{
  "website_summaries": [
    {
      "verdict": "A great look with the warmth and water resistance needed for a cold winter.",
      "pros": [
        "Meet the 3 criteria for a winter boot: comfortable, warm, and waterproof",
        "Excellent traction for winter explorers",
        "High shaft keeps more of the leg warm"
      ],
      "cons": [
        "Sizing can be a problem as the heel area tends to fit differently than other boots"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Not a good pair of boots",
      "text": "Bought these boots for my wife after her other boots finally needed to be replaced after 8 years. These boots arrived on time and were very nice when we opened the box. She has used these boots twice and they are already falling apart. Terrified to know what they will look like at the 3 month mark. Look elsewhere",
      "rating": 1.0,
      "verified": true,
      "author": "Nathan",
      "helpful_votes": 58,
      "publication_date": 20161207
    },
    {
      "title": "Tested in the Colorado Rockies!",
      "text": "Bought these and am very pleased. Light-weight boot, not clunky to walk around in. I was nervous at how thin they felt. But I spent 5 hours outdoors in single digit temperatures without the slightest chill in the toes! I read the reviews about selecting a size or two down. I'd actually vote to go up if you plan to wear thick wool socks. I went down and they are just a bit snug. But without half-sizes I get the dilemma. Can't wait to wear them again!",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa Thibault",
      "helpful_votes": 30,
      "publication_date": 20160112
    },
    {
      "title": "Kept me warm in the Arctic circle",
      "text": "I wore these glacier hiking and in the Arctic circle in Alaska. I couldn't believe how warm I was (with the help of some thermal socks of course because of how crazy low the temperature can get). Even when I stepped in waist deep snow and sunk down, when I came back up and brushed all the snow off my feet were still warm.",
      "rating": 5.0,
      "verified": true,
      "author": "Kaylee",
      "helpful_votes": 27,
      "publication_date": 20160312
    },
    {
      "title": "Beyond expectations, great pair of boots!",
      "text": "I was a little skeptical about ordering boots on-line without trying them on, but boy am I glad I did; I could not be happier with these boots! Extremely comfortable and warm. I have seen some comments regarding fit. The size 7 fit was perfect for me, but admittedly, I have narrow feet, ankles, and calves. What I’m most impressed with is the traction. We recently had a snowstorm followed by freezing rain. These boots handled slippery surfaces with little problem, even when walking two dogs. Did I mention they are warm? Oh so warm! I now a Kamik fan for life; thanks for a great product!",
      "rating": 5.0,
      "verified": true,
      "author": "Elaine Stueve",
      "helpful_votes": 3,
      "publication_date": 20190118
    },
    {
      "title": "Warm and Dry",
      "text": "I LOVE these boots! I have never had a pair of shoes that kept my feet warm, but I needed something because we are headed to Iceland this winter and I needed the protection. I wore them today on a 4 mile hike through the snow and it was 25 degrees Fahrenheit out and my feet were completely dry and incredibly warm by time I got back home. I wasn't even wearing winter socks under them! They haven't been Iceland approved just yet, but they are definitely Germany approved!",
      "rating": 5.0,
      "verified": true,
      "author": "Danielle Moser",
      "helpful_votes": 32,
      "publication_date": 20160116
    },
    {
      "title": "Love these boots!",
      "text": "I LOVE these boots! My husband bought Kamik boots and swears by how warm they are. I went ahead and got myself a pair. These boots and cozy and comfy. My toes do not get cold at all, even when I am standing in the snow. They are the easiest to lace up and tie. Just pull the ends and tie, there isn't any tugging and holding in place. The tread allows me not to slip and slide on the pavement. I would recommend these boots to anyone. I am very happy with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Holly",
      "helpful_votes": 4,
      "publication_date": 20161220
    },
    {
      "title": "perfect",
      "text": "I love these boots they are so comfortable, they keep my feet warm n dry with all the snow and freezing weather we are having right now..",
      "rating": 4.0,
      "verified": true,
      "author": "Lauren Cavage",
      "helpful_votes": 54,
      "publication_date": 20150108
    },
    {
      "title": "Best Boot Ever!",
      "text": "A Christmas present for my daughter, and she absolutely loves them. They fit perfectly, they feel great, and they look awesome! She wears a 7 1/2 shoe, and I ordered a 7 1/2 thinking they would probably be too small, but they fit fine.",
      "rating": 5.0,
      "verified": true,
      "author": "JS",
      "helpful_votes": 11,
      "publication_date": 20161227
    },
    {
      "title": "Liner NOT removable (issues with orthotics), little wide even for me; otherwise superb.",
      "text": "LINER is NOT removable but is loose and can be pulled up to dry. Issues with orthopedic insoles as size bigger was not conducive to a comfortable fit. Made store bought insoles work in my regular size. Traction: Perfect for walking on ice. Comfortable: Can wear for extended periods of time. Warm! Can't seem to get them tight enough as I need a wide boot and these have extra room. Extra space may take some getting used to. Won't recommend a second pair of socks as these are warm but that could be an option. Expect lots of compliments!",
      "rating": 4.0,
      "verified": true,
      "author": "MN User",
      "helpful_votes": 4,
      "publication_date": 20160110
    },
    {
      "title": "Fits small and narrow!",
      "text": "I love these boots! I bought them because they are cruelty free and more affordable than other brands. They are excellent quality and lightweight. I have had sorels format years and they were so clunky and didn’t keep my feet warm but these new boots so do! My only issue was I had to return the first pair that I went up a half size to make sure they fit bit they are narrow and I wouldn’t have been able to wear warm socks wkgh them for hiking so I order two half sizes up! I normally wear a 9/9.5 depending on the shoe and I ordered a 10.",
      "rating": 4.0,
      "verified": true,
      "author": "Ashley",
      "helpful_votes": 0,
      "publication_date": 20200120
    },
    {
      "title": "Fell apart quickly",
      "text": "Edit: im so sad that after just 3 months these boots fell apart & are no longer waterproof. Cold wet feet, no thanks. Original review: I’m a professional dog walker in Michigan. I had to be pretty picky with finding the perfect boot. Finally found these! Lightweight, supportive, extremely warm, & waterproof! I recommend these to everyone I know.",
      "rating": 1.0,
      "verified": true,
      "author": "Jenny D.",
      "helpful_votes": 2,
      "publication_date": 20181124
    },
    {
      "title": "Defective and no Response from Manufacturer",
      "text": "Laces loops started tearing after a few weeks of use; The manufacturer states a 1 year warranty on their web site and has a link to \"contact us\" for defective items. Submitted the form, complete with pictures of the defect. Actually, have submitted the same message twice now. No response at all. It seems the manufacturer doesn't honor their statements.",
      "rating": 1.0,
      "verified": true,
      "author": "Michael L Sides",
      "helpful_votes": 3,
      "publication_date": 20181128
    },
    {
      "title": "Four Stars",
      "text": "I like them, and getting postive responses about them. And they are protecting keeping my feet warm.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 11,
      "publication_date": 20170125
    },
    {
      "title": "do not keep my feet warm",
      "text": "first of all they were pretty big but that's not too bad of a problem, I just wear thicker socks, the main issue is that they do not keep my feet warm...right now I'm wearing them in th snow and my feet are ice cold and for the price that I paid that's pretty bad and returning them is not an option either since I have been wearing them every day but I would not buy them again nor would I recommend them to anyone else",
      "rating": 2.0,
      "verified": true,
      "author": "Maria Ansari",
      "helpful_votes": 4,
      "publication_date": 20170107
    },
    {
      "title": "Size runs too big.",
      "text": "They are great boots, very good for the freezing winter in Chicago. My feet are warm and dry. They do run big, I am a size 8 and I got size 8 but still too big even with an extra pair of socks. There is so much extra room in the ankle part of the boot. I should have exchanged them for a smaller size, but I really needed them the day I got them, so I'll deal with them the way they are...",
      "rating": 4.0,
      "verified": true,
      "author": "Delia Melcher",
      "helpful_votes": 0,
      "publication_date": 20180106
    },
    {
      "title": "Warmth, style and comfort at a great price!",
      "text": "When I purchased these boots I did not want to rush and write a review. I wanted to use them for a while to make sure they would hold up. I have had them for over two years now, and I have to say they’ve held up really well. The color stayed a very nice white and have not discolored. Of course looking great and performing great are two different things & I am happy to report that they perform just as great as they look. They are SO warm!! They are perfect for Minnesota winters.",
      "rating": 5.0,
      "verified": true,
      "author": "M&M",
      "helpful_votes": 0,
      "publication_date": 20200217
    },
    {
      "title": "Comfortable and not bulky boots!",
      "text": "Boot is very comfortable! Heels slip and returned for half size smaller. Nice looking boots. Boots are so light and of bulky! Cannot wait to get the smaller size as we are expecting huge storm! Thanks to Amazon for the variety to choose from and your quick delivery! Returns are never a problem!",
      "rating": 5.0,
      "verified": true,
      "author": "Maeve Broadhurst",
      "helpful_votes": 7,
      "publication_date": 20160119
    },
    {
      "title": "Great traction.",
      "text": "Wear a 9.5, have narrow feet, wore thick winter socks ordered a 10. Had no issues. I did notice a chill in the foot when I was not moving as much, I also own the deep snow version which does not have that issue but nothing for me to worry about. Easy to lace and light weigh. Walking uphill in deep snow was not an issue had plenty of traction. No slipping and falling. No leaks or moisture getting in either.",
      "rating": 5.0,
      "verified": true,
      "author": "Zeon Kitty",
      "helpful_votes": 3,
      "publication_date": 20170213
    },
    {
      "title": "The most amazing boot I have every purchased",
      "text": "OMG!! The most amazing boot I have every purchased! I love the construction, the high shaft to it and the fact it laces and not zips up. I have a wider calf and I have struggled getting boots for so long. My feet have stayed warm and dry in all the wet Chicago snow we have gotten and I could not be happier!!! These do run true to size. I like wearing really thick socks and I normally double up so in boots like this I normally get a size 7. I did get the size 7 in these and they fit exactly perfect! Well work the investment!",
      "rating": 5.0,
      "verified": true,
      "author": "Julie Hoffman",
      "helpful_votes": 2,
      "publication_date": 20161223
    },
    {
      "title": "Super cute but durable!",
      "text": "They were a bit large but not too much. I should have went about 1/2 a size down. They are super cute!! They are warm but make my feet sweat so my toes started freezing anyway. I have to wear sweat proof socks with them. They are waterproof!!! No snow got into these boots. They are perfect height and I can't wear baggy jeans and shove them in there so that's great!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Maria Shank",
      "helpful_votes": 0,
      "publication_date": 20190202
    },
    {
      "title": "At first I noticed a a space by the heel/ankle but after wearing out a few times it actually works good. The water proof part is true so far",
      "text": "I was a little hesitant to buy these boots online. I’m usually an 8 or 8.5 and I bought a 9 and it fits well. At first I noticed a a space by the heel/ankle but after wearing out a few times it actually works good. The water proof part is true so far, and I live in Milwaukee Wisconsin where the snow and slush is everywhere when it snows. With all the salt as well, the appearance of the boots are holding up great. These boots were a great choice, and you won’t be sorry if you go with these.",
      "rating": 5.0,
      "verified": true,
      "author": "Billie",
      "helpful_votes": 2,
      "publication_date": 20180116
    },
    {
      "title": "These are the best winter boots I have ever had",
      "text": "These are the best winter boots I have ever had. They are super warm, fit with boot socks, and are great in the snow. My feet are almost always cold and in these boot my feet are actually warm! The only downfall is that they are not the best in ice, but I have never had a snow boot that is. If it is icy where you are at just get some of those chains for your boots and they will be perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "nlc3",
      "helpful_votes": 2,
      "publication_date": 20161214
    },
    {
      "title": "Wore them on a trip we just came back from and used them for hiking and they were great. Kept my feet warm in the upper teens/20s",
      "text": "These were the second pair I bought. I'm usually a 10 and had to go a half size down. My heel was still slipping off but couldn't go smaller because it was too small. I bought heel grips which helped. Wore them on a trip we just came back from and used them for hiking and they were great. Kept my feet warm in the upper teens/20s. My heel still slipped and I was worried about blisters and never caused any. Highly recommend. They are a \"tad\" heavy.",
      "rating": 5.0,
      "verified": true,
      "author": "JW",
      "helpful_votes": 2,
      "publication_date": 20180103
    },
    {
      "title": "Unfortunate fit...the heel box isn't sized properly.",
      "text": "Way too big in the heel box. I bought my exact shoe size and they fit great everywhere else. Also, the color was not nearly as virbrant as the pics portray. The red is much closer to a maroon color than I wanted. I will be returning. It's too bad; I wanted to buy these in three different colors, but the heel being so loose ruined it for me. :(",
      "rating": 2.0,
      "verified": true,
      "author": "D. Moore",
      "helpful_votes": 8,
      "publication_date": 20160115
    },
    {
      "title": "Super Cute/ Comfortable/ Warm!",
      "text": "Loved these boots! They look adorable. They kept my feet comfortably warm/not sweaty in Los Angeles and in the snow. I wore for 6-7 hours straight and my feet felt great! They seemed a tad larger than I expected but maybe it was just because I wore small/thin socks. Also, not much arch support so if you need that consider getting an insole like Powersteps. All in all I totally recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Sara",
      "helpful_votes": 0,
      "publication_date": 20190330
    },
    {
      "title": "Junk.",
      "text": "These boots are warm. I've worn them four times now that it's finally snowing, and my feet have felt super toasty. I've received complements on them, too. Now the bad part: one of my boots is literally unraveling where the suede connects to the brown fabric. I've attached a photo showing g how the sewing can just be pulled away from the rest of the boot. My other boot doesn't have this problem. I'm pretty bummed because I only now see the poor quality, yet I purchased these boots three months ago. This particular boot won't last another week.",
      "rating": 2.0,
      "verified": true,
      "author": "s.v.",
      "helpful_votes": 13,
      "publication_date": 20161213
    },
    {
      "title": "Warm & functional",
      "text": "I bought these boots for super cold winter days and to use with snowshoes. They have kept my feet warm in -10 F temps (haven't been out in them on colder days, yet). They fit well, work great for snowshoeing, and are attractive enough I can wear them to work. I am very happy with these boots and would definitely recommend them.",
      "rating": 5.0,
      "verified": true,
      "author": "Alexis L Northcutt",
      "helpful_votes": 0,
      "publication_date": 20190207
    },
    {
      "title": "Love these!",
      "text": "I absolutely love these boots! They're cute, they're waterproof and they keep your feet water, even in the snow! Unlike my mom's boots, which got water in them, my feet stayed nice and dry even though I rolled around, slide around and otherwise tumbled in the snow. They worked perfectly. They ere also comfortable, although I ended up adding my favorite insoles to them anyway, which made them all the more comfortable. And I was delighted that the insoles fit without crushing my feet. The inside lining is very soft and comfortable. The laces are long enough to wrap around your leg once before tying and I recommend doing that for security and comfort. All-in-all, I loved these!",
      "rating": 5.0,
      "verified": true,
      "author": "Meg H.",
      "helpful_votes": 0,
      "publication_date": 20160206
    },
    {
      "title": "Poor Quality",
      "text": "I am not impressed with the quality of these boots. I bought them in August in preparation for winter. I started wearing them in December, and now it is almost mid February and these boots are shot. The lining is torn and the outer fabric is starting to wear. I'm barely getting one winter out of them. I am extremely dissatisfied. These boots look nice, but they aren't for wearing long term (as in more than a few months)",
      "rating": 2.0,
      "verified": true,
      "author": "amorett",
      "helpful_votes": 2,
      "publication_date": 20190210
    },
    {
      "title": "Give them a chance",
      "text": "I put the narrow answers on the toe and the width. When I first got them they were very narrow in the toe area. Thought I was going to have to send them back but I put them back on and wore them for awhile and they adjusted to my feet. So you have to give them a chance. I am replacing my other kamik winter boots. They are 4 years old. They have always kept my feet warm and dry.",
      "rating": 4.0,
      "verified": true,
      "author": "S.D.V.",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "Cute/warm/true to size but returning",
      "text": "So the boots are super cute and definitely warm. My only complaint (and ultimately the reason I’m returning the boots) is that the area of the boot that surrounds my ankles bends in a lot. It caused rubbing and pressure which my ankle bones and felt like I’d have no support. Tried changing the laces and tightness hoping that would help but it didn’t. But like I’d said earlier, the boots are cute and warm. They fit just the way that was expected. I’m normally a 9.5 but got a 10 and with some thicker socks fit great!",
      "rating": 4.0,
      "verified": true,
      "author": "Josica Koopman",
      "helpful_votes": 2,
      "publication_date": 20171112
    },
    {
      "title": "My daily go to boot in cold weather to walk dog",
      "text": "My daily go to boot in cold weather to walk dog. Comfortable. I have wide feet and went up a half size. The boots are big on me but I kept them since they're fine with heavy socks if necessary and I got them on sale and couldn't get them for that price in my size. They keep my feet very warm Would buy again in a heartbeat.",
      "rating": 5.0,
      "verified": true,
      "author": "J.Jane",
      "helpful_votes": 0,
      "publication_date": 20171230
    },
    {
      "title": "Heel slippage - Try a different style if you have a narrow heel.",
      "text": "I really wanted these to work for me but they didn't so I'm sharing my views. I'm a small 6 and bought a 6. They fit my wider front area of my foot but the heel slipped way too much even when wearing very thick socks. Lacked arch support. Lace up system was nice.",
      "rating": 3.0,
      "verified": true,
      "author": "Veg Traveler",
      "helpful_votes": 7,
      "publication_date": 20160107
    },
    {
      "title": "good fit, keep your footies warm & dry",
      "text": "Keeps my feet super warm and dry here in the frosty tundra. I chose the tan/blue color because it was the least expensive. Don't worry about the color of the boots, these boots are going to get covered in snow, slush, and road salt anyway, why should I care if it doesn't match my coat? I go biking year round and these have been keeping my feet super warm and dry even in freezing rain. I wear a size 5.5 so I got a size 6, and they fit fine with normal socks. The only bad thing I can say is that now that I have these boots, it's my job to shovel snow.",
      "rating": 5.0,
      "verified": true,
      "author": "Crazy Cat Lady",
      "helpful_votes": 0,
      "publication_date": 20180222
    },
    {
      "title": "Boot sizing is very difficult",
      "text": "The boots look great. Based on the reviews, I ordered one size down for my daughter. The boots are a little small and will probably need to be returned. They don't seem to come in half sizes anywhere else, and the seller's price for the half size up is $30 more than the size I ordered. Not acceptable so will return and start over. Sigh.",
      "rating": 3.0,
      "verified": true,
      "author": "mommy2three",
      "helpful_votes": 0,
      "publication_date": 20171213
    },
    {
      "title": "I wanted to like these boots",
      "text": "I wanted to like these boots. They fit well and are very comfortable. Before I purchased them I researched the company and found out it was based out of Canada. I live in the Upper Peninsula of Michigan. We're neighbors 'eh. They arrived fast and felt great.... At 35* above. This weekend was a true test. Currently the temperature is -2*. My toes froze after just a few minutes. I'll need to get a different pair now.",
      "rating": 2.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20171228
    },
    {
      "title": "Great fit! Great price! Fast shipping!",
      "text": "I searched for a long time to find an affordable winter boot that still had style but was also very practical and warm. Living in Maine, a good pair of boots is critical! I was happy to see that the green/orange color happened to be $70 which is cheaper than similar boots on the market. I read all the reviews before deciding on going with a size 11. I normally wear a size 10 in sneakers and an 11 in boots because I have pretty wide feet. These fit great and still leave room for thick socks!",
      "rating": 5.0,
      "verified": true,
      "author": "Gabby",
      "helpful_votes": 4,
      "publication_date": 20160114
    },
    {
      "title": "Boots for winter",
      "text": "I wear a 7.5 ordered an 8 fit is right for when I wear heavier socks. The boots are light yet look to be warm. I love the brand and i see no missed details in the stitching. The last kamiks I had lasted 8 years, they are still wearable but the traction on the bottom of the boot is gone from wear. I am hoping these will last as long and be as warm. I am also going to use camp dry to help waterproof the upper as a precaution I do with all my snow boots. It does claim they are waterproof.",
      "rating": 5.0,
      "verified": true,
      "author": "anna",
      "helpful_votes": 0,
      "publication_date": 20170919
    },
    {
      "title": "it does the job as snow boot",
      "text": "I got this boot few days before my trip to Chicago. the toe room is tight because of cushion insole and it feel no arch support. the size seems right fit. I order 6 1/2 instead of 6 which is my normal shoe size. I wear it for the entire trip, it keep my feet warm under 30F and it keep my feet dry walking on snow, even when it was snowing. but it hard to walk fast. I don't how long it last or how many times I can wear it before it breaks. so far so good for the price",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190228
    },
    {
      "title": "Quality product. Very warm",
      "text": "I’m an 8 and needed a 7 1/2 sz to fit. Beautiful looking boot. Very warm! I searched for probably 2 moths for a good boot. This is it. I didn’t want to pay that much but is worth it. Great service when needed to exchange due to sizing issue. Waterproof. I kept warm. We experience cold in the minis degrees this year and I was warm. Not quite as wide as I’d like but they will probably stretch a little with wear",
      "rating": 5.0,
      "verified": true,
      "author": "Brenda",
      "helpful_votes": 0,
      "publication_date": 20190301
    },
    {
      "title": "Love the look",
      "text": "Love the look! Where I live we average over 300\" of snow a year so I'm use to 6-10\" of snow fall at a time. My feet did get chilly walking through this deep of snow. They have kept my feet warm most of the time. I feel they are good boots for going from my house to the car and to work. Don't think I would use them for long term outside. But everyone's feet are different. Definitely recommend them just wear heavy socks. My one lace came with areas unravelled.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170101
    },
    {
      "title": "I also live in flip flops 75% of the time so I like room in the toe area",
      "text": "A little too tight in the toes for me, but my feet are a little wide in the front. I also live in flip flops 75% of the time so I like room in the toe area, for I am used to having \"wiggle room\".",
      "rating": 3.0,
      "verified": true,
      "author": "Renee M.",
      "helpful_votes": 2,
      "publication_date": 20171105
    },
    {
      "title": "MUST HAVE FOR WINTER",
      "text": "I wore these for over a week in Iceland in November. My feet were never wet or cold, even sinking down into knee deep snow. Super comfortable even around the ankle. Stood outside in windy winter night waiting for the Aurora to appear and my feet were nice and warm. Not sure why people say their feet got wet, I only observed mine to get too warm and started sweating...maybe they thought they were having wet feet?",
      "rating": 5.0,
      "verified": true,
      "author": "Claudia",
      "helpful_votes": 2,
      "publication_date": 20171204
    },
    {
      "title": "Dream Boots",
      "text": "These boots are absolutely perfect as far as being waterproof, warm, and comfortable. The traction is great - I did several hikes in Iceland the past few days in them through glaciers and lava caves and snowy waterfalls and hills. I didn’t slip once. I was hoping these fit a little large so I could wear warm socks, and they do.",
      "rating": 5.0,
      "verified": true,
      "author": "Rooster",
      "helpful_votes": 0,
      "publication_date": 20171111
    },
    {
      "title": "Excellent boot and so comfortable",
      "text": "I normally wear 7 - 7.5 depending on the fit, I ordered a 7 in these and could have easily gone up to the 7.5 and given my toes a little more room. That being said, they are very warm, very comfortable, and excellent traction. For a boot I bought on a whim because I was desperate for a good winter boot this met and exceeded my expectations.",
      "rating": 5.0,
      "verified": true,
      "author": "Julie C",
      "helpful_votes": 3,
      "publication_date": 20170113
    },
    {
      "title": "Super comfy",
      "text": "Look exactly like photo. Very warm; I've worn them in deep snow and they stay dry and warm. Traction isn't the best for ice; I did fall on ice while wearing them :( I will buy in other colors!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Tarareno",
      "helpful_votes": 5,
      "publication_date": 20160116
    },
    {
      "title": "Great Boots",
      "text": "Love them. We have had a lot of snow so I've had the chance to break these in and am very happy with them. Yes, the heel slides a little bit, but I'm not sure I would have even noticed if I had not read about it in other reviews. Very warm and very good quality. The last thing I will say is that I thought lace up boots would be a hassle but these are super easy and quick to get in and out of.",
      "rating": 4.0,
      "verified": true,
      "author": "Laurie M-B",
      "helpful_votes": 0,
      "publication_date": 20190220
    },
    {
      "title": "Dye leaks onto feet.",
      "text": "I enjoyed these boots. But thick socks are a must! I work outside in the snow all day and these came in handy and kept my feet warm. The only reason for a lower rating is it was causing blisters with a pair of thick socks so I had to put on two. It also dyes my feet blue like a smurf after a work day through my socks which takes a warm bath to wash off. Not the easiest thing to wash off.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190311
    },
    {
      "title": "Best winter boots I ever owned",
      "text": "I went up 1 size then what I wear in sneakers. Everyone said they fit snug so that why I went up well. The up 1 size fit perfectly. We live in Fairbanks Alaska so it does get down to -40 sometimes. These boots kept my feet nice and warm. I wore them with normal socks not ski socks and my feet were never cold. They are holding up really well after a year.",
      "rating": 5.0,
      "verified": true,
      "author": "Jill",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "The fur looks perfect. Look tough great tread",
      "text": "Absolutely imperial! Warm for our -12* weather with slushy salty messy snow. The fur looks perfect. Look tough great tread. Walked through thigh high snow banks & nothing entered the boot. Size is accurate. One month in they seem worth the 99$ I squeezed out of my tight budget. I hope they last.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180105
    },
    {
      "title": "Love these boots",
      "text": "I bought these for work (field research) and they've been great so far. I'm glad the 'fur' lining is just at the top of the boot because otherwise I think these would be too hot in Texas fall weather otherwise. I think they'll be great for winter though. I can't ever seem to get these boots laced tight enough, but that's just personal preference and they fit very well regardless. The boots fit as expected, and I could probably wear some thick socks if I needed to without it being too tight.",
      "rating": 5.0,
      "verified": true,
      "author": "Kat",
      "helpful_votes": 0,
      "publication_date": 20161027
    },
    {
      "title": "Awesome boots! Hope they last me a long time.",
      "text": "It only seems small because the amount of insulation inside. I think they fit snug, which is how I want a boot to fit when I'm trudging through snow. It is waterproof and has very good grips on the bottoms. It keeps my feet much warmer than my previous pair of boots which were by Columbia. These are taller than I realized but that is a good thing. They are soft and they move easily with my movements. The lace is very simple, can be easily loosened to pull boots on and the tops are soft enough you can pull them on without untying.",
      "rating": 5.0,
      "verified": true,
      "author": "Amy",
      "helpful_votes": 0,
      "publication_date": 20161220
    },
    {
      "title": "Stay dry!",
      "text": "These boots are AMAZING. I didn’t know what to expect from the reviews but I took a chance and was so happy. I took these on a trip to Iceland in the winter and wore them on many hikes through the snow and my feet didn’t get wet! I even stepped into a waterfall puddle and I stayed dry and warm! I have bad feet so I put my own insoles in but overall good quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Julia ",
      "helpful_votes": 0,
      "publication_date": 20200405
    },
    {
      "title": "They are nice to look at but thats about it",
      "text": "They are nice to look at but thats about it. The fit was good but there is a design flawat least for my daughter and i amd that is every step you take your feet slip half way out of the boot. Very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Denice",
      "helpful_votes": 2,
      "publication_date": 20180107
    },
    {
      "title": "Order a half size up",
      "text": "Nice and warm, I work outdoors and spend a lot of time outdoors in Wisconsin, so our winters are chilly. My feet are usually the first to get the coldest other than my face so this is a nice change. I did order a half size up and I'm glad I did. There are other reviews saying there's a weird sort of space in the heel area which proves to be true, but it isn't uncomfortable. These are nice boots.",
      "rating": 5.0,
      "verified": true,
      "author": "rachel lietz",
      "helpful_votes": 0,
      "publication_date": 20180108
    },
    {
      "title": "... so I could wear thick socks and they'd be easy off and on in the middle of the night ...",
      "text": "I got a size larger so I could wear thick socks and they'd be easy off and on in the middle of the night to walk my dog in Connecticut in December when staying at a hotel. I never considered I'd need these and if dh had not suggested it my feet would have been miserable for 2 weeks. I wore them all the time with regular socks and my feet never felt cold trudging through the snow. Probably you'll be ok with your normal shoe size.",
      "rating": 5.0,
      "verified": true,
      "author": "Missi Vanhorn",
      "helpful_votes": 0,
      "publication_date": 20180309
    },
    {
      "title": "Buy them. Worth the price.",
      "text": "These are a fantastic boot! I have worn them a ton, including lots of walking, and they are comfortable and warm. Because they didn't have half success, I bought a size up, which is perfect to wear my big warm socks with them. The only issue I have is with the laces. It's kindof a pain to get them laced tight enough. But it isn't a deal breaker.",
      "rating": 5.0,
      "verified": true,
      "author": "Bree",
      "helpful_votes": 3,
      "publication_date": 20151230
    },
    {
      "title": "Perfect for the Blizzard of '16",
      "text": "I got these boots just in time for the blizzard that dumped 30\" of snow on my town in New Jersey. Between digging out my sidewalk and chicken coop, playing with the kids, and taking out the dog, the boots remained fully waterproof and my feet were toasty warm. They were tall enough to keep my feet and ankles dry when I was wearing them over leggings. They are bulky but lightweight. I typically wear a size 9 shoe and I bought the size 9 boot, and they fit comfortably with thick socks.",
      "rating": 5.0,
      "verified": true,
      "author": "danamarieot",
      "helpful_votes": 0,
      "publication_date": 20160209
    },
    {
      "title": "Exactly in the middle of the others!",
      "text": "I needed a good snow boot with traction, waterproof, and warm. I didn't need something for 8 hours of wet hiking. This boot is perfect. It's not as heavy as the super winter boots but still warm in negative digits. They've been perfect for lake effect Michigan snow. I wear a 10 and they fit true to size - snug to stay warm with thin to medium weight socks. Probably size up if you're wearing thick winter socks all the time. They do not make my feet look huge or bulky. Very happy!",
      "rating": 5.0,
      "verified": true,
      "author": "Cdmarie",
      "helpful_votes": 0,
      "publication_date": 20170106
    },
    {
      "title": "Not too HOT nor too COLD, just RIGHT!",
      "text": "SO HAPPY with my Weather proof snow boots! I have not slipped on any ice or fallen for any reason while I have been wearing these boots. They are great in the snow. Keep feet nice and warm, although I do wear wool socks during this time of the year. I was very surprised at how light-weight they are! That's one major reason why I love them so much, the other reason; whether I am inside or outside in 20 degree weather my feet are not too cold or even too hot, they are just right!",
      "rating": 5.0,
      "verified": true,
      "author": "Melanie Hornung",
      "helpful_votes": 2,
      "publication_date": 20170209
    },
    {
      "title": "Disappointed in the quality.",
      "text": "I received these boots in Nov 2015 and was very pleased with them. They are very warm and I don't slide at all. I would have given 5 stars but for the fact that the leather holding one of the D-rings (for the laces) just broke when I pulled on the laces to tie them. This winter hasn't been too bad so I've only worn the boots a dozen times (maybe) in 2-3 months. I will try to sew the D-ring back on myself because I can't afford to just throw away these boots. What choice do I have? I am disappointed in the quality of this product. Very disappointed.",
      "rating": 3.0,
      "verified": true,
      "author": "Mary F.",
      "helpful_votes": 0,
      "publication_date": 20160202
    },
    {
      "title": "Amazingly comfortable ❤️",
      "text": "I am in love with these boots! I bought them for our Lake Tahoe trip and am so happy with them. They are so warm even in the snow and wow are they comfortable. I usually wear a size 7.5 but decided to buy the 7 because of suggestions by other reviewers and I'm glad I did they fit perfect with normal socks. There was no need to have thick socks because the boots are warm enough on their own. Only annoying part? The laces are super long and i had to wrap them around the boot once and then tie normally.. Still so happy I bought these.",
      "rating": 5.0,
      "verified": true,
      "author": "Kel",
      "helpful_votes": 0,
      "publication_date": 20160128
    },
    {
      "title": "Functional and Attractive boot!",
      "text": "LOVE, LOVE, LOVE these boots! Living and playing in northern VT, you need a good boot. I wear them with my snowshoes, and to work every day. Functional and attractive. Love the long laces so I can wrap them around once as well. The tread is great, grips good, and I love that they are made in North America.",
      "rating": 5.0,
      "verified": true,
      "author": "LoveHuskyVT",
      "helpful_votes": 3,
      "publication_date": 20170216
    },
    {
      "title": "Bulky boot lacking in style and practicality",
      "text": "I owned a great pair of Kamik \"Brussels\" boots for years til they finally fell apart. This boot cannot compare in fit or style. The excess (faux) fur at the top makes it impossible to place the boots securely tight. They are way too bulky, and the shaft is designed for big calves.",
      "rating": 1.0,
      "verified": true,
      "author": "Susan C",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "2 pillows for my feet",
      "text": "This is my first purchase of snow boots and I love them! They are so soft, like 2 pillows for my feet. I saw the other reviews about the sizes running large. Normally I wear a 9 1/2 in tennis shoes and pumps and a 10 in boots (I suffer from large calfs). I settled on a 9 which is a tad to large but anything smaller would not have fit right. I am completely happy with this purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "mrchad",
      "helpful_votes": 8,
      "publication_date": 20160128
    },
    {
      "title": "... my last pair of snow boots were so physically painful, I had to stop using them after two ...",
      "text": "I have very mixed success with shoes in general and my last pair of snow boots were so physically painful, I had to stop using them after two wears. Thankfully, not these. These feel comfortable, are easy to slip on (the laces make it easy to open them wider relatively quickly), and keep my feet nice and warm; I got to test them in Chicago's first big winter storm this past week and in our below freezing temperatures that followed. I also really enjoy their overall look and design; they're a nice mix of classy and rugged.",
      "rating": 5.0,
      "verified": true,
      "author": "DariaMsSSW",
      "helpful_votes": 0,
      "publication_date": 20161213
    },
    {
      "title": "Boots run small.",
      "text": "These boots were absolutely beautiful! I really liked them, I just wish they would have fit. They were narrow in the toe area and also too short. I wear a size 11 in women's and these were too small. They fit more like a 10.5. They were comfortable for the little bit I walked around the house, I think the laces would have been potentially annoying in the snow. I had to return them because I would not have been able to wear them at all.",
      "rating": 2.0,
      "verified": true,
      "author": "MrsJehu",
      "helpful_votes": 2,
      "publication_date": 20170112
    },
    {
      "title": "Cozy",
      "text": "I have received a lot of compliments on these boots, and they are as comfortable as they are fun. The footbed is luxorious - feels like wearing pillows. The treads are impressive - as deeply grooved as a high-quality pair of hiking boots. However, the boots are loose in the ankles and you have to work hard to cinch them tight around your calves, so they're not going to be the long-distance boots I had hoped for, despite the awesome treads - they just don't have the support. But for just messing around in the snow, they were a great deal compared to the competitors!",
      "rating": 4.0,
      "verified": true,
      "author": "Anon",
      "helpful_votes": 3,
      "publication_date": 20150102
    },
    {
      "title": "Warm, comfortable and stylish boot.",
      "text": "Warm, comfortable and stylish boot. The size runs large. Based on the other reviews I purchased a size smaller. I wear a size 10 in some running shoes and size 9.5 in regular and dress shoes. I ordered a size 9 and they fit perfectly. I haven't worn them in the snow yet because we haven't had any snow so I cannot speak on how well they keep my feet warm or dry. But they surely feel like they will do the job.",
      "rating": 5.0,
      "verified": true,
      "author": "T. D.",
      "helpful_votes": 0,
      "publication_date": 20170127
    },
    {
      "title": "they are very comfortable and they are warm for short amounts of time ...",
      "text": "These boots are somewhat wide. They also are not as warm as the temperature rating. Having to be outside in 10F weather recently, my toes got much colder than I expected for something with a -40F/C rating. Still, they are very comfortable and they are warm for short amounts of time out in the elements. Also, they do keep my feet dry while tromping through snow.",
      "rating": 3.0,
      "verified": true,
      "author": "Josh",
      "helpful_votes": 0,
      "publication_date": 20170126
    },
    {
      "title": "they run a bit large",
      "text": "These boots are the most comfortable boots I own. They are super warm and waterproof. I got them for walking my dog in the winter where it's so cold in the morning and the grass is always wet. They also come in handy when it snows. Not only are they comfortable, they're really cute too. I've received so many compliments.",
      "rating": 4.0,
      "verified": true,
      "author": "rc",
      "helpful_votes": 0,
      "publication_date": 20171230
    },
    {
      "title": "Horrible looking and fitting boots",
      "text": "Poor fit. The heel is sunk down lower than the toe box making it very difficult to walk in. I had to buy an insert to put in them. They run very large and they are really ugly looking on your feet. I do not recommend buying these boots!",
      "rating": 1.0,
      "verified": true,
      "author": "Paula M",
      "helpful_votes": 0,
      "publication_date": 20191130
    },
    {
      "title": "Very Comfortable",
      "text": "This boot is very comfortable & the faux fur keeps legs warm. The only problem I have with this is the faux cuff is very poofy. It's kind of over the top. The tread is hearty. It's a nice balance between function & fashion.",
      "rating": 5.0,
      "verified": true,
      "author": "Katie ",
      "helpful_votes": 0,
      "publication_date": 20181205
    },
    {
      "title": "Love these boots!",
      "text": "I absolutely love these boots. They fit well and are very warm. The toes have \"pillows\" of insulation that wrap your feet to keep them extremely warm! They are not only perfect for cold weather and snow but they look great too.",
      "rating": 5.0,
      "verified": true,
      "author": "AmazonMom",
      "helpful_votes": 0,
      "publication_date": 20181231
    },
    {
      "title": "Very warm and great fit even with warm thick socks",
      "text": "I am loving these boots they fit great. At first I thought they were going to tight but as I walked with heavy socks they were perfect. Very very warm and it has been 13 degrees here. I have had on thick wool socks too. I wear a nine and bought the nine. I am very happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "stampmom9 Dawn Gallop",
      "helpful_votes": 2,
      "publication_date": 20171229
    },
    {
      "title": "This is a nice boot it’s doesn’t have as much room In the ...",
      "text": "This is a nice boot it’s doesn’t have as much room In the foot area as I thought it would have it’s a bit snug on me. I wear a 9 1/2 I ordered a 10 but it’s still wears well. As soon as I ordered it it stop snowing so I haven’t been able to try it out in the weather but I think it’ll be just fine. If you’re going to order I would say maybe try a size up.",
      "rating": 4.0,
      "verified": true,
      "author": "JN",
      "helpful_votes": 0,
      "publication_date": 20180321
    },
    {
      "title": "Beware small toe box",
      "text": "The toe box is so small especially up and down. Uncomfortable with lightweight cotton socks so no way could wear my winter wool socks with these. Also really no arch support. Sent these back to find something that is comfortable.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazonian",
      "helpful_votes": 0,
      "publication_date": 20200203
    },
    {
      "title": "Height of the boots & looks are perfect as well as warm",
      "text": "I have a pair of these boots in black & my daughter tried them on & had to have a pair of them. Found this color for her & she loves them.She wears them up to thee mountain before going & puts on for after. Plus on cold days in Vancouver BC, like minus 4 Celsius or a litlle colder they have kept her feet very warm. Her older sister now wants a pair.",
      "rating": 5.0,
      "verified": true,
      "author": "drnichols",
      "helpful_votes": 0,
      "publication_date": 20180211
    },
    {
      "title": "10 stars for these boots!",
      "text": "I LOVE THESE BOOTS! After reading a ton of reviews I decided to go with a pair of Kamik Snowvalley boots and I'm glad I did! They arrived just as the Maine temperatures dipped below zero and my usually cold feet remained comfy. I ordered my regular shoe size, and even though I have wide feet, these fit comfortably right from the get-go. The first pair developed a hole in the tongue - the stitching was too close to the edge. I got a return label from Amazon, shipped the boots back the day my new order arrived (in perfect condition). They're wicked good!",
      "rating": 5.0,
      "verified": true,
      "author": "beejay",
      "helpful_votes": 0,
      "publication_date": 20160129
    },
    {
      "title": "Comfortable with thick socks",
      "text": "My only complaint is the back near the heal because it digs into my heal. Best to wear thick socks",
      "rating": 4.0,
      "verified": true,
      "author": "denell",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Love these boots!",
      "text": "I love these boots! I bought them because I recently adopted a dog and in the winter where I live we get feet of snow. These boots are warm and dry. I bought them a size larger than I usually wear because I wanted to have room for thicker socks. The only thing I would change is more arch support. I have high arches and needed to get insoles to make them comfortable for walking. Otherwise, they are the best boots I've purchased yet.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20161215
    },
    {
      "title": "Vey good traction from bottom of boots and for walking on ...",
      "text": "They are very warm and waterproof. Extremely comfy, but they are not supportive at the ankles, even when I tighten them all the way. I roll my ankles when walking on uneven surfaces. Vey good traction from bottom of boots and for walking on sidewalks or streets, they are great. I did put padded insoles in them to make them snugger. It helped a little. I usually go up a size in boots, but definitely not with these. Good value.",
      "rating": 4.0,
      "verified": true,
      "author": "sue galler",
      "helpful_votes": 3,
      "publication_date": 20160115
    },
    {
      "title": "Odd...",
      "text": "The boots were narrow at the toes, too big in the heel, yet the managed to rub on my ankles. I walked around the house in them, and I couldn't imagine trying to shovel in them. Not with my toes crunched like that. I don't think ordering a bigger size will help since the heel was so big. They get two stars only because they are cute in person. Too bad they have to go back.",
      "rating": 2.0,
      "verified": true,
      "author": "Mylo's Mom",
      "helpful_votes": 2,
      "publication_date": 20151209
    },
    {
      "title": "Decent snow shoe",
      "text": "Decent for the snow but even with layered wool socks my feet got really cold. For the price they’re good",
      "rating": 4.0,
      "verified": true,
      "author": "G Fauss",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "Good value, definite recommend!",
      "text": "I guess I am confused by all the confusion on the sizing. I am a true size 8 with medium width feet and the boots fit perfectly. With that being said, I have enough room to add a thick wool sock without the boot becoming tight. They are very light weight, they have enough arch support to be comfortable to walk in, they are warm, and stylish.....what more could you want?! For people who have high arches....I was able to insert a good arch support inside the boot but then I did have to downsize the sock to a medium weight. They are a wonderful boot at a good value, a definite recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Tina Mott",
      "helpful_votes": 0,
      "publication_date": 20150126
    },
    {
      "title": "No: From Wisconsin",
      "text": "Perfect for the snow...however I’m changing my review. The material from the ankle to the calf is sooo paper thin that it ripped after 100ft. walk with the dog. Shoulda been leather or pleather or something. I returned them. Never again.",
      "rating": 1.0,
      "verified": true,
      "author": "PD",
      "helpful_votes": 0,
      "publication_date": 20190309
    },
    {
      "title": "IMPRESSIVE WHITE WINTER BOOTS",
      "text": "OMG...these boots are AMAZING!!! Not only are they beautiful, but they have heat ratings for up to 25 below zero (F)...and they're waterproof...Wore them outside for the first time this morning...felt cozy and sheek...made by a Canadian company and I am impressed...would definitely recommend...",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Lisa Grubbs",
      "helpful_votes": 0,
      "publication_date": 20171210
    },
    {
      "title": "They r perfect other then I will have to buy inserts because ...",
      "text": "They r perfect other then I will have to buy inserts because I walking in them for a long period of time ur feet will get sore but they r cute and super warm! I ordered a 9 so a little bigger then I normally wear so I could Put extra socks on incase and it feels like a 9",
      "rating": 5.0,
      "verified": true,
      "author": "Amy",
      "helpful_votes": 0,
      "publication_date": 20180108
    },
    {
      "title": "Double Check the Size",
      "text": "Disappointed. They sent me a size 8 and a size 9. I am upset that one is so much bigger than the other. Kamok mislabeled the bottom of the boot as an 8 but the inside label is a 9, and it feels really bad when I walk in them. Double check yours if you order them. Otherwise they are very comfortable and warm, i just feel like one will fall off anytime.",
      "rating": 1.0,
      "verified": true,
      "author": "User of Products",
      "helpful_votes": 0,
      "publication_date": 20181016
    },
    {
      "title": "Was wide in the heel but felt tight in the ...",
      "text": "Was wide in the heel but felt tight in the toes. Went with my shoe size so maybe could have gone 1/2 size up. Will not be able to wear really thick socks but I have thin wool socks. Have not had any snow yet so have not worn but I hear I will get some use this winter.",
      "rating": 3.0,
      "verified": true,
      "author": "Sue T",
      "helpful_votes": 0,
      "publication_date": 20171116
    },
    {
      "title": "Warm, Comfy, Cozy Snow Boots!!",
      "text": "Great Boots. Definitely kept my feet warm and dry in 25 degree weather with snow all around! They were maybe a half of inch too big, but better than too small. The fur on the lining is very thick. Almost too thick for you to pull your pants over the outside of the boot, but I don't like wearing my pants like that, so they worked perfect for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Wendy H.",
      "helpful_votes": 0,
      "publication_date": 20170221
    },
    {
      "title": "Great for a person who had a wide calf",
      "text": "I bought these for my wife. She has a larger calf and has a tough time finding boots. These are nicely adjustable at the top of the boot for a wider calf. It also nicely just to normal size calf also.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Forbes",
      "helpful_votes": 0,
      "publication_date": 20191221
    },
    {
      "title": "Ordered on size larger and they fir great.",
      "text": "Read the other reveiews and learned that the boots run a tad bit smaller than expected. Ordered on size larger and they fir great.",
      "rating": 5.0,
      "verified": true,
      "author": "Doug Campbell",
      "helpful_votes": 0,
      "publication_date": 20171129
    },
    {
      "title": "Comfy and Warm",
      "text": "I wore these for the first time snowshoeing and I loved how warm they kept my feet! Also I was out snowshoeing for about 3 hours and had not previously worn these and yet my feet were as comfy as can be! They were slippery on ice which I was disappointed about, but maybe I had too high expectations. Also not the best for snowshoeing as they don't provide much ankle support. For shoes that I didn't try on beforehand, I'm really pleased with my purchase!",
      "rating": 4.0,
      "verified": true,
      "author": "Danielle B.",
      "helpful_votes": 0,
      "publication_date": 20200218
    },
    {
      "title": "Great boots. Bought these a year ago and they ...",
      "text": "Great boots. Bought these a year ago and they are holding up great (in New England). They are perfect for shoveling the driveway, staying warm at sporting events, or just playing around in the snow. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Katelyn",
      "helpful_votes": 0,
      "publication_date": 20170129
    },
    {
      "title": "... as I live in New Zealand and was really pleased that they only took 12 days to arrive",
      "text": "Bought these boots online as I live in New Zealand and was really pleased that they only took 12 days to arrive. I'm usually a 38 and bought the US 8 (38/39) to allow for bigger socks but would have been better with the US 7.5 (38). Boots are really comfortable and warm however they are quite roomy in the heel and they do slouch a little round the ankle. I have big calves and the boots do up nicely as they only go up to the lower calf. Overall I am very happy with them.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170808
    },
    {
      "title": "Yes",
      "text": "It’s a bit heavy and it’s not that comfortable. Over awesomefor keeping out cold and rain though",
      "rating": 4.0,
      "verified": true,
      "author": "Squid Smith",
      "helpful_votes": 0,
      "publication_date": 20181205
    },
    {
      "title": "A steal at clearance prices! Great boots for the buck!",
      "text": "Waited for these to go on sale and got them for under $45.00 so I am very happy. They appear to be made well but, it remains to be seen if they can make it through a Montana winter or not. That is what I bought them for and I am excited to see how they do. I always buy things for the Winter in the Spring and Summer and visa-versa as a way to stretch a dollar and these boots represent that!",
      "rating": 5.0,
      "verified": true,
      "author": "FLSTCKTTop Contributor: Coloring",
      "helpful_votes": 0,
      "publication_date": 20170703
    },
    {
      "title": "Replaced with my normal size and at first they were great, but with use",
      "text": "I first ordered these one size up and they were huge. Replaced with my normal size and at first they were great, but with use, they seem to widen and stretch. They are very cute and very warm but thinking maybe I should have sized down. Another note is that the grip on the bottom is not the greatest. I seem to slip more in the snow than I do with my cheap boots",
      "rating": 4.0,
      "verified": true,
      "author": "Joy Lynam",
      "helpful_votes": 4,
      "publication_date": 20160115
    },
    {
      "title": "These boots are great if you're moving",
      "text": "These boots are great if you're moving. If you stand too long in the snow, the bottoms become cold and then my feet get cold, even when wearing two pairs of socks. They haven't let snow in and they keep my ankles warm, but my toes and the bottoms of my feet get really cold if I'm not constantly moving and creating heat.",
      "rating": 3.0,
      "verified": true,
      "author": "K. Richardson",
      "helpful_votes": 4,
      "publication_date": 20160210
    }
  ],
  "product_meta": {
    "title": "Kamik Women's Snowvalley Boot",
    "description": "Whether trekking through the mountains or the snow-packed city streets, the snowvalley warm winter boot has you covered. These winter boots for snow have a classic styled upper with suede overlays paired with 3Mtm thinsulatetm insulation to keep the warmth in, without weighing you down. Featuring seam-sealed waterproof construction. Temperature rated -40°F\n\nKamik comes from a place of extremes. Where the harshest conditions intersect with some of the most beautiful sights you'll ever see. At Kamik, we make footwear that brings to life our northern origins. Singular. Strong. Simply dependable. We've been doing it for over 100 years. Day after day. 24/7. The result of all this effort: a complete line of outdoor footwear built to deliver superior comfort and reliable protection in the most extreme conditions. We know you wouldn't have it any other way.",
    "rating": 4.4,
    "feature_bullets": [
      "Textile",
      "Imported",
      "Synthetic sole",
      "Shaft measures approximately 12\" from arch",
      "Waterproof seam sealed",
      "Comfort rated to -25f",
      "Waterproof nylon upper",
      "Moisture wicking soft boa fleece lining",
      "3m thinsulate fixed foam insulated liner"
    ],
    "categories": [
      "Boots",
      "Women",
      "Shoes",
      "Clothing, Shoes & Jewelry",
      "Mid-Calf"
    ],
    "price": "",
    "specifications": {}
  }
}