{
  "website_summaries": [
    {
      "verdict": "A decent honey extractor that comes with an easy to turn crank handle.",
      "pros": [
        "Easy to balance and extract",
        "Legs allow you to put a pot or jar easily under the extractor nozzle",
        "Easy to put together",
        "Can handle 2 frames",
        "Easy to clean stainless steel material"
      ],
      "cons": [
        "This model can't hold as many frames as other models available",
        "Doesn't come with instructions"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Works but pay attention to what your doing.",
      "text": "Little bit more pricier than the others but came recommended from other beekeepers. Because it's a dual frame the frames have to be relatively same in weight otherwise it vibrates violently. Also found that medium frames if you're not careful when putting them in the wire frame can fall through the bottom. Was able to remove the handle and hook up a power drill. It does what it's supposed to do, just have to pay attention to what you're doing",
      "rating": 4.0,
      "verified": true,
      "author": "Cyber0ne",
      "helpful_votes": 0,
      "publication_date": 20191025
    },
    {
      "title": "Missing hardware and no way to contact the seller",
      "text": "Most frustrating part -Missing parts. Hardware was just thrown in the box and the box had holes so I’m assuming the missing parts fell out during shipping. No instructions, but pretty self explanatory. Like other reviewers said the ball bearing is just sitting in the bottom. Don’t tip the extractor upside down without putting tape over where the ball bearing sits. It does need to be cleaned before use, but super easy to do so- outside. Very easy to use all around.",
      "rating": 4.0,
      "verified": true,
      "author": "Anne R.",
      "helpful_votes": 0,
      "publication_date": 20200827
    },
    {
      "title": "it's okay AT best",
      "text": "Upon opening the box we thought maybe it was used. The red paint was chipped in many places. Very easy to put together. Started spinning the honey and had one part of the crank shaft come apart. While putting that back together two bolts fell to the bottom of the extractor, which had some honey in there. A couple of sticky arms later we got it put back together. We now have a clamp on the shaft to keep it together. It is extracting the honey but I think it's a pretty crappy piece of equipment. Had I seen it was from China I would have never purchased this. Spend a little more money and get something better.",
      "rating": 3.0,
      "verified": true,
      "author": "Growinghergardens",
      "helpful_votes": 3,
      "publication_date": 20151006
    },
    {
      "title": "Good value for the price",
      "text": "One of the leg bolts was milled improperly, but I decided to use without attaching legs. Worked fine. I steadied the extractor with my feet and spun the frames while watching tv. Propped the extractor on a counter's edge to empty the extractor. There was a strong smell of gear oil, but after washing and airing it, it seems better. The split top is a little awkward, has to be held down while spinning to avoid annoying rattling while spinning, but that's pretty minor. Good value, overall, for the price. I would recommend.",
      "rating": 4.0,
      "verified": true,
      "author": "Paige",
      "helpful_votes": 4,
      "publication_date": 20150415
    },
    {
      "title": "Needs to be emptied about every 4 frames.",
      "text": "The extractor I received was missing parts, half assembled and didn't have any instructions or general information about it. I'm guessing it was used and sent back. Still had to use it but couldn't attach the legs because not all the parts were there. This can only spin and store about 4 full frames honey before it needs to be emptied.",
      "rating": 2.0,
      "verified": true,
      "author": "Bart Miller",
      "helpful_votes": 0,
      "publication_date": 20200519
    },
    {
      "title": "Thrown in a box.",
      "text": "I just ordered this in. 1. No instructions on how to put this thing together. 2. Packaged poorly. There were nuts and bolts all over the bottom of the box, and inside the extractor. Hopefully after I can get this thing together, it will work for its purpose.",
      "rating": 3.0,
      "verified": true,
      "author": "Tabatha Caster",
      "helpful_votes": 0,
      "publication_date": 20200630
    },
    {
      "title": "Works like its supposed to",
      "text": "This is my second year using this for my one hive. It works as expected. Its the only extractor I've ever used so I have nothing to compare it to.",
      "rating": 4.0,
      "verified": true,
      "author": "Brandon Romeo",
      "helpful_votes": 0,
      "publication_date": 20190813
    },
    {
      "title": "GREAT MACHINEFOR HOME USE!!",
      "text": "Was late in arrival, but after talking with company rep they gave me a 10% refund, which was great! Arrived on time. All part were in box and with a little help from my grandson only took and hour to put it together:) 1/2 hour with no help:) Simple instruction and was up an ready to use. Used the weekend(along with grandsons help, to remove honey from 5 hives. Worked really well and efficient! Good work out with 65 pounds of honey stored up now.",
      "rating": 5.0,
      "verified": true,
      "author": "endndoc",
      "helpful_votes": 5,
      "publication_date": 20140829
    },
    {
      "title": "Choose a model manufactured in the USA",
      "text": "Instructions would have been nice. Also, I wish I chose a unit that was manufactured in the US. It arrived coated in machine oil inside and out to prevent rust from its over seas travels. This took over an hour to scrub off. Still concerned the honey will taste like oil.",
      "rating": 1.0,
      "verified": true,
      "author": "Don D",
      "helpful_votes": 13,
      "publication_date": 20140908
    },
    {
      "title": "Excellent product for the price",
      "text": "Excellent product for the price. The quality surpassed our expectations. Well made of quality materials. Was not difficult to clean and had no sharp edges. If we could change anything about this extractor, we would raise the basket a few more inches off the bottom so that it would hold all the honey from a medium 10 frame honey super without having to stop and drain some out before completing the extraction.",
      "rating": 5.0,
      "verified": true,
      "author": "Rebecca",
      "helpful_votes": 0,
      "publication_date": 20160726
    },
    {
      "title": "Like i said I think most are like this",
      "text": "It works. The only thing i think could be improved upon would be the height. I think most extractors are this tall, but I'm always struggling to get it up on something so that a 5 gallon pail will fit underneath. Like i said I think most are like this, but it would be an improvement on the design for me.",
      "rating": 3.0,
      "verified": true,
      "author": "Emilia Medick",
      "helpful_votes": 0,
      "publication_date": 20170918
    },
    {
      "title": "Works great. Better customer service!",
      "text": "This product worked great. It didn't come with instructions, but it was easy enough to figure out. A ball bearing showed up in the honey when I strained it. The seller advised me it goes in the bottom hole. Also, great customer service. When I put on the valve/gate I had to torque it pretty good to prevent leaking and the gate door handle broke. They replaced it free of charge without hesitation.",
      "rating": 5.0,
      "verified": true,
      "author": "NA",
      "helpful_votes": 0,
      "publication_date": 20151012
    },
    {
      "title": "Cheap crap",
      "text": "This extractor had exactly one use in it. The main nut was stripped after turning the Extractor for 4 mins. While the company offered to send a replacement nut it does not compensate for the poor quality of this Extractor.",
      "rating": 1.0,
      "verified": true,
      "author": "Clam ocean salts",
      "helpful_votes": 6,
      "publication_date": 20140924
    },
    {
      "title": "Not a bad unit. Not a professional unit",
      "text": "Not a bad unit. Not a professional unit. Well built and easy to clean. I did a video of assembly at Youtube... If I could have afforded a radial extractor I would have gone that route. Do not spin too fast or the frames will blow out. Good unit for up to 4 hives though.",
      "rating": 4.0,
      "verified": true,
      "author": "David Lenweaver",
      "helpful_votes": 0,
      "publication_date": 20151027
    },
    {
      "title": "first year of use and it seems to be very ...",
      "text": "first year of use and it seems to be very effective. bottom legs could be a bit longer to allow larger honey bucket to slip under spigot. users need to be VERY careful when cleaning not to lose the small ball bearing on which the main shaft rides (inside the nut at the bottom of the tub). If lost buy several and tape to outside of the unit.",
      "rating": 5.0,
      "verified": true,
      "author": "Kirby B.",
      "helpful_votes": 0,
      "publication_date": 20161009
    },
    {
      "title": "NOTHING OUT THERE COMES CLOSE IN VALUE",
      "text": "You can pay twice as much for a 2-frame extractor made in Italy, or in my opinion -- based on my research -- you can buy this one of equal quality. Yes, it's made in China, what isn't? But, don't let that deter you. If you have the mechanical ability of a 6th-grader, you may have to make some minor adjustments (due to in-transit knocking around), tighten some bolts, and put a couple of drops of oil at the gearbox crank and shaft. Mine worked flawlessly after doing that. I had an issue with some shipping damage, but Mario at Specialty Diamond promptly replaced the damaged parts and treated me very fairly.",
      "rating": 5.0,
      "verified": true,
      "author": "EJK",
      "helpful_votes": 0,
      "publication_date": 20150913
    },
    {
      "title": "First Impression",
      "text": "After reading all the other reviews was the reason we bought it. I watched my wife put it together on skype in three minutes without breaking a nail. We had no machine oil smell, or instructions. we have not used it for extraction as of yet. We will update this later and hopefully we will give 5 stars. We are very pleased with our purchase of the Hardin two frame extractor",
      "rating": 4.0,
      "verified": true,
      "author": "rodneyco",
      "helpful_votes": 0,
      "publication_date": 20150508
    },
    {
      "title": "good service, bad product",
      "text": "When I received it there was a massive dent in the bottom of the drum so big that it had knocked the ball bearing loose. They sent me another drum that had several small dents in the bottom and COVERED in machine oil. I then had the joy of changing all the parts over to the new drum. Mine had sharp metal edges on the drum and legs that are going to need to be filed down before use not to mention washing off all the oil.",
      "rating": 2.0,
      "verified": true,
      "author": "Marc Van Sickle",
      "helpful_votes": 2,
      "publication_date": 20150608
    },
    {
      "title": "Works well, slight issue with crank handle",
      "text": "Everything worked well and was as described. The only minor downfall was the crank handle was a bit chipped and pitted. I had given this as a gift and when we found that issue it was slightly disappointing. Overall though, it did work very well.",
      "rating": 4.0,
      "verified": true,
      "author": "Travis Mills",
      "helpful_votes": 0,
      "publication_date": 20160826
    },
    {
      "title": "Recipient was very happy to get this",
      "text": "Recipient was very happy to get this. Hasn't used it yet but says it has all of the features she could possibly want and is excited to begin using it next fall. Buying on Amazon using Prime was convenient and economical.",
      "rating": 5.0,
      "verified": true,
      "author": "Silvia",
      "helpful_votes": 0,
      "publication_date": 20150107
    },
    {
      "title": "Great buy",
      "text": "A well built unit. Extraction was quick and painless. For obvious balance reasons use frames that are as equally filled as possible. Clean up was a snap, but I lost a little ball bearing out of the bottom and discovered that the customer service was fantastic as well. They said they would sent the lost bearing right out. Totally happy.",
      "rating": 5.0,
      "verified": true,
      "author": "91TBIRD",
      "helpful_votes": 0,
      "publication_date": 20151005
    },
    {
      "title": "Good inexpensive 2 frame extractor",
      "text": "Arrived timely, easy to assemble & use. Would have given it 5 stars if the legs were longer so you could put a 5 gal bucket under the honey gate.",
      "rating": 4.0,
      "verified": true,
      "author": "John S",
      "helpful_votes": 0,
      "publication_date": 20150720
    },
    {
      "title": "Exchange was easy and customer service very nice",
      "text": "The first unit arrived damaged. Exchange was easy and customer service very nice. Second unit arrived damaged. Both units damaged so badly not able to be used or spun at all. Return was a breeze, got our money back. These honey spinners are made of light weight metal, easily broken, not recommended.",
      "rating": 1.0,
      "verified": true,
      "author": "Carole J. Callahan",
      "helpful_votes": 2,
      "publication_date": 20150704
    },
    {
      "title": "Good bargain.",
      "text": "Bargain priced but better than expected. My only complaint is that the spindle came off the bearing in shipping, but easily repaired in the assembly process.",
      "rating": 4.0,
      "verified": true,
      "author": "Triguydoc",
      "helpful_votes": 0,
      "publication_date": 20151121
    },
    {
      "title": "I do like this product but I had to take it apart ...",
      "text": "I do like this product but I had to take it apart to put in the honey gate as it had very sharp edge's, I had to de-bur it so when I put in my frames I would not get cut. if it was not for that it is every thing I had hoped it would be and would have given it 4 stars as I do not believe that anything is perfect.",
      "rating": 3.0,
      "verified": true,
      "author": "Edwin Haskins",
      "helpful_votes": 0,
      "publication_date": 20150901
    },
    {
      "title": "Quality item",
      "text": "This is a nice extractor, well made glad I bought it",
      "rating": 5.0,
      "verified": true,
      "author": "punasurfer",
      "helpful_votes": 0,
      "publication_date": 20170723
    },
    {
      "title": "Product is well made, just some welds are left ...",
      "text": "Product is well made, just some welds are left rough. Be careful, you can over spin the frames and break them.",
      "rating": 3.0,
      "verified": true,
      "author": "Milly",
      "helpful_votes": 0,
      "publication_date": 20160321
    },
    {
      "title": "Very good quality item",
      "text": "Extremely speedy delivery. Very good quality item. So glad I ordered this product. thank you.",
      "rating": 5.0,
      "verified": true,
      "author": "M. D.",
      "helpful_votes": 0,
      "publication_date": 20150903
    },
    {
      "title": "Great buy for the price",
      "text": "I havn't had a chance to extract honey but I am confident this extractor will do the job. It is well built goes together easily. I have looked at other extractors at twice the price or more that were no better. IN fact Ihe stainless body of the extractor is a little sturdier than several I looked at. I had only one slight problem when I was bolting on the legs one nut was tacked a little off center of the hole. All I did is widen the hole in the bracket 1/16\" or so with a unibit and the bolt went right in.",
      "rating": 5.0,
      "verified": true,
      "author": "James O. Becroft",
      "helpful_votes": 2,
      "publication_date": 20150411
    },
    {
      "title": "Great communication after purchase",
      "text": "Great communication after purchase, fast shipping, competitive price, follow-up after shipping. Good merchandising approach for word of mouth advertising. Extractor works great, just what I needed for my small family bee adventure. Ed",
      "rating": 5.0,
      "verified": true,
      "author": "Ed",
      "helpful_votes": 2,
      "publication_date": 20140818
    },
    {
      "title": "so far so good",
      "text": "appears to work just fine a little manual would have been useful to get started especially to explain the extra drain hole",
      "rating": 4.0,
      "verified": true,
      "author": "Adam Morand",
      "helpful_votes": 0,
      "publication_date": 20150923
    },
    {
      "title": "We received the extractor promptly and it looks very good. It appears to be pretty heavy duty",
      "text": "We received the extractor promptly and it looks very good. It appears to be pretty heavy duty. We will use it next year and we are hopeful it will work well!",
      "rating": 5.0,
      "verified": true,
      "author": "Barb47",
      "helpful_votes": 0,
      "publication_date": 20141222
    },
    {
      "title": "Sharp legs",
      "text": "Sharp legs- probably not a good one for kids to use, unless you file them really good. Company did offer to remedy the problem so 4stars for service.",
      "rating": 4.0,
      "verified": true,
      "author": "L W",
      "helpful_votes": 0,
      "publication_date": 20160429
    },
    {
      "title": "It was quick and rather easy to clean up",
      "text": "The extractor is just what we need and more for our small operation. It was quick and rather easy to clean up. Recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Munz",
      "helpful_votes": 0,
      "publication_date": 20150806
    },
    {
      "title": "Fair price for a good product.",
      "text": "Used it this weekend to harvest three supers. The gears needed lubrication at initial set up, then all was perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "mamadomo",
      "helpful_votes": 0,
      "publication_date": 20141008
    },
    {
      "title": "Nice smalll operation extractor",
      "text": "Item looks good, haven't tried it yet, but all parts included, easy assembly, light oil protection easily cleaned off, nice quality stainless steel",
      "rating": 4.0,
      "verified": true,
      "author": "ramroot",
      "helpful_votes": 0,
      "publication_date": 20150927
    },
    {
      "title": "Fast and efficient, for me with two hives this ...",
      "text": "Fast and efficient, for me with two hives this is all I need. Watch your hand though when spinning the crank.",
      "rating": 5.0,
      "verified": true,
      "author": "Falcon",
      "helpful_votes": 0,
      "publication_date": 20150909
    },
    {
      "title": "Good price and works well.",
      "text": "Works great. When u clean it don't loose the little ball bearing at the bottom.",
      "rating": 5.0,
      "verified": true,
      "author": "Turkey",
      "helpful_votes": 0,
      "publication_date": 20151122
    },
    {
      "title": "awesome piece of equipment!",
      "text": "All in all a great product. Sturdy construction. I found that I really like to marvel at its greatness. Only problem i had was thay the bolts didn't match the nut holes for the legs. Kind of a pain but nothing some manipulation couldn't fix.",
      "rating": 4.0,
      "verified": true,
      "author": "Joshua A. Bliss",
      "helpful_votes": 0,
      "publication_date": 20150403
    },
    {
      "title": "Other than the leak we are happy with the extractor and it came very quickly",
      "text": "We just did an extraction and the seam on the tank was not SEALED so it leaked. Is there any $$$ compensation ? Other than the leak we are happy with the extractor and it came very quickly.",
      "rating": 3.0,
      "verified": true,
      "author": "Kerry Obleman",
      "helpful_votes": 0,
      "publication_date": 20150809
    },
    {
      "title": "very nice, well made",
      "text": "very nice , well made ,you do need to add a lock washer to the leg bolts 6 of them .",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20150128
    },
    {
      "title": "but am very pleased with the appearance and operation of this extractor",
      "text": "Have not extracted any honey yet, but am very pleased with the appearance and operation of this extractor. Seems perfect for the hobby beekeeper with a few hives.",
      "rating": 4.0,
      "verified": true,
      "author": "tcmpspa",
      "helpful_votes": 0,
      "publication_date": 20150713
    },
    {
      "title": "The product was better than I expected",
      "text": "The product was better than I expected! It was not difficult to assemble at all. The customer service was great as well. I could not be happier. Thank you! :)",
      "rating": 5.0,
      "verified": true,
      "author": "Amy L. Murphy",
      "helpful_votes": 0,
      "publication_date": 20150705
    },
    {
      "title": "this spinner is unusable. The stem does not reach ...",
      "text": "this spinner is unusable. The stem does not reach the bottom and no matter how tight I tighten the bolts it always comes undone.",
      "rating": 1.0,
      "verified": true,
      "author": "Rasa",
      "helpful_votes": 2,
      "publication_date": 20150714
    },
    {
      "title": "Five Stars",
      "text": "Excelent the only I had tighten all the nuts but it works good",
      "rating": 5.0,
      "verified": true,
      "author": "MARCO",
      "helpful_votes": 0,
      "publication_date": 20151014
    },
    {
      "title": "Have already received and used my extractor and I love it!",
      "text": "Have already received and used my extractor and I love it!! There is a youtube video on how to set the shallow frames in. Thanks!",
      "rating": 5.0,
      "verified": true,
      "author": "Renae",
      "helpful_votes": 0,
      "publication_date": 20150717
    },
    {
      "title": "Although I haven; t yet used it, it ...",
      "text": "Although I haven;t yet used it, it seems to be well constructed.",
      "rating": 5.0,
      "verified": true,
      "author": "Rob Archibald",
      "helpful_votes": 0,
      "publication_date": 20150515
    },
    {
      "title": "Three Stars",
      "text": "The Legs are to small to put a 5 gallon bucket with strainer underneath the spickot.",
      "rating": 3.0,
      "verified": true,
      "author": "Peter Maher",
      "helpful_votes": 0,
      "publication_date": 20150905
    },
    {
      "title": "It works! (once you get it working)",
      "text": "This arrived in pretty awful shape (despite the box being in perfect shape) but after seeing a replacement wouldn't arrive for upwards of 2 months, I just bought the various nuts and bolts needed to put it all back together and used a rubber mallet to reform the roughed up base of the unit. It works reasonably well given the price, but if you aren't prepared to tweak this thing a bit to get it working - you may want to spend a bit more and get one that's a bit sturdier!",
      "rating": 2.0,
      "verified": true,
      "author": "mdaugherty",
      "helpful_votes": 0,
      "publication_date": 20150718
    },
    {
      "title": "Five Stars",
      "text": "Really surprised, it is well made will last a long time",
      "rating": 5.0,
      "verified": true,
      "author": "Cbjmr",
      "helpful_votes": 0,
      "publication_date": 20150627
    }
  ],
  "product_meta": {
    "title": "GOODLAND BEE SUPPLY Hardin Professional 2 Frame Manual Honey Extractor",
    "description": "The Hardin royal 2 is a must have for the beekeeper with 1 - 10 hives. The 16 gauge stainless steel tank with sealed bearings and steel gears make this a professional, durable 2 frame honey extractor. Clear Plexiglas top for easy viewing while extracting. Two deep, medium, or shallow frames can be extracted at once. Included with the Hardin royal 2 is a 3 piece leg stand making offloading your honey hassle free. Because of the simple stainless steel design clean-up is a snap with warm water and soap.",
    "rating": 3.9,
    "feature_bullets": [
      "16 gauge stainless steel tank",
      "Steel gear construction with sealed bearings",
      "Clear Plexiglas top for easy viewing",
      "Optional leg/stand included"
    ],
    "specifications": {
      "Product Dimensions": "15 x 45 x 24 inches",
      "Item Weight": "24 pounds",
      "Manufacturer": "GoodLand Bee Supply",
      "ASIN": "B00HS1YKAA",
      "Item model number": "HE2MAN",
      "Customer Reviews": "3.9 out of 5 stars91 ratings3.9 out of 5 stars",
      "Best Sellers Rank": "#180,202 in Patio, Lawn & Garden",
      "Is Discontinued By Manufacturer": "No"
    },
    "categories": [
      "Patio, Lawn & Garden",
      "Farm & Ranch",
      "Beekeeping Supplies",
      "Garden & Outdoor"
    ],
    "price": 220.27
  }
}