{
  "website_summaries": [
    {
      "verdict": "This budget-friendly blanket is extremely lightweight to carry in your beach bag and resists water and sand.",
      "pros": [
        "Polypropylene weave with anti-fray fabric edging",
        "Choice of colors and sizes",
        "Durable",
        "Resists mildew",
        "Convenient carry handles",
        "Pockets on both sides",
        "Cleans easily with soap and water",
        "Lightweight",
        "Folds up compact"
      ],
      "cons": [
        "Wind lifts easily, so plan to find a way to anchor it",
        "Can be challenging to fold"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Looks gr8 but don't let it fool you",
      "text": "After using this 2x the entire thing fell apart. I could not believe it. At first it seemed like the greatest deal but after using just twice it's obvious this product is literally meant to be used and disposed. Done expect to get much life from this product.",
      "rating": 1.0,
      "verified": true,
      "author": "Steffani Wallace",
      "helpful_votes": 109,
      "publication_date": 20170831
    },
    {
      "title": "Great for the price.",
      "text": "I love this mat. I have seen a little larger, probably thicker, ones for $60-$100 but for the money this is excellent. For our little camper. Keeps us from tracking so much into the camper. Plus it fold small for easy storage. We have very little storage room.",
      "rating": 5.0,
      "verified": true,
      "author": "Chrissy Hightower",
      "helpful_votes": 17,
      "publication_date": 20181212
    },
    {
      "title": "Very big size. Nice",
      "text": "Love it. Perfectly what I was looking for. It's huge and will fit my family of 4 on it during our trip to Sanibel Island in 3 weeks :)",
      "rating": 5.0,
      "verified": true,
      "author": "ꪶꫀⅈꪶꪖꪀⅈ ꪑⅈᥴꫝꫀꪶꪶꫀ",
      "helpful_votes": 118,
      "publication_date": 20150318
    },
    {
      "title": "Terrific Buy!",
      "text": "It's perfect for what it is. Two can lie on it comfortably and you really don't need your towel. Whatever the material is, it's quite soft. I put my chair on the front edge under my umbrella and spread this in front of it. When I wanted to get out in full sun, I just shifted to the mat without having to move my towel and without getting covered in sand. Perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Martha",
      "helpful_votes": 7,
      "publication_date": 20170703
    },
    {
      "title": "Straps break/ sand seeps through.",
      "text": "This product looks pretty but the strap broke the second time we used ut making it difficult to carry it back as it is big and it kept unfolding without the use of the straps. It also kept blowing off so truly should come with sticks to hold down. Aside the sand goes up through the weaving even in the middle of the blanket. So on the second use I tossed it on my way out of the beach. Save your money.",
      "rating": 1.0,
      "verified": true,
      "author": "Evamomelina",
      "helpful_votes": 4,
      "publication_date": 20190626
    },
    {
      "title": "Cheap plastic garbage",
      "text": "Don’t waste your money! This looks like such a smart addition to a beach trip, but in fact it’s a huge waste of money. You need sandbags to weight it down or it lifts in the slightest wind, sand piles on top it does not filter through, and it ended up with holes in it from walking on it after a mere 4 hours of use. Complete garbage piece of cheap plastic.",
      "rating": 1.0,
      "verified": true,
      "author": "Lori Lamb",
      "helpful_votes": 2,
      "publication_date": 20200706
    },
    {
      "title": "Yes you need these",
      "text": "Where have these been all my life? We used them at the beach to put our towels on. We set up two side by side to claim our territory and put our towels on top. The towels got much less sandy, and on a damp day they stayed dry because they weren’t right on the damp sand. They just made a super foundation to hang out on, and were very light weight and seem durable. We’ve used them about eight days so far, and won’t be going to the beach without them next summer.",
      "rating": 5.0,
      "verified": true,
      "author": "Doghouse",
      "helpful_votes": 2,
      "publication_date": 20181004
    },
    {
      "title": "Doesn’t fold properly causing one of the edges to bend and crease up",
      "text": "My friend has the blue one and I loved it so I bought one. The one I got was defective. One of the edges while folded doesn’t fold properly and because of this it is bent and creased. I tried to flatten it out but every time I fold it up cause it doesn’t fold correctly it bends and creases again. I just requested a replacement as I can’t stand trying to bend it back to flatten anymore. Also one of the sides is coming apart. Hope the second one is better.",
      "rating": 3.0,
      "verified": true,
      "author": "E. Han",
      "helpful_votes": 0,
      "publication_date": 20200618
    },
    {
      "title": "Great mat for the beach and picnics",
      "text": "I bought this mat when it is was on sale and it has been a great item to have in our house. I have young children and we use it to go on picnics at the park and we take it to the beach. It is nice because dirt and sand slide right off. I read where some people have difficulty folding up the mat, but my husband has had no issues. One other bonus - you don't have to wash your picnic blanket when you have this.",
      "rating": 5.0,
      "verified": true,
      "author": "Jdole",
      "helpful_votes": 2,
      "publication_date": 20180809
    },
    {
      "title": "Like the mat alot",
      "text": "Great mats, I have one I use for the beach but this year for Bonnaroo I ordered 11 to completely cover our campsite..u must put a tarp under them or water will seep up from the grass. I duck taped them together to make a large mat to cover the space...the tape pulled off after four days without hurting the mat..great for camping it rained really hard one morning on Sunday our camp site was dry..easy to store I have them all in a tote ready for Bonnaroo next year.",
      "rating": 5.0,
      "verified": true,
      "author": "alina martinez",
      "helpful_votes": 2,
      "publication_date": 20180614
    },
    {
      "title": "Convenient but Uncomfortable",
      "text": "It is very a convenient thing to keep in the car for spontaneous trips to the park or the beach. It folds up quite nicely and is easy to set up except when it is super windy. The downfall of the convenience and the price is that the weaving started to come undone after a couple uses. It is also quite uncomfortable to lie down or sit on for longer than 10, 15 minutes and you need to put a towel down on it to make it bearable to sit on.",
      "rating": 3.0,
      "verified": true,
      "author": "Amish",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "Great Mat, but my own issues...",
      "text": "I purchased this product but unfortunately had to return it due to me not liking the feel of the material against my skin. The product itself is well-made and very sturdy and would definitely serve its purpose. It's a nice size for sitting out on the beach or lounging on. Its lightweight and easy t to carry. My issue is that I would need to lay a towel or blanket on top of it to feel comfortable with it. If you don't have an issue with the way beach lounge chairs feel against your skin then this would be a great mat to purchase. I am looking for a mat that that has a material that feels comfortable for me.",
      "rating": 4.0,
      "verified": true,
      "author": "CharPaul",
      "helpful_votes": 0,
      "publication_date": 20180101
    },
    {
      "title": "A nice \"door mat\" to our tent",
      "text": "I bought this solely to use as a door mat area in front of our 6 person Kelty tent. It's been a nice addition. It is pretty tough material and has been used about 5 times so far without an issue. Folds up nicely, sorta like a map though, an IQ test of sorts. Need to follow the bends LOL. Anyway, it would work well as mat to lay down for soccer practices or at the beach (maybe too stiff for that?) but this one is our dedicated tent entry mat. Very pleased with it.",
      "rating": 5.0,
      "verified": true,
      "author": "JC",
      "helpful_votes": 2,
      "publication_date": 20180815
    },
    {
      "title": "BEST beach mat ever!",
      "text": "I bought the mat for a week at the beach. It is fantastic! It's comfortable to sit and walk on and very easy to spread out. The best thing is I can put my chair on it and it doesn't sink into the sand when I sit down. And it doesn't get hot from the sun. I think it will last a long time. Be sure you're getting the extra large one. ...it is so roomy. We are very pleased with our purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Judith Sobczynski",
      "helpful_votes": 0,
      "publication_date": 20190518
    },
    {
      "title": "Easy to store",
      "text": "Great for an outdoor carpet/mat for my camper van when out. I have had a few of these, and they usually do not last more than a season or two, but the price is great, and these are lightweight. If you are on a rough surface, rocks and such things will poke through, so be careful. I like the festive color, and it folds down to a really small size to store in my camper van.",
      "rating": 5.0,
      "verified": true,
      "author": "kmrotterdam",
      "helpful_votes": 0,
      "publication_date": 20200413
    },
    {
      "title": "Used a lot in 2 summers",
      "text": "I've used this mat for 2 summers now. It still looks like new. I use it both in front of our camper door, so it gets walked on all the time, and as beach mat. I am very happy with it. Wish it came in other colors as the blue and green is pretty bright which is fine for the beach, a bit garish for RVS. I like that it is light weight and folds up so small, easy to store or carry.",
      "rating": 5.0,
      "verified": true,
      "author": "ElizabethK",
      "helpful_votes": 2,
      "publication_date": 20180726
    },
    {
      "title": "Functional, sturdy, durable, easy to clean",
      "text": "Awesome for using in the “kitchen” area at camp. Dries fast if it gets wet, keeps sand and dirt at a minimum, and I swear it keeps bugs at bay (at least the crawling variety). My outdoor camp “kitchen” consists of a tiny sink, a folding prep table, two small propane grills, and a couple of coolers all covered by a pop-up canopy. This mat was exactly what I needed to pull it all together. This has seen a ton of foot traffic from humans and dogs, has been through many rain storms, has been immersed in mud and covered in sand and has held up beautifully.",
      "rating": 5.0,
      "verified": true,
      "author": "K Bat",
      "helpful_votes": 0,
      "publication_date": 20200313
    },
    {
      "title": "I'd buy again",
      "text": "Me and my family really liked the mat when we went to the beach. But were thinking of using it other places too, like the lake or park. It was very easy to clean and sand just came right off. The material I think is nylon or plastic of some sort. Just put a towel down if your thinking of just placing your elbow right on it though.",
      "rating": 4.0,
      "verified": true,
      "author": "G",
      "helpful_votes": 2,
      "publication_date": 20180726
    },
    {
      "title": "Great for the sandy beach.",
      "text": "I purchased this product so I could spread out at the beach and not go home with a sand filled beach blanket. This light weight and breathable product gives you ample room and sand slides off as you're packing for home. It's a great buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Darlene",
      "helpful_votes": 4,
      "publication_date": 20170427
    },
    {
      "title": "Not great for the beach but decent overall",
      "text": "Good, albeit basic mat for the beach. I bought it hoping to keep some of the sand off our stuff and give our kids a place to sit without getting all sandy but sand still got everywhere. I know it's not a sand-proof mat or anything, I had simply hoped the material would allow some sand to fall through. This would be perfect for a picnic on grass or other surfaces.",
      "rating": 4.0,
      "verified": true,
      "author": "Tybriss",
      "helpful_votes": 7,
      "publication_date": 20160621
    },
    {
      "title": "Works great on the Beach!",
      "text": "Works great on the Beach! We used it in Corpus Christi Texas last week. I would have given it a 5 out of 5 but think it would help to have some reinforced holds on the corners for stake to anchor it to the ground. I just used regular tent stakes and stuck them right through the material. Seems to work good but might not be a good long term solution.",
      "rating": 4.0,
      "verified": true,
      "author": "Michael Bucannon",
      "helpful_votes": 2,
      "publication_date": 20170331
    },
    {
      "title": "Great Buy",
      "text": "Yes, I recommend this mat. It is very large and made well. My boyfriend and I used it at the beach and several people asked us where we purchased it. It sure beats a blanket or towels on the sand. Much more comfortable. The sand easily shakes right off too! We couldn't get it to fold as it was when we first opened it, in a neat little rectangle with a carrying handle, but that's no big deal.",
      "rating": 5.0,
      "verified": true,
      "author": "phxmary",
      "helpful_votes": 2,
      "publication_date": 20171226
    },
    {
      "title": "Love it!",
      "text": "Love love love this! My mom had the smaller one and we used it at the beach and i fell in love. I ordered the big one for myself and it is huuuuge! I probably only needed the smaller size but since the big one folds up so nicely its still a keaper. Cant wait to take this to the beach, the park, etc.",
      "rating": 5.0,
      "verified": true,
      "author": "jesus aguinaga",
      "helpful_votes": 7,
      "publication_date": 20170523
    },
    {
      "title": "Great for our deck",
      "text": "Perfect to use as a \"rug/mat\" on my deck. I purchased this to use on my deck to prevent splinters and keep feet comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Genevieve Stiehl ",
      "helpful_votes": 3,
      "publication_date": 20200624
    },
    {
      "title": "Good",
      "text": "It's okay, we have a 9 month old so it works to take her out with the mat and let her crawl and play on it. Great to lay out and tan too. The ONLY PROMLEM is that within one week the weave started to loosen up in some parts so not the greatest quality but it works for light use",
      "rating": 4.0,
      "verified": true,
      "author": "The Cravens",
      "helpful_votes": 0,
      "publication_date": 20200423
    },
    {
      "title": "Fell apart",
      "text": "Update: started falling apart after 3 light uses for sunbathing in back yard!! Over priced also! Same one at Winco $6 Seems like a good product, bought for sunbathing if the sun makes an appearance this year!! A bit difficult to fold back up tho!",
      "rating": 1.0,
      "verified": true,
      "author": "Ritta",
      "helpful_votes": 2,
      "publication_date": 20190525
    },
    {
      "title": "Good Beach Mat!",
      "text": "I like that this mat rolls up, is easy to carry, and provides a good base for our beach towels. I moved to SC to be close to the beach. We take this when we go and it provides a place for towels, water, etc. We do weight it down to keep it from flying away when we jump in the water. We shake it out before putting it back in the car, but there will be sand when you go to the beach. It's lasted through several seasons and I expect we'll be using it for years to come.",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara F. Kelly",
      "helpful_votes": 0,
      "publication_date": 20181028
    },
    {
      "title": "You can’t beat the price and quality",
      "text": "I read a ton of reviews & compared different brands before buying. I got the large one and holy crap it’s huge. But it’s perfect for us. Make sure to take step by step photos on your phone of you unfolding it otherwise it won’t go back to normal at the end. It must be exact. Once you do it a few times you shouldn’t need the photos. If you’re going to sit/lay on it you’ll need a towel, blanket, etc. it will leave temporary marks on your skin.",
      "rating": 5.0,
      "verified": true,
      "author": "SKYE COX",
      "helpful_votes": 0,
      "publication_date": 20190501
    },
    {
      "title": "Love it!",
      "text": "Bought this mat th use with our RV when camping. Just came back from a 9 day trip and it worked out great. We put this down outside the door under the awning so that we could walk outside barefoot and to help keep from dragging in dirt and grass. It rained torrentially and this mat saved use from having a muddy mess outside the camper. When we packed up to head home, it folded up nicely and noted well.",
      "rating": 5.0,
      "verified": true,
      "author": "NJH",
      "helpful_votes": 0,
      "publication_date": 20200712
    },
    {
      "title": "Nice mat",
      "text": "It's great to keep in the trunk for impromptu picnics. It's not fabric so if you spill something, you can rinse it right off the mat. Folding is better with 2 people but you can fold it easily enough off the ground if you're by yourself - just follow the lines. The carrying handle is clutch if you're carrying a lot of stuff since you can carabiner it to something else. Good for the beach, although sand a little harder to shake out. Recommend, would buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Perpetua",
      "helpful_votes": 0,
      "publication_date": 20190713
    },
    {
      "title": "Good buy",
      "text": "So easy to bring everywhere, I just leave it in the car. Easy to fold up, can shake off sand easily. I got the big size for a family of 6. Some there's have come loose, but it hasn't fallen apart, and it's not a big deal so far, it's held up all summer",
      "rating": 4.0,
      "verified": true,
      "author": "Briana Marie",
      "helpful_votes": 2,
      "publication_date": 20180813
    },
    {
      "title": "Best beach blanket there is",
      "text": "Look no further! This is what every beach family needs! It does the best job of any product I have used so far to keep your area sand free. Not entirely sand free of course, that’s impossible, but this as close as you’re gonna get. It’s a little hard to fold back up, but I love this thing! I got the large size too and it’s so big, fits all my kids!",
      "rating": 5.0,
      "verified": true,
      "author": "CocoThe Slug",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "Woven don’t work",
      "text": "It’s woven and I completely soaked my jeans when sitting on thick dewy grass. ( a la San Francisco parks) I should have realized woven plastic was a bad idea, I thought it would be one piece. Even on the beach, the sand just came right through it. AND the strap broke on the first use. Totally busted. I gave it away.",
      "rating": 2.0,
      "verified": true,
      "author": "Sayyesinsf",
      "helpful_votes": 0,
      "publication_date": 20191205
    },
    {
      "title": "pretty good for the price.",
      "text": "this is ok, good for the price. it's plastic-y, but be clear that it's not water proof. folds and store easily. nice handles. some stitching coming undone after few months of pretty light use. but it's serving it's basic purpose well and, again, it's priced to move.",
      "rating": 3.0,
      "verified": true,
      "author": "pdid",
      "helpful_votes": 2,
      "publication_date": 20180119
    },
    {
      "title": "Lightweight, Comfortable and Attractive",
      "text": "I bought this to go with my Tommy Bahama Beach Chair (the one with the green/blue stripes) and it looks great and is easy to carry. before I connect the straps on my beach chair, i place one of the beach chair traps through the mat's handles. Then I connect he chair snaps and carry the chair on my bag. The mat weighs ounces so there is no extra burden. The mat does not weigh much so it is a good idea to place your other beach items on its corners or on the edge facing the wind to keep it on the sand securely.",
      "rating": 5.0,
      "verified": true,
      "author": "AmazonEd",
      "helpful_votes": 0,
      "publication_date": 20170207
    },
    {
      "title": "Everyone should have one of these!",
      "text": "I bought this mat before we went to the beach and I couldn't be happier. Weighs almost nothing, easily folds up into a package about the size of a 9x13 envelope (maybe 3 inches thick) and has a Velcro strap to hold it together when folded. It stays cool in the sun which is really important. Sand shakes right off, also important. You can spray it down with the hose in the way from the beach and the water just shakes off. We have used it on grass at an outdoor concert and just recently at a BBQ at a lake with friends. Inexpensive and a convenient piece of outdoor gear to have in the back of the car.",
      "rating": 5.0,
      "verified": true,
      "author": "MattReader",
      "helpful_votes": 0,
      "publication_date": 20170718
    },
    {
      "title": "Convenient and versatile",
      "text": "We've already used it a couple times at the beach. So much more convenient than laying down towels and a breeze to clean. Used it outside of our tent while camping as well and it offered some extra comfort while cutting down on the amount of dirt tracked in. Despite an entire day of rain all it needed was a quick rinse and was ready to be packed back away.",
      "rating": 5.0,
      "verified": true,
      "author": "FLR",
      "helpful_votes": 0,
      "publication_date": 20190804
    },
    {
      "title": "ripped strap",
      "text": "This came with a ripped strap, looked like someone had cut it almost all the way through. This mat was much junkier than I expected, just a large piece of plastic to sit on. I truthfully would have been embarrassed to give it to my parents and they still would have had to sit on a towel on it if they took it for a picnic and it seemed pretty uncomfortable. I was able to do the return online with no issues, just had to take it to a UPS drop off location.",
      "rating": 1.0,
      "verified": true,
      "author": "happy with flowers",
      "helpful_votes": 0,
      "publication_date": 20190704
    },
    {
      "title": "Great for the lawn!",
      "text": "I brought this mat lakeside for a week. Didn't get too hot, even after being in the sun. Easy to fold, once you know to orient the mat the same way every time. The strap didn't hold up very well. Broke on third day from excessive force by a user, not because it's poorly made. However, you can still keep the mat together without the strap. Easily to clean than the large cotton beach blankets with plastic backings.",
      "rating": 5.0,
      "verified": true,
      "author": "It's All Stuff",
      "helpful_votes": 0,
      "publication_date": 20190803
    },
    {
      "title": "Great product.",
      "text": "I used this mat to go underneath a thinner blanket that I had found on amazon as well. This mat is huge and worked perfectly underneath my 10x10 pop up tent. I was worried it would get too hot on the mat but I didn't have any issues with that. Overall its very light weight, I like how it folds into itself and acts as its own carrying case. There is nothing worse than being someplace and having 10 different bags for all of our items.",
      "rating": 5.0,
      "verified": true,
      "author": "Haley",
      "helpful_votes": 0,
      "publication_date": 20160826
    },
    {
      "title": "Very useful!",
      "text": "I bought this a while back and finally came back to review. It’s held up nicely,I’ve used this everywhere and I love it. Went to the beach,park,camping,used in the backyard and it’s always very useful. People always ask me where I got it from because it’s very convinient,I love that it turns into a tote and easy to carry around.",
      "rating": 5.0,
      "verified": true,
      "author": "Classicarah",
      "helpful_votes": 0,
      "publication_date": 20200804
    },
    {
      "title": "Great area mat to secure your space on the beach!",
      "text": "I bought another one of these a year ago for when we go to Cape Cod. Now with the need to keep social distant from others, I bought a second one in order to help secure that space. It helps keep towels from getting too sandy and doesn't get hot. It's the BEST investment and super easy to fold up and store.",
      "rating": 5.0,
      "verified": true,
      "author": "ishcabah",
      "helpful_votes": 0,
      "publication_date": 20200710
    },
    {
      "title": "surprisingly sturdy and useful?",
      "text": "I've taken this thing on float trips, to colorado and recently packed it for Aruba. One of the handles has ripped off, but I just super glued it back on. I'm surprised this lasted so long and cleaning (even mud) comes right off with a hose.",
      "rating": 5.0,
      "verified": true,
      "author": "James Jones",
      "helpful_votes": 3,
      "publication_date": 20170429
    },
    {
      "title": "These mats are not as good a quality as other thicker",
      "text": "Decent quality and very handy to have. Currently have one of these, which needs replacing. That one has served me well for 6-8 years, but is now fraying along one edge. These mats are not as good a quality as other thicker, sturdier, but much more expensive mats. However, it is well worth its price and I anticipate it will last as long as the mat it is replacing.",
      "rating": 4.0,
      "verified": true,
      "author": "L",
      "helpful_votes": 2,
      "publication_date": 20170630
    },
    {
      "title": "Perfect size for family, easy to fold and carry",
      "text": "This mat is light, yet well build. It's also easy to fold as well as carry. When opened, it comes to a superb 9'x6' size, which is good for a small family to sit around and still have enough room for food spread! Bought this after dealing with some moisture issues on picnic and beach trips and couldn't be happier. The colors are bright and nice too.",
      "rating": 5.0,
      "verified": true,
      "author": "abhizone",
      "helpful_votes": 0,
      "publication_date": 20190807
    },
    {
      "title": "Nice",
      "text": "Perfect mat. Its like a soft plastic. Fits 2-4 people comfortably depending on size of person. Easy to shake off sand and fold up and go.",
      "rating": 5.0,
      "verified": true,
      "author": "lucky34",
      "helpful_votes": 0,
      "publication_date": 20200918
    },
    {
      "title": "Feels like a bunch of plastic straws glued together",
      "text": "As soon as it was opened I already saw the plastic \"straws\" bending. Would fall apart real quick. I returned it as soon as I felt how uncomfortable it is.",
      "rating": 1.0,
      "verified": true,
      "author": "E.P",
      "helpful_votes": 0,
      "publication_date": 20200721
    },
    {
      "title": "Easy to carry around and I keep it in the ...",
      "text": "Easy to carry around and I keep it in the trunk of my car. I also bring it along in my baby's stroller because it's convenient for anytime we want to sit on the grass. I initially bought it for the beach but haven't used it for that reason yet. It is very handy as the title put it.",
      "rating": 5.0,
      "verified": true,
      "author": "HHN",
      "helpful_votes": 2,
      "publication_date": 20170617
    },
    {
      "title": "I love this large size mat",
      "text": "You must have this large size mat. It is plenty of room even tall guy. Just make sure to get large size. If you spill something just spray the water and let it dry bit. I love this. I purchased another on for my friend as well. I hope they make more bigger ones.",
      "rating": 5.0,
      "verified": true,
      "author": "Any Plus+",
      "helpful_votes": 0,
      "publication_date": 20180719
    },
    {
      "title": "Great to keep in the car!",
      "text": "This is such a great product to own! The colors are fun too! As a bonus it folds into its own carry case. It’s quick and easy to fold away and carry. It’s even easier to wipe clean after a full day at the lake! Now I carry it with me in the car as it doesn’t take up much space. It’s there ready for any random outdoor activity. It’s very big allowing for more leg room. I definitely recommend this!",
      "rating": 5.0,
      "verified": true,
      "author": "CeeCee",
      "helpful_votes": 0,
      "publication_date": 20180822
    },
    {
      "title": "So much better than a towel!",
      "text": "This mat is a great addition to the items we take to the beach. Easy to carry with the handles, easy to unfold and easy to clean up after a day at the beach. It took us a few times to get the fold back so you could use the closer and handles to get back to the car but once you get the hang of it there is not a problem. So much easering than taking extra towel with you and it worked great for our dogs too.",
      "rating": 4.0,
      "verified": true,
      "author": "K. Jones",
      "helpful_votes": 0,
      "publication_date": 20190925
    },
    {
      "title": "Liked it so much I bought two more",
      "text": "I bought one of these to use as a giant doormat outside our tent when camping. I ended up liking it so much that I bought two more -- one for the other side of the tent and one for picnicking. Lightweight, easy to carry around. My only complaint is that one of the straps broke off quickly, which makes carrying it more challenging.",
      "rating": 4.0,
      "verified": true,
      "author": "A Mom of 3",
      "helpful_votes": 0,
      "publication_date": 20181127
    },
    {
      "title": "Great deal!",
      "text": "Multi use Matt worked great! Used the first time for a camping trip to set outside of the tent as an entry mat, after much rain and mud this held up beautifully. I’m very pleased. Took it home and hosed it down and look forward to trying it out at the beach. Great price.",
      "rating": 5.0,
      "verified": true,
      "author": "em",
      "helpful_votes": 0,
      "publication_date": 20190812
    },
    {
      "title": "Great value",
      "text": "I used this mat for two months of beach camping in Baja this year and it was great. Even though it was big, about 6x9', it folds into a very small space and it's very easy to lay out and fold up. Sure helped keep the sand out of the van, great deal for a big mat that doesn't take up much space.",
      "rating": 5.0,
      "verified": true,
      "author": "Sally Lockhart",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "Will Never Buy Again!",
      "text": "Couldn't use it. Had to return as soon as we received it. When we opened it up there was a huge hole due to the weave being all messed up in the middle of the mat. Not worth another try. It was very bad workmanship.",
      "rating": 1.0,
      "verified": true,
      "author": "Jason P. White",
      "helpful_votes": 5,
      "publication_date": 20160709
    },
    {
      "title": "Neat for beach days",
      "text": "It is easy to open up but not so easy to fold back up. Nice to have on a beach day. Can probably fit 3 to 4 adult people sitting up on it. 2 laying down.",
      "rating": 4.0,
      "verified": true,
      "author": "D.Sherrick",
      "helpful_votes": 0,
      "publication_date": 20190616
    },
    {
      "title": "Super Colorful, Super Durable!",
      "text": "I've bought mats like these before and they're typically pretty disposable. You step on it wrong and the edge starts tearing from the body. This one has held up wonderfully, and survived a family vacation that involved a lot of small children running around/squirming on top of it. Works great.",
      "rating": 5.0,
      "verified": true,
      "author": "Mariah",
      "helpful_votes": 0,
      "publication_date": 20190618
    },
    {
      "title": "Large, great quality beach mat.  Love it.",
      "text": "We love this beach mat. It seems to be of good quality and put together well. If folds up easily. The size is quite large, which is what we wanted. Very happy with this product and would order again.",
      "rating": 5.0,
      "verified": true,
      "author": "Julia R.",
      "helpful_votes": 3,
      "publication_date": 20170407
    },
    {
      "title": "This is huge and held three nice beach chairs with occupants",
      "text": "This is huge and held three nice beach chairs with occupants, two Labrador Retrievers, and assorted beach day items well. It carries easily and matched the popup and beach bag I bought with it. It did have an odor when we first received it but I just opened it up and left it outside for the day over our picnic table and after one day at the beach, the odor was gone. Great for a family that goes to the park or the beach.",
      "rating": 5.0,
      "verified": true,
      "author": "Katrina H.",
      "helpful_votes": 0,
      "publication_date": 20170722
    },
    {
      "title": "Weird handles, but v durable",
      "text": "It is plenty big enough for a family of 3-5 to sit on, but probably only 2 adults to fully lay out on. It’s very durable and easy to clean, but not so easy to fold back up. The carrying straps are actually really small and don’t fit over my shoulder, so you either have to hold it by your hand or put it in a bag. I would like it to have more practice features to increase ease of use, but overall, happy with purchase.",
      "rating": 3.0,
      "verified": true,
      "author": "chelsey sample",
      "helpful_votes": 0,
      "publication_date": 20180922
    },
    {
      "title": "Use Everyday for short Daily Backyard picnic with Babies ...",
      "text": "Bought 2 while the price was on sale ... So glad made that decision, we've been using this every single day ... On the summer and beyond will be an enjoying mat to accompany our short backyard picnic. Just don't forget to spray bug repellent in the season where bug flying all over. Our children love the colorful pattern too ... very recommended as a tool to being outside got fresh air and enough alive sun light",
      "rating": 5.0,
      "verified": true,
      "author": "KT",
      "helpful_votes": 0,
      "publication_date": 20180806
    },
    {
      "title": "Great concept, good customer service - happy with Camco and Mat",
      "text": "We used this mat for a beach vacation and loved it. While we had issues with the first one not lasting very long, Camco was prompt and helpful, willing to replace the product, turning around the customer experience to a positive one. I recommend both the product and company.",
      "rating": 4.0,
      "verified": true,
      "author": "Midwest Review",
      "helpful_votes": 0,
      "publication_date": 20190103
    },
    {
      "title": "Strong, unpleasant odor",
      "text": "We haven't used this yet so I cannot review the quality of construction. Still airing it out in hopes of getting rid of the strong, unpleasant odor - I don't want the smell to permeate towels and other items in our beach gear bag.",
      "rating": 3.0,
      "verified": true,
      "author": "CJ",
      "helpful_votes": 2,
      "publication_date": 20170519
    },
    {
      "title": "Big, lightweight, packable, easy to carry, big enough for 2 people.",
      "text": "We bought two of these to take to the Caribbean on our cruise. They are light and packable, easy to carry with the handles. Each one easily fits two people laying down. Great on the sand or the grass.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelli Chase",
      "helpful_votes": 3,
      "publication_date": 20170325
    },
    {
      "title": "OK but not great",
      "text": "seams started falling apart after 1 use. Size, coverage area and portability is great. Hence the 4 star",
      "rating": 3.0,
      "verified": true,
      "author": "Carlos",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "Amazing mat for the price!!",
      "text": "I LOVE this mat!! It is so light and easy to fold up and even comes with handles for easier travel. I have taken this all over the place in the short time that I've had it and it has held up GREAT! It's a nice big size, it is durable and waterproof. I just spray it down with a hose after each trip, lay it to dry and it is as good as new for the next trip!",
      "rating": 5.0,
      "verified": true,
      "author": "T",
      "helpful_votes": 2,
      "publication_date": 20160920
    },
    {
      "title": "Must have mat for any beach trip",
      "text": "Perfect for sitting on the sand. Large. Easy to dust and wash off. As long as the fold lines remain on the mat, I’ll be able to fold it back properly every time. Used every day for a week at the beach and it was wonderful! Highly recommend. Heavy duty enough that wind didn’t pick it up and blow it.",
      "rating": 5.0,
      "verified": true,
      "author": "Kdoodle",
      "helpful_votes": 0,
      "publication_date": 20200725
    },
    {
      "title": "Awesome! It folds up easily and the handles appear ...",
      "text": "Awesome! It folds up easily and the handles appear to be sewn on well with a little velcro latch part. I love using these types of blankets at the park because they are no easy to maintain. The blanket doesn't let dirt, water, sand or bark chips just stuck on it. I got the 60\" x 78\" size and 5 people were able to comfortably sit on it.",
      "rating": 5.0,
      "verified": true,
      "author": "Cherries and Coconuts",
      "helpful_votes": 12,
      "publication_date": 20170321
    },
    {
      "title": "I LIKE IT",
      "text": "I am pleased overall and excited for all the ways I can utilize the mat. This mat is lightweight, large enough for all 5 of my kids and I like the straps for the option to carry. However, I am sometimes challenged with folding it back up correctly.",
      "rating": 4.0,
      "verified": true,
      "author": "Rebecca",
      "helpful_votes": 0,
      "publication_date": 20191122
    },
    {
      "title": "I would give it a half star!",
      "text": "Do not buy this. Any moisture on the ground will come right through and soak into your clothes. It is made out of some type of plastic not cloth and lots and lots of gaps between the strands. Looks pretty cheap too. I don't think it will last long. Is only ok for dry grass. Sand will certainly go right through these gaps and so it won't be good for the beach either.",
      "rating": 1.0,
      "verified": true,
      "author": "Kevin S. Ainsworth",
      "helpful_votes": 0,
      "publication_date": 20190907
    },
    {
      "title": "Worked great in our shade tent",
      "text": "Worked great in our shade tent. It is really big, I guess I could have used the small, but I like bigger rather then have things too short. easy to fold back up into its own self.",
      "rating": 5.0,
      "verified": true,
      "author": "Pam Curl",
      "helpful_votes": 2,
      "publication_date": 20170724
    },
    {
      "title": "Highly recommend these mats!",
      "text": "Love these mats! I bought a small one for the beach then bought three large ones for the floor of our 10x18 tent. The photos do not do these mats justice. The colors are vibrant and the binding is perfect. Great purchase, highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Sunshine",
      "helpful_votes": 0,
      "publication_date": 20190728
    },
    {
      "title": "Perfect for Summer Fun!",
      "text": "We took this with us to the beach as well as picnics and it has been absolutely perfect every time. The sand didn't even stick to the mat, even the juice we spilled on it cleaned right off with just a little bit of water. Amazon has this Handy Mat for a great price, this mat is perfect for summer fun! It also has pockets on the side to carry things in!",
      "rating": 5.0,
      "verified": true,
      "author": "Honey and TomTop Contributor: Cooking",
      "helpful_votes": 0,
      "publication_date": 20160803
    },
    {
      "title": "sand in all the cracks",
      "text": "so this right here is horrible. it doesn't keep the sand off of it. it doesn't fold back up easily. it doesn't stay on the ground without putting a bunch of stuff on it. the sand doesn't come off of it the only good thing is that its not heavy. would never ever recommend this to anyone highly disappointed",
      "rating": 1.0,
      "verified": true,
      "author": "Stephanie miller",
      "helpful_votes": 0,
      "publication_date": 20200312
    },
    {
      "title": "Love this too",
      "text": "Love this too. Very well made, seems sturdy and we've used it 3 times already. Next item is a beach umbrella. We go to the beach a lot, and we travel big. wagon, tent, beach mat, etc. Kids have needs. :)",
      "rating": 5.0,
      "verified": true,
      "author": "Chardonnay",
      "helpful_votes": 0,
      "publication_date": 20180622
    },
    {
      "title": "Great for outdoor concerts and to keep in the trunk of the car for any occassion",
      "text": "We use this at least once a week. We just keep in the trunk and its been to every summer concert we have been to this year. Great mat to lay down on the lawn to watch an outdoor concert. We also have used it as a camp mat under our canopy. It's pretty hearty and durable. I love the pockets to stuff anything in you want to take with you.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170810
    },
    {
      "title": "Damaged product",
      "text": "This product is great and exactly what I've been looking for. Great size, good enough material. The only thing that I have to return it because it has a cut in the middle of the product. Check your product carefully. I opened it with my bare hands and there is no way I could have damaged it. The package came perfectly fine but the product if damaged. Watch out before you go to the beach.",
      "rating": 3.0,
      "verified": true,
      "author": "Gregory.G.",
      "helpful_votes": 0,
      "publication_date": 20160705
    },
    {
      "title": "Great for picnics",
      "text": "This opens up to function as a great picnic blanket and folds up easily for storage in the car. My niece specifically requested this and I liked it so much I got myself one, too. The synthetic surface is a little sticky on hot days though, so for more comfort, bring a light sheet if you plan on napping.",
      "rating": 5.0,
      "verified": true,
      "author": "NGOC NGUYEN",
      "helpful_votes": 0,
      "publication_date": 20200530
    },
    {
      "title": "Loved these mats for camping",
      "text": "Seriously great buy for our family. We Use these mats to keep sand, dirt, and food away from our campground and they work like a dream! Very easy to clean off and keep the area dirt free and ant free! Highly recommend if you are looking for a non expensive mat that works just as good. Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "katie",
      "helpful_votes": 0,
      "publication_date": 20191006
    },
    {
      "title": "Great for Large Family",
      "text": "Wonderful mat but not so great for the sun as it gets very hot . It does repel sand and water . It also cleans up very easy , folds up and easy to store away . I would suggest it for large family gatherings and still like mine just use in shade . Its also easy to carry and has a side pocket to carry things .",
      "rating": 4.0,
      "verified": true,
      "author": "Robsanole",
      "helpful_votes": 0,
      "publication_date": 20170930
    },
    {
      "title": "Purchased 3 years ago!",
      "text": "Bought 2 of these mats when we moved to Myrtle Beach 3 years ago. Other than one strap ripping they are in perfect condition. Will definitely purchase more soon as gifts. They protect us from the scorching heat of the sand in the summer months and when I roll them up I tap them on the ground before putting in the car and sand falls right off. Love these!!",
      "rating": 5.0,
      "verified": true,
      "author": "Denise6811",
      "helpful_votes": 0,
      "publication_date": 20190613
    },
    {
      "title": "A must for beach goers!",
      "text": "We bought this specifically for use in our hawaii vacation and what a great mat this is! awesome! We used it almost everyday and every hour and works great! Easy to pack, easy to carry, easy to spread and easy to clean that beach sand and pack it right away! We found what we wanted. This beach mat has seen almost all beaches around north and south maui beaches :)",
      "rating": 5.0,
      "verified": true,
      "author": "Maverick",
      "helpful_votes": 2,
      "publication_date": 20160626
    },
    {
      "title": "Great for people who are always outdoors",
      "text": "I've been looking for a mat to take to the beach and my kids games that is easy to carry and easy to clean. This is a great product for families who are always outdoors. It's a great size ... It's big enough for my family of 5!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180329
    },
    {
      "title": "Better then Expected",
      "text": "We tend to go to the beach alot and I thought this would be great. Over I love it. It is a little hard to spread out and fold with just one person. Works fine for 2 people. Easy to clean by shaking it or if an extra tough mess you can just spray with a hose.",
      "rating": 4.0,
      "verified": true,
      "author": "MKM",
      "helpful_votes": 0,
      "publication_date": 20190725
    },
    {
      "title": "It is plastic, wish it was a natural product.",
      "text": "Since it is plastic, it is not comfortable to be on this mat when it's hot outside, the plastic on skin just makes you sweat more and feels uncomfortable against your skin, leaving pattern marks. It does protect you from the ground, it's light, fairly small to carry and a nice size once it's open, easy to refold. Two adults could lay on it. I feel like a sheet or towel between you and the mat is necessary for comfort.",
      "rating": 4.0,
      "verified": true,
      "author": "NM",
      "helpful_votes": 0,
      "publication_date": 20190715
    },
    {
      "title": "Work horse.",
      "text": "This may look cheaply made with cheap looking plastic and stitching, but back in 08 I bought one in Kuwait and only recently needed to replace it. I could not believe I found the exact same thing and can't say how relieved I was. The last on I had was heavily used, and lasted through extreme desert heat beaches and picnics. Even after it started to tear from the UV break down, it worked for us. The new one is exactly the same as the last, and I'm sure I'll get the same amount of use out of it.",
      "rating": 4.0,
      "verified": true,
      "author": "Lubbz",
      "helpful_votes": 0,
      "publication_date": 20150927
    },
    {
      "title": "No happy",
      "text": "Not happy used this Matt 2 times and already the handles/strap/Velcro part came off!",
      "rating": 1.0,
      "verified": true,
      "author": "Diddi",
      "helpful_votes": 6,
      "publication_date": 20160715
    },
    {
      "title": "Nice for Beach or Grassy Park",
      "text": "This is a large mat and can easily fit 3-4 Adults sitting. Comfortable on grass and beach sand but since it’s thin not good for a hard surface. Since it’s large, folding isn’t that easy but once it’s folded it’s small.",
      "rating": 5.0,
      "verified": true,
      "author": "Jayda",
      "helpful_votes": 0,
      "publication_date": 20201018
    },
    {
      "title": "Buy this!",
      "text": "Good quality for the money. This is my second purchase of this brand. Love that it folds easily to put over your shoulder or slip into a large beach bag. And the sand doesn’t stick to it. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191107
    },
    {
      "title": "Very compact and lightweight to bring to beach or park",
      "text": "Ultra convenient and compact when folded. I use this for the beach and it works much better then a towel over the sand. Can sometimes be tough to shake all the sand off but a great value and very light to carry around",
      "rating": 5.0,
      "verified": true,
      "author": "badlittledog",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "Great for camping or at the beach.",
      "text": "Perfect for camping. Use it outside the tent to put your shoes before entering. Use it on the floor of the tent at the door to take off shoes. Holds up well. I bought a couple over the years.",
      "rating": 5.0,
      "verified": true,
      "author": "Djangorose",
      "helpful_votes": 0,
      "publication_date": 20200208
    },
    {
      "title": "Poor quality as delivered",
      "text": "The material looks nice and all for the beach but the product I received was delivered in a poor condition. The Velcro strap to keep the mat together was sewed poorly and is almost completely torn off. The pictures show the state in which the mat arrived. I hope it holds on through this weekend while I'm at the beach.",
      "rating": 2.0,
      "verified": true,
      "author": "M. Hudson",
      "helpful_votes": 2,
      "publication_date": 20170830
    },
    {
      "title": "⭐️⭐️⭐️⭐️⭐️",
      "text": "It is so simple easy to unfold and fold back up! It’s not like super comfortable but if you lay your towel on top of it, it’s good to go! I would recommend this to everyone! I absolutely love mine my kids love it! If you have children and travel to the beach you definitely need one of these! I would give it 5 ⭐️",
      "rating": 5.0,
      "verified": true,
      "author": "Precious",
      "helpful_votes": 0,
      "publication_date": 20200617
    },
    {
      "title": "Beach Mat",
      "text": "Took to Flordia to use on the beaches and it was perfect! Easy to pack in suit case. Easy to fold and spread. Can shake sand off but some gets stuck not a huge deal though. If windy you do have to put cooler or something heavy on corner",
      "rating": 5.0,
      "verified": true,
      "author": "Kate",
      "helpful_votes": 0,
      "publication_date": 20190824
    },
    {
      "title": "This one does not seem like the same quality",
      "text": "I bought one of these a LONG time ago and it lasted forever. I ordered this newer one recently. This one does not seem like the same quality, however, it is super big (large enough for my family of three and huge dog)...should last us a few summers and we live in Florida.",
      "rating": 5.0,
      "verified": true,
      "author": "JRose",
      "helpful_votes": 0,
      "publication_date": 20161229
    },
    {
      "title": "like but skeptical",
      "text": "I like this item. Nice size. Like how it folds up and has a carry strap. However, when I unfolded it, I can already see areas where the material (plastic weave, tarp like) might develop holes. I haven't used yet. Bought for trip to beach this summer. So I don't know if the material is comfy or will be sticky. I'll probably lay towels on top of it. Should be enough to keep some sand off the towels. We'll see.",
      "rating": 3.0,
      "verified": true,
      "author": "MPaige",
      "helpful_votes": 0,
      "publication_date": 20150517
    },
    {
      "title": "Works exactly like it should",
      "text": "I've used this quite a few times at the beach and went camping with it. Works great. Spreads out easy and super easy to get sand and dirt off. Super convenient, just a little tricky to fold back up though.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190814
    },
    {
      "title": "Thick enough for small rock protection",
      "text": "Great mat. We used it over a rocky, shell filled lake shore and it protected us from all those pointy small rocks and shells. I truly was worried that the rocks were going to puncture the mat, but thankfully no damage was done. It is a bit tricky to fold it back in place but overall is a great mat.",
      "rating": 5.0,
      "verified": true,
      "author": "ronald hernandez",
      "helpful_votes": 0,
      "publication_date": 20200528
    },
    {
      "title": "Very comfy and no sand!",
      "text": "This was used for the ones who don’t want to sit in the sun tent and they loved it. The sand went right through but it was thick and comfy. They only issue was when the wind blew hard it would fly up on one end and fold over their feet. We just put our shoes there and we were fine.",
      "rating": 4.0,
      "verified": true,
      "author": "MomTeacherArtist",
      "helpful_votes": 0,
      "publication_date": 20180801
    },
    {
      "title": "The idea of this is great, the size is great and it did not ...",
      "text": "The idea of this is great, the size is great and it did not get hot. All great things...but it is too light and blows all around unless you strategically place shoes, cooler, etc... around it to hold it down. And it is cumbersome to fold back up correctly, especially if there is a breeze. I've left it in the car that last couple of times we've gone to the beach...so that says a lot about it. Maybe on a completely still day, although there is typically a breeze at the beach where I am...or for use at the park/soccer game it would work better.",
      "rating": 3.0,
      "verified": true,
      "author": "Laurabean",
      "helpful_votes": 0,
      "publication_date": 20150708
    }
  ],
  "product_meta": {
    "title": "Camco Handy Mat with Strap, Perfect for Picnics, Beaches, RV and Outings, Weather-Proof and Mold- Mildew Resistant (Blue/Green - 60\" x 78\") - 42805",
    "description": "Color:Blue and Green| Size:60\" x 78\"This Handy Mat is perfect to take with you wherever you go and can comfortably seat up to four adults. It's ideal for picnics, beaches, RVing and outings. Includes built in handles and convenient pockets on both sides to accommodate personal items. Folds out to 60\" x 78\" and folds to a compact 10.5\" x 15\". Durable woven polypropylene is weather proof and mold and mildew resistant. UV stabilized for years of use. Easily cleans with soap and water.",
    "rating": 4.6,
    "feature_bullets": [
      "An Ideal Outdoor Accessory: Great for picnics, beaches, RVing and outings",
      "The Perfect Size Mat: Comfortably seats up to four adults",
      "Includes: Built in handles for easy transport as well as convenient pockets on both sides to accommodate personal items",
      "Durable Construction: Made of strong, weather proof and mildew resistant woven polypropylene weave; UV stabilized for years of use",
      "Easy to Clean: Just wipe with soap and water. Lightweight: Weighs less than 2 lb. Simple to Store: Folds out to 60\" x 78\" and folds to a compact 10.5\" x 15\". Note : That odor comes from the plastic straw material when they make it. If you leave it out for a day the odor goes away."
    ],
    "specifications": {
      "Manufacturer": "Camco",
      "Brand": "Camco",
      "Model": "42805",
      "Item Weight": "1.2 pounds",
      "Product Dimensions": "60 x 0.5 x 78 inches",
      "Item model number": "42805",
      "Is Discontinued By Manufacturer": "No",
      "Manufacturer Part Number": "42805",
      "Folding": "No",
      "Cover Included": "Camco 42805 Handy Mat 60\" x 78\" Outdoor Mat - Blue/Green",
      "ASIN": "B00HJ6O4A0",
      "Customer Reviews": "4.6 out of 5 stars4,049 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#1,934 in Sports & Outdoors",
      "Date First Available": "September 15, 2013"
    },
    "categories": [
      "Outdoor Recreation",
      "Sports & Outdoors",
      "Automotive Parts & Accessories",
      "Camping & Hiking",
      "Camping Furniture"
    ],
    "price": 11.09
  }
}