{
  "website_summaries": [
    {
      "verdict": "Even if you're on a tight budget, you should skip Alcatel's One Touch Fierce in favor of a better prepaid phone.",
      "pros": [
        "The Alcatel One Touch Fierce is inexpensive, has great call quality, and clocks in with respectable HSPA+ speeds"
      ],
      "cons": [
        "The handset's internal speeds are sluggish",
        "In addition, its camera has a unintuitive UI and takes poor photos"
      ],
      "aspects": {
        "Design": 6.0,
        "Features": 6.0,
        "Performance": 6.0
      },
      "publication_date": 20131018,
      "rating": 6.0,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "OLD VERSION - DO NOT BUY",
      "text": "This is a previous generation and the phone description should be updated. There is a Fierce 2 that has been released. This is also a refurbished phone. It is not new as described.",
      "rating": 2.0,
      "verified": true,
      "author": "dimples0",
      "helpful_votes": 3,
      "publication_date": 20150904
    },
    {
      "title": "Excellent screen.",
      "text": "Excellent screen... Insufficient internal storage for all the apps I use.... Battery life mediocre AT BEST (I BELIEVE IS POSSIBLE THAT I RECEIVED A REFURBISHED UNIT SOLD AS \"NEW\"",
      "rating": 3.0,
      "verified": true,
      "author": "Sean G.",
      "helpful_votes": 0,
      "publication_date": 20150929
    },
    {
      "title": "uyer Beware",
      "text": "I didn't open these pones until I was in Jamaica. One was a gift. They were awful Sorry I bought them.",
      "rating": 1.0,
      "verified": true,
      "author": "Carol A. Fitzgerald",
      "helpful_votes": 0,
      "publication_date": 20160429
    },
    {
      "title": "Really poor processing speed and memory",
      "text": "Really poor processing speed and memory. I had to upgrade again within a couple of months. Does not use expandable memory effectively either.",
      "rating": 2.0,
      "verified": true,
      "author": "DiceThrower",
      "helpful_votes": 0,
      "publication_date": 20160906
    },
    {
      "title": "Took it to Tmobile and easily switched plans",
      "text": "Took it to Tmobile and easily switched plans. Some things are a little hard to understand how they work, but for the most part, phone is great for what I am looking for",
      "rating": 4.0,
      "verified": true,
      "author": "Patricia Gamble",
      "helpful_votes": 0,
      "publication_date": 20151103
    },
    {
      "title": "Have never had a phone like this, it takes a bit of getting used ...",
      "text": "Have never had a phone like this, it takes a bit of getting used to but I have come to really like it. Would buy it again.",
      "rating": 5.0,
      "verified": true,
      "author": "Ann Buonamici",
      "helpful_votes": 0,
      "publication_date": 20160502
    },
    {
      "title": "Good phone",
      "text": "I got this for my mom she loves it, it works perfectly in the caribbean. As advertised it will work on any gsm network",
      "rating": 4.0,
      "verified": true,
      "author": "Kadiekay",
      "helpful_votes": 0,
      "publication_date": 20160305
    },
    {
      "title": "Just what we expected a great phone at a good price , delivery was at the expected date could not expect more from Amazon",
      "text": "Just what we expected a great phone at a good price , delivery was at the expected date could not expect more from Amazon",
      "rating": 5.0,
      "verified": true,
      "author": "Nestor Jose",
      "helpful_votes": 0,
      "publication_date": 20150303
    },
    {
      "title": "Great",
      "text": "Cant believe how good this phone is. Using h2o wirless.",
      "rating": 5.0,
      "verified": true,
      "author": "Cbaracuta",
      "helpful_votes": 0,
      "publication_date": 20150726
    },
    {
      "title": "absolutely perfectly",
      "text": "Purchased this device to use while traveling, received it just the day before traveling, and nowthat heading it on a day to day basis i absolutely love it",
      "rating": 5.0,
      "verified": true,
      "author": "Alistair Sonaram",
      "helpful_votes": 0,
      "publication_date": 20150314
    },
    {
      "title": "I did not like this phone",
      "text": "I did not like this phone. It is a prepay phone and I cound not get this to work. I thought it was an unlock phone?",
      "rating": 1.0,
      "verified": true,
      "author": "Lawrence",
      "helpful_votes": 0,
      "publication_date": 20150413
    },
    {
      "title": "was a nice looking phone for the money but can not use ...",
      "text": "was a nice looking phone for the money but can not use with net 10 service as I was told I could. Only got 2g when transferred to a net10 service.",
      "rating": 2.0,
      "verified": true,
      "author": "Debbie",
      "helpful_votes": 0,
      "publication_date": 20160110
    },
    {
      "title": "Five Stars",
      "text": "It was a gift for my granddaughter and she loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "M. C. Davilla",
      "helpful_votes": 0,
      "publication_date": 20150502
    },
    {
      "title": "Reasonable price, great phone!",
      "text": "Great phone for the price! I've bought them for my kids and they love these phones as well!",
      "rating": 5.0,
      "verified": true,
      "author": "Daniela Kostic",
      "helpful_votes": 0,
      "publication_date": 20150706
    },
    {
      "title": "It's an okay phone none the less",
      "text": "It's a little glitchy and has less memory than stated, less than 1gb free. Transferable apps will not transfer to my 32gb SD card.",
      "rating": 3.0,
      "verified": true,
      "author": "Ty",
      "helpful_votes": 0,
      "publication_date": 20160302
    },
    {
      "title": "The phone work very good.",
      "text": "I purchased an unlocked phone but received an T Mobil one, fortunetnetly it worked in my network. Thanks. The phone work very good.",
      "rating": 5.0,
      "verified": true,
      "author": "bienvenido thomas",
      "helpful_votes": 0,
      "publication_date": 20150712
    },
    {
      "title": "Would not recommend this",
      "text": "The phone was very poorly made and was very slow. Would not recommend this phone",
      "rating": 2.0,
      "verified": true,
      "author": "S. Smith",
      "helpful_votes": 0,
      "publication_date": 20150404
    },
    {
      "title": "the battery strength is very poor. Am really surprised that Alcatel will make this",
      "text": "The phone is not strong, the battery strength is very poor. Am really surprised that Alcatel will make this, very poor quality.",
      "rating": 5.0,
      "verified": true,
      "author": "joel",
      "helpful_votes": 0,
      "publication_date": 20150331
    },
    {
      "title": "Good device",
      "text": "Awesome device. Took to two other countries and used different Sims and data service. Love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Jai Cee",
      "helpful_votes": 0,
      "publication_date": 20150820
    },
    {
      "title": "Good afternoon the phone does not even six months old ...",
      "text": "Good afternoon the phone does not even six months old and the touch screen slides not please I can do Thank you for your help",
      "rating": 1.0,
      "verified": true,
      "author": "Merbys Correa",
      "helpful_votes": 0,
      "publication_date": 20150525
    },
    {
      "title": "... my SIM card for it but overall it's a good phone. But it has a poor front camera",
      "text": "I had to cut my SIM card for it but overall it's a good phone. But it has a poor front camera.",
      "rating": 4.0,
      "verified": true,
      "author": "Fako Ouattara",
      "helpful_votes": 0,
      "publication_date": 20141129
    },
    {
      "title": "Two Stars",
      "text": "The box and promotion say The cell phone is 4G and didn't",
      "rating": 2.0,
      "verified": true,
      "author": "Raquel Alvarez",
      "helpful_votes": 0,
      "publication_date": 20150502
    },
    {
      "title": "Great Phone",
      "text": "It's a great phone, very fast, up 4G , applications work well. I recommend it. Shipping was fast. Not bring headphones.",
      "rating": 4.0,
      "verified": true,
      "author": "Mariana M.",
      "helpful_votes": 3,
      "publication_date": 20150606
    },
    {
      "title": "I bought this product but it doesn't work in Venezuela. I had to pay to unlock it",
      "text": "Hi, I bought this product 2 weeks ago. According to features in the publication, the cell phone is unlocked to Venezuela, but when the product came here, any telephone company worked on the phone; so, I had to pay for unlock my phone to can use it. I would be thankful if you check the model before sending it to customer. Thanks and regards.",
      "rating": 3.0,
      "verified": true,
      "author": "José Parra",
      "helpful_votes": 10,
      "publication_date": 20150131
    },
    {
      "title": "This phone is great and very nice feature but I was disappointed because ...",
      "text": "This phone is great and very nice feature but I was disappointed because it was not unlocked internationally (Philippines), no case included and I can't change mg network into 3g and 4g network! 2g network only! VERY DISAPPOINTED! How can I use 3g and 4g??? The distributor need to help me.",
      "rating": 2.0,
      "verified": true,
      "author": "Karen Kim",
      "helpful_votes": 0,
      "publication_date": 20150301
    },
    {
      "title": "Especially the quality of videos and pictures are very good. It is really an interesting Smartphone",
      "text": "Especially the quality of videos and pictures are very good. It is really an interesting Smartphone. Buy it you will satisfy.",
      "rating": 4.0,
      "verified": true,
      "author": "Andy San",
      "helpful_votes": 2,
      "publication_date": 20150429
    },
    {
      "title": "wasn't as described. it says tmobile phone, and ...",
      "text": "wasn't as described. it says tmobile phone, and yes it has a tmobile cover, but on start up it shows metro pcs logo. which is also compatable with tmobile, but i didn't want a metro phone.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160203
    },
    {
      "title": "Not international unlocked",
      "text": "I bought this cell 'cause I was moving outside of US but it's not international unlocked like you are selling. It doesn't work w/france telecom",
      "rating": 1.0,
      "verified": true,
      "author": "NERFY",
      "helpful_votes": 0,
      "publication_date": 20141215
    },
    {
      "title": "One Star",
      "text": "they said its 4G and it isnt 4G.... its 2g for digitel and 3g fpr movistar.",
      "rating": 1.0,
      "verified": true,
      "author": "ulyses leger",
      "helpful_votes": 0,
      "publication_date": 20150821
    },
    {
      "title": "Good, I have five days with my phone and ...",
      "text": "Good, I have five days with my phone and I got defective, the touch screen is uncontrolled and unresponsive I should do?",
      "rating": 1.0,
      "verified": true,
      "author": "Ana Gabriela Montilla",
      "helpful_votes": 0,
      "publication_date": 20141224
    },
    {
      "title": "Headphones Handfree not included",
      "text": "Te product work perfectly but the headphones not come with the cellphone. I rate only 3 stars for this issue",
      "rating": 3.0,
      "verified": true,
      "author": "Jose F. Torres M",
      "helpful_votes": 0,
      "publication_date": 20150816
    },
    {
      "title": "One Star",
      "text": "Extremely disappointed, it didn't accept the network. It would have only allowed calls/texts, but no data usage.",
      "rating": 1.0,
      "verified": true,
      "author": "Dianna",
      "helpful_votes": 0,
      "publication_date": 20150815
    },
    {
      "title": "Awsome :)",
      "text": "Like an Love the Phone an it works thx guys but no case in the box but its okay already got one now.",
      "rating": 5.0,
      "verified": true,
      "author": "Charles Begay",
      "helpful_votes": 8,
      "publication_date": 20140313
    },
    {
      "title": "At first it looked like a locked phone - T-Mobile everything",
      "text": "UPDATE: Since I got this thing last year, it just keeps getting worse. Out of storage problems, can't move to SD card, can't delete shovelware, and I can't root the damn thing either. It's very disconcerting when a product's performance deteriorates substantially over such a short period of time. At first it looked like a locked phone - T-Mobile everything. But when I finally got an AT&T SIM it seemed to work fine. Note that it takes only the smaller kind of SIM. Not the big ones.",
      "rating": 1.0,
      "verified": true,
      "author": "G Rowland",
      "helpful_votes": 2,
      "publication_date": 20151124
    },
    {
      "title": "A good basic smart phone",
      "text": "This is a good basic smart phone. We had some problems with being able to use it with a Mexican SIM card when we first got it, but the customer service from the seller was superb, and they walked us through getting it to work (via many friendly emails). This isn't an iphone, but then again, I didn't want all of the bells and whistles that come with an iphone. It is functional and it works. That is what matters to me.",
      "rating": 4.0,
      "verified": true,
      "author": "jr",
      "helpful_votes": 0,
      "publication_date": 20150922
    },
    {
      "title": "Would not recommend",
      "text": "This is the 1st item I ordered from Amazon that I would not recommend and I have been purchasing items for 3 years. The phone did not work. Could not even read the screen. Returned the day after received.",
      "rating": 1.0,
      "verified": true,
      "author": "Paula Whited",
      "helpful_votes": 2,
      "publication_date": 20150914
    },
    {
      "title": "really a good choice.",
      "text": "Have been using it for more than 3 years, really a good choice.",
      "rating": 5.0,
      "verified": true,
      "author": "MSam",
      "helpful_votes": 0,
      "publication_date": 20170706
    },
    {
      "title": "Great For The Price",
      "text": "For the price and its specs i think it is a very good purchase. Have in mind that this phone is an unlocked version of T mobile phone but it works great if you are using it with other carrier or in another country. Comes with charger and cable and full of apps. I bought this for my mother so I erased everything I could.",
      "rating": 5.0,
      "verified": true,
      "author": "SergioArb",
      "helpful_votes": 8,
      "publication_date": 20150705
    },
    {
      "title": "worst phone ever",
      "text": "Fierce is, without a doubt, the worst phone I have ever had. It shut off constantly. I missed phone calls, because they never came through. Internet was impossible. I had it less than two weeks before I got a different phone. Now I can not sell it for even the cost of shipping.",
      "rating": 1.0,
      "verified": true,
      "author": "Tracy",
      "helpful_votes": 0,
      "publication_date": 20150325
    },
    {
      "title": "Not so glad with this Alcatel",
      "text": "30 second after be speaking in a convresation the mic stop working. I most speak as closer as posible to be heard for the other person or use an hands free. some times the call is cutted by the phone or some error with it. I bought another one for my wife and the same problem happens. Signal, most of time is low. Alcatel is a very good brand, but this model I would not recomend.",
      "rating": 3.0,
      "verified": true,
      "author": "Rafael S.",
      "helpful_votes": 9,
      "publication_date": 20140501
    },
    {
      "title": "Five Stars",
      "text": "bought for a family friend, works in a different country.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20150928
    },
    {
      "title": "waste of time dont buy",
      "text": "Will never buy again waste of time was not unlocked",
      "rating": 1.0,
      "verified": true,
      "author": "Simone Pinkney",
      "helpful_votes": 0,
      "publication_date": 20150427
    },
    {
      "title": "phone look like a used one and Playstore was not working",
      "text": "I bought this product recently, phone look like a used one and Playstore was not working.",
      "rating": 1.0,
      "verified": true,
      "author": "dasa prakash jayabalan",
      "helpful_votes": 0,
      "publication_date": 20151130
    },
    {
      "title": "hay people u should buy this phone",
      "text": "omg I loveeeeeeeeeee this phone the only thing is the front camera really dones not work that good but other then that I love it",
      "rating": 5.0,
      "verified": true,
      "author": "Tina",
      "helpful_votes": 0,
      "publication_date": 20150325
    },
    {
      "title": "Four Stars",
      "text": "Work good can relly take a beatting grate it you neef a quick phone but has terable mimmery",
      "rating": 4.0,
      "verified": true,
      "author": "Nobody",
      "helpful_votes": 0,
      "publication_date": 20160414
    },
    {
      "title": "Good Phone!",
      "text": "This was purchased for me son we both like it a lot!",
      "rating": 4.0,
      "verified": true,
      "author": "Jennifer Nienke",
      "helpful_votes": 0,
      "publication_date": 20151224
    },
    {
      "title": "Super Android",
      "text": "Its more than what I was expecting is an excellent android all app work just perfect. It was unlocked as the seller specification and brand new. 100% satisfy with this product.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Zelaya",
      "helpful_votes": 5,
      "publication_date": 20140725
    },
    {
      "title": "The phone is good and functioning well",
      "text": "The phone is good and functioning well. Unfortunately it does not have language I considered essential so I had to return it.",
      "rating": 4.0,
      "verified": true,
      "author": "Rubin",
      "helpful_votes": 4,
      "publication_date": 20150511
    },
    {
      "title": "otherwise it's good in general",
      "text": "first they lie...there is no case included...the memort is limited which I did not pay attention to...otherwise it's good in general...",
      "rating": 3.0,
      "verified": true,
      "author": "Abdulrazak ",
      "helpful_votes": 5,
      "publication_date": 20140919
    },
    {
      "title": "I was looking for a smart phone unlock I saw this alcatel one touch",
      "text": "I was looking for a smart phone unlock I saw this alcatel one touch. I was spectacle about this phone. boy I was wrong its a great phone with all the feature that was looking for. and for the price its is great. I will RECOMMEND THIS PRODUCT TOO MY FRIEND AND FAMILY.",
      "rating": 5.0,
      "verified": true,
      "author": "hector martinez",
      "helpful_votes": 0,
      "publication_date": 20151228
    },
    {
      "title": "Not a good Phone in Africa.",
      "text": "It's not working good in Africa. It function as 2G .",
      "rating": 3.0,
      "verified": true,
      "author": "F. Bunor",
      "helpful_votes": 0,
      "publication_date": 20141205
    },
    {
      "title": "save your money not worth the price",
      "text": "I just recieved the phone today and now im returning it today. The phone is a good size but the front camera is horrible, the sound is terrible , and the service is 2g not 4. Not worth it at all. 😒😥",
      "rating": 1.0,
      "verified": true,
      "author": "daijanae wiley",
      "helpful_votes": 0,
      "publication_date": 20150508
    }
  ],
  "product_meta": {
    "title": "Alcatel One Touch Fierce 4G Android Smartphone Unlocked - Use With Any SIM - Slate",
    "description": "This Fierce has been determined fully functional by our industry leading functionality inspection. It will show signs of wear like scratches, scuffs, and minor nicks on the screen or body. This item will NOT come in its original packaging NOR will it include original accessories, headsets, SIM card, or manual. It WILL include a certified 3rd party cable and UL approved power adapter. This Fierce is fully functional with T-Mobile, AT&T and all other GSM networks. It will NOT work on Sprint, Verizon, Boost, Virgin Mobile or any other CDMA network.",
    "rating": 3.7,
    "feature_bullets": [
      "4.5 in qHD Display - a vivd screen for viewing photos, playing games and watchuing HD movies",
      "Quad-Core Processor with 1GB RAM and 4 GB ROM & a Micro SD Slot for expandable memory",
      "Android 4.2 - Jellybean",
      "5 MB rear camera with LED flash and camcorder to capture, edit, create and share photos and videos in addition to a VGA front facing camera",
      "Smooth multitasking experience allows you to simultaneously run multiple apps, games and access the internet",
      "Unlocked cell phones are compatible with GSM carriers like AT&T and T-Mobile as well as with GSM SIM cards (e.g. H20, Straight Talk, and select prepaid carriers). Unlocked cell phones will not work with CDMA Carriers like Sprint, Verizon, Boost or Virgin."
    ],
    "specifications": {
      "Product Dimensions": "7 x 5 x 4 inches",
      "Item Weight": "15 ounces",
      "ASIN": "B00HWQBPGS",
      "Item model number": "Alcatel",
      "Batteries": "1 C batteries required.",
      "Customer Reviews": "3.7 out of 5 stars166 ratings3.7 out of 5 stars",
      "Is Discontinued By Manufacturer": "No",
      "OS": "Android 4.2",
      "Wireless communication technologies": "Cellular",
      "Additional Features": "Camera, Expandable-memory, Smartphone",
      "Display technology": "LED",
      "Other display features": "Wireless",
      "Other camera features": "Back camera: 5 MP camera|Front camera: VGA",
      "Form Factor": "Smartphone",
      "Colour": "Black",
      "Manufacturer": "OneTouch",
      "Date First Available": "January 17, 2014"
    },
    "categories": [
      "Cell Phones & Accessories",
      "Cell Phones",
      "Unlocked Cell Phones",
      "All Departments"
    ],
    "price": ""
  }
}