{
  "website_summaries": [
    {
      "verdict": "Royal Purple earns a lot of praise for providing results for many motorists, but it also has features that make it impractical for some.",
      "pros": [
        "Known for delivering results – produces noticeable gas mileage improvement and less knocking in most automobiles",
        "A reliable stabilizing additive for consumers who use low-octane fuel"
      ],
      "cons": [
        "The bottle doesn't have a long spout, which makes it awkward to put into the tank without spilling",
        "Contains MMT, which may \"gunk up\" some spark plugs"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "The best fuel system cleaner I have ever used",
      "text": "The best fuel system cleaner I have ever used. I made the mistake of letting my 2000 ford ranger sit too and basically my gasoline lost its punch. My vehicle was driving terrible. I researched and found this was the highest rated product out there. I poured it into my tank and let it sit over night. It was an immediate difference in performance. I should have done it as PM a long time ago.",
      "rating": 5.0,
      "verified": true,
      "author": "Pluto2727",
      "helpful_votes": 10,
      "publication_date": 20180627
    },
    {
      "title": "My vehicle genuinely needs an octane boost, and this works the best",
      "text": "I have a 1965 Triumph with a milled cylinder head, and a street/race cam. These modifications were performed around 1970 by the first owner. (the engine has not been rebuilt since). I have had problems with pinging, light load uphill. This is the only product that works. One can usually can last me a year and half, since I don't drive the car all the time. I have had no additional issues with this classic since using this product. (misfires, smoke from bad rings, etc). I do not feel any additional MPG, or performance using this product. If you genuinely do not get enough octane from pump gas, I suggest trying this.",
      "rating": 5.0,
      "verified": true,
      "author": "Gladlands",
      "helpful_votes": 5,
      "publication_date": 20180129
    },
    {
      "title": "Definitely better gas mileage in my c5 Corvette",
      "text": "Definitely better gas mileage in my c5 Corvette. It also smoothes out the idle and I get a better throttle response. I have terrible cold starts unless I use this stuff.",
      "rating": 4.0,
      "verified": true,
      "author": "Zachariah McElhatton",
      "helpful_votes": 8,
      "publication_date": 20170526
    },
    {
      "title": "Boo, did night for my beautiful Vette",
      "text": "Hello, I have to admit the packaging, labeling etc is what drew me in initially. After that it was the 30 point boost claimed. I bought a can to put in my Vette, in great anticipation and hope; yet the product dropped my mileage by 10 vice raising it by 30. If especially hard when you aren't at all sure of WHAT is going to manifest itself; at 13 a can will.... I have a '13 Grand Sport which is already fast, so any data point in speed or power did nit show itself......boo",
      "rating": 1.0,
      "verified": true,
      "author": "Tango Kilo",
      "helpful_votes": 0,
      "publication_date": 20200429
    },
    {
      "title": "Great fuel additive when running a tuner or larger cam.",
      "text": "Highly recommended for all the gear heads out there. You will absolutely notice a hp increase with no knocking or pinging, especially if using a tuner.",
      "rating": 5.0,
      "verified": true,
      "author": "Rzr guy",
      "helpful_votes": 7,
      "publication_date": 20170728
    },
    {
      "title": "Only fuel additive I use",
      "text": "The best stuff for your car, I usually put this in at every fill up or two, keeps my Dodge Charger 6.1L going fast and strong.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Ruiz-Gardner",
      "helpful_votes": 4,
      "publication_date": 20180906
    },
    {
      "title": "Worked for me!",
      "text": "Took a long road trip. Put a can in my 2012 Cadillac CTS for better performance. I was impressed. In just the first 200 miles, I could feel a better and more powerful response. After filling up the tank for the trip home, I got another 3 MPG. That’s awesome in my book for a 3.5 V6!",
      "rating": 5.0,
      "verified": true,
      "author": "MARCUS",
      "helpful_votes": 0,
      "publication_date": 20200410
    },
    {
      "title": "did not worked in my toyota camry.",
      "text": "i filled up full tank of premium gas and added royal purple max boost, and did not notice anything at all",
      "rating": 1.0,
      "verified": true,
      "author": "Tim",
      "helpful_votes": 0,
      "publication_date": 20200117
    },
    {
      "title": "Awesome! Worth Every Penny!",
      "text": "Works great in my 10-1 compression Jeep engine! No more knocking and a little more power!",
      "rating": 5.0,
      "verified": true,
      "author": "A A",
      "helpful_votes": 3,
      "publication_date": 20180511
    },
    {
      "title": "Work well. Closest thing to race gas in an additive",
      "text": "I use this for 03 bmw with a tune for 93 octane. I can feel a distinct difference when I use this and when I don’t.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian",
      "helpful_votes": 0,
      "publication_date": 20201017
    },
    {
      "title": "Good stuff",
      "text": "Got a tune on my ‘18 Charger R/T and needed some extra octane and this did the trick. Will order more.",
      "rating": 5.0,
      "verified": true,
      "author": "JCE",
      "helpful_votes": 0,
      "publication_date": 20200611
    },
    {
      "title": "I purchased this by mistake",
      "text": "I purchased this by mistake ,but I will use it when the time comes.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard",
      "helpful_votes": 0,
      "publication_date": 20190915
    },
    {
      "title": "great product",
      "text": "Always use royal purple products in my vehicles they. work great",
      "rating": 5.0,
      "verified": true,
      "author": "GLENN LOWY",
      "helpful_votes": 0,
      "publication_date": 20200901
    },
    {
      "title": "Solved pinging issue.",
      "text": "Got a bad rank of gas and threw this in. It stopped pinging instantly.",
      "rating": 5.0,
      "verified": true,
      "author": "Daryl B.",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "Product and Seller service",
      "text": "Hi, this is an excellent product enhancing mileage distance and smooth running of the engine. Seller delivered way up front to eta delivery date, Product from this Seller is highly recommended. Best regards Lionel South Africa",
      "rating": 5.0,
      "verified": true,
      "author": "Lionel Wolmarans",
      "helpful_votes": 0,
      "publication_date": 20190924
    },
    {
      "title": "1/2 can, less is more in my case.",
      "text": "Honda Accord J35 with a tune. Definitely pulling less timing with this product. 1/2 can + 91 pump gas is the ticket. A full can is too much.",
      "rating": 4.0,
      "verified": true,
      "author": "PV",
      "helpful_votes": 2,
      "publication_date": 20190707
    },
    {
      "title": "Works very good.",
      "text": "I used this in an old lawn mower and atv. It helped making starting much easier after 2 tank of gas. I will buy again",
      "rating": 5.0,
      "verified": true,
      "author": "ss",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "Does nothing",
      "text": "No difference. Power or mileage. Liqui Moly, works and I can feel the difference. Royal Purple-no difference",
      "rating": 2.0,
      "verified": true,
      "author": "B1R",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "Works",
      "text": "Bought this to add to fuel for quad and mini bike",
      "rating": 5.0,
      "verified": true,
      "author": "THW",
      "helpful_votes": 0,
      "publication_date": 20200227
    },
    {
      "title": "The best octane booster ever!",
      "text": "I put a can of the Royal Purple Octane booster in my son's 2008 Mustang GT, and using premium gas, not only did it improve his performance, but his gas mileage went way up. It added 2 additional miles per gallon. Simply amazing!",
      "rating": 5.0,
      "verified": true,
      "author": "Ken L. Chin",
      "helpful_votes": 0,
      "publication_date": 20181012
    },
    {
      "title": "Very good stuff for your gas",
      "text": "This is a very good product it will save you on your gas and get better gas mileage but every time you order it from Amazon it always comes dented the bottle ☹️ Huge dent on the side of the can don’t understand why",
      "rating": 4.0,
      "verified": true,
      "author": "andrew",
      "helpful_votes": 0,
      "publication_date": 20180730
    },
    {
      "title": "well worth it",
      "text": "Definitely helps MPG (if you drive normally) and gives it that little extra boost. Does everything the bottle says it does.",
      "rating": 5.0,
      "verified": true,
      "author": "Gregory",
      "helpful_votes": 0,
      "publication_date": 20171204
    },
    {
      "title": "Great product.",
      "text": "Great product that came promptly and is used in a classic car.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard B.",
      "helpful_votes": 0,
      "publication_date": 20190701
    },
    {
      "title": "No difference Whatsoever!!",
      "text": "I used it then filled up. It made no difference in Performace or Engine Noises.",
      "rating": 2.0,
      "verified": true,
      "author": "Woodyboy in Florida",
      "helpful_votes": 0,
      "publication_date": 20181123
    },
    {
      "title": "Feel the boost!!!",
      "text": "Great stuff. Definitely feel the difference in power from added octane. Wouldn't use in none fuel injected cars unless you have high compression.",
      "rating": 5.0,
      "verified": true,
      "author": "Nicholas L.",
      "helpful_votes": 0,
      "publication_date": 20200226
    },
    {
      "title": "Five Stars",
      "text": "This is a great product! I use it in my tahoe, 93 honda vfr750 and my snowmobiles!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171216
    },
    {
      "title": "My 4 stroke outboard loves this stuff.",
      "text": "Added to my 1998 Mercury 4 stroke outboard. I use 89 octane then add this product and the motor is getting better mileage than when used with other fuel products. I'm sold, ill be adding at every fill up.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180719
    },
    {
      "title": "def notice small difference when you do the whole royal set",
      "text": "packaging or straw built in thing is wack but beside noice",
      "rating": 4.0,
      "verified": true,
      "author": "Nav",
      "helpful_votes": 0,
      "publication_date": 20190522
    },
    {
      "title": "Five Stars",
      "text": "felt a noticeable boost in my truck and less engine noise",
      "rating": 5.0,
      "verified": true,
      "author": "Byron Livermore",
      "helpful_votes": 0,
      "publication_date": 20170814
    },
    {
      "title": "Great but expensive",
      "text": "Good product but kind of expensive to use as an every fill up addative.",
      "rating": 3.0,
      "verified": true,
      "author": "Sean Carter",
      "helpful_votes": 0,
      "publication_date": 20180414
    },
    {
      "title": "Can Tell mileage went up !",
      "text": "Works good cleans and saves fuel mileage , pour directly into vacuum line to injectors",
      "rating": 5.0,
      "verified": true,
      "author": "Dv",
      "helpful_votes": 0,
      "publication_date": 20160425
    },
    {
      "title": "Surprisingly seems to free up some power in my BMW ...",
      "text": "Surprisingly seems to free up some power in my BMW 530i and Honda Fit motors. Definitely took care of valve rattle in the BMW.",
      "rating": 5.0,
      "verified": true,
      "author": "Shreck",
      "helpful_votes": 8,
      "publication_date": 20150418
    },
    {
      "title": "I'm sing this in a Mastercraft ski boat with an ...",
      "text": "I'm sing this in a Mastercraft ski boat with an engine that calls for premium fuel. Only regular (87 octane) fuel is available this summer locally without ethanol (my preference based on feedback from other owners). I've been using Max-Boost to compensate and the boat is running well.",
      "rating": 4.0,
      "verified": true,
      "author": "Donald H.",
      "helpful_votes": 2,
      "publication_date": 20160901
    },
    {
      "title": "THIS IS NOT A 6 PACK!",
      "text": "THIS IS NOT A 6 PACK AS AMAZON HAS LISTED. Its one can which is way too much for the price. This stuff works well but its listed in a way that will upset you.",
      "rating": 3.0,
      "verified": true,
      "author": "A K Q 10 2",
      "helpful_votes": 2,
      "publication_date": 20171226
    },
    {
      "title": "Five Stars",
      "text": "Works well in my BMW 328i and allows me to use higher modes on my active autoworker tune.",
      "rating": 5.0,
      "verified": true,
      "author": "James T.",
      "helpful_votes": 5,
      "publication_date": 20160306
    },
    {
      "title": "Don’t buy, does not do what it claims",
      "text": "This was a huge waste of money. I run high o rain in my 2008 harley night rod and tired of paying for racing fuel. Bought this hoping since it was a name brand it would do what it said. It did not. Will never buy again",
      "rating": 1.0,
      "verified": true,
      "author": "David carpenter",
      "helpful_votes": 2,
      "publication_date": 20180610
    },
    {
      "title": "only stuff that works",
      "text": "i use this and the MAX-CLEAN product once in a while in my jeep to keep the internals good. there are a lot of snake oil products for cars vut you can actually feel this stuff working",
      "rating": 5.0,
      "verified": true,
      "author": "Nate",
      "helpful_votes": 0,
      "publication_date": 20170511
    },
    {
      "title": "only 1 bottle. Not 6",
      "text": "The order was for 6 pack $12.71. But I received only 1 bottle.",
      "rating": 2.0,
      "verified": true,
      "author": "Path To Wisdom",
      "helpful_votes": 0,
      "publication_date": 20171216
    },
    {
      "title": "Three Stars",
      "text": "tried it, the cost to performance difference doesn't make it worth the money.",
      "rating": 3.0,
      "verified": true,
      "author": "Jon Wedde",
      "helpful_votes": 0,
      "publication_date": 20161207
    },
    {
      "title": "Royal Purple makes good products.",
      "text": "It really does work and you can tell it when you drive away from the gas pump. Royal Purple makes good products.",
      "rating": 5.0,
      "verified": true,
      "author": "phil",
      "helpful_votes": 0,
      "publication_date": 20160111
    },
    {
      "title": "WORKS",
      "text": "We have tried many, many of the other products out there....the difference is this actually works and because there is ethanol in our fuel locally, this product is even better - NO added alcohol.",
      "rating": 5.0,
      "verified": true,
      "author": "Vicky M",
      "helpful_votes": 6,
      "publication_date": 20150210
    },
    {
      "title": "Five Stars",
      "text": "Actually saved my gas mileage thanks! can't buy anything higher than 93... car needs at least 95.",
      "rating": 5.0,
      "verified": true,
      "author": "Zach",
      "helpful_votes": 0,
      "publication_date": 20160128
    },
    {
      "title": "Royal Effectiveness!",
      "text": "It's effective as long as I don't pour the entire bottle per each tankful. That has been my mistake all along. My car is tuned so when it seems to apply more timing advance is when I use only 1/4 of its content per half tank of gas or 1/2 of the booster per tankful. This is good for me to know because I don't end up wasting it right away.",
      "rating": 5.0,
      "verified": true,
      "author": "I4Y",
      "helpful_votes": 3,
      "publication_date": 20160706
    },
    {
      "title": "price is for one can not a 6 pack",
      "text": "When I purchased the item the ad said 16 oz. 6 pack. it also said the package weighed 6.3 lbs. 16 oz. equals one pound consequently I thought it was a 6 pack as advertised. In actuality it is one can. The ad has since been edited deleting 6 pack but it still says it weighs 6.3 lbs. Just be aware of the quantity you are actually buying.",
      "rating": 1.0,
      "verified": true,
      "author": "DL",
      "helpful_votes": 5,
      "publication_date": 20171222
    },
    {
      "title": "I think I got better results from the NoS octane booster",
      "text": "I think I got better results from the NoS octane booster. Also one thing I'd like to say is that this product doesn't come with a funnel, so it's kinda hard to get it in the gas tank unless you have a funnel for it. I wouldn't buy this again, Royal Purple should really include a funnel with this product.",
      "rating": 4.0,
      "verified": true,
      "author": "Alan",
      "helpful_votes": 2,
      "publication_date": 20151208
    },
    {
      "title": "Great product, as i have used different fuel octane ...",
      "text": "Great product,as i have used different fuel octane boosters,seems to help my 90 plymouth van run alot better.I use royal purple oil in my 83 mazda Rx7",
      "rating": 5.0,
      "verified": true,
      "author": "Raymond McGrath",
      "helpful_votes": 5,
      "publication_date": 20141122
    },
    {
      "title": "2007 Audi S8",
      "text": "Good stuff my 2007 S8 V10 runs great on it. I would advise to mix it with Shell V-power. Plus remeber higher octain gas doesn't need same amount of energy to combust. Which translates to longer running engine.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20160820
    },
    {
      "title": "Learning view on a turbo ej25 motor says it allowed ...",
      "text": "Learning view on a turbo ej25 motor says it allowed more timing with stock maps. Cant get anything but 91 in the Rockies so I use a few oz in every tank for my 6g72tt motor.",
      "rating": 5.0,
      "verified": true,
      "author": "RyanAssoc",
      "helpful_votes": 2,
      "publication_date": 20160308
    },
    {
      "title": "Car runs much better with this in the tank",
      "text": "Used in Porsche 996 Turbo. Car has a GIAC ECU upgrade optimized for 93 octane. I recently move to the west coast where it is unavailable. Car runs much better with this in the tank.",
      "rating": 5.0,
      "verified": true,
      "author": "Gary R",
      "helpful_votes": 5,
      "publication_date": 20151123
    },
    {
      "title": "Makes a big difference",
      "text": "I was skeptical about the these types of products and decided to try it on my 1999.5 Audi A4 1.8 Quattro. The turbo engine always has had a hard time with Texas heat and humidity. When I had the opportunity to drive the car at Circuit of the Americas I put this in the tank before filling up. It makes a big difference. Normally the car feels sluggish due to heat soak at temps above 95F and it feels as if the turbo is broken. With this product the car drives as if the temp is in the 70s with very good throttle response and no more sluggish feeling. Will keep on using this in the summer time.",
      "rating": 5.0,
      "verified": true,
      "author": "slimpie",
      "helpful_votes": 4,
      "publication_date": 20160705
    },
    {
      "title": "Four Stars",
      "text": "Decent product, i noticed no difference in performance with my Turbocharged car though.",
      "rating": 4.0,
      "verified": true,
      "author": "Sean",
      "helpful_votes": 2,
      "publication_date": 20160424
    },
    {
      "title": "royal purple made the biggest difference and work perfect for my application",
      "text": "Well it's royal purple. I recently put a different tune in my 04 Dakota 4.7 and with the need for higher octane than I can get at the pump I tried a few different octane boosters and out of all of them, royal purple made the biggest difference and work perfect for my application. I should have just tried rp first because I use royal purple produst in every part of my truck.",
      "rating": 5.0,
      "verified": true,
      "author": "Justin DeVincentz",
      "helpful_votes": 3,
      "publication_date": 20160214
    },
    {
      "title": "Great with their max-clean fuel system cleaner!",
      "text": "This in conjunction with Royal Purple's Max-Clean Fuel System Cleaner made my 2004 Subaru WRX feel much smoother. I just got the car at 140,000 miles and it was feeling a little clunky. So I emptied the tank, put both liquids in, filled my tank up with premium, and drove off into the sunset.",
      "rating": 5.0,
      "verified": true,
      "author": "itsTreble",
      "helpful_votes": 4,
      "publication_date": 20160211
    },
    {
      "title": "Royal Purple Max-Boost is the real deal!",
      "text": "I run a supercharged L67 in my Bonneville SSEi and knock/detonation is deadly. This stuff is seriously worth several horsepower as proven in dyno test after dyno test and gives about a 3 point octane boost. I've always been skeptical about most cheesy boosters but this is the real deal. Check it out for yourself on this dyno test.",
      "rating": 5.0,
      "verified": true,
      "author": "dAmADtECH",
      "helpful_votes": 10,
      "publication_date": 20151014
    },
    {
      "title": "Lead ingredient may foul o2 sensors.",
      "text": "I ordered this and then realized lead is an ingredient that can foul o2 sensors.",
      "rating": 2.0,
      "verified": true,
      "author": "Doug E. White",
      "helpful_votes": 0,
      "publication_date": 20160629
    },
    {
      "title": "Max-boost works great. I had about a 1",
      "text": "Max-boost works great. I had about a 1.5 miles per gallon increase in mt Ford F150. I will be using this product again. I also considering using it on my company's fleet of trucks.",
      "rating": 5.0,
      "verified": true,
      "author": "steve woodbury",
      "helpful_votes": 9,
      "publication_date": 20140829
    },
    {
      "title": "Power feels better at midband",
      "text": "This went into my 2002 SPI Ford Focus and the idle became smoother with less hiccups. Power feels better at midband, and maybe a few hp improvement. Online videos show this product does remove some deposits from combustion chamber. It gave me the result I was expecting. I am happy to recommend the product from my own experience.",
      "rating": 5.0,
      "verified": true,
      "author": "Matt",
      "helpful_votes": 2,
      "publication_date": 20160804
    },
    {
      "title": "Exactly how advertised I am very happy with this purchase",
      "text": "Exactly how advertised I am very happy with this purchase",
      "rating": 3.0,
      "verified": true,
      "author": "Ed Everett",
      "helpful_votes": 0,
      "publication_date": 20160613
    },
    {
      "title": "Two Stars",
      "text": "Hogwash... I haven't seen any true benefits with this product!",
      "rating": 2.0,
      "verified": true,
      "author": "JAHRODUS SPLIFT",
      "helpful_votes": 0,
      "publication_date": 20160907
    },
    {
      "title": "Felt no difference.",
      "text": "I put this into a nearly bone dry 13 gal tank then filled tank with premium 91octane here in California. I drive a 2011 Subaru STI and honestly made no difference in fuel economy or power. Maybe two bottles may have made a difference but not worth the $ to try it.",
      "rating": 1.0,
      "verified": true,
      "author": "Flip Alarcon",
      "helpful_votes": 5,
      "publication_date": 20160114
    },
    {
      "title": "It needs a longer spout to fit in the gas ...",
      "text": "It needs a longer spout to fit in the gas tank opening or else its just going to spill out over your car's precious paint job.",
      "rating": 1.0,
      "verified": true,
      "author": "Sanford L. Schantz",
      "helpful_votes": 3,
      "publication_date": 20161108
    },
    {
      "title": "Royal Purple Max Boost",
      "text": "Tried it . Its ok. No lead. Try Octane Supreme. It has real Tetraethyl lead for valves and seats. And will greatly increase octane.",
      "rating": 3.0,
      "verified": true,
      "author": "D. Noe",
      "helpful_votes": 6,
      "publication_date": 20140824
    },
    {
      "title": "Excellent for adding points for those who cant run anythimg lower than premium pump gas!",
      "text": "Excellent product! Noticeable difference! I have to run at least mid grade in my Pontiac grand prix gtp supercharged model, or it will spark knock due to the pulley size drop. So, this product, along with a full tank of mid grade pump gas, and I'm getting results as if I run 104 VP racing fuels! At half the cost Pr gallon! I'm game!",
      "rating": 5.0,
      "verified": true,
      "author": "Cart-man",
      "helpful_votes": 3,
      "publication_date": 20190907
    },
    {
      "title": "See the change",
      "text": "Poured a little of this in our golf cart and the rest in my wifes car.",
      "rating": 5.0,
      "verified": true,
      "author": "David from Missouri",
      "helpful_votes": 0,
      "publication_date": 20190826
    }
  ],
  "product_meta": {
    "title": "Royal Purple ROY11757 MAX BOOST, 16 fl oz",
    "description": "Item Package Quantity:1Royal Purple Max-Boost - 16 fl oz Can is a high-performance octane booster with fuel treatment that increases gasoline octane, reduces emissions, and enhances engine performance while stabilizing fuel. Max-Boost is formulated with MMT, which delivers the best octane enhancement to help eliminate engine-damaging detonation, pre-ignition, and pinging or knocking from low octane gasoline. Max-Boost is formulated for engines equipped with carburetors, port fuel injection and direct injection, as well as turbocharged, supercharged and nitrous-injected engines. Safe for use in leaded and unleaded gasoline's, and alternate fuels like gasohol, reformulated gasoline, and all ethanol blends. Max-Boost is safe for oxygen sensors and catalytic converters. Performance engine oils contain higher levels of phosphorus as an anti-wear additive, which can accumulate in catalytic converters and reduce their effectiveness. Max-Boost protects against phosphorus poisoning of catalytic converters.",
    "rating": 4.5,
    "feature_bullets": [
      "Replaces lead additives for protection of non-hardened valve seats",
      "Raises octane rating up to 30 points or 3 numbers",
      "Restores power and fuel economy while cleaning deposits from fuel injectors",
      "Reduces power loss due to knock-retard in computer-controlled vehicles",
      "Reduces engine knocking/pinging and stabilizes fuel",
      "Max-Boost is a racing formula and is not street legal."
    ],
    "specifications": {
      "Manufacturer": "ROYAL PURPLE",
      "Brand": "Royal Purple",
      "Model": "11757",
      "Item Weight": "12.8 ounces",
      "Product Dimensions": "7.5 x 2.5 x 2.5 inches",
      "Item model number": "ROY11757",
      "Is Discontinued By Manufacturer": "No",
      "Manufacturer Part Number": "11757",
      "OEM Part Number": "11757",
      "Folding": "No",
      "Cover Included": "Auto part, Automotive Accessories, Replacement and Performance parts",
      "ASIN": "B00HEZQHQU",
      "Customer Reviews": "4.5 out of 5 stars248 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#15,984 in Automotive",
      "Date First Available": "December 19, 2013"
    },
    "categories": [
      "Additives",
      "Automotive Parts & Accessories",
      "Oils & Fluids",
      "Engine & Oil",
      "Automotive"
    ],
    "price": 13.79
  }
}