{
  "website_summaries": [
    {
      "verdict": "The Canon PowerShot Elph 340 HS pocket camera packs a long zoom into a slim body, but image quality drops off a cliff in low light.",
      "pros": [
        "Sharp 12x zoom lens",
        "Speedy focus",
        "Creative Shot mode",
        "Wi-Fi with NFC",
        "Compact"
      ],
      "cons": [
        "Very noisy images",
        "Slow continuous shooting rate",
        "Narrow aperture when zoomed"
      ],
      "aspects": {},
      "publication_date": 20140312,
      "rating": 5.0,
      "source": "pcmag"
    }
  ],
  "customer_reviews": [
    {
      "title": "All You Need in Europe!",
      "text": "Don't let the size fool you. This camera takes stunning clear, vibrant photos, and incredible HD video. Broadcasting quality. It powers on quickly. Has a dedicated video record button. No viewfinder- just large LCD screen. It's solidly built. I was touring very dangerous areas where you had to keep your camera secreted inside your shorts. With all the sweaty conditions and frumpy and bumpy handling, I only noticed a few small scratches to the LCD screen. No data loss or card corruption. WiFi feature works very well. I was surprised.",
      "rating": 5.0,
      "verified": true,
      "author": "Otis Lift",
      "helpful_votes": 3,
      "publication_date": 20150805
    },
    {
      "title": "I think this product is excellent. What I like most of all for this ...",
      "text": "For the price, I think this product is excellent. What I like most of all for this camera, is the zoom. It records also normal videos. For photos I have D1100 and I wanted something small for concerts. I satisfied. This camera is taking better quality photos and videos in concerts, than D1100. Here is the link how it records the lives  Take in consideration, that I was sitting very very far. Sound I think quite normal. Also, camera itself is very beautiful.",
      "rating": 5.0,
      "verified": true,
      "author": "Keto",
      "helpful_votes": 2,
      "publication_date": 20150525
    },
    {
      "title": "Great Camera!",
      "text": "Love this camera!!! I got if for myself first and after using it for a few months, had to get another one for my mom. She is not very tech savvy and this camera is extremely user friendly. The pictures come out very clear, even at 12X zoom. I love how light and small it is, fits into the smallest purse and pockets. I've taken it to concerts and sporting events and could zoom in on singers/player face while sitting in nose bleeds. Judging by my pictures, I was in first row! As far as batteries go, I haven't had any issues and charge usually lasts all day. Highly recommend it",
      "rating": 5.0,
      "verified": true,
      "author": "Polina",
      "helpful_votes": 0,
      "publication_date": 20151001
    },
    {
      "title": "Great Camera",
      "text": "I saved for a quite a while and did a lot of research before I bought this product. I am still in the discovery stage of trying it out and learning all the tricks this camera offers. I can't wait to take it on vacation and see the kind of photos I get of the ocean, lakes, mountains, etc. I love it. It doesn't have as quick of a photo taking process as I'd like but I'm getting used to that as well. For me its just adjusting from one Canon to another Canon. I must say Canon cameras are just awesome. Clear beautiful photos.",
      "rating": 5.0,
      "verified": true,
      "author": "Frances Cangialosi",
      "helpful_votes": 0,
      "publication_date": 20150317
    },
    {
      "title": "My 8th Canon ... Perfect again!",
      "text": "This is the EIGHTH Canon pocket digital I've owned since 2003 ... getting a new one for every major trip we've taken. Guess you could say I'm a CANON fan! Works like a charm, hides in my pocket in every museum that doesn't like me taking photos and gets great shots even when used at hip level in a crowded room. So called \"smart\" phones take great shots when everything is just right, but with image stabilization and a killer auto-focus, NONE of them can match a REAL Canon!",
      "rating": 5.0,
      "verified": true,
      "author": "Robert J. Taylor",
      "helpful_votes": 0,
      "publication_date": 20160809
    },
    {
      "title": "I'm so disappointed. This camera was bought refurbished from FourBros",
      "text": "This is my first time ever posting a review. I'm so disappointed. This camera was bought refurbished from FourBros. The camera does not hold a charge. Every time I pull it out to use it, it is out of battery. You can not take it on trips because it looses its charge quickly. I'm so disappointed, because I wasted my money and I don't have money to buy a new camera.",
      "rating": 1.0,
      "verified": true,
      "author": "bluelupine",
      "helpful_votes": 6,
      "publication_date": 20160623
    },
    {
      "title": "I like this camera",
      "text": "I like this camera. I am a novice photographer who did not want to spend a lot of money on a DSLR until I learned how to take excellent pictures. The camera is easy to use and has many picture taking options. The 12x zoom works well and the picture quality is excellent. The other nice feature is that the camera takes 1080 video, which is really nice. I think this camera is great for the beginner or the established photographer who wants to carry a point and shoot camera.",
      "rating": 4.0,
      "verified": true,
      "author": "Larry F.",
      "helpful_votes": 0,
      "publication_date": 20150819
    },
    {
      "title": "Everything Grainy from image on screen to how the pictures turn out. Very disappointed!",
      "text": "I loved my HS 330 and this is a very poor substitute. Everything is grainy. When you look at the screen it looks like a 5mp camera and the pictures don't come out much better.",
      "rating": 1.0,
      "verified": true,
      "author": "Emily Kapic",
      "helpful_votes": 9,
      "publication_date": 20150117
    },
    {
      "title": "Like very much",
      "text": "My father and his friend recommended this camera, they are both in their 80's and have been taking beautiful pictures with it, so I finally bought one. I love the size and it's pretty easy to use. My other camera is too complicated so it's a pain to use. I think I will get a lot of use with this and it's nice and small. The anti movement feature is very good, much better than either of my more expensive cameras. The wifi sends pictures to my smart phone or computer easily too. Photo of fairy garden was taken from about 20 feet away.",
      "rating": 5.0,
      "verified": true,
      "author": "C. L. Kehoe",
      "helpful_votes": 0,
      "publication_date": 20151104
    },
    {
      "title": "I'd save and get that model instead it took way better pictures and had a better wide angle compared to ...",
      "text": "Works ok I had the previous model ELPH 330. I'd save and get that model instead it took way better pictures and had a better wide angle compared to this model. Of course they have newer versions so hopefully they made improvements baised on consumer reviews. The camera functions well otherwise in regards to technicality. I just regret loosing my previous model since it worked so much better.",
      "rating": 3.0,
      "verified": true,
      "author": "Chemise",
      "helpful_votes": 0,
      "publication_date": 20170302
    },
    {
      "title": "The camera did all the work",
      "text": "The camera did all the work. I bought this camera in anticipation of a trip to Scotland and Northern England. I set it on Auto and let the camera do its thing. Of course, my subject matter was gorgeous and there is nothing to compare to rolling green hills, ancient castles and the like, but this is what surprised me : In the view finder, I did not see the quality of the shot. In the print in my hand, there was a Wow factor. This little, compact ,convenient camera takes great pictures. This was a good buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Finbarr",
      "helpful_votes": 0,
      "publication_date": 20150604
    },
    {
      "title": "Good Camera, Purchased for 70+ Mother In Law, she likes it!",
      "text": "Nice camera, easy to use and takes good Pics! Not the most feature laden, but for a simple digital point and shoot it works nicely. Good value for the money. Purchased this as a gift for Mother In Law, she's 70+ and her old Nikon had been acting up. The learning curve on it wasn't too bad for her and it came with a decent owners manual. Overall, she likes it a lot and takes a lot of pictures. What more could you ask for?",
      "rating": 4.0,
      "verified": true,
      "author": "Snixer",
      "helpful_votes": 0,
      "publication_date": 20161016
    },
    {
      "title": "Great Camera",
      "text": "Excellent small camera. The wireless works smoothly with my iPad Air 2 and my mini iPad. The pictures are exactly as I hoped they would be. Attached is one of the photos I took with this camera. Take the time to become familiar with its features. It's worth it. Although, it works well as a point and shoot on auto setting. The battery life is shorter than one might hope, but you can buy TWO extra batteries with charger for $11. So it's no problem.",
      "rating": 5.0,
      "verified": true,
      "author": "HIM",
      "helpful_votes": 3,
      "publication_date": 20150619
    },
    {
      "title": "clean sharp photos",
      "text": "Took over 20,000 photos (the counter resets after 9,999) using my old Elph at work under rough conditions. Decided on this one as a replacement since the old one was so reliable. They have come a long way since I bought my old one. I get clean sharp photos even when zoom is maxed, and is pretty good in low light also. Fits perfectly in the pants pocket, good battery life. As with all compacts the flash is just so so.",
      "rating": 5.0,
      "verified": true,
      "author": "Bean",
      "helpful_votes": 0,
      "publication_date": 20160203
    },
    {
      "title": "I would recommend!",
      "text": "It really is a great little camera. It fits well in my purse, has a very decent zoom, and picture quality is great! Although I have a nice big fancy camera with a lot more zoom, I really like something that I can carry around easily and this fits the bill. I bought it before a trip I took to Kuala Lumpur in April and have been very happy with the pictures it has produced.",
      "rating": 5.0,
      "verified": true,
      "author": "LJRD",
      "helpful_votes": 0,
      "publication_date": 20150905
    },
    {
      "title": "Love this camera",
      "text": "I had one of the older ones for years until I dropped it and it was a great little camera. I haven't got to use this one much yet but so far I am liking it more than my old one.",
      "rating": 5.0,
      "verified": true,
      "author": "John II",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "Great little camera, but GPS needs improvement",
      "text": "Does a great job under a variety of lighting conditions. I'm doing much less post-processing of my digital images (photoshop, etc) with this camera than with my prior ones. Image colors are generally good, without being over saturated. Zoomed images are sharp. High contrast shots (aka backlit conditions) are handled very well, automatically. On board GPS initialization is cumbersome at best. User manual is poor in this area. Even once GPS is locked on to satellites, re-establishing satellites a few minutes after shutting down camera and powering back up is extremely slow. I leave the system turned off and carry a dedicated GPS, then geotag images once I return home.",
      "rating": 4.0,
      "verified": true,
      "author": "Ronald W. Hayward",
      "helpful_votes": 0,
      "publication_date": 20160401
    },
    {
      "title": "Great Point and shoot",
      "text": "This camera is a great point and shoot camera. For just a little camera, this camera has a fantastic zoom. It's photos come out clear and it is a perfect on-the-go camera that can fit right in your pocket. A really nice camera for traveling because it is compact and takes really great quality pictures up close and far away.",
      "rating": 5.0,
      "verified": true,
      "author": "hnicole",
      "helpful_votes": 0,
      "publication_date": 20160724
    },
    {
      "title": "Five Stars",
      "text": "Canon has always a good product. I don't go with other.",
      "rating": 5.0,
      "verified": true,
      "author": "Nita ",
      "helpful_votes": 2,
      "publication_date": 20180130
    },
    {
      "title": "Could be better.",
      "text": "The camera arrived as stated, no shipping problems. It is easy to use, takes decent pictures. But after a couple weeks of use, the lens cover stopped closing all the way when the lens retracted. I did not return it because I am travelling. My last Canon Elph had a similar problem in that the lens stopped retracting all the way, and the camera ceased working but this was after 4-5 years of use. I love these small cameras but I'm not sure I will buy another. I find the Elph numering system very confusing too. What is the latest/newest version? Who knows? Finally, the battery doesn't last long. I bought extras and must be diligent about keeping them charged.",
      "rating": 3.0,
      "verified": true,
      "author": "Delores Clark",
      "helpful_votes": 0,
      "publication_date": 20160422
    },
    {
      "title": "Fine pocketable camera, good value.",
      "text": "I have several Canon DSLRs, EOS-ID Mark IV, 7D, Rebel T3 and a G11 but wanted something truly pocketable. The ELPH 340 fills the bill. Excellent photos, good range, loaded with features and priced competitively or lower than comparable models. It serves me well in the instances when my iPhone 6+ camera is insufficient but carrying a larger kit is a nuisance. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Alfred R Huddleston",
      "helpful_votes": 3,
      "publication_date": 20141225
    },
    {
      "title": "Golden Oldie!",
      "text": "Sweet, older model that delivers BETTER photos than the newer 350 & 360, in my opinion. I'm retiring a 300 that has survived a lot of abuse & still mostly works. Highly recommend the 340 for adventure & remote travel. Small, light, & excellent photos!",
      "rating": 5.0,
      "verified": true,
      "author": "Catfish ...",
      "helpful_votes": 2,
      "publication_date": 20160328
    },
    {
      "title": "1000% satisfied",
      "text": "Camera was in super shape. I have more expensive and versatile cameras (Canon G-15, SX40 super zoom) but this one I can carry with almost no notice and it is still has enough control for most situations and takes good pictures. It is the camera I carry most of the time.",
      "rating": 5.0,
      "verified": true,
      "author": "George R. Wills",
      "helpful_votes": 0,
      "publication_date": 20160824
    },
    {
      "title": "This camera is amazing. It is tiny yet packs a plethora of ...",
      "text": "This camera is amazing. It is tiny yet packs a plethora of functions. It takes amazing quality pictures and the Wi-Fi feature is my favorite! We ride horses and I take this camera with me into some pretty severe back country and to the arena. I left it on the fender of the horse trailer and drove off the second time I ever used it. We found it the next day in the gravel it had been run over, but one small dent is all it suffered and it still works perfectly!",
      "rating": 5.0,
      "verified": true,
      "author": "vamplover",
      "helpful_votes": 0,
      "publication_date": 20150917
    },
    {
      "title": "This is a case of progress making things worse. I have no need to upload pics to ...",
      "text": "The wifi connection is too difficult to use and did not always connect. I had to put memory card in another camera to get my pictures. I have a mac book pro. With a USB cord, camera connects to computer directly and iPhoto. With WiFi, pictures went to Canon program. Then I had to bring the photos into IPhoto after saving them. A second canon program opens before you can drag the pictures to iPhoto. This is a case of progress making things worse. I have no need to upload pics to my phone and take up valuable memory. Be careful before you buy.",
      "rating": 2.0,
      "verified": true,
      "author": "Dr. Alan M. Schwartz",
      "helpful_votes": 0,
      "publication_date": 20150726
    },
    {
      "title": "Audio issues.",
      "text": "I bought this camera to replace my 330 HS, which I LOVED. This camera has already given me battery errors, lens issues, and audio issue when recording. I have a feeling it will be replaced soon.",
      "rating": 3.0,
      "verified": true,
      "author": "SnowDogs",
      "helpful_votes": 4,
      "publication_date": 20141116
    },
    {
      "title": "which took great pictures. But there is nothing to grip on ...",
      "text": "This is my second Elph series camera. I dropped my first one, which took great pictures. But there is nothing to grip on either camera, so hang on for dear life. It does take very good pictures, but the manual especially concerning wi-fi is very underwhelming and confusing. For the price it is a great bargain.",
      "rating": 3.0,
      "verified": true,
      "author": "rgjmalec",
      "helpful_votes": 2,
      "publication_date": 20141231
    },
    {
      "title": "Written manual !",
      "text": "I am one of the \"technologically disadvantaged\". I bought this because of the reviews, the price, and the reputation of Canon. I am very happy with this camera. It is very user friendly. It comes with a WRITTEN manual! Thank you Canon! I am pleased with the pictures I have taken. This is an upgrade from the other digital camera I had which was not user friendly and not a Canon.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Mitchelle",
      "helpful_votes": 0,
      "publication_date": 20150308
    },
    {
      "title": "it travels easily, and the battery has a decent amount of ...",
      "text": "We wanted a classic camera to use on a recent Disney vacation as our phone batteries drain so quickly. This camera worked incredibly well! The pictures are sharp and true to color, it travels easily, and the battery has a decent amount of life (we did get an extra that we would switch out). I do recommend getting a large memory card. Overall very happy with it and plan on using it whenever a camera phone or a large DSLR isn't quite convenient.",
      "rating": 5.0,
      "verified": true,
      "author": "A. McCain",
      "helpful_votes": 0,
      "publication_date": 20150306
    },
    {
      "title": "Has worked for what we needed so far",
      "text": "So far it seems to work well, got it for my daughter for Christmas. She has only used it minimally so not sure that all the capabilities work as expected. But so far so good.",
      "rating": 4.0,
      "verified": true,
      "author": "Brandon Doucet",
      "helpful_votes": 0,
      "publication_date": 20180104
    },
    {
      "title": "Hard to believe that Canon would produce such an unsatisfactory product.",
      "text": "Very disappointing . No instruction booklet , confusing operation , and continual interference of light on viewing screen in all situations .",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180413
    },
    {
      "title": "Battery dies super fast even with new batteries",
      "text": "Battery dies super fast even with new batteries .. And it has a really hard time focusing. Upsetting ..",
      "rating": 1.0,
      "verified": true,
      "author": "Hong-Cindy",
      "helpful_votes": 6,
      "publication_date": 20150807
    },
    {
      "title": "Awesome Vlog Camera for YouTube!!",
      "text": "I absolutely love this camera! I am able to record in high light very well. I have been using this camera for most of my vlogs on YouTube. If you want to see what the camera looks like, come check out my videos. The only time when the camera gets fuzzy is in low-light settings or at night. I am not sure yet if I can fix that, but when there is enough light in a room or outside, it seems to be okay. If anyone has a fix to the low-light being super pixelated, let me know! Youtube Link: www.youtube.com/c/EliCypert",
      "rating": 5.0,
      "verified": true,
      "author": "Elias",
      "helpful_votes": 0,
      "publication_date": 20150731
    },
    {
      "title": "Abominable Canon product support",
      "text": "Bought this about a year ago. Seemed to work fine until recently. Now any picture I take looks fine on the camera screen, but the proportions are way off when downloaded to computer. Couldn't find an answer in the user manual. Then I tried to check with Canon product support. I probably typed Canon ELPH 340 HS a dozen times, always leading to a dead end. I would give this camera a higher rating if it was possible to get information from Canon. Their support site is FRUSTRATION, FRUSTRATION, FRUSTRATION.",
      "rating": 2.0,
      "verified": true,
      "author": "Lyle",
      "helpful_votes": 0,
      "publication_date": 20160405
    },
    {
      "title": "Nice camera - vastly superior indoors and out over any of our cell phones!",
      "text": "Nice camera. I did a lot of research for a smallish camera that would be easy to carry in a pocket but still get good pictures and have a good optical zoom. Not perfect pictures compared to the big guns out there but vastly superior indoors and out over any of our cell phones.",
      "rating": 5.0,
      "verified": true,
      "author": "Bob Y. from Redding",
      "helpful_votes": 0,
      "publication_date": 20170123
    },
    {
      "title": "Catches that Moment",
      "text": "I've become a Canon loyalist. All these ELPH cameras are easy to work and always get great shots. If you are active with your kids and want to catch a moment in life this is a tool to have. Drops in a day pack or jacket pocket, always ready. There are a lot of options on the program so spend a little time getting to know it and you won't be sorry.",
      "rating": 4.0,
      "verified": true,
      "author": "Wynn44",
      "helpful_votes": 0,
      "publication_date": 20160717
    },
    {
      "title": "Noisy as a Heavy Metal Band Concert",
      "text": "Canon has really disappointed me with this camera. Unless you are in direct sunshine, every picture you take is guaranteed to be noisy/grainy. The zoom is also not nearly as good as it was hyped up to be. If you try to zoom in on anything, the picture instantly becomes worthless and grainy beyond belief. If you are looking for quality photos, go elsewhere.",
      "rating": 2.0,
      "verified": true,
      "author": "JulieAnne",
      "helpful_votes": 4,
      "publication_date": 20150404
    },
    {
      "title": "Great for concert snaps",
      "text": "I bought this specifically to take concert photos with and it has done as well as I had hoped. First, Robert Plant at the Riviera, then the Afghan Whigs at the Metro and most recently Placebo at the Hose of Blues. The shots are clear in low light. It has a good zoom and anti-shake feature which helps a lot. I'm happy with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Edward Maczka",
      "helpful_votes": 5,
      "publication_date": 20141026
    },
    {
      "title": "One of the best",
      "text": "I've owed Canon products for years and this has to be one of the best. Light weight, compact and chrystal clear pictures are just a few of the rewards you will have when you purchase this gem. Canon, as usual GREAT JOB ! Oh and by the way you don't have to be a rocket scientist to operate it.",
      "rating": 5.0,
      "verified": true,
      "author": "LA",
      "helpful_votes": 2,
      "publication_date": 20140606
    },
    {
      "title": "Goes anywhere, takes great pics.",
      "text": "This is the perfect camera for a traveler who doesn't want to be bothered about camera settings. It's small enough that you can shove it in a jacket pocket or purse,and it takes great pictures all by itself (if you set it on automatic). After my first ELPH, I bought a Nikon and it was so much bulkier and complicated that I bought myself another ELPH.",
      "rating": 5.0,
      "verified": true,
      "author": "Lex",
      "helpful_votes": 0,
      "publication_date": 20150509
    },
    {
      "title": ") this is a sweet little camera",
      "text": "Once you figure out where all the settings are hidden (and they are actually quite convenient once you find them!) this is a sweet little camera. I might want a little more control, but it is really effective. Haven't used the network feature yet, but already enjoyed taking shots for home and work and like the quality. The low light hand held shots are much better than my previous Canon Elphs (this is my second Elph and third Canon Powershot in the last 12 years or so) so I really have nothing to complain about. And my daughter loves the color!",
      "rating": 5.0,
      "verified": true,
      "author": "A Mishra",
      "helpful_votes": 0,
      "publication_date": 20150426
    },
    {
      "title": "The Best Camera to Own!",
      "text": "This is a great camera for its size with so many new features which replaced my 9 year old canon elph and cost me $400.00 which is still working. My new canon is only $149.00 and gives me Super sharp pics and simple to use Perfect for everyday use and if u like to travel for a quick point and shoot! You can't go wrong with this top brand name",
      "rating": 5.0,
      "verified": true,
      "author": "Kathy",
      "helpful_votes": 0,
      "publication_date": 20150608
    },
    {
      "title": "I loved this camera for daily vlogging",
      "text": "I loved this camera for daily vlogging, until it completely broke less than a year later. The lens wouldn't retract anymore and the screen completely went black. It wasn't dropped, or mishandled. It worked in the morning, and by afternoon was done-zo! The only complaint i had from day was was the annoying buzzing noise in the background of videos. Theres no way around it.",
      "rating": 3.0,
      "verified": true,
      "author": "kateyandfamily",
      "helpful_votes": 0,
      "publication_date": 20151204
    },
    {
      "title": "Top quality point and shoot",
      "text": "Great point and shoot camera that has a much better picture quality than a smartphone. It's even a Consumer Reports Best Buy which was a deciding factor for me. It's hard to beat Canon's reputation for reliability.",
      "rating": 5.0,
      "verified": true,
      "author": "Hopkins",
      "helpful_votes": 2,
      "publication_date": 20150521
    },
    {
      "title": "Love it! Small and light weight but took awesome ...",
      "text": "Love it! Small and light weight but took awesome pictures on our cruise both inside and outside. Easy to use. Used this instead of my larger and heavier camera. Fits easily into a pants or jacket pocket. My husband used it and mostly kept it in a case attached to his belt. Much better pictures than from iPhone but about same size.",
      "rating": 5.0,
      "verified": true,
      "author": "Judith Rowland",
      "helpful_votes": 2,
      "publication_date": 20150321
    },
    {
      "title": "Incredible pocket camera",
      "text": "If you want a giant killer camera you can carry around in your pocket this is your best choice at this time, in my opinion. Technology moves quickly these days, so look for newer models that replace this one. There's not much you could wish a camera could do and do them easily that this camera doesn't do...",
      "rating": 5.0,
      "verified": true,
      "author": "B. Entrekin",
      "helpful_votes": 0,
      "publication_date": 20150415
    },
    {
      "title": "Love it!",
      "text": "Oh! I loved this camera with all my heart. Perfect pictures and so many kinds of features! I would totally recommend it. So sad it fell on the lens... never try fixing a camera by yourself... lens are sensitive... but I love this camera!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Mia",
      "helpful_votes": 0,
      "publication_date": 20160217
    },
    {
      "title": "Canon 340 HS Digital camera",
      "text": "Very nice camera, simple to use. Takes good, clear pictures. HD video is great. Takes clear movies and good sound. I also have a Canon 320 and they have similar features. The zoom is stronger on the Canon 340. Good price and free shipping. Received the camera in a few days. Easy and simple to use. Takes good pictures with flash.",
      "rating": 5.0,
      "verified": true,
      "author": "Marilyn K. Teigen",
      "helpful_votes": 4,
      "publication_date": 20140710
    },
    {
      "title": "Great Camera, But hard To Hook Up To Wi-Fi",
      "text": "Camera takes very sharp pictures. Small and easy to carry. It is a pain to get hooked up to the internet through Wi-Fi though. I have not been able to get the camera to recognize my computer so I could not wirelessly download pictures directly to my computer. I had to upload them to the Canon website and then to my computer, which is a pain. Other than that the camera is great!",
      "rating": 4.0,
      "verified": true,
      "author": "Bruce B.",
      "helpful_votes": 0,
      "publication_date": 20140709
    },
    {
      "title": "Really nice camera",
      "text": "I bought this as a gift for my wife who is the camera person in the family. She researched and this is the product she chose. I think she had some difficulty downloading software and getting the wireless all set up and working, but the camera takes awesome pictures and has plenty of functionality for a point and shoot.",
      "rating": 4.0,
      "verified": true,
      "author": "S. Whitworth",
      "helpful_votes": 0,
      "publication_date": 20141110
    },
    {
      "title": "My girlfriend is very happy with this camera",
      "text": "My girlfriend is very happy with this camera. I've been an ELPH fan for a while, and just wish that it was a little smaller. 16MP isn't that great, and the ELPH seems to be getting bigger. Canon is a quality brand though, and I'm still very happy with the production of the photos.",
      "rating": 4.0,
      "verified": true,
      "author": "Craig Jacoby",
      "helpful_votes": 0,
      "publication_date": 20150820
    },
    {
      "title": "So far so good",
      "text": "I'm giving this four stars because I've only had it for about a month, but so far it has exceeded my expectations. We've used it indoor and outdoor and I'm pleased with the quality of the images. My toddler is a quick mover and with our old camera, all of his pictures were a bit blurry. But, this one captures them fast and I can move on to the next shot quickly. So, I'm really pleased with this camera.",
      "rating": 4.0,
      "verified": true,
      "author": "arc619",
      "helpful_votes": 0,
      "publication_date": 20150529
    },
    {
      "title": "Good But Not as Fast as Hoped",
      "text": "I got this new camera to replace an older Canon Elph that was too slow between shots. Reviews of the 340 HS touted its quick recovery time between shots. While it is faster than our older Canon, it is not the speed I was hoping for or expected based on the reviews. Still it is a very good, compact point and shoot camera with a lot of nice features that I have yet to use.",
      "rating": 4.0,
      "verified": true,
      "author": "RMcI",
      "helpful_votes": 0,
      "publication_date": 20150104
    },
    {
      "title": "Decent but not \"special\"",
      "text": "It is a decent point and shoot camera but the price is high. Unfortunately i needed this specific model for a very particular application. The manual should have more info on how to correctly use the wifi to download images a pc.",
      "rating": 4.0,
      "verified": true,
      "author": "Leonardo",
      "helpful_votes": 0,
      "publication_date": 20161128
    },
    {
      "title": "The 2nd Generation ELPH for me is great!",
      "text": "This is the 2nd ELPH Camera I have owned, with the 1st one being purchased in 2007 while serving in the Army in Iraq during Operation Iraqi Freedom. The size and capabilities was perfect then for me and assisted with some treasured memories from an otherwise troublesome time, and this one the ELPH 340 has done equally as well. I definitely like it and use it often.",
      "rating": 4.0,
      "verified": true,
      "author": "Winford Fowlkes",
      "helpful_votes": 0,
      "publication_date": 20170114
    },
    {
      "title": "Good camera, good pictures",
      "text": "Good camera, good pictures. Comfortable in use. But Wi-Fi is useless in practice because it is very complicated for ordinary users. It is much more simple just to take memory card from camera, put it into PC or tablet slot and copy everything you want. Reading the manual of wi-fi pairing leads to great head ache.",
      "rating": 4.0,
      "verified": true,
      "author": "sergey samoylov",
      "helpful_votes": 0,
      "publication_date": 20150820
    },
    {
      "title": "Excellent point-and-shot camera!",
      "text": "I was devastated (well, certainly sad) when my old camera broke, so after a lot of research I decided on this one, and I love it!!! The purple color is beautiful and it takes great pictures. Love the big zoom and the wifi - which I've found to work very well!",
      "rating": 5.0,
      "verified": true,
      "author": "Rach9276",
      "helpful_votes": 0,
      "publication_date": 20160610
    },
    {
      "title": "Very easy to use camera",
      "text": "Very easy to use camera. Nice features. The only down side for me is there is no setting (or maybe I have not found it yet) to have the flash on all the time. The auto program feature sometimes does a bit too,much. The flash recharge time is a bit long......but it works great for what I want it for.",
      "rating": 4.0,
      "verified": true,
      "author": "Shirvan Ramjit",
      "helpful_votes": 4,
      "publication_date": 20140916
    },
    {
      "title": "Had High Hopes",
      "text": "I had bought this camera to replace an older Canon camera that I loved. This is a good camera, but there were some issues that I came upon that were just not what I needed - doesn't seem to have a fast enough capture for my needs.",
      "rating": 3.0,
      "verified": true,
      "author": "Emily E Heape",
      "helpful_votes": 0,
      "publication_date": 20161101
    },
    {
      "title": "It’s good",
      "text": "It is a good camera. Inside lighting causes pics to not be bright and clear, but good value.",
      "rating": 5.0,
      "verified": true,
      "author": "Cindy D.",
      "helpful_votes": 0,
      "publication_date": 20180721
    },
    {
      "title": "Good camera",
      "text": "Good camera. It is so small I have difficulty holding it (arthritis) so I always loop the carry strap around my wrist. Takes good pictures. I haven't used the video or the Wi-Fi yet. Not so easy to use, I have to keep the directions nearby.",
      "rating": 4.0,
      "verified": true,
      "author": "mamaw211",
      "helpful_votes": 0,
      "publication_date": 20150327
    },
    {
      "title": "Great Canon",
      "text": "Awesome camera! Takes great pictures. It's very user friendly! I've had many canon cameras and they just get better and better every time! Last a long time, only want to replace for upgrades and new features. The bluetooth features on this camera are really awesome and easy to use. We used the phone button to take family pictures this Christmas and no one had to run to get back into the shot! Definitely would recommend this camera to anyone!",
      "rating": 5.0,
      "verified": true,
      "author": "Lori Martin",
      "helpful_votes": 0,
      "publication_date": 20141228
    },
    {
      "title": "Love the ELPH",
      "text": "This was a slight upgrade from my old Canon digital which was misplaced. Really great high res photos in any light. I use it for merchandising online.",
      "rating": 5.0,
      "verified": true,
      "author": "geneva",
      "helpful_votes": 0,
      "publication_date": 20150823
    },
    {
      "title": "Fine camera--connecting to wireless a challenge.",
      "text": "Fine camera but connecting it to wireless was VERY DIFFICULT. Took several sessions with Canon tech support supervisors and finally with a live computer expert. Problem was identifying and downloading the required Canon software into the computer and finding it once there. Basic problem is sketchy and inadequate wireless connection explanations in the manual. Unfortunately this camera has no hardwire port of any kind so wireless is the only option, short of removing the chip and transferring into computer IF the target computer has the proper chip access port.",
      "rating": 4.0,
      "verified": true,
      "author": "Fred James",
      "helpful_votes": 0,
      "publication_date": 20150527
    },
    {
      "title": "Great camera !",
      "text": "My old digital camera that I'd been using for 10 year finally died, well the flash died. This little camera delivers BIG time. Easy to use, picture quality is excellent. I would highly recommend this camera to anyone who wants and easy to use camera.",
      "rating": 5.0,
      "verified": true,
      "author": "Trekincat",
      "helpful_votes": 0,
      "publication_date": 20151220
    },
    {
      "title": "The pictures turn out great! I love this camera for pictures",
      "text": "The pictures turn out great! I love this camera for pictures. I also bought it to take short video clips. I use a professional lighting system in my living room and the video comes out a bit grainy. I wish I had gone for a camera that records in 60 fps. But, the great pictures it takes is worth it!",
      "rating": 4.0,
      "verified": true,
      "author": "Morgan",
      "helpful_votes": 0,
      "publication_date": 20150822
    },
    {
      "title": "Five Stars",
      "text": "Terrific point and shoot that fits in my pocket and is always available.",
      "rating": 5.0,
      "verified": true,
      "author": "grandma darlene",
      "helpful_votes": 0,
      "publication_date": 20180326
    },
    {
      "title": "Spent a lot of time looking for the best small camera.  The elph might be the very best.",
      "text": "Cannon cameras are really nice, wish the manual had come with it.",
      "rating": 5.0,
      "verified": true,
      "author": "#1",
      "helpful_votes": 0,
      "publication_date": 20180413
    },
    {
      "title": "Good camera and versital",
      "text": "Great little camera. Nice size for a pocket or a purse. Takes great pictures. Nice zoom range. Also, didn’t buy it with the idea of taking any video but the video capability is a good addition and the video quality is better than I would have thought.",
      "rating": 5.0,
      "verified": true,
      "author": "bugeater",
      "helpful_votes": 0,
      "publication_date": 20150818
    },
    {
      "title": "The WiFi connection option is a great feature",
      "text": "Fairly easy to use and takes very good pictures. My wife likes the ease of use and I like the WiFi connection to my computer for quick download. the Canon software is a download, so be prepared to take care of that if you want to use the WiFi feature.",
      "rating": 4.0,
      "verified": true,
      "author": "GWS III",
      "helpful_votes": 0,
      "publication_date": 20150824
    },
    {
      "title": "Great camera, great quality pictures",
      "text": "Great camera, great quality pictures. Unfortunately the camera was dropped a few weeks after I got it but I liked the camera so much I bought another. There is a lot of options that can be used but if you want to just take simple picture you can do that too.",
      "rating": 5.0,
      "verified": true,
      "author": "T. Gerry",
      "helpful_votes": 0,
      "publication_date": 20150616
    },
    {
      "title": "Great camera, but the new switch on the top",
      "text": "Great camera, but the new switch on the top, very near to the exposition button is not very clever. Very easy to switch over to unwanted mode. A pity that the battery from my older Canon PowerShot doesn't fit, got to trash it even the charger, notwithstanding the underwater housing.",
      "rating": 4.0,
      "verified": true,
      "author": "Lajos J. Hajdu",
      "helpful_votes": 0,
      "publication_date": 20141216
    },
    {
      "title": "Handy little camera",
      "text": "I take a lot of pictures while going down the road. This camera captures good, clear pictures 9 times out of 10. It will fit in a pocket easily.",
      "rating": 5.0,
      "verified": true,
      "author": "uwhunter",
      "helpful_votes": 0,
      "publication_date": 20200220
    },
    {
      "title": "This is a nice point and shoot camera",
      "text": "This is a nice point and shoot camera. It takes great photos. The operation is a bit complex, as are most digital cameras. My only difficulty was setting up Wi-Fi link to upload the photos, and that is only only method provided to offload the photos.",
      "rating": 4.0,
      "verified": true,
      "author": "F Pare",
      "helpful_votes": 0,
      "publication_date": 20150523
    },
    {
      "title": "Good travel camera",
      "text": "I got this camera to have a small camera that is easy to take with me on the go. Fits in my jeans pocket and starts up quick. The only down side (and reason why I give it 4 stars instead of 5) is that the screen looks really grainy and the colors over saturated, but when I take photos the photos looks amazing and the colors are nice. Not sure if I have my settings wrong for the LCD.",
      "rating": 4.0,
      "verified": true,
      "author": "desphotography",
      "helpful_votes": 12,
      "publication_date": 20140615
    },
    {
      "title": "Good little camera.",
      "text": "Easy to use. Takes good pics. Only dig I would give it is the lack of a USB connection. They only way to xfer pics to your computer is wi-fi, at least as far as I have discovered yet. I think this was the only camera Consumer Report rated well in the point and shoot class that is under $200.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20150112
    },
    {
      "title": "Good for the price",
      "text": "For the price, it's a pretty good camera. I'm not overly impressed with the pictures, but it does well enough. It's very dependent on the lighting. It doesn't do well in either dark or bright conditions. Again, it's good enough, just not impressive.",
      "rating": 4.0,
      "verified": true,
      "author": "Nick Schader",
      "helpful_votes": 0,
      "publication_date": 20150608
    },
    {
      "title": "Returned for something better",
      "text": "I decided to return this camera because the quality wasn't that much greater than my cellphone and I really wanted a flip screen point and shoot camera. It's a nice light weight camera and I like the wifi benefits but I ended up biting the bullet and purchased the Canon G7X instead.",
      "rating": 3.0,
      "verified": true,
      "author": "Bell",
      "helpful_votes": 0,
      "publication_date": 20150829
    },
    {
      "title": "Love!",
      "text": "Love purple so i just couldn't resist this camera. its so much more high tech then my last cannon purchase some years ago. I'll have to figure out how to use the cool wifi print feature!",
      "rating": 5.0,
      "verified": true,
      "author": "Aaisha Brown",
      "helpful_votes": 0,
      "publication_date": 20160204
    },
    {
      "title": "I would purchase as a gift!",
      "text": "Excellent camera for pint and shoot.,The multiple option is great for grand kids that move fast. You will not miss a shot! I also shot pelicans flying above the beach! The battery charges fast. Many improvements from the similar camera I had from 2006.",
      "rating": 5.0,
      "verified": true,
      "author": "Dianne Currans",
      "helpful_votes": 4,
      "publication_date": 20141129
    },
    {
      "title": "Great pictures, great functions, easy to use!",
      "text": "Love this camera. I'm not a big reviewer and havent had a chance to use it that much but so far it has completely met my expectations. Love the multiple capture setting that creates different tones and finishes. So easy my boyfriend who cant take a good picture to save his life now does! I'm able to be in front of the camera instead of always behind it now!",
      "rating": 5.0,
      "verified": true,
      "author": "Callie",
      "helpful_votes": 0,
      "publication_date": 20141118
    },
    {
      "title": "It is an easy pocket size digital camera to use",
      "text": "I had to quickly replace my previous camera before going on vacation. I haven't printed pictures yet. But reviewing them seem very clear. It is an easy pocket size digital camera to use. So far, very happy with the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Stacy",
      "helpful_votes": 0,
      "publication_date": 20140711
    },
    {
      "title": "this camera is great for video (my main use)",
      "text": "With just one exception, this camera is great for video (my main use). Nice wide-angle, lots of zoom for a pocket-cam, good low-light contrast, 30.mins video recording time at 720P (maybe 17-mins at 1080P). Downside is low-light-FOCUSING is weak.. during low-light videos it sometimes has trouble finding what to focus on, and goes a bit blurry. Non-issue for normal videos. And low-light contrast quite good for it's size. The mic (for recording audio) cannot handle loud sounds (like filming loud bands), but not much worse than other pocket-cams (or iPhones for that matter). Way better pictures than smartphones. Good overall picture quality. Overall good for pictures and videos.",
      "rating": 5.0,
      "verified": true,
      "author": "roseman",
      "helpful_votes": 4,
      "publication_date": 20141013
    },
    {
      "title": "Perfect",
      "text": "This was a Christmas gift but she loves it, the size is great so she can put in in the diaper bag and have it ready at any time. The pictures come out beautiful and it's very easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "muther",
      "helpful_votes": 0,
      "publication_date": 20150425
    },
    {
      "title": "It's the perfect size! Small enough to fit in your pocket ...",
      "text": "It's the perfect size! Small enough to fit in your pocket and nice and light-weight. Great for a beginner like myself, who loves taking photos! Plus all the added features and wifi to make using and downloading easy =)",
      "rating": 5.0,
      "verified": true,
      "author": "Shammrox",
      "helpful_votes": 0,
      "publication_date": 20150309
    },
    {
      "title": "great little camera for the price",
      "text": "great little camera for the price!!! the photos taken from this came are so much better then my iPhone 5",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20150418
    },
    {
      "title": "I am having the most fun with this camera",
      "text": "I am having the most fun with this camera! I am in love. It's easy to use and is taking great pictures. Love the wifi feature. Still figuring out features- it has so many!",
      "rating": 5.0,
      "verified": true,
      "author": "L. Shelton",
      "helpful_votes": 2,
      "publication_date": 20140819
    },
    {
      "title": "I don't use this camera everyday but's its really good for pictures/video",
      "text": "I don't use this camera everyday but's its really good for pictures/video. (not a huge camera person) Works well for me",
      "rating": 5.0,
      "verified": true,
      "author": "Troll Face",
      "helpful_votes": 0,
      "publication_date": 20170221
    },
    {
      "title": "horrible auto focus in video and a constant fan sound ...",
      "text": "grainy pictures, horrible auto focus in video and a constant fan sound in the audio. I'm super disappointed. I've used every powershot elph model and this is my LEAST favorite. sending back and getting a 330hs again.",
      "rating": 2.0,
      "verified": true,
      "author": "Marie",
      "helpful_votes": 0,
      "publication_date": 20141130
    },
    {
      "title": "Great little point in shoot for the non tech savy",
      "text": "Bought this for my mother-in-law who is not tech savy, she has no issues using it. There is a slight delay for the shutter but it takes great pictures. It's light and pocket size so it's easy to take any where.",
      "rating": 4.0,
      "verified": true,
      "author": "ByOilyDesign",
      "helpful_votes": 0,
      "publication_date": 20150729
    },
    {
      "title": "(went from 4x to 12x) Great lighting, sharp images and color",
      "text": "My wife loves it. This camera was purchased to replace an earlier model that just wore out. The size is small enough to be carried in her purse, yet. the telescopic ability is greater. (went from 4x to 12x) Great lighting, sharp images and color. Perfect!",
      "rating": 5.0,
      "verified": true,
      "author": "Handyman Charlie",
      "helpful_votes": 0,
      "publication_date": 20150117
    },
    {
      "title": "Five Stars",
      "text": "great little camera, use in my weight loss clinic !",
      "rating": 5.0,
      "verified": true,
      "author": "Susanna",
      "helpful_votes": 0,
      "publication_date": 20170303
    },
    {
      "title": "Great camera! I don't use the Wi-Fi feature so ...",
      "text": "Great camera! I don't use the Wi-Fi feature so I just use a card reader to upload photos to my computer. It takes really nice photos and has many options. The purple color is pretty cool too.",
      "rating": 5.0,
      "verified": true,
      "author": "rainbowlvr24",
      "helpful_votes": 0,
      "publication_date": 20160211
    },
    {
      "title": "Another winner from Canon",
      "text": "In my opinion Canon makes the best cameras in the world because they concentrate on the fundamentals rather than the latest gizmos. This camera is no exception. It has a good solid feel and takes great pictures at any setting. What more can you want from a 'point and shoot' camera.",
      "rating": 5.0,
      "verified": true,
      "author": "G.H.H.",
      "helpful_votes": 0,
      "publication_date": 20150903
    },
    {
      "title": "Screen broke within two months",
      "text": "Within two months the display broke without it ever being dropped/mistreated/etc. Tried to return it on Amazon, but apparently it is only eligible for return for one month. No option to return after that even for an obviously defective product. Besides that it worked fine, but now I'm left with a largely useless camera.",
      "rating": 1.0,
      "verified": true,
      "author": "Rebecca Balon",
      "helpful_votes": 0,
      "publication_date": 20151021
    },
    {
      "title": "Great Camera.",
      "text": "This was a present for my wife to replace the Cannon she has had for many years. She loves it and the great pictures she takes.",
      "rating": 5.0,
      "verified": true,
      "author": "larry dickson",
      "helpful_votes": 0,
      "publication_date": 20150828
    },
    {
      "title": "Very nice camera.",
      "text": "This was purchased as a gift and to date the user has had no issues with it. It seems to be pretty easy to use which was the main reason for purchasing this model. Don't let the smallness/compactness fool you. It's a very nice camera.",
      "rating": 4.0,
      "verified": true,
      "author": "Tabbie52",
      "helpful_votes": 0,
      "publication_date": 20140912
    },
    {
      "title": "I am not a camera expert although I would like to be",
      "text": "I am not a camera expert although I would like to be. I do know a good picture when I see it and this camera takes excellent pictures. It is a very good size for a vacation as it fits easily in a pocket or purse. I used it for a cruise vacation and am very pleased with the quality of the pictures. It captured beautiful views of a sunset over the ocean and many others.",
      "rating": 5.0,
      "verified": true,
      "author": "L. King",
      "helpful_votes": 13,
      "publication_date": 20141215
    },
    {
      "title": "Great pictures with this camera.",
      "text": "Takes great pictures. Replaced my Daughter's other camera that was similiar, but this battery/disk door is more durable and harder to break. Wife has an older model of the same thing.",
      "rating": 5.0,
      "verified": true,
      "author": "John Dappert",
      "helpful_votes": 0,
      "publication_date": 20141107
    },
    {
      "title": "Five Stars",
      "text": "camera has amazing features - now that i have it cant live without!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160806
    }
  ],
  "product_meta": {
    "title": "Canon PowerShot ELPH 340 HS 16MP Digital Camera (Black)",
    "description": "Style:Base| Color:Black| Product Packaging:Standard PackagingSlim and sleek with style to spare, the new PowerShot ELPH 340 HS camera is a creative force to be reckoned with. Its powerful 12x Optical Zoom puts you into the action from anywhere, ready to capture with the quality only Canon optics can deliver. Built-in Wi-Fi means you\"re always connected to your world, transferring images and video directly to popular social networking sites, mobile devices and your computer.\n\nFROM THE MANUFACTURER\n \n\nSTYLE THAT CONNECTS\nSlim and sleek with style to spare, the new PowerShot ELPH 340 HS camera is a creative force to be reckoned with. Its powerful 12x Optical Zoom puts you into the action from anywhere, ready to capture with the quality only Canon optics can deliver. Built-in Wi-Fi® means you're always connected to your world, transferring images and video directly to popular social networking sites, mobile devices* and your computer. You can also shoot remotely with a compatible smartphone or tablet** to easily capture group photos, and connect wirelessly to a compatible Android™ device*** with a simple touch using built-in NFC (Near Field Communication). The PowerShot ELPH 340 HS has Creative Shot mode, so you can discover the fun of creating artistic photos that are as unique as you are. The high-resolution 16.0 Megapixel High-Sensitivity CMOS sensor combines with the DIGIC 4+ Image Processor to create the Canon HS SYSTEM, giving you impressive image quality in all situations, including low light. And with advanced features like 1080p Full HD video in MP4 format, Hybrid Auto and Smart AUTO that recognizes 32 predefined scenes, the PowerShot ELPH 340 HS captures the excitement of your everyday life with style.\n\n* Compatible with iOS versions 6.0/6.1/7.0, Android smartphone versions 2.3.3/4.0/4.1/4.2/4.3 and Android tablet versions 4.0/4.1/4.2/4.3. Data charges may apply.\n** With the download of the free Canon CameraWindow app. This software enables you to upload images to social network services. Before uploading images, please be aware that image files may contain privacy-related information such as people and places. If necessary, please delete such information. Canon does not obtain, collect or use such images or any information included in such images through this software. \n*** Compatible with Android devices version 4.0 or later.\n\nSPECTACULAR LENS POWER FOR A WHOLE NEW PERSPECTIVE\n12X OPTICAL ZOOM\nThe PowerShot ELPH 340 HS features a 12x Optical Zoom so spectacular shots are within your reach. You'll love the flexibility it gives you when shooting with an amazing range of 25–300mm (35mm equivalent) in a slim, compact camera. Plus, the Wide-Angle lens captures expansive image in every shot, adding depth, perspective and grandeur. Landscapes, city scenes, family shots and more all benefit from the extra width. Whether you're shooting wide group shots or zooming to the telephoto end, your images are assured to be bright and clear.\n\nSHARE IMAGES AND VIDEO WHEREVER AND WHENEVER\nBUILT-IN WI-FI® MAKES SHARING QUICK AND EASY\nThe PowerShot ELPH 340 HS camera is equipped with built-in Wi-Fi® technology for on-the-go convenience when you want to share your photos and videos, keeping friends and family up to date as events unfold in real time. The camera can connect directly to both iOS® and Android™ devices*, and upload images via the free Canon CameraWindow app** without a computer. Easily post your images to social networking and media sites – Facebook®, Twitter®, YouTube™, Flickr® and now Google Drive™ – through CANON iMAGE GATEWAY# or save them to the online photo album to share anytime, anywhere. You can share your images with everyone or to selected groups, and even add comments. Sharing video is also easy with the PowerShot ELPH 340 HS, which records video in the easy-to-share MP4 format. The built-in Wi-Fi® technology on the PowerShot ELPH 340 HS also allows you to transfer images to other Wi-Fi® equipped PowerShot cameras or print your photos directly to a PictBridge (Wireless LAN) certified printer.\n\nOne-touch connection to your mobile device or computer is made possible on the PowerShot ELPH 340 HS with the camera's dedicated Mobile Device Connect Button. You can choose to transfer images to your smartphone or tablet for immediate sharing with the CameraWindow app**, or to your computer on the same network with Image Sync to make saving and organizing your images easier. When the camera finds a linked computer on the same wireless network, images are sent directly to it. Otherwise, images are temporarily stored on CANON iMAGE GATEWAY# then transferred once a connection is made, eliminating the need for cables.\n\nREMOTE SHOOTING\nWith the built-in Wi-Fi® on the PowerShot ELPH 340 HS, you can use your smartphone or tablet* to remotely control the camera. Simply connect wirelessly to your device and access the free Canon CameraWindow app**. Your device will show a live image of the camera's capture – perfect for a commemorative group photo, wildlife shots and all kinds of situations. The camera's powerful zoom, flash, self-timer and shutter are all under your control, with images being saved to your camera.\n\n* Compatible with iOS versions 6.0/6.1/7.0, Android smartphone versions 2.3.3/4.0/4.1/4.2/4.3 and Android tablet versions 4.0/4.1/4.2/4.3. Data charges may apply.\n** This software enables you to upload images to social network services. Before uploading images, please be aware that image files may contain privacy related information such as people and places. If necessary, please delete such information. Canon does not obtain, collect or use such images or any information included in such images through this software.\n# One-time registration is required on CANON iMAGE GATEWAY online photo album.\n\nSIMPLY TAP TO CONNECT\nBUILT-IN NFC (NEAR FIELD COMMUNICATION) FOR EASIER WI-FI® CONNECTIVITY\nThe PowerShot ELPH 340 HS camera supports NFC (Near Field Communication) technology, eliminating the need to find and open the Canon CameraWindow app* on your mobile device. Simply touch the NFC icon on your camera to your compatible Android device**, and the CameraWindow app will launch automatically for quick, easy sharing of your images. Built-in NFC technology also makes it simpler to install the app. If the app hasn't been installed yet, once you touch the devices together for the first time, the download screen will display automatically.\n\n* This software enables you to upload images to social network services. Before uploading images, please be aware that image files may contain privacy related information such as people and places. If necessary, please delete such information. Canon does not obtain, collect or use such images or any information included in such images through this software.\n** Compatible with Android devices version 4.0 or later.\n\nRETHINK PHOTOGRAPHY WITH CREATIVE SHOT\nCREATIVE SHOT MODE\nNot only is the PowerShot ELPH 340 HS a stylish powerhouse, the camera also enables you to easily create artistic images with Creative Shot mode. In Creative Shot mode, the camera captures the original composition and automatically produces and saves five additional variations by using advanced Canon technologies to apply any of 46 filter options based on the individual scene, subject and exposure. Filter choices are grouped into Retro, Monochrome, Special and Natural categories to make exploring the world of artistic photography fun and easy, or you can simply select Auto to access the full range of effects. With Creative Shot mode, the result is stunning artistic photos that are perfect for sharing.\n\nBEAUTIFUL IMAGES AND INCREDIBLE PERFORMANCE START HERE\n16.0 MEGAPIXEL HIGH-SENSITIVITY CMOS SENSOR\nThe PowerShot ELPH 340 HS camera is equipped with a 16.0 Megapixel High-Sensitivity CMOS sensor to make even your everyday photography remarkable. The highest resolution CMOS sensor used in any PowerShot camera, the sensor takes in more light, so images are clear and beautifully detailed. High ISO shots are particularly impressive, with less noise and expanded dynamic range. And the 16.0 Megapixel resolution gives you the flexibility to be more creative with your shots: crop and enlarge any part of an image – you can be confident that the detail and resolution you need are there.\n\nDIGIC 4+ IMAGE PROCESSOR\nThe new Canon DIGIC 4+ Image Processor powers the PowerShot ELPH 340 HS camera's advanced functions and capabilities, including Hybrid Auto, Creative Shot, and Full HD video shooting at 30p in the easy-to-share MP4 format. Its accelerated processing speed creates fast, responsive performance, for a shooting experience that's easy and natural. The DIGIC 4+ Image Processor also enhances image quality in several ways. Processing of high ISO shots has been shortened by 60% compared to the DIGIC 4 Image Processor. This significantly reduces noise for brilliant color, smooth gradations, and beautiful detail even in low light. The processor also allows for the integration of electronic Dynamic IS. This advanced system compensates for multiple motion types, effectively preventing angular blur, shift blur, and blur caused by parallel movement and tilt shift. The result is images that are reliably sharp and clear at all lengths of the camera's powerful zoom. The processor's highly efficient design also extends battery life.\n\nCANON HS SYSTEM HELPS PROVIDE EXCELLENT LOW-LIGHT PERFORMANCE\nPacked in the slim body of the PowerShot ELPH 340 HS camera is the power to create images full of spectacular depth, detail and emotional resonance with the renowned Canon HS SYSTEM – a combination of the camera's 16.0 Megapixel High-Sensitivity CMOS sensor and the new DIGIC 4+ Image Processor. With the Canon HS SYSTEM, you'll experience excellent tracking performance even in low light, and achieve gorgeous still image quality at ISO speeds up to ISO 3200; beautiful low-light shots are possible with minimal noise and maximum detail in highlight and shadow areas.\n\nGET THE COMPLETE HD EXPERIENCE\nCAPTURE STUNNING 1080P FULL HD VIDEO WITH A DEDICATED MOVIE BUTTON\nThe PowerShot ELPH 340 HS not only preserves your memories in video with spectacular realism, but does it in a format that makes them easy to share. You can simply touch the dedicated movie button to start and stop video recording, so you're always ready to capture the moment as it happens. The camera records in stunningly realistic 1080p Full HD, so even when played back on a big-screen HDTV, your videos are crystal clear, with smooth action and beautifully natural color. On the PowerShot ELPH 340 HS, video can be captured at 30 frames per second in MP4 format. MP4 videos are perfectly sized for quick online sharing – whether you're showing friends and family what you have been up to or posting status updates on social networking sites.\n\nSHARE WITH A SINGLE TOUCH\nMOBILE DEVICE CONNECT BUTTON\nIt's now easier than ever to connect your PowerShot ELPH 340 HS camera to an iOS® or Android™ device* using the Mobile Device Connect Button. The button allows you to choose to transfer images to your smartphone or tablet for immediate sharing with the CameraWindow app**, or to your computer on the same network with Image Sync to make saving and organizing your images easier. Once your device is registered on the camera, simply press the Mobile Device Connect button for easy connection.\n\nBy connecting to a smartphone with the CameraWindow app using the Mobile Device Connect Button, you can browse and share images while still leaving the camera inside a bag. It is also possible to turn off the PowerShot ELPH 340 HS quickly and easily, directly from a smartphone. Once your camera is linked to your computer on the same wireless network, you can automatically transfer images to it, for easy saving and organizing of your photos. The Mobile Device Connect Button is great for quick and easy sharing from a fun day out with friends and family.\n\n* Compatible with iOS versions 6.0/6.1/7.0, Android smartphone versions 2.3.3/4.0/4.1/4.2/4.3 and Android tablet versions 4.0/4.1/4.2/4.3. Data charges may apply.\n** This software enables you to upload images to social network services. Before uploading images, please be aware that image files may contain privacy related information such as people and places. If necessary, please delete such information. Canon does not obtain, collect or use such images or any information included in such images through this software.\n\nREMEMBER THE DAY IN CRISP HD\nHYBRID AUTO\nThe PowerShot ELPH 340 HS camera features Hybrid Auto, which records up to four seconds of video every time you shoot a still image, then automatically joins the clips and pictures* into a video that captures the essence of special days: vacations, important occasions, or any time you're shooting many shots in a day. With Hybrid Auto, this “highlight reel” is stunningly beautiful. Hybrid Auto automatically recognizes the scene and optimizes camera settings to capture the highest possible image quality. The resulting 720p HD video is properly exposed, crisp and steady.\n\n* Pictures can be withheld from the resulting video via menu settings.\n\nA SMARTER CAMERA MEANS BETTER PHOTOS AND VIDEOS\nSMART AUTO\nSophisticated Canon technology that makes getting that great shot as simple as pressing the shutter button, Smart AUTO automatically detects scenes by assessing various factors in both the background and the subject. On the PowerShot ELPH 340 HS, detected scenes are analyzed using 32 predefined shooting situations. The camera then makes optimal settings to ensure the best possible image capture, whether you're shooting stills or video. Smart AUTO also includes Advanced Subject Detection, which allows the camera to detect and track non-human moving subjects like animals and vehicles. With Smart AUTO, all you have to do is frame your shot and capture away.\n\nSHOOTING MODES/SPECIAL SCENE MODES\nSmart AUTO The camera automatically selects the best shooting settings for optimal quality based on subjects and environmental factors to provide point-and-shoot simplicity. Movie Digest & Hybrid Auto Automatically selects shooting settings for optimal quality and records a video clip every time you capture a still image. One day's worth of clips are then combined into a single video. Program The camera automatically and intelligently selects the aperture/shutter speed combination based on the shooting conditions. Creative Shot Analyzes the scene and applies a number of creative filters to automatically create five variations in addition to the original image. Portrait Brings the subject into focus while beautifully blurring the background. Smart Shutter The camera automatically takes the photo when people smile, wink, or get into frame. High-Speed Burst Captures rapid action frame by frame, by shooting continuously at a high speed while the shutter button is held down. Handheld Night Scene Take clear and steady pictures at night without the use of a tripod. Low Light For high quality image capture in an amazing range of dimly lit situations. Fisheye Effect Now you can get the fisheye effect – a classic photographic distortion – without a fisheye lens. Miniature Effect Give images a miniature look with an effect that emphasizes perspective by blurring the top and bottom of the image. Toy Camera Effect Simulates photos taken with “toy” or pinhole cameras, darkening the image at the edges to create a vignette effect. Monochrome Choose from three single-tone effects: Black-and-White, Sepia, or Blue. Super Vivid Super Vivid intensifies existing hues, saturating the scene with bright colors. Poster Effect Poster Effect combines several similar shades into one color, turning subtle gradations into eye-catching, scene-popping contrasts. Snow Shoot clear snow scenes without darkened subjects or an unnatural bluish tint. Fireworks Create brilliant images of skyrocketing fireworks. Long Shutter Use to blur moving subjects for artistic effect, ideal for urban night photography. Movie Record video in stereo sound. Unwanted scenes can be deleted in playback mode. Actual results may vary from examples shown above.\nFinal image may vary depending on picture composition.\n\nADDITIONAL FEATURES\nINTELLIGENT IS\nIt's easy to capture clear, steady images with the PowerShot ELPH 340 HS, even in low light without using a tripod. That's because the camera is equipped with Canon's innovative Intelligent IS. The system automatically analyzes camera movement and applies the best shake correction method for the shooting situation – allowing you to focus on framing and capturing your shot. For stills, the system selects from Normal IS, Panning IS, Macro (Hybrid) IS and Tripod modes. When shooting video, the system selects from Dynamic IS, Powered IS, Macro (Hybrid) IS and active Tripod IS modes. New icons clearly mark the image stabilization mode, whether you're shooting still images or video.\n\nStill Image Shooting Normal IS Corrects for a wide range of camera movement when shooting stills. Panning IS Panning motion is detected so that IS does not interfere with desired camera movement. Macro (Hybrid) IS Corrects for shift-type camera shake, which typically occurs in macro (close-up) shooting. Tripod When tripod use is detected, the Image Stabilizer is stopped because it is not needed. Video Recording Dynamic Effective for video shooting at wide-angle focal lengths, eliminating the unwanted shaking that typically occurs while walking. Powered Compensates for hand movement when shooting video at the telephoto end of the zoom range, where camera shake is magnified. Macro (Hybrid) IS Corrects for motion blur that is likely to occur when shooting video while walking. Also compensates for the shift-type camera shake common in macro shooting. Active Tripod IS When shooting video while using a tripod, the image stabilization is active to compensate for slight camera shake. ECO MODE\nThe PowerShot ELPH 340 HS features ECO Mode, which provides more shots per single charge through LCD monitor and camera power management. ECO Mode can be activated for easy power preservation when an outlet is unavailable or the moment is too exciting to put the camera down. The mode quickly wakes the camera from sleep when a button is pressed. With ECO Mode activated to conserve power, you can even stay connected for longer with the built-in Wi-Fi® featured on the camera. When the fun with family and friends runs late into the night, you can be assured your camera can keep up.\n\nEASILY PRINT YOUR FAVORITE MOMENTS\nIt's quick and easy to make beautiful prints from your PowerShot camera. With the built-in Wi-Fi® on your PowerShot camera, it's easy to send your images to a PictBridge (Wireless LAN) compatible printer. Or use the Direct Print system; simply connect your PowerShot ELPH 340 HS camera to a Canon PIXMA or SELPHY photo printer with a USB cable and press the button to print. Easily turn every favorite moment into an amazing photo.\n\nAVAILABLE IN 31 LANGUAGES\nThere are now a total of 31 display languages from which you can choose: English, German, French, Dutch, Danish, Finnish, Hebrew, Italian, Norwegian, Swedish, Spanish, Simplified/Traditional Chinese, Japanese, Russian, Portuguese, Korean, Greek, Polish, Czech, Hungarian, Turkish, Thai, Arabic, Romanian, Ukrainian, Farsi, Hindi, Malay, Indonesian and Vietnamese.",
    "rating": 4.3,
    "feature_bullets": [
      "12x Optical Zoom helps ensure outstanding optical performance and versatility.",
      "Built-in Wi-Fi allows wireless transferring of images and video to compatible mobile devices, select social networking sites and your Wi-Fi enabled computer, and lets you remotely shoot using your smartphone or tablet.",
      "16.0 Megapixel High-Sensitivity CMOS sensor with the DIGIC 4+ Image Processor creates the Canon HS SYSTEM, which helps provide excellent low-light performance.",
      "Creative Shot mode uses composition, color and lighting from your original image to create unique images with an artistic flair.",
      "Smart AUTO intelligently selects the proper camera settings based on 32 predefined shooting situations."
    ],
    "specifications": {
      "Product Dimensions": "3.93 x 0.88 x 2.27 inches",
      "Item Weight": "5.1 ounces",
      "ASIN": "B00HLDFNKQ",
      "Item model number": "9344B001",
      "Batteries": "Lithium Metal batteries required.",
      "Customer Reviews": "4.3 out of 5 stars589 ratings4.3 out of 5 stars",
      "Best Sellers Rank": "#67,571 in Electronics",
      "Is Discontinued By Manufacturer": "Yes",
      "Date First Available": "January 4, 2014",
      "Manufacturer": "Canon"
    },
    "categories": [
      "Electronics",
      "Digital Cameras",
      "Camera & Photo",
      "Point & Shoot Digital Cameras"
    ],
    "price": ""
  }
}