{
  "website_summaries": [
    {
      "verdict": "The BenQ GL2460HM is a capable 24-inch monitor that delivers a fast pixel response and inky blacks.",
      "pros": [
        "Vibrant colors",
        "Fast pixel response",
        "Dark blacks"
      ],
      "cons": [
        "Stingy feature set",
        "Weak speakers",
        "Narrow viewing angles"
      ],
      "aspects": {},
      "publication_date": 20141101,
      "rating": 6.0,
      "source": "pcmag"
    }
  ],
  "customer_reviews": [
    {
      "title": "You'll need speakers.",
      "text": "These are great monitors, but the speakers are really quiet. If you want any volume, buy the \"AmazonBasics USB-Powered Computer Speakers\" to go with this monitor. Those speakers are about $14, and they're great.",
      "rating": 5.0,
      "verified": true,
      "author": "Maverick York",
      "helpful_votes": 91,
      "publication_date": 20170805
    },
    {
      "title": "Very poor quality picture",
      "text": "There are what looks like compression artifacts even though the image looks perfectly fine on my other monitor. The color is also very unsaturated. I couldn't do anything to fix these issues even when using user settings and tinkering with saturation, contrast, brightness, gamma, etc.",
      "rating": 1.0,
      "verified": true,
      "author": "sophisticated finger",
      "helpful_votes": 22,
      "publication_date": 20180808
    },
    {
      "title": "Recommended",
      "text": "Wow. This monitor is something else. All i can say is for the price of this monitor its really really good! And my gaming has improved by so much with this thing!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 34,
      "publication_date": 20170507
    },
    {
      "title": "A Recreational Gamer, Web Surfer...This Could Not Cut It.",
      "text": "My Acer Monitor was going bad, so I wanted a cost effective replacement. Based on the reviews, this should have been the answer. However, once hooked up, the picture quality had a subtle blur and was just not sharp. For the several low tech games I play, it was even worse. My be fine for someone who does not need HD graphics, but was not for me. I am returning and I ordered the BenQ ZOWIE RL2455S 24 inch 1080p Gaming Monitor, which I am using now. A huge improvement for a small amount of extra cash. So low to mid-level gaming, as well as pictures and videos, take a pass here and go for the BenQ ZOWIE RL2455S.",
      "rating": 3.0,
      "verified": true,
      "author": "The Woj",
      "helpful_votes": 2,
      "publication_date": 20190528
    },
    {
      "title": "----Buyer Beware----",
      "text": "I am very disappointed. I read some bad reviews, but the overall rating for this monitor was alright. My expectations were not high b/c; I do not need a high-end monitor to suit my needs. However, I did need a monitor that worked. Once I began my initial use of the monitor, it started malfunctioning. First, it looked like pinstripes where throughout the screen, and then it just went blank. I turned it off/on, checked all the plugins, and such. It would work great for a few minutes and started it all over again. I am returning it. I'd rather pay more for a brand that I feel confident will work.",
      "rating": 1.0,
      "verified": true,
      "author": "Cassie",
      "helpful_votes": 2,
      "publication_date": 20200215
    },
    {
      "title": "Nice quality monitor (VESA-compatible)  Fast delivery",
      "text": "Need some monitors FAST.. Offers both VGA and HDMI ports Easily attachable base is sturdy and fell balanced.... Also removes completely for VESA mount to wall or arm. LOVE the fact that they have internal power supply so you plug in a standard computer power cord. NO wall wart, or proprietary power supply required. Simple and straightforward monitor for office or home use. May not be the best for gaming but great general purpose monitor. Good color, easy to set up.",
      "rating": 5.0,
      "verified": true,
      "author": "dc-in-md",
      "helpful_votes": 0,
      "publication_date": 20200319
    },
    {
      "title": "pretty good monitor with small flaws",
      "text": "Pros: I bought this monitor more than a year ago and it still held up with virtually no wear. Cons: Personally I don't really like how it looks from the back. Height / angle is not adjustable. built in speakers are not loud enough.",
      "rating": 4.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 3,
      "publication_date": 20190710
    },
    {
      "title": "Vertical white line and Customer service.",
      "text": "Bought the monitor in May 2020. Today, July 21 2020 the monitor developed a vertical white line 2/3 of the way across the screen. Went to the Benq website to fill out a repair ticket. Form fields were not identified so I had to guess at what went in them. Submitted form and website did not verify the submission. Contacted Amazon support and went through a great big runaround with phone numbers. Got an international # and a US # with too many digits. The Monitor worked fine up until now.",
      "rating": 2.0,
      "verified": true,
      "author": "Def",
      "helpful_votes": 0,
      "publication_date": 20200721
    },
    {
      "title": "It was a big disappointment to my nephew as it was my gift to ...",
      "text": "Returned the first one and the replacement does not work either. It was a big disappointment to my nephew as it was my gift to him. BENQ's support was no help at all.",
      "rating": 1.0,
      "verified": true,
      "author": "DCM",
      "helpful_votes": 5,
      "publication_date": 20180703
    },
    {
      "title": "I am very impressed with the screen quality of this monitor.",
      "text": "I have this monitor paired to an Intel i7 CPU and a RX580 black edition GPU and the monitor looks very good. While not 4k color and clarity are very good and I have no dead pixels. For the price of this monitor it is hard to find better in this class. I also have a higher end Viewsonic but I prefer to use this monitor daily especially the low blue light feature for reading and web browsing. I waited some months to review to make sure of the quality. If you are look for a good monitor in this price range this is the one to buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Norman A",
      "helpful_votes": 0,
      "publication_date": 20190111
    },
    {
      "title": "Gets the job done",
      "text": "It tilts up and down but has no height adjust. The internal speakers are quiet compared to generic desk speakers. I bought one of these in 2016 and another in 2017, which is the one I'm writing the review for. The newest one has a subtle yellow tint compared to the old monitor but you don't notice it in most cases. Don't bother trying to overclock this monitor, I immediately started having contrast and artifacting issues. Neither of these monitors have had any dead pixels so far.",
      "rating": 4.0,
      "verified": true,
      "author": "James W.",
      "helpful_votes": 2,
      "publication_date": 20190128
    },
    {
      "title": "It has great light distribution and easy on the eyes",
      "text": "The monitor is great- plenty of ways to customize the settings. Had to go into the settings and turn HDMI Auto Switch to OFF. It has great light distribution and easy on the eyes. Plenty of screen space to work on. The speakers are disappointing, but I figured as much. They work well for just viewing small videos for homework. If you want good sound, you'll need external speakers. Great monitor!",
      "rating": 5.0,
      "verified": true,
      "author": "S. Campbell",
      "helpful_votes": 2,
      "publication_date": 20180619
    },
    {
      "title": "Very good monitors but not the absolute best for gaming.",
      "text": "If you’re gaming in 1080p and have no desire to go higher than this monitor is a decent purchase. I bought two for my setup and love them coupled with a two monitor mount. I use one for Xbox, /PS4 and use a dvi to hdmi adapter to switch between the two systems.",
      "rating": 4.0,
      "verified": true,
      "author": "Peyton",
      "helpful_votes": 0,
      "publication_date": 20200524
    },
    {
      "title": "Owned for over two years...",
      "text": "I bought this monitor when I was building a computer over two years ago and have no regrets. It's been such a good monitor that I recently bought a second one for my husband who really needed an upgrade. I've had no issues with it and it's been great. It has a beautiful, high detail picture. I personally don't use the speakers, I have external speakers I use. My husband has been using the built in speakers of the monitor and said they are, \"Okay.\" They wouldn't be good for 3D sound or anything, but you get a clear sound to listen to through it. I would recommend the monitor 100%. I use it for gaming personally, and it's great.",
      "rating": 5.0,
      "verified": true,
      "author": "Extended Time of Ownership Reviewer",
      "helpful_votes": 0,
      "publication_date": 20181228
    },
    {
      "title": "NOT happy",
      "text": "the screen is fine but THE SPEAKERS ARE SO QUIET you literally hear nothing out of them even at 100 it’s like seriously whispers almost. you need to have speakers to plug in but unfortunately i do not have that and i didn’t use this monitor until i got to college MONTHS after buying! very upset",
      "rating": 1.0,
      "verified": true,
      "author": "salma ",
      "helpful_votes": 0,
      "publication_date": 20191106
    },
    {
      "title": "Leave the monitor on for at least 2 hours before using!",
      "text": "I was going to leave a bad review for the monitor because it came with a yellow tint. No amount of tinkering the settings was able to fix it. I was going to return it and had another monitor picked out, but when I came back to it a couple hours later, everything was fine! Maybe the pixels needed some time to \"warm up?\" I'm not too knowledgeable with hardware / physics so I cannot justify this phenomenon, but this screen is way better than my Asus monitor with the same specs!",
      "rating": 5.0,
      "verified": true,
      "author": "Lakshya",
      "helpful_votes": 0,
      "publication_date": 20180531
    },
    {
      "title": "Super monitor at a great value",
      "text": "What a great monitor. I have it hooked up to a Mac Mini using the hdmi port. I must say, when it first came on it was very bright and the text against it was very hard to read. The lesson is not to panic. The menu system is very easy to access on the side of the monitor. It is straight forward and easy to navigate and if you tweak the brightness, the contrast and the sharpness you can really fine tune the picture to your liking. With some patience I have my picture looking sharp and crisp. The quality of this monitor for $120.00 is amazing. I would definitely purchase another.",
      "rating": 5.0,
      "verified": true,
      "author": "Avery",
      "helpful_votes": 0,
      "publication_date": 20181005
    },
    {
      "title": "Are you still console gaming on a TV?",
      "text": "Stop it. Get a decent gaming monitor like this one. In literal hours my shots (COD) had reverted back to the glory days of my youth when l didn't have to strafe and pan across a massive 60\" widescreen TV. I had thought I'd only imagined being good at shooters, that it was a lie I'd fabricated and wholly believed to justify the thousands of hours spent calling kids nerds on XBL. But no, I WAS GOOD. My TV was just bad. Okay I'm still a little bad but not as bad since buying a BenQ 24 Inch 1080P gaming Monitor. TLDR: Great response, adequate frames, nice picture. Watch TV on your TV, play games on your gaming monitor.",
      "rating": 5.0,
      "verified": true,
      "author": "Mason",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "GREAT low cost monitor - LOVE BenQ",
      "text": "I bought 2 monitors on this order - shipped from 2 Amazon locations. These are my 5th & 6ht BenQ monitors - I absolutely love them. 4 previous BenQ were for our daughter - 2 each at her home & office. These 2 were for my home for when our daughter comes to visit. She is a patent attorney & needs good quality monitors for her work. Love BenQ - awesome value.",
      "rating": 5.0,
      "verified": true,
      "author": "James R. R",
      "helpful_votes": 0,
      "publication_date": 20200626
    },
    {
      "title": "Amazing Monitor especially at this price!",
      "text": "Since I am indefinitely working from home now I decided to invest in a monitor! I could not be more impressed and pleased with the purchase of this monitor. The picture is crystal clear and such a nice size - I don't see the need now to get another monitor as I can fit 2 screens side by side on this one! My eyes don't tire out as easily either. Great purchase and would highly recommend - I actually have to several of my colleagues!",
      "rating": 5.0,
      "verified": true,
      "author": "AliN",
      "helpful_votes": 0,
      "publication_date": 20200607
    },
    {
      "title": "Okay monitor. Dead pixel.",
      "text": "Bought this as a back-up monitor, so I didn't try it before the 30 day return period. Upon finally turning it on, I instantly discovered a dead pixel. Hard to miss because it's dead center on the screen. It was a fair price; everuthing else seems fine. It doesn't automatically turn on when I power up the computer either.",
      "rating": 2.0,
      "verified": true,
      "author": "Norinco3264",
      "helpful_votes": 0,
      "publication_date": 20190221
    },
    {
      "title": "Perfect for my home office",
      "text": "Working from home and needed an additional monitor. The size of this is perfect and the quality of the screen is ideal. I’m not using it for anything other than work and the occasional web surfing but it works perfectly for that. No issues at all I’m very happy with my purchase",
      "rating": 5.0,
      "verified": true,
      "author": "Tracy Bittner",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "Great gaming monitor at a great price.",
      "text": "I usually wait a few weeks before I review something, but this warranted a review now. The response time is so fast on this monitor. The colors look fantastic, and the screen size is awesome for movie viewing. The supplied stand is plenty sturdy but does not allow for adjustment of height or angle. Supplied drivers worked great. No response lag in video games like GTA V, Fifa 17 ,CSGO and many others. Speakers are clear and audible although not particularly loud, but nice to have when not using headphones For the price you can not go wrong.",
      "rating": 5.0,
      "verified": true,
      "author": "Jimbo123",
      "helpful_votes": 0,
      "publication_date": 20170127
    },
    {
      "title": "After doing some research I decided to purchase the BENQ ...",
      "text": "After doing some research I decided to purchase the BENQ GL2460HM. After one week it just died. After a conference call with Amazon Conceirge and BenQ Tech Support we agreed I return the item.",
      "rating": 1.0,
      "verified": true,
      "author": "Bennyb",
      "helpful_votes": 5,
      "publication_date": 20180516
    },
    {
      "title": "One of the best values for the money",
      "text": "One of the best values for the money. Very nice picture. Beware! When connecting a HDMI cable, you won't see a picture after starting up for the first time. You have to go into the Menu and choose the connection because it is not automatically detected. A kind of annoying is the fact that by using and switching the picture presets, there are several steps to take each time you want to change. My other monitor has just one switch to change between those. Like expected, the sound of the included monitor speakers are no replacement for good external ones.",
      "rating": 4.0,
      "verified": true,
      "author": "Pianotek",
      "helpful_votes": 0,
      "publication_date": 20160909
    },
    {
      "title": "Great clarity and image stability for my needs",
      "text": "Been very satisfied with this after several months of use. I like the \"eye care\" (blue reduction) capability. Primarily using for office applications, some photo editing. Hope it lasts as long as my old Samsung SyncMaster (5 yrs) that is still going strong. Stand seems a little bit light-duty, but if you plan to VESA mount, this is a non-issue.",
      "rating": 5.0,
      "verified": true,
      "author": "F7D486E3087",
      "helpful_votes": 2,
      "publication_date": 20170919
    },
    {
      "title": "Amazing Monitor",
      "text": "Probably the best monitor I have. The picture is very very good. The only issues I had with it are that it takes a little longer to turn on than my Asus monitor (which doesn't have anywhere close to as nice of a picture as this monitor does) and that the buttons are behind the monitor itself with only dots showing where the buttons are - no details on what the buttons are. Just a heads up, I play video games and watch Blu Ray movies on this monitor and just recently watched the Lord of the Rings Blu Ray on it and it is absolutely stunning.",
      "rating": 5.0,
      "verified": true,
      "author": "Cross The Brij",
      "helpful_votes": 4,
      "publication_date": 20150726
    },
    {
      "title": "A great starter PC gaming Monitor.",
      "text": "If you're looking for a 1080p 60Hz Monitor that will not disappoint, then I can highly recommend this monitor. BenQ has always delivered very well on their monitors and this one is no exception, for a reasonable price, you get the quality you expect from BenQ but for the entry level gamer who's trying out PC gaming for the first time, if you want to make sure you do it right, start with this, and then adapt based on your wants/needs.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas",
      "helpful_votes": 0,
      "publication_date": 20170714
    },
    {
      "title": "Awesome no fuss monitor.",
      "text": "As with all the BenQ monitors I've owned it has everything I want and nothing I don't. No bizarre picture modes/features of use to no one, all the inputs you need and VESA mount-ready. On top of that it has great color, contrast and refresh rate. It looks even better when you calibrate it. You definitely won't be using this to color grade or anything, but it's a fantastic FHD monitor for everyday use. Pairs great with my Mac mini and small form factor PC.",
      "rating": 5.0,
      "verified": true,
      "author": "giantrobot503",
      "helpful_votes": 0,
      "publication_date": 20180416
    },
    {
      "title": "THE ULTIMATE GAMING MONITOR...for the price",
      "text": "This monitor is just plain and simply put...AMAZING. I bought two of these and been pc gaming on them for almost a year now and if I do say so myself the response time and picture quality is amongst the greater gaming monitors. I recommend this monitor to any gamer who is starting a new system or plan on buying multiple monitors. I plan on buying their upgrade monitor to this one...Ben Q grabbed my attention for game for years to come, thanks.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica Sablad",
      "helpful_votes": 2,
      "publication_date": 20160926
    },
    {
      "title": "Great budget Monitor.",
      "text": "great monitor for the price. Goes up to 1920x1080 as it says and looks fantastic coming from a 1600x900 monitor. If your looking for a great monitor that won't break the bank, I highly recommend this one. Great for gaming and just browsing the web. I wish the settings would allow you to customize the display more because different settings change the picture drastically and most settings lock out options. There is a user setting that lets you customize everything, but it just doesn't look as good as other options no matter how much you mess with it. This is my one gripe with the monitor, but it is still fantastic.",
      "rating": 5.0,
      "verified": true,
      "author": "Rello",
      "helpful_votes": 2,
      "publication_date": 20150525
    },
    {
      "title": "GL 2480 is definitely for the console gamers!",
      "text": "TN 1ms 75Hz, I was looking to buy a monitor for my PS4 and settled on this one. I am not disappointed. I play a lot of FPS games and the response time is vastly superior to my 55\" TV. Picture clarity is fantastically crisp and the colours are great. For the price you can't go wrong.",
      "rating": 4.0,
      "verified": true,
      "author": "Andrew M.",
      "helpful_votes": 0,
      "publication_date": 20200601
    },
    {
      "title": "Awesome!!!!",
      "text": "First and foremost I am a twitch streamer. I need a good monitor when gaming or doing daily activities . This provides that... I love the size and the quality of the monitor and would recommend this monitor to anyone who is on a budget and needs a perfect monitor. I have money now and would still buy the same monitor!",
      "rating": 5.0,
      "verified": true,
      "author": "KingSolrac",
      "helpful_votes": 0,
      "publication_date": 20180910
    },
    {
      "title": "Great monitor",
      "text": "For some reason I thought it had built in speakers. Nevertheless, I use this for my ps4 playing COD Warzone and it’s great. I was already good at the game but I’m next level now. If you have a turtle beach or gaming headset, this will do for you!",
      "rating": 4.0,
      "verified": true,
      "author": "Jordan L.",
      "helpful_votes": 0,
      "publication_date": 20200702
    },
    {
      "title": "Excellent Monitor",
      "text": "Clear, crisp images straight out of the box. For some reason the HDMI plug is not working on this comp so using the standard cable until it gets fixed. No tearing or lag, dark dungeons are easily seen and bright glare from snow areas are eliminated. Got this for my husband and looking forward to getting another for myself - far better than the equivalent monitors we have been using from other manufacturers. Stand is a little higher than normal so have been able to remove the monitor stands and free up some room on the desks. Have not tried the sound because we have a stand alone system. Easy set up straight out of the box.",
      "rating": 5.0,
      "verified": true,
      "author": "christine brooks",
      "helpful_votes": 0,
      "publication_date": 20141231
    },
    {
      "title": "BEST MONITOR FOR CONSOLES!",
      "text": "FANTASTIC MONITOR! I use this Monitor for my Xbox One games and it looks clear as can be! It is ideal for FPS and fits nicely next to my computer monitor to complete my ultimate set up! Best for individual gamers rather than family console fun for everyone to play on coop. EDIT: that was for the 1080p monitor, recently got the 4k monitor and it is truly great. Speakers are meh, but for me they do the job. Use it for my ps4 pro and xbox one x, not for pc. Highly recommend for small setups!",
      "rating": 5.0,
      "verified": true,
      "author": "Chapa",
      "helpful_votes": 0,
      "publication_date": 20170728
    },
    {
      "title": "meh!",
      "text": "So i bought this monitor to replace and reg tv screen on which I previously played on. This was a huge improvement if you get it however that being said you pay for what you get Don't expect to get top of the line video @ this price its just not going to happen. The speaker aren't the best even cranked up all the way you cant hear it much. overall id give this a 4 stars.",
      "rating": 5.0,
      "verified": true,
      "author": "Jonathan Lopez",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "Had to return it, no support",
      "text": "The set up was easy but had some issues like blurriness and a couple of other things. I never heard back from tech support so I have to select a different monitor and send this one back.",
      "rating": 1.0,
      "verified": true,
      "author": "Penmen",
      "helpful_votes": 0,
      "publication_date": 20200510
    },
    {
      "title": "Nice product design. Poor picture quality.",
      "text": "Really disappointed in the picture quality. Tried numerous settings and the final offering is sorely lacking. The actual product itself looks just fine. Clever concept to keep the cables hidden. Too bad about the picture quality.",
      "rating": 2.0,
      "verified": true,
      "author": "L. W.",
      "helpful_votes": 0,
      "publication_date": 20200627
    },
    {
      "title": "Great WFH monitor",
      "text": "I bought 2 of this 24' monitor since I started WFH during this perilous times. The picture quality is crisp and I like how it adjust the brightness automatically. The price on this monitor is a bargain for its size.",
      "rating": 5.0,
      "verified": true,
      "author": "beefsteak",
      "helpful_votes": 0,
      "publication_date": 20200414
    },
    {
      "title": "Ok but ultimately disappointed",
      "text": "A little disappointed in the monitor but ultimately can’t be too upset cause it’s not expensive. I took a gamble on this monitor hoping it would be a good gaming monitor for my second setup. However, the ghosting present is very distracting even at 75hz with the overdrive set to high. Panning and fast motion just looks off compared to my other monitor and tv. For general pc use like web browsing and netflix its fine. For gaming, id invest in something a little more expensive",
      "rating": 3.0,
      "verified": true,
      "author": "Anthony Socci",
      "helpful_votes": 0,
      "publication_date": 20200820
    },
    {
      "title": "Best value on the market",
      "text": "I actually love this monitor. I have this next to a 27\" samsung curved LED monitor and I like this monitor almost just as much, especially as a secondary monitor. For the price, this was a steal. Mounted on my desk with the amazon basics single monitor display mounting arm and can't complain about a thing. Great for video editing and use as a side monitor.",
      "rating": 5.0,
      "verified": true,
      "author": "Sam Biesack",
      "helpful_votes": 0,
      "publication_date": 20170529
    },
    {
      "title": "Beautiful monitor.",
      "text": "This is well worth the money.. the colors are amazing making you truly feel you are in the game. The refresh rate really gives you that edge you need in any shooter! It also brings out details in rpgs that you may have never noticed! The only downside is the speakers in it are not very loud, no problem with some turtle Beach headsets! Overall great buy for any gaming set up",
      "rating": 5.0,
      "verified": true,
      "author": "keith gallimore",
      "helpful_votes": 0,
      "publication_date": 20181115
    },
    {
      "title": "Is a good monitor, and it does allow you to change ...",
      "text": "Is a good monitor, and it does allow you to change the screen mode in diferent ways, you can change to reading mode by just taping on a button, but the only thing i don't like is that you have to enter the menu and do many clics to change from reading to gaming :S, but for everything else is great for the money you spent :). I have not tried it with high request game mode, i mean playing a game that actually ask for it for a high performance, but at lease with SCII and AoE is runing perfect.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20161019
    },
    {
      "title": "Missing vital component, but an adequate monitor",
      "text": "For the price this monitor works as expected, although its quality is not great. It works fine for everyday business use but I wouldn't use it for much more than that. It also did not come with a vital part for the monitor - the power cord. Luckily I had an extra standard power cord lying around the house so it didn't matter for me, but for most people it would stink to have to wait for it to arrive only to not be able to use it once it did.",
      "rating": 3.0,
      "verified": true,
      "author": "Southern Knight",
      "helpful_votes": 0,
      "publication_date": 20200421
    },
    {
      "title": "Cannot beat the price and quality.",
      "text": "Wow. Where to begin? Super easy and secure assembly with a small base. Slender, tight bevels, cutting down on unnecessary space. Crisp bright colors, no dead pixels, amazing picture quality and super affordable price. Able to be mounted, which is what I did when I got it. My biggest issue? It's too bright! The whites could be harsh on the eyes, but this is easily fixed by messing with the onboard settings. Could use more inputs, but then, I'd prefer more inputs on just about everything I own. All together, no real complaints.",
      "rating": 5.0,
      "verified": true,
      "author": "Arthur Schupbach",
      "helpful_votes": 0,
      "publication_date": 20141110
    },
    {
      "title": "Nice monitor and price point",
      "text": "Nice monitor and price point for general business use. Good size for pairing two wide on a desk. Lacking height adjustment which will bother some users. Not knowledgeable about graphic production and gaming use but for my purposes they are very suitable. Includes built in connection for three types of connectors including HDMI and VGA.",
      "rating": 4.0,
      "verified": true,
      "author": "AverageJoe",
      "helpful_votes": 0,
      "publication_date": 20180519
    },
    {
      "title": "A very nice monitors",
      "text": "I like this monitor.. Despite the style or prices always read full specifications before buying any electronics. I've had this monitor nearly a year now and still going strong.. Would buy again!",
      "rating": 4.0,
      "verified": true,
      "author": "Brett",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Superb Product!",
      "text": "The best! for saving my eyes!... I was using two LCD side by side and going blind and did not even know it, till one day I started seeing eye floaters and had to change many things, I switch to this, this has saved me from having to give up the computer...no more eye soreness and my sight is getting better.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard Roger Hunt",
      "helpful_votes": 0,
      "publication_date": 20180617
    },
    {
      "title": "Three Stars",
      "text": "Great for the money but missing several pixels. Just fine for command line stuff. Actually the Mfg. offered to replace the unit immediately but I turned down their offer as the monitor is being used on a server that doesn't need to be 100% perfect. I've been using my $2k+ NEC calibrated monitors too long I guess, but for this outrageously low cost, and the offer to replace, I'll have to give it five stars.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark Andea",
      "helpful_votes": 2,
      "publication_date": 20170216
    },
    {
      "title": "Great monitor!",
      "text": "i love my new monitor such an upgrade from my old one. It's the perfect size for playing games, watching movies, and just surfing the web. The picture looks great and has a great response time of 2ms. Only complaints are the turn on speed which is slower than my old one, I also thought this was LED but it's actually LCD and also the speakers suck more than my old monitor. All and all I love this thing for the prices of 146.00 and I'm thinking about buying a second for dual monitoring .",
      "rating": 4.0,
      "verified": true,
      "author": "Samantha & Shawn",
      "helpful_votes": 0,
      "publication_date": 20150318
    },
    {
      "title": "Thumbs up.",
      "text": "This monitor is the biggest monitor I have had and it is amazing. Great colors when put side by side with my other monitor you can really see the difference between them. Gaming is great I play League of Legends and others on it all the time. Thumbs up.",
      "rating": 5.0,
      "verified": true,
      "author": "Zachary M.",
      "helpful_votes": 3,
      "publication_date": 20170412
    },
    {
      "title": "Nice Monitor, but there's a line of dead pixels in the monitor after two months of use.",
      "text": "Great monitor and easy to set up. Seems great; not overly bright and easy on the eyes for prolonged use. Updated, after 2 months of use the monitor developed a line of dead pixels.",
      "rating": 3.0,
      "verified": true,
      "author": "Jerry St.Croix",
      "helpful_votes": 0,
      "publication_date": 20191126
    },
    {
      "title": "Nothing else compares",
      "text": "This was my first monitor I have ever purchased. The colors are beautiful, the response time is great, and the price was right. I have used Asus and dell monitors in the past and this easily blew those away! 24 inches is perfect for me personally and for the price you won't find many monitors with similar specs even if they are 19 inches! The most important thing to know when buying is to buy it off Amazon. The date I purchased this, the same monitor was on BenQ's website for $30 more.",
      "rating": 5.0,
      "verified": true,
      "author": "Jaimee",
      "helpful_votes": 0,
      "publication_date": 20150620
    },
    {
      "title": "I also like the the buttons are on the side instead of ...",
      "text": "I have had this monitor for about a month now, and I use it very frequently mostly for gamimg but also for watching TV. There is literally no flicker or lag at all. The colors and crisp look it provides makes this purchase be worth it. The only complaint I have is that the standard that it is on slants the screen down a little bit istead of holding it up straight. But that only bothered me for a short while. I also like the the buttons are on the side instead of the bottom (like my other BenQ monitor). All in all... it is a great purchase, and I highly recomend it.",
      "rating": 5.0,
      "verified": true,
      "author": "LadiesAwakening",
      "helpful_votes": 0,
      "publication_date": 20141125
    },
    {
      "title": "adjust color settings immediately",
      "text": "Inexpensive gamer monitor 1 ms response with that said immediately after turning on upload driver disc as windows will identify the monitor correctly but still use generic drivers and then pull up pdf manual and adjust color settings to 90% brightness and gamma level 5 the color settings out of box are horrible google model number and see how everyone in the world has to tweak color settings on these ..not removing a star for this but of all monitors had over the years this one was worst out of box for color settings. if not sure how to so this google it",
      "rating": 5.0,
      "verified": true,
      "author": "Mathew Hoffer",
      "helpful_votes": 0,
      "publication_date": 20150702
    },
    {
      "title": "Good but very bright",
      "text": "Nice monitor but the blue is too bright for sustained use",
      "rating": 4.0,
      "verified": true,
      "author": "Glenn Campbell Jr.",
      "helpful_votes": 0,
      "publication_date": 20191105
    },
    {
      "title": "Can't be beat for the Money",
      "text": "I bought two of these to hook to my buddies computer that I built for everyday gaming. NO lag, or trails behind the characters and stuff. Well worth the money at 1/3rd cheaper than the name brands.",
      "rating": 5.0,
      "verified": true,
      "author": "Dirty",
      "helpful_votes": 0,
      "publication_date": 20190812
    },
    {
      "title": "Console Gamer Bang for Buck.",
      "text": "Amazing monitor for console gamers. 2ms Response Bright Vivid colors. This is a great buy for any Competitive or casual player looking to up their console game. The 2ms response time is a noticeable improvement over my old tv. Remember the put the monitor into game mode before playing. since consoles do not support over 60hz of refresh rate this is the perfect for XB1 and PS4. FPS gamers will not be sorry.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian & Sarah Richey",
      "helpful_votes": 0,
      "publication_date": 20170121
    },
    {
      "title": "average quality monitor",
      "text": "I got his monitor on May 2020 not bad quality at all. I prefer samsung monitor but this one is good for quick job. I recommend it.",
      "rating": 4.0,
      "verified": true,
      "author": "karim",
      "helpful_votes": 0,
      "publication_date": 20200508
    },
    {
      "title": "Finally getting the full gaming experience.",
      "text": "I couldn't be happier with this monitor. I've been console gaming on large TVs for as long as I can remember, but in recent months I've heard enough people say it puts you at a big disadvantage to play on a big TV, or a TV at all. Playing on this monitor gives me the competitive edge I've needed, and reduces the input lag to basically none and the motion blur feature is a great bonus as well. The picture on this monitor is amazing also-- totally worth the $130.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180611
    },
    {
      "title": "Great monitor!",
      "text": "I bought two of these for my PC and I am loving them. The picture is clear and high quality on them so far. I had not had experience with this brand before, but will definitely buy their products again in the future.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew",
      "helpful_votes": 0,
      "publication_date": 20190413
    },
    {
      "title": "2ms response for $140. Great for the price",
      "text": "I'm using my GL2460 for my Xbox One. Pros -Xbox one plays very well, 2ms response leaves no visible ghosting. -Buttons on the back of the right side, nice not having an annoying LED sticking out of the front. -Headphone jack, and Audio out port in back to connect to other speakers (recommended.) Cons- -Only one HDMI, but I knew before buying. -DO NOT rely on these built in speakers, very quiet.",
      "rating": 5.0,
      "verified": true,
      "author": "Ethan Whitney",
      "helpful_votes": 2,
      "publication_date": 20160510
    },
    {
      "title": "Fine monitor at a great price",
      "text": "Fine monitor at a great price. Lost a star because it can't auto-detect the connected HDMI cable. Had to manually set the input to HDMI for it to work. It's 2018, have to think it must be a defect in it to cause this problem. What monitor these days can't auto-detect? Still not that big of a deal if it works with a manual setting. Lost some time to it and a little worried that it might be a defect that will worsen over time.",
      "rating": 4.0,
      "verified": true,
      "author": "Shawn R. Sabbini",
      "helpful_votes": 0,
      "publication_date": 20180529
    },
    {
      "title": "Great monitor",
      "text": "Great monitor, great price. Colors are sharp, and the low blue light setting is nice for darker rooms without much ambient lighting. There is a noticeable reduction in my eye strain when it's on. No dead pixels on the one I received, so definitely a 5/5.",
      "rating": 5.0,
      "verified": true,
      "author": "Dennis",
      "helpful_votes": 0,
      "publication_date": 20170730
    },
    {
      "title": "Excellent for PC Games",
      "text": "24 inches is a perfect size for my desk. The BenQ GL2460HM has a beautiful screen. It is light, easy to assemble, and plays games at high refresh rates. I picked this monitor up after extensive research and decided that it was best for me because of the excellent prize, the perfect screen size, and the high quality of BenQ for playing internet videos and PC games.",
      "rating": 5.0,
      "verified": true,
      "author": "JensenAndMore",
      "helpful_votes": 4,
      "publication_date": 20141020
    },
    {
      "title": "Overall great Monitor, I would like to get another one ...",
      "text": "Would be a 5 star but one of the pixels in my monitor is out and the monitor randomly goes black; I've tried replacing the HDMI cable, and I know it's not a power issue because the power light does not change when it does go black randomly. It is also not the screen saver. It happens when I am actively using the computer and usually at the most inopportune moments. Overall great Monitor, I would like to get another one soon but I need to resolve this black screen issue first.",
      "rating": 4.0,
      "verified": true,
      "author": "Mia",
      "helpful_votes": 0,
      "publication_date": 20170727
    },
    {
      "title": "and I'm happy with it so far",
      "text": "Have had it for a month or so, and I'm happy with it so far. There was one incident where, mysteriously, it wouldn't recognize the feed, even though the cords hadn't been touched since its last use. Unplugged all cords, waited several seconds, and replugged. It's worked since.",
      "rating": 4.0,
      "verified": true,
      "author": "Emma J",
      "helpful_votes": 0,
      "publication_date": 20170823
    },
    {
      "title": "Spend more and get better.",
      "text": "1 month old and already have dead pixels!! Not happy!! Was told by BENQ Customer Service warranty doesn't cover 1 dead pixel. Has to be 3 or more.. WTF???",
      "rating": 1.0,
      "verified": true,
      "author": "Diesel",
      "helpful_votes": 0,
      "publication_date": 20191102
    },
    {
      "title": "Very nice monitor for the price",
      "text": "I'm thoroughly satisfied with this monitor. I thought the price was fair and it looks amazing. I don't use it for gaming so I'm not sure how games run on it as this is my 2nd monitor. Overall though I love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Samantha",
      "helpful_votes": 0,
      "publication_date": 20190604
    },
    {
      "title": "5/7 all day! Great monitors for the price!",
      "text": "I own a pair of these monitors, and I absolutely love them. I have owned them for almost a year and have had zero issues with them. I am a gamer and play some fairly high FPS games (think Fallout, Mad Max, Subnautica) and have had zero tearing or lag with them. Perfect monitors for gaming or watching 1080P video. If I were to say anything negative, it's that my PC has tried to make them the default speaker configuration, and I have had to change that. BUT, that's a super minor thing to complain about. Overall 5/7 in my opinion. For the price, they are perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas H.",
      "helpful_votes": 0,
      "publication_date": 20170720
    },
    {
      "title": "Much needed and appreciated!",
      "text": "After much scrimping and saving from a very poor gamer, I found this monitor to suit my needs. My monitor I was using was horribly outdated (a relic from the year 2000) and it was starting to become a noticeable problem in the few games that I could play and the websites I would often visit. I've been using this for many months now and I absolutely love it. It is sharp, detailed, and exactly what you want from a monitor. I use an hdmi cord to connect to my pc and it is a clear step up! Bottom line is if you need a gaming monitor (or one in general) then you can't go wrong for what it is!",
      "rating": 5.0,
      "verified": true,
      "author": "Paul Railsback",
      "helpful_votes": 0,
      "publication_date": 20150611
    },
    {
      "title": ":)",
      "text": "I am consistently seeking out good products that are budget friendly. As you can see I have ranked this display 5 stars. I haven't noticed really any ghosting during my gameplay. A myriad of settings can be changed to suit your needs and preferences. Looks nice on my desk and performs wonderfully. Thanks BenQ!!",
      "rating": 5.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 2,
      "publication_date": 20170514
    },
    {
      "title": "Very good monitor",
      "text": "I'm happy with this purchase. It's super bright, and the text are clear and easy to read. I ordered another one for a dual monitor setup (although from a different site). Recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "sam765",
      "helpful_votes": 0,
      "publication_date": 20190724
    },
    {
      "title": "Saved my Eyes",
      "text": "I had been suffering from tremendous eye and brain pain from long hours at the computer. I had a 15 yr old monitor . Upgrading to this monitor I noticed an immediate improvement",
      "rating": 5.0,
      "verified": true,
      "author": "robert ade",
      "helpful_votes": 0,
      "publication_date": 20200218
    },
    {
      "title": "Needs instructions",
      "text": "Arrived in perfect condition. Great screen/color/contrast. Difficult to set up since there were no clear instructions. Had to go online for a manual with schematic. Would have given it a 5 if easier to set up.",
      "rating": 4.0,
      "verified": true,
      "author": "S. McArthur",
      "helpful_votes": 2,
      "publication_date": 20170427
    },
    {
      "title": "Son Loves It",
      "text": "My son asked for this monitor to record while gaming, however, he is using it as his main monitor for PS4. He absolutely loves it. He was playing on a 46 inch flat screen television & he said this is a million times better and the picture on the screen is perfect. Happy young man! Highly recommend!!",
      "rating": 5.0,
      "verified": true,
      "author": "Kimberly Vipperman",
      "helpful_votes": 0,
      "publication_date": 20161230
    },
    {
      "title": "Nice monitor with a few annoying quirks",
      "text": "Good monitor with a nice picture. One major annoyance is how slow it is to turn on. It takes a full 10 to 20 seconds from when I press the button to when I can see an image. It's particularly bad when I have to switch between inputs, the long status time combined with the short time it stays on when not getting an input means if I don't sit and wait the whole warm-up time it will turn off before I can hit the button to change inputs.",
      "rating": 3.0,
      "verified": true,
      "author": "Tyler Waugh",
      "helpful_votes": 2,
      "publication_date": 20170614
    },
    {
      "title": "Will never go back to a tv screen",
      "text": "This is the best investment for a gamer. The picture is fantastic and there is no screen drag like I was getting with my tv.",
      "rating": 5.0,
      "verified": true,
      "author": "Heather",
      "helpful_votes": 0,
      "publication_date": 20190530
    },
    {
      "title": "Great Monitor! Everything looks crisp on it",
      "text": "Great Monitor! Everything looks crisp on it! Only drawback is it bright, this monitor is bright as sh*t, personally too bright for me since I spend a lot of time in-front of it. The size is great, 24inches is A LOT bigger than I expected. If you want to run dual monitor setup you should probably buy one of these first, and see how it works, then buy the second monitor if necessary. After buying only one I'm VERY satisfied with my single purchase, no need for two.",
      "rating": 5.0,
      "verified": true,
      "author": "Athlete",
      "helpful_votes": 0,
      "publication_date": 20140916
    },
    {
      "title": "Very nice, great price",
      "text": "Very nice! Especially for the price. 139.00 when I purchased. I mounted them on a swing arm that comes off the wall, in my office exam rooms. Patient notes and x-rays are nice and big now. I'm trying to get office software company to accommodate portrait view, then I won't have to scroll on the note and can read it from anywhere in the room.",
      "rating": 5.0,
      "verified": true,
      "author": "Brett",
      "helpful_votes": 0,
      "publication_date": 20160410
    },
    {
      "title": "Great picture! Mediocre viewing angles",
      "text": "Really crisp image! I really love these monitors (I bought 2). My only problem is that the viewing angles aren't great, which kinda sucks if I'm at the PC and my partner is trying to watch, or vice versa. Speakers are also quiet but you should probably buy external speakers anyways.",
      "rating": 4.0,
      "verified": true,
      "author": "Luke",
      "helpful_votes": 0,
      "publication_date": 20171010
    },
    {
      "title": "great for gamming",
      "text": "The colors of this monitor are beautiful and very true to what they are supposed to be. I have had this monitor for about 6 months now with no issues, and I love watching movies and playing games on it. I had previously had to return a different brand monitor due to it making my video games look grainy, but have had no issues with this one and would defiantly recommend it!",
      "rating": 5.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20150901
    },
    {
      "title": "they last a long time & the quality is fantastic - bar none",
      "text": "i have had benq monitors for years & years. they last a long time & the quality is fantastic - bar none. this was a christmas present to me this year & i am so overjoyed that i spent the money on this. crisp & clear & color is awesome. size was perfect for my desk.",
      "rating": 5.0,
      "verified": true,
      "author": "starsexton",
      "helpful_votes": 0,
      "publication_date": 20170225
    },
    {
      "title": "Bought in 2015, still going strong in 2020",
      "text": "I’ve had this monitor since 2015, and am now planning to buy a second one of the same model. I’ve never had an issue with it, and the screen is so much brighter, and more colorful than my actual laptop screen that i can’t go back to my laptop.",
      "rating": 5.0,
      "verified": true,
      "author": "Chase.B",
      "helpful_votes": 0,
      "publication_date": 20200415
    },
    {
      "title": "Don't buy any other monitor!",
      "text": "This could be the best purchase I've ever made from Amazon! The picture is perfect, crisp, clear with vibrant colors. I bought this to use with my Playstation 4 system. Honestly, you could not ask for a better product for the price!",
      "rating": 5.0,
      "verified": true,
      "author": "Jamie Lynn",
      "helpful_votes": 0,
      "publication_date": 20170714
    },
    {
      "title": "Good for console gaming.",
      "text": "Love this monitor. I bought this monitor for console gaming. I play on the Playstation 4. I've been playing on regular TVs for so long. Once I got this monitor, I decided I'm never going back. Image is so clear and has almost no noticeable delay. If you're a console gamer looking to switch to a monitor, I'd say this is a great first choice.",
      "rating": 5.0,
      "verified": true,
      "author": "Johnny Medina",
      "helpful_votes": 0,
      "publication_date": 20161213
    },
    {
      "title": "This is one of the best monitors i have ever used",
      "text": "This is one of the best monitors i have ever used, the picture quality is great and looks 10 times better than my big screen TV, it was also very affordable. the only downside i have to this is that there is a phantom dead pixel that only shows up sometimes, I've had this problem since i got it, but it wasn't a deal breaker for me since it only ever shows up at random.",
      "rating": 4.0,
      "verified": true,
      "author": "Antonio",
      "helpful_votes": 0,
      "publication_date": 20151122
    },
    {
      "title": "used it mostly as a 3rd monitor",
      "text": "suddenly stopped working one day i gave it away and told them to try using a different cable port it worked about 7 months.",
      "rating": 3.0,
      "verified": true,
      "author": "Technologies8",
      "helpful_votes": 0,
      "publication_date": 20190806
    },
    {
      "title": "Gift for my super computer nerdy hubs",
      "text": "Gift for my super computer nerdy hubs. So picked it out and then let him check it to make sure I wasn't picking out the worst monitor ever. He has been loving it, color is great and screen size is nice as well. No complaints and thinks it's probably the best monitor he has owned and he has had 5-6 gaming monitors",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie",
      "helpful_votes": 2,
      "publication_date": 20170612
    },
    {
      "title": "Good monitor, bad speakers.",
      "text": "Nice visualization, but terrible speakers. Half the time they don't work and the other half they are too quiet. The volume is at 100% on monitor, computer, youtube, everything that has a speaker volume is at 100% and we still have to get close to hear it. Sometimes there is no audio at all. The only way I have figured out how to fix this is to put the computer to sleep and then wake it up and then the monitor works. So maybe it's a computer problem but I don't think so.",
      "rating": 3.0,
      "verified": true,
      "author": "Janene Petersen",
      "helpful_votes": 2,
      "publication_date": 20151003
    },
    {
      "title": "Perfect monitor",
      "text": "This monitor is great for the price. I needed to mess around with the settings to get the picture perfect for gaming. I have another monitor but different model. Did not notice I ordered two different models but they are both great",
      "rating": 5.0,
      "verified": true,
      "author": "Customer",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "It's ok for a basic monitor",
      "text": "Color depth richness not the greatest. But good value for a cheaper price monitor.",
      "rating": 4.0,
      "verified": true,
      "author": "William Hinebaugh",
      "helpful_votes": 0,
      "publication_date": 20200421
    },
    {
      "title": "My dog broke my monitor so I bought it again",
      "text": "I will say the only thing that made me sad is that the Square Deal does not cover breakage but the monitor is very good. I use it for work and I have zero eye strain. Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Slakkie",
      "helpful_votes": 0,
      "publication_date": 20190127
    },
    {
      "title": "awesome budget monitor!",
      "text": "Very nice monitor. Easy to hook up and functions great. No dead pixels and I don't notice any motion blur while gaming. For the price, this monitor is hard to beat!",
      "rating": 5.0,
      "verified": true,
      "author": "louconn",
      "helpful_votes": 2,
      "publication_date": 20170605
    },
    {
      "title": "Clear - Bright - Crisp - Thin Bezel LED Monitors - I Could Not Be Happier With These",
      "text": "I was looking for two more monitors to match the two I have since I purchased a four monitor stand but the ones I own were no longer available. I am glad the were not as I found these BenQ 24-inch monitors and I could not be happier with them. These are well lit, bright and crisp white, black and every other color are high quality. The bezel around the edge is thinner than the same size monitors I already own and this makes for a much cleaner look. These are superior monitors and for the price, I do not think I could have made a more perfect purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "TBuff",
      "helpful_votes": 5,
      "publication_date": 20171203
    },
    {
      "title": "A great choice to use working from home.",
      "text": "Bought this monitor for work. Has good color reproduction and brightness.",
      "rating": 5.0,
      "verified": true,
      "author": "B. Hormazabal",
      "helpful_votes": 0,
      "publication_date": 20200630
    },
    {
      "title": "Great",
      "text": "I got this baby as a second screen for my gaming channel and I love it, it shows good the sound is good everything is good, exceeded my expectations",
      "rating": 5.0,
      "verified": true,
      "author": "Calie",
      "helpful_votes": 0,
      "publication_date": 20190506
    },
    {
      "title": "Perfect for computer monitor",
      "text": "I love this! Bought it for my home office and it’s bright and clear enough to see tiny details in Autocad but not reflective or jarring. Highly recommend! As a side note, I have sensitive eyes and easily get headaches and this has improved working from home 1000%",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly Sea",
      "helpful_votes": 0,
      "publication_date": 20200402
    },
    {
      "title": "Excellent monitor.",
      "text": "Very happy. Love the Blue Light filter adjustment. The buttons/controls on the back of the unit are fine. I was concerned that they would be a problem, yet then I realize how the front of the monitor shows you which button to click. Pretty easy. I am not a gamer - hence, I am only speaking in terms of watching video, browsing the interest, E-mail, etc.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephen Crane",
      "helpful_votes": 0,
      "publication_date": 20150831
    }
  ],
  "product_meta": {
    "title": "BenQ 24 Inch 1080P Monitor | 75 Hz for Gaming | Proprietary Eye-Care Tech |Adaptive Brightness for Image Quality | GL2480,Black",
    "description": "Whether you are catching up on the show on the internet or viewing documents, The BenQ GL2480 LED monitor is the perfect choice for you in style! Featuring dynamic ratio of 12M: 1, flicker-free, and Response time of 1 ms for gaming, this 24\" 16: 9 LED monitor delivers you the audiovisual enjoyment. Power supply - built-in Super-fast 1ms GTG response and 75Hz Refresh Rate eliminates motion smear for smooth video viewing and gaming experiences. Fast-moving action and dramatic transitions render flawlessly without lag or ghosting. Enjoy immersive gaming and video entertainment without delay. The latest HDMI high-speed multimedia interface enables effortless convenience to enjoy digital entertainment from today's source devices as well as tomorrow's multimedia equipment",
    "rating": 4.6,
    "feature_bullets": [
      "* 1ms response time for lightning fast gaming performance and ZeroFlicker technology for minimized eye strain and improved eye comfort during long hours of work or gaming",
      "* Low Blue Light Technology filters out harmful blue light, effectively diminishing eye fatigue and irritation. Display Area (mm) 531.3x298.8",
      "* ZeroFlicker technology virtually eliminates flicker at all brightness levels for minimized eye strain and improved eye comfort during long hours of use. Power Consumption (on mode.)- 25W. Power Consumption (based on Energy Star) - 17.48W",
      "* Full HD 1080p 16:9; Dimensions with Wall Mount (HxWxD mm w/o base) 565 x 333 x 54‎. OS Compatibility- Windows 7,Windows 8,Windows 8.1",
      "* 16mm slim bezel display, high-gloss frame and base, and carbon fiber-patterned back – ideal for work or home use, 3 year warranty"
    ],
    "specifications": {
      "Standing screen display size": "24 Inches",
      "Max Screen Resolution": "1920 x 1080",
      "Brand": "BenQ",
      "Series": "GL2480",
      "Item model number": "GL2480",
      "Hardware Platform": "Electronic_games",
      "Operating System": "Electronic Games",
      "Item Weight": "9.5 pounds",
      "Product Dimensions": "7.6 x 17.1 x 22.2 inches",
      "Item Dimensions  LxWxH": "7.6 x 17.1 x 22.2 inches",
      "Color": "Black",
      "Manufacturer": "BenQ",
      "ASIN": "B00IKDFL4O",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "March 1, 2013",
      "Customer Reviews": "4.6 out of 5 stars1,981 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#75 in Computer Monitors",
      "Domestic Shipping": "Item can be shipped within U.S.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S. Learn More"
    },
    "categories": [
      "Monitors",
      "Computers & Accessories",
      "Electronics"
    ],
    "price": 119.99
  }
}