{
  "website_summaries": [
    {
      "verdict": "No more need to brown your meat in a separate pot; this Crock-Pot sits right on top of the stove for browning before switching to slow cooking.",
      "pros": [
        "Stove-top browning saves time and cuts down on kitchen cleanup",
        "Digital timer counts down the cooking time, then automatically switches to \"Warm\" when time is up"
      ],
      "cons": [
        "Some owners felt that the low and warm settings cooked too hot, burning their food"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Very disappointed in this product",
      "text": "Very disappointed in this product. Every time I have used this item it has over cooked or scorched what every was being cooked. Last time I cooked on the warm setting and came home to find it boiling! I would never purchase this item again.",
      "rating": 1.0,
      "verified": true,
      "author": "P. Woodard",
      "helpful_votes": 26,
      "publication_date": 20170407
    },
    {
      "title": "Size is good for just the 2 of us as well (never ...",
      "text": "I don't use it too often, but when I do, I have no complaints. It's convenient to be able to brown food (or saute onions, etc) on the stove top with it, then transfer to the slow cooker. Size is good for just the 2 of us as well (never too much food as the rest can refrigerate for lunch the next day). I am confident leaving this overnight while sleeping, although the kitchen smells like food when we wake up (doesn't hold all the smells inside, but that's probably a good thing). I also prefer this digital timer to a non-digital one, and it automatically switches to 'keep warm' when finished cooking.",
      "rating": 5.0,
      "verified": true,
      "author": "sboo99",
      "helpful_votes": 4,
      "publication_date": 20171218
    },
    {
      "title": "Malfunction with lid",
      "text": "I loved this crockpot and replaced it after a few years when the handle fell off the lid causing it to drop and break. I bought a second one because the enamel had also worn off. I had my second one for 2 months. Again the handle came off while I was lifting the lid, causing it to fall and shatter. Crock pot did not respond to calls about this malfunction. The product is now useless. Amazon did take it back for a refund but I had to ship the damaged product back to them and I paid shipping. I am very disappointed that crock pot did not stand up to this issue.",
      "rating": 2.0,
      "verified": true,
      "author": "Susan Carroll",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "Has just about every option you can ask for",
      "text": "I've used this once and browned onions/garlic/meat on stovetop (gas stove) first, then put in the crockpot with other ingredients for the day. It worked amazing! Very pleased with the stovetop browning option. I'm still giving this 5 stars, however, the one option I also looked for, and didn't find, was the lid lockdown feature that many crockpots have. I also like that it sets itself to Warm, when the timer is done. Very pleased with this purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "DH",
      "helpful_votes": 8,
      "publication_date": 20161117
    },
    {
      "title": "Great Cooker",
      "text": "Very easy to clean. Have not used the stove top method yet. It runs hotter than other slow cookers so your cooking time is reduced. I use it about twice a week. I had a Bella slow cooker but after a year the programmable section melted so I bought this one and love it with zero problems.",
      "rating": 4.0,
      "verified": true,
      "author": "Garyd",
      "helpful_votes": 6,
      "publication_date": 20161229
    },
    {
      "title": "Don't Buy This!",
      "text": "I have had crock pot brand pots for over 40 years. I was looking for something that could brown and slow cook. THE PROBLEM WITH THIS POT IS THE INNER POT SHEDS BLACK ALL OVER THE TOWELS WHEN DRYING IT. AND IT COOKS TOO FAST! No slow cooking here, over cooks in less than 3 hours on LOW. Dangerous shedding of the liner pot and over cooked food is not a slow cooker and is probably poisonous liner.",
      "rating": 1.0,
      "verified": true,
      "author": "DenvrGrl",
      "helpful_votes": 0,
      "publication_date": 20200222
    },
    {
      "title": "Browning on the stove in the same pan!! SOLD!",
      "text": "I love this crock pot! The fact that I can brown meat on the stove in the same pan that goes into the crock pot shell is just awesome. That pan is also very easy to clean compared to a traditional ceramic crock pot insert. The whole thing is much lighter weight than my other crock pot too. I really like the keep warm setting and the digital controls. It's a keeper!",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth",
      "helpful_votes": 4,
      "publication_date": 20170523
    },
    {
      "title": "I used it twice and there are round areas the ...",
      "text": "I used it twice and there are round areas the size of a dime where the coating on the aluminum insert is coming off already. It was used only on low heat and plastic utensils and hand washed. I was excited to switch from a ceramic insert to an aluminum one but I guess they can't coat aluminum to be durable. I would not buy this unit unless you want bare aluminum to come in contact with your food.",
      "rating": 1.0,
      "verified": true,
      "author": "James L Schmonsky",
      "helpful_votes": 12,
      "publication_date": 20160208
    },
    {
      "title": "So I ordered this one and I could not be happier. The food cooks exactly the same as the ...",
      "text": "Let me tell you, I've been through two slow cookers in less than a year because I keep breaking the crock when I wash it after use. They are so heavy and hard to handle. So I decided, no more, I'm getting a slow cooker with a metal pot. So I ordered this one and I could not be happier. The food cooks exactly the same as the cooker with a ceramic pot, except for one thing. When it's time to clean up, the pot is so much lighter and easier to handle. I will never go back to ceramic pots. This is the way to go.",
      "rating": 5.0,
      "verified": true,
      "author": "Pop Oblivion",
      "helpful_votes": 4,
      "publication_date": 20170421
    },
    {
      "title": "Very nice and works great and is large in size for ...",
      "text": "Very nice and works great and is large in size for any meal concoction and it cooks \"HOT\", meaning it actually cooks as intended. The only thing is that I wished that the inside was coated with a non scratch coating or glaze like the original crockpots are made out of instead of the usual non stick stuff that always seems to wear out from utensils.",
      "rating": 5.0,
      "verified": true,
      "author": "Clint Martell",
      "helpful_votes": 2,
      "publication_date": 20180218
    },
    {
      "title": "This crockpot needs to go back to the development department",
      "text": "I posted one star only because it is easy to clean But that's it ....I'm so sorry I did not try this crockpot early enough to be able to return it I have used it three times only to have all three dinners burn or at the least too hot on the warm setting I wanted to replace my old slow Cooker for this one that allowed browning first and the slow cooking all in same pot Also claimed it automatically kept food warm when time ended When I came home the food was still cooking on high And burnt sauce",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20180320
    },
    {
      "title": "The cooker itself does the job very well and it's ...",
      "text": "The cooker itself does the job very well and it's very convenient to have the timer/heat control. Unfortunately, the pot has started to corrode at the bottom seams. I've cooked a handful of meals in it and I'm diligent in cleaning it yet, after only a few months of use the ceramic coating is flaking off.",
      "rating": 2.0,
      "verified": true,
      "author": "Chase.",
      "helpful_votes": 3,
      "publication_date": 20170407
    },
    {
      "title": "Awesome!",
      "text": "This is my first slow cooker and l absolutely love it! The fact that you can take out the cooking pan and put it on the stove top is just awesome and makes less to clean up. I've cooked 5 meals in it so far and in surprised at how easy it is to clean. I'm living by myself and I love how l can cook and freeze the leftovers, so easy!",
      "rating": 5.0,
      "verified": true,
      "author": "Green Blue",
      "helpful_votes": 3,
      "publication_date": 20170310
    },
    {
      "title": "This pot is hot and you can cook a lot!",
      "text": "Great Crock-Pot. Non-stick finish is great. Delivery was fast. You can put the Crock Pot insert right on the stove burner and brown meat. Then, place in the insert in the unit and let it continue cooking. The finish is delicate. When I was cleaning the insert, I got a very small nick in the finish on the first day. However, if you are careful, you'll have no problems. Don't use metal utensils.",
      "rating": 4.0,
      "verified": true,
      "author": "DM",
      "helpful_votes": 6,
      "publication_date": 20141006
    },
    {
      "title": "Time Time Time is on your Side!",
      "text": "Just did my first corned beef....house smells wonderful. Now I can set a more precise time. Old pot only had 2-6-8 hours timing, but this one allows for any times in increments of 30 minutes. Two heat levels. And next week, I'm going to use this metal bottomed pot to sear my pork chops before slow cooking them. What a smart feature!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170525
    },
    {
      "title": "Overall I love this crockpot and I am very very happy with ...",
      "text": "Pros:1. You can brown in the crockpot pot reducing the use of an extra pot. 2. If you add ingredients you take the crockpot pot out of the crockpot place it back on the stove to heat to boiling and then replace into crockpot reducing cooking time and time in the risky food safety temperature zone. 3. It’s not a Teflon type non stick but rather a sprayed on ceramic type material which is also non stick. (See the product description). Cons: the handles get hot so be sure to use oven mitts. Overall I love this crockpot and I am very very happy with my purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "inge",
      "helpful_votes": 0,
      "publication_date": 20180325
    },
    {
      "title": "Great Value and gives true meaning to one pot cooking",
      "text": "I purchased a slow cooker at William Sonoma for several hundred because of the various elements....browning, roasting etc. It worked right up until the warranty expired. I was thrilled when I found this Crock Pot at a much lower price that I could still make my one pot meals...it can go from your stove top right into the slow cooker. Great feature. Cleans up easily. Nice size for a family. Overall great product. Some of the recipes on their site are really good!",
      "rating": 4.0,
      "verified": true,
      "author": "PMP",
      "helpful_votes": 0,
      "publication_date": 20180201
    },
    {
      "title": "It's just great",
      "text": "I have made bread pudding in it sear my roast and stew meat on stove and then return insert to pot and added resdt of things set timer and cook speed started it and walk away until it was done. Everything thing so far has come out great and my husband loves the beef stew receipe that came with it. A winner all around",
      "rating": 5.0,
      "verified": true,
      "author": "Janet Harpster",
      "helpful_votes": 0,
      "publication_date": 20191208
    },
    {
      "title": "easy to set, easy to clean up, reliable cooking",
      "text": "this was a gift to my daughter and she hasn't stopped raving about it. she loves the programmable feature as she works and can serve her family a meal soon after she gets home. it's super easy to clean and easy to use. highly recommended! in fact, my pot is getting creaky and i'm thinking of getting one of these for myself.",
      "rating": 5.0,
      "verified": true,
      "author": "JudyReene",
      "helpful_votes": 2,
      "publication_date": 20161116
    },
    {
      "title": "Seems to only have one heat level.",
      "text": "Seems to only have one heat level. Even on “keep warm” it boils way too hot. Burning food several times. Wish I hadn’t chosen this one.",
      "rating": 2.0,
      "verified": true,
      "author": "Michael McCracken",
      "helpful_votes": 0,
      "publication_date": 20200618
    },
    {
      "title": "Crock-Pot for Cave Man",
      "text": "Cave Man say \"ugh.\" Translation \"This sophisticated modern device is very simple to use. Just set in big fire pit. Oops, no.\" This Crock-Pot saves time cooking various meals. Now, Cave Woman have more time to fetch water.",
      "rating": 5.0,
      "verified": true,
      "author": "Diieeego",
      "helpful_votes": 2,
      "publication_date": 20170111
    },
    {
      "title": "Disappointed",
      "text": "Ridiculous and completely unnecessary to put a sticker directly on the product. Now I have to spend time scrubbing the mess off. I haven’t used it yet, but the crock part is flimsy and disappointing compared to the 15 year old crockpot I am replacing. Seems like a cheap replacement, though it cost nearly three times as much.",
      "rating": 2.0,
      "verified": true,
      "author": "ANGELA",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "Great crock pot",
      "text": "This crock pot is so much better than the one I had. It is great for browning on the stove, and heats up fast in the unit. Because of the ceramic coating, it is light rather than so heavy like the old ones. And it cleans up like a breeze! You do have to use plastic utensils in it, but that's a small inconvenience compared to the improvements over the old style ones.",
      "rating": 5.0,
      "verified": true,
      "author": "Joy2U",
      "helpful_votes": 0,
      "publication_date": 20170201
    },
    {
      "title": "Makes great Pot Roast!",
      "text": "I have only cooked a pot roast, so far. Chile is next. Have no issues. Like the lighter insert and easy controls. Hope this Crock Pot lasts as long as my first one which I had since 1975!! Still was working when I donated it.",
      "rating": 5.0,
      "verified": true,
      "author": "John Simon Jr.",
      "helpful_votes": 0,
      "publication_date": 20190810
    },
    {
      "title": "Great new crock pot idea",
      "text": "Wow what a Gabe changer when it comes to making a one dish meal it is so nice to be able to use it on the stove stop to brown the meat. The only thing I would change is it would be nice to have a locking lid.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191123
    },
    {
      "title": "Too hot!",
      "text": "First use, I put chicken chili on Warm setting and it was simmering! Way too hot for Warm. I will try again and it I have better luck, I will revise my review. *Revised! After using it a few more times, that first use must have been a fluke. It has worked very well since!",
      "rating": 4.0,
      "verified": true,
      "author": "valtid",
      "helpful_votes": 4,
      "publication_date": 20160929
    },
    {
      "title": "I have washed lots of times and it just smells like a combination of everything I have ever cooked in ...",
      "text": "This may sound strange, but the pot itself stinks. I have washed lots of times and it just smells like a combination of everything I have ever cooked in it.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20170124
    },
    {
      "title": "I love it. It is relatively light to pick up",
      "text": "I love it. It is relatively light to pick up. The inside is so easy to clean. In my old one, I had to use liners every time. Not with this one. I have a glass cook top stove. I don't know if I can use it on that. If you know, please let me know. I would definitely buy this again.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170207
    },
    {
      "title": "Love love love",
      "text": "I am a crock pot fanatic! Given that I have broken a few in my time. I paid full price for this when it first came out. Have not been disappointed yet. Love the fact I can use it on my glass top stop for browning meat or whatever then slow cook all in same pot! Plus its super lightweight compared to my old ones!",
      "rating": 5.0,
      "verified": true,
      "author": "N. Jacobs",
      "helpful_votes": 3,
      "publication_date": 20151101
    },
    {
      "title": "I love this. Repurchased as I started my first on fire;)",
      "text": "would buy it again! it has saved me from switching pans so many times while I have to cook the meat and sautee the vegetables. whether I am cooking spaghetti or chilli or stew or even cheesy potatoes it's always nice that if it isn't quite done yet and I need it faster that I can just through it on the stove and finish it up and keep it warm for anyone that is late for dinner.",
      "rating": 5.0,
      "verified": true,
      "author": "kimber",
      "helpful_votes": 2,
      "publication_date": 20151216
    },
    {
      "title": "worked great! My other old slow cooker has only high ...",
      "text": "Used it for the first time last weekend for a chicken leek and barley dish, worked great! My other old slow cooker has only high or low setting. This one has those, but a count-down timer that works well, easy clean-up, and a good price.",
      "rating": 5.0,
      "verified": true,
      "author": "GG",
      "helpful_votes": 0,
      "publication_date": 20171108
    },
    {
      "title": "Disappointed",
      "text": "Bought this cooker less than four month ago. Used it several times and it seemed to work fine. Then it went out in the middle of cooking a meal and has not worked since. There was a slight burnt smell in the controls. We had to throw a away. Disappointed!",
      "rating": 1.0,
      "verified": true,
      "author": "Clifton T Smith",
      "helpful_votes": 4,
      "publication_date": 20170216
    },
    {
      "title": "not very happy about that since it's pretty much new and has ...",
      "text": "Have had this 3 months and used maybe 4 times and only once with the stovetop browning, go to use it today and notice the non stick coating is coming off in spots near the lid, not very happy about that since it's pretty much new and has been well cared for. Loved it until I noticed that!",
      "rating": 2.0,
      "verified": true,
      "author": "Rachel",
      "helpful_votes": 3,
      "publication_date": 20170822
    },
    {
      "title": "Low cook way too hot, warm function malfunction",
      "text": "My unit would now allow me to set the crock pot to warm manually. The only way it would set to warm is automatically after a cooking cycle was complete. The low setting way wayyyyy too hot.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190429
    },
    {
      "title": "Love that you can brown the meat on the stove top!",
      "text": "This is probably my fifth Crock-pot. I am a regular user because it fits my lifestyle. This one gets bonus points for 2 reasons - first, you can brown the meat in the crock-pot on the stove top. This saves dirtying another pan and you just take it off the stove and drop it into the base. Second bonus is the digital timing, my last crock-pot was just High/Low 4/8 hours. The digital timer allows many more options.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary S.",
      "helpful_votes": 0,
      "publication_date": 20190408
    },
    {
      "title": "Must have",
      "text": "I love this crockpot so much I've bought it for the lake house and our home...love being able to brown and do everything in one pot.",
      "rating": 5.0,
      "verified": true,
      "author": "Forrest",
      "helpful_votes": 0,
      "publication_date": 20200917
    },
    {
      "title": "Crock Pot EASE!!",
      "text": "I use this crock pot at least once a week - it is very simple to use - very simple to clean and very durable. I would definitely recommend this to anyone and I would certainly purchase it again.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181031
    },
    {
      "title": "Rain Drop, Crock-pot",
      "text": "So far, I like this crockpot. It cooks everything I need the best way possible, which is slow. I cook alot of chicken in this thing and its just awsome. Would highly recommend for those who wants food ready for them when they get home. Good buy",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180226
    },
    {
      "title": "Made very cheap!",
      "text": "It is made very cheap. The cover doesn't seem to fit right. The handles get very hot. I thought the inside was ceramic but it appears to have a teflon coating which I do not like.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190704
    },
    {
      "title": "Great Product",
      "text": "I love that I can brown the meats I’m slow cooking right in the vessel on top of the stove. It makes it for great flavor of the dish. The pot is very easy to clean also. Also you can finish the gravy on the stove also. Just use a silicone whisk, since the vessel will scratch using metal utensils. Also like the Keep Warm feature, that automatically turns on after the cooking process is done.",
      "rating": 5.0,
      "verified": true,
      "author": "Schlebusch",
      "helpful_votes": 0,
      "publication_date": 20191123
    },
    {
      "title": "LOVE IT!",
      "text": "First slow cooker purchase. Decided on this model after determining that the ability to brown the meat on the stove top in the same crock-pot was worth a few extra dollars. Have only made two dishes with it so far (a stew, and crock-pot lasagna), but both came out perfectly! Easy cleanup of the no-stick pot as well! (I followed the suggestion of cleaning it by hand instead of in the dishwasher). Highly recommend getting one if you are in the market.",
      "rating": 5.0,
      "verified": true,
      "author": "Anonymous",
      "helpful_votes": 0,
      "publication_date": 20160330
    },
    {
      "title": "BUYER BEWARE-DON'T WASTE YOUR MONEY",
      "text": "The base for this slow cooker is so thin, it seems like it won't last. The lid is too small & does not properly cover the food. This is just very poor quality. Buyer beware on this one!",
      "rating": 1.0,
      "verified": true,
      "author": "Marty Segal",
      "helpful_votes": 0,
      "publication_date": 20190815
    },
    {
      "title": "Very disappointed!",
      "text": "Bought this just a little over a year ago (so I'm outside the warranty) and the non-stick coating has started flaking off. I like that you can brown on the stove first, but very disappointed in the durability of the crock insert.",
      "rating": 1.0,
      "verified": true,
      "author": "Kyle",
      "helpful_votes": 4,
      "publication_date": 20161211
    },
    {
      "title": "The non-stick feature is fantastic for cleanup",
      "text": "The low setting cooks at a higher temp than older crock-pots (as most newer ones do), so I always cook on low. The non-stick feature is fantastic for cleanup! I've only used it once to sear meat (pork) on the stove before slow-cooking. It worked well.",
      "rating": 5.0,
      "verified": true,
      "author": "Erin K.",
      "helpful_votes": 0,
      "publication_date": 20160504
    },
    {
      "title": "Crockpot SCCPV1600S6QT",
      "text": "I upgraded from my old crockpot as wanted the added features.. I LOVE this Crockpot!!! It's much easier to place larger meats in do to the oval shape.. I only wish I had done this sooner.. Hubby is reaping the benefits and the dog too!",
      "rating": 5.0,
      "verified": true,
      "author": "Marilyn",
      "helpful_votes": 0,
      "publication_date": 20180308
    },
    {
      "title": "Love it!",
      "text": "I love this cooker. I didn't try the other functions, so I chose not to rate Versatility.",
      "rating": 5.0,
      "verified": true,
      "author": "Phoenyx Song",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "I love this slow cooker",
      "text": "I love this slow cooker. I love that the insert is ceramic coated instead of coated with the toxic nonstick stuff like the other brands. Ii is just as easy to sear on the stove top compared with doing it in the slow cooker unit itself. Very much an excellent slow cooker at a fraction of the price of the fancier ones.",
      "rating": 5.0,
      "verified": true,
      "author": "P. Hernandez",
      "helpful_votes": 0,
      "publication_date": 20160212
    },
    {
      "title": "Great Crock Pot.",
      "text": "I didn't think the stovetop browning would work, but everything that I've made in this crockpot from browning meat on the stove first for roast to smothered pork chops- this thing has worked beautifully. And cleaning it is so easy. Nothing sticks. I also love that when it's set for a cooking time, after that time is up it automatically sets to warm.",
      "rating": 5.0,
      "verified": true,
      "author": "Kat Pierce",
      "helpful_votes": 0,
      "publication_date": 20150104
    },
    {
      "title": "Pretty Good",
      "text": "It seemed to run a little hot the first few times, but now it seems to be ok. I do think that Keep Warm feature is too warm - had to take one star off for that. Otherwise, this slow cooker is great - has all the right features.",
      "rating": 4.0,
      "verified": true,
      "author": "R. Loy",
      "helpful_votes": 2,
      "publication_date": 20151005
    },
    {
      "title": "Love the Crock Pot!",
      "text": "Takes some getting use to cook times but works well",
      "rating": 5.0,
      "verified": true,
      "author": "B. Peden",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "Crockpot",
      "text": "not as heavy as old style....love being able to brown in the pot!!......SO FAR SO GOOD",
      "rating": 4.0,
      "verified": true,
      "author": "Cheryl Thon",
      "helpful_votes": 2,
      "publication_date": 20170709
    },
    {
      "title": "Best ever",
      "text": "Best crockpot ever. I love that I can use it on stove to sauté or brown the meat and then just transfer to slow cooking without having to change pots",
      "rating": 5.0,
      "verified": true,
      "author": "Lucia Bayne",
      "helpful_votes": 0,
      "publication_date": 20181019
    },
    {
      "title": "I love it!",
      "text": "You can brown your food on the stove and continue to cook it in the Crock-Pot . I call that one pot cooking.",
      "rating": 5.0,
      "verified": true,
      "author": "PatC",
      "helpful_votes": 0,
      "publication_date": 20190820
    },
    {
      "title": "Great for travel",
      "text": "Purchased for motorhome and love it. Easy to use and makes a great meal.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190503
    },
    {
      "title": "Meals come out really great and meats very tender",
      "text": "Wife loves this Crock-Pot! Much lighter weight than one that has been in the family for 40 years. Meals come out really great and meats very tender.",
      "rating": 5.0,
      "verified": true,
      "author": "R Brady",
      "helpful_votes": 3,
      "publication_date": 20170201
    },
    {
      "title": "A+",
      "text": "Use this 2-3 times per week. Love that I can sautéed on the stove top then place it in the crock pot warmer. So smart!",
      "rating": 5.0,
      "verified": true,
      "author": "Marketie Papantonis",
      "helpful_votes": 3,
      "publication_date": 20161009
    },
    {
      "title": "Lining has chipped",
      "text": "This product started off working well but then the lining started to chip away making it unusable. Unsure if I will buy this again.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191117
    },
    {
      "title": "I will keep the slow cooker but it does take a good amount of time to heat up",
      "text": "I read the reviews and was excited about my purchase. I will keep the slow cooker but it does take a good amount of time to heat up. The outside gets really hot to the touch. But it does the job and the price was good.",
      "rating": 3.0,
      "verified": true,
      "author": "Clara Bow",
      "helpful_votes": 0,
      "publication_date": 20170315
    },
    {
      "title": "Believe the hype! It's fantastic!",
      "text": "Oh my I LOVE this crock pot! I had been waiting for it to come out since it had the bottom where you could brown on the stove and then just drop it in the shell and continue cooking. It's a perfect size for making a large batch of beef Burgundy and it saves tons of time not having to clean other pots. The crock pot itself cleaned up super easily everything is nonstick in this crockpot! It's got a 20 hour timer and then switches to low automatically. Great for making those long cooking broths. I love this crockpot!",
      "rating": 5.0,
      "verified": true,
      "author": "Kristína Borbélyová",
      "helpful_votes": 0,
      "publication_date": 20141116
    },
    {
      "title": "Great crock pot....stove top dream",
      "text": "Great crock pot, the food is delicious and tender..love the stove top feature. made a rib-eye steak tonight and the depth kept the splatter down...was perfectly seared and was absolutely wonderful... cooked it even better then my George Foreman grill. Plus, clean up is a breeze....no sticking. Would recommend this to anyone...new to cooking to the advanced chef.",
      "rating": 5.0,
      "verified": true,
      "author": "Ohio'",
      "helpful_votes": 0,
      "publication_date": 20141010
    },
    {
      "title": "the look are great. The dish is actually metal (but looks like ...",
      "text": "Overall--the quality, the product, the look are great. The dish is actually metal (but looks like stoneware) and is very hot to the touch and it's also about .75 inch more shallow than my traditional crock--which is probably fine, yet the overall product is taller which created storage issues for my favorite shelf. I haven't tried it on the stove top yet, but I've bragged about it enough 3 friends have purchased it also.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170424
    },
    {
      "title": "Great buy shopped around for this one Amazon had best ...",
      "text": "Great buy shopped around for this one Amazon had best price the fact that you can sear the meat before on stove top and then straight to slow cooker great set up.",
      "rating": 5.0,
      "verified": true,
      "author": "Jimmy D.",
      "helpful_votes": 0,
      "publication_date": 20180418
    },
    {
      "title": "coating chipping",
      "text": "the coating on the inside of the pot is chipping off. only plastic spoon used to stir",
      "rating": 3.0,
      "verified": true,
      "author": "Ed",
      "helpful_votes": 4,
      "publication_date": 20161003
    },
    {
      "title": "perfect",
      "text": "best slow cooker we have ever had. Love it because you can place it on a stovetop.",
      "rating": 5.0,
      "verified": true,
      "author": "Tommy Herman",
      "helpful_votes": 0,
      "publication_date": 20181225
    },
    {
      "title": "happy with appliance",
      "text": "It works as expected. Not sure I want the auto shut off, but I dealt with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda Schafer",
      "helpful_votes": 2,
      "publication_date": 20170118
    },
    {
      "title": "This new pot works great and is very easy to use",
      "text": "I had an old round circa 1980's pot that sat unused for a very long time. This new pot works great and is very easy to use. I especially like that you can brown your meats first, then add your other ingredients all in the same pot.",
      "rating": 5.0,
      "verified": true,
      "author": "Brad",
      "helpful_votes": 0,
      "publication_date": 20180308
    },
    {
      "title": "Ceramic Coating Chipped",
      "text": "Loved that the pot can be used on the stove top, but unfortunately the coating was chipped in a couple of places on arrival. We did not use it right away and missed the return window. It has since chipped more. Very disappointed in the durability. Will definitely buy an item like this locally in the future to avoid having to ship returns.",
      "rating": 1.0,
      "verified": true,
      "author": "Jon",
      "helpful_votes": 0,
      "publication_date": 20181119
    },
    {
      "title": "Nice easy to use crockpot",
      "text": "I am very happy with this crockpot. I had a very expensive on with lot of electronics that quit working. This one is fairly simple. I love that the Pot can be used on the stove to brown meat before cooking!",
      "rating": 5.0,
      "verified": true,
      "author": "Sandie M.",
      "helpful_votes": 2,
      "publication_date": 20160610
    },
    {
      "title": "I like the idea that when you set the timer",
      "text": "I found that it worked perfectly. In fact, the meal I prepared in the crock pot was done before the scheduled time. I like the idea that when you set the timer, it did shut off.",
      "rating": 5.0,
      "verified": true,
      "author": "Von Yingling",
      "helpful_votes": 0,
      "publication_date": 20170913
    },
    {
      "title": "Stopped working",
      "text": "Really liked this Crockpot but it stopped working after a year and a half.",
      "rating": 1.0,
      "verified": true,
      "author": "Amanda Jost",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Excellent quality and value.",
      "text": "Great slow cooker for the price. I love that it is light weight. My daughter bought a much more expensive version from Williams Sonoma and this one is so much easier to clean because it doesn't weigh so much. It is plenty big enough to cook a whole chicken.",
      "rating": 5.0,
      "verified": true,
      "author": "doggymommy",
      "helpful_votes": 2,
      "publication_date": 20150221
    },
    {
      "title": "A great crock pot.",
      "text": "An excellent cooker. We love the ceramic/metal pot, it is much lighter than traditional crocks. Easier to clean too.",
      "rating": 5.0,
      "verified": true,
      "author": "PLBoyette",
      "helpful_votes": 0,
      "publication_date": 20170531
    },
    {
      "title": "It makes a good amount of soup",
      "text": "I love this Crock-Pot it makes a good amount of soup",
      "rating": 5.0,
      "verified": true,
      "author": "Courtney",
      "helpful_votes": 0,
      "publication_date": 20181212
    },
    {
      "title": "Finally a good croc pot",
      "text": "I hated the last croc pot I had for 9 years. Finally broke down and got this. Love the timer setting and the fact that this pot is light. I don't mind using my croc pot now!! :)",
      "rating": 5.0,
      "verified": true,
      "author": "GooGooDolphins",
      "helpful_votes": 0,
      "publication_date": 20170911
    },
    {
      "title": "Love it!",
      "text": "Has everything I need. Hi and low settings, turns to warm when time is up in case I get home later then I expected. Cleans up with a wipe and goes right into the dishwasher. I can make put the meal together the night before and put just the insert in the fridge. Take it out in the morning and turn it on. There's just two of us and I can make a smaller batch for us, but it's large enough to make enough for many.",
      "rating": 5.0,
      "verified": true,
      "author": "Martin P.Frasco",
      "helpful_votes": 0,
      "publication_date": 20150425
    },
    {
      "title": "Love it",
      "text": "The cast aluminium alloy insert is great !!! Can seat meat on stove top n put into slo cooker to finish up .",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200502
    },
    {
      "title": "So happy I bought this",
      "text": "So happy I bought this. I like to brown most of the meats that I cook in a slow cooker. This has eliminated one dirty pan to clean",
      "rating": 5.0,
      "verified": true,
      "author": "Carmen Blinn",
      "helpful_votes": 0,
      "publication_date": 20171223
    },
    {
      "title": "Crockpot",
      "text": "This product boils on all three settings even on warm. I had to return.",
      "rating": 1.0,
      "verified": true,
      "author": "Anne Neufer",
      "helpful_votes": 0,
      "publication_date": 20200430
    },
    {
      "title": "Great for cooking but not practical for gatherings where you ...",
      "text": "Gets way too hot. Boils on keep warm. Great for cooking but not practical for gatherings where you need to keep food warmed and served all day, it’ll burn",
      "rating": 3.0,
      "verified": true,
      "author": "Jake",
      "helpful_votes": 0,
      "publication_date": 20180108
    },
    {
      "title": "I love this. It's a great size for a 4 ...",
      "text": "I love this. It's a great size for a 4 person family. I love that you can put it directly on the burner!",
      "rating": 5.0,
      "verified": true,
      "author": "LDale",
      "helpful_votes": 0,
      "publication_date": 20161221
    },
    {
      "title": "I like this crock pot because you can brown meat on ...",
      "text": "I like this crock pot because you can brown meat on the stovetop before placing in the slow cooker which truly makes this a one pot meal!! We have only had this for a short time and used it about 3 times so far--- so far it is working out great. Very easy to use. I have no complaints. Price was also good and it shipped quickly.",
      "rating": 5.0,
      "verified": true,
      "author": "Ashy's mom",
      "helpful_votes": 0,
      "publication_date": 20141125
    },
    {
      "title": "Love it!",
      "text": "I LOVE this crockpot! I have seared my meats on this and then cooked for 6-8 hours, recipe came out great. It’s super easy to clean and easy to set up.",
      "rating": 5.0,
      "verified": true,
      "author": "Sheilla",
      "helpful_votes": 0,
      "publication_date": 20191018
    },
    {
      "title": "Five Stars",
      "text": "Should have many years of slow cooking with this crock pot.",
      "rating": 5.0,
      "verified": true,
      "author": "Janet M.",
      "helpful_votes": 0,
      "publication_date": 20180127
    },
    {
      "title": "Non-stick Coating Coming Off",
      "text": "UPDATE: Contacted customer service regarding warranty and was told the insert is not warranted, even though it does not say that on that warranty. Was told I could purchase a new insert for $15, then they said they had no new inserts in stock. I am very, very disappointed and would not recommend. I really liked this slow cooker, but after two uses the non-stick coating has begun to chip off. Of course we use only non-metal utensils in it, so I don't know why except it's poorly made. I want to return it.",
      "rating": 2.0,
      "verified": true,
      "author": "Mary A.",
      "helpful_votes": 5,
      "publication_date": 20161102
    },
    {
      "title": "Too hot",
      "text": "The lid doesn't fit properly, it cooks way too hot, and it's easy to burn yourself on.",
      "rating": 1.0,
      "verified": true,
      "author": "Bob",
      "helpful_votes": 3,
      "publication_date": 20171221
    },
    {
      "title": "Set it & forget it; come home & start eating.",
      "text": "Easy to use. Great size for the type or meat I cook in it.",
      "rating": 5.0,
      "verified": true,
      "author": "Cale",
      "helpful_votes": 0,
      "publication_date": 20180311
    },
    {
      "title": "Too hot",
      "text": "lots, lots hotter than our old crock pot. We have over cooked every thing we have made so far. On low, it boils our gravy for the roast. Little too hot for a slow cooker.",
      "rating": 2.0,
      "verified": true,
      "author": "keyman",
      "helpful_votes": 0,
      "publication_date": 20160322
    },
    {
      "title": "Finish chipped",
      "text": "Loved the cook top feature so bought one. After the first roasting chicken, using only wood tools, there were three chips of the enamel finish. Returned it for a full refund.",
      "rating": 2.0,
      "verified": true,
      "author": "billinwv",
      "helpful_votes": 0,
      "publication_date": 20160303
    },
    {
      "title": "Terrible product and overheats on all settings and customer service didn't care in the least!!!!",
      "text": "I would give this product 0 stars if i could! Worst Product I've ever bought, burns everything and has no low or warm functions! Customer service wanted me to do all kinds of tests with a thermometer and basically told me because I bought it 2 months ago it was my problem unless I could prove it! I will never buy another crock-pot product! Was disappointed with amazon as well because it was a christmas gift and wasn't opened right away and was passed the 1 month return policy and they wouldn't take it back either. Very disappointing situation!",
      "rating": 1.0,
      "verified": true,
      "author": "Brian",
      "helpful_votes": 13,
      "publication_date": 20161028
    },
    {
      "title": "Excellent crock-pot. The name is changed from Rival which ...",
      "text": "Excellent crock-pot. The name is changed from Rival which we had for 20 years and still working. I hope this unit works for 20 years.",
      "rating": 5.0,
      "verified": true,
      "author": "Larry",
      "helpful_votes": 0,
      "publication_date": 20170321
    },
    {
      "title": "Easy to use and clean",
      "text": "I love the stovetop compatibility. The liner is not very heavy either. The crockpot runs very hot, though. Keep an eye on it!",
      "rating": 4.0,
      "verified": true,
      "author": "Eric",
      "helpful_votes": 0,
      "publication_date": 20160826
    },
    {
      "title": "browning on stove",
      "text": "Love this crockpot! I've used it more than a dozen times and love that I can take the inset out and brown the meat/veggies then place it in the crockpot and cook away! It also has a \"warm\" setting so once cooked, you can continue keeping the food warm until time to eat! Definitely LOVE this!",
      "rating": 5.0,
      "verified": true,
      "author": "Diane M.",
      "helpful_votes": 0,
      "publication_date": 20181222
    },
    {
      "title": "Very nice crockpot",
      "text": "I like the timer feature and keep warm ability. The pot is very lightweight and very easy to clean. I would recommend purchasing this crockpot.",
      "rating": 5.0,
      "verified": true,
      "author": "Lori",
      "helpful_votes": 0,
      "publication_date": 20200210
    },
    {
      "title": "Ability to brown meat on the stove within its own pot makes this a win for us.",
      "text": "The ability to brown meat inside the pot on the stove top works better than we had hoped. A time saver and cleanup saver too. Controls simple, works fine, nice price. Definite win for us.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazorro",
      "helpful_votes": 0,
      "publication_date": 20160308
    },
    {
      "title": "GREAT BUY",
      "text": "EXCELLENT. ESPECIALLY THE FACT THAT IT TURNS OFF AUTOMATICALLY WHEN SET.",
      "rating": 5.0,
      "verified": true,
      "author": "Willa",
      "helpful_votes": 0,
      "publication_date": 20171017
    },
    {
      "title": "I do like the feature of browning things first on the stove ...",
      "text": "I purchased this crock-pot solely because I felt the one I currently used got too hot. Sadly this one does the same. It is boiling on the low setting. My food is always overlooked even if I cut the suggested time. I do like the feature of browning things first on the stove but so far I have not been pleased with the results of this \"slow\" cooker. 😡😡",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 8,
      "publication_date": 20161106
    },
    {
      "title": "Does not last",
      "text": "This pot was used about 2 times a month and only lasted 7 mo . It no longer works. !",
      "rating": 2.0,
      "verified": true,
      "author": "Colette C.",
      "helpful_votes": 0,
      "publication_date": 20200327
    },
    {
      "title": "Would definitely recommend",
      "text": "Great product. So convenient being able to sear meat/vegetables in the pot before slow cooking.",
      "rating": 5.0,
      "verified": true,
      "author": "Bev",
      "helpful_votes": 0,
      "publication_date": 20180105
    },
    {
      "title": "Crock-Pot",
      "text": "Love that the liner can be used on a stove to brown meat.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Fulks",
      "helpful_votes": 0,
      "publication_date": 20161201
    },
    {
      "title": "Love it!",
      "text": "I love this crockpot. Now I can set the timer and forget about watching the clock. No more overdone food.",
      "rating": 5.0,
      "verified": true,
      "author": "Marilyn B. Hughes",
      "helpful_votes": 0,
      "publication_date": 20190505
    }
  ],
  "product_meta": {
    "title": "Crock-Pot SCCPVI600-S 6-Quart Countdown Programmable Oval Slow Cooker with Stove-Top Browning, Stainless Finish",
    "description": "Color:StainlessCleaning\nHow do I care for my removeable stoneware?\n1.Do not preheat the slow cooker\n2.Your Crock-Pot Slow Cooker makes a great server for hot beverages or dips. Keep it on the low setting to maintain the proper serving temperature\n3.A Crock-Pot Slow Cooker does not have direct heat at the bottom. Therefore, always fill the stoneware at least half full to conform to recommended times. If you fill the stoneware less than half full, please note that cooking time will be affected",
    "rating": 4.4,
    "feature_bullets": [
      "Ceramic-coated pot can be used for stove-top browning and then placed in the slow cooker",
      "Digital timer counts down cooking time; program cooking time from 30 minutes to 20 hours",
      "6-quart slow cooker serves 6+ people",
      "Removable, dishwasher-safe stoneware insert, and dishwasher-safe locking glass lid",
      "Recipes included"
    ],
    "specifications": {
      "Product Dimensions": "9.9 x 15.2 x 15.1 inches",
      "Item Weight": "7.98 pounds",
      "Manufacturer": "Jarden Consumer Solutions",
      "ASIN": "B00IPENZK0",
      "Domestic Shipping": "Item can be shipped within U.S.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S. Learn More",
      "Item model number": "SCCPVI600-S",
      "Customer Reviews": "4.4 out of 5 stars692 ratings4.4 out of 5 stars",
      "Best Sellers Rank": "#20,073 in Kitchen & Dining",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "May 1, 2014"
    },
    "categories": [
      "Home & Kitchen",
      "Slow Cookers",
      "Small Appliances",
      "Kitchen & Dining"
    ],
    "price": 79.99
  }
}