{
  "website_summaries": [
    {
      "verdict": "If you're looking for an easy-to-use Geiger counter that can take continuous data and download it, this is a convenient and inexpensive way to do it.",
      "pros": [
        "Data can be recorded continuously and downloaded elsewhere",
        "Charges via USB",
        "Features audio and visual signals",
        "Price is very reasonable"
      ],
      "cons": [
        "Some people have had trouble integrating it with their computers"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "This device looks very good, seems to measure the background radiation and the ...",
      "text": "This device looks very good, seems to measure the background radiation and the interface is simple but easy to read I also liked to computer interface. HOWEVER, when I tried to put it close to a standardized radiation source with 3000 cpm (one typically used for industrial Geiger Counters), it did not even react to it!!! If the manufacturer will get to me and explain or direct me what I did wrong, I would be more than happy to change the review. Right now, I am not confident if the device really works.",
      "rating": 2.0,
      "verified": true,
      "author": "Roman Vlkolinsky",
      "helpful_votes": 59,
      "publication_date": 20171113
    },
    {
      "title": "It works.",
      "text": "I've had it several months now, running continuously on the adapter. I can't attest to its accuracy, but it immediately detected my (slightly radioactive) thoriated TIG tungstens. I feel better with this device sitting quietly in the corner, with its alarm set to five times normal background. Update: Here it is with my sister's Terra rad detector, both sitting on the same pack of radioactive TIG rods. At these low doses, radiation is inherently random, which is probably why the readings fluctuated by about ten percent over time. Nonetheless, the two machines agreed closely enough that I couldn't tell which one read consistently higher. The simplest explanation is that both detectors work properly.",
      "rating": 5.0,
      "verified": true,
      "author": "Gordon",
      "helpful_votes": 10,
      "publication_date": 20171225
    },
    {
      "title": "Dead after using 3 times",
      "text": "Owned for a couple months, third time I went to use the device it is stuck in a reboot loop. Banner displays, reboot, banner displays reboot. Only way to stop it is pulling the battery. If I put the battery back in it stays off until I turn it on and immediately enters reboot loop. Battery is fully charged, even verified with multimeter. Save yourself the trouble and buy a different brand.",
      "rating": 1.0,
      "verified": true,
      "author": "Plain Truth",
      "helpful_votes": 14,
      "publication_date": 20170527
    },
    {
      "title": "Good for the price",
      "text": "A no-frills, hand-held portable Geiger Counter. Pluses: + Functional, fairly accurate, and good response time + Lightweight and portable + Simple operation + Choice of multiple scales, digital, and graphic display + Data logging feathre + Battery rechargeable through USB port Minuses: - Plastic build doesn't feel very solid -- don't drop it - No external sensor tube; No indication of where the sensor tube is located - Programming is confusing and not intuitive For $90 it's not a bad deal, and it does what it's supposed to. But it's really more of a kid's laboratory demonstration unit, than a professional measuring device.",
      "rating": 4.0,
      "verified": true,
      "author": "Dr HTop Contributor: Photography",
      "helpful_votes": 3,
      "publication_date": 20190403
    },
    {
      "title": "Bad manual, iffy buttons, battery won't discharge below 80%.",
      "text": "I liked the recording feature. Very hard to start using. Manual was incomplete or poorly written. Entry into menu system was consequently difficult. Battery came charged to 80%. Meter subsequently shut off at 80% battery charge. Meter had recorded readings from 7 months ago. Perhaps it was previously used, charged to 80%, returned, stored 6 months, sold to me? The meter stopped working after recording 255 counts per minute, while sitting at my residence where previous readings averaged 26-36 com. Portable, rechargeable, inexpensive, recording accumulated counts/dose. If I could get it replaced with one that had a good manual and all the features worked I would be very happy!",
      "rating": 1.0,
      "verified": true,
      "author": "Mark A. Huebner",
      "helpful_votes": 4,
      "publication_date": 20180527
    },
    {
      "title": "Looks a little cheap, but very nice unit",
      "text": "Excellent design and functionality. Although the case and general look do seem to be \"cheap\" the reality is that this just makes the unit light weight, and since you own a Geiger counter for that rare event, light weight means you'll have it with you. The menu is intuitive. Lots of options. No CPS mode, but CPM is fine for a unit like this. Will measure in all the popular units. Great backlight. The battery is rechargeable, but also looks like a standard AA in a clip inside, so I suspect it is readily replaceable should the need arise. Very satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "SchmidtD",
      "helpful_votes": 4,
      "publication_date": 20160223
    },
    {
      "title": "Front panel functions became disabled",
      "text": "Product worked fine out of the box, then next day the front panel buttons became disabled and would not allow any user input. The screen would flash 320 v4 and would go blank much like it was stuck in an endless system reboot loop. Went online to the manufacturers product support and it appears many people had the same problem with no resolution offered. Problem looks like it has been around for 2 years and mfgr has not fixed it.",
      "rating": 1.0,
      "verified": true,
      "author": "R",
      "helpful_votes": 3,
      "publication_date": 20190210
    },
    {
      "title": "Stopped working 5 days after the return window closed.",
      "text": "Just over 30 days after receiving this unit, a blank line has appeared across the screen so I can no longer see any of the readings. I have attached a picture. Unfortunately, this occurred five days after the return window for the item closed. I do not recommend this item.",
      "rating": 1.0,
      "verified": true,
      "author": "Runner10",
      "helpful_votes": 5,
      "publication_date": 20181106
    },
    {
      "title": "Great for the price",
      "text": "This is a great low-cost counter for the casual hobbyist. I have tried it on some old radium-containing plastic and a little 1mR/hr (milli Roentgen per hour) gamma source and it definitely works. If you are hoping to use it to test Fukushima-contaminated salmon, you need to put the aluminum salad strainer back on over your head, get on Wikipedia and read about how radioactive isotopes work, how much radiation we all receive naturally from our environment every day and stop living in fear.",
      "rating": 5.0,
      "verified": true,
      "author": "X-Ray Guy",
      "helpful_votes": 5,
      "publication_date": 20160305
    },
    {
      "title": "did not work",
      "text": "Could hear glass rattling around in it before I even opened the shipping box - opened batter compartment and glass shards fell out from the busted radiation detector tube thing or whatever inside that made it work - confirmed by ordering a uranium ore sample - still nothing but 0 readings from the unit using a know radiation calibration sample - busted on arrival - attempting return",
      "rating": 1.0,
      "verified": true,
      "author": "DNSHAT",
      "helpful_votes": 3,
      "publication_date": 20181003
    },
    {
      "title": "Very nice unit",
      "text": "You definitely can't go wrong buying one of these for home use. It has a few quirks but the features make up for it. When turning it on you have to hold the button for just the right amount of time. It's a little frustrating if you haven't used it in awhile and don't remember that. But if you haven't used it in awhile don't worry about the battery. Even after sitting for almost a year it didn't need charging. The software and data logging are a great bonus.",
      "rating": 5.0,
      "verified": true,
      "author": "Mango",
      "helpful_votes": 4,
      "publication_date": 20170203
    },
    {
      "title": "I like it",
      "text": "I like the unit. About 2 minutes is required for the reading to stabilize (required of any counter since the particles stuck the detector at random intervals. I wish it came with the printed manual. The sheet included only points you a website to download a manual. The USB port is the mid-sized type that is not used much. I would prefer that used the micro USB as in phones. The display is clear and bright. The speaker is easily heard. Battery seems to have a good life.",
      "rating": 5.0,
      "verified": true,
      "author": "Abc",
      "helpful_votes": 0,
      "publication_date": 20180714
    },
    {
      "title": "Great Product",
      "text": "I'm a member of a Gem & Mineral Society and am often asked to check if specimens are radioactive. This unit is perfect that task.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Gans",
      "helpful_votes": 5,
      "publication_date": 20170303
    },
    {
      "title": "Stopped working - PLEASE READ BEFORE BUYING",
      "text": "5 Days after the return deadline and it stops working - it comes on, but no detection. A few other reported this so I assumed it was exception and not the rule. You are risking your money with this item.",
      "rating": 1.0,
      "verified": true,
      "author": "Bushman",
      "helpful_votes": 4,
      "publication_date": 20190521
    },
    {
      "title": "VERY PLEASED",
      "text": "IT IS COMPACT. IT SENSES BACKGROUND RADIATION WELL. EASY READOUT. A RECHARGEABLE AAA BATTERY INCLUDED AND CHARGING CABLE. I CHARGED IT AND PUT IT AWAY FOR OVER A WEEK. IT STILL READ 100% CHARGED. QUITE A FEW READOUT TYPES. GRAPHS, NUMBERED COUNT RATE, ETC. WELL BUILT. FOR THE PRICE IT IS HARD TO BEAT. I DID NOT HAVE OPPORTUNITY TO TEST IT ON A PROPANE LANTERN MANTLE OR ANYTHING. SORRY.",
      "rating": 5.0,
      "verified": true,
      "author": "BOB. I've just received 2 more chargers. we call them the \"hot\" chargers. they charge things really fast.  They are made for the Raspberry pi and we have 2 running on them. Working great. ",
      "helpful_votes": 3,
      "publication_date": 20170104
    },
    {
      "title": "Parts missing. Item has to be returned.",
      "text": "Did not come with all the parts, e.g. 2 electrical contacts missing, an instructional CD was missing, a black bag was missing.",
      "rating": 1.0,
      "verified": true,
      "author": "frikadeller",
      "helpful_votes": 2,
      "publication_date": 20200119
    },
    {
      "title": "Definitely works",
      "text": "I have not used the fancy features, but I did test it with a Uranium test source I ordered from United Nuclear (see photo) and also a veterinarian took it into a radioactive iodine isolation ward, said it hit >200cpm when he opened the isotope freezer.",
      "rating": 5.0,
      "verified": true,
      "author": "Akom",
      "helpful_votes": 3,
      "publication_date": 20180220
    },
    {
      "title": "Just in case",
      "text": "This is a strait forward detector. It is easy to set up and use. I am a little sad they charge to download the programming that allows you do pull data from your detector. I still give it 5 stars because it works well. I just wish they were more up front about the software and if they were that would have been good customer service.",
      "rating": 5.0,
      "verified": true,
      "author": "Gardner",
      "helpful_votes": 0,
      "publication_date": 20181129
    },
    {
      "title": "Broken display",
      "text": "Mine came with a bad display, showed only a portion of the screen. From what I was able to see it measures the radioactivity with some degree of consistency, the device is super light (like an empty plastic box or a kid’s toy), I am giving 2 stars because it look like it was functioning except for the display. Returned it for refund.",
      "rating": 2.0,
      "verified": true,
      "author": "cyo",
      "helpful_votes": 0,
      "publication_date": 20181109
    },
    {
      "title": "Great Geiger Counter at a low cost.",
      "text": "All the bells and whistles and a low price to boot. For the price it can't be beat. Does everything I expected it to do. USB connection to the computer, rechargeable battery and a decent software app. Love all the menus to customize my readout. I would recommend this counter to anyone concerned about radiation. You could pay much more and not get the all the features this one has.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. Russell",
      "helpful_votes": 0,
      "publication_date": 20170402
    },
    {
      "title": "Seems to work well and is easy to use.",
      "text": "I brought back some sand where nuclear testing had been done decades before and my wife was worried. The meter showed it was very low background. I can't have a way of checking accuracy so lefty it blank.",
      "rating": 5.0,
      "verified": true,
      "author": "A Small Change",
      "helpful_votes": 0,
      "publication_date": 20200516
    },
    {
      "title": "Good while it worked.",
      "text": "Initially I liked it for the money. After a year it stopped detecting. I have used it maybe 10-20 hours. I suspect the tube has gone bad. The manufacturer has not been helpful.",
      "rating": 2.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 0,
      "publication_date": 20190902
    },
    {
      "title": "It works.",
      "text": "- 1 star for very strange battery indicator, when charging it shows 100%, but when you unplug you may see 30% leaving you puzzled is it completely charged or not - 1 star for the case, should be made little bit more stronger.",
      "rating": 3.0,
      "verified": true,
      "author": "Alex Smith",
      "helpful_votes": 0,
      "publication_date": 20190109
    },
    {
      "title": "Small little radiation detector for a great price.",
      "text": "I have used the detector for a month now. Had one glitch. They need the manufacturer to use a better battery box. Great customer service department.",
      "rating": 4.0,
      "verified": true,
      "author": "Herbert Smit",
      "helpful_votes": 3,
      "publication_date": 20170408
    },
    {
      "title": "Well made good investment",
      "text": "Well made, honestly have not used it. Got it for prepper storage. Hope I will never need.",
      "rating": 5.0,
      "verified": true,
      "author": "Batfire",
      "helpful_votes": 2,
      "publication_date": 20180423
    },
    {
      "title": "I have to conclude that it is a poor quality product or maybe this unit is defective",
      "text": "I had high expectations for this product but it broke very quickly. It was on when received and I turned it off when going to a different location. Now it won't turn on again for more than one second and it shuts off again right away each time. The battery is fully charged. I have to conclude that it is a poor quality product or maybe this unit is defective, or both. The instructions included with the unit don't provide a customer service phone number. I want a refund and plan to try a different product.",
      "rating": 1.0,
      "verified": true,
      "author": "CaliforniaGuy",
      "helpful_votes": 14,
      "publication_date": 20160717
    },
    {
      "title": "Would like to give 5 stars but would need this thing ...",
      "text": "If it is accurate and works 3 stars. Mine constantly shuts off and won't reboot until the battery is dead. I tried to fix the battery and there is some spacer that wont let the battery come out. Would like to give 5 stars but would need this thing to work all the time",
      "rating": 2.0,
      "verified": true,
      "author": "Will",
      "helpful_votes": 2,
      "publication_date": 20170903
    },
    {
      "title": "Nice Unit for the Money, does the job, but seems rather fragile.",
      "text": "A lot of features for the money, but the case isn't very rugged, I would avoid dropping it. Still, it beats having to pay $800 for something comparable. Sensitive enough to pick up our background radiation and worked well with a uranium check sample. Checking our tuna fish just in case, and we're ready if someone drops the big one!",
      "rating": 4.0,
      "verified": true,
      "author": "Carol Thomas",
      "helpful_votes": 0,
      "publication_date": 20160826
    },
    {
      "title": "Does what it is supposed to do at a good price.",
      "text": "Tested this with two different radioactive samples. The Uranium sample lit off this thing big time. I had a lower reading from an isotope that was supposed to be safe. It reads background radiation all the time. I believe it is sensitive enough to provide most amateur users the information they may need in case of some unwanted exposure.",
      "rating": 5.0,
      "verified": true,
      "author": "amxcoder",
      "helpful_votes": 0,
      "publication_date": 20160324
    },
    {
      "title": "Very inexpensive and surprisengly good counter.",
      "text": "Good inexpensive counter. Shows slight increase when placed on my granite counter tops. Base level fluctuates around 17-24. Quality is good while display is clear. My coworker has identical one - only older and they pretty much track.",
      "rating": 5.0,
      "verified": true,
      "author": "Jerzy Z Potopowicz",
      "helpful_votes": 2,
      "publication_date": 20161107
    },
    {
      "title": "Fun Geiger Counter",
      "text": "Great little tool. Easy and convenient. Fits in shirt pocket. Battery charges quickly and holds charge for a long time. Haven't found anything of note yet except for a spot on my granite countertop that gets up to 40 cpm which is still not dangerous. Normal reading is around 20 cpm.",
      "rating": 5.0,
      "verified": true,
      "author": "edweinb",
      "helpful_votes": 0,
      "publication_date": 20171217
    },
    {
      "title": "Well made meter",
      "text": "This meter works very well. As explained by BPEarthwatch, this meter is easy to use and doesn't seem to use much battery and stays running a long time.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190302
    },
    {
      "title": "5star",
      "text": "Good product, good to have. Came packaged nicely. Just what we expected.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190201
    },
    {
      "title": "Works",
      "text": "Tested with samples, works, I know I can depend on it if I need it. Software for the PC is jank to say the least, but that was just something to play with for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Pam P.",
      "helpful_votes": 0,
      "publication_date": 20200207
    },
    {
      "title": "Yes it clicks!",
      "text": "I always wanted a Geiger counter, mainly as a toy, but one never knows when or if it will be a vital survival tool. This has many more features than I needed, and is a great buy for the money",
      "rating": 5.0,
      "verified": true,
      "author": "Hubert Lee Allen Jr",
      "helpful_votes": 0,
      "publication_date": 20171017
    },
    {
      "title": "Easy to use and read",
      "text": "This counter is very easy to use and read but unfortunately (or thank God I should say) it is measuring a very low levels so I don't have the chance to see if there is a higher level radiation and I hope I will never be able to do so",
      "rating": 5.0,
      "verified": true,
      "author": "Alfeca",
      "helpful_votes": 0,
      "publication_date": 20171203
    },
    {
      "title": "i'm waiting for good weather to explore with it",
      "text": "a new hobby for me. i'm waiting for good weather to explore with it.",
      "rating": 4.0,
      "verified": true,
      "author": "john ",
      "helpful_votes": 0,
      "publication_date": 20180417
    },
    {
      "title": "It does the job",
      "text": "I use this device to check my food for radioactive residue from Fucashima.",
      "rating": 5.0,
      "verified": true,
      "author": "Geoffrey Campbell",
      "helpful_votes": 0,
      "publication_date": 20190402
    },
    {
      "title": "Long battery life, stable operation.",
      "text": "I like being able to download the results. However the viewing software is flaky and freezes after every download.",
      "rating": 4.0,
      "verified": true,
      "author": "J. E. Yurkon",
      "helpful_votes": 0,
      "publication_date": 20200804
    },
    {
      "title": "Not bad",
      "text": "Affordable, seems to work, fairly easy to use, seems to have long battery life",
      "rating": 4.0,
      "verified": true,
      "author": "ILikeMIDI",
      "helpful_votes": 0,
      "publication_date": 20200224
    },
    {
      "title": "Not Sure...",
      "text": "I don't know if this is good or not. It never reads above 25 CPM but our local Nuclear Emergency Tracking Center monitor typically has a value between 150 and 200 CPMs. LOL...I hope this unit has the correct value.",
      "rating": 3.0,
      "verified": true,
      "author": "Steve",
      "helpful_votes": 0,
      "publication_date": 20160924
    },
    {
      "title": "... the argon gass out so it still worked just fine just give it better tube and it would have ...",
      "text": "geiger muller tube is made from weak glass came a little busted but not enough to let the argon gass out so it still worked just fine just give it better tube and it would have got 5 stars",
      "rating": 4.0,
      "verified": true,
      "author": "cody austin",
      "helpful_votes": 0,
      "publication_date": 20170617
    },
    {
      "title": "Amazing instrument, plain residential consumer use for extreme emergency",
      "text": "Received, did initial count background reading. Sure is different from Geiger counters of 1980! Use to work for the old Victoreen nuke monitor company in Cleveland. Wonder 'where' the 'ion' chamber is ? Lol, have not done anything else with it, hope never have to use with North Korea threats. I wonder where I could get it calibrated or 'checked for accurate reading. Nuke plant QC worker here",
      "rating": 5.0,
      "verified": true,
      "author": "Bruce Romano",
      "helpful_votes": 0,
      "publication_date": 20171028
    },
    {
      "title": "It actually works?!",
      "text": "I bought a vial of sample uranium ores(compilation) and needed to test them, so I decided to get this todo just that. Which it actually worked for the low price it is I'd recommend it",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan Guerrero",
      "helpful_votes": 2,
      "publication_date": 20160127
    },
    {
      "title": "Best quality in 100 to 250 ra ge with feature rich options",
      "text": "Best value for the money. Has a doimeter and a variety of measure units to choose from. Can print to excel.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171029
    },
    {
      "title": "Great for folks that love physics.",
      "text": "I love this little thing. The software works well and it is really easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff Lesof",
      "helpful_votes": 2,
      "publication_date": 20170124
    },
    {
      "title": "It did what I wanted it to do.",
      "text": "Took this Geiger counter to the atomic bomb Trinity site Oct open house at White Sands New Mexico and it read above average radiation just fine. It was going off pretty constantly. Then when home, loaded PC software, downloaded the saved file through USB port and examined it with date and time marks. It did the job! Top measurement... .116mR/HR",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel L. Miller",
      "helpful_votes": 0,
      "publication_date": 20171024
    },
    {
      "title": "Review of: GQ GMC 320+",
      "text": "On initial start up will start beeping and act like your sitting in a radioactive dump, after a minute or two, will level out. Will last a long time on single charge, lots of nice features",
      "rating": 4.0,
      "verified": true,
      "author": ":DAK",
      "helpful_votes": 0,
      "publication_date": 20170514
    },
    {
      "title": "it works.",
      "text": "Having only seen and used the older models that had a swing needle and hand held wand, I was very pleasantly surprised to find an all inclusive unit. One less item to forget when packing or traveling. As for it working, I have used it on the sample I purchased, as for other sources, I have not detected any yet. But as long as it detects that sample, it means its working correctly.",
      "rating": 4.0,
      "verified": true,
      "author": "Alfred M Granberry",
      "helpful_votes": 4,
      "publication_date": 20150902
    },
    {
      "title": "Use mine daily.",
      "text": "More features than you can shake a stick at. Sturdy, well thought out, and easy to use. I use mine daily.",
      "rating": 5.0,
      "verified": true,
      "author": "John L Bales",
      "helpful_votes": 0,
      "publication_date": 20160422
    },
    {
      "title": "Works great.",
      "text": "Works great. Driving through Shelbyville, TN it started beeping and going crazy. I eventually turned around and went back but it stayed low, not sure what caused it, kinda scary.",
      "rating": 5.0,
      "verified": true,
      "author": "john",
      "helpful_votes": 0,
      "publication_date": 20180606
    },
    {
      "title": "Screen failing",
      "text": "Screen started to flicker in and out literally the 3rd time I turned it on. Hopefully replacement is better",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190713
    },
    {
      "title": "Doesnt come with car charger adopter or wall plugin, however still good product",
      "text": "they say it comes with car plug adopter and wall plug in had both were missing or its just false advertizing! how ever the product is perfect. for the price. just wished it came with what was featured in the ad!",
      "rating": 5.0,
      "verified": true,
      "author": "gary w.",
      "helpful_votes": 0,
      "publication_date": 20190512
    },
    {
      "title": "I very pleased with its feature and ease of use",
      "text": "The radiation detector performs as expected. I very pleased with its feature and ease of use.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171117
    },
    {
      "title": "Five Stars",
      "text": "Great device for the rock hound. Light weight and compact.",
      "rating": 5.0,
      "verified": true,
      "author": "J Walker",
      "helpful_votes": 0,
      "publication_date": 20171031
    },
    {
      "title": "Four Stars",
      "text": "It gives me the data I want, which would be a visual alert.",
      "rating": 4.0,
      "verified": true,
      "author": "Jerry Thomas Ridley",
      "helpful_votes": 2,
      "publication_date": 20161030
    },
    {
      "title": "bad detection tube",
      "text": "the detection tube filament broke 2 weeks after the return date and I can't find a replacement any where on the internet. It's like they are pushing buying a new one instead of having readily available replacement that fits in the socket.",
      "rating": 1.0,
      "verified": true,
      "author": "reginald h.",
      "helpful_votes": 3,
      "publication_date": 20171029
    },
    {
      "title": "Great Counter!!!",
      "text": "What a great Geiger Counter. Very easy to use, and read.",
      "rating": 5.0,
      "verified": true,
      "author": "Jimmy Rants",
      "helpful_votes": 0,
      "publication_date": 20171215
    },
    {
      "title": "Nice product with poor accompanying PC software",
      "text": "Nice product, but poor accompanying software to PC. Downloading data from GM<C-320 is very long, PC USB driver very often stops after self-changing of virtual COM port number, no clear graph digram for the collected data.",
      "rating": 3.0,
      "verified": true,
      "author": "Andy 52",
      "helpful_votes": 4,
      "publication_date": 20170330
    },
    {
      "title": "Five Stars",
      "text": "Very nice for the price. I would feel better if I knew the accuracy of the device.",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan Robinson",
      "helpful_votes": 0,
      "publication_date": 20180307
    },
    {
      "title": "Awesome product and seller",
      "text": "I also have the Soeks unit and this one is hands down much better. Love the USB data logging features and the Li Ion rechargeable battery.",
      "rating": 5.0,
      "verified": true,
      "author": "Harry A. McColl",
      "helpful_votes": 0,
      "publication_date": 20170511
    },
    {
      "title": "Really good counter",
      "text": "Best counter under a jillion bucks. Modifiable (minor soldering) to accept the famous Russian SBM-20 tube.",
      "rating": 5.0,
      "verified": true,
      "author": "CrazyBassman",
      "helpful_votes": 0,
      "publication_date": 20180101
    },
    {
      "title": "Highly recommended",
      "text": "Nice and compact. Great data logging capabilities as well. Much better than the old CDV-700 civil defense units.",
      "rating": 4.0,
      "verified": true,
      "author": "Bob",
      "helpful_votes": 0,
      "publication_date": 20170613
    },
    {
      "title": "Arrived quickly and works great!",
      "text": "Works GREAT! No dangerous radiation sources found in my home.",
      "rating": 5.0,
      "verified": true,
      "author": "Dennis W",
      "helpful_votes": 0,
      "publication_date": 20160304
    },
    {
      "title": "Good little unit",
      "text": "I like it. It works good. It took a little time connecting the Pro software to the Geiger counter. it works now. I goes a little crazy the the Anti-Virus software updates.",
      "rating": 4.0,
      "verified": true,
      "author": "William W",
      "helpful_votes": 4,
      "publication_date": 20150804
    },
    {
      "title": "Five Stars",
      "text": "Excellent battery life. Went off when placed against a smoke detector.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180213
    },
    {
      "title": "Was great for 6 months.",
      "text": "It worked for 6 months and now constantly reboots with \"GMC-320 (+V4)\" on the screen. I think it is a great product when it was working. No issues there.",
      "rating": 2.0,
      "verified": true,
      "author": "trent",
      "helpful_votes": 0,
      "publication_date": 20170604
    },
    {
      "title": "A very nice unit I am very pleased with it having tested ...",
      "text": "A very nice unit I am very pleased with it having tested it on some thoriated tungsten welding rods and various other background levels.",
      "rating": 5.0,
      "verified": true,
      "author": "Alan Lavender",
      "helpful_votes": 2,
      "publication_date": 20170304
    },
    {
      "title": "This thing seems to work just fine. I typically wander around a nuclear waste site ...",
      "text": "This thing seems to work just fine. I typically wander around a nuclear waste site where things are supposed to be \"controlled.\" I use some old thorium lantern mantles to calibrate (actually just to see if its working) before I leave the office. I don't trust anyone anymore and I feel much better having this little chirper in my pocket. It doesn't do much for neutrons, but if you are worried about neutrons then there are other reasons you should be worrying. Also it's a good idea not to have the sound turned on if you are going into a radiologically controlled area, as it makes people nervous. The battery life has been very good.",
      "rating": 4.0,
      "verified": true,
      "author": "Axeman",
      "helpful_votes": 3,
      "publication_date": 20150907
    },
    {
      "title": "great unit when working with a computer",
      "text": "fast service, great unit when working with a computer, excellent conditions, good price.",
      "rating": 5.0,
      "verified": true,
      "author": "Martin Lundquist",
      "helpful_votes": 0,
      "publication_date": 20170603
    },
    {
      "title": "Easy to use and compact",
      "text": "Easy to use and compact, as opposed to the civil defense era surplus equipment. I would have given it 5 stars if it had replaceable batteries instead of a rechargeable one...",
      "rating": 4.0,
      "verified": true,
      "author": "Robert O.",
      "helpful_votes": 0,
      "publication_date": 20160516
    },
    {
      "title": "This is a fine product that lives up to expectations",
      "text": "This is a fine product that lives up to expectations. Computer interface, great battery, saves a log, satisfying clicks or silent mode. I have no way to calibrate it but am pleased withe the sensitivity.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161207
    },
    {
      "title": "Always wanted one",
      "text": "Always wanted one haven't found anything radio active thank god!",
      "rating": 3.0,
      "verified": true,
      "author": "Ronj",
      "helpful_votes": 0,
      "publication_date": 20170613
    },
    {
      "title": "Bum battery.",
      "text": "The rechargeable battery is dead. I have to keep it plugged in to use it.",
      "rating": 3.0,
      "verified": true,
      "author": "wyzowl",
      "helpful_votes": 0,
      "publication_date": 20170910
    },
    {
      "title": "Good things come in small packages",
      "text": "For the price and size, it is amazing. Works well for gamma radiation. I had just finished a nuclear stress test when I received the device and it was a bit scary to see the reading when I first picked it up. I'm impressed.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160806
    },
    {
      "title": "NIce product, fast shipping",
      "text": "NIce product, fast shipping. Christmas gift for my retired geologist Dad. Said he never knew such a thing existed. He was happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Armand",
      "helpful_votes": 0,
      "publication_date": 20170108
    },
    {
      "title": "Great!",
      "text": "Works great, beeped a lot by my old dishes, hmmm...",
      "rating": 5.0,
      "verified": true,
      "author": "Joe S.",
      "helpful_votes": 0,
      "publication_date": 20161012
    },
    {
      "title": "Works just fine for a monitoring system for particle events",
      "text": "Works just fine for a monitoring system for particle events. CPM's tell you how much radiation your getting around your home or office.",
      "rating": 5.0,
      "verified": true,
      "author": "Side One 1",
      "helpful_votes": 0,
      "publication_date": 20171211
    },
    {
      "title": "Four Stars",
      "text": "great product but won't charge any battery/found out too late",
      "rating": 4.0,
      "verified": true,
      "author": "tony",
      "helpful_votes": 0,
      "publication_date": 20150926
    },
    {
      "title": "Great unit!",
      "text": "Great functionality for the price! The sensibility is a bit low, but the Geiger sensor can be replaced easily to fit your requirements.",
      "rating": 5.0,
      "verified": true,
      "author": "Vilen77",
      "helpful_votes": 0,
      "publication_date": 20161018
    },
    {
      "title": "Nice instrument, seems to work fine",
      "text": "Nice instrument, seems to work fine. I've tried it with some known radioactive test sources, and the reading line up nicely.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20160524
    },
    {
      "title": "Do not purchase",
      "text": "Does not work. Checked with real sample and counter does not read correctly. Did not test with verified sample until the return window closed.",
      "rating": 1.0,
      "verified": true,
      "author": "James Hanover",
      "helpful_votes": 0,
      "publication_date": 20180703
    },
    {
      "title": "Will not detect ore sanple",
      "text": "Will not detect uranium ore I ordered from Amazon via Images SI INC. I think someyhing is wrong with my ore sample.",
      "rating": 4.0,
      "verified": true,
      "author": "MONK",
      "helpful_votes": 0,
      "publication_date": 20150923
    },
    {
      "title": "Excellent tool",
      "text": "Works perfectly. Tested it on some stuff at work and it performed flawlessly",
      "rating": 5.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20160813
    },
    {
      "title": "Would not recommend. Software doesn't work",
      "text": "Would not recommend. Software doesn't work. Company offers no support. Won't answer the phone. Email reply says to read the book. What book?",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 14,
      "publication_date": 20160305
    },
    {
      "title": "Good and not so much",
      "text": "This is a nice unit but the software was so flaky i.e. sometime it would work other time it would drive me up the wall, no matter what computer I used...Really wanted to give 5 it stars",
      "rating": 3.0,
      "verified": true,
      "author": "Equate Null",
      "helpful_votes": 5,
      "publication_date": 20151121
    },
    {
      "title": "Satisfied Customer",
      "text": "A fun gadget. Great support from GQ Electronics when I had a question.",
      "rating": 5.0,
      "verified": true,
      "author": "M",
      "helpful_votes": 0,
      "publication_date": 20170529
    },
    {
      "title": "Junk.",
      "text": "The unit was for all practical purposes DOA. It would power up but there was no measurement of background radiation as the enclosed instructions said there would be. Held it up in front of the 36\" CRT television tube and again, no measurement at all. All scales indicated 0 at all times. I would expect that each unit's calibration would be checked before it left the manufacturer. Alas, all the corners cut just to save a dime.",
      "rating": 1.0,
      "verified": true,
      "author": "Critter",
      "helpful_votes": 5,
      "publication_date": 20161103
    },
    {
      "title": "Fukushima is Leaking - Be Ready",
      "text": "Nice unit. Easy to operate and easy to carry. I don't have a source to check the accuracy, but it seems to be accurate for background radiation in my area. I think it's worth the price. . . :^)",
      "rating": 5.0,
      "verified": true,
      "author": "R A Rodriguez",
      "helpful_votes": 0,
      "publication_date": 20150903
    },
    {
      "title": "Seems to be an awesome geiger counter for a good price",
      "text": "To be honest I can't tell how well it works as I don't have a radiation source to test with but it seems to pick up background radiation just fine. And for the price, it can't be beat.",
      "rating": 5.0,
      "verified": true,
      "author": "Don Powell",
      "helpful_votes": 0,
      "publication_date": 20150407
    },
    {
      "title": "Small and elegant.",
      "text": "I love my geiger counter. I have become aware of regional background radiation and radioactive products in my environment. This unit is small enough to carry on a small bag or purse.",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy B. Adams",
      "helpful_votes": 0,
      "publication_date": 20150709
    },
    {
      "title": "good unit at low cost.",
      "text": "I bought this to monitor radiation levels after radioactive iodine treatment. The unit functions as advertised. It was great being able to track and minimize any potential risk of exposure to my family.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20160216
    },
    {
      "title": "... sister and she has never told me if she liked it or not so I will go with she ...",
      "text": "I ordered this for my sister and she has never told me if she liked it or not so I will go with she liked it.",
      "rating": 4.0,
      "verified": true,
      "author": "Arthur Jackson",
      "helpful_votes": 0,
      "publication_date": 20160716
    },
    {
      "title": "Five Stars",
      "text": "Works as good as the bug $$$ Geiger Counters. I highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Reginald Carstairs",
      "helpful_votes": 0,
      "publication_date": 20150922
    },
    {
      "title": "manual useless.",
      "text": "No expert, seems to function, strap was not attached properly, manual useless.",
      "rating": 4.0,
      "verified": true,
      "author": "Ddw",
      "helpful_votes": 3,
      "publication_date": 20150430
    },
    {
      "title": "Takes a couple second to get a reading but fine for the price",
      "text": "My father had radioactive iodine. This worked as described. Takes a couple second to get a reading but fine for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe Buyer",
      "helpful_votes": 0,
      "publication_date": 20151231
    },
    {
      "title": "We were extremely disappointed in both the geiger counter and the customer support ...",
      "text": "We were extremely disappointed in both the geiger counter and the customer support to address a number of issues. The CD that accompanied the product would not load. The literature that accompanied the product referenced websites to obtain a user manual, none of the websites could be accessed. The home page for the product lacked any means to downloading a user manual. When we tried to contact the company by phone, we could not get anyone to answer - we made repeated calls and still no one answered. The product may be good, but with the lack of support and instructions, we would not recommend it. We returned it for a refund.",
      "rating": 1.0,
      "verified": true,
      "author": "Donna H",
      "helpful_votes": 31,
      "publication_date": 20150407
    },
    {
      "title": "Better safe than sorry!",
      "text": "I purchased this out of curiosity more than anything. A week after moving into a year lease, the Aliso Canyon Gas Leak erupted in my neighborhood (yay). There were a lot of scary reports floating around on the internet, so I ordered this to see for myself. I'm no expert in radioactive readings, but I found this meter to be east to use and well made. The clicking noise is eerie, like something straight out of a movie. I'm happy I bought it, because the readings never went crazy and neither did I.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris H",
      "helpful_votes": 0,
      "publication_date": 20160427
    },
    {
      "title": "He says it is easy to use",
      "text": "My husband likes his new radiation detector. He says it is easy to use. We check items that come from other countries, and even fish items from Wal-Mart, just to see how much Japan's nuclear accident has affected the fish and tuna in the Pacific Ocean.",
      "rating": 5.0,
      "verified": true,
      "author": "RixxJerr",
      "helpful_votes": 0,
      "publication_date": 20150414
    },
    {
      "title": "Awesome little unit for the price",
      "text": "For the money, this is a really nice little Gamma/Beta detector. It's not as accurate as a $3k Ludlum scintillator but it's really good enough for a rough idea of what low level gamma/beta you're being exposed to. And at this price, you're not as worried about getting it wet/breaking it.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael H.",
      "helpful_votes": 0,
      "publication_date": 20160819
    }
  ],
  "product_meta": {
    "title": "GQ GMC-320Plus Fulfill Nuclear Radiation Detector Meter Test Equipment",
    "description": "The GQ gmc-320-plus digital Geiger counter is the latest GMC-320Plus Fulfill developed by GQ electronics LLC, USA. as an enhanced version of gmc-300e Plus, it has larger internal Flash memory to facilitate data processing capability. It also has temperature sensor & electronic gyroscope, LCD contrast control, front LED indicator, analog data port output, new graphic Type. this product can be used for industrial, commercial or Test equipment, such as universities, laboratories, environment evaluation measurement, hospital research, scientific analytical applications, antique evaluation, building material testing research and so on. comparing to other brand products, the most prominent advantages of this product are: having most features and cost effective. It also has unique features, such as, record data first play it back later; open protocol for easy application integration; visualize real-time graph, data logging. portable and convenient with built-in audible and visual signals, it features automatic data recording. It is able to continually monitor the radiation and log the data each second into internal memory. When connected to a PC, GQ software can download the radiation history data to the computer and the user is able to analyze those data later. The device uses USB port for communication and power. The internal battery can be charged via wall adapter or car adapter. Using the adapters, continuous data monitoring is possible and no worry about batteries charge or any data loss. The main board has a real time clock for time related data logging purposes. the USB port communicates with GQ gmc-320 Plus soft Geiger counter software and GQ Geiger counter data viewer software. For professional data logging, an more advanced version, may be purchased at low cost from gq. .",
    "rating": 4.3,
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "5.9 x 5.3 x 1.6 inches; 8.01 Ounces",
      "Item model number": "GMC-320Plus Fulfill",
      "Batteries": "14500 Lithium ion batteries required.",
      "Date First Available": "February 1, 2014",
      "Manufacturer": "GQ Electronics",
      "ASIN": "B00I8GQ1EC",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}",
      "GTIN": "723794243537 , 608939448889"
    },
    "categories": [
      "Occupational Health & Safety Products",
      "Industrial & Scientific",
      "Hazardous Material Handling",
      "Radiation Protection Supplies"
    ],
    "price": 89.0
  }
}