{
  "website_summaries": [
    {
      "verdict": "An inexpensive, high-quality starter kit for those who want to try something new.",
      "pros": [
        "A great 10-piece set for beginners",
        "Icing bags included"
      ],
      "cons": [
        "Plastic couplers must be purchased separately",
        "Instruction pamphlet is very basic"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Good quality. Nice set",
      "text": "Good quality. Nice set. doesn't come with a connector, but you just drop the tip into the baking bag, then draw it back and cut a hole big enough to allow the very tip through, but not enough for the entire tip to slip through the hole. Then you put in the frosting.",
      "rating": 5.0,
      "verified": true,
      "author": "Eli",
      "helpful_votes": 19,
      "publication_date": 20160605
    },
    {
      "title": "Easy & Fun to Use - Frosted Cookies Never Looked Better",
      "text": "These don't come with the connector piece, but it's not necessary to have it. We used them to frost Christmas cutout cookies with buttercream frosting. They were easy to fill and use to decorate - even my 5-year-old niece had no problem squeezing the frosting out onto her cookies. I chose this set because of how many different tips were included, and that worked out really well. They make very pretty designs. I'm not a good decorator and grew up just spreading the buttercream on with a knife, so this was a big step up for me - my cookies never looked better! Looking forward to practicing more with them.",
      "rating": 5.0,
      "verified": true,
      "author": "vinaigrettchen",
      "helpful_votes": 2,
      "publication_date": 20181223
    },
    {
      "title": "Love the variety of tips",
      "text": "This kit had everything I needed (except for the coupler Wilton 411-7367, that was really useful too). I made cookie monster cupcakes and the specialty grass tip made it very simple. The specialty grass tip was expensive by itself, so I was glad to find it in this kit where a bunch of other tips and piping bags were included too. The other tips were fun to play with, I was able to pipe some flowers and shells.",
      "rating": 5.0,
      "verified": true,
      "author": "AH",
      "helpful_votes": 8,
      "publication_date": 20170510
    },
    {
      "title": "Perfect for beginners!",
      "text": "I am a beginner at piping cupcakes and bought this set to try it out! It’s amazing and very simple to use for beginners! I highly recommend for the price and amount of bags and tips that are included! Great value for your money!",
      "rating": 5.0,
      "verified": true,
      "author": "Carolyn",
      "helpful_votes": 3,
      "publication_date": 20191120
    },
    {
      "title": "I must say that this product is very easy and fun to use",
      "text": "I'm not an expert in decorating cakes and cupcakes. However, I must say that this product is very easy and fun to use. First time, I tried this kit to decorate my cupcakes for the Valentine's Day, using mascarpone base cream. They came out not only delicious, but very beautiful. The only issue I had was with changing tips. Later, I bought Twist Coupler System and it solved my issue. Thank you for a great product!",
      "rating": 5.0,
      "verified": true,
      "author": "Anna",
      "helpful_votes": 8,
      "publication_date": 20150312
    },
    {
      "title": "No more messy clean up",
      "text": "Great to pipe frosting for gingerbread houses and Christmas cookies.",
      "rating": 5.0,
      "verified": true,
      "author": "Joie",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "Great versatile set for the baker looking to expand their skills",
      "text": "My wife is going to be super happy with this purchase. She is looking to dabble in cake making and this set provides what she needs a more. With ten different cake making icing tips, and 10 12\" bags, this is the one stop shop set. Can't wait to see what cakes she makes!",
      "rating": 5.0,
      "verified": true,
      "author": "iProDrone",
      "helpful_votes": 3,
      "publication_date": 20151218
    },
    {
      "title": "Good value",
      "text": "Worked great. Lots of bags, able to use a variety of colors. Wish there was a version that wasn't so slippery.",
      "rating": 4.0,
      "verified": true,
      "author": "Dorothy L Blakeslee",
      "helpful_votes": 0,
      "publication_date": 20180810
    },
    {
      "title": "Cupcake Tips and bags",
      "text": "These are amazing! Bags are strong and sturdy and tips are easy to use and the tip designs are beautiful 💕",
      "rating": 5.0,
      "verified": true,
      "author": "TrannyMagic",
      "helpful_votes": 0,
      "publication_date": 20191221
    },
    {
      "title": "Let the Fun Begin!",
      "text": "Looking forward to making fun creations with my granddaughter using the Wilton decorating kit.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathryn Nicolato",
      "helpful_votes": 0,
      "publication_date": 20200228
    },
    {
      "title": "Worth it",
      "text": "Bought these to decorate cookies. They were fun to use and survived kids from 4 to 13 years old using them.",
      "rating": 4.0,
      "verified": true,
      "author": "Mel Y.",
      "helpful_votes": 0,
      "publication_date": 20190101
    },
    {
      "title": "Wiltons cake decorating tried & true.",
      "text": "Been using these products for 40+ years. Never use any other.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe Blaquiere",
      "helpful_votes": 0,
      "publication_date": 20190305
    },
    {
      "title": "Love Wilton!",
      "text": "I am a big Wilton fan. Never dissappointed by their product.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristin",
      "helpful_votes": 0,
      "publication_date": 20181219
    },
    {
      "title": "Perfect set for beginners.",
      "text": "Bought this set for my daughter's cupcake project. This kit comes with everything to get her started with decorating cupcakes. You only need to supply the cupcakes and the frosting. She didn't do anything fancy like multiple colors so it worked fine. You can use other types of disposable bags besides Wilton. Just make sure they are good quality. One thing she did mention is if the frosting,buttercream, icing is too thick or coarse, some of the tips may not work well.",
      "rating": 5.0,
      "verified": true,
      "author": "Wil",
      "helpful_votes": 2,
      "publication_date": 20160614
    },
    {
      "title": "Five Stars",
      "text": "Now I can go back to what I used to do",
      "rating": 5.0,
      "verified": true,
      "author": "Sandi L.",
      "helpful_votes": 0,
      "publication_date": 20170626
    },
    {
      "title": "Inexcusable",
      "text": "I ordered this to give as a gift and it arrived in a perfect box, but the Wilton Box inside was smashed beyond belief. I then had to make my way to find another gift to give! Totally inexcusable!",
      "rating": 1.0,
      "verified": true,
      "author": "LL55",
      "helpful_votes": 3,
      "publication_date": 20150924
    },
    {
      "title": "I love this set!",
      "text": "I ordered this so I could frost cupcakes for my son's first birthday party. I was amazed at how easy this was to use. I am not a professional baker and had no clue how to ice cupcakes when I ordered this. The product is so easy to use that it had me feeling like I could compete on Cupcake Wars. I did make my own frosting and of course, I watched YouTube videos before using. I love this and plan on baking more often!",
      "rating": 5.0,
      "verified": true,
      "author": "Brenda W.",
      "helpful_votes": 44,
      "publication_date": 20160723
    },
    {
      "title": "Perfect",
      "text": "This is the perfect little starter kit! I've made 2 cakes since I purchased this kit and it helped tramendously. If you are a beginner make sure you grab like 4 or 5 couplers so you can change the tips on the bags!",
      "rating": 5.0,
      "verified": true,
      "author": "Justine P",
      "helpful_votes": 10,
      "publication_date": 20151003
    },
    {
      "title": "Great beginners package for someone who doesn't bake a lot",
      "text": "I don't bake a lot. Somehow in my last move, I lost my container of piping supplies. Never fear, Wilton is here! This package was perfect. The price was right, the piping heads are perfect for cupcakes and cakes. And I have a love affair with their disposable piping bags. They are durable and easy to use. Its a great set for anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Lbatt",
      "helpful_votes": 0,
      "publication_date": 20190314
    },
    {
      "title": "By far my favorite bags to pipe frosting.",
      "text": "By far my favorite bags to pipe frosting. They are thick enough to not rip and minimize over heating the frosting. Theses provide amazing control for frosting without making it runny.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200919
    },
    {
      "title": "Squeezing Out Some Fun",
      "text": "Excellent kit for a beginner. Though the included pamphlet is basic, it is very helpful when you are just getting started. Since it includes an assortment of 10 tips, you have the ability to try techniques which are more advanced than simple writing and borders. In addition to cakes and pastries, my deviled eggs look as good as they taste!",
      "rating": 5.0,
      "verified": true,
      "author": "LekoDude",
      "helpful_votes": 2,
      "publication_date": 20160124
    },
    {
      "title": "OK",
      "text": "It wasn't quite what I thought it would be and my granddaughters had a bit of a problem using them.",
      "rating": 3.0,
      "verified": true,
      "author": "suzieq",
      "helpful_votes": 0,
      "publication_date": 20181230
    },
    {
      "title": "Just What I Needed",
      "text": "This Buttercream Basics Kit is just what I needed for my baking requirements. Nice quality, easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe E. Strange",
      "helpful_votes": 0,
      "publication_date": 20171011
    },
    {
      "title": "... our sons first birthday cake and it worked out great! Highly recommend",
      "text": "Bought this set to make our sons first birthday cake and it worked out great! Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "SK",
      "helpful_votes": 0,
      "publication_date": 20180728
    },
    {
      "title": "Great tip set",
      "text": "They do the job perfectly, easy to clean and I like the size of the bags.",
      "rating": 5.0,
      "verified": true,
      "author": "Joanna Miller",
      "helpful_votes": 0,
      "publication_date": 20191127
    },
    {
      "title": "Four Stars",
      "text": "Good beginning kit. I suggest if you are in to more elaborate decorating, this might not be enough.",
      "rating": 4.0,
      "verified": true,
      "author": "Naomi E.",
      "helpful_votes": 0,
      "publication_date": 20180224
    },
    {
      "title": "The booklet inside is in a very small print. ...",
      "text": "The booklet inside is in a very small print. I dont wear glasses and yet its hard to read when you are in the middle of decorating. I should've bought the regular reusable kit .",
      "rating": 3.0,
      "verified": true,
      "author": "rafi",
      "helpful_votes": 2,
      "publication_date": 20150505
    },
    {
      "title": "recipient is very happy. It's just the basics",
      "text": "Purchased as a gift, recipient is very happy. It's just the basics, but that's all most people would need.",
      "rating": 5.0,
      "verified": true,
      "author": "Brad and Pam",
      "helpful_votes": 0,
      "publication_date": 20160128
    },
    {
      "title": "Exactly as pictured. Makes decorating cakes a lot easier ...",
      "text": "Exactly as pictured. Makes decorating cakes a lot easier than the non-professional set I had before. Difference is night and day.",
      "rating": 5.0,
      "verified": true,
      "author": "FC",
      "helpful_votes": 2,
      "publication_date": 20150904
    },
    {
      "title": "Four Stars",
      "text": "Great beginner set I bought for my niece! She loved it!",
      "rating": 4.0,
      "verified": true,
      "author": "Vickie",
      "helpful_votes": 0,
      "publication_date": 20151030
    },
    {
      "title": "LOve tge set it has all I need",
      "text": "LOve tge set it has all I need. It arrived timely..however... the box was smashed and good thing the tips are metal cuz plastic would have broken.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160104
    },
    {
      "title": "Works well",
      "text": "I don't pipe much. This does the trick for me when I feel like adding an extra touch to decorating some of my baking. Can't go wrong with Wilton products.",
      "rating": 5.0,
      "verified": true,
      "author": "Felix",
      "helpful_votes": 0,
      "publication_date": 20201125
    },
    {
      "title": "Great beginner set! So fun.",
      "text": "This was a birthday present to me from my parents. I wanted it to practice for fun, and I love it! Don't think I could have found a better beginner set. Tools I recommend to get along with this kit: - Wilton Standard Couplers: Makes the decorating tip changing process SO easy!!! Plus you get to try out all of the decorating tips (except for the two large ones - couplers will not work with those) on one piping bag and save piping bags that way. - Flower nail: Making roses is much easier on one of those and is something a beginner should have anyway, in my opinion. Wilton provides quality products. I definitely recommend.",
      "rating": 5.0,
      "verified": false,
      "author": "Jaime",
      "helpful_votes": 2,
      "publication_date": 20190418
    },
    {
      "title": "Five Stars",
      "text": "Value for money and great for a first timer! Came with some piping bags to start you with.",
      "rating": 5.0,
      "verified": false,
      "author": "Anesidora SG",
      "helpful_votes": 0,
      "publication_date": 20160812
    },
    {
      "title": "very nice",
      "text": "i got my package today and its great ! it comes with everything as the picture shows and im ready to start decorating ! :)",
      "rating": 5.0,
      "verified": false,
      "author": "Stephanie ",
      "helpful_votes": 0,
      "publication_date": 20140725
    }
  ],
  "product_meta": {
    "title": "Wilton Beginning Buttercream Decorating Set, 20-Piece Cake Decorating Kit",
    "description": "No more pipe dreams, this is the real deal for beginning decorators. With these cake decorating supplies, you'll be able to practice and perfect your piping skills using buttercream icing. This Wilton cake decorating set includes: 10 decorating tips, 10 disposable decorating bags and illustrated cake decorating techniques.",
    "rating": 4.6,
    "feature_bullets": [
      "Learn and practice all kinds of piping designs with this Beginning Buttercream Decorating Set",
      "The perfect starter set for aspiring decorators",
      "Comes with 10 decorating tips, including round, star, petal, leaf and specialty; 10 disposable decorating bags and illustrated icing techniques",
      "Material: Tips are stainless steel; disposable decorating bags are plastic",
      "Tips are top-rack dishwasher safe; however for best results, wash in warm, soapy water before first and after each use"
    ],
    "specifications": {
      "Product Dimensions": "0.99 x 0.99 x 1.75 inches",
      "Item Weight": "0.16 ounces",
      "Manufacturer": "Wilton",
      "ASIN": "B00IE6Z4OO",
      "Domestic Shipping": "Item can be shipped within U.S.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S. Learn More",
      "Item model number": "2104-1367",
      "Customer Reviews": "4.6 out of 5 stars250 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#16,168 in Kitchen & Dining",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "February 11, 2014"
    },
    "categories": [
      "Home & Kitchen",
      "Decorating Tools",
      "Icing Dispensers & Tips",
      "Bakeware",
      "Kitchen & Dining"
    ],
    "price": 13.59
  }
}