{
  "website_summaries": [
    {
      "verdict": "Everything you need in a bed frame for a value price. Adjustable design is flexible for years of use, regardless of the size you choose.",
      "pros": [
        "A rugged frame that stands out for adjustability",
        "Fits mattresses from full to king",
        "Made of steel for lasting durability",
        "Lower price"
      ],
      "cons": [
        "It won't work with some headboards because screw patterns don't align",
        "It sometimes squeaks"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "IF I COULD GIVE 0 STARS I WOULD",
      "text": "I put together this bedframe last night and it took about 45 min - hour. Not bad. What im LIVID about is that I ordered the queen frame & there are \"queen\" stickers all over the frame indicating it is for a queen sized bed, but my queen box spring does not fit. The frame is not wide enough. Do you know how much energy I put into putting that stupid frame together at almost 30 weeks pregnant? And in order to get a refund its expected to take it apart and ship it back? Ridiculous. I do not recommend and I'm really curious to know how all these people with good reviews got their bed to fit.",
      "rating": 1.0,
      "verified": true,
      "author": "SLIMRAERAE",
      "helpful_votes": 133,
      "publication_date": 20190221
    },
    {
      "title": "Perfect!",
      "text": "Solid and easy!!! I'm pregnant and this really wasn't hard to construct as the unit just fit together and the directions were clear. May people complained it's shorter than expected, but it seems perfect to me ( I'm 5'8\"). In fact the bedskirt barely touches the floor! I am completely satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "Annerbelle",
      "helpful_votes": 86,
      "publication_date": 20170824
    },
    {
      "title": "Watch out for BAD SPOT WELDS!",
      "text": "It's a decent adjustable bed frame, as long as you receive one that doesn't have a broken weld. Seems to be very sturdy and intelligently designed. It was very easy to put together, however the first frame I ordered had a bad spot weld. Amazon was great in sending out a new frame, but it was very inconvenient to tear down my Select Comfort air mattress, disassemble the bad frame, reassemble the new one and put everything back together. Not to mention the new frame had a bent rail that needed straightening. Also, good luck fitting a defective frame back into the original box without tearing up the cardboard. Make sure you check all the spot welds before assembly!",
      "rating": 3.0,
      "verified": true,
      "author": "SHAWMAN",
      "helpful_votes": 247,
      "publication_date": 20160215
    },
    {
      "title": "Easy, Good and affordable.",
      "text": "I was scared when I started putting everything together cause I thought it was going to be too smal but after I finished it was perfect for my queen bed, very easy to assemble.",
      "rating": 5.0,
      "verified": true,
      "author": "Ross A.",
      "helpful_votes": 70,
      "publication_date": 20170811
    },
    {
      "title": "Extremely easy - tools included",
      "text": "These Were great, when the box arrived I was kinds questionable, but they are sturdy and setting them up was extremely easy, the tools are included all together it took about 5 minutes to put together. I purchased two of these to use for the foundation/framing of a king size bed.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 189,
      "publication_date": 20160909
    },
    {
      "title": "Easy peasy assembly",
      "text": "Easily assembled even by a single person as long as you know how to follow directions. It has accompanying pictures that were helpful in illustrating what the next step should look like. Remember to unscrew the middle screws and pull the bars apart to its maximum length. If you skip this step, you'll end up with a base that's 1-2\" shorter than what you'll need for a queen bed. It came in a compact package which made it easy to haul into the bedroom. It's sturdy, had all its parts for assembly, and works just as it should. Along with having it delivered to your doorstep, It's unbeatable for its price!",
      "rating": 5.0,
      "verified": true,
      "author": "Lena's Mum",
      "helpful_votes": 132,
      "publication_date": 20160503
    },
    {
      "title": "So so easy to put together",
      "text": "So so easy to put together. Crazy easy even with one person (getting the mattress on was way harder!). I almost didn't believe my queen would fit on here, but it does absolutely PERFECTLY. It is so sturdy, and there's enough room to store things underneath my bed. Love this product. Amazing for the price. Tip: put a fitted sheet over your box spring before you put the mattress over. Its a way easier way to hide the box spring and it looks so tidy if you choose a color that complements your other bedding!",
      "rating": 5.0,
      "verified": true,
      "author": "Customer",
      "helpful_votes": 42,
      "publication_date": 20180627
    },
    {
      "title": "Adjustable Steel Bed Frame",
      "text": "Super easy to put together and very sturdy support for my king size box spring and mattress. Also, the price can't be beat. One recommendation to any future purchasers: if you think you ever might want to move the bed after you've assembled it, place some furniture sliders under all of the legs before you put the box spring and mattress in place. It is impossible to move otherwise without taking the mattress off.",
      "rating": 5.0,
      "verified": true,
      "author": "mreda",
      "helpful_votes": 111,
      "publication_date": 20160907
    },
    {
      "title": "Simple and sturdy.",
      "text": "Great frame. Easy to put together and all the correct parts were included. I thought it was a little low to the ground, but after putting the box spring and pillow-top mattress on, I was happy the frame wasn't any higher. I have wood floors so I'm glad the legs have rubber padding.",
      "rating": 5.0,
      "verified": true,
      "author": "Natasha",
      "helpful_votes": 70,
      "publication_date": 20161209
    },
    {
      "title": "Not your average bed frame!",
      "text": "So I know it is just a bed frame, an item I've purchased and assembled at least 10 other times, but I have to say that for the money I paid, this bed frame blew past my expectations. First, the quality of the bed frame and assembly is very high. Leaps and bounds over all other metal bed frames I've assembled. Second, the thought put into this frame from the design to the very clear instructions, to the magnetic anti-slip pads that came with this frame had me wondering how much I had actually paid and to my surprise, this was no more then other far less quality frames. Great job Zinus and thank you.",
      "rating": 5.0,
      "verified": true,
      "author": "Raymond Lane",
      "helpful_votes": 39,
      "publication_date": 20180101
    },
    {
      "title": "Doesn’t work with 2 box springs for California King due to design issue",
      "text": "I really was excited about this bed frame. It was simple and easy to set up, even had markings where the California King setting was for my California King bed. I set it up with no issues or problems. When I went to set the box spring down that is when I saw there was a problem. It will not expand wide enough for a California King and my box springs were left looking like a tee pee. The center support legs block it from fully extending. :(",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 46,
      "publication_date": 20180120
    },
    {
      "title": "I wish I purchased a normal, traditional metal bed frame",
      "text": "If you need a metal bed frame, consider purchasing a normal, standard one instead of this one. A standard, traditional metal bed frame is sturdy and, importantly, doesn't require nuts and bolts and can be assembled/unassembled in about 60 seconds. Quick, easy and effective. THIS bedframe is over complicated for no reason. Three separate parts fold out and extend, require a dozen bolts and at least 20 minutes to assemble. Then, when you move, it will take another 20 minutes and you have to save and keep tabs of all the special bolts. I don't get it: there is no value to complicating something so simple.",
      "rating": 1.0,
      "verified": true,
      "author": "DFW",
      "helpful_votes": 24,
      "publication_date": 20181109
    },
    {
      "title": "Due to prime membership it came in 2 days and was in perfect no scratches or malfunctions so far so good and ...",
      "text": "I must admit I didn't see all the complaints before I ordered this so I was nervous until it came. Due to prime membership it came in 2 days and was in perfect no scratches or malfunctions so far so good and super easy to put together. I felt like this would either be a hit or miss. Luckily hit! I suppose the good ratings out weighed the bad so odds are favorable! Im glad I took the gamble however I wish it didn't feel like a gamble...I guess often life feels that way regardless lol!",
      "rating": 5.0,
      "verified": true,
      "author": "LovelyKay",
      "helpful_votes": 20,
      "publication_date": 20180304
    },
    {
      "title": "High Quality and Easy to Put Together.  Strong and Sturdy.",
      "text": "Easy to put together. I am a 50 year old woman and did the entire thing myself in like 15 minutes. Very easy to understand directions and just basically a few screws to put in. Most pieces are connected already, you just fold them out and bend the legs down, and then a bolt goes through a hole to hold the leg in place. So easy. The way this thing is made, it is VERY strong and sturdy. It is a great price on Amazon for a quality bed frame like this.",
      "rating": 5.0,
      "verified": true,
      "author": "L.S.H.",
      "helpful_votes": 18,
      "publication_date": 20180118
    },
    {
      "title": "Def a must buy for plus size!!!!",
      "text": "Ok so i ordered this frame back in june didnt want to write a review until i knew it was safe too do so being that i have gotten other bed frames n they brake easy anyways i love this bed frame im a good 250lbs and my fiance a good 240lbs well this bed holds us both and the dog lmfaoo about 17 lbs i recommend this bed frame its sturdy easy to build and actually came earlier then expected!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Tania",
      "helpful_votes": 9,
      "publication_date": 20190903
    },
    {
      "title": "Horrible",
      "text": "I bought this product for my guest room as I worked on getting my home together room by room. I decided to put the frame together tonight and it is so poorly designed and the quality is questionable at best. The screws do not even thread to the base of the frame so it wobbles then once I finished the last assembly step, there is a hook to finalize the frame and it won’t even match up with the frame so my time and efforts were wasted. I’m extremely disappointed in this product and would NOT recommend for anyone.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 9,
      "publication_date": 20190508
    },
    {
      "title": "Great frame",
      "text": "Arrived as promised. Not too heavy for my mom to bring into the house; small easy packaging. When I arrived I unpacked it and all the pieces were included. It is sturdy and well made. The only thing I did not like was the instructions. I like word instructions, not pictures. I did get this put together in about 20 minutes and my mom is very happy with it. She needed her bed lowered, she's 4'9\" tall. This is perfect; she can easily get in and out of bed & sit on the bed. It gives about 7 inches under the bed for storage. I gave it 4 stars because I dislike the instructions. Otherwise, it's a 5 star product.",
      "rating": 4.0,
      "verified": true,
      "author": "Dee",
      "helpful_votes": 8,
      "publication_date": 20181006
    },
    {
      "title": "Extremely difficult to assemble.",
      "text": "After struggling for 4 hours trying to put this together, I have given up. What happened to a frame that was simple and someone could do it in minutes. First, the parts are unlabeled so you do not know which bolt goes where. Then the directions look simple until you try to figure out where each bolt is supposed to be placed. They don’t show enough detail. I would like to return this but it is so big and bulky I can’t imagine how to do it. Am going to Walmart tomorrow and buy just a regular frame.",
      "rating": 1.0,
      "verified": true,
      "author": "S. H. Haile",
      "helpful_votes": 8,
      "publication_date": 20180817
    },
    {
      "title": "My husband and I put it together yesterday afternoon and it was fairly easy. The directions are clear",
      "text": "We were having problems with our mattress caving in and realized our current bed frame did not have a center support bar! Crazy! I read the reviews and decided on this one. My husband and I put it together yesterday afternoon and it was fairly easy. The directions are clear, all the parts were there and it's coded with numbers so you can figure it out even if you're not too technical or a builder. The bed already feels that much more secure and supportive with the center bar and the legs are a good height. We have a box spring and a mattress on top and it's not too tall.",
      "rating": 5.0,
      "verified": true,
      "author": "Love&Wishes",
      "helpful_votes": 8,
      "publication_date": 20180219
    },
    {
      "title": "We love(d) this bed frame...",
      "text": "We love this bed frame! We ordered it for our new queen sized mattress and while we were hesitant because of the price, we could not be happier. It's great quality and isn't loud if someone moves. We would buy it again, no doubt. Update: it squeaks like crazy now. We have tried everything...wd-40, adding rubber washers, assign cotton, tightening everything. It has gotten progressively worse and now squeaks if you just move your leg. Save yourself frustration and don't buy this.",
      "rating": 1.0,
      "verified": true,
      "author": "Grace",
      "helpful_votes": 23,
      "publication_date": 20160630
    },
    {
      "title": "Looks like it would be great if it had come properly ...",
      "text": "Looks like it would be great if it had come properly made. One of the holes on the long arms of it is on the wrong side so I can't get the last leg put on. Unfortunately, it is on the bottom left corner so I can't put a bed on it with it missing that leg.",
      "rating": 1.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 10,
      "publication_date": 20171229
    },
    {
      "title": "BEST bed frame purchase",
      "text": "This bed frame is EXACTLY what I was looking for. I recently upgraded to a king size bed and just needed a frame that would function until I get around to building a headboard (another project I would like to work on soon). In case I ever do get a matching bedroom suite of furniture I wanted a frame that could be versatile, and this one can also work for full or queen sized beds. This is very sturdy and does not move or squeak. The legs have a rubber bottom, which means it does not scoot across my wood floors. I am super impressed, especially since the cost was so reasonable! I definitely recommend this.",
      "rating": 5.0,
      "verified": true,
      "author": "Melinda",
      "helpful_votes": 8,
      "publication_date": 20170620
    },
    {
      "title": "It does fit cal king. Does not include footboard brackets",
      "text": "Good and sturdy frame. Assembly was very simple. It does fit a California king bed as long as you loosen the butterfly and extend it as far as you can. This frame does include headboard brackets, but no footboard brackets. The bed kind of just cuts off which I found interesting. I ordered an extension so here's to hoping it works with this frame!",
      "rating": 4.0,
      "verified": true,
      "author": "S. Roberts",
      "helpful_votes": 8,
      "publication_date": 20180521
    },
    {
      "title": "Item came bent",
      "text": "I ordered this frame base on the reviews. Once I did receive the frame it was bent. Being optimistic we proceed on putting it together. Than we got to the part were we has to but the mattress onto the frame. I don't know if the frame was measured straight. One side of the mattress fit perfectly but the other side did not. Being that we spent time in putting it together. I really wasn't trying to return the frame. I must say its actually holding up. My 3 yr old jumps on the bed and the frame is still intact. I hope its last for a few years.",
      "rating": 1.0,
      "verified": true,
      "author": "Eva G.",
      "helpful_votes": 5,
      "publication_date": 20190805
    },
    {
      "title": "Best frame I've ever owned",
      "text": "This is the 2nd frame I've ordered. A king and a full size. These are very strong and well engineered. It goes together very quickly and easy. They include a cool little ratchet wrench and everything fits together perfectly and then screws tight for stability. Included extra parts, didn't need them, but I hate having to go to the hardware store if I break or lose something. You really wont find a better or stronger bed frame at any price.",
      "rating": 5.0,
      "verified": true,
      "author": "john from phoenix az",
      "helpful_votes": 4,
      "publication_date": 20190402
    },
    {
      "title": "SO MUCH STORAGE AVAILABILITY!!",
      "text": "BEST FRAME!!! wow cannot stress enough how happy we are with this purchase. Easy to assemble, very sturdy!! We needed a frame that wasn’t too high but I could fit containers under for shoes and I can fit 6!!!! 6 long containers, 3 under each side of the bed. So much storage ability we didn’t have before and with a bed skirt (which I kept off for the photo) you can’t even see it. Easily attached our bed frame and does not shake/move/slide on the floor. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Rachael",
      "helpful_votes": 2,
      "publication_date": 20200516
    },
    {
      "title": "everything is provided to put it together. Easy",
      "text": "For the price it really is exactly what I needed. Even for me it was easy to put together maybe took 5 minutes.I read some other reviews and was worried that even though people said they got California King it didn't fit their California King box springs but mine did. We bought a brand new California King just a couple months ago and this frame fit the California King two box springs. Had this a couple weeks so far so good. Me and my husband are both larger size people and we haven't had any issue with it. Seems to be sturdy and no noise or squeaking. Overall a good buy.",
      "rating": 4.0,
      "verified": true,
      "author": "leann loder",
      "helpful_votes": 2,
      "publication_date": 20200805
    },
    {
      "title": "Check contents before setting up",
      "text": "It seems to look m like it's a sturdy frame so far but it took me forever to get it up because It was missing the brackets to hook it to the head board. So good luck if you buy it and this happens to you because I notified the seller many times and nothing was done :-/",
      "rating": 3.0,
      "verified": true,
      "author": "Nice shopper",
      "helpful_votes": 9,
      "publication_date": 20171123
    },
    {
      "title": "Actually fun to assemble",
      "text": "This was the easiest item I've ever assembled. The instructions were great, the tools and parts were nicely packaged. The frame itself was smooth and heavy - excellent quality. I am so pleased with this bed frame - terrific value. Even the ratchet tool included was super nice! Every thing about this purchase was great - the price, the quality, the packaging and even a sweet little card to the purchaser with some blank note cards to \"share the love.\" I will check out this company first from now on!",
      "rating": 5.0,
      "verified": true,
      "author": "soosh",
      "helpful_votes": 4,
      "publication_date": 20181029
    },
    {
      "title": "Well Engineered Product",
      "text": "All i can say is wow, this product was well engineered. I am an Electrical Engineer but i still can appreciate a good design. I was very skeptical about how much this product cost, and wanted a sturdy frame. This thing is rock solid and breaks down into 3 pieces. If your nervous about getting a flimsy metal frame, don't be! this thing would be able to hold your mom... (your mom fat joke here) Anyway great product and this should be the standard for all metal bed frames!",
      "rating": 5.0,
      "verified": true,
      "author": "Spikes2020",
      "helpful_votes": 4,
      "publication_date": 20181030
    },
    {
      "title": "Just a few issues away from excellent",
      "text": "When I first started assembling the frame I couldn't believe such a thing existed for ~$50. Then the experience became less favorable. Assembly takes longer than it should (10-15 min), as each of the nine legs (overkill for a full-size frame) need to be screwed into place (a head-scratching design choice over other locking mechanisms). The frame edge/lip was also bent past 90 degrees on one side, which I'm just chalking up to loose quality standards. Sturdy and works well otherwise.",
      "rating": 4.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 3,
      "publication_date": 20190427
    },
    {
      "title": "Bent parts",
      "text": "I made it work but the part where it’ll hook to a headboard was noticeably bent. That whole end side as well as the part that will connect to headboard. I can only hope it doesn’t start giving us trouble & when I get a headboard it’ll connect. I read reviews of others having trouble with bent parts & hoped I’d be one of the happy reviewers but I didn’t get that lucky. The answer on if I’d buy again is no. But since I got the mattress on it & don’t see a problem @ the moment I decided not to bother with returning it. I needed it now.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20190118
    },
    {
      "title": "I was framed! 👮🏻‍♂️",
      "text": "Assembly was quick and easy although the Allen wrench that was included is a piece of crap. It stripped out pretty easy. The king size frame fits my king size box springs and mattress as expected. I slept on the frame and my new bed for the first time last night and I am satisfied with my purchase. The frame seems to be sturdy and does not make any noise. I will purchase a headboard soon and hopefully have no issues attaching it to the frame.",
      "rating": 4.0,
      "verified": true,
      "author": "Wu Gambini",
      "helpful_votes": 6,
      "publication_date": 20171119
    },
    {
      "title": "Nice and sturdy, easy to set up",
      "text": "Great product, especially for the low price. We're using with a king-sized mattress and box spring, and it feels very sturdy--no issues whatsoever and extremely easy to set up. Appreciated that this is designed to accommodate a headboard without any additional parts. I wouldn't hesitate to purchase again if we're in need of a new frame for another bed.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrea Williams",
      "helpful_votes": 16,
      "publication_date": 20161111
    },
    {
      "title": "These things work Great.",
      "text": "We bought 4 of them. Used them for 2 Queens, a Full and a Twin. Very Sturdy and Easy to put together. About 15-20 minutes to put each one together. Have one frame to adjust made it easy to order, pack, and put together.",
      "rating": 5.0,
      "verified": true,
      "author": "BW",
      "helpful_votes": 6,
      "publication_date": 20180912
    },
    {
      "title": "Awesome!",
      "text": "It came on time and was perfect. It’s so easy to assemble with clear directions and it’s so light weight one person can put it together. It’s light weight but very sturdy. Also love that it came with non slip stickers so the mattress doesn’t slip, who thinks of this but it’s clever and helpful. I love the little cards the put with it for you to send to someone else. Just seems like a good thoughtful company. It’s the little things that make you want to buy from them again.",
      "rating": 5.0,
      "verified": true,
      "author": "alberr730",
      "helpful_votes": 4,
      "publication_date": 20180621
    },
    {
      "title": "FALSE ADVERTISING DOES NOT FIT CAL KING",
      "text": "Does not fit cal king!!! I should have read the reviews before I purchased. Like others said, it does not fit a cal king as advertised. Also some of the welds were off so even if it did fit the box springs would not be lined up. My husband is an engineer (and former mover) and he says it is poorly made and it does not come together properly. Will be returning tomorrow :(",
      "rating": 1.0,
      "verified": true,
      "author": "Linzy McIntyre Lingo",
      "helpful_votes": 17,
      "publication_date": 20170627
    },
    {
      "title": "Easy and affordable bed frame",
      "text": "When I first pulled this out, I was very overwhelmed by all the pieces. But once I calmed down and took a minute to focus on the picture instructions, I realized it was a very simple assembly. One reviewer said this frame did not fit with his headboard from Target. I also was attaching the frame to a headboard from Target, and originally the holes did not line up. But that’s because of user error. If your holes don’t line up, it’s because the flat plates (that come with the headboard) used to attach headboard to frame are upside down and on the wrong legs. Switch sides, and then flip them and it should match up perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Ellen",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "Why spend so much for a bed frame?",
      "text": "Have a Cal King mattress set that I needed a bedframe for. Didn't want to spend $100 on a frame. Was very pleased to find this option and it has worked out perfectly. It came in a super small box and extends cleverly to fit any size frame, though Cal King is clearly marked as an option. Came with a rachet tool, hex key and thank you cards? Was easy to setup and fairly clear to follow the instructions. Now if I could only find a headboard I like...",
      "rating": 5.0,
      "verified": true,
      "author": "Hesed2020",
      "helpful_votes": 4,
      "publication_date": 20180514
    },
    {
      "title": "Not a fan.",
      "text": "At first this frame was perfect. Absolutely silent and no wobble. Now that the bed has been set up for several months, the frame squeeks getting in and out bed and has some wobble to it. It also did not work with my headboard. The holes on the frame that you would attach a headboard are too small for a normal sized screw to go in. I'm in the process of looking for a different frame all together.",
      "rating": 2.0,
      "verified": true,
      "author": "OhSaySugar",
      "helpful_votes": 3,
      "publication_date": 20190408
    },
    {
      "title": "So easy, our 11 year old did it!",
      "text": "My 11 year old put this together almost completely on his own (adult tightened the locking mechanisms) in about 15 minutes. The bed frame is super sturdy and has smooth edges that do not damage the box spring (or toes that get in the way accidentally!). Would definitely buy this again.",
      "rating": 5.0,
      "verified": true,
      "author": "Heather S.",
      "helpful_votes": 8,
      "publication_date": 20170721
    },
    {
      "title": "Was so excited about it",
      "text": "I was so excited to see this and to get a new one, and I have been a buyer of Amazon for years and I have to say the rails bent and broke after only a few months, Im only 90lbs wet so I can say I have to say that I will never buy this item again, sadly I loved the part where I could upgrade the size of the bed and not worry about needing to get another frame, but sadly I was wrong",
      "rating": 2.0,
      "verified": true,
      "author": "Crystal StPierre",
      "helpful_votes": 3,
      "publication_date": 20190221
    },
    {
      "title": "Relatively easy to put together",
      "text": "Relatively easy to put together. Once together feels pretty sturdy. Wish there was a way to easily lock it into shape: when inserting the two halves of my box spring the bed frame easily became unaligned. Was more of a pain in the ass to get the box spring settled than I've experienced with other frames in the past.",
      "rating": 4.0,
      "verified": true,
      "author": "Hamele",
      "helpful_votes": 5,
      "publication_date": 20180526
    },
    {
      "title": "Heavy duty bed frame!",
      "text": "I would have given 5 stars if it was easier to put together. It took two strong guys to get it done. But I LOVE the fact that it's strong, heavy-duty, well-made and QUIET. My old frame wiggled and moved. This is solid. It's a good height and has a cross-beam in the center, so a heavy-set person (or couple) will still feel secure. My box spring fits snugly into it, so there is no sloshing around. All in all, it's a bed frame. What can you say about a frame? I recommend it highly.",
      "rating": 4.0,
      "verified": true,
      "author": "A. Grillo",
      "helpful_votes": 3,
      "publication_date": 20180821
    },
    {
      "title": "Do not honor warranty",
      "text": "I answered honestly and provided all the photos as requested. However, I am unsatisfied with this product and believe it is substandard. This bed frame became useless after six months of wear. When matteres is on top, it bows, causing back pain. After calling and sending several photos and exchanging many emails, they said they could not find any defects by looking at my photos. This company is not serious about taking care of customers.",
      "rating": 1.0,
      "verified": true,
      "author": "Alex T.",
      "helpful_votes": 5,
      "publication_date": 20190219
    },
    {
      "title": "Very good quality for a very reasonable price. Highly recommended",
      "text": "We have vacation rental homes and we have been buying similar frames for more money. I didn't feel like driving an hour to get a new one to replace a broken one so I ordered this online. It is a much better quality than any we have purchased prior. I was very impressed with everything from packaging to ease of use and especially strength. Its a great product and less expensive than the cheaper quality ones.",
      "rating": 5.0,
      "verified": true,
      "author": "mark c",
      "helpful_votes": 6,
      "publication_date": 20170724
    },
    {
      "title": "Unexpectedly Sturdy and Loving it",
      "text": "I ordered the frame and was upset about delivery (not with amazon or Zinus but from UPS which is another review). The frame came in one box. I saw it was a medium to smallish box and assumed it was going to be multiple parts and take me forever. I was so wrong it was already assembled all i had to do was unfold it and screw in maybe 5 screws. I have been sleeping on it now for three days and it was the best purchase I've every made. Reordering one now for my daughter.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190517
    },
    {
      "title": "Doesn't get any better than this!",
      "text": "I so appreciate a company that puts their money where their mouth is. Zinus has created a bed frame that is FUN to put together; they obviously had people attempt to install it before putting it out into the world for sale. This bed frame is BRILLIANT: the construction is totally solid and stable due to the 9 legs and method they used to put it together. I will buy the same frame if I ever need another.",
      "rating": 5.0,
      "verified": true,
      "author": "J. M. Cohen",
      "helpful_votes": 5,
      "publication_date": 20171027
    },
    {
      "title": "I received a used product",
      "text": "Amazon pulled down my past review which basically stated: 1. This bed is not difficult to put together but is time consuming because it offers 3 sizes (twin, full and queen) together. It took me over 90 minutes to put together. 2. The dimensions for a queen is not wide enough for a queen. It was missing 1 inch in width to be big enough for a queen bed. 3. It came damaged. There were dents in the metal. These dents look unsightly.",
      "rating": 1.0,
      "verified": true,
      "author": "Ali",
      "helpful_votes": 0,
      "publication_date": 20200316
    },
    {
      "title": "Needs Box Spring",
      "text": "I know it's not their fault that I bought this without recognizing the need for a Box Spring, I just bought 60$ of scrap metal I have to return. Assembly was easy enough to the point I stopped. Frame is alright, nothing too sturdy but would do the job for someone who still uses a box spring for some reason. I'm buying a Zinus Able frame due to price point and ship date even trying to find something different. I did buy the wrong part for the job but my disappointment is enormous. Don't make my mistake, and if you have a Box Spring still, reevaluate your choices in life so this can come off the market.",
      "rating": 3.0,
      "verified": true,
      "author": "Daniel",
      "helpful_votes": 0,
      "publication_date": 20200903
    },
    {
      "title": "Just make sure you really like the person who is helping you put it together",
      "text": "My husband and I put this together on a very warm June day this year. We put it together outside because we thought it would be easier since our room is small. Having only to yell at him one time while putting this together we did it in a semi short time and only had to change it once after putting in the wrong piece. The instructions are pretty simple - if you are both reading it the same side up. Its been 5 months now and the firmness of the frame is excellent and the cost perfect!",
      "rating": 5.0,
      "verified": true,
      "author": "brenal1402",
      "helpful_votes": 0,
      "publication_date": 20191105
    },
    {
      "title": "This is a spare bed for guests and the frame worked out as a perfect replacement. My queen bed frame is on its ...",
      "text": "My free with mattress frame kept falling apart. Therefore, I ordered this as a replacement. I needed a twin size. It still came with the center support bar. Many other twin frames do not have that bar. Especially for adult use, the bar is important for longer life of your mattress. This is a spare bed for guests and the frame worked out as a perfect replacement. My queen bed frame is on its last legs, so I ordered this brand in queen size as a replacement too. Very pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "K. BroussardTop Contributor: Sewing",
      "helpful_votes": 8,
      "publication_date": 20160610
    },
    {
      "title": "Great buy!",
      "text": "Arrived in a small, not too heavy box. It was so easy to put together! We attached it to a vintage queen sized headboard and the bed frame lined up perfectly. The frame is very sturdy. I love how the feet at the foot of the bed are inset a bit, no more slamming my foot in the dark against them like on older models. I also like those little \"grippers\" that came in the package so the box spring won't slide around on the bed frame. You guys thought of everything!!! I love it. Thank you.",
      "rating": 5.0,
      "verified": true,
      "author": "DB",
      "helpful_votes": 2,
      "publication_date": 20181127
    },
    {
      "title": "So Much More than Expected!",
      "text": "For the price point, I didn’t expect something so sturdy and heavy duty! Assembly was easy, and instructions were clear, and the Queen-sized box spring fits in so perfectly! The fact that it adjusts from twin up to queen is such a bonus, as we have two twins and a full in this house. When we need to buy more bed frames, THIS is the one I’ll be purchasing again! Awesome product! I do have the same problem as other reviewers, in that it doesn’t bolt to the headboard, but it fits so snugly against it that I can deal. Especially since there’s no metal overhang at the foot of the bed to kick!",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa P.",
      "helpful_votes": 0,
      "publication_date": 20200421
    },
    {
      "title": "Sturdy, Great Value, Easy To Assemble",
      "text": "We got a new mattress and I wanted to finally get it up off the floor. I love that the frame is low profile, with some under bed storage but you are not sky high. Our new mattress is 13” and this frame is the perfect height for us. It’s really sturdy, and easy to put together. Nothing was bent in our box. They include all the hardware and tools; it took us about 20 min. We bounced around and slept on it and there are no creaks, or movement, the bed feels solid, good for heavier couples. Also I feel that the price is very reasonable, well worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "Regina M",
      "helpful_votes": 0,
      "publication_date": 20200902
    },
    {
      "title": "No tools or screws in box.",
      "text": "Horrible. When I opened the box I saw that all the screws except one andall other tools were missing. The bed is impossible to assemble without them. Now I have to spend extra money for something that should have been in the box to begin with.",
      "rating": 1.0,
      "verified": true,
      "author": "Angela Hall",
      "helpful_votes": 3,
      "publication_date": 20191003
    },
    {
      "title": "Durable",
      "text": "I bought this after buying a new mattress and it being too high for me to get into. I know embarrassing -_- I took my bed off of the actual sleigh frame and put this inside to lower it. Worked perfect! I can now sit on my bed and don't have to jump in or out of it. This is very durable as my mattress is very heavy on its own not counting anyone else! It was very easy to throw together and surprisingly light! All the tools needed were included which makes it so convenient! I threw a bed skirt on the box-spring and you cant even see the metal frame. I am 100% happy with this",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa Taylor",
      "helpful_votes": 0,
      "publication_date": 20190314
    },
    {
      "title": "I was not pleased.",
      "text": "This damn thing broke after a month. I’m sure I can spare you the details, but if it helps we are a little bit on the heavier side, but we’re not so big that the frame shouldn’t be able to hold us and our physical activities aren’t so extravagant that the frame should break. Clearly it’s a quality issue. Sorry for the TMI, LOL. I wouldn’t suggest it but it is good If you’re single and you need to save a few bucks.",
      "rating": 2.0,
      "verified": true,
      "author": "Mela Lewis",
      "helpful_votes": 2,
      "publication_date": 20190426
    },
    {
      "title": "Perfect bed frame, perfect price!",
      "text": "I'll be honest...I had some doubts about this. We have a King-sized Posturepedic memory foam mattress and the sheer size of that alone (13+ inches thick) PLUS the two box springs is a LOT. I would have thought there was absolutely no way for this frame to support all that, clever engineering or not...BUT I read all the reviews and took the risk. And I LOVE this frame! Assembly was fairly simple, everything was packaged and labelled well and the final product is a welcome addition to my bed set-up. It raises the box springs enough to allow some under-bed storage and it is stable and sturdy. For the price, this is an amazing buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Alicia",
      "helpful_votes": 0,
      "publication_date": 20181127
    },
    {
      "title": "Very sturdy great engineering.",
      "text": "My King bed frame arrived on time, packaged well and undamaged. Its true, the instructions aren't great and I took a couple of wrong steps and had to back track. That said, it still only took 15 mins to put together. It comes with all the hardware, including tools for assembly and a spare bolt too. The two box springs that make up a king bed base fit perfect and the whole thing is solid and creak free. It is really well engineered for the price. I couldn't build a frame out of pallet wood with the nail gun for cheaper. If you're put off by the cheap price, thinking it may be sub standard, it isn't. Just buy it.",
      "rating": 5.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "Great little frame",
      "text": "This frame is exactly what I needed for the bed in my guest room. It was very easy to put together, even with the wordless directions (it only has pics of each step). It’s very sturdy and fit the box spring perfectly. Would definitely buy again if/when I need another frame. I really like Zinus. My king size bed was is also from them and I love it also.",
      "rating": 5.0,
      "verified": true,
      "author": "mstahliin",
      "helpful_votes": 0,
      "publication_date": 20200624
    },
    {
      "title": "Make the bolt slots bigger, please.",
      "text": "Great bed frame. Super easy to put together, and very sturdy. I am only giving it 3 stars because the slots to attach the headboard to this frame are not big enough to accommodate the bolts that came with my headboard. I cannot use smaller bolts because of the pre drilled holes in the headboard, so I'll have to get my Dremel and make the slots on this frame larger. I shouldn't have to do that, this should come ready to go without modifications. Other than that I'd recommend this frame, it is much better than the old clunky, heavy ones from the 90s.",
      "rating": 3.0,
      "verified": true,
      "author": "M Young",
      "helpful_votes": 0,
      "publication_date": 20200509
    },
    {
      "title": "Love how low it is.",
      "text": "I received this pretty quickly. Only been in use for a day now but so far, so good. Took me a second to figure out the first step but was very easy afterwards. Took about 15 min. I like that it comes with anti slip stickers and a nice little ratcheting Allen wrench. Doesn’t sit very high in comparison to my old one so our feet don’t cover the tv anymore! Also, it came with 3 blank thank you cards which is a nice touch, but they were blank and there were 3 so I don’t know. I will update this review if anything changes.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Guerrero",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "A bit harder to assemble but WELL worth it!",
      "text": "Upon opening, I expected the standard bed frame - swing out the centers, snap together, and done. Not this baby! It took more to assemble than the run-of-the-mill frame, but wow - VERY sturdy. It replaced a frame which failed because two kids under 11 were gaming and sat on the bed - collapsed the frame. I don’t thing several adults could do the same to this one. A great investment! Also, this can be securely adjust add for various bed sizes (no extra screws, duct tape, etc) and it will NOT move. I don’t buy frames often, but this is my go-to frame from now on!",
      "rating": 5.0,
      "verified": true,
      "author": "John Beatty",
      "helpful_votes": 0,
      "publication_date": 20200408
    },
    {
      "title": "Measure your bed before you buy it",
      "text": "I assumed this would fit the dimension of my bed but even though I picked the correct name of my bed it came too small. However if it did fit it would have been great, easy assembly and light weight. After I took it apart again it has taken residence in the box it came in thus easy storage. Would I buy it again nope. but only because it turns out my bed is too big",
      "rating": 3.0,
      "verified": true,
      "author": "Rg",
      "helpful_votes": 0,
      "publication_date": 20200502
    },
    {
      "title": "Solid but short",
      "text": "This is a good bedframe for the under $40 price range, and fairly easy to assemble alone. It's a good idea to scan through all of the directions once before you start - I didn't and found I had to undo some bolts because I missed a step. The metal construction isn't the most robust, but it should hold up. My major complaint is the very low height. This would be fine for one of those really tall ultra plush mattress and box frame sets. For a normal set, it's a few inches too low. Not enough of a problem to return it, and overall a decent value.",
      "rating": 4.0,
      "verified": true,
      "author": "Beverly M.",
      "helpful_votes": 0,
      "publication_date": 20200416
    },
    {
      "title": "Worth the price!",
      "text": "I bought 2 of the king size bed frame without reading the reviews and was hesitant at first but I decided that I should buy it! After placing an order I thought to myself what was I thinking buying 2 right away without trying it first! Then it got delivered. The only thing that I didn’t like was the frames doesn’t have wordings for example it didn’t say which one goes on top, right, left, bottom or letter. Without those labels it’s going to be confusing! Well in the end the frame is really sturdy!",
      "rating": 5.0,
      "verified": true,
      "author": "Cielo L",
      "helpful_votes": 0,
      "publication_date": 20201008
    },
    {
      "title": "Terrible support leg placement-cover with foam!!",
      "text": "I bought this for my 3 year old daughters full size bed without a box spring. It was very easy to put together however the placement of the outside middle leg is HORRIBLE! I cannot even tell you how many times I kicked it while putting her to her until I added a condensation cover for a pipe from the hardware store around it which has saved my toes! A pool noodle will also work. This leg needs to be maybe 10 inches under the bed. It also doesn’t have any lip to keep the mattress in place but that hasn’t really caused any issues but that evil leg is another story...",
      "rating": 2.0,
      "verified": true,
      "author": "ACP",
      "helpful_votes": 0,
      "publication_date": 20200205
    },
    {
      "title": "IF RETURNING EXPECT A FEE!",
      "text": "I purchased this after mistaking something wrong on my current frame. After disassembling my old bed i saw it wasn't broken. After deciding the new one wasn't necessary, I started the return process. I then learned it was going to be almost $17 to ship back. I decided rather than lose almost half the cost of the bed to just keep it. It took about 40 minutes to build, and so far works as intended. I reached out the the company and suggested to better advertise the return fee. I assumed with it being a prime item the return wouldn't force me to eat part of the cost.",
      "rating": 4.0,
      "verified": true,
      "author": "designofeye",
      "helpful_votes": 3,
      "publication_date": 20190130
    },
    {
      "title": "Absolutely sturdy, top quality frame - no need to look further!",
      "text": "This is a heavy, absolutely sturdy frame. Well packed for shipping, easy to follow instructions, they even provide an actual ratchet tool! The frame is 7\" tall, so you need to consider this when choosing a box spring and mattress so that you end up with a comfortable height for your bed. We bought it as a set together with the Zinus Victor 4\" mattress foundation - another excellent product! The frame and foundation together were 11\" tall, which worked well for us. So glad we found this on Amazon!",
      "rating": 5.0,
      "verified": true,
      "author": "EMM",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "Nice frame for the price",
      "text": "This frame will work for what I need it for, however I'm not completely sure about the sturdiness of it. It was easy to put together for the most part but the directions aren't great. If you need this bed frame for someone with a large build, I would consider looking for something a little stronger. If you're using it for sleep and lounging, and maybe some light activity, it works fine. Not recommended for jumping on the bed, or throwing yourself on the bed, or for very active consenting adults performing some vigorous activity. The price and convenience is well worth it.",
      "rating": 4.0,
      "verified": true,
      "author": "KarenTop Contributor: Pets",
      "helpful_votes": 4,
      "publication_date": 20170126
    },
    {
      "title": "Arrived dented cheap",
      "text": "Came dented. Disappointed in that - not worth the price. otherwise the legs were nice and had rubber on the bottom to prevent scratching the floor. UPDATE: we finally purchased a headboard to attach to our bed frame. The metal piece that you attach your headboard to is wobbly and unstable as this product is cheaply made and not good quality. Our headboard is secured to the piece and tightened yet wobbles. Stick with the traditional old school universal bed frame and don’t waste your money or time on this crap. Their response was to return the item. Do not buy",
      "rating": 1.0,
      "verified": true,
      "author": "Michelle",
      "helpful_votes": 0,
      "publication_date": 20191119
    },
    {
      "title": "Excellent frame with good features!",
      "text": "Can't be a 9-post bed frame. Not the easiest to move once it is placed, but it won't sag in the middle spans. We had two box springs fail because the frame the bed store sold us left them unsupported at various places. Of course they had a \"heavy duty\" box spring to solve the problem... for $180. And it only had 6 wheeled legs. How often do you move your bed that you are willing to have a saggy/broken box spring? This frame is easy to assemble, well built, and is an ideal solution for anybody wanting to ensure there is sufficient support at all points of the frame.",
      "rating": 5.0,
      "verified": true,
      "author": "Michele L. Borgen",
      "helpful_votes": 4,
      "publication_date": 20170119
    },
    {
      "title": "Bed frame Worked Great!!",
      "text": "I didn't want to get one of those cheaper bed frames with wheels (which we don't use) for a new bed for our guest room. The place we bought the queen set recommended this frame as it's the same one he uses. It went together with no problems. All parts lined up as expected and no tools of mine were required. The queen box spring fit perfectly and there are no squeaks. Excellent quality frame for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "sgg",
      "helpful_votes": 2,
      "publication_date": 20190201
    },
    {
      "title": "Buy it NOW!",
      "text": "TLDR: This is a quality product at an amazing price! Brought this as temporary solution since our old frame lost its battle to bed bugs. It was $40! Plus it had AMAZING reviews. Assembled it (well my brother did, I watched for moral support) and viola it is a wonderful investment until a new bedroom set for that room is purchased. Luckily the bed bugs were confined to that room. Still no idea how they got in there but boy howdy a girl wasn't taking any chances. The tiny ratchet alone impressed me. Never saw a tiny rachet in my life. Buy it now!",
      "rating": 5.0,
      "verified": true,
      "author": "Dee",
      "helpful_votes": 0,
      "publication_date": 20200222
    },
    {
      "title": "It's just okay - not heavy metal of that's what you're lookin for",
      "text": "This is not the old fashion, hard, sturdy metal frames that our old beds used to sit on. It's kind of flimsy but super easy to assemble. The reason for the 3 stars is because when I tried to move the bed into place, the middle legs started to fold so I had to remove the box spring and mattress then move the frame and then put everything back. But other than that it's okay.",
      "rating": 3.0,
      "verified": true,
      "author": "hawaiianrsch",
      "helpful_votes": 3,
      "publication_date": 20180625
    },
    {
      "title": "Does not fit a real full",
      "text": "The frame itself was easy to assemble and the tools it came with were amazing. But even after extending it, it does NOT fit a full size bed. So, those of you who are saying it fit your full size bed, I have no idea how. We were able to make it work anyways because the frame is sturdy enough to hold the bed, but definitely not big enough.",
      "rating": 3.0,
      "verified": true,
      "author": "Jessica Wolford",
      "helpful_votes": 2,
      "publication_date": 20190421
    },
    {
      "title": "I wish I could tell you how this works, but I can't put it together",
      "text": "Assembling this thing makes putting IKEA furniture together look easy. Maybe I'm just dense, but seriously, I have no idea what these directions mean. This is like some massive IQ puzzle you buy in the airport. I quit and I'm waiting for my wife to help so we can get frustrated together.",
      "rating": 1.0,
      "verified": true,
      "author": "JRRogers",
      "helpful_votes": 4,
      "publication_date": 20181129
    },
    {
      "title": "Stable",
      "text": "This isn't very high so I can only store a few shoe boxes on the floor underneath but it feels very stable for my mattress and box spring. There is no squeaking or weak spots that I can feel. It was easy to assemble but just be careful if you have hardwood floors as to not scratch the floors. I'd buy it again.",
      "rating": 5.0,
      "verified": true,
      "author": "sgum",
      "helpful_votes": 0,
      "publication_date": 20200603
    },
    {
      "title": "Outstanding product!",
      "text": "We needed a second frame for a twin bed and I ordered this one, along with the box springs. I put them both together myself and as someone who has assembled many ordered items, these are the absolute best ones! The kits are incredibly well designed, come with really substantial hardware, and are simple to assemble. There is even an actual ratchet tool rather than the little angled ones that usually come with items to be assembled. I will definitely order from this company again!",
      "rating": 5.0,
      "verified": true,
      "author": "Sharon B",
      "helpful_votes": 0,
      "publication_date": 20190322
    },
    {
      "title": "If your a bigger person you want this",
      "text": "Lemme start off by saying I originally purchased a steel frame here off amazon for around $40. The steel 4 corners normal bed frame. Well as a big guy who weighs 310 I always felt it gave in middle and I rolled towards it or slid you could say. So I decided after a year to buy this one and it supports you like your mattress is on the floor super solid and imo a great frame for the price. I would buy it again if I ever have to but as for frames with no center bar never again would I buy them.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim",
      "helpful_votes": 0,
      "publication_date": 20200607
    },
    {
      "title": "Easiest assembly ever!",
      "text": "Oh this was a great purchse! Needed a new simple bed frame. This took 25 minutes to assemble. The directions were clear and simple. The only thing that held me up is fuguring out how to extend it past full to queen size. That took 2 minutes to figure out. Pictures show assembly. Last pic shows with a standard bedskirt. Note: There is 1 problem. I used a stabdard box spring but the screws that are at the very end prevent the box spring from sitting flat qirhin the frame. Not really noticeable when bed all together",
      "rating": 5.0,
      "verified": true,
      "author": "Melle Mel",
      "helpful_votes": 0,
      "publication_date": 20190412
    },
    {
      "title": "Very sturdy!",
      "text": "Really pleased with this frame. It came very well packaged with Allen wrench and extra bolts for down the road if something gets lost in a move. You can attach it to a headboard, provided you have the extra screws to do that. Seems very sturdy. My hubby and I assembled it in about 25 mins which included attaching our own headboard. For people who have done this before, it may take less time. Note that when assembling the Queen size, pull how horizontal slats all the way out as wide as they will go. Otherwise, your boxsprings will not fit within the rails.",
      "rating": 5.0,
      "verified": true,
      "author": "TwinsmomNY",
      "helpful_votes": 0,
      "publication_date": 20191113
    },
    {
      "title": "Super sturdy",
      "text": "This is better than I hoped for! It is very heavy. We had a standard bed frame with wheels on it and all 4 wheels cracked and broke. I wanted a sturdy frame for our bed. This one is rock solid. Assembly is easy enough that my 9 year old worked on it. Flip the legs down, screw in the screws, done. It comes in a couple pieces that easily fit together. Our other frame had notches where it fit together. This one uses screws to keep it together. No more random frame disassembling when cleaning and rearranging. It’s a great height off the floor and we can easily slip stuff under the bed.",
      "rating": 5.0,
      "verified": true,
      "author": "Jill",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "Perfect for Sleep Number!",
      "text": "When you buy a Sleep Number bed, you will need a sturdy frame. For us, that meant getting a king sized bed frame. We could add it to our mattress order for a little over $250, but I decided to check Amazon. For less than $60, I found this one which was not only easy to assemble (it comes with a ratchet!!) but it is extremely sturdy and fits our new king sized bed perfectly! Save yourself the $190 at Sleep Number and get this frame instead.",
      "rating": 5.0,
      "verified": true,
      "author": "Kato2k",
      "helpful_votes": 0,
      "publication_date": 20200825
    },
    {
      "title": "Sturdy, solid, and easy to assemble",
      "text": "So far this is the sturdiest bed frame I’ve had. I have a sleep number system so my ‘box spring’ is solid plastic. It fits nice and snug inside of the frame. Legs are solid and my 10 yr old and I had the fame assembled in about 15 minutes. The Allen key ratchet they give you makes assembly go super fast. I weigh around 180 and the frame doesn’t make a peep when I hop into bed. Will update if I have any issues in the future but so far so good!!",
      "rating": 5.0,
      "verified": true,
      "author": "Christina Grace",
      "helpful_votes": 0,
      "publication_date": 20200812
    },
    {
      "title": "Heavy set people, plus size kings and queens.. THIS IS FOR US",
      "text": "I spent days looking for bed frames on amazon, I look at ratings, thoroughly look through reviews, etc. I saw one person say something like “plus size people, this is for you!” It obviously caught my attention being that I too, am a plus size person. Needless to say.. this bed frame is amazing. I do plan on giving an update in a few months but so far so good! I thought my mattress and boxspring needed to be replaced too but when I changed the frame, I realized that is what was causing the issue. My mattress and box spring are amazing again! Haha It’s crazy how much of a difference the frame made. I’m still amazed.",
      "rating": 5.0,
      "verified": true,
      "author": "Elle",
      "helpful_votes": 0,
      "publication_date": 20190629
    },
    {
      "title": "Easy to install basic bed frame",
      "text": "Our old bed frame broke after many years of use so I bought this one to replace it. It was easy to set up, though I did have to read the instructions and had to back track in the set up process to correct some mistakes I made. Much more sturdy than the frame this replaced and I expect this to last many years to come. Only downside is that it does not have wheels on it like the old bed frame...but that is a minor complaint.",
      "rating": 5.0,
      "verified": true,
      "author": "Nicholas J. Yunker",
      "helpful_votes": 0,
      "publication_date": 20190620
    },
    {
      "title": "An excellent value. Very sturdy.",
      "text": "When the box came I was shocked by the shape. I expected a long narrow box. It was shorter and wider than I expected. This frame is unlike any other I've seen before. The center feet are not just an afterthought. Putting the item together was fun. They give you all the tools you need. 9 feet is much better than 5. I've used this frame for a week now and I'm have to say it's very sturdy. For the price you can't do better! I will say it would have been nice if the instructions were written in English and not just arrows and pictures.",
      "rating": 5.0,
      "verified": true,
      "author": "Minnesota Merchandise",
      "helpful_votes": 0,
      "publication_date": 20200504
    },
    {
      "title": "Well made with a nice price",
      "text": "We were looking for a inexpensive bed frame for my son's full size bed. I found this frame on Amazon and read the many positive reviews. The Zinus name caught my eye as we have purchased a upholstered bed frame from them and the pricing and quality as well as ease of assembly were very good. This frame does not disappoint. This frame can adjust to three sizes twin, full and queen. The instructions were easy to follow great quality. If you like good design and fair pricing buy this bed frame, you will not be dissapointed.",
      "rating": 5.0,
      "verified": true,
      "author": "Tonka Guy",
      "helpful_votes": 0,
      "publication_date": 20190110
    },
    {
      "title": "Universal option is a great value",
      "text": "I bought the universal bed frame and it was very easy to set up and feels very sturdy. I’m glad I noticed that the universal fit which adjusts for full, queen and king was actually cheaper than getting just the king bed frame which allows us to use it in the future for different mattress sizes. Some of the holes were difficult to get the bolt through, but with the right pressure we got it figured out. Great value for the price.",
      "rating": 4.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20201006
    },
    {
      "title": "Happy camper",
      "text": "I am overjoyed honestly. It arrived in a timely manner with me being a Prime member in its original packaging but it had damage to it. That was to be expected since I did buy it refurbished. Surprisingly, when I unpackaged the rails, they looked like new. The rails came with a hardware set you will need to assemble the rails to your preference. The instructions on how to assemble could be a little more in detail with words but I eventually got it with the just the pictures. The sturdiness of the rails are superb. I love the way the feet of the rails can fold out. Overall, I am satisfied with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Keanna",
      "helpful_votes": 0,
      "publication_date": 20200308
    },
    {
      "title": "Fantastic solution to a rolling nightmare",
      "text": "My bed was giving me headaches for the past six months I wish I had decided to try this earlier. It took me 15 minutes to set it up by myself. I used this in conjunction with the Zinus Bunkie board and it is so much better than anything from That Swedish place. While it might not be the most beautiful thing on earth, it has no-slip grips on the bottom (as opposed to those rolling nightmares), noise proof pads, and EASY to understand instructions. All in all I would definitely recommend this to anyone who is a renter or moves from time to time.",
      "rating": 5.0,
      "verified": true,
      "author": "tsunamibomb",
      "helpful_votes": 0,
      "publication_date": 20180812
    },
    {
      "title": "I have bought two",
      "text": "I bought one for my elder daughter for a slumping bed she had me sleeping on. She had replaced the mattress but it turns out it was the frame. Them my second daughter moved out and I got one for her new bed and tossed the one that came with it. These have 9 support legs to the floor, no sag possible. They are very easy to assemble and come with the needed tools. We are all very pleased with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "misterdaveusa",
      "helpful_votes": 0,
      "publication_date": 20190621
    },
    {
      "title": "My 2nd Zinus bed frame",
      "text": "This is my 2nd Zinus bed frame. I have 1 queen one, and now 1 king one. Very solid bed frames. Whoever engineered this thing to fit in a little box and fold out all crazy to assemble is an evil genius. Just make sure you follow the instructions carefully step by step, and do not skip ahead. The order is very important. If you follow the direction it is simple and comes with everything you need to put it together. The only downside is that these frames do not fold, and I highly doubt I'll want to disassemble and reassemble when I move.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian McKearney",
      "helpful_votes": 0,
      "publication_date": 20190311
    },
    {
      "title": "Fixed my saggy bed",
      "text": "I had a regular metal bed frame without the middle support so my bed was saggy it would cave in the middle. I was looking for middle support bar but this frame was the same price as the middle support I was looking at that I wasn't sure if it was going to fit so I decided to purchase this universal frame. Glad I did! This made my bed firm again!! I Like how it came in a smaller package then anticipated and how it came with all the tools needed to assemble. Didnt take long to build. Oh and it got here super fast. Im so happy with my firm bed now thank you Zinus!",
      "rating": 5.0,
      "verified": true,
      "author": "zaida",
      "helpful_votes": 0,
      "publication_date": 20190313
    },
    {
      "title": "Quality Steel Bed Frame",
      "text": "Easy to assemble in 15 minutes, quality material, strong, but not heavy, and exactly what I needed for my son's room. Also good packaging. By the way, I love the message the included and the cards. You have to read it. Thank you People from Zinus. Great Job!",
      "rating": 5.0,
      "verified": true,
      "author": "Yazmin Redondo",
      "helpful_votes": 0,
      "publication_date": 20200903
    },
    {
      "title": "Easy Assembly!",
      "text": "I bought a new king sized bed, it has 2 box-springs and a super heavy mattress. Theres a headboard, footboard and 2 side panels. Within a year the wood frame that came with the bed started to bend & break. I removed the old wood supports and assembled this within the bedframe. It was simple to assemble. My only complaint is that the packaging and materials smelled like cigarette smoke. I had to clean everything thoroughly and immediately throw the box, directions, etc. out after.",
      "rating": 4.0,
      "verified": true,
      "author": "Gina",
      "helpful_votes": 0,
      "publication_date": 20200506
    },
    {
      "title": "Sturdy; easy to assemble; twin, full or queen.",
      "text": "Perfect bed frame for my queen size bed. I did away with a wood footboard, so I needed a frame with legs. Assembly was very easy. Will also form to a twin or full bed if needed. I am very pleased with the 5 extra legs for a queen size bed making a “plus” & 4 corners of support under my box springs. The head end of rails can also attach brackets to use with a wood headboard. Enough of a height from the floor to store items under the bed (as seen in pictures). Very pleased with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Rosie W.",
      "helpful_votes": 0,
      "publication_date": 20200524
    },
    {
      "title": "Hardware doesn’t fit",
      "text": "This bedframe is okay, but doesnt line up with my queen bed. Part of the box spring hangs over the frame, tilting the mattress slightly. Setting up was easy but I had to go to the hardware store to pay $7 for screws for the headboard. The screws in the kit do not fit in the brackets. It was a bit of an inconvenience for me. Buyer beware.",
      "rating": 2.0,
      "verified": true,
      "author": "Sean C. Barile",
      "helpful_votes": 0,
      "publication_date": 20200716
    }
  ],
  "product_meta": {
    "title": "Zinus Michelle Compack Adjustable Steel Bed Frame, for Box Spring and Mattress Set, Fits Full to King",
    "description": "Color:Black| Size:UniversalZinus has reinvented the bed frame with this \"compack\" and easy-to-set-up base, uniquely designed for optimum support and durability. This bed fame adjusts to provide a sturdy foundation from a full size up to a king size mattress set. Visionary Design - The center bar support and 9-leg construction is unique to the Compack Bed Frame and ensures superior stability. Low-Stress, Easy Assembly - The Zinus Compack bed frame assembles in a few simple steps. The 9 support legs are intelligently recessed for safety and helps you avoid hitting your toes when making the bed. Bed frames are meant to be used with a box spring and mattress set. Worry free 5 year limited warranty.",
    "rating": 4.6,
    "feature_bullets": [
      "100% Steel",
      "Imported",
      "Stability and support with 9-legs and center bar",
      "Steel construction with easy locking system",
      "Recessed-leg design for safety",
      "Easily adjusts for Full, Queen, and King size",
      "For use with Box Spring and Mattress Set(not for use with mattress only)"
    ],
    "specifications": {
      "Product Dimensions": "53.5 x 70.5 x 7 inches",
      "Item Weight": "23 pounds",
      "Manufacturer": "ZINUS",
      "ASIN": "B00IGGJQ6O",
      "Item model number": "AZ-SBF-07U",
      "Customer Reviews": "4.6 out of 5 stars23,691 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#490 in Home & Kitchen",
      "Is Discontinued By Manufacturer": "No",
      "Fabric Type": "100% Steel",
      "Is Assembly Required?": "No",
      "Batteries Required": "No",
      "Included Components": "Headboard",
      "Import Designation": "Imported"
    },
    "categories": [
      "Bed Frames",
      "Furniture",
      "Home & Kitchen",
      "Bedroom Furniture",
      "Beds, Frames & Bases"
    ],
    "price": 77.2
  }
}