{
  "website_summaries": [
    {
      "verdict": "This uniquely designed shower tent is easy to put up with preinstalled tent poles.",
      "pros": [
        "No assembly needed because tent poles are preinstalled, just pop it up and fold it down again",
        "Removable floor useful when used as a shower room",
        "Includes stitched-in pockets for toiletries and a shelf for storing your own solar shower or for clothes",
        "We like the option of using the shelf for your own solar shower"
      ],
      "cons": [
        "Some users found the plastic joints difficult to fold down"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Room for 2 + Zodi Shower!",
      "text": "This privacy shelter was easy to set up and handled high winds with ease. The dual-direction zipper allowed us to hang our clothes and towels on the poles and simply open the top of the door to grab them when done showering. The vents on the top let the hot shower steam out, making showering comfortable, even under direct sunlight. Because the Lightspeed Shelter doesn't become a sauna, like my Cleanwaste, ( which was the best at the time, but is now assigned to toilet duty. There is enough room for two to shower, along with the Zodi Outback Gear Extreme Hot shower tank and shower pole. ( and pole: (",
      "rating": 5.0,
      "verified": true,
      "author": "ABQ Amazon Addict",
      "helpful_votes": 13,
      "publication_date": 20180701
    },
    {
      "title": "Good, while it lasted....",
      "text": "Worked for 2 camping trips. all but 1 side wall started developing holes. I stored it just like it came from the factory and never had sharp objects near it. its almost as if the weave of the fabric just started separating? Really frustrating. I thought for the price it would be made with a heavy duty material. Manufacture is doing a warranty claim but in the peak of the summer camping season, now im having to shop for something else. Real shame",
      "rating": 3.0,
      "verified": true,
      "author": "homeowner10",
      "helpful_votes": 6,
      "publication_date": 20180724
    },
    {
      "title": "Great tent but mine was a darker army green",
      "text": "I really love the size of this privacy tent and intend to use it as both as a bathroom tent and a shower tent. It's very spacious inside and set/takedown is super easy. I had the Ozark Trail 2 room tent prior, but thought that was a bit over kill. This is the right size with all the right features like a floor you can keep up or put down and a towel rack with hook directly in the center. Be forewarned the tent sent to me was more of a darker army green than what is pictured in the posting along with the video which is closer to a lighter tan.",
      "rating": 5.0,
      "verified": true,
      "author": "Philip, San Jose CA",
      "helpful_votes": 7,
      "publication_date": 20180515
    },
    {
      "title": "Sturdy - that's what you want from a privacy tent",
      "text": "Sturdy - that's what you want from a privacy tent. (I had one of those spring steel contraptions and it literally took me 30-45 minutes to get it back in the bag, which I left in the trash can at my last camping site in New Mexico.) This one deploys in an unconventional manner - just practice with it in the daylight a couple times and it will be great.",
      "rating": 5.0,
      "verified": true,
      "author": "George",
      "helpful_votes": 17,
      "publication_date": 20171112
    },
    {
      "title": "The included interior pouches are handy for holding toiletries and the overhead shower head holder is very versatile and worked",
      "text": "Works as advertised. Purchased this to pair with my pop up camper's outdoor shower. Also doubles as a bathroom with a cassett toilet. Sets up in about a minute and take down is the same. The included interior pouches are handy for holding toiletries and the overhead shower head holder is very versatile and worked great. Great quality, very convenient, and folds up and stores neatly. Very pleased with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "redhat6161",
      "helpful_votes": 8,
      "publication_date": 20170416
    },
    {
      "title": "Best money spent",
      "text": "Best money spent!.. nice quality unit... So easy to set up & take down, very spacious, sturdy \"if you stake it out\"... It survived some extremely strong winds at the Mogollon rim... not sure if I want to hang one of those 5-gallon solar shower bags in it but I use my Ivation portable camp shower and Dometic toilet and now I can extend my camping Adventures for a very very long time!",
      "rating": 5.0,
      "verified": true,
      "author": "David S.",
      "helpful_votes": 8,
      "publication_date": 20171023
    },
    {
      "title": "Very low quality.  Don't expect the plastic framing parts to hold up very long.",
      "text": "The quality of the plastic leg connectors and other plastic support fittings is so low they broke within days. This is good for a short period of time but is essentially disposable. A frame from pvc or some other material may be fashioned and the tent itself reused but it's really not worth the effort. If you are using it once or twice you will be fine - probably - more than that and it will eventually fail. Save your money.",
      "rating": 1.0,
      "verified": true,
      "author": "flyijohn",
      "helpful_votes": 3,
      "publication_date": 20181127
    },
    {
      "title": "Easy to set up even with my arthritis!",
      "text": "This shower/dressing room tent is perfect for me. I camp in my suv, so I just needed an area to place my porta-potty with room for my clothes, tolietries, dog dishes and a place to sit out of the weather other than my car. I glammed it up a bit with solar lights (I placed the charger outside the back of the tent). I love that it stands on it's own, so I can camp in a camp trailer spot on the asphalt if I need to. I do attach the tent stake rope to my Subaru and dog fence just in case.",
      "rating": 5.0,
      "verified": true,
      "author": "Suzie",
      "helpful_votes": 0,
      "publication_date": 20200612
    },
    {
      "title": "dang nice to have",
      "text": "Used this for the 1st time this past week camping, dang nice to have; coupled w/ a Reliance fold up crapper, wife didn't have to wander off in the dark to the bath house, also great for daylight hours too...super simple to put up/take down; it for sure will be nice for beach fishing trips, just pack long stakes...",
      "rating": 5.0,
      "verified": true,
      "author": "Rik",
      "helpful_votes": 3,
      "publication_date": 20180505
    },
    {
      "title": "Quality  Changing/showering/latrine Tent",
      "text": "I bought this to house a camper style portable toilet while camping during COVID. It’s got substantial weight and sets up easily. We were camping on a mountaintop at Shenandoah National Park so the 4 extra guide lines helped reinforce it as storms were blowing through the area. I left the floor out of the way against the side of the tent. The pockets were great doe extra wipes and hand sanitizer. This was bigger than I needed for this job, but it was easy to unzip I’m the middle of the night. It was extremely easy to set up and take down.",
      "rating": 5.0,
      "verified": true,
      "author": "RoseW",
      "helpful_votes": 0,
      "publication_date": 20200730
    },
    {
      "title": "This product is faulty and with very low built quality",
      "text": "I bought this product a few months ago and by the time I opened its bag the first time and started to install the tent as per the manuel, one of the four vertical poles' contact ring on the tip of the tent broken due to pressure as it is a very weakly built, cheap plastic material. Apparently the whole tent is now obsolete and non operational. Since I live in a foreign country, I had no chance to return it to the states. Such a disgrace. Shame on your build quality for a product with such an expensive price tag.",
      "rating": 1.0,
      "verified": true,
      "author": "Ali Uysal",
      "helpful_votes": 3,
      "publication_date": 20181105
    },
    {
      "title": "... the video it sets up and breaks down very easily. if you are going to use in a ...",
      "text": "as shown in the video it sets up and breaks down very easily. if you are going to use in a rainy situation it definitely needs some seam sealer around the roof vent seams ( we experienced slight dripping as an outhouse shelter in Western NY in February, probably more extreme conditions than it was designed for)",
      "rating": 5.0,
      "verified": true,
      "author": "r11rider",
      "helpful_votes": 3,
      "publication_date": 20180211
    },
    {
      "title": "Good to go",
      "text": "Awesome. Paired this with a hot shower setup. Zodi metal can style. I can't remember what it's called. Anyways. I did have to cut a small hole in the top mesh to run the hose in from the outside. I hang the shower head center inside the tent. Sturdy, easy to set up and great for bigger guys. Plenty of room. Also doubled as a private toilet. I bought a rubber mat from Lowes to put at the bottom which I recommend so you don't have to stand in mud, grass, rocks. works great.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe",
      "helpful_votes": 0,
      "publication_date": 20191203
    },
    {
      "title": "Recommend",
      "text": "This thing is gargantuan!! I could use it as a spare tent if needed, lol. Very fast and easy to set up, and tons of room. I set it up in my living room and only took probably about a minute or two. I will update after taking it down to see how well it fits back into the bag, and difficulty. So far so good! Update: I love this thing!! It is my favorite camping item. :) Zips open and closed with ease, and, fits back into its bag like I had hoped. I recommend it to anyone!",
      "rating": 5.0,
      "verified": true,
      "author": "Melly W.",
      "helpful_votes": 0,
      "publication_date": 20200422
    },
    {
      "title": "Much better quality, more sturdy and larger inside",
      "text": "Its okay I guess. It didnt trust it to hold my 3 gallon water shower. Spend the extra money and get the one from Cabela's. Much better quality, more sturdy and larger inside. Just as fast to setup. I got the one from Cabela's for 150 instead of 200, but even at 200 to 109 I would get the better one which also has a lifetime warrany. If you ever dropped this one on anything sharp like a branch, it would tear in an instant.",
      "rating": 3.0,
      "verified": true,
      "author": "Kraemer",
      "helpful_votes": 5,
      "publication_date": 20170810
    },
    {
      "title": "Sent a known lemon",
      "text": "I didn’t have a chance to try this out until after the 30 days had expired. It was obvious it had been returned. It seems sturdy n might have met my needs, but it won’t unfold properly rendering it useless. We tried no less than 10 times and it doesn’t work. Idk. I’m mostly mad they sent me one that had been returned and obviously was faulty. But to note, apparently some of these are faulty, so make sure you try them out as soon as possible, if decide to buy one.",
      "rating": 1.0,
      "verified": true,
      "author": "M. LANE",
      "helpful_votes": 2,
      "publication_date": 20200414
    },
    {
      "title": "Both of the ones I purchased broke on 2nd use",
      "text": "Once up, this tent is great. Once you set it up and take it down 1 or 2 times, the little plastic piece at the top breaks, and it is not a replaceable piece. The first time I used the tent within a month of purchase, so I was able to return it and get a new one. This second time, it was over a month, so I ended up paying a ton for 2 uses. :( I don't see a better quality one on Amazon, but if someone invents one, I would buy it!",
      "rating": 2.0,
      "verified": true,
      "author": "Shepard O. Humphries",
      "helpful_votes": 0,
      "publication_date": 20180912
    },
    {
      "title": "Not what I ordered",
      "text": "The item I purchased and the item I received were not the same. It wasn't a quick set up tent. There was no compression hub and the poles were not pre-threaded or telescoping as seen in the video. There was a large dual zippered D-shaped door, but there was no towel strap, amenities pockets, or a shelf for solar shower. It wasn't even the same color. I have several quick tents and this wasn't close.",
      "rating": 1.0,
      "verified": true,
      "author": "Deals",
      "helpful_votes": 2,
      "publication_date": 20180826
    },
    {
      "title": "Too easy to set up!",
      "text": "This is a great little enclosure. Probably the fastest tent I have ever set up. Unfortunately when we took it down (also fast and easy!) the stuff sack separated at the seam. I contacted the company and they replaced the stuff sack immediately. I think it was there the next day. I love the tent and I love the service.",
      "rating": 5.0,
      "verified": true,
      "author": "Jane Dudik",
      "helpful_votes": 7,
      "publication_date": 20160922
    },
    {
      "title": "Roomy privacy  in the campground",
      "text": "This, once we figured out how to put it up, Is big around and surprisingly comfortable for my 6'3\" frame. The second time we set it up was easy. We enjoyed taking showers in our dry campsite. Helpful would be a hatch in the roof for our hose, which has to pass through the doorway currently. It dried out quickly in our dry climate and packed up easily, it will ride around permanently in our camper.",
      "rating": 5.0,
      "verified": true,
      "author": "G. MCDONOUGH",
      "helpful_votes": 0,
      "publication_date": 20200801
    },
    {
      "title": "Storage And cleanliness...",
      "text": "Easy to set up, every detail is thoughtful... Strap for towel, shelf for solar heated water bag, well made. Multi purpose at the camp site. A good place to store stuff to keep out of sight or protect from getting wind blown. Those swimming noodles needed for the lake, but where the heck do you put them when not swimming! In the shower of course.",
      "rating": 5.0,
      "verified": true,
      "author": "katy patton",
      "helpful_votes": 10,
      "publication_date": 20150719
    },
    {
      "title": "Large and easy to put up",
      "text": "Looking for a LARGER sized privacy tent? I am in a wheelchair. Fits my chair and a commode. Plus super easy to raise. Allows me to camp again.",
      "rating": 5.0,
      "verified": true,
      "author": "Roscoe Dan",
      "helpful_votes": 5,
      "publication_date": 20170718
    },
    {
      "title": "Quick Setup and Tear Down",
      "text": "I received this last week. We purchased it to use while tailgating at concerts and sports events. My next concert isn't until next month so... we haven't used it yet but... I pulled it out of the box to make sure it was good to go. I went through the set up process twice to make sure it all worked as easily as expected. All is good. Pops together quickly and tears down quickly. Looking forward to using this moving forward! Thanks!",
      "rating": 5.0,
      "verified": true,
      "author": "Bob M.",
      "helpful_votes": 0,
      "publication_date": 20180702
    },
    {
      "title": "no spare parts available",
      "text": "seemed like a nice product with a clever design, but it arrived missing an essential piece of one leg latch and vendor is unable to supply such a simple part, which also does not bode well for any future parts needs, which is a worry because plastic is used at all connections . I fabricated an ad-hoc latch out of a piece of metal.",
      "rating": 3.0,
      "verified": true,
      "author": "Anthony J. Hitchings",
      "helpful_votes": 0,
      "publication_date": 20200711
    },
    {
      "title": "I love it. It is a fast and easy setup",
      "text": "I love it. It is a fast and easy setup. Under a minute. The zipper work well and is easy to open/close. Guy-lines are great to have. First time I used it there was a constant wind. Was still able to set it up by myself and stake it out. Stood strong all weekend long.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20170710
    },
    {
      "title": "Very easy up and down, sturdy, and actually fits back in the bag it came in.",
      "text": "Tried many different ones, this one is by far the best for a shower/ changing room. I did not try to hang a bag, rather had a wand and hose to a heater outside. By far the easiest to put up and take down. It has held up well in pretty high winds that came up. It was staked down. I would buy this one again.",
      "rating": 5.0,
      "verified": true,
      "author": "D Holm",
      "helpful_votes": 0,
      "publication_date": 20180630
    },
    {
      "title": "BUYER BEWARE!!",
      "text": "Received this and set it up in my garage. All seemed fine. I went to the store and came back and the top piece snapped off on its own. Nobody was home or near it. Cheap plastic. Emailed seller and they still have not replied. Maybe it’s a random defect but as of now I can not recommend this tent or this seller.",
      "rating": 1.0,
      "verified": true,
      "author": "MLegin",
      "helpful_votes": 0,
      "publication_date": 20190924
    },
    {
      "title": "Affordable, easy and durable",
      "text": "As a member of the Star Wars 501st Legion, we sometimes have outdoor events and nowhere private to change. This makes the perfect outdoor changing area and the clothes line is great for holding clothes. I'll be using this when I camp as well with the built in shower bag and zip away floor. It's constructed really well and is easy for one person to set up and take down. I'm not easily impressed, but this is by far one of the best purchases I've made.",
      "rating": 5.0,
      "verified": true,
      "author": "C",
      "helpful_votes": 2,
      "publication_date": 20180501
    },
    {
      "title": "Set it up pretty easily. I look forward to setting up camping",
      "text": "Set it up pretty easily. I look forward to setting up camping. I did notice a couple of small holes in the fabric. Disappointed in that flaw.",
      "rating": 4.0,
      "verified": true,
      "author": "Eileen D. Copeland",
      "helpful_votes": 4,
      "publication_date": 20180222
    },
    {
      "title": "Sturdy and attractive",
      "text": "This has ample room and while designed to be a shower/outhouse it can serve many purposes: storage, tool shed, shelter for the bike and scooter, lawnmower. A snack bar away from the bugs and sun and a shelter on the beach from the weather and sun/wind. Sturdy and attractive.",
      "rating": 5.0,
      "verified": true,
      "author": "Logan Hunter",
      "helpful_votes": 0,
      "publication_date": 20180620
    },
    {
      "title": "I am pleased.",
      "text": "As advertised. Actually well thought out. Don't need an engineering degree to use it. They're smart enough to give you a storage bag that is big enough for the folded unit. I'm impressed.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20190410
    },
    {
      "title": "Great Addition to Our Camping Experience",
      "text": "Just used our new tent for the first time on a long weekend camping trip and it worked perfectly. Easy to put up and plenty of space for showers (used with a reusable shower bag), changing, and even as a portable bathroom (used with a luggable loo). We staked it down and it withstood some strong wind that came through. It was slightly challenging to take down, but with additional use we are confident this will become easier. The only modification that would make this a better product would be larger vents. Definitely recommend if you are looking for something to give you additional space for camping activities or an alternative to using public bathhouses.",
      "rating": 4.0,
      "verified": true,
      "author": "Terri P.",
      "helpful_votes": 0,
      "publication_date": 20200629
    },
    {
      "title": "Easy set up and take down.",
      "text": "I'm crippled and I can set this up with no problems, the only concerns that I have is with the tie downs, I put regular old 1\" hose clamps just above the quick release button and anchored it more, that latch looks to be a bit unstable. Seems sturdy, we'll see?",
      "rating": 4.0,
      "verified": true,
      "author": "Larry",
      "helpful_votes": 0,
      "publication_date": 20200707
    },
    {
      "title": "design, materials and fabric / sewing are very good.  i have never set up a tent as easily as this shelter.",
      "text": "i have seen other camp privacy shelters and this one is far better. setup is so easy, one person can set this up in a minute...amazing. the poles are very strong and powder coat finish will keep them from corroding.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Kelso",
      "helpful_votes": 2,
      "publication_date": 20180516
    },
    {
      "title": "Will be used as a shower",
      "text": "My wife and daughter/inlaws wanted a shower at our cabin. This seems to be a good structure. We received it in a timely manner, and will be combining it with a Camplux Tankless gas heater, not a bagbed heater that may be used with it. It sets up easy, as the instructions are sewn on the tent bag. We have not used in the field yet though, this spring.....",
      "rating": 5.0,
      "verified": true,
      "author": "Mike S.",
      "helpful_votes": 0,
      "publication_date": 20181202
    },
    {
      "title": "Spacious and great quality!",
      "text": "It took us a bit to set it up the first time because it was inside out and twisted BUT since we got it figured out, it will be easy now! It's very roomy and seems to be of good quality. We got it to serve as a bathroom and changing tent when we go camping in our truck camper. Can't wait to try it out!",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa K.",
      "helpful_votes": 2,
      "publication_date": 20170203
    },
    {
      "title": "Camping must have!",
      "text": "Having a pop up camper is awesome!!! But changing can be a pain cause there is not a lot it room. So we decided we needed a room to change! I cane across this one and I am abs in love! It works perfect! Has pouches inside to hold stuff. Floor can be down or not. I am also potty training a 2 year old so placed a small potty for her inside.",
      "rating": 5.0,
      "verified": true,
      "author": "Christine Castro",
      "helpful_votes": 0,
      "publication_date": 20200723
    },
    {
      "title": "I did find it very easy to set up and take down",
      "text": "While I haven't used it camping yet, I did find it very easy to set up and take down. The design and construction seem really sturdy. It's larger than I expected, plenty of room. I like the vents too, the last shower tent I owned was like a sauna, I expect the vents to really help with cooling.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Corn",
      "helpful_votes": 9,
      "publication_date": 20150430
    },
    {
      "title": "I’m Impressed",
      "text": "After watching the setup video, it was fast and easy. No defects, nice and roomy, just what I was looking for. Take down was also fast and easy. Putting it back in storage was also easy. Hope this last. So far I’m impressed.",
      "rating": 5.0,
      "verified": true,
      "author": "Bill Wayne Oha",
      "helpful_votes": 0,
      "publication_date": 20200310
    },
    {
      "title": "Does NOT do what it says.",
      "text": "I bought this to use for showering when camping for long periods of time. I also bought a camp shower bag. But the tent was unable to stay up with the hanging shower bag. Even though this was designed to hold a shower bag it doesn't. The whole tent fell every time and twisted. This would have been great but unfortunately it did not do its job. Especially if there is some wind.",
      "rating": 3.0,
      "verified": true,
      "author": "JuicyJuwee",
      "helpful_votes": 0,
      "publication_date": 20200716
    },
    {
      "title": "Handy - dandy",
      "text": "We used it as a changing and porta-potty next to our tear drop trailer.used doodie bags in our Honey Bucket. Room enough to stand up in",
      "rating": 5.0,
      "verified": true,
      "author": "Susan Bliss",
      "helpful_votes": 6,
      "publication_date": 20150816
    },
    {
      "title": "Excellent product. Goes right up",
      "text": "Excellent product. Goes right up. I have had others that were not nearly as good. I love this one Also the extra room in this one is awesome I have smaller ones and they were not easy to shower in.",
      "rating": 5.0,
      "verified": true,
      "author": "FCE",
      "helpful_votes": 2,
      "publication_date": 20180309
    },
    {
      "title": "love it!",
      "text": "we just used this on our latest camping trip and we loved it! Easy to set up and take down. Lot's of room to shower and it's thick so you have lots of privacy. Definitely recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Staci Weber ",
      "helpful_votes": 0,
      "publication_date": 20200719
    },
    {
      "title": "Perfect camping shower",
      "text": "I couldn’t be happier with this shower! It is huge and roomy... tall enough for a person 6ft to shower comfortably. It gets steamy inside if you don’t open the vents, but that’s not a big deal for us. I love how you can configure the bottom and attachments. Huge thumbs up!",
      "rating": 5.0,
      "verified": true,
      "author": "JDGfamily",
      "helpful_votes": 0,
      "publication_date": 20200713
    },
    {
      "title": "FRAGILEand no replacement parts.....",
      "text": "Bought this to replace my old and complicated PAHA QUE shower tent. Loved its fast set up and size but you want to talk about fragile.....????? It fell over ONCE and broke one of the upper \"knuckles\". Just now called Lightspeed and was told they don't make or keep parts. $120 shower now worthless from a $5.00 part. I will never buy another product from Lightspeed. Dumb and waste full company.",
      "rating": 2.0,
      "verified": true,
      "author": "Todd Stricker",
      "helpful_votes": 0,
      "publication_date": 20200724
    },
    {
      "title": "Great for Camping",
      "text": "Nice size, easy setup. We used it camping to provide privacy as a combo shower, changing room, and toilet.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Foster",
      "helpful_votes": 3,
      "publication_date": 20170623
    },
    {
      "title": "Complete waste of money",
      "text": "The first time we set this up a pin was missing out of one pole. We where up in the mountains and had to use it. On the second day as my husband was setting the shower bag on top two poles broke and the whole thing was useless. A complete waste of money",
      "rating": 1.0,
      "verified": true,
      "author": "Darcie",
      "helpful_votes": 0,
      "publication_date": 20180806
    },
    {
      "title": "Easy, quick and oversized",
      "text": "Sturdy, oversized tent that sets up and tears down quickly. We use this to shower and use the bathroom in while camping off the grid. A little pricey but it does work well.",
      "rating": 5.0,
      "verified": true,
      "author": "OC Dead Head",
      "helpful_votes": 0,
      "publication_date": 20200515
    },
    {
      "title": "Well...",
      "text": "I like it for camping once we took it apart and put back together not sure if they sent a return but it was all twisted when I got it had to completely disassemble and put back the right way once that was done it’s a great bathroom / shower for camping just wish it would have been right originally",
      "rating": 3.0,
      "verified": true,
      "author": "Pen Name",
      "helpful_votes": 0,
      "publication_date": 20190610
    },
    {
      "title": "Easy.",
      "text": "Wow. I’m honestly surprised there’re not more tents that just seem to “flow” like this one. Awesome shower tent. Roomy enough for two. Super easy to put up.",
      "rating": 5.0,
      "verified": true,
      "author": "B Kaiser",
      "helpful_votes": 0,
      "publication_date": 20191001
    },
    {
      "title": "Best Essy Set up Toom yet!",
      "text": "The reviews I read were true. Easy to put up just like the video showed. I am s 5'2, 60 year old and was able to put this up in less then 5 minutes. I did have to stake it or the wind did blow it over. Plenty of room! Love it",
      "rating": 5.0,
      "verified": true,
      "author": "Pamela Hutchings",
      "helpful_votes": 4,
      "publication_date": 20170530
    },
    {
      "title": "Good for what you need",
      "text": "Set it up the first time in our living room. The only issue was locking lower legs into place takes some doing to get them latched. Really roomy inside.",
      "rating": 4.0,
      "verified": true,
      "author": "bob",
      "helpful_votes": 0,
      "publication_date": 20200601
    },
    {
      "title": "Easy set up.",
      "text": "The best privacy tent I’ve ever owned. Love it!!! . Big and roomy with room to hang wet swim suits etc. Very easy to set up and take down. Just make sure you use guy ropes especially if it’s windy. I lost my sleeping tent and pop up shelter in a recent storm. The only tents that weren’t damaged were my privacy shelters. Great item. I recommend it to everyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Life-long camper",
      "helpful_votes": 0,
      "publication_date": 20190615
    },
    {
      "title": "Quality",
      "text": "Am an avid rafter ,so it’s nice to provide a covered space for the Toilet! It provides plenty of room and is much easier to put up and take down. Take your time and use all , I mean all the tie downs and close the zipper on the door and it stands up to the wind .",
      "rating": 5.0,
      "verified": true,
      "author": "Jimfixit",
      "helpful_votes": 0,
      "publication_date": 20190520
    },
    {
      "title": "Great product!!!",
      "text": "The light speed pop-up was perfect for our camping trip. We used it as a bathroom with our camping toilet, and to change into and out of our swimwear . Also not having to use the campground bathhouse during the Covid 19 outbreak was a huge plus! I am impressed with the size and quality and the ease of set up and take down. I highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Carol Grote",
      "helpful_votes": 0,
      "publication_date": 20200725
    },
    {
      "title": "Excellent product and definetly a purchase for those in search ...",
      "text": "Excellent product and definetly a purchase for those in search for a large privacy shelter and shower. I live in Hawaii and I recently used it for a shower during our beach camp out. Heavy duty, easy to set up and breakdown and with all the options of hooks and compartments made showering that much more easy. Excellent product Lightspeed and once again beyond satisfied. Mahalo.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. U",
      "helpful_votes": 9,
      "publication_date": 20161114
    },
    {
      "title": "Love it!",
      "text": "I've had a number of these types of \"tents\" over the years. I use it for a bathroom tent. This one was the easiest to set up. I liked that the floor could be used or not too.",
      "rating": 5.0,
      "verified": true,
      "author": "Vicki",
      "helpful_votes": 7,
      "publication_date": 20160830
    },
    {
      "title": "This tent is very roomy.  Easy set up and take down",
      "text": "I use this tent to enhance my truck camping. This tent gives me a comfortable place to clean up, change clothes, use my portable toilet and take a shower. So far I'm very happy with it. It's easy to set up and take down too.",
      "rating": 5.0,
      "verified": true,
      "author": "Christina Wilkinson",
      "helpful_votes": 0,
      "publication_date": 20200730
    },
    {
      "title": "easy set up great product.",
      "text": "great product so far, only used twice. material seems a bit thin. we will only be using it as a potty/ changing room so works fine for our needs. super easy set up and take down and once up is sturdy. much better than those round folding ones.",
      "rating": 5.0,
      "verified": true,
      "author": "mvas",
      "helpful_votes": 0,
      "publication_date": 20181029
    },
    {
      "title": "Cheap metal, broke first use.",
      "text": "Broke trying to set up. Made out of cheap pot-metal or something. First time trying to use. What a waste of mony.",
      "rating": 1.0,
      "verified": true,
      "author": "Gene Beck",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "Not happy",
      "text": "Unfortunately we could not use the tent until this weekend and found it came with a couple small holes in the door and after it rained there are leaks everywhere and the floor is flooded. Not happy at all with this product and apparently it’s to late to send it back....",
      "rating": 1.0,
      "verified": true,
      "author": "Jura B",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "Works good",
      "text": "Easy to set up. I need some practice to putting it away. Really like having it. The openness inside is great",
      "rating": 5.0,
      "verified": true,
      "author": "Gardner",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "Great product. Setup takes about 60 secs",
      "text": "Great product. Setup takes about 60 secs. Take down about 2 minutes to get it down and back into the bag. YES, you can actually get this back into the included bag with very little effort. The poles stay connected to the enclosure and folds up as a complete assembly. This was the #1 selling point for me. No separate tent poles to assemble and fit into the enclosure. Great product that was very well thought out.",
      "rating": 5.0,
      "verified": true,
      "author": "TPlasek",
      "helpful_votes": 0,
      "publication_date": 20180711
    },
    {
      "title": "Easy setup, good quality",
      "text": "Easy to set up. Bigger than expected. You’ll need the built-in tie downs for windy conditions or a heavy shower bag",
      "rating": 5.0,
      "verified": true,
      "author": "odwjz_rz",
      "helpful_votes": 0,
      "publication_date": 20190415
    },
    {
      "title": "Easy to setup and breakdown",
      "text": "Works great 👍 easy set up and breakdown... I would highly recommend this product!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190825
    },
    {
      "title": "Rain proof.",
      "text": "Wanted to love the tent, did at first. I have a small trailer so I needed good storage. Well it is not rain proof, expensive things ruined. I just love the easy set up and take down. I it is large. We used it as a changing room from wet pool.",
      "rating": 3.0,
      "verified": true,
      "author": "Cindy",
      "helpful_votes": 0,
      "publication_date": 20180702
    },
    {
      "title": "Good shower tent",
      "text": "Easy to put up, you might need two people to put up. Perfect for military training shower tent. Big enough to change in",
      "rating": 5.0,
      "verified": true,
      "author": "Megan",
      "helpful_votes": 0,
      "publication_date": 20190606
    },
    {
      "title": "Easy setup! Great product!",
      "text": "Incredibly easy to set up and break down. Not kidding. I’m a photographer and I use this for my models at fashion shoots for them to change clothes. Very roomy. Can’t stress how easy the set up and break down is. And it easily fits back into its carry bag.",
      "rating": 5.0,
      "verified": true,
      "author": "Jesse Moore",
      "helpful_votes": 0,
      "publication_date": 20200214
    },
    {
      "title": "Easy to set up and sturdy",
      "text": "Excellent product. Used it for almost 4 weeks on our cross Canada Trip, setting it up and breaking it down at least 20 times. We did stake it out each time and it withstood some heavy winds and rain. My wife was very pleased with our privy. We have been camping together for 40 years and her only complaint was that we didn’t have it sooner.",
      "rating": 5.0,
      "verified": true,
      "author": "Dr Jim",
      "helpful_votes": 0,
      "publication_date": 20190707
    },
    {
      "title": "TOP OF THE LINE !!!",
      "text": "EASY SET UP, ROOMY, AND VERY STABLE, WHEN SPIKED WITH ITS INCLUDED SUPPORTS FOR WINDY CONDITIONS. AWESOME PRODUCT !!!",
      "rating": 5.0,
      "verified": true,
      "author": "dcurl",
      "helpful_votes": 3,
      "publication_date": 20170419
    },
    {
      "title": "Shower",
      "text": "We had two Grandsons visit us for 10 days, they showered in it because we are living in a 23' travel trailer while having a home built. They could not fit in small shower in trailer. Worked perfectly",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190627
    },
    {
      "title": "Shower tent",
      "text": "I used this tent as a shower tent when I was having my bathroom renovated. It worked out great!",
      "rating": 5.0,
      "verified": true,
      "author": "Irene Dwyer",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "Good but almost see-through",
      "text": "Nice build, good and fast setup... my problem with this product? It is almost see-through, very thin material",
      "rating": 2.0,
      "verified": true,
      "author": "Laz B",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "Nice tent quick and easy",
      "text": "Seriously good quality stuff here it's worth the extra bucks compared to others, as they say you get what you pay for its true",
      "rating": 5.0,
      "verified": true,
      "author": "chris",
      "helpful_votes": 0,
      "publication_date": 20190320
    },
    {
      "title": "Love It",
      "text": "Sets up fast and easy. Must have camping accessory. Recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve in AZ",
      "helpful_votes": 0,
      "publication_date": 20200729
    },
    {
      "title": "great product. Easy to open and close",
      "text": "great product. Easy to open and close. We use this as a changing room for our small business, customers love it.",
      "rating": 5.0,
      "verified": true,
      "author": "AlGiotti",
      "helpful_votes": 2,
      "publication_date": 20170614
    },
    {
      "title": "Best buy ever!",
      "text": "I use this as a changing room for my LuLaRoe customers and everyone loves it! People are always trying to buy it at my vendor events and other retailers who bring their changing tents always ask to use mine for their customers. 😂 Easy to put up and take down, roomy, and you cannot see through it, unlike some changing tents I’ve tried. I’m buying one to take camping!",
      "rating": 5.0,
      "verified": true,
      "author": "adoragurl",
      "helpful_votes": 0,
      "publication_date": 20181102
    },
    {
      "title": "High quality and big.",
      "text": "This changing tent is great quality and does set up very quickly. It is bigger than other similar tents I have seen. Because it is bigger it is a little heavy, and can tough to put away with one person.",
      "rating": 5.0,
      "verified": true,
      "author": "bt",
      "helpful_votes": 0,
      "publication_date": 20180815
    },
    {
      "title": "It went up quickly and easily and served the purpose for an outdoor restroom",
      "text": "This privacy tent was an instant campground hit. \"It changed everything about camping for me.\" - My lady. It went up quickly and easily and served the purpose for an outdoor restroom. Also, packs up nicely into its bag. Only issue is I was a little concerned that I was bending the poles putting it up, but everything has been fine. The telescoping poles make this a snap to put up. Very good quality. I would recommend and definitely purchase again. Happy Camper.",
      "rating": 5.0,
      "verified": true,
      "author": "J.G.",
      "helpful_votes": 11,
      "publication_date": 20141109
    },
    {
      "title": "A good purchase",
      "text": "Very impressed with the ease and speed with which the privacy tent sets up. I did so alone in less than 10 minutes. Instructions are stitched into the carrying case and everything fit back in once I took it down, also simple. Purchased for a camp shower/toilet for a week long state park trip.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170807
    },
    {
      "title": "Four Stars",
      "text": "works great wondering if there is top cover for it it leaks in heavy rain Thanks",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180509
    },
    {
      "title": "Great small tent.",
      "text": "This is it. If you are looking for a good small tent this one will be it to buy. Order came fast. Easy to go up and take down. Instruction made into carry bag.It is a winner.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve5105",
      "helpful_votes": 0,
      "publication_date": 20180523
    },
    {
      "title": "Great changing room and along with a chemical toilet, bathroom.",
      "text": "I'm a heavy tent camper and this thing is great as a changing room and shower/toilet room. Very quick to set up and sturdy.",
      "rating": 5.0,
      "verified": true,
      "author": "William",
      "helpful_votes": 0,
      "publication_date": 20170922
    },
    {
      "title": "Works well, but poor quality",
      "text": "I actually like the tent, but it came with small holes in the material and one seam is not correctly sewed. See photos. I sent two emails to the seller and neither were answered.",
      "rating": 2.0,
      "verified": true,
      "author": "C. Martin",
      "helpful_votes": 10,
      "publication_date": 20170608
    },
    {
      "title": "Roomy",
      "text": "There is a lot of interior space. As a single women I can set up and break down solo. Would give it a 5 star but, bottom seam ripped in high winds. I taped it with gorilla tape. Otherwise, love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Linda Abuhasou",
      "helpful_votes": 0,
      "publication_date": 20190702
    },
    {
      "title": "Awesome for camping!",
      "text": "This thing has come in handy for us while we were building our weekend spot/campsite. Used for camping port-a-potty, and made a nice shower too!",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda Buenemann",
      "helpful_votes": 0,
      "publication_date": 20190923
    },
    {
      "title": "Camp Shower/ Porta Potti",
      "text": "I used this tent this past weekend. I have a Portable toilet and purchased this tent to use it with. First time taking my kids camping and didn't want them venturing out late at night to use bathroom. I also used it to change my clothes instead of changing in my tent. Definitely worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "James Vereline",
      "helpful_votes": 0,
      "publication_date": 20180822
    },
    {
      "title": "Quick set up and well made",
      "text": "One person can set it up in just a few minutes. We used it for a week-long roadtrip while camping. We purchased a 5 gallon shower bag as well that easily fit in the top harness for showering and doing dishes",
      "rating": 5.0,
      "verified": true,
      "author": "Keith Belt",
      "helpful_votes": 0,
      "publication_date": 20200523
    },
    {
      "title": "Setting up and taking down are very easy and it worked great",
      "text": "WE got this to use as a shower room as well as privacy for the toilet. Setting up and taking down are very easy and it worked great. My wife loved it!",
      "rating": 5.0,
      "verified": true,
      "author": "Braddog",
      "helpful_votes": 0,
      "publication_date": 20180705
    },
    {
      "title": "Love this tent!",
      "text": "So easy to set up! Love the large space inside.",
      "rating": 5.0,
      "verified": true,
      "author": "Adam Kickish",
      "helpful_votes": 0,
      "publication_date": 20191030
    },
    {
      "title": "I got this to be used as a camping shower tent",
      "text": "Very easy to set up, but the construction materials are a bit on the thin side. I use this privacy tent for showering while camping and I have no complaints with it for that use.",
      "rating": 5.0,
      "verified": true,
      "author": "Bob Thompson",
      "helpful_votes": 0,
      "publication_date": 20190804
    },
    {
      "title": "Very good!",
      "text": "This was super easy to setup and take down! It was very sturdy too! Loved using it during my camping trip!",
      "rating": 5.0,
      "verified": true,
      "author": "sarah",
      "helpful_votes": 0,
      "publication_date": 20170521
    },
    {
      "title": "Directions were very easy to follow",
      "text": "I had a stroke 3 years ago so my right side isn’t very strong making it very hard for me to set up regular tents. I can’t believe how quick and easy it was setting up this pop up shower tent. Looking forward to using it.",
      "rating": 5.0,
      "verified": true,
      "author": "Demian H.",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "Super easy set up.",
      "text": "Easy to set up and take down. We needed an extra private space for our large family on our camping trips and this product was just what we needed.",
      "rating": 5.0,
      "verified": true,
      "author": "Connie McEntarffer",
      "helpful_votes": 0,
      "publication_date": 20190822
    },
    {
      "title": "Great for privacy, easy set up and take down but will not support a solar shower bag",
      "text": "Great for privacy, easy set up and take down but will not support a solar shower bag",
      "rating": 4.0,
      "verified": true,
      "author": "Dan Theman",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "Spacious",
      "text": "Sets up and takes down extremely easy. seems durable so far and has enough space to fit a chair, heater, and pack inside.",
      "rating": 5.0,
      "verified": true,
      "author": "matt",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "This was a great buy! It's exactly what we were looking for",
      "text": "This was a great buy! It's exactly what we were looking for, and it was really easy to set up!",
      "rating": 5.0,
      "verified": true,
      "author": "BTS",
      "helpful_votes": 0,
      "publication_date": 20161126
    },
    {
      "title": "Great shower tent",
      "text": "Easy to set up, plenty of room and lots of pockets. Didn't use the solar shower bag holder but it looks good if you go that route.",
      "rating": 5.0,
      "verified": true,
      "author": "Dennis Masuda",
      "helpful_votes": 6,
      "publication_date": 20140909
    },
    {
      "title": "easy to set up and take down really enjoyed having",
      "text": "Bought this for Thanksgiving weekend for a Desert camping trip. Used it for a shower and toilet room it is well made, easy to set up and take down really enjoyed having it",
      "rating": 5.0,
      "verified": true,
      "author": "Kim Starrs",
      "helpful_votes": 0,
      "publication_date": 20171201
    },
    {
      "title": "Easy and speedy to use",
      "text": "Easy and speedy to use. Great design. I would suggest some more robust ground stakes but the ones it comes with do the job but can bend if used in hardpack.",
      "rating": 5.0,
      "verified": true,
      "author": "JG",
      "helpful_votes": 0,
      "publication_date": 20180520
    }
  ],
  "product_meta": {
    "title": "Lightspeed Outdoors Xtra Wide Quick Set Up Privacy Tent, Toilet, Camp Shower, Portable Changing Room",
    "rating": 4.5,
    "feature_bullets": [
      "Quick set up with compression hub and pre threaded telescoping poles (see video); Large dual zippered D-shapped door; Umbrella rated 800mm PU coated for wet weather",
      "Floor can be clipped up or down for use; Towel strap, amenities pockets, and shelf for solar shower ( shower bag not included); 2 zippered mesh rooftop windows",
      "Open size 5' w x 5' d x 6.75' h; Packed size 41\" x 7.3\"; Weight 14.6 lbs",
      "Includes: tent stakes, guylines, and oversized carrybag for easy packing",
      "Large, easy to use privacy tent, camp toilet, camp shower and changing room"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "61 x 80.7 x 61 inches; 15.2 Pounds",
      "Date First Available": "February 8, 2014",
      "Manufacturer": "Lightspeed Outdoors",
      "ASIN": "B00IBM7N40",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Camping & Hiking",
      "Outdoor Recreation",
      "Sports & Outdoors",
      "Camping Shelters",
      "Privacy Shelters",
      "Tents & Shelters"
    ],
    "price": ""
  }
}