{
  "website_summaries": [
    {
      "verdict": "A top-of-the-line model with exceptional quality. If you want to grab attention with exceptional images, this is the one to get.",
      "pros": [
        "Sturdy, rigid screen made of high-quality vinyl",
        "Excellent images"
      ],
      "cons": [
        "Assembly is required (takes 30 to 40 minutes)"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Excellent Screen. Assembly video attached.",
      "text": "Excellent Screen. I've now assembled and used both the Silver Ticket and Elite Screens models, and Assembly is actually a bit easier with the Silver Ticket Screen. Check out my assembly video.",
      "rating": 5.0,
      "verified": true,
      "author": "Mes045",
      "helpful_votes": 554,
      "publication_date": 20161020
    },
    {
      "title": "World of difference!",
      "text": "I have nothing to compare it to other than my lightly textured tan wall and boy what a difference! Assembly was easy and material was made with high quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Koopa",
      "helpful_votes": 471,
      "publication_date": 20150504
    },
    {
      "title": "Excellent screen and easy build",
      "text": "Excellent screen and easy build. I fixed some LEDs to the back. Keep them close to the inside so the lip doesn't cast a shadow where you want your light. I rigged up a suspension so I didn't have to fix it to a cement basement wall. Really helped with letting the LEDs do their thing. LED control zip tied to one of the included wall mounts. IR hidden in the eyelet. No waves or wrinkles black velvet is very forgiving if you're not perfectly aligned. We love it!",
      "rating": 5.0,
      "verified": true,
      "author": "David Shelton",
      "helpful_votes": 52,
      "publication_date": 20170626
    },
    {
      "title": "Easy to install and looks amazing! Used 2x4's behind the screen to install LED lighting.",
      "text": "Easy to install and looks amazing! Used 2x4's behind the screen to install LED lighting.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 154,
      "publication_date": 20160202
    },
    {
      "title": "Great screen",
      "text": "Good screen but Silver Ticket didn't re-design to accommodate acoustically transparent screen. Utilizes same frame as solid screen material, which is a fantastic frame setup but you can see two support bars down screen in their 1/3 segments (or where ever you put them). They are most noticeable obviously using bright scenes... like hockey ice. Screen material is indeed acoustically transparent though. I used brighter in wall speakers behind since the screen will absorb some of the high frequencies. Would purchase again but may try a different color wrapping over internal support bars other than the black velvet provided. Takes two people to build and hang. Overall, it is a beautiful set up, very appealing in any standard of room.",
      "rating": 4.0,
      "verified": true,
      "author": "simon",
      "helpful_votes": 10,
      "publication_date": 20170621
    },
    {
      "title": "Good price, but you get what you pay for",
      "text": "This screen has decent picture quality and looks good. But the assembly is very time consuming and compared to more expense models, like Da-Lite and Stewart, it does not have the reflectivity, sharpness. Installation on the wall needs significant improvement, The current 4 eye hooklets are nearly impossible for a perfectly level installation and tightness to the wall so it doesn't vibrate with a subwoofer. It can be done, but takes an unreasonable amount of time. But again, for the price vs the other brands mentioned above, it's understandable, being that those other brands cost well over $1000.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Buyer",
      "helpful_votes": 3,
      "publication_date": 20190830
    },
    {
      "title": "Best screen I have owned to date.",
      "text": "I have had an 140 inch retractable screen for a very long time. It was very cheap at the time I purchased it. Just recently bought an UST 4k laser projector and was in shock when every single little flaw was visible on my old screen after hooking up my laser projector. Purchased this screen, and the clarity and quality of the image is so much better. The improvement is more than I expected. I am 100% pleased with this purchase. I easily assemble and mounted the screen by myself. Most people will probably need help. The screen material is very flat with no wri kles or creases.",
      "rating": 5.0,
      "verified": true,
      "author": "D.S.",
      "helpful_votes": 4,
      "publication_date": 20180926
    },
    {
      "title": "Great Screen",
      "text": "With a 1.5 gain, this screen is excellent for daytime viewing where ambient light is somewhat controlled. In a dark room, the screen has excellent performance even if a light at the back of the room is turned on. Much better than a white screen which is more sensitive to ambient light. Blacks are also very good. These observations are from a 5.2.4 system using an Epson 3700 projector with 3000 lumens mounted 17ft from a 135\" screen using both an Eco and Medium brightness mode. The AVR is a Marantz SR6013 unit. Priced at $599, I have no complaints.",
      "rating": 5.0,
      "verified": true,
      "author": "loggiarch",
      "helpful_votes": 2,
      "publication_date": 20200708
    },
    {
      "title": "Great grey screen.",
      "text": "My family and I couldn't be happier with our screen. It's a great match to our Epson 2045 projector in the upstairs living room/HT. Screen tightens up and stays that way, perfect flat projecting surface. Assembly wasn't bad after watching someone do it on YouTube and hanging it wasn't as bad as I thought it would be. This subtile grey screen is at least half the price of the other guys, recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "JMcI",
      "helpful_votes": 12,
      "publication_date": 20160719
    },
    {
      "title": "Great price and very easy to install.  THANKS!",
      "text": "My $0.02 I was concerned about sound quality (I have L/C/R in-wall) no issues - WOW - I cant even tell the screen covering the speakers. Screen itself is VERY high quality and sturdy. THIS IS A 2 PERSON JOB Picture quality 4K is incredible! Love the \"wider edging\" helps with larger installs (I have the 150\") I would 100% recommend and would buy again if ever in a situation to do so. Pics soon... AH",
      "rating": 5.0,
      "verified": true,
      "author": "Andy Hughes",
      "helpful_votes": 0,
      "publication_date": 20200927
    },
    {
      "title": "Missing parts",
      "text": "The package is missing all the bolts and l brackets etc.. not sure who to contact without having to re package and return whole item.",
      "rating": 1.0,
      "verified": true,
      "author": "Chandler Adams",
      "helpful_votes": 3,
      "publication_date": 20200619
    },
    {
      "title": "Pretty good screen.",
      "text": "Pros: -First time assembly: 1.5 hours by my self, being extra careful. That's good. -All parts are there, everything fits together perfectly -Screen, when complete is still pretty light, stretches evenly across the frame and has a very nice border. -It hangs well on the wall so very easily. Cons: -You have to assemble it -You need lots of space to lay everything out cleanly Overall: The cons are, well, expected. The pros, are overwhelmingly good. It's perfect for our purposes, and it looks very nice. Projected images are clear as any screen I have used or better. I can't really think of anything that would detract me from recommending this screen.",
      "rating": 5.0,
      "verified": true,
      "author": "John Hermanson",
      "helpful_votes": 3,
      "publication_date": 20170728
    },
    {
      "title": "Great 4k video quality and looks AMAZING",
      "text": "I spent hours looking at options from $2700 screens at Bestbuy to screen paint that friends have sworn by....but I selected the Silver Ticket screen instead, based on the reviews and ratings I saw online. I LOVE THIS SCREEN! The black felt edge completely absorbs light, meaning the edge to your video will be extremely sharp, once you set your projector up. It took about 45 min to put together and then hang it up, by myself, although a buddy could have made the hanging easier. Note, I am pretty mechanically savy, so it could take longer. The screen seriously looks professional on the wall, even when the projector is off! Highly, highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan from Delaware",
      "helpful_votes": 0,
      "publication_date": 20190520
    },
    {
      "title": "Very good quality for the price",
      "text": "You can't go wrong with these. The price is pretty good when compared to the competition. Setup is also quite easy (just make sure you have the space lol, struggled a little with a 120 inch but totally worth it) If you have a projector, you really need a good quality screen to make the most of it. Makes a big difference to the image quality when compared to projecting directly on a white wall. Also, I got the grey version but realised that white would be better since my projector contrast is already very good. I got a replacement white screen from silver ticket (just check their website). So didn't have to buy the frame again.",
      "rating": 5.0,
      "verified": true,
      "author": "Ramto_8",
      "helpful_votes": 0,
      "publication_date": 20190221
    },
    {
      "title": "Simply Amazing",
      "text": "There’s not much else to say that hasn’t already been said. This thing is 5 stars on thousands of reviews for a reason. The image quality is amazing. The setup was incredibly easy, like others have said, until you try to hang it. Getting it level is really, really difficult, that is until I decided to get a laser level. We spent hours trying to get it level and just couldn’t. With a cheap laser level we were able to get it perfectly level immediately on the first try. Do yourself a major favor and put a laser level in the budget if you don’t already own one.",
      "rating": 5.0,
      "verified": true,
      "author": "ghostrider",
      "helpful_votes": 0,
      "publication_date": 20200807
    },
    {
      "title": "The build quality is outstanding!!!",
      "text": "I am blown away by this screen. The build quality is fantastic. The parts fit together perfectly, assembly was incredibly easy. For something so simple, the design is fantastic. It’s sturdy, it’s rigid, it goes together extremely well, and the screen just fits, with enough stretch to ensure a wrinkle free picture! The felt frame is an excellent border that perfectly absorbs any excess light from the projector! I am extremely satisfied with this purchase, and would highly recommend silver ticket screens for anyone looking for a quality, professional projector screen! My only disappointment is that I didn’t go one size bigger! 😂",
      "rating": 5.0,
      "verified": true,
      "author": "Titanicfanatic",
      "helpful_votes": 0,
      "publication_date": 20190925
    },
    {
      "title": "125” 2.35:1 projector screen (grey material)",
      "text": "Projector screen was easy to unbox. Instructions were easy to follow, and all assembly tools were provided. All I needed was a screwdriver and a level. I assembled the screen by myself, and it took about an hour, give or take a few minutes. The most difficult part for me was getting the tension rods installed. With a second person to help guide the end of the rods, it would probably be easier. I chose grey material due to not being in a fully light controlled environment. I get some light reflection off of my white ceiling tiles, but it is negligible. Make sure you research proper screen size and lighting conditions prior to making your screen purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Wilson",
      "helpful_votes": 0,
      "publication_date": 20190805
    },
    {
      "title": "Easy to assemble and Mount W/ great Picture",
      "text": "This Projector was very easy to assemble. Any one who says other wise has weak hands or bad arthritis. Doesn't weigh very much so was very easy to hang by my self. As long as you can use a tape measure and Drill/screw driver your gonna be fine. I was projecting on my wall for a few days before this arrived and was satisfied with that. But with the screen I love my new projector even more. I'm using an epson 5040ub, a panasonic 420 blu ray player, the Rubio Optical HDMI 50' cable and everything runs very smooth. I will try the 3d Today and update the review if its not a great experience.",
      "rating": 5.0,
      "verified": true,
      "author": "Nathan T. Rood",
      "helpful_votes": 0,
      "publication_date": 20200308
    },
    {
      "title": "I assembled the 15' screen and it was pretty dang tough",
      "text": "Product works as advertised. I assembled the 15' screen and it was pretty dang tough. The frame went together nicely, stretching the screen - SUCKED!! I ruined several of the springs trying to stretch the screen. If you are going to purchase a larger screen, please get someone to help you. It took literally 4 hands to stretch the screen material across the frame. Maybe some practical advice/tips (\"start with the corners\") or something in the little 2 page install guide would of been great.",
      "rating": 3.0,
      "verified": true,
      "author": "James Tucker",
      "helpful_votes": 2,
      "publication_date": 20180612
    },
    {
      "title": "not ambient light rejected  - what a bummer.",
      "text": "This stated ambient light rejecting but it not at all even after following all installation instructions.",
      "rating": 1.0,
      "verified": true,
      "author": "Jesse",
      "helpful_votes": 7,
      "publication_date": 20180419
    },
    {
      "title": "Not Really Impressed",
      "text": "This was a 120\" gray screen. It went on a wall that was already painted about the same gray color. I mounted the projector (BenQ TH671ST), then bought this screen. Was expecting to see a big difference in the picture, but really didn't. The screen looks good, was well packed and seems to be solid, but truthfully it's not needed if you already have a similar color with an eggshell or semi-gloss finish paint. Would be better it it was in the $100-$150 range. Glad I didn't go with high contrast materal for the extra cash. Probably no difference either. If you're on the fence, would say to hold-off or spend cash on a better projector or receiver/speakers.",
      "rating": 3.0,
      "verified": true,
      "author": "Kelly VanBussum",
      "helpful_votes": 0,
      "publication_date": 20191030
    },
    {
      "title": "Amazingly High Quality!!!!",
      "text": "This projector screen is amazing. It comes with a black suede border and thick screen material. The quality of this screen is stellar. It looks just like a LED television when the projector is on (I have the epsom HD 1060 $500 from best buy). I read reviews that it was difficult to put together but my husband just read the instructions and put it together with no issues. Initially, we we’re going to project it on the wall, and it looked good, but having the screen makes the picture brighter especially during the day and makes my living room look more fluent. If you are hesitant about buying this screen, don’t be!!! You will not be disappointed!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Catrina Johnson",
      "helpful_votes": 0,
      "publication_date": 20190525
    },
    {
      "title": "Amazing quality.",
      "text": "I could not help but go with this screen after I read the reviews on it. I just had to make one choice which screen type to get. My theater is in my basement with a set of glass doors on the side letting some ambient light in. I paired it with a new ht1075. I chose the grey screen to help with my black levels and ambient light. I didn't go with the ambient light rejecting screen because of its smaller viewin angle. This screen is amazing. It took about an hour to put together but went together flawlessly. Best budget screen out there.",
      "rating": 5.0,
      "verified": true,
      "author": "Fridayone8",
      "helpful_votes": 8,
      "publication_date": 20151003
    },
    {
      "title": "Great screen",
      "text": "Was i skeptical, yes. Was i proven wrong, yes. This screen is the bee's knees. It's amazing. Built it in about 15-20 mins. Used the measurements that were in packaging and boom it went up, easy. Don't pay someone to do it for you, just get a hand if you need it. The color is great. Use it in a room with outside light coming in..still good. At night it's even better. Please look up best practices for screen size and viewing distance. I found this size was exactly what I needed for my 4k projector, sitting 13 feet away.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Knight",
      "helpful_votes": 0,
      "publication_date": 20200311
    },
    {
      "title": "Easily the best bang for the buck",
      "text": "Replaced a cheap motorized screen. Build quality is very good. Easy to assemble for anyone with mediocre mechanical skills. Lay out all the pieces on the floor before starting. Took about 30 minutes to build, 10 minutes to hang. Need 2 people to hang it. Using an UST 4K laser projector (Vava) and am very satisfied!",
      "rating": 5.0,
      "verified": true,
      "author": "DaveCarrera4",
      "helpful_votes": 0,
      "publication_date": 20200421
    },
    {
      "title": "Great!",
      "text": "I started reading the reviews but then I simply followed the very good printed instructions and had zero problems with the install. Some said the center bar is tricky to install but it worked for me, simply aligned one side and then pushed/pulled the other side in place... Overall great quality, the only complaint I have is the price. Bought 120\" an should be no more than $199, I paid $50 more.... Well, and it smells badly after plastic even after a couple days... Also I've noticed that the surface is almost identical to our white roller shades for the windows, it seems to me made from thin vinyl or PVC so not specifically some hi-tech super reflective material....",
      "rating": 4.0,
      "verified": true,
      "author": "tall2010",
      "helpful_votes": 0,
      "publication_date": 20190109
    },
    {
      "title": "You can stop searching now. This screen is EVERYTHING.",
      "text": "AMAZING screen. Looks super professional. High quality material. Velvet frame. Can't believe this huge beauty was so inexpensive. Really easy to put together - can be built and hung in an hour. Best of all, the four hooks you hang it on can be adjusted across the length of the entire screen so you can easily attach into the wall studs - wherever they may be. Seriously, I have never been happier with a product. Don't waste money on a corporate screen, or try to cheap out on a flexible one that will never be what you want. This is the perfect solution.",
      "rating": 5.0,
      "verified": true,
      "author": "Ed U. Kaytor",
      "helpful_votes": 0,
      "publication_date": 20180917
    },
    {
      "title": "Well engineered screen!",
      "text": "This is a well thought out and well engineered screen! First of all, it is well packaged, substantial in weight, and pretty easy to assemble. The look is impressive, and our screen came unmarred and uncreased. Some previous posters commented about seeing through the acoustic material, but it looks like the company has addressed that by covering the rear supports with felt and additionally providing a rear light block (can be seen how I hooked it all in my pics). So far, I think I made the right decision here.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Downing",
      "helpful_votes": 0,
      "publication_date": 20181209
    },
    {
      "title": "great price, great picture and easy assembly",
      "text": "I liked how easy this screen was to put together. Our picture from the projector looks great and smooth. We were watching movies on a white textured wall before, so this looks amazingly better. I was a little worried when ordering this because the reviews were a little too good to be true. If fact, it got a very low rating for possibly false reviews. I am happy i took the chance because it works great for us and there isn't anything mechanical to go wrong, so I don't expect any problems. My 135\" screen was worth the money, which was considerably less than other comparable screen sizes.",
      "rating": 5.0,
      "verified": true,
      "author": "Alyson",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Beautiful QUALITY, EASY assembly and AFFORDABLE! very happy with this screen!",
      "text": "Grest quality Very affordable Easy set up Shipped secure! So very happy with thisive never assembled anytut hing like This before and im not tech savy. But i put this 120\" screen together by myself in less than two hours! Because its lightweight i was able to get it hung up on the wall by myself. It was a bit tricky due to size but lightweight enough. This took me about 45 minuted. If id had help holding other end ( rather than propping on a box) i could have hung it in 10 minutes tops! Quality and affordable!",
      "rating": 5.0,
      "verified": true,
      "author": "J",
      "helpful_votes": 0,
      "publication_date": 20191210
    },
    {
      "title": "Yes, This Screen is Really Very Good",
      "text": "I was loathe to spend $1500 or more on the screens usually suggested by projector websites because I wasn't sure if I'd find projection acceptable compared to my OLED TV and I didn't want to make a quite large investment unless I had to. That's why I tried this screen - based on price and all the great reviews. I've watched 40-50 movies on the Silver Ticket, everything from silent films, to low-res DVD's, to Blu-Rays, and a number of 4K UHDs, through an Optoma Cinemax P1, and the screen really performs beyond my expectations. I see no reason to buy a more expensive screen. Your movies, too, will look great on the Silver Ticket.",
      "rating": 5.0,
      "verified": true,
      "author": "Darrell B",
      "helpful_votes": 0,
      "publication_date": 20200721
    },
    {
      "title": "Great Screen",
      "text": "Easy to assemble. The moving/floating hangers makes mounting a LOT easier. Screen has a lot less texture than many others making a little more accurate reflection of the image directly back to the viewer. Using an Epson 5040ub I am getting a terrific image experience. Not sure how this would compare to a $2k stewart screen. I have never seen a stewart screen, but it would have to be a HUGE difference to justify 10x the cost. The silver ticket is a tremendous purchase and quality that I would buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "David D.",
      "helpful_votes": 0,
      "publication_date": 20191223
    },
    {
      "title": "Good Value.",
      "text": "For Context: I bought this product in July and have used it daily/weekly for the last 90 days. Overall, the screen quality is \"good\" for the money. I paired this screen with an LG CineBeam projector. --My experience is informed by watching movies and using the Nintendo Switch. --I tried both the STR WHITE, and SILVER screen. --I felt that the SILVER material was worth it for the impact it has on colors (they look stunning) --NOTE: That enhanced color comes at the cost of some brightness, but the tradeoff is worth it in my theater. Thanks!",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200921
    },
    {
      "title": "Fun & easy assembly, impossible to hang",
      "text": "AMAZING IMPROVEMENT over projecting onto white wall!!! Fun & easy assembly! Took about 45 mins. Simple, clear instructions. INSANELY CHALLENGING TO HANG. Took four people over THREE HOURS to successfully hang it on the wall. Requires *exactly* lining up four corners of screen with four screws in the wall... Would be essentially impossible for one person to hang. Absolutely need a second person to hang; expect very very long arduous process of making minute adjustments to the four corners hoping the magically all \"click into place\" at the same time.",
      "rating": 5.0,
      "verified": true,
      "author": "Dan Keller",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "Great product!  Easy setup!",
      "text": "Great product! I dont have anything else to compare it to though. Went together rather easy and was easy to hang. It is used in light controlled room with dark grey ceiling, dark gray screen wall and dark floors. Quick update, been using for about 3 weeks or so now, picture and quality still look great. I have noticed a rattling or buzzing coming from the screen at certain frequency. I never hooked bottom of screen to wall so that may be causing some of the problem, need to investigate. Hopefully I can resolve the problem.",
      "rating": 4.0,
      "verified": true,
      "author": "Danny",
      "helpful_votes": 0,
      "publication_date": 20191022
    },
    {
      "title": "Questionable acoustic 4k experience",
      "text": "4k is iffy on this screen. The screen itself looks great,installed very easy, and I'm happy with it. But....with my 4k optoma uhd60 projector I now noticed the woven pattern on scenes that are white. It's not just a little noticeable it's actually distracting. I previously had a Carl's sheer wave acoustic screen before this acoustic screen and didn't look as good as this one. Not 100% sure acoustic screens are the right way to go for 4k. I can't totally remodel my theater for a complete different setup though. So this one will stay and I will deal with the woven pattern. Other than that it's a great screen",
      "rating": 4.0,
      "verified": true,
      "author": "Breds09",
      "helpful_votes": 2,
      "publication_date": 20170713
    },
    {
      "title": "Better than I thought",
      "text": "I was a little unsure on the quality of the aluminum frame as the price is so much lower than Screen Innovations. It would seem my concern was misplaced. this screen is absolutely well built/solid. I purchased the 106\" white and should have gotten the next size larger... CON: does not easily slide horizontally. instructions say you can slide screen after mounted; however, brackets will not move in easily. I had my wife hold one side while I finagled the top bracket to the left 4\"in then repeat for the other side. No big deal, but I hope they redesign in the future to allow simple horizontal movement.",
      "rating": 5.0,
      "verified": true,
      "author": "E. Coli",
      "helpful_votes": 0,
      "publication_date": 20190324
    },
    {
      "title": "I love this screen!",
      "text": "Wonderful product. I'm not a handyman, so I was nervous about this. I didn't want my screen experience to end badly and I wasn't sure how difficult assembly would be. Well, it's EASY! The instructions are pretty easy to follow and the actual work involved to assemble is straight forward and simple. The picture looks great, very satisfied with the result. If I ever decide to build another theater room, a Silver Ticket screen will be top of my list :)",
      "rating": 5.0,
      "verified": true,
      "author": "Ken N",
      "helpful_votes": 0,
      "publication_date": 20200325
    },
    {
      "title": "Better quality than what you pay for.",
      "text": "Putting this together was fun. Got a pretty good workout in. It looks great! Went from a 120\" screen to this 135\" screen. It's HUGE! Very well made screen and easy to put together and to hang. Way better quality than I was expecting. There is a little smell from the screen, but I'm sure it will fade over time. Don't hesitate; get this one! Update: The screen has been up for a couple weeks now, and the smell is gone. Loving this screen.",
      "rating": 5.0,
      "verified": true,
      "author": "Bo Bandy",
      "helpful_votes": 0,
      "publication_date": 20190308
    },
    {
      "title": "Really great screen for the money.",
      "text": "This competes with much more expensive screens as far as the quality of the image and the way it looks on your wall. If you need additional features as far as it retracting you won't get that but this is a great economical option for a home theater. I read countless reviews and many people compared this to screens they owned that were easily $1,000 more. And after seeing this screen and action compared to other people's home theaters we have been in I can say it definitely holds up!",
      "rating": 5.0,
      "verified": true,
      "author": "Joe B",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "The screen is THE BEST.",
      "text": "Ok so it's awesome I'm so happy with my choice. The black velvet on the sides makes for a perfect picture. The screen (amazon didnt store properly and damaged it. BAD AMAZON) but I contacted the company and they were so helpful asking what projector I have and tips and offered to send me another replacement screen! The screen was super easy to set up, and you need room to do this it's quite big. I purchased the 106in screen and its huge! and and my husband and I had it up in like 20min, Unboxing and setting up, Had it on the wall in less than 5 min. BEST CUSTOMER SERVICE FROM THIS COMPANY",
      "rating": 5.0,
      "verified": true,
      "author": "Tiffany Nguyen",
      "helpful_votes": 0,
      "publication_date": 20190227
    },
    {
      "title": "Don't think Twice Just get it.  Very good quality screen and frame material.",
      "text": "Guys, Please don't blow your money on any other Name branded screens, Please do your research on AVS forum and Just get it this screen from Silver Ticket. This screen is made out of very good material. 7.2.6 System Projector: Epson 5040ub Receiver: AVR-X8500H with Triad Speaker In-Wall Silver/4 (3, LCR ) In-Ceiling Silver/6 Sat (4, overhead) In-Wall Bronze/4 Surround ((6, side & rear surrounds) In-Room Sub: PSA S1510 (Dual) Screen: STR-235115-WAB Aspect ratio of 2.35 AT Seating: Seatcraft Serenity 3 Rows of 3 Seats. Lighting: Philips HUE Remote: Logitech Harmony Elite Voice Control: Google Home Mini",
      "rating": 5.0,
      "verified": true,
      "author": "A. Himani",
      "helpful_votes": 2,
      "publication_date": 20190520
    },
    {
      "title": "Well made",
      "text": "After reading some of the reviews, I was a little intimidated about setting up this screen. My son and I put it together in about 20 minutes without issue. It is easy to mount- we just found some studs that were inside the screen dimensions and then slide the retaining brackets over to line up with the screws. I would purchase this screen again.",
      "rating": 5.0,
      "verified": true,
      "author": "Catcherinthewheat",
      "helpful_votes": 0,
      "publication_date": 20191025
    },
    {
      "title": "Sharp edges and shoddy instructions.",
      "text": "Great screen. Wrinkle free when tensioned. I got the gray because I have light constantly coming in. The frame is nice and rigid. Be careful of sharp edges with the frame. They didn't de-burr the corners where they were cut. The instructions weren't well written. There are two different screw types and the instructions didn't differentiate the two types, I had to figure that out myself. Other than that, the screen looks great.",
      "rating": 5.0,
      "verified": true,
      "author": "PbLead",
      "helpful_votes": 0,
      "publication_date": 20190704
    },
    {
      "title": "Great screen, clear a large area - you'll need it",
      "text": "You're going to need a large, clean patch of floor to put this screen together. I do not recommend trying to assemble it in a tight space. The instructions that are included are easy to follow and the frame is a cinch to put together. I was not strong enough to completely install the screen, but my much stronger husband had no problems. We painted the theater room wall black, so the velvet just kind of disappears, which is exactly what we wanted. The picture quality is great (of course that's highly dependent on the projector....). Overall, it's working out as a very good option for our home theater.",
      "rating": 5.0,
      "verified": true,
      "author": "Sara B.",
      "helpful_votes": 0,
      "publication_date": 20190208
    },
    {
      "title": "Awesome product.",
      "text": "When I first purchased a projector I went with an Elite Screen 120 inch screen, due to quality issues I returned it and went with this screen for my second attempt. This screen blew me away not only is the quality higher and it was 15 inches larger but it was 100 dollars cheaper. After my first screen not working out I went over this screen to try and find quality issues but damn I didn't find any, I just wish I could have gotten the 150 inch model.",
      "rating": 5.0,
      "verified": true,
      "author": "chad walker",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "Amazing screen for your dollar!",
      "text": "This screen is excellent for the money! The setup was fairly easy which I did by myself. The only part I needed help with was actually lifting it up to mount it which I'm only using 2 or the four screw mount into drywall. So it's fairly lightweight. I've had this for over a year now and I'm still super happy with the purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "leon",
      "helpful_votes": 2,
      "publication_date": 20190128
    },
    {
      "title": "Top notch quality",
      "text": "Takes a little effort to assemble, but well-worth it. Not a wrinkle in sight, my projection looks beautiful now, and the black bars do wonders for framing your content and hiding any slight curves on the edges. I've had a couple guests upon first sight say \"holy cow, that's the biggest TV I've ever seen!\" This screen makes your projection look THAT good!",
      "rating": 5.0,
      "verified": true,
      "author": "Cool Hwip",
      "helpful_votes": 0,
      "publication_date": 20190821
    },
    {
      "title": "Buy this! Do not build your own!",
      "text": "Do not even try to do it yourself, you'll regret it. This is so much better. The finish is great, its made out of metal, the black finish is great. I do wish this company will continue innovating with thier products. I'd love to see thinner frames in the future. I emphasize again! If you are doing a 2.35 screen, do not attempt to build one yourself, the streching proccess will drive you mad. The way SilverTicket has solved that issue, is worth appreciating! Really love the quality of the material as well. It is quiet flexible and color accuracy is better than anything else I've used.",
      "rating": 5.0,
      "verified": true,
      "author": "Aman Patel",
      "helpful_votes": 0,
      "publication_date": 20190822
    },
    {
      "title": "Wrong Piece, Come On Man!!!",
      "text": "So as I was putting my screen together, I got to the part where you have to insert the rods and I noticed one rod was shorter than the rest. I was upset because I knew someone screwed up and gave me a rod that belonged to a different sized screen. I inserted all the rods and I was short a few inches, leaving just one hole unclipped. Thankfully I have kids who happen to have paint brushes and I was able to use one as a rod replacement for my 4inches I was short. Quality control, \"Come on man!!!\"",
      "rating": 5.0,
      "verified": true,
      "author": "Ramon",
      "helpful_votes": 0,
      "publication_date": 20200510
    },
    {
      "title": "Movies at my house, dudes!",
      "text": "I like this and am happy with it. Fairly easy to assemble. Make sure to YouTube someone doing it and it's a breeze. Hanging takes two people. I learned it's best to have the hooks closer to the edges than the middle in case your a few millimeters off of being level in your studs Picture quality is way better than just pointing at the wall but I'm not sure how it stacks up to others. I like it and I guess that's what matters. The only real negative is that the felt seems are noticable if you're looking for it. Not a huge deal though",
      "rating": 4.0,
      "verified": true,
      "author": "B. West",
      "helpful_votes": 0,
      "publication_date": 20190404
    },
    {
      "title": "Looks great, very sturdy and easy to assemble",
      "text": "Totally worth extra expense versus DIY that I was contemplating. For a large screen, by the time you mess a round with home depot frame, fabric , mounting hardware and then risk a sagging frame it's worth getting this. Design is very sturdy, easy to put together with few screws and perfect tension of the screen. It looks wonderful with the perimeter felt fabric that serves as overscan masking. The 135\" picture on my new BenQ HT2550 4k'sh projector looks fantastic. Took about an hour or so to assemble and hang. All you need is a Philip screwdriver",
      "rating": 5.0,
      "verified": true,
      "author": "C. M. Dube",
      "helpful_votes": 0,
      "publication_date": 20180301
    },
    {
      "title": "Not a huge difference between wall and the screen",
      "text": "Not a huge difference between wall and this screen. Assembly was easy. The only advantage using this screen is that the black velvet border absorbs the extra light on the sides and hence kind of adds a frame to the picture. Other than that not worth of the price if you have lighter paint on the wall. Of course you will need it if you have a dark paint on the wall.",
      "rating": 3.0,
      "verified": true,
      "author": "KCGuy",
      "helpful_votes": 0,
      "publication_date": 20200924
    },
    {
      "title": "Worth it!",
      "text": "I got the 100\" screen - I poured over reviews on which screen to get. I saw a lot about Elite screens but didn't see a lot that differentiated them enough from Silver Ticket that would justify the extra $$$. I got it hung up last night - a few notes on directions and assembly. The printed directions are lacking, so make sure to watch the product videos on the seller's website, those are very helpful. Assembly was relatively easy given what you're assembling - took me about 45 min. I'm VERY satisfied with the quality of the materials, solid metal, good looking black velvet and good screws.",
      "rating": 5.0,
      "verified": true,
      "author": "HeavyMetalChuck",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Grey 120\". Beyond excellent screen.",
      "text": "Geek squad installed my grey 120\" silver ticket. After they assembled it, they said it was a very nice screen and assembled easy. They mounted it with no problem since the mounting brackets slide side to side. I'm using an EPSON 4010 project and the picture looks insanely awesome. Crystal clear and the picture pops. Very very very please. 1000% buy this screen and you will never look back. Hands down a smoking deal. Screen is tight and the felt is very nice.",
      "rating": 5.0,
      "verified": true,
      "author": "Kizer so say",
      "helpful_votes": 0,
      "publication_date": 20181027
    },
    {
      "title": "Screen and details",
      "text": "Don't know much about screens. So after installing the screen is made out off a tough yet flexible plastic, like the one used on inflated water rafts in gray color. The one i received, after following the instructions to the t, there was a couple of scratch-like lines on the upper left corner. These lines might not do much difference, however, there are there. Stars given to this related to the overall perception is 5. But as being plastic, not knowing if best ones are made out of a cloth materials, 4. If not then 5. As for the scratch goes, well if theres a discount on it ill be ok with the screen and a discount. LMK ThanK you",
      "rating": 5.0,
      "verified": true,
      "author": "Elisa P.",
      "helpful_votes": 0,
      "publication_date": 20191112
    },
    {
      "title": "Excellent Screen for a Good Price",
      "text": "We moved into a new house and I wanted the media room set up well and inexpensively. After lots of research I went with this screen and the Optoma HD142X projector. I watched 2 YouTube videos on how to put this together before starting. Glad I did as they were informative and made the assembly quite easy. I did ask for help from a friend to hang it. It is actually on only 2 Hercules Hooks at the top with 2 Command Strips at the bottom to keep the bottom secure. It is an excellent screen and lightweight. I like the black material border as it help center the image and keep picture clear.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah Pratt",
      "helpful_votes": 0,
      "publication_date": 20190629
    },
    {
      "title": "Well worth the investment!",
      "text": "I am normally the \"Project it on the wall\" kinda guy but I have always wondered about these screens. My new home has a wall that was pretty uneven and it made for an awful picture so I snagged one of these bad boys. I gotta say that it's pretty simple to set up. I wouldn't say the quality of the frame's felt was 10 outta 10 but it was decent enough. The pieces in general were of decent quality and when we got it set up, wow does it look awesome. It has me wanting to look into a new projector now. I'll try to post a picture later but I absolutely would recommend this.",
      "rating": 5.0,
      "verified": true,
      "author": "Traintech86",
      "helpful_votes": 0,
      "publication_date": 20181121
    },
    {
      "title": "Good quality and easy to assemble.",
      "text": "I originally purchased a screen that was $35 less from another seller and it was trash. I returned it and I ordered this one. I’m so glad I did. The directions are straight forward and easy to follow. I’m a 50 year old woman and I was able to assemble this by myself. I only needed help with the center support and mounting it. I highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Kim Hoover",
      "helpful_votes": 0,
      "publication_date": 20200725
    },
    {
      "title": "Very sturdy, quality screen",
      "text": "This screen is expensive, but a quality item and it provides a very nice picture for a projector. Assembly is simple, but not necessarily easy. I had a tough time making sure the frame was perfectly square before tightening all of the hardware. It is also kind of a pain in the ass to hang. That said, the frame is extruded aluminum and will be rock solid forever. the screen material was very easy to install. Overall, I like it very much and would recommend it to others.",
      "rating": 5.0,
      "verified": true,
      "author": "Brother Steele",
      "helpful_votes": 0,
      "publication_date": 20190723
    },
    {
      "title": "Quality Product",
      "text": "I ordered a sub $100.00 screen from another manufacturer and was thoroughly disappointed with the quality. After returning the sub-$100.00 screen, I was able to purchase the Silver Ticket Projector screen for less than $200.00. Everything about this screen reflect quality craftsmanship. The product was professionally packaged, with a components list, and very detailed assembly instructions. The components were well made and fit together like a glove. It took me less than 30 minutes to assemble and mount this awesome projector screen screen onto my wall (this is working alone). Its been three weeks now, and I could not be happier with my purchase. I highly recommend the Silver Ticket Projector Screen, you will not be disappointed!",
      "rating": 5.0,
      "verified": true,
      "author": "dragon master",
      "helpful_votes": 0,
      "publication_date": 20190203
    },
    {
      "title": "Quality Screen highly recommend",
      "text": "Product came packaged well to prevent any damage in shipping. Assembly was easy and straight forward. I would like to see a better way to attach the black cloth to the back of the frame. I tried using black duct tape the first time and it didn’t hold. Ended up pinning it to the wall behind the screen when I installed the speakers behind it. Picture quality is great. I have to say for the money this is a very nice screen. I am a electronics dealer and have access to high end screens and this screen holds it own to the big names. Would definitely recommend this product and would buy another one with out a doubt.",
      "rating": 5.0,
      "verified": true,
      "author": "Brandon Iseminger",
      "helpful_votes": 0,
      "publication_date": 20200218
    },
    {
      "title": "Perfect For The Money!",
      "text": "Awesome screen! I went with a cheaper screen since my setup is small. Simple install which btw this was designed to apply retention to the screen was brilliant. I'm used too springs I have to struggle and pull back. With the plastic bits I just pull back the screen and it fits snug. Surprisingly tight for the lack of force needed to stretch it. I'm using the ht3550 BenQ. The colors are amazing with this screen. Best buy for the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Zachary",
      "helpful_votes": 0,
      "publication_date": 20190810
    },
    {
      "title": "Perfect",
      "text": "Amazing! This screen was a breeze to assemble (not sure why other reviewers had issues with the cross support bar, I just pushed it in the opposite direction and it fit in really easily). Assembly took approx 45 minutes, just on my own. I was also able to wall mount the 120\" screen by myself. This is a great screen for the price, I'm not sure why anyone would pay 4x as much for a similar fixed screen. No wrinkles, creases or anything, just a nice crisp, flat screen. Really gives the WOW factor for your home theater setup.",
      "rating": 5.0,
      "verified": true,
      "author": "Sir Douglas",
      "helpful_votes": 0,
      "publication_date": 20171013
    },
    {
      "title": "Gorgeous screen works perfect with the LG PF1000U Ultra short throw projector.",
      "text": "I thought I would have an issue with the border since I'm using an LG PF1000U, Ultra short throw projector. The angle means that the border sticking out makes the picture jump and lose a little. I was actually wrong. This works great and you literally don't lose any of the picture, it just doesn't start until about 3/4 of an inch, but that's barely noticeable, otherwise, the picture is perfect. It's a gorgeous screen, super sturdy and the frame has room with the mounting to put LEDS in back of it, which I did. Love this, but now I'm used to the size so it's time to go even BIGGER!",
      "rating": 5.0,
      "verified": true,
      "author": "johnd3101",
      "helpful_votes": 0,
      "publication_date": 20180603
    },
    {
      "title": "Best projector screen ever!!!",
      "text": "I went from a cheap $30 screen to this, and let me just say WOW! The difference from a PVC to an actual screen is huge, this thing is 100 times better if not even more. The velvet boarder looks amazing, the screen pops to life, assembly was a breeze, I love it. I debated between Silver Ticket and the other ones out there for a while, but definitely go with Silver Ticket. The build quality is just remarkable (I've assembled and disassembled mine multiple times with moving) and have yet to have a problem.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170625
    },
    {
      "title": "Easy Installation and great quality (so far)",
      "text": "I've only had it for about a week, but so far, this thing is great. The installation was very easy. My wife and I had the whole thing put together in about 15 minutes. The center support bar that some people have complained about was the most difficult part and even that was very easy for us. When attaching the screen material to the \"hooks\" make sure you start in the middle of each side and alternate between sides back and forth until you end at the corners. Picture quality is amazing. The black frame erases any bleed-over. I considered the projector paint, but I've so glad I went this route instead. Overall, I would highly recommend this screen!",
      "rating": 5.0,
      "verified": true,
      "author": "J",
      "helpful_votes": 0,
      "publication_date": 20190130
    },
    {
      "title": "Dont tighten the corners and lengths down 1st and then try and slide the.iddle bar in. Slide the bar in and then tighten.",
      "text": "Whoever says this thing isn't hard put together is completely full of crap. It took me about 2 hours to put it together and get it hung on the wall. I also ordered a hundred and 20 inch screen and didn't realize I received a hundred and ten inch screen until I had it mounted to my wall. Also don't put the metal bar in the middle if you've tightened all the corners down it's ridiculously hard. Put the metal bar in the middle first and then tighten all the corners and seems down.",
      "rating": 4.0,
      "verified": true,
      "author": "J's Purchases",
      "helpful_votes": 0,
      "publication_date": 20180227
    },
    {
      "title": "Great screen at affordable price",
      "text": "The screen size is perfect and the picture looks great. There are no wrinkles. Wider side borders are helpful to cover over throw image. Initially I had thought it might be small for my setup which is 11 x 8 wall. But after setting this up it was just right. Setup is relatively easy but still need extra hands and some time. I got installers to come and help and it took some time for two people to put it together and mount on the wall.",
      "rating": 5.0,
      "verified": true,
      "author": "skuj",
      "helpful_votes": 0,
      "publication_date": 20190622
    },
    {
      "title": "Excellent screen backed by first rate company",
      "text": "This is wrt 135\" screen - good quality, sturdy and lightweight; comes together solidly, not too challenging to assemble or install, can be done by one person. Looks good on the wall with matte black (like velour) frame. Image quality is excellent. Also, the people at Silver Ticket Products are first rate, there was a minor issue with my delivery, they jumped right on it and immediately made things right, really excellent customer service.",
      "rating": 5.0,
      "verified": true,
      "author": "jim.t",
      "helpful_votes": 0,
      "publication_date": 20180418
    },
    {
      "title": "A Well Designed Solution",
      "text": "Quality materials and design. I appreciated the simple assembly and clever construction. I was surprised the screen was vinyl. I purchased a similar screen a few years ago made from a heavier fabric. The advantage of vinyl is its ability to smoothly stretch without a crease. Fabric is much harder to make taut, but feels more durable. Once this screen is hung in its permanent location durability won't be an issue.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff Franck",
      "helpful_votes": 0,
      "publication_date": 20191017
    },
    {
      "title": "Great screen for your home theater...",
      "text": "Assembly was easy and I was able to mount it myself (although a partner would have been helpful). The material has no wrinkles, and the thick velvet bar around the outside adds a classy touch that also serves to conceal the spill over light from my projector. I’m using a BenQ projector and it looks awesome on this screen. Overall, this is a really great product and I would definitely recommend it if you’re starting a home theater.",
      "rating": 5.0,
      "verified": true,
      "author": "JRousey",
      "helpful_votes": 0,
      "publication_date": 20200909
    },
    {
      "title": "Excellent screen for the price",
      "text": "We had a slight issue with a wrinkle in the lower lefthand corner but a simple email to the manufacturer resulted in a completely brand new roll of material being shipped out for free. Overall, I'm happy with it. It works well with console games, PC VR, and 4K movies paired with a JVC projector in our multiuse room.",
      "rating": 5.0,
      "verified": true,
      "author": "PCMR",
      "helpful_votes": 0,
      "publication_date": 20200620
    },
    {
      "title": "Fantastic Screen",
      "text": "The screen came quickly and very well packaged. Nothing was damaged and all the parts were included. Assembly was straightforward and relatively easy to accomplish. The screws went into the threaded holes perfectly. The most difficult aspect was threading support rods through the edges of the screen materiel. Even that was easily accomplished just a bit \"figgity\". Hanging the finished screen onto the wall was easy but of course did require an assistant. The picture quality is unreal, especially compared to the pull down screen I was using prior to purchasing this screen. This screen is a must have if you have a projection TV.",
      "rating": 5.0,
      "verified": true,
      "author": "P. J. Tempest",
      "helpful_votes": 0,
      "publication_date": 20190402
    },
    {
      "title": "Easy to assemble great looking screen!",
      "text": "Arrived VERY well packaged (seriously, I am impressed how well everything was put in the box!!). Screen was easy to put together and looks great on the wall. We were just using the painted wall before and this screen looks 10x better. Color and clarity look great. All the parts were well made and fit together well. Well worth the money!",
      "rating": 5.0,
      "verified": true,
      "author": "Alan",
      "helpful_votes": 0,
      "publication_date": 20200620
    },
    {
      "title": "Silver Ticket Screen are awesome😁",
      "text": "Screen has great picture quality, was very easy to put together, had and still has NO wrinkles, even great with the lights on or off see pictures, I sit 12ft away from and it just perfect, was easy to hang, but it does take two people, purchased the 120 in screen, had a Stewart 106 in screen, wanted bigger, but not at that going rate. To me it looks even better, see pictures",
      "rating": 5.0,
      "verified": true,
      "author": "antonio purcell",
      "helpful_votes": 0,
      "publication_date": 20201003
    },
    {
      "title": "Easy to assemble, Excellent Picture, Wrinkle Free.  Screwdriver and common sense.",
      "text": "Bad A&% Screen. Bought it for Fight Nights on our Barn Wall. EXCELLENT picture at over150 inches! Like being ringside. Seriously easy to assemble and zero wrinkles. TIP: place a large sheet or blanket (clean of course) on the surface you plan on assembling it on. The White is really really White!",
      "rating": 5.0,
      "verified": true,
      "author": "Mongo",
      "helpful_votes": 0,
      "publication_date": 20200821
    },
    {
      "title": "Good screen for the price",
      "text": "Tip - when inserting the center bar, release tension on the screen by removing four middle pins on top and bottom. I was very close to damaging the screen when trying to hammer it into place before removing the tension. The white screen is a good surface for projection. The black flocked wrapping on the frame bars is very good - does a complete job of blanking out the overshot screen. The tensioned screen setup is very good as well--very flat surface for projection.",
      "rating": 3.0,
      "verified": true,
      "author": "A",
      "helpful_votes": 2,
      "publication_date": 20170514
    },
    {
      "title": "very sharp for media room",
      "text": "Fairly simple to assemble even if instuctions were not very descriptive but once assembled it looks very sharp. I put it next to old screen and not dramatic difference but it did look better. Top is DYI screen botton is silver ticket",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 13,
      "publication_date": 20160305
    },
    {
      "title": "Great quality",
      "text": "Very easy to assemble. Build quality is great. Where this screen really performs for me is during bright light applications. Compared to my old screen when there is a light or other intense brightness on screen during a movie or game it really comes out at you. A fter resetting contrast the darks really differentiate themselves on this screen. Seriously adivse on purchasing this screen if you are on the fence about it.",
      "rating": 5.0,
      "verified": true,
      "author": "Justin",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "Beautiful screen",
      "text": "I bought this screen as part of a home theater upgrade from 1080p to 4K. I put the screen up first, and am impressed by how much better my 1080p projector looks on this screen than it did on the one it replaced. The surface is very uniform, and the projected image looks fantastic.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff M. Flanagan",
      "helpful_votes": 0,
      "publication_date": 20190605
    },
    {
      "title": "Movie Quality Projector Screen",
      "text": "The screen quality is amazing. The assembly process was very simple. Take the time to assemble and stretch the screen correctly and you'll have a very nice screen for your projector. I would recommend this product to anyone! The only downfall to this is not the product, but to myself as I wish I would have got a larger screen",
      "rating": 5.0,
      "verified": true,
      "author": "Chad R.",
      "helpful_votes": 0,
      "publication_date": 20200519
    },
    {
      "title": "Absolute steal for the price",
      "text": "My home theater uses a JVC 950 projector set up with a 7.1.4 speaker system. I replaced a Stewart 1.1 gain 90 inch widescreen with the Silver Ticket 120 inch STR – 169120. I expected a considerable drop off in quality given the tremendous price difference between Stewart screens and Silver Ticket. To my surprise, The Silver Ticket hangs in there very well. Absolute steal for the price with very easy construction/installation",
      "rating": 5.0,
      "verified": true,
      "author": "Kamal",
      "helpful_votes": 2,
      "publication_date": 20170814
    },
    {
      "title": "Amazing 150\" Fixed Gray Screen for the money",
      "text": "I purchased the 150 inch gray screen for my garage, this thing was HUGE, I just didn't want to get the 135inch and later regret not going bigger. Soo happy I went with the bigger screen. I paired this with a BenQ HT2050A. The result was an amazing 1080P image on this screen, no regrets with skipping on a 4k projector for now. I'll be adding some led lights behind the screen frame next and will update the pictures. I did put the screen on hinges so I can flip it up and keep it on the roof so my kids don't use it as a chalk board 😂.",
      "rating": 5.0,
      "verified": true,
      "author": "Leandro Guerra",
      "helpful_votes": 0,
      "publication_date": 20190304
    },
    {
      "title": "Great screen for my theatre",
      "text": "Well made product with good directions for install. Very happy with the purchase so far. They gave extra parts just in case. All stainless and aluminum materials. Everything lines up well. Recommend this product 100% for the price. One suggestion. I added led back lighting and you can see it bleed through the front of the screen in between it and the frame. Would be nice to have something to put in there that blocks it out completely. I taped it.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike Viirre",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "Amazing for the cost. Don’t buy one for $500+, buy this one",
      "text": "At first I was concerned with the large felt bezel but after a couple hours I actually don’t notice it. It does a great job absorbing light. I got the gray screen which is due to the light from behind the projector during the day. It looks great and not to bad to assemble. I like how I can take it apart if necessary as well. For the price you can’t beat it. It is in line with my elite screen I use to have in another home and cost 1/3 the price!",
      "rating": 4.0,
      "verified": true,
      "author": "xcel290",
      "helpful_votes": 0,
      "publication_date": 20200911
    },
    {
      "title": "Love it. Easy to set up, great result.",
      "text": "Easy set up, Nice white screen. It says to have plenty of room to set it up. The directions are very clear. Easy to follow. i didn't have a flat space anywhere in the house that was as big as this screen. So, I put the frame together as instructed, then sat it up in the hallway and attached the screen. No issues. once you get the feel, it goes together quickly. I think start to finish, including hanging it on the wall was about an hour and 15 minutes. Yes, I'd buy this again (probably will when I expand living arrangements). Great screen for the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Dr. Darwin Perkins",
      "helpful_votes": 0,
      "publication_date": 20171223
    },
    {
      "title": "beautiful HD quality picture.",
      "text": "Best buy was adamant that I needed a high grade screen or \"why bother\" putting in a projector. The price substantially higher so I tried this screen first and I am not disappointed. This screen is beautiful and I am proud to show it. The picture quality is definitely HD. I am using a Sony VPL HWES45 projector. Picture quality is excellent even with low to moderate ambient light. I went with the white screen 110\" after looking on the sliver ticket website.",
      "rating": 5.0,
      "verified": true,
      "author": "JWM",
      "helpful_votes": 2,
      "publication_date": 20170301
    },
    {
      "title": "110” P.Screen",
      "text": "Pretty DARN good, purchased 110” was going to purchase the 120” but chose not to figured that would be just too much for a front living area. However it took me 1 hour max to put together, and I have one broken hand (so hopefully that speak volumes). This silver ticket screen is absolutely HUGE Gigantic .... seriously !!! A++++ quality easy accessibility, Swift delivery only took 2-days literally,This screen beats buying a television for $1999-$5000 for a 70”. Lol .. Worth the buy just make sure you match it with the perfect projector !! And you’ll be alright Thanks love it",
      "rating": 5.0,
      "verified": true,
      "author": "Pen Name",
      "helpful_votes": 0,
      "publication_date": 20190303
    },
    {
      "title": "Finally! The perfect screen! Just buy it.",
      "text": "I bought the 92” 16:9 Grey screen. I went with grey because I wanted a little more contrast. This thing is great. I tried a few different screens, but should have just bought this one first. I have it paired with a BenQ MH530FHD. Great setup for around 800 total. This screen is very high quality and went together in about 20 minutes. One person job.",
      "rating": 5.0,
      "verified": true,
      "author": "TKsOpinion",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "I purchased this screen and love it! Took a while to assemble",
      "text": "At our last house, we just painted the wall and framed our own screen, which worked perfectly for us. Unfortunately, the walls in our new house are not very flat, which distorted the picture. So, I purchased this screen and love it! Took a while to assemble, but that's to be expected. Nothing hard about the assembly, it just takes some time. The screen is only part of the puzzle, but the picture on this screen is great! Right now it's just being used with a 1080p projector, but plan to get a 4K projector in the future as prices come down. Highly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "ST",
      "helpful_votes": 0,
      "publication_date": 20171223
    },
    {
      "title": "Is smells like petroleum for a week or so while the vinyl degasses.",
      "text": "This is my first projector screen set up. I paired this with a Sony 285 ES 4K. I paid the difference for the grey screen and it looks amazing. Assembly was a snap. It is lightweight and made of well machined aluminum. The felt cover border allows tolerance.",
      "rating": 5.0,
      "verified": true,
      "author": "Rick McCracken",
      "helpful_votes": 0,
      "publication_date": 20190829
    },
    {
      "title": "Very well designed product.",
      "text": "This projector screen seemed like it was going to be a hassle to install, but once I went over the instructions, I probably had to look at them twice from how easy it was to install, the quality of the materials are very high and when you put it all together you will see what a great product and very thought through it is. The sides of the screen are felt, so that was a very added bonus to me. The only thing I had a problem with was the mounting on the wall, might want to check your measurements 4 times.",
      "rating": 5.0,
      "verified": true,
      "author": "Larryboy",
      "helpful_votes": 0,
      "publication_date": 20180709
    },
    {
      "title": "I originally planned on getting a motorized screen but a friend convinced me this would be better. I am really glad I went this",
      "text": "I am really impressed with the quality of this screen. I originally planned on getting a motorized screen but a friend convinced me this would be better. I am really glad I went this route. It looks great and was even easy to hang. Putting it together was way easier then I even imagined. They sent extra clips so make sure you put the extras in the groves just in case one breaks, otherwise you have to start from scratch. I learned the hard way. Excellent product! I highly recommend this screen.",
      "rating": 5.0,
      "verified": true,
      "author": "Mariah Bristol ",
      "helpful_votes": 4,
      "publication_date": 20170128
    },
    {
      "title": "Using with an ultra short throw...",
      "text": "Better than I thought it would be. I am using it with an ultra short throw optoma 5500+. The only negative is a a very small shadow at the bottom due to the closeness of the projector. That however is not the screens fault because it is not really made for this type of projector. BUT... seeing that the cost difference can be about $800?! I have no concern with the very small little tiny ... shadow. The image is beautiful. See? Don't mind the mess.",
      "rating": 5.0,
      "verified": true,
      "author": "DM",
      "helpful_votes": 0,
      "publication_date": 20171206
    },
    {
      "title": "Easy to assemble and looks great!",
      "text": "The screen is easy to assemble and took me about 40 minutes because I was doing it very carefully. The screen material is stretchy and if you follow the directions on how to stretch it out, it won't be a problem. The center bracing rod is tough to get into place until you undo a couple of the screen mount points near the center to allow the frame to move a little to get the brace into place. The screen looks great on the wall and delivers a uniform picture compared to my white painted wall that I was using. Overall, excellent product for the price!",
      "rating": 5.0,
      "verified": true,
      "author": "Impostor71",
      "helpful_votes": 0,
      "publication_date": 20180820
    },
    {
      "title": "Movie theater experience at bargain prices!!",
      "text": "Every quote I got from local companies for a similar screen was over $1500. This was one third the cost!! The picture quality is incredible and sound comes through beautifully. A must have for anyone looking to set up a home theater without spending a fortune! I paired this 135\" screen with the Micca M series speakers, Optoma HD27 for much less than what most new 75\" 4K HDTVs cost. It looks and sounds better than a friends HT setup that cost 4x as much!",
      "rating": 5.0,
      "verified": true,
      "author": "The Grim Meeper",
      "helpful_votes": 0,
      "publication_date": 20181105
    },
    {
      "title": "Great Screen",
      "text": "I wasn't sure whether or not to have this as a firm fixture on the wall or whether I should have gotten a motorized dropdown. After having this for a couple months, man am I happy that i got the wall screen fixture. It doesn't really make the picture better (I was previously projecting on a white wall) but it absolutely makes it FEEL so much better. The picture wasn't much better (biggest thing I noticed was the screen helped the blacks pop) but it was definitely a much better experience. I included a before and after video Buy these and put it on the back of it",
      "rating": 5.0,
      "verified": true,
      "author": "Usman Shahid",
      "helpful_votes": 0,
      "publication_date": 20160423
    },
    {
      "title": "Awesome, well thought out kit - worth the price",
      "text": "I purchased the 150\" kit and am incredibly happy. The kit is very well thought-out and installation is easy. It took my wife and I about 45 minutes to assemble. The tensioning rods are especially well designed and make the process very fool proof. At another home I previously had built a 120\" screen from scratch - if you are debating between fabricating yourself and getting a kit, let me tell you that the kit is totally worth the price for the time savings alone. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Customer",
      "helpful_votes": 2,
      "publication_date": 20181208
    },
    {
      "title": "Awesome",
      "text": "Love this screen. Bought the grey color and it does help with some ambient light. Better than thescreen I had before by far. Easy to put together by yourself and easy to hang. Well thought-out product that could use a little better instructions but if your handy and know English, you can figure it out. Great product and seems like it will be around for awhile. Zero complaints and would recommend this far",
      "rating": 5.0,
      "verified": true,
      "author": "Sean",
      "helpful_votes": 0,
      "publication_date": 20190730
    }
  ],
  "product_meta": {
    "title": "STR-169150 Silver Ticket 4K Ultra HD Ready Cinema Format (6 Piece Fixed Frame) Projector Screen (16:9, 150\", White Material)",
    "description": "The STR-169150 Silver Ticket fixed frame projection screen features a native 16:9 format and a whopping 150\" diagonal viewing surface. FULL HD, 4K, 8k & 1080p HDR and Active 3D Ready. This entry-level screen truly assembles much faster than any other brand available! Forget about tucking the screen material into the frame - the Silver Ticket Tension Rod System saves you time and frustration. How does the material connect to the frame? Each side of the material has a pocket. A rod slides through the pocket to attach to the frame. This saves you time in the assembly process, but also removes any puckers or wrinkles to provide a flat viewing surface. The rod holds the material perfectly square all around the whole frame. This pocket and rod system remains hidden behind the frame so you only see the movie. This screen features real projection screen material, not a sheet. The material is stretchy multi-layered vinyl made specifically for watching projected movies. Wait until you see the colors! There is no resolution lost at any angle. Mildew resistant, flame resistant, and washable with mild soap and water. Forget about tricky installations - this fixed frame screen mounts on the wall much like a large picture frame. The sturdy aluminum frame is WRAPPED not flocked with a light absorbing black velvet fabric to absorb over-projected light so you don't have to be a professional when aligning your projector. Other brands use square tubing in their frames, but this frame is wide extruded aluminum and contours down to the projected image so you won't have any ugly shadow on the image area. The frame connects to the wall in 4 mounting points to hold it strong and square. Even after mounting on the wall the screen can be horizontally adjusted to ensure perfect positioning! The Silver Ticket Fixed Frame is available in many different sizes and aspect ratios.",
    "rating": 4.8,
    "feature_bullets": [
      "Wall Mounted Fixed Frame Projection Screen (Overall Size 78.25\" Tall x 135.5\" Wide) (Viewing Area 150\" Diagonal x 73.5\" Tall x 130.75\" Wide) No option for Legs or Stands with this product. Recommended for projectors with Native 16:9 Resolution",
      "1.1 Gain White screen surface with an exceptionally wide viewing angle at 160 degrees with no resolution loss at any viewing angle. Works great with Long, Short and Ultra Short Throw projectors.",
      "2 3/8\" heavy duty beveled aluminum frame wrapped in light-absorbing black velvet material for a beautifully crisp viewing image; Enjoy beautiful movies, pictures, and games in FULL HD, 4K / 8K and Active 3D",
      "Quick and easy assembly with tensioning rod system ensures that you can bring cinema-quality entertainment to your home in just a few minutes. Secure top and bottom mounting brackets that allow horizontal adjustment",
      "Before purchasing, project an image on wall to determine the size works for the projector and watch the step by step instructional video listed."
    ],
    "specifications": {
      "Product Dimensions": "135.5 x 1.25 x 78.25 inches",
      "Item Weight": "39.4 pounds",
      "ASIN": "B00I4WRVVC",
      "Item model number": "STR-169150",
      "Customer Reviews": "4.8 out of 5 stars95 ratings4.8 out of 5 stars",
      "Best Sellers Rank": "#200 in Video Projection Screens",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "January 30, 2014",
      "Manufacturer": "Silver Ticket Products"
    },
    "categories": [
      "Television & Video",
      "Electronics",
      "Projection Screens"
    ],
    "price": 449.98
  }
}