{
  "website_summaries": [
    {
      "verdict": "With 5 pairs in a pack, these glasses are comfortable to wear and provide an incredibly good deal for the money.",
      "pros": [
        "For a great price, these glasses come with a microfiber cloth for easy cleaning, and their spring hinges make them comfortable to wear"
      ],
      "cons": [
        "Earpieces may break away from the frames"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Well Made, Great Quality Frames and Crystal Clear",
      "text": "I needed new to increase the strength on my readers from 1.0 to 1.5 and found these. After reading the reviews I ordered this product. The shipping was timely and well packaged and I'm really happy with the product so far. These are stylish, well made (they simply feel more expensive than they are) and they are very clear. I've had other readers that just aren't that clear for some reason and these are crystal clear. I'm very happy with my purchase. I was also happy to learn that this is a family business and I love supporting small family run businesses.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff W",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "Great value",
      "text": "Nice six-pack that allows them to be available in my normal reading areas. The quality is fine and the price was great compared to what my eye doctor 's office attempted to sell me. At 73 years I do require reading glasses yet my distance vision is great so paying over $600 bucks for one pair of readers seemed ridiculous. These are working fine and should I lose a pair or break them it is not a concern. I would order these again. They work just fine for the very limited time I require wearing glasses.",
      "rating": 5.0,
      "verified": true,
      "author": "riky1",
      "helpful_votes": 0,
      "publication_date": 20200410
    },
    {
      "title": "Readers for under $3.50 each???",
      "text": "Second time ordering. These readers are quite sturdy, but as I tend to \"lose/sit on/abuse/step on/drop in the river/drive over/chew on/leave in a restaurant/loan out\" my reading glasses, theses are perfect - both in price and durability. Only had one pair actually break (the frame at the bottom of one lens cracked after quite a bit of use), and I probably contributed mightily to their demise. This time there was a small glitch in the order - the storage bags were missing - but one e-mail and everything was made right IMMEDIATELY. I had the bags in two days. Greg from Newport even called me to make sure I was completely satisfied. Great customer service!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Snowbound",
      "helpful_votes": 4,
      "publication_date": 20150601
    },
    {
      "title": "Great readers with service",
      "text": "I'm impressed with these readers. They are more strudy than any I have bought. Forget Walmart these are the way to go. I love the comfort and I'm sure the screws won't fall out after a few times wearing them. Plus I got a very nice business card with a nice message and their phone number. To me, that is good service. That was nice try them, you'll like them. What a deal!",
      "rating": 5.0,
      "verified": true,
      "author": "Cathy Black",
      "helpful_votes": 0,
      "publication_date": 20200311
    },
    {
      "title": "These seemed like a good deal on Amazon",
      "text": "These seemed like a good deal on Amazon, but I didn't realize until I got them what an amazing deal they were. I had been buying the \"Foster Grant\" readers from Walgreens for about $25 bucks a pair. Those lasted me about 3 or 4 months, and then the hinges broke or they got scratched so easily that they were not usable. But these came in perfect condition, the lenses were CLEAN! And the price was way beyond reasonable. 5 pair for $17, including a pair of shaded readers which I will definitely use. We will see how they hold up, but at this price, I'm a very happy customer!",
      "rating": 5.0,
      "verified": true,
      "author": "Jeffrey Jenkins",
      "helpful_votes": 2,
      "publication_date": 20151201
    },
    {
      "title": "Thin and break easily.",
      "text": "These are very cheap glasses. They break way too easily. The right arm joint always seemed to break. Very thin. Granted, I have a big head and that's a bit hard on cheap glasses, but at the same time, I've never had a nice pair of glasses break on my like these. If you are a little princess and take care of your glasses like butterfly wings, then these may work for you. If you plan on ever putting them in your pants pocket like you might a regular prescription pair of normal glasses, figure they'll last you about a week tops. Two stars because the lens quality is okay and the price is good",
      "rating": 2.0,
      "verified": true,
      "author": "Harry Carbuncle",
      "helpful_votes": 0,
      "publication_date": 20140813
    },
    {
      "title": "Good value",
      "text": "Like most other reviewers, I constantly loose readers, so don't want to spend a bunch of money on them. I'd been buying them in 3 packs from WalMart, but wanted something with a different look. These are perfect! I've been wearing them now for over a month and am pleased with my purchase. The only thing I wish was different was the color mix. I only got one \"tortoise shell\" pair, and I prefer those over the black. I wish you could get a more even mix, or just order what color you want. Small thing, but something to consider.",
      "rating": 5.0,
      "verified": true,
      "author": "JARTX",
      "helpful_votes": 2,
      "publication_date": 20140608
    },
    {
      "title": "Comfortable and affordable",
      "text": "We had bought packages of reading glasses from other sellers on Amazon. They broke pretty easy and we found we were having to repurchase a couple times a year. This time we switched to these, I have to say I am very happy I did. They are more comfortable to wear for 8 hours at work staring at a computer and files. We haven't had them for a long time yet, so I cannot speak to if they will hold up better than the last brand... stay tuned!",
      "rating": 5.0,
      "verified": true,
      "author": "Alyson",
      "helpful_votes": 0,
      "publication_date": 20181106
    },
    {
      "title": "Clear, Durable, & Inexpensive",
      "text": "The joke around our house is how many pairs of reading glasses are in circulation. You are liable to find a pair anywhere when you don't need them, and nowhere when you do. Leaning more towards the bulk buying opportunities to buy these required devices my wife and i have come across these and one other set that is very clear and durable. I can't imagine paying $20 or $30 for a pair i am capable of losing forever in minutes, but i also desire to not have cheap optics. These fit the bill on both counts. One warning because these are not prime and ship through a reseller, don't wait until its a dire need to order them.",
      "rating": 4.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20140527
    },
    {
      "title": "I Can Seeee!!",
      "text": "Needed several extra pairs of readers so I could have a set for office, car, etc. While several other vendors provide multipacks, this was the only one that had the \"mid strength\" packs--packs between the std 1.00, 1.50, 2.00 etc. Glass is not \"optical quality\" but they are not $100 per pair either. They seem to be well made and, with some care, I get several months out of each pair before the become scratched (or I lose them!). They were what I needed and I will buy more when I need them.",
      "rating": 4.0,
      "verified": true,
      "author": "J. Bristow",
      "helpful_votes": 0,
      "publication_date": 20140926
    },
    {
      "title": "Perfect reading glasses",
      "text": "Love these glasses. I have a hard time finding glasses that don’t always slide down my nose or that my eyelashes don’t hit. These are perfect and the fact that I can have them in every color is great.",
      "rating": 5.0,
      "verified": true,
      "author": "Shellsamazon",
      "helpful_votes": 0,
      "publication_date": 20190409
    },
    {
      "title": "Great readers, great price",
      "text": "I'm very pleased with these reading glasses. They are much higher quality than other reading glasses I've tried that cost almost as much for one pair as all six of these. They feel substantial, are very comfortable across the bridge of the nose, and the spring hinges make them a perfect fit. I like that each pair comes with a microfiber bag to protect them from scratches that also doubles as a cleaning cloth. I highly recommend them and plan to order another set for my husband.",
      "rating": 5.0,
      "verified": true,
      "author": "JPF",
      "helpful_votes": 0,
      "publication_date": 20150608
    },
    {
      "title": "Decent quality in a hard-to-find strength",
      "text": "I typically buy cheap reading glasses at local drug or department stores because I tend to break them and lose them. The problem I have is that the highest strength most stores carry is 2.5 diopter. I need a 3.0 to 3.5 lens and so have been struggling to see with the 2.5's for the past few years. I received these very quickly, was surprised at the quality for the price, and was delighted that I could see again. Regardless of the strength that you need, you probably won't find a better deal than these.",
      "rating": 5.0,
      "verified": true,
      "author": "Charles A. Miess",
      "helpful_votes": 0,
      "publication_date": 20140412
    },
    {
      "title": "5 STAR  ALL THE WAY",
      "text": "THESE READERS ARE GREAT. AFTER RECEIVING CATERACT REMOVAL SURGERY AND LENS IMPLANTS, MY SIGHT IS 20 -15, THESE READERS ARE JUST THAT LITTLE EDGE FOR THE FINE - FINE PRINT! PACKAGING, AND SHIPPING WERE THE HIGHEST OF STANDARDS. THANKS TO ALL CONERNED",
      "rating": 5.0,
      "verified": true,
      "author": "JEPix",
      "helpful_votes": 0,
      "publication_date": 20171013
    },
    {
      "title": "Don't last",
      "text": "Got my glasses. First issue was all but one were black. A bit annoying but I could live with it. My main gripe is they don't hold up. Each pair breaks where the screw meets the hinge, i.e. the design or materials of the hinge area are not made to last. Since I bought them less then a year ago have already had 3 break on me.",
      "rating": 1.0,
      "verified": true,
      "author": "David in Austin",
      "helpful_votes": 2,
      "publication_date": 20150701
    },
    {
      "title": "Glasses for every room!",
      "text": "I must have \"50 ways\" to lose my reading glasses. Or break them. I like to leave multiple pairs around the house and one for the car and another for work. This six pack is just what I wanted. These are decent quality dime store readers. Light weight with plastic lenses. Lenses are clear from edge to edge - which is better than some other plastic readers I've had. And better than the heavy glass ones that are prone to falling off my head.",
      "rating": 5.0,
      "verified": true,
      "author": "John Scott",
      "helpful_votes": 0,
      "publication_date": 20140726
    },
    {
      "title": "A great buy !",
      "text": "These are fine reading glasses. Better than you can buy at the box stores or chain pharmacies. Sturdy frames, good fit, with hinges that don't easily break and screws don't loosen and fall out after a few days. As a graphic artist I take my glasses on and off many times a day looking at proofs. These glasses get a workout. They are very durable.",
      "rating": 5.0,
      "verified": true,
      "author": "c.w. scott",
      "helpful_votes": 0,
      "publication_date": 20180224
    },
    {
      "title": "Good glasses",
      "text": "They are good glasses, price very much reasonable, especially for people like me who looses them often.",
      "rating": 5.0,
      "verified": true,
      "author": "Radmila Jevicki",
      "helpful_votes": 0,
      "publication_date": 20190329
    },
    {
      "title": "Good enough for me",
      "text": "From the car to the commode, got these scattered all over hell. I consider them a good value for as inexpensive as I THINK they are. Other reviewers seem to think they should be glass lensed and seat belt proof; how about safety lenses and sturdy enough you can drive back and forth over them; prescription maybe? I mean, for two bucks, you should get some real quality, huh! I'm happy with these quality for the price. Or, perhaps I just have grossly exurbanite tastes in reading glasses.",
      "rating": 5.0,
      "verified": true,
      "author": "AJG",
      "helpful_votes": 0,
      "publication_date": 20170802
    },
    {
      "title": "Great quality",
      "text": "Lenses are very clear and frames seem sturdy. The power that I ordered was the power I received. Very Satisfied and would buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "jim",
      "helpful_votes": 0,
      "publication_date": 20190115
    },
    {
      "title": "Very satisfied",
      "text": "They arrived in a timely fashion and as described. Don't forget to indicate which power magnification you want. E.G. 1.5x, 2x, etc... No metal hinges or joints that get pulled out or bent in similar type reading glasses that I got from COSTCO that eventually all broke down in one way or another. I think these will hold up better. For the price and the quality, I can't complain. It's nice to have spares in practically every room where needed and replacements near by.",
      "rating": 5.0,
      "verified": true,
      "author": "James Wong",
      "helpful_votes": 0,
      "publication_date": 20140407
    },
    {
      "title": "Nice looking, great glasses",
      "text": "Great glasses for the price! Fit great and stay put. I usually have problems with glasses being a bit big and slippings off, these fit nicely.",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle",
      "helpful_votes": 0,
      "publication_date": 20170814
    },
    {
      "title": "Love these glasses",
      "text": "What can I say, I had a small issue with my order and the vendor's customer service was so good they get my future orders for reading glasses. Thanks for being such a good trustworthy company.",
      "rating": 5.0,
      "verified": true,
      "author": "Josh Matteson",
      "helpful_votes": 0,
      "publication_date": 20200503
    },
    {
      "title": "You won't want to lose these glasses (but even if you do, a great value to replace them!)",
      "text": "I've bought this ten pack for my husband twice in the past 6 months (he loses his glasses on a weekly basis - is that normal?) and have been completely satisfied both times. They are stylish, very good quality and the Rx is exactly as he needed. He gets a lot of compliments when he wears them. Very good value.",
      "rating": 5.0,
      "verified": true,
      "author": "Wendy Allerton",
      "helpful_votes": 0,
      "publication_date": 20180329
    },
    {
      "title": "Good deal ... decent quality",
      "text": "It's great to have reader glasses everywhere that I need them so that I don't have to carry around my good pair all the time. The optics aren't \"perfect\" like professionally made glasses, but for the few minutes that I need to use them at my two jobs, they help me a lot. It would have been nice to get more of an assortment of frames ... 5 black, one 'leopard' I guess you'd call it ... but that's minor.",
      "rating": 4.0,
      "verified": true,
      "author": "Randall R. Finnerty",
      "helpful_votes": 0,
      "publication_date": 20150109
    },
    {
      "title": "Really like them so far.....",
      "text": "The only reason I have not given these a 5 star rating is because I'm waiting to see if they hold up to my husband's treatment. So far I really like the glasses and so does my husband. My husband is pretty rough on glasses and usually picks up a pair at our local pharmacy. I don't really care too much for the way any of those look.Theses look really nice. They are not the typical small readers. They are a nice big lens(but not too big). And they are a great masculine look.",
      "rating": 4.0,
      "verified": true,
      "author": "Perry a",
      "helpful_votes": 0,
      "publication_date": 20140519
    },
    {
      "title": "They arrived in perfect condition. This is something that me and my ...",
      "text": "They arrived in perfect condition. This is something that me and my husband both use and they are just what we need. I do have a thin bridge to my nose so while they aren't the most comfortable reader for me they fit my husband perfectly. I ordered them before and did a reorder. In fact I'm wearing a pair now and get crisp vision. I would definitely purchase again!",
      "rating": 5.0,
      "verified": true,
      "author": "kluless",
      "helpful_votes": 0,
      "publication_date": 20140725
    },
    {
      "title": "these look decent but break easily. I am not that hard on glasses but ...",
      "text": "these look decent but break easily. I am not that hard on glasses but these have a weak spot in the design where the plastic meets the hinge. If you treat these as a consumable, you can expect a pair to last about a week.",
      "rating": 1.0,
      "verified": true,
      "author": "Slappy Blanco",
      "helpful_votes": 4,
      "publication_date": 20140712
    },
    {
      "title": "AMAZING! I bought these to sprinkle around the house ...",
      "text": "AMAZING! I bought these to sprinkle around the house for when I couldn't find my \"real\" glasses. Well I like these so much better than the ones I paid hundreds for! Lightweight, really comfortable and so cute! The pictures don't do them justice. They have a really nice matte finish. I'll buy them again when I need a different strength.",
      "rating": 5.0,
      "verified": true,
      "author": "LJ",
      "helpful_votes": 0,
      "publication_date": 20150129
    },
    {
      "title": "The greatest colors and quality",
      "text": "I am forever leaving my reading glasses all over the place and I was excited to order this collection of colors. All the colors are so funned vibrant and I had never thought of having reading glass sunglasses before...but what a cool thing. Now I can't live without them. The lenses are a wonderful quality and very very clear",
      "rating": 5.0,
      "verified": true,
      "author": "Marcie J.",
      "helpful_votes": 0,
      "publication_date": 20150207
    },
    {
      "title": "Cute and functional",
      "text": "Very stylish, love the spring hinges because I have a bad habit of putting them on my head when I'm not wearing them. All around great glasses at a reasonable price.",
      "rating": 5.0,
      "verified": true,
      "author": "Niki",
      "helpful_votes": 0,
      "publication_date": 20190323
    },
    {
      "title": "Great bargain, great look",
      "text": "This 6-pack is great. These are stylish basic readers. I only needed 1.0 as I use them over my contacts when I have to use my computer or read a menu. Since this is a 6-pack, I can keep them scattered and always have a pair close by. Very good quality for the price and as a 200 lbs male, there should no problem with it fitting most adults.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Alden",
      "helpful_votes": 0,
      "publication_date": 20140729
    },
    {
      "title": "Cute, but no cigar",
      "text": "Glasses were good looking. But 5/6 pairs fell apart. Strangely, all of the right temples fell off. That would lead me to believe it's a design flaw. Cute though.",
      "rating": 1.0,
      "verified": true,
      "author": "Annie ",
      "helpful_votes": 9,
      "publication_date": 20140424
    },
    {
      "title": "it's wonderful to get 6 pair at a time at a ...",
      "text": "The way I go through reading glasses by losing them, scratching the lenses, and just generally mistreating them, it's wonderful to get 6 pair at a time at a terrific price. These do the job very well and I can keep a pair handy wherever I need them. They are light-weight, comfortable and ideal for my needs.",
      "rating": 5.0,
      "verified": true,
      "author": "SoundMind",
      "helpful_votes": 0,
      "publication_date": 20141011
    },
    {
      "title": "Price and quality",
      "text": "I love them. Great price, quality and the glasses are beautiful! Now I leave one pair of glasses in each room of my house and don't have to be running around looking for them!",
      "rating": 5.0,
      "verified": true,
      "author": "Maria Ramos",
      "helpful_votes": 0,
      "publication_date": 20171218
    },
    {
      "title": "Good glasses for a great price",
      "text": "I go through a lot of reading glasses - lose them, break them, forget them ... so I don't want to spend a lot of money on expensive reading glasses. I gave these a try and I am very happy with them. They feel and sit well, I like their style, and they are actually much more sturdy than I expected. Great value!",
      "rating": 5.0,
      "verified": true,
      "author": "Tobe",
      "helpful_votes": 0,
      "publication_date": 20140701
    },
    {
      "title": "I may reorder again as they could easily raise the price",
      "text": "I reordered a week after receiving my glasses. That says it all. I may reorder again as they could easily raise the price. Solid,attractive, relatively sturdy. Great glasses!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Honest333999",
      "helpful_votes": 0,
      "publication_date": 20171017
    },
    {
      "title": "Practical and just as described",
      "text": "I bought these to have in various places around the home and shop, work OK, plastic lenses are fairly soft so you have to be careful not scratch. Delivery was perfect. packaging is minimal but for the price it should be perfect for my application. Value for the dollar for me is acceptable.",
      "rating": 5.0,
      "verified": true,
      "author": "Stuck in old Lodi again",
      "helpful_votes": 0,
      "publication_date": 20140611
    },
    {
      "title": "Poor quality",
      "text": "Purchased as Christmas gift from wish list. Out of 6, 5 have been used. 2 of the most lightly used ones have both had earpieces just fall off with no previous damage.",
      "rating": 1.0,
      "verified": true,
      "author": "withak",
      "helpful_votes": 0,
      "publication_date": 20190513
    },
    {
      "title": "But these are good quality and he loves the spring hinges",
      "text": "My husband goes through these, drop's them, breaks them etc. But these are good quality and he loves the spring hinges. I think they will last longer than others he has purchased. Real bonus was the sunglass ones, which he really liked.....!!",
      "rating": 4.0,
      "verified": true,
      "author": "Mustang Sally",
      "helpful_votes": 0,
      "publication_date": 20160401
    },
    {
      "title": "Great support and glasses",
      "text": "Great set of glasses. For the price, these are good quality and use them everyday. I emailed the seller before purchase as I wanted all black and a gentleman responded quickly and said he would would need my order number and would see what he could do. Not sure if he did anything but I received 5 black and 1 brown tortoise. Very happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Rod L. Clift",
      "helpful_votes": 0,
      "publication_date": 20140904
    },
    {
      "title": "Great company and service!",
      "text": "The glasses appear to be well made with that spring action in the sides so the glasses keep their fit. The lenses are crystal clear. I called the company and the gentleman I spoke with was wonderful! I love great customer service!",
      "rating": 5.0,
      "verified": true,
      "author": "Lois Bruno",
      "helpful_votes": 0,
      "publication_date": 20180310
    },
    {
      "title": "Great Glasses",
      "text": "I like the flexibility in the arms. Like having glasses in every room of the house.",
      "rating": 5.0,
      "verified": true,
      "author": "Glo",
      "helpful_votes": 0,
      "publication_date": 20181115
    },
    {
      "title": "Good to spread around house.",
      "text": "These reading glasses are good quality. I order one pack and was happy with them so I ordered another pack. Excellent to spread around house or anywhere you may need. I like to be keep reading glasses with arms reach where ever I may be and these are really good for this.",
      "rating": 4.0,
      "verified": true,
      "author": "Greg",
      "helpful_votes": 0,
      "publication_date": 20140328
    },
    {
      "title": "Wayfarer 1.5 power reading glasses",
      "text": "So far so good with these reading glasses. I bought other similar 6-packs of glasses that included a reading sunglasses, but the screws that hold the ear piece to the main frame keep coming loose. I haven't had these long enough to comment on that but so far so good.",
      "rating": 4.0,
      "verified": true,
      "author": "RC",
      "helpful_votes": 0,
      "publication_date": 20140403
    },
    {
      "title": "American Hero Flyers",
      "text": "Great story of American heroes who chose to go on this dangerous mission early in WWII. It also provides a capsule of historical biography and events of the times. I found the book easy to read and enjoyable.",
      "rating": 4.0,
      "verified": true,
      "author": "Donald Forman",
      "helpful_votes": 0,
      "publication_date": 20140722
    },
    {
      "title": "you get what you pay for with these, 4 ...",
      "text": "you get what you pay for with these, 4 pr. broke soon after purchase always in the same spot at the bottom of the right lens frame. it wasn't just me either one pair I gave to a friend!",
      "rating": 1.0,
      "verified": true,
      "author": "linda williams",
      "helpful_votes": 4,
      "publication_date": 20140803
    },
    {
      "title": "These glasses work great, and they are not expensive",
      "text": "I must break at least two pairs of reading glasses a month. I have decided to buy reading glasses in bulk, and keep some extra pairs around. These glasses work great, and they are not expensive. I would highly recommend them.",
      "rating": 5.0,
      "verified": true,
      "author": "TominMD",
      "helpful_votes": 0,
      "publication_date": 20141121
    },
    {
      "title": "Compare well to my more expensive reading glasses, good optics",
      "text": "Well-made and very good optics... very clear! Price is right - I can leave these all over the house so I don't have to drag them around with me. Compare nicely to much more expensive glasses I have bought.",
      "rating": 5.0,
      "verified": true,
      "author": "Goldengate",
      "helpful_votes": 0,
      "publication_date": 20151224
    },
    {
      "title": "Cheap glasses broke easily",
      "text": "All 6 pairs broke almost immediately. Will not buy again.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191006
    },
    {
      "title": "Wayfarers are great reading glasses",
      "text": "You will not find a better value for reading glasses anywhere. These look good on me and its nice to have an extra pair in every room. I would recommend these to anyone who needs reading glasses. They are an excellent value.",
      "rating": 5.0,
      "verified": true,
      "author": "Eva Choate",
      "helpful_votes": 0,
      "publication_date": 20140423
    },
    {
      "title": "Great deal and arrived super fast",
      "text": "These readers have a very high quality lens for a non prescription pair of glasses. Great deal and arrived super fast.",
      "rating": 5.0,
      "verified": true,
      "author": "Sharon Amatetti",
      "helpful_votes": 0,
      "publication_date": 20180805
    },
    {
      "title": "Price was great. I thought i was going to love them ...",
      "text": "Price was great. I thought i was going to love them because the frames seemed heavy duty.. i have owned them for a couple of weeks and every spring on the glasses are broken.. real bad quality.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180220
    },
    {
      "title": "Good value. Well worth it to buy two bundles",
      "text": "Good value. Well worth it to buy two bundles, that way you can have them readily available-If your like me and forget where you leave them.",
      "rating": 4.0,
      "verified": true,
      "author": "drake",
      "helpful_votes": 0,
      "publication_date": 20150426
    },
    {
      "title": "Nice For the price",
      "text": "I like them..good enough quality for the low cost. They fit the bill. Also they are attractive looking. Have a pair now for everywhere in the house. Really can't go wrong if you want to spend big bucks on something go ahead but these will do. Ship to me also very fast. Thank you very much",
      "rating": 5.0,
      "verified": true,
      "author": "Dogman Duke",
      "helpful_votes": 0,
      "publication_date": 20140402
    },
    {
      "title": "Can't beat the price",
      "text": "For the price, you can't beat it. They are not top of the line quality but it is perfect for what I need them for. Cheap reading glasses that I keep all over the house and not too concern with losing.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon User 819",
      "helpful_votes": 0,
      "publication_date": 20140429
    },
    {
      "title": "Great Vendor, Great Value, Great Readers!!! :-)",
      "text": "I rarely rate products or vendors, but Newport Blvd seems like a great family doing great business on Amazon, and there products are superb. If you are like me and just need readers, these are awesome. At this price/quality I have a pair in my truck, each room of my house, my garage, my boat, everywhere. They are so inexpensive, if I misplace them, I don't worry about finding them. I just ordered my second set of six...and I'll order more when I lose these. And I will. :-)",
      "rating": 5.0,
      "verified": true,
      "author": "RP HB",
      "helpful_votes": 0,
      "publication_date": 20140520
    },
    {
      "title": "Frames do not irritate my face like metal!",
      "text": "They are rigid and withstand the abuse I give them on household projects. Metal frames were a source of skin irritation and always seemed to bend out of shape with light abuse. These do not.",
      "rating": 5.0,
      "verified": true,
      "author": "csmith",
      "helpful_votes": 0,
      "publication_date": 20141113
    },
    {
      "title": "Readers",
      "text": "Reading glasses are well made and lenses are clear. I would purchase again and would prefer if I could order all black instead of an uneven mix of colors. Shipping was fast and packaging was perfect. I will order again.",
      "rating": 4.0,
      "verified": true,
      "author": "Navy Rick",
      "helpful_votes": 0,
      "publication_date": 20140512
    },
    {
      "title": "Gettin old is a hassle",
      "text": "My wife is having more trouble than I as far as clearly seeing detail work-sewing, beading, removing splinters from me. These arrived on time, were as advertised and solved the problem for her. Thanks",
      "rating": 5.0,
      "verified": true,
      "author": "bbubba",
      "helpful_votes": 0,
      "publication_date": 20140530
    },
    {
      "title": "the Best Reading Glasses Ever!!!",
      "text": "These are the best reading glasses I have ever purchased. They are sturdy. They are stylish. I could not be happier I made this discovery. These are the only reading glasses I will buy moving forward. The value is amazing.",
      "rating": 5.0,
      "verified": true,
      "author": "susanb",
      "helpful_votes": 0,
      "publication_date": 20170203
    },
    {
      "title": "I am completely happy with this purchase and will be back for more",
      "text": "I am completely happy with this purchase and will be back for more, great product good fit and great price Thanks, Bill",
      "rating": 5.0,
      "verified": true,
      "author": "WILLIAM T. FIX",
      "helpful_votes": 0,
      "publication_date": 20150923
    },
    {
      "title": "I am more that pleased with the 5 reading glasses",
      "text": "I am more that pleased with the 5 reading glasses. They are all over the house, ar and in my purse. They are good quality, fit well, look good and I was glad to see a pair of sunglasses, too. thank you for answering a problem of transporting my glasses all over.",
      "rating": 5.0,
      "verified": true,
      "author": "Diane J. Sweet",
      "helpful_votes": 0,
      "publication_date": 20170213
    },
    {
      "title": "You get what you pay for.",
      "text": "The arms fell off 3 out of 5 pairs of these glasses within a month of purchase. The only 2 that still had both arms were the 2 I didn't wear during that time. Yes they're cheap, but one pair of well made glasses is better than 5 pairs of rubbish.",
      "rating": 1.0,
      "verified": true,
      "author": "Michael K.",
      "helpful_votes": 0,
      "publication_date": 20160210
    },
    {
      "title": "Great glasses, great price",
      "text": "Great glasses, great price. If only I can keep my wife from \"picking them up to use for a second\", I'd be all set, but with 6 pairs, it is not really an issue!",
      "rating": 5.0,
      "verified": true,
      "author": "F. Rizzo",
      "helpful_votes": 0,
      "publication_date": 20140816
    },
    {
      "title": "I like the larger style",
      "text": "this is a second purchase of these. At this price, you get a decent product. I like the larger style, as those tiny oval readers drive me crazy. I have broken all but two from the first order, so I reordered. I would recommend these but take it easy on them, they do break easily.",
      "rating": 4.0,
      "verified": true,
      "author": "msbass4579",
      "helpful_votes": 0,
      "publication_date": 20141126
    },
    {
      "title": "Glasses are very good for the price",
      "text": "Glasses are very good for the price! Would be 5 stars but got 3 clear and 2 tinted, instead of 4 and one. Would order again though when needed!",
      "rating": 4.0,
      "verified": true,
      "author": "Jnowie",
      "helpful_votes": 0,
      "publication_date": 20160105
    },
    {
      "title": "Average",
      "text": "Lens quality good. Frames are flimsy. Handle with care. One of 6 broke so far just by picking it up by the side of the eyeglass frame. Do not recommend putting in one's pants pocket without eyeglass case.",
      "rating": 3.0,
      "verified": true,
      "author": "KHWOOD",
      "helpful_votes": 0,
      "publication_date": 20140328
    },
    {
      "title": "... SEEMS TO BE CORRECT THE ONLY THING I DON'T LIKE ABOUT THEM IS THE FIXED NOSE PIECE (NOT ADJUSTABLE)",
      "text": "THE GLASSES ARE CLEAR AND THE STRENGTH SEEMS TO BE CORRECT THE ONLY THING I DON'T LIKE ABOUT THEM IS THE FIXED NOSE PIECE (NOT ADJUSTABLE). OTHER THAN THAT THEY DO WHAT THERE SUPPOSED TO.",
      "rating": 4.0,
      "verified": true,
      "author": "daveM",
      "helpful_votes": 0,
      "publication_date": 20140807
    },
    {
      "title": "Five Stars",
      "text": "Great glasses great price fast shipping, great followup service I will be buying more soon UPDATE Glasses fell apart quickly didn't have them for more than 3 weeks..REAL JUNK",
      "rating": 5.0,
      "verified": true,
      "author": "Shopper",
      "helpful_votes": 0,
      "publication_date": 20140721
    },
    {
      "title": "good price, good value",
      "text": "I was very happy with my purchase and probably will buy more. This is a fine service, given how often I break or lose my glasses. I'm very satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "Larry A. Verdugo",
      "helpful_votes": 0,
      "publication_date": 20140419
    },
    {
      "title": "Great deal",
      "text": "Great deal and very good delivery time. In fact it's my third order and I like the variety. It sure beats the $250 pair of glasses I lose the first week I have them",
      "rating": 5.0,
      "verified": true,
      "author": "Gregory C. Mcnulty",
      "helpful_votes": 0,
      "publication_date": 20141229
    },
    {
      "title": "A good pair of glasses for the money",
      "text": "A good pair of glasses for the money. You don't have to panic when your two year old rips them in half cause you got 5 more pairs.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Eubanks",
      "helpful_votes": 0,
      "publication_date": 20140826
    },
    {
      "title": "Great set of reading glasses",
      "text": "Great set of reading glasses! They're attractive, yet allow me to SEE. :) Love the handy sets so that I can place them in various spots around the house!",
      "rating": 5.0,
      "verified": true,
      "author": "L. Woods",
      "helpful_votes": 0,
      "publication_date": 20140903
    },
    {
      "title": "Good Quality",
      "text": "As advertised. Now I have a pair for everywhere I need them and at a very fair price. Thank you you're the best!",
      "rating": 5.0,
      "verified": true,
      "author": "V. Beckner",
      "helpful_votes": 0,
      "publication_date": 20150211
    },
    {
      "title": "no problem at all",
      "text": "Received my product on time. the glasses were perfect----just what I wanted. the whole transaction was smooth. Keep up the good work",
      "rating": 5.0,
      "verified": true,
      "author": "Dr. L. A. Puccinelli",
      "helpful_votes": 0,
      "publication_date": 20140323
    },
    {
      "title": "Very Nice Glasses",
      "text": "These glasses were as advertized, they came very quick and they seem to be manufactured very sturdy. Will recommend to friends and family",
      "rating": 5.0,
      "verified": true,
      "author": "Octavio Alvarez",
      "helpful_votes": 0,
      "publication_date": 20140512
    },
    {
      "title": "thumbs up",
      "text": "Great deal , great transaction , couldn't be happier , durable and sturdy , i go through glasses like water , so these are fantastic",
      "rating": 5.0,
      "verified": true,
      "author": "T.Shore",
      "helpful_votes": 0,
      "publication_date": 20140609
    },
    {
      "title": "SERIOUSLY? 6 PAIRS?",
      "text": "For $22.00, these cannot be beat. Heck, for $50.00 they could not have been beat! These are exactly what I hoped for when I needed glasses that I don't mind using then dumping. I work in the military and tired of wasting $20.00 a set. Each of these are as good as those.",
      "rating": 4.0,
      "verified": true,
      "author": "Ah2golf",
      "helpful_votes": 0,
      "publication_date": 20140313
    },
    {
      "title": "Practical and inexpensive",
      "text": "Very good quality. Clark Kent glasses, but they're not for style, they're functional and cheap, which is what I was looking for.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Stuver",
      "helpful_votes": 0,
      "publication_date": 20140818
    },
    {
      "title": "great glasses",
      "text": "I will use them until I need a stronger lense; I will recomend to others. great for the price too. Oh, my wife uses them too.",
      "rating": 5.0,
      "verified": true,
      "author": "atlas",
      "helpful_votes": 0,
      "publication_date": 20140330
    },
    {
      "title": "Five Stars",
      "text": "Sturdy, A+ hinge, excellent lens, This is the 3rd set, they just don't float, LOL.",
      "rating": 5.0,
      "verified": true,
      "author": "Compass Rose",
      "helpful_votes": 0,
      "publication_date": 20160114
    },
    {
      "title": "Three Stars",
      "text": "to thick of glass or something cannot see blurry reading.",
      "rating": 3.0,
      "verified": true,
      "author": "Janet Riffle",
      "helpful_votes": 0,
      "publication_date": 20161006
    },
    {
      "title": "Exactly what I wanted",
      "text": "These glasses arrived as promised and were exactly what I needed extra glasses for plating around with my grand kids. I highly recommend them. They are the smaller sized lenses.",
      "rating": 4.0,
      "verified": true,
      "author": "W. Sargent",
      "helpful_votes": 0,
      "publication_date": 20140426
    },
    {
      "title": "Five Stars",
      "text": "great glasses...much better than the Costco readers that cost twice as much...great service also.",
      "rating": 5.0,
      "verified": true,
      "author": "hjalmar",
      "helpful_votes": 0,
      "publication_date": 20160309
    },
    {
      "title": "Five Stars",
      "text": "great style and fit. very happy with price and speedy delivery.",
      "rating": 5.0,
      "verified": true,
      "author": "Timothy Arb",
      "helpful_votes": 0,
      "publication_date": 20141010
    },
    {
      "title": "Five Stars",
      "text": "Super fast shipping! Great glasses! Will order more when my husband looses them all! Thank You!",
      "rating": 5.0,
      "verified": true,
      "author": "Rebecca Prokopchuk",
      "helpful_votes": 0,
      "publication_date": 20180412
    },
    {
      "title": "Flawless transaction, quality product",
      "text": "Exquisite and just perfect. In every way. I lose glasses like nickels. I dont want to lose any of these. I love these glasses.",
      "rating": 5.0,
      "verified": true,
      "author": "Stevie Moon",
      "helpful_votes": 0,
      "publication_date": 20140331
    },
    {
      "title": "Marginal quality. most have broken after a few months ...",
      "text": "Marginal quality. most have broken after a few months. You get what you pay for",
      "rating": 2.0,
      "verified": true,
      "author": "S. Bridges",
      "helpful_votes": 0,
      "publication_date": 20150728
    },
    {
      "title": "Great!",
      "text": "These glasses are great and I leave them everywhere so that I can read!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Smack",
      "helpful_votes": 0,
      "publication_date": 20141204
    },
    {
      "title": "FIORE READING GLASSES",
      "text": "EXCELLENT PURCHASE -- GREAT GLASSES -- FAST SHIPPING---EVERYTHING WAS PERFECT --- AAA+++",
      "rating": 5.0,
      "verified": true,
      "author": "James G. Shevela",
      "helpful_votes": 0,
      "publication_date": 20140903
    },
    {
      "title": "Five Stars",
      "text": "Can't beat the price, anywhere. Don't scratch. I buy them regulalry",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20160201
    },
    {
      "title": "Five stars!",
      "text": "What a great family business this is! Incredible customer service, great prices, just exceptional all the way around. You've got me for life!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Steven Starr",
      "helpful_votes": 0,
      "publication_date": 20170304
    },
    {
      "title": "Good price, although if they made them just a ...",
      "text": "Good price, although if they made them just a little stronger where the arms meets the frame they'd be so much better. This is a definite weak point and I've broken a bunch already.",
      "rating": 4.0,
      "verified": true,
      "author": "Richard",
      "helpful_votes": 0,
      "publication_date": 20141014
    },
    {
      "title": "they are sturdy and he can leave pairs around the house where ...",
      "text": "Bought for my dad, they are sturdy and he can leave pairs around the house where he needs them.",
      "rating": 5.0,
      "verified": true,
      "author": "Doc Sue",
      "helpful_votes": 0,
      "publication_date": 20140802
    },
    {
      "title": "Great deal!",
      "text": "Great deal!! Arrived promptly and look nice. Now I can have spares.",
      "rating": 5.0,
      "verified": true,
      "author": "DJS",
      "helpful_votes": 0,
      "publication_date": 20150428
    },
    {
      "title": "These reading glasses are excellent and most importantly durable",
      "text": "These reading glasses are excellent and most importantly durable. Every inexpensive reading eyewear I have purchased in the past broke either at the stems or the bridge quickly. I have been wearing the first of a package of six received for a few weeks and have had no problem.",
      "rating": 5.0,
      "verified": true,
      "author": "Jay William Blumberg",
      "helpful_votes": 0,
      "publication_date": 20150212
    },
    {
      "title": "Work Great",
      "text": "The glasses arrived on time. They fit good and are a good value. I will purchase these glasses again when they all get lost.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20140311
    },
    {
      "title": "Job well done",
      "text": "Is great value, good price, arrived sooner than expected! This is, I think my third order with Newport Blvd. and it's clear they take customer service seriously, refreshing. Nice job!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161011
    },
    {
      "title": "Five Stars",
      "text": "I love the glasses leave a pair n every room",
      "rating": 5.0,
      "verified": true,
      "author": "JRG",
      "helpful_votes": 0,
      "publication_date": 20161023
    }
  ],
  "product_meta": {
    "title": "Reading Glasses 1.00 | 5 Pack Spring Hinge Trendy Readers for Men and Women [5 Pack, 1.00]",
    "rating": 4.5,
    "feature_bullets": [
      "👓 Fantastic Value – Fiore puts your concerns first to anything else. Our brand-new trending oxford style frame reading glasses are suitable for both men and women. Lightweight plastic frames and Environmentally friendly material lens, with flexible spring hinge temples ensure a comfortable fit without uncomfortable pinching. Classic shape is suitable for any age and for any shape face.",
      "👓 Economical Solution For Your Vision – Fiore brings a perfect solution for your reading with an extra economical package. Our package includes five and six reading glasses with different colors of frames. This will give you an option to wear different glasses on every working day. These can also solve your problem for missing and finding glasses everywhere, as you can put these on different places, like home, office, etc.",
      "👓 Multiple Uses – These reading glasses are specially designed for reading and writing tasks, but they are also very useful for jobs that require more visual effort like electricity, DIY, sewing, crafts, etc. Very practical to use with your mobile phone, tablet or computer. Ideal for use at home or at work. Wearing these reading glasses at home, in bed, at the office, or wherever you need them, means you'll always look sharp.",
      "👓 Variety & Clarity – You will receive 5 or 6 pairs of glasses and don’t worry about trying to find something to clean your glasses as set comes with a micro-fiber cleaning cloth to remove those annoying smudges before they get in your way. A convenient set allows you to keep a pair of reading glasses in different places, so you always have a pair at hand. Comfortable fit, ergonomic design and carefully modified to make the whole pair of glasses comfortable.",
      "⭐ PROUDLY AMERICAN OWNED ⭐ – We are an American family-owned business with over 500,000 Amazon sales. We started using our home garage as a warehouse and slowly grew into a much larger warehouse a few years later. We appreciate you supporting our family and helping our business grow. Thank you! Greg, Susan, David, Daniel, and Shadow."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "6 x 3 x 3 inches",
      "Date First Available": "April 17, 2017",
      "Manufacturer": "Fiore",
      "ASIN": "B07228Z945",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Reading Glasses",
      "Health & Household",
      "Health, Household & Baby Care",
      "Vision Care"
    ],
    "price": 19.99
  }
}