{
  "website_summaries": [
    {
      "verdict": "While the SRS-X7 can't beat the performance of competitors like the Bose SoundLink III, it's a nice portable wireless speaker that offers the flexibility of both Bluetooth and Wi-Fi connectivity.",
      "pros": [
        "The Sony SRS-X7 has a sleek, minimalist design and allows you to stream audio wirelessly via Bluetooth or Wi-Fi, with both AirPlay and DLNA support"
      ],
      "cons": [
        "Somewhat pricey",
        "Wi-Fi set-up isn't simple",
        "battery life could be better",
        "speaker vibrates with heavy bass at high volumes and can move around on smoother surfaces"
      ],
      "aspects": {
        "Design": 8.0,
        "Features": 9.0,
        "Sound": 7.0,
        "Value": 7.0
      },
      "publication_date": 20140516,
      "rating": 7.5,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "this speaker was good when I first bouts it",
      "text": "this speaker was good when I first bouts it . It seemed pretty loud. After using it daily at a grocery store. I wasn't as loud as when I first bought it. Then a little after a year of almost daily use it stop holding a charge. And now it doesn't work. I tried customer support via chat and they said I did all the trouble shooting they would suggest. so I tried calling Sony but I get the usual corporate hold and run around. This is the second Sony speaker I have bought and the last one did the same thing. I'm going to buy JBL now.",
      "rating": 2.0,
      "verified": true,
      "author": "Joseph  Fernando",
      "helpful_votes": 0,
      "publication_date": 20170818
    },
    {
      "title": "I have used Bluetooth and Airplay and both seem to work well although I am a bit far from my WiFi router so Bluetooth is better.",
      "text": "I was really impressed by how much sound this puts out. I am somewhat picky about sound quality but not a total aficionado. I use this in my large master bathroom to stream music from my iPad. It looks so much nicer than the old computer speakers I was using before. I have used Bluetooth and Airplay and both seem to work well although I am a bit far from my WiFi router so Bluetooth is better. I did notice with this speaker that the sound is much better if the speaker is closer to head height so I put it on a shelf. I bought a refurbished model and only paid around $100 so it was a great deal.",
      "rating": 5.0,
      "verified": true,
      "author": "KJ",
      "helpful_votes": 0,
      "publication_date": 20150701
    },
    {
      "title": "Great Sound, Good Bass, Lightweight, Portable, Wired and Bluetooth",
      "text": "I wanted a great sounding wired and/or bluetooth enabled speaker...not just bluetooth but great sounding with good bass. This one fits the bill and for the price its good and loud. The DJ didn't show for a family reunion gathering in a large carpeted room and fortunately I had this with me to spin some tunes from both my phone and tablet. It was loud enough to easily fill the room and allow me to stream music for the party. Instantaneous DJ!!",
      "rating": 5.0,
      "verified": true,
      "author": "Timothy",
      "helpful_votes": 2,
      "publication_date": 20160323
    },
    {
      "title": "Perfect for it's size!",
      "text": "Excellent sound quality for it's size, and like others have mentioned, the audio power does fall slightly when it's removed from battery power. I've used this to watch Formula One racing at a local venue here in town. We have it playing over Bluetooth from a laptop about 15 feet away and the sound quality is indistinguishable from any other playback source. Sounds great and the range is better than I expected! I would not hesitate to get this for someone as a gift. Very happy with the build quality, but I baby mine. If you you are someone who's rough with their electronics, maybe consider getting a carrying case for it.",
      "rating": 5.0,
      "verified": true,
      "author": "Dave N.",
      "helpful_votes": 0,
      "publication_date": 20151223
    },
    {
      "title": "Much better than any other Bluetooth unit I tested and I ...",
      "text": "Decent sound quality and battery life. Much better than any other Bluetooth unit I tested and I tested a lot (Sonos, Harmon Kardon, Bose, UE, JBL to name a few). Only qualm is the over powering bass. So much so that the unit can sometimes find itself on the ground if turned too loud regardless of the surface. The unit either needs more weight or thicker shock absorbing feet. This thing jiggles all over the place if you turn it up and the bass is pretty overpowering. Very little blending from mids to lows but still the best bluetooth unit out there. Sony play helps, but doesn't solve the issue of blending.",
      "rating": 4.0,
      "verified": true,
      "author": "cboynton",
      "helpful_votes": 0,
      "publication_date": 20160803
    },
    {
      "title": "Great speaker, steap price",
      "text": "Sony srs x7 is very well rounded speaker. WiFi, Bluetooth, aux in, nfc. WiFi connecting can be complicated, but once connected works perfectly. Mine needed to be updated for the Bluetooth to function, not sure why. When running on battery the volume is affected, so I keep mine plugged in. Deep bass, and great sound clarity. Be warned if your music is in a compressed audio format, the sound will be affected. Overall this speaker is amazing, and one should thoroughly read the instructions before using.",
      "rating": 5.0,
      "verified": true,
      "author": "caleb mc",
      "helpful_votes": 2,
      "publication_date": 20150223
    },
    {
      "title": "However it is not easy to connect via Air Play (WIFI)",
      "text": "I use Apple iPhone. Since the phone doen't supports Apt-X, I expect a lot for the Air Play function of the speaker. However it is not easy to connect via Air Play (WIFI), I used the fuction one time only, it doesn't speak sound via Air Play even it says connected by WIFI on the Songpal app.. Bluetooth is okay but it is a big diappoint I have to use Songpal app when I want to use Air Play but it is not works properly..",
      "rating": 3.0,
      "verified": true,
      "author": "Steve",
      "helpful_votes": 0,
      "publication_date": 20160804
    },
    {
      "title": "No Sony Partystreaming connectivity",
      "text": "only problem, I cannot remotely turn on when it is on Bluetooth or Wi-Fi. It automatically shuts down...yes, I have changed the setting in the app and updated the software (was first thing I did). Still cannot remotely turn on. also, I hate that the speaker DOES NOT work Sony Partystreaming the devices or apps. I have all Sony wireless speakers and theater system that all connect....except for this one which I wanted to place in my gym which is the only room that didn't have a Ssony wireless speaker.",
      "rating": 4.0,
      "verified": true,
      "author": "Dark Knight",
      "helpful_votes": 0,
      "publication_date": 20160113
    },
    {
      "title": "Very happy with purchase",
      "text": "Bought this for use at my work's gym (30' wide by 40' length room). Reminds me of the Bose Soundwave as far as sound quality. Pretty impressive. It has good bass, not amazing (hard to do with a fairly shallow depth speaker). Also, this speaker actually sounds better if you have it at least 5+ feet away from you since the sound was slightly distorted at higher volume at close range but not further away. This speaker may be a bit overkill in a very small bedroom Well worth the small investment ($199) to have a speaker this small fill such a large room with great quality sound.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Slaughter",
      "helpful_votes": 0,
      "publication_date": 20141230
    },
    {
      "title": "Sounding good!",
      "text": "This was a Christmas gift so all I know is what I heard for a few minutes and what the recipient is telling me. It was easy to set up and sounded REALLY good and clear...and loud. He tells me he loves it and it still sounds amazing. Got it on sale so that helped because it isn't exactly cheap; still, worth it, if you're into sound.",
      "rating": 5.0,
      "verified": true,
      "author": "Anonymity",
      "helpful_votes": 0,
      "publication_date": 20151230
    },
    {
      "title": "So far this is the best sounding portable Bluetooth speaker I've heard",
      "text": "So far this is the best sounding portable Bluetooth speaker I've heard, so I agree with Consumer Reports. The base is decent for it's size. The highs are very present but maybe a bit harsh. The mids acceptable. At 4.3 lbs It is surprisingly heavy for it's size so if light weight portability is important to you, check the size and weight specifications first. Bluetooth connection is a breeze. I'd say spend the extra $50-100 bucks and get this puppy. Your ears will thank you.",
      "rating": 4.0,
      "verified": true,
      "author": "Randy_H",
      "helpful_votes": 0,
      "publication_date": 20150619
    },
    {
      "title": "Ready to Rave Thumping Bass!",
      "text": "It's the best sounding portable airplay/Bluetooth speaker you can buy, period. Anything bigger needs an outlet. Rechargeable battery lasts a good 4-6 hours. Enough time to enjoy a picnic, etc. but will need more juice if you're going to throw an all night rave.",
      "rating": 5.0,
      "verified": true,
      "author": "Glenn Smooth",
      "helpful_votes": 0,
      "publication_date": 20140909
    },
    {
      "title": "Meh.",
      "text": "I like the rich tone of this unit. The interface (smartphone app) needs to be more straight forward and needs more complete in terms of playback options. Why can't I listen to an album straight through? Some discs need to be heard in the order the artist chose. Annoying! Also, for the life of me, I can't get it to recognize my WiFi. I am reasonably intelligent. I've followed the directions precisely. It shouldn't be this hard. Bluetooth works fine, as does the wired connection to my network.",
      "rating": 2.0,
      "verified": true,
      "author": "chris tyrrell",
      "helpful_votes": 0,
      "publication_date": 20161014
    },
    {
      "title": "I love this speaker.",
      "text": "No wires. Great sound. I wanted Bluetooth, Didn't really understand the Wi-Fi feature before I bought it, but use it exclusively now. Really good sound quality, comparably with my Bose but so much easier to bring outside. Very ready to set up and I control it with my phone.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe M.",
      "helpful_votes": 0,
      "publication_date": 20150523
    },
    {
      "title": "Nice sound and comparative to the Bose minilink, but Battery Life falls way short",
      "text": "Brand new, Fully charged after the software update,,, Runtime. 2 Hours and 15 minutes.... Far cry from the listed 6hrs proclaimed,, Very disappointed,, Ran Through bluetooth and playing Pandora poolside,,, 2 hours wont cut it near a beach or the lake where power supply isnt an alternative. Disappointed. ..",
      "rating": 1.0,
      "verified": true,
      "author": "Michael \"Cisco\"",
      "helpful_votes": 2,
      "publication_date": 20160705
    },
    {
      "title": "nice",
      "text": "The sound quality of this is very nice, crisp and deep. However I would prefer a little more bass, and its not as loud as other reviewers led me to believe. Its still a fantastic speaker for a room",
      "rating": 4.0,
      "verified": true,
      "author": "K. C ",
      "helpful_votes": 0,
      "publication_date": 20160707
    },
    {
      "title": "I think this sounds better than the bose speaker system",
      "text": "The sound quality is unbelieveable. It puts out incredible bass. You have to watch the bass because it can vibrate right off of the counter. Voices and music are crystal clear. I think this sounds better than the bose speaker system. Love it !!!",
      "rating": 5.0,
      "verified": true,
      "author": "Gordon H.",
      "helpful_votes": 0,
      "publication_date": 20150619
    },
    {
      "title": "Taking a chance and failed!",
      "text": "Purchased this unit over a year ago for my son dorm room. It would not work from time to time, but often enough to get through the school year. Brought it home and I followed the troubleshooting and got it going again. Week later, not working - No SOUND coming out, I can pair it via Bluetooth, but nothing comes out. Audio IN - No sound out. Of course I am out of Wty, so it is on me to pay for repairs. Will not purchase another one. It will make a great door stop!!!!!",
      "rating": 2.0,
      "verified": true,
      "author": "knightshift",
      "helpful_votes": 0,
      "publication_date": 20160804
    },
    {
      "title": "and it sounds amazing. I wanted a little larger unit to fill ...",
      "text": "My wife has the x5, and it sounds amazing. I wanted a little larger unit to fill a larger outside area. This unit is spectacular. Sound quality is better than nearly every other speaker I've listened too. Even Bose, in my opinion.",
      "rating": 5.0,
      "verified": true,
      "author": "GM2",
      "helpful_votes": 0,
      "publication_date": 20160703
    },
    {
      "title": "Try it! you will Love it !!",
      "text": "Wow!! This Lil speaker is awesome. So far I have enjoyed everything about it, although my phone doesn't have an app for it, I'm a windows phone user but there is a program, Media Go that works very well on my Windows laptop. Both Bluetooth and network connection work great and the sound is just amazing. Love how portable it is also, great for time out on the patio.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160501
    },
    {
      "title": "I wanna rock",
      "text": "Really great sound when plugged in but quality of sound decreases when on battery power but still sounds really good. Love the NFC function and the bass is much better than I expected. Very satisfied with the purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "Cha Cha Ra",
      "helpful_votes": 0,
      "publication_date": 20150520
    },
    {
      "title": "This box rocks",
      "text": "Easy to set up, Song Pal works great, sound is awesome, blows away the Echo by far. Battery makes it portable although not weather proof. Great speaker, only complaint is the cord is too short.",
      "rating": 4.0,
      "verified": true,
      "author": "MarkMW",
      "helpful_votes": 0,
      "publication_date": 20160816
    },
    {
      "title": "Great product. Sounds great",
      "text": "Great product. Sounds great. Works well with AirPlay. It can take a little to long (15secs) to sync with my computer with AirPlay. I don't use Bluetooth much with this but itseemsto work fine as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Wario",
      "helpful_votes": 0,
      "publication_date": 20150513
    },
    {
      "title": "Excellent sound quality",
      "text": "Excellent sound quality, the bass can be a little lacking but what do you expect from such small speakers? It does very well for its size in my opinion and the quality is crisp. If you want bass go buy some studio monitor speakers, just remember that the more bass you get the less portability you will have.",
      "rating": 4.0,
      "verified": true,
      "author": "Aaron Westrom",
      "helpful_votes": 4,
      "publication_date": 20140702
    },
    {
      "title": "Great Sound",
      "text": "This speaker is a great buy the sound quality is amazing and the bass is really good I really recommend this Sony speaker",
      "rating": 5.0,
      "verified": true,
      "author": "Jose Luis Carmona Mendoza",
      "helpful_votes": 0,
      "publication_date": 20151222
    },
    {
      "title": "It needs a carrying pouch - Great Bass & Treble",
      "text": "I was replacing an older model Sony Sound-bar, read a lot of reviews before buying and I have to say it sounds great, deep bass and crisp highs. Had to give it a 4 because its one of the only models that doesn't come with a carrying pouch & it doesn't get super loud!",
      "rating": 4.0,
      "verified": true,
      "author": "Shaun",
      "helpful_votes": 0,
      "publication_date": 20150709
    },
    {
      "title": "Sound is great, but",
      "text": "The sound fills my \"great room\", good base, good separation. But I have found the wifi interface frustrating to use. I recommend the speaker.",
      "rating": 4.0,
      "verified": true,
      "author": "Big Wally",
      "helpful_votes": 0,
      "publication_date": 20150523
    },
    {
      "title": "Good sound quality",
      "text": "Sound quality is good for a speaker of this size. Bluetooth works great. It took awhile to figure out how to sync it with my iPod and iPad Mini. The instruction manual was not very helpful and seemed to have been written by someone who doesn't speak English. Eventually it almost went through the steps for set-up itself.",
      "rating": 4.0,
      "verified": true,
      "author": "Old music lover",
      "helpful_votes": 0,
      "publication_date": 20150101
    },
    {
      "title": "Good quality for the money",
      "text": "Good quality for the money. Happy with mine. Use it everyday, in fact. The only downside is no remote but that is hardly a reason to not love this speaker!",
      "rating": 5.0,
      "verified": true,
      "author": "J. P. Morski",
      "helpful_votes": 0,
      "publication_date": 20150524
    },
    {
      "title": "Five Stars",
      "text": "Simply superb, the sound is crystal clear, really nothing to envy Bose.",
      "rating": 5.0,
      "verified": true,
      "author": "Fabian",
      "helpful_votes": 0,
      "publication_date": 20161119
    },
    {
      "title": "Sound Quality is good. Bass is awesome",
      "text": "Sound Quality is good. Bass is awesome. The speakes are too fond depending of Songpal. An app that still needs some rework.",
      "rating": 4.0,
      "verified": true,
      "author": "Belike",
      "helpful_votes": 0,
      "publication_date": 20150504
    },
    {
      "title": "great buy! has the kind of power that i ...",
      "text": "great buy! has the kind of power that i can enjoy, i love listing to it outside on my patio. sony power!",
      "rating": 4.0,
      "verified": true,
      "author": "Louie E",
      "helpful_votes": 0,
      "publication_date": 20160724
    },
    {
      "title": "Good sound, better if the sound is sustainable",
      "text": "Good sound, better if the sound is sustainable, when equipment is not plugged there is a huge volume and bass difference",
      "rating": 4.0,
      "verified": true,
      "author": "omalykualy",
      "helpful_votes": 0,
      "publication_date": 20150325
    },
    {
      "title": "great sound, good design.",
      "text": "sounds great and the variety of streaming options are an added benefit. That being said, the wifi is a bit tricky to set up. Plus, ability to hook it up to ethernet cable allows it to be placed in areas where wifi might have trouble getting to.",
      "rating": 5.0,
      "verified": true,
      "author": "NMP20009",
      "helpful_votes": 0,
      "publication_date": 20160317
    },
    {
      "title": "Good sound and portable",
      "text": "My first bluetooth speaker and it's awesome. Carry it with me everywhere, quality product with affordable price.",
      "rating": 5.0,
      "verified": true,
      "author": "HAN D NGUYEN",
      "helpful_votes": 0,
      "publication_date": 20160728
    },
    {
      "title": "The sound quality was great, but the battery only seemed to last 15 ...",
      "text": "I could only get the bluetooth to work, and it often cut out inexplicably. The sound quality was great, but the battery only seemed to last 15 min before needing plugged in. Now it wont turn on at all. So unless I feel like pissing away my time trying to get the battery fixed or replaced, I'm out $160. Boo Sony.",
      "rating": 2.0,
      "verified": true,
      "author": "Aaron McIntosh",
      "helpful_votes": 0,
      "publication_date": 20151024
    },
    {
      "title": "Sound is amazing. Set up is easy",
      "text": "Sound is amazing. Set up is easy. You just need to install an app and you are connected. The only con is that I still didn't figure how to connect it via wifi. Keeps failing to connect",
      "rating": 4.0,
      "verified": true,
      "author": "Harel & Dalit Talmor",
      "helpful_votes": 0,
      "publication_date": 20151101
    },
    {
      "title": "Decent Speaker",
      "text": "For a relatively small speaker, the sound is good. I use it primarily with AirPlay, and it works flawlessly. The only issue I've experienced is that the Sony SongPal app doesn't always connect/recognize the speaker.",
      "rating": 4.0,
      "verified": true,
      "author": "Sean",
      "helpful_votes": 0,
      "publication_date": 20160728
    },
    {
      "title": "but I heard it connected to my son's IPhone by bluetooth and the sound was great. He was very pleased",
      "text": "This was a gift, but I heard it connected to my son's IPhone by bluetooth and the sound was great. He was very pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "Mtn. woman 5",
      "helpful_votes": 0,
      "publication_date": 20150107
    },
    {
      "title": "This speaker has been awesome. Comes just like the non-refurbished one for a ...",
      "text": "This speaker has been awesome. Comes just like the non-refurbished one for a portion of the price. My wife loves this. It has great low sound which a lot of the bluetooth speakers dont have.",
      "rating": 5.0,
      "verified": true,
      "author": "Casey F.",
      "helpful_votes": 0,
      "publication_date": 20150518
    },
    {
      "title": "Great to have for presentations in large rooms",
      "text": "This speaker is powerful. Great to have for presentations in large rooms.",
      "rating": 5.0,
      "verified": true,
      "author": "PuddinSkins",
      "helpful_votes": 0,
      "publication_date": 20151217
    },
    {
      "title": "Totally satisfied and some tips for users",
      "text": "Really good product. The sound quality and volume is excellent, at least for me. Recommendations: download Sony's SongPal app (you can manage the speaker volume and equialize it from your phone) and plug it to the wall to hear 10-15% louder (approximately).",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160725
    },
    {
      "title": "Finally bought it.",
      "text": "Very good speaker for its size. Just what I was looking for. Easily connects to all my portable music players.",
      "rating": 5.0,
      "verified": true,
      "author": "sangrefria23",
      "helpful_votes": 0,
      "publication_date": 20150923
    },
    {
      "title": "Two Stars",
      "text": "sounds like an enhancer phone speaker. No comparison to JBL or Bose portable speaker",
      "rating": 2.0,
      "verified": true,
      "author": "Kimmykim",
      "helpful_votes": 0,
      "publication_date": 20161224
    },
    {
      "title": "Five Stars",
      "text": "Great sound quality! The multiple connection options are very useful",
      "rating": 5.0,
      "verified": true,
      "author": "Henry",
      "helpful_votes": 0,
      "publication_date": 20140709
    },
    {
      "title": "Love it!",
      "text": "Love it !!! The range is enough to have me leave in the house and go to the outside patio. So happy with this wireless speaker.",
      "rating": 5.0,
      "verified": true,
      "author": "Lynn G.",
      "helpful_votes": 0,
      "publication_date": 20140905
    },
    {
      "title": "Great sound with a lot of Bass",
      "text": "Great sound with a lot of Bass..! I'm so happy I decided to give this a listen since I planned on passing it up considering it wasn't a Bose or Beats product. For the size of this device it has a really great sound. I'll be using it a lot outside and when traveling.",
      "rating": 5.0,
      "verified": true,
      "author": "Nicholas M Liguras",
      "helpful_votes": 0,
      "publication_date": 20150529
    },
    {
      "title": "Very Satisfied.",
      "text": "Easy setup, sound quality excellent, nice design looks good anywhere I put it... I am very satisfied with this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Buz Marion",
      "helpful_votes": 2,
      "publication_date": 20140422
    },
    {
      "title": "Five Stars",
      "text": "Great design & sound beats my expectation. Way better than Bose Soundlink I've been using for 10 months.",
      "rating": 5.0,
      "verified": true,
      "author": "Yoon",
      "helpful_votes": 0,
      "publication_date": 20160830
    },
    {
      "title": "Had issues with AirPlay",
      "text": "It had issues when connected with AirPlay along with other speakers. I ended up returning it because of this.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160808
    },
    {
      "title": "Ok, but not great",
      "text": "Sound is clean and clear, but a little dull and heavy, lack of brightness, richness and warmth.",
      "rating": 4.0,
      "verified": true,
      "author": "HH",
      "helpful_votes": 0,
      "publication_date": 20150729
    },
    {
      "title": "Spoke to Amazon customer care and looked like it was going to be a long haul",
      "text": "Product paired with Samsung note 4, but did not pair with Samsung note 3 and my ipad. Spoke to Sony customer care. The customer care person told since you had purchased it from amazon, you have to talk to amazon. We cannot help you. Spoke to Amazon customer care and looked like it was going to be a long haul, connecting once more to Sony customer care. So decided to return the product. The sound was good when i connected to Samsung note 4. Its a pity that i have to return it.",
      "rating": 2.0,
      "verified": true,
      "author": "Excalibur",
      "helpful_votes": 0,
      "publication_date": 20141218
    },
    {
      "title": "but realized I'd rather have great sound instead",
      "text": "I tested dozens of bluetooth speakers before deciding on this one. I originally wanted something very portable, but realized I'd rather have great sound instead. This sounds fantastic, plus you can make custom eq adjustments in the app.The bluetooth is great and has a nice range. Love that it connects via Wifi (though the controls are delayed i.e. when you skip to the next track, it takes a solid 2-3 seconds). Plus, the aesthetic is far and away superior to other bluetooth speakers. It actually looks like an expensive, quality speaker and not a red/green/blue trendy bubble.",
      "rating": 5.0,
      "verified": true,
      "author": "benrajabj",
      "helpful_votes": 0,
      "publication_date": 20150319
    },
    {
      "title": "Great product expected more volume",
      "text": "Its a great product, its heavier than the bose soundlink II and III the volume its very similar and a very good quality sound even though i preffer bose sound, but you get a good product for your money",
      "rating": 4.0,
      "verified": true,
      "author": "Manuel I. Vegas Brandt",
      "helpful_votes": 0,
      "publication_date": 20141226
    },
    {
      "title": "Five Stars",
      "text": "It has very many convinient functions and sounds good~~ I'm very satisfied",
      "rating": 5.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20160713
    },
    {
      "title": "This speaker is so great. I have owned bose soundlink mini 2 and ...",
      "text": "This speaker is so great. I have owned bose soundlink mini 2 and harman kardon esquire. SRS-X7 win them, absolutely!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160429
    },
    {
      "title": "Four Stars",
      "text": "Great sound reproduction. Syncs easily to all our Bluetooth devices. Battery life could be better, however.",
      "rating": 4.0,
      "verified": true,
      "author": "RMMDAM",
      "helpful_votes": 0,
      "publication_date": 20150912
    },
    {
      "title": "... bought this speaker roughly a week ago I do enjoy the sound but I do feel that there isn't ...",
      "text": "I bought this speaker roughly a week ago I do enjoy the sound but I do feel that there isn't a lot of volume coming out of the speaker and it distorts at high volume.",
      "rating": 3.0,
      "verified": true,
      "author": "Kenneth Blume",
      "helpful_votes": 0,
      "publication_date": 20150622
    },
    {
      "title": "Everything is so good",
      "text": "Everything is so good. Except Network delay&non-sense sleep mode. Sound quality is excellent to me. Wide wifi coverage is so impressive",
      "rating": 5.0,
      "verified": true,
      "author": "yungwoo.jung",
      "helpful_votes": 0,
      "publication_date": 20141125
    },
    {
      "title": "Five Stars",
      "text": "it's good. it has some scrach..but it works very well. touch butten is good too..",
      "rating": 5.0,
      "verified": true,
      "author": "Park, guntae",
      "helpful_votes": 0,
      "publication_date": 20150517
    },
    {
      "title": "Best sounding speaker for the price",
      "text": "Since the price dropped, $188 dollars this is the best speaker you could want. Sounds amazing compared to Bose sound link. The big jambox is a little bit louder and more portable then this one, but the bass is much deeper and has a fuller frequency range. I love it, good stuff for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "DjMag",
      "helpful_votes": 0,
      "publication_date": 20150413
    },
    {
      "title": "Otherwise sounds great with decent response from this size device",
      "text": "Have to reset it constantly to connect to AirPlay. Otherwise sounds great with decent response from this size device.",
      "rating": 3.0,
      "verified": true,
      "author": "Art H.",
      "helpful_votes": 2,
      "publication_date": 20150303
    },
    {
      "title": "Either Wireless or WLan connected but no sound at all ...",
      "text": "Either Wireless or WLan connected but no sound at all. DLNA failed too. Given three star because I am always supporting Sony and hope they can stand out once again. Currently this speaker act as my display, as I am using NAS server to play music around the environment.",
      "rating": 3.0,
      "verified": true,
      "author": "Nicoresus",
      "helpful_votes": 0,
      "publication_date": 20150521
    },
    {
      "title": "It took a dumpa'.",
      "text": "Mine is dead. 1st day, wouldn't connect to wifi, no matter what. 2nd day. Won't even turn on. My PS4 also just took a dump. I thought Sony was supposed to make a good product.",
      "rating": 1.0,
      "verified": true,
      "author": "K. MCINTYRE",
      "helpful_votes": 0,
      "publication_date": 20160414
    },
    {
      "title": "Not completely reconditioned",
      "text": "Buttons on the top do not work. This was a reconditioned unit and I expected it to function correctly.",
      "rating": 2.0,
      "verified": true,
      "author": "mary a hammond",
      "helpful_votes": 2,
      "publication_date": 20141231
    },
    {
      "title": "Three Stars",
      "text": "Not happy with battery life and realized it is not really practical to travel with.",
      "rating": 3.0,
      "verified": true,
      "author": "J.P",
      "helpful_votes": 2,
      "publication_date": 20150125
    },
    {
      "title": "Very disappointed. I bought the SRSX7 for its AirPlay feature ...",
      "text": "Very disappointed. I bought the SRSX7 for its AirPlay feature and was willing to pay a premium for good sound quality. After a week of trying to ignore the muddy bass and continuous network dropouts, I'm done. Ships with an Apache Web server to perform the configuration. Endless waiting for a configuration page to appear (over 7 minutes watching a blinking light). Appliances like this should work like AppleTV: plug it in, turn it on, setup, forget.",
      "rating": 1.0,
      "verified": true,
      "author": "Matthew Mattoni",
      "helpful_votes": 4,
      "publication_date": 20141230
    },
    {
      "title": "success!!!",
      "text": "Perfect transaction! and dont bother buying bose, the sony blows it away!!!",
      "rating": 5.0,
      "verified": true,
      "author": "goose",
      "helpful_votes": 0,
      "publication_date": 20150225
    },
    {
      "title": "Five Stars",
      "text": "Absolutely nothing in this price point sounds 1/2 this good.",
      "rating": 5.0,
      "verified": true,
      "author": "CK Burks",
      "helpful_votes": 0,
      "publication_date": 20150105
    },
    {
      "title": "boom boom sony",
      "text": "What a speaker amazing bass, clear sound great vibration full dj system feel",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160710
    },
    {
      "title": "Four Stars",
      "text": "Pretty good sound, not great but it grows on you. Easiest to connect to Android",
      "rating": 4.0,
      "verified": true,
      "author": "OBXRON",
      "helpful_votes": 0,
      "publication_date": 20150306
    },
    {
      "title": "Five Stars",
      "text": "sounds incredible. I use it out near the pool and also on the boat",
      "rating": 5.0,
      "verified": true,
      "author": "Richard  Hutchison",
      "helpful_votes": 0,
      "publication_date": 20150310
    },
    {
      "title": "Sounds and feels good,but...",
      "text": "if you are a rich person and don't care if your speaker gets very loud at all, and want all around (low, mid, high) good solid sound when you very close to it, this is for you. This speaker tops out at about half my bose sounddock that has the old 30 pin on it. Better to waste the money on something that can at leased turn up. Refer to YouTube for the ideal speaker for you, because trust this: good speakers are harder and harder to find now",
      "rating": 2.0,
      "verified": true,
      "author": "LB7",
      "helpful_votes": 3,
      "publication_date": 20150129
    },
    {
      "title": "One Star",
      "text": "the equipment does not work, and when I return I do not return the money",
      "rating": 1.0,
      "verified": true,
      "author": "Diana P. Ramirez Echeverri",
      "helpful_votes": 0,
      "publication_date": 20160124
    },
    {
      "title": "you get what you pay for...",
      "text": "I bought it refurbished from \"Secondipity\"... Product was broken, volume buttons were not working.",
      "rating": 1.0,
      "verified": true,
      "author": "Carlos Bejarano",
      "helpful_votes": 3,
      "publication_date": 20150414
    },
    {
      "title": "Good sound & configurations, but bad battery life",
      "text": "The sound is really good and will not disconnect even if you're 10 meters away. I really liked the app for the speaker, SongPal. You could control the speaker system by using the app, such as adjusting the volume, checking the battery life, and customizing EQ. The most disappointing thing about this speaker system is that the battery life is bad. It goes around 4-5 hours of nonstop. I had Bose Soundlink 2 and that went for at least 9 hours. Due to the poor battery life, I'll be returning this.",
      "rating": 3.0,
      "verified": true,
      "author": "Cloud Engineer",
      "helpful_votes": 6,
      "publication_date": 20140320
    },
    {
      "title": "Disappointed",
      "text": "I has high hopes for this speaker but my Bose mini had more bass and power. Bluetooth interrupted at times. Have tested over 12 different bluetooth speakers. Would put this in the middle. Will return.",
      "rating": 3.0,
      "verified": true,
      "author": "Nina  Kline",
      "helpful_votes": 6,
      "publication_date": 20140327
    }
  ],
  "product_meta": {
    "title": "Sony SRSX7 Portable NFC Bluetooth Wireless Wi-Fi Speaker System",
    "rating": 4,
    "feature_bullets": [
      "Powerful stereo sound with 32 Watts of power",
      "Subwoofer with dual passive radiators for rich sound (50 Hz to 20 kHz)",
      "Bluetooth audio streaming with AAC and aptX support",
      "Wi-Fi audio streaming with DLNA and AirPlay support",
      "DSEE and ClearAudio+ deliver realistic, rich sound"
    ],
    "categories": [
      "Portable Audio & Video",
      "Portable Bluetooth Speakers",
      "Electronics",
      "Portable Speakers & Docks"
    ],
    "price": "",
    "specifications": {}
  }
}