{
  "website_summaries": [
    {
      "verdict": "Solid, injection-molded wrist roller with special features to improve its effectiveness in helping build strength of wrist, hand, or forearm.",
      "pros": [
        "Injection molded handle is durable and offers many gripping options to work a variety of forearm muscle sets (ranges of motion)",
        "Rubber gripper minimizes slipping",
        "Strong and adjustable webbing strap has center guide to maintain strap in proper position for consistent weight balance during exercise",
        "Easy to attach weights using handy weight pin",
        "Compatible with 1- or 2-inch weight plates"
      ],
      "cons": [
        "Some users found that metal clip holding strap did not hold up when using higher weights"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Breaks under stress",
      "text": "Metal clips start to break and deform once you put 15lbs or more on this. Device itself is easy to use and comfortable, unfortunately it cannot support high weight. Garbage for the price.",
      "rating": 1.0,
      "verified": true,
      "author": "ZD",
      "helpful_votes": 49,
      "publication_date": 20160105
    },
    {
      "title": "a great addition",
      "text": "This is an excellent edition to my wrist joint work-outs. Till now all I could do were wrist curls (& reverses) and grippers which can cause some discomfort at times. The Wrist Ripper gives me more alternatives as it can be held at different grips and provides for constant tension. 32 years of construction work has damaged my wrists and elbows to the point that I experience pain. The wrist ripper has not only aided in the development of my grip strength, but it has decreased the pain felt while working-out as I believe it has developed all the supporting muscles surrounding my wrists and elbows giving me more support and stability.",
      "rating": 5.0,
      "verified": true,
      "author": "Ed M.",
      "helpful_votes": 2,
      "publication_date": 20170618
    },
    {
      "title": "Best wrist strengthening device ever invented ? ?",
      "text": "I have two of these. I have been a rower for over 46 years and I have used various wrist strengthening systems - including machines in gyms and home-made wooden dowel + rope rigs. The ripper is the best ever for three reasons: 1. The grips are fantastic - right diameter and amount of tackiness 2. The weight plate plug is a snap to use - with the snap connection 3. Build quality is excellent 4. No dropped weights - the bevels on the middle and the bulbs at the end give you tactile feedback of the grip dimensions 5. Strap wraps up more neatly than a rope or chain",
      "rating": 5.0,
      "verified": true,
      "author": "chiptex",
      "helpful_votes": 2,
      "publication_date": 20160529
    },
    {
      "title": "Best buy product",
      "text": "came quick..works as advertised and is easy to use...I looked at the other items like this and found the were badly made and found this one..glad I did as it works. ( now if I can only get motivated to work out more). as products go this one is perfect for working out your hands and wrists. to start go get a 5 lbs plate for workouts as you can hurt your wrist easy. 3 sets of 10 for first week....DO NOT WORK OUT ANY PART OF YOUR BODY AT MAX WEIGHT TO SHOW OFF. sorry..had to make sure kids do not hurt themselves.is best for this item",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew Links ",
      "helpful_votes": 0,
      "publication_date": 20160929
    },
    {
      "title": "Good product but expensive.",
      "text": "I work out often at home and my forearms were noticeably smaller then the rest of my arm. This makes your forearms burn! I would say it's pretty well made, just have to be careful not to slam the weight down because the \"pin\" that holds the weight is plastic. For $50 it should be metal. A little expensive, but it'll give your forearms a good workout. I like how strap stays centered while using it, compared to the old \"rope and stick\" method.",
      "rating": 4.0,
      "verified": true,
      "author": "Andrew R.",
      "helpful_votes": 5,
      "publication_date": 20160112
    },
    {
      "title": "Great product",
      "text": "I was going to make a home-made version, as my gym has a weight tied to a dowel, but, I'm glad I decided to buy this one instead. This is well made, with multiple grip options. I don't know exactly what material the handle is, but, my sweaty hands are able to maintain a good grip. I would recommend this as a lot of thought seems to have gone into the design. PS: their customer service is great too... as I had a minor issue that they resolved immediately.",
      "rating": 5.0,
      "verified": true,
      "author": "broken_ankle",
      "helpful_votes": 2,
      "publication_date": 20160529
    },
    {
      "title": "Dumb not to buy this!",
      "text": "I WISH I HAD FOUND THIS PRODUCT YEARS AGO! We use this in my physical therapy / Workout Center Daily with patients rehab and with Crossfitters, etc The piece that the weights stack on is plastic, but other than that it is perfect!",
      "rating": 5.0,
      "verified": true,
      "author": "SYNERGY ATHLETIC PERFORMANCE",
      "helpful_votes": 2,
      "publication_date": 20161229
    },
    {
      "title": "Great Piece of Equipment",
      "text": "Much sturdier than what you will find at Walmart or any of those other store dept stores. The strap stays in the middle so you can concentrate on your form, and not worry about how the strap is tracking on the roller. Loading/unloading your weight plates is easy, too. Works on Olympic and standard plates. I highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Honest Scott",
      "helpful_votes": 2,
      "publication_date": 20161212
    },
    {
      "title": "Perfect for recovery from broken wrist",
      "text": "Works perfect for my use. I bought a couple of 1 pound ankle weights and attached them. But, I only use 1 pound right now as my recovering broken wrist cannot handle more than that right now. Wrist ripper is excellent for this range of motion during recovery.",
      "rating": 5.0,
      "verified": true,
      "author": "Crusader",
      "helpful_votes": 0,
      "publication_date": 20180528
    },
    {
      "title": "Works well",
      "text": "I really like this gripper. It works well and USA made. My only concern is like the others with plastic clip for the weights. It hasn't broken yet though. I also feel like the rubber is to grippy. If I try to go fast or even after doing it for a awhile the rubber burns my hands. Maybe I need to use something on it to soften it up or make it smoother.",
      "rating": 4.0,
      "verified": true,
      "author": "Bryan N.",
      "helpful_votes": 0,
      "publication_date": 20160312
    },
    {
      "title": "BEST FOREARM WORKOUT YOUR GOING TO GET",
      "text": "And because of the loading mechanism you can keep scaling this exercise up in weight. However you really don't need to. I've been using a 10 lb metal plate and it's been absolutely frying my forearms with only a couple rolls up and down. This is a very misleading look exercise, it looks simple but will have your forearms pumped way more than doing any type of fore arm curls. It was expensive, but the product is quality.",
      "rating": 5.0,
      "verified": true,
      "author": "What I Say Goes",
      "helpful_votes": 0,
      "publication_date": 20160909
    },
    {
      "title": "Excellent product!",
      "text": "Excellent product! Arrived fast! I have been using it for 2 weeks and it has worked great. I can definitely feel the difference in my forearms.",
      "rating": 5.0,
      "verified": true,
      "author": "Ruben V Juarez",
      "helpful_votes": 0,
      "publication_date": 20171028
    },
    {
      "title": "Beware Plastic Fatigue",
      "text": "I've used this for five years, using only a ten pound weight. Good ergonomics and nice design, but just noticed a large developing crack in the center. Bad news if it breaks unexpectedly and the weights drop to the floor. After five years of use maybe I shouldn't complain, but I'd be willing to pay more for something made of metal.",
      "rating": 3.0,
      "verified": true,
      "author": "Hernando Fernando",
      "helpful_votes": 0,
      "publication_date": 20200331
    },
    {
      "title": "Good wrist roller that gets the job done",
      "text": "This roller exercises forearms in the conventional motion, and also has the knobs on the ends to get the other axis of movement. Using this does a great job of hitting the wrists. The grips are rubber so there is no slippage, and the strap is adjustable to your height. It should be noted that both the grip bar and plate pin are plastic, but they seem substantial enough to hold up. I am glad I bought this.",
      "rating": 5.0,
      "verified": true,
      "author": "TomG",
      "helpful_votes": 2,
      "publication_date": 20150222
    },
    {
      "title": "Works great, I love how it isolates the wrist and ...",
      "text": "Works great, I love how it isolates the wrist and forearm with a more comfortable motion than traditional wrist curls. This would be 5 stars, but I am concerned to see that it flexes a bit under heavier loads (50 pounds or more). I have opted to reduce weight and increase speed and reps.",
      "rating": 4.0,
      "verified": true,
      "author": "SK",
      "helpful_votes": 3,
      "publication_date": 20160727
    },
    {
      "title": "Excellent quality",
      "text": "Awesome wrist roller, excellent quality, well put together. I've used it vigorously and put it through its paces and still holds up well.",
      "rating": 5.0,
      "verified": true,
      "author": "Killerdudee",
      "helpful_votes": 0,
      "publication_date": 20171005
    },
    {
      "title": "My forearms are getting huge!",
      "text": "I have been using the wristripper for about a month and my forearms have gotten huge! Very sturdy and well made product. Still, it’s plastic and has to be handled gently.",
      "rating": 5.0,
      "verified": true,
      "author": "Santiago",
      "helpful_votes": 0,
      "publication_date": 20180113
    },
    {
      "title": "Best I've seen, time will tell about durability",
      "text": "Works as advertised. I have not used it heavy or for very long, so I cannot speak to the durability. For me, it has worked perfectly and I love that you can reverse your grip and strengthen both ways. I can see why some reviewers said the plastic mechanism at the bottom should be stronger. It has been fine for me, but I'm careful with it because I can imagine it cracking if I threw it around. If you plan to be careful, this is a really great product for a good price.",
      "rating": 4.0,
      "verified": true,
      "author": "Tony Pisani",
      "helpful_votes": 2,
      "publication_date": 20160929
    },
    {
      "title": "My son has complained about his wrists being a weak ...",
      "text": "My son has complained about his wrists being a weak point although the rest of his body is toned and strong. He loves his Wrist Ripper.",
      "rating": 5.0,
      "verified": true,
      "author": "JBee",
      "helpful_votes": 2,
      "publication_date": 20161229
    },
    {
      "title": "Its a great product and works the way that it was design ...",
      "text": "Its a great product and works the way that it was design to work. My only complaint would be thst it was a bit pricey. $30 would be the ideal and happy medium for this product in my humble opinion. I would buy again when in need for another one and with a price reduction.",
      "rating": 5.0,
      "verified": true,
      "author": "lonestar trucker",
      "helpful_votes": 2,
      "publication_date": 20160829
    },
    {
      "title": "Very sturdy",
      "text": "Good quality and very sturdy. I use this for my physical therapy and its very easy to use and you can adjust whatever weight you would like to use. Comfortable grips too.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff Lagios",
      "helpful_votes": 0,
      "publication_date": 20161110
    },
    {
      "title": "Can't wait to rip it up!",
      "text": "Haven't used it yet but I can tell it's very well constructed. Best one I've seen. Can't wait to use it.",
      "rating": 5.0,
      "verified": true,
      "author": "Benjamin",
      "helpful_votes": 2,
      "publication_date": 20170428
    },
    {
      "title": "Great product.",
      "text": "Great quality product. Prior to this I had been using a cut and drilled broomstick with a rope at home, obviously this is a huge upgrade. It seems to be made of quality material and I love the design. The plate holder is made of plastic and it doesn't look real durable, but has been holding up fine so far.",
      "rating": 4.0,
      "verified": true,
      "author": "don",
      "helpful_votes": 0,
      "publication_date": 20160329
    },
    {
      "title": "Love it.",
      "text": "It's strong and durable. I wrap it around a kettlebell rather than using the weight rack it comes with. Good length for the strap which is adjustable so you can even stand up high and get some extra distance. The grips get slippery when I sweat which isn't the best but that's not a huge issue.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20160218
    },
    {
      "title": "Wrist Roller",
      "text": "This is a great wrist roller. Because of the strap it has a very smooth motion. I use it often. The only problem I see is that it is made of plastic and appears not to handle very heavy weight. But all in all a great wrist roller.",
      "rating": 4.0,
      "verified": true,
      "author": "EXERCISE NUT",
      "helpful_votes": 0,
      "publication_date": 20150820
    },
    {
      "title": "Excellent grip. Wrist Wrapper allows you to work the ...",
      "text": "Excellent grip. Wrist Wrapper allows you to work the muscles in your wrist/forearm from all angles. Glad I bought it.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly Hight",
      "helpful_votes": 2,
      "publication_date": 20160929
    },
    {
      "title": "Best wrist roller out there",
      "text": "I've been using this wrist roller for about 3 months now it doesn't hurt the wrist or hands it's a clean steady roll of the wrist and you can do it on the side alsi. Not like the others out there.",
      "rating": 5.0,
      "verified": true,
      "author": "GUYLIATH",
      "helpful_votes": 0,
      "publication_date": 20160624
    },
    {
      "title": "It is both durable and easy to use",
      "text": "This little jewel does exactly what it promises. It is both durable and easy to use. The wide ends allow other possible grips that add variety to the regular palms up and palms down options. It is built to last, and well worth the price!",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas Padgett",
      "helpful_votes": 0,
      "publication_date": 20160517
    },
    {
      "title": "Very Well made.",
      "text": "Very well made. I find it a little pricey but it seams to be made to last. So far it has worked great. The rubber on the handles grips well and the strap that holds the weights is very sturdy.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve",
      "helpful_votes": 0,
      "publication_date": 20160617
    },
    {
      "title": "Worth the investment.",
      "text": "Great product! Simple. Numerous grip options to hit the forearms at every angle. Ships together and ready to use right out of the box. Should last a very long time, worth the investment. No weights included, but you would only need $10-$30 worth of weights for it anyway depending on forearm strength.",
      "rating": 5.0,
      "verified": true,
      "author": "Devin Bates",
      "helpful_votes": 0,
      "publication_date": 20160429
    },
    {
      "title": "Love It",
      "text": "Loves this product... Good feal and good grip.. Nice forearm work out",
      "rating": 5.0,
      "verified": true,
      "author": "Marc",
      "helpful_votes": 0,
      "publication_date": 20170818
    },
    {
      "title": "Pricey, but works well",
      "text": "The Wrist Ripper comprises a very solid plastic bar with rubberized grips, a heavy duty nylon strap, a heavy duty metal clip and a heavy duty plastic plate holder. It works as advertised and should increase your forearm and grip strength. I'm still not sure why it costs twice as much as a DVD player, however.",
      "rating": 4.0,
      "verified": true,
      "author": "J. Scott",
      "helpful_votes": 0,
      "publication_date": 20161002
    },
    {
      "title": "Does the Job",
      "text": "I could have made my own, but purchasing this was more convenient and looks like it will last a long time.",
      "rating": 5.0,
      "verified": true,
      "author": "MARK S.",
      "helpful_votes": 0,
      "publication_date": 20181130
    },
    {
      "title": "Great product!",
      "text": "My son uses this to strengthen his wrist for Hockey. Gets the job done! Great product!",
      "rating": 5.0,
      "verified": true,
      "author": "Km9",
      "helpful_votes": 2,
      "publication_date": 20170129
    },
    {
      "title": "Great product. Well made",
      "text": "Great product. Well made. The Wrist Ripper is so good I use it several times a week for long sessions. I'm seeing positive results after just three weeks.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170628
    },
    {
      "title": "Works well.",
      "text": "Gives a good wrist workout and creates wrist fatigue rather quickly which shows how weak my wrists are. The thing that kept me from giving 5 stars was a 2 inch adapter for use with Olympic plates would have been ideal.",
      "rating": 4.0,
      "verified": true,
      "author": "waldi",
      "helpful_votes": 3,
      "publication_date": 20150221
    },
    {
      "title": "Great product",
      "text": "Excellent product. Solid construction and easy to use. Gives incredible forearm workout . I have had it for two weeks and using it religiously and seeing a big difference in my Forearms. Starting to look like Popeye. Seriously, get this product if you want to develop forearms and wrists.",
      "rating": 5.0,
      "verified": true,
      "author": "Timothy Tribbett",
      "helpful_votes": 2,
      "publication_date": 20150812
    },
    {
      "title": "A Must-Have piece workout equipment",
      "text": "Best workout I could give my wrists and forearm. Easy to use and sturdy.",
      "rating": 5.0,
      "verified": true,
      "author": "tino64inomaha",
      "helpful_votes": 0,
      "publication_date": 20170528
    },
    {
      "title": "Does what it is supposed to do. A bit ...",
      "text": "Does what it is supposed to do. A bit pricey for what it really is, but I wanted something that would just work, and this one does.",
      "rating": 5.0,
      "verified": true,
      "author": "Rick",
      "helpful_votes": 0,
      "publication_date": 20151001
    },
    {
      "title": "Good quality. The clip that hold the weights on ...",
      "text": "Good quality. The clip that hold the weights on seemed like it may be a little weak but so far it has held up and was a very good purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian Norton",
      "helpful_votes": 0,
      "publication_date": 20150729
    },
    {
      "title": "Four Stars",
      "text": "Great product I really like the burn in my forearms",
      "rating": 4.0,
      "verified": true,
      "author": "Ron McDaniel",
      "helpful_votes": 0,
      "publication_date": 20161029
    },
    {
      "title": "Great burn!",
      "text": "Great product! Very comfortable on the habds and easy to grip.",
      "rating": 5.0,
      "verified": true,
      "author": "IceCase88",
      "helpful_votes": 0,
      "publication_date": 20171030
    },
    {
      "title": "Excellent Product",
      "text": "Does great job on forearms and wrists! Excellent product - professional quality. If you perform the exercises correctly, and don't cheat you will get a real \"burn!\"",
      "rating": 5.0,
      "verified": true,
      "author": "Dr.L",
      "helpful_votes": 0,
      "publication_date": 20150815
    },
    {
      "title": "Build Popeye forearms.",
      "text": "Nice piece of equipment. Wide strap stays centered. Comfortable grips. No slop when using standard plates. The side grips are a greatbbonus feature.",
      "rating": 5.0,
      "verified": true,
      "author": "B. Bradley",
      "helpful_votes": 0,
      "publication_date": 20150918
    },
    {
      "title": "This thing works. Other forearm-strengthening tools take a long ...",
      "text": "This thing works. Other forearm-strengthening tools take a long time to make my forearms sore. This thing gets my arms sore fast.",
      "rating": 5.0,
      "verified": true,
      "author": "Missouri Man",
      "helpful_votes": 0,
      "publication_date": 20151020
    },
    {
      "title": "Better than the other rollers as this one keeps the ...",
      "text": "My son loves this. Better than the other rollers as this one keeps the weight in the middle. With the other rollers the weight can shift putting more weight on one side. This one keeps it well balanced.",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony Vargas",
      "helpful_votes": 0,
      "publication_date": 20150329
    },
    {
      "title": "If you're getting it for the end grips, forget it",
      "text": "I got this because I wanted to replace the wood dowel rod I currently use. I liked the feature of being able to grab the ends for an extra exercise that the other products didn't offer. However, the end grips are very uncomfortable to the point where I think it did more harm than good. It actually hurt to use them which is the main reason I got this over other similar products. I ended up returning this which was my first Amazon return ever. The construction seems fine and the main grips aren't too bad (although I'd prefer foam over a thin rubber grip).",
      "rating": 2.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 2,
      "publication_date": 20161104
    },
    {
      "title": "Minimal expense for major results!",
      "text": "This little piece of equipment is fabulous for strengthening your wrists and forearms. Using just a 2 1/2 pound plate I can feel my lower arms working! Affordable and really efficient.",
      "rating": 5.0,
      "verified": true,
      "author": "SGF",
      "helpful_votes": 0,
      "publication_date": 20150324
    },
    {
      "title": "Five Stars",
      "text": "very nice product, well designed and feels like it will hold up for a very long time.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161229
    },
    {
      "title": "This is the best forearm wrist roller I have ever used",
      "text": "This is the best forearm wrist roller I have ever used. I have been lifting weights for over 40 years and currently hold the world record on the gripper machine. I can honestly say it does wonders for forearms and your grip.",
      "rating": 5.0,
      "verified": true,
      "author": "pumppt",
      "helpful_votes": 0,
      "publication_date": 20150925
    },
    {
      "title": "Good piece of equipment...",
      "text": "Well built and easy to use. I enjoy using it and can vary the positions with ease. Glad I bought the Ripper.",
      "rating": 4.0,
      "verified": true,
      "author": "Gregory Horton",
      "helpful_votes": 0,
      "publication_date": 20160829
    },
    {
      "title": "Five Stars",
      "text": "The wrist ripper is a very good piece of equipment it really works your forearms and wrist totally satisfied",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161007
    },
    {
      "title": "Five Stars",
      "text": "Great for baseball players, or any sport requiring strong wrists and forearms.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160929
    },
    {
      "title": "Smart design and reasonably well made",
      "text": "Smart design and reasonably well made. Are there things that could be improved upon? Sure. But it would be splitting hairs. It seems to be the best of its kind and it gets the job done at a fair price.",
      "rating": 5.0,
      "verified": true,
      "author": "adam friedman",
      "helpful_votes": 0,
      "publication_date": 20151229
    },
    {
      "title": "Excellent Product",
      "text": "This is an excellent product. It is very well made and performs exactly as described. The extra end grips are a tremendous addition. With only 5lbs of weight this thing really burns - I love it !",
      "rating": 5.0,
      "verified": true,
      "author": "Michael J. May",
      "helpful_votes": 0,
      "publication_date": 20160129
    },
    {
      "title": "It is sturdy and the handles will never slip the way cheaper ...",
      "text": "The device works perfectly. It is sturdy and the handles will never slip the way cheaper models always do. Excellent product. Well worth the price.",
      "rating": 5.0,
      "verified": true,
      "author": "PanamaJohn",
      "helpful_votes": 2,
      "publication_date": 20150531
    },
    {
      "title": "just what the doctor ordered.",
      "text": "Excellent for wrist workouts. Easy to make adjustments and comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "bobbyaustin2",
      "helpful_votes": 0,
      "publication_date": 20150427
    },
    {
      "title": "It works",
      "text": "It works,not only the wrist but your forearm and upper arm",
      "rating": 5.0,
      "verified": true,
      "author": "Andy Sr",
      "helpful_votes": 0,
      "publication_date": 20170328
    },
    {
      "title": "Five Stars",
      "text": "Works perfectly and seems like it will last for a long time.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul",
      "helpful_votes": 0,
      "publication_date": 20160129
    },
    {
      "title": "Five Stars",
      "text": "This was easy to hang a weight from and easy to ise. Well made.",
      "rating": 5.0,
      "verified": true,
      "author": "Elaine Sommerfeld",
      "helpful_votes": 0,
      "publication_date": 20161129
    },
    {
      "title": "Five Stars",
      "text": "Amazing! I'm glad I spent the extra money to get a quality product.",
      "rating": 5.0,
      "verified": true,
      "author": "Patrick DiGiovanni",
      "helpful_votes": 0,
      "publication_date": 20150821
    },
    {
      "title": "Great product!",
      "text": "Got it for my fiancée, and he loves it. Uses it all the time!",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel",
      "helpful_votes": 0,
      "publication_date": 20160222
    },
    {
      "title": "This is truly a perfect product. It is made extremely well",
      "text": "This is truly a perfect product. It is made extremely well, the weight strap rolls smoothly, the weight pin affords quick interchange of weights, and the grips allow for solid control while rolling the weight up and down. I purchased it in an effort to manage elbow tendinitis as a result of rock climbing (I climb a lot). It has offered an incredible way to strengthen antagonistic climbing muscles in my forearms and I am thankful for the results the wrist ripper provides. I highly recommend the wrist ripper for climbers, tennis players, golfers, and anyone looking for balanced forearm fitness.",
      "rating": 5.0,
      "verified": true,
      "author": "Erika K. Trout",
      "helpful_votes": 5,
      "publication_date": 20160303
    },
    {
      "title": "Great product",
      "text": "Best forearm exercise you can do. This product is made of quality, no foam padded grips that will wear off in just a few uses",
      "rating": 5.0,
      "verified": true,
      "author": "Rob Q",
      "helpful_votes": 0,
      "publication_date": 20160129
    },
    {
      "title": "Five Stars",
      "text": "Very sturdy and well designed. Works great and would recommend highly",
      "rating": 5.0,
      "verified": true,
      "author": "Brian Arscott",
      "helpful_votes": 0,
      "publication_date": 20160226
    },
    {
      "title": "so good. This gives my forearms a pretty good workout",
      "text": "So far, so good. This gives my forearms a pretty good workout.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Lyons",
      "helpful_votes": 0,
      "publication_date": 20150725
    },
    {
      "title": "A great, high quality wrist and forearm developer.",
      "text": "High quality construction. Grips are comfortable and non-slip. Really works the wrists and forearms. Very satisfied with device and results.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark H.",
      "helpful_votes": 0,
      "publication_date": 20160430
    },
    {
      "title": "The quality of materials is not good and the grip is not comfortable",
      "text": "Not worth the money at all. The quality of materials is not great and the grip is not comfortable and the material actually makes it harder (not in the good kind of way) to properly perform the exercise. The one upside is that it allows you to do the side roll which most wrist rollers do not. However the grip on this is also poorly designed. This product could be immensely better if they added a different grip. Something that doesn't literally make your skin stick too it",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170522
    },
    {
      "title": "Smashed toe",
      "text": "Worked well till the latch failed. It has a cheap latch that is only held closed by tension, some how during use the part under tension shifted to one side and off the post, releasing the weight and at the top of a rep it slipped off and I dropped 20 lbs on my big toe. You should expect better quality for $50 but there aren't many option for this type of equipment. Look for one made of metal with a locking carabiner or replace it yourself. I would gladly pay those $10 to avoid a week of limping.",
      "rating": 1.0,
      "verified": true,
      "author": "Jorge C.",
      "helpful_votes": 16,
      "publication_date": 20161127
    },
    {
      "title": "Great product and well built",
      "text": "Great product and well built. I really liked the ability to grip on the inside or outside to work my forearms in two different ways.",
      "rating": 5.0,
      "verified": true,
      "author": "kyle",
      "helpful_votes": 5,
      "publication_date": 20140928
    },
    {
      "title": "It was great before it broke.",
      "text": "I would have rated this 5 stars if it weren't for the fact that the metal buckle that secures the strap to the handle broke apart. I was only using a 25 lbs plate when one of the loops of the metal buckle suddenly broke apart from the tension of the weight. It looks like it can easily be replaced with a little ingenuity and probably a trip to Home Depot, but still, I expected better quality than this. I've had this for a few months now, but have only been using it regularly in the last two months. I'm really disappointed about this because it was such a great product before it broke.",
      "rating": 3.0,
      "verified": true,
      "author": "Erwin G.",
      "helpful_votes": 17,
      "publication_date": 20160402
    },
    {
      "title": "Effective for wrist and forearm development.",
      "text": "I enjoy the Wrist Ripper very much. It's very effective at working the forearm and wrist. I like the burn it gives me. Instead of going by reps, I usually go by time. I believe the forearm muscles are best suited for endurance, with a lot of reps instead of heavier weights with low reps. Although, it's always good to switch up your routine. Personally, I prefer the pump I get with using a lot of reps. Sometimes I use the wrist roller right after I finish doing reverse curls, this adds to the burn and the pump. I'm satisfied with this product.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Kivlehen",
      "helpful_votes": 4,
      "publication_date": 20140929
    },
    {
      "title": "It broke",
      "text": "I liked it when I got it, but after 2 months use it started to creak. In the 3rd month it broke in half. The plastic is not strong enough for even moderate weight. I contacted the company to see if they will replace it. For $50 I hope the warranty will be at least 90 days.",
      "rating": 2.0,
      "verified": true,
      "author": "Mr Holt",
      "helpful_votes": 0,
      "publication_date": 20180614
    },
    {
      "title": "Just what I hoped for.",
      "text": "Just what I was looking for to strengthen my wrists and grip. The design and construction meet my needs perfectly. I take it along when I travel, and improvement was seen in just a few weeks.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas W. Cummins",
      "helpful_votes": 0,
      "publication_date": 20150815
    },
    {
      "title": "One Star",
      "text": "Does not hold much weight without the rope coming off. Broke completely after a couple months.",
      "rating": 1.0,
      "verified": true,
      "author": "Eric",
      "helpful_votes": 3,
      "publication_date": 20180107
    },
    {
      "title": "Look elsewhere....",
      "text": "My recommendation is to look elsewhere... any product that uses plastic in a weight bearing position (pin that holds all of the weight is plastic) is not a serious product. For the money, this should have all been steel.",
      "rating": 1.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 5,
      "publication_date": 20170424
    },
    {
      "title": "Easy to use",
      "text": "Well built. Easy to use. Fast results. I thought it was a bit pricey but once I received I had no second thoughts. Great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Alex R",
      "helpful_votes": 0,
      "publication_date": 20160829
    },
    {
      "title": "It would be better if they made it with a different material",
      "text": "The rubber on the handle is too sticky. It would be better if they made it with a different material.",
      "rating": 2.0,
      "verified": true,
      "author": "Christopher Sugano",
      "helpful_votes": 0,
      "publication_date": 20160507
    },
    {
      "title": "don't like it and have stopped",
      "text": "Used it a few times, don't like it and have stopped. And I'm a 30 year long avid body builder.",
      "rating": 2.0,
      "verified": true,
      "author": "Tom Murphy",
      "helpful_votes": 0,
      "publication_date": 20180412
    },
    {
      "title": "What a crafty marketing plan and serious disappointment and surprise of no weight plates w purchase",
      "text": "What a crafty marketing plan and serious disappointment and surprise of no weight plates w purchase.... especially at that mercenary price! I am returning this piece of junk...regrettably",
      "rating": 1.0,
      "verified": true,
      "author": "Jesse Hatton",
      "helpful_votes": 2,
      "publication_date": 20150414
    }
  ],
  "product_meta": {
    "title": "WristRipper - The Ultimate Wrist Roller/Wrist and Forearm Exerciser",
    "description": "The WristRipper is a wrist roller exercise device that puts a new twist on one of the oldest and most effective ways to strengthen your hands, wrists and forearms - the wrist roller. In just minutes a day, you can improve your wrist and forearm strength. The forearm muscles are the key to wrist and grip strength which is why this product is used by golfers, baseball players, hockey players, tennis players, body builders and rock climbers. This product will help improve performance for any activity that requires grip strength and the use of your hands and wrists. Simply roll the weight up and down as many times as you can to exercise and strengthen your hands, wrists and forearms. Depending on how strong you are, it is recommend to start with 2.5lbs or 5lbs and add additional weight as you get stronger. This product allows for multiple gripping options. You can grip the handle or outer knobs to work different ranges of motion to get a complete forearm workout. Weight plates are not included with the product and can be purchased at Amazon.com, local sporting good stores or other online retailers. The weight-loading pin is compatible with 1\" standard; and 2\" olympic weight plates. Maximum recommended weight is 10lbs.",
    "rating": 4.1,
    "feature_bullets": [
      "The Wrist Ripper is a wrist roller exercise product that puts a new twist on one of the oldest and most effective ways to strengthen the hands, wrists and forearms. The WristRipper has many added improvements over homemade and other wrist roller products on the market.",
      "#1 Strong injection molded handle provides multiple gripping options to work different ranges of motion for a complete forearm workout. #2 Rubber gripping areas help reduce slipping. #3 Heavy duty adjustable webbing strap and center guides keeps strap in the middle for proper balance. #4 Weight loading pin makes it easy to load/unload weights and is compatible with 1\" and 2\" weight plates.",
      "This product will quickly improve your performance in any activity that requires grip strength and the use of your hands and wrists. Golfers, baseball players and body builders love this product!",
      "WEIGHT PLATES ARE NOT INCLUDED WITH THIS PRODUCT AND ARE SOLD SEPARATELY. Maximum recommended weight is 10lbs.",
      "The Wrist Ripper is MADE IN THE USA!"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "19.02 x 4.49 x 2.99 inches; 1.39 Pounds",
      "Date First Available": "February 27, 2014",
      "Manufacturer": "WristRipper Inc.",
      "ASIN": "B00IOCS3G4",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Strength Training Equipment",
      "Exercise & Fitness",
      "Sports & Outdoors",
      "Sports & Fitness",
      "Wrist Weights"
    ],
    "price": ""
  }
}