{
  "website_summaries": [
    {
      "verdict": "If you need a smooth, creamy, and delicious peanut butter, Jif delivers.",
      "pros": [
        "Tasty and smooth",
        "Not gritty like some other brands",
        "Also comes in extra-crunchy",
        "Kosher",
        "Has just a hint of molasses for taste",
        "Arrives quickly",
        "Cooks well in baked goods"
      ],
      "cons": [
        "May be a little too sweet for some palates"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Jar Arrived with Lid Off",
      "text": "I love this product, but the jar arrived with the lid popped off, and at this point there's almost no recourse other than throwing the product away. Amazon says it's \"not eligible for return\" and I don't want to use it after it sat in the box with no lid on for two days. I bought this because the price was so much better than what you see in the grocery store, but it's not worth it if it's going to arrive damaged and Amazon provides no way of rectifying the situation.",
      "rating": 1.0,
      "verified": true,
      "author": "RJHuf",
      "helpful_votes": 15,
      "publication_date": 20190819
    },
    {
      "title": "Had dead bugs in it.",
      "text": "I’m a peanut butter fanatic, and Jiff is my favorite. I This was my first Prime Pantry order. My Jiff had dead bugs in it. I eat it straight from the jar. I scooped out a teaspoon and ate it. I felt something in my mouth; I spit it out and found dead bug carcass. Uggg. I threw the jar away.",
      "rating": 1.0,
      "verified": true,
      "author": "Anita B",
      "helpful_votes": 21,
      "publication_date": 20180421
    },
    {
      "title": "My go to peanut butter!",
      "text": "Texture is creamy and smoothie. Great for dipping pretzels, cookies, celery, or just making lunch sandwiches for the kids. Goes great on toast, crackers, and all other snacks. Although we use a lot of peanut butter in our house over time, the 40oz jar is massive and will last us a long time. Great consistency, flavor, and shelf life. Probably not very healthy with the added sugar, but a good substitute over other \"snacks\". If you found my review helpful, please vote below so I can improve my future reviews for people like you. Thanks.",
      "rating": 4.0,
      "verified": true,
      "author": "Jor El",
      "helpful_votes": 7,
      "publication_date": 20200224
    },
    {
      "title": "Back to the best!",
      "text": "Being both vegan and health conscious for decades, I tried all the natural peanut butters out there. They are all the same ~ 2 inches of oil on top and 2 inches of cement on the bottom, no matter how well you try and stir them up. Plus, the taste is dreadful and the consistency ruins most recipes. I decided to go back to my childhood favorite. I forgot just how good it is. It's Jif for me, from now on.",
      "rating": 5.0,
      "verified": true,
      "author": "giabella",
      "helpful_votes": 7,
      "publication_date": 20200312
    },
    {
      "title": "Smooth and creamy",
      "text": "Jif is our favorite peanut butter. My kids prefer smooth and I prefer crunchy. With the coronavirus outbreak, it has been difficult to find Jif in stores. It was nice to find both smooth and crunchy available on Amazon at a good price. Jif Creamy peanut butter is smooth and tasty. The jar I received has an expiration date of almost 2 years out. Although I do not have a Pantry membership, by placing a $35 order of Pantry products, I received free shipping.",
      "rating": 5.0,
      "verified": true,
      "author": "Connie P",
      "helpful_votes": 4,
      "publication_date": 20200603
    },
    {
      "title": "This is a prohibited product by the FDC and cannot be sold in the US since June 18, 2018",
      "text": "This product is dangerous because it was made with hydrogenated oils which are quite capable of affecting your circulatory system in many ways. We Americans already have the highest rate of coronary disease in the World and this product makes it worse. Now Bezos does not allow a return, well Jeff we just might get a divorce over this issue. Jeff must not allow your vendors to sell products that can cause harm, Henry Henry",
      "rating": 1.0,
      "verified": true,
      "author": "Julius Caesar",
      "helpful_votes": 2,
      "publication_date": 20200526
    },
    {
      "title": "Peanut butter, a food group",
      "text": "Creamy, crunchy, matters not to me. I am a Jif aholic. I eat tons of peanut butter, it is probably my favorite food in the whole world, in fact I think it should be a food group. I know this isn't the healthier \"natural\" peanut butter but it is soo much easier to eat that I'm willing to sacrifice. And I love the taste of Jif and how nice and smooth and creamy it is!",
      "rating": 5.0,
      "verified": true,
      "author": "whosaysidontcook",
      "helpful_votes": 8,
      "publication_date": 20160621
    },
    {
      "title": "Superior Flavor",
      "text": "This peanut butter blows Skippy out of the water with its barely perceptible yet game-changing hint of molasses. We don't buy any other peanut butter now that we have tried the superior flavor and thick smooth consistency of Jif. Plus, it's made with real peanuts. Just writing this review is making me crave a PB&J.",
      "rating": 5.0,
      "verified": true,
      "author": "Jordan",
      "helpful_votes": 3,
      "publication_date": 20171208
    },
    {
      "title": "Not sure about sheerness but I love this stuff.",
      "text": "I did not rate sheerness because I was not sure how that applied to the product. I used to use only the crunchy stuff but as age caught up with me I had to switch to creamy due to dentures. LOL I ONLY buy Jif (unless in an alternate universe, then I buy Jiffy) and this is a great price for the product. Forgive the humor, I highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Grateful Zugore",
      "helpful_votes": 0,
      "publication_date": 20200915
    },
    {
      "title": "Price gouging due to covid 19",
      "text": "I feel these were price gouged due to covid 19 when I bought them. I’ve never paid so much for Jif Peanut Butter ever. And it arrived melted with the oil in a pile at the top of the jar. Very disappointed!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200426
    },
    {
      "title": "Really great peanut butter!",
      "text": "After using another brand since I was a kid, I gave Jif a try out of pure curiosity. I really figured there would be no difference. Peanut butter is peanut butter, right? Wrong! This is the best peanut butter ever. The texture is melt in your mouth, the flavor is like fresh peanuts -- it's divine. Try it on celery, apple slices, rice cakes or right out of the jar, you will absolutely fall in love with this brand of peanut butter. Delivery from Amazon is so much better than lugging it home. Great purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "J. Arena",
      "helpful_votes": 5,
      "publication_date": 20150911
    },
    {
      "title": "Nice Big Peanut Butter!",
      "text": "My son loves this peanut butter. This is a huge container. This is a great value, delivered right to my door! I am a pedestrian who has to walk my groceries home. This is really nice to be able to have some staples just delivered right to my door, and then I just buy the fresh stuff and carry it home.",
      "rating": 5.0,
      "verified": true,
      "author": "islander",
      "helpful_votes": 4,
      "publication_date": 20161003
    },
    {
      "title": "Large size has a different flavor",
      "text": "I got this size thinking it will save me a trip to the store too often. It worked, but the flavor is different than the smaller bottles. I'm not sure why that is. This one is more oily which separates from the spread and the flavor is a bit off. I'm still not sure if I will get this size again or stick to the smaller ones",
      "rating": 3.0,
      "verified": true,
      "author": "Arby186",
      "helpful_votes": 0,
      "publication_date": 20200819
    },
    {
      "title": "Tastes great!",
      "text": "My family has always preferred the flavor and consistency of Jif. It is smooth and creamy. It spreads easily. It smells and tastes great!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Good",
      "text": "Good Yum Yum LOL How do you write a review on Jif Creamy Peanut Butter? Everybody in the country knows it cant be beat.",
      "rating": 5.0,
      "verified": true,
      "author": "Ronp30014",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "Poor packaging",
      "text": "I have it a lower rating due to the packaging. Very poorly packaged for delivery. The box was half open, smashed and there was so padding in the box. Peanut better was otherwise ok.",
      "rating": 3.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200423
    },
    {
      "title": "Great value, excellent product.",
      "text": "I have always liked if peanut butter especially the creamy kind. It makes for a good late-night snack and the protein did I don't get in other Foods I get with peanut butter.",
      "rating": 5.0,
      "verified": true,
      "author": "LADYBUG",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "Still A Family Go-To",
      "text": "Remains as a go-to snack on celery stalks as well as for PB&J picks.",
      "rating": 5.0,
      "verified": true,
      "author": "CynMA",
      "helpful_votes": 0,
      "publication_date": 20200202
    },
    {
      "title": "Jif, the best peanut butter",
      "text": "over the years I have tried different brands of peanut butter, even to making my own and I always return to Jif. which is saying a lot as I use to like Skippy before they changed something. Its all about taste and Jif is where it is.",
      "rating": 5.0,
      "verified": true,
      "author": "Rhyanna DeTuathana",
      "helpful_votes": 0,
      "publication_date": 20190424
    },
    {
      "title": "Jif is the best & price can’t be beat!",
      "text": "Love Jif & use nothing but to make peanut butter fudge I sell in my gift shop. I was thrilled to find this at such a great price. Shipping dept, however, needs to be more careful when packing this product. I ordered two 2-packs & two jars were smashed. There was nothing to protect the jars inside the box.",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara Edwards",
      "helpful_votes": 0,
      "publication_date": 20180811
    },
    {
      "title": "NOM NOM NOM",
      "text": "it's peanut butter, if you don't love it, you're probably some underevolved creature that will die if you come in contact with this delicious spread of the gods.",
      "rating": 5.0,
      "verified": true,
      "author": "Landon Wisely",
      "helpful_votes": 0,
      "publication_date": 20170609
    },
    {
      "title": "my favorite peanut butter for years",
      "text": "my favorite peanut butter for years. those who eat \"natural\" peanut butter might say i like it because it is sweet, but it's alright with me. i don't think anyone ever got fat from eating only peanut butter.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael H. Childress",
      "helpful_votes": 2,
      "publication_date": 20170612
    },
    {
      "title": "Great deal on a large size of Jif",
      "text": "My Jif was very fresh and was the real thing; delicious and creamy with no off flavors. The price and packaging for shipping were outstanding from Amazon Pantry. I’m very satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "Enchilada Lover",
      "helpful_votes": 0,
      "publication_date": 20200604
    },
    {
      "title": "Kow what happened to my order on 8 18 20",
      "text": "there was no label of it was for No name mothing so in their confusion they gave it to a neighbor. because of that I was and still am without food.",
      "rating": 2.0,
      "verified": true,
      "author": "M William Roth",
      "helpful_votes": 0,
      "publication_date": 20200904
    },
    {
      "title": "and so it is the perfect addition for my lifestyle",
      "text": "I know the commercial say that choosy moms choose Jif, but I'm not a very choosy mom. That being said, this is the only peanut butter I will use. It is creamy and delicious and my little one actually eats it. Peanut butter is full of healthy fats when eaten in moderation, and so it is the perfect addition for my lifestyle.",
      "rating": 5.0,
      "verified": true,
      "author": "Erin G",
      "helpful_votes": 0,
      "publication_date": 20160321
    },
    {
      "title": "Jif is our favorite peanut butter!",
      "text": "It’s wonderful peanut butter. It’s the only kind my Son has eaten since he was born & he is 13. I take advantage of Prime Pantry so the value is even better.",
      "rating": 5.0,
      "verified": true,
      "author": "meshelle ",
      "helpful_votes": 0,
      "publication_date": 20190727
    },
    {
      "title": "Great",
      "text": "If I was still baking cookies I would use this kind of peanut butter - but instead I eat a tablespoon of this product when I need to add a fat to lunch or dinner - it's such a treat~",
      "rating": 5.0,
      "verified": true,
      "author": "Boots",
      "helpful_votes": 0,
      "publication_date": 20170710
    },
    {
      "title": "Best peanut butter",
      "text": "My favorite peanut butter! Have used it for years. On apples, cucumber slices, toast, crackers, you name it. Great peanut flavor. Good price on Amazon.",
      "rating": 5.0,
      "verified": true,
      "author": "Katee",
      "helpful_votes": 0,
      "publication_date": 20190726
    },
    {
      "title": "Recommended",
      "text": "Good expiry date, would recommend. It was also fresh. Only downside was that one of the bottles arrived broken, but Amazon refunded me without any problem.",
      "rating": 5.0,
      "verified": true,
      "author": "Sandra",
      "helpful_votes": 0,
      "publication_date": 20200726
    },
    {
      "title": "Good value/product.",
      "text": "Arrived on time in great condition. Good product for long term storage and an excellent source of protein (seven gems per serving).",
      "rating": 5.0,
      "verified": true,
      "author": "CHAZ in Olympia WA",
      "helpful_votes": 0,
      "publication_date": 20200326
    },
    {
      "title": "Jif Creamy Peanut Butter 48oz",
      "text": "It's really good with Jif peanut butter & Smuckers strawberry jam, or I sometimes just eat it right out of jar, \" YUMMY \" Thank You",
      "rating": 5.0,
      "verified": true,
      "author": "Karl  Petrush",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "CAUTION PLEASE READ",
      "text": "Product may contain peanuts. If you are allergic to peanuts and are even looking at this product. Please have seconds.",
      "rating": 5.0,
      "verified": true,
      "author": "OBX Dreamin'",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "Choosy DADS choose JIF too  :o)",
      "text": "I have been a fan of JIF since I was little and had the displeasure of getting whatever PB was on sale at the time. Every once in awhile the rotation would land on JIF and it would be a month of bliss. Fast forward to adulthood and now it is all I buy. My preference is for the creamy but the extra chunky is good too if you like the crunch. Great value compared to prices at local grocery store as well so a win-win for me.",
      "rating": 5.0,
      "verified": true,
      "author": "BMUR",
      "helpful_votes": 0,
      "publication_date": 20150401
    },
    {
      "title": "Best on the market",
      "text": "Always been my favorite and no reason to change brands.",
      "rating": 5.0,
      "verified": true,
      "author": "E Annette Leding",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Cannot go wrong with Jiffy’s",
      "text": "The very best around! Stays by my bed oops better buy another for the kitchen just for guests. Lol",
      "rating": 5.0,
      "verified": true,
      "author": "Raquel Strait",
      "helpful_votes": 0,
      "publication_date": 20200821
    },
    {
      "title": "Best peanut butter money can buy!",
      "text": "As a peanut butter-aholic, I loved having it delivered right to my door. It arrived in a timely manner without incident. In my opinion, JIF is the best brand of peanut butter that money can buy. I am definetly going to be a regular customer for this item!",
      "rating": 5.0,
      "verified": true,
      "author": "CMC",
      "helpful_votes": 0,
      "publication_date": 20161103
    },
    {
      "title": "Oily Flavor",
      "text": "It was a good price, but I really don't like the flavor compared to natural peanut butter (especially the unnecessary added oils) aside from the sugar being unhealthy",
      "rating": 2.0,
      "verified": true,
      "author": "Jason Melo Hall",
      "helpful_votes": 0,
      "publication_date": 20180728
    },
    {
      "title": "Jif is for choosy Mothers or Dads",
      "text": "I'm a Jif fan since I was a kid... good price, just wish they'd get it back in stock again soon.",
      "rating": 5.0,
      "verified": true,
      "author": "Greg Smith",
      "helpful_votes": 0,
      "publication_date": 20200421
    },
    {
      "title": "I'll buy Jif over Peanut Butter that's made in front of me from peanuts.",
      "text": "I've always loved Jif Peanut Butter way better than any other brand, even if you make the peanut butter right in front of me. I buy Jif.",
      "rating": 5.0,
      "verified": true,
      "author": "Vicki from Florida",
      "helpful_votes": 0,
      "publication_date": 20180111
    },
    {
      "title": "Great product",
      "text": "I shipped this to a friend during quarantine bc she couldn’t find it for her son....",
      "rating": 5.0,
      "verified": true,
      "author": "Dllynchmob",
      "helpful_votes": 0,
      "publication_date": 20200502
    },
    {
      "title": "Best way for a PB&J FREEK",
      "text": "OMG, OMG I love this stuff and in my 70's This is the super Jumbo size I like. Yea you may get some on your fingers as you trry to reach the bottom but those small jars just go too fast.",
      "rating": 5.0,
      "verified": true,
      "author": "Heartland IndianaTop Contributor: Photography",
      "helpful_votes": 0,
      "publication_date": 20170318
    },
    {
      "title": "and we all like it!",
      "text": "My Daughter loves this peanut butter. We are originally Canadian, and, food for thought, (most Canadian prefer crunchy); however, my Daughter has been in the U.S., since she was 2 years old, and, developed a taste for smooth peanut butter. Well I tried it too, and, other members of the family, and, noticed the incredible taste of this peanut butter, and we all like it!",
      "rating": 5.0,
      "verified": true,
      "author": "Sherry",
      "helpful_votes": 0,
      "publication_date": 20160215
    },
    {
      "title": "Looks like I will be baking a lot of cookies",
      "text": "You can't go wrong with this Jif. I haven;t started on it and the jar is at least 2 times the regular size from the store and the price is so cheap. Looks like I will be baking a lot of cookies.",
      "rating": 5.0,
      "verified": true,
      "author": "jpkantqs",
      "helpful_votes": 0,
      "publication_date": 20180511
    },
    {
      "title": "Awesome purchase! Giant jar!",
      "text": "I will continue to buy all my peanut butter from Amazon. It's always fresh and half the price",
      "rating": 5.0,
      "verified": true,
      "author": "WVHomegirl",
      "helpful_votes": 0,
      "publication_date": 20200622
    },
    {
      "title": "My pick for the best peanut butter.",
      "text": "I guess I'm just a kid at heart. This peanut butter couldn't be better in anyway. Makes awesome PB & J .",
      "rating": 5.0,
      "verified": true,
      "author": "bridget",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "Great value and perfect for sending a care package to ...",
      "text": "Great value and perfect for sending a care package to my daughter who recently moved out of state. It was no more expensive to have it shipped to her than buy in the store. Amazon is unbelievable.",
      "rating": 5.0,
      "verified": true,
      "author": "Ross Loblein",
      "helpful_votes": 2,
      "publication_date": 20161001
    },
    {
      "title": "Old fashioned white bread peanut butter and jelly. Not recommend nutrionally.",
      "text": "Old fashioned white bread peanut butter and jelly. Not recommend nutrionally.",
      "rating": 5.0,
      "verified": true,
      "author": "highlandhoh3",
      "helpful_votes": 0,
      "publication_date": 20200729
    },
    {
      "title": "Good",
      "text": "This product is tasty and delicious it was exactly what I expected",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190626
    },
    {
      "title": "Great Purchase",
      "text": "Excellent value for the money. Jif is our go to peanut butter.",
      "rating": 5.0,
      "verified": true,
      "author": "Maxx0026",
      "helpful_votes": 0,
      "publication_date": 20200422
    },
    {
      "title": "For sandwiches are amoothies, this hits the spot!",
      "text": "Love my Peanut butter and Grape jelly sandwiches with soup on a cold day! Jig tastes like it always has, a little taste from my childhood days. Smooth and creamy it spreads well. And for the days I need to be an adult, a tablespoon in my smoothies provides a kick of protein. Yum!",
      "rating": 5.0,
      "verified": true,
      "author": "Riggszoo",
      "helpful_votes": 0,
      "publication_date": 20160108
    },
    {
      "title": "Yummy!",
      "text": "I LOVE Jiffy peanut butter, and I'm grateful that hese jars came fresh, delicious and perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "oldEnglishtchr",
      "helpful_votes": 0,
      "publication_date": 20201013
    },
    {
      "title": "Yummy",
      "text": "Love this jar of creamy Peanut Butter... great on saltines",
      "rating": 5.0,
      "verified": true,
      "author": "jane",
      "helpful_votes": 0,
      "publication_date": 20200207
    },
    {
      "title": "JIF",
      "text": "IF YOU LOVE PEANUT BUTTER AND JELLEY YOU WANT TO HAVE THIS",
      "rating": 5.0,
      "verified": true,
      "author": "ralph",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Fine, but nothing special",
      "text": "Very average peanut butter. Not the worst, not the best.",
      "rating": 3.0,
      "verified": true,
      "author": "ThatOneGuy",
      "helpful_votes": 0,
      "publication_date": 20200827
    },
    {
      "title": "Nice size container great for a family of six that love peanut butter",
      "text": "Nice size container great for a family of six that love peanut butter",
      "rating": 5.0,
      "verified": true,
      "author": "Jen Matlock",
      "helpful_votes": 0,
      "publication_date": 20200628
    },
    {
      "title": "the best",
      "text": "it's not sweet, it tastes like peanuts, which is all I want in Peanut Butter",
      "rating": 5.0,
      "verified": true,
      "author": "Janis L. Lang",
      "helpful_votes": 0,
      "publication_date": 20200524
    },
    {
      "title": "Lots of Peanut Butter",
      "text": "If you are need of a lot of peanut butter, then this is a good buy. As for the taste, it's more sweet than Open Nature Natural Peanut Butter, which has more of an actual peanut taste. Plus, I couldn't find a large tub of that brand. If you need a regular amount of peanut butter, though, then go for less than 40 oz., since you don't want to throw away half of your purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Reviewer K",
      "helpful_votes": 0,
      "publication_date": 20150107
    },
    {
      "title": "my husband loves it so much i have to buy lots of jars.",
      "text": "this must be the best peanut butter on earth because my husband is eating a jar a week. his fave sandwich is peanut butter and miracle whip. i know.... ew. he's been so happy since i've been buying this regularly for him. thanks for a good product. we had stopped buying peanut butter for years after he got the salmonella from peter pan. your product has renewed our trust in peanut butter. thanks",
      "rating": 5.0,
      "verified": true,
      "author": "throat puncherTop Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20150103
    },
    {
      "title": "Choosy",
      "text": "I don't eat as much peanut butter as I did as a kid, but when I do, I only like JIF. It is smooth, tastes good and doesn't contain xylitol. This is also great for making peanut butter cookies. I guess it's okay for dogs & birds too, but I would rather use Trader Joes plain unsalted/unsweetened peanut butter for feeding any kind of critter. Save​ the really good stuff for yourself.",
      "rating": 5.0,
      "verified": true,
      "author": "Charlemagne 🐇Top Contributor: Cooking",
      "helpful_votes": 0,
      "publication_date": 20160125
    },
    {
      "title": "Great peanutbutter!",
      "text": "Jif peanutbutter, my favorite! Now I can have protein for lunch. Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara Yannotti",
      "helpful_votes": 0,
      "publication_date": 20200612
    },
    {
      "title": "Starting to like Jif better then Skippy",
      "text": "Its a very unique task to write a product review on a foodstuff item. When purchasing grocery items our family already knows what we want and what we like to buy. So a pantry box will be filled with products that we buy on a regular basis. This product is no different. High quality product, great taste and a constant staple at our house.",
      "rating": 5.0,
      "verified": true,
      "author": "JJ Wifey",
      "helpful_votes": 0,
      "publication_date": 20151116
    },
    {
      "title": "Delicious and available through Amazon Pantry!",
      "text": "Jif peanut butter is delicious. I bought this through Amazon Pantry so that I could get it delivered to my office and keep on hand for use in a quick afternoon snack.",
      "rating": 5.0,
      "verified": true,
      "author": "frankfromnj",
      "helpful_votes": 0,
      "publication_date": 20180601
    },
    {
      "title": "Great price and flavor",
      "text": "My go to peanut butter. Great flavor and great price on Amazon.",
      "rating": 5.0,
      "verified": true,
      "author": "Beadwabbit",
      "helpful_votes": 0,
      "publication_date": 20191221
    },
    {
      "title": "Jif—it’s tastes good and is easy to spread. No mess unless you’re a clutz.",
      "text": "I love peanut butter. Jig is really creamy and smooth and is delicious.",
      "rating": 5.0,
      "verified": true,
      "author": "Irene",
      "helpful_votes": 0,
      "publication_date": 20200607
    },
    {
      "title": "Peanut butter goodness",
      "text": "Great value for your money have this on hand for some snacks",
      "rating": 5.0,
      "verified": true,
      "author": "Missmary1899",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "Order groceries on line",
      "text": "I have several items that are handy to order on line. Works for me",
      "rating": 5.0,
      "verified": true,
      "author": "grammalynn",
      "helpful_votes": 0,
      "publication_date": 20190801
    },
    {
      "title": "Super creamy and absolutley the very best brand on the market!",
      "text": "Don't waste your money on the smaller jars....perfect with celery for snacks or the usual PB & J......super creamy!",
      "rating": 5.0,
      "verified": true,
      "author": "Kavrox",
      "helpful_votes": 0,
      "publication_date": 20180826
    },
    {
      "title": "I've tried them all and still come back to Jiff.",
      "text": "What can I say? I love peanut butter and this is the best tasting one out there. I've tried them all and still come back to Jiff.",
      "rating": 5.0,
      "verified": true,
      "author": "Billieg",
      "helpful_votes": 0,
      "publication_date": 20170810
    },
    {
      "title": "Excellent",
      "text": "Choosy mothers choose Jif; I'm not a mother. But I love celery with peanut butter. Jif is the best!",
      "rating": 5.0,
      "verified": true,
      "author": "Dr. Lu",
      "helpful_votes": 0,
      "publication_date": 20181210
    },
    {
      "title": "yummy",
      "text": "the is my favorite peanut butter and i love the taste. i liked getting a large quanity at a fair price. The consistancy of the peanut butter was not what i'm used to from this brand. it was softer than it normally is. I don't know if it had set on the seller sheves too long or if it froze somewhere in the shipping process. May not use this seller again.",
      "rating": 4.0,
      "verified": true,
      "author": "nita s",
      "helpful_votes": 0,
      "publication_date": 20140219
    },
    {
      "title": "perfect for cookies",
      "text": "I use this Peanut butter for three ingredient Peanut butter cookies and it is perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Colene Cobb",
      "helpful_votes": 0,
      "publication_date": 20181107
    },
    {
      "title": "Great value",
      "text": "Was just what I ordered. Granddaughter was happy with it",
      "rating": 5.0,
      "verified": true,
      "author": "Lynda",
      "helpful_votes": 0,
      "publication_date": 20200713
    },
    {
      "title": "they're both good to me",
      "text": "Gotta say, Jiff, Sunny Jim, they're both good to me. But have never had a problem with this Jif product.",
      "rating": 4.0,
      "verified": true,
      "author": "ConnieMac 117",
      "helpful_votes": 0,
      "publication_date": 20180726
    },
    {
      "title": "My Favorite",
      "text": "Jif Creamy Peanut Butter is my all time favorite. I grew up eating Skippy, but Jif is much better tasting IMO. Everyone has different tastes in foods, but if you haven’t tried Jif, you might be missing out.",
      "rating": 5.0,
      "verified": true,
      "author": "BillyBulb",
      "helpful_votes": 0,
      "publication_date": 20180530
    },
    {
      "title": "Tastes good, makes your dog do funny things when you ...",
      "text": "It's peanut butter. Tastes good, makes your dog do funny things when you smear it on the roof of his mouth. How many other foods both nourish and entertain?",
      "rating": 4.0,
      "verified": true,
      "author": "Mike Knapp",
      "helpful_votes": 0,
      "publication_date": 20180319
    },
    {
      "title": "The perfect snack food",
      "text": "The world's most perfect snack food...peanut butter. It goes with almost anything, it is a healthy choice, and the taste is loved by virtually everyone",
      "rating": 5.0,
      "verified": true,
      "author": "Old Sparkie",
      "helpful_votes": 0,
      "publication_date": 20161217
    },
    {
      "title": "Jiff the best.",
      "text": "Used to only buy skippy but now jiff is better.",
      "rating": 5.0,
      "verified": true,
      "author": "Tinley titen",
      "helpful_votes": 0,
      "publication_date": 20191224
    },
    {
      "title": "Love them",
      "text": "This is the only way to Jif peanut butter way way cheaper than any store",
      "rating": 5.0,
      "verified": true,
      "author": "Karen Willcoxson",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Peanut butter sandwiches",
      "text": "We use lots of peanut butter in my House . A anytime snack, and a quick bite to eat with jelly when in a hurry. brenda bay",
      "rating": 4.0,
      "verified": true,
      "author": "brenda bay",
      "helpful_votes": 0,
      "publication_date": 20200229
    },
    {
      "title": "What are awesome deal on a 40 ounce jar of Jeff creamy peanut butter.",
      "text": "What are awesome deal on a 40 ounce jar of Jeff creamy peanut butter.",
      "rating": 5.0,
      "verified": true,
      "author": "Cjthor13Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190402
    },
    {
      "title": "Choosy moms choose JIF",
      "text": "My mom bought Adams, but damn that stuff messes up my bread. This stuff spreads like a dream.",
      "rating": 5.0,
      "verified": true,
      "author": "Kail Withers",
      "helpful_votes": 0,
      "publication_date": 20200414
    },
    {
      "title": "Although Jif is a favorite....",
      "text": "If you don't pay attention like I did, you will be charged more for delivery than the product costs. And I'm a Prime Member!! Good Grief.",
      "rating": 4.0,
      "verified": true,
      "author": "my2cents",
      "helpful_votes": 0,
      "publication_date": 20190826
    },
    {
      "title": "This is the only brand I actually like.",
      "text": "My fiance bought this so he could take sandwiches to work and the gym. I used it all to make a big batch of puppy chow. This is the only brand I actually like.",
      "rating": 5.0,
      "verified": true,
      "author": "Hannah",
      "helpful_votes": 0,
      "publication_date": 20170309
    },
    {
      "title": "A piece of home at our doorstep",
      "text": "We live overseas in a place where you can't find peanut butter that easily. What is available isn't always the best quality. Finding this two-pack of Jif on Amazon made my day! With 2 school aged kids, we go through a lot of peanut butter, so now that we have this as a subscribe and save item, we'll never run out! It's made living away from home much easier on all of us.",
      "rating": 5.0,
      "verified": true,
      "author": "The Luna family",
      "helpful_votes": 2,
      "publication_date": 20130823
    },
    {
      "title": "great peanut butter",
      "text": "I love this peanut butter. I share it with my dog and we make candy with it. I am nuts for any nuts.",
      "rating": 5.0,
      "verified": true,
      "author": "tJones",
      "helpful_votes": 0,
      "publication_date": 20180801
    },
    {
      "title": "HUGE jar of Jif",
      "text": "I did not realize how big this jar was until I received it- it is huge! I checked and it is actually twice (or more) than the size of normal peanut butter jars which actually made the price decent. If you go through peanut butter like we do, then this is the jar for you.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20150414
    },
    {
      "title": "Best value",
      "text": "Really tasty, smooth with great flavor Wish it was the 48 ounce size",
      "rating": 5.0,
      "verified": true,
      "author": "John Hengs",
      "helpful_votes": 0,
      "publication_date": 20190813
    },
    {
      "title": "Five Stars",
      "text": "We love Jif Creamy Peanut Butter. No problems with this shipment.",
      "rating": 5.0,
      "verified": true,
      "author": "Peggy J Rector",
      "helpful_votes": 0,
      "publication_date": 20181002
    },
    {
      "title": "High quality product.",
      "text": "This product was tasty, smooth and creamy. Great peanut taste. perfect for sandwiches and dipping.",
      "rating": 5.0,
      "verified": true,
      "author": "Lynn a.",
      "helpful_votes": 0,
      "publication_date": 20191004
    },
    {
      "title": "The best!",
      "text": "It’s Jiff peanut butter. It’s what I’ve known and loved all my life, what else can I say?",
      "rating": 5.0,
      "verified": true,
      "author": "Salinwa",
      "helpful_votes": 0,
      "publication_date": 20180705
    },
    {
      "title": "The only brand of peanut butter I will consider buying ...",
      "text": "The only brand of peanut butter I will consider buying, feeding to my family, and eating myself. No other brand compares.",
      "rating": 5.0,
      "verified": true,
      "author": "Sugarbear",
      "helpful_votes": 0,
      "publication_date": 20170502
    },
    {
      "title": "Great price, great product.",
      "text": "What can I say, it’s peanut butter. Great price, great product",
      "rating": 4.0,
      "verified": true,
      "author": "Cory M. Shaw",
      "helpful_votes": 0,
      "publication_date": 20190706
    },
    {
      "title": "Peanut butter",
      "text": "Same as what comes in the two pack. This is just a single.",
      "rating": 5.0,
      "verified": true,
      "author": "Alan F.",
      "helpful_votes": 0,
      "publication_date": 20190706
    },
    {
      "title": "I RECOMMEND to ALL",
      "text": "very qualitative goods!!!! bystry delivery, sociable seller!!!! I RECOMMEND to ALL!!!! SUCCESSFUL PURCHASES!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170406
    },
    {
      "title": "Smooth as silk; perfect for many uses.",
      "text": "Another of the P&G excellent foods. Couldn't be smoother; loved by everyone in this family.",
      "rating": 5.0,
      "verified": true,
      "author": "Charmayne S. Dierker",
      "helpful_votes": 0,
      "publication_date": 20180626
    },
    {
      "title": "Everybody loves Jif",
      "text": "Jif is my favorite peanut butter. Eaten right out of the jar when I have a low blood sugar situation. Added to an ice cream recipe its delicious. Its easy to over do tho. I little bit goes a long way in ice cream.",
      "rating": 5.0,
      "verified": true,
      "author": "Curmudgeon",
      "helpful_votes": 0,
      "publication_date": 20150503
    },
    {
      "title": "Love Jif",
      "text": "Just got my peanut butter order today! I tried some right away. It's delicious !! I am new to Amazon, and was excited to find they have food. It got here so fast, right at my door. I love Jif creamy, and so Glad it arrived and good price, so I can take it off my grocery shopping list",
      "rating": 5.0,
      "verified": true,
      "author": "McLeSk",
      "helpful_votes": 2,
      "publication_date": 20140711
    },
    {
      "title": "The best peanut butter!",
      "text": "This is our favorite brand of peanut butter. Right now our local stores have been charging $1.00-$2.00 more per jar (for the smaller size!) so I added this to our prime pantry order that was just about ready to go out and we got a great deal delivered right to the door! Peanut butter sandwiches are pretty good, but Jif peanut butter spread over a warm piece of toast is crazy good! If you have never tried peanut butter on toast you are missing out! It gets warms and melty,...yum!",
      "rating": 5.0,
      "verified": true,
      "author": "KG",
      "helpful_votes": 9,
      "publication_date": 20141018
    },
    {
      "title": "A Whale of a Deal",
      "text": "We live in a remote area so I am a big fan of \"Subscribe and Save.\" My husband loves peanut butter and I am ecstatic to purchase it on Amazon for literally half the price of our local store. Both jars arrived quickly and in perfect condition. Thanks Amazon!",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs.Pritchett",
      "helpful_votes": 0,
      "publication_date": 20131020
    },
    {
      "title": "My 'go to\" food .",
      "text": "Take a step back to your childhood. Can anything be more satisfying than dipping a spoon in the eanut butter jar?????",
      "rating": 5.0,
      "verified": true,
      "author": "Betty J. Mason",
      "helpful_votes": 0,
      "publication_date": 20160903
    }
  ],
  "product_meta": {
    "title": "Jif Creamy Peanut Butter, 40 Ounces, 7g (7% DV) of Protein per Serving, Smooth, Creamy Texture, No Stir Peanut Butter",
    "description": "Spread the love! It’s easy to do with our Jif Creamy Peanut Butter, full of that mouthwatering fresh roasted peanut taste you know the whole family enjoys. No other peanut butter will do, so it’s a no-brainer that you’ll enjoy this classic peanut butter taste paired with jelly or create your own show-stopper snack with a quick spread on veggies or fruit. Just one bite of this smooth, creamy peanut butter will remind you of your best childhood memories. From a brand that has been trusted for generations, Jif Creamy Peanut Butter is That Jif’ing Good, making it perfect for a variety of recipes from simple sandwiches to delightful baked goods, dolloped on celery, or just on its own in spoonfuls straight from the jar. Plus, this peanut butter is gluten free, contains no artificial preservatives and has 7g protein (7% DV) per serving*, so you’ll definitely want to keep the goodness going and stock up on this good stuff. *See Nutrition Information For Fat And Saturated Fat Content **Certified NSF Non-GMO True North by NSF International\n\n\n\n\nPRODUCT DETAILS\n * Package Dimensions :6.6 x 3.8 x 3.8 inches; 2.5 Pounds\n * Item model number :10000253\n * Date First Available :April 22, 2014\n * Manufacturer :Jif\n * ASIN :B00I8G7268\n\n * \n\n * Customer Reviews:4.8 out of 5 stars3,967 ratings Spread the love! It’s easy to do with our Jif Creamy Peanut Butter, full of that mouthwatering fresh roasted peanut taste you know the whole family enjoys. No other peanut butter will do, so it’s a no-brainer that you’ll enjoy this classic peanut butter taste paired with jelly or create your own show-stopper snack with a quick spread on veggies or fruit. Just one bite of this smooth, creamy peanut butter will remind you of your best childhood memories. From a brand that has been trusted for generations, Jif Creamy Peanut Butter is That Jif’ing Good, making it perfect for a variety of recipes from simple sandwiches to delightful baked goods, dolloped on celery, or just on its own in spoonfuls straight from the jar. Plus, this peanut butter is gluten free, contains no artificial preservatives and has 7g protein (7% DV) per serving*, so you’ll definitely want to keep the goodness going and stock up on this good stuff. *See Nutrition Information For Fat And Saturated Fat Content **Certified NSF Non-GMO True North by NSF International",
    "rating": 4.8,
    "feature_bullets": [
      "Contains 1- 40 ounce jar of Jif Creamy Peanut Butter",
      "A gluten-free peanut butter that has 7g protein (7% DV) per serving*",
      "Contains no artificial preservatives and Non-GMO**",
      "Every jar contains that mouthwatering fresh roasted peanut taste",
      "Spread the love and create something delicious for your family, from simple snacks to baked goods and more",
      "Jif Creamy Peanut Butter is That Jif’ing Good"
    ],
    "specifications": {
      "Package Dimensions": "6.6 x 3.8 x 3.8 inches; 2.5 Pounds",
      "Item model number": "10000253",
      "Date First Available": "April 22, 2014",
      "Manufacturer": "Jif",
      "ASIN": "B00I8G7268",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Amazon Pantry"
    ],
    "price": 5.49
  }
}