{
  "website_summaries": [
    {
      "verdict": "While it may not be the best-sounding headphone for the money, the Bose Freestyle's superior design and comfort level make it a go-to choice for anyone seeking a sporty and stylish in-ear model.",
      "pros": [
        "The Bose Freestyle headphones are secure and comfortable as well as sweat-resistant, and their \"open\" design is appealing",
        "They also offer pleasantly full bass and include an integrated remote and microphone and a nice carrying case"
      ],
      "cons": [
        "They let sound in, so they're not good for noisier environments",
        "not all the remote's features will work with Android and Windows phones"
      ],
      "aspects": {
        "Design": 9.0,
        "Features": 8.0,
        "Sound": 7.0,
        "Value": 7.0
      },
      "publication_date": 20140911,
      "rating": 8.0,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "One highly undermentioned, undervalued, and immensely important feature ...",
      "text": "One highly undermentioned, undervalued, and immensely important feature of this product is it's durability. As you may or may not be able to see, I purchased this product in my sophomore year of high school (about 3 years ago?). I have finally taken the time, after they broke a few weeks ago, to write my grateful review. These headphones have stuck by my side for coming close to four years. There's not much I can say, other than the fact that these headphones all of the close to 4 years either in my pockets, jostled by my keys, or drenched in sweat during a run, or just swung around aimlessly. Quality product Bose. Quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Jonathan",
      "helpful_votes": 2,
      "publication_date": 20170104
    },
    {
      "title": "Not as good as other Bose products.",
      "text": "I've listened to the older model of these headphones and was blown away. However, the set of headphones I received did not perform like a normal Bose product. I have other Bose headphones and Bose speakers and feel that these don't come close to what I was expecting. I'm not sure if Bose as a company just made lower quality headphones or if Amazon is selling 2nd tier products. At this point, I ended up putting these away, seeing as how my standard apple headphones beat the Soundtrue headphones in terms of quality. Absolutely not worth the $80.",
      "rating": 1.0,
      "verified": true,
      "author": "Irecio",
      "helpful_votes": 4,
      "publication_date": 20160119
    },
    {
      "title": "Love this design",
      "text": "Best ear buds I have for very high Bose-quality sound while still allowing you to hear ambient noise very well. No problem conversing or driving with these as they let outside sounds in very effectively. This is is not the product you want if you are seeking isolation and outside noise cancellation - get something that seals off or covers the ear - these just lightly sit in the ear with air space around them. These look like but are not the same as SoundSport which are cheaper and nowhere near as good.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeffrey S.",
      "helpful_votes": 0,
      "publication_date": 20190811
    },
    {
      "title": "Great sound in the right setting.",
      "text": "Highly durable design, very comfortable to wear on the street. I knew these weren't noise isolating in any way, but was VERY surprised how much sound they let in when not in a really quiet setting. Pros: - Great for the gym, the yard, places where you want some music but to still be aware of your surroundings. - Stay put. great design on the little wings that press into your ear. - Comfortable, even for longer music sessions. Cons: - Have to CRANK the volume to block out surrounding sound in noisy environments. - Tangle up more than i expected for what seems like a robust cordset.",
      "rating": 4.0,
      "verified": true,
      "author": "GP The Engineer",
      "helpful_votes": 2,
      "publication_date": 20150424
    },
    {
      "title": "After 5 Years, They're Still Great!",
      "text": "I've had these headphones for 5 years now. They have been all over the country, shoved in my purse or my pocket, and they are still amazing headphones. The sound quality is great, they fit so nicely in my ears (which is a huge deal for me since I am really particular with how headphones sit in my ears), and the noise cancellation is good if the volume is turned up. I don't really use them so much for that purpose, but even on lower settings, it still does a good job of cancelling out noise. Highly recommend :)",
      "rating": 5.0,
      "verified": true,
      "author": "Christine",
      "helpful_votes": 0,
      "publication_date": 20200325
    },
    {
      "title": "Overall worth the purchase",
      "text": "This pair has a very balanced sound, without excessive punch in any part of the spectrum. This is overall a good thing. They are pretty comfortable, and the inline mic and controls work very well with iPhone. Noise isolation is subtle compared to other pairs I've owned, like Etymotic. Don't expect these to drown out a lot of ambient noise. The up side is you are still aware of your surroundings. I do believe the sound gets better as you break these in more. It's not phenomenal sound, but it's excellent for the price. I wear these everywhere, including the gym. I'm careful with the cord, but I see how it would wear quickly with careless use.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Chang",
      "helpful_votes": 2,
      "publication_date": 20150912
    },
    {
      "title": "Finally giving out",
      "text": "I bought these in Sep 2015, it is now April 2019..and .well, to be honest, is more like I am choosing to retire them and buy a new pair. These poor bastards have gone through the wash and dry 3 times, they have been to and from Afghanistan once, they been to the gym hundreds of times and in and out of my jeans pockets almost daily. They have taken some brutal punishment, but they still sound good. I am retiring them because the cables have become quite worn and they probably wont last much longer. Would I buy them again, absolutely!",
      "rating": 5.0,
      "verified": true,
      "author": "Bernardo",
      "helpful_votes": 0,
      "publication_date": 20190404
    },
    {
      "title": "My second pair of these and I use them every day",
      "text": "These have great sound and I REALLY LIKE THEM! I have an iPhone and even though these are for Samsung, they work just fine. I wear my headphones at least 4 hours a day and the one complaint I have is that they need to be a bit sturdier or stronger to preserve the wire inside. If you're using them as much as I do, after a year the cord becomes weak and you lose sound in one ear or even both. These will probably last longer for other people as mine truly get above average use. The microphone also works pretty darn well. This earphone is superior to the Bose in ear, Sound-true Ultra which is more money.",
      "rating": 4.0,
      "verified": true,
      "author": "Sarah.",
      "helpful_votes": 2,
      "publication_date": 20160201
    },
    {
      "title": "Good Headphones",
      "text": "These bose In-Ear Headphones are very high quality... and very expensive too hehe, but the sound quality, looks, carry case, \"stayhear tips\", gives almost the \"worth it\" I am a guitar player so I use them for rehearsals with my band or practicing/recording in my room, where I need a mix with a backing track or a metronome, and it's a most to be comfortable for hours and having. I have a pair of sennheiser and definitely they sound such much better, but I was looking to be comfortable wearing good headphones on the office as on rehearsals, and not having to buy a $400 or higher headphones",
      "rating": 5.0,
      "verified": true,
      "author": "Ira",
      "helpful_votes": 0,
      "publication_date": 20150511
    },
    {
      "title": "good but one slight problem in my opinion.",
      "text": "After looking at these reviews glorifying these earphones, I decided to give them a try. Upon Putting them on, they felt really comfortable, in fact so comfortable that if i turned them off, and walked around for a bit, I would probably forget that they were on my ears. Now the sound. Yes they are crisp and what not but I feel like the only problem with these is that the silicone piece that is attached to the earphones is slightly too far from the ear causing a higher pitched sound and making the melody and the bass slightly harder to hear. Other than that they're great!",
      "rating": 5.0,
      "verified": true,
      "author": "david lutsyk",
      "helpful_votes": 2,
      "publication_date": 20150526
    },
    {
      "title": "AMAZING headphones that stay in place, even when dancing!",
      "text": "I LOVE these headphones. Seriously, I cannot sing their praises enough. I've been searching high and low for a comfortable pair of headphones to wear while rehearsing for dance performances, and these fit the bill. With so many turns and head whips in dance, I needed a pair that stayed put, and I first tried all those headphones that wrap around your ears and/or head. While they stayed in place, they were incredibly uncomfortable after an hour. These headphones never hurt, and they never fall out! Additionally, they're sweat-proof, and they have certainly stood up to the test. I recommend these to all my dancer friends!",
      "rating": 5.0,
      "verified": true,
      "author": "Jina",
      "helpful_votes": 0,
      "publication_date": 20150622
    },
    {
      "title": "Would recommend to anyone",
      "text": "Amazing headphones, I don't write reviews much and if you look at my history you can tell. But I just had to write a review for these headphones, finally had to buy some new ones because after 4-5 years of owning this pair they finally started failing. I used them all the time and worked great every time. Even accidentally washed them a couple of times. My absolute favorite thing about them (which is also why the were recommended to me) was that they stay put and are comfortable. You can pull on the cord and they stay put!",
      "rating": 5.0,
      "verified": true,
      "author": "Franco Ferrara",
      "helpful_votes": 0,
      "publication_date": 20171126
    },
    {
      "title": "Super comfortable, nice case, ok sound.",
      "text": "Too bad. As comfortable as these are, I cannot say the same for the sound. It's lacking too much bass for my liking, and when I tried with the, the bass muffles all the mids and highs. If you want an extremely comfortable (and rather solidly built) pair of earphones and do not care for the sound quality, get these. I do love that they include a SUPER NICE case to carry the earphones with.",
      "rating": 4.0,
      "verified": true,
      "author": "Yutani",
      "helpful_votes": 0,
      "publication_date": 20160502
    },
    {
      "title": "earwax encrusted earbuds and throw them in the garbage where they belong",
      "text": "Take your old, cheap, earwax encrusted earbuds and throw them in the garbage where they belong. These bose soundtrue in ear headphones will pour new life into your music, audiobooks, and other sound-related needs. Tired of listening to your coworkers rant about how much they hate their kids? Annoyed with hearing your neighbors screaming at each other through your paper thin apartment walls? Pop these in and the top quality sound will blow you away and finally put a barrier of privacy between you and those you wish you could entierly avoid. 10/10 would buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott",
      "helpful_votes": 0,
      "publication_date": 20161030
    },
    {
      "title": "Sounds Great but Falls Apart Quickly",
      "text": "The sound quality is above average, but the things fall apart so quickly that you don't get long to enjoy it. I've had theee pairs, and each time wire casing leading into the speakers frays quickly (on the order of 2-4) with daily use and can lead to sudden loss of power to one or both speakers. Bose may be sound engineering masterminds, but they seem completely incapable of producing a product with any bit of material integrity.",
      "rating": 2.0,
      "verified": true,
      "author": "Clod Clawed Claude",
      "helpful_votes": 2,
      "publication_date": 20160704
    },
    {
      "title": "... at the end of 2015 and while they sound great. The volume is rather low with this set",
      "text": "I bought these at the end of 2015 and while they sound great. The volume is rather low with this set, also the buttons for volume and mute/skip control fall apart. I only use them while at work in an office environment so they never got dirty or over used or anything like that. The buttons while they are hard plastic and the housing is also hard plastic, there is a soft rubber material that holds the buttons in place, this breaks apartment pretty quickly. Its pretty cheaply put together. Not worth the money at all.",
      "rating": 1.0,
      "verified": true,
      "author": "Kenneth C.",
      "helpful_votes": 0,
      "publication_date": 20170621
    },
    {
      "title": "Lasted 38 months, life reduced by sticky rubberized material that gets caught on everything",
      "text": "Main issue is longevity. Outer shell started to deteriorate after 25 months of regular use. Wires became exposed after 33 months. Right speaker failed at 38 months. Lifespan was shortened due to design: outer covering of cord is sticky rubberize plastic that grabs on anything, getting easily caught and adding constant stress. Where the wire meets the plug (most frayed part) is straight instead of a 90 degrees, again causing the cord to stick out and get caught often.",
      "rating": 2.0,
      "verified": true,
      "author": "JRA",
      "helpful_votes": 0,
      "publication_date": 20181002
    },
    {
      "title": "Great sound, great product.",
      "text": "I immediately noticed a difference from my previous pairs of headphones! I'm so happy about this purchase. So, I go to the gym about five times a week and like to listen to music when using the elliptical machine and the treadmill. I found other types of headphones would either: 1) fall out, 2) get wacky because of sweat or 3) hurt the backs of my ears The Bose Freestyle solves all of my issues. They stay nicely and securely in my ears without causing pain or pressure. The volume is consistent, despite my aggressive sweating and they stay put and allow me to focus on the run, not on my headphones.",
      "rating": 5.0,
      "verified": true,
      "author": "Onion",
      "helpful_votes": 0,
      "publication_date": 20150727
    },
    {
      "title": "Non-apple product user",
      "text": "Let me start by saying I hate earbuds. They are either too big, too uncomfortable, or too difficult to keep in the ear. These are not earbuds. They fit comfortably, stay put, and come with three different size earpieces to fit. The sound quality is clear and crisp. These are used on an older model MP3 player and a smartphone, neither one are apple products. Because these earbuds are made for apple devices, the volume control and mic don't work, but I don't need those functions. These are not noise cancelling, so if you are looking for that you may want to try something different.",
      "rating": 5.0,
      "verified": true,
      "author": "KC",
      "helpful_votes": 2,
      "publication_date": 20150406
    },
    {
      "title": "40$ earbud quality for the price of 100$",
      "text": "Sound quality was ok nothing special I dished out 100 bucks because I wanted something with quality sound but that is also durable. The wire is just like any other heap hone wire which seems foolish to me. Big problem with headphones is wires rip. That's pretty much the main reason you get new ones. You'd expect them to protect the wire with a bit more padding but nope. At this rate these 100$ ear buds will need to replaced just as often as 20$ ones. I've had skull candy titans for a long time the sound quality is pretty much even with the bose sounding a little better depending on the music.",
      "rating": 3.0,
      "verified": true,
      "author": "Alec",
      "helpful_votes": 0,
      "publication_date": 20151207
    },
    {
      "title": ") Overall I found the audio quality to be good, with good bass and clear audio in general",
      "text": "I don't consider myself an audiophile, so take this with a grain of salt :) Overall I found the audio quality to be good, with good bass and clear audio in general. I use these headphones while lifting weights and sweat has been a problem for previous headphones - so far (1 month in) I haven't had a problem with these headphones filling with sweat - the rubber ear insert seems to be designed in a way that discourages that. They fit snugly in my ear and I've never had a problem with them falling out. Overall I think they're a great purchase and would recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "hamiltonia",
      "helpful_votes": 7,
      "publication_date": 20141121
    },
    {
      "title": "Sounds GREAT!",
      "text": "My old MIE2I ear buds I feel were the best ear buds available (purchased October 4, 2012 - they replaced the Bose predecessor ear buds I wore out before them) and they've been used continuously ever since. It got to where I had electrical tape around the input jack, both ends of the volume controls, and at the connections of each ear bud. After much teasing from my wife I purchased the new SoundTrue ear buds. I wish I'd done that sooner as the sound quality is much improved. I listen to music on my iPhone at the gym daily, and my Kindle too (watch movies, tv shows, YouTube). GREAT GREAT GREAT!",
      "rating": 5.0,
      "verified": true,
      "author": "JimP",
      "helpful_votes": 0,
      "publication_date": 20150916
    },
    {
      "title": "The ear fittings come in medium,small and large.",
      "text": "Absolutely spectacular sound quality. Yes they are not noise cancelling but as someone already said I'd rather be able to hear things that could potentially save my life. they were delivered a couple of days after i ordered them on prime! I'm a fitness instructor and these ear phones (with the fittings) stay dead in place while I jump around like a mad person during my Zumba practice so I'm happy happy happy with this purchase. The ear fittings come in medium,small and large. They're made of a malleable rubber so they're very comfortable to wear.",
      "rating": 4.0,
      "verified": true,
      "author": "Gitanjali",
      "helpful_votes": 2,
      "publication_date": 20150406
    },
    {
      "title": "I love these earbuds",
      "text": "I love these earbuds! They are exactly as pictured and even came with an original case. I bought these to replace the same Bose earbuds I bought from a big name department store because I gave those to my daughter. The sound on these earbuds is amazing and they are so pretty! When I listen to music I hear much more depth than with the standard earbuds that came with my iPhone. I use them every day to listen to music at my desk at work and when I walk. I highly recommend these earbuds. Update: these earbuds stopped playing sound in one ear several months ago. Not happy about that.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathe",
      "helpful_votes": 0,
      "publication_date": 20160218
    },
    {
      "title": "Doesn't eliminate environmental noise.",
      "text": "I really like these - do note they do not form a seal in your ear canal when you wear them - aka noise isolating or whatever they call it. You can hear all noise around you. Where I really wish they did block out environmental sounds was on a puddle jumper flight. I could barely hear the movie I was trying to watch. I'm ordering some different headphones that will block out more noise for use at work and traveling. I will use these for when I go walking so I can hear traffic, etc. Sound quality is good - nice depth. I think the bass could be richer.",
      "rating": 4.0,
      "verified": true,
      "author": "Choo choo train",
      "helpful_votes": 0,
      "publication_date": 20160809
    },
    {
      "title": "Disappointed:  Not what they used to be",
      "text": "Bought two pairs of these a year ago and they were great, 5 Stars. The pair I received today have significantly less bass than my previous two pairs. Wondering if this is just a lemon or has Bose quality control gone down hill? Either way, I won't be buying these again and I'll be returning these for a different model. Too bad Bose has stagnated in their innovation as of late. I used to revere them as a top drawer electronics company. Where are the bluetooth in-ear phones? I bought a pair of SoundPEATS QY7 from Amazon for $25 and they sound impressively good. Thing is, I like Bose's StayHear tips more than 'bullet' ear buds.",
      "rating": 2.0,
      "verified": true,
      "author": "Rhudson",
      "helpful_votes": 2,
      "publication_date": 20160330
    },
    {
      "title": "Good Sound, Would Reccomend overall.",
      "text": "These are worth the price and do sound great, but I have two small nitpicks about this product compared to the old Mie2i Model. -The plug is straight, unlike the Mie2i, which had a nice angled plug. -The sound sounds a bit more muffled. Still great, hardly noticable once you've been listening to them for awhile. I would definitely reccomend these to someone looking for a pair of portable earphones with good sound, unlike Beats and other \"fake\" high end products.",
      "rating": 4.0,
      "verified": true,
      "author": "Claude Landes",
      "helpful_votes": 0,
      "publication_date": 20151104
    },
    {
      "title": "The Best my ears have enjoyed",
      "text": "I have owned all least 20 pairs of ear buds in my lifetime. All suffer from the same problem...staying in your ear. That is why I love this pair so much because no matter what they do not fall out. I also got the stay hear+ tips which make a good seal for better sound quality, which by the way is already really good. Everyone who has listened to music on these has been impressed. I would recommend to anyone looking for a high quality product.",
      "rating": 5.0,
      "verified": true,
      "author": "Julz",
      "helpful_votes": 2,
      "publication_date": 20150314
    },
    {
      "title": "Still my favorite pair of earphones",
      "text": "Still my favorite pair of earphones. Been using these and previous generations for the last four years. I use these for cycling, running and the gym. They stick in my ears without dropping (most other earphones do!), I don't have to charge them and I can still be aware of environmental noises such as approaching cars. They also have a great hands-free microphone which I occasionally use for meetings and more. Until Bluetooth earphones have twenty hours of battery life I'll happily stick with these!",
      "rating": 5.0,
      "verified": true,
      "author": "kesslerIO",
      "helpful_votes": 0,
      "publication_date": 20160303
    },
    {
      "title": "These headphones are great. If you want better sound then the over ...",
      "text": "These headphones are great. If you want better sound then the over the ear, huge padded ones are just that. For those that use these to exercise, talk while driving, etc. these are perfect. The only drawback is that I paid $150, now they're a lower price here. The worst thing is that you can purchase these at Sam's Club for $99. My company bought these or I'd send them back and save the money. All in all though, these headphones do everything I ask and sound great while I'm working through a tough set of exercises.",
      "rating": 5.0,
      "verified": true,
      "author": "Presenter",
      "helpful_votes": 0,
      "publication_date": 20150114
    },
    {
      "title": "Bose Exceeds",
      "text": "Straight forward: They're comfortable and they sound awesome. They come with little extras like a case and different sized earpieces. However, they are not noise cancelling, as they clearly state; the only flaw. I'll also add that I accidentally ran these through the washer and dryer via a pair of jeans... and they still work fine. Exceptionally done as advertised, and durable beyond expectation. Would highly recommend.",
      "rating": 4.0,
      "verified": true,
      "author": "Adam1385",
      "helpful_votes": 0,
      "publication_date": 20160302
    },
    {
      "title": "Great for the Gym!",
      "text": "The sound is very good, but not great. If you're expecting to be blown away, you won't be. However, if you are looking for balanced sound, and a larger soundstage than your buds, get these. They are very comfortable as well. I was worried about those hooks that go around you ear, but I hardly notice them. I purchased these solely for the gym. They fit nice, stay in the ear, and sound decent. The zipper case is a nice feature, as it keeps the headphone safe in my gym bag. Overall I am happy with these, and I really wish amazon would start doing .5 stars. Because that's exactly where these would fall; 4.5 stars.",
      "rating": 4.0,
      "verified": true,
      "author": "J. fox",
      "helpful_votes": 0,
      "publication_date": 20150202
    },
    {
      "title": "Best Headphones I've Had",
      "text": "I bought these to replace my beats in ear headphones and I am soooo happy. I have always used Bose headphones in the past but received a beats headphones from my husband so I used them. I hated the beats headphones because the music quality was poor. After the beats headphones stopped working, I went back to Bose. You can hear the difference! The base is more prominent and the voice is crisper. Not to mention, the Bose in ear actually stays in your ear. I use it to go to the gym and run on the treadmill and it never comes off. I highly recommend this product. I am truly satisfied in every way.",
      "rating": 4.0,
      "verified": true,
      "author": "Farrah",
      "helpful_votes": 0,
      "publication_date": 20151219
    },
    {
      "title": "Incredible comfort!  Great Bose sound.",
      "text": "These headphones aren't going to surprise anyone with their sound...just another great sounding Bose product. Great, crystal clear balance through the whole audible spectrum. What makes these great is their comfort. Once you put them in your ears, you kind of forget about them as you go about your business. But the best feature is that, after wearing them for a few hours, your ears don't feel like someone has bopped you and given you cauliflower ears. No soreness! Don't know about you, but I hate that feeling. Doesn't matter if I'm working or doing various activities. When I plug these headphones into my smartphone and listen to my playlist on Amazon Prime Music...it's Heaven on earth!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon customer",
      "helpful_votes": 0,
      "publication_date": 20151108
    },
    {
      "title": "Absolutely amazing!!",
      "text": "I was hoping that these in ear buds were worth the $100 I paid for them as they were being shipped! Lol. They are!!!! The sound is the best I have ever heard! I couldn't believe how clear the music sounds through these!! I have been a drummer for 18 years and I love great sounding music! These things produce it!! Wicked comfortable also!! They are worth $100!! If you have the extra money and want great quality headphones these are the ones to have!!",
      "rating": 5.0,
      "verified": true,
      "author": "Nick Carter",
      "helpful_votes": 3,
      "publication_date": 20150519
    },
    {
      "title": "Great sound, bad fit for grapplers.",
      "text": "Arrived in new packaging, great sound on the audiophile level, only drawback is the fit. I have extensive cauliflower ear in my left ear from wresting, grappling, and competing. Why does this matter? It interferes with the way the inner ear portion fits (thus 4 out of 5 stars rating). Ended up using the small fitting (left) large fitting (right) and the buds work without too much slippage... although require regular adjustment through your workouts. If you have normal ears, buy away! If not, sucks to be you. Either way, I highly recommend getting yourself a set of these if you are anal about high quality sound.",
      "rating": 4.0,
      "verified": true,
      "author": "Corey M.",
      "helpful_votes": 0,
      "publication_date": 20150624
    },
    {
      "title": "Best of the best",
      "text": "I spend a great deal of time listening to audio books, usually while working in the yard. I have a pair of Bose in-ear headphones I bought in 2005, still going strong as far as sound quality goes but the wire covering is beginning to wear. Knowing that all good things come to an end I tried a number of ear buds but some kept falling out of my ears and nothing compared to the Bose quality. So bought these on sale as back up and there's the same Bose quality. And these don't fall out of my ears.",
      "rating": 5.0,
      "verified": true,
      "author": "SP",
      "helpful_votes": 0,
      "publication_date": 20160602
    },
    {
      "title": "Great sound, great fit",
      "text": "I love my Bose SoundTrue Earbuds! I have used them running and jumping with no problems. They are so comfortable in my ears that I forget I am wearing them. I was worried they would not fit my ears well because all previous earbuds I have used were too big. These come with three different sizes so you are sure to find your size. The sound is amazing. The best sounding earbuds I have ever had.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Hansen",
      "helpful_votes": 0,
      "publication_date": 20160410
    },
    {
      "title": "Great for Sensitive Ears",
      "text": "I've always hated ear buds because they hurt the inside of my ears and never fit well. But with my new job I'm on the phone a lot, and needed something small so I could work hands-free when on a call. I decided to try these and I'm glad I did! They provide multiple size soft ear buds and the small pair fits my ears perfectly! They are so comfortable I can't even tell I have them in. The sound quality is crystal clear, and the microphone is very clear as well. I'd recommend these to anyone who wants a killer set of earbuds!",
      "rating": 5.0,
      "verified": true,
      "author": "Casey Demattei",
      "helpful_votes": 5,
      "publication_date": 20141007
    },
    {
      "title": "Very pleased.",
      "text": "First, I am no audiophile, so I have a layman's view of sound quality. They sound fine to me. After several pairs of Apple headphones, I decided to buy a nice pair and am so glad I did. These are my go-to set when I am not in a loud background noise environment (I use Shure SE112m+-GR Sound Isolating for that). These are very comfortable and let in just enough ambient noise that you don't feel disconnected from your environment. They've been plenty durable and reliable - I've had them for almost 2 years and use them daily.",
      "rating": 5.0,
      "verified": true,
      "author": "NA",
      "helpful_votes": 0,
      "publication_date": 20170421
    },
    {
      "title": "Right Ear Bud has no Sound",
      "text": "I have gone thru 2 pairs of earphones and each lasts around a year. The right ear bud simply fell apart right around the 1 year mark. Tried to fix it and then eventually, I had to buy another pair. This time, after a year, I can only get sound on the left ear bud. No sound comes out of the right ear but. The only thing that I like about these ear buds is how comfortable they are inside the ear. This is why I gave it 2 stars. Otherwise, it would have been 1 star. Unfortunately, this will be the last Bose earbuds I will buy.",
      "rating": 2.0,
      "verified": true,
      "author": "Rhino6624",
      "helpful_votes": 0,
      "publication_date": 20161129
    },
    {
      "title": "My favorite wired in-ear headphones",
      "text": "Great sound and great fit. Plus these aren't the kind that seal the ear-canal, so you don't get that sealed in feeling like you have a head cold. The little wing thing is the secret to holding them in place. A set of Aukey bluetooth headphones I have also has that piece and it works great to keep them from falling out. The color of these in the pictures is more red than reality, but the \"cranberry\" description is right on the money. I got these to give as a gift and they seem to be as good as a pair of older Bose IE2 headphones, which are my favorite wired in-ear headphones.",
      "rating": 5.0,
      "verified": true,
      "author": "W. Warren",
      "helpful_votes": 0,
      "publication_date": 20151016
    },
    {
      "title": "Second set of these - I like this later version with the straight headphone jack instead ...",
      "text": "Second set of these - I like this later version with the straight headphone jack instead of the 90 degree one on the last one I had. Only complaint is the last ones ended up dying basically after a lot of hard use - I used them in the gym and stuff like that a lot, which they aren't rated for and I probably shouldn't have. The headphones started sending the \"hangup\" signal at random to the phone - I couldn't touch them or they would kill the call or whatever I was listening to. Was annoying. But this new set work great, great sound, yet you can still hear the world around you.",
      "rating": 4.0,
      "verified": true,
      "author": "C. Cashman",
      "helpful_votes": 0,
      "publication_date": 20150105
    },
    {
      "title": "Great sound, but flimsy cord",
      "text": "Great sound, but flimsy cord. Mine is now in the drawer since the cord became frayed and exposed the wire. Not sure why Bose would use such a cheap cord. The Bose products from the past were much better. I still have my Bose Spatial receiver I purchased in 1982, while stationed in Korea. I also purchased the Bose 901's back then. I just wish the quality was the same. They need to have a sturdy cord similar to the Beats earbuds. They will last forever.",
      "rating": 2.0,
      "verified": true,
      "author": "Earle Holder",
      "helpful_votes": 0,
      "publication_date": 20170108
    },
    {
      "title": "the best.",
      "text": "They have lasted for six months so far. Very impressed. Please, when you pull them out, always pull at the jack, otherwise the wires might detach same with pulling the wires to get them out of your ears. They are starting to protest a little, won't play the music at first, but I twist the plug a little and everything works again. Also: I have weird ears that normal buds fall out of CONSTANTLY. I've had over ear headphones, I've had ones with the little thing that goes behind your ear, these are, by far, the best.",
      "rating": 5.0,
      "verified": true,
      "author": "Shannon",
      "helpful_votes": 0,
      "publication_date": 20151115
    },
    {
      "title": "I do like how they hold in your ear but I think ...",
      "text": "Volume was too low for my liking and I did not notice and improved sound quality over the factory ear buds that came with my iphone. I do like how they hold in your ear but I think you're just paying for the \"BOSE\" name. Look elsewhere, especially for loud environments (yes I realize these are not noise canceling, but neither are my earbuds).",
      "rating": 3.0,
      "verified": true,
      "author": "Adam",
      "helpful_votes": 0,
      "publication_date": 20160203
    },
    {
      "title": "Perfect for the person who is on their cell phone all day long",
      "text": "These were recommended to me by a co-worker and I am not disappointed. They have great sound and I haven't gotten a single complaint that people can't hear me on the other line. I opted for these because I use my cell phone all day and I grew tired of losing charge with Bluetooth headsets. They also seem to have pretty good noise/background sound reduction. They come with a nice carrying case so I take them everywhere and they don't get tangled up.",
      "rating": 5.0,
      "verified": true,
      "author": "Kitty Barrow",
      "helpful_votes": 0,
      "publication_date": 20160107
    },
    {
      "title": "All time favourite.",
      "text": "Best earplugs ever! I am not a huge fan of the bass and listen to lot of vocals and hence mid frequency is my primary concern. And this Bose just kills it. The only other product that comes close to this level of balance across the sound spectrum was the. However, over the years a lot of counterfeit creative products are doing the rounds and hence moved to this. I bought the old version of this a year back and one more a year before this. I doubt if I will ever look for any other earphones/plugs.",
      "rating": 5.0,
      "verified": true,
      "author": "Aravind",
      "helpful_votes": 0,
      "publication_date": 20151103
    },
    {
      "title": "Awesome earbuds.",
      "text": "Love these earbuds. Have been getting them since they came out. Stay in ear all day, very comfortable, sound great and I can wear them at work because they are not noise cancelling so I can hear if someone talks to me. I have had Sony noise cancelling in the ear type ear buds but they would hurt my ears after a few hours and didn't sound as good as the Bose.",
      "rating": 5.0,
      "verified": true,
      "author": "snakeburm",
      "helpful_votes": 0,
      "publication_date": 20160429
    },
    {
      "title": "Great Earphones if you are in a quiet area.",
      "text": "Overall, I am impressed with the Bose SoundTrue earbuds. I had never used the winged ear design before, and I really like it. The earphone is heald securly in place, and I think it is really comfortable. The sound is amazing. If you are comming from cheep earbuds, you will love the high quality of sound. Really, it is a whole new world. However, these earphones do not block ambiant sound. If your trying to listed to music with background noise, you will not enjoy them as much. However, the are great if you are in a quiet room.",
      "rating": 4.0,
      "verified": true,
      "author": "John Swift",
      "helpful_votes": 0,
      "publication_date": 20150301
    },
    {
      "title": "Pretty good.",
      "text": "Pretty good, but considering the branding, I expected a little better quality sound. I have a pair of Beats Studio Wireless (higher end/a little like comparing apples and oranges) and I definitely gravitate towards them. These are good for running/athletic activities, but not going to blow your socks off with sound quality. Frankly, I'm not sure the sound quality is any better than my stock Apple Earbuds. These, although, sit much more comfortably in my ears given their design and use of silicone.",
      "rating": 4.0,
      "verified": true,
      "author": "Brian J. Conley",
      "helpful_votes": 0,
      "publication_date": 20160409
    },
    {
      "title": "Hello, I love you",
      "text": "I have a serious fear of purchasing electronics of any sort for myself, and this includes earbuds. Often times I am afraid I haven't done enough research and am throwing money at something not worth my hard earned paycheck... That being said, I am beyond in love with these headphones. They're cute and the sound quality is AMAZING. I have been living under a rock as far as sound is concerned before snatching these earbuds up. Well worth every penny- the iphone integration is really nice and the little holder that comes along with them is perfect for storage.",
      "rating": 5.0,
      "verified": true,
      "author": "Amelia",
      "helpful_votes": 0,
      "publication_date": 20151203
    },
    {
      "title": "Excellent Sound, Questionable Durability",
      "text": "Had a pair of these for years. Sound was amazing for earbuds, but was disappointed in durability. Cords rapidly degraded over time, rubbing raw and showing copper. Come time to replace, could not find anything similar. Similar earbuds simply can't match the sound. Cheap Panasonics are just that - cheap. Expensive replacements simply don't have the sound. I fully expect these to wear out over time, but in the meantime, the sound and price are worth it.",
      "rating": 4.0,
      "verified": true,
      "author": "seamusoldfield",
      "helpful_votes": 0,
      "publication_date": 20150504
    },
    {
      "title": "LOVE MY BOSE EARBUDS",
      "text": "I love these. I had ordered another pair (which kept falling out of my ears) and sent them back and exchanged them for these. First of all, I have small ears and these are the only ones with the clips (comes with different sizes) to fit my ears and not fall out. Plus the sound is great. Would definitely purchase these again if needed. I can answer my phone without having to take it out of my banjee and adjust the sound as well. Very, very happy with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "karrtoons",
      "helpful_votes": 0,
      "publication_date": 20150622
    },
    {
      "title": "I love it.",
      "text": "I love it. Latest in a long number of bose headphones that I have been getting. Sound quality is as good as earlier versions of this in-ear. One thing that I do not like in this version is the metal part where the headphone is inserted into the audioplayer. In eralier versions of the headphone the part had a L-shape that I found more convenient to use. This version has lost the L-shape and I find that it sticks out a little more and is not as convineinent. On the plus side, the phone wires don't get as tangled up as my earlier versions used to. All in all, I am liking it very well and will stay with Bose.",
      "rating": 5.0,
      "verified": true,
      "author": "Kofib",
      "helpful_votes": 0,
      "publication_date": 20151122
    },
    {
      "title": "Brilliant headphones!",
      "text": "Just got these to replace my hard working BOSE MSIE. I would consider myself very hard on headphones as I use these for work and play. My headphones get thrown into pockets, bags and the car. The MSIE held up great but the wear and tear was visible and they didnt have the functionality that these Bose SoundTrue have. I have only been using them for half a day so far but they are wicked. Great sound quality, really fresh good tops, mids and decent bass. The controls are simple to work with, they are very comfortable in-ear. Sound quality in calls is very good. I would recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Mixed Joy",
      "helpful_votes": 0,
      "publication_date": 20150828
    },
    {
      "title": "Defective headphone where mic goes out after a short period of time",
      "text": "These are truly terrible ear buds. I bought 3 of them in sequence, returning them to amazon when the microphone would go out. On the third pair, it went out exactly 31 days after I bought them, so I couldn't return them. These is some defect where the microphone drops out after a relatively short period of time. They still work as headphones, but when I want to take of make a call, I have to pull them out and use the phone directly. I only wish I could return this pair!",
      "rating": 1.0,
      "verified": true,
      "author": "David Mattingly",
      "helpful_votes": 0,
      "publication_date": 20151116
    },
    {
      "title": "Not worth it.",
      "text": "The sound quality isn't any better than the standard iPhone earbuds, so it's not worth the price premium. I had higher expectations for Bose earphones but I guess I was wrong. The earpieces are a little uncomfortable and leave my ears sore after a while. They are also a little heavy. I wouldn't buy this again or recommend it.",
      "rating": 3.0,
      "verified": true,
      "author": "BL",
      "helpful_votes": 0,
      "publication_date": 20160901
    },
    {
      "title": "Great product.....a little overpriced but Bose is never cheap",
      "text": "Great sound,very comfortable but does not cancel or block noise from a riding mower. Actually is good for walking, running or bike riding because you can hear background noise. Do not fall out like most ear buds. I prefer my noise cancelling quiet comfort headphones but these serve their purpose for day to day use and as a hands-free phone attachment. As with most Bose products, might be a little costly for the average person. But once you own Bose is hard to enjoy anything else.",
      "rating": 4.0,
      "verified": true,
      "author": "WAYNE W.",
      "helpful_votes": 0,
      "publication_date": 20151110
    },
    {
      "title": "Great sound, not overpowering.",
      "text": "The SoundTrue's have a rich, full sound without being too heavy on the bass. They are heavier in the low frequencies than SoundSport Ultra's, though. I had bought a pair of SS Ultra's first but upon listening to them I found the sound to be too thin and emphasizing on the mid's and high's. I use the SoundTrue's to listen to the low freq's so I can transcribe a song's bass line. I am very happy with these in-ear headphones. After returning the Ultra's Amazon refunded my original purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Haveaday",
      "helpful_votes": 2,
      "publication_date": 20160101
    },
    {
      "title": "Best headphones ever!",
      "text": "Best headphones ever! This is my 3rd pair of Bose headphones. The bass is creamy and now over/under powered. The buds are extremely comfortable and have never come out during running or biking. I ran my previous two through the dryer and that killed them, however they survive the washing machine just fine!",
      "rating": 5.0,
      "verified": true,
      "author": "mitchell Lester",
      "helpful_votes": 0,
      "publication_date": 20160827
    },
    {
      "title": "the quality is very good and it is very suitable for sports",
      "text": "very expensive but definitely worth it. the quality is very good and it is very suitable for sports. very few headphones stay in my ear even at rest, not even mentioning while im running but these are the only pair that hve staye din without problem. 3 sizes to choose from for the peice that goes into your ear which is nice.",
      "rating": 5.0,
      "verified": true,
      "author": "Cindy",
      "helpful_votes": 0,
      "publication_date": 20180217
    },
    {
      "title": "Love them!",
      "text": "I just got them and I do love them.. BUT:: I wish they had a button to skip sings.. Thats why I only gave it 4 stars.. Bose is a good company and why wouldn't they have this on the control piece.. And also the control piece feels cheap.. But all in all the sound is great.. Just wish they fix these things.. I'll keep them because most earphones hurt my ears but are very comfortable..",
      "rating": 4.0,
      "verified": true,
      "author": "demi",
      "helpful_votes": 0,
      "publication_date": 20150621
    },
    {
      "title": "Good sound that can't be heard in noisy surroundings.",
      "text": "Good sound output but for me, these earphones do a bad job of keeping outside noise out. As such they are only useful in a quiet environment such as a library. I can't use them on the train for example. My stock Samsung earbuds keep outside noise out better it's sad to say. Buttons work well, the microphone also worked well for a phone call and overall the earphones are comfortable to wear. The case is ok; a zipper on small corners is not the best approach.",
      "rating": 3.0,
      "verified": true,
      "author": "P. Thornton",
      "helpful_votes": 0,
      "publication_date": 20150520
    },
    {
      "title": "The silicone ear inserts hold the earphones comfortably and securely in place without having to jam an ...",
      "text": "I purchased these as a replacement for an earlier model Bose ear phones that I misplaced. The silicone ear inserts hold the earphones comfortably and securely in place without having to jam an over sized rubber bulb into the ear canal. Admittedly, for many reasons, not everyone is a fan of Bose products but I'm no audiophile and I truly enjoy the sound of these earphones. The sound is crystal clear with deep clear bass tones, not overpowering. Great comfort and great sound.",
      "rating": 5.0,
      "verified": true,
      "author": "CSchena",
      "helpful_votes": 0,
      "publication_date": 20151031
    },
    {
      "title": "If you like puzzles you'll love disentangling those little f***** everyday",
      "text": "If you like puzzles you'll love disentangling those little f***** everyday! The rubbery material makes it really, really hard to disentangle. The sound is pretty good though they dont block that much sound so you'll have to push volume up if your surroundings are noisy. My pair survived about 2 years and 2 months before one of the sides cracked open and then quickly stopped working.",
      "rating": 3.0,
      "verified": true,
      "author": "tarabout frédéric",
      "helpful_votes": 0,
      "publication_date": 20180328
    },
    {
      "title": "Great headphones",
      "text": "This headphones are amazing I love them I've been using them for more then a year and have not had a single problem yet. The sound quality is out of this world I've heard things in a song I've never heard before. These headphones like most boss products have amazing bass I love the way they they feel and they never fall out of my ear. I highly recommend these headphone to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin",
      "helpful_votes": 0,
      "publication_date": 20160605
    },
    {
      "title": "Can't beat these comfort fit earbuds!",
      "text": "This is my third pair of Bose earbuds. My first two went dead on the right side. I sleep with them in and that's probably why the right side goes bad. I really do like the Bose earbuds for the comfort and ability to lay on them on a pillow without discomfort. I have tried several others but always come back to the Bose for the ear comfort. I can't stand noise canceling earbuds or any earbuds that go into the ear canals. So even though I don't have the best of luck with these lasting long, they are still my go to earbuds.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20140912
    },
    {
      "title": "Love these!",
      "text": "I have been in need of some headphones to use while I work out. I run and rollerblade (yes, a little funny, I know) almost everyday and wanted some that would actually stay put in my ears. These are perfect! I love the little case they come in as well, so I can just throw them in my purse when I need them. I wear them at work, when doing computer work and they are great at blocking out unwanted noise as well. Would recommend these in a heart beat! :)",
      "rating": 5.0,
      "verified": true,
      "author": "Haley Gray",
      "helpful_votes": 0,
      "publication_date": 20150630
    },
    {
      "title": "Money well spent people!!",
      "text": "AWESOME AMAZING SUPERB!!!!!! What else can I say? Another amazing product by Bose. They don't slip. They are extremely comfortable. They are sweat proof and stay out when running. You can even sleep in these babies!!! This is my second pair (I slammed the first pair in the car door and messed up the wires not to mention about ripped my ears off). I love these and recommend them to everyone. Money well spent!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "M. Nally",
      "helpful_votes": 0,
      "publication_date": 20151230
    },
    {
      "title": "Love them",
      "text": "Great sound! I have been using cheap headphones all my life and these blew me away. I will never go back. I have not owned them long, so cannot comment on durability. The fit is comfy. Comes with three sizes to try. The free storage case is big for just the headphones, but if you wanted to use it for an iPod mini or something like that it would hold both.",
      "rating": 4.0,
      "verified": true,
      "author": "T. Fro",
      "helpful_votes": 0,
      "publication_date": 20160301
    },
    {
      "title": "Clearly the best In-Ear Headphones around",
      "text": "Clearly the best In-Ear Headphones around. Easy to put on and take off ...very secure in the ear. Unlike headphones, you can lay down on your side with one ear on a pillow with the headphones on. These headphones are usually attached to my Kindle Fire while watching Prime Instant Video. I have a set of noise reduction Bose headphones. It comes with an extension cord which fits these headphones so I have a longer connection when plugging these into the TV.",
      "rating": 5.0,
      "verified": true,
      "author": "CMS",
      "helpful_votes": 0,
      "publication_date": 20150330
    },
    {
      "title": "Worth every penny!",
      "text": "I bought these headphones to replace my Apple Earpods, which just wouldn't stay in my ears. Much to my delight, these Bose headphones are worth every penny! They look, feel, and sound great. It is important to note that these headphones do not plug your ear canal. Instead, the silicone allows it to sit comfortably and securely, directing sound into the ear. With the volume low, you can hear the ambient noises around you, which I really appreciate as that means I don't have to keep taking them off and putting them back on.",
      "rating": 5.0,
      "verified": true,
      "author": "C L",
      "helpful_votes": 0,
      "publication_date": 20150710
    },
    {
      "title": "I am glad I got these",
      "text": "I never spent this much money on headphones, i wasn't sure if I would like these but now that I have and used them, i am glad that I did treat myself to these. It is VERY easy to use and fit them in your ear. They NEVER fall off. The cable is not long like many others, it's long enough to avoid unnessesary clutter. The quality of sound is perfect, I compared these to beats and I found these a better product.",
      "rating": 5.0,
      "verified": true,
      "author": "yogee007",
      "helpful_votes": 0,
      "publication_date": 20150524
    },
    {
      "title": "Great Buds",
      "text": "I am pretty picky with my audio, but I'm absolutely no audiophile. I bought these to replace my old Klipsch earbuds and the difference is quite noticeable. These produce a much more equally distributed sound, while my Klipsch buds produced richer bass and worked at higher volumes, which is sometimes what I need as a student. Plus, the Klipsch were significantly better at keeping our external noise. However, these stay in my ear better, and produce a healthier, more natural playback.",
      "rating": 4.0,
      "verified": true,
      "author": "Vensez",
      "helpful_votes": 0,
      "publication_date": 20150812
    },
    {
      "title": "Comfortable, Great for Hands Free Calling, and Love the Color",
      "text": "I was looking for headphones that wouldn't hurt my ears. The rubber that holds the buds in your ears is very comfortable. I can wear them for a few hours without discomfort. They also have great sound. It is crisp like other Bose products I own. I have also used the microphone to make hands free calls and it is working great (no distortion and the sound is clear). I highly recommend these headphones. I also like the red color.",
      "rating": 5.0,
      "verified": true,
      "author": "Annie",
      "helpful_votes": 0,
      "publication_date": 20150307
    },
    {
      "title": "Great headphones, 1 major flaw.",
      "text": "The sound quality of these are good. Definitely within the price range and deliver the kind of Base you expect from Bose. My only grievance is the large amount of sound leakage. The plastic ear pieces do not have buds on the end to trap sound in the ear, so I found myself having to turn up the volume and getting looks from people around me since they could all hear my music. I had to buy a pair of plastic tips with buds from Bose for $10 (they normally come with the sound canceling models) which helped a lot with this issue.",
      "rating": 4.0,
      "verified": true,
      "author": "Chuck",
      "helpful_votes": 0,
      "publication_date": 20150621
    },
    {
      "title": "Bose",
      "text": "These headphones are truly amazing. I use them everyday for working and watching Netflix. These headphones actually allow you to hear some sounds that you probably wouldn't be able to hear with cheaper headphones. The wire is also very durable, don't know how many times I've gotten the wire stuck on the weight rack and it is flawless up to this point. I would definitely recommend getting these if you have the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Javi",
      "helpful_votes": 2,
      "publication_date": 20150219
    },
    {
      "title": "Great headphones!",
      "text": "I LOVE these earphones. I had the old model for well over a year before I managed to break them (my fault, not the manufacturer's), and just got these to replace them. The sound is fantastic, and I simply can't listen to cheap headphones anymore because they give me a headache. As other reviewers have said, the sound does tend to bleed, but I think that unless you have some hearing issues you can put it on a comfortable volume without bothering everyone around you (I work in a library and no one has complained about my music yet). All in all, these are the only headphones I'll ever buy, and they're 100% worth the price!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Cyanidesoybean",
      "helpful_votes": 0,
      "publication_date": 20141105
    },
    {
      "title": "Great sound & comfortable to wear",
      "text": "The sound of those things is absolutely amazing. And you can still heat what's going on around you if you have them in your ear for phone calls (as in leaving them in and waiting for a call). What I like most is that they do not hurt your ears at all - you can leave them in all day at the office and take calls as they come in without suffering from sore ears that most other in-ear headphones cause.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael R. Martin",
      "helpful_votes": 0,
      "publication_date": 20160113
    },
    {
      "title": "hoping to get better sound quality than the iphone earbuds",
      "text": "Meh. I bought these as a treat for myself, hoping to get better sound quality than the iphone earbuds. I think the apple earbuds sound better than these, honestly. These have a lot of bass, but the highs are non existent. They sound like the apple earbuds after 8-9 months of use when they get dull. Pretty disappointing. Would have never bought these if I could have tried them out beforehand. I find myself still reaching for my apple earbuds instead of these.",
      "rating": 2.0,
      "verified": true,
      "author": "J. Wilson",
      "helpful_votes": 0,
      "publication_date": 20151014
    },
    {
      "title": "Increadibly Clear Audio",
      "text": "Very clear audio for in the ear sized headphones. The bass is rich and I immediately compared these to my stock Samsung ear buds and the difference was significantly better. I have been running with these and they stay in my ear just fine. I also use them frequently while on an airplane and they are comfortable for long-term use. I've had them for about a month now and really like them and would recommend them.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 0,
      "publication_date": 20141130
    },
    {
      "title": "Old version is much better",
      "text": "I bought a pair of the original Bose earbuds that worked great for over a year. I used them extensively and eventually the volume rocker stopped functioning due to water damage from using them at the gym. I decided to replace them with these earbuds since I had such a great experience with the older earbuds. I bought these earbuds in January and it is now March and the earbuds are completely unusable. Any movement of the cord causes one of the two earbuds to drop its signal. I would not buy these again.",
      "rating": 2.0,
      "verified": true,
      "author": "Josh G.",
      "helpful_votes": 0,
      "publication_date": 20150327
    },
    {
      "title": "Love these",
      "text": "LOVE these Bose headphones... wanted a pair of headphones with great sound quality that were not over the ear and not ridiculously expensive. -These bose headphones have great sound quality for music and streaming TV and videos. - The fit is great, it comes with three different sizes for all different sizes of ears. The fit is snug and comfortable. - I also like how it syncs and works with my iPhone, I don't want to talk on my phone without it",
      "rating": 5.0,
      "verified": true,
      "author": "Kell",
      "helpful_votes": 0,
      "publication_date": 20150916
    },
    {
      "title": "Fit nice, sound great, case seems cheap",
      "text": "I'm used to high end headphones and earbuds, but I needed an affordable set of buds that weren't in-ear blocking all of the sound around me. These work great for that purpose and sound great as well. It takes a little getting used to when putting these in, but once you get the hang of it they're a breeze. I would say the case leaves a bit to be desired in the quality department...",
      "rating": 4.0,
      "verified": true,
      "author": "Jay R. Baker",
      "helpful_votes": 0,
      "publication_date": 20160413
    },
    {
      "title": "Works for Me",
      "text": "Great earphones so far. Took on our trip. Used on plane, phone and whisper. Expensive but sound and quality is excellent. Decided to try Bose and replace all the many other earphones I have purchased recently. Biggest plus for me is that I notice the volume level for the Bose is about 4x less than my other earphones! I modified it with the Stay Ear tips. Works for me. More bass but I can adjust frequency with my Samsung phone.",
      "rating": 5.0,
      "verified": true,
      "author": "rodney",
      "helpful_votes": 0,
      "publication_date": 20151008
    },
    {
      "title": "Such a massive disappointment! Was really hoping that with the name Bose ...",
      "text": "Such a massive disappointment! Was really hoping that with the name Bose and the price tag for these ear buds that I would love them, but they are crap. The one ear bud died within a month, so I'm left with really great sound in one ear. So the left side of my face is like \"this sounds awesome!!\" and the right side is like \"WHAT, DID YOU SAY SOMETHING!!??!\" For the quality of these things, just go with something cheaper since they are no worth the price tag at all. Really let down Bose!",
      "rating": 1.0,
      "verified": true,
      "author": "SassyGirl",
      "helpful_votes": 0,
      "publication_date": 20150728
    },
    {
      "title": "Comfortable and they stay in your ears",
      "text": "These stay in my ears while running, and most earbuds don't. The support arches are very soft; you can't even feel them when they are in and people can't see them. The sound is drastically better than your normal $20 earbuds and you can still here outside noise, which is good for me because I wear them running. If you're looking for high-quality earbuds that look good and won't hurt your ears after extending periods of listening, these are a great choice.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim Beamer",
      "helpful_votes": 0,
      "publication_date": 20151201
    },
    {
      "title": "No dramatic improvements from last gen",
      "text": "Wish they had made more significant advancements since the last generation. I used to own the IE2s and I cannot hear a difference at all. I wasn't expecting much but I don't think they made any improvements since the creation of this line of headphones. It's the same price as the old ones so at least they didn't make it a worse deal. They sound pretty good, but if you're thinking about upgrading from your MIE2s/IE2s don't bother. On my Droid DNA the buttons change the song or pause, no volume control.",
      "rating": 4.0,
      "verified": true,
      "author": "jah",
      "helpful_votes": 0,
      "publication_date": 20150226
    },
    {
      "title": "Very comfortable earbuds with great sound",
      "text": "The sound quality and comfort of these earbuds are the best I've been able to find. The silicone tips are great for running and never get uncomfortable. The earbuds also come with a clip, which is convenient for clipping to the neck of your shirt to keep the cord from flapping around too much. The only criticism that I have of these is that one earbud typically goes dead after 6-12 months, but I suspect that is from running and wearing it to the gym which causes a little bit of tugging as the cord/phone bounce around in my pocket. I wouldn't avoid this for that because it seems to happen with all earbuds.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160126
    },
    {
      "title": "Good comfort, but not for loud environments.",
      "text": "I love everything about these headphones except for the sound. They are the only ear buds that do not fall out of my ears! Very comfortable. But, the sound is very lacking. Low volume, not much bass/lows, decent mids/highs. I love the ear tips, but the sound doesn't do it for me, especially in a loud environment such as a gym or plane. (yes I've used them on long-haul flights.) Even with the volume at max, these headphones are not very loud.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20150101
    },
    {
      "title": "Wife Love Them",
      "text": "Bought these for my wife as a present, she always has problems with air buds being to large for her small ears, such as apple's standard size that comes with their phones and other products. These have three sizes of soft inserts, the smallest fit her perfectly and she is very impressed by the clarity of the sound they produce, when I asked her what she thought she said she loved them. A piece of foam over the microphone would be a good way to keep wind noise down, this is common to most ear buds of this style.",
      "rating": 5.0,
      "verified": true,
      "author": "CRS",
      "helpful_votes": 0,
      "publication_date": 20150723
    },
    {
      "title": "NO WARRANTY BEWARE",
      "text": "Bought on May 10 order. 4 months later they just stop working. Paid $129.95. N0 WARRANTY. THAT IS BEYOND SAD. THAT is wrong. THIS is a huge investment for me. Extremely disappointed. Boise would not register because it did not recognize the serial number. So much for Amazon products with Brand Names. AMAZING HELP FROM BOSE LOCAL STORE. THEY EXCHANGED THEM FOR FREE. LET GO LET GOD. AMEN",
      "rating": 1.0,
      "verified": true,
      "author": "Suzz",
      "helpful_votes": 0,
      "publication_date": 20150915
    },
    {
      "title": "Stylish, comfy, and great sound!",
      "text": "These are my favorite headphones ever. I got my first pair as a gift and when I lost them I promptly ordered another without hesitation! I love how they fit snugly in your ear and don't move around. But they're not too tight -- if you catch the wire on a doorknob it won't rip your ear off. Amazing headphones!",
      "rating": 5.0,
      "verified": true,
      "author": "Stephen Baal",
      "helpful_votes": 0,
      "publication_date": 20160213
    },
    {
      "title": "You can never go wrong with Bose!",
      "text": "These are the best!! I've gone through many different headphones and not only do they produce great sound but they are the most comfortable I've ever worn. Most headphones/ear buds hurt my ears after awhile but I wore these on a 5-hour flight with no discomfort at all. I have many Bose products and they never disappoint. I think these were an older model which is why the price was lower than this years model but that is fine with me. I love that they come with different sizes of in-ear buds.",
      "rating": 5.0,
      "verified": true,
      "author": "Dawn",
      "helpful_votes": 0,
      "publication_date": 20151124
    },
    {
      "title": "Best Headphones for Active Use",
      "text": "I hope these never break. I've had them for a long time, carry them with me everywhere, stuffed in a bag that I cram in my purse or my briefcase. I have tried so many different types and these are by far the best. They get abused frequently, but still work as expected. I use them outdoors with everything and can hear clearly. They have yet to fall out even with heavy activity. If I could change one thing, I would make the cords flat so that they tangle less.",
      "rating": 5.0,
      "verified": true,
      "author": "OceanGirl",
      "helpful_votes": 0,
      "publication_date": 20151002
    },
    {
      "title": "Very happy with Bose!",
      "text": "I have never been disappointed with Bose, and these ear buds are no exception. The sound quality is what I expect from Bose. They are very comfortable in my ears. I wear them all day at work, and they never fall out. I had an older pair of Bose buds (different style), and the tips use to fall off easily. Not these. No on has complained that it's hard to understand me when I talk on the phone, and phone conversations are crystal clear on my end. I would definitely recommend these ear buds.",
      "rating": 5.0,
      "verified": true,
      "author": "craz3z",
      "helpful_votes": 3,
      "publication_date": 20140930
    },
    {
      "title": "Great phones- but replace the tips with Stay Hear for better performance.",
      "text": "These are great headphones, but Bose should really change the tips to the StayHear version which also fits these phones. The new tips make all the difference in the world, taking these from an adequate headphone to an exceptional isolation headphone in just one step. The isolation tips are comfortable to wear and sleep in and make the sound a much nicer crisper tone, but with great bass. I would buy these again, but at first chance would replace the tips with Stay Hear tips. 4-Stars for these since I had to replace the tips for better performance.",
      "rating": 4.0,
      "verified": true,
      "author": "Veronica M.",
      "helpful_votes": 0,
      "publication_date": 20151202
    },
    {
      "title": "Sounds great, comfortable, and terrible cord.  8/10",
      "text": "I was initially hesitant to spend this much for some ear buds, but WOW! Feels really good in ear, even after long periods. Sound quality is top notch for lows and highs, no ear-achiness like some ear buds get after 2-3 hours. Bad: The cord is just garbage, its too stiff and gets in the way. It's like the QC team forgot to inspect or product test that part this design.",
      "rating": 4.0,
      "verified": true,
      "author": "Scuba_Steve",
      "helpful_votes": 0,
      "publication_date": 20151113
    },
    {
      "title": "worked great for a year of heavy use",
      "text": "worked great for a year of heavy use, now I have to twist the wire to get sound out of just one headphone, but to be fair, these are my gym headphones, and I am not that gentle on them. Great sound quality, and they did a good job of blocking out the sounds of an active gym.",
      "rating": 4.0,
      "verified": true,
      "author": "Nick",
      "helpful_votes": 0,
      "publication_date": 20170921
    }
  ],
  "product_meta": {
    "title": "Bose Freestyle Earbuds, Indigo - Wired",
    "description": "Your music says a lot about you. So do your headphones. Bose FreeStyle Earbuds feature fresh designs, a comfortable fit and full-range sound that will surprise you. Whether you're listening to your favorite songs or discovering new ones. Pushing yourself to the limit or just hanging out. Includes 3 sets of StayHear tips (S/M/L) for a perfect fit. Available in Ice Blue or Indigo, with a color-coordinated carrying case.",
    "rating": 4.3,
    "feature_bullets": [
      "Colorful designs to suit your style",
      "Deep, clear sound, so you'll love the music you love even more",
      "Comfortable fit no matter how long your playlist is",
      "Built heavy-duty to stand up to your active life",
      "Easily switch from calls to music with inline Mic/remote",
      "Connectivity technology : Wired"
    ],
    "specifications": {
      "Product Dimensions": "45.25 x 6 x 7.5 inches",
      "Item Weight": "0.6 ounces",
      "Manufacturer": "Bose Corporation",
      "ASIN": "B00ISIG690",
      "Item model number": "625946-0020",
      "Batteries": "1 Lithium ion batteries required.",
      "Customer Reviews": "4.3 out of 5 stars3,483 ratings4.3 out of 5 stars",
      "Best Sellers Rank": "#11,776 in Earbud & In-Ear Headphones",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "April 6, 2014"
    },
    "categories": [
      "Earbud Headphones",
      "Electronics",
      "Headphones"
    ],
    "price": ""
  }
}