{
  "website_summaries": [
    {
      "verdict": "Functional and fashion-forward jacket featuring combination of 2 types of weave, for men with an active lifestyle.",
      "pros": [
        "Quality-crafted combination of jacquard knit and heavyweight sweater knit bonded to anti-pill fleece",
        "Excellent for active lifestyles",
        "Features a brushed microfiber inner collar, reverse coil zipper in front, zipper hand pockets, and locker loop",
        "Comes in a large variety of colors"
      ],
      "cons": [
        "Fabric snags easily, and it is not fully wind-proof"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great looking sweater",
      "text": "Great looking sweater. I receive many compliments on it. there are a few downsides (hence the 4 stars): #1 This sweater snags easily. You really do need to keep an eye out on surfaces. When this thing rubs against something rough, you will pull threads. This results in little tuffs across the surface. #2 Long sleeves suck with this. The fabric on the inside of the sleeves makes it difficult to get a long sleave shirt in it. You have to do quite a bit of adjustment afterward. #3 Not for windy days. While this is a pretty warm sweater, a chilly wind will cut right through it.",
      "rating": 4.0,
      "verified": true,
      "author": "Tyler Kiser",
      "helpful_votes": 13,
      "publication_date": 20171224
    },
    {
      "title": "Love this. Put it on and you are Jason Bourne or Bond... Well... Does that to me, alright?",
      "text": "Spent the winter in this jacket. How is it this thing makes you feel like Bourne or James Bond when you put it on? How'd they do that? Theme music plays... You start lookin for bad guys... Kidding. pros: butt kickin good looking coat. Warm as heck. Just love this design and the green rocks. HEAVY for a jacket. cons: can get picked/pilled by things, but not bad. Wind can penetrate this pretty easy... so need another outer shell for high wind. Not sure about rain, think you'd be soaked, as this is not a tight weave.",
      "rating": 5.0,
      "verified": true,
      "author": "Just Another Amazonian Like You",
      "helpful_votes": 7,
      "publication_date": 20150318
    },
    {
      "title": "Almost perfect.",
      "text": "Great textured outer shell, very warm, feels like a very well make, high quality sweater. My only concern is that that pockets have a very thin mesh-like fabric backing that you can see through from the inside making me cautious that any sharp object like keys, a pen, etc will poke through or cut the fabric....just odd that everything else on the sweater is great, but this is the weak point.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 6,
      "publication_date": 20160129
    },
    {
      "title": "Nice looking.  But that's about it.",
      "text": "Wind goes right through it, not particularly warm, lack of additional pockets (besides handwarmer) is a problem.",
      "rating": 2.0,
      "verified": true,
      "author": "Robert Y.",
      "helpful_votes": 3,
      "publication_date": 20171210
    },
    {
      "title": "Larger than expected; Medium fit a guy who ALWAYS wears large....",
      "text": "Nice “waffle weave” exterior. Color looks more muddy, until it gets under fluorescent lights, and then “Pop! Wow!” Originally ordered the large (because he always wears a large), and it was much too big; exchanged for the medium, which fits great (and was $30+ less expensive!) He really likes that it has “weight” and feels “heavy” (good for those who like such qualities).",
      "rating": 5.0,
      "verified": true,
      "author": "TBH22",
      "helpful_votes": 0,
      "publication_date": 20190103
    },
    {
      "title": "Five Stars",
      "text": "Looks anf feels great. Be aware there are Different thicknesses of these and this is a heavyweight one.",
      "rating": 5.0,
      "verified": true,
      "author": "Mikswah",
      "helpful_votes": 15,
      "publication_date": 20141026
    },
    {
      "title": "Really warm and good looking",
      "text": "Got this for my husband for his birthday. I had one and he always commented how cool it js so i finally found one for him too. He says it’s really really warm and loves it. Looks good and of good quality too.",
      "rating": 5.0,
      "verified": true,
      "author": "Tijana",
      "helpful_votes": 0,
      "publication_date": 20200222
    },
    {
      "title": "Absolutely great sweater. I use it for ultra cold days ...",
      "text": "Absolutely great sweater. I use it for ultra cold days when snowboarding as a mid layer, under my jacket. Never been warmer. It really is a high quality piece of gear, and worth the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Kyle",
      "helpful_votes": 0,
      "publication_date": 20170520
    },
    {
      "title": "Excellent quality !!!",
      "text": "This jacket was a gift to my father. I had it shipped directly to his house. It arrived exactly on time. The quality of the jacket was excellent and my father was ecstatic . We especially liked the weave of the material on the out side of jacket, i've never seen anything like it. And with the fleece liner it should be especially warm",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170720
    },
    {
      "title": "Good fit and nice material with a thick lining",
      "text": "Good fit and nice material with a thick lining. Only problem is that there is no black on it like in the picture. It is one solid color.",
      "rating": 4.0,
      "verified": true,
      "author": "GK005",
      "helpful_votes": 11,
      "publication_date": 20140927
    },
    {
      "title": "Well made and stylish!",
      "text": "Well made and stylish. An excellent mid-layer underneath a medium weight to heavy weight jacket when it is really cold out, or as an outer layer over a merino wool mock neck when it is cool/not too cold out. NOTE - this jacket is cut for someone who is in shape = a slender-to-athletic build. You can wear it casually with jeans and shoes/boots or slightly dressy if you know how to match colors and fabrics. I have three of them in my wardrobe.",
      "rating": 5.0,
      "verified": true,
      "author": "JohnNYC",
      "helpful_votes": 2,
      "publication_date": 20160307
    },
    {
      "title": "This is now one of my favorite sweaters and brands",
      "text": "This is now one of my favorite sweaters and brands. It is both light and VERY WARM. It is more a jacket than a sweater. The styling is excellent. I liked it so much I bought a second color.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20180221
    },
    {
      "title": "Really looks and feels very nicely made, but it does fit small",
      "text": "Really looks and feels very nicely made, but it does fit small. I am a big guy and normally wear a 3XL in coats, shirts, etc... This really fits 1-2 sizes too small. Which is a shame, because I really like it.",
      "rating": 3.0,
      "verified": true,
      "author": "t0ys0ld1er003",
      "helpful_votes": 0,
      "publication_date": 20160928
    },
    {
      "title": "This \"sweater\" is very comfortable, and the quality is impeccable",
      "text": "This \"sweater\" is very comfortable, and the quality is impeccable. The arms are cut a bit long, but that's ok, as the only time I wear this is when it's just cool enough outside to want to \"turtle up\" my hands into the arms. Wind does burst right through it though, so keep that in mind when purchasing it. However, I think I look pretty sexy in this thing. Oh yeah!",
      "rating": 4.0,
      "verified": true,
      "author": "Darren K. Peterson",
      "helpful_votes": 0,
      "publication_date": 20150402
    },
    {
      "title": "He doesn't like bulky jackets",
      "text": "My son is very picky about his outerwear. He doesn't like bulky jackets. He loved this one so much that he wouldn't take it off once he was in the house. It was warm enough to wear all winter and still looks brand new.",
      "rating": 5.0,
      "verified": true,
      "author": "jason costa",
      "helpful_votes": 0,
      "publication_date": 20160513
    },
    {
      "title": "Luxurious sweater",
      "text": "Loved the color, the fit, the texture and the fleece.",
      "rating": 5.0,
      "verified": true,
      "author": "Lee Collins",
      "helpful_votes": 0,
      "publication_date": 20190424
    },
    {
      "title": "GREAT BRAND!!!",
      "text": "I saw a guy wearing a blue one on the street and I asked him about it. After I learned the brand name I went home and looked it up and bought the red one. I absolutely love it! GREAT quality, color and I look really GOOD in it! I'll be checking out more of the Spyder stuff in the future!",
      "rating": 5.0,
      "verified": true,
      "author": "Rayme Sciaroni",
      "helpful_votes": 0,
      "publication_date": 20160616
    },
    {
      "title": "Very nice product. One of those brands that really screams ...",
      "text": "Very nice product. One of those brands that really screams quality. Its well made, stylish.... Almost too thick, will need some pretty cold weather for this but excellent.",
      "rating": 5.0,
      "verified": true,
      "author": "RickWW",
      "helpful_votes": 0,
      "publication_date": 20160731
    },
    {
      "title": "The jacket is nice and warm and came to the house very quickly",
      "text": "My husband got paint on his jacket (2013 version) so I had to find a replacement. This worked perfectly. The jacket is nice and warm and came to the house very quickly.",
      "rating": 5.0,
      "verified": true,
      "author": "HallKAL",
      "helpful_votes": 0,
      "publication_date": 20170201
    },
    {
      "title": "No as warm as it looks",
      "text": "The jacket is of high quality, but it's almost more like a sweater than a winter jacket. I found the wind goes right through it in the sleeves.",
      "rating": 2.0,
      "verified": true,
      "author": "JMA2005",
      "helpful_votes": 0,
      "publication_date": 20180209
    },
    {
      "title": "Thin but warm",
      "text": "Fantastic jacket. Amazed at how thin it is but how warm it keeps me.",
      "rating": 5.0,
      "verified": true,
      "author": "Adam",
      "helpful_votes": 0,
      "publication_date": 20170705
    },
    {
      "title": "Beautiful jacket! One of the most comfortable jackets I ...",
      "text": "Beautiful jacket! One of the most comfortable jackets I have ever worn. Fits true to size.",
      "rating": 5.0,
      "verified": true,
      "author": "L. Sid",
      "helpful_votes": 2,
      "publication_date": 20160804
    },
    {
      "title": "Nice jacket. Heavier than I was expecting so I ...",
      "text": "Nice jacket. Heavier than I was expecting so I should have bought the lighter weight jacket. Sleeves tend to run long, which I hear is consistent with these jackets.",
      "rating": 3.0,
      "verified": true,
      "author": "Levi",
      "helpful_votes": 0,
      "publication_date": 20170423
    },
    {
      "title": "Exceptional Core...",
      "text": "Great core, and works well with the Spyder shell (Enforcer) that I have when it gets really cold. Breathes nicely, so I'm always warm without overheating...",
      "rating": 5.0,
      "verified": true,
      "author": "DJ Harrison",
      "helpful_votes": 0,
      "publication_date": 20170228
    },
    {
      "title": "Perfect gift for my grown, hard to please son!",
      "text": "Jacket is beautiful. My son had really wanted it but the local Sports Authority was charging so much he felt too guilty to purchase it. Came home & saw your price & ordered right away. Had to return the original as I must have erroneously ordered an extra large & meant to order large. Fits well except arms are too long,but he doesn't mind. This was my first attempt to order from Amazon directly and found the experience very good overall. Thanks!",
      "rating": 4.0,
      "verified": true,
      "author": "Kathleen Williams",
      "helpful_votes": 0,
      "publication_date": 20150115
    },
    {
      "title": "Great, very warm, but doesn't block wind",
      "text": "This is a great jacket. It looks awesome, feels great, and is super warm. If you plan to use it somewhere windy, you'll need a soft shell (wind breaker) on top of this.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe",
      "helpful_votes": 3,
      "publication_date": 20141229
    },
    {
      "title": "... Jacket is thick and the inner lining is very comfortable but the lining for the pockets are fairly thin",
      "text": "The Jacket is thick and the inner lining is very comfortable but the lining for the pockets are fairly thin. There is a problem with the right pocket with the inner lining always being caught in the zipper. If you're a person that doesn't use the zipper on the pockets often it's not a problem but if you are a person who does use the zippers often then this may be an issue.",
      "rating": 4.0,
      "verified": true,
      "author": "Carl Cho",
      "helpful_votes": 0,
      "publication_date": 20150319
    },
    {
      "title": "Very classy",
      "text": "Love it and very classy. If your large then order larger than you normally would if you want it loose fit",
      "rating": 5.0,
      "verified": true,
      "author": "Mr Jo Smo",
      "helpful_votes": 0,
      "publication_date": 20171216
    },
    {
      "title": "I love this sweater coat",
      "text": "I love this sweater coat. At about ~35+ F (~2 C) 'Real Feel' weather I wear just this coat, and below that I put another light coat over this one. I'm used to the cold however being from the upper mid west in the US, so take that into consideration for your own warmth needs in different temperatures. The inside lining on this coat is a nice soft/fluffy lining. The other thing that I like quite a bit about this coat unlike some other coats is that comparatively there is next to no static shock when taking the coat off.",
      "rating": 5.0,
      "verified": true,
      "author": "austinp",
      "helpful_votes": 0,
      "publication_date": 20151221
    },
    {
      "title": "Five Stars",
      "text": "Very warm but yet very light weight jacket! This product is of high qaulity and I would reccomend!",
      "rating": 5.0,
      "verified": true,
      "author": "T. Travis",
      "helpful_votes": 0,
      "publication_date": 20170112
    },
    {
      "title": "It is a great value when you purchase it for less than $85 ...",
      "text": "It is a great value when you purchase it for less than $85 considering it goes for 170 in stores. Very nice quality although the sleeves are longer then usual.",
      "rating": 5.0,
      "verified": true,
      "author": "Earl",
      "helpful_votes": 0,
      "publication_date": 20160202
    },
    {
      "title": "Great fit his light and keeps you warm",
      "text": "Amazing design amazing fit keeps you warm and it’s very lightweight. I like the black one better than the gray one",
      "rating": 5.0,
      "verified": true,
      "author": "ghaith f musmar",
      "helpful_votes": 0,
      "publication_date": 20200228
    },
    {
      "title": "Five Stars",
      "text": "I love this jacket, very warm and it looks great!",
      "rating": 5.0,
      "verified": true,
      "author": "Customer X",
      "helpful_votes": 0,
      "publication_date": 20170608
    },
    {
      "title": "Five Stars",
      "text": "I just love this Spyder stuff. Really comfortable and warm.",
      "rating": 5.0,
      "verified": true,
      "author": "Comet Tim",
      "helpful_votes": 0,
      "publication_date": 20180305
    },
    {
      "title": "Best jacket I have ever bought",
      "text": "Best jacket I have ever bought. Extremely warm & comfortable. Highly recommend it, & I purchased others as Christmas gifts",
      "rating": 5.0,
      "verified": true,
      "author": "Chad Chapel",
      "helpful_votes": 0,
      "publication_date": 20161209
    },
    {
      "title": "Very Nice",
      "text": "Fits perfectly, I got a large and I am generally right between large and extra large. Nice and heavy but not uncomfortable. It is green with black. Someone said theirs had no black but mine does. I bought this because I like my buddy's core sweater. The think the core sweater is a tad heavier.",
      "rating": 5.0,
      "verified": true,
      "author": "Here to Help",
      "helpful_votes": 0,
      "publication_date": 20170131
    },
    {
      "title": "Five Stars",
      "text": "Perfect for my son this fall and winter. These items were purchased at his request and he loves them.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20161209
    },
    {
      "title": "Typical spyder...awesome.",
      "text": "Very heavy and warm. Great fit and stylish. Great quality. Definitely recommend anything spyder.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Harvey",
      "helpful_votes": 0,
      "publication_date": 20170207
    },
    {
      "title": "beautiful!  worth every penny.",
      "text": "Beautifully detailed with an interesting outer material. Reminded me of the texture of a fine chain mail. Its gorgeous. Inside is fleece around the back and sides. Bought it for my husband and he has taken it off yet! He loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20141226
    },
    {
      "title": "Love it!",
      "text": "Love this jacket. I bought it because my (comparably priced) TNF jacket looks old after only a year. The Spyder is also much warmer and keeps out the wind.",
      "rating": 5.0,
      "verified": true,
      "author": "JW",
      "helpful_votes": 0,
      "publication_date": 20160129
    },
    {
      "title": "Really nice sweater...",
      "text": "Awesome sweater. Come fall/winter... we'll see how it holds up but my relatives have them and dig them.",
      "rating": 5.0,
      "verified": true,
      "author": "Frank Sandbeans",
      "helpful_votes": 0,
      "publication_date": 20160803
    },
    {
      "title": "Two Stars",
      "text": "nice and warm but it is one size too large. Buy one size down.",
      "rating": 2.0,
      "verified": true,
      "author": "Dave",
      "helpful_votes": 0,
      "publication_date": 20160107
    },
    {
      "title": "Five Stars",
      "text": "Spider make some excellent outdoor clothing. This is a great sweater.",
      "rating": 5.0,
      "verified": true,
      "author": "bloal",
      "helpful_votes": 0,
      "publication_date": 20170108
    },
    {
      "title": "Five Stars",
      "text": "This was a gift for my son-in-law at Christmas. He loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170125
    },
    {
      "title": "Fit, Quality and Look",
      "text": "Fits very well, the fabric is premium quality that keeps the body warm in 10 degree F weather and it looks great.",
      "rating": 5.0,
      "verified": true,
      "author": "William R",
      "helpful_votes": 0,
      "publication_date": 20200121
    },
    {
      "title": "Five Stars",
      "text": "Great product as expected, fits well, would recommend to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Lance L. Johnson",
      "helpful_votes": 0,
      "publication_date": 20160319
    },
    {
      "title": "Five Stars",
      "text": "Great jacket, amazingly warm for the size, Spyder makes some of the best products on the market",
      "rating": 5.0,
      "verified": true,
      "author": "Martin",
      "helpful_votes": 0,
      "publication_date": 20161119
    },
    {
      "title": "Great Jacket!",
      "text": "I wear it all the time! I get compliments on it all the time. I really like how soft and warm it is on the inside. I actually liked it so much I got a matching one for my brother.",
      "rating": 5.0,
      "verified": true,
      "author": "CH CH CH CHIA",
      "helpful_votes": 0,
      "publication_date": 20160101
    },
    {
      "title": "Stylish and functional sweater",
      "text": "Toasty warm and stylish. Perfect jacket/sweater for mild winter days. Washes and dries beautifully.",
      "rating": 5.0,
      "verified": true,
      "author": "trixie friganza",
      "helpful_votes": 0,
      "publication_date": 20160119
    },
    {
      "title": "Five Stars",
      "text": "I love this jacket. the heavy texture of it makes me feel very cozy.",
      "rating": 5.0,
      "verified": true,
      "author": "Penelope ;)",
      "helpful_votes": 0,
      "publication_date": 20170412
    },
    {
      "title": "Love it! The price is way cheaper than in ...",
      "text": "Love it! The price is way cheaper than in stores (even with coupons, cash back). In Northern Virginia this will cover a winter jacket for most of the season. Spyder never goes on sale in retail stores (Dicks, Gandor, Sports Authority etc.) the retail tag shows $169.99 and that is what you would pay in store, but not here on Amazon. The fit is athletic, the quality is superb and Spyder supporting our Veterans. You can't ask for more from Amazon on this one. Oh and this jacket is indeed the very heavy weighted one.",
      "rating": 5.0,
      "verified": true,
      "author": "JT",
      "helpful_votes": 3,
      "publication_date": 20141229
    },
    {
      "title": "Colors not as shown",
      "text": "The color description of the sweater is cirrus/ploar and the sweater in the picture is white/grey. The actual color of the sweater is grey/darker grey. If the manufacturer or seller want to use exotic color names, then the picture of the product should very clearly demonstrate the actual color of the product.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20151230
    },
    {
      "title": "Excellent sweater/jacket",
      "text": "6'4\" 205. XL fits great. I wear L tall or XL in most shirts and jackets.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20160729
    },
    {
      "title": "Spyder is made very well !",
      "text": "Heavyweight. It will be great in the fall and winter. Very well made. A+++++",
      "rating": 5.0,
      "verified": true,
      "author": "Phast Phred",
      "helpful_votes": 0,
      "publication_date": 20160621
    },
    {
      "title": "Great fit and very warm",
      "text": "Great fit and very warm, just used it in 20 degree weather with a light shell on top and had to unzip a bit",
      "rating": 5.0,
      "verified": true,
      "author": "Steve K.",
      "helpful_votes": 0,
      "publication_date": 20180302
    },
    {
      "title": "Absolutely love this item",
      "text": "Absolutely love this item. Received quickly and in great condition. Fits the way it should, long enough in arms and roomy without being baggy. Would definitely recommend this item.",
      "rating": 5.0,
      "verified": true,
      "author": "Gee Buttersnaps",
      "helpful_votes": 0,
      "publication_date": 20151116
    },
    {
      "title": "Very nice quality and warm",
      "text": "Very nice quality and warm. I am very impressed with this purchase. I would definitely recommend this jacket. Shipping was very fast.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin",
      "helpful_votes": 0,
      "publication_date": 20161112
    },
    {
      "title": "Love this sweater",
      "text": "This jacket is perfect for Cleveland OH weather down until about 25 to 30 degrees. It's not to bad in the wind. Spyder does not rate this sweater for wind I found out. None the less I'm very happy with this jacket.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark Z",
      "helpful_votes": 0,
      "publication_date": 20150118
    },
    {
      "title": "Price",
      "text": "This was a super deal. Most stores charge 180 for this",
      "rating": 5.0,
      "verified": true,
      "author": "leonard giardini",
      "helpful_votes": 0,
      "publication_date": 20200525
    },
    {
      "title": "Fit him perfect and the color was really striking",
      "text": "Given as gift to brother in law. Everything about this sweater was high end. Fit him perfect and the color was really striking. He loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161228
    },
    {
      "title": "Quality/PRice - what more can I ask for?",
      "text": "Excellent product - and an unbelievable price! Much less than retail",
      "rating": 5.0,
      "verified": true,
      "author": "B. Beck",
      "helpful_votes": 0,
      "publication_date": 20151226
    },
    {
      "title": "worth the price",
      "text": "My husband wears a 3x t shirt and it fit perfectly! He loves how warm it keeps him and how thin it is.",
      "rating": 5.0,
      "verified": true,
      "author": "Ishtar81",
      "helpful_votes": 0,
      "publication_date": 20160129
    },
    {
      "title": "Five Stars",
      "text": "jacket fits perfectly and I am able to feel the heat generated inside of jacket.....",
      "rating": 5.0,
      "verified": true,
      "author": "Mr Jones",
      "helpful_votes": 0,
      "publication_date": 20161026
    },
    {
      "title": "good jacket",
      "text": "Good jacket. Heavy. Runs large. I typically wear lg. But if size down. Cant have another layer. But often do not need one.",
      "rating": 4.0,
      "verified": true,
      "author": "maverick",
      "helpful_votes": 0,
      "publication_date": 20150517
    },
    {
      "title": "Great fit and quality!!",
      "text": "Comfortable, great fitted outerwear. Had a defective zipper , however, Amazon overnighted a replacement.Great service!! Very satisfied. Will definately purchase other items by Spyder from Amazon.",
      "rating": 5.0,
      "verified": true,
      "author": "BRUCE,",
      "helpful_votes": 0,
      "publication_date": 20150225
    },
    {
      "title": "Great deal!",
      "text": "True to size. My husband has worn it all winter and has held up well. Great deal because it cost much more in retail stores.",
      "rating": 5.0,
      "verified": true,
      "author": "dabbott1380",
      "helpful_votes": 0,
      "publication_date": 20170312
    },
    {
      "title": "Great fit!",
      "text": "This is a nice jacket. It is very warm, well-designed and looks great!",
      "rating": 5.0,
      "verified": true,
      "author": "Deb S.",
      "helpful_votes": 0,
      "publication_date": 20180125
    },
    {
      "title": "Otherwise looks good.",
      "text": "first one started to fray almost immediately. Otherwise looks good.",
      "rating": 4.0,
      "verified": true,
      "author": "EKH",
      "helpful_votes": 0,
      "publication_date": 20160424
    },
    {
      "title": "Ordered a large, and the tag on the coat ...",
      "text": "Ordered a large, and the tag on the coat said large but the tag attached to the inside was an extra large. It ended up being way to big",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170314
    },
    {
      "title": "Well made and nice looking. Cut for an athletic figure",
      "text": "Gorgeous sweater. Well made and nice looking. Cut for an athletic figure...I'm 6' 3\" and 200 lbs. the XL fits nicely.. I can just feel it up in the armpit area a little but you kinda get used to it. It's not a loose, baggy fit. Very pleased with it!",
      "rating": 5.0,
      "verified": true,
      "author": "Scott Calkins",
      "helpful_votes": 0,
      "publication_date": 20150220
    },
    {
      "title": "Five Stars",
      "text": "best jacket I own..warm as can be and compliments every single time I wear it.",
      "rating": 5.0,
      "verified": true,
      "author": "Lorenzo",
      "helpful_votes": 0,
      "publication_date": 20160321
    },
    {
      "title": "Great Product",
      "text": "High quality sweater that will keep you warm as a layer or jacket. Best used in the high 20's and above if using it as a jacket. You have to be careful to avoid snags, especially with gloves that have a Velcro closure. Overall, a high quality, sharp looking product.",
      "rating": 5.0,
      "verified": true,
      "author": "JRG",
      "helpful_votes": 0,
      "publication_date": 20150111
    },
    {
      "title": "Five Stars",
      "text": "Tried on at Scheels, but found for $50 cheaper on Amazon, so knew exactly what I was getting.",
      "rating": 5.0,
      "verified": true,
      "author": "RL",
      "helpful_votes": 4,
      "publication_date": 20141028
    },
    {
      "title": "Great",
      "text": "My son loves it. It is warm and stylish. Great coat",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer Lovett",
      "helpful_votes": 0,
      "publication_date": 20151118
    },
    {
      "title": "Four Stars",
      "text": "I usually wear M size. This one is little large for me.",
      "rating": 4.0,
      "verified": true,
      "author": "Krishna",
      "helpful_votes": 0,
      "publication_date": 20160513
    },
    {
      "title": "Great gift purchase!",
      "text": "I bought this sweater/coat for my brother for Christmas. It has a nice weight to it and the fit was very true to his size. The only thing he was disappointed about was that it's not warm enough to wear outside as a light coat - the air whips right through it. Other than that he was super happy with it.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer bob schwartz",
      "helpful_votes": 0,
      "publication_date": 20160128
    },
    {
      "title": "Five Stars",
      "text": "Excellent jacket, warm and definitely keep the rain off of you, plus I get a lot of compliments.... Yes!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170430
    },
    {
      "title": "High Quality , Great Fit",
      "text": "Great trim fit , High quality sweater/jacket . Looks even better in person than it does online. I am 5 10\" 170lbs and the medium fits perfectly.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161122
    },
    {
      "title": "Five Stars",
      "text": "Awesome fit! Awesome jacket. Love it looks great wears very well.",
      "rating": 5.0,
      "verified": true,
      "author": "mike",
      "helpful_votes": 0,
      "publication_date": 20170227
    },
    {
      "title": "Great Bang for the buck!",
      "text": "I love this jacket!! It looks very professional and the texture isn't like any other so stands out above the crowd. I get a lot of compliments on it! This jacket usually retails for $169",
      "rating": 5.0,
      "verified": true,
      "author": "Bradley Miller",
      "helpful_votes": 0,
      "publication_date": 20160218
    },
    {
      "title": "Four Stars",
      "text": "Nice warm jacket. Just wish the cut was a little trimmer.",
      "rating": 4.0,
      "verified": true,
      "author": "Harry Brinkley",
      "helpful_votes": 4,
      "publication_date": 20141025
    },
    {
      "title": "and he looks great in it",
      "text": "My husband absolutely loves this jacket, and he looks great in it!",
      "rating": 5.0,
      "verified": true,
      "author": "bhardy979",
      "helpful_votes": 0,
      "publication_date": 20160126
    },
    {
      "title": "Cool jacket , material \"pulls\"  easily !",
      "text": "Pros: Like the jacket, like the look, warm. Cons: material seems to get \" pulls\" in the material very easy, little disappointed that this happens especially at the cost of this jacket.",
      "rating": 4.0,
      "verified": true,
      "author": "michael bennett",
      "helpful_votes": 0,
      "publication_date": 20150420
    },
    {
      "title": "Great coat. I had tried this coat on at ...",
      "text": "Great coat. I had tried this coat on at the store so I knew it ran large. I wear a large in all shirts and coats. In this coat I wear a medium.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Staley",
      "helpful_votes": 0,
      "publication_date": 20150310
    },
    {
      "title": "Five Stars",
      "text": "Awesome Jacket!!! This is now my husbands favorite jacket! It's warm and very comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Twinsplus1",
      "helpful_votes": 0,
      "publication_date": 20150309
    },
    {
      "title": "Great jacket",
      "text": "Great jacket. Surprisingly warm - for the typical guy I think you can consider this your casual winter jacket. Sufficiently roomy for normal clothing e.g. sweater underneath, but you aren't swimming in it either. Note that it is not wind resistant. Also note that photos with the black underneath the sleeves are inaccurate - the entire jacket is gray. That didn't matter to me however. Seller wasn't Amazon but it arrived on time and as expected. I love the jacket.",
      "rating": 5.0,
      "verified": true,
      "author": "Davey Jones",
      "helpful_votes": 4,
      "publication_date": 20150312
    },
    {
      "title": "One of the best jackets I've ever owned (though it is technically a ...",
      "text": "One of the best jackets I've ever owned (though it is technically a sweater...). Lightweight and very warm. Would have liked more pockets particularly interior.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Johnson",
      "helpful_votes": 0,
      "publication_date": 20150101
    },
    {
      "title": "Not for me",
      "text": "Material was nice but size of it seems like it's for someone with a larger gut",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160127
    },
    {
      "title": "HEAVY WEIGHT IS TOO HEAVY FOR LIGHTWEIGHT DUDE",
      "text": "This is indeed HEAVY WEIGHT and I prefer the other lighter SPYDER styles that can be worn as a layer under a parka or vest while skiing. This garment is intended to be THE top garment and is bulky and heavy. I like the full length zipper and pockets....but I prefer the lighter weight which can be used more year round. I returned the jacket and got credit from AMAZON.",
      "rating": 2.0,
      "verified": true,
      "author": "SeniorSkier@72",
      "helpful_votes": 0,
      "publication_date": 20170430
    },
    {
      "title": "Three Stars",
      "text": "No inside pocket and the sleeve the air go true",
      "rating": 3.0,
      "verified": true,
      "author": "enriquearaujo",
      "helpful_votes": 0,
      "publication_date": 20170304
    },
    {
      "title": "Perfect jacket. My husband loves it and says its ...",
      "text": "Perfect jacket. My husband loves it and says its very warm.",
      "rating": 5.0,
      "verified": true,
      "author": "beachpeople",
      "helpful_votes": 0,
      "publication_date": 20160211
    },
    {
      "title": "Five Stars",
      "text": "I liked it very much. Slim design and nice material. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Myoung-Joon Kim",
      "helpful_votes": 0,
      "publication_date": 20151031
    },
    {
      "title": "Three Stars",
      "text": "Fits great and very warm. Threads pull very easily, keep it away from velcro.",
      "rating": 3.0,
      "verified": true,
      "author": "kevin williams",
      "helpful_votes": 0,
      "publication_date": 20150318
    },
    {
      "title": "Good quality. Very happy with this purchase",
      "text": "This is a relatively light Jacket that is very warm. Good quality. Very happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike Peterson",
      "helpful_votes": 0,
      "publication_date": 20141218
    },
    {
      "title": "Would recommend",
      "text": "Very warm, unless it's super windy. Fits true to size.",
      "rating": 5.0,
      "verified": true,
      "author": "bigs024",
      "helpful_votes": 6,
      "publication_date": 20141124
    },
    {
      "title": "Great jacket/sweater!",
      "text": "Looked great in the photos but even better when you have it in front of you! Very thick as the other reviewers noted. I bought it in size large and it fits me comfortably. Quality of the material is top notch and the color is great. Almost makes me want the cold weather to get here sooner. Almost...",
      "rating": 5.0,
      "verified": true,
      "author": "AJ776523",
      "helpful_votes": 0,
      "publication_date": 20161018
    },
    {
      "title": "Great driving jacket",
      "text": "Great driving jacket, warm enough but not constricting like a full ski/winter coat. Spyder's sizing seems to be off because I usually wear a 1X in their ski jackets but this is a 3X and fits great. Its not a fluke because I have a red and a black one too and all 3 are XXXLarge --- weird",
      "rating": 5.0,
      "verified": true,
      "author": "Studio 54 - E Olson-Hulls",
      "helpful_votes": 0,
      "publication_date": 20161226
    },
    {
      "title": "My son is a perfect mens medium and I purchased this jacket in a ...",
      "text": "This jacket was for my 26 year old son and he loves it and fits just right. This style runs a litlle on the small side .. My son is a perfect mens medium and I purchased this jacket in a large , and it fits him perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161231
    },
    {
      "title": "Almost Great.",
      "text": "Great style, great look. Great insulation layer. Wind blows right though, pulls easily from velcro.",
      "rating": 4.0,
      "verified": true,
      "author": "leanbeanjean",
      "helpful_votes": 0,
      "publication_date": 20150312
    },
    {
      "title": "Won of the most warmest sweater i have every owned ...",
      "text": "Won of the most warmest sweater i have every owned .",
      "rating": 5.0,
      "verified": true,
      "author": "Rick",
      "helpful_votes": 0,
      "publication_date": 20161211
    }
  ],
  "product_meta": {
    "title": "Spyder Men's Foremost Full-Zip Jacket",
    "description": "The fabric and styles that you love have a new name, with even more color, variety and broadening of the range. What you have known as core sweater is now style fleece.",
    "rating": 4.7,
    "feature_bullets": [
      "100% Polyester",
      "Imported",
      "Machine Wash",
      "Zip-front jacket with stand collar, logo at chest, and contrasting side panels",
      "Side-entry welt pockets"
    ],
    "categories": [
      "Fashion Hoodies & Sweatshirts",
      "Clothing",
      "Men",
      "Clothing, Shoes & Jewelry"
    ],
    "price": "",
    "specifications": {}
  }
}