{
  "website_summaries": [
    {
      "verdict": "While the battery is a concern, the Xperia Z2 Tablet is still a good-looking slate that's loaded with more than enough power for anything you're likely to throw at it. It's a good choice if you're looking for a more affordable iPad alternative with 4G LTE -- particularly if you've ever lost a gadget through water damage.",
      "pros": [
        "The Sony Xperia Z2 Tablet's processor is searingly powerful and copes well with games",
        "It has a bright, vivid display and its razor-thin body can be taken in the shower without worry"
      ],
      "cons": [
        "It loses its battery far too quickly in standby mode",
        "Huge bezels around the display don't look good and make the body needlessly big, and its slim design has resulted in the whole thing being a little flexible"
      ],
      "aspects": {
        "Design": 8.0,
        "Features": 7.0,
        "Performance": 6.0
      },
      "publication_date": 20140731,
      "rating": 7.0,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Caution, warrenty not honored outside of uk.",
      "text": "Overall three tablet is nice, but heed my warning, this device, if it fails will require mailing back to the uk as Sony regards it as gray market and will not honor the warranty otherwise. I say this because the tablet now shuts off due to a malfunctioning temp sensor that claims overheat 30 seconds after turning on despite being perfectly cool.",
      "rating": 2.0,
      "verified": true,
      "author": "Reahreic",
      "helpful_votes": 0,
      "publication_date": 20161024
    },
    {
      "title": "Great tablet. Light",
      "text": "Great tablet. Light, fast, bright, stylish. Comes with some bloatware, but not a horrible amount, and what is included is not heinous. I really couldn't be more pleased with this.",
      "rating": 5.0,
      "verified": true,
      "author": "Stuart L.",
      "helpful_votes": 0,
      "publication_date": 20150304
    },
    {
      "title": "Five Stars",
      "text": "Much better than all ipad combined. picture quality is far better then ipad. love it",
      "rating": 5.0,
      "verified": true,
      "author": "king ray",
      "helpful_votes": 0,
      "publication_date": 20140813
    },
    {
      "title": "The best android tablet of today",
      "text": "amazing screen light as a feather very nice finish kit kat is inside good camera good battery waterproof what else do U need?",
      "rating": 5.0,
      "verified": true,
      "author": "Boaz Wittenberg",
      "helpful_votes": 3,
      "publication_date": 20140611
    },
    {
      "title": "Five Stars",
      "text": "in a few words the best tablet I've ever had, ultra fast, light, water resistant, sony software excellent!",
      "rating": 5.0,
      "verified": true,
      "author": "D. CHARALAMBAKIS",
      "helpful_votes": 0,
      "publication_date": 20140706
    },
    {
      "title": "Sony Xperia Tablet z2",
      "text": "Major problem with this. The unit would not hold a charge. Contacted Sony and had to do a total System Software Upgrade which was trickly. The problem did not solve itself. After much time, I realized the Charger Unit that came with the Unit was kicking off at 60% level. The Charger Unit that came with the device was an International setup with an adapter for use in the US. Major problems with this and I'm attempting have Sony provide me a new US version adapter.",
      "rating": 3.0,
      "verified": true,
      "author": "Thomas Reilly",
      "helpful_votes": 6,
      "publication_date": 20140525
    },
    {
      "title": "Don't waste your money!!!",
      "text": "I was excited to purchase this for my mom, who has severe arthritis. When it arrived, it was \"customized\" for 4 countries, none of which were the US. When I contacted Sony Support, I found out this is a purchase on the \"gray market\" and I am out of luck. I will be returning this tablet to Amazon and going with a different brand.",
      "rating": 1.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 9,
      "publication_date": 20140428
    },
    {
      "title": "An Excellent Tablet In All Respects.",
      "text": "Only those who love to find fault with everything would criticise this superb tablet..We have four tablets/pads in the house, all high spec. This one is easily the best for weight, slimness, graphics, sound, build and ease of use. Set up takes minutes. The processor is powerful and not many tablets have 3 RAM. Charging is not difficult but is a bit fiddly. I would therefore recommend buying the cradle to do this. The battery is perfectly adequate for all routine use. Would recommend without hesitation.",
      "rating": 5.0,
      "verified": true,
      "author": "Dr Barry Clayton",
      "helpful_votes": 2,
      "publication_date": 20150121
    },
    {
      "title": "Fast and with a great screen. I don't take it underwater - but ...",
      "text": "Fast and with a great screen. I don't take it underwater - but when the screen needs a clean I just wash it. Simples.. Multitasks well. Near field file transfer thing does work, but it's sometimes hard to find the sweet spot. The case made for it by Sony is excellent - holds the tablet in the positions you need. Battery life is very good. Storage capacity is also excellent. Well recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Sunshine Soon",
      "helpful_votes": 2,
      "publication_date": 20150226
    },
    {
      "title": "just like almost everyone else says - wow!",
      "text": "Well, like almost everyone else says, this is really an exceptional bit of kit. It does just about everything you could ask - and then some. I just love it. Listen to music on it - not a much advertised feature but the very best sounds I've heard over the past 20 years or more. Hooked up to a set of Sony zx600 headphones, the sounds are captivating! Yes, it's thin, light, waterproof, brilliantly coloured screen etc etc all as well. Not cheap, but as ever, you get what you pay for!",
      "rating": 5.0,
      "verified": true,
      "author": "jds",
      "helpful_votes": 0,
      "publication_date": 20140706
    },
    {
      "title": "Great for working away from the office",
      "text": "I needed something to work on while traveling by train. I already have a Z1 compact smartphone with which I am really pleased so decided to stick with Sony. I am extremely pleased with it. It does everything I want it to do, including word processing, email, project management, video conferening and much more. It does it all without any issues. I use it together with the Microsoft Wedge Portable keyboard, which works superbly with it. Also works great for entertainment (videos, iPlayer, etc) for when I am relaxing after work.",
      "rating": 5.0,
      "verified": true,
      "author": "Maarten",
      "helpful_votes": 0,
      "publication_date": 20150317
    },
    {
      "title": "Xcellent Xperia",
      "text": "Had it 10 days or so and still finding new features. Fast and good graphis/text. Would recommend it. Came down to choice between this and an ipad but Sony won. Loads of features and the Sony name behind it. I contacted Sony customer services with a couple of queries before buying and very helpful people. Price-wise nothing in it so went for the Android system I know. Apple has the 'fashionable' kudos but....",
      "rating": 5.0,
      "verified": true,
      "author": "Alfred A.",
      "helpful_votes": 7,
      "publication_date": 20140614
    },
    {
      "title": "Don't buy expensive so called quality products!",
      "text": "Have had this just two and a half years and though it's a nice product and I thought buying Sony would give me a quality product I was wrong. It has a main board issue (not through mis-used as acknowledged by Sony) that would cost more to repair than the cost of a new unit. You are better off buying a cheaper product and replacing it more frequently than buying expensive so called quality products - lesson learned for me.",
      "rating": 1.0,
      "verified": true,
      "author": "Donna",
      "helpful_votes": 0,
      "publication_date": 20170224
    },
    {
      "title": "5 stars!",
      "text": "I have now had this tablet for 8 months. It has behaved well and never failed me. The screen is bright, the system responsive and can double as a desktop or notebook computer. The battery is excellent and sony has improved the firmware. The only problem is you cannot add a mobile dongle to a non 3g version. Verdict the best android tablet on the market.",
      "rating": 5.0,
      "verified": true,
      "author": "JP",
      "helpful_votes": 0,
      "publication_date": 20141231
    },
    {
      "title": "An excellent tablet apart from the sound",
      "text": "An excellent tablet apart from the sound, which is still better than most of the competition. Not too much bloatware. As with most modern technology it is way overpriced but prorata it probably represents the best overall value on the market today. Like most tablets it lacks the convenience of a mini HDMI port and a second usb port. Overall apart from being a bit plasticy in build it does everything it says on the tin. 5 stars because of the price.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20150316
    },
    {
      "title": "As good as the iPad air.",
      "text": "In my view, definitely the best Android 10in tablet of the day. Very responsive, picks up poor WiFi signals well and has a good display. Should be 5 star but one minor gripe, the back of the tablet shows small scratches easily and retains greasy finger prints. And one major niggle.... who thought it would be a good idea to put the headphone socket at the bottom lefthand edge of the device. This means that with the headphone plugged in the display is always at an angle. Not all Apps autorotate.",
      "rating": 4.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20140615
    },
    {
      "title": "I had a nexus7 which I liked. decided to get a bigger screen",
      "text": "I had a nexus7 which I liked.decided to get a bigger screen.glad I did sonys 10.1\"screen is a lot brighter and the hole experience of using it is a lot faster.water proof as well. I think it's one of the slimmest out there. And very light. It knocks spots of the galaxy tablets in my experience. Well worth getting.",
      "rating": 5.0,
      "verified": true,
      "author": "antony parton",
      "helpful_votes": 2,
      "publication_date": 20150306
    },
    {
      "title": "Great piece of Tech, would recommend to anyone",
      "text": "This tablet has been a pleasure to use. Purchasing this in 2014, I've had an altogether great experience using this device. It's a very versatile piece of tech, with a lot in the ways of features and also usability, with its incredibly thin screen and responsive touch-screen. The only slight niggle I have with it however is the waterproofing. The charger cover is weak and has, eventually broken off, unfortunately rendering the tablet susceptible to the elements. This has not however dented its performance in any way and still runs its Android system with virtually no lag whatsoever.",
      "rating": 4.0,
      "verified": true,
      "author": "Seth Johnson",
      "helpful_votes": 0,
      "publication_date": 20150314
    },
    {
      "title": "Great tablet. Can't recommend highly enough",
      "text": "Great tablet. Can't recommend highly enough. Battery life is out of this world, screen is bright and crisp. Weigh less than the case I bought for it! If you're already an Android user, or if you'd rather avoid Apple's offerings, I'd definitely recommend this over the other choices. Sony's made very little changes to the default Android UI and their bundled apps are unobtrusive.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Hart",
      "helpful_votes": 0,
      "publication_date": 20150621
    },
    {
      "title": "Great powerful tablet",
      "text": "Great powerful tablet, runs xbmc fine great for streaming shows, sport and movies, have dropped it once and screen didn't smash! Takes a good few hours to charge but thats a good thing as the battery lasts ages, there's a few little things that aren't perfect like the home button being so close to the keyboard so sometimes you can accidentally press that when typing which can be annoying, but hey everything cant be perfect, mine came with all the menus in Japanese which was a bit strange but it was easy enough to change it to English. Overall great tablet brilliant quality hd screen highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Ade meaden",
      "helpful_votes": 0,
      "publication_date": 20141124
    },
    {
      "title": "I love it",
      "text": "I purchased this to take on holiday, so I didn't have to lug a laptop about. Its turned out to be an excellent buy. Its pictures are crystal clear, Its much more compact and lighter than a laptop and is semi waterproof. The camera is excellent. I love it, and when my Iphone packs up will be buying a Xperia phone.",
      "rating": 5.0,
      "verified": true,
      "author": "A. D. Green",
      "helpful_votes": 0,
      "publication_date": 20141027
    },
    {
      "title": "Wow, just wow:",
      "text": "Wow, just wow: - waterproof check - android check - tablet check - Look and feel check - Snapdragon 801 check - Overall 10/10",
      "rating": 5.0,
      "verified": true,
      "author": "Marcy",
      "helpful_votes": 2,
      "publication_date": 20150303
    },
    {
      "title": "Nice tablet, long battery life",
      "text": "I had a Samsung Note 10.1 before and it worked pretty well, but the odd crashes of apps were irritating. No problems with this and it came as a warehouse deal from Amazon so cheaper than brand new, yet it seemed brand new and unused.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. A. Trevarton",
      "helpful_votes": 0,
      "publication_date": 20151203
    },
    {
      "title": "Excellent service dodgy product",
      "text": "I purchased this for my girlfriend for Xmas and when we got it out of the box it didn't work. The supplier took it back and sent a new one over the Xmas and new year period. Then the new one stopped charging and I again got excellent service from the supplier in getting it turned around. When it is working it is a very good tablet better than an iPad the problem is it tends to not be working.....",
      "rating": 4.0,
      "verified": true,
      "author": "Mr. A. R. Brown",
      "helpful_votes": 0,
      "publication_date": 20160311
    },
    {
      "title": "Changed my opinion on tablets - Love it.",
      "text": "It was a present for my wife. She doesn't like PC,s very much but took to the tablet like a duck to water. I didn't like tablets, now I do. Need I say more.",
      "rating": 5.0,
      "verified": true,
      "author": "Tinonit",
      "helpful_votes": 0,
      "publication_date": 20160209
    },
    {
      "title": "Tablet",
      "text": "This tablet is still working today 5 years on a great decision to purchase this.",
      "rating": 5.0,
      "verified": true,
      "author": "Calioril",
      "helpful_votes": 0,
      "publication_date": 20180624
    },
    {
      "title": "I sent it back and got a replacement which I'm happy with. It's a great tablet and can't find ...",
      "text": "First time it came it was slightly bent from the middle. I looked at it a dozen times before I could be absolutely certain that it was warped. I sent it back and got a replacement which I'm happy with. It's a great tablet and can't find anything to complain about apart from the speakers not being loud enough. Other than that I just hope this won't bend over time as it might've happened with the previous one which I assume it had only been sat in a warehouse.",
      "rating": 4.0,
      "verified": true,
      "author": "Madalina Schiopu",
      "helpful_votes": 0,
      "publication_date": 20141223
    },
    {
      "title": "Another winner from Sony",
      "text": "Beautifully designed tablet with android os. Tablet is lightweight and apparently watertight but I've not tried that out. I love my Sony products and this lives up to expections. Graphics are clear and crisp. Thouroughly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs Sarah Pritchard",
      "helpful_votes": 0,
      "publication_date": 20150531
    },
    {
      "title": "Really pleased. Fantastic performance",
      "text": "Wasn't sure that I really needed one of these, but bought it anyway. Really pleased. Fantastic performance, really well made, great battery life, and goes with me all over the place. Best purchase of the year for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Wendy Cutler",
      "helpful_votes": 0,
      "publication_date": 20141011
    },
    {
      "title": "It's Early days but",
      "text": "So far the tablet has lived up to my expectations,has many nice features running the Android Kit Kat,very quick compared to my trusted Galaxy Tab 2,also much lighter, the screen resolution is very good,crisp and clear,so far it seems money well spent",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20140514
    },
    {
      "title": "I don't feel inclined to buy a new tablet. ...",
      "text": "I don't feel inclined to buy a new tablet. This is it. You don't need anything else. It's fast, feature rich, getting cheaper, why replace it?",
      "rating": 5.0,
      "verified": true,
      "author": "Phillip Parr",
      "helpful_votes": 0,
      "publication_date": 20160201
    },
    {
      "title": "loving it!",
      "text": "Love it. I am a big Sony fan and it did not disappoint. Great battery life. Not the best camera. Very responsive, a pleasure to use it.",
      "rating": 5.0,
      "verified": true,
      "author": "Oana O",
      "helpful_votes": 0,
      "publication_date": 20150407
    },
    {
      "title": "WOW",
      "text": "I was looking for a good tablet. Now I have found one. It has got the apps and gadgets I wanted. I like it's camera especially because I can change any photograph according to my choice.",
      "rating": 5.0,
      "verified": true,
      "author": "shahriar reza",
      "helpful_votes": 0,
      "publication_date": 20140814
    },
    {
      "title": "Really good, works well",
      "text": "Really good, works well. On the heavy side, didn't quite appreciate how much extra weight a cover would add to the tablet. The other thing was that it got cheaper about one week after I bought it which is always slightly annoying.",
      "rating": 4.0,
      "verified": true,
      "author": "M. King",
      "helpful_votes": 0,
      "publication_date": 20140711
    },
    {
      "title": "Excellent tablet, if a bit expensive",
      "text": "Excellent tablet. Good battery life, clear screen, easy to use. Only loses a star because it is so much more expensive than other comparable ones.",
      "rating": 4.0,
      "verified": true,
      "author": "Garrulous Grandma",
      "helpful_votes": 0,
      "publication_date": 20160304
    },
    {
      "title": "Great little tablet",
      "text": "This tablet is fantastic as a replacement for my iPad 2. Much better than the iPad, took some getting used to but I love it now. So much easier to get films on there. Very high quality screen.",
      "rating": 5.0,
      "verified": true,
      "author": "Bemused26",
      "helpful_votes": 0,
      "publication_date": 20150521
    },
    {
      "title": "Very pleased with product and seller.... Would recommend.",
      "text": "Very pleased with this tablet, waited a while to give a review, but no problems at all so far... Would recommend this seller.",
      "rating": 5.0,
      "verified": true,
      "author": "my view",
      "helpful_votes": 0,
      "publication_date": 20200125
    },
    {
      "title": "Great tablet. Fast and responsive",
      "text": "Great tablet. Fast and responsive. Use it everyday. Also great if for remote play with PS4 if you own a PS4.",
      "rating": 5.0,
      "verified": true,
      "author": "root",
      "helpful_votes": 0,
      "publication_date": 20150327
    },
    {
      "title": "dissapointed",
      "text": "Seven months on, been working OK, suddenly will not start then indicates battery low even when just charged. Sony taking a LONG time to sort it?",
      "rating": 2.0,
      "verified": true,
      "author": "Mr. M. Nash",
      "helpful_votes": 0,
      "publication_date": 20150519
    },
    {
      "title": "Nearly but not quite",
      "text": "The device supplied is actually only has16GB of storage and not 32GB as stated on the description, other than that device is fine battery is good",
      "rating": 2.0,
      "verified": true,
      "author": "William Taylor",
      "helpful_votes": 0,
      "publication_date": 20180208
    },
    {
      "title": "Outstanding.",
      "text": "Outstanding value at Amazon's price. Very fast and very easy to use. The camera is the best I've seen on a tablet. Who needs an iPad?",
      "rating": 5.0,
      "verified": true,
      "author": "Richard",
      "helpful_votes": 0,
      "publication_date": 20160204
    },
    {
      "title": "Just like all new technology",
      "text": "It's ok... it works. Just like all new technology, you have to get on the merry-go-round of products somewhere - and before you know it, the model has been succeeded by something else.",
      "rating": 3.0,
      "verified": true,
      "author": "Richard",
      "helpful_votes": 0,
      "publication_date": 20160121
    },
    {
      "title": "BEST TABLET EVER!!!!!",
      "text": "It's simply incredible how sony managed to fit high end specs within the ultra thin design. The battery is larger than the competitors and still it is the ligjtest tablet ever. On full battrey charge I easily manage to watch two 2hr length movies and still have around 30% battery left. This is definitly the best tablet of the year.",
      "rating": 5.0,
      "verified": true,
      "author": "Aaron Saliba",
      "helpful_votes": 0,
      "publication_date": 20140717
    },
    {
      "title": "good value",
      "text": "Arrived on time and no problems whatsoever :-) Battery life isn't great, but I do use it a fair bit.",
      "rating": 5.0,
      "verified": true,
      "author": "Brutal Princess",
      "helpful_votes": 0,
      "publication_date": 20150310
    },
    {
      "title": "best tablet around",
      "text": "In my limited experience, must be the best tablet around. Fast, light, elegant - does everything I want of it. Got this as a \"used\" product, but it arrived as good as new.",
      "rating": 5.0,
      "verified": true,
      "author": "ermintrude",
      "helpful_votes": 0,
      "publication_date": 20141118
    },
    {
      "title": "Expensive black mirror",
      "text": "The docking station is not that great and it has now totally locked up for no reason. Will be sending it back",
      "rating": 1.0,
      "verified": true,
      "author": "M. Thompson",
      "helpful_votes": 0,
      "publication_date": 20160124
    },
    {
      "title": "all good except for delicate screen",
      "text": "I've had two of these break now ... all good except for delicate screen",
      "rating": 2.0,
      "verified": true,
      "author": "P. Harvey",
      "helpful_votes": 0,
      "publication_date": 20180101
    },
    {
      "title": "Sony Quality",
      "text": "You got what you pay for !!! Quality and design !!",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. M. Dadej",
      "helpful_votes": 0,
      "publication_date": 20150521
    },
    {
      "title": "A great tablet, especially if you can find discounted",
      "text": "I love this tablet. Extremely lightweight and easy to carry and has excellent performance, screen and not to mention waterproof protection. Don't worry about the bezel - a great looking tablet.",
      "rating": 5.0,
      "verified": true,
      "author": "stewart stringer",
      "helpful_votes": 0,
      "publication_date": 20140628
    },
    {
      "title": "Fab",
      "text": "Amazing quality, best tablet I've very used and so light in weight. Best of all its water proof",
      "rating": 5.0,
      "verified": true,
      "author": "C Lelliott",
      "helpful_votes": 0,
      "publication_date": 20141201
    },
    {
      "title": "Great Tablet",
      "text": "Great tablet, love it, have had no problems, can link to my xperia phone, Great",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs C.",
      "helpful_votes": 0,
      "publication_date": 20141103
    },
    {
      "title": "Very easy to keep up to date",
      "text": "Has been a handy tablet to have. Very easy to keep up to date.",
      "rating": 5.0,
      "verified": true,
      "author": "JP",
      "helpful_votes": 0,
      "publication_date": 20171222
    },
    {
      "title": "The best tablet of all and I'm happy to have one",
      "text": "The best tablet of all and I'm happy to have one :) fast delivery no issues with the tablet :)",
      "rating": 5.0,
      "verified": true,
      "author": "Ged",
      "helpful_votes": 0,
      "publication_date": 20140726
    },
    {
      "title": "Five Stars",
      "text": "Brilliant! Very high spec android tablet and as a bonus, it is water proof!",
      "rating": 5.0,
      "verified": true,
      "author": "C Noble",
      "helpful_votes": 0,
      "publication_date": 20140716
    },
    {
      "title": "high quality tablet",
      "text": "Brought this as a gift for my hubby and he is thrilled. He says its a \"fantastic piece of kit\" easy to use and high quality everything and more you would expect from Sony",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20140731
    },
    {
      "title": "Five Stars",
      "text": "Cracking piece of kit bought specifically for its connectivity. Wish I could do it justice.",
      "rating": 5.0,
      "verified": true,
      "author": "G B Evans",
      "helpful_votes": 0,
      "publication_date": 20141214
    },
    {
      "title": "Very good at everything so far",
      "text": "Very good at everything so far. Need to instal more software, but so far it is handling everything without fault.",
      "rating": 5.0,
      "verified": true,
      "author": "nick",
      "helpful_votes": 0,
      "publication_date": 20140716
    },
    {
      "title": "Awesome",
      "text": "Perfect tab. Gd display and remote play with PlayStation is awesome.",
      "rating": 5.0,
      "verified": true,
      "author": "Alex Gede",
      "helpful_votes": 0,
      "publication_date": 20150711
    },
    {
      "title": "Great tablet!",
      "text": "Tablet was was exactly as described and I have had no problems with it. It is a great light tablet with a great screen and video play is excellent. I would recommend this to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160525
    },
    {
      "title": "Great tablet I have bought Sony for years",
      "text": "Great tablet I have bought Sony for years. well packed. Fair price. great Del. time good work team Yours Geordie",
      "rating": 5.0,
      "verified": true,
      "author": "Geordie Meadows",
      "helpful_votes": 0,
      "publication_date": 20140811
    },
    {
      "title": "What a tablet",
      "text": "Perfect tablet for wot I require, very pleased with it",
      "rating": 5.0,
      "verified": true,
      "author": "John Johnston",
      "helpful_votes": 0,
      "publication_date": 20160416
    },
    {
      "title": "top rate",
      "text": "caused nothing but fights since it came through the door",
      "rating": 5.0,
      "verified": true,
      "author": "wallyford",
      "helpful_votes": 0,
      "publication_date": 20140708
    },
    {
      "title": "love this sony xperia z2 very quick to respond",
      "text": "love this sony xperia z2 very quick to respond ,I have had other tablets before but this one is the best so far.",
      "rating": 5.0,
      "verified": true,
      "author": "susan cook",
      "helpful_votes": 2,
      "publication_date": 20150119
    },
    {
      "title": "Five Stars",
      "text": "love it, super nice look, screen quality is great and its pretty fast",
      "rating": 5.0,
      "verified": true,
      "author": "Dáire Keane",
      "helpful_votes": 0,
      "publication_date": 20141026
    },
    {
      "title": "Four Stars",
      "text": "the touch screen some times is so slow to respond to the commands.",
      "rating": 4.0,
      "verified": true,
      "author": "leonardo herrera",
      "helpful_votes": 0,
      "publication_date": 20150108
    },
    {
      "title": "sony Xperia Z2 tablet",
      "text": "I`ve had other tablets before which i thought were good.....but this one is far superior. Its extremely fast....especially when web surfing....the other tablets lagged on this point. Its very lightweight and its colour definition and sound are much better than other tabs. I would highly recommend this tab. It costs a bit more than other tabs but the extra expense is worth it:)",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20140510
    },
    {
      "title": "Absolutley Great Product - Must Buy",
      "text": "I have had this tablet for only a week now, and has been absolutely flawless. I has that wow factor as soon as you open and use. Would strongly recommend. It has the speed, smoothness and quality of an Ipad air with the freedom that comes with Android and expandable storage. It has a few Gimmicky features such as an IR Blaster (used for controlling your TV) or some cool animations on videos, there are many more features like this, as much as they have no important use they are great fun! It is an incredibly beautiful product and is worth the money, is a great tablet to show off ;)",
      "rating": 5.0,
      "verified": true,
      "author": "Sir Colemano",
      "helpful_votes": 0,
      "publication_date": 20140620
    },
    {
      "title": "Cracking gadget",
      "text": "A fine piece of design. Feels very light, but solid. Very responsive. Screen is excellent, lovely vivid but not over saturated colours, clarity is fantastic. Quite reflective screen at times, but fine in this respect most of the time. Easy to set up, now mirrors my Android phone so easy to flick from one to the other. Sound decent, good considering size, through headphones great quality. Can't recommend this enough.",
      "rating": 5.0,
      "verified": true,
      "author": "Peter Wood",
      "helpful_votes": 2,
      "publication_date": 20140420
    },
    {
      "title": "Good, but could be great",
      "text": "This tablet, while aiming to be great, is sadly only decent. Sony has done a pretty fine job customising the stock Android. There is some some Sony bloatware, but that's to be expected. Hardware, however, is somewhat flaky - the touchscreen acts up every now and then (stops recognising touches and also has problems with various gestures). Others have also various problems with other hardware components. Luckily my unit only has the touchscreen problem and hasn't developed any other issues - thus, I haven't bothered to get it replaced. Short story even shorter: be prepared to get your unit replaced as various hardware problems might crop up.",
      "rating": 3.0,
      "verified": true,
      "author": "Mart Roosmaa",
      "helpful_votes": 0,
      "publication_date": 20140712
    },
    {
      "title": "Outstanding Product",
      "text": "Weight: 10/10 Aesthetics: 10/10 Performance: 10/10 Battery: 8/10 Camera: 9/10 Price: 7/10 Its waterproof up to 30 minutes at a depth of 1 meter. At first I was skeptical about getting it, but now I have had it a week it really is quite something special! its lightweight, slim, so not clunky, it has a large screen and is very responsive. I would recommend to anyone, don't let the price scare you off, well worth it!",
      "rating": 5.0,
      "verified": true,
      "author": "Barnes",
      "helpful_votes": 0,
      "publication_date": 20140601
    },
    {
      "title": "Z2 Tablet is great",
      "text": "If you are looking for something that will do the basics email, video, music, browsing and a couple of favourite apps then this is great. Also this is one of the easiest setups I have ever come across (and I used to work for a competitor). The device is really slick very easy to use and the colour and video quality is excellent. Haven't tried dropping it in water yet though :-)",
      "rating": 5.0,
      "verified": true,
      "author": "S. Tindal",
      "helpful_votes": 6,
      "publication_date": 20140626
    },
    {
      "title": "Good looking, good quality building and very Sharp processor ...",
      "text": "Good looking, good quality building and very Sharp processor and screen, not bad screen at all, very sensitive and good quality definition,one of the best i've seen. BUT ..... the black frame around the screen not very nice and reduces screen to a \"8\" inches...the plugs for micro card and micro USB due to waterproof protection they're not very acessible and easy to work with. Really needs or should have a HDMI exit or at least USB standar and not micro USB, restrict the usage of a simple pen without a adaptor from micro usb to usb. In workability and performance still above Samsung and others....",
      "rating": 3.0,
      "verified": true,
      "author": "Flavio H. Pombas Alves",
      "helpful_votes": 0,
      "publication_date": 20141013
    },
    {
      "title": "Highly recommended",
      "text": "Fantastic tablet, I was able to sync this with my phone and all things google. Great to see photos on this high res tablet. Controls my hi-fi via an app from anywhere in the house. Handles multitasking very well. The infrared feature also controls all other electronics. Serves my needs thus far and the front and rear cameras are as good as you will get on a tablet, the battery lasts fairly well given what I use the tablet for. One niggle to get used to is that the home button is close to the space bar when typing, this means you have to reopen the page you are working on as I sometimes minimise the page this way.",
      "rating": 5.0,
      "verified": true,
      "author": "T. Santovito",
      "helpful_votes": 0,
      "publication_date": 20150321
    },
    {
      "title": "I am still finding out new things with it but it is clear and quick and I really like it. has attracted good press reviews and I",
      "text": "waited a while to get a tablet - was about to order a Z1 when this came out.Took amazon an unusually long time to deliver it!I am still finding out new things with it but it is clear and quick and I really like it. has attracted good press reviews and I would agree with them. It was cheap and easy to buy and fit a 32gb micro sd card to upgrade the memory.so far so satisfied",
      "rating": 5.0,
      "verified": true,
      "author": "F. C. Ford",
      "helpful_votes": 0,
      "publication_date": 20140729
    },
    {
      "title": "Superb tablet, supplier pretty good",
      "text": "Tablet arrived in six days and was dispatched by Amazon rather than Gamecybershop. The tablet is a Hong Kong/China model, but you can select British English language. The touchscreen was unusable at first, a software upgrade via PC Companion sorted that out. On the confirmation I was told it was upgraded to 32GB , which it wasn't. Despite this, I'm happy overall; works well on EE 4G",
      "rating": 5.0,
      "verified": true,
      "author": "Steven Collis",
      "helpful_votes": 5,
      "publication_date": 20140524
    },
    {
      "title": "Technical support services has been excellent.",
      "text": "TV Catchup does not work (stream) at all well on this model - it is a known problem - both by Sony and TV Catchup. It is hoped that Android Lollipop may solve this problem. TVCatchup is one app I use daily. Sony seems to be quite slow in releasing Lollipop for this item. Technical support services has been excellent.",
      "rating": 3.0,
      "verified": true,
      "author": "Whiskers",
      "helpful_votes": 0,
      "publication_date": 20150223
    },
    {
      "title": "high performance tablet with crystal clear screen and good sound quality",
      "text": "A very well packaged, high performance tablet with crystal clear screen and good sound quality. Everything you need with a simple interface to so it on. 5 out of 5.",
      "rating": 5.0,
      "verified": true,
      "author": "Joseph Carl Ettwein",
      "helpful_votes": 0,
      "publication_date": 20150225
    },
    {
      "title": "Xperia Z2:- You've got to get one.",
      "text": "Absolutely fantastic product. Looks really cool. Brilliant performance, way better than the ipads.",
      "rating": 5.0,
      "verified": true,
      "author": "Donnie MacLeod",
      "helpful_votes": 0,
      "publication_date": 20141107
    },
    {
      "title": "First class service",
      "text": "When it was good it was very good, but mine stopped working after two months, sent it back,no trouble from amazon's great after service",
      "rating": 2.0,
      "verified": true,
      "author": "Mr. B. T. J. Bayley",
      "helpful_votes": 0,
      "publication_date": 20160804
    },
    {
      "title": "Sony Xperia Z2  10.1 tablet",
      "text": "Having tried several tablets, this is the best I have tried, its light, quick to respond and easy to use, I have now added a 64GB card to give it a great capacity so can now hold plenty of films and music. It gives upto 8 hours life before requiring charging, is great as a navigation aid in the car.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard Hoyle",
      "helpful_votes": 2,
      "publication_date": 20140620
    },
    {
      "title": "Fantastic tablet.",
      "text": "I had an ipad but an android phone and had been waiting for a decent tab for ages. I am extremely happy with the purchase. Its a great looking device with a brilliant screen. I read a lot of reviews and despite reading about niggles with the screen sharpness compared to the Samsungs and Ipad its a non issue as far as im concerned. If you prefer android to IOS like me then this tablet is worth serious consideration, you wont be disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "Wez1980",
      "helpful_votes": 3,
      "publication_date": 20140530
    },
    {
      "title": "great tablet but I expected to be more faster",
      "text": "The tablet is a great tablet Prons: waterproof. Large and sharp display, good sound,good 🔋 life, easy to get used to, dose not detected warm not even when you use for a long time. Cons: display in outdoors gives a lot of reflection kind of annoying, emails and Internet a bit slow.",
      "rating": 4.0,
      "verified": true,
      "author": "Stanley Suda",
      "helpful_votes": 3,
      "publication_date": 20140507
    },
    {
      "title": "Great tablet, let down by awful touch-screen",
      "text": "Undoubtedly a beautiful tablet to look at and with an impressive specification but let down by an awful screen. It's not the resolution (although this is somewhat below par), rather than the buggy touch-screen performance. Sometimes overly sensitive and sometimes unresponsive, it makes using the tablet a wearisome experience. Try using the on-screen keyboard and you'll find letters repeat or aren't registered at all, meaning you have to watch for every keystroke - touch typing becomes impossible. Maybe this problem is limited to a certain production run but's seems I'm not alone with my experience, see:  I ended up returning the tablet for a refund. A real shame as everything else about it was spot-on.",
      "rating": 2.0,
      "verified": true,
      "author": "David Orme",
      "helpful_votes": 2,
      "publication_date": 20140805
    },
    {
      "title": "using it and love it",
      "text": "Bought for almost two weeks and very satisfied. The screen is perfect either for videos or images. Wifi Internet connection is also fast and stayble. Battery power is strong enough for me since I only have to charge this thing approximately once in 48 hours (and I consider myself as a heavy user of this electronic device). Sound output for headphones is great as usual. Android system is comfortable to use. 800megaPixel camera is enough since it will look stupid (no offence) to use a tablet as a professional camera. It is my first tablet, so no comparison can be made. But I think it worth the price.",
      "rating": 5.0,
      "verified": true,
      "author": "EDGAR",
      "helpful_votes": 0,
      "publication_date": 20140514
    },
    {
      "title": "Good tablet, battery life not the best",
      "text": "Very good tablet - battery life could be better, and the charging cable is very short. Overall would recommend, but these issues do let it down.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20140503
    },
    {
      "title": "Poor touchscreen",
      "text": "I had to return the tablet, it is fast, the screen is nice al in all its a good tablet...except the touchscreen doesn't respond well near the corners to the point of it being unusable.",
      "rating": 2.0,
      "verified": true,
      "author": "DT",
      "helpful_votes": 2,
      "publication_date": 20140914
    },
    {
      "title": "disappointed.",
      "text": "I've had this for just over a month and it's started creaking when I hold it like something isn't secure inside, and in the last few days a yellow discolouration has appeared on the right hand side of the screen and along the bottom. I'm sending it back as this is unacceptable and from looking at Google it has happened to a lot of people.",
      "rating": 1.0,
      "verified": true,
      "author": "Dan C.",
      "helpful_votes": 4,
      "publication_date": 20141127
    },
    {
      "title": "never buying  'Sony Xperia'",
      "text": "can not use it for skype as it makes lots of noise, tried changing setting doesn't help!!! never buying 'Sony Xperia'",
      "rating": 1.0,
      "verified": true,
      "author": "Bujar Metaj",
      "helpful_votes": 0,
      "publication_date": 20150212
    },
    {
      "title": "Lovely to look at but........",
      "text": "Sold my Apple iPad Air and bought this based on the reviews so far. I have sent it back as the tablet's touch screen failed to respond to touch almost every time I used it. Whether it was to swipe to unlock or to open an app. Now I'm not sure if this was just a faulty tablet but after having had 4 Apple iPads with no issues at all I won't be buying a Sony tablet again.",
      "rating": 2.0,
      "verified": true,
      "author": "Paul G. Johnston",
      "helpful_votes": 3,
      "publication_date": 20140523
    },
    {
      "title": "so it is a complete waste of time trying to connect the charger supplied",
      "text": "how do you charge up the tablet when there is no charging port ,so it is a complete waste of time trying to connect the charger supplied. There is nothing in the literature to tell you how to charge the device.",
      "rating": 1.0,
      "verified": true,
      "author": "Mr PAUL N WINGATE",
      "helpful_votes": 2,
      "publication_date": 20141028
    },
    {
      "title": "The best thing for me with this tablet is it's ability ...",
      "text": "The best thing for me with this tablet is it's ability to be expanded through micro sd. I have a 64 gb card in mine which can handle thousand's of pictures, albums and video's without me worrying about space. I have always been an apple fan and previous to this I used to take a mac book pro away with me, but this makes my camera equipment so heavy which mean a tablet was a much more manageable solution. I have had 2 Ipad's but this Sony is so much more practical for me with my photography and travel.",
      "rating": 5.0,
      "verified": true,
      "author": "M A Roper",
      "helpful_votes": 2,
      "publication_date": 20150111
    },
    {
      "title": "Can barely tell I'm holding it",
      "text": "This tablet is ridiculously good in both speed and quality. I have had it only a day but I can't stop wanting to pick it up and play around with it. That may seem like an arbitrary compliment, but sometimes products just have a certain \"je ne sais quoi\" about it, be it form factor or something with the build that just feels right. The most noticeable thing about other than the sleek looks is simply how light it is. It's unbelievable. I hope Sony continues with this type of quality product.",
      "rating": 5.0,
      "verified": false,
      "author": "Usnavyvet2002",
      "helpful_votes": 0,
      "publication_date": 20140818
    },
    {
      "title": "Stopped working after about 6 months.",
      "text": "Great concept poor execution. After a few months mine stopped working. Both charging ports failed. Now either buy a new tablet like Samsung or pay a fortune to repair this one. I'm leaning towards switching my business to Samsung.",
      "rating": 1.0,
      "verified": false,
      "author": "Jeff D.",
      "helpful_votes": 0,
      "publication_date": 20150514
    },
    {
      "title": "Sony Xperia Z2 Tablet",
      "text": "Could not be happier with this tablet. I am a college graduate student and use this everyday. I never realized how much simpler it is to bring a tablet instead of your laptop. The screen is absolutely stunning as it makes my laptop screen look dim in comparison. I have it on max brightness and get a couple days of good use on a single charge. This tablet is ridiculously thin, super light, waterproof, and feels very comfortable in landscape mode. It is what you would come to expect from Sony build quality. I recommend buying from the Sony online store as you will get the magnetic charging dock for free. Highly recommended tablet!",
      "rating": 5.0,
      "verified": false,
      "author": "Battousai91",
      "helpful_votes": 2,
      "publication_date": 20140831
    },
    {
      "title": "Great tab!",
      "text": "Xperia Z2 is the thinnest and the lightest tablet Sony has ever made. It's sleek design and amazing spec sheet makes it a strong competitor against other tabs. Pros: 1. Incredibly thin and waterproof too 2. Snappy performance Cons: 1. Both cameras are underwhelming",
      "rating": 4.0,
      "verified": false,
      "author": "all star",
      "helpful_votes": 0,
      "publication_date": 20150202
    },
    {
      "title": "Love it no issues",
      "text": "I've had it over a year and I love it!! Best one I've had yet and Samsung is definitely my 2nd choice!! But I wanted to give Sony a try and I'm glad I did!!",
      "rating": 5.0,
      "verified": false,
      "author": "Marcie Turner",
      "helpful_votes": 0,
      "publication_date": 20160721
    },
    {
      "title": "After owning all the latest and best and most expensive",
      "text": "After owning all the latest and best and most expensive, this is by far the best with the greatest clarity and colors. Held side by side with the Nexus 10, which has been one of the highest rated tablets, colors on the Nexus appeared washed out. The Sony colors were bright with great clarity. If you watch a lot of movies or games, this is fast and brilliant.",
      "rating": 5.0,
      "verified": false,
      "author": "dewey brunner",
      "helpful_votes": 6,
      "publication_date": 20140502
    },
    {
      "title": "Not Ready for Primetime",
      "text": "Very lightweight and great screen. Good when it works - the operative phrase being when it works. Had it for one week before returning it. Screen constantly froze needing the tablet to be rebooted. Would also turn itself off for no apparent reason and restart. The manual was no help since the only included documentation was a quick start guide - not even a manual on disc. Touch screen was not particularly responsive. Very poor effort from SONY.",
      "rating": 1.0,
      "verified": false,
      "author": "Crester",
      "helpful_votes": 6,
      "publication_date": 20140515
    },
    {
      "title": "best tablet so far, but the price........",
      "text": "like i said, this is the best android tablet out there right now however, the price listed by the seller is skyhigh. $599.99 is the price for a 32Gb not for 16Gb on the sony store website, wit tax is around $650 at most for a 32Gb the 16Gb at the sony website is only $499.99 but besides the price, the tablet is very nice and fast, i switched from ipad to this tablet, and am enjoying it would have give 5 stars if not for the overpricing",
      "rating": 3.0,
      "verified": false,
      "author": "KD",
      "helpful_votes": 8,
      "publication_date": 20140424
    }
  ],
  "product_meta": {
    "title": "Sony Z2 SPG561 32GB 10.1\" Verizon + GSM 4G LTE Water-Resistant Tablet w/ Exmor RS 8MP Camera - Black",
    "rating": 3.7,
    "specifications": {
      "Standing screen display size": "10.1 Inches",
      "Graphics Coprocessor": "2.3 GHz Qualcomm MSM8974AB Quad-core",
      "Wireless Type": "802.11n, 802.11b, 802.11a, 802.11ac, 802.11g",
      "Average Battery Life (in hours)": "10 Hours",
      "Item model number": "SGP511GB/B.CEK",
      "Hardware Platform": "Android",
      "Operating System": "Android 4.4 KitKat",
      "Item Weight": "15 ounces",
      "Product Dimensions": "6.77 x 10.47 x 0.25 inches",
      "Item Dimensions  LxWxH": "6.77 x 10.47 x 0.25 inches",
      "Rear Webcam Resolution": "8 MP",
      "Processor Brand": "Qualcomm",
      "Processor Count": "4",
      "Computer Memory Type": "Unknown",
      "Flash Memory Size": "16 GB",
      "Batteries": "1 Lithium ion batteries required.",
      "ASIN": "B00ITTWQK6",
      "Customer Reviews": "3.7 out of 5 stars121 ratings3.7 out of 5 stars",
      "Best Sellers Rank": "#289,283 in Electronics",
      "Date First Available": "March 24, 2014"
    },
    "categories": [
      "Computers & Accessories",
      "Electronics",
      "Computers & Tablets",
      "Tablets"
    ],
    "price": ""
  }
}