{
  "website_summaries": [
    {
      "verdict": "Those who are tired looking for a comfortable boot that more than justifies its price tag may finally find rest in the Meindl Bhutan MFS. It is indeed a comfy gear, but one with a kind of waterproofing that works surprisingly well, and enough stiffness that inspires confidence. What people might find a little worrying about the boot, however, is its weightiness. All in all, the Meindl Bhutan MFS may not be the lightest boot there is, but with its towering reputation, it simply is something that should not be missed by any means.",
      "pros": [
        "Experts found a lavishly comfortable hiking boot in the Meindl Bhutan MFS",
        "Numerous users were able to take great advantage of the footwear’s stiff soles",
        "A moderate percentage of reviewers only had adorations for the boot’s relentless waterproofing",
        "The Bhutan MFS’ price tag was considered worth it by several purchasers",
        "This backpacking footgear received praises from a number of owners for its exemplary traction",
        "About a third of those who reviewed the Meindl Bhutan MFS liked its durable construction",
        "Some wearers couldn’t be more pleased about the boot’s precise fit",
        "The stability offered by this footwear was highly commended by a few critics",
        "Because of its reliable ankle support, a couple of testers felt compelled to admire the boot"
      ],
      "cons": [
        "Some professional reviewers found an issue with the Bhutan MFS’ heaviness",
        "A footwear blogger came away disappointed with the footgear’s insufficient ventilation"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": 9.4,
      "source": "runrepeat"
    }
  ],
  "customer_reviews": [
    {
      "title": "Strong but too narrow.",
      "text": "This is a bit narrow, first of all. So if you have a wider foot, then it might be worth looking around. That said, mine arrived earlier today & I've been wearing them for 3 hours now. They're strong, sturdy & I get the immediate impression that they'll go to extremes. Sadly too narrow for me although unable to return them. So I'll be selling these on. Seriously, try before you buy rather than risk purchasing & testing them - I fell foul of that & ended up with a £180 pair of boots I can't use.",
      "rating": 3.0,
      "verified": true,
      "author": "Bigfoot",
      "helpful_votes": 11,
      "publication_date": 20170428
    },
    {
      "title": "Best boots I have ever owned!",
      "text": "Had these for about a month now. Used everyday for dog walking in woodland and for a week in Cornwall doing coastal walks etc which can be challenging at times. Found them to be very comfortable straight out the box offering excellent ankle support for when you misjudge the edge of a path and your ankle tries to twist. So far waterproofing has been excellent. I bought a half a size up from my normal size and they fit perfectly even with thick walking socks. Can’t review long term durability yet but so far, best boots I have ever owned. Love them!",
      "rating": 5.0,
      "verified": true,
      "author": "Martyn",
      "helpful_votes": 3,
      "publication_date": 20190906
    },
    {
      "title": "Excellent quality, the most comfortable hiking boots I have ...",
      "text": "Excellent quality, the most comfortable hiking boots I have tried on so far. The memory foam makes the boot adapt to my ankle and it feel like wearing UGGs. Fairly bulky but you get used to the feeling and certainly useful when walking on rocky, snowy terrain.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 8,
      "publication_date": 20171211
    },
    {
      "title": "German made",
      "text": "This is my second pair and I would say the best walking boots on the market.The fit is nice and snug your foot is held in comfort an d very well supported.well worth the cost",
      "rating": 5.0,
      "verified": true,
      "author": "colin scrymgeour",
      "helpful_votes": 5,
      "publication_date": 20181219
    },
    {
      "title": "The best hiking boots in the world",
      "text": "My last pair gave me twelve years of comfortable hiking through desert, in the arctic, swamps and pleasant countryside. The new pair will do the same. Without doubt the best footwear I have ever owned.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. A. M. D. Steiner",
      "helpful_votes": 4,
      "publication_date": 20190114
    },
    {
      "title": "Great boots",
      "text": "They are great boots. However they are not built to last. I’m now on my 6th pair in 8 years. The glue is not long-lasting and the soles fall off after walking about 5,000Km. I’ve had to replace them several times the day before a multi-day expedition. You have to really look after the leather as it can crack easily if you dry them too quickly. Still 5 stars as I’ve never had a blister.",
      "rating": 5.0,
      "verified": true,
      "author": "Nigel G",
      "helpful_votes": 4,
      "publication_date": 20191002
    },
    {
      "title": "Highly recommended!!!",
      "text": "Got these shoes for our treck to outer cora of Mt Kailash @6k Meters. I can only say that these shoes were our best companions for all sort of tarraiance, snow, rail, rocks, climbing up the steep mountains or coming down. They are waterproof and would not let your feet and ankels be effected by an landscape.",
      "rating": 5.0,
      "verified": true,
      "author": "Mitesh Solanki",
      "helpful_votes": 3,
      "publication_date": 20190916
    },
    {
      "title": "A great boot for hiking on  varied terrains",
      "text": "This is a superb boot and given the obvious quality of its design and construction, it represents good value for money. I watched a video which suggested that I should order the same size Bhutan to replace my Burma boots as the fit would be 'identical'. The Bhutan actually feels a bit smaller and tighter inside than the Burma when they were brand new. So, I wish I'd ordered half a size larger. Hopefully they will 'wear in' and become as comfortable as my Burma boots.",
      "rating": 5.0,
      "verified": true,
      "author": "Floss",
      "helpful_votes": 0,
      "publication_date": 20200903
    },
    {
      "title": "The ones I bought in June 2013 need repair in August 2020, so I bought another pair :D",
      "text": "As you can see on the \"NEW vs OLD\" pictures, they have room for stretching and shaping on the foot. Still very comfortable while forming. The last picture is new ones on feet. I tried to avoid mud with and walked mainly asphalt, and they are extremely comfortable. Just had to change the laces at some point, could have waxed them I guess, just used the spray sometime. They are my fourth Meindl since 1999. I'm keeping the old ones, just need to find a proper craft man to repair them safely after the coronavirus 2 crisis is over...",
      "rating": 5.0,
      "verified": true,
      "author": "ZIMMERMANN",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "Very good quality boots",
      "text": "This is my second pair of Meindl Bhutan boots.The first lasted 4 years (around 2,000 miles) before they started to leak in wet weather.I have worn the new pair twice(26 miles) and they seem fine.I have two minor criticisms,shared by my friends. The first is that it is difficult to remove the laces to clean the boots,as recommended,especially with cold hands.The second is that that application of the Meindl wax,again as recommended,gives the boots a 'cruddy' appearance,and it is difficult to see how the waterproofing spray would work on this.",
      "rating": 4.0,
      "verified": true,
      "author": "Chris  R Jones",
      "helpful_votes": 0,
      "publication_date": 20200723
    },
    {
      "title": "Brilliant boots",
      "text": "Very comfortable boots - my second pair of Meindls. Looking forward to many years of wearing.",
      "rating": 5.0,
      "verified": true,
      "author": "EFMOL",
      "helpful_votes": 2,
      "publication_date": 20190214
    },
    {
      "title": "Love these boots",
      "text": "Love these boots. Last pair lasted me nearly 20 years of regular use. Fit is perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Marcus Prevel",
      "helpful_votes": 3,
      "publication_date": 20190817
    },
    {
      "title": "Really comfortable hiking boots",
      "text": "Very comfortable from the first hike in them - never had any blisters. Just returned from the Tour De Mont Blanc in the Alps - these boots were perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "M. J. Martin",
      "helpful_votes": 0,
      "publication_date": 20190920
    },
    {
      "title": "Quality pair of walking boots!",
      "text": "Did not even try to wear them in...marched through all sorts of wet and boggy areas for about 18 miles last weekend...They were warm waterproof and great. loved them and wish i had bought a pair years ago",
      "rating": 5.0,
      "verified": true,
      "author": "David J Earlam",
      "helpful_votes": 3,
      "publication_date": 20190303
    },
    {
      "title": "Well worth it!",
      "text": "Bought these for a colleague who had requested them to replace an old pair which he had for years. They are extremely comfortable, weareable from the start (no breaking in) and waterproof. The price is a bit on the expensive side but worth it and you get what you pay for.",
      "rating": 5.0,
      "verified": true,
      "author": "Jean Thompson",
      "helpful_votes": 0,
      "publication_date": 20200601
    },
    {
      "title": "BRILLIANT BOOTS AND CUSTOMER SERVICE",
      "text": "Boots are a superb fit and quality . Sent different sizes 1st time but Taunton Leisure Customer service was excellent and got another pair in a couple of days .... great work guys .",
      "rating": 5.0,
      "verified": true,
      "author": "Stephen Campbell",
      "helpful_votes": 4,
      "publication_date": 20171026
    },
    {
      "title": "Very satisfied",
      "text": "Gift for my son who is an outdoor activities instructor. He is very happy with them.",
      "rating": 4.0,
      "verified": true,
      "author": "H White",
      "helpful_votes": 0,
      "publication_date": 20181109
    },
    {
      "title": "Good supportive walking boots, last a long time",
      "text": "Bought for my husband, he has two pairs that he has had for years, treating him to new ones for Xmas",
      "rating": 5.0,
      "verified": true,
      "author": "Melanie taylor",
      "helpful_votes": 0,
      "publication_date": 20181014
    },
    {
      "title": "they are strong and well made",
      "text": "boots are exactly as explained in advert, had them before always a good buy",
      "rating": 5.0,
      "verified": true,
      "author": "sonia church",
      "helpful_votes": 0,
      "publication_date": 20190311
    },
    {
      "title": "Meindl Boots",
      "text": "Best boots I have ever worn on my feet -not cheap but sure deliver to the highest standard",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190513
    },
    {
      "title": "Buy size up",
      "text": "I would advise to buy a half size up they are very narrow.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201008
    },
    {
      "title": "Great quality!",
      "text": "Solid boots! Will last for a very long time. Tested on a Carrauntoohil hike during a rainy day! Waterproof 100%",
      "rating": 5.0,
      "verified": true,
      "author": "Jakub",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "Money well spent",
      "text": "Best boots I have ever had, glad I took the time researching walking boots, they may be pricey but it's money well spent!!",
      "rating": 5.0,
      "verified": true,
      "author": "rory ashmore",
      "helpful_votes": 9,
      "publication_date": 20150908
    },
    {
      "title": "Comfort and hard wearing.",
      "text": "This my second pair. I wear them daily and the last pair lasted 4 years.",
      "rating": 5.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 0,
      "publication_date": 20200625
    },
    {
      "title": "After the apocalypse the only things remaining will be cockroaches, VW Beetles and Meindl boots.",
      "text": "Fantastic pair of boots. I did a lot of research before ordering these and they do not disappoint. Super comfortable after 3 days, very well made and will probably outlast me. Highly recommend these boots and this seller. Don’t forget to buy wax as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Ceri Williams",
      "helpful_votes": 0,
      "publication_date": 20191113
    },
    {
      "title": "Very good boots, recommended.",
      "text": "Good boots. Can't remember when I bought them but I think it's about 2 years, just after I got divorced. I've worn them regularly and very often. I usually walk about 4 to 5 miles most days but not all and have periods when I don't go out. I've waxed them regularly and I must say they are excellent. The heels are wearing down a bit now and I wonder if Miendl do repairs, not sure how to get in touch. My only complaint is that the tongue of the left boot always slips over to the left and one of the very tough metal lace hooks bent, I've no idea how! Still an excellent boot. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "ItIsAsItIsNow",
      "helpful_votes": 0,
      "publication_date": 20201110
    },
    {
      "title": "great boots",
      "text": "this is the second pair of Meindl boots I've owned. No need to break in - comfortable from day 1. So comfortable in all terrains. Could walk for miles and miles in them without any bother. Would happily recommend them to all walkers and hikers. You won't be disappointed",
      "rating": 5.0,
      "verified": true,
      "author": "Shampoo",
      "helpful_votes": 0,
      "publication_date": 20201028
    },
    {
      "title": "Brilliant boots",
      "text": "These boots fit me perfectly and were comfortable straight out the box very good quality just as good as my lowas",
      "rating": 5.0,
      "verified": true,
      "author": "Nath",
      "helpful_votes": 0,
      "publication_date": 20201213
    },
    {
      "title": "Fantastic boots",
      "text": "Excellent, totally living up to expectations! Should hsve bought these years ago!! 😂😂",
      "rating": 5.0,
      "verified": true,
      "author": "Angus",
      "helpful_votes": 0,
      "publication_date": 20201122
    },
    {
      "title": "Comfortable and good quality but on the small side",
      "text": "I got these from Black's as an exchange for a pair of Brasher Country Master boots, which were faulty, and they are considerably better in every way. I've had them for about three months now and they've coped very well with the wet and muddy conditions and everything about them seems good quality, including the laces. I've oiled them a few times with neatsfoot oil and they have remained soft and supple and perfectly waterproof, even through regular walks of long, wet, grass. Overall, I can't fault them, however I have always taken a size 9 but I do find that with these I would be happier with a 9.5 as they do seem a little on the short side.",
      "rating": 5.0,
      "verified": false,
      "author": "Johnnybluetime",
      "helpful_votes": 2,
      "publication_date": 20190326
    },
    {
      "title": "Super, super boots.",
      "text": "Great boots super comfy. I knew as soon as I put my foot in that they were the boots for me. I've only wore them twice, but throughout both times they have remained dry, warm and most importantly, dry. Top tips, but a pair a size up from your regular size and buy a summer hiking sock as the boots are really warm, even in -2.",
      "rating": 5.0,
      "verified": false,
      "author": "Siabbo",
      "helpful_votes": 8,
      "publication_date": 20151202
    },
    {
      "title": "leaking after just 6 weeks",
      "text": "had to return the boots today as they were leaking round the toe area, as you can see from the pics, the leather was darker brown where the water leaked in, I had taken good care of them, cleaned after every use, and proofed with meindl sports wax, I did not buy these from amazon I got them from go outdoors, I returned them today for a refund, looking at the forums it seems that meindl aren't quite the great quality that they once were, which is a shame really as they were a very comfortable boot,",
      "rating": 1.0,
      "verified": false,
      "author": "ian ",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "Bad quality soles",
      "text": "The shoes are really comfortable, but the soles seem to be of very poor quality. Having worn these shoes twice, doing a total of no more than 10 miles, on country paths and fields (barely any hard surfaces) and they've already started showing a lot of wear. Having paid more than 200 pounds for these shoes, this is unacceptable and I will be requesting my money back for these.",
      "rating": 1.0,
      "verified": false,
      "author": "Thomas",
      "helpful_votes": 0,
      "publication_date": 20200809
    },
    {
      "title": "Good, strong, comfortable.  Not sure about the sole.",
      "text": "Bought for rough-country walking, for which they are excellent. Had careful foot measurements before purchase. They're comfortable, strong, well waterproofed and provide good ankle support. I'm less than happy with their grip on rock, especially if a little wet. The sole pattern looks very swish and technical, but the grip is nowhere near as good as \"traditional\" Vibram soles, especially Vibrams with softer rubber.",
      "rating": 3.0,
      "verified": false,
      "author": "Whigwood",
      "helpful_votes": 0,
      "publication_date": 20201116
    },
    {
      "title": "Bhutiful Pair Of Boots",
      "text": "Fantastic boot but they do seem to need a bit wearing in. Have worn these numerous times now from hikes in the lakes and the Cheviots to running around during airsoft and they have remained dry no matter what. Very pricey on here though, I got them at Go Outdoors for about £150 with their price match + 10% off. Definitely worth shopping around for.",
      "rating": 5.0,
      "verified": false,
      "author": "James",
      "helpful_votes": 7,
      "publication_date": 20151029
    },
    {
      "title": "Not worth the money",
      "text": "Not worth money I've had replaced 3 times now & still wet feet. I walk dogs daily & are not a good boot for that as out in all weather save your money is my opinion",
      "rating": 1.0,
      "verified": false,
      "author": "G",
      "helpful_votes": 6,
      "publication_date": 20160917
    }
  ],
  "product_meta": {
    "title": "Meindl Bhutan MFS Men's Hiking Boots",
    "description": "From simple strolls to demanding trails, the Bhutan MFS from Meindl offers the protection and comfort you need. It has a GORE-TEXÂ membrane for waterproofing and a Memory Foam System that replicates the shape of your foot at the ankle, collar and tongue zones for a comfortable, perfect fit. - Gore-Tex Membrane",
    "rating": 4.6,
    "feature_bullets": [
      "Waterproof & breathable Gore-Tex performance lining",
      "Memory foam system - Perfect fit every time",
      "Outer Material: Leather",
      "Sole: Gum Rubber",
      "Closure: Lace-Up",
      "Heel Height: 1 centimetres",
      "Shoe Width: Medium",
      "Meindl multigrip Vibram sole",
      "Nubuck leather upper"
    ],
    "specifications": {
      "Item Weight": "320 Grams",
      "Date First Available": "3 Mar. 2015",
      "Manufacturer": "Meindl",
      "ASIN": "B01N3T1VJ3",
      "Manufacturer reference": "292646",
      "Department": "Men’s"
    },
    "categories": [
      "Fashion & Athletic Trainers",
      "Shoes",
      "Sports & Outdoor Shoes",
      "Men's Shoes",
      "Trekking & Hiking Footwear",
      "Shoes & Bags"
    ],
    "price": 263.27
  }
}