{
  "website_summaries": [
    {
      "verdict": "If SiriusXM is your go-to for live sports, music, and news, then this is perfect fit.",
      "pros": [
        "Stores up to 20 channels for quick access",
        "Sound quality is top notch",
        "Can be paired with external speakers for home use as well",
        "Comes with unique features such as the ability to pause a song and zero commercials"
      ],
      "cons": [
        "SiriusXM package is required"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "Bestselling vehicle kit for satellite radio comes with features galore – for those seeking a better overall experience.",
      "pros": [
        "Can store up to 20 favorite channels and pause, rewind and replay live satellite radio",
        "TuneMix allows you to create your own favorite music channel",
        "Access to Sirius programming",
        "State of the art graphics",
        "Easy to install",
        "Can browse other channels while listening to another"
      ],
      "cons": [
        "Subscription sold separately, and channel lineup will vary depending on the package",
        "Issues with antennas diminishes reception"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Hate the satellite industry",
      "text": "Just FYI to anybody thinking about buying this product. If you have satellite radio and you think you’re going to add this to your second vehicle and listen to music that you are already paying for you are seriously mistaken. They will want a separate charge for this device. Do yourself a favor go get Spotify.",
      "rating": 1.0,
      "verified": true,
      "author": "Ken",
      "helpful_votes": 26,
      "publication_date": 20181123
    },
    {
      "title": "Broken out of the box",
      "text": "Returning due to malfunctioning connection of antenna. Constant signal interruption with message antenna is broken or disconnected. I've read many comments over this same issue. This is poor engineering and qualify control from Audiovox. Returning radio and docking station for complete exchange. Does anybody from Sirius XM have anything to say over this ???",
      "rating": 1.0,
      "verified": true,
      "author": "Gustave Akselrod",
      "helpful_votes": 56,
      "publication_date": 20150607
    },
    {
      "title": "Perfect!",
      "text": "Excellent! We’ve had XM/ Sirius satellite radio for many years. This receiver is excellent and exactly as described. The one BEWARE to keep in mind is the advertising of one free month and free activation is misleading. If you are a new subscriber you may actually receive this. However if you are a current customer you will not receive the free month. When you call to switch your current subscription to the new receiver they will TRY to charge you a $15 activation fee. Refuse to pay it and they will waive the fee! Same when it’s time to renew your service at the inflated prices :)",
      "rating": 5.0,
      "verified": true,
      "author": "B. Schuck",
      "helpful_votes": 17,
      "publication_date": 20171226
    },
    {
      "title": "Nice XM radio",
      "text": "Bought th as a replacement for my husband's Sirius radio. The price was unbeatable, and the radio is very nice. The only complaint I have, is that the radio is considered an XM and not Sirius, so he had to pay a fee for switching over. I know that's not the seller's fault, just throwing that out there as an FYI for anyone considering buying this.",
      "rating": 4.0,
      "verified": true,
      "author": "A. Smith",
      "helpful_votes": 55,
      "publication_date": 20150218
    },
    {
      "title": "Turned out to be a real lemon",
      "text": "Works great, big improvement from the Pioneer Inno mp3 version that it replaced. UPDATE: The home kit quit working after 4 months and the radio itself died after 5 months. Completely dead, wouldn't even turn on. It was nice while it worked. There is basically no warranty beyond the 30 day Amazon return policy. I was under the mistaken impression that buying from Amazon offered some protection. When I then called XM, they said too bad you bought it from Amazon because we would have covered you for a year.",
      "rating": 1.0,
      "verified": true,
      "author": "Country Girl",
      "helpful_votes": 26,
      "publication_date": 20150723
    },
    {
      "title": "No Quality! Not worth the money! Don't buy",
      "text": "This is the worst Satellite radio receiver I have ever had! Just touch it and it loses the connection with the base. It is completely worthless in a vehicle that is moving!",
      "rating": 1.0,
      "verified": true,
      "author": "Mary. B",
      "helpful_votes": 11,
      "publication_date": 20180217
    },
    {
      "title": "Easy installation",
      "text": "Easy installation- after several years on my old XM radio, it finally just wore out Ordered the entire package very reasonably over what I could pay for it at a local audio store or a truckstop! Especially pleased with the adhesive radio stand that enables me to place it anywhere on my dashboard I wish If you are halfway handy, you could install this and hide the wires etc. with just a little investment of your time.... The three months free upfront was a nice gesture also",
      "rating": 5.0,
      "verified": true,
      "author": "Toolman",
      "helpful_votes": 5,
      "publication_date": 20180825
    },
    {
      "title": "Awful sound quality - heavily compressed",
      "text": "I enjoy the SiriusXM service. Mainly I listen via the mobile App which sounds find. The sound quality from this product is awful. The features are great and it's nice to use. The sound from this is akin to a 96 kb MP3 that was ripped in 1993. You can hear the major over-compression in everything that plays from this. The low end sounds muddy, the high end sounds harsh and unclear and everything in the middle is just a mess. It's probably good enough for most people but it sounds way worse than broadcast FM and not even close to playing Apple Music tracks over bluetooth to the same car stereo.",
      "rating": 2.0,
      "verified": true,
      "author": "James B",
      "helpful_votes": 4,
      "publication_date": 20170809
    },
    {
      "title": "Great radio, but mine wasn't a new product",
      "text": "I like this radio and would buy the same unit again. I would, however, buy from a different seller. Although sold as new, my radio was clearly not. The outer package had been opened as well all of the individual bags inside the box. The radio face had a sticky smear on it. It cleaned up okay and I was able to get it activated so it wasn't a total failure.",
      "rating": 3.0,
      "verified": true,
      "author": "D. Otto",
      "helpful_votes": 5,
      "publication_date": 20190221
    },
    {
      "title": "not as good reception as the vehicle radio.",
      "text": "To receive stations the antenna some times has to be moved. Forget attempting to install antenna out side or on windshield inside. Wind outside and heat inside cause it to fall off. It isn't as user friendly as the in radio units. The sound quality doesn't seem to be as good as in radio. Receiver refuses to stick any where but in the cup holder due to textured surface of dash. Screen is very small and difficult to see. The cords are too long and look unsightly hanging from dash. For the price I guess it was worth it but don't expect in dash sirius radio quality.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190308
    },
    {
      "title": "Not setup 4 Home Use.",
      "text": "Just got my Radio, opened and found there is no way 2play in my HOME, The whole reason I bought it. Now 2buy a home kit is $40 more. Poor wording in Description, had I bought the other number which I assume is 4home it's $83, then I have 2buy a another kit 4 car. WHT the Heck don't they just sell 1Unit w both, cause that's what I thought I bought w this one. Now I have 2 Return. I'm done buying online.",
      "rating": 1.0,
      "verified": true,
      "author": "lefty",
      "helpful_votes": 5,
      "publication_date": 20180705
    },
    {
      "title": "Best dock and play satellite radio ever!",
      "text": "I love my Onyx Plus! Looks great and has great features!!",
      "rating": 5.0,
      "verified": true,
      "author": "D. Schultz",
      "helpful_votes": 24,
      "publication_date": 20160130
    },
    {
      "title": "Perfect!",
      "text": "Bought this for my husband to use in multiple cars. He loves it. We have one kit in our truck and another in his car and it is so easy for him to move from vehicle to vehicle. He also took it on a trip from Ohio to Missouri and had no major issues and said it was just like having an actual XM radio installed in the car. He did say the audio is a lot clearer if you use the included aux cord, but using the included transmitter worked ok too.",
      "rating": 5.0,
      "verified": true,
      "author": "shelby",
      "helpful_votes": 2,
      "publication_date": 20181127
    },
    {
      "title": "Top of the line satellite radio",
      "text": "This is my first SiriusXM radio, the other two were just Sirius radios. Technology has come a long way in the last fourteen years. Color display, 20 presets, pause and rewind and 200+ channels to listen to. I'm so happy I got a lifetime subscription fourteen years ago from Sirius. My other two radios are still working, but got this one because my fathers radio (a Starmate-2) quit working but it turns out it was a bad power supply for his boom box unit, so I retired my original unit.",
      "rating": 5.0,
      "verified": true,
      "author": "Steven Estabrook",
      "helpful_votes": 0,
      "publication_date": 20200601
    },
    {
      "title": "Defective radio. On the phone for two hours with ...",
      "text": "Defective radio. On the phone for two hours with SiriusXm technicians. Radio would only pick up channel 350. Technician told me it was a lemon or refurbished (Amazon advertised it as new). Tech said that $56 price from Amazon for a radio that retails for $99 should have been a clue.",
      "rating": 1.0,
      "verified": true,
      "author": "M. Oberman",
      "helpful_votes": 8,
      "publication_date": 20170501
    },
    {
      "title": "Good quality products difficulty finding optimal antenna placement",
      "text": "This item works OK. The issue that I’ve had with it is placing the antenna in an area within my home that receives a clear signal. In addition, the antenna is fairly conspicuous and doesn’t look so great in Plainview. But also like to point out that SiriusXM is notoriously challenging to work with when trying to set up existing accounts with additional devices which made using this device less than optimal. I realize this is not any fault of the seller it’s just an unfortunate reality with SiriusXM and it’s peripherals.",
      "rating": 4.0,
      "verified": true,
      "author": "Student77",
      "helpful_votes": 0,
      "publication_date": 20190727
    },
    {
      "title": "I just decided to return the item in disgust. Amazon's service has been excellent",
      "text": "This was the second identical radio that I purchased. When talking with XM tech, they told me that since I couldn't pull up channel 1, it was defective. The replacement did the same thing. It's my ascertion that XM could not understand my problem. So, instead of dealing with them over the phone, I just decided to return the item in disgust. Amazon's service has been excellent. Thanks.",
      "rating": 1.0,
      "verified": true,
      "author": "Michael Decker",
      "helpful_votes": 8,
      "publication_date": 20170720
    },
    {
      "title": "Great gift for dad",
      "text": "I bought this for my dad for Father's Day because he couldn't get sirius in his new car. He was really excited and hasn't stopped talking about how he can listen to the Beatles station whenever he wants! It came in perfect condition and had everything included. I chose this because it was all in one, which made it easier. Installation wasn't what I expected, but I also didn't look into it, so make sure you know what you're getting yourself into. It all worked out well though!",
      "rating": 5.0,
      "verified": true,
      "author": "Brianna",
      "helpful_votes": 3,
      "publication_date": 20170724
    },
    {
      "title": "Historical Piece",
      "text": "The physical unit is built well, but it's quarky and weirdly designed. You can tell marketing had too much say. Like there's no volume control, but in a buried menu you can set \"sound level\"... As if this is my sole device for music connected only to a speaker. The service is way outdated with limited channels and content and I should never hear a commercial on a paid service. I imagine that in the late 80s or early 90s this was a great device. Now it feels dollar store quality.",
      "rating": 2.0,
      "verified": true,
      "author": "Zacc",
      "helpful_votes": 2,
      "publication_date": 20190209
    },
    {
      "title": "Great gift!",
      "text": "I bought this for my husband. The installation was easy. We thought we were going to have to buy new speakers for the car. We were wrong. It actually made my speakers sound better! He enjoys the ability to pause and rewind what he is listening to.",
      "rating": 5.0,
      "verified": true,
      "author": "Joey",
      "helpful_votes": 2,
      "publication_date": 20181201
    },
    {
      "title": "Easily set up in under 5-minutes",
      "text": "Easily set up in under 5-minutes! I was amazed changing from an older SiriusXM tuner to this one, I knew it would be a struggle, but within 5-minutes, chatting on my phone, it was done and listening to wonderful satellite radio! The screen is smaller than I expected, so to see what channel and song is playing I have to get up and walk over to it. But aside from that, I love it!",
      "rating": 5.0,
      "verified": true,
      "author": " Mark Nettles",
      "helpful_votes": 3,
      "publication_date": 20171105
    },
    {
      "title": "Great XM receiver",
      "text": "An updated version of our old Delphi. Works well. Sound quality is great, but then it is connected to a Bose. Did not use tech support, so couldn’t rate that. Don’t use the remote control because we use the Bose remote for off and on. Only listen to one XM station, so no need to change channels!",
      "rating": 5.0,
      "verified": true,
      "author": "Merry Girl",
      "helpful_votes": 0,
      "publication_date": 20191109
    },
    {
      "title": "Quick Station Access is Worth the Extra Cost",
      "text": "Have been using it for a few weeks now. It works great. Being able to program 20 favorite stations for quick tuning is worth the extra price. We have a minivan; there's a very helpful YouTube video showing how to thread the antenna cable so that the antenna can be easily moved from the outside to the inside of the van (or any other vehicle with a rear hatch) whenever that is desired. Very helpful.",
      "rating": 5.0,
      "verified": true,
      "author": "BSquared18",
      "helpful_votes": 2,
      "publication_date": 20180223
    },
    {
      "title": "GREAT RADIO",
      "text": "This was a birthday gift for my wife. First Sirius home radio for us so ive hit the new purchaser things others fail to explain. You get the antenna, radio , docking system together. Speakers you provide separate. Assembly was almost effortless. The antenna is not what you would think is an antenna flip open unit with a simple plug in so no need to run it outdoors, it sits on a higher shelf by its self. Very simple plug ins to power and speakers. Easy straight forward to use with detailed explanation and GREAT customer service. just can not ask for more.",
      "rating": 5.0,
      "verified": true,
      "author": "joseph savino",
      "helpful_votes": 0,
      "publication_date": 20190111
    },
    {
      "title": "What happened to the Three months subscription",
      "text": "Easy to setup no issues with that, however, the reason I purchase this unit was for the added three months subscription. There no coupon or certificate regarding to the free three months subscription. When activation process went straight to payment options. Happy with the unit but feel cheated. If that promotion has expired it should be removed from description title.",
      "rating": 3.0,
      "verified": true,
      "author": "lwalkerboy",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "If you like Sirius XM in an older vehicle this is your kit",
      "text": "We sold our van with Sirius XM radio and still had an active subscription. The replacement van had a free trial subscription. We have a third older SUV with no Sirius XM radio so I ourchased the kit. The most difficult part was running the antenna wire from the back of the car to the front. Everything else was a breeze. I am using the feature to broadcast the audio over the FM radio and the sound quality is great.",
      "rating": 5.0,
      "verified": true,
      "author": "Bill",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "Works great everywhere!",
      "text": "This portable radio is great. A but cumbersome with three cables connected to it in the vehicle, but we can now listen to Sirius/XM while camping, working in the yard, and at job sites and relaxing at home. We love it!!! Works well in all situations with proper placement of antenna.",
      "rating": 5.0,
      "verified": true,
      "author": "Rhonda Sue L",
      "helpful_votes": 2,
      "publication_date": 20180529
    },
    {
      "title": "False advertising by SiriusXM",
      "text": "The product is great. But don’t let the free 3 months of free service get you. It’s says on the box get 3 month free with purchase. I have been a customer since 2006. I asked for the 3 months free when activating this radio and they put me on hold for 20 minutes, then told me I had to call a different number, after calling the new number and go thru the same thing they tell me they can’t help that I have to call yet another number. It’s a scam, false advertising by SiriusXM",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200508
    },
    {
      "title": "Easy to install and use!",
      "text": "Easy to install and use! Bought this for my wife's 4Runner, works great. My only complaint iis the power cord is a big adapter for a cigarette lighter port, since wife uses hers for cell phone charger I bought a external cigerette lighter socket and piggyback wired it to the existing wiring and plugged satellite receiver into it and hid this under console out of the way. Works great, may get me one for MY truck!",
      "rating": 4.0,
      "verified": true,
      "author": "rins71mc",
      "helpful_votes": 0,
      "publication_date": 20181116
    },
    {
      "title": "Bought item when it was on sale now it is half off. Wth?",
      "text": "Bought this and spent close to an your on the phone with Siriusxm about their false advertising. After many arguments they finally gave me a deal. Using the receiver the hardware is slow like a snail so I had to setup as many favorites as i could to get it to work properly. I now come to find it is half off what I paid and if i didn't already have it setup i would return it",
      "rating": 1.0,
      "verified": true,
      "author": "WQND300",
      "helpful_votes": 0,
      "publication_date": 20190723
    },
    {
      "title": "Enjoying so far.",
      "text": "As a truck driver I am loving the XM unit. It is easy to install. It is a bit of a learning curve for navigating through the channels. Beware! When you call to get it registered and activated. You need to tell XM you have a free trial or they will just try to sell you on a high price plan.",
      "rating": 5.0,
      "verified": true,
      "author": "Joey",
      "helpful_votes": 0,
      "publication_date": 20181111
    },
    {
      "title": "SiriusXM is good and no issues but you need to understand that ...",
      "text": "SiriusXM is good and no issues but you need to understand that if you travel distances, that you will be changing the stations that it receives on manually often. Running the cable and trying to get it inside of the door, while the door doesn't crush it will be another trick. The mount that I have doesn't work on the vents but does work on the drop down ashtray as long as I don't hit a hard bump. Sirius XM is great, if professionally installed and is built into the head unit but this wasn't what I had hoped for.",
      "rating": 4.0,
      "verified": true,
      "author": "james",
      "helpful_votes": 0,
      "publication_date": 20170724
    },
    {
      "title": "Very Nice Radio",
      "text": "Nice radio! I bought if for my daughter. We spent part of an afternoon installing it in her car; a Mazda 3 sedan. This radio has some great features such as notifying you if a certain band is playing on any station. You can then switch to that station and hear your favorite band's music. My daughter can remove the radio and take it with her. This is a good safety feature, Overall, we are real happy with this radio.",
      "rating": 4.0,
      "verified": true,
      "author": "J. Nevarez",
      "helpful_votes": 4,
      "publication_date": 20160412
    },
    {
      "title": "SiriusXM Radio including higher channel numbers not available on Sirius radios",
      "text": "Bought this for the extra channels not available on my older Sirius radios. This model includes channels into the 400s whereas my older Sirius radios did not include newer channels included in the SiriusXM series of radios.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard Haidle",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "Someone stripped this kit of some essential parts.",
      "text": "The kit was a Warehouse checked and approved return... Problem was there were lots of necessary parts missing such as the audio cable, the dash/window mounting bracket, the vent louver mount, screws, installation directions. Whom ever got a refund for returning this should not have gotten a full refund. someone made off with a lot of necessary parts.",
      "rating": 2.0,
      "verified": true,
      "author": "Donald E. Goldsmith",
      "helpful_votes": 0,
      "publication_date": 20191018
    },
    {
      "title": "It has held up well and I really enjoy the fact that regardless of where I am I ...",
      "text": "I drive for a living. 5-6 days a week for 12-14 hours a day I listen to this Satellite radio. This radio has been halfway across the country and back several times. I'd estimate at this point this radio has traveled over 20k miles over some rough roads and in extreme temperatures. It has held up well and I really enjoy the fact that regardless of where I am I can listen to what I want to.",
      "rating": 5.0,
      "verified": true,
      "author": "Dehietyi",
      "helpful_votes": 2,
      "publication_date": 20170111
    },
    {
      "title": "Awesome! Satellite radio in any vehicle make/model with an ...",
      "text": "Awesome! Satellite radio in any vehicle make/model with an aux input. No messing with CDs, music players or bad FM stations. When calling XM to set it up, tell them you are on the fence and just want to try it out. They gave me 3 months free and lower monthly price. The features on this little unit aren't extensive, or if they are, they aren't that intuitive. I pre-program 10 presets and don't touch anything else on it while driving. The one thing this needs is a rotary dial or else, 5 stars.",
      "rating": 4.0,
      "verified": true,
      "author": "Dodd Rivers",
      "helpful_votes": 0,
      "publication_date": 20161018
    },
    {
      "title": "Incomplete",
      "text": "No tail for antenna, no 3m pad for antenna ( hello space sattelite people, many modern cars have aluminum body and your magnet will not stick), no remote. You will spend about $30 adding these items so you can install this receiver. At least the pad and tail should come with a vehicle kit. What happened to \" whats in box\" details ?",
      "rating": 4.0,
      "verified": true,
      "author": "happy",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "Good product.",
      "text": "This Onyx Plus Radio was aesy to set up and activate. The Seriusxm Tech was very helpful and I was listening within a half hour. I have had service in my vehicle for years and there are a few channels wanted in my home since we can't go in the car too often. I highly recommend The Home kit to anyone needing this service.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200506
    },
    {
      "title": "Miss the Remote 😱",
      "text": "Husband loves it. Not easy to program the pre-sets, you actually have to read the instructions! 😵🤐 And he was bummed because his older obsolete model had a remote but this fancy new model doesn't. Not a deal breaker, but a remote would absolutely make this a ⭐️⭐️⭐️⭐️⭐️! My only recommendation when buying this is that you realize it's Sirius XM and not just Sirius. Husband didn't and he had to upgrade his service to include the XM stuff which he wouldn't have automatically done without it. Otherwise I am satisfied using the radio! If hubby's happy, Mama's happy! 💗👍🏻",
      "rating": 4.0,
      "verified": true,
      "author": "Mzzhcoats",
      "helpful_votes": 0,
      "publication_date": 20170104
    },
    {
      "title": "Works great out of the box",
      "text": "Works great out of the box. Set up was easy as well as calling to activate the service. The unit picks up the satellite within my home and has a strong signal. We use the unit with our home system that has 8 speakers throughout our home. Function keys are easy to use. There are many station presets for your liking. The remote writing on each button is a bit small and hard to read. Non-the-less works as designed.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris G",
      "helpful_votes": 3,
      "publication_date": 20160629
    },
    {
      "title": "Cheap, terrible quality",
      "text": "Where the antennae plugs into the device is loose and keeps disconnecting my signal until I wiggle it. The sound is terrible as I can hear some constant static in the background that sends to coincidence with the acceleration of my car. My phone never had audio issues when I plug into the aux port.",
      "rating": 1.0,
      "verified": true,
      "author": "Critical",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Accessories are very poor quality",
      "text": "The device is actually quite nice and super simple to set up online (be advised you will be charged a $15 activation fee aside from your 3 month trial), but the car mount is defective or something and won’t lock the device in place. It’s honestly quite disappointing how bulky and poor quality the rest of the kit turned out to be. So right off the bat this item is going to be returned and I’ll be looking for another solution to get SiriusXM in my car.",
      "rating": 2.0,
      "verified": true,
      "author": "patrick",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "Works great. Note to everyone that buys one you should ...",
      "text": "Works great. Note to everyone that buys one you should always call customer service to start your service as you can usually get 1/2 priced 6 month deals on whatever package you want. Sometimes you may have to call back a couple times, but it's worth it. The sirius packages are otherwise ridiculously priced, but that isn't the fault of the radio itself.",
      "rating": 5.0,
      "verified": true,
      "author": "Joleme",
      "helpful_votes": 4,
      "publication_date": 20160330
    },
    {
      "title": "Flimsy docking station fails quickly",
      "text": "I purchased the home kit in July. initially hooked the docking station into my sound bar for the television, but then decided to look around for a more portable speaker. I finally found one I liked and plugged it in to the connector today, and the connector receptacle broke. So now I have a new speaker and a defective docking station and no sound. This is entirely unacceptable. What a royal pain and expense, as it appears I'm now going to have to order ANOTHer docking station.",
      "rating": 2.0,
      "verified": true,
      "author": "Gamma 5",
      "helpful_votes": 3,
      "publication_date": 20161104
    },
    {
      "title": "Get those upper channels",
      "text": "Bought this to replace an Onyx radio. We’ve only had this a few weeks but love that it has the higher channels that were missing from our old radio. The dock for our original Onyx also works with this one. We installed it in our truck camper and hooked it up to a small Bose speaker. Great sound in a tiny package.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180429
    },
    {
      "title": "This is a great radio",
      "text": "Easy to use. My wife was able to figure out how to turn it on and choose her favorite station with none of my usual help. It has many useful features and several stations can be preset. Easy to use and good sound quality. Worked the first time I turned it on. Easy to install.",
      "rating": 5.0,
      "verified": true,
      "author": "Joed",
      "helpful_votes": 0,
      "publication_date": 20191220
    },
    {
      "title": "Downgraded to DO NOT PURCHASE",
      "text": "Never worked particularly well with some background hissing and the item turned on/off randomly until it eventually failed so frequently it can only be described as worthless. Item extended warranty proves totally worthless, never ever again...",
      "rating": 1.0,
      "verified": true,
      "author": "Erik & Leslie H",
      "helpful_votes": 0,
      "publication_date": 20181124
    },
    {
      "title": "Best unit out there",
      "text": "Best unit out there, I previously had 3 of the same units that failed and I kept getting the antenna damaged or no signal notification that is caused by vibration that eventually breaks a small solder inside the unit that connects to the base but I'm going on a year with this one so hopefully Sirius finally fixed the problem.",
      "rating": 5.0,
      "verified": true,
      "author": "Manny",
      "helpful_votes": 0,
      "publication_date": 20191027
    },
    {
      "title": "Easy solution for no SiriusXM",
      "text": "I recently leased a mid line Mazda CX-5 which DOES NOT have SiriusXM capability. Mazda, in their infinite wisdom, makes SiriusXM available only on the top of the line model. This radio kit solved that problem. It was easy to install and set up. I recommend buying the remote control for it which is sold separately.",
      "rating": 5.0,
      "verified": true,
      "author": "amazonfan",
      "helpful_votes": 0,
      "publication_date": 20200729
    },
    {
      "title": "Easy installation",
      "text": "I bought this to provide more variety in my truck. I was worried about difficulty of assembly but turned out is was relatively easy, I place the antenna first. It turned out that installing the antenna over the passenger side window worked best.",
      "rating": 5.0,
      "verified": true,
      "author": "John Picklesimer",
      "helpful_votes": 3,
      "publication_date": 20160728
    },
    {
      "title": "Sound is good. Love some of the channels",
      "text": "Was very difficult to get subscription. Took 3 different phone calls before we got someone who actually knew what to do. We were supposed to get 3 months free with this and didn't get it bc no one knew about it and Said that it didn't exist. Blue tooth speakers don't work with it, the speaker has to be hooked up directly to it. We had to put the antenna out the window to get it to work.",
      "rating": 4.0,
      "verified": true,
      "author": "Tina Reynolds",
      "helpful_votes": 0,
      "publication_date": 20181227
    },
    {
      "title": "Looks great when pictured without wires",
      "text": "Looks great when pictured without wires. With wires, it is a mess. Antennae, aux cable, and power cable are kind of messy. Our Aux and power ports are near each other, so a cable wrap would have been nice to minimize the mess. The cables are pretty crappy quality too, stiff and difficult to maneuver around the console. We put it in the center console arm rest because its ugly with all the cables around.",
      "rating": 2.0,
      "verified": true,
      "author": "Rick",
      "helpful_votes": 8,
      "publication_date": 20150609
    },
    {
      "title": "Free trial isn't applicable. Cancelled in less than 2 months",
      "text": "The advertised free trial. Is not. It is for additional units. I was disappointed because I bought this unit for a friend and wanted him to try Sirius before he had to purchase air time. No such luck! The surf service was cancelled in less than 2 months but unfortunately stuck with a $50 paper weight",
      "rating": 3.0,
      "verified": true,
      "author": "Wes",
      "helpful_votes": 0,
      "publication_date": 20200223
    },
    {
      "title": "Buy a Radio directly  from Sirrus XM!",
      "text": "This radio was subscribed to another user. I was unable to use the free trial a had to pay the $15 reactivation fee. To top it off I had to also purchase a new battery for the remote. The radio is free from Sirrus XM and by the time you pay shipping it would of costs $20+ less!",
      "rating": 1.0,
      "verified": true,
      "author": "Bottle Cap",
      "helpful_votes": 0,
      "publication_date": 20200409
    },
    {
      "title": "This would have been great if I had a newer CD/Radio in my",
      "text": "does the job but my car is old - 2004 so didn't have a way to connect the aux in -don't want to get a new CD player so had to use my twist speaker for output. I even tried several cassette converters which failed. This would have been great if I had a newer CD/Radio in my car",
      "rating": 5.0,
      "verified": true,
      "author": "C. Stoyanoff",
      "helpful_votes": 2,
      "publication_date": 20170317
    },
    {
      "title": "Great Product, but I returned it.",
      "text": "I will give a positive review because I have heard the quality of the sound. I returned the product because I found it was not the right system for me. It is not a suggestion that it is not a good product. I thank Amazon for being considerate in assisting with my return because it was out of the return window.",
      "rating": 4.0,
      "verified": true,
      "author": "Shawanda McNeil",
      "helpful_votes": 0,
      "publication_date": 20191010
    },
    {
      "title": "Good radio but didn't last long",
      "text": "Great radio except it stopped working. I've had this radio since April and was working great. Three days ago it stopped working and said no sattelite signal. I tried unplugging the radio and moving the home antenna around. It will not pick up a signal at all. The antenna seems to be working because when you unplug the cable for the antenna it's says \"antenna damaged or disconnected\" to spend $80 and only work less than a year is unacceptable. This radio doesn't get moved at all either. I believe the issue might be the radio itself.",
      "rating": 2.0,
      "verified": true,
      "author": "Me",
      "helpful_votes": 0,
      "publication_date": 20180117
    },
    {
      "title": "I absolutely would not buy this receiver again. Ive ...",
      "text": "I absolutely would not buy this receiver again. Ive used two of these now in my truck, and each one the antennae comes loose or something because it constantly loses signal. I had used a different receiver between these two and never had any problems. I bought this one because you can have 20 presets and rewind, but it is not worth it due to lack of quality in signal.",
      "rating": 1.0,
      "verified": true,
      "author": "Shawn Cusack",
      "helpful_votes": 0,
      "publication_date": 20180416
    },
    {
      "title": "Came scratched up",
      "text": "Radio itself was all scratched up I had to double check my order thinking I may have bought a refurbished one but I didn’t said it was new but came all scratched up not sure why",
      "rating": 1.0,
      "verified": true,
      "author": "Tony cushman",
      "helpful_votes": 0,
      "publication_date": 20190827
    },
    {
      "title": "Turn on once then that's about it.",
      "text": "It turn on one time then that's about it didn't even get to set it up sending back hope the second works more than once. Got a second one cause maybe the first one just was junk, nope I was wrong the second I was about to use on the way to work after that it won't turn back on now I am fighting to cancel the subscription",
      "rating": 1.0,
      "verified": true,
      "author": "anthony",
      "helpful_votes": 0,
      "publication_date": 20190909
    },
    {
      "title": "Radio dead on arrival.",
      "text": "Antenna broken out of the box. No satellite signal. Contacted sirius customer service. They were useless. Did not want to fix the radio. They just wanted to sell a subscription for a non functional radio. Returned box next day to amazon. Amazon returns are very painless. Will not do business with Sirius again due to their lack of customer service.",
      "rating": 1.0,
      "verified": true,
      "author": "Dan Clark",
      "helpful_votes": 10,
      "publication_date": 20150502
    },
    {
      "title": "Great!",
      "text": "Pretty great little gadget! I recently received a company vehicle and wouldn't you know it, it didn't include Sirius or even the option to pay for Sirius. I was devastated because Sirius has been my chosen music source for many years. This solved all of my problems, thanks to a husband that fixed everything for me! It's worth the money and does what it should. I didn't receive a remote, but that's fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Samantha Doucet",
      "helpful_votes": 0,
      "publication_date": 20200309
    },
    {
      "title": "Watch out Stern fans",
      "text": "They wanted a $75 transfer fee and I didn't get Howard Stern. I called back and they tried to tell me they needed $400 to update my subscription to Premier in order to get it. After I bitched they told me I could have it for free. But it looks like they charge me a hundred dollars for it. Plus my $75 transfer fee. The radio does work but doesn't seem to have a record feature.",
      "rating": 2.0,
      "verified": true,
      "author": "Jeffrey W.",
      "helpful_votes": 0,
      "publication_date": 20170106
    },
    {
      "title": "Makes traveling so much better",
      "text": "Works great. I like the full color screen. It displays the album art of whatever band is currently playing. I plug it in using an auxiliary cord and that way I don’t have to worry about finding a radio signal while I travel. They asked me when I called to have service connected if I bought the unit from Amazon, and I think I was supposed to receive a free echo dot... but I never did.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190124
    },
    {
      "title": "Complete GARBAGE!",
      "text": "Had this thing a week and worked fine for about 3 hours PERFECTLY and then with EVERYTHING NEW hooked up it went back and started cutting out and skipping and giving the error msg of bad antenna no connection and doing the EXACT SAME THING my old one did!! I didn't bother calling XM because you have to find someone that actually speaks English first to understand your problem and then from reading other reviews they don't care anyways since you didn't but it from THEM! I had my last one for almost 5 years with no issues and now this! My boss has 3 of them in his semis and they ALL do the SAME THING!",
      "rating": 1.0,
      "verified": true,
      "author": "A. Sanchez",
      "helpful_votes": 0,
      "publication_date": 20200206
    },
    {
      "title": "Needs current tech",
      "text": "First off the \"Free\" trial requires a activation fee so its slightly free. I had this installed in a '19 Honda Accord Sport. The new radio system has NO AUX port, I had to buy a AUX to USB adapter. Also the Honda radio system is awkward so the FM modulator needed an adapter. After install there is a small buzz in the speakers, I know its the power but its feed back from the Honda system, nothing can be done about it. SiriusXM needs to update there kits to match modern technology and ditch the activation fee.",
      "rating": 3.0,
      "verified": true,
      "author": "Jon B.",
      "helpful_votes": 0,
      "publication_date": 20190321
    },
    {
      "title": "A great little unit.",
      "text": "Is easy to get started and install the unit in my vehicle. I stared with the vent installation but soon switch to the pedestal. A little difficult to navigate to the stations you want but once you have the presets set up it is great.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190525
    },
    {
      "title": "Easy to see",
      "text": "I live in Arizona and it is very bright here but you can easily see the screen even with your shades on. The sound quality is awesome like night and day from my stock radio that came with the car. Definitely recommend this stereo.",
      "rating": 5.0,
      "verified": true,
      "author": "Donald McLellan",
      "helpful_votes": 0,
      "publication_date": 20190420
    },
    {
      "title": "Please beware before purchasing....",
      "text": "Great product and works very well, but you have to obtain separate service for this device. Like it's another vehicle on your account. You cannot use existing service that you usually have in your vehicle for this device.",
      "rating": 3.0,
      "verified": true,
      "author": "Jb",
      "helpful_votes": 0,
      "publication_date": 20180518
    },
    {
      "title": "Weak FM signal",
      "text": "I like the radio and ease of use, however the FM signal is very weak. It would have to be plugged into my stereo or right on top to use but the antenna could not get a signal. I purchased a FM transmitter to use it in the house and on the property.",
      "rating": 3.0,
      "verified": true,
      "author": "M. Harvey",
      "helpful_votes": 0,
      "publication_date": 20190522
    },
    {
      "title": "Two Onyx Plus Radios Stopped Working after Two Weeks",
      "text": "I have purchased two Onyx Plus radios; each stopped working after less than two weeks, failing to turn on when employing either the unit or remote power button. As a long-standing All Access subscriber, SiriusXM subsequently dispatched an Onyx EZ at no cost. It has been in my possession for more than a month and I have yet to encounter any difficulties. Given my Lynx radio worked well for many years, I remain surprised the Onyx Plus has proven so problematic (or, better, valueless), at least for me.",
      "rating": 1.0,
      "verified": true,
      "author": "Jerrold Elkin",
      "helpful_votes": 0,
      "publication_date": 20180913
    },
    {
      "title": "Great option to add to your car",
      "text": "This is great! My RAV4 didn’t come with satellite, but I travel so much and live in a small town so I needed it. I bought this and it is awesome! I get all the channels with the 3 month free trial! The sound quality is better when plugged into the cars aux, but there is the fm transmission option. Definitely recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Jocey 93",
      "helpful_votes": 0,
      "publication_date": 20201002
    },
    {
      "title": "No free service as stated.",
      "text": "I was happy with the radio and accesseries. However, when I phoned sirius for the free service, they informed me that it didnt come with it. So if you are expecting free service as stated, dont hold your breath. I was very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Pony",
      "helpful_votes": 2,
      "publication_date": 20180711
    },
    {
      "title": "On/Off circuit misfires.",
      "text": "About 1 out of 5 times, when I turn it off, the sound stops then 2 to 5 seconds later, the device sound & display comes on again. About 1 out of 5 times, when I turn it ON, the screen lights up then about 2 seconds later the unit turns completely off-no sound & no display. This happens exactly the same if I use the button on the device AND if I use the remote control. Tech support has been dismal.",
      "rating": 2.0,
      "verified": true,
      "author": "Ruben Rodriguez",
      "helpful_votes": 0,
      "publication_date": 20200412
    },
    {
      "title": "You will have fees...",
      "text": "I wish it mentioned there is a start up fee to begin your subscription to xm radio. 17.10 for a 3mo \"free starter subscription\", and then its about 29$ A MONTH after. Very misleading. Hoping there is a better package available after the subscription ends bc 30/mo isnt worth it imo.",
      "rating": 3.0,
      "verified": true,
      "author": "IBoughtThis",
      "helpful_votes": 0,
      "publication_date": 20181225
    },
    {
      "title": "Disappointed",
      "text": "Extra $15! What they don’t tell you is you need to pay $15 connection fee and when you call to have it connected you need to give then a card number!!! If you don’t they won’t connect it!!! Make sure you call to cancel after 3 months!!! If you don’t they will charge you $100 for 6 months!!!! Online you can get $99 for 12 months!! Disappointed!!!!!",
      "rating": 3.0,
      "verified": true,
      "author": "Gina",
      "helpful_votes": 0,
      "publication_date": 20190109
    },
    {
      "title": "I will be sending this great little radio back",
      "text": "This has only to do with SiriusXm. They tell me I can not transfer my life time subscription to this radio. or any other radio. IT is not life time then. If the request for my subscription to the HQ of sirius does not work out. I will be sending this great little radio back.",
      "rating": 5.0,
      "verified": true,
      "author": "Gregory G.",
      "helpful_votes": 3,
      "publication_date": 20170327
    },
    {
      "title": "Great to have Satellite Radio in the home.",
      "text": "We have satellite radio in both cars and wanted to listen to the same stations when at home. The only problem is placing the antenna where it can receive satellite transmissions. Ths requires a window that does not have any obstructions.",
      "rating": 5.0,
      "verified": true,
      "author": "LAURENCE E WILLIAMS",
      "helpful_votes": 0,
      "publication_date": 20190102
    },
    {
      "title": "These work!",
      "text": "I bought one of these and a mobile connect kit...with one Sirius license I can source into my home and vehicle sound systems simply by moving this remarkably small receiver from cradle to cradle. The antenna is sensitive enough to pull in a signal from indoors...no window needed.",
      "rating": 5.0,
      "verified": true,
      "author": "metrology dufus",
      "helpful_votes": 0,
      "publication_date": 20180701
    },
    {
      "title": "Other than that it's a good unit. Bought one and got two more free ...",
      "text": "My only complaint is that the display is hard to read from just a couple of feet away. Difficult to see what channel you're on or switching to or to use any of the other features using the remote if you're listening from across a room. Even a small room. Other than that it's a good unit. Bought one and got two more free although the subscriptions are a bit pricey. This versatile radio can go from the house to the car or wherever you roam very easily with the respective docking or personal listening hardware.",
      "rating": 4.0,
      "verified": true,
      "author": "Lee",
      "helpful_votes": 0,
      "publication_date": 20150818
    },
    {
      "title": "Tiny",
      "text": "Works well menu instructions weak, also sirius wants a $15 charge for your free 90 days, I said no or I'll send it back. They waved it. but normal price is like $24 a month, it ain't that good.",
      "rating": 3.0,
      "verified": true,
      "author": "Patrick Kennedy",
      "helpful_votes": 0,
      "publication_date": 20200201
    },
    {
      "title": "No remote with it",
      "text": "Dont get sucked in by amazons bull S description about a remote control. It doesnt come with one. Have to buy the home kit in order to get one. Just a heads up! Radio is cool though.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer bb2002",
      "helpful_votes": 0,
      "publication_date": 20190123
    },
    {
      "title": "Powering up or down can be an issue",
      "text": "Frequently this device will not turn on with the first or even second time I push the power button. It will act as though it is turning on/loading but then the screen will inevitably go black I and will have to push the power button once or twice more. It also does this while powering down but in reverse obviously haha",
      "rating": 3.0,
      "verified": true,
      "author": "LRY",
      "helpful_votes": 0,
      "publication_date": 20171108
    },
    {
      "title": "Cheaply made, poor customer service",
      "text": "Radio was fine when it worked. The antenna had good service most places. Unfortunately I have gone through 2 of these same radios in the past 4 months. Both ended up with the same error message \"antenna disconnected or damaged...\". Customer service at SiriusXM made the experiences all the worse. But hey, they gave me 3 months free service as long as I CREATED A WHOLE NEW ACCOUNT! Very disappointed with the whole experience.",
      "rating": 2.0,
      "verified": true,
      "author": "donald frank",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "Great Radio, expensive subscription, but worth it.",
      "text": "Awesome! I love this gift. My wife got it for me for Christmas and it's great. You do have to spend money on the SiriusXM subscription, but it's worth it to be able to get great music and comedy channels. She can't wait for me to have my own workshop because she hates that I listen to the comedy channels all day long. She does like the commercial free music on some of the other channels. So it's a win win. It is also very easy to install. I hooked up the antenna and keep it on the desk. I didn't event extend the antenna at all and it works perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Lariston",
      "helpful_votes": 0,
      "publication_date": 20150113
    },
    {
      "title": "Save your money",
      "text": "The signal sucks! I get better reception using their FREE app on my phone! Not worth the subscription. I've tried putting the antenna everywhere but it makes no difference.",
      "rating": 1.0,
      "verified": true,
      "author": "Ms. Vicki",
      "helpful_votes": 0,
      "publication_date": 20180612
    },
    {
      "title": "Easy set up",
      "text": "My hubby wanted this for his semi truck because it had an old style radio in it. It gets staticky sometimes, but works good for the most part. (He bought a bigger external antenna and it helped.)",
      "rating": 4.0,
      "verified": true,
      "author": "Melania",
      "helpful_votes": 0,
      "publication_date": 20170524
    },
    {
      "title": "Worth the price",
      "text": "Easy to install. My dash is deep enough to mount antenna inside the car. Car kit is good. Good price. This unit was purchased for an older pickup and hookup in the AUX works and sounds great. Impressive next day shipping free.",
      "rating": 5.0,
      "verified": true,
      "author": "cherie",
      "helpful_votes": 0,
      "publication_date": 20190621
    },
    {
      "title": "I love it",
      "text": "I also bought the Portable Speaker Dock SD2 with this and they work very well together and the sound is awesome in my office. Had a few compliments on the looks and sound already and have only had it set up for a few days. I highly recommend this set up. I know you will enjoy it.",
      "rating": 5.0,
      "verified": true,
      "author": "Jack Williamson",
      "helpful_votes": 0,
      "publication_date": 20180816
    },
    {
      "title": "Works all day and all night!",
      "text": "I play music all day long and this is so great. I have XM in my cars and so great not to deal with commercials. I live out in the country and can't stream music. I bought an extension cord for the antenna and have it out on a peak of my house. great reception!",
      "rating": 5.0,
      "verified": true,
      "author": "BB",
      "helpful_votes": 0,
      "publication_date": 20181016
    },
    {
      "title": "Great service-no feee trail tho...",
      "text": "Always loved the service, bought a new receiver for the RV, the “free trail” is actually $15, or $30... nice bait and switch amazon!",
      "rating": 4.0,
      "verified": true,
      "author": "iridium",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "Good home addition",
      "text": "I use the radio in my car and in my house. The home kit plugs direct into my house stereo system and sounds great. It's nice to just hear music and no political adds all day long.",
      "rating": 5.0,
      "verified": true,
      "author": "cavman35",
      "helpful_votes": 0,
      "publication_date": 20200122
    },
    {
      "title": "SiriusXM SXPL1V1 Onyx Plus Satellite Radio",
      "text": "I like the SiriusXM SXPL1V1 Onyx Plus Satellite Radio because I can take the receiver from my truck to my boat for one low price. I spent about half a day to install it in my truck & boat. You do need two antennas for your truck and boat. Easy to install and you can listen to sports, music, comedy, & talk anywhere and not loose audio while traveling. For 40 dollars, this is the best product on the market.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard Pollock",
      "helpful_votes": 0,
      "publication_date": 20190121
    },
    {
      "title": "Horrible sounds quality",
      "text": "Sound in my wife's car is horrible. And I used a cable to connect it straight to the factory radio, so it has nothing to do with the FM signal. Save your money and buy something else.",
      "rating": 1.0,
      "verified": true,
      "author": "Who, me?",
      "helpful_votes": 0,
      "publication_date": 20191105
    },
    {
      "title": "problem returning",
      "text": "Need to return product it does not work for our car. Was just able to get to the company who was going to install it, as they were not open due to the virus until now. I need to return it. it is in new condition never used. please contact me asap",
      "rating": 1.0,
      "verified": true,
      "author": "Joan ",
      "helpful_votes": 0,
      "publication_date": 20200624
    },
    {
      "title": "Audio plug breaks off....",
      "text": "The radio receiver is ok...but the audio outlet plug on the back of the docking base ( attached on inside to the circuit board) is a piece of junk and will break off very easily rendering the radio useless...Handle with care when installing or removing the audio plug.",
      "rating": 1.0,
      "verified": true,
      "author": "Mandy T.",
      "helpful_votes": 0,
      "publication_date": 20190207
    },
    {
      "title": "Defective radio base",
      "text": "Have brought this radio for years but this time the base was defective the antenna plug is full of sodder and the center pin is missing . I team drive the big truck and equip gets ruff use. Lucky the old base works,but who knows for how long.",
      "rating": 1.0,
      "verified": true,
      "author": "Nancy Anne",
      "helpful_votes": 3,
      "publication_date": 20160301
    },
    {
      "title": "Garbage",
      "text": "They keep raising prices, and keep selling terrible radios. Since I've started buying these portable radios about 6 years ago, I've never made it more than a year without having to replace an antenna. Frustrating, especially when you rip out a bunch of your interior to hide the wires. Also, there customer service is terrible. Hope podcasts put them out of business.",
      "rating": 1.0,
      "verified": true,
      "author": "Joseph S.",
      "helpful_votes": 0,
      "publication_date": 20190602
    },
    {
      "title": "Everything that was stated about the radio I found to ...",
      "text": "Everything that was stated about the radio I found to be 100% true. From the reception, to the station availability, to even the installation instructions all as advertised. A home run !",
      "rating": 5.0,
      "verified": true,
      "author": "H. Rehm",
      "helpful_votes": 0,
      "publication_date": 20180528
    }
  ],
  "product_meta": {
    "title": "SiriusXM SXPL1V1 Onyx Plus Satellite Radio with Vehicle Kit with Free 3 Months Satellite and Streaming Service",
    "description": "Style:Onyx Plus with Vehicle Kit| Pattern Name:Satellite RadioWant the most from your satellite radio? Then the Onyx Plus with Vehicle Kit from SiriusXM is the radio for you. It allows you to Play SiriusXM through existing vehicle stereo with easy DIY installation. The company has combined their most advanced technology with exciting features to create the ultimate listening experience in or out of your vehicle. Get SiriusXM Extra Channels—20+ channels of additional music, sports, entertainment and SiriusXM Latino, a new set of Spanish language channels. See full color album art while you listen. Never again tune in to the middle of a song. Start songs from the beginning with Tune Start and create your own music channel by blending your favorite channels with Tune Mix. Did you miss something? Pause, rewind and replay on your favorite channels for up to 30 minutes. And sports fans—never miss a game or score again with game and score alerts, and sports ticker. And One-Touch Jump to traffic and weather for the city of choice or back to previous channel. Includes vehicle kit. Hear dedicated channels from your favorite artists like The Beatles Channel, Elvis Radio, Eminem’s Shade 45, Kenny Chesney’s No Shoes Radio, Pit bull's Globalization, Bruce Springsteen E Street Radio, Tom Petty Radio and Jimmy Buffet’s Margarita Ville.",
    "rating": 4.3,
    "feature_bullets": [
      "Subscription sold separately by Sirius. Channel lineup varies based on subscription package.",
      "To get three months Free service you must subscribe to the “all access” package. Provide your radio ID when activating and mention “never miss a beat.” a $15 activation fee and credit card are required for this offer.",
      "Sirius all access subscription package allows you to listen in your car on this radio, Plus on your phone, online and at home. Listen to 150+ channels in your car and over 300+ channels online and on the app.",
      "Store up to 20 of your favorite channels for one-touch access.",
      "Pause, rewind and replay live satellite radio Plus all your smart favorite channels.",
      "Create your own music channel that’s a blend of channels with TuneMix.",
      "Hear exclusive entertainment only available on SiriusXM like Howard Stern, Today Show Radio, Fox News, CNN and Kidz Bop Radio. Plus live play-by-play sports from the NFL, MLB, NBA, NHL, the best games in college sports and NASCAR races.",
      "Hear dedicated channels from your favorite artists like the Beatles channel, Elvis radio, Eminem’s Shade 45, Pearl JAM radio, Kenny Chesney’s No Shoes Radio, Pitbull's globalization, Bruce Springsteen E Street Radio, Tom Petty Radio and Jimmy Buffet.",
      "Take your radio with you in your home or office with accessories like SXDH3 home kit or SXD2 portable speaker dock (each sold separately).",
      "To activate your radio: Call 866-587-4225 or go online to SiriusXM.Com/activate now."
    ],
    "specifications": {
      "Product Dimensions": "4.5 x 2.4 x 0.7 inches",
      "Item Weight": "3.2 ounces",
      "ASIN": "B00I59XQKO",
      "Item model number": "SXPL1V1",
      "Batteries": "1 CR2 batteries required.",
      "Customer Reviews": "4.3 out of 5 stars3,063 ratings4.3 out of 5 stars",
      "Best Sellers Rank": "#1,487 in Electronics",
      "Is Discontinued By Manufacturer": "No",
      "Connectivity technologies": "AUX",
      "Other display features": "Car Audio or Theater",
      "Colour": "Black",
      "Included Components": "Mounting Accessories, Siriusxm Onyx Plus Satellite Radio Receiver, Auxiliary Cable, Magnetic-Mount Antenna, Powerconnect Power Adapter, Powerconnect Vehicle Dock, Owner's Manual",
      "Manufacturer": "Audiovox - Sirius",
      "Date First Available": "February 1, 2014"
    },
    "categories": [
      "Satellite Radio",
      "Car Audio",
      "Electronics",
      "Car & Vehicle Electronics",
      "Car Electronics"
    ],
    "price": 59.99
  }
}