{
  "website_summaries": [
    {
      "verdict": "Oxbow Essentials literally provides the high-quality elemental needs of any hamster or gerbil’s diet without the sugar, fillers, and artificial colors that may hinder long-term health.",
      "pros": [
        "Timothy hay meal, pearled barley, and oats are the first 3 ingredients",
        "Balanced diet",
        "High-fiber",
        "Fortified with essential vitamins",
        "Natural flavor hamsters love",
        "Promotes healthy digestion and teeth"
      ],
      "cons": [
        "Since this is a premium hamster and gerbil food recipe, expect to pay premium prices for it"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Hamster Approved",
      "text": "Our hamster is one picky little dude and was spoiled by seeds and nuts the first few days we had him while we waited for this to arrive. When we transitioned to this food, he initially turned his nose up at it and wouldn’t eat. Now he loves it and it’s all we will buy for him. The bags are large and we still haven’t opened the second one. According to a hamster expert friend, it has all the right ingredients to keep him happy and healthy.",
      "rating": 5.0,
      "verified": true,
      "author": "Rebekah Richardson",
      "helpful_votes": 4,
      "publication_date": 20190918
    },
    {
      "title": "No more wasted food!",
      "text": "These pellets make it impossible for the little critters to dig out the corn kernels or the sunflower seeds and leave the rest of the food to be dumped. My son's hamster loves it and it doesn't matter that it's more expensive because we're not throwing most of it away.",
      "rating": 5.0,
      "verified": true,
      "author": "Head Mistress",
      "helpful_votes": 5,
      "publication_date": 20180612
    },
    {
      "title": "My hamster loves these",
      "text": "I have a syrian teddy bear dwarf hamster and he loves these. These packages should last you just under a year each. So you shouldn't really need 2 unless your hamster eats an abnormal amount. But even for myself I refill his food about every 4days. Giving a break for a day when his tray runs out because I know he stores his food. But these last me just over a year however I mix with sunburst. So he's getting more then just these pellets.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel",
      "helpful_votes": 3,
      "publication_date": 20181214
    },
    {
      "title": "Same Product Despite Different Pictures",
      "text": "I needed a refill on this product, but was concerned that it may be different because the 2-pound photo is different from the 1-pound photo. It's the same! In fact, the 2-lb bag was just a delivery of 2, 1-pound bags. The image is the same as I was used to purchasing with the tan background (fence/barn photo).",
      "rating": 4.0,
      "verified": true,
      "author": "anonymous",
      "helpful_votes": 0,
      "publication_date": 20190605
    },
    {
      "title": "Top Brand of Hamster Food",
      "text": "I always use Oxbow product for my little animals. My guinea pigs lived for over seven years and my little hamster lived for two and half years. Good nutrition was an important part of their long lives.",
      "rating": 5.0,
      "verified": true,
      "author": "TW",
      "helpful_votes": 0,
      "publication_date": 20191122
    },
    {
      "title": "best gerbil food",
      "text": "one of the best gerbil foods on the market. the value makes it even better. the pellets are a balanced diet so its perfect to mix with treats. i will never use anything else because there inst a better option price or nutrition wise.",
      "rating": 5.0,
      "verified": true,
      "author": "Casey Stanley",
      "helpful_votes": 0,
      "publication_date": 20191024
    },
    {
      "title": "... food when we first got our hamster and the poor thing had neon green diarrhea",
      "text": "I used a different hamster food when we first got our hamster and the poor thing had neon green diarrhea. I switch to this food and we never looked back. The hamsters doing great and seems healthy. Nacho appreciates it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181019
    },
    {
      "title": "Best rodent food on the market!",
      "text": "I’m a veterinarian and this is the best rodent food on the market. Our personal hamster has been extremely healthy!",
      "rating": 5.0,
      "verified": true,
      "author": "Tracy Bennett",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "Our Hamster Loved it!",
      "text": "A great deal as you get 2 bags. Our hamster loves it and there is no waste. Would buy again! Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200525
    },
    {
      "title": "Gerbil approved",
      "text": "Our gerbs love this food, and it's good for them. We give them a good scoop of food with some seeds and snacks sprinkled throughout the day.",
      "rating": 5.0,
      "verified": true,
      "author": "Brianne Lester",
      "helpful_votes": 0,
      "publication_date": 20181005
    },
    {
      "title": "We attribute (right or wrong) their good health to this product and won't try anything else",
      "text": "Our gerbils live to 3 about years old. This is their base food (they also get fresh vegetables, fruit, and seeds). They seem healthy. We attribute (right or wrong) their good health to this product and won't try anything else.",
      "rating": 5.0,
      "verified": true,
      "author": "Anadrmos",
      "helpful_votes": 0,
      "publication_date": 20171201
    },
    {
      "title": "So Awesome!",
      "text": "Took my hammy some getting use to, but I slowly encorporated it in to her regular diet and she loves it! I also mix a little oxbow vegetable pellets for hamsters in with it also so she feels like she has a variety. I see SO MUCH more energy and seems over all happy. This stuff it great!!",
      "rating": 4.0,
      "verified": true,
      "author": "Mc13",
      "helpful_votes": 2,
      "publication_date": 20171024
    },
    {
      "title": "Best Commercial Hamster Food!",
      "text": "Hands down! This is what all the pet store owners say to me! Get this, unless your getting the fancy specially made ones or creating your own brand of hamster food! Straight from the store to your hands that is cheap.. this is the best for your hamster health",
      "rating": 5.0,
      "verified": true,
      "author": "Elle",
      "helpful_votes": 0,
      "publication_date": 20190325
    },
    {
      "title": "My Hamsters won’t eat",
      "text": "I am sure it is very healthy, but my three robo hamsters won’t eat it even if only feeding this food for an entire week, they would rather starve thenselves than eat this, so it certainly did not work for my hamsters unfortunately",
      "rating": 2.0,
      "verified": true,
      "author": "Richard Stroum",
      "helpful_votes": 0,
      "publication_date": 20190102
    },
    {
      "title": "Hamster loved it",
      "text": "Trying to get her healthier food, she couldn't shove enough in her mouth.",
      "rating": 5.0,
      "verified": true,
      "author": "Maddy",
      "helpful_votes": 0,
      "publication_date": 20200512
    },
    {
      "title": "Better for them than seed mix blends",
      "text": "My hamster loves this food!! Better for them than seed mix blends, ingredients hamsters actually require!!",
      "rating": 5.0,
      "verified": true,
      "author": "Megan Greiner",
      "helpful_votes": 0,
      "publication_date": 20180312
    },
    {
      "title": "The only food that keeps hampster at a good weight",
      "text": "This stuff is great and way cheaper than in stores.",
      "rating": 5.0,
      "verified": true,
      "author": "kris",
      "helpful_votes": 0,
      "publication_date": 20190306
    },
    {
      "title": "Not sure",
      "text": "Hanpster loves it...but it is kinda messy in the cage vs our other food",
      "rating": 2.0,
      "verified": true,
      "author": "So Happy",
      "helpful_votes": 0,
      "publication_date": 20181215
    },
    {
      "title": "Five Stars",
      "text": "Every hamster I have ever had prefers Oxbow food over any other brand.",
      "rating": 5.0,
      "verified": true,
      "author": "Kirsten",
      "helpful_votes": 0,
      "publication_date": 20180131
    },
    {
      "title": "Good. My hamster is eating it",
      "text": "Good. My hamster is eating it. My sister's hamster is eating it. Now they have more healthy (and hopefully tasty to them) food that I add/alternate with Science Selective and Hazel Hamster food.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20140711
    },
    {
      "title": "Arrived half empty!",
      "text": "One bag was completely full and the other half empty!",
      "rating": 2.0,
      "verified": true,
      "author": "OneSassyMom",
      "helpful_votes": 0,
      "publication_date": 20170819
    },
    {
      "title": "The only thing I'd feed my hamster, it doesn't ...",
      "text": "The only thing I'd feed my hamster, it doesn't have crazy amounts of sugar disguised as healthy food unlike other brands.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20150617
    },
    {
      "title": "Cujo Likes",
      "text": "Our hamster cujo likes the food, hes running around cage stuffed.",
      "rating": 5.0,
      "verified": true,
      "author": "Jean-Luc",
      "helpful_votes": 0,
      "publication_date": 20181016
    },
    {
      "title": "Dont over feed",
      "text": "Really good for russian dwarf hampster and its a good deal one bag at petsmart is 10 dollars here u can buy two for 15",
      "rating": 5.0,
      "verified": true,
      "author": "Hamde Khalil",
      "helpful_votes": 0,
      "publication_date": 20180922
    },
    {
      "title": "Hamster food",
      "text": "This is exactly what I got from the pet store, but a little cheaper.",
      "rating": 5.0,
      "verified": true,
      "author": "Courtney L Allen",
      "helpful_votes": 0,
      "publication_date": 20190420
    },
    {
      "title": "Happy and Healthy Gerbil's",
      "text": "My gerbils love this stuff. Yes, they will eat any seeds and nuts first, but who wouldn't?",
      "rating": 5.0,
      "verified": true,
      "author": "Comfort",
      "helpful_votes": 0,
      "publication_date": 20141122
    },
    {
      "title": "Crunchy",
      "text": "A bit dry but still a good snack. A handful a day on the bus to work.",
      "rating": 5.0,
      "verified": true,
      "author": "just some guy",
      "helpful_votes": 0,
      "publication_date": 20180725
    },
    {
      "title": "Picky hamster  loves it",
      "text": "My hamster, a very picky eater, seems to be fond of this food! And it’s one of the healthiest choices which is a huge bonus.",
      "rating": 5.0,
      "verified": true,
      "author": "Aliya Rose",
      "helpful_votes": 0,
      "publication_date": 20191005
    },
    {
      "title": "Recommended feed for prairie dogs",
      "text": "This is one of the few approved prairie dog feeds I have been recommended by my vet and by a very knowledgeable Facebook group called prairie dog parents. My prairie dog pup love this food and have no problems eating it. I also give this in addition to the american pet diner prairie dog feed. Really love this feed. Please if you have a prairie dog or about to get one do your research on their nutrition, Guinea pig food and most rabbit foods are bad for them, there are only a very few select foods healthy for them and this is one of them. My coco chanel and allium approve!",
      "rating": 5.0,
      "verified": false,
      "author": "Caroline Wesson",
      "helpful_votes": 0,
      "publication_date": 20180521
    },
    {
      "title": "Not safe!",
      "text": "Please don’t feed this. This is Timothy based and hamsters cannot digest it and can starve on it. Great brand for guinea pigs and rabbits though!",
      "rating": 1.0,
      "verified": false,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190524
    }
  ],
  "product_meta": {
    "title": "Oxbow Animal Health Hamster and Gerbil Fortified Food, 2-Pound",
    "description": "Hamsters and gerbils love this blend of timothy hay, oats and barley. Healthy Handfuls - Hamster and Gerbil Food is a complete, stabilized feed with optimally balanced nutrients that help maintain proper nutrition, weight, digestive function, dental health and quality of life for active pets. It includes a high level of fiber for digestive mobility. It does not include seeds, high-sugar fruits, or artificial preservatives, colors and flavors. Healthy Handfuls - Hamster and Gerbil Food is not intended for pregnant or nursing females. Serve with Oxbow hays to encourage foraging and provide enrichment.",
    "rating": 4.6,
    "feature_bullets": [
      "Two 1-pound bags",
      "For hamsters and gerbils",
      "Packaging May Vary"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "1 x 1 x 1 inches; 1.6 Ounces",
      "Date First Available": "April 28, 2014",
      "Manufacturer": "Oxbow",
      "ASIN": "B00JZQXTJ4",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Food",
      "Pet Supplies",
      "Small Animals"
    ],
    "price": 15.05
  }
}