{
  "website_summaries": [
    {
      "verdict": "This pair of sunglasses may be cheaper than the competition, but they are quality sunglasses.",
      "pros": [
        "These lightweight glasses are comfortable, durable, and stylish",
        "Five interchangeable lenses are included, though only one lens is polarized",
        "Lenses are distortion-free and clear, making these a great inexpensive option that will perform well on the road",
        "Several colors available, though not all include five lenses"
      ],
      "cons": [
        "Some customers did not find the polarized lenses effective"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great buy!",
      "text": "This set is really amazing for the price. Ok, the glasses are probably a bit fragile so you have to try and be careful with them but they come in a solid case that protects them. The lenses are relatively easy to change once you get the hang of it ( I was trying to be too gently at first for fear that I would damage them but then I got it!) and they are really great for any type of weather or brightness level and protect you from bugs. Very glad I got it.",
      "rating": 5.0,
      "verified": true,
      "author": "Florence Rosario",
      "helpful_votes": 0,
      "publication_date": 20180608
    },
    {
      "title": "Good for the money",
      "text": "I use them for cycling, PR is pretty sunny and they help greatly. I used one to go to the beach and got a little damaged, but nothing great.",
      "rating": 4.0,
      "verified": true,
      "author": "Carmen ",
      "helpful_votes": 0,
      "publication_date": 20200601
    },
    {
      "title": "Quality has not been an issue",
      "text": "So far the quality has not been a problem. Mostly used the multicolor lens, blue and yellow for better road visibility in cloudy conditions. Many thanks to other posters who explained how to safely change lenses, the tricky part for me is fitting the nose. Have not tried to fit my regular glasses underneath. If you wear prescription lenses, best option appears to find a WileyX retailer who uses the same size insert frame.",
      "rating": 5.0,
      "verified": true,
      "author": "Capt Alan",
      "helpful_votes": 0,
      "publication_date": 20161024
    },
    {
      "title": "I do not recommend buying these",
      "text": "These were very low quality glasses. I guess for the price I should expect that but these glasses lenses would not even stay in the frames. I do not recommend buying these. I would try another brand and possibly try spending a bit more money for something that might actually work.",
      "rating": 1.0,
      "verified": true,
      "author": "Joseph C. Hill",
      "helpful_votes": 0,
      "publication_date": 20171009
    },
    {
      "title": "Why spend big $$$$ when the Wolfbike glasses will fill any need!!",
      "text": "Killer glasses for the $$$$. Thye come with 5 lenses and rally nice case, bag, strap, cord, cleaning cloth. They can be worn with or without prescrip glasses. I really like the fit and the lense selection is awesome. I use clear for evening rides when all the bugs come out as I ride along creeks and rivers where bugs are thick. The other lenses are fantastic in sun, shooting, driving or any other times you need glasses.",
      "rating": 5.0,
      "verified": true,
      "author": "wvriverrunner",
      "helpful_votes": 0,
      "publication_date": 20151020
    },
    {
      "title": "These are poor quality knock off glasses",
      "text": "These are poor quality knock off glasses. Entirely plastic and feel very weak. I guess thats what you are paying for. Annoying thing is the glasses started falling off from the frame after using it for a week.",
      "rating": 1.0,
      "verified": true,
      "author": "M J.",
      "helpful_votes": 0,
      "publication_date": 20180308
    },
    {
      "title": "The design and packaging is some of the best I've ever seen",
      "text": "The design and packaging is some of the best I've ever seen. Major kudos. And the price is unbeatable. With that said only thing is I have a large head and they have a tendency to fit loose, but wolfbike provides head strap (proper wording ..) for the shades no idea how to put them on though.",
      "rating": 5.0,
      "verified": true,
      "author": "Anonymous Was Taken",
      "helpful_votes": 0,
      "publication_date": 20170910
    },
    {
      "title": "I own Costa’s",
      "text": "Look, I own Costas for fishing. Ok I bought name brand in that case. You want to drop those on the ground cycling? NO! these are awesome and work perfect. How is it large eye glass companies don’t even include a case? This is a great buy and you’ll be happy with the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Blake",
      "helpful_votes": 0,
      "publication_date": 20171114
    },
    {
      "title": "... delivers i open it the case is big & nice lock the sunglasses mad from poor quality",
      "text": "hello to be honest with my self and people after the package arrived and take long time to delivers i open it the case is big & nice lock the sunglasses mad from poor quality, the only thing i don't like in the sunglasses is the lens it's easy to take of from the frame it's not Stably any small wrong movement the lens go up from the frame cause it's wide and not hold good in the frame i prefer the other type single lens",
      "rating": 2.0,
      "verified": true,
      "author": "wild-bird",
      "helpful_votes": 0,
      "publication_date": 20160801
    },
    {
      "title": "AMAZING and a great price",
      "text": "These are extremely amazing, especially for the price. The case is great and I love all that it includes. Changing the lenses if fast and easy. I was blown away buy the quality of these, and will be recommending them to the owner of my local bike shop.",
      "rating": 5.0,
      "verified": true,
      "author": "Chelsey",
      "helpful_votes": 0,
      "publication_date": 20170408
    },
    {
      "title": "their lenses have an excellent quality and putting lenses with magnification inside is very ...",
      "text": "Really surprising the quality for price of these sunglasses, their lenses have an excellent quality and putting lenses with magnification inside is very easy (although they remain with a strange visual direction)",
      "rating": 5.0,
      "verified": true,
      "author": "WillyDragonBlue",
      "helpful_votes": 0,
      "publication_date": 20171029
    },
    {
      "title": "This is an excellent set of sport glasses",
      "text": "This is an excellent set of sport glasses. The quality is incredible for such a low price, I was pleasantly surprised. They have really good air flow to keep eyes cool and lenses from fogging, Water and sweat repels good while riding, unlike most regular sunglasses which need to be wiped constantly. Pick these up, they're a steal.",
      "rating": 4.0,
      "verified": true,
      "author": "Jason Grafe",
      "helpful_votes": 0,
      "publication_date": 20160812
    },
    {
      "title": "Super sweet",
      "text": "I own two pairs of these. Awesome deal, comes with case, different types of swappable lenses, a carrying cord, lens cloth. You are dumb if you don't buy these!",
      "rating": 5.0,
      "verified": true,
      "author": "Coffee",
      "helpful_votes": 0,
      "publication_date": 20190107
    },
    {
      "title": "I love all the options",
      "text": "I love all the options, but the head band adjustment fell right where my ears are and there was no way to fix this. Unfortunately, these didn't work well for me.",
      "rating": 3.0,
      "verified": true,
      "author": "Matt KTop Contributor: Photography",
      "helpful_votes": 0,
      "publication_date": 20180115
    },
    {
      "title": "Best Shades at this price point hands down",
      "text": "You have to wait a while for them to get here but they are WELL worth the wait. It comes with 8 (i think) lenses and a thing that'll hold your prescription lenses. The case is nice.. it hold all the lenses, the frames, the two headbands, shammy and cloth case. The rubber part around your nose moves to mold to your bone structure. Sweet shades... I recommend for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Thecuteducky89",
      "helpful_votes": 0,
      "publication_date": 20150419
    },
    {
      "title": "The lenses don't completely cover the eyes with a 1/2 ...",
      "text": "The lenses don't completely cover the eyes with a 1/2 an inch open gap on the bottom, thus, not protecting the eyes completely.",
      "rating": 3.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20180427
    },
    {
      "title": "These are great..",
      "text": "These are great.... Enough said.. Although they only work with lenses inserts and the inserts I had did not fit so I will have to fill a prescription with the frame they came with. Keep in mind these do not go over regular glasses folks. these are worn with inserts.",
      "rating": 5.0,
      "verified": true,
      "author": "David Bierman",
      "helpful_votes": 0,
      "publication_date": 20151223
    },
    {
      "title": "The price is good and having the different lenses seems to be a ...",
      "text": "The price is good and having the different lenses seems to be a plus. But it doesn't make up for the fit. The glasses are very bulky and really don't feel right. The top of the glasses have a thick plastic pad on them that rests on the forehead and I'm not a fan.",
      "rating": 2.0,
      "verified": true,
      "author": "Brooks Becker",
      "helpful_votes": 0,
      "publication_date": 20180107
    },
    {
      "title": "The bare minimum",
      "text": "Cheap product buy if you are not bad if you are hard on shades like my self but some basics to get the job done",
      "rating": 3.0,
      "verified": true,
      "author": "Seneca Saltmarch",
      "helpful_votes": 0,
      "publication_date": 20180517
    },
    {
      "title": "the best Sunglasses I have very had there just what I all ways wanted",
      "text": "I am very happy with my WOLFBIKE Cycling Sunglasses when I am riding at night I can see so good and in day time seeing is like so good to and I can only say that I am so Happy HAPPY HAPPY",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160809
    },
    {
      "title": "Can't beat it at the price",
      "text": "I don't use most of the lenses- typically just the polarized and yellow/contrast booster.. but if I wanted to have fun rainbow mirroring I could use the others. The polarized lens is noticeably more thin than the others, but does the job.",
      "rating": 5.0,
      "verified": true,
      "author": "Nate S",
      "helpful_votes": 0,
      "publication_date": 20160121
    },
    {
      "title": "Good deal, but a bit heavy feeling",
      "text": "These are excellent for the price. If for nothing but the durable case that can hold a lots of things. They're a bit heavy on my nose, though",
      "rating": 4.0,
      "verified": true,
      "author": "jonathan cornett",
      "helpful_votes": 0,
      "publication_date": 20170814
    },
    {
      "title": "Need instructions to be included.",
      "text": "Would have gotten a 5 but I had to go on you tube to see how to change lenses out. Love the glasses and the ease of changes lenses as the need arises. I fact one of the guys I ride with liked mine so much he went and ordered himself a pair.",
      "rating": 4.0,
      "verified": true,
      "author": "David Toman",
      "helpful_votes": 0,
      "publication_date": 20151023
    },
    {
      "title": "Despite all the positive reviews on this product, Im ...",
      "text": "Despite all the positive reviews on this product, Im really not a fan. Bought a pair for me andmy girlfriend and we both thought they were very uncomfotable to wear. I actually started to get a headache wearing them.",
      "rating": 1.0,
      "verified": true,
      "author": "chaz.photo",
      "helpful_votes": 0,
      "publication_date": 20151119
    },
    {
      "title": "Highly Recommend",
      "text": "Excellent Product Highly Recommend so versatile Good Quality for the Cost Thank You For making this a positive experience",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180624
    },
    {
      "title": "Great for the money",
      "text": "For the price you can’t beat these. Not the most comfortable on your nose but overall a great buy.",
      "rating": 4.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20171023
    },
    {
      "title": "these are good. They have many options for shades and they ...",
      "text": "As far as cycling glasses go, these are good. They have many options for shades and they stay on while riding.",
      "rating": 4.0,
      "verified": true,
      "author": "Arielle",
      "helpful_votes": 0,
      "publication_date": 20170726
    },
    {
      "title": "Five Stars",
      "text": "Just wonderful, I lover changing my lens. The colors are great, very good quality for interchangeable lenses.",
      "rating": 5.0,
      "verified": true,
      "author": "Anna J.",
      "helpful_votes": 0,
      "publication_date": 20170802
    },
    {
      "title": "Great Value",
      "text": "Use for bike commuting. These fit really well, have good ventilation and are a great bargain. The extra lenses are a welcome addition. I bought an extra set of glasses I liked the first ones so much!",
      "rating": 5.0,
      "verified": true,
      "author": "Gus J Calapristi",
      "helpful_votes": 0,
      "publication_date": 20160101
    },
    {
      "title": "Five Stars",
      "text": "excellent item, is faster and the price is good, very recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "johnxz2012",
      "helpful_votes": 0,
      "publication_date": 20180125
    },
    {
      "title": "I really like these sunglasses",
      "text": "I really like these sunglasses, I wear them when I bike as well as when I run. They are definitely worth the wait.",
      "rating": 5.0,
      "verified": true,
      "author": "Stacy Hurd",
      "helpful_votes": 0,
      "publication_date": 20170615
    },
    {
      "title": "Great features for the price",
      "text": "A lot of features for such a small price! If you tend to spend on the low side when it comes to sunglasses (I tend to lose mine too frequently) then try these. You just might like them.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20170524
    },
    {
      "title": "Good vision",
      "text": "Good vision, easy to change out the lenses. Great price",
      "rating": 4.0,
      "verified": true,
      "author": "Bruce B.",
      "helpful_votes": 0,
      "publication_date": 20180216
    },
    {
      "title": "Variety",
      "text": "Love the variety of the different types of colored lenses",
      "rating": 5.0,
      "verified": true,
      "author": "anethette",
      "helpful_votes": 0,
      "publication_date": 20171217
    },
    {
      "title": "They love them.",
      "text": "bought them as Christmas for my niece and grandson. They love them.",
      "rating": 5.0,
      "verified": true,
      "author": "Ben",
      "helpful_votes": 0,
      "publication_date": 20170923
    },
    {
      "title": "Cheap",
      "text": "Liked the glasses but the reason I bought these were for the prescription insert. The insert won't stay attached to the glasses. No I have no use for the glasses",
      "rating": 2.0,
      "verified": true,
      "author": "maleah",
      "helpful_votes": 0,
      "publication_date": 20170520
    },
    {
      "title": "These are awesome! I've used the shaded and blue lenses so ...",
      "text": "These are awesome! I've used the shaded and blue lenses so far and they work really well. I have a smallish head and was worried about the fit but they fit well without being too big. I'm going to order another pair for backup, that's how nice they are. Btw, I only use these for mountain biking.",
      "rating": 5.0,
      "verified": true,
      "author": "steve rogers",
      "helpful_votes": 0,
      "publication_date": 20180409
    },
    {
      "title": "Great!",
      "text": "Great case and I love the versatility of these, it is like you have 6 new pairs of glasses.",
      "rating": 5.0,
      "verified": true,
      "author": "Rick",
      "helpful_votes": 0,
      "publication_date": 20170215
    },
    {
      "title": "it's a deal, they look cool",
      "text": "for that price? I am always losing my sunglasses..so I bought this one and it's really good and cheap... when I lose mine, I would buy it again",
      "rating": 5.0,
      "verified": true,
      "author": "J. BOLIVAR",
      "helpful_votes": 0,
      "publication_date": 20151108
    },
    {
      "title": "The glasses are great and come with a variety of lenses",
      "text": "The glasses are great and come with a variety of lenses, which are very difficult to change, without smudging the lens.",
      "rating": 4.0,
      "verified": true,
      "author": "David Masucci",
      "helpful_votes": 0,
      "publication_date": 20171008
    },
    {
      "title": "Nice set. I had rx progressive lenses put in ...",
      "text": "shipped quickly from china. Nice set. I had rx progressive lenses put in the insert. Works great",
      "rating": 5.0,
      "verified": true,
      "author": "Our House",
      "helpful_votes": 0,
      "publication_date": 20160606
    },
    {
      "title": "'Polarized' applies to only one lens.",
      "text": "So only one of the lenses are polarized. Also, strange markings all over the packing seem to indicate these $12 glasses came from China?",
      "rating": 2.0,
      "verified": true,
      "author": "Megan Lindner",
      "helpful_votes": 0,
      "publication_date": 20151108
    },
    {
      "title": "Eye Style",
      "text": "My husband LOVES these glasses, great selection of lenses and he adds his own prescription lenses in easily!",
      "rating": 5.0,
      "verified": true,
      "author": "P. Shamel",
      "helpful_votes": 0,
      "publication_date": 20160921
    },
    {
      "title": "bike glasses",
      "text": "I haven't had a chance to really use the glasses but they came before the date stated and look and feel great. Love them AAA+",
      "rating": 5.0,
      "verified": true,
      "author": "Steven L Silverstein",
      "helpful_votes": 0,
      "publication_date": 20151130
    },
    {
      "title": "Cool Cycling 4 eyes",
      "text": "great look, with all the different lenses for all types of weather",
      "rating": 5.0,
      "verified": true,
      "author": "H. Schmidt",
      "helpful_votes": 0,
      "publication_date": 20170524
    },
    {
      "title": "For the price- not bad. Don't expect to get these for at least ...",
      "text": "For the price- not bad. Don't expect to get these for at least a few weeks. They were a little wide but I shaped them with a little heat ;)",
      "rating": 3.0,
      "verified": true,
      "author": "tray",
      "helpful_votes": 0,
      "publication_date": 20160829
    },
    {
      "title": "Four Stars",
      "text": "A little difficult to change the lenses, but after watching various videos finally got the hang of it.",
      "rating": 4.0,
      "verified": true,
      "author": "Teri",
      "helpful_votes": 0,
      "publication_date": 20170924
    },
    {
      "title": "All I can say is don't waste your money they fit bad",
      "text": "All I can say is don't waste your money they fit bad, feel bad, bend easy and all around suck!!",
      "rating": 1.0,
      "verified": true,
      "author": "Nathan",
      "helpful_votes": 0,
      "publication_date": 20150713
    },
    {
      "title": "Great glasses for the price",
      "text": "Great glasses for the price. Nose peice takes a little to get adjusted right but after that they are great. No issues after a few months of having them. I mostly use the lenses that come on it and they are very clear.",
      "rating": 5.0,
      "verified": true,
      "author": "Karl",
      "helpful_votes": 0,
      "publication_date": 20151024
    },
    {
      "title": "Nice shades at a great price my only issue is ...",
      "text": "Nice shades at a great price my only issue is the nose piece is a bit hard on my nose but bearable",
      "rating": 3.0,
      "verified": true,
      "author": "Livingstone",
      "helpful_votes": 0,
      "publication_date": 20160531
    },
    {
      "title": "Love the choice of lenses",
      "text": "Just getting to use these here in Wisconsin! Love the choice of lenses! Great for fishing!",
      "rating": 5.0,
      "verified": true,
      "author": "Darryl L. Mayfield",
      "helpful_votes": 0,
      "publication_date": 20170527
    },
    {
      "title": "Great.",
      "text": "They are a great pair of sunglasses. Nice price, nice feel, and nice look. 10/10 would buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Samuel",
      "helpful_votes": 0,
      "publication_date": 20160912
    },
    {
      "title": "Good road bike glasses",
      "text": "Good road bike glasses...so far I have completed two practice rides and 1 race and the glasses held up well. The polarized sets of lenses are really good. The standard lens as displayed will scratch if you’re not careful with them. Otherwise, great value for the price.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161017
    },
    {
      "title": "Great 👍🏾",
      "text": "Love these cycling sunglasses 🕶 for the way you can change the lenses to the occasion",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180829
    },
    {
      "title": "Do not buy",
      "text": "nose piece fall off the second time my son wore them!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20150522
    },
    {
      "title": "Five Stars",
      "text": "Great price and multiple snap in lenses. I love them.",
      "rating": 5.0,
      "verified": true,
      "author": "David Nochella",
      "helpful_votes": 0,
      "publication_date": 20170721
    },
    {
      "title": "Four Stars",
      "text": "a big cheaply made with the plastic but works well",
      "rating": 4.0,
      "verified": true,
      "author": "Karney Chen",
      "helpful_votes": 0,
      "publication_date": 20151103
    },
    {
      "title": "Flexible.",
      "text": "Has five different shades. which in turn makes for five different glasses.",
      "rating": 4.0,
      "verified": true,
      "author": "jeffrey defere",
      "helpful_votes": 0,
      "publication_date": 20190322
    },
    {
      "title": "pretty solide for the price",
      "text": "Overall really good pair of sunglasses. I was having issues with removing the earpieces to put the strap in but the lenses are super easy to put on but aren't lose in the frames. I really like the different lenses and am fairly satisfied with my order. They also came way earlier than expected.",
      "rating": 3.0,
      "verified": true,
      "author": "Lisa Kline",
      "helpful_votes": 0,
      "publication_date": 20140602
    },
    {
      "title": "!!!GARBAGE!!!",
      "text": "GARBAGE!!! The only lense that fits \"somewhat\" properly are the ones that come already inserted. Once they come loose good luck keeping them in!!! The other lenses do not fit AT ALL! I wanted to wear them on a wave runner so i grabbed the strap..... FOR NOTHING! The clips are missing a piece or just are not made for these frames. Useless! DO NOT PURCHASE!!! Some things are as easy as you get what you pay for... Simple as that.",
      "rating": 1.0,
      "verified": true,
      "author": "Antonio perez",
      "helpful_votes": 2,
      "publication_date": 20170610
    },
    {
      "title": "Like the glasses the changeable lenses are nice but the ...",
      "text": "Like the glasses the changeable lenses are nice but the polarized lens is to thin to keep latched in place like the other lenses",
      "rating": 4.0,
      "verified": true,
      "author": "peter",
      "helpful_votes": 0,
      "publication_date": 20170916
    },
    {
      "title": "Nice looking wor fraction of money",
      "text": "Nice looking wor fraction of money. Nose pc not so comfortable but can be adjusted . But you get what you pay for.",
      "rating": 4.0,
      "verified": true,
      "author": "Mariusz Nicka",
      "helpful_votes": 0,
      "publication_date": 20150318
    },
    {
      "title": "... very loose in the frame and it drops very easy, I will not buy one additional like this",
      "text": "Some glasses got very loose in the frame and it drops very easy, I will not buy one additional like this",
      "rating": 1.0,
      "verified": true,
      "author": "carlos alpizar",
      "helpful_votes": 0,
      "publication_date": 20160302
    },
    {
      "title": "JUNK",
      "text": "I have three things to say about these. JUNK,JUNK,JUNK.broke 1st time out on bike. lenses don't stay in, some don't fit at all. Ear pieces break when touched. Like a prize at a carnival booth, no not that good.",
      "rating": 1.0,
      "verified": true,
      "author": "Billy Carnahan",
      "helpful_votes": 0,
      "publication_date": 20160509
    }
  ],
  "product_meta": {
    "title": "Motorcycle Riding Glasses Smoke Clear",
    "description": "PRODUCT DETAILS\n * Is Discontinued By Manufacturer :No\n * Package Dimensions :7.3 x 4.9 x 3.1 inches; 6.4 Ounces\n * Item model number :BYJ-013-B\n * Department :Mens\n * Date First Available :March 28, 2014\n * Manufacturer :Wolfbike\n * ASIN :B00JBB37OU\n\n * .zg_hrsr_item {list-style : none};\n * Amazon Best Sellers Rank: #332,611 in Sports & Outdoors (See Top 100 in Sports & Outdoors)  *  #1522 inSunglasses \n   \n   \n\n * Customer Reviews:4.1 out of 5 stars168 ratings",
    "rating": 4.1,
    "feature_bullets": [
      "Imported",
      "plastic frame",
      "PU lens",
      "Polarized",
      "Lens width: 49~60 millimeters",
      "Comfortable glasses"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "7.3 x 4.9 x 3.1 inches; 6.4 Ounces",
      "Item model number": "BYJ-013-B",
      "Department": "Mens",
      "Date First Available": "March 28, 2014",
      "Manufacturer": "Wolfbike",
      "ASIN": "B00JBB37OU"
    },
    "categories": [
      "Accessories",
      "Sports & Outdoors",
      "Clothing, Shoes & Jewelry",
      "Sports & Fitness",
      "Sports Sunglasses"
    ],
    "price": ""
  }
}