{
  "website_summaries": [
    {
      "verdict": "A good set-up for kids who are too little or just learning to pedal.",
      "pros": [
        "Comes with a bar attachment for an adult to push",
        "Very versatile",
        "Works as a rocker, a push rider, and an independent pedal car",
        "Easy to put together",
        "Easy to convert from one function to another",
        "A sturdy product that does not feel cheap"
      ],
      "cons": [
        "The handlebars and pedals are both a little awkwardly placed for some toddlers"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Always love Fisher P",
      "text": "Here’s the problem. When a two year old (my Granddaughter) uses the pedal’s unless the foot is EXACTLY placed the foot will get caught between the pedal (yellow) and the red part that holds the wheel. Try explaining it to a 2.5year old who wants to learn to ride a tri cycle but cry’s when she gets pinched. I am 5’8 and have to hunch a bit to use the handle but I can live with that just not the Ouchy. Always love Fisher P. Just not this..",
      "rating": 1.0,
      "verified": true,
      "author": "Janice",
      "helpful_votes": 13,
      "publication_date": 20180323
    },
    {
      "title": "Terrible quality for the price",
      "text": "For $56, this was a total piece of junk. It's flimsy and one of the most important, load-bearing screws that keeps the back wheel in place completely did not fit properly. We are currently searching for a screw in my husband's toolbox in hopes that it will do the job. Also, my 21 month old daughter is only interested in pushing it from behind, as her feet don't yet reach the pedals but the stationary pedals are awkwardly positioned and her feet don't stay put on them. BIG FAIL. If we hadn't already assembled it, I'd be promptly returning it.",
      "rating": 1.0,
      "verified": true,
      "author": "WriteStuff31",
      "helpful_votes": 7,
      "publication_date": 20180306
    },
    {
      "title": "Grandson loves it.",
      "text": "We love these multi-function toys. It's durable, attractive, and easily changed from a rocker for indoor use, to a pusher/trike for outdoor use. In fact, our 18-month Grandson has learned to pull the locking pin (a big yellow, plastic dowel-shaped thing) out of the handle to convert it to the pusher/trike so he can go outside - hint, hint! When he gets a bit older, we can remove the handle altogether.",
      "rating": 5.0,
      "verified": true,
      "author": "Rock Diamond",
      "helpful_votes": 12,
      "publication_date": 20160612
    },
    {
      "title": "Not great",
      "text": "Kid has to steer, no parent override, not great for younger kids. Pegs for kids feet not large enough or not in right spot, they don't seem to work for us. It is ok for older kids (but by then, they don't need you to push them).",
      "rating": 2.0,
      "verified": true,
      "author": "Darcie",
      "helpful_votes": 5,
      "publication_date": 20180907
    },
    {
      "title": "Great trike for your toddler",
      "text": "I purchased this trike for my 10 month old son for Christmas. I originally had it set up as a rocker and he didn't seem so impressed. We quickly transformed it to a trike and to our surprise, my non-walking 10 month old was mobile. He loved it and took off in the house immediately. He's now 14 months and still rides it almost daily. Great quality and should last him until he 3-4.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie P.",
      "helpful_votes": 12,
      "publication_date": 20160525
    },
    {
      "title": "Safe, light weight!",
      "text": "Light weight, very easy to build together, the seat can move for growing up, the backrest allows you to control the ride trike if your kid go too fast, definitely recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20181028
    },
    {
      "title": "The foot rest is a nice idea, so the child can have a place ...",
      "text": "Had to return it. Might be a design flaw. The \"pin\" that holds the handle in place kept falling off from the very first time it was used. The foot rest is a nice idea, so the child can have a place to rest feet when not peddling.",
      "rating": 1.0,
      "verified": true,
      "author": "PCF",
      "helpful_votes": 4,
      "publication_date": 20180622
    },
    {
      "title": "A Real Hit with the Little Ones",
      "text": "Both my 2- and 4-year-old grandchildren love this trike so much, I had to get a second one! The four-year-old is now pedaling on his own. He seems to like this much more than the \"hot wheels\" - type of tricycle he also has; don't know why. Just make sure you follow directions carefully when you put it together. All sorts of adjustments you can make to it after it's built, without tools.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim H",
      "helpful_votes": 5,
      "publication_date": 20170504
    },
    {
      "title": "Love the 3-in-1 feature.",
      "text": "My 2 year old LOVE's this. The assembly is straight forward and easy to put together. For now, my 2 year old pushes the bike with his feet because he can't quite reach the peddles all the way yet. He doesn't care much for the rocker, but I bet if he was a bit younger he would have enjoyed it. I also love the fact that this bike has the push handle, so I can have a little control when necessary. Definitely recommend this for your lil' one. Great deal and it'll last a while, since it'll grow with your baby.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180206
    },
    {
      "title": "Love the Handle!",
      "text": "This is my 2nd purchase of this trike. Our 1st trike lasted over 5 years of heavy use (left outside in WI winters, toddlers to school age children playing with it, etc). We purchased a 2nd because we loved the 1st one so much (great for a toddler who wants to pedal but needs some help sometimes or you can't trust to stop at the end of the driveway!). I'm hoping to get another 5 years out of this one!",
      "rating": 5.0,
      "verified": true,
      "author": "Amy M.",
      "helpful_votes": 4,
      "publication_date": 20170803
    },
    {
      "title": "Love it!",
      "text": "I was looking for a way to ease my granddaughter into learning how to ride a big wheel/tricycle. She's 21/2 and isn't quite strong enough to pedal it on her own. This tricycle is perfect. She loves it. We push her and she steers the trike. The footrests keep her feet from dragging on the ground. Pretty soon I think she will be powering it on her own. Never got to use the rocking horse feature, but I like that you can configure it so that it can still be used as a toy even if the child isn't quite ready for a tricycle.",
      "rating": 5.0,
      "verified": true,
      "author": "EJ",
      "helpful_votes": 0,
      "publication_date": 20190817
    },
    {
      "title": "Nice bike, but it was an open box toy even if not advertised",
      "text": "Not to difficult to build and seems sturdy. Easy to switch position of handle/swing. BUT it came in an unmarked box, will all pieces loose inside without appropriate packaging. And this was not listed as an open box toy. Good toy, but disappointed with the quality control of Amazon.",
      "rating": 3.0,
      "verified": true,
      "author": "J Toledo",
      "helpful_votes": 3,
      "publication_date": 20180921
    },
    {
      "title": "Not as it appears",
      "text": "not hard but not easy to put together. the plastic is nice and thick so i think it will last a while. I do NOT like that when the handle is in place it doesn't turn the front wheel so we don't use it often. Great concept but wouldn't get again. Would spend the extra to get one where the handle attaches to the front wheel to make it easier to take a walk.",
      "rating": 3.0,
      "verified": true,
      "author": "rh",
      "helpful_votes": 0,
      "publication_date": 20191219
    },
    {
      "title": "This is the best tricycle EVER",
      "text": "This is the best tricycle EVER!!!! I bought this for my daughter's boyfriends little boy and he loves it. My kids had one when they were little and it sure did stand the test of time. My kids thrashed it and it kept on going and I still have it, now he has one for his house and my house. The transaction went smooth and I would recommend, This to anyone. The shipping was fast as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Stacy Griffin",
      "helpful_votes": 0,
      "publication_date": 20180323
    },
    {
      "title": "I don’t recommend this....",
      "text": "It’s a sturdy rocker.....but as a tricycle it’s not really worthy....if I take it out on sidewalk, it makes hell lot of noise...",
      "rating": 3.0,
      "verified": true,
      "author": "Usha",
      "helpful_votes": 2,
      "publication_date": 20190703
    },
    {
      "title": "Incorrect hardware",
      "text": "The screw included isn’t the correct screw for the product. As shown in the photo, the screw that came in the box is about 2cm too long and doesn’t work with the trike.",
      "rating": 1.0,
      "verified": true,
      "author": "Lauren",
      "helpful_votes": 4,
      "publication_date": 20180820
    },
    {
      "title": "Happy recipient",
      "text": "We bought this for our 2-year old grandson. It was very easy to assemble. The versatility of the trike and its removable handle in the back (which also converts to a rocker underneath the trike) will be great both for our grandson as he grows, but also for mom and dad in those moments when he gets tired of pedaling. He loved it and didn't want to get off the trike! The conversion from trike to rocker has a very simple mechanism to lock the wheels in place. A very nice toy.",
      "rating": 5.0,
      "verified": true,
      "author": "az1963",
      "helpful_votes": 0,
      "publication_date": 20190115
    },
    {
      "title": "Fun and sturdy",
      "text": "Easy to assemble from the packaging. It is sturdy and the wheels roll smoothly. It was perfect for a 2 year old. The handle on the back is a great addition so an adult can push without standing bend over for so long. It can be used indoors, this bike can roll on hardwood/laminate without damage to the floor. Notably, the seat is adjustable so you can move the seat back as the child's legs grow longer.",
      "rating": 5.0,
      "verified": true,
      "author": "J.M.",
      "helpful_votes": 3,
      "publication_date": 20160608
    },
    {
      "title": "I love that there are multiple options for using it",
      "text": "This was a Christmas present for my toddler and he absolutely loves it! I love that there are multiple options for using it. He can use it indoors as a rocker, we can push it outdoors and the handle/base removes for him to ride independently. Putting this together took a few hours. Some of the holes for the axel and other parts didn't line up exactly, so we used a utility knife to fix cut the plastic. Overall, we are happy with the product and it's holding up well with 2 boys playing on it daily",
      "rating": 4.0,
      "verified": true,
      "author": "Ashley Smith",
      "helpful_votes": 2,
      "publication_date": 20170104
    },
    {
      "title": "Pain to put together but sturdy and good price",
      "text": "Sturdy and my toddler loves it but was a pain to put together. The holes for the parts that screw together did not line up. The handle bars are held on with a screw. Lining up the screw in the handle bar with the hole drilled on the base required two people and a flashlight. It would have been a lot easier if there was a raised part around the hole on the base so could tell the screw was making contact. Since it's plastic, it's real easy to screw in above the drilled hole in the base.Also, screwing on the handle around the back wheels...we had to use a drill. The holes just did not line up well.",
      "rating": 4.0,
      "verified": true,
      "author": "Margaret ",
      "helpful_votes": 2,
      "publication_date": 20141201
    },
    {
      "title": "Bikes that grow with a child",
      "text": "I have twin grandsons who just turned 2. These bikes are so great because they can be usrd and enjoyed for many years. They love these bikes. So does their 4 year old brother. Such a great gift. I recommend them very highly.",
      "rating": 5.0,
      "verified": true,
      "author": "Margaret Martin",
      "helpful_votes": 0,
      "publication_date": 20190314
    },
    {
      "title": "It was annoying to put together",
      "text": "It was annoying to put together, the wheels are loud and it is difficult to maneuver with the parent handle as well as for my little one. OK for the price, but I wish I had purchased a Radio Flyer instead",
      "rating": 2.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 4,
      "publication_date": 20160506
    },
    {
      "title": "Beautiful ,strong and great quality for toddler , preschoolers and older kids.",
      "text": "I’m a child care provider and I bought three of this tricycles ten years ago that I still use but I reorder three more because the kids loves it so much that isn’t enough for twelve kids.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary S Sanchez",
      "helpful_votes": 0,
      "publication_date": 20190503
    },
    {
      "title": "Foot rest is well designed and easy to use",
      "text": "Bought this for my 2 year old. Put it together in about 30 minutes. He loves darting down the driveway in it. Foot rest is well designed and easy to use. We've been using it frequently for a few weeks now and I don't think we'll have any issues with it going forward.",
      "rating": 5.0,
      "verified": true,
      "author": "Evmansmama",
      "helpful_votes": 0,
      "publication_date": 20170704
    },
    {
      "title": "Not reccomended if it’s not coming as it has to come",
      "text": "The piece I had to perforate it inside because the steel bar didn’t pass through the other hole, my kid seen it and didnt wanna wait more for the Return, if you are going to sale a toy like this it should be perfectly build as well.",
      "rating": 2.0,
      "verified": true,
      "author": "Oscar matatan",
      "helpful_votes": 0,
      "publication_date": 20181127
    },
    {
      "title": "nice sroller bike",
      "text": "Ordred this for my niece, its a nice sturdy stroller, but I found it slightly more overbuilt.",
      "rating": 4.0,
      "verified": true,
      "author": "desert fox",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "Fun for 18mo old!",
      "text": "My 18mo old grandson loves to ride on this as a bike/rocking horse- he's not quite old enough to use it while adult is pushing. But either way this is a great toy for rocking away while watching tv and just playing around in general 😄",
      "rating": 5.0,
      "verified": true,
      "author": "Krista",
      "helpful_votes": 0,
      "publication_date": 20180814
    },
    {
      "title": "High quality , love it",
      "text": "Bought via pictures and reviews only and it was a great find. Very sturdy, grandson loves it. Easy to push our precious chunky monkey around.",
      "rating": 5.0,
      "verified": true,
      "author": "tammy",
      "helpful_votes": 0,
      "publication_date": 20190826
    },
    {
      "title": "It's a good tricycle except the footrest is not fixed and my ...",
      "text": "It's a good tricycle except the footrest is not fixed and my toddler is not able to place his foot on it. Colorful and robust",
      "rating": 4.0,
      "verified": true,
      "author": "JM",
      "helpful_votes": 0,
      "publication_date": 20180725
    },
    {
      "title": "Really disappointed",
      "text": "This wasn’t sturdy at all, and there’s some screws sticking out for seemingly no reason. I didn’t assemble it right away so by the time I discovered the issue my return window closed. I’d really like a refund or replacement on this.",
      "rating": 1.0,
      "verified": true,
      "author": "Sam ",
      "helpful_votes": 0,
      "publication_date": 20190914
    },
    {
      "title": "Be careful pushing it!",
      "text": "Great trike! The only drawback is that there is no way to steer it on a sidewalk if the child isn't old enough to get that concept. You could end up going off the curb or into the bushes! It would get 5 stars if there was a way for the parent to steer it when pushing it. It converts easily from rocker to trike! My granddaughter loves it!",
      "rating": 4.0,
      "verified": true,
      "author": "Open Minded Consumer",
      "helpful_votes": 0,
      "publication_date": 20170408
    },
    {
      "title": "Easy to assemble",
      "text": "This is a great bike. I love that it is a rocker for my younger granddaughter and then I can just flip the handle and my grandson can ride it.",
      "rating": 5.0,
      "verified": true,
      "author": "Ann",
      "helpful_votes": 0,
      "publication_date": 20190726
    },
    {
      "title": "Excellent Gift for Kiddo",
      "text": "Excellent Gift for your Little Bundle of Joy! I like this toy for my little girl. She likes the toy a lot. The only thing I didn't like was the foot resting pole it's not long enough and her feet fall off. She's not big enough to reach the pedals yet.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180917
    },
    {
      "title": "Very Poor Fisher Price Rock Roll n Ride Trike fulfilled by Amazon",
      "text": "This Fisher Price Rock Roll n Ride Trike was the WORST Customer service I have ever experienced. The manufacturer sent the Trike disassembled and came missing the straight axle that fits between the rear wheels, I wrote Amazon who directed me back to the manufacturer, Fisher Price who sent me the wrong part again (the pedal axle instead) I would NEVER recommend this item again or anything from Fisher Price.",
      "rating": 1.0,
      "verified": true,
      "author": "Dalton Mclean",
      "helpful_votes": 0,
      "publication_date": 20190211
    },
    {
      "title": "Perfect! Well made easy to put together",
      "text": "This is great!!! Well made easy to put together. Perfect for a 2 -3 year old. He loved it! Thank you Amazon I couldn’t find anything like this anywhere",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181129
    },
    {
      "title": "My neeice loves it but...",
      "text": "I bought this for my niece and she seems to love it. She is 2 years and and gets on it everyday as a rocker. My sister will push her when they are outside as the pedals are really to far away to be used as a tricycle. My 5 yr old nephew got on it and couldn't even reach the pedals so I'm sure that aspect of this toy will be useless. Otherwise it was a decent buy.",
      "rating": 5.0,
      "verified": true,
      "author": "KValentino",
      "helpful_votes": 0,
      "publication_date": 20150612
    },
    {
      "title": "Great Idea dan works well.",
      "text": "This is a great toy. It seems to work well. It is a little difficult to put together and the rear axle looks like it isn't lined up correctly. I thought the color was Blue and Red and it is actually a deep Purple and Red. Odd color comb. But I think its fine for people who don't mind about the colors!",
      "rating": 4.0,
      "verified": true,
      "author": "Consumer ",
      "helpful_votes": 0,
      "publication_date": 20160814
    },
    {
      "title": "Great product with a very short life!",
      "text": "This was great...at first. My son loved riding this trike and the handle made it really easy to go on a walk with him. Unfortunately the front wheel has a giant hole in the plastic tire that makes the trike unusable after a very short time of use.",
      "rating": 2.0,
      "verified": true,
      "author": "Jess Jess",
      "helpful_votes": 0,
      "publication_date": 20190409
    },
    {
      "title": "Great bike for a two-year-old",
      "text": "My 2 1/2-year-old grandson loves this bike. I love that I can push them around. Or he can pedal. It was fairly easy to put together. But I’ve only used it as the picture shows so far",
      "rating": 5.0,
      "verified": true,
      "author": "Tbelle",
      "helpful_votes": 0,
      "publication_date": 20180430
    },
    {
      "title": "It is versatile, and can be used inside as ...",
      "text": "It is versatile, and can be used inside as a rocking bike and outside as a push toy. But, when using it outside the kid's feet don't fit well on the pedals, and they spin around too fast for a kid to keep up with. So the kid has to put his/her feet up near the handle bars otherwise they drag on the ground and get caught in the spinning pedals.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180618
    },
    {
      "title": "Not for tall people",
      "text": "I'm 5'8\" in tennis shoes and this is too short for me. I have to bend over to push my son.",
      "rating": 3.0,
      "verified": true,
      "author": "ReRush",
      "helpful_votes": 7,
      "publication_date": 20151228
    },
    {
      "title": "I have a little guy. He is a little ...",
      "text": "I have a little guy. He is a little smaller than other two year old and in the reviews people were talking about how there 18 mos old could ride it. Well my little guy feet don't reach the paddles. Now we are just using the rocker part.",
      "rating": 3.0,
      "verified": true,
      "author": "steph",
      "helpful_votes": 2,
      "publication_date": 20151001
    },
    {
      "title": "Fits larger kids too",
      "text": "Because the seat can change positions it fits larger kids .",
      "rating": 5.0,
      "verified": true,
      "author": "Gloria Silva",
      "helpful_votes": 0,
      "publication_date": 20190630
    },
    {
      "title": "Great",
      "text": "Granddaughter took to it right away. Perfect for a 2 year old. She loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "vbcertified",
      "helpful_votes": 0,
      "publication_date": 20190814
    },
    {
      "title": "great value",
      "text": "My 1yr old son LOVES this trike. We had it set up as a rocker initially but soon changed it to the pusher. He loves riding on it and gets super excited in the morning when he sees it. He runs right over to it and wants to get on. Well worth the money!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181102
    },
    {
      "title": "Pretty easy to put together",
      "text": "Pretty easy to put together. Note that if you want to skip ahead to the push stage/stage 2, you have to complete the steps for the baby/rocker stage, stage 1. It took me a bit of time to figure out the push handle wouldn't work unless the handle was placed under the trike.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171229
    },
    {
      "title": "... as a christmas gift for my son and he loved it. I like how it is multifunctional",
      "text": "I bought this as a christmas gift for my son and he loved it. I like how it is multifunctional. Three settings, you can't beat that. It grows with your child.",
      "rating": 5.0,
      "verified": true,
      "author": "Angie Richardson",
      "helpful_votes": 0,
      "publication_date": 20180602
    },
    {
      "title": "this is awesome, it is such good quality my kids love it!",
      "text": "I love this my son and daughter haven't quite learned to pedal yet so I would push them on their trike. they love that but I couldn't do it for very long due to a bad back now I can push them and not have to cut our play sessions short or be in pain. a great buy!",
      "rating": 5.0,
      "verified": true,
      "author": "Britney A Nelson ",
      "helpful_votes": 0,
      "publication_date": 20160508
    },
    {
      "title": "Great for bonding",
      "text": "Give this to my 20 months old grandson when we saw a kid was riding in the park. He loves it very much. His feet isn’t long enough to ride as a bike but as a rocker and roller already so much fun. And it becomes a race car to push him around the park. It is very easy to assemble and quick for the transformation",
      "rating": 5.0,
      "verified": true,
      "author": "Mona Wong",
      "helpful_votes": 0,
      "publication_date": 20190901
    },
    {
      "title": "Great bike!",
      "text": "Bought this for my granddaughter for her 2nd birthday and it's awesome. She can just reach the peddles and has plenty of room to grow. My 16 year old likes to squeeze into it and ride it around too so it's definitely sturdy. It's a great buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Naomie Beaudet",
      "helpful_votes": 0,
      "publication_date": 20190527
    },
    {
      "title": "I love the idea behind this item",
      "text": "I love the idea behind this item. It is great that it is a 3 in 1 toy. My son lover it! The only downside is that it is highly priced for how cheap it is made. It's very bulky, heavy, plastic.",
      "rating": 3.0,
      "verified": true,
      "author": "Jessica M Crosby",
      "helpful_votes": 0,
      "publication_date": 20160702
    },
    {
      "title": "He didnt really like it in the rocking mode",
      "text": "I bought this for my nephew's first birthday. He is a littke tsller tgan tge average 1yr old and he had no problem scooting the bike aroubd. He didnt really like it in the rocking mode.",
      "rating": 5.0,
      "verified": true,
      "author": "michele",
      "helpful_votes": 0,
      "publication_date": 20170607
    },
    {
      "title": "Good quality trike...",
      "text": "This is the second one of these trikes we've purchased. The first one lasted 4 years with pretty regular use. The plastic wheels on these are much thicker and sturdier than other brands.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170514
    },
    {
      "title": "Great toy",
      "text": "This bike is great!!!! The only thing negative is the stand for child to rest feet isn’t long enough. Their feet kept falling off so we rigged a make shift stand and they loved it!!! Can’t wait for them to start pedaling",
      "rating": 4.0,
      "verified": true,
      "author": "Lisa Davis",
      "helpful_votes": 0,
      "publication_date": 20180810
    },
    {
      "title": "I do not recommend buying this product.",
      "text": "I could not use and returned back to Amazon. It was too much complicated to assemble . one part was broken so the whole toy did not work too. I returned and bought another kind and brand from walmart which my baby likes so much. I do not recommend buying this one",
      "rating": 1.0,
      "verified": true,
      "author": "amany",
      "helpful_votes": 0,
      "publication_date": 20181017
    },
    {
      "title": "Quintessential childhood toy",
      "text": "This is a super fun item and its awesome how versatile it is. Its appropriate for age 1+ and makes a perfect 1st birthday present because it will be used for years to come. My one year old rocks on it like a rocking horse and its been a great toy to help his motor skills as he climbs on and off the seat. He was trying to pedal the other day and I can't wait till his feet reach so we can go for rides outside!",
      "rating": 5.0,
      "verified": true,
      "author": "andria",
      "helpful_votes": 0,
      "publication_date": 20160910
    },
    {
      "title": "Kid loves it!",
      "text": "Was tedious to assemble but worth it, my 18 month old cant reach the peddles yet but loves being pushed around on it! The foot rest can easily fold up or be taken out completely once they are able to peddle on their own.",
      "rating": 5.0,
      "verified": true,
      "author": "Amber",
      "helpful_votes": 0,
      "publication_date": 20181220
    },
    {
      "title": "Great a trike that changes as your child grows. Awesome price.",
      "text": "I love the three stages so my grandson can grow with this trike. It's a rocker, stroller until he can reach the pedals, and then a three wheeler. Can't beat the price. My grandson loves it. Easy to put together too.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Huff",
      "helpful_votes": 0,
      "publication_date": 20150709
    },
    {
      "title": "Christmas Gift for 3 yr Old",
      "text": "This was a Christmas present for my 3 yr old. It was easily put together by my husband in less than 20 minutes. My 3 yr old loves rocking on it and can't wait till the snow melts so he can get on the trike part. This looks really sturdy and hopefully lasts all next summer.",
      "rating": 5.0,
      "verified": true,
      "author": "AvidReaderMom",
      "helpful_votes": 0,
      "publication_date": 20150102
    },
    {
      "title": "Just ok",
      "text": "I love you can convert it to different ways to tile but it came with missing pieces so good thing my husband a handy man!",
      "rating": 4.0,
      "verified": true,
      "author": "Jenae Schirmer",
      "helpful_votes": 0,
      "publication_date": 20190201
    },
    {
      "title": "GREAT GIFT FOR MY DAUGHTER",
      "text": "FANTASTIC GIFT... MY LITTLE GIRL IS SO HAPPY AND EXCITED THAT SHE WANTS TO RIDE ALL DAY. THIS TRANSACTION WAS MANAGED VERY WELL, AS IT REQUIRED THAT I RETURNED THE ORIGINAL ITEM, WHICH WAS QUICKLY REPLACED. THANK YOU FOR YOUR FAST RESPONSE. I AM VERY SATISFIED.",
      "rating": 5.0,
      "verified": true,
      "author": "Jsaltes",
      "helpful_votes": 0,
      "publication_date": 20150210
    },
    {
      "title": "Value for money",
      "text": "Its been 1.5 Years and my son is still enjoying his ride. I found this product to be sturdy and good for children, so far I have no problem with this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Ansh",
      "helpful_votes": 0,
      "publication_date": 20170822
    },
    {
      "title": "YES! YES!! YES!!! Fan Favorite!",
      "text": "This is the best toy ever!!! My 1 Year Old can’t get enough!!! I have to pry him off to eat and sleep!!! Love the stroller handle to help guide... comes off easy for when he’s older! And the easy flip to rocking horse style makes keeping him in one place SO EASY!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Manda",
      "helpful_votes": 0,
      "publication_date": 20180924
    },
    {
      "title": "fun for kids",
      "text": "Easy to assemble and will be enjoyed at different ages.",
      "rating": 5.0,
      "verified": true,
      "author": "Abbee",
      "helpful_votes": 0,
      "publication_date": 20180818
    },
    {
      "title": "They should have thought to make it with a safety ...",
      "text": "They should have thought to make it with a safety strap. When I purchased it, I didn't notice that it wasn't made with one, I thought that was common sense!",
      "rating": 1.0,
      "verified": true,
      "author": "TIKI",
      "helpful_votes": 0,
      "publication_date": 20170619
    },
    {
      "title": "Easy to assemble!",
      "text": "My grandson LOVES his trike! His mom and dad do too, because when he gets tired, they can push him.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190616
    },
    {
      "title": "Success with  gift selection... 2nd time",
      "text": "Brought this as a gift for a friend's. We had gifted one a year ago to another family and the kid seem to love this. So, was an easy pick for us...",
      "rating": 5.0,
      "verified": true,
      "author": "SK",
      "helpful_votes": 0,
      "publication_date": 20170215
    },
    {
      "title": "Perfect for neighborhood walks",
      "text": "LOVE these trikes. We bought one twelve years ago when our first grandchild was big enough to use it. After sitting out year-round in the SoCal sun, and getting a LOT of use, that one has faded and finally started to develop some cracks in the plastic. Just purchased a brand new one for the youngest grandkids to use. We have another small trike, but this is the one the grandkids prefer to ride, even though it has the handle on it. (We do use the handle during neighborhood walks, when their legs get tired of pedaling.)",
      "rating": 5.0,
      "verified": true,
      "author": "Grifsy",
      "helpful_votes": 4,
      "publication_date": 20160706
    },
    {
      "title": "Five Stars",
      "text": "Great first bike for toddlers that can't reach the peddles yet.",
      "rating": 5.0,
      "verified": true,
      "author": "Laurie A.",
      "helpful_votes": 0,
      "publication_date": 20180327
    },
    {
      "title": "Don't buy it.",
      "text": "Had to return this. Couldn't get the axle through the holes because they were uneven.",
      "rating": 1.0,
      "verified": true,
      "author": "John Vassallo",
      "helpful_votes": 0,
      "publication_date": 20161229
    },
    {
      "title": "Good starting Trike",
      "text": "This looked like it would be a good way for a child to start. It can be used for different \"stages\". I don't think the tires would have lasted very long.",
      "rating": 4.0,
      "verified": true,
      "author": "Cindy",
      "helpful_votes": 0,
      "publication_date": 20160726
    },
    {
      "title": "Very good I liked the three position for my 2 years ...",
      "text": "Very good I liked the three position for my 2 years old baby.. But the assembly isn't easy I took 2 hours to make it ready to use.",
      "rating": 4.0,
      "verified": true,
      "author": "O",
      "helpful_votes": 0,
      "publication_date": 20170201
    },
    {
      "title": "Great trike!",
      "text": "I originally purchased this trike for my 1 year old daughter so I can push her around during our strolls but my 5 year old loves this! He rides on it every day! Both my little ones would fight to ride on it. My son had a friend that is 6 years old and she fits on it as well! Would definitely recommend this for anyone who's looking for a trike.",
      "rating": 5.0,
      "verified": true,
      "author": "SGStar",
      "helpful_votes": 9,
      "publication_date": 20160430
    },
    {
      "title": "Missing parts",
      "text": "Was missing a wheel so my grandson can't even use it this was a gift",
      "rating": 1.0,
      "verified": true,
      "author": "margaret brum",
      "helpful_votes": 0,
      "publication_date": 20190725
    },
    {
      "title": "Great product!",
      "text": "Instructions were a bit lacking, but it went together ok regardless. Works great & is nice with the handle.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Swanger",
      "helpful_votes": 0,
      "publication_date": 20170125
    },
    {
      "title": "Bought this for our 2 yr old for Christmas. ...",
      "text": "Bought this for our 2 yr old for Christmas. He LOVES IT as do our other 2 children (8 and 4.5). It did take hubby and me about 2 hrs to put it together, though. hahaha. I guess it was worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "AmyW",
      "helpful_votes": 0,
      "publication_date": 20150122
    },
    {
      "title": "The best toy we have purchased for our 22month old",
      "text": "The best toy we have purchased for our 22month old!! He uses it inside and outside everyday. It's also great when he wants us to push him and the bar reaches high so you don't have to bend over. It's steers great and can go fast when they pedal hard. Great purchase before we get him a bike.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer Conover",
      "helpful_votes": 0,
      "publication_date": 20141026
    },
    {
      "title": "Great bike. Easy to push around",
      "text": "DAUGHTER LOVES THIS BIKE!!! Assembly took about 45 minutes to an hour. Great bike. Easy to push around!",
      "rating": 5.0,
      "verified": true,
      "author": "ODH",
      "helpful_votes": 0,
      "publication_date": 20160103
    },
    {
      "title": "My nephew loves it! He no longer want to ...",
      "text": "My nephew loves it! He no longer want to sit on the floor or chair...lol:)",
      "rating": 5.0,
      "verified": true,
      "author": "BKSP",
      "helpful_votes": 0,
      "publication_date": 20170830
    },
    {
      "title": "Best gift ever!!!",
      "text": "Love this for my 1 year old baby grand!! She can slide forward and tiptoe to push herself on it!!",
      "rating": 5.0,
      "verified": true,
      "author": "Anita D. Brown",
      "helpful_votes": 0,
      "publication_date": 20181116
    },
    {
      "title": "And this is easy to install and very light",
      "text": "I got this for my daughter,she likes it.And this is easy to install and very light.Good product.",
      "rating": 5.0,
      "verified": true,
      "author": "Henry",
      "helpful_votes": 0,
      "publication_date": 20170207
    },
    {
      "title": "Five Stars",
      "text": "Easy to assemble, my daughter enjoyed the assembly process. She loves riding on it. Works great indoor and outdoor.",
      "rating": 5.0,
      "verified": true,
      "author": "Bala",
      "helpful_votes": 0,
      "publication_date": 20151213
    },
    {
      "title": "Cute toy",
      "text": "Present for our grandson. He enjoys just the riding part now, but will be able to pedal very soon.",
      "rating": 5.0,
      "verified": true,
      "author": "gasman",
      "helpful_votes": 0,
      "publication_date": 20160309
    },
    {
      "title": "this arrived in pieces but was easy to put together",
      "text": "this arrived in pieces but was easy to put together, my daughter loves it and she loves the rocking aspect of it too. this was a great buy and i would recommend it to any one",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20151018
    },
    {
      "title": "It's extremely easy to convert from a rocking toy to a stroller-like ...",
      "text": "Assembly wasn't too difficult, and it's so well engineered. It's extremely easy to convert from a rocking toy to a stroller-like toy, and will be similarly easy to convert to a standard tricycle when the child is ready. Very pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "dp Arizona",
      "helpful_votes": 0,
      "publication_date": 20160804
    },
    {
      "title": "Five Stars",
      "text": "Was a great hit for a one year old. Should get years of rides.",
      "rating": 5.0,
      "verified": true,
      "author": "Larry & Nancy S.",
      "helpful_votes": 0,
      "publication_date": 20170920
    },
    {
      "title": "Bike for all ages",
      "text": "Awesome bike! Got it for my nephew for Christmas. Technically the only thing he can do now is to rock back and forth. he's a year old and too young to use the pedals. From what I hear, he loves his bike. I can't wait until summer to use the bike and push him around in it.",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy",
      "helpful_votes": 0,
      "publication_date": 20180220
    },
    {
      "title": "Two Stars",
      "text": "It doesnt have a \"seatbelt\" to keep my child in",
      "rating": 2.0,
      "verified": true,
      "author": "Julia martin",
      "helpful_votes": 0,
      "publication_date": 20170602
    },
    {
      "title": "and he still like to ride it",
      "text": "My boy loves it. Now he is four years old, and he still like to ride it.",
      "rating": 5.0,
      "verified": true,
      "author": "irene",
      "helpful_votes": 0,
      "publication_date": 20180601
    },
    {
      "title": "Easy to assemble",
      "text": "Easy to assemble, perfect for a 2 year old. He loves the fact he can either push it or ride it. Durable materials and safe.,",
      "rating": 5.0,
      "verified": true,
      "author": "Missg49",
      "helpful_votes": 0,
      "publication_date": 20150115
    },
    {
      "title": "Great Purchase",
      "text": "Perfect for 1yr+! Transitions well through your child's changing abilities.",
      "rating": 5.0,
      "verified": true,
      "author": "Kim boggs",
      "helpful_votes": 0,
      "publication_date": 20180619
    },
    {
      "title": "Incorrect hardware",
      "text": "Incorrect hardware The long screw is 2cm longer and does not work with the trike.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180906
    },
    {
      "title": "Four Stars",
      "text": "Love it and my son loves it! Bought it on sale and it works great! Very happy!",
      "rating": 4.0,
      "verified": true,
      "author": "Emma Snyder",
      "helpful_votes": 0,
      "publication_date": 20180420
    },
    {
      "title": "Awesome",
      "text": "Kids love it...need to buy another..they fight to gets to ride it!",
      "rating": 5.0,
      "verified": true,
      "author": "James M. Wheeler",
      "helpful_votes": 0,
      "publication_date": 20170102
    },
    {
      "title": "I'd recomend",
      "text": "My daughter (19 months) really enjoys this. I personally wish the handle came taller as I am a taller guy (6'3\") and have to bend over a little. Other wise great, took about 30 mins to build and sticker. I dislike the plastic wheels, but it is impossible to find a trike for under 80 with rubber wheels.",
      "rating": 4.0,
      "verified": true,
      "author": "Jhonathan",
      "helpful_votes": 0,
      "publication_date": 20160131
    },
    {
      "title": "It's sturdy and easy to roll",
      "text": "My little one loves this. It's sturdy and easy to roll. Very easy to build.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160815
    },
    {
      "title": "Five Stars",
      "text": "Son loves the bike, it took us around 20-30 minutes to complete assembly.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160730
    },
    {
      "title": "Love it!",
      "text": "Easy to put together in just a few minutes and a couple of tools. Feels very sturdy and quality. Well worth the $.",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa A Dack",
      "helpful_votes": 0,
      "publication_date": 20150110
    },
    {
      "title": "Great product. I wish it were a little taller ...",
      "text": "Great product. I wish it were a little taller when pushing it, but otherwise it was a hit with my grand daughter.",
      "rating": 5.0,
      "verified": true,
      "author": "WDS",
      "helpful_votes": 0,
      "publication_date": 20141223
    },
    {
      "title": "Five Stars",
      "text": "Grandson is 1 year old and he LOVES this trike.",
      "rating": 5.0,
      "verified": true,
      "author": "Ms.Mercy",
      "helpful_votes": 0,
      "publication_date": 20150914
    }
  ],
  "product_meta": {
    "title": "Fisher-Price Rock, Roll 'n Ride Trike [Amazon Exclusive]",
    "description": "Three grow-with-me stages let kids rock, roll, and ride from as young as 1½…all the way to 5! The youngest of riders can enjoy indoor/outdoor fun on the stationary rocker base. When they’re ready to roll, it’s quick and easy to remove and convert the base into an extra-long push handle for parents. Before they can pedal, toddlers can learn to steer as you help them roll along! Then, when they’re ready for big-kid pedaling fun, simply remove the handle, fold-up the footrest, and they’re off—with durable tires, easy-grip handlebars, chunky foot pedals and an adjustable “grow-with-me” seat. Trike easily converts from one stage to another and back again, no tools required.\n\nBRAND STORY\nFisher-Price: For the Best Possible Start. To give your child the best possible start in life, you don’t have to have all the answers or do things a certain way. All you have to do is the best you can, and let your kids play. At Fisher-Price, we’re dedicated to helping you do just that by working tirelessly to bring you the very best gear and toys. Fisher-Price toys are made to help all kids—from infants to toddlers to preschoolers—develop through play, in their own ways, because that’s how they learn best at each age and stage. And for babies, our gear offers simple solutions (more sleep, anyone?!) you can’t possibly parent without.",
    "rating": 4.4,
    "feature_bullets": [
      "Three “grow-with-me” stages let kids Rock, Roll, and Ride",
      "Stage 1: Rocking fun for little ones",
      "Stage 2: Rocker base converts to extra-long parent push handle to help toddlers roll along",
      "Stage 3: Independent pedaling fun for big kids",
      "Easy to convert—no tools required"
    ],
    "specifications": {
      "Product Dimensions": "32.5 x 19 x 40.5 inches",
      "Item Weight": "14.82 pounds",
      "ASIN": "B00JCA5DPG",
      "Item model number": "CJF13",
      "Manufacturer recommended age": "18 months - 5 years",
      "Best Sellers Rank": "#176,075 in Toys & Games",
      "Customer Reviews": "4.4 out of 5 stars376 ratings4.4 out of 5 stars",
      "Is Discontinued By Manufacturer": "No",
      "Mfg Recommended age": "18 months - 5 years",
      "Manufacturer": "Fisher Price"
    },
    "categories": [
      "Ride-On Toys & Accessories",
      "Tricycles, Scooters & Wagons",
      "Toys & Games"
    ],
    "price": ""
  }
}