{
  "website_summaries": [
    {
      "verdict": "A first-rate green tea lotion that delivers a superior combination of affordability and quality.",
      "pros": [
        "Includes an unprecedented blend of green tea, acai berry, gogi berry, and other powerful ingredients that help bolster the skin's appearance",
        "Green tea lotion stimulates the skin's anti-inflammatory and regenerating properties at the same time",
        "Lotion is 100% vegan",
        "Leaves the skin feeling refreshed and revitalized upon application"
      ],
      "cons": [
        "Emits a pungent odor",
        "Lotion is not as thick as comparable products"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Container needs to be redesigned for efficiency",
      "text": "I have ordered this several times and have been pleased overall with the creaminess and scent of the Exotic Green Tea & Asian Pear. The only drawback as shown in the two “empty” bottles pictured here is that it is impossible to get out the last 1/5 or so out of the container. I understand having a small amount of the moisturizer left in the bottle, but this really is wasteful. I have tried placing one bottle on top of the other, but the size of the opening is small and the top bottle slips off every time. The manufacturer should look into redesigning the container for maximum efficiency so that consumers can use the entire contents.",
      "rating": 4.0,
      "verified": true,
      "author": "Kristin P",
      "helpful_votes": 138,
      "publication_date": 20181003
    },
    {
      "title": "Best lotion!",
      "text": "This is my go to lotion ever since I got a real small bottle in one of my monthly subscription boxes. I was glad I looked on Amazon because they had the cheapest price I've eve seen it! I wash my hands over & over & over again every day at work therefore they are always very dry! This lotion has saved me from a winter of cracked & bleeding knuckles! This is a large bottle. I included one picture of it next to a large McDonald's cup to give you an idea how big the bottle is.",
      "rating": 5.0,
      "verified": true,
      "author": "Chanel",
      "helpful_votes": 41,
      "publication_date": 20180204
    },
    {
      "title": "I love this lotion!",
      "text": "This lotion is my favorite! The scent is my absolute favorite out of all the HEMPZ lotions and I've tried about every single one of them. The perfect balance of the green tea and pear scents. Neither are overpowering. It is extremely light weight and not greasy at all. I definitely run on the warm side of body temperature and when it comes to sweating and prefer and like that it doesn't feel as moisturizing as some more heavy weight lotions. I apply it all over my body immediately after I'm done showering and my body soaks it right up and it leaves my bath robe smelling awesome, too. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Shelly B.",
      "helpful_votes": 43,
      "publication_date": 20170510
    },
    {
      "title": "Not my cup of tea, scent is a little strong and needs reapplication every few hours.",
      "text": "The scent was much stronger than I expected, and bothers my husband when I apply it. It has a very strong green tea smell, and not much of a pear smell. It at first feels slightly sticky when applying and then it absorbs into the skin nicely and does not leave an oily residue.My previous purchase was hempz triple moisture. This is not as moisturizing. Skin seems to dry out within a few hours of application. I would return to the triple moisture but that scent is also too strong for me.",
      "rating": 3.0,
      "verified": true,
      "author": "Dancingstarheart💖&RelexivelyCatlike",
      "helpful_votes": 16,
      "publication_date": 20180516
    },
    {
      "title": "Thick, Creamy, with a Fresh Fragrance",
      "text": "Thick, creamy lotion, non-greasy, and it doesn't smell different once applied to your skin. I love this brand of lotion but it's hit or miss with the fragrances sometimes. With some of the fragrances, once you smell the lotion and apply it to your skin, it has a completely different smell to it. The green tea is one of the few fragrances that stays consistent from the bottle onto your skin - I love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda L",
      "helpful_votes": 25,
      "publication_date": 20170110
    },
    {
      "title": "Good light weight moisturizer",
      "text": "If you are looking for something with a lot of hydration, this product is not for you. It acts as a good moisturizer for summer months when my skin is not as dry. It sinks in very quickly and doesn't leave you sticky which is perfect. With that said, I can tell as soon as the colder weather hits, I will have to trade this in for a heavier moisturizer to combat my dry winter skin.",
      "rating": 4.0,
      "verified": true,
      "author": "Sonia",
      "helpful_votes": 16,
      "publication_date": 20170915
    },
    {
      "title": "Smells lovely!",
      "text": "I love Hempz lotions because of their ingredients and are very moisturizing for tanned skin! I decided to try green tea and Asian pear after finishing my bottle of mango nectar and hibiscus (both are amazing!!) and the green tea scent is more subtle than other Hempz lotions and smells very tasteful and expensive. Overall I love both scents and am excited to try another scent once I’m done with this bottle :)",
      "rating": 5.0,
      "verified": true,
      "author": "KatherineV",
      "helpful_votes": 7,
      "publication_date": 20191120
    },
    {
      "title": "Fragrance isn't stable on the skin",
      "text": "I decided to try this scent after really enjoying the pineapple melon version. I'm glad I just got a small bottle! The smell is nice right out of the bottle but soured almost instantly on my skin. The pear fragrance died immediately and the green tea was really astringent and didn't smell nice at all. I'm a big fragrance enthusiast and I generally like green tea but it wasn't balanced in this lotion. It doesn't seem to moisturize in the same way the pineapple melon version does. Going with my first instinct and investing in a large bottle of that one.",
      "rating": 3.0,
      "verified": true,
      "author": "Hexwench",
      "helpful_votes": 3,
      "publication_date": 20200327
    },
    {
      "title": "Love Hempz Lotion, Hate the Smell",
      "text": "I really like how lightweight but deeply moisturizing Hempz is, but I've now tried a few scents and realize they just always scent the lotions too strongly for me. I mostly prefer unscented products, but I do enjoy a scent or two. However, Hempz' scents are just too strong for me, especially since they tend towards sweet, even when floral. I wear my jeans several times before washing and I couldn't stand how the smell of this lotion lingered on them. Just not for me.",
      "rating": 3.0,
      "verified": true,
      "author": "Sally Bidwell",
      "helpful_votes": 3,
      "publication_date": 20181018
    },
    {
      "title": "Very small",
      "text": "It's just meh!! Very small as you can see this is the lotion sitting next to my smoke device so its really not worth the money the smell is ok and it doesn't really last so I def won't be ordering another I had ordered another heml product and I loved it but this one just doesn't cut it for me 😒",
      "rating": 2.0,
      "verified": true,
      "author": "Kelly",
      "helpful_votes": 3,
      "publication_date": 20200814
    },
    {
      "title": "Smells Great & Authentic Product",
      "text": "Arrived quickly and is authentic. Make sure when you are purchasing anything name brand on Amazon to buy these products through a reliable seller. It did arrive sealed. Like a previous user mentioned, this scent smells similar to cucumber melon. I am picky with lotion and I really like it!",
      "rating": 5.0,
      "verified": true,
      "author": "Olivia",
      "helpful_votes": 8,
      "publication_date": 20180303
    },
    {
      "title": "WARNING!...it’s that good",
      "text": "Once you try Hempz you won’t want to use any other brand. So far I have only tried two of the scents, this one as well as the pineapple. Between the two this one I would call more of a clean scent, where pineapple is fruity and fun. To me this scent smells like a mix of cucumber, clean ocean scent with a dash of sweetness. The scent is not overpowering and definitely fades nicely after application to leave behind soft hydrated skin. Definitely give it a try, once you do you’ll be hooked!",
      "rating": 5.0,
      "verified": true,
      "author": "Bailey Boo",
      "helpful_votes": 2,
      "publication_date": 20190530
    },
    {
      "title": "Lotion is Great, pump bottle SUCKS",
      "text": "Love the scent and it’s the perfect moisturizer just out of the shower. The dispenser seems to be broken, it takes about 20 pumps every time I want to use it so I’ve just been unscrewing the whole thing an use the pump tube as a dabber. What a NUISANCE!. I’m looking for another pump bottle I can transfer it to. I should really just send it back. The manufacturer needs to redesign this stupid pump because if you read other reviews you can never use the full contents of the bottle because of the crappy design. C’mon Hempz get with it!!!",
      "rating": 2.0,
      "verified": true,
      "author": "Diana in Kaneohe Hawaii",
      "helpful_votes": 0,
      "publication_date": 20190602
    },
    {
      "title": "Does not make me break out in hives or rashes!",
      "text": "I was worried about this since I am sensitive to a lot of lotions but to my surprise I did not break out in hives due to perfumes/dyes! I can't say for sure but this lotion is hypoallergenic to me. It smells absolutely divine, it absorbs into the skin really quickly, and you support hemp! I love this stuff this is now my go-to lotion! thank you!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 4,
      "publication_date": 20171027
    },
    {
      "title": "Needs different dispensing system or pump",
      "text": "The lotion itself is great. Love it. The pump used in the container is horrible. There's a good 1/4 bottle of lotion left when the pump decides to stop working. Have had this happen with both bottles purchased. And I made quite a mess trying to consolidate one bottles lotion into the other. Find a new dispensing system or get a better pump. (Test it). Thank you.",
      "rating": 4.0,
      "verified": true,
      "author": "Peg",
      "helpful_votes": 3,
      "publication_date": 20200206
    },
    {
      "title": "Wonderful Lotion--Worst Pump",
      "text": "I have tried many lotions for my eczema--but this has to be one of the better ones. Creamy and moistures my skin in a way that is awesome. Unless you moisturize you will be itching that dry skin. Now, for the pump that came with the lotion. It malfunctioned after 3 days. So what is the point for having a pump for the lotion when it does not work?",
      "rating": 4.0,
      "verified": true,
      "author": "Katrinka",
      "helpful_votes": 2,
      "publication_date": 20181124
    },
    {
      "title": "Love it!",
      "text": "I loved their pineapple lotion but wanted a more mellow scent that would not be overpowering or make me smell like a 13 year old girl who over does the fruit scented body spray. I was very impressed with this scent, it is refreshing but not overpowering. The lotion is not oily and soaks right in. I have very sensitive skin and this lotion does not bother me.",
      "rating": 5.0,
      "verified": true,
      "author": "  Curtis",
      "helpful_votes": 0,
      "publication_date": 20200419
    },
    {
      "title": "Soothing and Well Scented",
      "text": "I have mild eczema and am always in search of a soothing lotion for my skin. This one is by far my favorite ever! I've tried prescription, OTC lotions and creams, as well as specialty companies selling lotions with promising relief. However, nothing has been as effective as this! I am not sure if a guy would appreciate the smell, so just FYI it is quite floral - but not perfumy at all. It has also been effective on soothing skin irritants I've encountered in the great outdoors.",
      "rating": 5.0,
      "verified": true,
      "author": "TheWattersFamily",
      "helpful_votes": 0,
      "publication_date": 20200607
    },
    {
      "title": "My Favorite Lotion",
      "text": "This is my all time favorite lotion! I love all of the Hempz lotions because of their natural ingredients as well as their great scents. This one happens to be my favorite. I bought the travel size to make sure I have my favorite lotion on trips. This smell is subtle and more basic scent but still nice. It’s a good tea sorta smell without being overly herb scented.",
      "rating": 5.0,
      "verified": true,
      "author": "Maura",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "THE BEST!",
      "text": "This is THE BEST moisturizer/lotion and has been made increasingly more affordable for their very decent sized bottles. I got a sample from a salon and was hooked years ago and had been forced to buy it from Ulta for something like $25 when there were no other options. Picked this up from here for about $10. Leaves my skin feeling soft, moisturized, not greasy, not sticky, not residue-y. The scents are all pretty good. Not the type of perfumey that makes me sneeze or chemically scented. They seem to be on the sweeter or fruity side though.",
      "rating": 5.0,
      "verified": true,
      "author": "Alyson Moy",
      "helpful_votes": 0,
      "publication_date": 20180405
    },
    {
      "title": "Artificial colors negate all the healthy stuff",
      "text": "There wasn't an image to view the ingredients so I didn't. Shame on me for not investigating. I would not have purchased a product with Yellow 10, Green 3, and many other ingredients I don't want to take the time to spell. This is not a healthy, natural product",
      "rating": 1.0,
      "verified": true,
      "author": "Lynn",
      "helpful_votes": 3,
      "publication_date": 20180930
    },
    {
      "title": "great stuff",
      "text": "I have a bottle of Hempz in just about every room of my house. With what I do for a living I often suffer from dry and cracked skin. My favorite part of Hempz lotion is that it doesn't burn or sting when applying it to cracked skin like some other lotions do. Since using Hempz lotion the skin on my hands hardly breaks open anymore, and is no longer sore and red all winter long. Also I get drug tested randomly for my work, this will not make you fail a drug test. I know that is a concern for some people.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard S",
      "helpful_votes": 5,
      "publication_date": 20160429
    },
    {
      "title": "Not bad but not my favourite",
      "text": "Hempz makes great lotions. This scent is not my favorite. It seems heavy on the tea and less pear to me... Its not bad, I'll use it up as the quality is great, just not one that I will purchase again due to my personal preference of the scent wasn't my favorite",
      "rating": 4.0,
      "verified": true,
      "author": "Tine bop",
      "helpful_votes": 0,
      "publication_date": 20200915
    },
    {
      "title": "Pump doesn't work",
      "text": "I don't like this smell, also whenever I order Hempz products, roughly 50% of the time the pumps are broken upon arrival. Hempz manufactures poor quality products!!!! I actually like most of their lotions, but am looking for an alternative just because you can't actually use the lotion with a broken pump. If anybody knows of a brand just as good or better please leave in the comments! Thanks!",
      "rating": 1.0,
      "verified": true,
      "author": "Jessica McNamara",
      "helpful_votes": 2,
      "publication_date": 20190530
    },
    {
      "title": "Smell is so great and stay so long",
      "text": "Smell is so great and stay so long, creamy and it is not greasy after applied on your body, i know this one because i saw it at Green Massage, i tried to used it, smell is great, I asked receptionto buy it, they said that they don't sell that one and they offer me to buy this one at Herbal Store, i took pics and searching at amazon, finally i found it. THIS IS FABULOUS, everyday I slept so good with the nice smell around me. I bought ten smell lotion of Hempz, i will used them everyday one by one",
      "rating": 5.0,
      "verified": true,
      "author": "Sean Pham",
      "helpful_votes": 0,
      "publication_date": 20170802
    },
    {
      "title": "Pump arrived broken",
      "text": "I'd previously used the Blushing Grapefruit and Raspberry Creme lotion and couldn't wait to purchase another variety of this fantastic product, but when it arrived, the pump won't work no matter. Shaking it produces some kind of metal rattling sound, almost like there's a little bead stuck in there. The lotion is still very good, I'm just not impressed with how big of a pain it is to get it out of the bottle.",
      "rating": 3.0,
      "verified": true,
      "author": "Alexander",
      "helpful_votes": 2,
      "publication_date": 20190118
    },
    {
      "title": "Phenomenal product!! light clean,  yet sweet scent",
      "text": "I love the Hempz brand it is do moisturizing without being greasy or heavy and it leaves your skin feeling so soft. This scent was very light and more of the green tea than the Asian Pear it was not very fruity just a clean yet slightly sweet smell. I prefer their other scents like the grapefruit/raspberry and pomegranate but it is phenomenal product",
      "rating": 5.0,
      "verified": true,
      "author": "Kara Spang",
      "helpful_votes": 0,
      "publication_date": 20200430
    },
    {
      "title": "Simply AMAZING lotion!",
      "text": "Already used half the bottle! Definitely buying a bigger bottle!! It smells amazing and feels great on your skin and I have very sensitive skin and it is just simply amazing! Cant wait to try out ALL of the other ones from Hempz!",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica Gann",
      "helpful_votes": 0,
      "publication_date": 20200513
    },
    {
      "title": "Silky, Mild Scent, and Non-Greasy",
      "text": "I am very sensitive to strong odors, so I was worried when I read some of the reviews regarding the \"strong scent\". However, the scent is quite pleasant. Even my coworker mentioned how nice is smelled--she only noticed the scent when she saw me putting on the lotion--and the scent dissipates quickly. It moisturizes quite well, and doesn't leave any greasy or sticky residue. It is perfect for work.",
      "rating": 5.0,
      "verified": true,
      "author": "CobaltSerenity",
      "helpful_votes": 0,
      "publication_date": 20190412
    },
    {
      "title": "Great thin natural lotion",
      "text": "Hempz is a great smelling and pretty good acting moisturizer. This is a thinner more natural moisturizer. A little goes a long way as far as coverage goes. I want these to work better than they do for me but a thicker lotion, like that gold bond healing does better on my particular dry skin. Plus it smells great.",
      "rating": 4.0,
      "verified": true,
      "author": "Paul A",
      "helpful_votes": 0,
      "publication_date": 20200227
    },
    {
      "title": "A little goes a long way",
      "text": "Its really smooth and a little bit goes a long way, and it smells so good.",
      "rating": 5.0,
      "verified": true,
      "author": "Jenna",
      "helpful_votes": 2,
      "publication_date": 20200524
    },
    {
      "title": "Cream fabulous, container pump always breaks!",
      "text": "Love the cream can't stand the pump it breaks like clockwork! Every bottle everytime! Then I get creative to get a third of lotion, the remaining amount all out of bottle! Thank god the lotion is worth it or I would have not been a return buyer!",
      "rating": 5.0,
      "verified": true,
      "author": "edreams ",
      "helpful_votes": 0,
      "publication_date": 20190521
    },
    {
      "title": "LOVE THIS STUFF",
      "text": "I have very strong OCD and I've spent years searching for a lotion that I don't have to immediately wash off. THIS IS THE BEST. It's extremely moisturizing without being greasy so I will continue to buy it. Also when I use it in public, I always seem to get compliments on the clean smell of the lotion. It's a fav in my book! <3",
      "rating": 5.0,
      "verified": true,
      "author": "H",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "50/50",
      "text": "Shipping was slow (however I ordered March and received in May right around everything shutting down for COVID) the packaging appears to be identical. I originally bought for a bridesmaid proposal box for the girls post spray tan. While it lathers very similar to Hempz lotion, I wondered about the scent. The scent is not bad, its light and I am not unhappy with it, however I'm not sure that its 100% the same as what I've smelled in store. Bottles in store this size run about $7 so I think its a good purchase. Will update if it for any reason effects spray tans as this is what my gal recommends.",
      "rating": 5.0,
      "verified": true,
      "author": "Brandy",
      "helpful_votes": 0,
      "publication_date": 20200515
    },
    {
      "title": "Love the Product, but not the Scent",
      "text": "This is my favorite brand of lotion. It absorbs quickly, deeply moisturizes and isn’t greasy; however this scent wasn’t anything like what I expected. My mind was expecting green tea ice cream with an Asian pear topping or piece of pie, but what I got was a lot more botanical and floral. Think of pear and tea trees to formulate a more realistic expectation.",
      "rating": 3.0,
      "verified": true,
      "author": "Bryan*Squared",
      "helpful_votes": 0,
      "publication_date": 20200201
    },
    {
      "title": "Smell is absolutely too strong!",
      "text": "The cream feels great, but I smell like a darn dryer sheet. Horrible and overwhelming. Most workplaces don't even want people wearing that much cologne anymore. I could not wear another scent with this. So very disappointed because the cream is great.",
      "rating": 1.0,
      "verified": true,
      "author": "laura rauscher",
      "helpful_votes": 0,
      "publication_date": 20200607
    },
    {
      "title": "Great gift",
      "text": "So I am allergic to this product and I ended up giving away the lotion as a gift to my sister and she loved it so much she wanted more. She is young so I bought her another but I really can’t stand that this product consist of aloe and dyes. Dyes do not determine the products appeal to me and being that I’m allergic I’m sad I will never be able to experience it. Happy seeing it makes someone else happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Cinnabunny",
      "helpful_votes": 0,
      "publication_date": 20200312
    },
    {
      "title": "Bad container, great product",
      "text": "Love the product and want the option for a travel size. But, I definitely do not care for the container/ bottle it comes in. Hard to get the lotion out. The design doesn't allow you to squeeze it so having the flip too is a joke. Just end up unscrewing it and hitting it against my hand to force it out.",
      "rating": 2.0,
      "verified": true,
      "author": "Julie and Dan Hoyle",
      "helpful_votes": 0,
      "publication_date": 20191030
    },
    {
      "title": "BEST lotion out there - stop buying anything else",
      "text": "I LOVE this lotion. My skin has never been softer or more nourished. It really is the BEST! It comes in several scents but the green tea and pear is my favorite (I have a very sensitive nose).",
      "rating": 5.0,
      "verified": true,
      "author": "Colleen Donehue",
      "helpful_votes": 0,
      "publication_date": 20200217
    },
    {
      "title": "Smells great",
      "text": "I love the smell of this lotion and I use it after every shower. The smell stays almost all day but it’s very light and fresh so it doesn’t overwhelm you. The lotion itself is a bit thick while putting it on, it just feels like it doesn’t really absorb but rather sits on top of your skin. After a couple minutes though it doesn’t feel as weird",
      "rating": 4.0,
      "verified": true,
      "author": "DomiMeow",
      "helpful_votes": 0,
      "publication_date": 20190209
    },
    {
      "title": "Travel size not a full size bottle",
      "text": "I love this lotion but I didn't know it was a travel size or I wouldn't have bought it for the price but I love the smell and the lotion is awesome!",
      "rating": 4.0,
      "verified": true,
      "author": "Jackie",
      "helpful_votes": 0,
      "publication_date": 20200427
    },
    {
      "title": "Simple Scent",
      "text": "Out of all the Scents I've used with the Hempz Lotion, this one was the most Least to Smell like the description. Yet, it does smell nicely and it does make your skin fell lovely, and moisturized.This lotion is wonderful in the summer and winter months. I won't use any other lotion.",
      "rating": 5.0,
      "verified": true,
      "author": "Dawn H.",
      "helpful_votes": 0,
      "publication_date": 20190711
    },
    {
      "title": "Smells amazing!! It smells like very sweet and the ...",
      "text": "There are not enough positive things I can say about this lotion. Smells amazing!! It smells like very sweet and the smell will linger for quite some time. I have noticed that I have had to use more lotion than usual. It absorbs into my skin much faster than other brands. Likely because it is not clogged with parabens and other nasty ingredients. This brand is not tested on animals (my main reason for purchasing). I have very sensitive skin and have not seen any adverse reactions. Absolutely love this product. I will definitely be purchasing again.",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley Barteck",
      "helpful_votes": 0,
      "publication_date": 20151102
    },
    {
      "title": "This one is different.",
      "text": "I love Hempz products! They are great for my sensitive skin. I usually buy the pomegranate lotion. That being said, this one is a little different. The smell is okay, and the feel is the same great smoothness. However, I tend to get dry feet, and sometimes small cracks and this scent burned. The others don't. So I'm not sure what the difference is in scent, but it does burn on my dry skin. Next time I'll stick to the pomegranate!",
      "rating": 4.0,
      "verified": true,
      "author": "Kobiya",
      "helpful_votes": 2,
      "publication_date": 20160724
    },
    {
      "title": "Pump is crap, cream is great",
      "text": "I love the cream! The bottle pump doesn’t work on both creams I bought so I can’t actually get the cream out. So disappointed like who can both bottle pumps be defective? Cream is great though!",
      "rating": 3.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 0,
      "publication_date": 20190331
    },
    {
      "title": "Great for extremely dry skin and cracked knuckles!",
      "text": "I work for a moving company where I pack people’s belongings using a lot of paper and cardboard. My hands get really dry and my the skin on my knuckles even crack because of the material I’m always handling. This is the ONLY lotion I’ve ever found to bring the moisture back into my skin. It’s noticeable after one use, but it does take a few times to get my skin completely back to normal, which is expected. I will most definitely be buying this lotion again!!",
      "rating": 5.0,
      "verified": true,
      "author": "Samantha",
      "helpful_votes": 0,
      "publication_date": 20200229
    },
    {
      "title": "Second Bottle Blues",
      "text": "I started with the original scent. It has been gone for about two weeks now. However, I have boughten this and absolutely love it. The original scent I purchased seemed to attract all the dogs to licking my legs! This scent doesn't... My girlfriend loves it too! I will try another scent when the time comes!",
      "rating": 5.0,
      "verified": true,
      "author": "Jaiden",
      "helpful_votes": 0,
      "publication_date": 20200915
    },
    {
      "title": "Perfect for my needs & smells amazing!",
      "text": "Sooo good! Love the smell of this one. A nice middle of the road lotion- not super thick but not super watery either. Absorbs easily & quickly & my skin feels extra soft... & it smells amazing! Scent is a light, very slightly sweet crisp pear/green tea scent. Not overly youthful nor too mature. Really live this lotion!",
      "rating": 5.0,
      "verified": true,
      "author": "S.D. Moose",
      "helpful_votes": 0,
      "publication_date": 20190616
    },
    {
      "title": "Great product.",
      "text": "Love the smell and feel of the lotion. Not too thick and heavy feeling on my skin, but still moisturizes. Scent is very light and refreshing, not too overwhelming. Got this small bottle to try, but will definitely be purchasing the larger pump bottle next.",
      "rating": 5.0,
      "verified": true,
      "author": "John L.",
      "helpful_votes": 0,
      "publication_date": 20201001
    },
    {
      "title": "DELICIOUS SCENT, makes skin feel smooth, soft, moisturized, and hydrated!! Will be re-purchasing!",
      "text": "The smell is delicious!! I am almost half way through the bottle at this point and am 100% obsessed! Will definitely be ordering the same scent again next time, as it’s my new favorite. I hate “sticky” lotion that gives you the filmy feeling and this doesn’t give me that at all! This one makes my skin feel moisturized and hydrated! I can’t wait to put this on after the shower and before bed! My legs have never felt smoother!",
      "rating": 5.0,
      "verified": true,
      "author": "Chelsea Lowery",
      "helpful_votes": 0,
      "publication_date": 20200509
    },
    {
      "title": "Small bottle. Good lotion",
      "text": "Didn't realize it was such a tiny, but cute, little bottle! Good lotion. Moisturizes my skin pretty good. Doesn't feel greasy afterwards. Nice scent! Not overpowering at all. Kinda wish I'd bought the bigger bottle instead. Overall, I'm happy with my purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Barb Campbell",
      "helpful_votes": 0,
      "publication_date": 20200303
    },
    {
      "title": "Lovely Luscious Luxurious Lotion! Love Love Love!",
      "text": "The crepe paper skin on my hands ages them 20 years and I've even tried expensive anti-aging face creams and seen little improvement. Hempz is the only product I've tried that quickly and so dramatically plumps up the skin, lasting for hours even through hand washing, leaving skin silky soft and smelling delicious. I'll be trying ALL the scents.The Green Tea & Asian Pear is already perfect though :)",
      "rating": 5.0,
      "verified": true,
      "author": "Carey A. Willis",
      "helpful_votes": 0,
      "publication_date": 20180705
    },
    {
      "title": "Fabulous lotion! Horrendous packaging!",
      "text": "The pumps on hempz lotion are cheap pieces of junk that will not work past the last quarter of the bottle. Sometimes they won’t work at all. I love the lotion so much that I dump it in my own bottles. Wish it was more convenient.",
      "rating": 3.0,
      "verified": true,
      "author": "JayneDH",
      "helpful_votes": 0,
      "publication_date": 20181228
    },
    {
      "title": "Light and smooth but still moisturizes incredibly!!",
      "text": "I love how light it is and it’s so smooth it makes my skin feel so soft! And it smells fresh!",
      "rating": 5.0,
      "verified": true,
      "author": "kristy",
      "helpful_votes": 0,
      "publication_date": 20200506
    },
    {
      "title": "Waste of money",
      "text": "This lotion is not worth the purchase. It smells like insect spray, last no time, and is not moisturizing. Most of all, you can’t return it on Amazon and no refund! Save your money!",
      "rating": 1.0,
      "verified": true,
      "author": "Donna B",
      "helpful_votes": 0,
      "publication_date": 20200229
    },
    {
      "title": "love this lotion!",
      "text": "I've been using Hempz lotion for over a year now and absolutely LOVE it. I have very sensitive skin and had a hard time finding a lotion that didn't make my skin breakout.... well here is the perfect product! It leaves my skin feeling so fresh and smooth! This is also my favorite scent! would highly recommend this product!",
      "rating": 5.0,
      "verified": true,
      "author": "ally_cat",
      "helpful_votes": 0,
      "publication_date": 20170901
    },
    {
      "title": "BEST lotion ever!",
      "text": "LOVE this lotion. I received this product in my Ipsy bag (amongst many other lotions) and this is my absolute favorite. Many lotions feel oily or sticky once applied but this one almost feels like water! It keeps my skin extremely hydrated and it smells soooo amazing. This lotion is expensive but worth every single penny.",
      "rating": 5.0,
      "verified": true,
      "author": "diane hickman",
      "helpful_votes": 0,
      "publication_date": 20200321
    },
    {
      "title": "Smells Great!",
      "text": "I really like this lotion. It smells sooooo good, but it's just like any other lotion that I would get at Bath and Body Works. It can get greasy, so I only use a tiny amount. I'll use it until it runs out, but I don't think I would buy it again.",
      "rating": 5.0,
      "verified": true,
      "author": "renee",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "Smells awful",
      "text": "I generally love the Hempz line, but this one smells terrible. It does not smell like green tea, or pear, or even cucumber melon as one reviewer suggested. The scent reminds me of a low-end brand name lotion that my mother used in the 80's. It's awful.",
      "rating": 1.0,
      "verified": true,
      "author": "Lea",
      "helpful_votes": 2,
      "publication_date": 20181112
    },
    {
      "title": "Gentle smells good great $  100%",
      "text": "After i wash my face i take my shower and then right to the moisturizer. Right there i know \"Yes\" or \"No\" if it makes my cheeks burn or feels tight it's gone. I am having a really good experience with this one!!",
      "rating": 5.0,
      "verified": true,
      "author": "therose",
      "helpful_votes": 0,
      "publication_date": 20200507
    },
    {
      "title": "Lovely scent.",
      "text": "My favorite lotion. Not to heavy so it absorbs quickly. I live in Florida and lotion that is too thick takes forever to dry in our humid climate. Light scent and a little goes a long way. The Pomegranate scent is also fabulous.",
      "rating": 5.0,
      "verified": true,
      "author": "Elissa Z.",
      "helpful_votes": 0,
      "publication_date": 20190503
    },
    {
      "title": "Smells so good",
      "text": "At first I was hesitant about any hemp products especially lotions but after receiving my first bottle of hemp lotion and loving the scent I ordered almost every single scent that they have and I love them all.",
      "rating": 5.0,
      "verified": true,
      "author": "Shurie",
      "helpful_votes": 0,
      "publication_date": 20201019
    },
    {
      "title": "False ingredients advertised vs received",
      "text": "The ingredients listed here are not the same as on the bottle I received. The bottle I received list the ingredient methylisothiazolinone which is not listed here. Which was why I ordered in the first place, but cannot use now because of an allergy to the ingredient.",
      "rating": 1.0,
      "verified": true,
      "author": "Boe",
      "helpful_votes": 0,
      "publication_date": 20190830
    },
    {
      "title": "Good lotion but too pricey.",
      "text": "The lotion smells really nice but it’s a bit too strong when used all over the body. It’s moisturizing enough for a 10 hour workday-no reapplication needed. Value for price-not too good. It’s very small",
      "rating": 2.0,
      "verified": true,
      "author": "MartaKat",
      "helpful_votes": 0,
      "publication_date": 20201003
    },
    {
      "title": "Easy and safe to use",
      "text": "It’s important to me that the product doesn’t have mineral oil or petroleum products. I have very dry skin, and this lotion is working well.",
      "rating": 5.0,
      "verified": true,
      "author": "Heidi",
      "helpful_votes": 0,
      "publication_date": 20200123
    },
    {
      "title": "Great for people sensitive to lotion residue. Less great for sensitive noses.",
      "text": "Really great lotion for anyone like me who cannot stand the feeling of an oily lotion residue. I can hardly use most lotions without wanting to wash them off ASAP but this one is good. No residue feeling. The scent is nice, definitely more pear, but it is kinda strong in my opinion so I’d probably go for unscented next time. The moisture isn’t long lasting because it’s so light. However, I think it’s worth it because it’s a lotion I can stand to keep on.",
      "rating": 5.0,
      "verified": true,
      "author": "Liz",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "Love this lotion",
      "text": "Love this lotion and will keep buying it over and over! I have bought this lotion from amazon 3 times now and this is the first time I have had damage to the bottle. Other than that the product itself is amazing.",
      "rating": 4.0,
      "verified": true,
      "author": "Jessica Melendy",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "the smell alone is amazing",
      "text": "seems like your average lotion in terms of how well of a job it does - but the big selling points for me the smell - this is my fav but the pomegranate and the pineapple are great too - i bought the trials so i could see what i liked best then bought a biggie of my fav.",
      "rating": 5.0,
      "verified": true,
      "author": "S Trisha",
      "helpful_votes": 0,
      "publication_date": 20200122
    },
    {
      "title": "You know you want this!",
      "text": "Absolutely love this stuff! It smells amazing, doesn't leave a residue on your skin afterwards. My skin seems so much healthier after using this daily. I have only had 2 weeks and am a quarter ofvthe way through it. Thats because my kids love it too! After the bath or shower they ask for it now. All around great. My 4 yr old daughter has always had sensitive skin and will break with certain laundry soaps, soaps, and lotions. But this stuff has taken away the little bumps on her arms and it is baby soft again! BUY THIS PRODUCT!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Emily Kennerly ",
      "helpful_votes": 0,
      "publication_date": 20200821
    },
    {
      "title": "Crappy pump!",
      "text": "Product arrived today and I was excited to use this cream! Very disappointed that the pump does not work! The cream is great but it is a mess to use since the pump doesn’t work . I have to open it up and use the “straw “ of the pump to spread the cream on my hands then set it somewhere while I shake cream out of the bottle. A real pain!",
      "rating": 2.0,
      "verified": true,
      "author": "K. Clark",
      "helpful_votes": 0,
      "publication_date": 20190112
    },
    {
      "title": "Too perfume-y!",
      "text": "I’m a big fan of the sweet pineapple and melon. But I really dislike this scent. It does have a pear type scent but with a heavy perfume scent on it. I guess I’m sensitive to smells but I was definitely disappointed in this one. If you like heavy perfume scent, even when you try to wash it off, this is for you.",
      "rating": 3.0,
      "verified": true,
      "author": "IN",
      "helpful_votes": 0,
      "publication_date": 20200319
    },
    {
      "title": "Tiny bottle, big aroma🥰",
      "text": "The lotion I purchased is travel size, it fits perfectly in my purse. It smells great and the lotion goes in smooth. It isn't greasy or thick, it feels like a lightweight moisturizer.",
      "rating": 4.0,
      "verified": true,
      "author": "Doasm Memoir: VBJ",
      "helpful_votes": 0,
      "publication_date": 20200422
    },
    {
      "title": "Love the lotion, but have another pump bottle ready",
      "text": "I love this lotion, but pump bottles can't handle it. I've purchased this twice and both original bottles broke (one was broken when it arrived). I tried putting the lotion in a different pump bottle and it worked for a little while, but then that stopped working too. Kind of a hassle.",
      "rating": 3.0,
      "verified": true,
      "author": "Kate",
      "helpful_votes": 0,
      "publication_date": 20190308
    },
    {
      "title": "Tiny.",
      "text": "It’s tiny, but I knew that buying it (picture for reference). I bought the tiny ones so I could determine which scent I would really enjoy. And I really like this scent it’s not to strong. It’s perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Norma",
      "helpful_votes": 0,
      "publication_date": 20200610
    },
    {
      "title": "LOVE",
      "text": "I gave four stars just because the smell is a little overwhelming to me, but I am a tad sensitive to those things. It does a great job moisturizing though, and it's great for during the day. I just try to avoid it at night so the smell isn't too bothersome.",
      "rating": 4.0,
      "verified": true,
      "author": "afran23",
      "helpful_votes": 0,
      "publication_date": 20190213
    },
    {
      "title": "Another wonderful sample size lotion",
      "text": "I love that I can try these out before committing to the big bottles, I will be ordering this in the larger size very soon because it smells great, and I like a variety to pick from.",
      "rating": 4.0,
      "verified": true,
      "author": "Cherie",
      "helpful_votes": 0,
      "publication_date": 20200415
    },
    {
      "title": "At least try it!",
      "text": "We all have different skin. That being said my skin got dry after using it. I still continued until gone because I do not waste money lol. I will say this..the smell is long lasting and smells great",
      "rating": 3.0,
      "verified": true,
      "author": "Shopaholic 🔑",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "Effective without the greasy after feel",
      "text": "Love this. The scent is a little strong but I loved my pear scent. All the effectiveness of the lotions that leave your skin feeling greasy without the actual feeling. Highly impressed",
      "rating": 5.0,
      "verified": true,
      "author": "Bekah",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "Wouldn’t buy",
      "text": "The smell is terrible and gives me a headache. I’ve tried the other lotions like sweet pineapple and the coconut/watermelon and they smell soo much better. No return policy either. Stuck with it.",
      "rating": 2.0,
      "verified": true,
      "author": "julia6998",
      "helpful_votes": 0,
      "publication_date": 20200716
    },
    {
      "title": "Nice lotion. Bad smell.",
      "text": "Overall I like this lotion. It’s very moisturizing. I do not like the scent though. It’s weirdly floral or something. I will definitely try out other scents down the road.",
      "rating": 4.0,
      "verified": true,
      "author": "Lwag",
      "helpful_votes": 0,
      "publication_date": 20200417
    },
    {
      "title": "Good lotion, bad bottle",
      "text": "The lotion is fabulous, however it is almost impossible to get it out of the bottle. The lotion is so thick it won't go through the pump, so the only way to get it out of the bottle is to take off the cap and pound on the bottom. Perhaps they could switch to a different type of bottle? Sad because the lotion is so wonderful.",
      "rating": 3.0,
      "verified": true,
      "author": "Chris Shaw",
      "helpful_votes": 0,
      "publication_date": 20180429
    },
    {
      "title": "Works well, Smells gross",
      "text": "This goes on smooth and absorbs quickly, it does a good job moisturizing. But I cannot stand the smell. It’s nauseauting. Sort of sweet and bubblegum scented and gets on my clothes and just grosses me out all day. My husband can’t stand it either and says it gives him a headache. Also the ingredients aren’t as natural as I hoped, although that’s my fault for not checking before buying.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190108
    },
    {
      "title": "smells great!",
      "text": "I bought this hoping that it was like my old hemp lotion for sunburns. But its not but it still smells amazing and makes skin soft. And it didn't irritate the sunburn or make it hurt more so I guess it worked kind of.",
      "rating": 5.0,
      "verified": true,
      "author": "ALYSON Havener",
      "helpful_votes": 0,
      "publication_date": 20200820
    },
    {
      "title": "Lovely scent, smooth skin!’",
      "text": "It’s Hempz, need I say more? Just in case . . . I love this lotion! It’s so hydrating and the the smoothness lasts for hours. Non-greasy, pleasant scent! Completely replaces my other scented lotion collection. Buy it!!!",
      "rating": 5.0,
      "verified": true,
      "author": "April Beal",
      "helpful_votes": 0,
      "publication_date": 20200605
    },
    {
      "title": "its the worst quality lotion i have ever used",
      "text": "in order to have your skin moisturized with this \"cbd\" infused moisturizer you would literally have to apply it on you skin every 30 minutes very poor quality, unfortunately i got 3 different scents so im stuck with a kilo of moisturiser that has no use",
      "rating": 1.0,
      "verified": true,
      "author": "Miki",
      "helpful_votes": 0,
      "publication_date": 20190511
    },
    {
      "title": "Best non-oily lotion I've found yet!",
      "text": "I'm normally not a huge fan of lotion since it makes my skin oily. But this lotion doesnt, it smells amazing, and it's actually quite calming. I feel my body relax every time I use it. I started with the trial bottle which influenced me to buy this big bottle!",
      "rating": 5.0,
      "verified": true,
      "author": "Wendy Conway",
      "helpful_votes": 0,
      "publication_date": 20200814
    },
    {
      "title": "Hemps feels like the best natural moisturizer available",
      "text": "I just had to try the Asian Pear after buying the pumpkin spice Chau here. I love this product, it's great every time you moisturize, so soluble and the feels wonderful. And it lasts on the skin. I love the Asian Pear scent too. I definitely want to try Pomegranate next.",
      "rating": 5.0,
      "verified": true,
      "author": "iloveadeal",
      "helpful_votes": 0,
      "publication_date": 20180827
    },
    {
      "title": "Makes you feel smooth, and smell so good",
      "text": "This Hempz lotion leaves a nice smooth feel to your skin. It smells so much like a juicy pear, at perfect ripeness. Mmm I love it. However, took off a star because it seems to go rapidly (compared to store bought brands).",
      "rating": 4.0,
      "verified": true,
      "author": "My Amazon Prime ",
      "helpful_votes": 0,
      "publication_date": 20190720
    },
    {
      "title": "Love it!",
      "text": "I love it! Ever since i startled using it my face has been started to clear up and my acne is less noticeable.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191129
    },
    {
      "title": "Relaxing Scent",
      "text": "Wow, this is the first Hempz moisturizer/lotion I have used and the smell is absolutely amazing. It has a very relaxing scent that I can't get enough of. I have to say that this lotion really keeps my hands soft longer than any other lotion I have ever tried. For that reason alone I will definitely be buying more in the future.",
      "rating": 5.0,
      "verified": true,
      "author": "MelancholyFox",
      "helpful_votes": 0,
      "publication_date": 20181218
    },
    {
      "title": "Hempz is healing",
      "text": "I have used Hempz before and this is even better than I remember. I live in the desert so I need moisturizing 2x day. My thumbs get so dry they start peeling but nothing I have tried recently did any good. Applying a few drops over the day has healed them. I would highly recommend this product. Hemp oil is amazingly healing.",
      "rating": 5.0,
      "verified": true,
      "author": "QueenofCups",
      "helpful_votes": 0,
      "publication_date": 20200523
    },
    {
      "title": "Love this lotion and brand!",
      "text": "Smells lovely! My skin is so picky and dries out SO fast, so finding a lotion that lasts is EXTREMELY difficult for me! This one definitely is a top one for me!!! My hands feel way more moisturized and less dry for longer than normal, which is soooo nice!",
      "rating": 5.0,
      "verified": true,
      "author": "Jacquelyn",
      "helpful_votes": 0,
      "publication_date": 20201005
    },
    {
      "title": "Favorite moisturizer",
      "text": "I first found this body moisturizer at Marshall's and bought it mainly because of the ingredients (a lot of natural oils) and good scent. After using a whole bottle once, I just couldn't get enough of it's I bought more here on Amazon. I do recommend if you like a cream that leaves your skin with a very fresh scent and nice touch. Another good thing about this product is that it's not a heavy cream, it's rather light and extremely refreshing.",
      "rating": 5.0,
      "verified": true,
      "author": "Maria Ortega",
      "helpful_votes": 0,
      "publication_date": 20151129
    },
    {
      "title": "This is my favorite scent out of all of the Hempz lotions",
      "text": "This is my favorite scent out of all of the Hempz lotions. This is my new go to lotion for dry crackley hands in the winter time. I'll have to buy another one soon because all of my guests keep using it. I love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Jessy Dvorak",
      "helpful_votes": 0,
      "publication_date": 20180102
    },
    {
      "title": "Hempz is a great product. I have very sensitive skin and usually ...",
      "text": "Hempz is a great product. I have very sensitive skin and usually need to avoid scented lotions. But, with Hempz I can still enjoy a soft scent without the repercussions. Excellent for people with sensitive skin who still want to enjoy a scented product.",
      "rating": 4.0,
      "verified": true,
      "author": "lilmargy",
      "helpful_votes": 0,
      "publication_date": 20170417
    },
    {
      "title": "Very moisturizing",
      "text": "Bought this for my wife who suffers from horribly dry skin. She really likes it and says it's very moisturizing. It does need to be applied more often than some but we would purchase it again.",
      "rating": 4.0,
      "verified": true,
      "author": "William Holley",
      "helpful_votes": 0,
      "publication_date": 20200424
    },
    {
      "title": "Fantastic Moisterizer",
      "text": "Best skin lotion I've ever purchased. Great scent and feels fantastic on the skin. At a local store it sells for $26.00. Almost double the price. As far I can tell it's the real thing.",
      "rating": 5.0,
      "verified": true,
      "author": "Go4it",
      "helpful_votes": 0,
      "publication_date": 20180620
    },
    {
      "title": "Awesome scent",
      "text": "I love the Hempz lotions. They all help smooth my bumpy skin out. Everyone I've tried smells amazing. My husband loves how this one smells. I would definitely buy it again.",
      "rating": 5.0,
      "verified": true,
      "author": "Kat",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "My new favorite!",
      "text": "Every time I wear this lotion I get compliments on smelling good. I love the scent and it works really well. I’ll wake up the next day and my skin will still feel soft! I always have extremely dry skin and this is by far my favorite lotion. I will continue to buy!",
      "rating": 5.0,
      "verified": true,
      "author": "Kiki",
      "helpful_votes": 0,
      "publication_date": 20180622
    },
    {
      "title": "Very moisturizing, not the best scent",
      "text": "Love the moisturizer, not crazy about the scent. Luckily the scent is not too strong. Very moisturizing for the dry winter months when skin is itchy.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen",
      "helpful_votes": 0,
      "publication_date": 20200105
    }
  ],
  "product_meta": {
    "title": "Exotic, Natural Herbal Body Moisturizer with Pure Hemp Seed Oil, Green Tea and Asian Pear, 17 Fluid Ounce - Pure, Nourishing Vegan Skin Lotion for Dryness and Flaking with Acai and Goji Berry",
    "description": "Size:17 Fl Oz (Pack of 1)Hempz Exotic green Tea & Asian pear herbal Body Moisturizer, Hempz Exotic green Tea & Asian pear herbal Body Moisturizer helps skin feel refreshed, revitalized and balanced. Enriched with 100% pure Natural Hemp Seed Oil. Paraben-free, gluten-free, 100% vegan, THC-free.",
    "rating": 4.7,
    "feature_bullets": [
      "EXOTIC AND EXCITING: This luxurious body cream is scented with Green Tea and Pears, which will leave an alluring, romantic aroma on your skin. The smell is not too heavy, and since it contains no harsh chemicals, it will leave behind no residue.",
      "REVITALIZE YOUR SKIN: Acai Berry and Goji Berry combine with an essential extract blend that will balance, revitalize, and refresh your body from head to toe. It will help stimulate skin with anti-inflammatory properties and regenerating ingredients.",
      "ENRICHED MOISTURIZER: Our exotic lotions contain Vitamins A, C, E, and B5, which will protect your skin from natural and environmentally triggered oxidants and elements. Your skin will feel nourished and healthy with these rich, conditioning creams.",
      "NATURAL INGREDIENTS, NATURAL RESULTS: Hempz moisturizers contain no parabens, gluten, and are THC-free. They are 100% Pure Natural Hemp Seed Oil, and they are 100% Vegan. Alleviate eczema, winter drying, flaking, and dry hands and feet.",
      "EXPERIENCE THE BENEFITS OF HEMP SEEDS: 100% Natural Hemp Seed Oil is rich in omega-6 and omega-3 fatty acids, enabling it to reduce inflammation, soothe atopic dermatitis, and limit oil production, so your skin will look and feel extraordinary."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "1.5 x 3.25 x 7.5 inches; 1.06 Pounds",
      "Item model number": "110-2169-03",
      "UPC": "676280020634 676280100534",
      "Manufacturer": "HEMPZ",
      "ASIN": "B00JJWYHBI",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Moisturizers",
      "Skin Care",
      "Body",
      "Beauty & Personal Care",
      "Lotions"
    ],
    "price": 13.16
  }
}