{
  "website_summaries": [
    {
      "verdict": "It's limited to the types of pills it will cut, but if you take the kind that will fit, chances are you will be pleased with the results and effectiveness.",
      "pros": [
        "Offers a state-of-the-art design that splits 7 pills at a time",
        "Patented, multi-pill blade",
        "Earns praise for producing precise cuts",
        "Has a blade guard for added protection",
        "Lifetime warranty"
      ],
      "cons": [
        "Doesn't work with all types of pills – only suited for round and oval shapes",
        "Not for large pills",
        "Comes with a learning curve",
        "Pricey"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Five Stars",
      "text": "Works great. Better than hoped. A picture is worth a thousand words.",
      "rating": 5.0,
      "verified": true,
      "author": "Don",
      "helpful_votes": 454,
      "publication_date": 20150531
    },
    {
      "title": "Stopped working after a few months",
      "text": "It worked well for a couple of months but now no longer splits pills in half. It seems to be cutting down at an angle. I end up with a large and small half. I can make two over-sized quarters out of the large half. I can cut about 1/3 of off of the small half and end up with what I'm estimating is about 1/4. I'm pressing down in the middle as directed. Unfortunate to have spend $30 on something that got only a few months of use.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 60,
      "publication_date": 20180430
    },
    {
      "title": "which had the worst result -Second with only 2 pills",
      "text": "See pictures. This cutter smashes the pills leaving the halves unusable. I tried three different times: -First with as many pills as would fit, which had the worst result -Second with only 2 pills, which resulted in a better cut but still smashed the bottom side affecting the dosage size -Third with 4 pills, which had the same result as 2 (smashed the bottom side)",
      "rating": 1.0,
      "verified": true,
      "author": "JohnC",
      "helpful_votes": 244,
      "publication_date": 20160701
    },
    {
      "title": "Better than expected.",
      "text": "Better than I had expected. Both my wife and I have to split multiple pills daily...so our weekly filling of our pill boxes was a pain using 1 pill at a time cutters. This takes 1/6th the time and does a better job halving the pills. Plus, I can easy handle it with one hand (as my other is stroke damaged.)",
      "rating": 5.0,
      "verified": true,
      "author": "Paul Hoffman",
      "helpful_votes": 155,
      "publication_date": 20140612
    },
    {
      "title": "Best Pill Cutter On The Market!",
      "text": "I hate to split a quantity of pills, one at a time. This device has made it so easy. Now, I can accurately split 10 or more pills at once. I love it and highly recommend! Best purchase I have made in quite some time. ***UPDATE*** I have been using this pill cutter since June 2014 and it still works as well as the day I started using it. This pill cutter is the best of the best! Also, I love supporting a company that is proudly USA based!",
      "rating": 5.0,
      "verified": true,
      "author": "Hunter",
      "helpful_votes": 123,
      "publication_date": 20140602
    },
    {
      "title": "Great pill splitter",
      "text": "Absolutely love this pill splitter. I need to cut a tiny pill in half each day.... This splitter has taken the frustration out of that task. Not only does it split the pill exactly in half with little effort, it also cuts multiple pills so I can split 10+ pills at one time. Thank you for a great product!",
      "rating": 5.0,
      "verified": true,
      "author": "Hatsl",
      "helpful_votes": 30,
      "publication_date": 20160618
    },
    {
      "title": "Didn't split MY pills.",
      "text": "First it's over priced. I had so much hope but it didn't work for me. Works fine for completely round pills I guess, but not for oblong of very small odd shape pills. You spend to much time positioning each pill, only to see them move when the spring loaded sides throw them off center. Maybe this cutter need to be redesigned so as to keep odd shape pills in position for cutting. Maybe groves in the \"side rails\". I'll keep it for future use, but for now, back to cutting one pill at a time. Bummer. One size don't fit all.",
      "rating": 1.0,
      "verified": true,
      "author": "Listen to ME",
      "helpful_votes": 18,
      "publication_date": 20170518
    },
    {
      "title": "It really works!",
      "text": "I was skeptical but it really works! I have to cut two of my cat's pill in half and the other in quarters and she gets them twice a day - so it's a lot of pills to cut. This saves so much time! You have to hold open the sides and line up the pills, but that's not too much work. The pills slide right out the ends of the unit after being cut. To cut a pill in quarters, you first cut them in half and then put them back in but their cut side down. Works great.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristin Pitt",
      "helpful_votes": 18,
      "publication_date": 20170312
    },
    {
      "title": "What a flop, not one came out in half.",
      "text": "Well I always wait for a while before I send in a review. So as soon as I got it ,I tried it. Read some reviews and someone said try just four pills, so I did. Flop. The pills were not slit in half. So put in six pills, another flop. Put them all in the center of the pill splitter . No matter what I tried one may have slit in half. So not impressed with this splitter at all.",
      "rating": 1.0,
      "verified": true,
      "author": "aceman1946",
      "helpful_votes": 6,
      "publication_date": 20190530
    },
    {
      "title": "Waste of money",
      "text": "I purchased this based off of other reviews I've read and was hopeful that I found a pill cutter that could accurately cut pills in equal halves. This was not the case. I felt that it was difficult to use. If your pills are anything other than round, they don't hold well in place. On several occasions, my oval meds popped out and flew across the room. When I did get them to stay in, the cuts weren't even. I'd have larger halves and smaller halves. If I attempted to quarter pills, they just got crushed. I have a $2 pill cutter I got from Walmart that perfoms slightly better. For $30, I expected much more.",
      "rating": 1.0,
      "verified": true,
      "author": "Stephen Thompson",
      "helpful_votes": 4,
      "publication_date": 20200305
    },
    {
      "title": "Will split several pills at once  (time saver)",
      "text": "Great little gadget ... will split 8 or 9 of the tablets I take at once. Does a good job; none are crushed, they are all evenly divided, works great. The particular pills I use this with come as a 90 day supply (90 pills). SO much easier to do the splitting 10 times, rather than having to do it 90 times. Takes me 5 minutes, rather than half an hour (or more), and so far, I haven't had any pills crushed or splintered.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 6,
      "publication_date": 20190608
    },
    {
      "title": "Waste of eveything",
      "text": "Takes a super-long time to arrange your pills in a row. The blade shatters any more than 1-2 pills instead of cutting them, defeating the whole purpose of cutting muliples at once. Forget cutting pills into quarters; the arms just push the pills out of their orientation to cut them at the wrong angle. You spend ten times the amount of time arranging the pills for multiple cuts versus just doing it one at a time. Get a cheap one with a single slot. This is a huge waste of money and time.",
      "rating": 1.0,
      "verified": true,
      "author": "Maggie Fisher",
      "helpful_votes": 3,
      "publication_date": 20191104
    },
    {
      "title": "With some trial and error I have found that pressing lightly and quickly does the best job of splitting the pill evenly and without crumbling",
      "text": "I usually cut one at a time just in case. With some trial and error I have found that pressing lightly and quickly does the best job of splitting the pill evenly and without crumbling. My initial attempts were to press it very hard, thinking the force would help cut, but it was what was causing the crumbling and uneven split.",
      "rating": 5.0,
      "verified": true,
      "author": "a reviewer",
      "helpful_votes": 8,
      "publication_date": 20170914
    },
    {
      "title": "Don't use for Xylimelts",
      "text": "I wanted to like this pill splitter, truly I did. I was using it for cutting a largish round tablet (Xylimelts) and was getting less than stellar results with a conventional pill cutter. However, the results with this were terrible - almost 50% of the pills were getting crushed, not cut. Definitely not worth almost $30 with that outcome. Perhaps it works better on pills that are more traditional and don't have a second material on the bottom.",
      "rating": 1.0,
      "verified": true,
      "author": "Serendipity",
      "helpful_votes": 6,
      "publication_date": 20180326
    },
    {
      "title": "does perfect quarter cuts",
      "text": "We got these tiny round prescription pills for the dog which need to be cut into quarters. I did it with an extremely sharp thin bladed knife for a couple of days. Very slow and frustrating. This machine just arrived today and we now already have a 2 week supply of quartered pills. Works fast. In order to get the second cut you have to turn the pills 90 degrees, which is a bit of a pain. A toothpick was handy for that.",
      "rating": 5.0,
      "verified": true,
      "author": "Burgman",
      "helpful_votes": 3,
      "publication_date": 20180826
    },
    {
      "title": "After using it just one time it was well worth the purchase.",
      "text": "Before I got this blue multi-pill splitter I hate splitting my pills pill by pill just to have most of them break or be split very unevenly. The cheap clear splitter also creates a lot of dust and is very time consuming. My time is very valuable to me and this blue multi-pill splitter is very quick and saves a ton of time, The cuts are much more accurate and much less messy. I split enough pills to fill a whole bottle so they will last a very long time. If you like to save time and avaoid wasting pills and a dusty mess than the price is worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "Greg Martin",
      "helpful_votes": 0,
      "publication_date": 20200317
    },
    {
      "title": "Quarters pill to cat sized wafers",
      "text": "My highest recommendation. We needed to cut 2.5 mg prednisolone pills into quarters to keep our cat's asthma under control. If you've tried quartering pills with a knife of any sort (even an Exacto knife) you may have found it just doesn't work well. You mostly end up with crumbs. However, on the first attempt with this cutter, I was able to cut these small, oblong pills into half, and then into quarters smoothly and quickly. Just follow the instructions about quartering oblong pills. The wafer seemed to be less of a problem to the cat than the pointy chunks we'd been asking her to swallow. And that's all that matters . . .",
      "rating": 5.0,
      "verified": true,
      "author": "Keith M Linkous",
      "helpful_votes": 0,
      "publication_date": 20191207
    },
    {
      "title": "Very Easy, Very Convenient",
      "text": "Extremely easy to use, didn't even need the instructions. Cuts SEVEN of my thickest/hardest pills to cut. It's fast and cuts pills evenly in half. Just what I wanted. I hope it is durable enough to last.",
      "rating": 5.0,
      "verified": true,
      "author": "Shawn R. Blackhurst",
      "helpful_votes": 3,
      "publication_date": 20200212
    },
    {
      "title": "Pricey, but worth it until someone can find a cheaper product.",
      "text": "First off it is super expensive, but it works better then any other splitter I have purchased. I bought mine for small pills that normally turn to powder when cut with a single blade splitter. Even the most powdery pills cut “better” then any other pill splitter I have previously purchased. The only negative is that if the pills are super small getting them out can be a challenge because they can fall into the small holes of the splitter and if I line up 15 small pills maybe 1 out of the 15 is slightly destroyed. If you can afford the cost it is worth it though.",
      "rating": 5.0,
      "verified": true,
      "author": "James Morris",
      "helpful_votes": 0,
      "publication_date": 20200310
    },
    {
      "title": "perfect for cutting pills in half",
      "text": "outstanding for splitting multiple circle shaped pills at once. Not so much for oblong pills. I split 11 pills at once, all were perfect except for the one at the very end of the row. The blade comes straight down like a guillotine instead of closing like scissors in traditional pill splitters. Comes up short when quartering pills, but sometimes its just easier to break the half pills in half by hand. do not yet now how long the blade will last. I'd be willing to pay triple the price for a carbide, ceramic, or other type of blade that wont dull with multiple uses.",
      "rating": 5.0,
      "verified": true,
      "author": "dmgdvm",
      "helpful_votes": 0,
      "publication_date": 20180508
    },
    {
      "title": "Great time saver",
      "text": "If you have a lot of pills to split, this is the splitter to buy. I have some small ones and this device will split about 12 at a time. The mechanism has a genius design that lines the pills up fairly automatically and then easily splits them by pressing down on the top of the device. My only complaint is the price. I think it is worth about $15, but sells for twice that. I do, however, appreciate the design work that went into creating this product and am ok with what I paid.",
      "rating": 5.0,
      "verified": true,
      "author": "Ken Frechman",
      "helpful_votes": 0,
      "publication_date": 20181026
    },
    {
      "title": "this is a must for splitting pills.",
      "text": "The first time I tried to cut 3 pills in half I couldn't get the pills to stay straight. I got frustrated and boxed the splitter up and was going to return it. After settling down I looked over the box and decided to try splitting 7 pills. it worked perfect! I split a bottle of 90 pills in record time with no issues (no messed up pills). I have used it 3 or 4 times since getting it and I would say its the best pill splitter on the market. I would definitely recommend buying this pill splitter.",
      "rating": 5.0,
      "verified": true,
      "author": "Greggs",
      "helpful_votes": 0,
      "publication_date": 20190809
    },
    {
      "title": "Totally worth the priceQ",
      "text": "Don't hesitate to buy this pill splitter. I was a little hesitant because of the price. I am so glad I decided to give it a try. This pill splitter is amazing! Cutting a pill in half is so easy and they are cut evenly. Cutting a round pill into quarters has been a nightmare for me. With this device, I put the halves back in the splitter and it quarters them and they are cut evenly. It is a real time saver. I highly recommend this pill splitter.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathy A.",
      "helpful_votes": 2,
      "publication_date": 20170724
    },
    {
      "title": "Just spend the extra bucks to get something that works right.",
      "text": "Excellent product. I had been spending $7-8 a pop at drug stores getting pill splitters. Some would work well for a few weeks then start crushing the pills. Others never worked right. Finally decided to pay more to test this one out. Tried three pills at first, no problem, then 8, clean cuts on all pills. I loved the fact that it worked without having to be concerned about lining up the pill score marks! Just spend the extra bucks to get something that works right.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Lewis Tippett",
      "helpful_votes": 3,
      "publication_date": 20170202
    },
    {
      "title": "It really works",
      "text": "For years I have purchased pill splitters and for years have been disappointed at the outcome. This item, however, really works. I took it to my pharmacist who was similarly impressed and I could see in his eyes the thought process beginning of how he could stock them and how much to charge. 4 rather than 5 stars only because the price seemed a bit high. And a suggestion: use two hands and push decisively - the outcome is perfect each time. Don't overload it - maybe 8 or 9 max. I'd recommend it to a friend - and did.",
      "rating": 4.0,
      "verified": true,
      "author": "insurance guy",
      "helpful_votes": 0,
      "publication_date": 20190103
    },
    {
      "title": "Quarterers Rejoice",
      "text": "Just received this unit and whipped through 60+ quarters and it did the job very well. My gripes are minor and the efficiency is undeniable - for small round pills in my case. I've been dealing with the highly rated single pill style splitters which start to jump as the blade dulls, causing the pill to jump out of the cutting zone 9 times out of 10 - *incredibly* frustrating. This unit doesn't do that, full stop. Tip: a good pair of tweezers goes a long way when quartering. Will update as it ages.",
      "rating": 4.0,
      "verified": true,
      "author": "Ian",
      "helpful_votes": 0,
      "publication_date": 20200626
    },
    {
      "title": "Best pill cutter ever!",
      "text": "I've been using mine for 4 years weekly. From day 1 till now it has done a perfect job of splitting a long row of pills into perfect halves (then quarters, if you turn them). No crumbling; very sharp and clean cuts. I've tried about a dozen other types before, mostly single pill at a time. This is really great for this purpose. Couldn't ask for more.",
      "rating": 5.0,
      "verified": true,
      "author": "Catherine",
      "helpful_votes": 0,
      "publication_date": 20200322
    },
    {
      "title": "Pricey but Works as Described with Practice",
      "text": "Does a good job of cutting multiple oblong and round pills. It does take a little getting used to to keep from making a cut that is smooth and even without chipping the pill. I found the best way to cut the pills is not a straight down action applying pressure to both ends if the cutter with a downward motion. I found that pressing down on one beginning the cutter and then pressing down on the other gave me the cuts I expected. I would have given it five stars if there were good instruction on the cutting process shipped with the cutter.",
      "rating": 4.0,
      "verified": true,
      "author": "Kasitrol",
      "helpful_votes": 0,
      "publication_date": 20190501
    },
    {
      "title": "Good for plitting mutiple pills in 2 but not quarters",
      "text": "I have an allergic cat that has to have a quarter of a tablet twice a day, so I feel I am cutting pills all the time. So I tried this to help cut multiples at once. It splits them great in half. Not so great if you need to split those in half - just crushes them. So at least I can use to split in half and then I use the standard pill cutter to finish into quarters. Takes some of the work away. Wish there was a better option out there to cut a pill into quarters easily for animals.",
      "rating": 4.0,
      "verified": true,
      "author": "PurpleCat",
      "helpful_votes": 0,
      "publication_date": 20200921
    },
    {
      "title": "A great multipill solution",
      "text": "I cut up a 90 day supply of pills, seven at a time in just a few minutes with no shattering/fragmentation. I guess the cleanliness of the cut depends somewhat on the pill itself but my pills were easy to cut without any problems - just a little powder. Very easy to use. My only complaint is that I wish it could do more pills at once! Recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "KingBoy",
      "helpful_votes": 0,
      "publication_date": 20190607
    },
    {
      "title": "Different cuts every time.",
      "text": "I need my pills to be a perfect split. I've had this thing for over a year, and typically get 60/40 splits, which I'm okay with. But now it's like 80/20, and I can't handle that. I'll see if I can tighten anything, but it's just never been that accurate.",
      "rating": 1.0,
      "verified": true,
      "author": "JackalSwitch",
      "helpful_votes": 5,
      "publication_date": 20180112
    },
    {
      "title": "7 Months of Use",
      "text": "Honestly, this pill splitter is not worth the money. it feels cheap and it hardly ever evenly cuts a pill because the top part is too loose. For a patented product, you'd think they would have tighter manufacturing tolerances and use higher quality materials. If you buy this, do not expect to have an evenly split pill. Also, once you cut it in half, it's even harder to cut it into fourths. I have an easier time, and a more accurate result, literally cutting the pills myself with a sharp knife.",
      "rating": 2.0,
      "verified": true,
      "author": "Casper",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "Convenience outweighs accuracy",
      "text": "I have to split tiny human pills into quarters for my 10 pound cat. They crumble a little and quarter unevenly when I split them regardless of which splitter I use . I was extremely frustrated to split these tiny pills with my individual pill cutter. It took forever so I only lasted through about 4 pills each sitting - 8 days worth. Using this multiple pill splitter didn't improve the accuracy with these tiny crumbly pills but it was so much easier I am much happier. I also split some pills into halves for my husband. They are not crumbly and they split evenly - a huge improvement in convenience over my prior single pill method.",
      "rating": 5.0,
      "verified": true,
      "author": "Unlikelyshopper",
      "helpful_votes": 0,
      "publication_date": 20190216
    },
    {
      "title": "The best we've tried!",
      "text": "This is the best pill splitter I have ever used. We use it to split 25mg Atenolol pills into fourths for our cat. These pills have a tendency to crumble instead of split, except with this splitter. While not every pill is exactly 1/4, the variation in size is minimal and we don't have the crumbling issue anymore. Way better than the single pill, guillotine style we were using. And they do multiple pills! Highly recommended, would buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Halloran",
      "helpful_votes": 0,
      "publication_date": 20200429
    },
    {
      "title": "Quick and easy.",
      "text": "Nicely surprised by this cutter. I can cut a months worth of pills on a couple of minutes. You don't even have to have the cut line on the pills even with the blade. Only problem is the 'walls' of the device that hold the pills in place may snap close while loading it, sending pills flying. Just load the first and ease the walls into place, then stick the rest in.",
      "rating": 5.0,
      "verified": true,
      "author": "Jon E D",
      "helpful_votes": 2,
      "publication_date": 20191224
    },
    {
      "title": "Amazing Feature",
      "text": "This product has an amazing feature. Every pill splitter I've ever seen up to now requires that you very carefully align the pill exactly with the blade so you cut it in half. If you're off a tiny bit (quite likely if your eyesight is less than perfect) you get two unequal pieces. With this product all you have to do is put the pills (all of the same size) inside. You don't have to align them (or put them face up, or pay attention to the scoring marks). The design causes the spitter to \"know\" where the center is. Just follow the instructions. Halved pills can be quartered just as easily. Again, follow the instructions.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "Doesn't cut in 50/50 halves",
      "text": "I bought this because i needed to cut a lot of pills for my father in very precise 50/50 halves. Unfortunately, this cuts the pills in 60/40 pieces, or maybe even 70/30. It cuts the same each time, with the pieces on the bottom being much smaller than the pieces on top, which most likely means the blade just isn't installed straight. I contacted the seller last week and they never responded. Pity, had the potential to be a good product.",
      "rating": 1.0,
      "verified": true,
      "author": "AT",
      "helpful_votes": 0,
      "publication_date": 20200904
    },
    {
      "title": "Worth it!",
      "text": "I was hesitant due to the price, but sooo glad I bought this thing. It’s fast and splits down the middle every time! Make sure you have all the pills straight. If you place your pills crooked, it will cut it down the middle at that crooked angle. However, it is easy to keep the pills centered. It has two guide bars, under tension, which hold the pills in place.",
      "rating": 5.0,
      "verified": true,
      "author": "Antonio G. Perez",
      "helpful_votes": 0,
      "publication_date": 20200214
    },
    {
      "title": "Cuts hugely off-center (about a third of the pills come ...",
      "text": "Cuts hugely off-center (about a third of the pills come out closer to 10/90 splits than 50/50 splits) without practiced and well-planned effort, which is absurd considering the price.",
      "rating": 2.0,
      "verified": true,
      "author": " ​",
      "helpful_votes": 3,
      "publication_date": 20180908
    },
    {
      "title": "A great product",
      "text": "This multi-pill cutter does a great job overall. Accuracy could be a bit better when splitting pills, and arranging pill halves (in order to make quarter-size pieces) takes a little patience, with even less accuracy. Still, overall, it does a great job and saves a LOT of time!",
      "rating": 4.0,
      "verified": true,
      "author": "Pianophile",
      "helpful_votes": 0,
      "publication_date": 20191213
    },
    {
      "title": "Amazing. Wish I had it earlier!",
      "text": "I have a couple of medications I have to split every day. The pill cutter I got from the hospital never closed correctly, and would leave one of the medications in multiple uneven pieces. I tried this with 8-10 pills at a time. Perfect cuts down the middle, no random extra pieces broken off. Never going back to a regular pill cutter!!",
      "rating": 5.0,
      "verified": true,
      "author": "philosophress",
      "helpful_votes": 0,
      "publication_date": 20190213
    },
    {
      "title": "Doesn't cut on center",
      "text": "I had to cut some levothyroxine pills, and while this cutter was better than the $10 one i bought at wallgreens - it doesn't cut those pills evenly. It hasn't broken any, but the cut is always to the side of the center line, and not exactly straight. I tried 1 pill at a time, and 5 pills at a time, and anything in between. Maybe the blade isn't centered? I don't know, all i know is that i always had to keep track of which halves go with which so that i at least got the right dose over 2 days, and that's just tiring.",
      "rating": 3.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 0,
      "publication_date": 20171204
    },
    {
      "title": "works great!.",
      "text": "works great!... Even on pills that used to crumble on me most of the time when using my old splitter. seems very sturdy and if the splitting knife holds up, is well worth the money! Get quality precise cuts every time doing halves ... Have not done quarters, and have no need.",
      "rating": 5.0,
      "verified": true,
      "author": "Herb",
      "helpful_votes": 2,
      "publication_date": 20180729
    },
    {
      "title": "Good with flaws",
      "text": "I'd say this is the best I've come across so far for cutting multiple pills at a time, but it is a bit tricky (and time consuming) to use if the pills aren't round, and there is one major design flaw (see photo). 1/2 of a cut pill fell into one of the holes and I tried everything to get it out, with no luck. Ultimately, I had to crush the pill in order to remove it; otherwise the unit was non-functional.",
      "rating": 3.0,
      "verified": true,
      "author": "Christine",
      "helpful_votes": 6,
      "publication_date": 20160703
    },
    {
      "title": "Sharp blade!!",
      "text": "Very nice cutter!! I have had several other pill cutters but were not pleased with them. This one, however, is so easy to use, has a very sharp blade and has a top that covers the pills as they are being cut. You cut pills can just slide out the end and into your container. The adjustable bars hold the pills in place so they are secure - this enables the pills to be cut with more accuracy.",
      "rating": 5.0,
      "verified": true,
      "author": "Gloria",
      "helpful_votes": 0,
      "publication_date": 20200301
    },
    {
      "title": "Great pill splitter for small pills",
      "text": "I am a Home Care Nurse and have a patient how needs numerous pills split every week. This patient has several very small pills that need to be split and this splitter works perfectly for that. They are split evenly and don't crumble like they did when splitting one at a time. This splitter won't split large caplets thou.",
      "rating": 5.0,
      "verified": true,
      "author": "Norma Clines",
      "helpful_votes": 0,
      "publication_date": 20200427
    },
    {
      "title": "I like this",
      "text": "This does a really good job of cleanly splitting a number of pills at once, even into quarters. I dinged it one star because small pills are a bit tricky--instructions say to adjust the \"walls\" of the track so that they cover the holes, but because of the spring loaded closure, I have to hold the tracks at least till I've lined up a couple of pills. Not a huge deal, but not quite 5-stars.",
      "rating": 4.0,
      "verified": true,
      "author": "Jogging Grandma",
      "helpful_votes": 0,
      "publication_date": 20191124
    },
    {
      "title": "Not easy to use",
      "text": "It is very hard to use with multiple pills. If you can to cut a pill into several peaces, by the time you are done, all you got left is powder. Also, the cut pills could fall into the holes on the side. I would rather use the simpler, one blade cutters. You have more control with them. But if you have to cut several pills at a time, this would work, as long as you learn how to really use it.",
      "rating": 3.0,
      "verified": true,
      "author": "MOSTER",
      "helpful_votes": 0,
      "publication_date": 20190210
    },
    {
      "title": "Excellent product!",
      "text": "I've used multiple cutters, and they are all time consuming and/or leave a ton of crumbs or powder. This product is very precise and leaves minimal residue, ensuring that you are getting an accurate dose. **Note** it does seem to work better with the maximum pills that you can fit vs just one or 2. The last time I had to cut my Dad's pills, it took me almost 2 hours. With this, we were done in under 10 minutes. So worth the extra $$.",
      "rating": 5.0,
      "verified": true,
      "author": "DBS",
      "helpful_votes": 0,
      "publication_date": 20190430
    },
    {
      "title": "Best cutter, especially for tiny pills",
      "text": "The best splitter I have ever used. Very clean, exact cuts on all pills. The only problem I ever had was that some of my very soft aspirin were crushed a little. Many at once makes cutting a whole bottle ful a snap.",
      "rating": 5.0,
      "verified": true,
      "author": "Allan R.",
      "helpful_votes": 0,
      "publication_date": 20200124
    },
    {
      "title": "Not close to accurate",
      "text": "Just used this tonight and it did a terrible job splitting my pills. Out of 7 pills, it split 3 accurately but the other 4 were very far off.....one “half” was a sliver and the rest of the pill was huge. I had better results using the cheap splitter from the pharmacy. Very disappointed and would like to return it.",
      "rating": 1.0,
      "verified": true,
      "author": "LoveTo Read",
      "helpful_votes": 0,
      "publication_date": 20190921
    },
    {
      "title": "A $30 pill splitter?  I was VERY skeptical, but it works like a charm!",
      "text": "I used this on non-scored tablets (I know I know) and it works perfectly. Super easy, very clean, cuts perfectly. In fact its so easy I went in and chopped about 200 tablets just so I wouldn't have to do it daily and it cuts as clean on the 200th that it did on the first. I little wipe with a cloth on the blade (be careful its REALLY sharp) and it should last forever.",
      "rating": 5.0,
      "verified": true,
      "author": "Mitch Langley",
      "helpful_votes": 0,
      "publication_date": 20181016
    },
    {
      "title": "Best splitter I've used",
      "text": "Doing multiple pills at once a huge plus. Easy system to use, but don't press hard all at once. Rock and press gently, with increasing pressure. Helps to \"cut\" rather than split/splinter pills.",
      "rating": 4.0,
      "verified": true,
      "author": "Dean F.",
      "helpful_votes": 0,
      "publication_date": 20200811
    },
    {
      "title": "Useless Pill Cutter",
      "text": "Do not buy this pill cutter. The concept is great but the execution is unacceptable. The round pills I cut were average in size and many were shattered into a wide array of sizes, few of which were the halves I needed. Trying to do quarter sizes was even worse and I ended up with a lot of powder. Most of my pills were ruined and had to be thrown out. At least the cheap pill cutters cut a pill in half. I will resign myself to going back to cutting one pill at a time with a standard pill cutter. The $29.99 I spent on this cutter was a complete waste of my time and money.",
      "rating": 1.0,
      "verified": true,
      "author": "S. McDonald",
      "helpful_votes": 0,
      "publication_date": 20190619
    },
    {
      "title": "Great for pets.",
      "text": "Splitting pills is easy in batches with this. We do a large quantity of pills for our pets, and this makes it a snap. I can’t say if it would be good on human medications, as the pills sometimes crumble a bit, but I’m not sure if that is due to the pills being very small in the first place (and manufactured to animal standards), or due to the blade not being sharp enough, but it is very minor.",
      "rating": 5.0,
      "verified": true,
      "author": "Plainshow",
      "helpful_votes": 0,
      "publication_date": 20200826
    },
    {
      "title": "only marginally effective",
      "text": "while this splitter does a reasonably good job of halfting several pills, a time it is very expensive. This splitter is no more effective than splitters selling at a third the price. When it comes to quartering pills it fails miserably. Also there are holes in the splitter that the two rails ride on which some small pills fall into and then are difficult to remove",
      "rating": 3.0,
      "verified": true,
      "author": "donald",
      "helpful_votes": 0,
      "publication_date": 20190801
    },
    {
      "title": "4.5 stars",
      "text": "Cut a whole month of pills. Just have to apply strength evenly when cutting",
      "rating": 4.0,
      "verified": true,
      "author": "W. Tang",
      "helpful_votes": 3,
      "publication_date": 20170805
    },
    {
      "title": "It just works.",
      "text": "I have to take half of a tiny pill and my previous splitter often gave me some one day and a shaving of a pill the next. This one just puts them in a line and cuts them accurately with no fuss, no muss. SB",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200601
    },
    {
      "title": "Fantastic for cutting pills in half and in quarters!!!",
      "text": "I need to cut unscored pills in quarters for my dog. Asked the question here whether this thing would work and I got 7-8 responses that it would. They were right! When I cut pills with a knife, they were always uneven and lots of crumbly pieces. This thing is great! Cuts in quarters like a dream with very little crumbling or waste. It might be a little pricey but it's worth every nickel because it does the job right.",
      "rating": 5.0,
      "verified": true,
      "author": "B. Stirling",
      "helpful_votes": 0,
      "publication_date": 20180225
    },
    {
      "title": "This cutter is great!",
      "text": "You can split a whole pill bottle of any shape pills in just a few minutes. So far doesn't seem to smash pills like some of the other pill cutters I have used. Even cuts tiny pills with ease and you don't have a hard time digging them out of the V notch like other style pill cutters.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard Watson",
      "helpful_votes": 0,
      "publication_date": 20181118
    },
    {
      "title": "95% Accurate cut with round pills 100% accurate with oblong!!",
      "text": "Got new sets of pills from the VA. Was tired of cutting one at a time and turning them into dust with a single pill cutter. Received this afternoon and found that the round pre-scored pills would cut properly 95% of the time, 5% would split into 4 pieces...The oblong unscored pills cut 100% of the time with very little pill dust. I am really happy with this product!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Odie043",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "Great pill cutter especially if you need to cut several pills",
      "text": "We have to split pills for a daily medication and the cutter can easily do 7 pills at a time. Some reviews complain that this cutter 'crushes' the pills instead of cutting them. I've run into this on another medication so it really depends on what you have. I'm not sure how to tell which pills will work. I just know that it worked for one we cared about.",
      "rating": 5.0,
      "verified": true,
      "author": "Darren Schmidt",
      "helpful_votes": 0,
      "publication_date": 20191030
    },
    {
      "title": "Must have for pill cutting",
      "text": "Great cutter. I have been using this cutter for about 4 years and just got done cutting 100 pills in a couple of minutes and said \"I am glad I bought this\", so I thought I would do a quick rating. I have cut many different types and sizes of pills and it works really well. I have even cut small pills in 1/4's with no problems. I am sure there are some pills out there that are crumbly no matter what you use to cut them but I have been lucky and not had any.",
      "rating": 5.0,
      "verified": true,
      "author": "Cowboy J.",
      "helpful_votes": 0,
      "publication_date": 20180719
    },
    {
      "title": "Works great on round pills, good on odd-shaped ones",
      "text": "I use this pill splitter to split up to 4 pills at a time. It works great on round pills and can be made to work on the odd-shaped ones too with a little care. Owned for over a year and still working great. Hint to the manufacturers: Putting some serrations into the pill clamps would help it hold the odd-shaped ones better.",
      "rating": 5.0,
      "verified": true,
      "author": "Nathaniel Firethorn",
      "helpful_votes": 0,
      "publication_date": 20190916
    },
    {
      "title": "Made a time consuming job quick and easy",
      "text": "I have to split one of my meds, an oval shaped pill, in half. Doing it one pill at a time with a drug store pill splitter was slow and the two halves were usually slightly different sizes. With this device, I split about 8 pills simultaneously, and they were split exactly in two equal pieces. Fast and accurate!",
      "rating": 5.0,
      "verified": true,
      "author": "A. J. Dessler",
      "helpful_votes": 0,
      "publication_date": 20200516
    },
    {
      "title": "... time or 2 of using it to get the best results but it is so worth the money",
      "text": "Takes a time or 2 of using it to get the best results but it is so worth the money. My tiny pills are now split into 2 equal halves instead of maybe a half of one and some dust. Absolutely recommend it, especially for the small pills.",
      "rating": 5.0,
      "verified": true,
      "author": "Rose E. Williams",
      "helpful_votes": 2,
      "publication_date": 20180709
    },
    {
      "title": "Excellent multiple pill cutter!!",
      "text": "Love this multiple pill splitter. Saves me lots of time. The only thing in order to cut the pills evenly, you have to press with both hands in the center of the box..",
      "rating": 5.0,
      "verified": true,
      "author": "Nora Spencer",
      "helpful_votes": 0,
      "publication_date": 20200302
    },
    {
      "title": "but this is such a great improvement over the single pill cutters we've tried",
      "text": "Wow, but this is such a great improvement over the single pill cutters we've tried. The single splitters we tried crushed more than cut. I had better success with a sharp knife, but what a pain with small pills. This splitter cuts the pills much cleaner and saves a lot of time by cutting multiple pills at once.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark A. Boyd",
      "helpful_votes": 0,
      "publication_date": 20180626
    },
    {
      "title": "Inaccurate way to \"halve\" pills",
      "text": "Halves pills but not accurate. Pieces come out uneven. Had high hopes. Doctor says it really doesn't matter. The medication gets inside me anyway.",
      "rating": 2.0,
      "verified": true,
      "author": "Pamela Hepburn Fisk",
      "helpful_votes": 4,
      "publication_date": 20160921
    },
    {
      "title": "Almost perfect",
      "text": "Firstly, this works a lot better if you take the time to line up the scoring on the pills with the blade. The other minor problem I have noticed is that with pills that are circular and domed on the top and bottom, as opposed to flat, the pills tend to split slightly unevenly due to the plates holding it slightly askew from pressure. This only makes a noticeable difference when splitting smaller pills into quarters, but at that point even a slight discrepancy in size creates a proportionally large difference in dosage. Other than that it has been working fine. It cuts through several pills at once easily, though it does often leave a small amount of residual powder.",
      "rating": 4.0,
      "verified": true,
      "author": "D",
      "helpful_votes": 0,
      "publication_date": 20200716
    },
    {
      "title": "Stainless stell blade for those of us who know aluminun is so bad for our health!",
      "text": "Once I figured out how to open the tray and where to place the pill I wanted to split -- it was so easy I was ashamed to admit I couldn't figure it out quickly! It works perfectly. I am happy with the stainless steel blade, which I wanted and is the reason for paying so much more for this gadget. I can tuck it away easily. Just works perfectly every time. Don't have to position the pill according to the split line. Just pop it in, put the top on it, and press. That's all there is to it!",
      "rating": 5.0,
      "verified": true,
      "author": "Bujol",
      "helpful_votes": 0,
      "publication_date": 20180305
    },
    {
      "title": "The best I've tried yet!",
      "text": "I've been tried a large variety of pill cutters andI doubt I will ever find the perfect pill cutter. A perfect pill cut is also dependent on the density, grain and outer layer of the pill. With this cutter about 9 out of 10 pills are perfectly cut, which is better than the 2 out of 3 from my previous cutter.",
      "rating": 5.0,
      "verified": true,
      "author": "USMC Avionics Ret",
      "helpful_votes": 4,
      "publication_date": 20160810
    },
    {
      "title": "Not worth 30 bucks at all",
      "text": "Was very easy 2 use but when i did multiple pills it did not cut all of them evenly which is the only reason i spent 30 bucks on a pill cutter don't waste your money unless u don't care if your pills r exactly in half otherwise just get one for about 6 bucks and they work better",
      "rating": 1.0,
      "verified": true,
      "author": "Mateo titan fan #1",
      "helpful_votes": 0,
      "publication_date": 20190910
    },
    {
      "title": "Perfect tool",
      "text": "Right out of the box, I split 90 caplets, and it was perfect every time! No shatters, no crunchies, no waste. It was hard on my hands, because I sat in my chair and squeezed to activate the blade. It would have been much easier had I been sitting at the table. I was able to bisect 10 caplets every time. Perhaps the negative reviews were caused by more dense medication? I don’t know, but this splitter works perfectly for me and I am so pleased about it. I will definitely recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "VW",
      "helpful_votes": 0,
      "publication_date": 20180305
    },
    {
      "title": "I am actually pretty shocked by how good this is",
      "text": "There are some minor annoyances like some small crevices where cut pills can fall into (don't open the jaws all the way when removing pills), but I would still strongly recommend this on the quality and spacing of the cuts alone. It looks pretty cheap, but if you need to cut pills, this does the job incredibly well with consistent results.",
      "rating": 5.0,
      "verified": true,
      "author": "h steenstrup",
      "helpful_votes": 0,
      "publication_date": 20191109
    },
    {
      "title": "MUST HAVE! (if your cutting pills)",
      "text": "This is a life saver for us. We have a medical fragile child that we end up having to split about 60 pills a month for him. We cut through all 60 in minutes. The cuts are clean, quick, and has held up over the last 6 months flawlessly. This is a MUST have if you have to split your pills.",
      "rating": 5.0,
      "verified": true,
      "author": "anthony2823Top Contributor: Lego",
      "helpful_votes": 0,
      "publication_date": 20190125
    },
    {
      "title": "THE BEST EVER",
      "text": "If you have a single pill to split, use a regular pill splitter. The Multiple Pill Splitter is just that, it operates best when multiple pills are loaded and very even down force is applied suddenly. Works great and would recommend you practice applying the very even down force and apply the force strong and quickly. When done in this manner the pills are split very evenly.",
      "rating": 5.0,
      "verified": true,
      "author": "E. Daniel",
      "helpful_votes": 0,
      "publication_date": 20200429
    },
    {
      "title": "Still not perfect",
      "text": "I have tried this cutter several times but still not great. It does not always cut the pills in half. The pills are round, shiny and a little raised. I have tried several different pill cutters and nothing is perfect. This is the best I have tried so far but it is an expensive cutter, especially when you have to discard these expensive pills.",
      "rating": 3.0,
      "verified": true,
      "author": "Cheryl R.",
      "helpful_votes": 0,
      "publication_date": 20190226
    },
    {
      "title": "Not for very small Pills!",
      "text": "Where you place your pills between two bars there are slots just the size of my pills. It is possible to get the fallen pill out from the slot but very difficult. It would work for bigger pills that do not need to be cut on the indented line on the pill.",
      "rating": 1.0,
      "verified": true,
      "author": "W. Aher",
      "helpful_votes": 0,
      "publication_date": 20190730
    },
    {
      "title": "Off center split",
      "text": "Expensive, but if it worked, I could deal with that. The problem is that it is off center, so each use ends up with a 60/40 split of a pill, consistently.",
      "rating": 1.0,
      "verified": true,
      "author": "JK",
      "helpful_votes": 0,
      "publication_date": 20200529
    },
    {
      "title": "This pill splitter is awesome",
      "text": "I had been researching different pill cutters because the one I had did not cut evenly. I decided to take a chance on this one and I am so glad I did. Not only does it cut evenly, it cuts lots of pills at one time! One of my pills is very small and though I do have to make sure they are aligned correctly, it does a great job splitting them.",
      "rating": 5.0,
      "verified": true,
      "author": "Donna S.",
      "helpful_votes": 0,
      "publication_date": 20190209
    },
    {
      "title": "very good product for cutting small pills into halves and quarters",
      "text": "very good product for cutting small pills into halves and quarters. Took off a star for two reasons: 1.) If the pill is small enough you may accidentally drop one in the gaps that are exposed on the top while adjusting pills. 2.) It's not completely off center but pills are not cut right down the middle. You'll get cuts that are a little bit uneven.",
      "rating": 4.0,
      "verified": true,
      "author": "Nik",
      "helpful_votes": 0,
      "publication_date": 20180422
    },
    {
      "title": "Actually works well!",
      "text": "Works remarkably well. I was concerned given some of the reviews, so I space them out a little and that has worked for large and small. If the halves are real small they can get catch in the spring adjustment, so it takes a little work to get it out. It might take more force that an older person could muster to cut them. But the best option by far that I've seen.",
      "rating": 5.0,
      "verified": true,
      "author": "Rollin River",
      "helpful_votes": 0,
      "publication_date": 20171103
    },
    {
      "title": "Great product",
      "text": "Easy to use and very convenient. A bit bulkier than I expected so I had to be creative finding a place to store it in my full medicine cabinet. This product is patented and I believe it is the \"original\" design of a multiple pill splitting product. There are some cheaper knockoffs available on Amazon, but their reviews suggest they aren't as sturdy, reliable, or simple to use as this one. Worth the higher price.",
      "rating": 5.0,
      "verified": true,
      "author": "Morning",
      "helpful_votes": 0,
      "publication_date": 20190928
    },
    {
      "title": "Best engineered innovative device of any kind that I've ever bought.",
      "text": "Far and above the best engineered device of any kind that I've ever bought. This item cuts tiny pills perfectly into quarters, whereas all other cutters ended up destroying the pill. I can do one pill or 18 at once. No only protects the integrity of the pill but saves time. I think it is the most expensive one on the market, but I have made up the cost many time over by not having to throw away fragments of pills--and dosage is exact!",
      "rating": 5.0,
      "verified": true,
      "author": "DrDad",
      "helpful_votes": 0,
      "publication_date": 20180520
    },
    {
      "title": "excellent pill splitter",
      "text": "This is about the best pill splitter we have ever owned. The blade is ultra sharp and thin - meaning pills split with less breakage than you get with other types. It has a cam system that aligns the tablet and always centers them for you - ingenious. Does not take too much force to use - although you need to make sure to follow the instructions and apply even pressure across the top. We'll be ordering a few more to have on hand.",
      "rating": 5.0,
      "verified": true,
      "author": "FredK",
      "helpful_votes": 0,
      "publication_date": 20170514
    },
    {
      "title": "and I LOVE it. I was worried after reading some of ...",
      "text": "I've been using this for some time now, and I LOVE it. I was worried after reading some of the reviews, but I've had zero trouble splitting several pills perfectly in half in one go. I just pull the spring loaded parts apart with a finger on my left hand, pour 7 or 8 pills in the space and gently let the parts straighten them out and line them up. Then I just put the cutter top on, and give a firm, quick press. Voila! Pills cut perfectly in half.",
      "rating": 5.0,
      "verified": true,
      "author": "C. DEATON",
      "helpful_votes": 0,
      "publication_date": 20180128
    },
    {
      "title": "Difficult to load. Must press very hard",
      "text": "When you open it all the way so that it stays open, there are a lot of holes that the pills can drop into. It’s very difficult to load that way. It takes a little pressure to cut a full load of pills. Some people may not have the strength to do so. It’s not easy to clean the cutting knife.",
      "rating": 3.0,
      "verified": true,
      "author": "Big Billy",
      "helpful_votes": 0,
      "publication_date": 20190623
    },
    {
      "title": "Blade gets dull.",
      "text": "After about 5 uses, the blade gets dull enough to start leaving small pieces behind. The more you use it, the worse it gets. Would be good if you could change blades.",
      "rating": 1.0,
      "verified": true,
      "author": "Larry",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "cuts the uncuttable pills",
      "text": "I ordered this to split pills that seemed to be impossible to split unless you used a sharp corner of a table or something and that would hurt the fingers quickly. This does the job with little effort and a perfectly centered cut each time. Not only that, but I was able to cut 7 of these hard to split pills at once! It was getting to the point were I wasn't taking my medication because the hassle.",
      "rating": 5.0,
      "verified": true,
      "author": "J",
      "helpful_votes": 0,
      "publication_date": 20170723
    },
    {
      "title": "Works as advertised, does well",
      "text": "It is nice how it adjusts to the pill size ensuring it won't slip. Just be careful when loading smaller pills as you can send them flying. It works great! I was able to cut 15 pills in no time for my prescription and less mess than with knife.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie",
      "helpful_votes": 0,
      "publication_date": 20200915
    },
    {
      "title": "Easiest and best splitter I’ve ever used.",
      "text": "I bought this after returning the Equa-Dose. This pill splitter will hold the pills in place with a spring where most other ones require you to hold it in perfectly. With this one, you don’t even have to cut on the score. It cuts very nicely. Some wasted powder, but that’s the nature of splitting pills.",
      "rating": 5.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 0,
      "publication_date": 20190530
    },
    {
      "title": "Best splitter ever!",
      "text": "This is the best invention since sliced bread! I used this multiple splitter on 2 different-sized round pills. My first time to try it, I was able to split 40 pills in a short time. Saved me hours of time instead of using a single splitter. We have two prescriptions that require a half pill twice a day, morning and night, dispensed in quantities of 90 at each renewal. It is a sturdy product and easy to use. The halves are more equal than when using a single splitter. I'm happy I found this product!",
      "rating": 5.0,
      "verified": true,
      "author": "Delphine LD",
      "helpful_votes": 0,
      "publication_date": 20190726
    },
    {
      "title": "Perfectly split pills",
      "text": "I tried this with small, round pills. I started with one, then increase the number up until 9. It worked perfectly each time. It probably would have worked with 10 pills, but I ran out of pills for testing. I am very impressed with this product and can't understand the negative reviews. Highly recommend this product to perfectly cut multiple pills at once.",
      "rating": 5.0,
      "verified": true,
      "author": "Charles C Humphrey MD",
      "helpful_votes": 0,
      "publication_date": 20191117
    },
    {
      "title": "Works Well, although Sometimes Not Accurate",
      "text": "This is an innovative pill splitter. I like that it cuts multiple pills at a time and that it is easy to use. The only thing I didn't like is that it didn't always cut pills accurately, but it could be just my visual impairment that got in the way of lining them up correctly. It did meet my needs, as I needed to half and quarter some tablets for a taper off of some medications I was taking.",
      "rating": 4.0,
      "verified": true,
      "author": "Misty Dawn Bradley",
      "helpful_votes": 0,
      "publication_date": 20180927
    },
    {
      "title": "It works great, saves us the difficulty & hassle of splitting pills",
      "text": "What can I say, it actually works. Line up a bunch of pills, put the lid on, press down, and they're all cut in half. The tiny pills I'm cutting, it'll do probably 20 at a press - 1/2 morning and 1/2 evening, that's 20 days worth of pills. Pricey but it saves us the hassle of positioning & cutting one pill every day, and does a far better job than the hinged single pill cutter that just tends to shatter our dog's small pill.",
      "rating": 5.0,
      "verified": true,
      "author": "Sean W. Franklin",
      "helpful_votes": 0,
      "publication_date": 20170922
    },
    {
      "title": "Law mercy...where have you been all my life???",
      "text": "I was very skeptical while trying to cut tiny oblong pills, and then immediately turned and quarter them...Law mercy where have you been all my life?????? Worth every Penny....Go get one!!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Sunny Sprinkle",
      "helpful_votes": 0,
      "publication_date": 20200211
    },
    {
      "title": "OMG!  Great product!",
      "text": "OMG! I've used pill cutters before, but NEVER anything like this one. Wow! Normally the cut may or may not be dead-center, but almost always little tiny fragments chip off. But with this cutter, the cut is always absolutely, positively dead-center, and virtually no chipping or loss of debris. I am rarely this enthusiastic about a review, but this pill cutter is absolutely amazing!",
      "rating": 5.0,
      "verified": true,
      "author": "R.K.",
      "helpful_votes": 0,
      "publication_date": 20180606
    },
    {
      "title": "Not for me",
      "text": "Maybe it's the lack of good directions but 1) I would not use this for pills that absolutely have to be divided equally. Mine was just a vitamin so it didn't matter. 2) Confusing to use 3) wouldn't get another (as I had thought to do for another pill that needed exact cutting",
      "rating": 2.0,
      "verified": true,
      "author": "L",
      "helpful_votes": 2,
      "publication_date": 20180409
    },
    {
      "title": "EXCELLENT PRODUCT!!",
      "text": "FABULOUS! I've been using a 1 pill at a time cutter, and I have to cut 4 pills to get my daily dosages and it's a pain doing it one at a time. This works PERFECTLY, and IT DOES WORK ON RECTANGULAR pills!! Exact cut in half, both sides perfectly equal. EASY to use, I didn't even read any instructions. No more cutting 4 times.....1 time and I'm good for the day! Highly recommend this pill cutter.",
      "rating": 5.0,
      "verified": true,
      "author": "TLK",
      "helpful_votes": 0,
      "publication_date": 20180531
    }
  ],
  "product_meta": {
    "title": "Multiple Pill Splitter. Original Patented Design, with Accurate Pill Alignment, Sturdy Cutting Blade and Blade Guard, for Splitting and Quartering Round or Oblong Pills.US Patent No. 9,827,165.",
    "description": "Splits multiple pills in one operation;For use with round or oblong pills;Medical grade stainless steel cutting blade;Blade guard protects fingers;Splits halves of round or oblong pills into quarters",
    "rating": 4.4,
    "feature_bullets": [
      "Multiple Pill Splitter"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "4.8 x 2 x 2 inches; 4 Ounces",
      "Item model number": "PC100",
      "Date First Available": "April 11, 2014",
      "Manufacturer": "Cibolo Press, LLC",
      "ASIN": "B00JMHZ5BG",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Health Care",
      "OTC Medications & Treatments",
      "Health & Household",
      "Pill Crushers & Splitters",
      "Health, Household & Baby Care",
      "Medication Aids"
    ],
    "price": 29.95
  }
}