{
  "website_summaries": [
    {
      "verdict": "One of the best options to add a true sound upgrade to your vehicle at a good price.",
      "pros": [
        "Solid construction",
        "The rectangular profile of the case makes it easy to install the speaker in a number of different locations such as underneath a driver or passenger seat",
        "Designed to handle up to 1200 watts of power for maximum low-end sound production"
      ],
      "cons": [
        "Large case construction takes up more interior space than individual speaker options"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "FAKE pioneer",
      "text": "this is not a real pioneer speaker, be careful I've bought lots of pioneer subs this one lasted like a month I had my my 1000 watt amp 2 channel turned up half way out even pushing the sub and out of no where its starts popping again I wasn't even pushing it and the volume was not up pulled kt apart and it's a phone speaker",
      "rating": 1.0,
      "verified": true,
      "author": "pjhauver",
      "helpful_votes": 13,
      "publication_date": 20190707
    },
    {
      "title": "Impressive deep bass and great sound quality in a pickup",
      "text": "Purchased this sub along with this ampand this wire kit. I already had installed this stereo a few years back I added polyfill as one other reviewer mentioned and I'm really happy with this purchase. Its been years since I had a subwoofer in a vehicle and finally decided to go w/ something shallow mount and a decent amp. I'm very impressed with the output from just a 10 in such a small box. It's underneath passenger side rear seat in 2006 F150 FX4 SCREW. It was a little tight on the hump side in the middle, but it fits and sounds great.",
      "rating": 5.0,
      "verified": true,
      "author": "DIY DadTop Contributor: Fishing",
      "helpful_votes": 7,
      "publication_date": 20180806
    },
    {
      "title": "Great Sound",
      "text": "This has been in my GMC Sierra now for about 4 months, it sounds great and it wasn't too expensive. It easily fits into the vehicle inconspicuously. I'll be buying another one for my Miata.",
      "rating": 5.0,
      "verified": true,
      "author": "Jake Jacobs",
      "helpful_votes": 6,
      "publication_date": 20200101
    },
    {
      "title": "Pleasantly surprised.",
      "text": "I had a couple people tell me this subwoofer wouldn’t last and it was only for trucks. However, I put it in the trunk of my car and it is much bassier than I expected and sound quite nice. I do not run it super hard but it punches quite hard for its size. It’s perfect for my car and personal taste. However, if you like extremely loud/bassy bass this may not be enough for you. I have not had any problems with it whatsoever. I would highly recommend this for anyone who wants to add a subwoofer to their system but doesn’t want to annoy others.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190110
    },
    {
      "title": "Great buy!",
      "text": "I paired this with the recommended amp. For the low price it works!!! And it fits great in my 2007 Corvette C6 ZO6.",
      "rating": 5.0,
      "verified": true,
      "author": "Marcus Deerwester",
      "helpful_votes": 6,
      "publication_date": 20190310
    },
    {
      "title": "Failed in 4 month and support is no help.",
      "text": "Horrible quality!! Only lasted 4 months before it started failing. Called their support and they were no help. Wanted me to flip the bill, $20-$30, to ship to them on a $100 sub. Stay away from this one; go with another brand.",
      "rating": 1.0,
      "verified": true,
      "author": "Art",
      "helpful_votes": 7,
      "publication_date": 20170929
    },
    {
      "title": "Can’t go wrong with this purchase!",
      "text": "I’ve been working with car audio since 1996. I have 2 of these running on an Alpine PDX V-9 in my hybrid fusion. I’m pretty happy they pair nice with my pioneer head unit and custom MadaSound speaker setup. Bought a new E300 so need to find a new use for these. Maybe the racing simulator! If you want really crazy bass from a small space go to the new JL Audios or Audio Frog. Maybe something like that but for the space and price it’s so worth every penny!",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony P.",
      "helpful_votes": 0,
      "publication_date": 20190604
    },
    {
      "title": "Packs a punch.",
      "text": "It packs a nice punch! I added this to a '13 Nissan Sentra with a factory system, and wow! For nice clean and tight bass, this subwoofer is more than I expected from such a compacted low profile box.",
      "rating": 5.0,
      "verified": true,
      "author": "K and J.",
      "helpful_votes": 6,
      "publication_date": 20160702
    },
    {
      "title": "Lifelong (40 years) Pioneer fan",
      "text": "No longer. Have bought 4 of these within the last two years. One froze up tight after a year, one after one month. Called support and they require me to ship to Chicago to \"diagnose\". Cheaper to replace. Two words, Rockford Fosgate. On another note, 2 of 4, pioneer mono amps have shot craps in the same time period. Shorts in the gain knob. All work terrific, when they worked. Ya get what ya pay for!",
      "rating": 1.0,
      "verified": true,
      "author": "M. Wood",
      "helpful_votes": 4,
      "publication_date": 20180812
    },
    {
      "title": "Caught on fire (almost)",
      "text": "Had this sub/box combo in my 17 f150 crew cab behind the rear seat in the stock sub location. I had to trim some sound deadening material to fit it there and it worked well for the application. Sound quality was pretty good with the low pass crossover on ky pioneer AVH-2300 tuned just right. Sounded great until it caught on fire. Pictures are of the motor windings protruding through the permenant magnet center hole. The windings burnt pretty hot and apparently unwound inside the speaker box my truck filled with a burning wire smell when I lost all bass, stopped to check my amp and wiring...all was well. I guess the speaker windings became hot and shorted.",
      "rating": 1.0,
      "verified": true,
      "author": "Dave",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Beautiful box terrible clone",
      "text": "Why the box is really nice seems the box is worth more than the sub as the sub does appear fake as was posted by another review",
      "rating": 1.0,
      "verified": true,
      "author": "Skuibreaker",
      "helpful_votes": 2,
      "publication_date": 20190912
    },
    {
      "title": "It is a clean hard hitting sub",
      "text": "For what it is it does REALLY well. If you want clean hard hitting bass this is prefect. This isn't 2 12 inch kickers, if you really want glass shaking bass look for those. But this 10in properly tuned and paired with speakers hits better and cleaner than a set of 12s.",
      "rating": 5.0,
      "verified": true,
      "author": "Wyatt",
      "helpful_votes": 3,
      "publication_date": 20180315
    },
    {
      "title": "2000 Mustang GT Converible + PIONEER 10 inch = Happy Customer!:)",
      "text": "2000 Mustang GT Convertible. AMP (BOSS R1100M) remote turn on wired into aftermarket head unit. Mach 460 system untouched. This is the perfect extra BOOM my vert needed. Highly recommended. Perfect DIY project to save some hard earned $$$.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel",
      "helpful_votes": 3,
      "publication_date": 20170910
    },
    {
      "title": "Small but enough bass!",
      "text": "I was unsure of purchasing the 10 inch because I thought it wouldn't be loud enough. I was wrong! Good clear bass. I can't hear it from the outside of my truck very much but I can feel the base when I am inside, which is what I wanted. I put this under the back seat of a 2016 F150 SuperCrew. I ended up buying another.",
      "rating": 5.0,
      "verified": true,
      "author": "Emmanuel M.",
      "helpful_votes": 0,
      "publication_date": 20180514
    },
    {
      "title": "Ideal for small vehicle with limited space.",
      "text": "Great for limited space. Doesn't even compare to a regular box, but when you drive a small car with limited space, this is great. I am using a 600 watt amp to push this woofer. I would say when I have a regular box in the car it produce about twice as much bass if not more. That'll give you an idea of how much bass this box produces.",
      "rating": 5.0,
      "verified": true,
      "author": "Tom T.",
      "helpful_votes": 0,
      "publication_date": 20181024
    },
    {
      "title": "Great little sub",
      "text": "Great little sub, I'm getting older and don't really car to rattle my windows off. So this sub fits my taste perfectly. Gives me the low end my SUV was missing. Don't get me wrong though it does put out a decent amount of thump. Takes up very little space and if you mount the amp with some quick connects on it. Then it's all easily removable.",
      "rating": 5.0,
      "verified": true,
      "author": "Johnny B",
      "helpful_votes": 3,
      "publication_date": 20170122
    },
    {
      "title": "If you hear any rattling or humming from subwoofer return the speaker right away.",
      "text": "This speaker worked but it made a humming or a rattle sound when I hooked up the subwoofer. I thought it just needed some time to break in but it wasn’t the case. The speaker stopped working. I contacted Amazon customer about the issue I had and that I sent a email to the 3rd party about the issue and didn’t hear back from 3rd party seller. Amazon did a amazing job resolving my issue and refunding my purchase.",
      "rating": 1.0,
      "verified": true,
      "author": "Michael F.",
      "helpful_votes": 0,
      "publication_date": 20200217
    },
    {
      "title": "Sounds great, but doesn't fit F150 super crew",
      "text": "It's a great sounding sub. I got it to fit behind the rear seats in my F150 super crew but it's too deep and doesn't fit. I have it on the floor under the seat until I come up with a skinnier box. the sub sounds fantastic and the box is well built.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin",
      "helpful_votes": 0,
      "publication_date": 20200303
    },
    {
      "title": "Ok",
      "text": "Honestly its ok not the best.. I love the box design... if you want to add just a small bit of bass it's ok.. I was looking for something I can turn up a little and not have it sound bad and distorted.. I will prob purchase a different sub and reuse the box Make sure you really take the time to tune you amp and stereo to get a d decent sound Update since I have properly tunned it and broke it in this little subs kick for as small as it",
      "rating": 4.0,
      "verified": true,
      "author": "Shannon",
      "helpful_votes": 0,
      "publication_date": 20200210
    },
    {
      "title": "10” Pioneer Shallow Mount Sub",
      "text": "Considering the size, it’s a good sub. Adds a surprising amount of bass to my truck. After you adjust the amplifier and head unit settings it really comes alive. Update: 2 years later it’s held up great with daily use. I’m very satisfied with this purchase and would highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Joeydrumplayer",
      "helpful_votes": 0,
      "publication_date": 20171110
    },
    {
      "title": "Fits and it thumps!",
      "text": "Not really a fan of 10\" subs (12\" subs is where its at) but nothing short of an extremely customize box will fit behind the back seat of my 2018 F250 screw. I was able to squeeze this enclosure in along with a Kenwood KAC-5001PS and hook everything up to the stock headset/nav with a LOC tapped in. Now the truck has a respectable about of thump to enjoy a variety of music. Stoked!",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181129
    },
    {
      "title": "Great sub for a wonderful price!!",
      "text": "Great sub for a great price. I installed this sub in my 06 single cab Silverado and it fit perfectly behind my bench seat. The sound is beautiful and it fills my cab up with wonderful bass. Loud enough for me to enjoy but quiet enough on the outside of my truck to stay under the radar to other motorists. I highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Adam T.",
      "helpful_votes": 0,
      "publication_date": 20191124
    },
    {
      "title": "Extremely happy with this product",
      "text": "Extremely happy with this product. Just the right amount of bass for my Jeep Wrangler. Fits perfectly behind my back seat of the 2-door Jeep Wrangler .",
      "rating": 5.0,
      "verified": true,
      "author": "Ernesto N.",
      "helpful_votes": 4,
      "publication_date": 20160713
    },
    {
      "title": "Very nice bass",
      "text": "Very nice sub! Fits well in 2015-2017 F-150 supercrew. Have it hooked up to Rockford fosgate 300w amp. It will rattle your insides but nice tight bass. When delivered, the box looked like it had been trampled on but the product inside had no damage.",
      "rating": 4.0,
      "verified": true,
      "author": "L. Thurmond",
      "helpful_votes": 0,
      "publication_date": 20170712
    },
    {
      "title": "Well worth the short money and sounds surprisingly well",
      "text": "Bought this with the boss amp bundle and it hits very well. The bass is deeper and hits harder at a lower volume but when you turn the radio up it clears up and sounds really good. I was extremely surprised at how well it hits. The last system in my car was 2 alpine type R subs with a 3000watt ma audio amp. These dont hot that obnoxiously but it's plenty to curve your appetite for bass and awesome for just throwing in your trunk and not worrying about puncturing the sub with the platform it's on",
      "rating": 5.0,
      "verified": true,
      "author": "chris allen",
      "helpful_votes": 0,
      "publication_date": 20160905
    },
    {
      "title": "This thang thumps!!",
      "text": "Tried the 8” version but opted for this one instead. Boy was it worth it. This thang THUMPS! And it is a super space saver, love the design. No more nagging wife now that we have a useable trunk again! Get it!!",
      "rating": 5.0,
      "verified": true,
      "author": "Deal Guy",
      "helpful_votes": 0,
      "publication_date": 20181025
    },
    {
      "title": "Great Value and Quality",
      "text": "Paired with a 1500w planet audio mono block amp. Installed in a 2015 ford focus hatchback. Great sound, not overwhelming but loud and crisp, yet to hear distortion at any volume with gain below half. Perfect for the price and exactly what i wanted.",
      "rating": 5.0,
      "verified": true,
      "author": "not telling my name",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "Great bass on my 2015 Wrangler JKU",
      "text": "I wanted something small and compact in my Wrangler and was hoping that this box would fit under my rear seats but it's slightly too big. I paired it with the Boss 1100 watt amp and this combo surpassed my expectations. A very loud and clean bass, but not overwhelmingly obnoxious to everyone outside. extremely happy with this setup",
      "rating": 5.0,
      "verified": true,
      "author": "Patty Tee",
      "helpful_votes": 0,
      "publication_date": 20180901
    },
    {
      "title": "Great buy",
      "text": "I haven't installed one of these and my 2005 f250 using a audio tech 1000w amp let me tell you what this 10-inch speaker hits hard. I love it so much I'm thinking about adding another one and upgrading my amp to 2000w and using my 1000 for front/rear Pyle I got also from Amazon that have amazing clarity sound for the price",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Taylor",
      "helpful_votes": 0,
      "publication_date": 20190327
    },
    {
      "title": "If you're like me and you just like a well rounded",
      "text": "if you're a \"thumper\" than this speaker isn't for you. If you're like me and you just like a well rounded, full sound, this will take care of your needs.",
      "rating": 5.0,
      "verified": true,
      "author": "John Clark",
      "helpful_votes": 2,
      "publication_date": 20170501
    },
    {
      "title": "Fits 14 Tundra double cab with ease",
      "text": "Very pleased. I didn't need a ton of bass. Just something to round the sound out. This is perfect! I have a 2014 Tundra double cab and honestly I could have fit the 12\" version under the seat. But the 10\" sounds very nice",
      "rating": 5.0,
      "verified": true,
      "author": "Edward S.",
      "helpful_votes": 0,
      "publication_date": 20190521
    },
    {
      "title": "I am EXTREMELY HAPPY with this purchase. The pint size with a strong and clear punch. Amazing!",
      "text": "My headline says it pretty clearly. I purchased this box for my 2006 Chevrolet, I had it installed with a 5-channel Amp and new pioneer speakers throughout the doors and the box (speaker facing down) sits nice and flat in the back without interfering with the 3rd row seats and does not take up space... I am purchasing one of these for my BMW 535Xi.",
      "rating": 5.0,
      "verified": true,
      "author": "Lumecca",
      "helpful_votes": 0,
      "publication_date": 20200121
    },
    {
      "title": "Poor quality sound",
      "text": "Speaker doesn't sound that good. It rattles too much. Tried to return, no luck.",
      "rating": 1.0,
      "verified": true,
      "author": "183",
      "helpful_votes": 3,
      "publication_date": 20180726
    },
    {
      "title": "Great Sub",
      "text": "I have this in my 1996 Ford F-150 xlt extended cab in front of my back passenger seat. This sub sounds great and fits well in my truck. For a 10” sub it’s surprisingly powerful. I would recommend this sub to anyone who is looking for something that is not so pricey and still get what you want out of a sub.",
      "rating": 5.0,
      "verified": true,
      "author": "Cole Freeman",
      "helpful_votes": 0,
      "publication_date": 20190929
    },
    {
      "title": "Not worth the money",
      "text": "You can’t even hear this dang thing. Just spend the money and get a real setup.",
      "rating": 2.0,
      "verified": true,
      "author": "Jacob H.",
      "helpful_votes": 0,
      "publication_date": 20200417
    },
    {
      "title": "Big sound for little space.",
      "text": "Have a 2005 3.0i Z4, replaced the entire sound system but still had no balls on the low end. Big problem, very little space. If I installed a 10\" sub box, then I would have to give up the little space I have. Solution...Pioneer TSSWX2502 Shallow Mount. This sub gives me all the lows I need and I give up little space. Good crisp hits that are solid for rock and edm plus great sub-sonic low end vibes for trap and drum & bass. Installed a Rockford amp to power her..  The Rockford is maxed out and the Pioneer begs for more! Much more!! Impressive.",
      "rating": 5.0,
      "verified": true,
      "author": "Wolly09",
      "helpful_votes": 12,
      "publication_date": 20160605
    },
    {
      "title": "Great sound.",
      "text": "I'm highly impressed with the quality of the sound of this sub. I got these to fit underneath the back seat of my 2004 Ford F150. For price you definitely cant beat the sound.",
      "rating": 4.0,
      "verified": true,
      "author": "Gemini",
      "helpful_votes": 0,
      "publication_date": 20190227
    },
    {
      "title": "Great space saver item.",
      "text": "Deep bass but not sure if I needed a bigger speaker. Would have loved it to be louder",
      "rating": 4.0,
      "verified": true,
      "author": "KB",
      "helpful_votes": 0,
      "publication_date": 20191123
    },
    {
      "title": "Great Sub for the Price!",
      "text": "Great sub, takes time to break then has much better sound range. Mounts do not come with self tapping screws, so can be difficult to secure. Very good sub for a truck or small vehicle.",
      "rating": 5.0,
      "verified": true,
      "author": "Cullen",
      "helpful_votes": 0,
      "publication_date": 20181004
    },
    {
      "title": "I wanted good clean sound in my little Ford Ranger and that ...",
      "text": "I wanted good clean sound in my little Ford Ranger and that is exactly what this delivers. I did not want neighbor annoying, ground shaking bass. Very solid build. Get the mix right and you will love this and the sound it generates. It is not short on bass either.",
      "rating": 5.0,
      "verified": true,
      "author": "Gary Wilson",
      "helpful_votes": 0,
      "publication_date": 20170427
    },
    {
      "title": "NOT MUCH BASS AT ALL",
      "text": "Installed subwoofer in a JEEP CHEROKEE powered by a rockford 500 amp gain set to 3, could hardly tell it was on and it was rite behind driver seat, so I cut the gain up to 5, I am not kidding when I say my kicker 6x9's are almost as punchy as this 10 inch pioneer subwoofer..save your time and money on returning this junk 15$ to return it...",
      "rating": 1.0,
      "verified": true,
      "author": "Kirk",
      "helpful_votes": 0,
      "publication_date": 20190503
    },
    {
      "title": "Very good value",
      "text": "For the price this combo is awesome. I have a supercrew Ford and I put 2 of these subs under the rear seat. I have them feeding off of a JBL GTR-1001 and they exceed expectations. Very slim profile and sturdy box material. I did add poly material inside of the box to help with sound quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Charles Hubbard",
      "helpful_votes": 0,
      "publication_date": 20180824
    },
    {
      "title": "Perfect for what i needed",
      "text": "Sounds great! Just enough bass for what i listen to. Not overpowering but has enough.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian Selch",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Great sub - it really pounds and is great in ...",
      "text": "Great sub - it really pounds and is great in an S10. The feet on the front of the box allow it to be mounted firing downwards, so you can put stuff on top of it without worrying about it buzzing or damaging the speaker. It also fits under a jump seat in the extended cab, so you don't lose any functionality. Overall, I am very impressed.",
      "rating": 5.0,
      "verified": true,
      "author": "Henry Brown",
      "helpful_votes": 0,
      "publication_date": 20150907
    },
    {
      "title": "Don’t bump too hard",
      "text": "Had for about 3 months on a pioneer 900watt amp. Really sounded nice until it gave up, didn’t work one opened trunk and full of smoke.",
      "rating": 3.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 0,
      "publication_date": 20200319
    },
    {
      "title": "Pioneer subs rule",
      "text": "Came undamaged and looking beautiful. Its my 2nd pioneer subwoofer in my 2nd car so im not worried about what it will sound like. I am just blown away by how shallow it id and the moderate weight! Very convenient package",
      "rating": 5.0,
      "verified": true,
      "author": "Carol",
      "helpful_votes": 0,
      "publication_date": 20180407
    },
    {
      "title": "Sub works great and definately hits hard",
      "text": "Sub works great and definately hits hard. I am running with a single channel 500W amp and only am running the gain at 50%. Sounds clean and performs well. The enclosure is also pretty compact so it would work in numerous applications. Bought it for a boat but will prob end up getting a second one for my truck as it will fit nicely under the back seat.",
      "rating": 5.0,
      "verified": true,
      "author": "Shelby Speaks",
      "helpful_votes": 2,
      "publication_date": 20150716
    },
    {
      "title": "Made all the difference. Great buy!",
      "text": "This speaker has a great sound and gives plenty of that extra bass to make the music come to life.",
      "rating": 5.0,
      "verified": true,
      "author": "Rebecca Jordan",
      "helpful_votes": 0,
      "publication_date": 20200407
    },
    {
      "title": "GREAT sound in a very compact box",
      "text": "GREAT sound in a very compact box. Fits easily under the smaller side of my 60/40 split bench of a 2014 F150. Powered is with a BOSS Audio R1100M Riot 1100 Watt an it can produce more than enough bass. On really hard hitting songs, it not perfect. I think this is due to the sealed box but on 95% of music it is fantastic. I have tried a few and I am very satisfied with this box!",
      "rating": 5.0,
      "verified": true,
      "author": "TRYALS",
      "helpful_votes": 0,
      "publication_date": 20171008
    },
    {
      "title": "Not 12 but a great 10",
      "text": "For the price and size this is an incredible subwoofer. I tested it with a signal generator and it starts to fall off around 40 or 45 Hertz. It is booming hard above 60 hertz. I spent some time with a decibel meter and signal generator and was able to adjust the equalizer to get the response curve acceptable linear and flat. The Boss Audio 1200 watt amp recommended by Amazon works well with it. Fits perfectly under the rear seat of a 2001 Ford F 150 supercab with room to mount the amp under the seat next to it.",
      "rating": 5.0,
      "verified": true,
      "author": "Jimmy Alan",
      "helpful_votes": 5,
      "publication_date": 20160410
    },
    {
      "title": "Smooth bass",
      "text": "Smooth tight bass in my 2011 Tundra Crew cab, very small space behind seats",
      "rating": 5.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "Fits nicely under the rear seat of my '07 Tundra DC",
      "text": "Fits nicely under the rear seat of my '07 Tundra DC. Gives the sound system a nice bit of low end to round out the sound for an inexpensive price.",
      "rating": 5.0,
      "verified": true,
      "author": "BlueCrushSC16",
      "helpful_votes": 0,
      "publication_date": 20180316
    },
    {
      "title": "Sounded great while they worked but doesn't seem to last",
      "text": "We bought 2 of these subs a little over a year ago both have quit working after the first year. Sounded great while they worked but doesn't seem to last.",
      "rating": 2.0,
      "verified": true,
      "author": "Verlon Rackard",
      "helpful_votes": 2,
      "publication_date": 20180102
    },
    {
      "title": "Lots more bang for your buck!",
      "text": "Very satisfied with this subwoofer. Bass is crisp and clear, only running 180W at 4 ohms and it beats much harder than I expected. Will be upgrading the amp soon to get closer to the 300W rms is looking for. Only thing I should have done is get the 12 inch version as my van is a little big for this sub, still though sounds great.",
      "rating": 5.0,
      "verified": true,
      "author": "WayHighPainterGuy",
      "helpful_votes": 0,
      "publication_date": 20140911
    },
    {
      "title": "Great sound!",
      "text": "Pleasantly surprised! This thing sounds great. I was not expecting too much considering the size but I was wrong. Big sound from something small. Fits well in my truck.",
      "rating": 5.0,
      "verified": true,
      "author": "Nodo45",
      "helpful_votes": 0,
      "publication_date": 20191026
    },
    {
      "title": "Sounds great",
      "text": "Sounds great, it won’t rattle the windows but enough bass.",
      "rating": 5.0,
      "verified": true,
      "author": "Larry J. Moya",
      "helpful_votes": 0,
      "publication_date": 20190630
    },
    {
      "title": "Hits Hard and looks great!",
      "text": "Great subwoofer for the price. Well made. Sounds amazing and it hits hard!",
      "rating": 5.0,
      "verified": true,
      "author": "M&M&M",
      "helpful_votes": 0,
      "publication_date": 20200302
    },
    {
      "title": "Good speaker good box",
      "text": "This is great for a sealed box makes classic rock jazz blue country sound great not so much for most rap",
      "rating": 4.0,
      "verified": true,
      "author": "Justin Harkleroad",
      "helpful_votes": 0,
      "publication_date": 20190610
    },
    {
      "title": "Enough for my needs",
      "text": "Great little sub. Sound is a little less tight than I expected with a .35 sealed enclosure....but after making numerous adjustments to crossover, gain...etc. was able to get a nice sound from kick drum. Would definitely recommend this combo.",
      "rating": 4.0,
      "verified": true,
      "author": "Jim S.",
      "helpful_votes": 0,
      "publication_date": 20190927
    },
    {
      "title": "Five Stars",
      "text": "This sounds awesome!!! I highly suggest this. Does not take up much room and the sound is unbelievable.",
      "rating": 5.0,
      "verified": true,
      "author": "drrllcolon",
      "helpful_votes": 0,
      "publication_date": 20180616
    },
    {
      "title": "Weak, had a hard time determining if the stereo ...",
      "text": "Weak, had a hard time determining if the stereo was any louder than just the factory 6x9s. Does not play low at all..",
      "rating": 2.0,
      "verified": true,
      "author": "adam p nalow",
      "helpful_votes": 0,
      "publication_date": 20180819
    },
    {
      "title": "Gave my Mach 460 system in my 2001 mustang a new lease on life",
      "text": "I paired this sub with a BOSS AUDIO R2000M Riot 2000-Watt Monoblock, Class A/B 2 to 8 Ohm Stable Monoblock Amplifier with Remote Subwoofer Level Control and installed it the trunk of my 2001 Mustang Cobra with the Mach 460 and now I enjoy plenty of hard hitting bass! An excellent upgrade!",
      "rating": 5.0,
      "verified": true,
      "author": "Bull_Winkle",
      "helpful_votes": 2,
      "publication_date": 20160907
    },
    {
      "title": "Good product",
      "text": "For the price it is a great buy. Sound is good for small spaces.",
      "rating": 5.0,
      "verified": true,
      "author": "AH",
      "helpful_votes": 0,
      "publication_date": 20190830
    },
    {
      "title": "Bump, bump, bump...",
      "text": "Niiiiiiiicccceee...Great sound from such a compact size and at an incredible price...",
      "rating": 4.0,
      "verified": true,
      "author": "Joe Mancilla",
      "helpful_votes": 0,
      "publication_date": 20171129
    },
    {
      "title": "Died after one month",
      "text": "After just over one month of use, this unit no longer produces any audio. I checked all connections and the amplifier as well.",
      "rating": 1.0,
      "verified": true,
      "author": "Alec M.",
      "helpful_votes": 0,
      "publication_date": 20180413
    },
    {
      "title": "This product rocks",
      "text": "Granted in haven’t installed it yet. I am pleased with the size and the quality of the subwoofer. I have a Scion tC and the small hatch can be easily taken up by subs. This is small enough and hopefully packs a punch. Great purchase and looks really good.",
      "rating": 5.0,
      "verified": true,
      "author": "Auntais Faulkner",
      "helpful_votes": 0,
      "publication_date": 20180810
    },
    {
      "title": "Works perfect with a powerful bass",
      "text": "Fit with some slight modifications to the back storage area on my 2006 Toyota tacoma double cab. Had to cut into the plastic trays in the back. Works perfect with a powerful bass.",
      "rating": 5.0,
      "verified": true,
      "author": "Rawrooster71",
      "helpful_votes": 0,
      "publication_date": 20180423
    },
    {
      "title": "Good low profile and quality sound",
      "text": "Good range of bass and matches well with a balanced system. Only running around 400w rms through it and it hits well. Have it in my fiesta st and it doesn't compromise hatch space.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170217
    },
    {
      "title": "Great compact subwoofer",
      "text": "Great if you have a small compact car and dont want to lose all your trunk space or back seat space. I have mine behind the front passengers seat. Very loud bass. I would recommend buying two for a better distributed bass inside the car. Definitely worth it for the price!",
      "rating": 5.0,
      "verified": true,
      "author": "Hector Martinez",
      "helpful_votes": 0,
      "publication_date": 20170920
    },
    {
      "title": "Maybe for small cars...",
      "text": "this speaker may work for small vehicles but not mini-vans (if you want to feel the bass)...",
      "rating": 3.0,
      "verified": true,
      "author": "son of Lynn",
      "helpful_votes": 2,
      "publication_date": 20170808
    },
    {
      "title": "Trash Seller - unhelpful",
      "text": "Bought a subwoofer from this seller that stopped working after less than a month of use. Had professional instillation done and all. They can’t even bother to have a real person try to find out the issue or try to resolve it. All you get is an automated email saying they won’t help you.",
      "rating": 1.0,
      "verified": true,
      "author": "Ashley Smith",
      "helpful_votes": 0,
      "publication_date": 20191023
    },
    {
      "title": "Great for music",
      "text": "Compact, lightweight, yet reasonably loud and very musical. Just right for me, mostly a jazz and classic rock listener. For hip hop, no. But for me and other old fogies, yes.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve Livingston",
      "helpful_votes": 0,
      "publication_date": 20170225
    },
    {
      "title": "Great",
      "text": "Fit very nice in my son's Mini Cooper. Should have bought one for my truck.",
      "rating": 5.0,
      "verified": true,
      "author": "jsna1998",
      "helpful_votes": 0,
      "publication_date": 20190115
    },
    {
      "title": "Didn't last long even with 75 watt amplifier. Tiny magnet on sub.",
      "text": "Didn't last long. Blew it up in a few short months using a 75 watt Pioneer amplifier, won't buy again.",
      "rating": 2.0,
      "verified": true,
      "author": "Scott Duby",
      "helpful_votes": 0,
      "publication_date": 20191104
    },
    {
      "title": "Was ok for 30 mins it lasted",
      "text": "Speaker only lasted about 30 mins before it was fried. Idk how to measure the watts accurately but my amp is rated lower that the sub. 1000 watts 500 rms is what my amp is at. Only had the gains turn half way.",
      "rating": 2.0,
      "verified": true,
      "author": "Dion",
      "helpful_votes": 0,
      "publication_date": 20190622
    },
    {
      "title": "Good sub",
      "text": "Good sub for the money. Sounds great, and fin under the seat of a 2004 gmc sierra crew cab.",
      "rating": 5.0,
      "verified": true,
      "author": "Taylor",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "Pioneer 10 inch shallow mount sub-woofer",
      "text": "If you are looking for a subwoofer to fit in a truck don't hesitate on this one, it's great! It sound very clear. I used a Boss Audio Riot Monoblock 1100 watt amp to push it and its doing great!",
      "rating": 5.0,
      "verified": true,
      "author": "MH",
      "helpful_votes": 2,
      "publication_date": 20150311
    },
    {
      "title": "Seriously",
      "text": "It was great for the first 3 days then the speaker got super hot and blew out.",
      "rating": 1.0,
      "verified": true,
      "author": "Toby Dudeck",
      "helpful_votes": 0,
      "publication_date": 20190902
    },
    {
      "title": "boom on a budget",
      "text": "very impressed with the sound quality out of this small package",
      "rating": 5.0,
      "verified": true,
      "author": "Monteg0",
      "helpful_votes": 0,
      "publication_date": 20180715
    },
    {
      "title": "Good price point for this speaker",
      "text": "Good price point for this speaker, great price point if you compare the speaker and the enclosure separately. Originally I wanted the 2ohm 12, but it seems that that unit is difficult to get a-hold of. This unit takes up a little bit more space behind the passenger seat than I wanted, but I was lazy and didn't want to build the box if i wasn't getting the 12\" speaker I wanted in the first place. Produces pretty tight bass and functions well enough for all music types from choral to rap to country to rock as long as it is being pushed by enough power. Overall I am happy with this set.",
      "rating": 4.0,
      "verified": true,
      "author": "flatlynr",
      "helpful_votes": 5,
      "publication_date": 20140801
    },
    {
      "title": "Does a very solid job for its size. Powered ...",
      "text": "Does a very solid job for its size. Powered by a very budget amp, has more than enough sound to fill the cabin of a sedan without being obnoxious.",
      "rating": 5.0,
      "verified": true,
      "author": "Mang",
      "helpful_votes": 0,
      "publication_date": 20160419
    },
    {
      "title": "Great at first but...",
      "text": "Sounded awesome initially but it didn't last 2 weeks. Purchased a pioneer amp that put off less watts and didn't even have everything turned up. Blew out on me in two weeks. Knew it was too good to be true.",
      "rating": 1.0,
      "verified": true,
      "author": "Sabrina Hayes",
      "helpful_votes": 0,
      "publication_date": 20190505
    },
    {
      "title": "Three Stars",
      "text": "Product sounds great. It arrived damaged. Still works great though",
      "rating": 3.0,
      "verified": true,
      "author": "Mike Ungureanu",
      "helpful_votes": 0,
      "publication_date": 20170422
    },
    {
      "title": "Great values and sound!",
      "text": "I added this shallow ten to give my 3kgt a nice sound upgrade and definitely got that!! Super clean sound and love how it doesn’t take all your trunk space.",
      "rating": 5.0,
      "verified": true,
      "author": "Eddy23c",
      "helpful_votes": 0,
      "publication_date": 20190625
    },
    {
      "title": "Awesome box and speaker",
      "text": "Hooked it up in my old 2001 f150 super cab with pyle gps dvd stereo and boss audio mono block amp and this one box kicks. Hits pretty hard nice and clear Time to upgrade door speakers to match",
      "rating": 5.0,
      "verified": true,
      "author": "daniel cambria",
      "helpful_votes": 0,
      "publication_date": 20160303
    },
    {
      "title": "Well built space saver and great sound",
      "text": "Incredibly well built, extraordinary sound quality. Purchase this to replace a set of 2 12\" subwoofers and I love it, saved a lot of space with out sacrificing sound.",
      "rating": 5.0,
      "verified": true,
      "author": "Patricio S.",
      "helpful_votes": 0,
      "publication_date": 20190816
    },
    {
      "title": "Bad purchase",
      "text": "I bought this sub and it blew a month later",
      "rating": 1.0,
      "verified": true,
      "author": "Raul Santacruz",
      "helpful_votes": 0,
      "publication_date": 20181129
    },
    {
      "title": "This really helped clean up the overall sound in my ...",
      "text": "This really helped clean up the overall sound in my truck. The front speakers no longer have to struggle with the low frequency stuff.",
      "rating": 5.0,
      "verified": true,
      "author": "Chad A. Mitchley",
      "helpful_votes": 0,
      "publication_date": 20160729
    },
    {
      "title": "Great for limited space",
      "text": "I have this under the rear seat of my 11 Tundra powered by a vintage RF amp (250 watts RMS) and can't believe how good this sounds. It doesn't hit the lows like a larger subwoofer, or shake the neighborhood, but it's small enough that I can fit another under the seat with room to spare.",
      "rating": 5.0,
      "verified": true,
      "author": "Pearce",
      "helpful_votes": 0,
      "publication_date": 20170629
    },
    {
      "title": "Great size, decent price, good sound.",
      "text": "Paired with a cheap boss 1100 watt mono amp this combo fills a midsize SUV with enough bass to make you feel like your ears need to pop. Convenient size and good price point make it hard to pass up.",
      "rating": 5.0,
      "verified": true,
      "author": "Jdsu",
      "helpful_votes": 0,
      "publication_date": 20151217
    },
    {
      "title": "Perfect",
      "text": "tiny and saves space but also hits HARD (in a good way) love this sub better than the other loaded 10inch subs I’ve tried. Paired it with a 1500W boss Audio amp.",
      "rating": 5.0,
      "verified": true,
      "author": "Abby",
      "helpful_votes": 0,
      "publication_date": 20190505
    },
    {
      "title": "Amazing value for the money! Sounds great!",
      "text": "Bass range on this unit is amazing for the price tag. The bass easily fills my car and makes it shake. However, the bass doesn't overpower the highs and mids - it's quite well balanced. Buy this thing.",
      "rating": 5.0,
      "verified": true,
      "author": "SteveO",
      "helpful_votes": 0,
      "publication_date": 20151020
    },
    {
      "title": "Compact but delivers a punch",
      "text": "Pros Great value,bang for your buck its hard to beat. Compact, fits nicely behind my truck seat. Cons It's a 10\" so it's not going to drive the lows to rattle windows.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike ",
      "helpful_votes": 0,
      "publication_date": 20190723
    },
    {
      "title": "Great for any price, excellent for this price",
      "text": "Bought one. Liked it enough to buy a second. A great sounding compact sub. I have had all kinds over the years, including JL Audio (which I consider best of best). Still, for the price and size of this sub, you absolutely cannot go wrong with this pioneer sub...",
      "rating": 4.0,
      "verified": true,
      "author": "Jonathan A. Jacobi",
      "helpful_votes": 0,
      "publication_date": 20151010
    },
    {
      "title": "This thing sounds good. Like the other reviews say you won't be ...",
      "text": "This thing sounds good. Like the other reviews say you won't be heard for blocks but in my jeep its sounds great.",
      "rating": 5.0,
      "verified": true,
      "author": "Dennis",
      "helpful_votes": 0,
      "publication_date": 20180415
    },
    {
      "title": "It bumps",
      "text": "I have a 2005 Dakota that I put this in with a 1500 watt pioneer amp. Sounds great and definitely hits hard. Super easy to find a place for because it’s low profile.",
      "rating": 5.0,
      "verified": true,
      "author": "Darren",
      "helpful_votes": 0,
      "publication_date": 20180530
    },
    {
      "title": "Great sound in a small package",
      "text": "This is a great product... the size is perfect if you're looking to upgrade your base by adding a small enclosure. Do not forget to use an amplifier that can provide the proper power and ohms rating required by this product or it will likely sound like garbage.",
      "rating": 5.0,
      "verified": true,
      "author": "Benjamin Rivera",
      "helpful_votes": 0,
      "publication_date": 20170226
    },
    {
      "title": "It Booms",
      "text": "Perfect size sub for most vehicles. Not overkill, just right. Highly adjustable bass control makes this a pleasure to pair with your car's audio.",
      "rating": 5.0,
      "verified": true,
      "author": "Annalise",
      "helpful_votes": 0,
      "publication_date": 20190503
    },
    {
      "title": "Excellent speaker and box combo!",
      "text": "This thing is awesome paired with the alpine 500w rms digital mono block amp. Hooked up to th he factory stereo in my F-250. You won't be disappointed if you hook it up right.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason F.",
      "helpful_votes": 0,
      "publication_date": 20190217
    },
    {
      "title": "Five Stars",
      "text": "Great space saving subs. Louder than I had expected. Bought two and still tons of room in trunk.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike A.",
      "helpful_votes": 0,
      "publication_date": 20170620
    }
  ],
  "product_meta": {
    "title": "Pioneer TS-SWX2502 10 inch Shallow-Mount Pre-Loaded Enclosure",
    "description": "Pioneer TS-SWX2502 10 inch Shallow-Mount Pre-Loaded Enclosure. Music Power (Nominal): 1, 200 W (300 W) Frequency Response: 20 Hz to 200 Hz. Avoid installing in areas that are unstable or subject to frequent vibration.",
    "rating": 4.5,
    "feature_bullets": [
      "Music Power (Nominal): 1,200 W (400 W) Frequency Response: 20 Hz to 125 Hz, Sensitivity (1 W/1 m): 93 dB, Impedance: Single 4Ω Tight bass from a shallow compact design, Reinforced MICA injection-molded resin preloaded subwoofer cone"
    ],
    "specifications": {
      "Item Weight": "1.1 pounds",
      "Product Dimensions": "8.4 x 18.5 x 14.4 inches",
      "Item model number": "TSSWX2502",
      "Is Discontinued By Manufacturer": "No",
      "Wireless Remote": "No",
      "Height (inches)": "9 inches",
      "Width (inches)": "15.5 inches",
      "Weight": "42.1 Pounds",
      "ASIN": "B00JQTU3QC",
      "Customer Reviews": "4.5 out of 5 stars957 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#26,969 in Electronics",
      "Date First Available": "April 28, 2014"
    },
    "categories": [
      "Subwoofers",
      "Car Audio",
      "Electronics",
      "Component Subwoofers",
      "Car & Vehicle Electronics",
      "Car Electronics"
    ],
    "price": 219.99
  }
}