{
  "website_summaries": [
    {
      "verdict": "This tote bag is an impressive smaller option to transparently carry all must-haves.",
      "pros": [
        "A 16-by-12-by-4-inch size",
        "Comes in multiple color options",
        "Strap makes it comfortable to carry on shoulder and it’s roomy enough to fit a wealth of items",
        "Has top zipper to keep items safe inside bag",
        "Great for transporting spillable items since this bag is easy to clean"
      ],
      "cons": [
        "Has no organizational pockets"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great size and durable",
      "text": "I needed a bag to stick on my backseat that held basic essentials like an umbrella, gloves, travel wipes, and some things to keep me sane while waiting in a dr/dentist office-magazine, snack. I chose a clear bag because we've had a lot of break ins lately where women and school kids left purses and backpacks on the backseat. I wanted mine to give a clear message, no pun intended, that nothing in it was worth busting a window or lock for.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary_",
      "helpful_votes": 2,
      "publication_date": 20191222
    },
    {
      "title": "Good size bag and well made",
      "text": "Purchased for my wife since we are attending sporting events that require \"clear\" bags in order to enter. The bag isn't a decent size, basically big enough to put a toaster in it. She was able to carry a towel, money purse, bottles of water, snacks and a couple of other items. The bag itself is sturdy and well constructed with a zipper to close it up and keep items from coming out.",
      "rating": 5.0,
      "verified": true,
      "author": "TonyG",
      "helpful_votes": 3,
      "publication_date": 20180912
    },
    {
      "title": "Great bag! Ordering 3 more!",
      "text": "I work in retail and for security reasons, we have to use a clear plastic bag in place of a purse. The silly little \"envelopes\" we are given are worthless. So I searched on line and found this great buy. This tote is fantastic! It can hold all of my personal items and then some. It is well made for a plastic carrier plus I love the zipper. So pleased that I am ordering 3 more as gifts for friends at work.",
      "rating": 5.0,
      "verified": true,
      "author": "LittleMurph",
      "helpful_votes": 20,
      "publication_date": 20141205
    },
    {
      "title": "Used for job at a prison",
      "text": "I bought this when I worked at a prison and it was perfect for my needs. The bag is roomy and durable, and fit my lunch, wallet, umbrella, water bottle, and other items perfectly. The strap is long enough to carry over your shoulder, or you could just carry it by hand. The zipper is sturdy, as well. It's definitely not a designer bag, but for someone who works in a setting that requires clear bags this is a great buy!",
      "rating": 5.0,
      "verified": true,
      "author": "carly",
      "helpful_votes": 11,
      "publication_date": 20160106
    },
    {
      "title": "Great quality and size!",
      "text": "I bought this for my mom and she loves it. She needed a clear bag to carry work files in. This bag perfectly accommodates papers and folders that are 8 1/2 x 11 inches and has a nice, professional look.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Renee",
      "helpful_votes": 4,
      "publication_date": 20180126
    },
    {
      "title": "used it for work due to security issues.. ...",
      "text": "used it for work due to security issues....after several months of everyday use it began to tear at the plastic. zipper still worked but had to eventually throw away....",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20180712
    },
    {
      "title": "Very happy with the quality and the size for what I ...",
      "text": "Very happy with the quality and the size for what I needed it for I often feel I have quite a nest of things to take places with me but I don't want to carry in my purse. So this usually stays in my car and I can quickly access what I need without digging around in a dark hole.",
      "rating": 5.0,
      "verified": true,
      "author": "T S",
      "helpful_votes": 2,
      "publication_date": 20180221
    },
    {
      "title": "nice",
      "text": "the bags are nice looking but what I didn't like the fact that they came folded up in a small package and I needed these bags to be just as smooth because im adding images on them and once plastic gets wrinkled its hard to get them out but we will see how it goes",
      "rating": 4.0,
      "verified": true,
      "author": "ANGIE R",
      "helpful_votes": 0,
      "publication_date": 20200425
    },
    {
      "title": "These bags are awesome! I was unaware of stadiums requiring see-through bags--I ...",
      "text": "These bags are awesome! I was unaware of stadiums requiring see-through bags--I had ordered these because I put a lot of items on hooks to prevent the dog from getting into them (lack of closets and cupboards). The bags I was using are not transparent, so I often would lose things for weeks. The clear bags let me see what's inside. They zip at the top and have a generous shoulder drop. I've been able to grab a bag and go when I need to.",
      "rating": 5.0,
      "verified": true,
      "author": "HHS-OH",
      "helpful_votes": 6,
      "publication_date": 20150927
    },
    {
      "title": "Cut, but cheaply made...will fall apart!",
      "text": "I thought this bag would be super cute and perfect for my days by the pool during my cruise. But I was wrong, the bag started to fall apart by the 3rd day...it’s a don’t buy for me!",
      "rating": 1.0,
      "verified": true,
      "author": "Wanjiru",
      "helpful_votes": 0,
      "publication_date": 20190906
    },
    {
      "title": "nice beach bag, could be larger",
      "text": "it was definitely a convenient beach bag. I just wish it was bigger to hold our huge beach towels. it was strong and durable.",
      "rating": 4.0,
      "verified": true,
      "author": "Shaday Isehenrien",
      "helpful_votes": 2,
      "publication_date": 20190417
    },
    {
      "title": "Not Durable Enough For Everyday Use",
      "text": "I really liked this bag at first, good size and seemed durable. I started using it mid November. But now it’s January (2 months later) and I already need to replace it. The plastic on the sides are splitting. The bag was a waste of money. It’s just not very durable. 🙁",
      "rating": 1.0,
      "verified": true,
      "author": "Kathi",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Vinyl is the new leather!",
      "text": "Vinyl is the new leather! For the price & purpose, it’s worth it. I’m doing in-person elementary school filled with slobbery kids, and, oh, there’s this pandemic thing happening. Easy to clean & sterilize. Handle with care, I don’t see it having the longevity of leather. Nonetheless, all things operate smoothly: zipper, handle, seams.",
      "rating": 5.0,
      "verified": true,
      "author": "Lindie Sanford",
      "helpful_votes": 0,
      "publication_date": 20200924
    },
    {
      "title": "clear tote",
      "text": "I liked this tote, looks nice & well constructed but the materials used are a lighter weight than I thought it would be. I have to use this every day to enter & exit my workplace so we will just have to see how long it lasts with daily use.",
      "rating": 4.0,
      "verified": true,
      "author": "Rose",
      "helpful_votes": 0,
      "publication_date": 20190321
    },
    {
      "title": "Large enough, seems durable and great price.",
      "text": "I like the size. I will be using it for the college basketball tournaments coming the first part of March. Hopefully it’s not too large. Got caught up in a golf tournament that my clear backpack was too large. It is unfortunate that common sense has left this country. You can see through these bags!",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa F.",
      "helpful_votes": 0,
      "publication_date": 20200226
    },
    {
      "title": "Great purchase",
      "text": "Just what I needed. Gets me through my work security check quickly . The only reason I am giving 4 stars instead of 5 is because it is smaller than I expected.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170817
    },
    {
      "title": "It's cute and great for travels",
      "text": "This is the coolest little bag ever! I put all my hair products in there so in case of spills! It's cute and great for travels!",
      "rating": 5.0,
      "verified": true,
      "author": "Michele M.",
      "helpful_votes": 0,
      "publication_date": 20180702
    },
    {
      "title": "Awesome",
      "text": "I work retail and this is the best value for a great, sturdy bag. Zipper is great! No complaints! I even carry it on my off days. Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "Koi",
      "helpful_votes": 0,
      "publication_date": 20200218
    },
    {
      "title": "Disappointed",
      "text": "This bag was for my mom. Its starting to rip already she don't put a lot of stuff in it its cheap so we won't order it again.",
      "rating": 1.0,
      "verified": true,
      "author": "Joyce",
      "helpful_votes": 2,
      "publication_date": 20160413
    },
    {
      "title": "Perfect size for a purse.",
      "text": "Perfect size. Can hold wallet, bottle of water and lunch as well as sundries. Sturdy and zipper works well. Good purse size.",
      "rating": 5.0,
      "verified": true,
      "author": "Pamela",
      "helpful_votes": 0,
      "publication_date": 20170905
    },
    {
      "title": "A decent size clear tote",
      "text": "I wanted something clear to carry my crochet projects in. This is light and the perfect size for 3 skeins of yarn. It will just zip close if you put a 2 inch binder with the wide side up. I don't go to stadiums so I don't know if this is sufficient for that.",
      "rating": 5.0,
      "verified": true,
      "author": "Shirley Bruce",
      "helpful_votes": 0,
      "publication_date": 20191108
    },
    {
      "title": "Five Stars",
      "text": "Perfect for concerts, football games, airports. Makes checking at the gate fast & easy.",
      "rating": 5.0,
      "verified": true,
      "author": "Pegrita",
      "helpful_votes": 0,
      "publication_date": 20180821
    },
    {
      "title": "Don’t waste your money on this.",
      "text": "Arrived with a hole. No biggie, I sewed it shut. Then it tore open on another part. I threw it away after two weeks of moderate use. Total waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "CatherineRenee",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "This is the perfect size bag to tote all my stuff to work",
      "text": "This is the perfect size bag to tote all my stuff to work. And it's better quality than I've seen with most clear bags. UPDATE: It eventually started falling apart, but it served its purpose while I had it. I ended up buying a smaller, more sturdy clear bag to replace it.",
      "rating": 5.0,
      "verified": true,
      "author": "Lina Metz",
      "helpful_votes": 0,
      "publication_date": 20171205
    },
    {
      "title": "Its ok, thin material",
      "text": "Its ok, won't last too long, as the vinyl is thin. It was cheap, so I guess you get what you pay for.",
      "rating": 4.0,
      "verified": true,
      "author": "Shelley",
      "helpful_votes": 0,
      "publication_date": 20200123
    },
    {
      "title": "Perfect for Casino work",
      "text": "Just what I was looking for to take to work.",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa T.",
      "helpful_votes": 0,
      "publication_date": 20190813
    },
    {
      "title": "Just what I needed.",
      "text": "I have purchased bags like this before and was satisfied with this one. I have to carry a clear bag where I work.",
      "rating": 5.0,
      "verified": true,
      "author": "Online Shopper",
      "helpful_votes": 0,
      "publication_date": 20170704
    },
    {
      "title": "Great for stadium use",
      "text": "We purchased these to carry into a NASCAR race, and they easily fit everything we needed while complying with the track rules for bags.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190828
    },
    {
      "title": "Good bag overall",
      "text": "Good bag overall, but it feels a little cheaply made. I bought it for work so if you’re looking for that it’ll certainly do",
      "rating": 3.0,
      "verified": true,
      "author": "Carolyn",
      "helpful_votes": 0,
      "publication_date": 20180829
    },
    {
      "title": "Cute little lunch bag",
      "text": "I use the bag for lunch. Its perfect and small enough to put into the fridge at work",
      "rating": 5.0,
      "verified": true,
      "author": "D. B. Little",
      "helpful_votes": 0,
      "publication_date": 20200603
    },
    {
      "title": "A must-have",
      "text": "With increased security in public events, this is a good purse to carry essentials to a sports game, musical concerts or even on short weekend travel.",
      "rating": 4.0,
      "verified": true,
      "author": "ASiton",
      "helpful_votes": 0,
      "publication_date": 20180102
    },
    {
      "title": "It’s great.",
      "text": "I love it. It just the right size for my stuff—-not to big or too small. I love the fact that is see through so it is easy to find what I need.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathryn Soliz",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "Large reasonably priced security tote",
      "text": "Not high fashion, but that wasn't expected. It accomplished the goal of getting me through security for a large graduation ceremony. It holds more than expected. The price was right, and it was delivered quickly.",
      "rating": 5.0,
      "verified": true,
      "author": "Grandmother Mimi",
      "helpful_votes": 0,
      "publication_date": 20180607
    },
    {
      "title": "Five Stars",
      "text": "I had to buy this Clear Shoulder Tote for WVU games.",
      "rating": 5.0,
      "verified": true,
      "author": "Renee G.",
      "helpful_votes": 0,
      "publication_date": 20170816
    },
    {
      "title": "Good Sporting Event Bag",
      "text": "Great sports event bag - zipper works well to hold in items when sitting under the seats. Handles are sturdy.",
      "rating": 5.0,
      "verified": true,
      "author": "J. E. Thoma",
      "helpful_votes": 0,
      "publication_date": 20180803
    },
    {
      "title": "Super love it !!!!",
      "text": "I love this !!!! It’s perfect for my stuff going to work.",
      "rating": 5.0,
      "verified": true,
      "author": "Ben",
      "helpful_votes": 0,
      "publication_date": 20191007
    },
    {
      "title": "One time use",
      "text": "Loved it. Then the bottom blew out after just a few weeks. Never packed it full either. Busted at seams, could be seen back together.",
      "rating": 3.0,
      "verified": true,
      "author": "jeri dohner",
      "helpful_votes": 0,
      "publication_date": 20181009
    },
    {
      "title": "Too small for books and folders",
      "text": "Cute bag. Too small to hold notebook. Seams and zipper lightweight. I purchased with intent to use as a work book bag. Too small and flimsy. Will use it for a lunch bag.",
      "rating": 1.0,
      "verified": true,
      "author": "Lana Smith",
      "helpful_votes": 0,
      "publication_date": 20190622
    },
    {
      "title": "Five Stars",
      "text": "love this bag work at a prison and this is perfect",
      "rating": 5.0,
      "verified": true,
      "author": "daisybelle",
      "helpful_votes": 0,
      "publication_date": 20181102
    },
    {
      "title": "Great for work standards.",
      "text": "Work in the prison system, perfect for meeting standards of items allowed. Don’t overload the straps. I would buy again, nothing lasts forever.",
      "rating": 4.0,
      "verified": true,
      "author": "Teresa",
      "helpful_votes": 0,
      "publication_date": 20181102
    },
    {
      "title": "Best part.",
      "text": "Small enough to bring into football stadium and large enough for my jacket, wallet, and a couple bottled water. Best part ... security check is a breeze because they can look right thru to see what's inside.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20151016
    },
    {
      "title": "Great bag, just depends on which size you need.",
      "text": "Nothing wrong with this bag, just that the larger one is working out better for us because it holds more things. Not sure we will ever use this one, but it just depends on which size you need.",
      "rating": 4.0,
      "verified": true,
      "author": "B. J. MacPeek",
      "helpful_votes": 0,
      "publication_date": 20180507
    },
    {
      "title": "Durable",
      "text": "Durable and handy. I especially like the size. It is just right, not too big or small.",
      "rating": 5.0,
      "verified": true,
      "author": "Dara",
      "helpful_votes": 0,
      "publication_date": 20180404
    },
    {
      "title": "Good size too",
      "text": "I bought this bag to use to get into Falcon's games as the Dome has a clear bag policy. They let me through with this bag without an issue (even though it is not NFL certified). Good size too.",
      "rating": 5.0,
      "verified": true,
      "author": "Tori",
      "helpful_votes": 0,
      "publication_date": 20170420
    },
    {
      "title": "I really like this clear and durable bag especially for the price",
      "text": "I really like this clear and durable bag especially for the price, but I was hoping it was a little bit bigger.",
      "rating": 4.0,
      "verified": true,
      "author": "5th Grade Teacher",
      "helpful_votes": 0,
      "publication_date": 20180113
    },
    {
      "title": "One Star",
      "text": "The purse is clear not what the picture looked like.",
      "rating": 1.0,
      "verified": true,
      "author": "Mary Lois Welsh",
      "helpful_votes": 0,
      "publication_date": 20180815
    },
    {
      "title": "It was the perfect size and not cheap made",
      "text": "I purchased this for a concert that required a clear bag. It was the perfect size and not cheap made.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie Cheek",
      "helpful_votes": 0,
      "publication_date": 20160915
    },
    {
      "title": "Love it!",
      "text": "Use it as a work bag. Holds up very well. Definitely recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer Antunes",
      "helpful_votes": 0,
      "publication_date": 20190803
    },
    {
      "title": "ok",
      "text": "It lasted less then 2 years , the start broke. So don't put anything with substantial weight in it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 0,
      "publication_date": 20161028
    },
    {
      "title": "Five Stars",
      "text": "Great product, sturdy and easy to carry. I will be buying another in a different color.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160827
    },
    {
      "title": "About to buy another one.",
      "text": "Great buy! Perfect for corrections! Bottom big! Not too small! Had it a year now maybe and it just got a small tear. It's been well used.",
      "rating": 5.0,
      "verified": true,
      "author": "eboni johnson",
      "helpful_votes": 0,
      "publication_date": 20181028
    },
    {
      "title": "The Red Tote Bag",
      "text": "Bag was received on time and is as pictured. I actually thought it was going to be smaller, but no problem with the size... *smiles* I have more room to place my personal items.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170324
    },
    {
      "title": "magic bag",
      "text": "wonderful bag for work first time I took it to work my co-workers asked me to order them one so I did . And the price is really neat I wish the color black would be available or maybe some other colors.",
      "rating": 5.0,
      "verified": true,
      "author": "norma r rodriguez",
      "helpful_votes": 0,
      "publication_date": 20160319
    },
    {
      "title": "Best Quality I Have Seen",
      "text": "Perfect! Very well made. Good quality. It worked great for the football game. I have another one that came apart the 2nd time I used it.",
      "rating": 5.0,
      "verified": true,
      "author": "Mommy0812",
      "helpful_votes": 0,
      "publication_date": 20161008
    },
    {
      "title": "Recommended",
      "text": "It's clear. It's a bag. Works the way it should",
      "rating": 5.0,
      "verified": true,
      "author": "Kristen",
      "helpful_votes": 0,
      "publication_date": 20190524
    },
    {
      "title": "Five Stars",
      "text": "Working for a sports arena; this helps go through security faster. Thanks",
      "rating": 5.0,
      "verified": true,
      "author": "Stacy McAlister",
      "helpful_votes": 0,
      "publication_date": 20180311
    },
    {
      "title": "A okay",
      "text": "Works good for the purpose I need to use it for",
      "rating": 4.0,
      "verified": true,
      "author": "Gina",
      "helpful_votes": 0,
      "publication_date": 20180829
    },
    {
      "title": "I like this we use it to put small potatoes chips ...",
      "text": "I like this we use it to put small potatoes chips in kichen small bags potatoes chips so we don't overdo it I got one for my sister too nice bag",
      "rating": 5.0,
      "verified": true,
      "author": "miss",
      "helpful_votes": 0,
      "publication_date": 20170228
    },
    {
      "title": "Regulation clear bag",
      "text": "Football game bag. Could be a little studier,but is sufficient.",
      "rating": 4.0,
      "verified": true,
      "author": "CARRIE B. MILES",
      "helpful_votes": 0,
      "publication_date": 20191017
    },
    {
      "title": "Great clesr bag",
      "text": "Perfect size for my needs Seems to be well made, just had it for a couple weeks. Will buy again",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190124
    },
    {
      "title": "Need a clear bag?!",
      "text": "Need a clear bag? Here you go. It's not too big or too small. Needed it because I work in a jail.",
      "rating": 5.0,
      "verified": true,
      "author": "Tessa Verdieck",
      "helpful_votes": 0,
      "publication_date": 20170808
    },
    {
      "title": "Three Stars",
      "text": "bag last about a year so expect that. i use mine a lot tho maybe thats why",
      "rating": 3.0,
      "verified": true,
      "author": "daisy",
      "helpful_votes": 2,
      "publication_date": 20160319
    },
    {
      "title": "Its ok",
      "text": "It serves the purpose but not strong enough to hold heavy items straps are thin",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190403
    },
    {
      "title": "clear zipper tote",
      "text": "This tote is not to big. Large enough to carry a small lunch bag. Best price.",
      "rating": 5.0,
      "verified": true,
      "author": "Verified Purchase",
      "helpful_votes": 0,
      "publication_date": 20160927
    },
    {
      "title": "Nice bag.",
      "text": "Is as pictured. Zipper works well and seems high quality.",
      "rating": 5.0,
      "verified": true,
      "author": "x",
      "helpful_votes": 0,
      "publication_date": 20160420
    },
    {
      "title": "Great product",
      "text": "I use this for work. Durable and holds a lot.",
      "rating": 5.0,
      "verified": true,
      "author": "Cheryse White",
      "helpful_votes": 0,
      "publication_date": 20170422
    },
    {
      "title": "Nice Bag!",
      "text": "Nice size for any event. Seems to be sturdy enough for maximum capacity.",
      "rating": 5.0,
      "verified": true,
      "author": "Patti B",
      "helpful_votes": 0,
      "publication_date": 20190306
    },
    {
      "title": "GREAT!",
      "text": "I doubted at first but this bag is a GREAT bag! I love it!",
      "rating": 5.0,
      "verified": true,
      "author": "tiffany thrift",
      "helpful_votes": 0,
      "publication_date": 20181130
    },
    {
      "title": "Five Stars",
      "text": "Perfect for work, if you work in a place that is tight on security.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Everette",
      "helpful_votes": 0,
      "publication_date": 20150314
    },
    {
      "title": "Five Stars",
      "text": "Very nice bag I use it for work because I work in the airport light and good quality.",
      "rating": 5.0,
      "verified": true,
      "author": "raschild87",
      "helpful_votes": 0,
      "publication_date": 20171129
    },
    {
      "title": "I needed a medium size clear bag for work & ...",
      "text": "I needed a medium size clear bag for work & this bag does the job credibly. It's big enough to carry a bottle of water, a cosmetics bag, a book, & my wallet.",
      "rating": 5.0,
      "verified": true,
      "author": "Alicia Nicole",
      "helpful_votes": 0,
      "publication_date": 20170206
    },
    {
      "title": "Excellent Product",
      "text": "I like them so much until I would like to order three more in various colors. They are exactly what I wanted, and it took no time at all for me to receive them and they were well packaged. I may ever order 6 more.",
      "rating": 5.0,
      "verified": true,
      "author": "San_D_C",
      "helpful_votes": 0,
      "publication_date": 20160201
    },
    {
      "title": "Five Stars",
      "text": "Perfect for where I work - at a correctional facility!",
      "rating": 5.0,
      "verified": true,
      "author": "Robin Ahern",
      "helpful_votes": 0,
      "publication_date": 20170911
    },
    {
      "title": "Five Stars",
      "text": "This bag is perfect for my job at the airport. It holds everything",
      "rating": 5.0,
      "verified": true,
      "author": "andrea nelums",
      "helpful_votes": 0,
      "publication_date": 20170730
    },
    {
      "title": "No flat bottom",
      "text": "It’s perfect for what I needed it for! Great size.",
      "rating": 5.0,
      "verified": true,
      "author": "William Funke",
      "helpful_votes": 0,
      "publication_date": 20200216
    },
    {
      "title": "you can see all your stuff without hunting",
      "text": "i will be ordering more of these. perfect size and inexpensive enough to buy several a year which you have to do because plastic purses crack and are not meant to be long lasting.",
      "rating": 5.0,
      "verified": true,
      "author": "bizzymudda",
      "helpful_votes": 0,
      "publication_date": 20150323
    },
    {
      "title": "Five Stars",
      "text": "right size not heavy light and nice to carry on your shoulder. hold's all my stuff.",
      "rating": 5.0,
      "verified": true,
      "author": "grandmapms",
      "helpful_votes": 0,
      "publication_date": 20160202
    },
    {
      "title": "Four Stars",
      "text": "seems like it is made well and will hold up to what I need it for",
      "rating": 4.0,
      "verified": true,
      "author": "Janice Timmreck",
      "helpful_votes": 5,
      "publication_date": 20140914
    },
    {
      "title": "Great for us in retail!",
      "text": "I work in retail, so end of shift bag checks can be annoying. This allows me to carry what I need and it's clear so managers can just eyeball and I'm good to go! Also plan to use it when we go to a football game this fall.",
      "rating": 5.0,
      "verified": true,
      "author": "Patricia Fuusco",
      "helpful_votes": 0,
      "publication_date": 20150630
    },
    {
      "title": "... zipper part keeps getting caught in the zipper - annoying!",
      "text": "The thread on the zipper part keeps getting caught in the zipper - annoying!",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161027
    },
    {
      "title": "Five Stars",
      "text": "I love my clear shoulder tote. Perfect size and condition. Perfect for my security required job.",
      "rating": 5.0,
      "verified": true,
      "author": "josephina",
      "helpful_votes": 0,
      "publication_date": 20150818
    },
    {
      "title": "Five Stars",
      "text": "wife needs this for work clear bag sad time for our country",
      "rating": 5.0,
      "verified": true,
      "author": "Ken Ruckdeschel",
      "helpful_votes": 0,
      "publication_date": 20161130
    },
    {
      "title": "Nice. Good size. Like the added zipper.",
      "text": "I will use it for work which requires employees to use only clear bags. It will replace a larger one used for Winter months when more \"stuff\" was needed. Glad I chose blue. Enjoy free shipping!",
      "rating": 5.0,
      "verified": true,
      "author": "Ruth Kuzinski",
      "helpful_votes": 0,
      "publication_date": 20150420
    },
    {
      "title": "Big and cheap looking!",
      "text": "It was big, cheap looking and ugly. Not at all what the picture looked like.",
      "rating": 1.0,
      "verified": true,
      "author": "Romonica Lee",
      "helpful_votes": 0,
      "publication_date": 20160919
    },
    {
      "title": "Great tote for the price",
      "text": "Great tote for the price. I use it for work. My co worker had me order one for her as well",
      "rating": 5.0,
      "verified": true,
      "author": "alexandra",
      "helpful_votes": 0,
      "publication_date": 20150211
    },
    {
      "title": "Free shipping is great",
      "text": "I love this tote. It's just what I had been looking for. Thank you",
      "rating": 4.0,
      "verified": true,
      "author": "Cardsintx",
      "helpful_votes": 0,
      "publication_date": 20150908
    },
    {
      "title": "Loved it. Shipping was incredibly fast",
      "text": "Loved it. Shipping was incredibly fast. I ordered Friday morning and got in Monday. Medium size I thought it was going to be smaller so I definitely loved it.",
      "rating": 5.0,
      "verified": true,
      "author": "Griselle",
      "helpful_votes": 0,
      "publication_date": 20150811
    },
    {
      "title": "Five Stars",
      "text": "It's really greatv for my knifes for work I'm a chef",
      "rating": 5.0,
      "verified": true,
      "author": "Gina",
      "helpful_votes": 0,
      "publication_date": 20160912
    },
    {
      "title": "Five Stars",
      "text": "I like the Bag, is perfect. The send was very fast !! I loved it!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160412
    },
    {
      "title": "I purchased two because that what I needed for work ...",
      "text": "I purchased two because that what I needed for work...it has plenty of space, its durable n the price was right.",
      "rating": 5.0,
      "verified": true,
      "author": "Blanche Vaughters",
      "helpful_votes": 0,
      "publication_date": 20150314
    },
    {
      "title": "Five Stars",
      "text": "Perfect for those like me who must pass through security each day.",
      "rating": 5.0,
      "verified": true,
      "author": "Cheryl Harding",
      "helpful_votes": 0,
      "publication_date": 20150225
    },
    {
      "title": "Five Stars",
      "text": "Like them very much tell the rest of my Friend.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160828
    },
    {
      "title": "Five Stars",
      "text": "I love it. I wore it to work and had to order a second one for my coworker.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160329
    },
    {
      "title": "Five Stars",
      "text": "Very easy to tote to work. I will buy another soon.",
      "rating": 5.0,
      "verified": true,
      "author": "korena kerner",
      "helpful_votes": 0,
      "publication_date": 20150525
    },
    {
      "title": "This bag holds a lot of stuff and the zipper is great.",
      "text": "I needed a clear bag to take into work. This bag holds a lot of stuff and the zipper is great.",
      "rating": 5.0,
      "verified": true,
      "author": "Pam Hieber",
      "helpful_votes": 0,
      "publication_date": 20151028
    },
    {
      "title": "Five Stars",
      "text": "It is the perfect size and I can carry it over my shoulders.",
      "rating": 5.0,
      "verified": true,
      "author": "Bernice Crimes",
      "helpful_votes": 0,
      "publication_date": 20150430
    },
    {
      "title": "Not For Me",
      "text": "I didn't like this bag and that is why I given it 4 stars. It was too small yet it says medium. I sent this one back and order a different clear bag. Shipping was excellent. The bag was just not what I was looking for in a medium bag!",
      "rating": 4.0,
      "verified": true,
      "author": "ms.jg",
      "helpful_votes": 2,
      "publication_date": 20150327
    },
    {
      "title": "the seam across the top was off leaving a hole ...",
      "text": "the seam across the top was off leaving a hole in the bag. my coworker purchased the same bag and already has multiple holes in the plastic and broken seams.",
      "rating": 2.0,
      "verified": true,
      "author": "clara andrews",
      "helpful_votes": 5,
      "publication_date": 20160314
    },
    {
      "title": "Clear Shoulder Zipper Tote",
      "text": "Clear Shoulder Zipper Tote * Sorry Amazon \"But\" the quality wasn`t what I expected from you, especially for the price. I found one for $5 bucks that is sturdy and great quality with durable handles ~ these are perfect for going to NFL games etc...",
      "rating": 3.0,
      "verified": true,
      "author": "BS BIRMINGHAM",
      "helpful_votes": 2,
      "publication_date": 20151117
    },
    {
      "title": "Disappointed",
      "text": "Looks great but the fabric is already ripping away from the plastic. Can not use for anything heavy. two water bottles apparently put a strain on it. I will not buy from this company again. Disappointed.",
      "rating": 2.0,
      "verified": true,
      "author": "Sunni",
      "helpful_votes": 3,
      "publication_date": 20151004
    }
  ],
  "product_meta": {
    "title": "Clear Shoulder Zipper Tote",
    "description": "Clear shoulder tote has a top gray zipper and a 600 denier colored fabric bottom with matching handles. Perfect size to carry all the things you need! Bag Dimensions: approx. 16”W x 12”H x 4”G\n\n\n\n\nPRODUCT DETAILS\n * Is Discontinued By Manufacturer :No\n * Package Dimensions :12.91 x 8.58 x 1.61 inches; 4.8 Ounces\n * Date First Available :May 30, 2014\n * ASIN :B00JSA8UW8\n\n * Amazon Best Sellers Rank: #175,875 in Clothing, Shoes & Jewelry (See Top 100 in Clothing, Shoes & Jewelry)  *  #78309 inWomen's Shops \n    *  #61 inWomen's Top-Handle Handbags \n    *  #729 inWomen's Tote Handbags \n   \n   \n\n * Customer Reviews:4.3 out of 5 stars284 ratings Clear shoulder tote has a top gray zipper and a 600 denier colored fabric bottom with matching handles. Perfect size to carry all the things you need! Bag Dimensions: approx. 16”W x 12”H x 4”G",
    "rating": 4.3,
    "feature_bullets": [
      "DURABLE & STURDY – Ensign Peak’s Clear Shoulder Tote with ZIPPER Closure is a sturdy, durable bag that will hold up with repeated use. It is made of 3mm clear PVC with a 600D Poly Vinyl Bottom. As well as being durable, the clear vinyl makes it easy to find things. It is also waterproof which makes it perfect for wet towels and bathing suits. Also, the bag stands up when you set it down, making it easy to fill it up.",
      "SHOULDER LENGTH HANDLES – The shoulder length handles make it easy to carry the bag. The handles are also stitched down the entire height of the bag for added durability. You can carry your items with confidence.",
      "TOP ZIPPER – There is a full length zipper that helps keep your items secure and safe.",
      "SECURITY - Pass through security checkpoints with ease with this see-through bag. Events, concerts, soccer, football, and baseball games are easier to attend and bring your stuff when you have a clear transparent tote bag.",
      "DIMENSIONS & MATERIAL - 16”W x 12”H x 4”, 26\" Handles. Durable 3mm clear PVC with 600D Poly bottom."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "12.91 x 8.58 x 1.61 inches; 4.8 Ounces",
      "Date First Available": "May 30, 2014",
      "ASIN": "B00JSA8UW8"
    },
    "categories": [
      "Women",
      "Top-Handle Bags",
      "Handbags & Wallets",
      "Clothing, Shoes & Jewelry"
    ],
    "price": 7.99
  }
}