{
  "website_summaries": [
    {
      "verdict": "Not for everyone, but kids who want something different might enjoy this model.",
      "pros": [
        "Unique action allows for forward, reverse, and 360-degree spinning action",
        "Has an ergonomic seat for added comfort"
      ],
      "cons": [
        "Some kids might find the arm-powered movement awkward at first"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great wheel chair for kids with broken leg.",
      "text": "We bought this for our 2 year old who broke his leg. We had to put a plastic cutting board for him to put his feet on which worked very well. He got around great on it and loves it. Only complaint is it starts squeaking badly after heavy use. If you leave off the inner caps on the wheel hub you can get some graphite on the axles to help the squeaks.",
      "rating": 5.0,
      "verified": true,
      "author": "jon 371",
      "helpful_votes": 15,
      "publication_date": 20161128
    },
    {
      "title": "Nice But Small",
      "text": "We have had two plastic WhizWheels in our family for thirty years. Kids loved them and we're to their kids loving them and we never see them on the market these days. So when we saw this we were excited. It is metal, well made and perfect, except it doesn't even fit our granddaughter who is 8. It's too small. Disappointed. If they made this the size of our old plastic one it would be a winner.",
      "rating": 3.0,
      "verified": true,
      "author": "Kug",
      "helpful_votes": 4,
      "publication_date": 20190616
    },
    {
      "title": "Best gift of Christmas 2018",
      "text": "I bought the Cyclone for my 4 year old grandson thinking he was the only one small enough to use it. It was the most fought over gift of Christmas with the 6 year old and 8 year old wanting to use it, too. I bought it because my daughter has a small back yard and the Cyclone is very maneuverable and fun, even in tight spaces.",
      "rating": 5.0,
      "verified": true,
      "author": "kellyglazner",
      "helpful_votes": 5,
      "publication_date": 20181231
    },
    {
      "title": "Fantastic",
      "text": "Great toy. When a child broke his leg, we were unable to find a youth wheelchair with no notice. This worked great, and doubled as an awesome toy. Nearly every other kid & parent wondered where they could buy one! Seems these are only available 3rd party...I'm hoping Radio Flyer has not stopped making these as it's been a hit & everyone loves it & wants one!",
      "rating": 5.0,
      "verified": true,
      "author": "igd_2",
      "helpful_votes": 7,
      "publication_date": 20160724
    },
    {
      "title": "I want an adult one!!  THis thing is amazing!",
      "text": "I would give this thing 10 stars if I could. The only thing that really disappoints me about this product, is that it is built for children. I honestly can't remember the last time I watched my kid have so much fun. And it makes me want one for my self!! Radio flyer, please build an adult version of this!!",
      "rating": 5.0,
      "verified": true,
      "author": "Tim Ho",
      "helpful_votes": 12,
      "publication_date": 20151228
    },
    {
      "title": "Great and fun ride on",
      "text": "My 3 year old child immediately sat down and knew how to maneuver - including turning (she did need a slight prompt to go backward). I love it - but I am biased in that I love anything that keeps my child physically active. One downside that I wish radio flyer would fix is that there is no slot in the back of the seat to put a flag for safety. The lack of safety will limit the toy’s usability (it works best on pavement, but I can’t let her ride it anywhere there are cars)",
      "rating": 5.0,
      "verified": true,
      "author": "Diana",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "Good toy but assembly is a bit vague",
      "text": "The instructions are not real clear with pictures or words as to which is the top or bottom of some critical parts. If I had not guessed correctly it would have been very difficult to undo and possibly ruined the toy with trying to take the part off and turn it up. Other than that it’s a good toy for little ones to have fun and use upper body muscles in the process.",
      "rating": 5.0,
      "verified": true,
      "author": "Glenn",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Cyclone Purchase Christmas 2019",
      "text": "The frame of the cyclone is made of metal which should hold up well. Only concern I have is how the large wheels will hold up over time. Wheels are made of plastic. I would like to see Radio Flyer use a wheel with a rubber surface. Not sure how wheels will wear on a rough concrete surface. My grandsons will definitely give these units a good test with time. This item was a Christmas gift for my two grandsons.",
      "rating": 5.0,
      "verified": true,
      "author": "ncap",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "We love it !",
      "text": "My son loves this . Especially with this pandemic I needed something to help him burn energy inside the house . This promotes upper body muscle and strength my son needed something to keep him physically active while I work . It’s quiet and he can roll around the house and spin around in circles until he gets dizzy he enjoys this toy a lot and I would highly recommend this .",
      "rating": 5.0,
      "verified": true,
      "author": "Selena Garcia",
      "helpful_votes": 0,
      "publication_date": 20200430
    },
    {
      "title": "Fun, Fun, Fun",
      "text": "This was a hit with all three boys, ages 4, 5 and 7. The instructions for assembly were in some instances hard to follow. What I missed were the washers for the big wheels. Once they were on it was too difficult to undo and add the washers. My husband came to the rescue for completion, but I have the washers!",
      "rating": 5.0,
      "verified": true,
      "author": "Jane Phillips",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "Kids (all 3) don’t have the upper body power",
      "text": "It’s cool kids LOVED it initially but my kids struggled to use it because of the arm strength required it seems. It wold be great for inside super flat surfaces and a kid under 50lbs. Didn’t fair well on our sidewalk outside and in the paved cove... just too rough",
      "rating": 3.0,
      "verified": true,
      "author": "Dallas in TN",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "I am really pleased with the idea of this product",
      "text": "I am really pleased with the idea of this product. My energetic little 7 year old loves this toy and I like the physical activity she is getting with this cyclone (upper body work to balance out her soccer legs) The product was reasonably priced and shipped quickly, but the assembly directions left much to be desired. Also, the handles (which are pre-assembled) are apparently not sturdy. After a week, one snapped off. I wish the quality were a little better, but overall I am pleased with this purchase.",
      "rating": 3.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 2,
      "publication_date": 20150121
    },
    {
      "title": "Bought two of these for the kids and once I ...",
      "text": "Bought two of these for the kids and once I put them together they had a blast ridding them around the driveway and basketball court at the park. Other kids from around the neighborhood and family friends all had a blast taking turns ridding this around so much I had to buy another one as a backup when neighborhood kids are over playing with the kids.",
      "rating": 5.0,
      "verified": true,
      "author": "phats",
      "helpful_votes": 3,
      "publication_date": 20160102
    },
    {
      "title": "Grandaughter Really Likes It",
      "text": "I bought this for my granddaughter's 4th birthday. She spent the entire time riding it. Great for our long winters when kids tend to be inside more than outside. She will probably be riding it to the park come spring. I had to assemble it, but it wasn't too difficult. There was a compression cap for the wheel that was kind of difficult. I bent one, but they gave an extra. Took about 15-20 minutes to assemble. Keep in mind I'm a handy female that can assemble things easily.",
      "rating": 5.0,
      "verified": true,
      "author": "Jenny",
      "helpful_votes": 2,
      "publication_date": 20150116
    },
    {
      "title": "We love the Cyclone!",
      "text": "My 5 year old daughter played on one of these at a birthday party, and went crazy over it. We bought her one for Easter, and she LOVES it. This has been some good quarantine entertainment.",
      "rating": 5.0,
      "verified": true,
      "author": "Kizzy from Kentucky",
      "helpful_votes": 0,
      "publication_date": 20200419
    },
    {
      "title": "A great toy for a wide age range.",
      "text": "My daughter is just turning 8 and tall for her age, she's also skinny and loved this when I bought it for my nephew who is 3! I was surprised that they both had a lot of fun with this toy and somehow both seemed size appropriate? I had actually never seen this product before I had seen it on amazon so that makes me doubly pleased. 5 star, highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Robbie Ward",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "Typical Radio Flyer Great Quality!",
      "text": "This is a very well made ride on toy that is FANTASTIC for kids who may have mobility issues - there is no leg power needed to make it move, it's all arm work. The wheels are easy to turn and, with some practice, kids can learn how to maneuver it any which way they'd like. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Morgan",
      "helpful_votes": 0,
      "publication_date": 20190307
    },
    {
      "title": "Seems to be a hit",
      "text": "For an active 4 year old boy, this looks like a hit. Goes on the concrete driveway. Took him about 10 minutes to figure it out and away he went. Seems well built and stable. I don't think you could take it for a very long trip, but for goofing around in the driveway, it seems great.",
      "rating": 5.0,
      "verified": true,
      "author": "REN-GJ",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Big hit as a birthday gift!",
      "text": "This little gizmo was a real joy for my little grandson who has just turned 3 years old. He absolutely LOVED it and had no problem getting used to using his hands for mobility while riding. It probably was one of the birthday presents that I've ever given that were a BIG HIT!",
      "rating": 5.0,
      "verified": true,
      "author": "Marcia A. Katz",
      "helpful_votes": 0,
      "publication_date": 20160915
    },
    {
      "title": "Great fun to watch the grandkids on.....",
      "text": "Seems sturdy enough. Tricky to ride, but they like it once the get the hang of it.",
      "rating": 4.0,
      "verified": true,
      "author": "la griffith",
      "helpful_votes": 0,
      "publication_date": 20200223
    },
    {
      "title": "Quality",
      "text": "Good quality, good price. It’s very nice to use for my boys exercise, to strengthen their upper body",
      "rating": 5.0,
      "verified": true,
      "author": "CL",
      "helpful_votes": 0,
      "publication_date": 20200129
    },
    {
      "title": "I'm only giving it 3 stars because several of the screws came loose with nothing more than regular use around the house and now",
      "text": "Bought this for my 4 year old for his birthday. It has been a HUGE hit however, I'm only giving it 3 stars because several of the screws came loose with nothing more than regular use around the house and now it's pretty much useless. This is pretty upsetting to my son because prior to this happening he LOVED it.",
      "rating": 3.0,
      "verified": true,
      "author": "Amber",
      "helpful_votes": 0,
      "publication_date": 20161229
    },
    {
      "title": "would not buy it again, only if the tires were more sturdy",
      "text": "The wheel cracked and broke right away after 1 week of use. My 7 year old disabled child was devastated when this happened. I tried fixing the tire it self by sauntering the crack but it broke again after the initial use. I would recommend using sturdier tires. I tried ordering a Winther Win470 but unfortunately they can not ship to Alaska even if Alaska is the 50th state of the United States of America.",
      "rating": 2.0,
      "verified": true,
      "author": "Michael S.",
      "helpful_votes": 0,
      "publication_date": 20150506
    },
    {
      "title": "A Riding Toy Worth Buying",
      "text": "What a great spinning riding toy this is! Our grandson loves it, and its design promotes dexterity, as you steer it with your hands. No pedals. Turn your hands one way to go backwards, another to speed forward, and another to just spin (which is his favorite!). You'll need a big riding area. A parking lot does well, and a big driveway is good.",
      "rating": 5.0,
      "verified": true,
      "author": "pam coon",
      "helpful_votes": 0,
      "publication_date": 20150430
    },
    {
      "title": "The modern big wheel!",
      "text": "Bought this great item for my 3-year-Old grandson’s birthday. A little hard for him at first, but he’s zipping around just fine now. His 5-year-old brother is very happy when he gets his turn. This is such a fun alternative to their standard bikes....I also think the upper body workout they get from using this is very important...",
      "rating": 5.0,
      "verified": true,
      "author": "Janet L",
      "helpful_votes": 0,
      "publication_date": 20190511
    },
    {
      "title": "Cyclone For Twins",
      "text": "We bought two for twin granddaughters. They will be 4 in August so they are a bit small for the units. I wish the seat was adjustable so that their legs would have fit better. It is well made and easy to assemble with basic tools including a hammer which is needed to set the wheels not to align poorly fitting pieces. The price and value was good and a cute and clever variation on the big wheel using arms not legs. I would not recommend it for sloped driveways or places where a kid could slip into traffic. Allow plenty of room for movement.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160606
    },
    {
      "title": "good product, super slow shipping",
      "text": "product came 2 weeks late for my nephews birthday. that’s why the 2 stars other than that, it’s a good item that they immediately enjoyed as we anticipated they would. yes an upgrade to lightweight rubber wheels would be awesome. you can daddyengineer it yourself to nice wheels.",
      "rating": 2.0,
      "verified": true,
      "author": "jack yang",
      "helpful_votes": 0,
      "publication_date": 20191105
    },
    {
      "title": "My children are in love with this toy",
      "text": "My children are in love with this toy. I cannot keep them off of it and I am so thankful for a toy that allows them to use their muscles and energy! Children aged 2 - 11 are having a blast on this. well constructed and takes a beating all while keeping them busy for hours.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Audrey",
      "helpful_votes": 0,
      "publication_date": 20150114
    },
    {
      "title": "A must have for a strong kid",
      "text": "I bought this as a exercise device for my son. He loves it! it was easy to put together and they include a few extra pieces. watch out for your walls though. the little one will tear through the house at lightening speed while building some sweet upper body strength.",
      "rating": 4.0,
      "verified": true,
      "author": "S.",
      "helpful_votes": 2,
      "publication_date": 20141025
    },
    {
      "title": "Highly Recommend",
      "text": "Santa brought these to our three kids, and they LOVE them! I’m told by the man in red that they were easy to assemble. They’re still intact which means they’re pretty sturdy, and the kids haven’t destroyed them. I highly recommend them. Our kids are 3, 3, and 7. Cheers!",
      "rating": 5.0,
      "verified": true,
      "author": "WhitneyZhou",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "Purchased in September Broken in November",
      "text": "It is a cool idea and the kids enjoyed it but a wheel broke 2 months after purchase.",
      "rating": 2.0,
      "verified": true,
      "author": "Nancy",
      "helpful_votes": 0,
      "publication_date": 20191120
    },
    {
      "title": "Love, love, love this product.",
      "text": "I bought three of these for my grand kids aged 4, 4, and 3. They absolutely love them and are riding them nonstop. My 19 month old grand daughter has even figured out how to sit on it and make it move. She will be getting one for her 2nd birthday in June. I recommend this for all kids. Great for indoors or outdoors and good exercise as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Granny Nanny",
      "helpful_votes": 0,
      "publication_date": 20150108
    },
    {
      "title": "lots of fun",
      "text": "moves well but please supervise because they will put their legs through the openings and could get hurt.",
      "rating": 5.0,
      "verified": true,
      "author": "Pamela Ruffalo",
      "helpful_votes": 0,
      "publication_date": 20181228
    },
    {
      "title": "Five Stars",
      "text": "My little grandson loves this rider. He’s 4 and had no trouble mastering the turns & twirls. Lol",
      "rating": 5.0,
      "verified": true,
      "author": "Florida Girl",
      "helpful_votes": 0,
      "publication_date": 20180831
    },
    {
      "title": "Bought 2, both broke the first day",
      "text": "I bought one and the child who rode it LOVED IT, but it broke the first day. I ordered a second one immediately from a second vendor, and the same thing happened. The wheel split at the axle on both toys. This was hugely disappointing all around.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181019
    },
    {
      "title": "Its a Christmas gift",
      "text": "Item was damaged while arriving at Fed Ex facility. They were no lobger in stock when I finally discovered the problem. Sad to disappoint my 3 year old grandson",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181222
    },
    {
      "title": "Great indoor & outdoor ride on toy.",
      "text": "I bought this for my 4 year old grandson. At 1st he did have difficulty with using the Cyclone. Now he plays with it all the time. We have only used it indoors so far but this is a winner.",
      "rating": 5.0,
      "verified": true,
      "author": "Angela Cabiness",
      "helpful_votes": 0,
      "publication_date": 20191213
    },
    {
      "title": "Great for the kids!",
      "text": "The grandchildren were usually here on weekends, this was bought in January, it was fun but with little use and playing outside the plastic piece at the wheel broke off and now is of no use! So sad such a neat item but not really worth the $",
      "rating": 3.0,
      "verified": true,
      "author": "Kathy S. Duncan",
      "helpful_votes": 0,
      "publication_date": 20200205
    },
    {
      "title": "Fun on Wheels",
      "text": "Son is 4 and loves this thing. Daughter likes to steal it from him, she's two years older, and I am 35, and weigh about 105, and can ride on it, as well. We use in indoors and out, doesn't take long to figure out how to turn it. Great little invention, nice to think outside the box.",
      "rating": 5.0,
      "verified": true,
      "author": "BP",
      "helpful_votes": 0,
      "publication_date": 20141125
    },
    {
      "title": "Highly recommend",
      "text": "Highly recommend this item! My grandson loves, it is durable and FUN! Grandkids arguing over it now!!",
      "rating": 5.0,
      "verified": true,
      "author": "bjos",
      "helpful_votes": 0,
      "publication_date": 20180105
    },
    {
      "title": "his 8 year old brother could easily get in it and wheel it around too",
      "text": "So cute! For our 5 year old nephew... his 8 year old brother could easily get in it and wheel it around too.",
      "rating": 5.0,
      "verified": true,
      "author": "Hohan",
      "helpful_votes": 0,
      "publication_date": 20170406
    },
    {
      "title": "It was bought for my greatgranddaughter. She was born ...",
      "text": "It was bought for my greatgranddaughter. She was born where she could not walk. This cycle with the handles she can be put in it and be outside with all the other kids and is has made a difference in her life. She is 5 yrs old and a outgoing young lady. I wish you could see the smile on her face the first time she got in it. Thank you so much Grandma Ann",
      "rating": 5.0,
      "verified": true,
      "author": "Erna A Jones",
      "helpful_votes": 0,
      "publication_date": 20160605
    },
    {
      "title": "Wonderful present",
      "text": "My granddaughter who has spinabifida. Can get around in this like crazy she loves it",
      "rating": 5.0,
      "verified": true,
      "author": "cathy mansur",
      "helpful_votes": 0,
      "publication_date": 20200121
    },
    {
      "title": "Three Stars",
      "text": "product seems sturdy, grandson is not interested in it as yet.",
      "rating": 3.0,
      "verified": true,
      "author": "Cheryle Neill",
      "helpful_votes": 0,
      "publication_date": 20180311
    },
    {
      "title": "Super fun for kids",
      "text": "Super fun for kids! Watching them fugue out how to operate and steer it is really fun. They pick it up pretty quick. Only negative is that it's super small.",
      "rating": 5.0,
      "verified": true,
      "author": "John Little",
      "helpful_votes": 0,
      "publication_date": 20160515
    },
    {
      "title": "Great gift",
      "text": "4,5 and 6 year old love it. Easy to maneuver.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170303
    },
    {
      "title": "Watch your feet!",
      "text": "The plastic wheels didn't quite thrill me, but it was easy to assemble and the word is that my Grandson loves it. The frame is metal. Overall it seems well-made. Just remember to watch your feet as it can roll right over them... :)",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer2004",
      "helpful_votes": 0,
      "publication_date": 20150120
    },
    {
      "title": "Grandkids favorite gift",
      "text": "Love that it’s something they have to actually physically make happen",
      "rating": 5.0,
      "verified": true,
      "author": "Happy customer ",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Bought this for my 5 yr old grandson for his ...",
      "text": "Bought this for my 5 yr old grandson for his birthday. Once mom and dad finally figured out how to assemble it my grandson absolutely LOVES it!",
      "rating": 5.0,
      "verified": true,
      "author": "Ellen Fiducia",
      "helpful_votes": 0,
      "publication_date": 20160627
    },
    {
      "title": "Gift broke after 1month",
      "text": "I was just informed by my daughter in-law that the cyclone’s wheel broke off a couple of weeks ago. Would like to discuss with a representative.",
      "rating": 1.0,
      "verified": true,
      "author": "Linda Ackerman",
      "helpful_votes": 0,
      "publication_date": 20190131
    },
    {
      "title": "Tires get worn fast but very sturdy frame",
      "text": "My grangson loves this since he can not ride a bike because he is in a wheel chair. It is the second one we've bought he wore the wheels out on the last one.",
      "rating": 5.0,
      "verified": true,
      "author": "Luis",
      "helpful_votes": 0,
      "publication_date": 20200301
    },
    {
      "title": "Great item!!",
      "text": "My daughter broke her leg and we got this as a way for her to get around and it was awesome!! She loves it! And now all my kids play on it for fun!!",
      "rating": 5.0,
      "verified": true,
      "author": "Jackie Morgan",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Five Stars",
      "text": "Perfect for our 3 yo who broke his leg. He goes everywhere in it. Awesome product",
      "rating": 5.0,
      "verified": true,
      "author": "Julie L. Crawford",
      "helpful_votes": 0,
      "publication_date": 20170119
    },
    {
      "title": "lots of fun",
      "text": "The kids absolutely love these, we are having a lot of fun watching the children ride these fun cyclones!",
      "rating": 5.0,
      "verified": true,
      "author": "Elle",
      "helpful_votes": 0,
      "publication_date": 20170121
    },
    {
      "title": "My granddaughter loves it",
      "text": "My granddaughter loves it. I have one as a kid and wanted her to have one. She loves to spin so she love it",
      "rating": 5.0,
      "verified": true,
      "author": "karen",
      "helpful_votes": 0,
      "publication_date": 20201009
    },
    {
      "title": "Good toy",
      "text": "My nephews love it. They've also gotten a lot stronger- something we realized when their friends begged for a turn and couldn't go nearly as far or fast or go up hill at all",
      "rating": 5.0,
      "verified": true,
      "author": "Deccan",
      "helpful_votes": 0,
      "publication_date": 20150120
    },
    {
      "title": "Great!!",
      "text": "My nephew who is 4 loved it! Quality good Assembly not bad just follow instructions.",
      "rating": 4.0,
      "verified": true,
      "author": "Carolyn ",
      "helpful_votes": 0,
      "publication_date": 20181225
    },
    {
      "title": "Fun, fun, fun",
      "text": "Grandson had no problem learning to use this. He really likes it.",
      "rating": 2.0,
      "verified": true,
      "author": "Victor K.Millard",
      "helpful_votes": 0,
      "publication_date": 20200124
    },
    {
      "title": "Loved this!",
      "text": "Bought this for my 2 year nephew who broke his leg so he could play also, best ever! He had so much fun and it’s still something he can play with after!",
      "rating": 5.0,
      "verified": true,
      "author": "Katy Pope",
      "helpful_votes": 0,
      "publication_date": 20180914
    },
    {
      "title": "Five Stars",
      "text": "This is the most awesome thing, my granddaughters love them, they are 3 and 5. Just love it",
      "rating": 5.0,
      "verified": true,
      "author": "gwen",
      "helpful_votes": 0,
      "publication_date": 20161208
    },
    {
      "title": "Four Stars",
      "text": "the gandkids love it. after 4 or so years it is faded badly",
      "rating": 4.0,
      "verified": true,
      "author": "Kay Morris",
      "helpful_votes": 0,
      "publication_date": 20180417
    },
    {
      "title": "My son LOVES this",
      "text": "Super happy with this. My son has had so much fun riding it and it's different than anything I have seen before.",
      "rating": 5.0,
      "verified": true,
      "author": "Crystal Clayton",
      "helpful_votes": 0,
      "publication_date": 20170104
    },
    {
      "title": "Very small, plastic, not worth the money.",
      "text": "Not what I thought at all. It's mostly plastic. Not easy to assemble. A 5 year olds will have a hard time riding it because it's so small.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170111
    },
    {
      "title": "Kids didn’t like it! one of wheels feel off the first ...",
      "text": "Kids didn’t like it ! one of wheels feel off the first day :( not as fun as it looks ;/",
      "rating": 1.0,
      "verified": true,
      "author": "Paris vella",
      "helpful_votes": 0,
      "publication_date": 20180604
    },
    {
      "title": "AWESOME FUN! I bought this for my nephew's 3rd ...",
      "text": "AWESOME FUN! I bought this for my nephew's 3rd birthday! It was a BIG hit, but works best on sidewalks - not so much on dirt surfaces.",
      "rating": 5.0,
      "verified": true,
      "author": "Christine Huffman",
      "helpful_votes": 0,
      "publication_date": 20150202
    },
    {
      "title": "fun toy for everyone",
      "text": "good sturdy toy for my three year old grandson. His 8 year old sister and 6 year old brother liked it as well",
      "rating": 4.0,
      "verified": true,
      "author": "joan blair",
      "helpful_votes": 0,
      "publication_date": 20141115
    },
    {
      "title": "radio flyer=quality everytime!",
      "text": "Can't wait till my 3 yo sees this under tree! Love its gender neutral and can't go wrong w radio flyer!",
      "rating": 5.0,
      "verified": true,
      "author": "That Girl",
      "helpful_votes": 0,
      "publication_date": 20141129
    },
    {
      "title": "One of the best toys we've ever bought.",
      "text": "Dollar for dollar this is one of the best toys we've ever bought for our child.",
      "rating": 5.0,
      "verified": true,
      "author": "Tony",
      "helpful_votes": 0,
      "publication_date": 20160816
    },
    {
      "title": "This gift was a Big Hit at my nephews 5th ...",
      "text": "This gift was a Big Hit at my nephews 5th birthday party. They had never seen one before, so all the kids were clamoring for a chance to ride it.",
      "rating": 5.0,
      "verified": true,
      "author": "Serita Harper",
      "helpful_votes": 0,
      "publication_date": 20141109
    },
    {
      "title": "This toy is great!! My grandson is two and a half ...",
      "text": "This toy is great!! My grandson is two and a half and has no problem riding it and he loves it!!",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20150108
    },
    {
      "title": "my grandson loved it, and I even got to ride",
      "text": "Took me back to my childhood. my grandson loved it, and I even got to ride.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161227
    },
    {
      "title": "Great toy",
      "text": "My 4, almost 5 year old loves his cyclone. He rides it numerous times a day. We use ours inside now but I think it'll be used just as much outside once the weather gets warmer",
      "rating": 5.0,
      "verified": true,
      "author": "Bseib",
      "helpful_votes": 0,
      "publication_date": 20150105
    },
    {
      "title": "... & the older kids ( 5 to 8 ) like it but it's too much of a challenge for ...",
      "text": "Have a daycare & the older kids ( 5 to 8 ) like it but it's too much of a challenge for younger ones !",
      "rating": 4.0,
      "verified": true,
      "author": "kathryn proffitt",
      "helpful_votes": 0,
      "publication_date": 20150611
    },
    {
      "title": "They love their cyclone",
      "text": "my boys got on and went crazy. They love their cyclone.",
      "rating": 5.0,
      "verified": true,
      "author": "April M. Sandoval",
      "helpful_votes": 0,
      "publication_date": 20141230
    },
    {
      "title": "It's pretty good, but the plastic wheels slip",
      "text": "It's pretty good, but the plastic wheels slip. It would be better with rubber wheels. Was the right size for our 4 year old.",
      "rating": 4.0,
      "verified": true,
      "author": "Orly",
      "helpful_votes": 0,
      "publication_date": 20150409
    },
    {
      "title": "Awesome!",
      "text": "Our 3 & 5 year old boys both love it!! So fun and a great way to get their energy out!",
      "rating": 5.0,
      "verified": true,
      "author": "Jacob B",
      "helpful_votes": 0,
      "publication_date": 20150104
    },
    {
      "title": "Hard to go wrong with Radio Flyer.",
      "text": "No problems with assembly. My 4 year old granddaughter was the first to try it out. After using it a couple of trips around the playroom she asked, \"do you have any other cool things?\"",
      "rating": 5.0,
      "verified": true,
      "author": "Charles",
      "helpful_votes": 0,
      "publication_date": 20150531
    },
    {
      "title": "All loved it. The 4 yr",
      "text": "All the kids at the birthday party took a ride on it (ages 3-10). All loved it. The 4 yr., old whose gift it was, loves to spin around in circles or race across the driveway. Unique, but fun toy.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20150718
    },
    {
      "title": "Buy it",
      "text": "My four year old loves this Cyclone 640. well made too.",
      "rating": 5.0,
      "verified": true,
      "author": "HighGround",
      "helpful_votes": 0,
      "publication_date": 20150127
    },
    {
      "title": "Best gift ever",
      "text": "This gift has worked wonders for my 5 yo with sensory processing disorder. It is wonderful heavy work. When my sons \"engine is running high\" he will go crazy in this for five or ten minutes and it levels him right out. Every kid who comes to our house has to try it...they all love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Krystal Fuer",
      "helpful_votes": 0,
      "publication_date": 20150109
    },
    {
      "title": "Five Stars",
      "text": "All the kids in the neighborhood want to play with it. Helps build up the arm muscles and coordination.",
      "rating": 5.0,
      "verified": true,
      "author": "Ellen K",
      "helpful_votes": 0,
      "publication_date": 20170512
    },
    {
      "title": "Too bad they don't sell this in grown up sizes",
      "text": "5 yo son got this from Santa! What a hit! Too bad they don't sell this in grown up sizes!",
      "rating": 5.0,
      "verified": true,
      "author": "Katie S.",
      "helpful_votes": 0,
      "publication_date": 20150123
    },
    {
      "title": "Five Stars",
      "text": "Excellent purchase..my grandson loves it. Thanks to radio flyer for the excellence.",
      "rating": 5.0,
      "verified": true,
      "author": "Donna Loughran",
      "helpful_votes": 0,
      "publication_date": 20150106
    },
    {
      "title": "Five Stars",
      "text": "My grandson's favorite Christmas gift. And his little sister loves it too.",
      "rating": 5.0,
      "verified": true,
      "author": "muriel",
      "helpful_votes": 0,
      "publication_date": 20150101
    },
    {
      "title": "easy to",
      "text": "bought for niece's birthday. she loves it. easy to assemble",
      "rating": 4.0,
      "verified": true,
      "author": "Norma Reffner",
      "helpful_votes": 0,
      "publication_date": 20141018
    },
    {
      "title": "Five Stars",
      "text": "Great product! Recommended by our occupational therapist. Easy to use and something different to switch things up :)",
      "rating": 5.0,
      "verified": true,
      "author": "Cat",
      "helpful_votes": 0,
      "publication_date": 20151203
    },
    {
      "title": "Very disappointing!!!",
      "text": "This product was very disappointing. One of the tires started to crack and split by the second day. I now have a broken hearted 5 year old.",
      "rating": 1.0,
      "verified": true,
      "author": "Kim Price",
      "helpful_votes": 0,
      "publication_date": 20150403
    },
    {
      "title": "Four Stars",
      "text": "Wonderful product and the price is very appropriate .. my baby love it so much ..",
      "rating": 4.0,
      "verified": true,
      "author": "ABDULLAH,",
      "helpful_votes": 0,
      "publication_date": 20141213
    },
    {
      "title": "Wish they made one for adults!",
      "text": "We bought this for our 3 year old nephew and he absolutely loves it. He is able to ride it up and down a steep driveway with no problem. It is great exercise for building upper body strength and coordination. I wish they made one of these for adults, I would buy one for myself.",
      "rating": 5.0,
      "verified": true,
      "author": "Buys too much stuff from Amazon",
      "helpful_votes": 0,
      "publication_date": 20160720
    },
    {
      "title": "My children really had fun with this but it didn't last nearly as long ...",
      "text": "My children really had fun with this but it didn't last nearly as long as we expected. For Christmas my children were given an assortment of \"bikes\" including a plasma car, ziggles, razor flash rider 360s, and this cyclone. By April the cyclone had self destructed. All the other bikes are still going strong.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20150720
    },
    {
      "title": "NOT ENOUGHT STRONG FOR MY 6 YEAROLD GRANDSON SORRY FOR THE FEEDBACK WAS NEGATIVE IMPACT.",
      "text": "The item wasn't strong enough to for my grandson he is only 6 years old. There was parts missing and some of the parts were very light not enough to strong for my son.",
      "rating": 1.0,
      "verified": true,
      "author": "E Hermosillo",
      "helpful_votes": 2,
      "publication_date": 20170119
    },
    {
      "title": "I would not recommend this if you have a dirt or gravel play ...",
      "text": "My three year old loves this! It does require the smoothest of sidewalks/parking lots as the wheels are plastic. I would not recommend this if you have a dirt or gravel play area.",
      "rating": 5.0,
      "verified": true,
      "author": "HGR",
      "helpful_votes": 0,
      "publication_date": 20141030
    },
    {
      "title": "Best Gift Ever!",
      "text": "I was able to assemble this in about 20 minutes. My 4 year old nephew got on it and has not gotten off. Easy to carry and travel with, safe and easy to use. HE LOVES IT! Great purchase and highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Linda C.  Plumer",
      "helpful_votes": 0,
      "publication_date": 20170109
    },
    {
      "title": "My 4 and 2 year old boys just love it! Very light but sturdy toy",
      "text": "My 4 and 2 year old boys just love it! Very light but sturdy toy. Very easy to operate by my 2 year old boy!",
      "rating": 5.0,
      "verified": true,
      "author": "Don Y.",
      "helpful_votes": 0,
      "publication_date": 20150510
    },
    {
      "title": "Not well constructed...kids bored with it.",
      "text": "This wasn't a good buy. The wheels are not substantial at all and it requires a substantial amount of effort to ride. The net result is that kids who are well within the weight that the wheels can support aren't strong enough to really make it move. Kids who are, such as my 10 year old, cause the wheels to fold up where they ride on the axles. None of my three kids liked it and were quickly bored with it even before the wheels failed. The Razor Rip Rider 360 I got them was a huge hit and I wish I'd bought a couple of those instead.",
      "rating": 1.0,
      "verified": true,
      "author": "PaulaJ",
      "helpful_votes": 0,
      "publication_date": 20141230
    },
    {
      "title": "Had one kinda like this as a child and Loved It",
      "text": "I'm talking Fast fast shipping on this. Had one kinda like this as a child and Loved It.",
      "rating": 5.0,
      "verified": true,
      "author": "Raven Wilson",
      "helpful_votes": 0,
      "publication_date": 20140824
    },
    {
      "title": "Four Stars",
      "text": "Have yet to put it together looks like good quality parts will update when we use it",
      "rating": 4.0,
      "verified": true,
      "author": "keirsten",
      "helpful_votes": 0,
      "publication_date": 20160702
    },
    {
      "title": "My nephew has one and love how it works",
      "text": "bought as a gift... My nephew has one and love how it works...",
      "rating": 5.0,
      "verified": true,
      "author": "colleen5163",
      "helpful_votes": 2,
      "publication_date": 20160628
    },
    {
      "title": "Awesome! I bought it for my 4 Year old ...",
      "text": "Awesome! I bought it for my 4 Year old grandson who loves it. He rode it all over the house ,since it was snowing outside and it doesn't damage the wooden floors. His cousins who were over also loved it. They were 4 and 7 years old and they were both able to ride it comfortably. I highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Patricia",
      "helpful_votes": 0,
      "publication_date": 20180110
    }
  ],
  "product_meta": {
    "title": "Radio Flyer Cyclone",
    "description": "Zoom, Spin and Grin with Cyclone from Radio Flyer. Using arm powered action, you can spin 360⁰ for unlimited fun. Whether you are zooming forward or rolling in reverse, the 16\" wheels offer a smooth ride. This ride on also features comfort handgrips to guide your ride and an ergonomic seat and frame for a comfort ride. The solid steel frame and rear caster wheel ensure years of classic Radio Flyer fun.",
    "rating": 4.5,
    "feature_bullets": [
      "Arm power action and 360 degree Spins",
      "Zoom forward or roll In reverse with comfort handgrips guide your ride",
      "16\" Wheels for a smooth ride and solid steel frame",
      "Ergonomic seat & frame for a comfort ride"
    ],
    "specifications": {
      "Product Dimensions": "29.6 x 25.85 x 15.95 inches",
      "Item Weight": "12.05 pounds",
      "ASIN": "B00J405VH4",
      "Item model number": "640",
      "Manufacturer recommended age": "36 months - 7 years",
      "Best Sellers Rank": "#66,924 in Toys & Games",
      "Customer Reviews": "4.5 out of 5 stars224 ratings4.5 out of 5 stars",
      "Is Discontinued By Manufacturer": "No",
      "Release date": "July 1, 2020",
      "Mfg Recommended age": "36 months - 7 years",
      "Manufacturer": "Radio Flyer Import - Yantian"
    },
    "categories": [
      "Pull-Along Wagons",
      "Tricycles, Scooters & Wagons",
      "Toys & Games"
    ],
    "price": ""
  }
}