{
  "website_summaries": [
    {
      "verdict": "A sleek and functional medicine cabinet. Well built with easy to use \"hang 'n' lock\" installation for minimal install time.",
      "pros": [
        "Adjustable shelf height allows you to personalize to your needs",
        "Can easily be installed into a recess, or simply wall mounted using the patented \"hang 'n' lock\" adjustable wall mounting system"
      ],
      "cons": [
        "Some buyers report receiving the cabinet broken",
        "manufacturer could ensure more protective shipping packaging"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great medicine cabinet BUT... the mirror is defective",
      "text": "This is a wonderful medicine cabinet. It's fits perfectly in the bathroom, lots of space for things. The shelves are not adjustable. Why 2 stars? The mirror is defective. I have a beautiful newly renovated bathroom with a defective mirror. I contacted customer support to see if they will just replace the mirror, since the contractor has already installed the cabinet and completed the project. I can replace a few screws on the mirror, but don't want to mess with the placement of the cabinet itself. This post will get updated based on the customer service from the vendor. I hope they do it right :) (11 Jun 18).",
      "rating": 2.0,
      "verified": true,
      "author": "ME",
      "helpful_votes": 0,
      "publication_date": 20180611
    },
    {
      "title": "Poor hinge",
      "text": "The 24x30 inch croydex looked nice. However when my contractor tried to install it, the top hinge didn't click in and the cabinet wouldn't hold up. It kept coming off the hinge. And realized its impossible to reorder just the hinge part as its from the UK. The part alone is like $50 and then to deliver it. Wouldn't make sense to just order the hinge as the whole cabinet cost about $130. So, poor me out $140 and the time and effort my contractor spent trying to install it. Definitely wouldnt buy it again.",
      "rating": 1.0,
      "verified": true,
      "author": "Ray Chan",
      "helpful_votes": 0,
      "publication_date": 20181013
    },
    {
      "title": "6 months later and we need to replace it!",
      "text": "We installed this mirror in April 2019. It is now October 2019 and the mirror face is sliding off the frame. I don’t even know if this is fixable. It looks like the glue holding the mirror on the front is giving way and the mirror is going to come crashing down. In addition, we had to get new hinges for this mirror to install it since the ones it came with could not support the weight of the mirror door. Minor hassle, but still something to consider if you don’t have access to a specialty cabinet store that sells theses type of slow close hinges.",
      "rating": 1.0,
      "verified": true,
      "author": "Maya",
      "helpful_votes": 0,
      "publication_date": 20191030
    },
    {
      "title": "Flimsy hinges won't hold door",
      "text": "Purchased vanity mirror for a bathroom renovation. Kept the unopened box for several weeks until framing was finished. That ran past the return period, else I would have returned this flimsy cabinet. The door is much too heavy for the cheap hinges, so even if you can get it installed, it's only a matter of time before the door sags. That's if you're lucky. In our case, we couldn't even get the hinges to hold at all, and it was clear the door was going to fall off. They're pressure-snap hinges, and the spring wasn't strong enough to \"snap\" the catch into place. I'd never purchase a product from this company again.",
      "rating": 1.0,
      "verified": true,
      "author": "J.R.",
      "helpful_votes": 0,
      "publication_date": 20190903
    },
    {
      "title": "A DANGEROUS HAZARD. DO NOT BUY!",
      "text": "So incredibly disappointed. As other reviews have noted, the hinges are not strong enough to support the weight of the door. It was a miracle that it fell off in my hands instead of my daughter’s. It would have shattered and severely injured her. This product should be pulled from sales. Someone could be easily killed by it. DO NOT BUY.",
      "rating": 1.0,
      "verified": true,
      "author": "A. NARINE",
      "helpful_votes": 0,
      "publication_date": 20190918
    },
    {
      "title": "My husband had a heck of a time installing the ‘hang and lock’ system but it’s super sturdy. I had been looking for this size ...",
      "text": "We had to wait forever for this because it was out of stock, but it was well worth it! My husband had a heck of a time installing the ‘hang and lock’ system but it’s super sturdy. I had been looking for this size for several months but was not wanting to pay >300 bucks for the Koehler or some other brands. This one is extremely well made and works perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "luckymama",
      "helpful_votes": 0,
      "publication_date": 20180312
    },
    {
      "title": "Bought 2 both damaged",
      "text": "The first one had dents and scratches. Both hinges were damaged. The second one I just took a look at the hinges and they are both damaged.",
      "rating": 1.0,
      "verified": true,
      "author": "Lois Williamson",
      "helpful_votes": 0,
      "publication_date": 20190308
    },
    {
      "title": "Hinges don't work!",
      "text": "The hinges are defective, they won't clip into place and they are not strong enough to hold the mirror door. We can't even use the product. Too bad we didn't try the hinges before we installed it into our wall, which took several hours. Do not but this product.",
      "rating": 1.0,
      "verified": true,
      "author": "thatonechick",
      "helpful_votes": 0,
      "publication_date": 20200324
    },
    {
      "title": "Not Very Deep",
      "text": "This thing is HUGE! Had to cut bigger hole in wall. But it makes the tiny bathroom look blazingly light and roomy. Great for doing hair and shaving. Not very deep, barely store a bottle of shampoo, but for meds and first aid stuff, plenty of shelves.",
      "rating": 5.0,
      "verified": true,
      "author": "jacalyn chin",
      "helpful_votes": 0,
      "publication_date": 20180206
    },
    {
      "title": "Easy installation",
      "text": "We used this one to replace our 40 year old medicine cabinet. I surface mounted this to cover the existing hole. Easy to install with the mounting bracket on top. Then you hang the cabinet onto it and fix to the wall on the bottom. Happy with the product.",
      "rating": 5.0,
      "verified": true,
      "author": "Robrobsen",
      "helpful_votes": 0,
      "publication_date": 20180220
    },
    {
      "title": "Really really vague and bad instructions",
      "text": "You better know what you're doing when you buy this or have a professional install it. I can't complain enough about how stupidly vague the instructions are. If I wasn't already a week behind schedule on this project after receiving a broken mirror and needing to wait for a refund I would return this garbage.",
      "rating": 1.0,
      "verified": true,
      "author": "Travis",
      "helpful_votes": 0,
      "publication_date": 20190502
    },
    {
      "title": "... them but once you do the end result is good i don't trust the butterfly screw they give though",
      "text": "kind of hard to line up 2 of them but once you do the end result is good i don't trust the butterfly screw they give though. it's heavy",
      "rating": 4.0,
      "verified": true,
      "author": "Alan Z",
      "helpful_votes": 0,
      "publication_date": 20180114
    },
    {
      "title": "it's perfect, we love it",
      "text": "The first time this cabinet was delivered it was damaged and missing parts. Clearly someone had opened it and returned it that way. We returned it,got a refund, and ordered another one since our contractor had already left space in the wall for it. It came, it's perfect, we love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Cheryl",
      "helpful_votes": 0,
      "publication_date": 20180308
    },
    {
      "title": "Looks very nice, spacious inside",
      "text": "Looks very nice, spacious inside, but a pain in the a** to install. Tons of small parts that could have been put together pre-delivery for an easier installation process.",
      "rating": 3.0,
      "verified": true,
      "author": "captainwinters",
      "helpful_votes": 0,
      "publication_date": 20180505
    },
    {
      "title": "Width x length are usual measurements this was not what I expected very disappointed!",
      "text": "Advertised incorrectly. Width x length are usual measurements this was not what I expected very disappointed!",
      "rating": 1.0,
      "verified": true,
      "author": "irene",
      "helpful_votes": 0,
      "publication_date": 20180212
    },
    {
      "title": "dont bother",
      "text": "not quality at all. no wonder the price was what it was",
      "rating": 1.0,
      "verified": true,
      "author": "S. S. Ortega",
      "helpful_votes": 0,
      "publication_date": 20190626
    },
    {
      "title": "Five Stars",
      "text": "Love the solid piece front. Was packaged really well, was hesitant about scratches or cracks.",
      "rating": 5.0,
      "verified": true,
      "author": "Rob B",
      "helpful_votes": 0,
      "publication_date": 20171215
    },
    {
      "title": "Bad Contruction",
      "text": "The hinges are not strong enough to hold the door onto to the cabinet.... my contractor had to go buy a new set of hinges.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190910
    },
    {
      "title": "very nice !",
      "text": "i got 2 to replace my old ones and they fit right in the existing openings with no problems. very attractive and excellent quality. mahalo",
      "rating": 5.0,
      "verified": true,
      "author": "roger",
      "helpful_votes": 0,
      "publication_date": 20190315
    },
    {
      "title": "Came broken but was made whole",
      "text": "This is the second of two Medicine Cabinets I bought. The first one was ok but the mirror was not attached to the second one. On closer inspection, the hinges were damaged but they shipped it anyway. I contacted the manufacturer and requested new hinges and they send me some.",
      "rating": 4.0,
      "verified": true,
      "author": "Randy Stimpson",
      "helpful_votes": 0,
      "publication_date": 20190219
    },
    {
      "title": "looks great, but inner mirror already cracked without a lot",
      "text": "looks great,but inner mirror already cracked without a lot pressure",
      "rating": 4.0,
      "verified": true,
      "author": "Davis J Kaleda",
      "helpful_votes": 0,
      "publication_date": 20171230
    },
    {
      "title": "Did not come with shelves or installation parts.",
      "text": "This product did not come with the installation hardware and the shelves were missing. Very disappointed. I like the look and design if only it would’ve come with all the parts I would have given a higher rating.",
      "rating": 1.0,
      "verified": true,
      "author": "paul",
      "helpful_votes": 0,
      "publication_date": 20200123
    },
    {
      "title": "Scratched, scuffed and dented",
      "text": "I knew it was not going to be prrfect but thought it be in better shape than this. All seems to be working ok.",
      "rating": 4.0,
      "verified": true,
      "author": "Shannon Gieck",
      "helpful_votes": 0,
      "publication_date": 20181103
    },
    {
      "title": "Quality is most important to me",
      "text": "Door fell off to much movement in the hinges door to heavy for the 180 degree hinges installed in customer house had to go back and take it out and install a Kohler medicine cabinet hinges are much stronger and door is not as heavy",
      "rating": 1.0,
      "verified": true,
      "author": "Bernard mc Garvey Bernard McGarvey",
      "helpful_votes": 0,
      "publication_date": 20190921
    },
    {
      "title": "Great looking medicine cabinet",
      "text": "Loved the way it looked but it was too big for the space so I returned it. The return process was quick & painless.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190525
    },
    {
      "title": "Fantastic find! Great attention to detail in the design ...",
      "text": "Fantastic find! Great attention to detail in the design and specifications were on point for contractor. Have been recommending this product to anyone I know that needs a medicine cabinet.",
      "rating": 5.0,
      "verified": true,
      "author": "SiviD",
      "helpful_votes": 0,
      "publication_date": 20180710
    },
    {
      "title": "Defective hinges",
      "text": "I had to pay a Handiman to repair and install the cabinet door hardware that was obviously damaged.",
      "rating": 1.0,
      "verified": true,
      "author": "LLL",
      "helpful_votes": 0,
      "publication_date": 20190106
    },
    {
      "title": "Nice cabinet.",
      "text": "Took a couple tries to get one not broken but a large cabinet worth the wait.",
      "rating": 4.0,
      "verified": true,
      "author": "Jeff G.",
      "helpful_votes": 0,
      "publication_date": 20181218
    },
    {
      "title": "They are beautiful, big",
      "text": "I bought two. They are beautiful, big, and hold a lot. They arrived in perfect condition. They were exactly what I was looking for and even better.",
      "rating": 5.0,
      "verified": true,
      "author": "Kati Schmidt",
      "helpful_votes": 0,
      "publication_date": 20171031
    },
    {
      "title": "Too much wrong with the product",
      "text": "Mirror is damage in the coner. side panels mirror is cracked. The hinges were all bent....",
      "rating": 1.0,
      "verified": true,
      "author": "harold.kwon",
      "helpful_votes": 0,
      "publication_date": 20180809
    },
    {
      "title": "Five Stars",
      "text": "perfect fit, and super fast shipping. I highly recommend and would definitely order again.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20171115
    },
    {
      "title": "One Star",
      "text": "Medicine cabinet arrived broken with shattered, cracked, and broken glass and mirror.",
      "rating": 1.0,
      "verified": true,
      "author": "LK",
      "helpful_votes": 0,
      "publication_date": 20170909
    },
    {
      "title": "Very disappointed with Koehler",
      "text": "Spent a small fortune on this mirror. It has flaws in the mirror. If it is mounted flush to the wall the side of the mirror is ugly. Nothing was included to give it a finished look. Very disappointed with Koehler. Everything you buy today is crap. : (",
      "rating": 1.0,
      "verified": false,
      "author": "H. Deatherage",
      "helpful_votes": 0,
      "publication_date": 20180603
    },
    {
      "title": "Came broken",
      "text": "Looks to be a well made heavy product but I received the product with the box damaged and the glass on the inside busted",
      "rating": 2.0,
      "verified": false,
      "author": "Dakota Eiland",
      "helpful_votes": 0,
      "publication_date": 20180111
    },
    {
      "title": "i love the product unfortunately my mirror came with defects",
      "text": "i love the product unfortunately my mirror came with defects, several little dots which makes mirror not fully mirror like :(",
      "rating": 3.0,
      "verified": false,
      "author": "Ms",
      "helpful_votes": 0,
      "publication_date": 20170920
    }
  ],
  "product_meta": {
    "title": "Croydex Haven 30-Inch x 24-Inch Recessed or Surface Mount Medicine Cabinet with Hang 'N' Lock Fitting System, Aluminum",
    "description": "Size:30-Inch x 24-Inch - Single DoorThe Haven single door cabinet features two height adjustable shelves allow you to personalize your cabinet in a way that can maximize the use of space for all your daily lotions and potions. The patented hang 'n' lock easy installation bracket from Croydex is a simple and safe solution to hang your cabinet or mirror. Hang 'n' lock provides the flexibility to change the level of your cabinet or mirror after having drilled your holes making it easy for a single person install.\n\nFROM THE MANUFACTURER\nThe clean, elegant lines of this sophisticated cabinet would suit any style of bathroom and the many innovative and practical features ensure that the cabinet is functional as well as beautiful. The Hang 'N' Lock fixing system allows you to fix the supporting bracket to the wall rather than to the cabinet, so you do not have to struggle to measure distances and mark screw holes whilst supporting a heavy bathroom cabinet. This cabinet can also be surface mounted or recessed - depending on the cavity depth of your bathroom wall - so you can really optimize the space available in your bathroom.",
    "rating": 2.5,
    "feature_bullets": [
      "Aluminum",
      "Aluminum cabinet with mirrored door.Double sided mirrored door with ½” bevel on the front mirror Glass",
      "Two adjustable shelves",
      "165 degree sprung hinges for increased accessibility",
      "Recessed or surface mounted configuration",
      "Easy to install hang 'N' Lock system"
    ],
    "specifications": {
      "Manufacturer": "Croydex",
      "Part Number": "WC101469AZ",
      "Item Weight": "32.6 pounds",
      "Product Dimensions": "5.25 x 24 x 30 inches",
      "Item model number": "WC101469AZ",
      "Is Discontinued By Manufacturer": "No",
      "Size": "30-Inch x 24-Inch - Single Door",
      "Color": "Silver",
      "Finish": "Aluminium",
      "Material": "Aluminum",
      "Shape": "Rectangle",
      "Item Package Quantity": "1",
      "Accessory Connection Type": "2",
      "Plug Profile": "Recessed Mount, Surface Mount",
      "Included Components": "Cabinet, Shelves, Instruction Leaflet, Fittings",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "ASIN": "B00J9Q446M",
      "Customer Reviews": "2.5 out of 5 stars45 ratings2.5 out of 5 stars",
      "Best Sellers Rank": "#411,845 in Home & Kitchen",
      "Date First Available": "March 26, 2014"
    },
    "categories": [
      "Bathroom Accessories",
      "Home & Kitchen",
      "Medicine Cabinets",
      "Bath"
    ],
    "price": ""
  }
}