{
  "website_summaries": [
    {
      "verdict": "A premium green tea lotion that smells great and is easy to apply to the hands, face, and other areas of the body.",
      "pros": [
        "Boasts a pleasant scent that is sure to make you smile",
        "Delivers a soothing effect upon initial application",
        "Green tea lotion can be used both day and night",
        "Lotion is not greasy",
        "Helps unclog pores, treat acne, and address other skin blemishes"
      ],
      "cons": [
        "May cause skin dryness and breakouts for those with sensitive skin"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Long lasting, gentle, smells lovely!",
      "text": "I've been using this for a few months now, and I love it! I have so much product left, too. The lotion itself is thin, a bit runny. It glides over the skin easily, and a little goes a long way. Not greasy, has a pleasant smell. I have combination skin with cystic acne, and I've found it doesn't exacerbate my oily spots, or my acne.",
      "rating": 5.0,
      "verified": true,
      "author": "Hemly",
      "helpful_votes": 11,
      "publication_date": 20170518
    },
    {
      "title": "Light and smells great",
      "text": "It's warm and humid during the spring and summer where I live. Any moisturizer feels too heavy and I feel like a grease ball - I have oily skin. This is very light and smells great. I'm able to put sunscreen on top - I use the Biore Water from Japan - and it doesn't feel greasy at all. During the winter time I have to use a heavier moisturizer because my cheeks get a bit dryer.",
      "rating": 5.0,
      "verified": true,
      "author": "Edna",
      "helpful_votes": 9,
      "publication_date": 20161127
    },
    {
      "title": "Light Lotion Perfect for Summer Time",
      "text": "This is a wonderful light (emphasis on light/runny) lotion that's great for summer time. The smell of this is amazing (I wish it was available in a spray form). I think the lotion would be more suitable for people with oilier skin. Because the bottle has a wide opening, it keeps the freshest during the first 2-3 months, after which the scent starts to fade.",
      "rating": 5.0,
      "verified": true,
      "author": "Sasha",
      "helpful_votes": 3,
      "publication_date": 20180612
    },
    {
      "title": "... this for a few weeks now and I absolutely love it! I did a bunch of research on ...",
      "text": "I've been using this for a few weeks now and I absolutely love it! I did a bunch of research on affordable Korean night lotions before purchasing and watched some Youtube videos where people compared some favorites. Eventually I opted to try this one. It's very light and refreshing on your skin and has been perfect for my normal combination skin. It also softened and smoothed my skin a bit and smells very nice. Highly recommend! Now if only I could afford one of those monthly Korean beauty box sets...",
      "rating": 5.0,
      "verified": true,
      "author": "Kristi",
      "helpful_votes": 2,
      "publication_date": 20180303
    },
    {
      "title": "Sticky texture, hard to open",
      "text": "I was really hoping this would be a pleasing experience, but the lotion ended up being sticky and film-y, creating an odd layer on my skin and then more like... evaporating? Instead of absorbing. Effect: Did not notice any calming or moisturizing effect. Smell: I own several products infused with green tea, but this one smells so sharp and repulsive. I can't return it, so I guess I'll just end up throwing it away... A waste of plastic and money. Anyone got an idea how to qualify for a refund?",
      "rating": 1.0,
      "verified": true,
      "author": "Mariya Zabara",
      "helpful_votes": 0,
      "publication_date": 20190917
    },
    {
      "title": "I'd only recommend buying it if you're willing to sink the cost ...",
      "text": "Got this to try something a little different from my CosRX birch lotion. It works perfectly well, but as others have noted, the scent is quite strong. I'd only recommend buying it if you're willing to sink the cost if you don't like the scent. I'm mixing it with another lotion and will buy another one when I'm done with this.",
      "rating": 3.0,
      "verified": true,
      "author": "Moira Katson",
      "helpful_votes": 0,
      "publication_date": 20180606
    },
    {
      "title": "Didn't fulfill my longing for a real green tea scent...",
      "text": "I bought this moisturizer because it was relatively cheap for a decent quantity, I wanted a lighter moisturizer for summer, and I love the smell of green tea. As a lightweight daytime summer moisturizer it does the job for my normal-to-oily skin, but I was quite disappointed by the fragrance which is the heavy and artificial perfume that will be familiar to many kbeauty users. It does not smell at all like green tea. :(",
      "rating": 3.0,
      "verified": true,
      "author": "salma q",
      "helpful_votes": 0,
      "publication_date": 20180601
    },
    {
      "title": "Simple moisturizer",
      "text": "It's somewhat fragrant but I love the smell anyways and it's a great simple moisturizer. Haven't broken out since using it and I have acne prone skin. However it doesn't moisturize my face enough to the point where I want to wear it all year round. Perhaps the summer, but I think I'm gonna buy something else for winter.",
      "rating": 4.0,
      "verified": true,
      "author": "Artemis",
      "helpful_votes": 0,
      "publication_date": 20171006
    },
    {
      "title": "Smooth, non greasy, and moisturizing",
      "text": "Made the switch from Clinique surge to this and not regretting it. Treats my face and skin well. I have sensitive skin so it avoids the red blotching.",
      "rating": 5.0,
      "verified": true,
      "author": "WoofWoof",
      "helpful_votes": 0,
      "publication_date": 20200324
    },
    {
      "title": "Light, glowy, nice",
      "text": "This is a great face moisturizer for summer. Non greasy/heavy and gives a nice glow, softens skin, hasn’t broken me out. I don’t get what the complaints over the scent was about, it just smells like face lotion? Not overpowering at all... the bottle is pretty, my one complaint is getting the lotion out is sort of like the old glass Heinz ketchup bottles. One of the best lotions I’ve used in a minute though",
      "rating": 5.0,
      "verified": true,
      "author": "Grace",
      "helpful_votes": 0,
      "publication_date": 20200614
    },
    {
      "title": "Great Price.",
      "text": "It's been three months and I still have over half of the bottle left. I use it twice a day. Great price for a lot of product. I have dry skin and acne-prone skin. This did not break me out and it kept my skin hydrated and moisturised. After using this, I felt a noticeable change. My skin became softer and plumper.",
      "rating": 5.0,
      "verified": true,
      "author": "Rini",
      "helpful_votes": 0,
      "publication_date": 20170609
    },
    {
      "title": "Great Price - Pleasantly Moisturizing",
      "text": "I liked everything but the smell. I feel it has a strong scent somewhat like overly perfumey hand lotion. It is not a bad smell, just too strong for me (and I am not bothered by the scents of any of my other products). It feels pleasantly cooling, calms my redness and has reduced oiliness. Soaks in nicely without leaving a residue. Feels very moisturizing but not heavy or greasy at all. Very economical. Bottle is 160mL.",
      "rating": 4.0,
      "verified": true,
      "author": "Tyrone Greenbaum",
      "helpful_votes": 0,
      "publication_date": 20160512
    },
    {
      "title": "feels really nice to apply on my face",
      "text": "feels really nice to apply on my face! but it does get dry quickly. wish it gives more moisturizing effect. i have to apply this twice whenever i wash my face. but i like the smell, like how it gets absorbs nicely (doesn't sit around on the skin layer).",
      "rating": 4.0,
      "verified": true,
      "author": "soo",
      "helpful_votes": 0,
      "publication_date": 20180327
    },
    {
      "title": "i love it",
      "text": "i bough it because i saw a korean girl youtube video, i wasn't waiting to much of it, but after wash my face and aplying it 7 times before sleep for about a week (i didn't use moisturizer), my skin looks more hydrated, i have veins under my eyes and thin skin, now they are less visible, and more filled",
      "rating": 5.0,
      "verified": true,
      "author": "Brenda Mar",
      "helpful_votes": 0,
      "publication_date": 20180128
    },
    {
      "title": "Good Product",
      "text": "This is my third try with the Innisfree product. My first try was the Green Tea Body Lotion, and I love it. The body lotion made me fall in love with the Green Tea line. This one is also an amazing product. Smells good, not greasy and good for oil to normal skin. But it's not moist enough to use in cold days.",
      "rating": 4.0,
      "verified": true,
      "author": "Summer",
      "helpful_votes": 0,
      "publication_date": 20181127
    },
    {
      "title": "nice light smell",
      "text": "Absorbs quickly, nice light smell. I have oily/combination sensitive skin and this stuff works amazing. It has no alcohol which is great too. Works perfectly under makeup, doesn't make you greasy but is still moisturizing.",
      "rating": 5.0,
      "verified": true,
      "author": "Mastaroni",
      "helpful_votes": 0,
      "publication_date": 20170811
    },
    {
      "title": "Caused several breakouts",
      "text": "Has a nice consistency and a strong, yet pleasant smell... but it made me break out. At first, I wasn't even sure what it was that caused my pretty much clear skin to go crazy, then my sister told me that it made her break out and I realized it was the same for me. I have sensitive skin so I'm assuming it was the fragrance in it but I don't know. I had high hopes for it, but it turned out to be a waste of money.",
      "rating": 2.0,
      "verified": true,
      "author": "Lakeisha H.",
      "helpful_votes": 0,
      "publication_date": 20170722
    },
    {
      "title": "I like it",
      "text": "I have dry skin, as I am getting older. Makes my skin very soft and soft. Like it very much",
      "rating": 5.0,
      "verified": true,
      "author": "carole",
      "helpful_votes": 0,
      "publication_date": 20190913
    },
    {
      "title": "This product are the best and through Amazon you can get the brand name/original ...",
      "text": "This product are the best and through Amazon you can get the brand name/original as well as there website from innisfree",
      "rating": 5.0,
      "verified": true,
      "author": "Roxana D",
      "helpful_votes": 0,
      "publication_date": 20180328
    },
    {
      "title": "Worked fine as my intro to AB",
      "text": "Worked fine as my intro to AB, but will be finding a better fit for my combo/dehydrated skin. I'll likely be trying the cult favorite HL Gokujyun Lotion Moist next as my daytime hydrator, and during my night routine.",
      "rating": 3.0,
      "verified": true,
      "author": "Kelly H.",
      "helpful_votes": 0,
      "publication_date": 20160523
    },
    {
      "title": "Skin clearing",
      "text": "I have struggled for a long time to find a moisturizer that compliments my sensitive skin. Since using this my skin has evened in complexion and my breakouts are amost completely gone. A little bit goes along way with this moisturizer and I'm so happy that I tried it!",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20160303
    },
    {
      "title": "In love with this product",
      "text": "Great product that lasts a long time. The product is more for normal/combo skin, but I have very oily skin and it works fine for me and even manages the oil. I would pair this with a heavier moisturizer in the winter if you have normal/combo skin",
      "rating": 5.0,
      "verified": true,
      "author": "Reviewer",
      "helpful_votes": 0,
      "publication_date": 20181202
    },
    {
      "title": "Three Stars",
      "text": "It’s alright but too perfumed’ and not sure it helps with moisturizing",
      "rating": 3.0,
      "verified": true,
      "author": "Eventhorizon333",
      "helpful_votes": 0,
      "publication_date": 20180125
    },
    {
      "title": "Smells very good and the smell is not to strong",
      "text": "It’s light weight and it absorbs very quickly into the skin. It leaves a little glow after applying. Smells very good and the smell is not to strong.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180609
    },
    {
      "title": "she like it",
      "text": "To buy a friend, she said great Hope to continue to maintain good quality and price. Thank you!",
      "rating": 4.0,
      "verified": true,
      "author": "kane",
      "helpful_votes": 0,
      "publication_date": 20170228
    },
    {
      "title": "Overwhelming scent",
      "text": "This lotion is heavily fragranced and irritating for a face lotion. The smell is almost overwhelming. It does not absorb well and leaves skin feeling tight once it has dried. I would not recommend for anyone with sensitive skin.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190131
    },
    {
      "title": "break outs and dryness",
      "text": "I dont usually break out with products since passing the age of 25, especially korean products but this one made my face angry...and its very drying. This is for extremely oily skin and doesnt do much balancing. I have combination skin",
      "rating": 3.0,
      "verified": true,
      "author": "Lauren Jang",
      "helpful_votes": 0,
      "publication_date": 20181002
    },
    {
      "title": "Nice!",
      "text": "A nice light lotion for summer. The fragrance is not at all heavy and smells fresh. Leaves my face soft with no irritation.",
      "rating": 4.0,
      "verified": true,
      "author": "Nashville Nancy",
      "helpful_votes": 0,
      "publication_date": 20150727
    },
    {
      "title": "Barely moiturizes and feels like an unnecessary step in my skincare routine",
      "text": "Very over powering smell that I ignore. Barely moiturizes and feels like an unnecessary step in my skincare routine. Feels nice on the face but I won’t be repurchasing because the product feels useless.",
      "rating": 3.0,
      "verified": true,
      "author": "Christina Williams",
      "helpful_votes": 0,
      "publication_date": 20170929
    },
    {
      "title": "You get less than what you expect",
      "text": "Packaging was not in prime condition, product is as expected.",
      "rating": 4.0,
      "verified": true,
      "author": "bzftvetqovxiz",
      "helpful_votes": 0,
      "publication_date": 20200129
    },
    {
      "title": "Five Stars",
      "text": "SO GOOD!! CLEARED UP MY SKIN VISIABLLY AFTER 2 DAYS! THIS STUFF IS THE REAL DEAL",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170129
    },
    {
      "title": "Perfect thin lotion for combination or oily skin",
      "text": "Perfect thin lotion for combination or oily skin. Just enough moisture for the summer. If I feel like I need a little more (maybe at night), I can layer this product without any issue. Great stuff.",
      "rating": 5.0,
      "verified": true,
      "author": "Courtney",
      "helpful_votes": 0,
      "publication_date": 20150902
    },
    {
      "title": "Four Stars",
      "text": "I mean, it works, but it's not really anything special.",
      "rating": 4.0,
      "verified": true,
      "author": "IvyRosea",
      "helpful_votes": 0,
      "publication_date": 20180731
    },
    {
      "title": "but i really like the evening out it is doing to my skin",
      "text": "i used innisfree when i was living in korea. i never tried this particular green tea line, but i really like the evening out it is doing to my skin. and that there isnt any whitening. however, i was shocked at how watery it was. since the kind i used prior to this was not so watery. but its still doing what i need it do. i guess i dont need toner because of this lotion. but im also now a skin care expert, so maybe im wrong about that",
      "rating": 4.0,
      "verified": true,
      "author": "Alexis Okosa",
      "helpful_votes": 0,
      "publication_date": 20150423
    },
    {
      "title": "Smells amazing! I was so excited to use this whenever ...",
      "text": "Smells amazing! I was so excited to use this whenever I got it and it failed to disappoint. <3 Also came with a sample of other skincare products",
      "rating": 5.0,
      "verified": true,
      "author": "Jully",
      "helpful_votes": 0,
      "publication_date": 20150213
    },
    {
      "title": "bc it might be great for *your* skin",
      "text": "i can see the appeal of this, but it's just not for me. it leaves me feeling less moisturized and more...sticky. I think I just need a creamier lotion. I *do* think it's worth a try, bc it might be great for *your* skin. It smells great, but I think the texture is what doesn't quite jive w/ me. it's much thinner than i expected. it reminds of of pure aloe vera, which is nice, but still leaves me sticky.",
      "rating": 3.0,
      "verified": true,
      "author": "Tera Thompson",
      "helpful_votes": 0,
      "publication_date": 20151016
    },
    {
      "title": "Perfect lotion",
      "text": "I love this lotion. No grease no fuss. Smells good. I think I will use it forever.",
      "rating": 5.0,
      "verified": true,
      "author": "Mouna Abdelwahab",
      "helpful_votes": 0,
      "publication_date": 20150615
    },
    {
      "title": "Liquidy and poor bottle design",
      "text": "It's alright, but two things that I don't like about it is that it is very liquidy and the product design. It would've been MUCH better if they made it as a pump instead. The opening is pretty big, so you have to be careful not to pour it all out.",
      "rating": 3.0,
      "verified": true,
      "author": "choiwj",
      "helpful_votes": 0,
      "publication_date": 20171116
    },
    {
      "title": "it is more liquid than expected and I just don't feel like it is moisturizing enough for me",
      "text": "The product is not what I had in mind, it is more liquid than expected and I just don't feel like it is moisturizing enough for me. It is not terrible, it does it's job, just not how I wanted it to. However, if you have oily skin, this product may help. I have combination, so it left my dryer spots still feeling dry.",
      "rating": 3.0,
      "verified": true,
      "author": "Mandy Fuji",
      "helpful_votes": 0,
      "publication_date": 20160613
    },
    {
      "title": "I was satisfied overall.",
      "text": "It came earlier than I expected it too. I was satisfied overall.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160603
    },
    {
      "title": "Good for me",
      "text": "Good for me! I have combination skin and my face is pro to be sensitive. But this lotion is very good.",
      "rating": 5.0,
      "verified": true,
      "author": "Shirley Zhang",
      "helpful_votes": 0,
      "publication_date": 20150808
    },
    {
      "title": "Good for sensitive skin but not moisturizing",
      "text": "This is a very lightweight lotion (Western lotion, not the toner called lotion in Asian countries). I gave it three stars because if you have sensitive skin, this is perfect. I have tried many moisturizers and this is one of the only ones that doesn't cause breakouts. Unfortunately it doesn't provide nearly enough hydration.",
      "rating": 3.0,
      "verified": true,
      "author": "Patrick Keller",
      "helpful_votes": 3,
      "publication_date": 20161220
    },
    {
      "title": "I love Korean skincare products but really did not care for ...",
      "text": "I love Korean skincare products but really did not care for the smell of this and don't want to use it on my face (what I originally bought it for). Seems to work as a hand lotion product just fine.",
      "rating": 3.0,
      "verified": true,
      "author": "BookReader",
      "helpful_votes": 0,
      "publication_date": 20150812
    },
    {
      "title": "Meh",
      "text": "Unfortunately, the lotion was not as moisturized as I wanted it to be. It's very light and didn't do what I wanted it to. Would notice that my dry patches would be more prominent and it just wasn't a good fit for me. Also, be careful when you're dispensing the product, there's been times where I would get waaaaay too much.",
      "rating": 3.0,
      "verified": true,
      "author": "Chipperella",
      "helpful_votes": 0,
      "publication_date": 20170125
    },
    {
      "title": "... been using this lotion for almost a year and love how light yet moisturizing it is",
      "text": "I've been using this lotion for almost a year and love how light yet moisturizing it is. I also like that it's made with natural ingredients.",
      "rating": 5.0,
      "verified": true,
      "author": "LinaHugh",
      "helpful_votes": 0,
      "publication_date": 20160915
    },
    {
      "title": "Not good for sensitive skin",
      "text": "I didn't have good results with this. My skin is sensitive, oily, and dehydrated. This lotion made me a little less shiny, but it gave me closed comedones. If you don't have sensitive skin, it might work well.",
      "rating": 3.0,
      "verified": true,
      "author": "Hannah",
      "helpful_votes": 5,
      "publication_date": 20151224
    },
    {
      "title": "Holy. Grail.",
      "text": "This is the BEST to put on last in my am routine. I have really oily skin in my t zone, and my makeup would always start to break up there. Since using this before my primer, I haven't had that problem AT ALL, and I'm not sure how I've been living without this. My boyfriend even noticed that my makeup looked so much better at the end of the day!!! I'll never stop using this",
      "rating": 5.0,
      "verified": true,
      "author": "Denner",
      "helpful_votes": 18,
      "publication_date": 20161022
    },
    {
      "title": "Great for Oily, Combo Skin Types and Redness!!",
      "text": "I've been using this product for about 3 months now and I will continue to purchase. Using a dime to quarter size amount at night and day has really balanced my skin. I've seen a decrease in redness and my skin just looks healthier in general. I've noticed a more even skin tone and this is the perfect treat for your skin after every wash because it makes it feel fresh and clean. The scent is a light floral/green tea (not matchal) and it's very refreshing and non irrtitating. I love this lotion and have yet to hit the halfway bottle mark!!",
      "rating": 5.0,
      "verified": true,
      "author": "Briana_Reviews",
      "helpful_votes": 2,
      "publication_date": 20171115
    },
    {
      "title": "Great use for moisturizing",
      "text": "Used this product for over a year and still loving it. Great for moisturizing arms and legs. I tried applying it to my face a little and it did not burn or anything but I did see it make my face turn red..could be irritating my skin since it's sensitive on my face. So now I just don't apply on my face, body is just fine.",
      "rating": 5.0,
      "verified": true,
      "author": "l0limaidi0t",
      "helpful_votes": 0,
      "publication_date": 20190911
    },
    {
      "title": "I suspect this is a fake product",
      "text": "I bought innis free from the physical stores in Asia before, they all have very pleasant smell, but the ones I bought on amazon smell nothing, the texture is different, and I start having out breaks. I never had such skin problem before I used the product.",
      "rating": 1.0,
      "verified": true,
      "author": "Zunzi",
      "helpful_votes": 0,
      "publication_date": 20190328
    },
    {
      "title": "Good for normal skin",
      "text": "This is what my 13 year old daughter uses after she cleanses. She doesn't have oil or dry skin, but she does get pimples. She seems to be keeping the acne that was starting, at bay, by combining this product with a good cleanser and her facial tone looks even. She will probably continue to buy.",
      "rating": 5.0,
      "verified": true,
      "author": "momtocckc",
      "helpful_votes": 6,
      "publication_date": 20150413
    },
    {
      "title": "Great lightweight moisturizer",
      "text": "I typically purchase the Innisfree Green Tea Serum, but needed a little more moisturizer, so chose this. I love it! It's lightweight, gives me the moisture I need, and doesn't make me break out. I'll be purchasing this again. I have sensitive skin, so anything that doesn't cause a facial ruckus is appreciated!",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa",
      "helpful_votes": 0,
      "publication_date": 20171127
    },
    {
      "title": "it's not like your typical lotion that one would find in the ...",
      "text": "This works well with the other products from Innisfree, I have paired this with the olive cream from the same brand and some other products from different Korean brands within my skincare routine. The product itself, is very runny, it's not like your typical lotion that one would find in the States. It's light and smells fresh. If you have dry or dry to normal skin, you may want another facial cream.",
      "rating": 5.0,
      "verified": true,
      "author": "Thailyone Bien Lor",
      "helpful_votes": 0,
      "publication_date": 20160708
    },
    {
      "title": "Good buy for it's price.",
      "text": "Arrived on time with a free sample! The product itself has a strong smell when you first apply it on your face, but it goes away. It is perfect for those combination skin. The entire green tea balancing collection is for combination skin but this one does it's job the best.",
      "rating": 5.0,
      "verified": true,
      "author": "Olivia Ashley",
      "helpful_votes": 0,
      "publication_date": 20160314
    },
    {
      "title": "Five Stars",
      "text": "I love this moisturizer, it's lightweight and doesn't make my oily skin feel greasy under makeup.",
      "rating": 5.0,
      "verified": true,
      "author": "acw123",
      "helpful_votes": 2,
      "publication_date": 20171024
    },
    {
      "title": "Don't recommend for sensitive skin.",
      "text": "I was hoping this lotion would work for me because it smells nice (a bit masculine, though, so some people may not like that) and it's very lightweight. However, it was sticky, didn't feel very moisturizing, and caused me to break out.",
      "rating": 1.0,
      "verified": true,
      "author": "Em B.",
      "helpful_votes": 0,
      "publication_date": 20170922
    },
    {
      "title": "This is a light moisturizer - one of my favorite things about \"emulsions\" is the light texture",
      "text": "This is a light moisturizer - one of my favorite things about \"emulsions\" is the light texture. Living in Orlando is HOT in the summer and I am constantly switching up my skin care routine based on the weather needs. This lotions is light/thin and soft while providing great hydration. Leaves you feeling and smelling the moisture without the heavy thick texture.",
      "rating": 5.0,
      "verified": true,
      "author": "lkmwkl",
      "helpful_votes": 0,
      "publication_date": 20160804
    },
    {
      "title": "It's a great moisturizer for its price",
      "text": "It's a great moisturizer for its price. I gave it 3 stars because my skin still feels dry but it's also because it's winter time. I was previously using skinfood yuja water moisterizer and prefer that.",
      "rating": 3.0,
      "verified": true,
      "author": "Pak",
      "helpful_votes": 0,
      "publication_date": 20180228
    },
    {
      "title": "Three Stars",
      "text": "smells good but its a strong scent, i have sensitive skin so its not my favorite",
      "rating": 3.0,
      "verified": true,
      "author": "Mila",
      "helpful_votes": 0,
      "publication_date": 20181031
    },
    {
      "title": "Love the product. The smell is too much",
      "text": "If you're someone who loves that extreme perfume smell then great, but it was too overwhelming for me. The product is really nice and lightweight though, and perfect especially since the summer time is coming up. Other than the smell, it's incredible!",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170320
    },
    {
      "title": "Love it!",
      "text": "Love it got hooked in Taiwain repurchase all the time !",
      "rating": 5.0,
      "verified": true,
      "author": "Wendy M. Evans",
      "helpful_votes": 0,
      "publication_date": 20180821
    },
    {
      "title": "smells nice (but could be seen as overpowering for some noses)",
      "text": "Moisturizing, smells nice (but could be seen as overpowering for some noses), and goes on well. Doesn't irritate my skin. Gives me a dewy look.",
      "rating": 5.0,
      "verified": true,
      "author": "oo7",
      "helpful_votes": 0,
      "publication_date": 20170820
    },
    {
      "title": "I love this product",
      "text": "I love this product! My skin has improved since I've been using it. My skin doesn't breakout as often and it doesn't get as oily as it used it. It absorbs quickly and leaves my skin soft.",
      "rating": 5.0,
      "verified": true,
      "author": "Georgia Looney",
      "helpful_votes": 0,
      "publication_date": 20160819
    },
    {
      "title": "None sticky and face feels great. Smell not strong which is good.",
      "text": "Great smell and feel. It will leave your face like a newly wed couple.",
      "rating": 5.0,
      "verified": true,
      "author": "Nagi",
      "helpful_votes": 0,
      "publication_date": 20181208
    },
    {
      "title": "I don't recommend thid as your only lotion",
      "text": "I have extremely dry skin. I found that this was very calming, but takes a long time to absorb and doesn't keep my skin hydrated throughout the day. I don't recommend thid as your only lotion. I still use this, but I use it before my thicker lotion. I apply a dime sized amount, pat it in, and then repeat that 3 times. I find that that is easier than applying a normal amount and waiting like 10 minutes for it to absorb.",
      "rating": 3.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 3,
      "publication_date": 20170929
    },
    {
      "title": "I really enjoyed using it as a part of my skin care ...",
      "text": "I really enjoyed using it as a part of my skin care routine. It is supposed to be liquidy and that's what makes it good to keep moisture in your face. I liked the smell although I didn't like it at first, you just kind of get used to it. But overall it's worth trying and I would recommend people under age of 20 to try this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160205
    },
    {
      "title": "Great product. Did what is was supposed to do ...",
      "text": "Great product. Did what is was supposed to do which was help balance out my skin. The dry parts feel moisturized and the rest of my face is less oily. Also had a nice refreshing scent which isn't too strong.",
      "rating": 5.0,
      "verified": true,
      "author": "Colby",
      "helpful_votes": 0,
      "publication_date": 20151205
    },
    {
      "title": "Perfect for my 13 year old's changing skin",
      "text": "Very lightweight. Perfect for my 13 year old's changing skin.",
      "rating": 5.0,
      "verified": true,
      "author": "HeatherB",
      "helpful_votes": 0,
      "publication_date": 20160313
    },
    {
      "title": "Five Stars",
      "text": "my boyfriend love it. very good produce with acceptable price. i would recommend it",
      "rating": 5.0,
      "verified": true,
      "author": "amber",
      "helpful_votes": 0,
      "publication_date": 20170403
    },
    {
      "title": "Skin is pretty much YMMV but this lotion works well for both ...",
      "text": "Bought for relatives and myself. The lotion is light and tea-scented. Works well with combination skin. Skin is pretty much YMMV but this lotion works well for both my skin and relatives'.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170403
    },
    {
      "title": "Won't go without!",
      "text": "This works wonders for combination skin. I have dry, flaky cheeks and nose with a super oily t-zone and this is a miracle worker! Hydrates my parched areas and eliminates oil in my greasy zones. Good sized bottle. Smells fantastic! A little (very little) goes a long way!",
      "rating": 5.0,
      "verified": true,
      "author": "Wet Waffle",
      "helpful_votes": 3,
      "publication_date": 20170307
    },
    {
      "title": "Awesome!",
      "text": "OMG, I love this lotion. I have very sensitive skin on my face, and have always broken out frequently, but also have dry skin. I have previously used the green tea lotion from Proactiv, but can no longer afford it. This lotion is the closest I have found yet. Very light formula, smells nice, and doesn't break my face out or leave my skin feeling greasy. The only thing I would warn people about is that the smell is kinda strong when you first apply it, but it fades quickly.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary",
      "helpful_votes": 2,
      "publication_date": 20161119
    },
    {
      "title": "Highly recommend. I saw my skin get a lot better ...",
      "text": "Highly recommend. I saw my skin get a lot better after 1 day of use",
      "rating": 5.0,
      "verified": true,
      "author": "Ji",
      "helpful_votes": 0,
      "publication_date": 20150226
    },
    {
      "title": "LOVE THIS PRODUCT",
      "text": "I really like this cleanser. The smell is great and it leaves my face fresh and soft. I had acne on my forehead while using a lotion and scrub MADE FOR ACNE and when I switched to this product with green tea and menu pore cleanser from innisfree, there was a huge impact on my acne. My face is so much better now. Definitely recommend this product!!",
      "rating": 5.0,
      "verified": true,
      "author": ":))",
      "helpful_votes": 0,
      "publication_date": 20170423
    },
    {
      "title": "good for wearing under makeup pleasant fragrance Cons",
      "text": "Pros: light weight, good for wearing under makeup pleasant fragrance Cons: not very moisturizing (runny texture) Overall, good enough to add as a step to a routine, but not moisturizing enough to use on its own.",
      "rating": 3.0,
      "verified": true,
      "author": "lizbecca",
      "helpful_votes": 0,
      "publication_date": 20160929
    },
    {
      "title": "Putting this on is like getting punched in the face",
      "text": "I can't get over how overwhelmingly perfumed this product is. Putting this on is like getting punched in the face. Texture and hydration wise this meets my needs but this does not smell like green tea to me at all...just perfume. I have decided this will be my neck or hand lotion since it's a little bit more bearable away from my face.",
      "rating": 2.0,
      "verified": true,
      "author": "Zipperdunk",
      "helpful_votes": 0,
      "publication_date": 20151024
    },
    {
      "title": "One Star",
      "text": "Not really a lotion is more like a liquid. Doesn't moisturize..",
      "rating": 1.0,
      "verified": true,
      "author": "kwabena",
      "helpful_votes": 0,
      "publication_date": 20151014
    }
  ],
  "product_meta": {
    "price": "",
    "specifications": {}
  }
}