{
  "website_summaries": [
    {
      "verdict": "The perfect solution for hotels, family vacations, and trips to grandparents' house.",
      "pros": [
        "Children are subconsciously cued to shift toward the middle for safety when they bump it",
        "Compatible with any size bed or crib mattress",
        "Slips under the sheet",
        "Includes 2 bed rails, compact foot pump, and bag for storage or travel",
        "Inflates in 30 seconds"
      ],
      "cons": [
        "Not a long-term bedroom fixture, but more than adequate for use for nights away from home"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great concept, but they deflate!",
      "text": "These rails are a great concept and they worked for about 2 months. We used them twice to travel and then set them up on my toddler's big boy bed and within two months they have a leak. They deflate within about 2 minutes of blowing them up. So disappointing! They send you a patch with the rails, but I'm not able to find the leak on either one so I couldn't patch it if I wanted to. And now I'm past the timeframe for returning. :(",
      "rating": 2.0,
      "verified": true,
      "author": "Jennelle M.",
      "helpful_votes": 23,
      "publication_date": 20161230
    },
    {
      "title": "UPDATE Manufacture has NOT responded to my warranty claim!",
      "text": "These rails were working great until one developed a leak... no problem, there's a 2 year warranty right? Well, the only way to contact the company is by email and they do NOT respond! A warranty is useless if you cannot get the company to send a replacement for the defective product. UPDATE It took a while for them to respond, but they did and replaced my defective bed rail, I've changed the rating because these are the best inflatable rails I have found",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 7,
      "publication_date": 20180617
    },
    {
      "title": "I wish we would have found these years ago",
      "text": "We bought this for our sons to use on vacation. When they sleep they are all over the place & have fallen out of bed during hotel stays before. I found these & decided to try them. They worked well & our sons stayed in bed all night. My 7 year old slept on one like a body pillow one night & it never lost air. They were easy to inflate & easy to transport. I would definitely buy this again.",
      "rating": 5.0,
      "verified": true,
      "author": "Jill Lowery",
      "helpful_votes": 4,
      "publication_date": 20190602
    },
    {
      "title": "not for active sleepers",
      "text": "Save your money and suitcase space. Just move the matress to the floor. Thats what we did after a night of 2 falls right over the bedrail followed by a kicking/rolling toddler sleeping with his feet in my back as I acted as a living andcery awake bedrail. Left the thing in the condo we rented. Also, if the sheets are not just right, firmly hooking under a mateess, the rail will fall out with a little pushing.",
      "rating": 1.0,
      "verified": true,
      "author": "mishopper",
      "helpful_votes": 8,
      "publication_date": 20160519
    },
    {
      "title": "Great buy when traveling with toddlers.",
      "text": "Bought these for traveling to use in hotel beds. My twins are 2 and have outgrown a pack n play and crib. I bought two sets of rails and made a square on the hotel bed. Both my boys fit in the middle easily. The rails fit under the sheet and stayed put all night. Each rail took about 4 big puffs of air. They deflate quickly and are compact, taking little luggage space! Totally solved our dilemma on where they would be sleeping when we travel!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200822
    },
    {
      "title": "Hotel ready!",
      "text": "1st trip to Disney world with 1 and 3 year old whom I cosleep with. Had no idea how sleeping will work. I found this and tries it out... absolutely great. Was afraid if them rolling off the bed but they stayed put and secures and was easy to set up. Great to travel with and the best part is out of all the chaos you go through while travelling with kids and to have one thing work the way it should... really made my day. I know it's probably not recommended for daily home use but we do use them now that we are back and they have held up quite nicely! Great invention... very impressed.",
      "rating": 5.0,
      "verified": true,
      "author": "Meikacomehome",
      "helpful_votes": 2,
      "publication_date": 20171008
    },
    {
      "title": "Perfect for traveling with kids!",
      "text": "These are absolutely AMAZING. I was going back and forth between these and a pricier set that were $40. I’m so happy I went with these. The price was right and they worked very well. Super easy to inflate and deflate and comes with a great travel pouch. My just turned 3 year old, who is still in a crib at home, had no issues sleeping in a “big bed” on vacation. I bought a second set for my 6 year old for extra security as well. They both did fantastic with them! These are sturdy and fit right under the bed sheet without any issues. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "LG",
      "helpful_votes": 0,
      "publication_date": 20200710
    },
    {
      "title": "The rail came in a nice carrying case with a very ease to use pump ...",
      "text": "I bought this for a three night stay in a hotel with my 27 month old daughter (about 28 lbs). I put one rail on the side of the bed and I slept on the other side. Honestly I don't think her body ever got anywhere near the edge of the bed, but this gave me piece of mind while we both slept. I'm not sure it would prevent a larger child from rolling out of the bed. The rail came in a nice carrying case with a very ease to use pump that only took a minute to inflate. I'm not sure how long it will last, but for the price it can't be beat.",
      "rating": 5.0,
      "verified": true,
      "author": "agb2003",
      "helpful_votes": 0,
      "publication_date": 20180514
    },
    {
      "title": "Excellent Travel Bed Rails",
      "text": "I really LOVED these bed rails. Went to California for a week with my 3 year old and I knew I couldn't move the hotel bed against the wall, so I found these! The were very compact, easy to inflate, and stayed in place under the sheet. My daughter used them as a pillow most the time. They span the length of the bed so I didn't have to worry about her falling off in the middle of the night as well. I would highly recommend this product!",
      "rating": 5.0,
      "verified": true,
      "author": "lorrae",
      "helpful_votes": 0,
      "publication_date": 20190627
    },
    {
      "title": "Works Not At All`",
      "text": "Slid all around on the bed and kept falling off. Did 0 to help a toddler be safe on a bed. There is nothing to hold these in place under your sheets, so they slide around until they fall off the bed. I returned after trying for about a week.",
      "rating": 1.0,
      "verified": true,
      "author": "Alli",
      "helpful_votes": 6,
      "publication_date": 20170928
    },
    {
      "title": "It will deflate! Just a matter of when.",
      "text": "Loved these, until it sprung a leak. They do provide a patch kit, but the hole was right at the seam and the patch is worthless. Used superglue to plug the hole temporarily and ordered a foam bumper. I still think these are great for traveling, but not a long-term solution.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200624
    },
    {
      "title": "Excellent Product",
      "text": "This is a great product. I especially like these for travel as they are lightweight to pack and inflate super quick. They also stay put under a fitted sheet. I did have some issues with the 2 I recently bought for home use in that they developed leaks over a period of time. I wrote to the company directly to let them know and they immediately said they'd send replacements. Excellent customer service! We also used the inflatable toddler bed when my daughter was younger when we traveled. It comes with a fabulous electric pump (with a great warranty) that we still use to this day to inflate pool toys, aero-beds, etc. I highly recommend their products!",
      "rating": 5.0,
      "verified": true,
      "author": "Martha",
      "helpful_votes": 3,
      "publication_date": 20150624
    },
    {
      "title": "Best baby/kid travel innovation EVER!",
      "text": "Best toddler travel innovation in YEARS!! With two boys under 3.5 we have taken these bumpers on every family trip and they work great and roll up super tight to save space in our bags. Ditch the lame hand pump and just use your lungs to blow them up in about 30 seconds. Durable material, smart design and worth every penny! We just returned from 2 weeks of road tripping through New Zealand and had to stay in 8 different locations over the trip. These bumpers made bedtime a breeze as i didn't have to stress about the many different beds that were high off the ground and not safe for my toddlers. BUY THEM!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 0,
      "publication_date": 20170316
    },
    {
      "title": "Great for travel, especially international",
      "text": "Bought this a year and half ago. It's easy to use, great for travel, or every day use. They come with a 2 year hassle free warranty which came in handy. The seams have begun to leak, one delfates over night. I emailed Shrunks and they are sending replacements out. Their customer service is excellent. My only complaint is the patch kit is useless on a seam and that they broke at all. But overall I love the product. I also have Sunnydale ones but they are so much bulkier than these.",
      "rating": 4.0,
      "verified": true,
      "author": "amanda j coates",
      "helpful_votes": 0,
      "publication_date": 20181219
    },
    {
      "title": "Great for temporary use",
      "text": "I am a grandma to a 4 yr old who has outgrown his toddler cot at Nana's. I bought these for the queen size bed I have. They actually fit under your fitted sheet and do stay in place well. After buying these I took my grandson to a hotel and forgot to bring them. I simply rolled up heavy weight bathtowels and placed them under the fitted sheet. Worked exactly the same. You may want to save your money and make your own.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "Doesn’t keep the kid from rolling off the bed",
      "text": "The bumpers hold air fine but they don’t keep my kid from rolling out of bed. He rolled out the first night. I then put a table in front of his bed for a couple of weeks. Tonight was the first night it was removed and he rolled out again. He climbs back into bed on his own, so had I not checked the video, I wouldn’t even know.",
      "rating": 3.0,
      "verified": true,
      "author": "Badger2002",
      "helpful_votes": 0,
      "publication_date": 20200802
    },
    {
      "title": "Totally worth it! 😊",
      "text": "The pump needs some work. It took me longer than what the time advertised when inflating. However, the result was priceless. I was able to sleep at night and not worry during our vacation trip. She was safe on the bed while she slept.",
      "rating": 5.0,
      "verified": true,
      "author": "Nelly Anders",
      "helpful_votes": 0,
      "publication_date": 20181009
    },
    {
      "title": "Great product!",
      "text": "We used this the first time she has ever slept in a grown up bed, I was terrified haha! But it worked great! We ended up having a bed that was against the wall so we partially inflated one of bumpers and folded it and used it at the end of the bed. We never needed it- she stayed in place but was a useful product!",
      "rating": 5.0,
      "verified": true,
      "author": "Evie",
      "helpful_votes": 0,
      "publication_date": 20200919
    },
    {
      "title": "Perfect for roly-poly kids on tall hotel beds",
      "text": "Also perfect for keeping your kid from kicking you all night long when sharing a bed. Easy and quick to inflate, even without a pump. (The one that comes with them isn't very sturdy.) Rolls/folds up compactly for easy storage in a suitcase. Has clingy fabric strips on the bottom that grip a mattress pretty well beneath a fitted sheet.",
      "rating": 5.0,
      "verified": true,
      "author": "Bryan Wingert",
      "helpful_votes": 0,
      "publication_date": 20200510
    },
    {
      "title": "Makes travel bed arrangement easier with little kids",
      "text": "I used it for my 3.5 year old this summer and it worked great. Before this we were using Shrunks inflatable travel matress for kids. However this one is easier when your child is a bit older and doesn’t move like crazy. You can get a hotel room with two queen beds and know your kid would not fall off the bed. Not all hotel rooms have enough space to put a floor matress anyway. Or you can do an airbnb and have your kid sleep in a different room and without worrying.",
      "rating": 5.0,
      "verified": true,
      "author": "Katrina",
      "helpful_votes": 0,
      "publication_date": 20180807
    },
    {
      "title": "Handy for travel",
      "text": "This is nice for travel, but at home a rolled up blanket or stuffed animals tucked under fitted sheet works just as well. My cat popped it in no time. Kinda gimmicky.",
      "rating": 3.0,
      "verified": true,
      "author": "blondie",
      "helpful_votes": 17,
      "publication_date": 20140619
    },
    {
      "title": "Great solution to keeping a young child safe when getting ...",
      "text": "Great solution to keeping a young child safe when getting used to a real bed. One can sit on the rails and read to the child or can climb over them and be right next to them in bed. I like that they are soft and there is nothing to pinch them or get snagged. They are also fairly easy to re-position if needed.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170427
    },
    {
      "title": "A must for overnight travel with toddlers",
      "text": "Simply put, these are indespensible while doing any type of hotel stay with toddlers or pre-schoolers. They pack away so easily in luggage and thy provide a sufficient ‘rail’ once inflated so your little guys don’t roll out of bed. We had one spring a leak but I patched it and it works like new. They also double quite nicely as inflatable jousting sticks for the kids. We actually used one at home for a year in our 3-4 year old sons bed at home when h transitioned to his big boy bed. Cheers.",
      "rating": 5.0,
      "verified": true,
      "author": "Rain Man Did it",
      "helpful_votes": 0,
      "publication_date": 20180510
    },
    {
      "title": "Ideal for traveling with a toddler",
      "text": "Traveling across the country with a 2 year old who knows how to climb out of cribs/pack n play meant we needed an alternative. These bumpers have been amazing! They fold up and fit in a convenient small bag, so we just threw them in our overnight bag, take the 2 minutes it takes to inflate them with the foot pump, and place them under the bed sheets. Each morning it’s a quick deflate and fold them up and we’re on our way. She definitely would have rolled off the bed without them, they have been perfect. Definitely recommending these to my Mommy friends!",
      "rating": 5.0,
      "verified": true,
      "author": "Jordan Harris",
      "helpful_votes": 0,
      "publication_date": 20180709
    },
    {
      "title": "So easy to use and convenient",
      "text": "So easy to use and makes our grandbabies \"big girl\" bed at our house smaller. She moved from the pack and play to a twin because we didn't want to invest in a toddler bed for just a few nights a month. Because these roll up so easy the whole family shares them for her when we travel. They send a great canvas bag to store them in as well. Very pleased and would highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190406
    },
    {
      "title": "Wanted to like these, but my daughter has a concussion now.",
      "text": "So I really wanted to like these. In fact last night my husband and i were raving about them. We have been traveling and used them for 2 weeks, no problem. Until the early hours of this morning. Our almost 4 yo somehow pushed through one side and fell off the bed. Our morning was spent in the ER where she was diagnosed with a concussion. So..... I don’t want to completely slam these, but parents please be aware and don’t get too comfortable with these.",
      "rating": 3.0,
      "verified": true,
      "author": "kwb",
      "helpful_votes": 0,
      "publication_date": 20190310
    },
    {
      "title": "Peace of mind",
      "text": "We have had these inflatable bed rails for a few weeks now and we are impressed. A previous review mentioned their rail deflated but we have not had to give our rails any air since we started using them. They are nice and firm and give us total piece of mind that our toddler will not roll off of her full size bed. They are easy to inflate and install under the sheet and they stay in place. We have no complaints and are very satisfied with this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Anna",
      "helpful_votes": 2,
      "publication_date": 20170823
    },
    {
      "title": "It was easy to inflate",
      "text": "I recently had a chance to use this inflatable bed rail. It was easy to inflate, but I used my electrical pump. The grippy strips at the bottom of the rail really does grip the mattress so the rail stays put and doesn't move. My toddler is an active sleeper and rolls quite a bit and he didn't fall out of bed the 3 nights we were on vacation. I wouldn't use this as a permanent solution for an active sleeper, but for short term usage I definitely recommend it. I love that it has its own carrying pouch and is easy to deflate for traveling.",
      "rating": 5.0,
      "verified": true,
      "author": "MrsDubDeez",
      "helpful_votes": 0,
      "publication_date": 20160821
    },
    {
      "title": "Worked for my 17 months baby in hotel room",
      "text": "Loved it! Was easy to inflate and they held for 3 nights. My boy is very toll, so when hotel told me they only have pack-n-plays i figured the best way is to request 2 full beds in the room and get those for him. I am very happy how it all worked out.",
      "rating": 5.0,
      "verified": true,
      "author": "Eves",
      "helpful_votes": 0,
      "publication_date": 20180813
    },
    {
      "title": "Warranty only good for some sellers.",
      "text": "Just does not last and warranty is useless if not bought from one of about three approved Amazon sellers. It worked well to keep my baby from rolling out of the bed for about three months before it developed a leak at the seam that couldn't be patched. I went to the Shrunks website to try and get a replacement with the warranty but it turns out I had not purchased from a very short list of approved Amazon sellers. Do yourself a favor and double check on the Shrunks website to see if the warranty will cover your purchase or make sure you buy it directly fulfilled and shipped by Amazon.",
      "rating": 3.0,
      "verified": true,
      "author": "Nisa",
      "helpful_votes": 0,
      "publication_date": 20200524
    },
    {
      "title": "Deflates too easily- save your money!",
      "text": "We bought this for my 3 year old daughter in July 2019. The first one in the pack didn’t last very long at all- instantly deflated. Luckily we only needed one for end bed. We’ve been using the second one in the pack and for the last 2 months it deflates EVERY day. Last night it must have deflated while she was sleeping because she fell out of bed this morning and got her head. Not happy with this product and am ready to buy a foam bed bumper.",
      "rating": 2.0,
      "verified": true,
      "author": "Andrea M",
      "helpful_votes": 0,
      "publication_date": 20200405
    },
    {
      "title": "Very disappointed. Have to throw it out",
      "text": "Bought it for travel with my toddler and it worked well. However, we started using it full time after moving our child from toddler bed to twin bed and it started leaking at the seam. Kept the repair patch that came with the bed but considering the leak was on the seam, it didn't adhere properly. Very disappointed. Have to throw it out. Trying the similar rail made out of foam instead. Great idea, poor execution.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180507
    },
    {
      "title": "Very short time of use",
      "text": "Great idea but one sprung a leak in less than 3 weeks and the second did the same a few weeks after. Tried to repair with the enclosed kit but didn’t work well as both continued to leak. Now we just use two bolster pillow inserts under the sheet. Great idea but major design flaw especially at the seams.",
      "rating": 3.0,
      "verified": true,
      "author": "Dawn T.",
      "helpful_votes": 0,
      "publication_date": 20190519
    },
    {
      "title": "Leak at seals, don’t last long! Use pool noodles!",
      "text": "Long overdue update: These didn’t last very long, as I noticed they kept deflating. Found that they were both leaking at the seals, so I was unable to use the hole patches that came with the product. I was very dispointed in thismproduct. Waste of money.... just use a pool noodle, those have been working great for us ever since these inflatable pieces of junk let us down. These are great! Stay in place, inflate and deflate easily. Stores in small bag, perfect for travel.",
      "rating": 1.0,
      "verified": true,
      "author": "Jill",
      "helpful_votes": 2,
      "publication_date": 20160331
    },
    {
      "title": "Great for toddler bed or full length",
      "text": "Product delivers on features. Provides that slight feedback that a kiddo needs to stay in the middle of the bed. I suspect we won't use it too long for our 2 yr old, but it looks like it could last a good, long time.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Hanus",
      "helpful_votes": 0,
      "publication_date": 20200220
    },
    {
      "title": "Excellent for travel!",
      "text": "After a fall out of bed and a broken collar bone on vacation earlier this year, we bought these to use while traveling with our 4 year old. These rails are awesome! The deflated rails, pump, and tubes fit into a bag (included), that takes up less space than my extra pair of shoes in the suitcase. They inflated quickly and easily and we slid them under the fitted sheet on the hotel bed. My son is a very active sleeper, always moving and flipping in his sleep, but these rails kept in bed safely. Excellent for travelling!",
      "rating": 5.0,
      "verified": true,
      "author": "Jillian",
      "helpful_votes": 0,
      "publication_date": 20161128
    },
    {
      "title": "Must have for toddler travel!",
      "text": "My 2 year old sleeps with bed rails at home so when we went on vacation to stay at an AirBnB I was nervous about how he’d sleep but these made it so easy. They are quick and simple to set up and effectively kept him from falling out of bed. Pack up very small to fit in the suitcase.",
      "rating": 5.0,
      "verified": true,
      "author": "Katy",
      "helpful_votes": 0,
      "publication_date": 20181009
    },
    {
      "title": "Fell right off the bed with these!",
      "text": "They don’t stay in place very well and on night 2 of using them, my son rolled right over them and on to the floor. Nice for traveling but not realistic to keep a child from falling off the bed as they are not tall enough. Wouldn’t purchase again.",
      "rating": 1.0,
      "verified": true,
      "author": "Ks19",
      "helpful_votes": 0,
      "publication_date": 20190527
    },
    {
      "title": "Great Product!",
      "text": "This product is so easy to use! I inflated it with the pump that came with it. I placed each bumper under a heavy comforter. They stay exactly where you put them. I put my granddaughter’s sleeping bag between the two bumpers and feel the security of her not rolling out of the twin bed. These will be great for when we travel with her! Nice little bag to carry the deflated bumpers in.",
      "rating": 5.0,
      "verified": true,
      "author": "msheils",
      "helpful_votes": 0,
      "publication_date": 20200217
    },
    {
      "title": "LOVE this product and how smartly designed The Shrunks' line ...",
      "text": "LOVE this product and how smartly designed The Shrunks' line of products are! We have used these inflatable bed rails in hotel rooms, on road trips to grandmother's house to adapt the guest bed for our toddler, and even stuck a single rail down the center of the bed to keep my older child from flopping over into my side of the bed when we had to share on one of our recent trips. Will make his transition to a twin bed this fall easier. Everyone remarks how \"cozy\" The Shrunks' inflatable rails make the bed look for our little one. They hold his cuddle buddies in the bed as well, which is a bonus.",
      "rating": 5.0,
      "verified": true,
      "author": "N. H. 12",
      "helpful_votes": 0,
      "publication_date": 20170826
    },
    {
      "title": "I was skeptical but it worked really well. We ...",
      "text": "I was skeptical but it worked really well. We initially fought the valve but figured out (after reading instructions) that the internal valve stops the air from escaping once you inflate it to it's max. It was used in a hotel room and placed under the mattress cover to ensure it didn't move, which it didn't. It kept all it's air for 3 days no issues with leaks. It comes in a very compact bag with both rails and a pump but once it was opened it was hard to get everything back in (pump didn't fit).",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas J Burke",
      "helpful_votes": 0,
      "publication_date": 20180422
    },
    {
      "title": "Great for travel",
      "text": "They’re quick and easy to inflate/deflate and they allow my daughter to sleep in a regular bed while traveling, now that she’s too big for a pack n play. The only downside is that they lose air after a day or so. So you have to reinflate them every day or 2.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190826
    },
    {
      "title": "Deflates all of a sudden....unfortunate",
      "text": "Loved these for years and they’ve kept my now 5 year old from falling out of bed. However, one of the two started to deflate all of a sudden. Ordered a replacement set, and now the new one won’t stay inflated after less than 2 weeks of use! Can’t find a leak....good idea, bad production. Will be looking for a refund and alternative product. After reading additional reviews, this seems to be a consistent issue that another replacement likely won’t remedy. Unfortunate......",
      "rating": 2.0,
      "verified": true,
      "author": "caswkaid",
      "helpful_votes": 0,
      "publication_date": 20200211
    },
    {
      "title": "Picture is deceiving",
      "text": "Product was easy to inflate and seemed pretty secure when placed under the fitted sheet. Lost a star because the tubes are not as big as pictured...seems half the size. A little concerned that my small child, let alone a bigger one might go right over the top.",
      "rating": 4.0,
      "verified": true,
      "author": "Gypsy Girl",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "Great for travel with young kids.",
      "text": "I have purchased 2 of these for both my young children. Great for hotel rooms or wkend trips to Grandma's. My son (age 3) moves a lot when he sleeps and the shrunk is enough to keep him in bed while sleeping, but allows him to easily climb over to get out of bed while awake. I highly recommend this to anyone with young kids going on any overnight trips.",
      "rating": 5.0,
      "verified": true,
      "author": "Khack",
      "helpful_votes": 0,
      "publication_date": 20180906
    },
    {
      "title": "These are great! Once taken out of the box and placed ...",
      "text": "These are great! Once taken out of the box and placed in the travel bag they hardly take up any room to travel with and are so easy to inflate. Stayed in place under the bed sheets and kept the kiddo from rolling out. I would use one on my toddler bed instead of a bed rail if I could get it under the sheets. Great product!",
      "rating": 5.0,
      "verified": true,
      "author": "Aubrey Stroh",
      "helpful_votes": 0,
      "publication_date": 20170116
    },
    {
      "title": "Problem solver!",
      "text": "Love this. My 2 year old has this on his crib where we took rail off and it really helps them stay in bed. Without it my son would roll out every hour now it's a every so often thing. I think kids like to use it as a pillow too.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristina",
      "helpful_votes": 0,
      "publication_date": 20191001
    },
    {
      "title": "Space saving!",
      "text": "Love that storing it doesn’t take up a ton of space. Comes with patches for holes. Easyily inflates and deflates for travel. My son often ends up with an arm draped over like a pillow. Very pleased with this purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Cnm2846",
      "helpful_votes": 0,
      "publication_date": 20191121
    },
    {
      "title": "Great Concept",
      "text": "Fantastic concept. Packs small. One \"rail\" developed a hole after 3rd use. Cannot justify the cost of replacing given the light use these have not survived. Great concept though!!",
      "rating": 1.0,
      "verified": true,
      "author": "akjs",
      "helpful_votes": 4,
      "publication_date": 20170311
    },
    {
      "title": "They are NOT MADE OF GOOD material. Do not spend the money",
      "text": "These popped each time they sent me a new one. They are NOT MADE OF GOOD material. Do not spend the money. In the end , after about 10 different rails that shrunks sent me thru their two year warranty policy. I've ended up rolling up bathroom towels and placing them at the side of the bands. Those work fine. I've also seen, Styrofoam noodles that are placed at the edge of the bed as well.",
      "rating": 1.0,
      "verified": true,
      "author": "candice",
      "helpful_votes": 4,
      "publication_date": 20170830
    },
    {
      "title": "I bought this one after reading all the good reviews and was pleasantly surprised at the quality of ...",
      "text": "My toddler has a platform type bed and regular swing down bed rails don't fit well. I bought this one after reading all the good reviews and was pleasantly surprised at the quality of it. The rail comes with it's own foot pump so inflating it is a breeze. A handy travel bag comes with it as well, so when it's deflated it can be taken along on trips, such as to grandma's house! I have had no issues with it losing air as some have mentioned. The grips on the underside keep it in place pretty good. Would definitely recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Tink1881",
      "helpful_votes": 0,
      "publication_date": 20160223
    },
    {
      "title": "Not sure the bang for your buck",
      "text": "I have purchased 3 of these so far. When they first came out, they were about 1/2 of the price they are now. The first two have small leaks along the seam, which we have patched a few different times. The third has a different pattern on the rail, and has kept air longer. I'm not going to purchase any more since the price has doubled. I think they are okay for around ten to fifteen bucks, but can't see spending that much money on something that doesn't last extremely long. They do travel well, but using extra pillows or pool noodles gets the job done better.",
      "rating": 3.0,
      "verified": true,
      "author": "Michelle",
      "helpful_votes": 0,
      "publication_date": 20160330
    },
    {
      "title": "Works great",
      "text": "Great product works for my 2 yr old on a twin bed. So much better looking than an ugly gate.. also when she outgrows it I can deflate it and store with it taking up just a couple of inches of storage space (which is why I didn't buy a foam bumper which wld be huge to store).",
      "rating": 5.0,
      "verified": true,
      "author": "TW",
      "helpful_votes": 0,
      "publication_date": 20200304
    },
    {
      "title": "Perfect solution to travel with small kids!",
      "text": "We purchased these bed rails just before a trip to Disney. They were the same price as renting bedrails from the resort, so we thought we'd give them a try. They are perfect for anyone with small kids that travel with any regularity. The quality is top notch and they don't move at all once put into place. The rails themselves fold up very small when deflated and the included pump makes inflation fast and easy. We couldn't be more pleased. Top notch product!",
      "rating": 5.0,
      "verified": true,
      "author": "Courtney",
      "helpful_votes": 0,
      "publication_date": 20180520
    },
    {
      "title": "Works great",
      "text": "Used these in a hotel room sofa bed. They stayed in place and made my toddler's bed more cozy and more like the size he is used to. The rails fit well under the sheet and didn't move unless we moved them.",
      "rating": 5.0,
      "verified": true,
      "author": "JD",
      "helpful_votes": 0,
      "publication_date": 20190306
    },
    {
      "title": "Not for long term use",
      "text": "We used these for a number of months and they worked well, but after time they started developing holes and would deflate each night. We tried patching, but it wouldn't hold. I opted for foam bumpers to keep at home. And will keep these in case we need to travel with them.",
      "rating": 3.0,
      "verified": true,
      "author": "sunnysidesteph",
      "helpful_votes": 0,
      "publication_date": 20190120
    },
    {
      "title": "This was easy to inflate and the pump was included",
      "text": "This was easy to inflate and the pump was included. I have been using it for my 5 year old granddaughter who moves alot when she's sleeping. All of the safety warnings made me a little leary to use it and I probably would not use it with a smaller child because of that. I also think that there should be 2 rails in the package. What you read initially leads you to believe that there are 2 rails in the package, but if you scroll and read the description it clearly states there is only 1 in the package.",
      "rating": 4.0,
      "verified": true,
      "author": "DANIEL THOMPSON",
      "helpful_votes": 0,
      "publication_date": 20180302
    },
    {
      "title": "Great product, does the job!",
      "text": "Bought these for twin platform trundle bed at my inlaws for my 3.6 year old as she recently transitioned to a bed. They work really really well and store in very little space when not in use. Also great for traveling. Highly recommend. Others noted issues with deflation/holes. We have had them for a while now and no issues have arisen!",
      "rating": 5.0,
      "verified": true,
      "author": "Jana",
      "helpful_votes": 0,
      "publication_date": 20180718
    },
    {
      "title": "It really works!",
      "text": "I was a little skeptical, but this thing is really easy to inflate and deflate, fits under our regular sheets without difficulty, stays in place, and keeps my toddler (who moves a LOT in her sleep) from falling out of the bed. It even comes with a little bag to carry the deflated bed rail and pump on trips. Super glad I decided to go ahead and buy it!!",
      "rating": 5.0,
      "verified": true,
      "author": "Liddy",
      "helpful_votes": 0,
      "publication_date": 20180408
    },
    {
      "title": "Both garbage within 6 weeks.",
      "text": "I bought two for my toddlers bed. They never stayed on top of the bed. Every morning I would find them (still under the sheet) on the side of the mattress. Every night before bed I would put them back. After a week one developed a slow leak in one of the seams. After 6 weeks the other one called it quits at a seam as well. I love that these are made from Phthalate, lead and BPA free plastic. However, it seems the resulting plastic is not strong enough to make a secure seal at the seam.",
      "rating": 1.0,
      "verified": true,
      "author": "gshoes",
      "helpful_votes": 0,
      "publication_date": 20150518
    },
    {
      "title": "the pump is useless. Way faster to just blow it up with ...",
      "text": "We take this with us every time we travel! It works really well. We've had one or two instances where it doesn't stay put when hotels do the two top sheet thing instead of a top and bottom sheet. Also, the pump is useless. Way faster to just blow it up with your mouth. Updated: after about a year of using this for travel it stopped holding air. It was wonderful while it worked, but not long lasting.",
      "rating": 2.0,
      "verified": true,
      "author": "Lapearce",
      "helpful_votes": 0,
      "publication_date": 20160906
    },
    {
      "title": "My toddler had to sleep in a full size bed and we were very comfortable putting these railings up under the bed sheets",
      "text": "These were a life saver on our recent trip. My toddler had to sleep in a full size bed and we were very comfortable putting these railings up under the bed sheets. The pump is very small and light (plastic) and does not take up much space in the luggage. Highly recommend. If I didn't have railings at home (big and bulky), I would have used them 24/7 until he is a big bigger.",
      "rating": 5.0,
      "verified": true,
      "author": "SuccessfulBuy",
      "helpful_votes": 0,
      "publication_date": 20161017
    },
    {
      "title": "... you don't use a box spring these are a great alternative to the \"railing\" systems out there",
      "text": "If you don't use a box spring these are a great alternative to the \"railing\" systems out there. I tried several railing systems and they just do not work without a box spring, as it needs something to anchor to. These blow up quickly and simply and stay along the edge of the mattress (versus railings that may take an army of parents to figure out assembly). I ordered two, one for each side of the bed. Occasionally they need to be pushed back into place. My toddler has never rolled over the edge of them. I feel like it has enough of an edge to keep him in the bed.",
      "rating": 5.0,
      "verified": true,
      "author": "Maddyoverhere",
      "helpful_votes": 0,
      "publication_date": 20150509
    },
    {
      "title": "Great product",
      "text": "So far we really like this bed rail. Great price and easy to use. We have a platform bed for my daughter and was looking for something easy and simple. This was perfect. It stays in place under the sheet and keeps my little one from falling out of bed so far. We have only been using it for a week though. I recommend it for the price compared to getting a rail that is always in the way! It comes with pump that was easy and fast to use.",
      "rating": 4.0,
      "verified": true,
      "author": "loafer",
      "helpful_votes": 0,
      "publication_date": 20151221
    },
    {
      "title": "These work great as establishing a \"bump guard\"",
      "text": "These work great as establishing a \"bump guard\", however, would NEVER keep a child from falling out of the bed. The item fits under the sheet but will slip out with a little effort. I initially bought 2 of these for travel when my daughter was small and a crib would not be available. Now we use them in her big girl bed as a little extra protection to help keep her IN the bed. 4 star rating ONLY due to the mattress grips are pretty worthless and therefore they slide around pretty easily.",
      "rating": 4.0,
      "verified": true,
      "author": "Mombear1",
      "helpful_votes": 0,
      "publication_date": 20150530
    },
    {
      "title": "Used for our Co-Sleeping Family Bed",
      "text": "At home and when traveling, these were great physical barriers up until about 7 months and now they're still good for creating a boundary for sleeping babies. I wouldn't use them unsupervised (in person for sleepy or awake babies, video monitor for sound asleep babies) and we use them on our mattress on the floor because they won't really prevent a fall, just discourage going near the edges. Even though they don't \"contain\" small babies/toddlers, we still take ours everywhere and love them. We have two, but I've often thought about buying a 3rd.",
      "rating": 5.0,
      "verified": true,
      "author": "Meggietoro",
      "helpful_votes": 0,
      "publication_date": 20140114
    },
    {
      "title": "Had hole in seam that wouldn't patch after only 2 uses",
      "text": "We got this for traveling. First trip it was OK although it slipped off the bed by night's end. While it kept him from rolling off the bed, he could easily just go over it. And on our second use it kept deflating & we found a small hole on the seem that couldn't be patched. We did try the useless repair kit...No luck... Hole continued to leek. A rolled towel or small swim noodle work better than this overpriced, overrated piece of plastic. Unfortunately the return window expired so needless to say its was a total waste of money!!",
      "rating": 2.0,
      "verified": true,
      "author": "MO&EM",
      "helpful_votes": 0,
      "publication_date": 20140225
    },
    {
      "title": "Excellent",
      "text": "We use this product on our camping trips and works excellent.",
      "rating": 5.0,
      "verified": true,
      "author": "JASON NEIDIG",
      "helpful_votes": 0,
      "publication_date": 20181007
    },
    {
      "title": "Defective Bed Rail the Company has yet to replace",
      "text": "I received this item back in May and one of the bed rails worked fine but the second bed rail had a hole in it from the beginning and would not stay inflated. The first time I emailed the company in May, I was told to email them back on June 1st. I have continued emailing the company and they have yet to respond again. Basically, I have a defective bed rail they will not replace or reimburse the money for.",
      "rating": 1.0,
      "verified": true,
      "author": "christoc",
      "helpful_votes": 0,
      "publication_date": 20200705
    },
    {
      "title": "Perfect for toddler in big bed and on the go.",
      "text": "We got these for my son who recently switched from crib to bed. They are just shorter than the length of the mattress which is perfect. They are sort of triangular shaped when inflated, and one side has a grippy side so it sticks to the mattress under the fitted sheet. They stay inflated well. Good secure valve. I've only had to \"top them off\" with air once in the past 4 months. They stay in place pretty well under the sheet. We took them on vacation too and they folded up and packed slim. We also have the trunks toddler air mattress. Love their products.",
      "rating": 5.0,
      "verified": true,
      "author": "Dublin Mama",
      "helpful_votes": 0,
      "publication_date": 20131122
    },
    {
      "title": "Awful quality - do not waste your time with this one",
      "text": "Piece of junk. I read many reviews that noted the leaking problems and I thought I might be lucky enough to avoid those problems but, alas, that was not to be. These are awful quality and the first one broke after a few nights of use and the second one shortly thereafter. The leak-repair stickers that come with this product are equally useless. Very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "BrianL",
      "helpful_votes": 3,
      "publication_date": 20150426
    },
    {
      "title": "Loses all air within a few hours-unsafe",
      "text": "After a few days this began to deflate within hours after inflating every single night. Meaning it was unsafe after just a few hours as it was so flat it provided no protection at all. I’d like a replacement if you believe this is defective.",
      "rating": 2.0,
      "verified": true,
      "author": "E123",
      "helpful_votes": 0,
      "publication_date": 20190603
    },
    {
      "title": "These are so great. We traveled to the Bahamas with our toddler ...",
      "text": "These are so great. We traveled to the Bahamas with our toddler and these were easy to inflate and stayed put under the fitted sheet. We had zero issues with rolling out of the bed. I’m tempted to take his bed rails down and just use these from now on!",
      "rating": 5.0,
      "verified": true,
      "author": "MrsChristieHH",
      "helpful_votes": 0,
      "publication_date": 20180131
    },
    {
      "title": "but I love it. It blew up pretty quickly",
      "text": "We have only used this one weekend so far, but I love it. It blew up pretty quickly. Deflating it took a little longer. The pump that comes with it, inflates and deflates it making it easier. My 4 year son is a mover in his bed (all night long) and it kept him in his bed. We use a bed rail at home and this for travel. The carrying case keeps all pieces together. We are going down the shore for the week coming up, hopefully I will still love it by the end of the week.",
      "rating": 5.0,
      "verified": true,
      "author": "H. Longo",
      "helpful_votes": 0,
      "publication_date": 20150706
    },
    {
      "title": "Critical travel gear for our toddler",
      "text": "I absolutely love this product. Ever since I bought it, I take them on every trip away from home for our almost 3yo. They are so compact and easy to use and fast to inflate. We used to push beds in hotel rooms and friends houses around to be against the wall, drag mattresses onto the floor, stuff pillows under the sheets and now I don't worry about the beds where we are going to stay, I just pack these guys and don't have to worry! I wish we had found these earlier!",
      "rating": 5.0,
      "verified": true,
      "author": "Karina C",
      "helpful_votes": 0,
      "publication_date": 20151208
    },
    {
      "title": "Great",
      "text": "Love the bed rails. I use them on a toddler bed to wedge between the bed and the wall because my daughter kept sliding out. These bumpers have prevented that from happening.",
      "rating": 5.0,
      "verified": true,
      "author": "mia",
      "helpful_votes": 0,
      "publication_date": 20190218
    },
    {
      "title": "Works great until deflates",
      "text": "It works great until it deflates... We had two of these; bought the second one after we left the first at a hotel. Had no issues with the first product after several months of usage, but the second got deflated right away. If you get lucky and receive a non defective product, it works geat.",
      "rating": 3.0,
      "verified": true,
      "author": "Inga",
      "helpful_votes": 0,
      "publication_date": 20170227
    },
    {
      "title": "Deflates over time",
      "text": "I really liked this when I first got it. It worked well for my 2 year old in his twin bed. It is tall enough and doesnt take up much room on the bed. It does however, over time, deflate. The air leaks out of the seams at the ends. It is flat every morning. I blow it up every night. I dont regret the buy but I wont buy again.",
      "rating": 3.0,
      "verified": true,
      "author": "MichelleG",
      "helpful_votes": 0,
      "publication_date": 20160709
    },
    {
      "title": "Won’t stay inflated after just 3 months of use.",
      "text": "I initially really liked this product but after just 3 months of use they will no longer stay inflated. There doesn’t appear to be a hole or any damage but every time I inflate them they lose the air within just a couple hours. Very disappointed!",
      "rating": 1.0,
      "verified": true,
      "author": "Sheena Hedlin",
      "helpful_votes": 0,
      "publication_date": 20190904
    },
    {
      "title": "Great for its purpose. Pump could use an improvement",
      "text": "I only used one if these on our recent trip to Cancun, but I can say they seem well made and worked well for what we needed. My only complaint is that the air pump is in 2 pieces and they do not like to stay together easily.",
      "rating": 5.0,
      "verified": true,
      "author": "H. Hall",
      "helpful_votes": 0,
      "publication_date": 20181129
    },
    {
      "title": "Wished it didn't puncture easily, only used 2 months",
      "text": "Loved this rail until it punctured less than 2 months of use. Did not have any sharp objects around it, not sure how the hole got there. Tried the repair sticker included but it still did not fix it. This is my second purchase for this product; the first one also punctured soon after purchase. Really wanted it to work, so I gave it another chance. Won't be buying again.",
      "rating": 2.0,
      "verified": true,
      "author": "Lainey M.",
      "helpful_votes": 0,
      "publication_date": 20160423
    },
    {
      "title": "Works!",
      "text": "Used this for traveling out of town with my four year old, staying in a hotel. This stayed in place perfectly and didn't require any adjustment. It comes with a pump that is several inches in diameter, which I had not planned on needing to fit in my luggage. I think it would be difficult to inflate by mouth because of the design of the valve, so plan on hauling the pump around too.",
      "rating": 5.0,
      "verified": true,
      "author": "jennyf",
      "helpful_votes": 0,
      "publication_date": 20150222
    },
    {
      "title": "use to divide queen for 2 kids",
      "text": "Two of our daughters have to share a room and we don't have a guest room. So, we kept our QUEEN size bed for when guests come and have this bed \"rail\" under a KING size bottom sheet in the middle of the bed. It does an excellent job of keeping wild sleeping 2 and 4 year old arms and legs on their own side of the bed! Great solution to a costly replacement of a queen size bed with two twin sizes, and leaves more floor space for playing.",
      "rating": 5.0,
      "verified": true,
      "author": "Benjamin M.",
      "helpful_votes": 0,
      "publication_date": 20131101
    },
    {
      "title": "Inflatable bumper pads for bed",
      "text": "These worked absolutely perfectly while traveling to stay at a hotel and also at grandparents house! Super easy to inflate and deflate and easy to store as well! Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Meemee",
      "helpful_votes": 0,
      "publication_date": 20190429
    },
    {
      "title": "Worked good but needed both of them",
      "text": "We ordered these for a cruise we were going to use for the grand children. As we arrived on the ship that night they blew up fine but one of them had a hole in it already and we had just gotten it out of the package for the 1st time. the patch that was with it could not cover the spot so we ended up only having 1 To use for the whole trip.",
      "rating": 4.0,
      "verified": true,
      "author": "Tammy Raines",
      "helpful_votes": 0,
      "publication_date": 20190819
    },
    {
      "title": "Coolest product an so easy to use",
      "text": "Love these take them everywhere. They are very easy to use an can be used anywhere. Some reviews say can't be used with a fitted sheet I found a fitted sheet is what they work the best with. I found using the tube to blow them up is 100x faster than using the hand pump provide. I would recommend them 100% There also super super compact.",
      "rating": 5.0,
      "verified": true,
      "author": "J.Pope",
      "helpful_votes": 0,
      "publication_date": 20160504
    },
    {
      "title": "Good travel bedrail.",
      "text": "Relatively easy to inflate and deflate with the included pump (though the pump is not anywhere near \"whisper quiet\" as the packaging claims). Collapses to a good portable size for travel. It worked on a hotel bed to keep my toddler from rolling off, though I wish it was just a little taller when inflated. I wouldn't want it as a permanent bedrail, but for travel it got the job done.",
      "rating": 4.0,
      "verified": true,
      "author": "Frequent buyer",
      "helpful_votes": 0,
      "publication_date": 20141231
    },
    {
      "title": "Love it",
      "text": "The product is simple, yes, but they kept my little one in bed while traveling. We used these for three nights so I am not sure if eventually we will have leaking issues. I will take paying $40 to avoid head injuries from falling out of bed. I brought two of the rails with us and an extra twin sheet so I could put the rail on the hotel sheet and have my little one sleep on our sheet from home. Worked like a charm!",
      "rating": 5.0,
      "verified": true,
      "author": "Andrea",
      "helpful_votes": 0,
      "publication_date": 20131119
    },
    {
      "title": "Great product!",
      "text": "Love this product! Gave a piece of mind for toddler sleeping on high hotel beds without falling out. Very compact and easy to inflate. Took only minutes to set up. Had it inflated for 2 weeks and didn’t have to add any more air in it. Great product overall!",
      "rating": 5.0,
      "verified": true,
      "author": "Liane",
      "helpful_votes": 0,
      "publication_date": 20190112
    },
    {
      "title": "works great",
      "text": "It works great definitely keep my son from failing off the bed when he sleeps",
      "rating": 5.0,
      "verified": true,
      "author": "Sharon J. Harris",
      "helpful_votes": 0,
      "publication_date": 20200604
    },
    {
      "title": "Great item",
      "text": "This is a must have if you don't want an ugly railing attached to a bed. By little over 2 years my daughter was climbing out of crib. We changed to toddler rails but she never seemed comfortable. I bought her a single bed and used this to make sure she wouldn't fall off. It works perfectly, doesn't show and she has never fallen off and its been over 1 year. You can travel with it as well. I think its a great item.",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa  ruiz",
      "helpful_votes": 0,
      "publication_date": 20141125
    },
    {
      "title": "it will be perfect!",
      "text": "I will be honest that I won't have an opportunity to use your product until the end of March when we have our granddaughter for spring break. We needed to find a product that would keep her from rolling off our upper bed in our motor home. From what I have seen so far, it will be perfect!",
      "rating": 5.0,
      "verified": true,
      "author": "Linda Evans",
      "helpful_votes": 0,
      "publication_date": 20180222
    },
    {
      "title": "Leaking after one year",
      "text": "Idea is good but started leaking air after 1 year, and the valve is not orange color, I bought from this seller one year ago.",
      "rating": 1.0,
      "verified": true,
      "author": "Kenny",
      "helpful_votes": 0,
      "publication_date": 20180629
    },
    {
      "title": "Good, but not for long....",
      "text": "These were really a great idea to begin with and they worked exactly like they were supposed to. However, exactly 6 months into ownership, they both sprung leaks. We had to keep blowing them up over and over. A long body pillow or a couple of regular size pillows on the side of the bed would do just as good to protect baby from rolling off. I wouldn't purchase these again.",
      "rating": 3.0,
      "verified": true,
      "author": "lisamc13",
      "helpful_votes": 0,
      "publication_date": 20150524
    },
    {
      "title": "Work great and are easy to fill and empty",
      "text": "Work great and are easy to fill and empty. Great to travel with. Once deflated they roll up into a small pouch that is easy to fit in a suite case.",
      "rating": 5.0,
      "verified": true,
      "author": "Meka B. Duvall",
      "helpful_votes": 0,
      "publication_date": 20170624
    },
    {
      "title": "Highly recommended!",
      "text": "These bed bumpers are great! My 4 year old granddaughter slept securely in a queen size bed. I purchased three so that I could have one across the bottom of the bed too. I have a set of stretchy microfiber fleece sheets and put the bumpers under the bottom fitted sheet. I highly recommend them!",
      "rating": 5.0,
      "verified": true,
      "author": "jrkattherock",
      "helpful_votes": 0,
      "publication_date": 20170114
    },
    {
      "title": "don't last long",
      "text": "Had to order foam bumpers, in 2 months these would no longer hold air. I toss and turn a lot and these helped tremendously, so I just ordered foam bumpers.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190522
    },
    {
      "title": "Tear at the Seam",
      "text": "We brought this in December 2016. Used it 3 times. Now there is leak right at the seam. The repair patch they send does not work because it's at the seam. So we're traveling on Monday and do not have a bed rail. I would not recommend this product.",
      "rating": 1.0,
      "verified": true,
      "author": "Leiha M.",
      "helpful_votes": 0,
      "publication_date": 20170702
    },
    {
      "title": "Easy to use, portable, great for storage and good quality",
      "text": "Bought for when grandson comes for sleepovers which is frequently. Easy to blow up and deflates quickly to store away. Works like a charm without buying those bulky bedrails",
      "rating": 5.0,
      "verified": true,
      "author": "B horne",
      "helpful_votes": 0,
      "publication_date": 20200704
    },
    {
      "title": "Perfect for travel",
      "text": "This is a fantastic product. Our family travels a lot and we've used this on every trip (several times a year) since we bought this over four years ago and it's held up brilliantly. Unfortunately, it recently gave up the ghost, but I would say 4 years for an inflatable item, is pretty good longevity. I plan to purchase a new one since I was so pleased with the first. One thing I recently realized is that the foot pump, while helpful, is not necessary and makes this a little bulkier for travel than it really needs to be. From now on, I'm going to skip the foot pump and just inflate by mouth.",
      "rating": 5.0,
      "verified": true,
      "author": "Summer B. Frace",
      "helpful_votes": 5,
      "publication_date": 20161209
    }
  ],
  "product_meta": {
    "title": "The Shrunks Inflatable Kids Bed Rails for Toddlers Portable Safety Guard Side Bumpers {2 Pack} for Children and Adult Beds Great Home or Travel. Have Your Child Sleep Safe and Comfortable",
    "description": "Size:2 CountKeep your child safe from rolling off the bed with The Shrunks Inflatable Bed Rail. Its slim design allows the bed rail to slip conveniently under any fitted standard sized twin, queen or king size bed sheet. Recommended for kids 2 years and up.",
    "rating": 4.2,
    "feature_bullets": [
      "Bed Rail Function: Replacing the traditional old unsafe Bed Bumpers with its newest inflatable technology, The Shrunks Advanced Bed Rail inflates when in use and easily deflates when travelling or not in use. Its ready to go in 30 seconds!",
      "Package Contents & Sizing: When inflated the Bed Rail measures 48 inches long, 7 inches wide and has a height of 4 inches. It is compatible to any size bed or crib mattress including adult beds. The Bed Rail easily slips under the sheet giving it a natural sleek look in the bedroom. The Package includes 2 Bed Rails, Compact Foot Pump, Elegant Storage/Travelling Bag, making your portable Bed Rail an ideal Camping or Hotel solution when on the go.",
      "Safety Protection: While children toss/turn during their sleep they can easily roll over and fall. However, when The Shrunks Bed Rail is in place as they touch the rail - they subconsciously are reminded to shift to the middle for safety, all without interrupting their peaceful sleep.",
      "Awards & Warranty: The Shrunks is the original manufacturer of the Inflatable Toddler Bed Rails, proudly serving the Infant & Juvenile community since 2007. Our Bed Rails are the chosen recipient of the Family Choice Award one of the most prestigious award programs running for 2 decades, along with numerous other awards. The Shrunks Bed Rail is backed by a full lifetime warranty! It also has a 30 day money back guarantee with free return shipping.",
      "Safety: The Shrunks Bed Rail does not contain dangerous Polyurethane Foam since children, toddlers and infants are known to be vulnerable to exposure. The Bed Rail is also BPA, Phthalate and Lead safe."
    ],
    "specifications": {
      "Product Dimensions": "48 x 7 x 4 inches",
      "Item model number": "88053",
      "Is Discontinued By Manufacturer": "No",
      "Target gender": "Unisex",
      "Batteries required": "No",
      "Is portable": "No",
      "Item Weight": "1.43 pounds",
      "ASIN": "B00J0YTT72",
      "Customer Reviews": "4.2 out of 5 stars1,132 ratings4.2 out of 5 stars",
      "Best Sellers Rank": "#5,672 in Baby"
    },
    "categories": [
      "Home & Kitchen",
      "Baby",
      "Bedding",
      "Kids' Bedding"
    ],
    "price": 22.49
  }
}