{
  "website_summaries": [
    {
      "verdict": "Though low gravity makes combat more interesting, Borderlands: The Pre-Sequel's missions and story feel like straight-up filler. This Pre-Sequel is strictly for devoted Vault Hunters.",
      "pros": [
        "Enjoyable low-gravity movement and combat",
        "Good art design",
        "Fun, new Claptrap class"
      ],
      "cons": [
        "Lackluster, repetitive mission design",
        "Uninteresting story and dialogue",
        "Lots of useless loot"
      ],
      "aspects": {},
      "publication_date": 20141210,
      "rating": 6.0,
      "source": "pcmag"
    }
  ],
  "customer_reviews": [
    {
      "title": "If you have Windows 10 don't bother.",
      "text": "Borderlands The Pre-Sequel is not compatible with Windows 10. I have been going back and forth with 2K support for two weeks now. Every suggested fix does not work. It is not possible to save a game on Windows 10. Every time I start the game I get so far I save it and then when I restart it the save file is not there. A waste of money. I should have known better after the fiasco with Aliens: Colonial Marines",
      "rating": 1.0,
      "verified": true,
      "author": "J. New",
      "helpful_votes": 0,
      "publication_date": 20171217
    },
    {
      "title": "Spend your money elsewhere.",
      "text": "There are far better games you should spend your time playing. The game plays okay and the co-op works well, but I didn't find myself having fun with this game. Go here, do this. Go there, bring this back. Etc etc etc. The plot was completely forgettable. The weapons are somewhat interesting, but IMO the first borderlands is a much better game in all regards.",
      "rating": 2.0,
      "verified": true,
      "author": "Jeff",
      "helpful_votes": 0,
      "publication_date": 20170124
    },
    {
      "title": "but once I did I was hooked just like BL2. I'd recommend it to anyone who misses ...",
      "text": "As always, Amazon's online game code service works flawlessly and lets me get to gaming as soon as the game installs through Steam. The game is a prequel to the story of Borderland 2 and really fleshes out the story of Jack and what made him the a**hole he was in BL2. It took a little while for me to get to the game, but once I did I was hooked just like BL2. I'd recommend it to anyone who misses all of Jack's smarta** comments throughout the game and for those who enjoyed the game, but want something new.",
      "rating": 5.0,
      "verified": true,
      "author": "Brandon Smith",
      "helpful_votes": 0,
      "publication_date": 20150328
    },
    {
      "title": "Buy all the DLC for Borderlands 2 first",
      "text": "Not bad. It's a huge DLC for Borderlands 2, basically. Buy it on sale. It lacks the compelling \"have to finish this mission\" aspect of Borderlands 2, but it seems they've adjusted the rarity tables for loot a little bit. I don't have to worry about going five levels with outdated equipment in this game. It introduces a few cool mechanics, too.",
      "rating": 4.0,
      "verified": true,
      "author": "Andy B",
      "helpful_votes": 2,
      "publication_date": 20141215
    },
    {
      "title": "Great game",
      "text": "Borderland 2 was the first I have played in the trilogy and it was great. I ordered this because of how great the other game was. And this one did not dissapoint also. Did not have the wow factor as playing the other game for the first time but still a great game. Have had several other people purchase this game because of how good it is.",
      "rating": 4.0,
      "verified": true,
      "author": "Evin",
      "helpful_votes": 0,
      "publication_date": 20150211
    },
    {
      "title": "Good game. The fighting and gameplay are everything you ...",
      "text": "Good game. The fighting and gameplay are everything you have come to expect from a Borderlands game. Lot of neat new features that are really fun like the hover bikes and the oxygen mechanics. The Helios Moon Base and Dahl Frigate levels were neat. Still though, it just isn't as good as Borderlands 2 was... something just feels... missing. You can tell that Gearbox didn't make this one; it just doesn't have the same style and hilarious politically incorrect jokes. They tried really hard to emulate Gearbox's wit but it just falls short. The humor uses stuff like lesbians and nerds for the punchlines which I didn't find as funny as midgets and psychos and firehawks.",
      "rating": 4.0,
      "verified": true,
      "author": "Nate",
      "helpful_votes": 0,
      "publication_date": 20150117
    },
    {
      "title": "More of 2.",
      "text": "The pre-sequel is certainly worth playing if you like Borderlands 2, but if you put a bunch of time in 2 like I did, you might feel that the pre-sequel is more of the same. The new gameplay mechanics aren't quite enough to keep it interesting. I'm still looking forward to 3 though.",
      "rating": 4.0,
      "verified": true,
      "author": "Mike B",
      "helpful_votes": 0,
      "publication_date": 20160429
    },
    {
      "title": "5 Stars for Amazon; it's a working steam key ...",
      "text": "5 Stars for Amazon; it's a working steam key for Borderlands: The Pre-Sequel. 2 Stars for the game. It uses almost everything the same from Borderlands 2: same engine, same guns parts, same enemies, etc. Offers very little original content to the Borderlands series, and the story is much shorter than Borderlands or Borderlands 2. Named NPCs are forgettable.",
      "rating": 5.0,
      "verified": true,
      "author": "amazonpenname",
      "helpful_votes": 0,
      "publication_date": 20141231
    },
    {
      "title": "Great Pre-Sequel",
      "text": "If you liked Borderlands 2 you'll love this one. Plays almost exactly the same. I spent most of my time leveling the Sheriff, which is crazy overpowered and a ton of fun to play. I also liked seeing the transition of Jack from a relatively good guy to a complete sociopath.",
      "rating": 5.0,
      "verified": true,
      "author": "JT",
      "helpful_votes": 0,
      "publication_date": 20150106
    },
    {
      "title": "This game just seems like the same old",
      "text": "I beat the previous 2 borderlands, so I bought this game as well. I just did not find this one quite as enjoyable as the last two. I think maybe because the first one was a groundbreaking game (a first person shooter RPG), and the second one was an improvement on the first. This game just seems like the same old.",
      "rating": 3.0,
      "verified": true,
      "author": "Ivan",
      "helpful_votes": 0,
      "publication_date": 20150714
    },
    {
      "title": "I was hoping that The Pre-Sequel would be as good as BL2 seeing as I paid $60",
      "text": "Okay is about all I can say about this game. BL2 was a classic game that I got hundreds of enjoyable hours playing. I was hoping that The Pre-Sequel would be as good as BL2 seeing as I paid $60.00 for both of them. My number one complaint was how few legendary weapons there were. The Pre-Sequel was just a scaled down version of BL2.",
      "rating": 4.0,
      "verified": true,
      "author": "Ed",
      "helpful_votes": 0,
      "publication_date": 20141129
    },
    {
      "title": "I was somewhat disappointed with this game",
      "text": "I was somewhat disappointed with this game. I played the heck out of Borderlands 1 and 2. This game felt somewhat rushed and not polished. The humor was great and allusions to subculture were subtle. I would definitely suggest this game when it is on sale and would not pay full price for it.",
      "rating": 3.0,
      "verified": true,
      "author": "Giao N.",
      "helpful_votes": 0,
      "publication_date": 20141221
    },
    {
      "title": "Five Stars",
      "text": "i love this game. its a bit short but very fun",
      "rating": 5.0,
      "verified": true,
      "author": "Jonathan Flores",
      "helpful_votes": 0,
      "publication_date": 20170926
    },
    {
      "title": "Loved BL2.",
      "text": "Loved BL2... This one, not so much. If you play this without playing BL2 first, you might like it, otherwise this is lackluster in comparison. The story is bland and it is missing the funny lines and jokes...",
      "rating": 3.0,
      "verified": true,
      "author": "serkman",
      "helpful_votes": 0,
      "publication_date": 20151228
    },
    {
      "title": "good game. its brand new so there isn't much ...",
      "text": "good game. its brand new so there isn't much else to say about it. Shipping was fast and received it in good condition. Thanks.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180428
    },
    {
      "title": "It's fun, but I don't feel like it added much ...",
      "text": "It's the same game. Lots of grinding. It's fun, but I don't feel like it added much in terms of useful content. Story was interesting. Worth a single playthrough, but little replay value over the previous games.",
      "rating": 3.0,
      "verified": true,
      "author": "DM Bianco",
      "helpful_votes": 0,
      "publication_date": 20150611
    },
    {
      "title": "Not an improvement",
      "text": "Not as great as 1 and 2, don't really have the urge to play this one as much as the others.",
      "rating": 3.0,
      "verified": true,
      "author": "Megan W.",
      "helpful_votes": 2,
      "publication_date": 20150604
    },
    {
      "title": "Three Stars",
      "text": "Its not bad. Just another borderlands game. Nothing new about it.",
      "rating": 3.0,
      "verified": true,
      "author": "James Griffith",
      "helpful_votes": 0,
      "publication_date": 20160222
    },
    {
      "title": "fun but not as good as the other two in series",
      "text": "Not as good as the others in the same series, but a great game. They definitely kept the same odd sense of humor in the game. Well worth playing, especially if you get it on sale, as we did.",
      "rating": 4.0,
      "verified": true,
      "author": "Brenna Lyons",
      "helpful_votes": 0,
      "publication_date": 20150120
    },
    {
      "title": "Awesome game, if you enjoyed BL2 this is very ...",
      "text": "Awesome game, if you enjoyed BL2 this is very similar but a ton of fun. I've been playing online co-op as clap trap, absolutely brilliant.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 0,
      "publication_date": 20150809
    },
    {
      "title": "it has the grinding thinggy and that I like.",
      "text": "this is nothing compared to borderland 2 or 1. However, it has the grinding thinggy and that I like.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20150714
    },
    {
      "title": "Borderlands pre sequel",
      "text": "Story line is kind of weak and doesn't keep me interested in it. Not a lot of new things other than butt slams in low gravity. Still fun to multiplayer and find new weapons.",
      "rating": 4.0,
      "verified": true,
      "author": "SomeguyfromWisco",
      "helpful_votes": 0,
      "publication_date": 20141127
    },
    {
      "title": "I love this game for how they stick with the main ...",
      "text": "Borderlands and more Borderlands. I love this game for how they stick with the main theme of borderlands and only slightly expand on other things.",
      "rating": 5.0,
      "verified": true,
      "author": "Kudae",
      "helpful_votes": 0,
      "publication_date": 20141215
    },
    {
      "title": "Great waste of time",
      "text": "Great waste of time, still some bugs BUT I got it as soon as it was released so go figure. Must have for a Borderlands fan",
      "rating": 5.0,
      "verified": true,
      "author": "Phil T",
      "helpful_votes": 0,
      "publication_date": 20150417
    },
    {
      "title": "Another Gem",
      "text": "Another gem in the Borderlands series. Handsome Jack was never more menacing. love it",
      "rating": 5.0,
      "verified": true,
      "author": "tiberius",
      "helpful_votes": 0,
      "publication_date": 20160717
    },
    {
      "title": "Writing isn't nearly as good as BL2.",
      "text": "I didn't finish it. Love'd Borderlands 2, but this is more of the same. Lasers are nice, AI is improved, writing isn't nearly as good.",
      "rating": 3.0,
      "verified": true,
      "author": "c3h8",
      "helpful_votes": 0,
      "publication_date": 20150528
    },
    {
      "title": "Three Stars",
      "text": "its ok just didnt hook me like previous borderlands games",
      "rating": 3.0,
      "verified": true,
      "author": "Anuree",
      "helpful_votes": 0,
      "publication_date": 20151225
    },
    {
      "title": "Would do 4.5 stars if half stars were available.",
      "text": "I love the world Gearbox has created. I love Borderlands 1 and 2. While this one does not skimp on anything that I love about the other two games, it doesn't bring anything new that I really love. I would still recommend the game to anyone who buys it.",
      "rating": 4.0,
      "verified": true,
      "author": "Don",
      "helpful_votes": 0,
      "publication_date": 20150109
    },
    {
      "title": "Five Stars",
      "text": "my son and I really likes this game as well as borderlands 2.",
      "rating": 5.0,
      "verified": true,
      "author": "redbenji",
      "helpful_votes": 0,
      "publication_date": 20150514
    },
    {
      "title": "It's okay",
      "text": "It's more of the same as BL2. Still fun, but not quite the same. I'm not as addicted as I was with BL2.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20150515
    },
    {
      "title": "It had funny moments, but they were so few and far ...",
      "text": "I only have played this for 3 hours. Felt it was very slow. It had funny moments, but they were so few and far between.",
      "rating": 3.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20141204
    },
    {
      "title": "an amazing game and addition to anyone who loves the franchise",
      "text": "bought this as a gift. Already own it myself. an amazing game and addition to anyone who loves the franchise.",
      "rating": 5.0,
      "verified": true,
      "author": "ScienceInChaos",
      "helpful_votes": 0,
      "publication_date": 20141211
    },
    {
      "title": "Not the best, not the worst",
      "text": "A pretty good game for a \"pre-sequel\". Could have been better, could have been worse. Doesn't stand up to Borderlands 2 but is not as bad as some people paint it to be.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170702
    },
    {
      "title": "Borderlands: The Pre-Sequel - PC",
      "text": "Bought this for my son, who is loving it. He's a gamer, and just had to have this.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20141214
    },
    {
      "title": "\"Claptrap! Shut Up!!\"",
      "text": "Love it Love it Love it!!! Great new installment to the franchise. Mainly just more story with the same game mechanics as BL2 but who cares?! The story and commentary is worth the price itself!",
      "rating": 5.0,
      "verified": true,
      "author": "Mary",
      "helpful_votes": 0,
      "publication_date": 20141205
    },
    {
      "title": "Jump boost!",
      "text": "Really fun game, though I will note that when I go back to playing Borderlands 2 I tend to have a bit of an adjustment period remembering there's no jump boost.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160803
    },
    {
      "title": "Four Stars",
      "text": "Worth playing until Far Cry 4 comes along. Uneven Boss battles. Ending is rather silly, but overall worth playing.",
      "rating": 4.0,
      "verified": true,
      "author": "Kenneth B. Clark",
      "helpful_votes": 0,
      "publication_date": 20141201
    },
    {
      "title": "Great game, but it's much better with a buddy",
      "text": "Great game, but it's much better with a buddy. Which is the sad part. Had to buy two game codes so my wife and I can play, I guess that's the brilliance behind 2k and gearbox's pile o' cash.",
      "rating": 5.0,
      "verified": true,
      "author": "Khrim Zunn",
      "helpful_votes": 0,
      "publication_date": 20141220
    },
    {
      "title": "Five Stars",
      "text": "worked perfect., had it fast. was able to use it and get the game with no issues.",
      "rating": 5.0,
      "verified": true,
      "author": "Ken Searles",
      "helpful_votes": 0,
      "publication_date": 20141201
    },
    {
      "title": "PC is awesome",
      "text": "I had this game for Xbox 360 and I loved it. It is so much better on PC. You can download other peoples game saves, and the graphics are so much better.",
      "rating": 5.0,
      "verified": true,
      "author": "Sheila Miller",
      "helpful_votes": 0,
      "publication_date": 20160529
    },
    {
      "title": "Is a fun and an excellent game",
      "text": "Is a fun and an excellent game. glad I bought it, was worth buying!!",
      "rating": 5.0,
      "verified": true,
      "author": "Jim",
      "helpful_votes": 0,
      "publication_date": 20150203
    },
    {
      "title": "Five Stars",
      "text": "Feels like an expansion, but much bigger. Love the new characters.",
      "rating": 5.0,
      "verified": true,
      "author": "Rob",
      "helpful_votes": 0,
      "publication_date": 20141130
    },
    {
      "title": "Five Stars",
      "text": "Great game, even better if you've played the previous 2 releases.",
      "rating": 5.0,
      "verified": true,
      "author": "Patti D",
      "helpful_votes": 0,
      "publication_date": 20141204
    },
    {
      "title": "I logged in several hundred hours with Borderlands 2 and its DLC and loved every minute of it",
      "text": "I've only played a few hours with the Claptrap character, but I have to say it is disappointing so far. I logged in several hundred hours with Borderlands 2 and its DLC and loved every minute of it. I tried all the characters and all were good. I'm sorry, but I'm just not thrilled with the jumping, jump stomping and oxygen canisters - playing as Claptrap I don't think I need O2, but I suspect with another character needing O2, I would like this game even less. Maybe it will get better, but I am losing interest.",
      "rating": 3.0,
      "verified": true,
      "author": "JC",
      "helpful_votes": 0,
      "publication_date": 20141229
    },
    {
      "title": "... gotten around to beating the game yet it is fun but not as much end game content as bl2",
      "text": "Though I haven't gotten around to beating the game yet it is fun but not as much end game content as bl2. If you are looking for an action with a lot of content play borderlands 2 and if u want new story play the pre-sequel.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160528
    },
    {
      "title": "Meh",
      "text": "Not as good as BL2. Fun but went by to quickly.",
      "rating": 3.0,
      "verified": true,
      "author": "Michael Lynch",
      "helpful_votes": 0,
      "publication_date": 20150401
    },
    {
      "title": "Five Stars",
      "text": "If you like the other two, you will like this one.",
      "rating": 5.0,
      "verified": true,
      "author": "Rod Costa",
      "helpful_votes": 0,
      "publication_date": 20141122
    },
    {
      "title": "Borderlands 2 expansion with excellent additions",
      "text": "Game is essentially a Borderlands 2 expansion. If you like Borderlands 2, you will love this game. The low gravity really makes the game more fun. Although there is a lot of grinding to level up, the characters and weapons make the game fun with friends. The classes are fairly unique and you will definitely want to try a few out. Overall, this is exactly what you expect from Borderlands franchise.",
      "rating": 5.0,
      "verified": true,
      "author": "Capt. Obvious",
      "helpful_votes": 0,
      "publication_date": 20141201
    },
    {
      "title": "Four Stars",
      "text": "Very fun: better than the original but not as good as Borderlands 2.",
      "rating": 4.0,
      "verified": true,
      "author": "dnblack",
      "helpful_votes": 0,
      "publication_date": 20150625
    },
    {
      "title": "Four Stars",
      "text": "Good game. Has a good story but a little short.",
      "rating": 4.0,
      "verified": true,
      "author": "Gayle E",
      "helpful_votes": 0,
      "publication_date": 20150329
    },
    {
      "title": "Nice pre-sequel.",
      "text": "Great addition to the Borderlands saga. If you liked the other games, you should like this one as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Hunter Harwood",
      "helpful_votes": 0,
      "publication_date": 20150113
    },
    {
      "title": "Fun, but the worst of the series",
      "text": "I'd say this is the worst of the series. BL2 > BL > BL:TPS. It's not bad, but it's not as entertaining as the others. I still haven't finished this one a few months after purchasing it, even though I went through both of the others in a month or less.",
      "rating": 3.0,
      "verified": true,
      "author": "Dann H",
      "helpful_votes": 2,
      "publication_date": 20151012
    },
    {
      "title": "Didn't improve on the original",
      "text": "Mayhem. Lots of mayhem. Lots of loot. Many strange weapons. However, the baddies respawn quickly, so it can be difficult in some places. It's moderately amusing to play as Claptrap the robot, but it does get a bit tiring after a while. I thought its predecessor (successor?) was better.",
      "rating": 3.0,
      "verified": true,
      "author": "Toyman",
      "helpful_votes": 0,
      "publication_date": 20141201
    },
    {
      "title": "even though I had loved the Borderlands franchise and was really looking forward to ...",
      "text": "After the responsiveness and free feeling play in Titanfall, even though I had loved the Borderlands franchise and was really looking forward to this, it felt like I was stuck in the mud. You can barely jump in this game, where in Titanfall, you have a jetpack and you can wallrun, etc. I could only play this game for about 30 minutes and then had to go right back to Titanfall.",
      "rating": 3.0,
      "verified": true,
      "author": "kruzboy",
      "helpful_votes": 0,
      "publication_date": 20141218
    },
    {
      "title": "... the PC version of the game and while I'm pretty easy to please",
      "text": "Bought the PC version of the game and while I'm pretty easy to please, I am disappointed with the consistent crashing of the game which pretty much makes it unplayable for me. I bought it roughly a month after the release date. I thought they'd get most of the issues ironed out... Nope.",
      "rating": 2.0,
      "verified": true,
      "author": "Liddokun",
      "helpful_votes": 0,
      "publication_date": 20141118
    },
    {
      "title": "Borderlands 2 with lasers claptrap and cryo",
      "text": "if you like borderlands 2 and want more, this is the game for you",
      "rating": 5.0,
      "verified": true,
      "author": "Quintin M. Watanabe",
      "helpful_votes": 0,
      "publication_date": 20141220
    },
    {
      "title": "Download Needed",
      "text": "Product review, not game review! 3.8gb of this game are on the disc. The other 2.7gb have to be downloaded through a steam account. Great game, but people deserve to know that a large download is the only way they will get to enjoy it",
      "rating": 4.0,
      "verified": true,
      "author": "Justin H.",
      "helpful_votes": 0,
      "publication_date": 20151115
    },
    {
      "title": "Its genuinely fun to fly around like a maniac double jumping and ...",
      "text": "Not as much content as BL2, but the gameplay feels a lot more fluid. Its genuinely fun to fly around like a maniac double jumping and literally crushing enemies under your feet. I haven't encountered any non cosmetic glitches in my 10 hours with the game so far, so I doubt the game is really as poorly put together as some other reviewers say it is. I'd say this is better than BL1, but it didn't innovate enough to be a proper sequel to BL2.",
      "rating": 4.0,
      "verified": true,
      "author": "Daniel Halpin",
      "helpful_votes": 2,
      "publication_date": 20141119
    },
    {
      "title": "Perfect!",
      "text": "Wonderful, spectacular storyline, perfect game for the series and worth ever penny!",
      "rating": 5.0,
      "verified": true,
      "author": "Tucker Mithuen",
      "helpful_votes": 0,
      "publication_date": 20150403
    },
    {
      "title": "Same game, new tricks, but still amazing!",
      "text": "In comparison to Borderlands and Borderlands 2, it has the same feel, yet brings in a new fresh environment that appeals to me. I enjoy the fact that it is the same basic game. I was not looking to be buying a completely new game, but just an extension of the story that I have grown to love. Borderlands for me is more of a good story than a gun shooting game.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian",
      "helpful_votes": 2,
      "publication_date": 20141015
    },
    {
      "title": "If you liked the older ones you will more than likely enjoy ...",
      "text": "Very similar to the previous Borderlands franchise games. If you liked the older ones you will more than likely enjoy this one.",
      "rating": 4.0,
      "verified": true,
      "author": "Kuma",
      "helpful_votes": 0,
      "publication_date": 20141103
    },
    {
      "title": "Great game.",
      "text": "Great game. No problem with Amazon code being used in Steam. No bugs. Good replay value. First play through was ~ 38 hours.",
      "rating": 5.0,
      "verified": true,
      "author": "Darren Lesinski",
      "helpful_votes": 0,
      "publication_date": 20150104
    },
    {
      "title": "More like a big expansion than a standalone game",
      "text": "Not as much content as expected for a full price game (just finished last night). I wish there was more humor in the game similar to BL2. That being said it was still a very good game. Essentially BL2 with a few new mechanics and character classes. Great news is that the original BL2 mechanics are still the best in class for non-realism FPS games.",
      "rating": 4.0,
      "verified": true,
      "author": "Bill S Neff",
      "helpful_votes": 11,
      "publication_date": 20141110
    },
    {
      "title": "Three Stars",
      "text": "The second one was the best, this one is just okay.",
      "rating": 3.0,
      "verified": true,
      "author": "R. Kramer",
      "helpful_votes": 0,
      "publication_date": 20150820
    },
    {
      "title": "Four Stars",
      "text": "Ordered the DVD however it still required a > 2GB download via steam before it was playable.",
      "rating": 4.0,
      "verified": true,
      "author": "Ochadd",
      "helpful_votes": 0,
      "publication_date": 20150709
    },
    {
      "title": "borderlands fan",
      "text": "Exactly the same as Borderlands 2, but loved the \"zero gravity\" aspect!",
      "rating": 5.0,
      "verified": true,
      "author": "Sharon Im",
      "helpful_votes": 0,
      "publication_date": 20150114
    },
    {
      "title": "Should've Been a DLC",
      "text": "This game should have been a DLC for Borderlands 2. It's way to short (It took me a week, playing only a few hours each evening, to complete the first run through) and honestly, all the scenes look incredibly similar.",
      "rating": 1.0,
      "verified": true,
      "author": "Benjamin",
      "helpful_votes": 0,
      "publication_date": 20150101
    },
    {
      "title": "Just OK.",
      "text": "Eh...it was OK. Not nearly as good as Borderlands 2.",
      "rating": 3.0,
      "verified": true,
      "author": "Harold Vance",
      "helpful_votes": 0,
      "publication_date": 20160208
    },
    {
      "title": "Five Stars",
      "text": "I love this franchise, it's so fun. Cracks me up!",
      "rating": 5.0,
      "verified": true,
      "author": "Dennis Blocker",
      "helpful_votes": 0,
      "publication_date": 20150916
    },
    {
      "title": "Soooooo disappointed.",
      "text": "The first Borderlands had great story lines with action around every corner. This game is just a string of stupid errands. I have rarely gotten to shoot any Psychos. Just a bunch of parkour and BS. Not fun!",
      "rating": 2.0,
      "verified": true,
      "author": "Chyna Dawl",
      "helpful_votes": 3,
      "publication_date": 20141116
    },
    {
      "title": "I also like Tiny Tina's DLC (it's worth it)",
      "text": "I've played through Borderlands 2 before playing Pre-sequel and the levels are the same which makes sense, but some of the bosses and missions are the same as well. I would just get Borderlands 2. I also like Tiny Tina's DLC (it's worth it).",
      "rating": 3.0,
      "verified": true,
      "author": "Ryan Christenson",
      "helpful_votes": 0,
      "publication_date": 20161016
    },
    {
      "title": "Five Stars",
      "text": "Amazing Game. A little slow in the beginning but after a while it starts to get better.",
      "rating": 5.0,
      "verified": true,
      "author": "Charlotte",
      "helpful_votes": 0,
      "publication_date": 20150901
    },
    {
      "title": "A good attempt at a Pre-sequel",
      "text": "A good attempt at a Pre-sequel. Entertaining and well worth the $30 I paid but still doesn't top Borderlands 2.",
      "rating": 3.0,
      "verified": true,
      "author": "J 'MF' S",
      "helpful_votes": 0,
      "publication_date": 20141229
    },
    {
      "title": "Four Stars",
      "text": "Although not as good as its predecessor, it still is a great game for borderland fans.",
      "rating": 4.0,
      "verified": true,
      "author": "chris",
      "helpful_votes": 0,
      "publication_date": 20141028
    },
    {
      "title": "Great Game! Get Your Borderlands Fix On!",
      "text": "Has quite a few new features! Very fun, lots of comedy still!",
      "rating": 5.0,
      "verified": true,
      "author": "stephanie cooper",
      "helpful_votes": 0,
      "publication_date": 20141024
    },
    {
      "title": "60 dollar dlc not great.",
      "text": "This game isn't bad if you liked bl2 cause its the same game.it's 60 dollar dlc",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20150326
    },
    {
      "title": "Five Stars",
      "text": "Great game, worthy of becoming part of the Borderlands trilogy.",
      "rating": 5.0,
      "verified": true,
      "author": "Dakota",
      "helpful_votes": 0,
      "publication_date": 20141116
    },
    {
      "title": "Oh B2",
      "text": "Its pretty good, but there's times when I keep reminiscing about Pandora. Keep wanting to play Zero or the Siren. Worth a play through, but I sort of wish I just played it with a buddy.",
      "rating": 3.0,
      "verified": true,
      "author": "dAK",
      "helpful_votes": 0,
      "publication_date": 20141103
    },
    {
      "title": "Hidden Requirement: Internet Activation",
      "text": "Hidden on separate 'system requirements' page: Requires internet activation and patch download. Should have been listed both on the box and clearly stated on Amazon sales page. Fail to both 2k and Amazon.",
      "rating": 1.0,
      "verified": true,
      "author": "Matthew W",
      "helpful_votes": 5,
      "publication_date": 20141122
    },
    {
      "title": "i do not recommend this product to",
      "text": "Have to have Steam to play it, downloaded steam and the game doesn't work. Corrupt download. Tried to download it twice now. That's what i get for buying a game that has to use Steam. i do not recommend this product to anyone",
      "rating": 1.0,
      "verified": true,
      "author": "J",
      "helpful_votes": 0,
      "publication_date": 20141128
    },
    {
      "title": "Charlene from PHX AZ",
      "text": "My son just loves playing this game. Received on a timely manner.",
      "rating": 5.0,
      "verified": true,
      "author": "Vivienne",
      "helpful_votes": 0,
      "publication_date": 20160123
    }
  ],
  "product_meta": {
    "title": "Borderlands: The Pre-Sequel",
    "description": "Borderlands: The Pre-Sequel is a new role-playing shooter in the critically acclaimed Borderlands series. Play as four all-new character classes while carving a path of destructive mayhem across Pandora’s never-before-seen low-gravity moonscapes with all new moves, weapons, and vehicles! Get high with low gravity and jump right in to fight alongside future megalomaniacal tyrant Handsome Jack, while preventing the destruction of Pandora and its moon. Contribute to the rise of the corrupt Hyperion Corporation and watch Handsome Jack’s transformation from a man trying to do good, into a ruthless tyrant, constantly seeking fortune, power, and infamy.",
    "rating": 3.8,
    "feature_bullets": [
      "Borderlands: The Pre-Sequel is a new role-playing shooter in the critically acclaimed Borderlands series. Play as four all-new character classes while carving a path of destructive mayhem across Pandora’s never-before-seen low-gravity moonscapes with all new moves, weapons, and vehicles! Get high with low gravity and jump right in to fight alongside future megalomaniacal tyrant Handsome Jack, while preventing the destruction of Pandora and its moon. Contribute to the rise of the corrupt Hyperion"
    ],
    "specifications": {
      "Product Dimensions": "19.05 x 2.54 x 13.97 cm; 70 Grams",
      "Manufacturer recommended age": "18 years and up",
      "Item model number": "41407",
      "Language:": "English",
      "Batteries Required?": "No",
      "Batteries Included?": "No",
      "Color": "Multi-colored",
      "Mfg Recommended age": "18 - 60 years",
      "ASIN": "B00JDOX2T0",
      "Customer Reviews": "3.8 out of 5 stars69 ratings3.8 out of 5 stars",
      "Date First Available": "25 Oct. 2018"
    },
    "categories": [
      "Board Games",
      "Toys & Games",
      "Games & Accessories"
    ],
    "price": 126.35
  }
}