{
  "website_summaries": [
    {
      "verdict": "Though it lags in terms of storage, it's a solid, economical choice for easy to moderate day hikes.",
      "pros": [
        "Straps are lightweight and won't dig into your shoulders, even on longer hikes"
      ],
      "cons": [
        "Overall storage capacity is smaller than some similarly priced packs"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "It is a comfortable backpack. It is NOT Waterproof",
      "text": "It is a comfortable backpack. It is NOT Waterproof, but it is water resistant and pretty good at it too as long as the water isn't coming through from the back facing side or the inevitable trickle through the zipper points. My biggest complaint is the size. It is really small and because of the cut where the top angles in, it is hard to make full use of the space available. Especially when using a water bladder, there is pretty much no room after putting one of those in, mine is a 2L water bladder. I also would have liked a port for a water bladder hose to go through.",
      "rating": 4.0,
      "verified": true,
      "author": "Faith",
      "helpful_votes": 2,
      "publication_date": 20170106
    },
    {
      "title": "i did'nt like this product and wanted to return it but was ...",
      "text": "i did'nt like this product and wanted to return it but was left no options other than retuning it with shipping costs that twice what I paid for it in the first place. Unhappy",
      "rating": 1.0,
      "verified": true,
      "author": "Reclaimed",
      "helpful_votes": 3,
      "publication_date": 20180714
    },
    {
      "title": "Awesome Value -- PERFECT for Day Hikes!!",
      "text": "Years ago I spent an obscene amount of money on a souped up \"fanny pack\" of which the quality was and is still fantastic. However I found that for day hikes a backpack was more my speed. When I came across this one I thought I'd give it a try. It was just what I was looking for. It appears to be very well made, the straps and back are well padded, and it provides just enough space for hiking essentials like a first ad kit, snacks, flashlight, water, matches, army knife, my phone, etc. And at $9.99 the price could NOT be beat!!",
      "rating": 5.0,
      "verified": true,
      "author": "Sugarplum704",
      "helpful_votes": 0,
      "publication_date": 20160313
    },
    {
      "title": "Lightweight daypack",
      "text": "Perfect size for a day hike. It was as pictured and as described. The product arrive on time and nicely packaged. The backpack is very lightweight and comfortable. The only issue I had was the ventilation in the back, it does make you sweaty after a few miles into your hike, since the back sits right against your back. The back, is however, very comfortable, no back pains like the others I have worn in the past. I was able to fit a medium sized jacket, snacks, flashlight, cell phone, camera, batter pack and other small gadgets into this thing! I highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "StephaniefromCA",
      "helpful_votes": 0,
      "publication_date": 20150118
    },
    {
      "title": "Perfect pack for dirt biking IMO",
      "text": "Perfect pack for dirt biking IMO. I don't like hydration packs and I wanted a small pack to carry a few waters, snack bars, phone, keys, etc. Like other reviews, the quality is far better than expected for the price point. The shoulder harness is padded and kept the pack secure while bouncing around on a quad in the dunes. It is small, like I wanted - but keep in mind it barely fits a bottle of water and a Carhartt jacket tightly rolled up in the main compartment. About ten hours of use so far, I don't even notice it while riding. Finally... a nice surprise on a random purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "CJ",
      "helpful_votes": 0,
      "publication_date": 20160822
    },
    {
      "title": "The quality isn't the greatest, but it's held up well so far",
      "text": "This really is a nifty little pack. The quality isn't the greatest, but it's held up well so far. I like the body straps that keep It snuggly attached to you while doing activities such as biking or climbing or whatever it is you do. The helmet net is pretty cool too. It's very light and allows good ventilation to keep your back cool. It's a good day pack, but I wouldn't use it for carrying a lot of heavy equipment as it is on the smaller side and somewhat cheaply made. But for light everyday activities it's great.",
      "rating": 4.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20160521
    },
    {
      "title": "A neat little backpack",
      "text": "This is a neat little backpack that was a great deal. Its perfect for short outings, I hate having a backpack thats much bigger than I need for the situation for this one was a good buy. I use it to run to work and can easily fit daily supplies in it (lunch, sneakers, a pair of pants). Its kinda silly there isnt a hole for a hydration hose on it but I knew that when I ordered it and wont hold that against it.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Collins",
      "helpful_votes": 0,
      "publication_date": 20160802
    },
    {
      "title": "I really loved the black with fluorescent yellow colors",
      "text": "I ordered this to substitute my old and trusty surfing daypack. It is a bit smaller that I expected but seem to be well manufactured. Has a small top pocket that could be used to store keys or similar sized items, but couldn't fit my iPhone 6 Plus. The front pocket fits the iPhone no problem, as well as my wallet and other small personal items. The main compartment could fit a change of clothes and a bottle of water and some food. I really loved the black with fluorescent yellow colors, it makes the backpack stand out. I just wished that it was a bit larger.",
      "rating": 4.0,
      "verified": true,
      "author": "J.C.",
      "helpful_votes": 0,
      "publication_date": 20150221
    },
    {
      "title": "Very nice build quality; lightweight",
      "text": "I bought this for an upcoming trip to Europe. The quality is superb with lots of little pockets and compartments. There's a backpack cover hidden in a lower zipper compartment that's pretty handy for inclement weather. I'm a medium size guy, and it'll fit me fine, but if you're large, I suggest looking elsewhere for something larger. This seems likely to be handy to hold a camera, a jacket and a couple of water bottles comfortably. The chest strap is an added bonus.",
      "rating": 5.0,
      "verified": true,
      "author": "Wesley",
      "helpful_votes": 0,
      "publication_date": 20150508
    },
    {
      "title": "Small and not durable.",
      "text": "I'll give it two stars for the price but it is not durable at all. All the pockets have holes in them only after a few uses and my keys and misc items fall in-between the layers of nylonf and become hard to reach. Also, this thing is tiny and can barely hold anything.",
      "rating": 2.0,
      "verified": true,
      "author": "Kuucheki",
      "helpful_votes": 0,
      "publication_date": 20170122
    },
    {
      "title": "Nice size, drinks sometimes fall out of pockets",
      "text": "Nice size, drinks sometimes fall out of pockets. When a drink is inserted, the main zipper is difficult to close.",
      "rating": 4.0,
      "verified": true,
      "author": "R. Painter",
      "helpful_votes": 2,
      "publication_date": 20171205
    },
    {
      "title": "totally worth it",
      "text": "For a semi small girl this backpack is perfect for hikes! I wanted a backpack that would be comfortable and this one is great. It is small so if you're planning a serious hike you probably won't want to use this one unless like me you have others with you who can carry larger items. I fit my large water bottle (side pocket), northface vest, a lunch, a Polaroid camera, a lunch, and had plenty more room left. For the price it's a great buy!",
      "rating": 5.0,
      "verified": true,
      "author": "megan",
      "helpful_votes": 0,
      "publication_date": 20150417
    },
    {
      "title": "Holds on Real Tight",
      "text": "Comfy and can handle the weight. I wish a bit more to organize it on the inside, but a quality backpack. Really holds on for good running and biking, etc. It's kinda like having a baby with amazing grip on. I would estimate you could hold about 50 gerbils in the main pouch easily and then at least 5 sticks of butter in the other zipper. If you get chaffing, I recommend vaseline. That's just a general note for life.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170103
    },
    {
      "title": "Perfect hiking and biking buddy",
      "text": "I've wanted a small backpack to take hiking/biking for a while and finally I landed on this one. It's exactly what I was looking for! It's got enough pockets for quite a few small things (my large iphone 6 plus fits in the big pocket on the front), it can fit two water bottles in the side pockets, and the helmet-holding mesh pocket is a fantastic addition to this little gem. I'd highly recommend this product. I used it all summer and it still looks brand-new.",
      "rating": 5.0,
      "verified": true,
      "author": "Kylah Ellison",
      "helpful_votes": 0,
      "publication_date": 20160115
    },
    {
      "title": "I can't believe what a great deal this is",
      "text": "I can't believe what a great deal this is. I wasn't expecting much since its so affordable but we were so impressed when it came. The quality is nice and it has great consideration in the pockets and design.",
      "rating": 5.0,
      "verified": true,
      "author": "Katy Mavour",
      "helpful_votes": 0,
      "publication_date": 20170426
    },
    {
      "title": "Not a ton of storage but good quality pack",
      "text": "Not a ton of storage but good quality pack, if you can pack light you will be happy. solid construction. Good zippers comfortable to wear, i use it cycling and hiking.",
      "rating": 5.0,
      "verified": true,
      "author": "Patrick Egan",
      "helpful_votes": 0,
      "publication_date": 20180201
    },
    {
      "title": "Nice intermediate size and ergonomic shape.",
      "text": "Gave this as a gift for my wife for vacations and field trips with her class. She loves it. Has used it many times and very happy. The size is just right for an extra jacket, camera, etc. Nice compact ergonomic shape. Materials and construction seem durable enough but time will tell.",
      "rating": 5.0,
      "verified": true,
      "author": "warNTmonkey",
      "helpful_votes": 0,
      "publication_date": 20150608
    },
    {
      "title": "Perfect size, really comfortable and I love all the ...",
      "text": "Perfect size, really comfortable and I love all the compartments. The only thing I'd change if I could would be to have the zipper for the main compartment zip up instead of down, this way you can access it easier while it's on your back and not have to take it off each time.",
      "rating": 4.0,
      "verified": true,
      "author": "MB",
      "helpful_votes": 0,
      "publication_date": 20150720
    },
    {
      "title": "Day use pack",
      "text": "This backpack is a nice lightweight option for day use. It's super small. Like fits a Mac book, but not a full sized binder. It has a nice helmet mesh holder for the outside which comes in handy. I like all the pockets, including the bottle holders on the sides.",
      "rating": 4.0,
      "verified": true,
      "author": "Kls",
      "helpful_votes": 0,
      "publication_date": 20160702
    },
    {
      "title": "Great hiking bag",
      "text": "Great light hiking bag. It's perfect for Maui where I live. I can fit my hydroflask, towel, keys wallet phone, and something dry to change into. Don't need more room than that. I strap it on and forget I'm wearing it. And if it starts to rain or I trip in the stream my stuff is dry inside :)",
      "rating": 5.0,
      "verified": true,
      "author": "RobG",
      "helpful_votes": 0,
      "publication_date": 20150311
    },
    {
      "title": "Great deal!",
      "text": "I love this backpack. There is a lot of space inside the main pocket. I normally keep two small notebooks but I can fit a sweatshirt as well. The bottom line is its huge for the size of the backpack. The smaller pocker is also spacious. I carry a lot of otc meds with me. I can fit four or five bottles/boxes as well as my wallet and there is still plenty of space. It's very light weight and the straps are comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Micaela",
      "helpful_votes": 0,
      "publication_date": 20160320
    },
    {
      "title": "The back pack is a good size with plenty of pockets and I love the ...",
      "text": "So i got this backpack to run with because I run right after work so I need to bring my work clothes back home. The back pack is a good size with plenty of pockets and I love the helmet holder. I actually use the helmet holder to hold my little neck pillow because I like to sleep on the bus and it fits perfectly!!! I am pleased with the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Dolorese Johnson",
      "helpful_votes": 0,
      "publication_date": 20150409
    },
    {
      "title": "great pack with wide chest and waist straps",
      "text": "great pack with wide chest and waist straps. My only complaint is that the vertical zipper would have been better used if it was off to one side instead of in the middle and it needs to be reflective, though that may be just me wanting reflective.",
      "rating": 4.0,
      "verified": true,
      "author": "strrynght514",
      "helpful_votes": 0,
      "publication_date": 20150610
    },
    {
      "title": "Light and compact",
      "text": "A light compact, daypack, with many zippered pockets. The sternum and waist straps were welcome. My only issue is that the main compartment opens from the side, not the middle, which may put things off balance if you pack heavy materials.",
      "rating": 4.0,
      "verified": true,
      "author": "NYer",
      "helpful_votes": 0,
      "publication_date": 20150505
    },
    {
      "title": "the straps are easy to deal with and it seems to hold plenty",
      "text": "Lightweight, the straps are easy to deal with and it seems to hold plenty. I appreciate the cooling feature on your back.",
      "rating": 5.0,
      "verified": true,
      "author": "Winston",
      "helpful_votes": 0,
      "publication_date": 20170726
    },
    {
      "title": "Started using it for a snowboard backpack and it's perfect! Just the right size to not get in ...",
      "text": "Started using it for a snowboard backpack and it's perfect! Just the right size to not get in the way, but carry what I need. Really happy with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Colton Slesser",
      "helpful_votes": 0,
      "publication_date": 20170125
    },
    {
      "title": "Nice little functional backpack",
      "text": "It's compact but I can fit a lot in there, water bottle pockets, 3 different zip pockets. The small size is perfect for a little day hike. I tried a few before settling on this one.",
      "rating": 5.0,
      "verified": true,
      "author": "Carolyn Bronz",
      "helpful_votes": 0,
      "publication_date": 20170213
    },
    {
      "title": "excellent pack!",
      "text": "Bought this to carry rain gear and lunch for work on my cbr. Perfect teardrop shape, great construction, and has chest strap as well as waist strap so I dont have it moving around all over. Perfect for on a motorcycle. UPDATE I absolutely love this backpack the more I use it.",
      "rating": 5.0,
      "verified": true,
      "author": "Denver Cox",
      "helpful_votes": 0,
      "publication_date": 20150415
    },
    {
      "title": "Looks nice",
      "text": "I have not used it yet cuz I just got it now but it looks nice and I adjust to fit my body and so far I really like it. Gotta go hiking this weekend to try it out.",
      "rating": 4.0,
      "verified": true,
      "author": "Kim Lan",
      "helpful_votes": 0,
      "publication_date": 20160807
    },
    {
      "title": "perfect size for casual day walks",
      "text": "perfect size for casual day walks. plenty of pockets, I wish the main compartment was bigger and zipped from the top ( it zips on the side) but for the price it is great",
      "rating": 5.0,
      "verified": true,
      "author": "Karyn Allen",
      "helpful_votes": 0,
      "publication_date": 20160419
    },
    {
      "title": "Inexpensive and a good buy",
      "text": "Inexpensive so it's 5 stars for what you expect. A cheaper bag that has so far held up well, it's light, small and comfortable and not unattractive.",
      "rating": 5.0,
      "verified": true,
      "author": "ELG",
      "helpful_votes": 0,
      "publication_date": 20160926
    },
    {
      "title": "Perfect for day hike",
      "text": "I love this pack. It fits everything I need for a day hike (food/water/jacket/phone etc) perfectly and is very comfortable to wear.",
      "rating": 5.0,
      "verified": true,
      "author": "Court",
      "helpful_votes": 0,
      "publication_date": 20161218
    },
    {
      "title": "This was great to take on vacation",
      "text": "This was great to take on vacation. Lots of pockets and areas to store items in. While I haven't been too crazy with it yet, it gives me the feeling that it will be very durable and last a long time.",
      "rating": 5.0,
      "verified": true,
      "author": "Case",
      "helpful_votes": 0,
      "publication_date": 20151117
    },
    {
      "title": "low price, high quality, excellent design.",
      "text": "Has worked out perfectly for cycling (scooting in my case). Helmet net is a great idea. Just the right size and is very comfortable. Worth more than the price!",
      "rating": 5.0,
      "verified": true,
      "author": "Jeffrey the Barak",
      "helpful_votes": 0,
      "publication_date": 20151102
    },
    {
      "title": "Good quality, but runs small",
      "text": "Good quality, but runs small. However, being small keeps you from overloading the Backpack. Lighter is better when hiking!",
      "rating": 5.0,
      "verified": true,
      "author": "Gigi",
      "helpful_votes": 0,
      "publication_date": 20160901
    },
    {
      "title": "Five Stars",
      "text": "Love this backpack. Use it for going to the gym. I would recommend this bag!",
      "rating": 5.0,
      "verified": true,
      "author": "rachel",
      "helpful_votes": 0,
      "publication_date": 20170819
    },
    {
      "title": "Love it for hiking",
      "text": "Perfect for hiking. Not too big, slim enough to fit water bottle and other small essentials needed!",
      "rating": 5.0,
      "verified": true,
      "author": "Cesario116",
      "helpful_votes": 0,
      "publication_date": 20161127
    },
    {
      "title": "great versatile bag",
      "text": "Used it for day trips in Costa Rica - now husband is using it for day to day work bag, I cannot convince him to use 'adult' work bag, he loves it.",
      "rating": 4.0,
      "verified": true,
      "author": "toots756",
      "helpful_votes": 0,
      "publication_date": 20150106
    },
    {
      "title": "good for biking and hiking",
      "text": "lightweight, good for biking and hiking, has padding on back for comfort, lots of extra features, very adjustable, fits my 7 yr old perfectly, reflective green strips and whistle for emergencies.",
      "rating": 5.0,
      "verified": true,
      "author": "Debby",
      "helpful_votes": 0,
      "publication_date": 20150323
    },
    {
      "title": "Perfect backpack for mountain biking.",
      "text": "Perfect backpack for a mountain biker. The backpack is light and has a low-profile yet it's big enough that I can carry all of my tools and parts",
      "rating": 5.0,
      "verified": true,
      "author": "ILoveLamp",
      "helpful_votes": 0,
      "publication_date": 20151009
    },
    {
      "title": "The Ideal Backpack for the Essentials",
      "text": "I bought this backpack for a hiking trip and couldn't be happier with my purchase! The ergonomic fit is great and weight is equally distributed. There is a center strap that locks for balance and it made hiking, crossing rivers, and running super easy. I liked the reflective aspect of it for night and found that the mesh helped a lot when sweaty. Highly recommended - great value!",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie B.",
      "helpful_votes": 17,
      "publication_date": 20160403
    },
    {
      "title": "Perfect for day hikes or a trip to the beach",
      "text": "As compact as this bag is, it holds a lot. Perfect for day hikes or a trip to the beach, holds 2 water bottles, my camera, towel, cell phone and snacks!",
      "rating": 5.0,
      "verified": true,
      "author": "lana",
      "helpful_votes": 0,
      "publication_date": 20150628
    },
    {
      "title": "My son was very happy with this backpack",
      "text": "My son was very happy with this backpack. He wanted a small one for hunting and this fit the bill. It is as described!",
      "rating": 5.0,
      "verified": true,
      "author": "L. Day",
      "helpful_votes": 0,
      "publication_date": 20150104
    },
    {
      "title": "This is a great day hike pack",
      "text": "This is a great day hike pack. I can pack just enough for the day including the following: water, binoculars, first aid kit, Map, compass, poncho, water proof thin gortex jacket, teashirt, mylar poncho, and batteries f or camera. Very light but not bulky. A best buy. I have 2. RFO So. Dakota",
      "rating": 5.0,
      "verified": true,
      "author": "Bob",
      "helpful_votes": 0,
      "publication_date": 20160731
    },
    {
      "title": "Great for cycling outings",
      "text": "Very comfortable, and I like the many compartments. Nicely engineered.",
      "rating": 5.0,
      "verified": true,
      "author": "'zon customer",
      "helpful_votes": 0,
      "publication_date": 20160824
    },
    {
      "title": "Great for Dog adventures",
      "text": "I use it as a dog bag for all hte dog stuff when I go to the park. Works great. Holds everything and is lightweight with lots of pockets.",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony Faulkner",
      "helpful_votes": 0,
      "publication_date": 20150310
    },
    {
      "title": "nice back pack for biking",
      "text": "nice back pack for biking. i like the net which will keep helmet in place when one is walking around.",
      "rating": 4.0,
      "verified": true,
      "author": "BT",
      "helpful_votes": 0,
      "publication_date": 20150906
    },
    {
      "title": "Great bag. Bought this for hikes with my dog",
      "text": "Great bag. Bought this for hikes with my dog. Holds several 16.9 ounce water bottles, toys, and extra clothing. Perfect for day hikes with the need to carry extras. Lightweight and comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20150413
    },
    {
      "title": "This backpack is the perfect size for a ride though the mountain",
      "text": "This backpack is the perfect size for a ride though the mountain. My husband and I both have the same bag!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20150723
    },
    {
      "title": "Backpack",
      "text": "Nice backpack. Very versatile. Plenty of cubbies to store your stuff and keep organized.",
      "rating": 5.0,
      "verified": true,
      "author": "Tim OKeeffe",
      "helpful_votes": 0,
      "publication_date": 20150626
    },
    {
      "title": "Perfect for my gadgets.",
      "text": "This fits my iPad mini, MacBook Air 11.6 and headphones perfect. Can't fit much more than that though.",
      "rating": 5.0,
      "verified": true,
      "author": "Nivek",
      "helpful_votes": 0,
      "publication_date": 20150612
    },
    {
      "title": "can't complain",
      "text": "Excellent backpack. Great for simple, everyday use. For theme parks. Love it. Super light.",
      "rating": 5.0,
      "verified": true,
      "author": "Clumsy Phone Holder",
      "helpful_votes": 0,
      "publication_date": 20150627
    },
    {
      "title": "This backpack appears sturdy and feels good when walking",
      "text": "This backpack appears sturdy and feels good when walking. Will test it this Fall on some hikes plenty of room for all the essentials and a pouch for a poncho.",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth P True-Gibb",
      "helpful_votes": 0,
      "publication_date": 20160906
    },
    {
      "title": "excellent hiking comfort",
      "text": "Yes! so glad i bought this, very comfortable and lots of space. Perfect for day hikes.",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara",
      "helpful_votes": 0,
      "publication_date": 20150512
    },
    {
      "title": "Great!",
      "text": "I bought this to go hiking with my family, and carry water and food. I got it a day before I was supposed to which was great. It was a perfect size, and very well made. It also did well against water.",
      "rating": 5.0,
      "verified": true,
      "author": "Preston",
      "helpful_votes": 0,
      "publication_date": 20161210
    },
    {
      "title": "... he recently started riding bike and this is the perfect size. It's surprisingly good quality for such a ...",
      "text": "got this for my husband he recently started riding bike and this is the perfect size . It's surprisingly good quality for such a low price .",
      "rating": 5.0,
      "verified": true,
      "author": "Daisy D",
      "helpful_votes": 0,
      "publication_date": 20160524
    },
    {
      "title": "Four Stars",
      "text": "perfect for my cycle rides, pouch held bike helmet too. good price",
      "rating": 4.0,
      "verified": true,
      "author": "Stewart",
      "helpful_votes": 0,
      "publication_date": 20170208
    },
    {
      "title": "Three Stars",
      "text": "It is not super comfortable but it is not that expensive for a hiking backpack.",
      "rating": 3.0,
      "verified": true,
      "author": "1006",
      "helpful_votes": 0,
      "publication_date": 20150921
    },
    {
      "title": "Nice pack",
      "text": "Perfect for my 12 year old son. Comfortable & holds what he needs. Exterior helmet storage works well.",
      "rating": 5.0,
      "verified": true,
      "author": "Johnny",
      "helpful_votes": 0,
      "publication_date": 20150409
    },
    {
      "title": "Five Stars",
      "text": "Great pack, comfortable and can hold a decent amt. of baggage.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171008
    },
    {
      "title": "Five Stars",
      "text": "light for bike riding but not enough space for a long hike",
      "rating": 5.0,
      "verified": true,
      "author": "Uyen",
      "helpful_votes": 0,
      "publication_date": 20150731
    },
    {
      "title": "I like it for brief hikes",
      "text": "Smaller than it looked to me, side zipper is a little awkward. I like it for brief hikes, but it's not my go to bag for anything longer than a couple of hours because it's hard to get to things. At the same time, side zipper does stay zipped where some of the top zip bags tend to unzip unless you use a carbiner. Overall, if you need a bag to grab and go and you don't need to get in and out of it frequently, it works great.",
      "rating": 3.0,
      "verified": true,
      "author": "Softspoken",
      "helpful_votes": 0,
      "publication_date": 20150224
    },
    {
      "title": "Five Stars",
      "text": "Great hiking backpack. Lightweight, but fits everything I need to take with me.",
      "rating": 5.0,
      "verified": true,
      "author": "Anita Suri",
      "helpful_votes": 0,
      "publication_date": 20150630
    },
    {
      "title": "Three Stars",
      "text": "Its nice but wayyy too small, definitely meant for children",
      "rating": 3.0,
      "verified": true,
      "author": "D",
      "helpful_votes": 0,
      "publication_date": 20160407
    },
    {
      "title": "My new favorite bag!",
      "text": "I love this pack. It fits very well, is super comfortable to wear, and is just big enough to hold essentials.",
      "rating": 5.0,
      "verified": true,
      "author": "Erin",
      "helpful_votes": 0,
      "publication_date": 20150327
    },
    {
      "title": "Great purchase. Light weight",
      "text": "Great purchase. Light weight. Used it in Colorado and Puerto Rico. Not a ton of storage space but good for wallet, keys, water bottles and small items.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20151229
    },
    {
      "title": "Love this pack",
      "text": "Love this pack. It's very small, but definitely enough to carry what I need for a bike ride to school. Looking forward to hiking with it! Warning: the elastic water bottle holders on the sides aren't tight enough to keep a bottle in if you tip the pack past 180 degrees at all. Not a huge deal, just means that my thermos falls out when I'm picking my pack up by the side sometimes.",
      "rating": 5.0,
      "verified": true,
      "author": "Alice",
      "helpful_votes": 0,
      "publication_date": 20150129
    },
    {
      "title": "Great light backpack",
      "text": "Great light backpack! I have been using it all over the places and few times for BurningMan as well. Love love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Cliente Amazon",
      "helpful_votes": 0,
      "publication_date": 20170405
    },
    {
      "title": "Great product. Used it for dirt biking in the ...",
      "text": "Great product. Used it for dirt biking in the Rookies and it was great. Fits great and cannot even tell you are wearing it. Lots of storage and pockets.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160905
    },
    {
      "title": "Great pack for the price",
      "text": "Great pack for the price. Not an overnight pack but great for day hikes. Love the drink holders and the bicycle helmet net is an added bonus.",
      "rating": 5.0,
      "verified": true,
      "author": "kevin vought",
      "helpful_votes": 0,
      "publication_date": 20160425
    },
    {
      "title": "Good things come in small packages!",
      "text": "It's a smidge smaller than I was hoping, but still perfect! I bought it to run with and its smaller size keeps me from overloading it!",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa T",
      "helpful_votes": 0,
      "publication_date": 20150417
    },
    {
      "title": "Very happy",
      "text": "Was higher quality than I was expecting. It's perfect. I've used it when traveling, it easily fits a change of clothes with bathroom provisions. Planning to use it for a day pack at Disney for a week, and I'm sure it will be perfect for that.",
      "rating": 5.0,
      "verified": true,
      "author": "Simon",
      "helpful_votes": 0,
      "publication_date": 20150501
    },
    {
      "title": "Five Stars",
      "text": "Can't beat it for the price! Light and practical for my needs.",
      "rating": 5.0,
      "verified": true,
      "author": "Rick Bronson",
      "helpful_votes": 0,
      "publication_date": 20170610
    },
    {
      "title": "Love this backpack very light easy to carrie",
      "text": "Love this backpack very light easy to carrie, I use it on those cloudy days to carry a small rain jacket an to protect my cel phone or ipot from rain, also to travel long paths.",
      "rating": 5.0,
      "verified": true,
      "author": "Alex RSR",
      "helpful_votes": 6,
      "publication_date": 20140908
    },
    {
      "title": "Great everyday backpack!",
      "text": "I bought this backpack to use when riding my bike to work. I pack my lunch, carry my hair gel to look good when I get to work and enough room to bring extra clothes to wear on the way back home or purposely taking a detour to enjoy some riding. There still plenty of room for my wallet and my keys. Very durable, light, and has held up well so far. Great buy!",
      "rating": 5.0,
      "verified": true,
      "author": "Davises",
      "helpful_votes": 0,
      "publication_date": 20160709
    },
    {
      "title": "He really loved the size and that it was waterproof",
      "text": "This was a gift. He really loved the size and that it was waterproof! Great buy!",
      "rating": 5.0,
      "verified": true,
      "author": "B. Wood",
      "helpful_votes": 0,
      "publication_date": 20150107
    },
    {
      "title": "Wrong color sent twice",
      "text": "I ordered it in black and was sent a blue TWICE. I'll order the same backpack from but a different seller- one that's not colorblind.",
      "rating": 1.0,
      "verified": true,
      "author": "J. magana",
      "helpful_votes": 0,
      "publication_date": 20150807
    },
    {
      "title": "Four Stars",
      "text": "Great for day trips. Not sure abou water resistance didn't encounter water",
      "rating": 4.0,
      "verified": true,
      "author": "Monica",
      "helpful_votes": 0,
      "publication_date": 20150506
    },
    {
      "title": "Five Stars",
      "text": "Great for kayaking, out on the boat etc. Love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Vicki Retherford",
      "helpful_votes": 0,
      "publication_date": 20150807
    },
    {
      "title": "Its true... sometimes bigger is better...",
      "text": "As other reviewers mentioned, this bag is much smaller than I expected. I haven't used it yet, but I'm concerned it might not function as well as I like as a gym bag.It looks like it will be stuffed by a change of clothes and running shoes. I will probably end up getting another larger bag and using this one for day hikes. However, I do like the style, just wish it were bigger.",
      "rating": 3.0,
      "verified": true,
      "author": "Alissa",
      "helpful_votes": 7,
      "publication_date": 20140815
    },
    {
      "title": "Nice pack.",
      "text": "Nice pack. A little smaller than I thought it might be, but I am 6'5\" 255 lbs, so most things are small. This will be better for me to carry than the one that I was using, now it goes to my son.",
      "rating": 4.0,
      "verified": true,
      "author": "JR",
      "helpful_votes": 0,
      "publication_date": 20150410
    },
    {
      "title": "Five Stars",
      "text": "I love it... Just like the description on the page",
      "rating": 5.0,
      "verified": true,
      "author": "Sharold Camacho",
      "helpful_votes": 0,
      "publication_date": 20150331
    },
    {
      "title": "Be carefully if you are a big guy this will ...",
      "text": "Be carefully if you are a big guy this will fit small on you I could not even close the strap on it",
      "rating": 3.0,
      "verified": true,
      "author": "Ana Negrette",
      "helpful_votes": 2,
      "publication_date": 20140818
    },
    {
      "title": "Super efficient! The helmut holder doesn't perform as well ...",
      "text": "Super efficient! The helmut holder doesn't perform as well as expected I have used this pack every day for about a year now and it is still holding up very well. NOT WATER PROOF",
      "rating": 4.0,
      "verified": true,
      "author": "Joshua Wittman",
      "helpful_votes": 0,
      "publication_date": 20160712
    },
    {
      "title": "Disappointed Pack",
      "text": "This pack looks great as shown but the pack is too small to put anything but a sandwich...",
      "rating": 1.0,
      "verified": true,
      "author": "R. Nazz",
      "helpful_votes": 2,
      "publication_date": 20150512
    }
  ],
  "product_meta": {
    "title": "Naturehike NH15C001-B Unisex Outdoor Cycling Bag, 15L, Black",
    "rating": 4.2,
    "feature_bullets": [
      "Material: 5% chinlon , 95% nylon",
      "Ventilate shoulder girdle: Slim design, docile, breathable, one-piece back breathable net pad for ventilation",
      "Size (LxWxH): 50x33x18 Capacity: 15L; Small front pocket is very practical, suitable for storing small articles such as your mobile phone",
      "Waterproof nylon fabric prevents liquid from entering",
      "Lightweight straps design, enhances comfort"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "7.87 x 3.94 x 5.91 inches; 14.07 Ounces",
      "Item model number": "JT-5ERY-02Z2",
      "Date First Available": "April 4, 2014",
      "Manufacturer": "Naturehike",
      "ASIN": "B00JGO2ASG",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Outdoor Recreation",
      "Sports & Outdoors",
      "Backpacking Packs",
      "Backpacks, Bags & Accessories",
      "Camping & Hiking"
    ],
    "price": ""
  }
}