{
  "website_summaries": [
    {
      "verdict": "This large, vintage-style bag works great as a diaper bag or for everyday use.",
      "pros": [
        "Quality-crafted, fashionable vintage design made of high-density, washed canvas",
        "Has removable or adjustable shoulder strap, offering three carrying options: shoulder diagonal, single shoulder, or hand carry",
        "Multiple compartments for all your iPads, wallets, umbrellas, glasses, diapers, and baby items",
        "Looks great and very functional at the same time"
      ],
      "cons": [
        "There were some complaints about hardware not holding up and shoulder strap breakage"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great bag!",
      "text": "Color is true to photo Bag is huge and awesome Strap is adjustable and long I love it! I added some pins to personalize it",
      "rating": 5.0,
      "verified": true,
      "author": "J Bork",
      "helpful_votes": 40,
      "publication_date": 20161106
    },
    {
      "title": "Cooler than it looks on line!",
      "text": "Even cooler than it looks on line! I love this bag. Heavy duty, dusty grey-charcoal canvas. Extremely well made, all zippers, grommets and fasteners are top quality. The shoulder strap is very adjustable, I am 5'10\" and got the perfect length for \"cross body slouchy\"! A lot of different storage areas, I like the fact that there is an outside zipped area against your body that you can quickly reach items like phone or other small items. Inside is large, but divided into 2 areas with zippers. The fold over closure is a leather strap over button, a little awkward, but very secure.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 8,
      "publication_date": 20180120
    },
    {
      "title": "Happy bag",
      "text": "Ok, I really like this bag. It’s roomy like a larger bag, but not this huge, floppy, awkward thing. Pockets are perfect. Just enough for the essentials with plenty of room to throw stuff in the bottom (like my brush and little zipper bags). Great bag!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 9,
      "publication_date": 20180808
    },
    {
      "title": "Very Good Bag!",
      "text": "This bag is fantastic. I took it on a two week trip through Europe to use as a day bag and it held up beautifully! No signs of wear or fatigue after constant and heavy daily use during the two week period. I have no complaints about this bag whatsoever and will probably start using it as my casual, everyday bag. It has lots of zipper-ed pockets on the inside and one on the outside for easy access. The straps are very comfortable and easy to adjust. You have to tie them in place but I much prefer that to other methods as there is no buckle/clasp to break or wear out.",
      "rating": 5.0,
      "verified": true,
      "author": "kat",
      "helpful_votes": 4,
      "publication_date": 20180826
    },
    {
      "title": "Great bag for under $20!",
      "text": "Great bag! I get compliments on it all the time! Only annoyance is there's an interior pouch with a zipper on it that fits pretty loosely, and as such it tends to hang open over the main compartment of the purse, and I accidentally shove my wallet in there instead if I'm not looking, which prevents it from closing: suffice it to say, me and the purse fight sometimes at the checkout line! But it's infrequent enough, and the purse is great otherwise, so I'm cool with it. It's a nice bag for $15!",
      "rating": 4.0,
      "verified": true,
      "author": "CHAZBUTT",
      "helpful_votes": 3,
      "publication_date": 20180618
    },
    {
      "title": "I am kicking myself spending all this money on expensive bags that are not even as cute when I could spend less and truly enjoy",
      "text": "Picture does not do this justice. It is such a cute bag. I take it everywhere. I am kicking myself spending all this money on expensive bags that are not even as cute when I could spend less and truly enjoy what I am wearing. Really happy with this bag.",
      "rating": 5.0,
      "verified": true,
      "author": "JolieVerdandi",
      "helpful_votes": 21,
      "publication_date": 20170410
    },
    {
      "title": "Holds all my stuff!!!",
      "text": "Holds all my stuff w/o being a really large bag..It takes some getting used to as I had a small bag b4 this one. A little cumbersome for me.. The leather button w/the leather fastener is quite tight to get around the button..But as I'm using it, it is getting softer..This is a very good looking bag & I've had many compliments on it. I would ask the manufacturer to think about a lighter lining..Perhaps Tan w/polka dots or some design..The inside of the bag is very dark w/the dark brown lining. And maybe some more colors to made available...",
      "rating": 5.0,
      "verified": true,
      "author": "fithofanickel",
      "helpful_votes": 2,
      "publication_date": 20181115
    },
    {
      "title": "Great Quality",
      "text": "I am always searching for a great cross body purse and I have found one in this purse! It is made out of a very thick canvas and the color is as shown in the image. It arrived quickly too! I am considering buying one in a different color, however, this one will last so long that I doubt I would need it!",
      "rating": 5.0,
      "verified": true,
      "author": "resec",
      "helpful_votes": 8,
      "publication_date": 20161019
    },
    {
      "title": "Great bag, exactly like the photo",
      "text": "Great bag, exactly like the photo. The cloth is thick and durable, and has two small zip up pockets on the inside and outside. The toggle is a little difficult to button, but that's the only 'problem' I have with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Lucy",
      "helpful_votes": 6,
      "publication_date": 20170110
    },
    {
      "title": "Spacious, comfortable, secure",
      "text": "This was the perfect bag to bring on my honeymoon. It's roomy and can pack a lot of things, but being canvas, it molds to your body without feeling bulky. It also is very secure. There are several interior spaces with zippers to store things, along with a zipper to close the entire bag and a button/tab to secure it even more. I wore it for two and a half weeks straight and it's showing no sign of wear. I would definitely recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "AFII",
      "helpful_votes": 2,
      "publication_date": 20170605
    },
    {
      "title": "super cool messenger!",
      "text": "I'm thrilled with the number & sizes of the pockets & zippered areas inside this pretty amazing messenger bag. It's just the right size bag for me (I've just downsized from a back-pack I'd worn on one shoulder & overpacked). The inner pockets/zippered pouches are perfect to keep my stuff orderly. I can see how the shoulder straps might be uncomfy if it were super full of heavy items, but since it'd be hard to do that considering it's size, it's perfect for me. LOVE IT!!",
      "rating": 5.0,
      "verified": true,
      "author": "Not Karen",
      "helpful_votes": 0,
      "publication_date": 20190405
    },
    {
      "title": "Perfect!",
      "text": "Love this purse! There’s plenty of room for my stuff and enough room to carry around my bulky work notebook, day planner, and iPad. I love how many pockets there are and the colors are awesome! I did undo the things on the sides to help it expand it more, but that doesn’t bother me. I’ve gotten a lot of compliments on it too. Definitely worth the purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Taylour",
      "helpful_votes": 3,
      "publication_date": 20171010
    },
    {
      "title": "Not sure if I would buy again",
      "text": "This bag is super cute. The material seems like it will be durable. My only issue with it is that having to go through the fold over flap to get to the main part of the bag is awkward. There is roughly a foot of fabric before you get to the part of the bag that holds your things. It makes it difficult to see and find things inside it. I’m going to sew up the flap and cut right above the internal zipper so that I can access it by flipping the flap up instead of having to go down through it.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201006
    },
    {
      "title": "It seems pretty sturdy and it's nice looking",
      "text": "I'm giving it 5 stars for now. I just received it yesterday so today is my first day using it. It seems pretty sturdy and it's nice looking. The size is great too. Has a lot of pockets, which I like. A purse is only as good as its straps so we will see how it holds up. The purse is a little heavy on its own and after you put stuff into it, it's gonna be way more heavier so as long as these straps hold up, I will keep my 5 star review. I really like this purse so I hope the straps hold up and don't rip. Fingers crossed 🤞🏻",
      "rating": 5.0,
      "verified": true,
      "author": "stephanie maglietta",
      "helpful_votes": 0,
      "publication_date": 20171018
    },
    {
      "title": "The Messenger Bag that has it all",
      "text": "My Coofit Messenger Bag is amazing. I did not know that I would like it as much as I do. It is large without looking bulky. It is sturdy and should last a long time. The design is pure genius as all contents are safely contained inside the bag without any chance of falling out. The price is more than reasonable.",
      "rating": 5.0,
      "verified": true,
      "author": "Jacqueline L Alberti",
      "helpful_votes": 5,
      "publication_date": 20170323
    },
    {
      "title": "New bag for an old...me",
      "text": "I purchased this because I needed a sort of \"mini\" messenger bag. This will suit that purpose nicely. I appreciate the security of the zipper combined with the fold-over top. (Plus this inside zippered pocket) I like the way the strap adjusts. I've always liked the natural look of canvas. It may be nit-picking, but I removed one star because the bag is less structured in person than in the pictures. Which was mildly disappointing. (Would have only removed half a star, if possible)",
      "rating": 4.0,
      "verified": true,
      "author": "Xelodia",
      "helpful_votes": 0,
      "publication_date": 20180918
    },
    {
      "title": "Every day carry bag",
      "text": "It's a good bag, adjustable strap that can reach across the chest. Ive carried a laptop, two school books and my every day carry supplies in this bag at once. It seems durable and I'm one who slings bags around and is kind of rough on my things. The pockets on the inside have become a slight confusion for me and I have a difficult time finding things on the inside, maybe that's just me though.",
      "rating": 4.0,
      "verified": true,
      "author": "BigolebushTop Contributor: Pets",
      "helpful_votes": 2,
      "publication_date": 20170923
    },
    {
      "title": "Cheap fake leather fabric ripped day 1",
      "text": "I love the style of the bag and the fact that the strap was adjustable however the fake leather fabric holding the strap ripped on day 1 of using it. I am a steamstress so I fixed it myself instead of returning. I figured a new one made of the same fabric would just do the same thing. I am disappointed that I spent money on something that broke the first use. I am also surprised that there are not more reviews stating the same thing, the fake leather fabric was stiff and cheap",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20161231
    },
    {
      "title": "Made very cheap, very very cheap! I was ...",
      "text": "Made very cheap, very very cheap! I was following these recommendations and spent $32 on this bag, but I think all these reviews are false.",
      "rating": 1.0,
      "verified": true,
      "author": "Eden",
      "helpful_votes": 6,
      "publication_date": 20170102
    },
    {
      "title": "Super cute! I always get compliments on it",
      "text": "Super cute! I always get compliments on it. I was worried that this bag would be too big but it is a great size. I use it as a purse but it can definitely hold a second shirt or sweater inside. My only complaint would be that the zipper to get into the bag is very low on the inside making the bag a little difficult to zip and unzip. If you are thinking about buying it, do it! You won't regret it.",
      "rating": 5.0,
      "verified": true,
      "author": "Melanie",
      "helpful_votes": 4,
      "publication_date": 20161024
    },
    {
      "title": "If you don't really care about the cross-body feature you might really like this bag but it doesn't work for me",
      "text": "I wanted a cross-body bag and this bag, although attractive and stylish canvas, has substantial shorter straps that just get in the way. I tried to remove them but couldn't make it happen. They are bulky and heavy because of the metal fittings. If you don't really care about the cross-body feature you might really like this bag but it doesn't work for me.",
      "rating": 3.0,
      "verified": true,
      "author": "T. Johnston",
      "helpful_votes": 2,
      "publication_date": 20180424
    },
    {
      "title": "Best everything bag!",
      "text": "I ordered this bag for my sister as a gift then ordered one for myself and then my mom wanted one. So I've ordered three because I love this bag. You can wear it cross body or shorten the strap to wear it as a purse. I can throw stuff in for the kids and keep that stuff separate from my stuff because there are several pockets. It easily carries my iPad and other devices. And best of all, it's sturdy and the prefect color to not show dirt and wear. Great bag...you'll love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20170327
    },
    {
      "title": "I very much like the bag itself",
      "text": "I very much like the bag itself, but the faux leather cover on the strap is stiff and uncomfortable. I'm talking about the leather piece that is supposed to sit on your shoulder. The faux leather is very thick and sticks out in an awkward way on your shoulder. I don't know how to go about breaking it in. And I don't really want to cut it off. So I just haven't used the bag. Which is a shame.",
      "rating": 3.0,
      "verified": true,
      "author": "Debbie in WS",
      "helpful_votes": 0,
      "publication_date": 20180702
    },
    {
      "title": "It's a great bag, and the color was just as pictured",
      "text": "It's a great bag, and the color was just as pictured, and I like it. However, it is definitely hard to find stuff! The pictures make it seem like the top zipper is right on top- it isn't- its about 4 inches below the openings, which makes it really hard to get stuff into and out of this bag. The closure button is also hard to close. Maybe my leather strap just needs to do loosen up, but I guess it just wasn't exactly what I expected. Still, great material and comfy to carry around. Wish I would have realized those things tho before ordering.",
      "rating": 3.0,
      "verified": true,
      "author": "Megan",
      "helpful_votes": 0,
      "publication_date": 20170705
    },
    {
      "title": "Awful frustrating stylish piece of design nightmare.",
      "text": "This has got to be one of the most frustrating bags my wife has ever used. It is cumbersome to get into and time consuming searching for things deeply buried below the zipper which is down deep in the bag. It is difficult for her to get at the zipper due to the cloth flap and all that extra fabric from the fold down flap just gets in the way. When we get back from this latest trip, we're going to shred it slowly with smiles on our faces.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190222
    },
    {
      "title": "Useful, nice bag-",
      "text": "I used this for a carry-on bag and it worked well. The design of the side ties just doesn't work, though. One of them got lost so I just threw the other one away. Also, there's probably no need for the \"Tao Mao Mao\" logo- it's not quite the same as showing off your Coach bag or something!",
      "rating": 4.0,
      "verified": true,
      "author": "NancyB",
      "helpful_votes": 4,
      "publication_date": 20160919
    },
    {
      "title": "Pretty bag, but not for me.",
      "text": "It’s a very attractive bag, but the double straps are too short to go over the shoulder. Also the opening of the bag is small, and there is an awkward center zip pocket which makes it hard to see your belongings easily. And US residents: this will take about a month to get to you.",
      "rating": 3.0,
      "verified": true,
      "author": "Emily",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "Good bag but slightly flawed design",
      "text": "Bag was slightly smaller than expected but we'll constructed. The strap could stand to be a few inches longer if you're bigger up top. My only major complaint is that due excessive fabric that makes the fold over possible it is difficult to see inside of the bag, not sure what exactly the fix for this would be. All in all I do like it and will use it but probably not as a daily bag as I had hoped.",
      "rating": 4.0,
      "verified": true,
      "author": "Tiffany",
      "helpful_votes": 2,
      "publication_date": 20170202
    },
    {
      "title": "Super cute and practical",
      "text": "I love this purse. The straps adjust to exact length needed. The storage pockets are well done. Quality is excellent. The side pullover with button closure is so cute! The outside zippered pocket is so useful. The biggest downfall is things can get lost deep in the central bag but so worth it to have a versatile bag to be both small and large when needed. I really like the durability and look of the canvas with contrasted leather features.",
      "rating": 5.0,
      "verified": true,
      "author": "Traci C.",
      "helpful_votes": 0,
      "publication_date": 20190826
    },
    {
      "title": "This bag is very nice and I have enjoyed using it",
      "text": "This bag is very nice and I have enjoyed using it. The one problem I have had with it is that the adjustable strap does not stay at the length I adjusted it too. Over the course of a day or two, depending on how much walking around I do with it, it slides to the longest length. This isn't a huge problem, but if one is shorter it could be a bigger problem. Overall, I have enjoyed the bag and it is good quality.",
      "rating": 4.0,
      "verified": true,
      "author": "Deb",
      "helpful_votes": 0,
      "publication_date": 20180605
    },
    {
      "title": "I didn't like this bag",
      "text": "I didn't like this bag. It's not really adjustable (you can tighten the strap, but it doesn't stay). The bag itself is huge, which wouldn't be a problem for me, but the top that folds over was so long and I am short so I had a hard time actually reaching my entire arm into the bag to get my things in/out. The multiple pockets inside the bag were nice, but again, because of the long top, I couldn't really see what I was grabbing. I returned it.",
      "rating": 2.0,
      "verified": true,
      "author": "Sarah Vernau",
      "helpful_votes": 0,
      "publication_date": 20170302
    },
    {
      "title": "Five Stars",
      "text": "Super cute bag! I bought this for traveling. It holds a lot without being super huge.",
      "rating": 5.0,
      "verified": true,
      "author": "Madeline Faith",
      "helpful_votes": 3,
      "publication_date": 20180608
    },
    {
      "title": "This will last for a long while!",
      "text": "I have had this bag for a little over a year now,and it's still in perfect condition! I'm a BUSY boy mom (3 boys),so I'm always going somewhere. I carry my wallet,a book (paperback and hardback),my planner,toys,electronics and any other nonsense things and they all fit! Granted it makes my bag heavy,but it's great quality,and it'll last a long time.",
      "rating": 5.0,
      "verified": true,
      "author": "K",
      "helpful_votes": 0,
      "publication_date": 20190624
    },
    {
      "title": "A little awkward in size",
      "text": "I like this bag a lot. It's a cool, unique style and has extra pockets inside. The only issue I have is that it's a bit bigger than I expected, and it's so deep, that you have to pull the inside of it up to reach the things you put inside. I thought it would be open all the way from the top, but the zipper is actually several inches down inside of it, below where it folds over when closed. Pretty happy with it overall, though!",
      "rating": 4.0,
      "verified": true,
      "author": "Kelly",
      "helpful_votes": 0,
      "publication_date": 20180115
    },
    {
      "title": "Exactly What I Needed",
      "text": "This purse is exactly what I was looking for, but at a better price than I though possible. It's spacious and looks great! The interior lining is a little cheap, but for the price I don't really mind. The slip pockets on the interior started coming apart after a couple of weeks, but it should be an easy fix. Highly recommend.",
      "rating": 4.0,
      "verified": true,
      "author": "Eva",
      "helpful_votes": 3,
      "publication_date": 20160919
    },
    {
      "title": "Cute bag!",
      "text": "Very cute shoulder bag. I love the material and the color. I also like that the style is a little different. This would make a nice travel bag because everything can be kept so securely inside; you definitely don't have to worry about anything getting stolen out of it or falling out of it.",
      "rating": 4.0,
      "verified": true,
      "author": "A. Livieratos",
      "helpful_votes": 0,
      "publication_date": 20190110
    },
    {
      "title": "Nice Purse But;",
      "text": "Purchased the bag Oct. 2018. After 3 months material ripped along the zipper seam. The quality wasn't as I anticipated it to be.",
      "rating": 2.0,
      "verified": true,
      "author": "MLR",
      "helpful_votes": 2,
      "publication_date": 20190124
    },
    {
      "title": "Very Shallow Bag",
      "text": "The bag was big but the inner pocket was very small and swallow. It was not well made. I returned it because it could fit much. The look of the bag is deceiving. It looks great but it was worthless to me because none of my belongs that I normally carry could fit.",
      "rating": 1.0,
      "verified": true,
      "author": "Dharma  ",
      "helpful_votes": 0,
      "publication_date": 20190715
    },
    {
      "title": "Smaller version of the bigger one",
      "text": "It's a huge pocket book I get lost looking for things that I thought that I put in to it. I have a hard time finding the thing that I am looking for. The straps falls off my shoulders all the time. I do love the style of the this pocket book. Wished it was a smaller version of one like the bigger one though. I do not have enough stuff to fill this huge one. But the stykenif is just way too cool. Still. Wish there was a smaller one for sure.",
      "rating": 4.0,
      "verified": true,
      "author": "Donna M Merideth",
      "helpful_votes": 0,
      "publication_date": 20200215
    },
    {
      "title": "Sturdy, handsome bag.",
      "text": "My new grab and go bag. Zip if you want a small bag, I tend to leave it open since I like to pack everything but the kitchen sink. It holds a ton of stuff that way and there's also a handy side zip which holds my keys, saving me hours of rummaging through said stuffed bag looking for it. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Wondering kumala",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "This bag has a nice appearance and is an attractive color",
      "text": "This bag has a nice appearance and is an attractive color. I would have kept it only I saw within the first hour of wearing the bag that the rivets that attach the strap(s) to the bag were getting loose and one had already pulled through the hole and was just hanging on. That tells me that this bag would not last long at all. Poor craftsmanship and poor quality. I am returning it.",
      "rating": 2.0,
      "verified": true,
      "author": "Y. Fianko",
      "helpful_votes": 2,
      "publication_date": 20170420
    },
    {
      "title": "Everyday bag.",
      "text": "I bought this bag to replace my everyday bag. I love it so much. It has different compartments and zippereds pockets. The canvas was stiff at first however now it is breaking in and I am happy with the size and material. Love this bag.",
      "rating": 5.0,
      "verified": true,
      "author": "JRose",
      "helpful_votes": 2,
      "publication_date": 20170516
    },
    {
      "title": "Items are Smaller than advertised",
      "text": "It is MUCH smaller than advertised. I will use it for weekend use but it is too small for daily use.",
      "rating": 3.0,
      "verified": true,
      "author": "Yolanda D. Diva",
      "helpful_votes": 2,
      "publication_date": 20190428
    },
    {
      "title": "this bag SUCKS",
      "text": "This bag sucks!!!!!!!! It is not as big as you would imagine. I mean the outside is, but the inside is like half of the bag, if you know what i mean.. it doesnt go all the way down, the inside goes like halfway down. im not sure if it was a mistake or if every bag is like that. I'm sending it back and buying something else.",
      "rating": 1.0,
      "verified": true,
      "author": "Melissa G.",
      "helpful_votes": 0,
      "publication_date": 20171218
    },
    {
      "title": "Cute but not perfect",
      "text": "This bag is cute. It's a little difficult to get into with the long flap and holds a little less than you would expect given the dimensions. It won't stay on your shoulder unless you wear it cross-body. The dark gray color I ordered is pretty. The material is nice and the zipper/fasteners are good quality.",
      "rating": 4.0,
      "verified": true,
      "author": "Wendy",
      "helpful_votes": 0,
      "publication_date": 20170617
    },
    {
      "title": "I like that it has several pockets for organizing my things",
      "text": "I like that it has several pockets for organizing my things. I like the optional crossbody strap. The color is nice and it is lightweight. It is a good size for me and easy to access. I do wish the middle pocket was a little bigger and taller. The outside pockets could be a little larger for me also. I do like it and I am thinking of getting another one in a different color.",
      "rating": 4.0,
      "verified": true,
      "author": "Alissa Hartling",
      "helpful_votes": 0,
      "publication_date": 20180228
    },
    {
      "title": "Love, love, love!",
      "text": "I get so many compliments on this bag! It is great - the pockets are nice and deep, and I can fill the bag without it looking bulky. I have used it daily for 6 months with no sign of wear whatsoever. I get compliments all the time.",
      "rating": 5.0,
      "verified": true,
      "author": "djcj005",
      "helpful_votes": 0,
      "publication_date": 20181107
    },
    {
      "title": "Good, BUT.....",
      "text": "The bag is well made; color is a medium grey, heavy canvas-like material with brown trim. The look is casual and good. There is a zip pocket front and back; a side interior zip, interior open pockets and a full length center zip pocket. The bag is a little larger than expected. I was going to go with that... but, with exception of the center interior pocket, all the zip pockets are very shallow. I have a Samsung cell-phone, It does not fit.",
      "rating": 3.0,
      "verified": true,
      "author": "O2A",
      "helpful_votes": 2,
      "publication_date": 20170108
    },
    {
      "title": "Not in love",
      "text": "Not a fan, the opening flops over, which is cute, but when trying to get into the purse the opening isn’t very big. There are also a bunch of pockets and zippers on the inside, which makes me have to look for my items for twice as long. The quality of the bag is awesome and very well made, but the actual opening of the purse is not practical.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190507
    },
    {
      "title": "Love it!!",
      "text": "Perfect for size and the pockets are deep and actually hold everything! I've been on the hunt for the perfect purse for me and after alot of disappointments, I finally found this one! I Absolutely love everything about it!! Lightweight and easy to carry, and excellent quality!",
      "rating": 5.0,
      "verified": true,
      "author": "Jv",
      "helpful_votes": 2,
      "publication_date": 20170417
    },
    {
      "title": "I love this purse",
      "text": "I love this purse! It's a little awkward at first due to the fold over top, but now that I've figured it out, it's nice because I put the stuff I always need access to in the outside pocket and the rest of my crazy purse contents inside.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170203
    },
    {
      "title": "Otherwise I’m very pleased.",
      "text": "I received my bag when scheduled and it was exactly as shown. The shoulder strap doesn’t stay in the position I want to so I have to knot it at the bottom and I wish it also had a key holder clip. Otherwise I’m very pleased.",
      "rating": 4.0,
      "verified": true,
      "author": "Audrey Troxel",
      "helpful_votes": 0,
      "publication_date": 20180924
    },
    {
      "title": "Even better than expected!",
      "text": "This bag is perfect. Even better than expected from the mostly perfect reviews. Aside from how adorable it is, It's very sturdy. Has 3 big separate spaces, 2 smaller, 1 side zipped compartment just on the inside. On the outside it has 2 more zipped, 1 on each side. Couldn't be more pleased. Very glad I made this purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Ladydee",
      "helpful_votes": 0,
      "publication_date": 20190121
    },
    {
      "title": "LOVE this bag!!!",
      "text": "I love everything about this bag. The canvas is nice and thick and the stitching looks secure and well made. There are a ton of pockets, which I especially love. The color is so versatile. It really looks good with everything. I love the buckles at the end of the handles. But it has so much room inside it. It has the middle zipper pocket inside splitting the bag into two compartments. So your things stay organized. AND there are leather tabs on all the zippers so you can easily open any pocket. Oh, and you definitely can't beat the price for this!!",
      "rating": 5.0,
      "verified": true,
      "author": "JanineD",
      "helpful_votes": 9,
      "publication_date": 20160909
    },
    {
      "title": "Not very functional for everyday use",
      "text": "I really like the look of the bag, but that's about it. Some parts of the bag seen cheaply made and unnecessary. It's not good for an every day bag as it is a bit of a chore getting in and out of it and locating items and the different pouches. Was hoping for more in this bag.",
      "rating": 3.0,
      "verified": true,
      "author": "kaylaG",
      "helpful_votes": 0,
      "publication_date": 20180314
    },
    {
      "title": "should be fine with reinforcement",
      "text": "The purse's closure button fell off after no time at all, the leather securing the purse strap broke off a week later, should be fine with reinforcement. The interior fabric is so loose & flimsy that it feels like you are just grabbing at the bag & I can never find anything. The inside pockets allow for a weird weight distribution/lumpy bag. Canvas material use for the outside of the bag is thick & sturdy.",
      "rating": 2.0,
      "verified": true,
      "author": "Cody Michaels",
      "helpful_votes": 0,
      "publication_date": 20170917
    },
    {
      "title": "Its a nice bag.",
      "text": "Its a nice bag...it gets lots of compliments. However, the leather loops that hold the handle (a strap) to the buckle, have come apart twice so far...I glued them back into place.",
      "rating": 4.0,
      "verified": true,
      "author": "CeeCee",
      "helpful_votes": 3,
      "publication_date": 20170305
    },
    {
      "title": "Too difficult",
      "text": "It was cool looking online, but when I got it it was very stiff and kind of hard to get situated nicely/comfortably on my side. Also it's really awkward and difficult to get things out of it, because there is like 7 to 8 inches of extra fabric at the top that you have to reach down through to find the purse zipper. Way to difficult in my opinion. Returned.",
      "rating": 3.0,
      "verified": true,
      "author": "mw244",
      "helpful_votes": 2,
      "publication_date": 20161202
    },
    {
      "title": "I love it. The size is perfect and the materials ...",
      "text": "Ordered this bag earlier this week and got it last night. I love it. The size is perfect and the materials is great and looks very durable. I have a full time job and run my husbands business so I carry notebooks, agendas and folders for 8 1/2 x 11 paper and it all fits great and I have plenty of room. I also keep my personal agenda and bills in it and it still leaves room. Its high quality material and doesn't look cheap at all. I have ordered other bags on here and even gotten some in local stores that aren't as durable. Love it and great buy. I will use it with the long strap only.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeanette cosme",
      "helpful_votes": 2,
      "publication_date": 20170413
    },
    {
      "title": "Great bad, hard to get to my stuff.",
      "text": "Great bad. Really hard to get things in and out of. There are so many pockets in here and the opening is so far down its hard to get things out of it. Having said that.... it'll be great for travel. You couldn't get pick pocketed ever. I can't even get my wallet out, no way they are.",
      "rating": 4.0,
      "verified": true,
      "author": "Ms. M",
      "helpful_votes": 0,
      "publication_date": 20170529
    },
    {
      "title": "The worst. The straps are so bizarre they make the ...",
      "text": "The worst. The straps are so bizarre they make the bag practically unusable. Or maybe I got a weird one where it’s all tangled. Also getting anything out of the bag takes forever and the zipper hurts while you whole arm rummages around. Attempted to use once. Haven’t touched it since. Would highly recommend against buying!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180413
    },
    {
      "title": "50/50",
      "text": "Super cute, holds all kind of stuff! Impossible to see in, can only wear across shoulder like a seatbelt or it will absolutely fall off your shoulder.",
      "rating": 4.0,
      "verified": true,
      "author": "Tanner",
      "helpful_votes": 0,
      "publication_date": 20200417
    },
    {
      "title": "It serves its purpose!",
      "text": "This bag is as described. It’s deep and it is a cross body bag, it isn’t soft- but the canvas material has held up well!",
      "rating": 4.0,
      "verified": true,
      "author": "Partyof5!",
      "helpful_votes": 2,
      "publication_date": 20171026
    },
    {
      "title": "Awesome inexpensive bag",
      "text": "This is a great inexpensive bag. It's fairly casual but very cute. It is the perfect size, roomy without being huge. The gray and brown look great and blend with most outfits.",
      "rating": 5.0,
      "verified": true,
      "author": "Julia",
      "helpful_votes": 0,
      "publication_date": 20191002
    },
    {
      "title": "Disappointment intensifies*",
      "text": "The fabric is heavy its an ok bag minimal pockets its just not a good purchase for the money. I wish I could return it. We hate it",
      "rating": 3.0,
      "verified": true,
      "author": "gina votruba",
      "helpful_votes": 0,
      "publication_date": 20191125
    },
    {
      "title": "It looks great, and offers an abundance of storage and zippered out pouches to stay organized.",
      "text": "Honestly this is a unisex bag. I am a man. It looks less like a purse to me and more like a satchel. I got it for being able to keep things on me I wouldn't be able to if I had to haul them all them in my cargo pants. I am a senior and have begun to carry defensive items and this keeps them close at hand.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170623
    },
    {
      "title": "... side to hold it together and it just looks like a big overnight bag",
      "text": "Update: The seller contacted me and was very persistent asking me to change my rating. That said that I received the wrong bag and asked to resend so I will change my review. Surprisingly, the bag was much better quality and held it's shape better. My bag came without the leather straps on the side to hold it together and it just looks like a big overnight bag. It has no shape or a style. Returning.",
      "rating": 4.0,
      "verified": true,
      "author": "KM & CM",
      "helpful_votes": 0,
      "publication_date": 20180424
    },
    {
      "title": "Just the right size",
      "text": "I haven't had a chance to use it, but I'm so ready. It's roomy, the stitching is nice, the details really make it an unusual and cool looking. Love the color, a deep grey, very sexy. I looked for days for something different and this one does it for me!!",
      "rating": 5.0,
      "verified": true,
      "author": "Helen GriffisTop Contributor: Makeup",
      "helpful_votes": 0,
      "publication_date": 20170524
    },
    {
      "title": "LOVE IT!",
      "text": "I absolutely LOVE this handbag! It is so versatile and I really like the sturdy handles and shoulder strap that is attached. Would definitely buy this again.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa K",
      "helpful_votes": 0,
      "publication_date": 20200314
    },
    {
      "title": "I love this bag and have used it many times since ...",
      "text": "I love this bag and have used it many times since purchasing. It holds tons of stuff and is easy to carry cross-body. I took it to music festival and it was great for holding water and personal items. Also used it for hiking.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Ashcraft",
      "helpful_votes": 0,
      "publication_date": 20170914
    },
    {
      "title": "Really like this purse",
      "text": "Really like this purse. The canvas is much lighter than a comparable size leather purse. Really like the shoulder straps and the top zipper enclosure. It makes me feel more secure than some of my open top purses. The zippered pockets really help organize and the squared off inside material makes it easy to find items. The only con was the color wasn't grey as shown, it was more taupe. I'm keeping it anyhow and am happy with it.",
      "rating": 4.0,
      "verified": true,
      "author": "Suzy",
      "helpful_votes": 0,
      "publication_date": 20170823
    },
    {
      "title": "Good",
      "text": "Like this bag a lot. Its simple and has a lot of pockets in the inside. Color is a tad lighter than expected but still a great shade of grey. The \"leather\" pieces are stiff and plastic feeling but I don't mind that.",
      "rating": 5.0,
      "verified": true,
      "author": "Sydney",
      "helpful_votes": 2,
      "publication_date": 20170419
    },
    {
      "title": "Great bag!",
      "text": "This is a great bag! I bought it to use on a trip to NYC so I could be haul around all of my essentials and still be comfortable. Now I carry it everyday! Its very cute, well made, and has a TON of room inside. There are separate compartments so you can still organize your things and locate everything easily. Great purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 0,
      "publication_date": 20170922
    },
    {
      "title": "Not a good bag for me!",
      "text": "the bag is durable and looks cool but i continually struggle putting items in and taking them out of this bag......All the compartments inside are always catching anything i try to put in and take out. I've tried several times to work this out and its just not for me...I can never find anything once i struggle to get them in,they keep catching on the zipper compartments inside the bag, in or out things get stuck! I would like to return.......",
      "rating": 2.0,
      "verified": true,
      "author": "Happy with this sweatshirt for my dog",
      "helpful_votes": 0,
      "publication_date": 20181201
    },
    {
      "title": "Spacious with pockets",
      "text": "The zipper pocket on the outside is starting to tear, but otherwise it's holding up well, and has a lot of room.",
      "rating": 4.0,
      "verified": true,
      "author": "Lauren",
      "helpful_votes": 0,
      "publication_date": 20190427
    },
    {
      "title": "Nice purse",
      "text": "I LOVE this bag. It has so many pockets hidden everywhere, too! It's a great size, the only problem I had was the back straps sliding and making the strap over my shoulder longer, but I fixed that with an elastic. Love the purse!",
      "rating": 5.0,
      "verified": true,
      "author": "S. White",
      "helpful_votes": 0,
      "publication_date": 20180704
    },
    {
      "title": "Great purse but falls apart",
      "text": "I love this purse, it fit all my stuff and i have a ton but after awhile it did start to tear on the interior",
      "rating": 4.0,
      "verified": true,
      "author": "Amanda Coppola",
      "helpful_votes": 0,
      "publication_date": 20191015
    },
    {
      "title": "I thought the quality of this bag was very nice, but it was more fussy than anything",
      "text": "I thought the quality of this bag was very nice, but it was more fussy than anything. The loop closure on the flap was not very easy to fasten/unfasten. The bag was also stiff so you had to take the extra time to fasten properly. Returning this item was fast and simple.",
      "rating": 3.0,
      "verified": true,
      "author": "Jessica De Los Santos",
      "helpful_votes": 0,
      "publication_date": 20170806
    },
    {
      "title": "Not as deep as it looks",
      "text": "The bag has a couple pockets but the picture is a bit deceiving because where it shows it folds over thats wher the zipper is so its not as deep as it looks.",
      "rating": 3.0,
      "verified": true,
      "author": "Scott Lucas",
      "helpful_votes": 0,
      "publication_date": 20190416
    },
    {
      "title": "... functional for her while still being casual and looking nice. This crossbody bag ended up being perfect for ...",
      "text": "My mom had been struggling to find something that was functional for her while still being casual and looking nice. This crossbody bag ended up being perfect for her! It's soft but sturdy, holds just the right amount of stuff, and looks nice. She's trying to convince me to get one for myself!",
      "rating": 5.0,
      "verified": true,
      "author": "Kaci Walley",
      "helpful_votes": 0,
      "publication_date": 20180901
    },
    {
      "title": "It's a great size for carrying books or small laptop",
      "text": "Bought this for my daughter and she LOVES it. It's a great size for carrying books or small laptop, sturdy and cute.",
      "rating": 5.0,
      "verified": true,
      "author": "Angry YaYa",
      "helpful_votes": 2,
      "publication_date": 20160924
    },
    {
      "title": "Glue used to make the purse is very visible",
      "text": "My main issue with this bag is that it has huge globs of glue where they glued seams together",
      "rating": 2.0,
      "verified": true,
      "author": "Weaks",
      "helpful_votes": 0,
      "publication_date": 20191023
    },
    {
      "title": "Great bag",
      "text": "This is my favorite bag , it’s so cute I put some pins on it and it’s great.",
      "rating": 5.0,
      "verified": true,
      "author": "IOU",
      "helpful_votes": 0,
      "publication_date": 20200129
    },
    {
      "title": "Exactly as described",
      "text": "Perfect size for a side bag if you don't keep your life in your purse. All the extra zippers and pockets make organization easy, the pockets are deep enough so your items dont fall out of the pockets into your purse.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Staley",
      "helpful_votes": 0,
      "publication_date": 20190212
    },
    {
      "title": "Strong moldy smell",
      "text": "Good idea. Poor execution, the zipper cuts it in half. My biggest problem is that it was moldy. I washed and its been outside for 2 days and it still smells moldy! Was really looking forward to enjoying it.",
      "rating": 2.0,
      "verified": true,
      "author": "Cynthia",
      "helpful_votes": 0,
      "publication_date": 20190601
    },
    {
      "title": "I use my bag everyday so I am definitely getting ...",
      "text": "I use my bag everyday so I am definitely getting a lot of use out of it. Unfortunately the hardware on one of the corners were the straps are attached, fell off and got lost. I now see the stitching starting to fray. Just a matter of time before I will have to sew it or retire it :(",
      "rating": 4.0,
      "verified": true,
      "author": "Fruit Ninja is pretty challenging, but after awhile it gets to the point when you just cannot get the prizes. After all, this game is acceptable.",
      "helpful_votes": 0,
      "publication_date": 20170722
    },
    {
      "title": "Like it!",
      "text": "I bought this for my daughter in law for Christmas. She loves the bag! I’m happy because she is hard to shop for. She’s not much of a purse girl so this is perfect, being a cross body bag. Functional and cute too.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazonfreak",
      "helpful_votes": 0,
      "publication_date": 20190119
    },
    {
      "title": "Is what I wanted minus the shoulder strap. It ...",
      "text": "Is what I wanted minus the shoulder strap. It is missing one the parts to attach it to the purse. One of the reasons I bought it is that I miss a shoulder strap. And now I can't use it. Update: Since it came incomplete they gave me a full refund. Which is really nice",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 5,
      "publication_date": 20161002
    },
    {
      "title": "Love it",
      "text": "This bag is amazing. Love it and use it day. Has plenty of room for everything. Great stitching and made extremely well. Wouk purchase more from them. Love it",
      "rating": 5.0,
      "verified": true,
      "author": "Linda Johnson",
      "helpful_votes": 0,
      "publication_date": 20181104
    },
    {
      "title": "I love this bag",
      "text": "I love this bag! Great number of pockets/compartments for keeping organized. Bag is much more attractive in person than the picture. My only issue with this bag, and almost ALL bags is they need to have a light colored lining. But that said, I'm very pleased with this bag & the price was great.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Loos",
      "helpful_votes": 0,
      "publication_date": 20180304
    },
    {
      "title": "Love it!",
      "text": "Love this bag! I got it to be durable as a purse/travel bag since I am a dog walker. It's comfortable if you adjust the leather straps properly and its super cute. Still using it now!",
      "rating": 5.0,
      "verified": true,
      "author": "Deidra",
      "helpful_votes": 0,
      "publication_date": 20191108
    },
    {
      "title": "Not worth the price",
      "text": "Zipper pulled apart from the stitching making the outer pocket unreliable. Interior is such that the usable part begins halfway down the bag making it hard to see items in the purse.",
      "rating": 1.0,
      "verified": true,
      "author": "Colleen Floyd",
      "helpful_votes": 0,
      "publication_date": 20180827
    },
    {
      "title": "Fantastic bag!",
      "text": "I love this bag I'm a mother of 3 and always have extra to carry with me . And I hate diaper bags and it's nice to have a fashionable bag that can carry anything I need and still have my style about me .",
      "rating": 5.0,
      "verified": true,
      "author": "Working Mom",
      "helpful_votes": 0,
      "publication_date": 20190407
    },
    {
      "title": "Great bag for travel",
      "text": "Nice and roomy, with plenty of small zipper pockets inside to keep phone, passport, and wallet secure. This bag is going to be great for travel. It will hold a lot of personal items, and even a tablet computer or a book. I like the look of it too.",
      "rating": 4.0,
      "verified": true,
      "author": "Martha Marshall",
      "helpful_votes": 0,
      "publication_date": 20181214
    },
    {
      "title": "It's almost like a giant turtleneck is connected to my purse",
      "text": "It's a huge bag. I figured that the flap had a zipper underneath but it doesn't. It's almost like a giant turtleneck is connected to my purse. Canvas material seems sturdy but I have worn it out pretty quickly",
      "rating": 3.0,
      "verified": true,
      "author": "Bridget R",
      "helpful_votes": 0,
      "publication_date": 20171010
    },
    {
      "title": "I really liked the bag so it's upsetting",
      "text": "One of my straps broke just a couple days after I got it. I really liked the bag so it's upsetting.",
      "rating": 1.0,
      "verified": true,
      "author": "K.K.G",
      "helpful_votes": 3,
      "publication_date": 20161123
    },
    {
      "title": "Style and Quality",
      "text": "The weight is just right to be carried around the whole day. It fits my laptop, small sketch pad and wallet. It is thick but not too heavy. I have been using it for months and it has become softer but stitches are still intact and so are the pockets.",
      "rating": 5.0,
      "verified": true,
      "author": "Unfiltered Words",
      "helpful_votes": 0,
      "publication_date": 20170207
    },
    {
      "title": "Great messenger style bag!",
      "text": "Love it. I am a fan of cross body bags like this and am quite satisfied!",
      "rating": 5.0,
      "verified": true,
      "author": "Destinies Entwined",
      "helpful_votes": 0,
      "publication_date": 20200212
    },
    {
      "title": "I do love the purse",
      "text": "I do love the purse .The material is nice, well sewn with shoulder and hand carry. The straps are adjustable,pockets inside ,zipper section in the middle , outside pockets and a zipper it's exactly what I wanted",
      "rating": 5.0,
      "verified": true,
      "author": "kasis",
      "helpful_votes": 0,
      "publication_date": 20170915
    },
    {
      "title": "which makes for a very nice combination, but if you are looking for true ...",
      "text": "Really cute bag. I have received many compliments already! I had to send my mother the link because she wants to order one for herself! I got he gray/Brown. I would say that the gray does lean a bit towards olive, which makes for a very nice combination, but if you are looking for true gray, be aware.",
      "rating": 5.0,
      "verified": true,
      "author": "Christy",
      "helpful_votes": 2,
      "publication_date": 20171217
    }
  ],
  "product_meta": {
    "title": "Crossbody Bag, COOFIT Messenger Bag Casual Canvas Bag Shouder Bag Unisex",
    "description": "PRODUCT DETAILS\n * Is Discontinued By Manufacturer :No\n * Product Dimensions :7.87 x 7.87 x 3.94 inches; 1.2 Pounds\n * Item model number :CF0033\n * Department :Womens\n * Date First Available :August 4, 2015\n * Manufacturer :Coofit\n * ASIN :B01CQBS3B8\n\n * Amazon Best Sellers Rank: #142,399 in Clothing, Shoes & Jewelry (See Top 100 in Clothing, Shoes & Jewelry)  *  #503 inWomen's Crossbody Handbags \n    *  #180 inWomen's Hobo Handbags \n    *  #575 inWomen's Tote Handbags \n   \n   \n\n * Customer Reviews:4.2 out of 5 stars791 ratings",
    "rating": 4.2,
    "feature_bullets": [
      "Zipper closure",
      "Messenger bag for women: Material updated to good quality canvas, so it looks and feels sturdy. The purse is not just a nice looking purse but you can definitely tell it's a very sturdy purse.",
      "Shoulder bag for women: There is one zippered compartment on the outside of the bag, the additional smaller pocket makes storing medicine and other smaller important items easy to find. You can use it for your lip gloss so it doesn't get lost with all of your goodies in your purse.",
      "Crossbody bag: The purse has an additional strap with that can adjust easily. It can be carried as a tote bag, across the chest sideways, or just over the shoulder like a normal purse.",
      "Crossbody bags for women: The size is perfect for someone who has more than a wallet and phone to take with them all the time.",
      "Canvas bag dimensions: 12.9 x 15.3 x 2.7 inches (W * H * D)."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "7.87 x 7.87 x 3.94 inches; 1.2 Pounds",
      "Item model number": "CF0033",
      "Department": "Womens",
      "Date First Available": "August 4, 2015",
      "Manufacturer": "Coofit",
      "ASIN": "B01CQBS3B8"
    },
    "categories": [
      "Women",
      "Crossbody Bags",
      "Handbags & Wallets",
      "Clothing, Shoes & Jewelry"
    ],
    "price": 25.99
  }
}