{
  "website_summaries": [
    {
      "verdict": "Though it gets high marks for security and its protective craftsmanship, the numerous known issues with the lock are concerning.",
      "pros": [
        "Combines fire-resistant protection for up to 30 minutes at 1550 degrees with waterproof build",
        "Handle makes it easy to carry",
        "Owners like the mid-level size that is also less cumbersome to maneuver than heavier models"
      ],
      "cons": [
        "Issues with the lock are common – sticking, failure to latch, and inability to open",
        "Not spacious enough for larger files unless you fold them"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Does not allow USA 8.5 x 11\" paper to lay flat on Medium size safe. Causes 2 entire edges of important docs to curl up. Not good",
      "text": "Does not allow for USA 8.5 X 11\" paper to lie flat. Will curl up edges on 2 sides of paper. Not well thought out in that respect. Purchased the medium 4.5\" deep, not much can be stored in that space. Thick case and feels solid, just needs to be a few more inches deeper and 1/2\" wider to accommodate pages to lay flat. For some might not matter. In my case, important docs and papers should not end up being curled. Poor design in that respect. Feels overpriced if it will not allow for common USA size as advertised and described.",
      "rating": 2.0,
      "verified": true,
      "author": "Grizzly BearTop Contributor: Baking",
      "helpful_votes": 167,
      "publication_date": 20171214
    },
    {
      "title": "Nice safe, but---",
      "text": "Upon initially receiving this safe I was very pleased. It was solid, roomy and fit my needs exactly. Then I dropped it. The lid was closed but it popped off easily and could not be replaced. Upon contacting the company, I was told that since it was dropped (from a height of three feet), they did not consider it a workmanship defect and therefore it was not eligible for replacement under the warranty. It seems like a nice product, just don't drop it or try to deal with their customer service department.",
      "rating": 3.0,
      "verified": true,
      "author": "Thomas Modi",
      "helpful_votes": 137,
      "publication_date": 20171016
    },
    {
      "title": "Sentrysafe is garbage.",
      "text": "Handle rips right off the box under the box's weight. I thought maybe it was disassembled from factory, so slid it back in and checked that all the plastic tabs were dovetailed together. Lifted the handle with it even locked, handle/lock mechanism rips right out of the box. Fail. Gonna buy a honeywell. Sentrysafe is garbage.",
      "rating": 1.0,
      "verified": true,
      "author": "Nataly13",
      "helpful_votes": 128,
      "publication_date": 20171007
    },
    {
      "title": "This safe does not open easily. I was trapped and could not open this ...",
      "text": "Beware! This safe does not open easily. I was trapped and could not open this thing for two days. Needed contents and almost had to break in to it. I called Sentry and they said it was a common problem to have problems unlocking this safe. Told me to put weights on it overnight. Still could not open. After pounding and prying I got it open thank goodness. Returned it for a refund.",
      "rating": 1.0,
      "verified": true,
      "author": "DEB",
      "helpful_votes": 86,
      "publication_date": 20170921
    },
    {
      "title": "dissapointed in sentry co,!!!",
      "text": "very surprised that sentry would send out a safe in this condition ( broken and not usable ) doesn't close at all and handle is broken off and not re-installable . It should definitely not be labled a ' SAFE\"",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 50,
      "publication_date": 20171009
    },
    {
      "title": "Heavy and well made.",
      "text": "must be honest....we shopped for these at WalMart but ended up buying this one through Amazon because of size and price. It was supposed to be a gift for our daughter who's going to college but we ended up keeping it for ourselves. It's extremely heavy and a bit big for her needs. Ended up buying the next size down at WalMart (needed it faster than Prime) for our daughter to keep her important papers in, might as well start her off on the right foot, right? We had a 'strong box' but this one is so well made we decided to keep it instead of returning it. Made by the same company, highly recommend both!",
      "rating": 5.0,
      "verified": true,
      "author": "TheBossTop Contributor: Baking",
      "helpful_votes": 18,
      "publication_date": 20170727
    },
    {
      "title": "Fire box - not a safe",
      "text": "Without putting it through a house fire, it is hard to fully evaluate. It is solid and arrived undamaged. A couple of thing to point out - this is a fire box, not a safe. It is not intended to be impenetrable or to protect valuables from burglars. The only point of the latch is to keep the lid closed in the event of a fire. Almost any fire box can be opened by dropping it from waist height on its corner onto a hard surface. I use two Sentry Safe fire boxes to put paperwork and documents in AND then place the fireboxes in a large guns safe which is bolted to the floor.",
      "rating": 5.0,
      "verified": true,
      "author": "TNT in Maryland",
      "helpful_votes": 4,
      "publication_date": 20190311
    },
    {
      "title": "Three Stars",
      "text": "I think it's a good buy, although in the back a lid came off and cement came out too.",
      "rating": 3.0,
      "verified": true,
      "author": "Malexdra",
      "helpful_votes": 14,
      "publication_date": 20171110
    },
    {
      "title": "Oops",
      "text": "There is a chemical that is in the safe that makes it fireproof. However the product wasn't sealed correctly and there was powder all inside the safe.",
      "rating": 1.0,
      "verified": true,
      "author": "criticalconsumer",
      "helpful_votes": 10,
      "publication_date": 20180404
    },
    {
      "title": "Is it a Safe if it doesn't lock?",
      "text": "I'v never been able to lock this product. I have several people try t and no one can get it to lock. Not much of a safe if it doesn't lock. Send a note to the seller and didn't hear anything back.",
      "rating": 1.0,
      "verified": true,
      "author": "Darryl L. Cottier",
      "helpful_votes": 26,
      "publication_date": 20150610
    },
    {
      "title": "Easy to Open, Holds my Papers.",
      "text": "Works great for what I needed, living in a heavily wooded area with a history of wildfires I needed something to keep my documents safe in case of fire. Tax documents, school transcripts, etc. fit perfectly in there. I had no issues with the lock or latch to open it, so I'm not sure if maybe other people got defective safes. It was very easy to open. For website registration: The serial number is on the little white sticker inside. The model number is what Amazon has listed in the title. The \"key code\" is written on the key itself on a silver plate.",
      "rating": 5.0,
      "verified": true,
      "author": "Shay",
      "helpful_votes": 4,
      "publication_date": 20180104
    },
    {
      "title": "Waterproof Seal came off...do I send it back or what?",
      "text": "August 29th, 2017(was when I bought it), March 24th, 2018 is when I noticed the seal came off, not even a year, with little to slightly moderate use, the waterproof seal came off. I don't like contacting customer service for something that should be this durable but I'll reach out to them and update this review accordingly. (And no, I didn't damage it or intentionally peel it off or anything. I noticed it was already somewhat loose within the first few days, thought I saw that the seller/manufacturer recommends to just leave the seal the way it is from someone's question.)",
      "rating": 3.0,
      "verified": true,
      "author": "Johnny Cage",
      "helpful_votes": 4,
      "publication_date": 20180324
    },
    {
      "title": "Not perfect, but will do the job well",
      "text": "This thing is heavy, durable, and airtight. Way bigger & heavier than I expected actually. I don't think a bullet would penetrate this thing..but as some reviewers mentioned: the latch is like a $0.50 piece of plastic. I could rip it off with one hand if I wanted to. The lock seems quite secure but you have to press down on the lid while opening (they even give instructions for that on an enclosed slip). Overall it's a nice 'safe' but it's more about fire/flood protection then theft. A thief good take this easily or certainly rip off the latch. Good enough for our needs",
      "rating": 4.0,
      "verified": true,
      "author": "John A. Mickus",
      "helpful_votes": 0,
      "publication_date": 20190802
    },
    {
      "title": "Poor lock/handle design",
      "text": "I have a larger SentrySafe fire box that I'd had for years which seems sturdy and well built, so felt confident ordering this smaller unit. I removed this from box, carried across the room and put a few computer hard drives inside that keep my backups, weighing only a pound, maybe 2. I lifted by handle to take to closet for storage and entire handle and lock assembly pulled away from box, allowing lid to open and dropping box. The pieces did not appear to be broken, and I tried snapping back together, but it would not hold whether lock was engaged or not. Returning for refund.",
      "rating": 1.0,
      "verified": true,
      "author": "L. Preston",
      "helpful_votes": 2,
      "publication_date": 20190112
    },
    {
      "title": "Worked fine until recently",
      "text": "Bought this in December for my wife. Worked fine until recently. Could not, for the life of me, get it to open. Key turned, but nothing happened. Finally, with a great deal of force, I managed to get the safe opened, but it'll never be the same. It now resides in some landfill. Very disappointed. My first SentrySafe is still operational, and I have no complaints, but this unit was a waste of money.",
      "rating": 2.0,
      "verified": true,
      "author": "Bob",
      "helpful_votes": 6,
      "publication_date": 20170822
    },
    {
      "title": "https://images-na.ssl-images-amazon.com/images/I/41wjtN1jgQL._SS300_.jpg",
      "text": "Its a heavy container and feels like it should meet the standard the manufacturer says it will do. The box will hold about a 300 page ream of school paper. 500 page ream will not fit. So you will be selective on how much you can store but it feels like a quality unit. Its better than nothing for water &fire protection. if your looing for security, its only got the key & id personally spend the extra $$ for digital lock vs a keyed unit. Just my opinion.",
      "rating": 5.0,
      "verified": true,
      "author": "Chief",
      "helpful_votes": 7,
      "publication_date": 20170820
    },
    {
      "title": "Horrified I purchased the this!",
      "text": "This box when lifted by the handle along with the lock assembly comes clean off! I’m mortified at the malfeasance Of security items that Amazon will sell. Run away fast! This is a dumpster Fire!",
      "rating": 1.0,
      "verified": true,
      "author": "MWalt",
      "helpful_votes": 3,
      "publication_date": 20200629
    },
    {
      "title": "Interior dimensions smaller than advertised",
      "text": "I bought this firebox specifically because it said the interior dimensions had a width of 8.5 inches. This is not entirely true. At the top of the opening on the bottom storage item, it is 8.5 inches in width. But the bottom narrows and is easily .2 to .3 inches smaller in width. So, if you want to store an 8.5-inch x 11-inch stack of papers in the bottom without needing to fold or bend them, you're out of luck. Other than that, the unit is good.",
      "rating": 3.0,
      "verified": true,
      "author": "Kevin M. Meehan",
      "helpful_votes": 2,
      "publication_date": 20200518
    },
    {
      "title": "CHEAP PLASTIC LOCKING LATCH AND HANDLE",
      "text": "Had the safe for about three days sitting and then went to really look at it and use the key that's when the handle popped off after about lifting at three times then I noticed the key locks a plastic latch which upon further inspection just snapped right off. So my question, how in the world is this safe supposed to be fire proof if the latch is made out of plastic (very thin and flimsy plastic on top of it) absolutely ridiculous",
      "rating": 1.0,
      "verified": true,
      "author": "MELVIS ",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "Cheap locking system",
      "text": "This safe is not secure and, as it is not mounted (I should have realized this earlier) it is easily removed from the home in the event of a break in. But mostly, the product is just cheap. How secure is any safe that has a locking mechanism you can break with a hammer? Not much...",
      "rating": 1.0,
      "verified": true,
      "author": "AngelicaJewels",
      "helpful_votes": 2,
      "publication_date": 20200308
    },
    {
      "title": "NOT SECURE",
      "text": "This box is NOT secure -- I had cash in my box stolen from me, as it seems that the front lock is plastic-on-metal and can be pried off easily. It's a big heavy box with a lot of weight and heft with a sub par breakable lock. Complete waste of money and materials. If possible, I'd really like my money back.",
      "rating": 1.0,
      "verified": true,
      "author": "Frank C.",
      "helpful_votes": 34,
      "publication_date": 20160930
    },
    {
      "title": "Keeps your important documents safe!",
      "text": "I was worried about this purchase based on some of the negative reviews. However, when it arrived, it was super sturdy and in good condition. The lock was in good condition and quality as well. The straps on the top aren't tight enough to hold a passport like pictured, so I'm not using them for anything. They might hold something thicker, but they didn't work for the passports. I find it roomy enough for all the important things like birth certificates, passports, marriage certificate, etc.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie R.",
      "helpful_votes": 0,
      "publication_date": 20191122
    },
    {
      "title": "Okay safe, kinda bulky",
      "text": "The safe is cool, it does its job, but i can see how it could easily be cracked open by force. This is okay, i didnt need a bank quality safe, but for something that isnt force resistant and most likely used to dissuade children or nosy roommates, its bulky as hell! Its heavy and big and more wall than actual space for valuables. Why? Its not going to hold up if you drop it, just make a smaller sleeker safe. TL;DR - its a bulky lockbox, but not horrible by any means, just dont store your guns or jewels in it.",
      "rating": 4.0,
      "verified": true,
      "author": "Corterri",
      "helpful_votes": 0,
      "publication_date": 20191006
    },
    {
      "title": "A responsible purchase",
      "text": "This was a wonderful grown-up purchase. So far, I'm keeping important documents, passports, birth certificates and SS cards that can be placed in a folder and clipped to the inside of the lid, leaving tons of room for other things. I have peace of mind knowing that these important documents are safe from theft, fire or water damage.",
      "rating": 5.0,
      "verified": true,
      "author": "Amber",
      "helpful_votes": 3,
      "publication_date": 20180316
    },
    {
      "title": "No complaints",
      "text": "So far no complaints! I have seen a lot of bad reviews after I bought, so I'm cautious, but I personally haven't had any problems. It holds my important regular sized papers like our birth certificates, my marriage license, social security cars, ect. and has plenty of room in it for other things. I have a mini jewelry box with all of my real jewelry in it so I do t have to put 8 different boxes in there. It is a bit bulky but small enough where I am able to keep it under my bed.",
      "rating": 5.0,
      "verified": true,
      "author": "Jackie Bartie",
      "helpful_votes": 0,
      "publication_date": 20200517
    },
    {
      "title": "How did they select the interior dimensions?",
      "text": "The safe seems sturdy and well constructed...but the interior dimensions are odd. Long enough for a 9 x 12 envelope...but a 1/2 inch too narrow. File folders won't fit either. It is important that all documents fit within the perimeter of the rubber gasket that makes the contents waterproof. It requires the user to bend folder and envelopes to fit. A little bit of ergonomic engineering could have made this product 5 star instead of 3.",
      "rating": 3.0,
      "verified": true,
      "author": "Merle S. King",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "You gotta pay attention to specifics.",
      "text": "As big as the exterior of the safe is, I expected to find a greater capacity on the inside. I was disappointed. There is only a small improvement in the interior capacity of this unit over that of the fire-proof safe I was replacing. And this sucker is heavy. But, all that is beside the purpose of having a waterproof fire safe. There is no doubt that this unit will be totally protective of my papers should the occasion arise.",
      "rating": 3.0,
      "verified": true,
      "author": "Larry A. Culmer",
      "helpful_votes": 2,
      "publication_date": 20180128
    },
    {
      "title": "Its ok",
      "text": "Some of the reviews here are too much especially since this is a cheap safe but still pretty good for the price. This box came with a the keys, and two straps to secure things within the safe, and also had a handle. It only fits regular sized letter paper (8.5x11) but not legal size or folders. Probably best to just fold everything to fit. Only thing I'm concerned about is keeping jewelry inside. The manual said to keep anything of value (like jewelry, photos, etc.) inside a water tight container (I don't think one would fit or where to find one). Overall happy with my decision and will serve its purposes.",
      "rating": 4.0,
      "verified": true,
      "author": "Jay",
      "helpful_votes": 0,
      "publication_date": 20180822
    },
    {
      "title": "Lock is stuck after 1 month - cannot open!!",
      "text": "Haven’t even had this a month and the lock is stuck. I cannot get either key to work. I have contents which I need to get to inside and no matter what I try, it won’t budge. Do not get this product if you want what you store inside.",
      "rating": 1.0,
      "verified": true,
      "author": "kelly",
      "helpful_votes": 2,
      "publication_date": 20200610
    },
    {
      "title": "As advertised!",
      "text": "Works great for important papers and articles you need ready access to and don't want to store in a bank safe deposit box. Seems durable. However, the proof (so to speak) is how it holds up in fire and/or water, which I hope to never have to find out. That aspect I don't know.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20181103
    },
    {
      "title": "Just alright",
      "text": "Good to use for now, but not great. I don't like that you cannot fit a full sized 11-inch file folder or manila envelope inside without having to trim or fold the edges or it curling up. The handle and lock are not as sturdy as I expected them to be. The handle feels like it will break when you carry it because of the weight of the box The key pops out of the lock once you unlock the box, so if you do need to access it you will need to put the key in a pocket or set aside until you're ready to re-lock it.",
      "rating": 3.0,
      "verified": true,
      "author": "jojojo",
      "helpful_votes": 0,
      "publication_date": 20190525
    },
    {
      "title": "Poor Quality Lock",
      "text": "Bought this save for my son for Christmas. He locked the safe and then unlocked it . After he unlocked it ,he couldn't lock it again. Lucky for him it broke while unlocked and his valuables weren't inside. Unfortunately this happened after the return deadline and we can't get a refund. I was really surprised that Sentry made such a poor quality item. Will never buy anything from them again.",
      "rating": 1.0,
      "verified": true,
      "author": "Sherry A. Britton",
      "helpful_votes": 3,
      "publication_date": 20190222
    },
    {
      "title": "Great for transporting your pistols via TSA and Air Travel",
      "text": "I commute to other states for work and after I check to see the Carry Laws of this states, I will transport my pistols with this case. So many choice when you start searching for these, glad I chose this one. Easy to conform the foam t your pistol (s). Lots of room for such a small case (compared to a rifle case). I've always been a SKB fan but this a very good product and a reasonable price point.",
      "rating": 5.0,
      "verified": true,
      "author": "JB",
      "helpful_votes": 0,
      "publication_date": 20200122
    },
    {
      "title": "Sturdy Box But the Handle is the Weak Point",
      "text": "Just got this today and after a preliminary look it seems to be a solid product -- with the exception of the handle. The handle does not seem nearly strong enough to support the weight of this rather hefty empty box, much less a box with anything but paper in it. I'm not too worried about it for myself as I don't forsee needing to use the handle much, however I could easy see this handle not holding up well. As noted in several other reviews as well this box is surprisingly heavy, but it looks like it'll do the job in terms of protection.",
      "rating": 4.0,
      "verified": true,
      "author": "crussell",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "Good Price and it meets our needs perfectly",
      "text": "My wife and I needed a small safe to protect/secure certain important documents. She had been paying for a safe deposit box at a local bank, but with this we are not at the mercy of that bank's operating hours. We didn't need something fancy, just a safe place to keep passports, deeds, important receipts and some cash. This small, relatively light weight product meets our needs perfectly. Either one of us can just grab the convenient handle and go in the case of an emergency. We could have spent a lot more but Sentry's reputation drew our attention. I can recommend this product to anyone with relatively small needs for a safe. The price was excellent!",
      "rating": 5.0,
      "verified": true,
      "author": "Paige Ellen",
      "helpful_votes": 3,
      "publication_date": 20151212
    },
    {
      "title": "Letter size documents do not lie flat on bottom",
      "text": "I bought it to put letter size documents in either manila folders or envelopes. They do not lie flat. The box itself looks heavy duty, but the latch is plastic and I imagine that it can be easily preyed open. There are so many reviews about the faulty locks, that I will be locking & unlocking the box for a few days before putting in my papers. This box wasn't expensive, but I expect a product on Amazon to work.",
      "rating": 2.0,
      "verified": true,
      "author": "Techy Grandma",
      "helpful_votes": 0,
      "publication_date": 20181209
    },
    {
      "title": "Have Realistic Expectations",
      "text": "I recently moved out of my parents house and needed something to keep important documents in. I read a lot of reviews on safes before buying this one. Is it perfect no? But it fits a standard size sheet of paper okay, it has a handle, and it has a locking mechanism that works. Is it 100% theft proof. No? I paid around $50 for it and didn't expect it to. Will it protect my documents and important things from damage and provide mild theft protection. You bet. That's all I wanted and that's all I expected from a $50 portable safe.",
      "rating": 5.0,
      "verified": true,
      "author": "whydoesitmatter",
      "helpful_votes": 9,
      "publication_date": 20170728
    },
    {
      "title": "the locking mechanism worked fine, but would pull completely out from the box ...",
      "text": "The box I received could not be locked. Rather, the locking mechanism worked fine, but would pull completely out from the box if I tried to use the handle, thus opening the box while it was still \"locked\". I tried numerous times at assembly. Seems like it would work, but failed every time. On one occasion, the entire lower segment flew off and hit me in the face. I'm unsure why the lower segment of the locking mechanism would not be permanently attached to the box. Also, there is not mention of self-assembly, so I was not anticipating that. Such a hassle to return such a heavy item.",
      "rating": 1.0,
      "verified": true,
      "author": "lovesamazon",
      "helpful_votes": 29,
      "publication_date": 20170914
    },
    {
      "title": "Great Price, Excellent Size, Convenient Weight, and Strongly Built against Fire and Water",
      "text": "Great price; about one third of the price I've seen online and in stores for similar items. Add to that the free shipping. Excellent size to put all important documents / other valuables, light enough to lift and move around as needed, small enough to hide in safe place, and strong enough to withstand water and fire. Thank You Amazon for introducing office items cheaper than Office Depot and Staples! EJD",
      "rating": 5.0,
      "verified": true,
      "author": "EJD",
      "helpful_votes": 3,
      "publication_date": 20171207
    },
    {
      "title": "Not much storage space inside",
      "text": "I purchased this item for our Granddaughter last Summer. It was a very nice looking personal safe, but the problem was that there was hardly any storage space inside, so she was not very happy with it.",
      "rating": 3.0,
      "verified": true,
      "author": "Linda Tressler",
      "helpful_votes": 0,
      "publication_date": 20200523
    },
    {
      "title": "Great Safe",
      "text": "This is a great safe. Lots of room. I struggle to lock & unlock I have nails I've broken a couple nails trying to open it . This is my 2nd safe like this..I bought this one 4 my daughter she loves it. Amzone was a higher than getting it in the store but my daughter needed it in a hurry and amzone got it to her the next day.",
      "rating": 5.0,
      "verified": true,
      "author": "Mizzleah",
      "helpful_votes": 0,
      "publication_date": 20191019
    },
    {
      "title": "Good value",
      "text": "Safeguards damage to your documents at an affordable price. I would not want the larger size because it would be too heavy for me to carry. This size works out well for me",
      "rating": 5.0,
      "verified": true,
      "author": "D. Snyder",
      "helpful_votes": 4,
      "publication_date": 20170827
    },
    {
      "title": "Sentry Safe",
      "text": "Great safe. It holds the essentials. Letter size paper does NOT lay flat on the bottom. The corners will curl. For what the safe is, it is not overly heavy. If a thief finds it, it’s gone. My guess is it can easily be cracked open. My reason for purchase was to protect valuables.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul R",
      "helpful_votes": 0,
      "publication_date": 20200224
    },
    {
      "title": "Too small for 8.5 x 11 inch manilla folders",
      "text": "I would not recommend this item if you plan to store standard size folders. I had to bend my folders (three or four folders about 1.25 inch thick in total) to fit. Also, not very deep. I was able to close the lid with my folders and an external hard drive inside so I'm keeping it. The size and /or storage capacity is the only reason I gave this item a 3 instead of 5.",
      "rating": 3.0,
      "verified": true,
      "author": "Farmer72",
      "helpful_votes": 0,
      "publication_date": 20200717
    },
    {
      "title": "Surprised by the weight",
      "text": "The lid has a formed rubber gasket that falls off. It can be put back on. I can only hope there is a good seal. The case is heavy. I could find no info as to what makes it heavy. Anyway this has to be better for my important papers. I do like having my documents in one place. Some papers could not fit flat. This case is 'just' big enough. I know it doesn't sound like it but I do like it.",
      "rating": 4.0,
      "verified": true,
      "author": "Linda Dangerfield",
      "helpful_votes": 0,
      "publication_date": 20200905
    },
    {
      "title": "Excellent Size for Documents",
      "text": "Item is excellent size for what I wanted to store. I was skeptical as several reviews advised the straps were not included. This unit did come with the straps to hold documents to lid side. Its the perfect size for storing key documents (passport, birth certificate, ssn, and papers). Only drawback now wish I would have chosen the combo lock instead of a key.",
      "rating": 5.0,
      "verified": true,
      "author": "Deb",
      "helpful_votes": 0,
      "publication_date": 20190321
    },
    {
      "title": "Don't purchase",
      "text": "You get what you pay for. This safe was used once to put my passport and important documents in then wouldn't open the day before my vacation departure. Followed the instructions only to have the handle come off in my hand. Called a locksmith but thankfully my husband was able to snap the handle in place and finally jimmy it open. Don't waste the money.",
      "rating": 1.0,
      "verified": true,
      "author": "TS",
      "helpful_votes": 2,
      "publication_date": 20190314
    },
    {
      "title": "Not worth the $64 i paid",
      "text": "Locking mechanism and handle are made of plastic. The safe will do the job of water and fire proofing but not a good security safe or being portable. who ever designed this was an idiot. im sure if you drop this, the plastic lock will break open and di i mention it is way to heavy for the plastic handle",
      "rating": 2.0,
      "verified": true,
      "author": "lazy",
      "helpful_votes": 0,
      "publication_date": 20200813
    },
    {
      "title": "This is way smaller than photographed!",
      "text": "I thought this would have some depth to it, yet when it came I was sad to see how small it was. Overall, it's a great product, but I'm returning it for its size. You can only put 2/3 boxes of jewelry and potentially one manila envelope before its full! For that, I'd rather pay extra to know all my items are safely under lock and key.",
      "rating": 1.0,
      "verified": true,
      "author": "Kanny Anny",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "This is a heavy little box.",
      "text": "It's heavier than I thought and I guess that's a good thing. It's just right for 8x10 papers/documents. I don't know if it's really fireproof and hope never to find out. Lock works easily without struggle. Due to its weight I assume it will hold up to most abuses.",
      "rating": 5.0,
      "verified": true,
      "author": "Bulldog",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "Great value!!!",
      "text": "This safe makes my old safe feel and look like a lunch box. It's durability, construction and quality is unsurpassed. It is a bit heavy but you can move it short distances with the attached handle. This safe also comes with straps and keys inside. I use this product to store items which I need to access quickly on a daily basis, so the smoothly turning lock is indespensible. I'm so glad I have chosen to purchase this safe and highly recommend it!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181206
    },
    {
      "title": "My biggest disappointment is with the carrying handle",
      "text": "As others have said it DOES NOT fit an 8\" x 11\" piece of paper flat. and the overall inside dimensions are fairly shallow. Also, this is NOT A SECURE box...it is solely intended to mitigate fire and water damage. A child could pop the plastic lock on this with a stick in about 15 seconds. My biggest disappointment is with the carrying handle. It twists and flexes as you carry the box--so I expect it will break off at the hinge points with average use. I didn't send it back but I wouldn't buy another one. It just doesn't give me any confidence.",
      "rating": 2.0,
      "verified": true,
      "author": "KB",
      "helpful_votes": 0,
      "publication_date": 20170227
    },
    {
      "title": "Great value and really sturdy",
      "text": "I bought two of these as Xmas presents for my adult children who have just purchased townhouses. My kids really love these. Great size for a bedroom closet and easy to use. Warning--heavy. I couldn't carry the box upstairs but my son had no problem.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Moore",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "It is a good size and good weight however I am leary about ...",
      "text": "I was looking for something to get my external drives and media out of the larger safe in the house. It is a good size and good weight however I am leary about the plastic latch used to close the chest. I feel like it can be broke into very easily but since I am not placing any valuables into it I am not concerned about the security of it and more interested in the fire/waterproof features on the chest.",
      "rating": 3.0,
      "verified": true,
      "author": "Scott",
      "helpful_votes": 2,
      "publication_date": 20170103
    },
    {
      "title": "PLEASE DO NOT BUY THIS. PLEASE.",
      "text": "I’ve had this safe for only 4 months. I have only opened it 3 times. This last time I opened it, the handle broke completely off. PLEASE DO NOT BUY THIS. Now my return window has closed and I’m stuck with a useless safe. PLEASE, AGAIN, SAVE YOURSELF $60 and a great deal of disappointment.",
      "rating": 1.0,
      "verified": true,
      "author": "Mollie K.",
      "helpful_votes": 0,
      "publication_date": 20200807
    },
    {
      "title": "Good size for documents",
      "text": "I got this specifically to protect important documents, and it seems to fit the bill nicely. I haven't burned it or dunked it in water - if I ever have the misfortune to have that happen, I'll update my review. Seems good so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Emrys E. Maier",
      "helpful_votes": 0,
      "publication_date": 20200412
    },
    {
      "title": "Go with something else",
      "text": "Thankfully we've not tested it in a fire or underwater, but after a little over a year of being in the bedroom, it's cracked along the bottom. Felt sturdy, but it's clearly not. Cracked right after warranty ended.",
      "rating": 2.0,
      "verified": true,
      "author": "Justin Chow",
      "helpful_votes": 0,
      "publication_date": 20190616
    },
    {
      "title": "Nice size and heavy",
      "text": "This appears to be a well made lock box and I really like the size. Thanks",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190217
    },
    {
      "title": "Almost the right size",
      "text": "I'm happy with how this safe works. The seal appears to be air and waterproof. I thought that I could fit file folders in it, but it isn't quite large enough. The folders fold up and I can only fit two or three in before they hinder the lid from closing. Another inch and it would be perfect. You can fit plain 8.5x11 paper inside ALMOST flat on the bottom. I do not find this too heavy to carry around.",
      "rating": 4.0,
      "verified": true,
      "author": "Katie D",
      "helpful_votes": 3,
      "publication_date": 20160212
    },
    {
      "title": "Housewarming Gift",
      "text": "My granddaughter and her fiance just purchased their first home. I bought this as one of her housewarming gifts because she is very practical, orderly, and I knew she didn't have a safe place for her documents. She loved it.",
      "rating": 5.0,
      "verified": true,
      "author": "Savivi",
      "helpful_votes": 0,
      "publication_date": 20200326
    },
    {
      "title": "Won’t unlock!!!!!!",
      "text": "Oh yes, it’s airtight. Just placed every important document in my household and a little bit of savings for safekeeping... And the key won’t turn to unlock it. So now I don’t have access to any of my important belongings or my cash savings. Beyond furious. Would give zero stars if I could. Amazon, of course, can’t help and just directed me to call the manufacturer.",
      "rating": 1.0,
      "verified": true,
      "author": "The buyer of things",
      "helpful_votes": 0,
      "publication_date": 20200910
    },
    {
      "title": "Can’t lock safe with no keys.",
      "text": "Don’t know how sturdy it really is. Came without keys so can’t really do much with it. Heavy as I’ll get out, but not secure without keys. Gonna return it tomorrow.",
      "rating": 1.0,
      "verified": true,
      "author": "Joe A McGregor II",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "Great little safe",
      "text": "I can't speak to this products waterproof or fire resistant nature as I have not had to test it in that way (thank goodness), but the overall quality of this product seems to be solid. It's the perfect size for securing some important documents as well as other smaller valuables. I also like the it can fit under your bed.",
      "rating": 5.0,
      "verified": true,
      "author": "Claire",
      "helpful_votes": 0,
      "publication_date": 20180409
    },
    {
      "title": "Happy Customer!",
      "text": "My wife has been bugging me to get a fire/water safe for our important documents. After a long research, I bought this SentrySafe CHW20221 safe. It looks well built and heavy and has a handle to carry it. My only wish is the built-in strap was little tighter, but still works. I am happy to purchase this safe and highly recommend it.",
      "rating": 4.0,
      "verified": true,
      "author": "sean.diegan",
      "helpful_votes": 0,
      "publication_date": 20181108
    },
    {
      "title": "These are garbage",
      "text": "Our company has bought a few of these. I was not made aware of the fact that after a year of having one, the entire handle area, near the lock, had cracked and made it impossible to lock the safe. As I looked at it, I also realized that if you break that part, you could easily just break into the safe, making it completely pointless. So, we bought another one. This one came and it will not unlock at all. DO NOT BUY THIS GARBAGE!!!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Alex Cohen",
      "helpful_votes": 0,
      "publication_date": 20200908
    },
    {
      "title": "Lock broke after 2 uses",
      "text": "I am very disappointed that the lock on the Sentry Safe CHW20221 Fireproof Box and Waterproof Box with Key Lock failed after the second use. It was very difficult to open and close the first two times I used it and I set it aside for a while. Tonight, wanting to return it, I found out that I missed the 30 day return window by four days so it looks like I'm stuck with it. Buyer beware. The plastic lock on the steel box is too fragile to securely fasten the lid to the box. It appears to be a Sentry Safe design problem!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200608
    },
    {
      "title": "Heavy but an excellent safe.",
      "text": "The most durable medium sized safe that I have ever purchased. Be aware that the safe weights 21 pounds and feels much heavier. The latch can be hard to open or close. The owner's manual even states that the safe may have to be pried open after a fire. If you register the product there is a limited lifetime warranty. The safe will be replaced after a fire or flood. We want to store the safe in a space that is quite high and you need to be on a ladder. Since it is so heavy we will not be taking it down frequently. Very happy with it so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Rick",
      "helpful_votes": 2,
      "publication_date": 20150205
    },
    {
      "title": "Basically sufficient",
      "text": "Very heavy with a flimsy plastic handle- I am afraid to use the handle for much maneuvering for fear of it breaking off. Locking was difficult until I figured out the logic behind the lock setup. It is basically sufficient, but I wouldn't by this one again.",
      "rating": 3.0,
      "verified": true,
      "author": "JB",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "HEAVY AND DURABLE",
      "text": "This is a heavy safe lock box. The only thing is you need to screw it to the floor because anyone could just take your lockbox and pop it open at their leisure. Bolt it to the floor they will not be able to easily get into it it’s a sturdy heavy box",
      "rating": 5.0,
      "verified": true,
      "author": "rollerskatingmomma",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "Just a little too small for documents in envelopes",
      "text": "If you have your documents inside manila envelopes you will find this safe to tight a fit. They really should make it just a little bit larger inside so that normal letter-size documents in envelopes Don’t need to be managed down and deformed in order to fit.",
      "rating": 3.0,
      "verified": true,
      "author": "Wick Smith",
      "helpful_votes": 0,
      "publication_date": 20190618
    },
    {
      "title": "Very nice",
      "text": "Minor gripe. The keys are easy to work with, but I would prefer that the hole in the grip not be covered in plastic. It makes it hard to get it on a key ring, and it takes up a lot of space once you do.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "Good size safe for documents and small items",
      "text": "My letter size paper like standard printer paper seems to fit in this just fine. I keep my birth certificate, home ownership paperwork, Etc in it. I like that my important stuff is safe and I haven't had to test it in a flood or a fire yet and hopefully I don't have to but it seems durable",
      "rating": 5.0,
      "verified": true,
      "author": "Lauren",
      "helpful_votes": 0,
      "publication_date": 20190225
    },
    {
      "title": "I am pretty happy with my purchase",
      "text": "Solid, and serves the purpose for which I bought this, which is additional fire protection inside of a fire-rated safe for documents and old (and new) paper currency. The lock will keep children out of this, but it is not going to keep a determined thief out. I am pretty happy with my purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170222
    },
    {
      "title": "Get one with a handle",
      "text": "Get the one with a handle -- you'll be glad you did. If yu want/need to keep some 'stuff' at home, best to use as much protection as possible. After a friend lost some 'stuff' in a fire safe at his house, we use this INSIDE a fire safe for an extra layer of protection.",
      "rating": 5.0,
      "verified": true,
      "author": "Not_So_ Much",
      "helpful_votes": 5,
      "publication_date": 20151113
    },
    {
      "title": "Good protection for important documents",
      "text": "Heavy cast iron body and fiberglass gasket should provide good fire protection for the money. If you don't orient it right dripping water may get in, and if someone takes a hose to it water would penetrate the seal. If the gasket was just a little better I give it 5 stars. Don't think this will keep a thief out. The lock would be easy to break with a crowbar, and it's light enough they could just take the safe. But I didn't purchase it for security reasons so I'm glad they didn't increase the cost by having a sturdy lock.",
      "rating": 4.0,
      "verified": true,
      "author": "M Johnson",
      "helpful_votes": 2,
      "publication_date": 20141201
    },
    {
      "title": "Well Made",
      "text": "Quite a security case. Well made and very easy to open and secure. Case has some weight to it. Like the easy to install straps to hold small items. Highly recommend this case",
      "rating": 5.0,
      "verified": true,
      "author": "Michael R. Van Leer",
      "helpful_votes": 0,
      "publication_date": 20200427
    },
    {
      "title": "Small office safe",
      "text": "I have this tethered to a hidden desk leg for small amounts of cash and PMs. It's a small safe.....So far it hasn't taken anything, exploded, or walked away, so I guess it's doing its job.",
      "rating": 5.0,
      "verified": true,
      "author": "Moses Lee",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "but it should do fine to protect against fire",
      "text": "Heavy and seemingly well built. Some reviewers complained about the cheap lock. That is true......but it should do fine to protect against fire, water, or structural collapse. This box is not designed to foil would be thieves...but to protect against the elements. Granted I have not tested it, I am judging by it's appearance, weight, and I did jump my 215lb frame on top of it a few times without any damage whatsoever.",
      "rating": 4.0,
      "verified": true,
      "author": "sykes",
      "helpful_votes": 2,
      "publication_date": 20150922
    },
    {
      "title": "Nice safe but very heavy for portable",
      "text": "First off, this is HEAVY. With that said it's very well made. Has straps in the lid to place papers under as well as a kinda-roomy bottom. About the bottom. I probably didn't read the measurements correctly, but thought papers and manilla folders would fit in this which they do, but they have to be slightly curled up to do so. Overall I think this is perfect to keep your important papers safe and dry in case of disaster.",
      "rating": 4.0,
      "verified": true,
      "author": "Lynn S",
      "helpful_votes": 0,
      "publication_date": 20160502
    },
    {
      "title": "EXCEEDED MY EXPECTATIONS",
      "text": "VERY STURDY SAFE/BOX. HOLDS MORE MATERIAL THAT I THOUGH IT WOULD. ONLY POSSIBLE DRAWBACK IS THAT IT IS VERY HEAVY, BUT THAT ALSO IS A PLUS SINCE I FEEL IT WOULD HOLD UP AS EXPECTED TO FIRE AND WATER.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200305
    },
    {
      "title": "Fireproof box",
      "text": "This box is nice but will not hold my papers. I have envelopes of wills, family trust etc and they will not fit. The interior of this box is smaller than an 8 1/2 X 11 paper. I need to get a bigger size one to hold the few papers that I have.",
      "rating": 3.0,
      "verified": true,
      "author": "K. Ferment",
      "helpful_votes": 0,
      "publication_date": 20190506
    },
    {
      "title": "It’s heavy and hard to lock and unlock",
      "text": "Locking, unlocking somewhat difficult and weight is heavier than I thought it would be",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190727
    },
    {
      "title": "Safe but not safe",
      "text": "Does what i need it to do (i hope) which is keep whats inside safe in the event of a flood or fire. If it were to be stolen it the plastic lever to open the safe would be easily broken with bear hands or picked somewhat easily. Full sized paper does not lay compleatly flat but who really cares atleast its not ash or ruined by water.",
      "rating": 3.0,
      "verified": true,
      "author": "Mason M.",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Great Safe",
      "text": "This is a great safe. Perfect size lots of storage. Lock works. 2 keys included. It is water and fire proof. Thanks for providing this great item!",
      "rating": 5.0,
      "verified": true,
      "author": "Sallie S.",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "Hope we never need this",
      "text": "Bought this for papers and important items. Very heavy, seems air tight, lid closes with a bang if you just let go. Hope we never need to find out if it really works :)",
      "rating": 5.0,
      "verified": true,
      "author": "Pearl",
      "helpful_votes": 0,
      "publication_date": 20200207
    },
    {
      "title": "Cheaply made",
      "text": "I liked the safe for the first year and a half. Then, the top portion of the locking mechanism snapped off... I took a closure look at the design. I was not impressed. It wasn't an air tight design as I had hoped. I would not recommend the product.",
      "rating": 2.0,
      "verified": true,
      "author": "Bob",
      "helpful_votes": 0,
      "publication_date": 20190720
    },
    {
      "title": "Faulty lock",
      "text": "This box is a joke. The lock is stuck. I’ve only had it for 3 months. No trauma to the box or lock at all. It’s just poorly made.",
      "rating": 1.0,
      "verified": true,
      "author": "Tiffany Lopez",
      "helpful_votes": 0,
      "publication_date": 20200620
    },
    {
      "title": "Solid and sturdy",
      "text": "The safe is solid and big enough to hold all the papers. It doesn't look cheap or feel cheap. Arrived in good shape. Thanks Amazon!",
      "rating": 5.0,
      "verified": true,
      "author": "Thy Vu",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "Safe",
      "text": "Like the safe seems to be very strong the lock is easily operated . I will tell all family members and friends. Thank you.",
      "rating": 5.0,
      "verified": true,
      "author": "Earl",
      "helpful_votes": 0,
      "publication_date": 20200512
    },
    {
      "title": "Fire safe",
      "text": "Received within a couple of days. It’s very nice and heavy duty. I would recommend it to anybody and everybody",
      "rating": 5.0,
      "verified": true,
      "author": "nancyx2",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "Excellent choice, good value",
      "text": "This safe is heavy and sturdy and a perfect replacement for the long and narrow safe deposit box I had at the bank for a long time, paying $50 a year! It's easy to lock and unlock, and my important documents fit very well inside. The handle is sturdy. The inside is approx. 8 1/2 by 13, 3 inches deep but when closed there is an extra 1 1/2 inches inside the lid.",
      "rating": 5.0,
      "verified": true,
      "author": "meemoo",
      "helpful_votes": 0,
      "publication_date": 20160401
    },
    {
      "title": "Heavy lock box Feels Sturdy",
      "text": "This lock box feels like it would stand up to a fire or flood. It is very heavy and a good size for storing important documents and valuables.",
      "rating": 5.0,
      "verified": true,
      "author": "Nabeel Mulla",
      "helpful_votes": 0,
      "publication_date": 20190912
    },
    {
      "title": "Works great, good quality.",
      "text": "Doesn’t stink or cause mold like the negative reviews say. It fits everything I need it to fit, but I wish there was a little bit more room; but overall I like it very much.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris M.",
      "helpful_votes": 0,
      "publication_date": 20190403
    },
    {
      "title": "As described",
      "text": "be aware of the measurements and pounds , its very heavy and compartment inside is smaller than I expected",
      "rating": 3.0,
      "verified": true,
      "author": "Bostongal",
      "helpful_votes": 0,
      "publication_date": 20200425
    },
    {
      "title": "The internal dimensions are deceptive. The floor of the ...",
      "text": "The internal dimensions are deceptive. The floor of the safe curves into the walls of the safe (ie not a 90 degree angle), so documents cannot lay flat. Because you're probably going to be storing documents in here longterm, this could cause the edges of documents to be rolled over time.",
      "rating": 3.0,
      "verified": true,
      "author": "Jason Fry",
      "helpful_votes": 2,
      "publication_date": 20160406
    },
    {
      "title": "Exactly what I was looking for.",
      "text": "Perfect size for me. As a single woman, I don't need anything large, just something big enough to hold my really important papers. I'm happy with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "FlipFlopCEO",
      "helpful_votes": 0,
      "publication_date": 20191218
    },
    {
      "title": "perfect",
      "text": "the right size for the right price. after I saw how much it would hold I got one for my mother.",
      "rating": 5.0,
      "verified": true,
      "author": "Teresa",
      "helpful_votes": 0,
      "publication_date": 20200229
    },
    {
      "title": "Very Nice",
      "text": "Excellent! Just what I was looking for - right size, right price. Received quickly and intact. Thank You.",
      "rating": 5.0,
      "verified": true,
      "author": "Nighthawk",
      "helpful_votes": 0,
      "publication_date": 20200716
    },
    {
      "title": "Sentry needs to go back to the design board.",
      "text": "Sentry should have put this through closer inspection in the design process. Absurd that a piece of typing paper barely lies flat inside the safe. It needed to be just an inch bigger in width and length--that would have done the trick.",
      "rating": 2.0,
      "verified": true,
      "author": "Mrs. Murphy",
      "helpful_votes": 0,
      "publication_date": 20180610
    },
    {
      "title": "holds what I need",
      "text": "This is heavier than it looks. It holds what I planned to put in it. The key is a bit hard to get use too.",
      "rating": 5.0,
      "verified": true,
      "author": "k",
      "helpful_votes": 0,
      "publication_date": 20190215
    }
  ],
  "product_meta": {
    "title": "SentrySafe CHW20221 Fireproof Box and Waterproof Box with Key Lock 0.28 Cubic Feet,Charcoal Gray",
    "description": "Style:Built-In StrapsDesigned with you in mind, the SentrySafe CHW20221 Fireproof Safe and Waterproof Safe provides protection against unexpected fire and water damage to keep your irreplaceable items intact. The CHW20121 also offers ETL Verified digital media protection, and a carrying handle for easy transportation of your valuables.",
    "rating": 4.6,
    "feature_bullets": [
      "Fireproof box is UL Classified to endure 1/2 hour at 1550°F to protect irreplaceable documents, small valuables, DVDs, and USBs from fire",
      "Waterproof box is ETL Verified for 72 hours of water submersion offering peace of mind in the event of a flood",
      "Fireproof lock box features a tubular key lock for added security and to prevent the lid from opening in the event of a fire; includes two keys",
      "Document safe features built-in straps for easy storage of passports, social security cards, and birth certificates; fire box holds A4 size paper",
      "Exterior: 15.4 in. W x 14.3 in. D x 6.6 in. H; Interior: 12.8 in. W x 8.5 in. D x 4.4 in. H; medium capacity 0.28 cubic feet; weighs 20 pounds"
    ],
    "specifications": {
      "Manufacturer": "SentrySafe",
      "Part Number": "CHW20221",
      "Item Weight": "20.4 pounds",
      "Product Dimensions": "14.3 x 15.4 x 6.6 inches",
      "Item model number": "CHW20221",
      "Is Discontinued By Manufacturer": "No",
      "Size": "0.28 Cubic Feet",
      "Color": "Charcoal Gray",
      "Style": "Built-In Straps",
      "Material": "Captured Fire Insulation",
      "Shape": "Rectangular",
      "Item Package Quantity": "1",
      "Measurement System": "Metric",
      "Included Components": "1",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "Warranty Description": "One year limited warranty",
      "ASIN": "B00KOO594O",
      "Customer Reviews": "4.6 out of 5 stars1,896 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#877 in Office Products",
      "Domestic Shipping": "Item can be shipped within U.S.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S. Learn More",
      "Date First Available": "May 30, 2014"
    },
    "categories": [
      "Forms, Recordkeeping & Money Handling",
      "Office Products",
      "Cash & Check Boxes",
      "Tools & Home Improvement",
      "Office & School Supplies"
    ],
    "price": 57.5
  }
}