{
  "website_summaries": [
    {
      "verdict": "Samsung's NX3000 entry-level mirrorless camera boasts strong image quality and well-implemented Wi-Fi features, but it's a little slow to lock focus.",
      "pros": [
        "Compact",
        "Sharp kit lens",
        "Raw shooting support",
        "APS-C image sensor",
        "Tilting rear display",
        "Built-in Wi-Fi functionality",
        "Includes Adobe Photoshop Lightroom software"
      ],
      "cons": [
        "A little slow to focus",
        "No built-in flash",
        "No EVF support",
        "Dedicated battery charger not included"
      ],
      "aspects": {},
      "publication_date": 20140815,
      "rating": 7.0,
      "source": "pcmag"
    }
  ],
  "customer_reviews": [
    {
      "title": "I love this camera",
      "text": "WOW! I love this camera! The pictures are great and the mobile option is awesome. I'm also loving Lightroom--I'm very new to photo editing software, but I'm having a very good experience with this. If you're also new to Lightroom, I highly suggest you find the Lightroom Youtube channel and watch some tutorials, as these were VERY helpful for me in learning the program. I've attached some photos to this review, but you can see more at my photo blog, iseeasinamap on tumblr.",
      "rating": 5.0,
      "verified": true,
      "author": "Brianna",
      "helpful_votes": 25,
      "publication_date": 20150308
    },
    {
      "title": "Not the best not the worst.",
      "text": "This is a nice camera has trouble focusing. Makes taking pictures of children really tuff. I have a Nikon 1 j5 that is better suited for images in motion. If you are buying this camera as a family photo camera I say go with the Nikon 1 j5 or Sony a6000 but for landscape and non portrait photos this is a fine camera.",
      "rating": 4.0,
      "verified": true,
      "author": "Austin A. Spiker",
      "helpful_votes": 0,
      "publication_date": 20161219
    },
    {
      "title": "I love it, the quality is amazing",
      "text": "I listened to one of the other reviewers comment that said don't over think it. I love it, the quality is amazing, I don't vlog but I am sure this would be perfect for that too. the only thing that made it loose 1 star is that you are not able to use the flash with the front facing screen. Whats up with that samsung?",
      "rating": 4.0,
      "verified": true,
      "author": "Vane",
      "helpful_votes": 0,
      "publication_date": 20150917
    },
    {
      "title": "So far so good. I am not an expert photographer by any ...",
      "text": "So far so good. I am not an expert photographer by any means, but I plan to ask around for help to learn how to use the settings to the best of my ability. Auto setting and smart settings work well if you're someone like me who is still learning but wants higher quality photos.",
      "rating": 5.0,
      "verified": true,
      "author": "Genesis L.",
      "helpful_votes": 0,
      "publication_date": 20160623
    },
    {
      "title": "Great Camera for Beginners",
      "text": "I bought this camera for my trip to Europe. I never owned a real high quality camera before. I don't really know much about photography but this camera is so easy to use. The pictures turned out great",
      "rating": 5.0,
      "verified": true,
      "author": "Michael T",
      "helpful_votes": 0,
      "publication_date": 20150831
    },
    {
      "title": "great camera! love Samsung products",
      "text": "great camera! love Samsung products. easy to use, takes excellent pictures, don't have multiple lenses, which would be nice, but one day maybe . . . awesome camera tho",
      "rating": 5.0,
      "verified": true,
      "author": "Terri",
      "helpful_votes": 0,
      "publication_date": 20150909
    },
    {
      "title": "So Far, So Good",
      "text": "Getting used to it but like it more each day. It takes great pix, the screen is bright and easy to see in the sun. Controls are straightforward. Nice videos, too.",
      "rating": 4.0,
      "verified": true,
      "author": "NJL",
      "helpful_votes": 0,
      "publication_date": 20150329
    },
    {
      "title": "Casual photography, but still a great buy!",
      "text": "I'm definitely not a professional photographer, but I wanted a camera that could take really great pictures while getting down the basics of good photography. The NX3000 has so far been the perfect camera for me. I'm still toying with all the settings, but so far I'm glad I made the purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Fredi Garcia",
      "helpful_votes": 2,
      "publication_date": 20150314
    },
    {
      "title": "Love the camera clearly ordered the 16-50mm power zone highly ...",
      "text": "Love the camera clearly ordered the 16-50mm power zone highly disappointed that I recieved the 20-50 compact lens. Will be calling. To get a credit back or replacement sent",
      "rating": 5.0,
      "verified": true,
      "author": "Robin Dicus",
      "helpful_votes": 0,
      "publication_date": 20160415
    },
    {
      "title": "Great Camera!",
      "text": "Bought this camera for my daughter for Christmas. It is a great camera for beginners or someone who wants to take great photos without lugging around a heavy camera. Took it to Las Vegas and it fit easily in her purse and has been easy to use also. Very satisfied with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Marcie",
      "helpful_votes": 0,
      "publication_date": 20150113
    },
    {
      "title": "Pros and Cons",
      "text": "The audio is AWFUL! It sounds scratchy and muffled. I'll be in my room without any fans on and it still sounds like I'm outside on a mountain top! Other than that, it takes great pictures and videos. It's gorgeous, and has a great interface.",
      "rating": 3.0,
      "verified": true,
      "author": "John Wilkinson",
      "helpful_votes": 3,
      "publication_date": 20151124
    },
    {
      "title": "Samsungs brilliant little camera !",
      "text": "This truly is a amazing camera. You have all the control you need for your photo or, easy point and shoot. I ride a motorcycle and have been lugging around a SLR for years. Now I need very little space but my photos are so much more.",
      "rating": 5.0,
      "verified": true,
      "author": "Billy M. White",
      "helpful_votes": 0,
      "publication_date": 20150904
    },
    {
      "title": "Five Stars",
      "text": "great! i got it \"like new\" and it was pretty much brand new!",
      "rating": 5.0,
      "verified": true,
      "author": "tfreddy",
      "helpful_votes": 0,
      "publication_date": 20150122
    }
  ],
  "product_meta": {
    "title": "Samsung EV-NX3000BOJUS Wireless Smart 20.3MP Compact System Camera with 3-Inch LCD and 16-50mm OIS Power Zoom (Brown)",
    "description": "NX3000 is at compact and light interchangeable lens camera, giving you great quality images with rich color. The large APS-C 20.5MP CMOS Sensor delivers shots which are bursting with sharp detail even in low light. The Retro Design with premium metal accents , make the NX3000 exquisitely modern with just the perfect touch of analogue. The Smart Wi-Fi features let you share a just a quick touch.\n\nFROM THE MANUFACTURER\n\n\nThe Samsung NX3000 Smart Camera with 16-50mm power zoom lens and flash combines vintage design with a 20.3-megapixel sensor and wireless connectivity for an ideal combination of style and technology. The NX3000 features Wi-Fi and NFC connectivity for instant sharing and remote control from your smartphone. Smart Mode settings make it easy to take beautiful shots in a variety of settings, while the flip-up display lets you capture the perfect selfie.\n\nThe NX3000 is bundled with a 16-50mm power zoom lens and external flash. View larger.\n\nThe 3.3-inch Super AMOLED tilt display lets you capture hard-to-get shots. View larger.\n\nThe ultra-sensitive sensor captures high-quality images and lifelike colours. View larger.\n\n20.3-MEGAPIXEL SENSOR FOR CRISP, DETAILED PHOTOS\nAn advanced 20.3-megapixel APS-C CMOS sensor is at the heart of the Samsung NX3000, capturing lifelike colors and beautiful images with the highest resolution in its class. The camera has an ISO range from 100 to 25,600, so you'll be able take detailed photos in different lighting situations. And, with a fast shutter speed of 1/4,000 and a capture rate of 5 frames per second, you can shoot successive action shots that are clear and in focus.\n\nINCLUDES 16-50MM POWER ZOOM LENS\nThe NX3000 is bundled with a 16-50mm power zoom lens, an exceptionally compact lens suited for a variety of shots from standard portraits to wide-angle landscapes. Videographers will appreciate the power zoom function, which helps keep the image steady as you zoom in and out.\n\nThe camera uses a Samsung NX mount so you can choose the appropriate Samsung NX lens to suit your needs.\n\nPREMIUM VINTAGE DESIGN\nThe NX3000 makes a bold visual statement. Its vintage design features a solid, compact body wrapped in natural leather-like covering for a timeless look.\n\nTAKE THE PERFECT SELFIE WITH FLIP-UP DISPLAY\nThe 3-inch flip-up display is large and easy to see and makes framing your next selfie a snap. Plus, the wink shot feature means you can give the camera a wink and the NX3000 will capture the shot--perfect for getting a fun pic with the kids.\n\nWI-FI AND NFC CONNECTIVITY FOR INSTANT SHARING\nThanks to built-in Wi-Fi and NFC, transferring your images and sharing them doesn't require memory cards or cables. You won't have to worry about running out of space on your camera, either. With Photo Beam and MobileLink, you can transfer photos instantly or send whole albums. With AutoShare enabled, all the photos you shoot are automatically transferred to your mobile device where you can easily view and share.\n\nTURN YOUR SMARTPHONE INTO A REMOTE CONTROL\nRemote Viewfinder Pro turns your phone into a viewfinder and lets you preview images, adjust camera settings, frame the scene, and tag the shot location from up to 30 feet away. When you need to be in the group shot, Remote Viewfinder Pro makes it easy.\n\nFULL HD VIDEO RECORDING\nThe NX3000 shoots 1080p Full HD video at 30 frames per second for brilliant color and sharp detail. And the H.264 format lets you record longer MPEG-4 videos so you can capture more of the action. The CMOS sensor gives you precise autofocus even as you're shooting, so you can shoot with confidence.\n\nCHOOSE SMART MODE OR CUSTOMIZE THE I-FUNCTION LENS\nBeginners and experts can both get the most out of the NX3000. Get high-quality shots right out of the box with a variety of presets in Smart Mode. More advanced users can use i-Function control to adjust features such as white balance, aperture, shutter speed, exposure, and ISO range. You can also program shortcut keys to your favorite custom settings.\n\nWHAT'S IN THE BOX\nNX3000 Smart Camera with 16-50mm power zoom lens and flash, rechargeable battery, USB charging cable, user manual, strap, and Adobe Photoshop Lightroom 5.\n\nNX3000 SMART CAMERA WITH 16-50MM LENS AND FLASH (BROWN)\nAT A GLANCE:\n * High-resolution 20.3-megapixel APS-C CMOS sensor\n * Wi-Fi and NFC connectivity for instant sharing\n * 3-inch flip-up LCD display\n * Smart Mode presets for ease of use\n * Control via smartphone with Remote Viewfinder Pro\n * Captures 1080p Full HD video\n\nThanks to built-in Wi-Fi and NFC, transferring your images and sharing them doesn't require memory cards or cables (shown in white). View larger.\n\nThe NX3000 shoots 1080p Full HD video at 30 frames per second for brilliant color and sharp detail (shown in white). View larger.",
    "rating": 3.7,
    "feature_bullets": [
      "20.3MP CMOS Sensor for high-quality images and life like colors with crystal clear resolution",
      "Share your best photos instantly with Family and Friends with Built-in Wi-Fi with NFC",
      "SMART features - Social Media Upload, E-mail, Photobeam, DirectLink, MobileLink, PC Auto-backup, Remote Viewfinder PRO, AllShare, Baby Monitoring",
      "1080p HD Video"
    ],
    "specifications": {
      "Product Dimensions": "6.46 x 3.66 x 5.63 inches",
      "Item Weight": "1.41 pounds",
      "ASIN": "B00K88XMRW",
      "Item model number": "EV-NX3000BOJUS",
      "Batteries": "1 Lithium ion batteries required.",
      "Customer Reviews": "3.7 out of 5 stars31 ratings3.7 out of 5 stars",
      "Best Sellers Rank": "#222,868 in Electronics",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "May 8, 2014",
      "Manufacturer": "Samsung"
    },
    "categories": [
      "Mirrorless Cameras",
      "Electronics",
      "Digital Cameras",
      "Camera & Photo"
    ],
    "price": ""
  }
}