{
  "website_summaries": [
    {
      "verdict": "Despite some quirks, the practical design makes this steam mop and handheld steamer combo a convenient cleaning tool.",
      "pros": [
        "Heats up quickly and produces ample steam",
        "Boasts a detachable handheld steamer that's useful for numerous household cleaning chores",
        "Has a long lead"
      ],
      "cons": [
        "Some units had faulty parts or quit working altogether within a few months of use",
        "Company has been known not to honour the warranty"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Stood the test of time",
      "text": "Had this for two years, it’s been more than useful on a daily basis. I’ve cleaned almost anything and everything with it, but was really impressed with my kitchen floor, it looked like the day it was laid fifteen years ago! Going to buy one for my sons new home.",
      "rating": 5.0,
      "verified": true,
      "author": "K.c",
      "helpful_votes": 101,
      "publication_date": 20181109
    },
    {
      "title": "This product stopped working after a few months - no ...",
      "text": "This product stopped working after a few months - no steam coming from the base unit & the detergent not dispensing. On contacting vax customer service - they were rude and unhelpful - refusing to take the product back and issue a full refund. I would urge anyone NOT to purchase this product.",
      "rating": 1.0,
      "verified": true,
      "author": "Miss Vicky J Coombes",
      "helpful_votes": 69,
      "publication_date": 20180222
    },
    {
      "title": "Avoid at all costs. It’s total rubbish",
      "text": "Total rubbish. Cheap and very very nasty. The steam trigger packed up after 6 months and the steam jet was reduced to more of a trickle soon after. The attachments are a joke. One broke a week after I bought it. Don’t throw your money down the drain it will end up in the bin sooner than you think. Thought Vax was a decent make before I bought this. Not anymore!!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Mr S J Lear",
      "helpful_votes": 48,
      "publication_date": 20180318
    },
    {
      "title": "My best ever cleaning purchase.",
      "text": "This product has changed my life! Or my cleaning time at the very least. It has saved me time and money too. I was contemplating replacing the linoleum to Floor in the bathroom as I couldn't get it clean using cleaning products, scrubbing brushes or even bleach. This steam cleaner has brought it up like new. Works brilliantly on grout and tiles too. Freshens up carpets and has cleaned deep ground in dirt from all kinds of hard surfaces to the point they look new.",
      "rating": 5.0,
      "verified": true,
      "author": "Natalie86",
      "helpful_votes": 33,
      "publication_date": 20180818
    },
    {
      "title": "I initally thought this was a great item but very disappointed",
      "text": "Handle has snapped whilst in use after only 2 months of use. I initally thought this was a great item but very disappointed",
      "rating": 1.0,
      "verified": true,
      "author": "Emma",
      "helpful_votes": 39,
      "publication_date": 20171114
    },
    {
      "title": "HONEST REVIEW",
      "text": "This steam mop does what it needs to do, it steams and cleans. CONS: - As an upright steam mop it is a bit unstable/rickety when storing, starts to lean. - When refilling the water compartmens, it tends to leak and go everywhere whilst trying to re install. - The detergent compartment tends to empty very quickly, could do with being slightly larger. PROS: - Cleans quickly without much going over. - The hand held detachment is very easy to use. - Great range of accessories for different services. - The head of the mop is triangular for cleaning corners with ease.",
      "rating": 4.0,
      "verified": true,
      "author": "Adam",
      "helpful_votes": 11,
      "publication_date": 20190516
    },
    {
      "title": "Rubbish product / Warranty not honoured",
      "text": "original machine bought just over 12 months ago. 1st machine failed after a few months , steam stopped and water just pumped from a hole in side of handheld. Vax replaced it, same thing happened again after a few months. Vax replaced machine again and here we are again with the same problem. Despite 2 year warranty Vax saying they will do nothing under warranty unless I get an independent report which proves it is a manufacturing fault. Reading other reviews this appears to be a common fault with the machine - don't buy it !!",
      "rating": 1.0,
      "verified": true,
      "author": "Andrew J Hillier",
      "helpful_votes": 10,
      "publication_date": 20190606
    },
    {
      "title": "Vax Terrible quality control",
      "text": "This is the third VAX product I have ordered through amazon which I have had to return due to bad quality control on parts. I will never ever be buying VAX products again. When contacting VAX when my product was still under guarantee VAX refused to honour the guarantee. Amazon have been brilliant and offered great customer service on all 3 products.Last item being returned today, what an inconvenience. I am left with VAX filters and cleaning heads I and cleaning prodcuts I purchased previously. Not good enough VAX",
      "rating": 1.0,
      "verified": true,
      "author": "Uriel",
      "helpful_votes": 13,
      "publication_date": 20180829
    },
    {
      "title": "Not built to last.",
      "text": "Handle snapped after a few months light use. Vax replaced the handle but then the whole thing just stopped working just outside the 1 year warranty so they wouldn't replace it. Definitely not built to last. Will not buy Vax products again.",
      "rating": 1.0,
      "verified": true,
      "author": "N. Atkins",
      "helpful_votes": 9,
      "publication_date": 20190118
    },
    {
      "title": "I love this. I clean my floor regularly with it ...",
      "text": "I love this. I clean my floor regularly with it and it does it so quickly and makes a great job. I have also steam cleaned our dog bed after the cat weed on it and it seems to have got rid of the smell. I tried it on my windows but I think it was more user error that meant they were left a bit streaky. Think I would need to practise my technique.",
      "rating": 5.0,
      "verified": true,
      "author": "Chloe Kearney",
      "helpful_votes": 11,
      "publication_date": 20170519
    },
    {
      "title": "Unsuitable for anyone with poor grip.",
      "text": "Bought this, used once and am returning. I found it difficult to use. Only produces steam when trigger pressed and I found that tiring on the hand. The trigger was too big for most women, I'm 5ft 7, size 7 feet and proportionate hands. I also struggled to remove the detergent dispenser as that needed two buttons at the side to be pressed- again needing a large handspan and grip strength that I just don't have (my mum has arthritis in her hands so I may well have a predisposition to this. However I would say lots of petite women or elderly people would struggle. Furthermore I didn't think it produces all that much steam or cleaned very well.",
      "rating": 2.0,
      "verified": true,
      "author": "policefox lyn",
      "helpful_votes": 0,
      "publication_date": 20200717
    },
    {
      "title": "Stopped working again",
      "text": "Bought one less then 6 months ago which packed up on the first day. Returned it, got my money back and bought another. This one has also just packed up. Both just stopped producing steam. The first Vax steam mop I bought many years ago lasted about 5 years. This was the fourth time I'd bought Vax and each one has been worse than the previous. Plenty of gizmos to attract those that feel the need to have the latest model of everything but I've never used them. All I want is a straight forward steam mop that works when you want to clean a floor. Unfortunately, this isn't it.",
      "rating": 1.0,
      "verified": true,
      "author": "p a oxley",
      "helpful_votes": 0,
      "publication_date": 20200321
    },
    {
      "title": "Can’t do without it",
      "text": "My daughter borrowed my previous one and just wouldn’t part with it so never returned it ! Eventually I bought another , exactly the same . With 5 dogs and 2 toddlers in our house , this is such a great aid . We have ( fake ) wooden floors with rugs and I use it on all. This new one seems to put out a lot more steam than my old one - perhaps because it was old. It cleans floor so easily and leaves it practically dry straight away. I don’t often use the hand held part for other jobs but comes in handy for cleaning around bathroom / kitchen taps",
      "rating": 5.0,
      "verified": true,
      "author": "Cookie",
      "helpful_votes": 0,
      "publication_date": 20200331
    },
    {
      "title": "Stopped working",
      "text": "I have had 2 now and both only lasted about 12 months. Stopped producing steam, have tried replacing filters. Spoken to help desk about descaling the steam vents with a their tool or a paper clip but no scale present. Am giving up and going for a different manufacturer",
      "rating": 1.0,
      "verified": true,
      "author": "Bev",
      "helpful_votes": 6,
      "publication_date": 20190530
    },
    {
      "title": "Excellent steam cleaner",
      "text": "Really good steam cleaner which is easy to operate and really works. Didn’t realise just how dirty our kitchen floor was - our previous machine (not from Vax) didn’t lift the dirt like this does. We bought Vax because we have a vacuum cleaner by them and it is also very good.",
      "rating": 5.0,
      "verified": true,
      "author": "Rillgirl",
      "helpful_votes": 2,
      "publication_date": 20200420
    },
    {
      "title": "Perfect for the home",
      "text": "Love this product! Bought it to steam our floors and clothing due to a bed bug infestation! Although that alone hasn't been used to treat the situation. The steamer is quick and easy to use. Very simple so it's great for newbies. Take caution when using due to the steam temperature and you'll be fine. One of the best parts is being able to take the steamer apart and use it as a hand held steamer for different areas of the house. All round happy. This is the 2nd steamer I've used, both vax and this is by far the best one going!",
      "rating": 5.0,
      "verified": true,
      "author": "Siobhan M",
      "helpful_votes": 3,
      "publication_date": 20171121
    },
    {
      "title": "Pre-used / didn't work",
      "text": "Didn't realise when I ordered that this product was pre-used, however decided to proceed. The item arrived, wasn't clean, poorly packaged and didn't work. Having said this for an extra £9 I purchased a new one which I am very pleased with. Forget what I said above, the new one has just broke, frustrated isn't the word, I wont but another !!!",
      "rating": 1.0,
      "verified": true,
      "author": "christine emms",
      "helpful_votes": 0,
      "publication_date": 20200428
    },
    {
      "title": "Don't Buy It!",
      "text": "If I could give zero, I would! Very disappointed with this product...it certainly does not work as advertised. The detergent does not work at all and the instruction manual does not provide adequate trouble-shooting advice. I have subsequently found out (from a wide web-based search) that the detergent flow appears to be a common problem. I will be returning for a refund.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 8,
      "publication_date": 20170814
    },
    {
      "title": "Do not purchase this product. The is no steam",
      "text": "Waste of money. Purchased in December and only used a handful of times. Got it out today to use and there is no steam. I literally have the scrub the floor to get it clean. Really annoyed as I now have a dog in the house and the floor needs to be cleaned daily. Oh and the hand held steam function just drips water everywhere! I should of listened to the reviews but I was keen on getting a clean where you can use detergent. Big mistake!",
      "rating": 1.0,
      "verified": true,
      "author": "Iona N Gabriel ",
      "helpful_votes": 0,
      "publication_date": 20200218
    },
    {
      "title": "Dissatisfied received a lesser model",
      "text": "I’m really disappointed. The videos at the top show a different version of what I’ve received. I was in need of the scrub part for hard floors. What I have actually received is a much lesser model. Which is basic and no scrub option. Problem is I didn’t realise until I unpacked it to use!",
      "rating": 1.0,
      "verified": true,
      "author": "Ms. L. Turner",
      "helpful_votes": 0,
      "publication_date": 20200329
    },
    {
      "title": "Please Don't buy.. Not suitable for every flooring",
      "text": "After two months of usage, this machine caused some damage to my flooring.. Now someone needs to fix my flooring and it won't be a small cost Vax is fully confident that their machine is not faulty and they cannot help further.. Actually it is not about the equipment bring faulty. The key missing point is insufficient information on the type of flooring it can be used. This is not advertised on the vax website. On other supplier website like Karcher, they certainly published this information in their FAQ section.",
      "rating": 1.0,
      "verified": true,
      "author": "Aryan2411",
      "helpful_votes": 0,
      "publication_date": 20200405
    },
    {
      "title": "Negatives outweighs positives",
      "text": "Disappointed. This was a replacement for my previous Vax steamer which died after 5 years medium (twice weekly) use. The water tank too small, had to refill twice cleaning kitchen and hall tiles, it’s a normal size house not a stately home. Having to hold trigger all the time to get steam was tiresome. Only plus points was nice long lead and good accessory storage. Bought based on price and previous Vax ok experience. Definitely wouldn’t buy again",
      "rating": 3.0,
      "verified": true,
      "author": "selective reader",
      "helpful_votes": 0,
      "publication_date": 20190609
    },
    {
      "title": "The steam has stopped working",
      "text": "It was working great at first but now the steam does not come out at all. I don't know what to do, I've tried waiting for it to heat up (30-40mins) but nothing is working. Really quite disappointed.",
      "rating": 2.0,
      "verified": true,
      "author": "Fatima Bangura",
      "helpful_votes": 4,
      "publication_date": 20190327
    },
    {
      "title": "the hand held unit is a little better but more hot water than steam",
      "text": "For the price I can't really complain. It does a mediocre job of the floors, the hand held unit is a little better but more hot water than steam. I have a wooden floor through out the ground floor with a tiled kitchen floor. The floor does come up clean but just as good as if mopped though a lot easier. Also used it to clean the oven door at a house a friend had just moved into. Initially it was looking good but for the more stubborn grease we ended up resorting to chemical cleaners. It has now been demoted to a gimmicky mop.",
      "rating": 3.0,
      "verified": true,
      "author": "Greebo",
      "helpful_votes": 5,
      "publication_date": 20160122
    },
    {
      "title": "Love mine and wouldn’t be without it now",
      "text": "Absolutely love love my steam cleaner. I wouldn’t be without it. I use it mainly on my tiled floors but this is so versatile it can be used all over the house. Easy to use, I personally don’t find it heavy at all. Best purchase ever and so much better than keep using a mop and bucket. Floors dry fairly quickly too and no worry of knocking over a bucket of water. Wouldn’t be without mine now and I think so much more hygienic too. Excellent purchase and I think at a good price too. Certainly cheaper than I have seen elsewhere.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200215
    },
    {
      "title": "NO MORE MUDDY PAW PRINTS",
      "text": "Have 5 dogs so this is handy for muddy paws,heats up quickly and fab accesories Great price also",
      "rating": 5.0,
      "verified": true,
      "author": "Carolyn",
      "helpful_votes": 2,
      "publication_date": 20200704
    },
    {
      "title": "Beast of a machine",
      "text": "Fantastic product, I had been looking for a while and £60 was a good price. Arrived today on time, fool proof to use and it really gets things clean. I bought this to deep clean the house floors all been wood and tiled because we have to Labrador’s which are hard to keep clean! Dogs get grime in the house floors over time that a mop just won’t do....... well this absolutely deep cleaned all the doggyness away! Then as a bonus a blasted all the kitchen wall tiles and extractor hood........... cut through all the cooking grease!",
      "rating": 4.0,
      "verified": true,
      "author": "Adam ",
      "helpful_votes": 0,
      "publication_date": 20200612
    },
    {
      "title": "Comes with different attachments",
      "text": "My husband bought me this Vax steamer he was fed up of me scrubbing the floors with the mop trying to get muck off and the steamer is brilliant as I don't have to get the scrubbing brush the Vax steamer is perfect easy to use and set up only thing you have to do is change the cleaning pads to get the floors clean I love the Vax steamer well worth the money and would recommend it to any one we are going to buy another one for my dad as a present",
      "rating": 5.0,
      "verified": true,
      "author": "debbie arnold",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "Great all round cleaner",
      "text": "Like this for cleaning floors, laminate, cushion and tiled. Long lead so no need for unplugging for different areas. Gets into corners and love the fact the cleaning mats are detachable so clean put them in the washer and clean ready for next time. Also, great for refreshing carpets when you use the glider over the top of the cleaning mat.",
      "rating": 5.0,
      "verified": true,
      "author": "El",
      "helpful_votes": 0,
      "publication_date": 20200928
    },
    {
      "title": "Fantastic",
      "text": "Great design all clicks into place, easy fill and super easy to put the mop pads on, no more fiddling trying to get the things to hold in place. Really up to date cleaner and you can use detergent as well not just steam, great for making the kitchen smell lovely. The handheld part has so many gadgets, really good value for money.",
      "rating": 5.0,
      "verified": true,
      "author": "Sandi",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "Expected it to last longer",
      "text": "Initially seemed OK but only really used it for floor cleaning. Too much of a faff to use it hand held. The steam trigger packed up after about 1 year so I contacted VAX customer service by email for advice but never got a reply. Carried on using it for a few months as the trigger was 'stuck on' and still producing steam but it finally gave up altogether. This was the second VAX steamer we have had and will be the last, they both went faulty very quickly. We have a lot of the VAX micro fibre clothes so hope they fit some other brand.",
      "rating": 1.0,
      "verified": true,
      "author": "Steve K.",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "My best ever cleaning purchase.",
      "text": "I love this. I clean my floor regularly with it and it does it so quickly and makes a great job. I have also steam cleaned our dog bed after the cat weed on it and it seems to have got rid of the smell. I tried it on my windows but I think it was more user error that meant they were left a bit streaky. Think I would need to practise my technique.",
      "rating": 5.0,
      "verified": true,
      "author": "M Patel",
      "helpful_votes": 0,
      "publication_date": 20190924
    },
    {
      "title": "Not reliable or sturdy product",
      "text": "I bought this steamer in January as I have a holiday rental which needs to be regularly steam cleaned. The hand held bit of this machine was very useful for cleaning the shower, bathroom, toilet and the upright floor cleaner initially proved to be quite effective. I had previously had a Karcher steamer which was much more robust but less moveable and pretty heavy. However, after only 2 weeks the cleaning dispenser on the Vax broke, the plastic split and therefore leaked all over the place. Now the water/steam dispenser has given up the ghost after only 5 months. Amazon are replacing the product, but I cannot say that I would recommend this product.",
      "rating": 1.0,
      "verified": true,
      "author": "mrs s e calder",
      "helpful_votes": 0,
      "publication_date": 20200710
    },
    {
      "title": "Great product",
      "text": "Fantastic piece of kit and a great price steam very powerful and cuts through grime very well leaving it smelling very fresh and clean due to the hot steam and free antibacterial fluid to put in the steamer also comes with lots of extra utensils to steam areas if your bathroom or kitchen very impressed indeed would highly recommend this steamer .",
      "rating": 5.0,
      "verified": true,
      "author": "Richard Sheen",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "Works quite well but some Faults",
      "text": "The steamer works ok when i unpacked it the nozzle storage clip was broken and so this is unusable and the small tool storage on the body of the machine just doesn't work, if you attach the tools as soon as you move the steamer they just fall out, thank heavens there is a storage bag otherwise the would very quickly get lost. So overall not a bad tool that works quit well, but a little more thought in the design would have made it a good steamer.",
      "rating": 1.0,
      "verified": true,
      "author": "David west",
      "helpful_votes": 0,
      "publication_date": 20200829
    },
    {
      "title": "Not brilliant",
      "text": "This is the second one of these we have as the first one the vax liquid mix would not work but we bought this as our dog was not being well and yes it gives a nice smell when using the pet liquid but still leaves the marks on the carpet so had to get the carpet shampooer out which to us was a waste of money.",
      "rating": 3.0,
      "verified": true,
      "author": "Mr. R. W. GORE",
      "helpful_votes": 0,
      "publication_date": 20200224
    },
    {
      "title": "Not great.",
      "text": "need to have the detergent, which then leaves the floor sticky. one has to keep pressing the trigger despite the instructions saying to press intermitently, if you do not keep the button pressed the steam disappears. Returned item for a refund. just not good enough!!!.",
      "rating": 3.0,
      "verified": true,
      "author": "The Bolt",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "Brilliant!",
      "text": "I am so very pleased with this VAX steam mop. It's lightweight and simple to use. It heats up almost immediately and glides across my floors. I can change the mop attachment as and when required for different surfaces or cleaning requirements. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Jane H.",
      "helpful_votes": 0,
      "publication_date": 20201004
    },
    {
      "title": "Easy to use, good quality",
      "text": "Easy to assemble, ease to put on different nozzles for handheld. My third steam mop, but the FIRST van. It felt a little heavier than my H10 Thane (off shopping channel/then Wilkos) ... but it quickly became apparent that the Vax is fair superior. Highly recommend, in fact my daughter has just order one.",
      "rating": 5.0,
      "verified": true,
      "author": "Jopickle",
      "helpful_votes": 0,
      "publication_date": 20200323
    },
    {
      "title": "I wouldn't buy it again.",
      "text": "I bought this as i thought it is newest version of stem vax. This one i use only for floor, rest is really poor quality and hard to use and not really working as I imagined. Floor cleaning is ok on polished floor, panel floor, not great on linoleum. Generaly I will never buy it again. Bit disappointed.",
      "rating": 2.0,
      "verified": true,
      "author": "Joanna",
      "helpful_votes": 2,
      "publication_date": 20180926
    },
    {
      "title": "A load of rubbish",
      "text": "Well this is the 2nd one in a mater of 3 months the fiefs one was returned due to the part where you put the detergent broke ! Requested the same item and the same happened again and the the container where you put the water for steam don’t stay closed so water leaks everywhere don’t waste your money not worth the money",
      "rating": 1.0,
      "verified": true,
      "author": "joanne jones",
      "helpful_votes": 0,
      "publication_date": 20200828
    },
    {
      "title": "Very heavy, buy separate devices",
      "text": "The steamer heats up quickly, however with having the hand held attachment it's rather heavy to push, even on a vinyl surface. The hand held steam cleaner, although a good idea, there needed to be more thought from the designers regarding the attachments. The devise itself is easy to use, however, you have to keep turning it round to get the angle required for cleaning various surfaces. I feel that the attachments should be able to rotate at various angles so you don't have to keep turning the machine. Not the best purchase I've ever made & I probably should have bought separate devices.",
      "rating": 5.0,
      "verified": true,
      "author": "Not a happy purchaser",
      "helpful_votes": 0,
      "publication_date": 20200716
    },
    {
      "title": "I'm not impressed at all",
      "text": "Bought this to clean my tiled floor in the kitchen and living room, worked about a week and then the soap dispenser stopped working! It doesn't really clean my floor tiles well. I would recommend a two in one hoover and mop, if you do decide to get a tiled floor cleaner.",
      "rating": 1.0,
      "verified": true,
      "author": "Khan",
      "helpful_votes": 0,
      "publication_date": 20200816
    },
    {
      "title": "Not fit for purpose...good if you want a one-off steam clean",
      "text": "Made a fantastic job of the car interior. Removed the mould and the smell of spilled Redex. Don't know how but with a brush and the hand held steam generator the car was restored to new. Fabulous piece of kit. Only problem was that it failed to steam after this. Vax sent a new one to replace it... after 3 uses ( that will be 4 uses between 2 machines) the new machine broke too. This time Vax refused to refund my £69.99 or replace it as it was 3 weeks out of guarantee. This machine was 6 months old. Not fit for purpose. I will never buy Vax again.",
      "rating": 1.0,
      "verified": true,
      "author": "Dizzy",
      "helpful_votes": 0,
      "publication_date": 20190908
    },
    {
      "title": "Not a miracle cleaner!",
      "text": "It's not a bad piece of kit but it doesn't do a \"miracle\" clean that you see in the ads for steam cleaners! We have a terracotta floor in our kitchen and we had to scrub it, on hands and knees, to bring it up to scratch, especially the grouting because the steam cleaner wasn't doing it. Having said that the floor was particularly grubby because it is an old house that we've just moved into. Now that the floor is clean the Vax does keep it clean.",
      "rating": 3.0,
      "verified": true,
      "author": "Banksy",
      "helpful_votes": 7,
      "publication_date": 20150327
    },
    {
      "title": "No tools",
      "text": "I didn’t receive a tool accessory kit with my order. It has only just been bought to my attention as it was a present and was not opened until yesterday. Most disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Dawn",
      "helpful_votes": 0,
      "publication_date": 20191208
    },
    {
      "title": "Average",
      "text": "This is wasy to use, instructions are great. Over packaged. Not particularly environmentally friendly packaging. Works fine, not instant cleaning. The concentrate cleanung liquid isn't big enough. Only lasts a few cloor cleans.",
      "rating": 3.0,
      "verified": true,
      "author": "Victoria f",
      "helpful_votes": 0,
      "publication_date": 20200610
    },
    {
      "title": "Easy to use for thorough and quick cleaning.",
      "text": "Have had my Vax Steam cleaner for some time now and still love it. Have recommended to friends and family by lending mine out and letting folk have a trial run first. Should be on commission as at least three more of these have been purchased as a result! Useful for the jobs most people hate, like cleaning the oven - comes up sparkling every time. However, most often used on the kitchen floor quarry tiles where heavy traffic and messy cooking require regular cleaning up - the Vax Steam cleaner makes this easy, thorough and quick.",
      "rating": 5.0,
      "verified": true,
      "author": "MaMaMason",
      "helpful_votes": 0,
      "publication_date": 20160117
    },
    {
      "title": "Time saving machine!!",
      "text": "I find this a very useful piece of machine. No more wringing dirty mops and waiting for ages for the floor to dry otherwise. Great value for money. Absolute time saver. Easy to assemble, steams up quickly, floor is dry in a matter of seconds ( no fear of kids slipping or making new footprints!! ) , easy to manoeuvre , light enough to work with one hand. Used on wooden floor too, did not need much steam on it. Initially I had a problem with the detergent not dispensing and after making sure the hole in the dispenser is open, it worked fine. Would definitely recommend this steam mop.",
      "rating": 5.0,
      "verified": true,
      "author": "liz the dentist",
      "helpful_votes": 0,
      "publication_date": 20160111
    },
    {
      "title": "I'm retiring my mop and bucket.",
      "text": "I'm retiring my bucket and mop and the hard work of mopping. I really like this - I got it on a lightening deal which makes it great value too. It's easy and lightweight to use, versatile and cleans well. The hand held is very neat but I must admit I'm not sure what people do with the watery residue from the steam on vertical surfaces, which can get a bit dribbley. My only negative comment is the little tools don't store in their storage slots very securely and I expect would get lost along the way so I'll have to store them separately but overal I'm very pleased with my purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "YHoughes",
      "helpful_votes": 0,
      "publication_date": 20160220
    },
    {
      "title": "Slightly high priced but does the job well",
      "text": "Only used it for 3 times so far. It definitely does the job, does not take very long to heat up and lasts for 10 mins which is enough time for cleaning my kitchen, living room ( which is fairly good sized, as per standard UK homes ) and hall. Slightly heavy though. But happy with purchase so far.",
      "rating": 4.0,
      "verified": true,
      "author": "Rupali",
      "helpful_votes": 0,
      "publication_date": 20200124
    },
    {
      "title": "Product testing is lacking had return not fit for purpose.",
      "text": "Duff product very little steam being produced. For £60+ product very disappointed had to return",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190425
    },
    {
      "title": "Easy to use steam cleaner",
      "text": "I use this steam cleaner to cleaner the kitchen and bathroom floors and it works a treat. It’s easy to use and gives you confidence that the floor is thoroughly clean. I would recommend this cleaner.",
      "rating": 5.0,
      "verified": true,
      "author": "Jane Heir",
      "helpful_votes": 0,
      "publication_date": 20200927
    },
    {
      "title": "Super steam cleaner",
      "text": "Excellent - I gave this cleaner a very tough job and it has surpassed my expectations. Excellent value in black Friday sale. On down side keeping your hand on the steam action is very hard on your hands and esp as I have a tendency towards arthritis. I haven't tested the cleaner as a hand held but as the steam action is 'fierce' I would imagine v efficient. Also I didn't bother to slot the tools into little holes as couldn't imagine that would be anything other than annoying keeping them in there x",
      "rating": 5.0,
      "verified": true,
      "author": "Roisin Tolcher",
      "helpful_votes": 0,
      "publication_date": 20161202
    },
    {
      "title": "I would not be without it",
      "text": "Brilliant on ceramic floors and walls, detach the unit and you have a handheld cleaner for hobs and hoods, worksurfaces etc. What is more, when I have finished I know it has been sanitised as well as looking clean.",
      "rating": 5.0,
      "verified": true,
      "author": "jeff dixon",
      "helpful_votes": 0,
      "publication_date": 20201021
    },
    {
      "title": "Waste of money",
      "text": "One of the expensive gadget I have bought on Amazon and found as waste of money. It didn’t work was rather living a lot of water behind it, not heating etc... Overall doing nothing as the description. So I sent it back and got my refund",
      "rating": 1.0,
      "verified": true,
      "author": "Giselle",
      "helpful_votes": 0,
      "publication_date": 20200618
    },
    {
      "title": "What a great product! I have around 150 sq m of ...",
      "text": "What a great product! I have around 150 sq m of tiled flooring. I was getting desperate as all the methods of cleaning them seemed to be pushing the dirt around and left terrible streaks. This steam cleaner is light, easy to use and does an amazing job. It cleans quickly and effectively with any streaks. I can clean my floors in under half the time with perfect results. If there was any slight reservation it would be that the water reservoir could be larger, but overall I could not recommend this product more strongly. Everyone who has seen it working wants one!",
      "rating": 5.0,
      "verified": true,
      "author": "Tomicek",
      "helpful_votes": 0,
      "publication_date": 20160418
    },
    {
      "title": "Vax Steam Cleaner (S86-SF-CC)",
      "text": "I'm loving it so far. It's very quick and easy to use. I've mainly used it on floors, so I haven't used the many adaptors for other uses yet. But from what I've seen it's very effective at cleaning wooden floors.",
      "rating": 5.0,
      "verified": true,
      "author": "RingoT",
      "helpful_votes": 0,
      "publication_date": 20200318
    },
    {
      "title": "Amazing",
      "text": "I've had cheap steam cleaners before that just dribbled water so I decided to spend a bit more in the hope of a better product. I was not disappointed. It gives plenty of steam continuously. My first job was my oven which I don't clean and often as I should but it dissolved the baked on gunk and with the wire brush it brought the shelves up like new . Would definitely recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs. L.M. Parr",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "Versatile & Adequate",
      "text": "Bought recently, doesn’t the job but quite water & detergent hungry. Not tried all the other accessories that come with it but I bought this one for it’s versatility and expect it will be adequate for my requirements",
      "rating": 5.0,
      "verified": true,
      "author": "Juicee Sushie",
      "helpful_votes": 0,
      "publication_date": 20201024
    },
    {
      "title": "Great for floors... Not much else.",
      "text": "Great for floors, not much else. Cleans our tiled floor really well (we have two dogs so it needs it) and it dries super quick. I followed the instructions and gave it a bit of steam every few seconds rather than hold the trigger all the time. You have to click the detergent capsule in really firmly though as the first couple of times I used it it didn't work because I hadn't done that. I have tried it on shower doors and it's useless, ditto for the other attachments. But if you need floors cleaned quickly and effectively it's great.",
      "rating": 4.0,
      "verified": true,
      "author": "Gudgie",
      "helpful_votes": 0,
      "publication_date": 20160129
    },
    {
      "title": "steam clean fresh",
      "text": "Great buy especially with pets in the house have used on hard floors, freshens up carpets (though didn't expect miracles as won't deep clean), the handheld part detaches quite easily. Took a few hours as you have to let steam do its job but brought bathroom tiles back to looking like new. Grout brush wore out quickly but used own brushes instead with better success and more economical. Steam cleaned soft furnishings freshened up well. Only regret should have got one much sooner.",
      "rating": 5.0,
      "verified": true,
      "author": "miss piggy",
      "helpful_votes": 2,
      "publication_date": 20150404
    },
    {
      "title": "Great for floors",
      "text": "For floors this steam cleaner is brilliant, particularly if you purchase the Vax coral cleaning pads to use with it. However the handheld part is not as effective as the tools that came with my now defunct steam cleaner that had a flexible hose and extension poles with cleaner heads to fit on. The tools that come with the Vax are just OK. In handheld mode there is just not enough steamy oomph to be really effective. However, my floors are sparkling.",
      "rating": 4.0,
      "verified": true,
      "author": "Elizabeth Gowers",
      "helpful_votes": 0,
      "publication_date": 20160403
    },
    {
      "title": "COMPLETE WASTE OF MONEY",
      "text": "Absolutely utter rubbish ! complete waste of money; incredibly difficult to assemble; Does not work ; steam does not come out of the base and leaks from all over the place. Don't waste money on this.",
      "rating": 1.0,
      "verified": true,
      "author": "Surojit",
      "helpful_votes": 0,
      "publication_date": 20191124
    },
    {
      "title": "Good quality cleaner",
      "text": "Have used this a few times now to clean the floors and the hand held section to clean windows and the showers. Happy with the cleaner easy enough to use light weight and efficient. Happy with my purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "Stevie R",
      "helpful_votes": 0,
      "publication_date": 20200522
    },
    {
      "title": "not happy",
      "text": "I already have one of these and was pleased when i saw this on offer i got another one and gave mine to my mother sadly this one does not work because of lockdown i cant send it back",
      "rating": 1.0,
      "verified": true,
      "author": "mrs c palmer",
      "helpful_votes": 0,
      "publication_date": 20200430
    },
    {
      "title": "Control the steam",
      "text": "This steamer replaced another manufacturers whose handle had broken. I really like the fact that you can control the amount of steam and not have it continuously on stopping the floors from getting over wet. Also the extra reservoir for steam detergent leaves the floors shining and pleasantly smelling. The only reservation I have is the depth of the bottom which doesn’t go under my settees and cupboard.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Beningfield",
      "helpful_votes": 0,
      "publication_date": 20200818
    },
    {
      "title": "great product, not had any issues as yet",
      "text": "Brought this as an \"early\" gift for my mum, only complaint is that it didn't arrive in plain packaging, so she knew what it was (as I wasn't home) and proceeded to open and use it. All in all, great product, not had any issues as yet, Ive seen a few complaints about the handle, but so far so good. Ive yet to use any of the additional tools that come with it, so will update as and when I do :) Great value for money, and easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Jas Deusi",
      "helpful_votes": 2,
      "publication_date": 20161215
    },
    {
      "title": "Not brilliant",
      "text": "Thisis my second cleaner, is a replacement for the first. As others have said, the trigger stopped working and also stopped dispensing steam. That was the first one, thinking it was a one off ( I use it a lot as I have dogs) I ordered a replacement as I liked the machine and initially it did work well. Alas, the second displayed identical faults, so unfortunately have called it a day with vax, ( customer services not brilliant) and bought a different make hoping that will do better.",
      "rating": 2.0,
      "verified": true,
      "author": "Op1",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "5 Stars",
      "text": "Had the cheaper non combi version previous to this that lasted about 3 months before it gave up so was dubious about buying another Vax product. When it came up in a flash sales the price was to good to miss and i have been impressed with it so far. The compartment for cleaner/detergent is great and the mop produces a good amount of steam.",
      "rating": 5.0,
      "verified": true,
      "author": "KevAnt123",
      "helpful_votes": 0,
      "publication_date": 20170502
    },
    {
      "title": "Steam clean with no detergent, no residue",
      "text": "Replacement for previous one easier to separate and use. No attachments have to pay extra for those. Does not appear to be as powerful as the cheaper one I had, and cable not as long. Feel they have scrimped on it, it works!",
      "rating": 4.0,
      "verified": true,
      "author": "fast lady",
      "helpful_votes": 0,
      "publication_date": 20200903
    },
    {
      "title": "Versatile",
      "text": "This steam cleaner can be used to clean many surfaces. I have used it to sucessfully clean the kitchen worktops, tiled areas and windows. It has also removed a stain from a carpet. It is very quick to heat up and will steam for about quarter of an hour. It has made the cleaning process quicker and more fun.",
      "rating": 4.0,
      "verified": true,
      "author": "Pistebeast",
      "helpful_votes": 0,
      "publication_date": 20180812
    },
    {
      "title": "Unsatisfied",
      "text": "I dont like the pad where you just sit the steam on it, it leaves wet Mark's on the floor, it doesn't clean edges, the mains lead is always in the way, I certainly wouldn't recommend and I'm very disappointed in this product",
      "rating": 3.0,
      "verified": true,
      "author": "Di Childs",
      "helpful_votes": 0,
      "publication_date": 20200224
    },
    {
      "title": "does what it says - steams floors and lightweight",
      "text": "I had a previous Vax steamer, which was good although the drawstring mop pads drove me mad as they kept coming off the mop. Unfortunately I broke some of the parts so it was ready to be replaced... This new steamer uses pads which attach to the base via velcro type attachments which are on the mop base (put pad on floor, stand the mop on top of pad and you're done). I was unsure if this would work, but it does the pad stays secure during mopping. I have used the detergent too, which is also good, which I didn't have other my previous steamer. Very lightweight but sturdy, I recommend to others.",
      "rating": 4.0,
      "verified": true,
      "author": "Blondebelle",
      "helpful_votes": 0,
      "publication_date": 20170819
    },
    {
      "title": "Very good product",
      "text": "I thought this was just another shopping channel \"cleaning miracle\"but my wife insisted we got one. I have to say I am impressed so far, is main use has been in the bathroom and on kitchen floor (you need to buy additional pads I got an 8 pack for £20 from tesco direct). It is great cleaning taps, tiles and flooring but you will need a few microfibre cloths to wipe up as you go along. It can be a bit noisy but that should be expected. It's lightweight and easy to get going works well with Karcher window vac 😁",
      "rating": 5.0,
      "verified": true,
      "author": "Northern geezer",
      "helpful_votes": 0,
      "publication_date": 20160222
    },
    {
      "title": "Perfect!",
      "text": "Love love love this product. Use it daily on my laminate flooring and works like a dream. It's even got a stubborn mark off my new patio door frame which the plasters kindly left behind 😠, so couldn't be happier with this!",
      "rating": 5.0,
      "verified": true,
      "author": "EmmaJayne",
      "helpful_votes": 0,
      "publication_date": 20200514
    },
    {
      "title": "Fab! Highly recommend.",
      "text": "Love love love this mop. With 2 indoor cats we hoover and mop regularly. So great to know it's steaming and killing any bacteria at the same time. One compartment for water, one for cleaner (I use any cleaner not just the vax). Can chuck the pad in the wash over and over again when needed. LOVE. Great buy and got rid of old mops.",
      "rating": 5.0,
      "verified": true,
      "author": "Meg92",
      "helpful_votes": 0,
      "publication_date": 20180927
    },
    {
      "title": "Stops working",
      "text": "Have had two of these products and both times after maybe a year they just stop working. I thought maybe it was the filter so I bought new ones for the second one and replaced but still no good. I’ve given it two stars because when it works it’s really good but I would have hoped for a longer life span. We live in hard water area so that has maybe had an impact!",
      "rating": 2.0,
      "verified": true,
      "author": "HF",
      "helpful_votes": 0,
      "publication_date": 20190921
    },
    {
      "title": "Very good but don't expect miracles",
      "text": "Cleans the floors pretty well like a floor mop and once you are used to it and keep it moving you will find it doesn't leave the floor too wet. Doesn't really shift grime like you see in promo videos. Don't expect your grout that's been ingrained with dirt to suddenly become as white as Simon Cowell's teeth. However let's face it non of the other manufacturers steam cleaners will either. So all in all with all the attachments, it's very good performance and price I would still recommend this.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160110
    },
    {
      "title": "Very disappointed with this product",
      "text": "Very disappointed with this product. It is very good for cleaning floor surfaces but fails dismally on other household jobs. The brush heads were totaaly flattened after just two uses and were of no use at all. The nozzle which attaches the brushes to the steamer loosens itself and flys off. Full marks to Amazon however who very promptly arranged for me to return this item for a refund. Have now ordered H2O HD steamer to replace.",
      "rating": 2.0,
      "verified": true,
      "author": "Patricia",
      "helpful_votes": 2,
      "publication_date": 20160324
    },
    {
      "title": "Great item and value for money",
      "text": "This is my second one I bought for 2 houses I clean. Lightweight especially the hand held steamer and easy to use. Ideal for steaming furnishings against Covid 19 Recommend to many other people.",
      "rating": 5.0,
      "verified": true,
      "author": "gee cass",
      "helpful_votes": 0,
      "publication_date": 20200717
    },
    {
      "title": "The floors are always clean!",
      "text": "I simply love it! I was fed up with dragging around a bucket and a mop, which made me feel like I was also just swiping the dirt from one side to the other. This has made cleaning the floors of the whole house so much simpler and so much faster! I would love it if it was cordless, but still the cord is huge and I can even clean the top floor and not even needing to turn it off and on from one floor to the other!",
      "rating": 5.0,
      "verified": true,
      "author": "Claudia Casal",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "⭐️⭐️⭐️⭐️⭐️",
      "text": "Perfect!!! 👍 Quick delivery 👍Product as described 👍Great price 👍recommended product 👍recommended seller",
      "rating": 5.0,
      "verified": true,
      "author": "Parenting Tips 100",
      "helpful_votes": 0,
      "publication_date": 20200917
    },
    {
      "title": "For an Efficient Hygienic Clean",
      "text": "Cleans my floors quickly efficiently hygienically. Tools are useful but time consuming if you want a thorough clean of eg. Cooker",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200719
    },
    {
      "title": "Great machine",
      "text": "Bought this one for my daughter as I was so pleased with mine. Easy to use, easy to store, really pleased with it, takes no time at all to heat up and it does the job!",
      "rating": 5.0,
      "verified": true,
      "author": "Tricia",
      "helpful_votes": 0,
      "publication_date": 20200921
    },
    {
      "title": "Steaming brilliant!",
      "text": "This steamer is absolutely brilliant. I did quite a lot of research (boring!!!) before buying but glad I did as this one is really good. The detergent gives a pleasant smell to the freshly steamed floors and it removes marks and stains easily. I have also used the detachable hand held steamer to clean the bathroom and oven - great!",
      "rating": 5.0,
      "verified": true,
      "author": "BVenro",
      "helpful_votes": 0,
      "publication_date": 20171030
    },
    {
      "title": "Steaming",
      "text": "Absolutely brilliant steamer two in one. Simple to use. Easy to store. Had a few over the years for me this has been the best.",
      "rating": 5.0,
      "verified": true,
      "author": "Ant i Potter",
      "helpful_votes": 0,
      "publication_date": 20200819
    },
    {
      "title": "Really good versatile steamer",
      "text": "Really good versatile steamer. A few design issues though....the nozzle that is stored in the handle falls out, all the time!..... the cord could be a bit longer, it tells you to empty the water tank and the cleaning fluid tank after every use to prevent damage and when used as a hand held, it can be difficult to get to the bottom of things because the machine gets in the way. On the plus side, it heats up really quickly, all the tools are stored on board and it's easy to use and switch between the floor cleaner and the hand held.",
      "rating": 4.0,
      "verified": true,
      "author": "tracey porter",
      "helpful_votes": 0,
      "publication_date": 20150214
    },
    {
      "title": "Mop head comes unstuck.",
      "text": "The triangular mop head detaches and folds under. Does anyone have a fix. When you try the product help line the menu processes through the system and the having thanked you for your call, refers you to the web site which has no answer, and then cuts the call.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190423
    },
    {
      "title": "... admit that this purchase didn't get off to a good start. Delivery was to be within 7 days",
      "text": "I must admit that this purchase didn't get off to a good start. Delivery was to be within 7 days, but 9 days later the delivery company was still saying in transit. I contacted the supplier who arranged a replacement which arrived as promised. The steam mop does what is says on the box, but does need the detergeant to be effective, it cleans my tile floors rapidly and leaves a fresh smell in the room. I have not been succesful so far in refreshing my carpets but I will keep trying.",
      "rating": 4.0,
      "verified": true,
      "author": "David Jelfs",
      "helpful_votes": 0,
      "publication_date": 20150206
    },
    {
      "title": "Not working - and not all included accessories where there .",
      "text": "First of all came with no mop what is necessary for floors to cleaning.. And after putting it all together and see if it's working. then it's turns out it's not even working! The steam is not going true . Unfortunately it was waste of my money and feel very disappointed . I will have to send it back . Wasted my time and money.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200413
    },
    {
      "title": "Problems with refund",
      "text": "It was a good product but after using it 3 times it never turned back on again. I would not recommend it for long time as it doesn’t last. Amazon says to contact the manufacturer for refund/replacement which I did. But the manufacturer says to contact Amazon as this is the platform where the product was purchased. Can someone tell me how can I return the item and get my refund???? Thank you.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200407
    },
    {
      "title": "Mop",
      "text": "Very good mop for me I have three dogs so it is constantly in use, would buy another one in future when this one packs up. Happy with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Maureen",
      "helpful_votes": 0,
      "publication_date": 20200227
    },
    {
      "title": "Useless",
      "text": "It only worked twice before it stopped working. I keep trying but it still won't work. The two times it did work it was easy to use and cleaned kitchen floor well. I am now back to using a mop and bucket - wish I hadn't bothered buying it.",
      "rating": 1.0,
      "verified": true,
      "author": "Marina",
      "helpful_votes": 0,
      "publication_date": 20191204
    },
    {
      "title": "Great product, huge difference in floors!",
      "text": "Love this mop. Our baby is on the move and I felt our spray mop wasn’t enough for keeping the floors clean. And I couldn’t believe how much grime was on the pad after the first steam clean and I hoover about 2-3 times a day and mop everyday! For £20 more than the spray mop it’s 100% worth it! Floors even look visibly cleaner. Great purchase totally recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Ange771319",
      "helpful_votes": 0,
      "publication_date": 20200610
    },
    {
      "title": "Steamer views",
      "text": "It is a little more refined than or last Steamer which lasted a very long time. This one is a little difficult to release the cleaner fluid part of the Steamer. All in all, it does the job very well but I am built for ease of use.",
      "rating": 4.0,
      "verified": true,
      "author": "jeffrey furness",
      "helpful_votes": 0,
      "publication_date": 20200302
    },
    {
      "title": "This Vax steam cleaner is one of the better one's on the market at the moment",
      "text": "This Vax steam cleaner is one of the better one's on the market at the moment. we have had three other top line models in the last two years and all have just give up the ghost. So we thought we give this model a try, and if it went the same way as the others then we would go back to a mop and bucket. Don't want to tempt fate but this one just seems better build and design quality, easy to use, not to clumbersome and a decent power cable, you wont trip over this one..",
      "rating": 5.0,
      "verified": true,
      "author": "Tom",
      "helpful_votes": 0,
      "publication_date": 20150204
    },
    {
      "title": "Highly recommended",
      "text": "Such a good steam. Very easy to use and perfect for floor cleaning and moquette. The result is deep and disinfected clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Antonio D4",
      "helpful_votes": 0,
      "publication_date": 20200629
    },
    {
      "title": "Great when you have animals or do not want to wash on your hands and knees",
      "text": "Brilliant, having laminate flooring and tiles throughout this has saved so much time and hassle with cleaning. The only problem I encountered and upon googling it,it would appear to be a common problem is that the water holder with which to add the vax cleaning solution did not create any steam in fact it just seemed to retain all the liquid and the mop head remained dry so I ended up using the vax cleaning solution in the other water holder and haven't had any problems.",
      "rating": 5.0,
      "verified": true,
      "author": "Lilac Lisa",
      "helpful_votes": 0,
      "publication_date": 20171021
    },
    {
      "title": "Easy to use",
      "text": "I just bought this steam cleaner,veryeasy to assemble,I have back problems and have found it easy to use very light to lift and fill the tanks with water, it works well on my ceramics floors,has bought them up very clean if I could find a problem it is they only send a small bottle of cleaning fluid and I had to order a larger bottle and also they only send one floor mop and I ordered extra of those as well, very happy with this item.",
      "rating": 5.0,
      "verified": true,
      "author": "Helen J.",
      "helpful_votes": 0,
      "publication_date": 20150316
    }
  ],
  "product_meta": {
    "title": "Vax S86-SF-CC Steam Fresh Combi Classic 10-in-1 Handheld and Steam Mop by Vax",
    "rating": 4.1,
    "specifications": {
      "Product Dimensions": "11.81 x 45.67 x 12.2 inches",
      "Item Weight": "8.12 pounds",
      "ASIN": "B00KPT6AOG",
      "Item model number": "S86-SF-CC",
      "Customer Reviews": "4.1 out of 5 stars2,247 ratings4.1 out of 5 stars",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "August 13, 2015"
    },
    "categories": [
      "Home & Kitchen"
    ],
    "price": ""
  }
}