{
  "website_summaries": [
    {
      "verdict": "This model has a modern design and large storage space, making it a good choice for small bathrooms with few cabinets.",
      "pros": [
        "Recessed or surface-mount",
        "Includes Hang n Lock Fitting System for easy install",
        "Large storage capacity"
      ],
      "cons": [
        "Only 5 inches deep",
        "Easily fingerprints when you open it"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Perfect for what I needed",
      "text": "Great size mirror, great size medicine cabinets. I couldn't be happier with the look and quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Carmen M.",
      "helpful_votes": 51,
      "publication_date": 20150920
    },
    {
      "title": "Beautiful, but difficult.",
      "text": "We purchased the 31\" oval mirror cabinet. The mirror came broken/cracked. In the process of installing the replacement cabinet, we found that the side mirrors were also broken/cracked. Fortunately, we hadn't sent the 1st one back yet. So we were able to scavenge the side mirrors to complete the job. The installation instructions were confusing/frustrating. It took 2 people 5 hours to install. Swearing all the while. Had to go to YouTube to finally figure it out (go there first!). The cabinet is very heavy. The installation is hard. But...it is now installed and it is beautiful. Fingers crossed that it doesn't fall off the wall.",
      "rating": 3.0,
      "verified": true,
      "author": "LakeDesert",
      "helpful_votes": 2,
      "publication_date": 20190302
    },
    {
      "title": "Incredible customer service",
      "text": "Our mirror arrived cracked and within 24hours we had a replacement . I cannot say enough about Wayfair and how they handle a bad situation as the replacement was also broken! We now have two perfect vanity mirrors for our new master and they look gorgeous. I went and bought the sconce at Wayfair because I was so impressed with how they called me immediately and made sure everything was sorted. Customer for life and the sconce, by the way, is DIVINE! The have a line called Renaissance that compliments the traditional look of these mirrors. 10/10",
      "rating": 5.0,
      "verified": true,
      "author": "Maggie Hobson",
      "helpful_votes": 10,
      "publication_date": 20150725
    },
    {
      "title": "Very Pleased!",
      "text": "Very pleased with this purchase. Though it was more than I wanted to spend, it was the right size for my existing rough in. When it arrived, it was so much nicer than anything I had seen in any of the stores. The mirrored interior (cabinet and reverse side of mirror) is also a nice feature to see the side and back of hair.",
      "rating": 5.0,
      "verified": true,
      "author": "Dawn",
      "helpful_votes": 12,
      "publication_date": 20151010
    },
    {
      "title": "A beautiful and useful medicine chest.",
      "text": "I purchased this mirror last summer in anticipation of a bathroom remodel. It took three or four attempts before a non-broken one arrived. Amazon and the company were understanding and helpful until one arrived intact. Finally the bathroom is done and this is a perfect mirror. It's beautiful. The contractors had no trouble at all installing it. The three shelves adjust and there's a lot of space inside. Mine has been installed into the wall but there's enough room that I could hide a stick on toothbrush hanger along the edge under the mirror face. Overall, this was a great buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Cynthia",
      "helpful_votes": 0,
      "publication_date": 20190309
    },
    {
      "title": "This is a lovely medicine cabinet with an oval beveled mirror",
      "text": "I installed this as a recessed medicine cabinet. The cabinet is a medium sized aluminium cabinet with two glass shelves - perfect for a powder room. Once installed, it looks elegant. The original cabinet I received arrived with the the inside door mirror shattered (the outter door mirror was fine; the two are glued together) it appeared to me that it had been broken before it was packed at the factory. Amazon was very helpful and shipped me a replacement unit immediately. Overall, I am very pleased with this oval medicine cabinet.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike S",
      "helpful_votes": 0,
      "publication_date": 20190313
    },
    {
      "title": "All the people I interacted with to deal with the broken mirror were great. Very helpful to process the return and give ...",
      "text": "I bought this item 3 times. Each time the mirror was broken. All the people I interacted with to deal with the broken mirror were great. Very helpful to process the return and give me a full refund each time. But was still broken 3 consecutive times. I ended up buying something else. If you buy it, good luck. Looks like a good product if you get it in one piece!",
      "rating": 1.0,
      "verified": true,
      "author": "Abraham C.",
      "helpful_votes": 4,
      "publication_date": 20180726
    },
    {
      "title": "Buyer beware",
      "text": "I really like this mirrored medicine cabinet. That said, we needed two of these for our bathroom remodel. We ended up ordering 5 of these in order to get 2 that weren't broken. The big mirror was broken on 2 of these and a side mirror on all of these. We have decided to keep the two we have as the big mirrors are fine but again the side mirrors are broken and we will either have to have more cut here or do some other creative fix. So I say, \"buyer beware\" because the packing is crap.",
      "rating": 3.0,
      "verified": true,
      "author": "Annie",
      "helpful_votes": 0,
      "publication_date": 20180816
    },
    {
      "title": "Love this Mirror!",
      "text": "This has been an amazing bathroom upgrade! We remodeled our bath and decided to go with this mirror/med cabinet. I'm so glad we did! It was simple to install, even on shiplap and has so much storage! We broke one side of the mirrored cover glass and had it easily duplicated at our local glass shop. No one even suspected it was a medicine cabinet. We will purchase this again when the time comes to remodel the master bath.",
      "rating": 5.0,
      "verified": true,
      "author": "Rita M.",
      "helpful_votes": 2,
      "publication_date": 20170830
    },
    {
      "title": "total disappointment",
      "text": "It seemed the perfect cabinet with a lovely oval mirror for my bathroom update but ... the first one arrived with a cracked mirror. OK so.. I ordered another - it arrived with a shattered mirror. Three times a charm? No.. the third one arrived with a shattered mirror also. The packaging on all three was fine inside and out so I've no idea what happened but got tired of paying my handyman (for his time) who came to install it so ended up ordering a totally different product.",
      "rating": 1.0,
      "verified": true,
      "author": "Laura Blanchard",
      "helpful_votes": 0,
      "publication_date": 20190131
    },
    {
      "title": "I love this mirror",
      "text": "I love this mirror! The only issue is the instructions seemed to be missing a few words/could use a bit of clarification in parts. But the mirror itself is awesome for the price. Its looks great, mirror is everywhere inside and out and the shelves are adjustable :)",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 9,
      "publication_date": 20150724
    },
    {
      "title": "Lovely and useful!",
      "text": "They are well priced and beautiful. Quality is amazing very comparable to other well known brands but at lower cost. Would buy again!",
      "rating": 5.0,
      "verified": true,
      "author": "Leonardo Brea",
      "helpful_votes": 6,
      "publication_date": 20170702
    },
    {
      "title": "Great Quality and Easy to Install",
      "text": "Most importantly, for my wife, the quality is high; for me, installation was a dream. They provide great instructions and a full-size template to put on the wall. Helped me easily center the mirror and (I surface mounted) mount the bracket to hang the mirror on; even has a built-in level. To be honest, they have set the industry standard on this (see pic). I’m super impressed. Would certainly order Croydex again.",
      "rating": 5.0,
      "verified": true,
      "author": "William Powers",
      "helpful_votes": 2,
      "publication_date": 20180321
    },
    {
      "title": "Gorgeous!!",
      "text": "I absolutely love this mirror! It’s big it’s roomy the mirror is on both sides of the door and on the back of the inside of the medicine cabinet. When you open it it’s mirrors everywhere it looks absolutely beautiful.! I had done both bathrooms, I kind of wish I would’ve put this in my upstairs master instead of the first bath we did downstairs...it’s gorgeous !",
      "rating": 5.0,
      "verified": true,
      "author": "susan z.",
      "helpful_votes": 0,
      "publication_date": 20200123
    },
    {
      "title": "Good for purpose.",
      "text": "Not quite the quality I was expecting since I bought another one for a similar price a few years ago, but it does the job. It is not bad quality, but the old unit was heaver constructed and had larger dimensions.",
      "rating": 4.0,
      "verified": true,
      "author": "David Calder",
      "helpful_votes": 2,
      "publication_date": 20170627
    },
    {
      "title": "New bathroom New cabinet",
      "text": "Love it however the shelve is at a fixed height and I cannot figure out how to change thus 4 star.. looks great up",
      "rating": 4.0,
      "verified": true,
      "author": "annat",
      "helpful_votes": 6,
      "publication_date": 20150630
    },
    {
      "title": "It looks good in my bathroom",
      "text": "It's very nice. I didn't experience any trouble with the weight of the door others have mentioned. It looks really good in my bathroom, but I do feel like I over paid. I saw one very similar at walmart for about $60 less. But too late for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190811
    },
    {
      "title": "So much for your money",
      "text": "Love the mirrors on the inside and the glass shelves. Looks way more expensive than it is.",
      "rating": 5.0,
      "verified": true,
      "author": "Izzy",
      "helpful_votes": 0,
      "publication_date": 20180422
    },
    {
      "title": "Beautiful mirrors",
      "text": "Put 2 of these in my new master bath and they are beautiful. While a pro installed them they seemed to go in easily and with no trouble. They seem much higher quality to what was available at the library cal big box stores, but the price was similar. The delivery was quick and free of damage. I couldn't be happier.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20160620
    },
    {
      "title": "0 for 3. Purchased 4 mirrors, and only ...",
      "text": "0 for 3. Purchased 4 mirrors, and only received 3 of them. When I opened them, they were all broken. This item shipped in manufacturer's packaging only with no additional protection. The packaging may work for palletized shipments but not for individual item shipping, which is why they are all broken. I requested replacements, I can only hope that they show up in one piece.",
      "rating": 2.0,
      "verified": true,
      "author": "Armyb77",
      "helpful_votes": 0,
      "publication_date": 20180625
    },
    {
      "title": "Average quality purchase. Ok",
      "text": "Looks good but overall quality a bit low. Door flimsy.",
      "rating": 3.0,
      "verified": true,
      "author": "Carolyn W.",
      "helpful_votes": 0,
      "publication_date": 20190121
    },
    {
      "title": "Otherwise it would have been nice.",
      "text": "We ordered this recessed medicine cabinet and it came to us broken. Not once but twice. So we cancelled the order. Otherwise it would have been nice.",
      "rating": 2.0,
      "verified": true,
      "author": "Aaron Sargent",
      "helpful_votes": 0,
      "publication_date": 20180412
    },
    {
      "title": "Unique shape, great size",
      "text": "We were looking for a stylish bathroom medicine cabinet; were about to give up and settle for just a mirror. Then on Amazon we found this Croydex beautiful OVAL mirror with roomy medicine cabinet. Mirrored inside as well and nice glass shelves.",
      "rating": 5.0,
      "verified": true,
      "author": "Senortap",
      "helpful_votes": 0,
      "publication_date": 20181204
    },
    {
      "title": "Beautiful",
      "text": "This is a beautiful mirror inside and out. The whole inside is a mirror finish along with the back of the mirror. It unfortunately came broke.",
      "rating": 4.0,
      "verified": true,
      "author": "Beadbug",
      "helpful_votes": 2,
      "publication_date": 20160923
    },
    {
      "title": "Four Stars",
      "text": "This is really cute in my 1920's style vintage bathroom.",
      "rating": 4.0,
      "verified": true,
      "author": "Jen from KC",
      "helpful_votes": 3,
      "publication_date": 20160707
    },
    {
      "title": "Rough opening size is not correct.",
      "text": "Mirror is very nice, but the rough opening size is 14x19.",
      "rating": 1.0,
      "verified": true,
      "author": "sparkon",
      "helpful_votes": 0,
      "publication_date": 20180824
    },
    {
      "title": "Two arrived withcracked mirrors",
      "text": "I would like to receive the product without a cracked mirror. there are packing faults.",
      "rating": 1.0,
      "verified": true,
      "author": "Louise Chadwick",
      "helpful_votes": 0,
      "publication_date": 20190502
    },
    {
      "title": "The cabinet is very nice and the shipping was great",
      "text": "The cabinet is very nice and the shipping was great. I think it is a good item for the cost.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20160301
    },
    {
      "title": "Pretty mirror just too big!",
      "text": "Item was too huge for the the space I needed it for. Ordered it from Plum Struck. Worst Customer Service ever! Finally got it taken care of!! Wish i could have kept the mirror - it was very pretty and the inside of the cabinet was huge!!",
      "rating": 5.0,
      "verified": true,
      "author": "Roz",
      "helpful_votes": 5,
      "publication_date": 20151015
    },
    {
      "title": "You have to touch the mirror to open it. ...",
      "text": "You have to touch the mirror to open it. This leads to finger prints on it all the time and you know who will have to clean it.",
      "rating": 3.0,
      "verified": true,
      "author": "Cannonfire",
      "helpful_votes": 4,
      "publication_date": 20161206
    },
    {
      "title": "Looks great. However the mirror is a little heavy for ...",
      "text": "Looks great. However the mirror is a little heavy for the frame so you have to be kind of careful when you open the door.",
      "rating": 4.0,
      "verified": true,
      "author": "Liz",
      "helpful_votes": 4,
      "publication_date": 20160706
    },
    {
      "title": "Install supplies are worthless",
      "text": "Nice looking, large mirror with plenty of storage. However, the instructions are very poor and difficult to understand and the supplies to hang it are garbage. The sheet rock anchors have no lip to hold them in place or still while screwing into them. What should have been a 45 min install has taken 2 hours and now requires a trip to Lowes to get real anchors to hold them in place. Would not buy this again even though it looks nice.",
      "rating": 2.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20171130
    },
    {
      "title": "I am not happy with it",
      "text": "I am not happy with it, as the mirror is too heavy when you open it. It feels as though it is going to pull off the wall. Had the proper spaces been supplied, the mirror would not be on a tilted position. Because of the angle the weight of the mirror to swing open very freely.",
      "rating": 1.0,
      "verified": true,
      "author": "Helen DeMartino",
      "helpful_votes": 0,
      "publication_date": 20170525
    },
    {
      "title": "Mirror was broken",
      "text": "I bought this for our summer place and by the time we went to install it and discovered the mirror was broken, the time to return it had past. How very disappointing! What a waste.",
      "rating": 1.0,
      "verified": true,
      "author": "Beth Williams",
      "helpful_votes": 0,
      "publication_date": 20160904
    },
    {
      "title": "Five Stars",
      "text": "The fixtures are great and I can't say enough about the company's service...they were great!",
      "rating": 5.0,
      "verified": true,
      "author": "KATHERINE KRUECKEBERG",
      "helpful_votes": 2,
      "publication_date": 20150508
    },
    {
      "title": "Great product and worth twice as much!",
      "text": "I am so impressed with this cabinet. I was very surprised when I opened it and the inside of the door is also a mirror and so is the inside of the cabinet. Will be purchasing another for the second bathroom.",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara A. Nabours",
      "helpful_votes": 0,
      "publication_date": 20190415
    }
  ],
  "product_meta": {
    "title": "Croydex Winster 20-Inch x 16-Inch Recessed or Surface Mount Medicine Cabinet with Hang 'N' Lock Fitting System, Aluminum",
    "description": "Size:20-Inch x 16-Inch - Single DoorThe winster single door cabinet features two height adjustable shelves allow you to personalize your cabinet in a way that can maximize the use of space for all your daily lotions and potions. The patented hang 'n' lock easy installation bracket from Croydex is a simple and safe solution to hang your cabinet or mirror. Hang 'n' lock provides the flexibility to change the level of your cabinet or mirror after having drilled your holes making it easy for a single person install.\n\nFROM THE MANUFACTURER\nThe clean, elegant lines of this sophisticated cabinet would suit any style of bathroom and the many innovative and practical features ensure that the cabinet is functional as well as beautiful. The Hang 'N' Lock fixing system allows you to fix the supporting bracket to the wall rather than to the cabinet, so you do not have to struggle to measure distances and mark screw holes whilst supporting a heavy bathroom cabinet. This cabinet can also be surface mounted or recessed - depending on the cavity depth of your bathroom wall - so you can really optimize the space available in your bathroom.",
    "rating": 4.1,
    "feature_bullets": [
      "Aluminum cabinet with mirrored door",
      "Two adjustable shelves",
      "105 Degree hinge",
      "Recessed or surface mounted configuration",
      "Easy to install Hang 'N' Lock system"
    ],
    "specifications": {
      "Manufacturer": "Croydex",
      "Part Number": "WC101169AZ",
      "Item Weight": "21 pounds",
      "Product Dimensions": "5.25 x 16 x 20 inches",
      "Item model number": "WC101169AZ",
      "Is Discontinued By Manufacturer": "No",
      "Size": "20-Inch x 16-Inch - Single Door",
      "Color": "Silver",
      "Finish": "Aluminum",
      "Material": "Aluminum",
      "Shape": "Rectangle",
      "Item Package Quantity": "1",
      "Accessory Connection Type": "2",
      "Plug Profile": "Recessed and surface-mount",
      "Included Components": "Cabinet, Shelves, Instruction Leaflet, Fittings",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "ASIN": "B00J9Q4228",
      "Customer Reviews": "4.1 out of 5 stars131 ratings4.1 out of 5 stars",
      "Best Sellers Rank": "#411,845 in Home & Kitchen",
      "Domestic Shipping": "Item can be shipped within U.S.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S. Learn More",
      "Date First Available": "March 26, 2014"
    },
    "categories": [
      "Bathroom Accessories",
      "Home & Kitchen",
      "Bath",
      "Tools & Home Improvement",
      "Medicine Cabinets"
    ],
    "price": 139.3
  }
}