{
  "website_summaries": [
    {
      "verdict": "The 3rd version of the Asics Gel Zaraca was engineered to move more naturally with the runner’s foot. It’s lightweight and flexible, so it won’t feel restrictive or limiting. It caters to the needs of neutral runners.",
      "pros": [
        "Fused overlays with stitched reinforcements allow the upper to wrap around the foot easily",
        "Many runners appreciated the durability of this running shoe",
        "The cushioning is soft and springy, which runners welcomed",
        "The moderate weight prevents runners from feeling as if the shoe is dragging them down",
        "Durable rubber shields the sole unit from wear and tear",
        "Breathable mesh makes the upper unit very comfortable on the skin"
      ],
      "cons": [
        "The upper began to tear off for a few testers",
        "It runs a bit smaller than the usual"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": 9.2,
      "source": "runrepeat"
    }
  ],
  "customer_reviews": [
    {
      "title": "Always Asics!",
      "text": "Sad when I had to retire these after over 1000k (I do this with all my running shoes) as they held up well, although the soft material over the toe wore through (as usual with all my Asics trainers). They were a great fit, very light and the minimalist sole seemed to really help me get over my runner's knee problem (which I think was caused be wearing trail trainers on the road). Asics are the very best running shoe, in my opinion.",
      "rating": 5.0,
      "verified": true,
      "author": "Stevie H",
      "helpful_votes": 4,
      "publication_date": 20161223
    },
    {
      "title": "Reasonable for the price.",
      "text": "Okay for the price, not anywhere near as good as more expensive Asics I've owned. Fits well, good for general outdoor use but I wouldn't like to actually try running or using these in wet weather. Worst part about these is the grips, totally slippy in anything other than dry weather.",
      "rating": 3.0,
      "verified": true,
      "author": "Alex Trust",
      "helpful_votes": 0,
      "publication_date": 20171207
    },
    {
      "title": "nice shoes",
      "text": "nice shoes lasted me about a quarter, I like the gel",
      "rating": 5.0,
      "verified": true,
      "author": "Lopsey",
      "helpful_votes": 0,
      "publication_date": 20200828
    },
    {
      "title": "excellent quality but mind the size!",
      "text": "I ordered this for my friend, the quality is superb for the very low price, very happy with the purchase. It has only one issue, the size displayed is in UK and doesn't mach the real shoes for they are in EU & USA. I had this issue with 3 other shoes, they are a pit larger.",
      "rating": 4.0,
      "verified": true,
      "author": "Yaser Mahfoodh",
      "helpful_votes": 0,
      "publication_date": 20170302
    },
    {
      "title": "Happy to buy another pair soon",
      "text": "I've worn these regularly for over 1 year now and they are starting to wear out in the usual places. Happy to buy another pair soon.",
      "rating": 5.0,
      "verified": true,
      "author": "A S Somal",
      "helpful_votes": 0,
      "publication_date": 20170212
    },
    {
      "title": "Owned these shoes for a few months now and even ...",
      "text": "Owned these shoes for a few months now and even though these trainers are half a size too small for me they are very comfy (says it all), have been durable and theyre stylish to boot. Ill definitely get another pair once they have been worn out, half a size bigger this time.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160324
    },
    {
      "title": "No complaints",
      "text": "Ran the Belfast marathon in these and no issues what so ever. Fantastic for the price. Just tie them loosely and the tightness will not be an issue.",
      "rating": 5.0,
      "verified": true,
      "author": "Marty",
      "helpful_votes": 0,
      "publication_date": 20170703
    },
    {
      "title": "Great athletic trainer",
      "text": "My teen was more than happy with them. I personally thought they look better in front of my eyes then on the website. That's a good thing",
      "rating": 5.0,
      "verified": true,
      "author": "Zofee Sully",
      "helpful_votes": 0,
      "publication_date": 20170417
    },
    {
      "title": "Put a new spring in my step",
      "text": "Best running, exercise footwear. These size nine and a halves, fits my size tens perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. M. J. Taylor",
      "helpful_votes": 0,
      "publication_date": 20170727
    },
    {
      "title": "Flawed",
      "text": "I buy a half size bigger shoes because I have wide feet. The inside of the shoe near the toes has a step where the mesh joins which catches my toenail and almost tears off. So not recommended for people with wide feet buying a larger size to compensate. Apart from that they dry quickly, keep your toes cool and the gel in the sole seems to help.",
      "rating": 3.0,
      "verified": true,
      "author": "C. Michaux",
      "helpful_votes": 0,
      "publication_date": 20150608
    },
    {
      "title": "Good Gym Shoes",
      "text": "Good shoes as expected by Asics. I brought these specifically for gym use and they are perfect for this. They are a little soft on the cushioning so I wouldn't use for 10m plus races but the fit is perfect and are comfortable.",
      "rating": 4.0,
      "verified": true,
      "author": "Liam",
      "helpful_votes": 0,
      "publication_date": 20150311
    },
    {
      "title": "Light, bouncy and fit like a glove",
      "text": "SOOO comfy. These are great to run in. Light and bouncy and fit like a glove especially with my wide feet. I might even buy another pair to replace in a few years when I have worn the others out",
      "rating": 5.0,
      "verified": true,
      "author": "dom",
      "helpful_votes": 0,
      "publication_date": 20160429
    },
    {
      "title": "including a half marathon and they're really comfortable and run great",
      "text": "Ran multiple distances in these since I've received them, including a half marathon and they're really comfortable and run great. Ordered half a size larger than usual and it's a great fit.",
      "rating": 5.0,
      "verified": true,
      "author": "Conor L",
      "helpful_votes": 0,
      "publication_date": 20150730
    },
    {
      "title": "Price was good, fit was perfect and my only gripe is ...",
      "text": "Price was good, fit was perfect and my only gripe is the tread has worn thin. But considering i use these to walk to / from the station every day on pavements not too worried about that. Would be great running trainers also.",
      "rating": 4.0,
      "verified": true,
      "author": "AP",
      "helpful_votes": 0,
      "publication_date": 20150929
    },
    {
      "title": "Three Stars",
      "text": "Good light running shoes. A little too large for me, fine with thicker socks.",
      "rating": 3.0,
      "verified": true,
      "author": "Mr B.",
      "helpful_votes": 0,
      "publication_date": 20160620
    },
    {
      "title": "Spend a bit more and get a decent pair that will last",
      "text": "Poor quality running shoe. Cheaply made. Had to return as it did not meet expectations",
      "rating": 1.0,
      "verified": true,
      "author": "Steven Hayes",
      "helpful_votes": 0,
      "publication_date": 20180929
    },
    {
      "title": "Seem slightly larger 8. 5(UK) than other brands I ...",
      "text": "Seem slightly larger 8.5(UK) than other brands I buy (North Face/Adidas/Nike).",
      "rating": 5.0,
      "verified": true,
      "author": "Stevie",
      "helpful_votes": 0,
      "publication_date": 20151212
    },
    {
      "title": "Decent (at first), then not so much...",
      "text": "Good fit, comfortable and supportive. Edit - after more use the padding at the back of the foot shifted, leaving an uncomfortable hard, and quite sharp, support. Actually made me bleed a couple of times, until I through away. Won’t be buying again.",
      "rating": 2.0,
      "verified": true,
      "author": "jamescraiguk",
      "helpful_votes": 0,
      "publication_date": 20150401
    },
    {
      "title": "very comfortable",
      "text": "bought these for my husband he said they are very comfortable one of the most comfortablr he's ever had",
      "rating": 5.0,
      "verified": true,
      "author": "Kim Hill",
      "helpful_votes": 0,
      "publication_date": 20150502
    },
    {
      "title": "Five Stars",
      "text": "Great trainers. Fast delivery, very pleased with product and service.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20150908
    },
    {
      "title": "Good buy",
      "text": "Next day delivery great price fitted perfectly and they look good, an excellent running shoe for the not to serious runner.",
      "rating": 4.0,
      "verified": true,
      "author": "McrGraeme",
      "helpful_votes": 0,
      "publication_date": 20150615
    },
    {
      "title": "Good value for money and good running trainers.",
      "text": "Excellent trainers takes the shock of impact but soft enough and subtle enough to promote good running form and not \"heel striking\". Felt the difference between these and my older Asics.",
      "rating": 5.0,
      "verified": true,
      "author": "M. B. Dunn",
      "helpful_votes": 0,
      "publication_date": 20150619
    },
    {
      "title": "Great for the gym",
      "text": "Light weight and comfy. They flex easily and the gel cushioning isn't obtrusive.",
      "rating": 5.0,
      "verified": true,
      "author": "TB",
      "helpful_votes": 0,
      "publication_date": 20150519
    },
    {
      "title": "good budget shoe",
      "text": "good fit gel heel makes all the difference the colour is a bit garish but liveable",
      "rating": 4.0,
      "verified": true,
      "author": "kiwijock",
      "helpful_votes": 0,
      "publication_date": 20141014
    },
    {
      "title": "Very comfortable to start with for the limited runner that I ...",
      "text": "Very comfortable to start with for the limited runner that I am. Time will tell how they do over the next few months.",
      "rating": 4.0,
      "verified": true,
      "author": "rdrummond",
      "helpful_votes": 0,
      "publication_date": 20150417
    },
    {
      "title": "Perfect comfort and support just a little on the large ...",
      "text": "Perfect comfort and support just a little on the large size keeping this pair for work and buying another to train in",
      "rating": 5.0,
      "verified": true,
      "author": "PT and Nutrition enthusiast",
      "helpful_votes": 0,
      "publication_date": 20150717
    },
    {
      "title": "Great trainers!!",
      "text": "Love these beauties!! Comfortable, lightweight and great value too. So pleased!!",
      "rating": 5.0,
      "verified": true,
      "author": "Stuart Blackburn",
      "helpful_votes": 0,
      "publication_date": 20150606
    },
    {
      "title": "Five Stars",
      "text": "Most comfortable trainers I own and I have many pairs by various manufacturers",
      "rating": 5.0,
      "verified": true,
      "author": "stephen wilson",
      "helpful_votes": 0,
      "publication_date": 20150628
    },
    {
      "title": "Perfect support, lightweight and breathable",
      "text": "A little narrow but soon broke them in. Perfect support, lightweight and breathable. Brilliant for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Rob James",
      "helpful_votes": 0,
      "publication_date": 20150919
    },
    {
      "title": "Jog on!",
      "text": "Very comfortable, good price and quick delivery. Very happy with these!",
      "rating": 5.0,
      "verified": true,
      "author": "Shaun P",
      "helpful_votes": 0,
      "publication_date": 20150326
    },
    {
      "title": "Great Asics running shoes",
      "text": "These have served me very well and I thoroughly recommend them.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr William Carpenter",
      "helpful_votes": 0,
      "publication_date": 20170827
    },
    {
      "title": "lovely",
      "text": "Love these trainer ran half marathon a year ago in them and they are still going! 👍🏻👍🏻",
      "rating": 5.0,
      "verified": true,
      "author": "Shaunlee G",
      "helpful_votes": 0,
      "publication_date": 20150918
    },
    {
      "title": "Five Stars",
      "text": "Amazing product and an amazing price. Highly recommended! No surprises on the size, fitting perfectly!",
      "rating": 5.0,
      "verified": true,
      "author": "Andre Rosendo",
      "helpful_votes": 0,
      "publication_date": 20150729
    },
    {
      "title": "... have paid treble for shoes that are not as good as this",
      "text": "I have paid treble for shoes that are not as good as this item",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff J.",
      "helpful_votes": 0,
      "publication_date": 20150830
    },
    {
      "title": "Trainers",
      "text": "Great quality fitted as expected also arrived earlier than anticipated.",
      "rating": 5.0,
      "verified": true,
      "author": "Asky",
      "helpful_votes": 0,
      "publication_date": 20150913
    },
    {
      "title": "These trainers are really good they are extremely comfortable with the gel in them ...",
      "text": "These trainers are really good they are extremely comfortable with the gel in them let air in to cool u down. All in all very good.",
      "rating": 4.0,
      "verified": true,
      "author": "m j hill",
      "helpful_votes": 0,
      "publication_date": 20150623
    },
    {
      "title": "Plus I think they look great.",
      "text": "Really comfy, I wore them to the gym the day I bought them and didnt need breaking in. Plus I think they look great. Cheers",
      "rating": 5.0,
      "verified": true,
      "author": "david mannix",
      "helpful_votes": 0,
      "publication_date": 20150401
    },
    {
      "title": "Five Stars",
      "text": "Excellent fit, very comfortable, good price. Quick delivery. Would definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "les molyneux",
      "helpful_votes": 0,
      "publication_date": 20150828
    },
    {
      "title": "Perfect fit and lovely trainers",
      "text": "Bought these for the husband. Perfect fit and lovely trainers. He's very happy with these, look very smart. Arrived promptly too!",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs T J Williams",
      "helpful_votes": 0,
      "publication_date": 20151107
    },
    {
      "title": "Five Stars",
      "text": "Great shoe, have bought Asics before so new correct size",
      "rating": 5.0,
      "verified": true,
      "author": "Mr Michel Le Cras",
      "helpful_votes": 0,
      "publication_date": 20150622
    },
    {
      "title": "Five Stars",
      "text": "Very comfortable and plenty cushion in them for running long distance.",
      "rating": 5.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20150911
    },
    {
      "title": "These are great if you're looking for an 'unstructured' shoe",
      "text": "These are great if you're looking for an 'unstructured' shoe. I've previously used ASICS that support the arches (with a 'rocker' as some call it) but I prefer flatter soles. I've also tried barefoot/minimalist running shoes but for me these are all hype no substance as all they seem to do is wear through quicker; I'm a mid-foot runner anyway. Definitely good quality and excellent value for money.",
      "rating": 5.0,
      "verified": true,
      "author": "Emma W",
      "helpful_votes": 0,
      "publication_date": 20151003
    },
    {
      "title": "Great functional runners, recommended for anyone looking for comfort and good sizing",
      "text": "Comfy running shoes. Use them for casual use and they feel so smooth that you barely notice wearing them at all until you look down and realise they are Asics. Any runner knows how much you depend on good shoes, and these are no different. Excellent. Reflective quality on them is quite good, too.",
      "rating": 5.0,
      "verified": true,
      "author": "PJ2014",
      "helpful_votes": 4,
      "publication_date": 20150219
    },
    {
      "title": "Five Stars",
      "text": "Great trainers. Very comfortable and light. Perfect for running and gym based training.",
      "rating": 5.0,
      "verified": true,
      "author": "MR A J Smith",
      "helpful_votes": 0,
      "publication_date": 20140928
    },
    {
      "title": "Great looking and good value",
      "text": "Lovely looking trainers. I bought them for my husband and he is really happy with them. He finds them comfortable. They are excellent value for money, all the shops had them for twice what I paid for them. They were delivered quickly. I will use this seller again.",
      "rating": 5.0,
      "verified": true,
      "author": "Maria",
      "helpful_votes": 0,
      "publication_date": 20150301
    },
    {
      "title": "Great and comfortable shoes - however the thin material layer ...",
      "text": "Great and comfortable shoes - however the thin material layer at the top was very easily punctured through regular day-to-day use (within about a month). Can't use them for anything other than evening runs now as my socks are poking through!",
      "rating": 2.0,
      "verified": true,
      "author": "Tom",
      "helpful_votes": 0,
      "publication_date": 20150901
    },
    {
      "title": "They fit perfectly (size 8) and are light as a ...",
      "text": "They fit perfectly (size 8) and are light as a feather. Wearing them most days as they're really supportive and I need that right now (recovering from a back op)",
      "rating": 5.0,
      "verified": true,
      "author": "Philip ",
      "helpful_votes": 0,
      "publication_date": 20151103
    },
    {
      "title": "Trainers are great thanks, box was slightly squashed at one end ...",
      "text": "Trainers are great thanks, box was slightly squashed at one end but apart from that can't complain, arrived when expected.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20150218
    },
    {
      "title": "Three Stars",
      "text": "nice shoe, got a half size larger than normal and the shoe was still on the tight side.",
      "rating": 3.0,
      "verified": true,
      "author": "Ryan",
      "helpful_votes": 0,
      "publication_date": 20150506
    },
    {
      "title": "Stay clear from these",
      "text": "I honestly think these trainers are fake.... I've never worn a more uncomfortable trainer in my life! Can't walk in them Can't run in them Can't train in them Apart from that there great lol",
      "rating": 1.0,
      "verified": true,
      "author": "Stan Shopp",
      "helpful_votes": 0,
      "publication_date": 20160408
    }
  ],
  "product_meta": {
    "title": "ASICS Gel-Zaraca 3, Men's Running Shoes",
    "description": "These gel-zaraca 3 training shoes by asics are less structured for a different running experience. They are engineered with a flexible midsole to give a more responsive ride. The rear foot gel absorbs shock and protects foot through the gait cycle and also adds a touch of style to your running with a sleek low profile.",
    "rating": 4.4,
    "feature_bullets": [
      "Outer Material: Synthetic",
      "Inner Material: Textile",
      "Sole: Gum Rubber",
      "Closure: Lace-Up",
      "Shoe Width: Normal"
    ],
    "specifications": {
      "Item Weight": "997.9 Grams",
      "Date First Available": "1 July 2014",
      "Manufacturer": "ASICS",
      "ASIN": "B00TX4U7SO",
      "Item model number": "T4D3N-9900",
      "Department": "Men's"
    },
    "categories": [
      "Fashion & Athletic Trainers",
      "Shoes",
      "Sports & Outdoor Shoes",
      "Men's Shoes",
      "Road Running Shoes",
      "Running Shoes",
      "Shoes & Bags"
    ],
    "price": 71.78
  }
}