{
  "website_summaries": [
    {
      "verdict": "Nicely priced golf cart cover that uses a rear zipper for fast removal when you need to use the cart.",
      "pros": [
        "Vents in the rear of the cover will prevent moisture buildup inside the cart",
        "Large rear zipper allows you to quickly remove or install the cart cover",
        "Elastic around the bottom of the cover ensures it will remain in place, even in windy conditions",
        "Grommets around the bottom allow you to tie down the cover",
        "Comes in two sizes"
      ],
      "cons": [
        "Fabric probably won't last as long as you'd like",
        "Build quality of zipper is below average"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "I am very satisfied with my new golf cart cover",
      "text": "I am very satisfied with my new golf cart cover. The weight is wonderful. The lighter covers are hard for one person to put on when the wind is blowing. This weight is manageable and can even be used without using extra tie downs. It doesn't blow off. I do wish it was just a little bit larger. My golf cart is lifted and could have used just a little more cover to get the tires covered completely. Still, it's a much better cover than others I've purchased in the past. I would definitely purchase another one when needed.",
      "rating": 5.0,
      "verified": true,
      "author": "Jay D.",
      "helpful_votes": 4,
      "publication_date": 20180420
    },
    {
      "title": "Heavy and well made. I wish it fit a bit more snugly.",
      "text": "Well made, heavy, coated canvas-like material. It is very large and doesn't fit the form of my four-seat Club Car, which makes it difficult to position on the cart. I really can't tell the front from the back. I thought I had put it on wrong so took it off and turned it around. Same thing. Maybe it's made to fit an extended roof? Anyway I'll probably just put some bungee cords here and there to keep it tighter. That said, it seems to be very durable and will last for several years. Much better than those thin covers which cost the same price.",
      "rating": 4.0,
      "verified": true,
      "author": "Raynepa",
      "helpful_votes": 2,
      "publication_date": 20171015
    },
    {
      "title": "Heavy!",
      "text": "This review is for the KHOMO GEAR Golf Cart Cover - TITAN Series - 4 Passenger. They are great covers. I bought one of these last April and used it everyday for six months. It still looked new enough that a friend came in over late October and saw it and had to have one NOW, so he paid me full price to by myself a new one and he took the old one! He is also very happy with it. I just ordered another new one for my cart a few hours ago.",
      "rating": 5.0,
      "verified": true,
      "author": "gerG",
      "helpful_votes": 3,
      "publication_date": 20180304
    },
    {
      "title": "Nice quality",
      "text": "This thing is heavy... Unlike the think covers you mostly find this is a thick, well stitched cover. The only downfall is the weight. It makes it a little more difficult to get on, but I think this is going to last. I have a lifted precedent with rear facing bench added on and this fit tightly.",
      "rating": 5.0,
      "verified": true,
      "author": "yeahright",
      "helpful_votes": 4,
      "publication_date": 20170419
    },
    {
      "title": "Great  cover heavy duty AAA+++",
      "text": "I just used your cover for the very first time today my wife and I both were very pleased with the quality of the cover and how it covered are four person golf cart two facing forward and two facing to the rear",
      "rating": 5.0,
      "verified": true,
      "author": "John Absher",
      "helpful_votes": 3,
      "publication_date": 20180428
    },
    {
      "title": "Very Sturdy - Heavier than Desired",
      "text": "I must say that the quality is very solid. So solid that it's heavy to manage. My old one was much lighter and easier to throw over the cart. You're not going to throw this one...it's heavy and not very flexible. If you want something that will last, is waterproof, and very sturdy, then this is the one for you. I personally will try to find one that I can throw on and off more easily.",
      "rating": 4.0,
      "verified": true,
      "author": "Wadebbi",
      "helpful_votes": 0,
      "publication_date": 20190126
    },
    {
      "title": "Not only is this cover a great fit, but the quality is great",
      "text": "I have a four seat EZGO golf cart. Not only is this cover a great fit, but the quality is great.....much, much better than expected.",
      "rating": 5.0,
      "verified": true,
      "author": "737-300",
      "helpful_votes": 2,
      "publication_date": 20180516
    },
    {
      "title": "Heavy duty and easy to put on your golf cart",
      "text": "This is the second one I purchased. This one is for a neighbor who after seeing mine wanted one also. It’s very heavy duty, ours sits out in the Florida sun and I haven’t seen any UV deterioration.",
      "rating": 5.0,
      "verified": true,
      "author": "John C.",
      "helpful_votes": 0,
      "publication_date": 20190518
    },
    {
      "title": "Not worth for the money",
      "text": "Heavy witch i like and i thought it would be heavy duty,but it faded in 4 months ,and rip in 6-8 months I’m hoping that’s covered under warranty witch is not listed?",
      "rating": 2.0,
      "verified": true,
      "author": "Noelspainting&Handyman Services Inc.",
      "helpful_votes": 0,
      "publication_date": 20190811
    },
    {
      "title": "Well made heavy material",
      "text": "Nice heavy duty cover it should last a few years in the Florida sun?",
      "rating": 5.0,
      "verified": true,
      "author": "Ray T",
      "helpful_votes": 0,
      "publication_date": 20180617
    },
    {
      "title": "Nice cover, well made, great protection for your investment.",
      "text": "This cover is well built. It's lightweight and should last a long time. My only complaint with these covers are that I find them to be difficult to install by myself. I have a four seat cart with the extended roof and they always want to hang up. With two people it's not too bad.",
      "rating": 4.0,
      "verified": true,
      "author": "Ophiacus",
      "helpful_votes": 0,
      "publication_date": 20171222
    },
    {
      "title": "but we love it. It is heavy duty and will last ...",
      "text": "It's too big for our cart (2 person), but we love it. It is heavy duty and will last hopefully way more than one season. Thank you",
      "rating": 5.0,
      "verified": true,
      "author": "mtsjb",
      "helpful_votes": 0,
      "publication_date": 20170603
    },
    {
      "title": "Highly recommend!",
      "text": "Nice and heavy material, will definitely last for a few years, maybe more. Product was as advertised and arrived when specified. Would order from them again! Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Debra B.",
      "helpful_votes": 0,
      "publication_date": 20171128
    },
    {
      "title": "Great cover. worth the money.",
      "text": "Very heavy duty cover. Actually heavier than I expected. Covers the cart as expected.",
      "rating": 5.0,
      "verified": true,
      "author": "Bulldog12019",
      "helpful_votes": 0,
      "publication_date": 20170923
    },
    {
      "title": "Quality buy!",
      "text": "Great quality! Very happy with the thickness!! Don’t buy a cheaper one that u will regret due to quality!!",
      "rating": 5.0,
      "verified": true,
      "author": "Chicago Prime",
      "helpful_votes": 0,
      "publication_date": 20180603
    },
    {
      "title": "Great Quality, you won't find a cover that has ...",
      "text": "Great Quality, you won't find a cover that has more protection for the price. Problem that I faced that it was extremely HEAVY.",
      "rating": 5.0,
      "verified": true,
      "author": "Adam",
      "helpful_votes": 0,
      "publication_date": 20180731
    },
    {
      "title": "Quality Material.",
      "text": "Quality product and fits perfectly over our 4 seat golf cart.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190110
    },
    {
      "title": "Five Stars",
      "text": "This is a VERY nice cover!! Very heavy duty. We are extremely pleased with our purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Regina Breese",
      "helpful_votes": 0,
      "publication_date": 20180309
    },
    {
      "title": "Not as good as our first purchase",
      "text": "The first time we put the cover over our golf cart, one of the pull strings broke. It still protects the golf cart, but we cannot tighten down.",
      "rating": 3.0,
      "verified": true,
      "author": "Geraldine Sinuard",
      "helpful_votes": 0,
      "publication_date": 20200612
    },
    {
      "title": "This cover is wonderful but it is very",
      "text": "This cover is wonderful but it is very, very, heavy. It is hard for one person to put on and take off by themselves. It has stood up to extremely strong winds and not blown off as our old one did.",
      "rating": 4.0,
      "verified": true,
      "author": "HappyCamper",
      "helpful_votes": 0,
      "publication_date": 20180516
    },
    {
      "title": "Five Stars",
      "text": "Very surprised at what good quality it was based on price. Very satisfied, great buy..",
      "rating": 5.0,
      "verified": true,
      "author": "Joey",
      "helpful_votes": 0,
      "publication_date": 20180613
    },
    {
      "title": "Only thing I would add to this cover is tie down grommets in the bottom for wind etc.",
      "text": "My new cover was all I expected it to be and more. Should protect my cart for years to come.water proof sun protection etc . Would recommend it to anyone looking for a cart cover.",
      "rating": 5.0,
      "verified": true,
      "author": "John McRae",
      "helpful_votes": 0,
      "publication_date": 20180512
    },
    {
      "title": "Very cheap construction",
      "text": "Very thin and not made well. It was missing buckle on one side and zipper was not sewed in very well. I sent back",
      "rating": 1.0,
      "verified": true,
      "author": "Stormie Johnette",
      "helpful_votes": 0,
      "publication_date": 20190601
    },
    {
      "title": "excellent cover",
      "text": "This is a heavy duty cover, fits perfect over our lifted yamaha cart with a back seat that sits outside all summer. It should last several years.",
      "rating": 5.0,
      "verified": true,
      "author": "Gloria Engen",
      "helpful_votes": 0,
      "publication_date": 20190829
    },
    {
      "title": "Be sure you know the correct size.",
      "text": "We ordered the wrong size and it costs more to return it than we paid. We have reordered the correct size and that is good. Now we have one that is useless to us!",
      "rating": 1.0,
      "verified": true,
      "author": "linda gordon ",
      "helpful_votes": 0,
      "publication_date": 20181029
    },
    {
      "title": "so very good quality and very heave duty",
      "text": "We were surprised how heavy this cover was. For the price we were expecting something lightweight and a little flimsy. Takes two of us to put it over the cart, so very good quality and very heave duty. Would highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Ann",
      "helpful_votes": 0,
      "publication_date": 20170325
    },
    {
      "title": "Poor quality!",
      "text": "Cover is very heavy, thought it would be more durable! We've had it for a year, fabric seems very brittle now. We were putting the cover on last week, it snagged on the corner and now has a huge hole in the cover! Does the fabric typically deteriorate after a year? Do not buy!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180508
    },
    {
      "title": "Five Stars",
      "text": "I am very pleased with this product. It is great quality at a reasonable price.",
      "rating": 5.0,
      "verified": true,
      "author": "Rob",
      "helpful_votes": 0,
      "publication_date": 20180517
    },
    {
      "title": "Great in the heat!",
      "text": "This is my go to cover. Our carts are stored outside in the Arizona heat. It holds up great to the wind and sun.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190706
    },
    {
      "title": "Five Stars",
      "text": "Product was just as described. Arrived quickly and fits very well. Only time will tell how it holds up.",
      "rating": 5.0,
      "verified": true,
      "author": "Gary",
      "helpful_votes": 0,
      "publication_date": 20140824
    },
    {
      "title": "It works great and fit is perfect",
      "text": "I have a standard golf cart with a back seat so I wasn't sure if this would be too big. It works great and fit is perfect!",
      "rating": 5.0,
      "verified": true,
      "author": "Chelsey A Langan",
      "helpful_votes": 0,
      "publication_date": 20140814
    },
    {
      "title": "Great value",
      "text": "Love it so far after about a month's use. Appears to be good quality, fits well altho its a little baggy in the back (was supposed to fit 4 passenger carts with the shorter roof line but looks to be sized to accomodate the longer, extended roof), and the zipper on the rear of the cover is handy. For $50 including shipping, its a great deal.",
      "rating": 4.0,
      "verified": true,
      "author": "Jerry",
      "helpful_votes": 0,
      "publication_date": 20140902
    },
    {
      "title": "Great quality very impressed",
      "text": "Cannot beleive the quality this is for price. Great fit. Cover entire cart. No brainer protect your cart from weather",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew Farmer",
      "helpful_votes": 0,
      "publication_date": 20170506
    },
    {
      "title": "Very nice cover",
      "text": "Very easy to put on and very well made. Doesn't go all the way to the ground on a lifted golf cart.",
      "rating": 4.0,
      "verified": true,
      "author": "Lauren M Saady",
      "helpful_votes": 0,
      "publication_date": 20170503
    },
    {
      "title": "Five Stars",
      "text": "Very tough material..... hopefully last longer than one I had",
      "rating": 5.0,
      "verified": true,
      "author": "Lee Jernigan",
      "helpful_votes": 0,
      "publication_date": 20170510
    },
    {
      "title": "best valued cart cover on the market",
      "text": "the cover fits perfectly over my 4 seater with room to spare. cover alot heavier than anticipated.moe than pleased and highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Kenneth M.",
      "helpful_votes": 2,
      "publication_date": 20140620
    },
    {
      "title": "Five Stars",
      "text": "One of the best covers I have bought for the golf cart at a great price.",
      "rating": 5.0,
      "verified": true,
      "author": "CJ",
      "helpful_votes": 0,
      "publication_date": 20140727
    },
    {
      "title": "Five Stars",
      "text": "Looks excellent, have not used it yet, will be using it for winter storage.",
      "rating": 5.0,
      "verified": true,
      "author": "Mrsclean",
      "helpful_votes": 0,
      "publication_date": 20140717
    },
    {
      "title": "Five Stars",
      "text": "Excellent quality for the price. Heavy duty, and it fit perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20140804
    },
    {
      "title": "It has been a great cover! For the reasonable price I highly recommend ...",
      "text": "It has been a great cover! For the reasonable price I highly recommend it!",
      "rating": 5.0,
      "verified": true,
      "author": "Stacy",
      "helpful_votes": 0,
      "publication_date": 20140812
    },
    {
      "title": "Five Stars",
      "text": "Tom could not believe the great quality for such a reasonable price. Happy Happy",
      "rating": 5.0,
      "verified": true,
      "author": "Bonnie Kennedy",
      "helpful_votes": 0,
      "publication_date": 20140801
    },
    {
      "title": "Very heavy duty material.",
      "text": "The material for this golf cart cover is really nice and heavy. We have a Yamaha extended top and the cover fits the cart perfectly all the way down over the tires. There is a cord at the bottom to tighten around it. This cover has withstood some pretty heavy winds without coming off. We are very pleased with this purchase and highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "jrad",
      "helpful_votes": 0,
      "publication_date": 20190112
    }
  ],
  "product_meta": {
    "title": "KHOMO GEAR Golf Cart Cover Universal - 4 Passenger - Grey",
    "description": "KHOMO GEAR Golf Cart Cover This cover uses a super high quality Polyester fabric with PVC coating. Our covers have a handy rear zipper for easy installation , rear air vents reduce wind lofting and inside moisture and a elastic hem for perfect fit.",
    "rating": 4.4,
    "feature_bullets": [
      "Fits 4 Passenger standard golf carts - 108'' x 48'' x 66''",
      "Protects your golf car from sun, weather damage and dirt",
      "Elastic hem on the bottom, reinforced grommets for snug fit, rear zipper down the center for easy access",
      "KHOMO GEAR is a registered trademark and best-seller of Outdoor Covers."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "18.1 x 12.4 x 4.7 inches; 13.75 Pounds",
      "Date First Available": "May 22, 2014",
      "Manufacturer": "KHOMO GEAR",
      "ASIN": "B00KHWJFES",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Golf",
      "Sports & Fitness",
      "Golf Cart Accessories",
      "Sports & Outdoors"
    ],
    "price": ""
  }
}