{
  "website_summaries": [
    {
      "verdict": "A nice price for most light to moderate hikes, although it lacks the space and durability of pricier packs.",
      "pros": [
        "Surprisingly spacious and high quality given its affordable price tag"
      ],
      "cons": [
        "A handful of consumers wish it offered more storage space"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "Will hold up and resist wear and tear as you traverse the world or head across campus for class.",
      "pros": [
        "A lightweight backpack you can take from land to sea and safeguard your belongings along the way",
        "Packs up tightly for easy travel",
        "We love that it looks good enough to use exploring a city just as it does in a rainforest"
      ],
      "cons": [
        "While highly durable, this backpack is not 100% waterproof"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great Backpack!",
      "text": "Great backpack. I was a little worried that it would be too small based on the video and pictures posted so I took some pictures myself. I'm very happy with the backpack, especially when you consider that it only costs $20. Material is light and flexible, but strong. I LOVE the deepness of the mesh pockets on the sides. So many other backpacks have pockets that are too shallow and don't hold. The mesh pockets also look to be pretty strong.",
      "rating": 5.0,
      "verified": true,
      "author": "D. scott",
      "helpful_votes": 153,
      "publication_date": 20151029
    },
    {
      "title": "Dynamo daypack!",
      "text": "Broke in this pack on a trip to Iceland. Held extra clothing, snacks, aluminum water bottle and iPad safely and securely through all the elements, including rain (waterproof quality was impressive and unexpected). These folks believe in their product and it shows.",
      "rating": 5.0,
      "verified": true,
      "author": "Shareworldz",
      "helpful_votes": 202,
      "publication_date": 20150409
    },
    {
      "title": "Great on a trip!",
      "text": "I bought this specifically for my Hawaii trip thinking it would be perfect for the hikes, etc. I ended up using it exclusively on the island! It is super lightweight, but once unfolded, can carry quite a bit. I honestly cannot find anything bad to say about it. I would highly recommend this to anyone who wants a packable backpack that has pockets for water and an interior zipped pocket. While I have not tested the water resistance fully, in the sporadic bouts of rain I experienced on Hawaii, all of the contents inside the backpack were kept dry.",
      "rating": 5.0,
      "verified": true,
      "author": "Ann",
      "helpful_votes": 2,
      "publication_date": 20191108
    },
    {
      "title": "It worked fine for day excursion/adventures",
      "text": "I took this bag as an extra bag for a trip to Thailand. It worked fine for day excursion/adventures. The material is soft but not padded, so unless I placed a towel or shirt before placing anything else in the bag I could feel the bag's contents shape/surface while walking (not painful, just uncomfortable if not properly arranged/packed). The bag was easy to clean (soft wet cloth) but was not water proof, just water resistant so you would need a protector over it in case you get caught in the rain. However, the fact that it was collapsible made it super convenient and the colors were true as pictured",
      "rating": 3.0,
      "verified": true,
      "author": "DianaV",
      "helpful_votes": 8,
      "publication_date": 20160628
    },
    {
      "title": "Very surprised at the quality",
      "text": "I wasn’t expecting much for the price but my mom needs a packable backpack for an upcoming African safari and since this was so inexpensive I thought I would buy one for myself so she could test it out. I had expected a backpack version of the re-usable bags that I carry in my purse; made of very thin nylon and maybe not sewn well. I was pleasantly surprised when I opened mine! The nylon is much thicker than I expected and it’s very well put together. I’m astonished that something so inexpensive is so well made! I definitely recommend this product and will be getting one for my mom.",
      "rating": 5.0,
      "verified": true,
      "author": "Feather",
      "helpful_votes": 2,
      "publication_date": 20191230
    },
    {
      "title": "the zipper started pulling apart & the pack became useless. I sent an email to HIKPRO telling them ...",
      "text": "So we purchased this small pack for a European trip in 2015 & we've used the pack w/out a problem since then. On a trip last month, the zipper started pulling apart & the pack became useless. I sent an email to HIKPRO telling them of the broken zipper. Much to my surprise, I received a quick response & HIKPRO replaced the pack at no charge!!😁I'm ecstatic that a small inexpensive pack was replaced after we've used the product for almost two years!! This is a good, small, lightweight travel pack & HIKPRO stands behind their product. I'm a big fan now!",
      "rating": 5.0,
      "verified": true,
      "author": "Chris C",
      "helpful_votes": 5,
      "publication_date": 20170802
    },
    {
      "title": "Stitches came out 1st use",
      "text": "Stitching came undone along the right-backside on the first day I used it. I only had 4.5lbs weight in it. A 1 liter water bottle and a jacket. I missed the 30 day return window. Poor quality. Try another brand",
      "rating": 1.0,
      "verified": true,
      "author": "Jeff Boyd",
      "helpful_votes": 4,
      "publication_date": 20190821
    },
    {
      "title": "Lightweight, But Difficult To Fold",
      "text": "I just received my backpack and am looking forward to using it on an international trip. I rated this 4 stars because I wish there were instructions included as to how to fold the backpack into its little carrying case. I was impressed with how quickly the company mailed my backpack. Super fast delivery. The purple color matches my suitcase, so this is a nice bonus. Also, I could easily slip my Apple laptop into the pack with room to spare. Update: Very frustrated with the water bottle holders. You can hardly fit bottles in because pockets are tight.",
      "rating": 3.0,
      "verified": true,
      "author": "zesty",
      "helpful_votes": 0,
      "publication_date": 20190716
    },
    {
      "title": "Super Great For Travel",
      "text": "My husband searched for just the right backpack for our travel. THIS one really fits the bill. Looking for a lightweight pack that can hold the gear we take, needs to be compact, not bulky, needs to fold up into itself when not in use and needs to be under $40.00. This HIKPRO fits all the criteria! We carry two water bottles, raincoats, two lightweight vests, phones, keys, glasses cases, hats and so much more, and no one's shoulders or back gets painful or sore. Happy to find just the right pack at the right price. Nice job, HIKPRO. Keep making good products that are useful!!",
      "rating": 5.0,
      "verified": true,
      "author": "readingreviewer5",
      "helpful_votes": 0,
      "publication_date": 20190803
    },
    {
      "title": "Well worth the money!!",
      "text": "This is a great backpack! I purchased this for a few reasons. First it starts out small and is folded inside of itself which is great for packing in a suitcase. Second, when opened, it’s extremely roomy but lightweight even when adding water bottles and cameras. Plus the straps are unbelievably comfortable and are adjustable as well! There are elastic mesh slots on each side to hold water bottles as well as a small section with a zipper. I didn’t encounter any rain on my trip so I can’t say how it would hold up bit since it’s nylon, I can only assume it’s water resistant not definitely not waterproof.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Cartee",
      "helpful_votes": 0,
      "publication_date": 20191008
    },
    {
      "title": "Excellent travel, Day hike bag",
      "text": "I own three of these Hikpro backpacks. I received my first as a gift, and then purchased two more for my daughters. I love how lightweight and compact they are. Easily stuffs back into the small pouch, making it ideal to take along as an extra bag on a trip. The straps are very comfortable on my shoulders, and for my kids also. I like the two water bottle pouches, and the multiple zippered compartments. Colors are vibrant. I haven't really tested any of our packs in heavy rain, so I can't speak to how waterproof they are. This is my go-to personal item for airline travel as well as my favorite backpack for day hikes, or school field trips.",
      "rating": 5.0,
      "verified": true,
      "author": "christine bender",
      "helpful_votes": 0,
      "publication_date": 20190604
    },
    {
      "title": "One For Everyone",
      "text": "Last year I received one of these daypacks as a gift. It was perfect for the type of travelling we do. From a small, folded up \"pocket\" came good-size hiking pack. Great for carrying water bottles, snacks, rain jacket, camera, etc. Plus the zippered pouch inside was useful also for special items. When the day was through, it folded back up to it's small pocket and fit right into purse or suitcase. This year we are taking our grandson to Yellowstone, and before I started getting things ready for packing, I ordered both Granddad and Grandson their own day packs. Quality and price are right. Looking forward to our trip.",
      "rating": 5.0,
      "verified": true,
      "author": "NYC73",
      "helpful_votes": 0,
      "publication_date": 20190713
    },
    {
      "title": "Great folding backpack.",
      "text": "Very compact design. Love that it folds up into a small package yet unfolded it’s a very handy size. I will use it on my upcoming trip to carry my slr camera and miscellaneous other stuff. Seems quite durable but I haven’t had it long enough yet to field test it. I looked at an osprey small back pack and it was $100 while this was $16. I’m not sure that I would get six times the value from the more expensive one. Plus this one has a five year warranty. The company is concerned that you like their product and say to contact them if there is a problem. Some companies are buy it and forget about you attitude.",
      "rating": 5.0,
      "verified": true,
      "author": "Alan Sohn",
      "helpful_votes": 0,
      "publication_date": 20181104
    },
    {
      "title": "perfect for light travel",
      "text": "We used this packable daypack for a recent trip overseas and it was exactly what we needed it to be. We stored granola bars, tissues and other small items in the front pocket. We were able to store 16oz water bottles in the side pockets without issue. The main compartment was surprisingly roomy and able to store both our puffy jackets (one of them in a compression bag) along with a few other smaller items. It's also very easy to stuff back into the pouch without having to fold it in any specif way. I'm not sure how it would stand up to carrying anything with real heft but for our purposes, it was perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "jdub19",
      "helpful_votes": 0,
      "publication_date": 20191204
    },
    {
      "title": "Great value! Durable so far",
      "text": "I got this for day hikes. I can fit all 10 essentials in it (map and compass not pictured), as well as extra clothes and misc other items. I actually had a packable down throw in this bag as well. While it isn't uncomfortable to wear, I might add a cross-body strap to help with weight distribution. The water bottle holders aren't big enough for a nalgene, but they're big enough for something smaller, like a 16 or 20 oz bottle. Because it's so minimalist, you need to be well-organized to keep it packed well and find things easily. I definitely recommend this bag! For the cost, you can't go wrong.",
      "rating": 5.0,
      "verified": true,
      "author": "Becky Holston",
      "helpful_votes": 0,
      "publication_date": 20180902
    },
    {
      "title": "Small but Durable",
      "text": "I bought three of these to assemble our 72-hour \"Grab and Go\" emergency packs. They are a bit undersized, but work for my needs. Anything larger would hold more, but it would also be heavier, which might make it difficult to transport in an emergency. These seem to be durable enough--I would have preferred metal zippers instead of plastic ones--but it works fine. The little built-in inside zipper pouch that the backpack is made to fit inside, is just the right size to put a little extra cash and copies of IDs, or an emergency supply of prescription meds.",
      "rating": 4.0,
      "verified": true,
      "author": "Retired Bookworm",
      "helpful_votes": 3,
      "publication_date": 20161112
    },
    {
      "title": "Light and Perfect for hiking!",
      "text": "We take a few hour hikes at a time with our dog. This is light, well-made, and conveniently folds up very compact if not being used. We like the loops on the outside of the backpack to easily connect and disconnect a portable dog bowl during the hike. Will purchase this again, so we have a backpack for each of our trips - quick day bag, hiking, and for stuff my wife needs to take when she volunteers at the nearby hospital. It doesn't have the cushion/protection for a laptop - this is a nice light, well-made bag to hold the essentials on a hike or few day trip!",
      "rating": 5.0,
      "verified": true,
      "author": "Changeagentnow",
      "helpful_votes": 0,
      "publication_date": 20191123
    },
    {
      "title": "Great bag for cruises",
      "text": "I bought two bags, purple and navy blue. The colors were true to the pictures on the website. These are super light. I purchased them to take on a cruise. You can fit 3 cruise beach towels, sunblock, cellphone and sunglasses. We used the bags for all 3 excursions at the beach. Each time we had rain passing by. All the items inside the bag remained dry. I am very happy with my purchase. Even my husband said: \"good call on getting these bags\". The next time we go on a cruise, these are coming with us again, I may get two more for the kids to carry their own stuff :-)",
      "rating": 5.0,
      "verified": true,
      "author": "amazon user",
      "helpful_votes": 0,
      "publication_date": 20200129
    },
    {
      "title": "Excellent Backpack.  Great quality.",
      "text": "Love this little backpack! I bought it to use for a few days at a theme park. Very lightweight and of great quality. The two little side pockets were perfect for a water bottle and my sunscreen. The inner zippered pocket and the outer zippered pocket were perfectly sized to hold little items you wanted easy access to. For a smaller bag it ended up holding a lot of stuff. I don't know how waterproof it is as I was lucky enough to use it during some absolutely glorious Florida weather. I am so impressed with this backpack!",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle A. Bazin",
      "helpful_votes": 0,
      "publication_date": 20190928
    },
    {
      "title": "Well made and lightweight-- GREAT PRICE",
      "text": "I just received my Hikpro backpack. Since I sew a lot, I wanted to look for any imperfections or weak spots in the stitching. I found none, BUT I did find where every seam is reinforced with reinforcing nylon ribbon. And the stress points on the straps were double stitched. If I were sewing a backpack, that's exactly how I'd do it. I was very impressed with the design. It has tons of room and is extremely lightweight. I 'd recommend this backpack to anyone. And it was a great deal!!!",
      "rating": 5.0,
      "verified": true,
      "author": "David McQueen",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "Great day pack!",
      "text": "I used this today for the first time when taking my grandsons to the park for the day. It is true to its description in that it is so light weight and roomy! The only weight is what you put in it. Great interior pocket that doubles as the pouch it packs into itself. Two very spacious zippered pockets to pack an ample amount of daily needs for an all day outing. Two great elasticized water pockets on the sides and extremely comfortable shoulder straps for carrying. I will definitely be purchasing more of these, one for each of my daughters and for the price, they will make great gifts! I am very pleased with this purchase!!",
      "rating": 5.0,
      "verified": true,
      "author": "Loveamazon",
      "helpful_votes": 0,
      "publication_date": 20180811
    },
    {
      "title": "The red color faded onto my shirt.",
      "text": "I did not like the back pack, the red color faded onto my shirt during my long hot and sweaty 9+ mile hike. The material on the inside of the pack peeled. Although it was super light weight which was great. I wondered if this was a fluke, as I did not see this complaint when I read the reviews. The purchase and return process was flawless. I received it in two days as promised and had a problem free return process.",
      "rating": 2.0,
      "verified": true,
      "author": "Joy",
      "helpful_votes": 3,
      "publication_date": 20180423
    },
    {
      "title": "Light weight and ready to travel.",
      "text": "As travelers in our own small airplane we needed backpacks and \"luggage\" that are small, very light and durable. With a total of 100 pounds for camping equipment, food, cloths and emergency supplies it is essential to have luggage that will fit the need. this product line works really well. Added advantage is that it will MOLD to the space allowing for better packing of item behind the seat. A really good value and item. We purchased 2 backpacks and 2 30L bags. More than enough space for even the bulky items.",
      "rating": 5.0,
      "verified": true,
      "author": "Kenneth B Brown",
      "helpful_votes": 0,
      "publication_date": 20190614
    },
    {
      "title": "Just What I Needed for Travel",
      "text": "I used HIKPRO 20l for a plane trip, and it was a great size for me, because I'm not able to carry much weight. It fit very easily in the overhead bins. I appreciated the zippered compartments and used the water bottle holders on the sides. The straps were comfortable on my shoulders. The cost was reasonable. It was exactly what I expected and served me well.",
      "rating": 5.0,
      "verified": true,
      "author": "Sheila B.",
      "helpful_votes": 0,
      "publication_date": 20190803
    },
    {
      "title": "Good luck trying to carry a water bottle.",
      "text": "Light weight and well seen seams. That's the good. But more than outweighed by the bad. Terrible water bottle storage. You can not reach a water bottle while wearing the backpack. And you cannot put the backpack on without the water bottle falling out of the backpack. If you don't have a hiking partner traveling with you, you are forced to hand carry your water bottle. This totally defeats the purpose of having a backpack in the first place. This product needs a major redesign.",
      "rating": 2.0,
      "verified": true,
      "author": "Dr. Dan",
      "helpful_votes": 0,
      "publication_date": 20180724
    },
    {
      "title": "Sturdy / Useful Bag",
      "text": "Well made product. Useful pockets. Nice material. Large when packed full, small when zipped empty. Gonna see a lotta use during our Grandson's 2019 youth league baseball season. With any luck, we'll get thru all the games alive & with a bunch o'wins. And no dickering among the overly hopeful parents / grandparents. Yeah...right. Once some moron Father realizes his kid won't be starting shortstop, he'll be raising hell. Anyway...Good Bag at a decent price. I'd buy it again.",
      "rating": 4.0,
      "verified": true,
      "author": "Tombo33",
      "helpful_votes": 0,
      "publication_date": 20190314
    },
    {
      "title": "Perfect for my daily hikes",
      "text": "I've been using a hydrating pack and I couldn't fit everything into it so I had to use a waist pouch and it was uncomfortable. I hike often with my dog and this pack if perfect for both his and my water bottles - the pack has a pouch on each side. It has zippered pouches on the inside and the outside where my phone, keys, towel, water bowl and protein bars all fit perfectly. The pack itself is incredibly light and actually came folded up in this small little pouch that is attached. Absolutely perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Philly",
      "helpful_votes": 0,
      "publication_date": 20190528
    },
    {
      "title": "Nice Back Pack",
      "text": "Specs: 18 inches tall, 12 inches wide, 5.5 inches deep, 6.5 ounces heavy So far, I've used this pack for three day hikes in the Lincoln National Forest. I had two water bottles, snacks, a first aid kit, small field glass, a trail guide-map, and accessories for my camera. Everything packed into the bag well, and the pack sat comfortably high on my back, snug and square with no bouncing. I never had fatigued shoulders! Also, I did manage to get the bag back into its pouch, which is an accomplishment for me: I'm usually not good at repacking such things ... All my rain slicks are free-range once I unpack them. A good backpack for short, daily walks.",
      "rating": 4.0,
      "verified": true,
      "author": "Josh H. Knight",
      "helpful_votes": 2,
      "publication_date": 20160613
    },
    {
      "title": "A splendid example of the genre",
      "text": "What are we looking for in a durable, lightweight backpack? Durability? Yes! Lightweight? Yes! Packable? Yes! Oh, and let's add \"water resistant\"! This little backpack has it all and I bought a second one after the first one was eaten by a bear. But that's another story.....",
      "rating": 5.0,
      "verified": true,
      "author": "Nick Morgan",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "Really impressed!",
      "text": "Wasn't expecting much out of this bag, but after taking it on a few hikes with the dog and into the city, I can say I'm impressed. Holds a lot of stuff (including two water bottles), repels light rain and is small enough to make travel easy. It's the best $16 you'll spend on a backpack.",
      "rating": 5.0,
      "verified": true,
      "author": "The Bookster",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "Great hiking backpack",
      "text": "I do a lot of hiking in the rough terrain around Tucson, Arizona and this is a great pack. It is lightweight and comfortable. The material is very durable, especially against all the things that can stick or tear clothing in the desert. The shoulder straps are wide and padded for comfort and security. The pocket used to fold it \"inside itself\" works as a great place for keys, wallet, or other valuable items, hidden inside the pack. The pockets for water bottles are deep, and while that does hold them securely, it causes a little extra effort to get a drink. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Connie McIntyre",
      "helpful_votes": 0,
      "publication_date": 20190424
    },
    {
      "title": "Great Daypack!!!",
      "text": "I took this backpack on a number of day trips. It is light weight and comfortable to wear! It did not rain, so I cannot speak to the water permeability issue. I loved it being so lightweight! It is much better than the average backpack! Thank you for providing good product information on the weight! Shoulder straps adequately padded, as I carried 6 water bottles plus our lunch, without any discomfort. The zipper works well! It also foldable into it’s own packable, pack (about a 5” square).",
      "rating": 5.0,
      "verified": true,
      "author": "SummerDays",
      "helpful_votes": 0,
      "publication_date": 20181120
    },
    {
      "title": "Great backpack!!",
      "text": "I purchased this lovely backpack for a WDW trip. This backpack is awesome. Great color, durable, spaceship, and I never felt like my back was weighed down. I love how you can fold it back up for quick storage. Once the trip was over (:O( ), I took everything out, folded it up, and tucked it away back into my suitcase. I love the side pockets and ample space inside. It's also washable (air dry). Great buy! I highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Blessedmomof3",
      "helpful_votes": 0,
      "publication_date": 20180823
    },
    {
      "title": "Compact, strong, comfortable backpack",
      "text": "We bought a pair of this backpack to bring to our week long Orlando theme park hopping trip. The 2 backpacks are very light but big enough to fit ponchos, change of t-shirts for the 4 of us, flip flops, my camera, and water bottles. It’s about the same size as a standard jansport backpack. The best part is that it folds up to roughly around 4” x 4”. The 2 sockets on each side can fit a standard water bottle, the pouch inside can keep your wallet/car keys safe. The only downside is it’s a bit warm on the back and you can feel the objects on your back. But overall satisfield with the backpacks.",
      "rating": 5.0,
      "verified": true,
      "author": "Rangga A",
      "helpful_votes": 0,
      "publication_date": 20180907
    },
    {
      "title": "Light and comfortable backpack",
      "text": "Love the straps which start near the middle and this works for me as I've got relatively narrow shoulders. The water bottle holders are strong and have enough depth that the water bottles stay in. The bag folds back into the internal zipper pocket. Only complaint: I would probably opt for a bag that has at least one more zipper pocket either on outside or inside, or a velcro extra pocket on the inside to separate items more.",
      "rating": 4.0,
      "verified": true,
      "author": "elewis",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "Ripped after a month",
      "text": "When I first got it I thought it was perfect. It’s cute and lightweight but unfortunately after a month of moderate use there is a thread that’s coming out by the zipper which results in a broken product. I’m very disappointed. I had a similar bag from a different brand in the past and it lasted a couple of years with much more abuse than this one. I don’t recommend this brand.",
      "rating": 2.0,
      "verified": true,
      "author": "Elizabeth Tarakhovskaya",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "THERE",
      "text": "As one who travels a lot, I thought this would be a great idea to use instead of a purse when flying. I actually now have recommended this bag to many of my friends who travel now as well! I bought the smaller and realized it was big enough for all incidentals. It was great! It provides more room than a purse and leaves me hands free. It's big enough to carry some snacks too. It weighs so little, and it is so practical. I can actually carry a small bag in it for when I reach my destination =)",
      "rating": 5.0,
      "verified": true,
      "author": "Diva",
      "helpful_votes": 0,
      "publication_date": 20181224
    },
    {
      "title": "Totally Awesome!",
      "text": "Awesome! I needed a backpack that could take more then a light walk in the woods and I decided to take the chance of this one making it through some rather rugged hikes and it did! I hiked May Lake and then down to Rasin Lake one day and Glacier Point in Yosemite another day. My final hike, and most concerning one, Mt. St. Helens in Washington and it came through without a scratch! I'll tell you Mt. St Helens is a rocky and sandy mess and this back pack did the tango with some of those rocks. I am really surprised it made it through with no damage what so ever.",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole Tibbe",
      "helpful_votes": 4,
      "publication_date": 20150918
    },
    {
      "title": "Love it!",
      "text": "I love this bag because it's super lightweight and folds up to a very small size. I packed it easily in my carry-on luggage and then took it out to use for an entire week in Disney. This was convenient and comfortable for storing our water bottles and rain jackets, but also fit in the small spaces in each ride. I didn't notice any wear or tearing of the bag after heavy use during the trip. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew",
      "helpful_votes": 0,
      "publication_date": 20200201
    },
    {
      "title": "Great quality product at a very good price",
      "text": "This product appears to be well made and has a great appearance. Light weight with plenty of pockets and good deep water bottle pockets on both sides. Size is good for day packing of average tourist activities and while I got it for me (adult/male), it would be quite suitable for my 5'3\" spouse or kids say 9/10 & up. Seams and pockets are well sewn and the shoulder straps are quite comfortable. Can't wait to use it on our upcoming vacation to multiple national parks and monuments in the midwest and Montana.",
      "rating": 5.0,
      "verified": true,
      "author": "lbt",
      "helpful_votes": 0,
      "publication_date": 20190527
    },
    {
      "title": "Great for Traveling and it Holds a Lot",
      "text": "I was looking for a light and durable backpack that could hold a good amount of whatever I need to carry. Also wanted wide shoulder straps that don't dig into your shoulders, have water bottle pockets, and is water resistant. This backpack fulfilled it all. And it travels well as the folded up pack measures 6.5\" x 6.5\". I just returned from Hawaii where I took the backpack to the beach with a towel and essentials, used it to take Pickleball paddles, balls, and water to the courts, and used it to hold cameras and a towel on whale watches and hiking. I'm glad I purchased this backpack.",
      "rating": 5.0,
      "verified": true,
      "author": "James P. Johnson",
      "helpful_votes": 0,
      "publication_date": 20200223
    },
    {
      "title": "Great product",
      "text": "This is a lightweight good quality pack. The color is as vibrant as expected. The pockets are helpful. It holds my 24 oz water bottle beautifully. My only complaint is that the strap falls so that if I’m walking or hiking in a tank top, it chaffs.",
      "rating": 4.0,
      "verified": true,
      "author": "book house",
      "helpful_votes": 0,
      "publication_date": 20190831
    },
    {
      "title": "Compact Add on to My Travel Arsenal",
      "text": "Great pack to throw in for my trips. I travel a lot...typically with a large computer bag and high end luggage/rollaway. For those days when I can slide out of the meeting early and take a quick hike or tour around town, I don't want to use my computer bag as a day-pack. This one folds up small and I can just toss it in with my luggage without adding more than a few ounces and fist size ball (ok,a large fist) to my gear. I use it to carry gloves, hats, jackets, snacks, water bottle....etc. Any of those items you might want on a day-hike or a walk around. A highly recommended extra.",
      "rating": 5.0,
      "verified": true,
      "author": "T. Norton",
      "helpful_votes": 0,
      "publication_date": 20181102
    },
    {
      "title": "great lightweight backpack",
      "text": "Served me well for a 2 1/2 week trip to Singapore and Nepal. Held everything I wanted close at hand for long airplane rides. Served as my backpack for touring the cities. Held spare clothes back at the hotel when I departed on my trek. Used a larger 28 liter internal frame pack for the actual trek. Love its lightweight and good carrying capacity. Held large water bottles securely and still felt light on my shoulders.",
      "rating": 5.0,
      "verified": true,
      "author": "bluewindharper",
      "helpful_votes": 0,
      "publication_date": 20190225
    },
    {
      "title": "Compact but holds a lot",
      "text": "I love this backpack. It folds down to fit inside a self-case, but when open it's the perfect size for a daypack. It's lightweight but appears strong; that is, I've used it a few times so far and have place substantial items inside such as a hardcover book and full water bottle, and no signs of tearing. I can't comment on water resistance as I've not taken it out in the rain yet.",
      "rating": 5.0,
      "verified": true,
      "author": "FD",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "Great lightweight backpack",
      "text": "I got this backpack to use when hiking. I have taken it on two camping trips so far and have had no issues. It is not waterproof though. It rained one day and everything inside was wet, however I always put things in my bags in waterproof containment..so this wasn't really an issue for me. It is compact and easy to make smaller than it actually already is. I am happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "GeekyDia",
      "helpful_votes": 0,
      "publication_date": 20200821
    },
    {
      "title": "Split seam on 2nd day of use!",
      "text": "Loved the bag but seam split at top of bag second day of use at Disney! We like a replacement bag from Hikpro.",
      "rating": 1.0,
      "verified": true,
      "author": "Frances L Raynes",
      "helpful_votes": 4,
      "publication_date": 20190825
    },
    {
      "title": "Perfect for a Day Hike",
      "text": "We recently bought a camper and I needed something to take a few necessities with me when we do some light hiking around the State Parks we are visiting this summer. This is perfect as it folds into itself and is super lightweight. it holds all I need bug spray water bottles binoculars snacks and other items for my kids. the straps are nice and wide. I am excited about all the places it will go this summer.",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy L. Garner",
      "helpful_votes": 0,
      "publication_date": 20200615
    },
    {
      "title": "Perfect backpack for Disney",
      "text": "Purchased this backpack for our most recent trip to Disney World. Needed a pack that was lightweight & waterproof. It was perfect for long days at the parks. The should straps are comfortable and it it easy to take on & off quickly to get onto rides. Everything in it stayed dry even after it was soaked from Splash Mountain! Loved having the water bottle pockets on the sides. Would definitely purchase another one in the future.",
      "rating": 5.0,
      "verified": true,
      "author": "Sheri S",
      "helpful_votes": 0,
      "publication_date": 20190403
    },
    {
      "title": "Well made, just what I was looking for",
      "text": "This little backpack is perfect. Although the shoulder straps aren't very well padded, they are constructed so as to be very comfortable. The stitching appears to be well done. It fits a 12 oz Hydroflask in the water bottle pocket. I was after something to take to the beach, go shopping or on a day hike. This fits the bill.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas A Garbacik",
      "helpful_votes": 0,
      "publication_date": 20190301
    },
    {
      "title": "Great Lightweight Day Pack",
      "text": "This is a terrific, well made, basic day pack. I bought one for myself, one for a friend, and 2 for my kids. The pouch zippers work effortlessly, versus some other cheap packs. It is very light, but the material is strong and repels water. Perfect for light duty hauling of smaller, lighter items when you don't need the extra heft and weight to carry bulkier, heavier things that would require padding. I just used mine on a 2.5 week vacation trip and I was very happy with it. I highly recommend this lightweight day pack.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim",
      "helpful_votes": 0,
      "publication_date": 20180826
    },
    {
      "title": "Small bag.",
      "text": "In the words of ZOOLANDER...It's a nice bag for ants!😏 Yep, it's small. I was tryna save money, but this bag is for a little kid staying one night at Grandma's and not for a proper GO BAG. I will use it for crochet projects.",
      "rating": 3.0,
      "verified": true,
      "author": "Annie's Corner",
      "helpful_votes": 0,
      "publication_date": 20200605
    },
    {
      "title": "Absolutely Love these backpacks!",
      "text": "I bought one of these backpacks last year. It is perfect for day hikes. It weighs almost nothing and is rugged and durable. I pack it in the suitcase when traveling as it takes up hardly any room. My two young grandsons always want to borrow it for school excursions and to carry their things when spending the weekend or overnights with friends or relatives. So I decided to get both of them one of their own. Everyone thinks they are perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Ramsey",
      "helpful_votes": 0,
      "publication_date": 20181120
    },
    {
      "title": "Nice backpack",
      "text": "This is a great backpack for running around town. I use it to carry extra clothes, towels, snacks, and water bottles. It is lightweight and not too cumbersome to carry. I wouldn’t use it to carry heavy duty things because the material is pretty lightweight. It’s a great overall backpack for the things I need it for.",
      "rating": 5.0,
      "verified": true,
      "author": "HValentine",
      "helpful_votes": 0,
      "publication_date": 20190727
    },
    {
      "title": "Great backpack",
      "text": "I purchased this bag to use for a 7 day trip to Costa Rica over the holiday. It came folded like a pouch. Very pretty purple color. The bag has a zippered pocket on the inside and one on the outside. It also has one pocket on each side. (not zippered). It rained every day in LaFortuna and I used this backpack for my coffee tour and a trip to the hot springs. On my return trip, I was able to pack a few things inside and used it as my personal item on the plane. it's extremely lightweight and I will definitely use this backpack for multiple trips",
      "rating": 5.0,
      "verified": true,
      "author": "kim gordon",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "So far, its great!",
      "text": "Purchased this backpack as a replacement bag since our kids are now older and we don't need a diaper bag anymore, but still need something to carry a change of clothes for our youngest and snacks etc. Basically, I was looking for something that would be light, carry a decent amount and be able to stand up to daily use. So far, so good. Its lightweight, but with enough pockets etc for me to feel like I have a place to stick keys and smaller items that I dont want to have to dig for, and it seems well made and works for both my hubby or I to carry. So far, I recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Alisa Crosson",
      "helpful_votes": 0,
      "publication_date": 20181112
    },
    {
      "title": "Form, function and perfect lifestyle fit",
      "text": "I can’t believe how much I love this product. It’s so much lighter and more functional than even the description led me to expect. The design is perfect for my 12-15-mile GirlTrek needs. And I no longer feel as if so have a cinderblock on my back! Also, it breathes so I’m not sweaty.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa Suhay",
      "helpful_votes": 0,
      "publication_date": 20200207
    },
    {
      "title": "Exactly what I needed",
      "text": "Love how this folds up so small, yet opens to be big enough to carry my DSLR case with camera and extra lens and still has room for more. Material feels sturdy, too. Can't wait to try it out on my trip next month. I am only taking a carry-on another backpack with this one in it. If I buy gifts I can always check my carry-on, use my larger backpack as a carry-on and this as a backpack. Hoping it works well on local trip so can take it to Europe for 16 days!",
      "rating": 5.0,
      "verified": true,
      "author": "Janmader",
      "helpful_votes": 0,
      "publication_date": 20190125
    },
    {
      "title": "Small bag with a sturdy outer layer!",
      "text": "I love this backpack, heading to Singapore but wanted to try the bag out before getting there to find out it is useless, so I unpacked the bag and it was amazing! I packed four shirts, a pair of jogging pants, undies, water shoes, 2 pairs of socks, my 5 cords, my cell phone, my tablet, a water bottle, a bag of M&M's (don't judge) and my keys and still had room. Im 5'2 and 118 perfect bag for me love this bag!",
      "rating": 5.0,
      "verified": true,
      "author": "Lala",
      "helpful_votes": 0,
      "publication_date": 20181011
    },
    {
      "title": "Durable, lightweight, good quality",
      "text": "This is a quality backpack. I took it with me on a trip and it was easy to pack, lightweight and waterproof. The connected pouch it folds into makes a great zippered pocket when using it as a backpack and there's an additional pocket on the front. The color was exactly as pictured and I found the backpack to be comfortable when carrying for a few hours.",
      "rating": 5.0,
      "verified": true,
      "author": "CJ",
      "helpful_votes": 0,
      "publication_date": 20200517
    },
    {
      "title": "Looks good!",
      "text": "Just got this in and have not had a chance to use for intended purpose yet...our Mardi Gras trip to Disney World. I'll be sure to report back afterwards. Color is great, pack seems small but I'm used to bringing in much bigger packs. I'm trying to avoid the bigger bags/multiple compartments with reports of increased Disney security taking longer to move through bag check lines. This bag seems perfect for that. One big compartment and only two other zippers to open. One small on inside, and one on outside front. Hopeful bag holds up as it seems thin. We shall see.",
      "rating": 4.0,
      "verified": true,
      "author": "Rebecca R. Adams",
      "helpful_votes": 0,
      "publication_date": 20170104
    },
    {
      "title": "Awesome day pack",
      "text": "This is my second Hikpro, purchased after I wore my first one out ... and it took years for me to do so because it's so sturdy! This is an awesome piece. I love that I can throw it into my suitcase because it takes no space at all ... but it holds so much when opened up. It's sturdy, comes in great colors, and holds a good amount of stuff.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Daisley",
      "helpful_votes": 0,
      "publication_date": 20191111
    },
    {
      "title": "Bought for a Trip",
      "text": "Got two of these for a trip to Florida where we anticipated we'd be doing a lot of sightseeing but didn't want to bring actual backpacks. A lot more durable than they appear, they really do go into a compact form which was amazing for packing them for the flight. And pretty water resistant as we used them not only walking through nature reserves, but also during a 5-hour kayaking expedition so they do work pretty well and will definitely keep this as travel staples.",
      "rating": 4.0,
      "verified": true,
      "author": "Nathan Westerberg",
      "helpful_votes": 0,
      "publication_date": 20190521
    },
    {
      "title": "Awesome LIghtweight Pack",
      "text": "This backpack is even more portable than I thought it would be. It comes folded up in a tiny pouch. Unfold and the pouch is a pocket in the pack. Very cool! The fabric seems good and the seams seem solid. I'll post an update on how it works in use. For now, this is exactly what I needed for an excursion bag for a 2 month tour on a ship. This would be a great bag to have on hand for when you end up needing extra packing space.",
      "rating": 5.0,
      "verified": true,
      "author": "Teresa M",
      "helpful_votes": 0,
      "publication_date": 20180814
    },
    {
      "title": "5 Stars All Around",
      "text": "This is a GREAT compact backpack. Durable, easy to pack, and can hold quite a lot. I ordered this for a vacation where we would be spending time in some National Parks and needed a small backpack to hold water, snacks, maps, etc. for some half day hikes. This backpack worked beyond great! It also takes up virtually no space in your suitcase, another bonus! I ordered another very popular compact backpack and it didn't even compare to how sturdy and spacious this product is. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "L. Waters",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "Great compact backpack",
      "text": "Very compact, plenty of space for bulky items but compartmentalized enough to be able to separate smaller items in separate pockets. Folds into itself for easy storage. My only complaint is that the side pockets are not wide enough to hold my 1L Nalgene, but I have a smaller thermal water bottle that fits just fine. Great for carry-on luggage, as a day-pack for hiking/biking, even as a pack for running; despite the lack of a cross-strap it stays pretty snug to your upper back during more physical activities. Very satisfied!",
      "rating": 5.0,
      "verified": true,
      "author": "MS",
      "helpful_votes": 0,
      "publication_date": 20180708
    },
    {
      "title": "Fantastic value!",
      "text": "This is a very nice, lightweight pack for carrying things you might need on your vacation in the city. I purchased mine for visiting art galleries. I can pack a raincoat, sunglasses, readers, phone, tablet, sketch box, all in a pack that is light as a feather. The quality is very good. Sturdy zippers and good straps. Happy it comes in so many nice colors!",
      "rating": 5.0,
      "verified": true,
      "author": "NoSheep",
      "helpful_votes": 0,
      "publication_date": 20190314
    },
    {
      "title": "Lightweight and Efficient",
      "text": "When the backpack arrived, it appeared small and I was a little nervous. Turns out, this little backpack proved to be quite efficient. I took it to Epcot (on a rainy day) and it worked great. Able to stuff this thing with alot of gift items and necessities. It's very lightweight and stored easily on the rides. Plan on using this backpack alot more this year. For the price and what I'm looking for it works great. I have only had it for a few weeks, so as far as longevity I cant comment on just yet.",
      "rating": 5.0,
      "verified": true,
      "author": "B. J. Borsellino",
      "helpful_votes": 0,
      "publication_date": 20190428
    },
    {
      "title": "Best daypack you will ever buy!!",
      "text": "This is the best day pack you will ever own. I have had mine for years and it’s been to Europe, Costa Rica, Belize and every weekend excursion! It packs small and is very light. The side mesh can hold a water bottle or your glasses or cell phone . Great pocket in front and inside . Great sturdy material that dries fast and wipes clean. I really can’t say enough about it! Just bought one for my son to bring to Montana!",
      "rating": 5.0,
      "verified": true,
      "author": "Teresa",
      "helpful_votes": 0,
      "publication_date": 20190801
    },
    {
      "title": "Great little backpack for traveling",
      "text": "I really liked the fact that it scrunched up into such a small package. I took it with me when traveling to Vietnam during the rainy season, and it was perfect to hold things I wanted to keep dry, and to hold knick-nacks that I bought on my travels, then I was able to easily scrunch it back up and pack it to take back home.",
      "rating": 5.0,
      "verified": true,
      "author": "Peter Koziar",
      "helpful_votes": 0,
      "publication_date": 20191117
    },
    {
      "title": "GREAT LITTLE BAG",
      "text": "I needed a stuff-able, light-weight day bag. I did a lot of searching before buying this bag. It was inexpensive and had everything I needed in a day bag. It is well made, sturdy, has good solid zippers and it is holding up beautifully. I use it constantly, and it has handled everything I have thrown at it. Travel, camping, hikes, or trips to the grocery, Couldn't be happier.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190330
    },
    {
      "title": "I love this pack!",
      "text": "I bought this specifically to use while hiking because I can't stand to carry my water bottle. It came in a little zip pouch and opens up into a backpack. The zip pouch then doubles as an inside zip pocket! I use this to hold my ID and portable phone charger, you know, just in case! Overall, it's a lightweight pack and the side water bottle pockets make it super easy to reach my arm around and grab it and slip it back in when I'm finished. I love this bag!",
      "rating": 5.0,
      "verified": true,
      "author": "Jaimie",
      "helpful_votes": 0,
      "publication_date": 20200421
    },
    {
      "title": "Durable built to last",
      "text": "Just received it. Material looks like it will last us a while. Looks a little small on me 5'8\" but i don't care it'll work for walking around town. Has one compartment in the front and the bag that you fold it into becomes the second compartment in the main pocket. The water bottle holders both fit my 24 oz water bottle so i can carry two. The shoulder straps have an anti sweat material too. Pretty easy to fold up, and is about 6x6x2\" just like picture.",
      "rating": 5.0,
      "verified": true,
      "author": "Kashif Rizvi",
      "helpful_votes": 0,
      "publication_date": 20190610
    },
    {
      "title": "A very practical backpack you can pack!",
      "text": "This backpack met my needs during hikes and long walks during my recent trip to Colombia. I was able to carry a medium-sized camera in its case, a jacket, lunch, small umbrella, an iPad and more. My water bottle fit perfectly in an outside pocket and didn’t fall out. It was very comfortable for a light-weight backpack. It’s made well and takes up hardly any space when stuffed into its own pocket. It’s an incredible value at a terrific price!",
      "rating": 5.0,
      "verified": true,
      "author": "Suzanne",
      "helpful_votes": 0,
      "publication_date": 20190219
    },
    {
      "title": "Perfect for travel!",
      "text": "My son and I traveled to Europe recently. We were trying to pack minimally so we each purchased one of these to use while we were out and about and to have as a personal item for travel on the way home. The fact that they could be condensed into a small ball to pack in my tiny suitcase was what drew me to it initially. The backpacks are lightweight and sturdy. The seams/zippers/etc. are well made. There were multiple zippered compartments, which was an added plus! I would definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "sweetsheryl",
      "helpful_votes": 0,
      "publication_date": 20191112
    },
    {
      "title": "My daily bag",
      "text": "This is the second one I have purchased after running the first one to the ground. I should say the first one lasted a really long time and took lots of abuse before I had to get a new one. The size is perfect for daily use for belongings. Love the durability and simpleness. Weatherproofing is also a great plus. Would definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew Harding",
      "helpful_votes": 0,
      "publication_date": 20190405
    },
    {
      "title": "Light durable and bright!",
      "text": "Things I LOVE about this pack. I ordered the orange one for visibility in the woods and it’s such a bright vibrant color. I didn’t realize that it folded into itself, so bonus there. Will be great for myself or my tween son to carry, with all our stuff for the hike. Water proof definitely needed and the material feels nice and durable. Looking forward all the fun we’ll have.",
      "rating": 5.0,
      "verified": true,
      "author": "Tammy",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Great backpack for day hikes",
      "text": "I took this backpack to Guatemala and used it daily. I hiked an active volcano, kayaked across lake Aitalan, and hiked El Rostro Maya. The backpack was easy to pack in my suitcase and was very lightweight. It got a little wet on the outside but my things stayed dry on the inside. The pockets were great and I loved the reinforced bottom. My hiking poles, jacket, water bottle, glasses, wallet, sunscreen, and snacks easily fit in this backpack.",
      "rating": 5.0,
      "verified": true,
      "author": "Buz",
      "helpful_votes": 0,
      "publication_date": 20200217
    },
    {
      "title": "Exactly what i was looking for",
      "text": "Arrived very compact in its own storage bag, which then becomes an inside pocket. Easy to get out of pouch and fairly simple to put back in. Appears to be well made. love the deep pouches on side, love the size. Can’t wait to use it.",
      "rating": 5.0,
      "verified": true,
      "author": "marleycat",
      "helpful_votes": 0,
      "publication_date": 20190301
    },
    {
      "title": "Challenge yourself at Disneyland and see why it has 0 wait time",
      "text": "I love to take this backpack to disneyland. My original plan was to take it for hiking, but I love Disney more. I like that I can carry my disneyland must haves, and I don’t suffer carrying some heavy backpack. I use this to carry my things and my fiancé’s things. This backpack must, especially if you’re a annual pass member! If you have kids, I would probably recommend a bigger one because kids need a lot more things than two adults.",
      "rating": 5.0,
      "verified": true,
      "author": "Je",
      "helpful_votes": 0,
      "publication_date": 20170925
    },
    {
      "title": "Best bag for all purposes",
      "text": "I bought this for my trip to Hong Kong and the Philippines. It was the perfect bag. It was lightweight and able to hold a lot. Was great for the beach with it being water resistant. I loved the 2 pockets on the side that I used one for water and the other for my phone for quick access to take pictures. When this one has been used to the max I will definitely be buying another one to replace it.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly",
      "helpful_votes": 0,
      "publication_date": 20190407
    },
    {
      "title": "Perfect for a quick outing",
      "text": "This 20L backpack is just the right size when you need a bag as you head out the door. How many times do you have an item or two in your hand then grab another couple and realize you can't carry it all? This the the bag for that! It folds into a small size you can take with you then take it out of its pouch and add items to it while you're out. It is well-made. No loose threads or poorly sewn seams. This bag exceeded my expectations.",
      "rating": 5.0,
      "verified": true,
      "author": "Patricia A.  Scibona",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "Perfect Size for a Daypack",
      "text": "I bought this bag to use as a daypack during my recent trip to the Balkans. It was the perfect size. I was able to carry my walking stick, my rain coat, my camera, notebook, miscellaneous medications and small souvenirs I purchased along the weight. It was quite sturdy for a packable pack, much better than the totally shapless flimsy ones I've used in the past. It had water bottle pockets on both sides and a small zippered outside compartment to hold my iPhone, keys, etc. I really like this bag and hope it holds up for a long time.",
      "rating": 5.0,
      "verified": true,
      "author": "Crosswycke",
      "helpful_votes": 0,
      "publication_date": 20180813
    },
    {
      "title": "Light and Sturdy!",
      "text": "It’s a light weight, but sturdy day backpack for carrying essential items on a hiking trip. It’s got two side pockets for water bottles. Also, there is zippered pocket on the back to store small items. We used it extensively on our hiking trips in Peru and Ecuador. It’s a perfect backpack for day trips.",
      "rating": 5.0,
      "verified": true,
      "author": "Gurudev",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "Conveniently useful, compact and sturdy!",
      "text": "This pack was tested in the wonderful world of Iceland. I convinced my sister to buy the same for our trip (she got the purple, I got the army green) and we both loved them. It was incredibly useful for hiking and traversing the landform features, resilient to rain and sturdy throughout our travels. It's incredibly compact and versatile and will carry all your essentials and then some. I am thrilled with the investment and look forward to using it many more times wherever I go, local or afar. It's super sharp. Great color options. Thank you. Update: like it so much, we bought another (red).",
      "rating": 5.0,
      "verified": true,
      "author": "KCrew",
      "helpful_votes": 0,
      "publication_date": 20181014
    },
    {
      "title": "Perfect size for a day hike",
      "text": "Perfect for what I needed. Was looking for a lightweight backpack. I have only a few things to pack when hiking with my dog. This backpack is comfortable, weighs practically nothing it is the perfect size. I would say my only wish would be that it had more pockets. I highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Donatello",
      "helpful_votes": 0,
      "publication_date": 20200809
    },
    {
      "title": "will be returning it because of color",
      "text": "wanted this type of backpack but wanted more color selections. I use to have a red one that I literally wore out, it lasted too. thought I was getting this nice blue color in the photo. looking back I see it says navy even though the photo isn't navy. don't like navy as it is a dull color for me.",
      "rating": 3.0,
      "verified": true,
      "author": "Cynthia",
      "helpful_votes": 0,
      "publication_date": 20190529
    },
    {
      "title": "What I was hoping for....",
      "text": "I received the backpack yesterday. I took it out of the bag with concern about ever being able to get it back in.... We're going to DC this coming week and I needed to be able to take photography equipment, water, etc for our walk-around the \"Mall\" doing cherry blossom time. It's the perfect size and I was able to repack the bag without a problem. Appears to be a great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Gary",
      "helpful_votes": 0,
      "publication_date": 20190330
    },
    {
      "title": "Great little backpack!",
      "text": "Got one of these for a 3 week vacation and it was great. It weighs almost nothing which made it perfect for a daypack. Large enough for sweater, camera, tour book, wallet, Kleenex, etc. Nice side pockets for water bottles. I don’t know if it would hold up to long term daily use but it did the job for what I needed. It is such a little pack folded up and makes a great extra bag bringing extras back on the way home.",
      "rating": 5.0,
      "verified": true,
      "author": "KT",
      "helpful_votes": 0,
      "publication_date": 20180624
    },
    {
      "title": "exactly what I was looking for",
      "text": "I was looking for a foldable back pack to bring along on trips so we have an extra bag in case we pick up stuff on our way. My kids tend to collect stuff on hikes or buy some souvenirs when on a city trip. Sometimes we pack a lunch for a hike and after eating it we can just fold this back pack up and merge it with another. It's just easy to have one on hand when on the road. Perfect for what we bought it for.",
      "rating": 5.0,
      "verified": true,
      "author": "Operation Brando",
      "helpful_votes": 0,
      "publication_date": 20180812
    },
    {
      "title": "Excellent day-pack for travel",
      "text": "Just got back from walking all over Monterey with this on my back, full of picnic, purse, water bottles and extra layers of clothing. It's a great little pack, and very comfortable considering how lightweight it is. I pack it in whenever I travel; it usually comes in handy several times during a trip, and takes up next-to-no space in my luggage. Also handy if you end up getting just a few too many mementos to fit in your regular luggage. A well designed little pack!",
      "rating": 5.0,
      "verified": true,
      "author": "B. Dace",
      "helpful_votes": 0,
      "publication_date": 20180421
    },
    {
      "title": "Durable & Lightweight",
      "text": "I bought this backpack 5 years ago and it's been on countless hikes and trips around the world. It's so lightweight and compact that it goes everywhere with me. It's been overfilled and spilled on, and it looks just like it did when I got it. Good quality zipper and stitching, no fraying. Highly recommended",
      "rating": 5.0,
      "verified": true,
      "author": "afizzo",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "proven durability",
      "text": "I have used this pack almost daily for the last couple years. Mainly use it to carry lunch and other items to work. I have also used it on day hiking trips. It looks like new. Zippers work flawlessly. For what I use it for it is perfect. The only down side is that large water bottles fall out of side pockets. Compensate by using smaller water bottles. A simple pack that will do the job.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180803
    },
    {
      "title": "Absolutely love this backpack",
      "text": "Absolutely love this backpack! Was looking for something lightweight and compact and we found it. Has nice zippered pockets for storing keys and other small items. Pretty roomy and very durable. This isn’t a big bag, but just perfect for what we were looking for. We use it almost daily when we walk the dog. It holds our keys, phones, water bottle and has plenty of room to hold 2 sweatshirts. When not in use, it folds flat or you can roll it up for easy storage.",
      "rating": 5.0,
      "verified": true,
      "author": "Timothy M Yandle",
      "helpful_votes": 0,
      "publication_date": 20171105
    },
    {
      "title": "SO GREAT",
      "text": "bought this for international travel because I needed something small yet sturdy. there were a lot of options to pick from so I did a lot of research and ended up purchasing this one and MAN I am so glad that I did! it was super comfortable and I could fit a TON of stuff in it too. held up the entire trip.",
      "rating": 5.0,
      "verified": true,
      "author": "allison",
      "helpful_votes": 0,
      "publication_date": 20190820
    },
    {
      "title": "Easy to fold, comfy and perfect size for my small frame.",
      "text": "Purchased this to use at festivals and amusement parks. It seems perfect size to hold a sunscreen stick, snacks, my phone, water bottles and an umbrella. I love that it is easy to fold and the pouch is connected to the backpack. I am one of those people that would definitely lose the little pouch if it weren’t sewn in. I can’t wait to throw this in my suitcase to travel with. The straps seem comfortable and the bag seems like it will hold up nicely for a long time.",
      "rating": 5.0,
      "verified": true,
      "author": "U. Bowman",
      "helpful_votes": 0,
      "publication_date": 20180305
    },
    {
      "title": "Great, lightweight pack!",
      "text": "I'm really enjoying this backpack so far. I wanted something that was super light to take on day trips with my daughter and this back pack delivers. The material seems durable and it seems well built. My only (small) complaint would be that I wish there was some padding in the straps but I suppose that would add to the weight and make it less foldable. Otherwise, great backpack. Would recommend!",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180711
    },
    {
      "title": "So pleased!",
      "text": "I needed a small backpack for a day hike. I used to hike a lot and know that the ideal ones have back support, but they end up being quite heavy, even without stuff in them. I was skeptical buying this product at first, due to the lack of rigidness in the material. However, I am super happy with my purchase! It was so comfortable, you just need to pack your stuff in neatly to avoid things poking into your back. It's very lightweight and I was super comfortable for the 4 hour hike. It amazes me how it folds back into it's tiny pouch and takes up no room, being stored in a closet or suit case.",
      "rating": 5.0,
      "verified": true,
      "author": "Kim",
      "helpful_votes": 0,
      "publication_date": 20150928
    },
    {
      "title": "Light - Roomy - Comfortable - Durable",
      "text": "This backpack is great, it is light, roomy and has easy to get to zipper compartments for important things like money, credit cards etc. I also like the shoulder straps, they are wide and comfortable. It is also durable, This is the 2nd one I ordered for myself. I ordered red for a trip so it will be easy to spot. I usually carry my black one. I bought one for my sister-in-law and she likes it as much as I do. I highly recommend this backpack if you are looking for the qualities I have listed above.",
      "rating": 5.0,
      "verified": true,
      "author": "NAT",
      "helpful_votes": 0,
      "publication_date": 20190313
    },
    {
      "title": "perfect size",
      "text": "bought this for travel as an added piece for day trips and excursion. Love it so far. I can tuck my camera, a small purse or wallet, and a light weight rain coat in and still have room for other things. Hoping it holds up for a while but for the price, if it last a couple of years, it is still a good deal.",
      "rating": 5.0,
      "verified": true,
      "author": "P. Nicolella",
      "helpful_votes": 0,
      "publication_date": 20190929
    }
  ],
  "product_meta": {
    "title": "HIKPRO 20L - The Most Durable Lightweight Packable Backpack, Water Resistant Travel Hiking Daypack for Men & Women",
    "rating": 4.8,
    "feature_bullets": [
      "LIGHTWEIGHT & FOLDABLE - Minimalist Designed, Ultra-lightweight, reduced excess shoulder load, backpack itself weight Only 7.5Oz, making your journey relaxing. It also can be easily folded into a small sandwich size for easy travel."
    ],
    "categories": [
      "Outdoor Recreation",
      "Hiking Daypacks",
      "Sports & Outdoors",
      "Backpacking Packs",
      "Backpacks, Bags & Accessories",
      "Camping & Hiking"
    ],
    "price": 18.99,
    "specifications": {}
  }
}