{
  "website_summaries": [
    {
      "verdict": "Overall, NHL 15 is a bittersweet event. It regularly exudes shades of brilliance and heightened moments of action that truly captures the best parts of hockey. But alas, it's soiled by a harsh truth. NHL 15 is missing an awful lot of features.",
      "pros": [
        "NHL 15 features a stellar NBC Sports presentation, great new commentary, drastically improved puck physics and true-to-life replays",
        "All said, it's the closest thing you'll get to a live hockey game save for going to the arena yourself"
      ],
      "cons": [
        "NHL 15 for Xbox One and PlayStation 4 ships with tons of missing content compared to last year's Xbox 360 and PlayStation 3 game",
        "There's some wonky AI too and the game tends to favor offensive more than it rewards rigid defense",
        "Online play also remains a more sluggish experience than offline"
      ],
      "aspects": {},
      "publication_date": 20140909,
      "rating": "",
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "I'm torn some good, some bad",
      "text": "It looks fantastic, if someone walked by the room at a glance it looks like a live NHL game. As others have said the next gen is missing game modes...no season mode. My biggest problem is that depending on the skill level it is either ridiculously easy or incredibly difficult to win games. I have played with the sliders but can't find the sweet spot where the game is challenging but not frustrating.",
      "rating": 3.0,
      "verified": true,
      "author": "T Stafford",
      "helpful_votes": 0,
      "publication_date": 20141001
    },
    {
      "title": "Why the Hate?",
      "text": "I don't understand the hate, this is one of the best NHL simulation experiences to date! Yes, some game modes are lacking but give them some time! New OTP (Online Team Play) is on next gen is addictively fun and fresh. This isn't the best game ever but the gameplay is awesome and cannot wait for future NHL games from EA.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian A. Krol",
      "helpful_votes": 0,
      "publication_date": 20141115
    },
    {
      "title": "\"Merely a shadow of its former self\"",
      "text": "This is just a barebones release of NHL. They did improve upon the graphics and physics of the game but, stripped it down to almost nothing as far as game modes go. They intend to put some of them back in at a later date through patched but, for now it's just a quick cash grab with their Hockey Ultimate Team micro transactions.",
      "rating": 2.0,
      "verified": true,
      "author": "Devin",
      "helpful_votes": 0,
      "publication_date": 20141028
    },
    {
      "title": "Five Stars",
      "text": "Fast shipping great seller game was as expected very satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "Luc Pitre",
      "helpful_votes": 0,
      "publication_date": 20141123
    },
    {
      "title": "disappointment",
      "text": "The on the ice play is very good. However, everything else is about 5 steps backward from last years game. Imagine my disappointment when I started playing this game and found out that all of the game modes I enjoyed playing were gone.",
      "rating": 1.0,
      "verified": true,
      "author": "son of wiggum",
      "helpful_votes": 0,
      "publication_date": 20141004
    },
    {
      "title": "... to give it one star because it made me terrible game u can hammer the net all day and ...",
      "text": "Have to give it one star because it made me terrible game u can hammer the net all day and not score one timers whatever and yet u can poke check all day and not do anything while other team non stop hits the slot all day so stupid",
      "rating": 1.0,
      "verified": true,
      "author": "ronald flood",
      "helpful_votes": 0,
      "publication_date": 20141106
    },
    {
      "title": "Five Stars",
      "text": "Great game though missing a few features from the last generation.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe from Chicago",
      "helpful_votes": 0,
      "publication_date": 20140913
    },
    {
      "title": "Wait for the next version on xbox one! Not worth more than $10",
      "text": "Do not buy the xbox one version. I love tho franchise, I've played NHL 2013 every week for more than a year on xbox 360, this version is missing way too many features. Someone mentioned it's a $60 demo and I fully agree. Even \"be a pro\", one of the simplest mode, is rendered useless: no minor leagues, you start as the number one center on the team on your recruit year, the camera angles are limited, you can't skip when you're not playing. It's ridiculous.",
      "rating": 2.0,
      "verified": false,
      "author": "Amazon Customer",
      "helpful_votes": 9,
      "publication_date": 20140915
    },
    {
      "title": "This has been a great series for years and now I cannot play the ...",
      "text": "The developers announced less than a month that there would be limited game modes. This is long after many of us preordered the game and stopped checking on every little detail about it. This has been a great series for years and now I cannot play the only modes I continuously bought the game to play. EASHL was what I played about 90% of the time and had no idea it was not included in the game. Other standard features of the game are missing and will be released as an update in several months. Not cool. Wish I could return this but it was opened before I noticed everything missing.",
      "rating": 1.0,
      "verified": false,
      "author": "Jates11",
      "helpful_votes": 10,
      "publication_date": 20140909
    },
    {
      "title": "Would have been satisfied at $19",
      "text": "Same complaints as the other reviews - missing critical game modes and the graphics can be a little glitchy at times which, for a \"next generation graphics,\" game is somewhat embarrassing. Would have been satisfied at $19.99 but this is not a $60 game.",
      "rating": 2.0,
      "verified": false,
      "author": "SunshineFun",
      "helpful_votes": 4,
      "publication_date": 20140924
    },
    {
      "title": "I really can't believe this is the NHL product to ...",
      "text": "I really can't believe this is the NHL product to kick off this console generation. It's a stripped down mess and the glitches are unbearable. It seems that the EA direction is away from a digitized hockey game, and toward the HUT card game. It's shocking that this is the direction, but EA's greed knows no bounds, and the micro transactions have seduced them away from a real hockey product. Please come back 2k!!",
      "rating": 1.0,
      "verified": false,
      "author": "joe",
      "helpful_votes": 2,
      "publication_date": 20140921
    },
    {
      "title": "What ever you do, don't buy this.",
      "text": "The game is joke. There is so much that is, to put it politely, unfinished. $69. For what. A game that can't keep stats when you play a season. There is so much missing. For EA to think this is acceptable, here comes another worst company in america award from consumerist.",
      "rating": 1.0,
      "verified": false,
      "author": "Mike Tozier",
      "helpful_votes": 5,
      "publication_date": 20140910
    },
    {
      "title": "$60.00 demo.",
      "text": "Unsurprisingly Ea has Dropped the ball....again. why put out a product that is basically a demo version of a game and charge full price? Could you imagine if the did this to madden? There will be updates but from what I have read they aren't really adding modes just fine tuning and adding stuff to existing modes. If you haven't bought this game congrats take the year off from this franchise and don't waste your money.",
      "rating": 1.0,
      "verified": false,
      "author": "matt holder",
      "helpful_votes": 11,
      "publication_date": 20140910
    },
    {
      "title": "Where are the game modes ?",
      "text": "Graphics and gameplay are phenomanel. No complaints there. However, many modes are not in the game any more. Winter classic, EASHL, shootout mode, etc. They're not in NHL15. Many on ice presentations have been taken out as well. Team presentations, hats on ice on the hat tricks, SJ giant shark head. Good on the gameplay but missing a lot of what the fans wanted. Maybe to fit other things in like the broadcast team ???",
      "rating": 3.0,
      "verified": false,
      "author": "Rizz",
      "helpful_votes": 0,
      "publication_date": 20140909
    },
    {
      "title": "DO NOT BUY ULTIMATE EDITION",
      "text": "Ultimate edition bonus material ended in March. You literally get nothing extra anymore. I enjoy the game a bit, probably not worth $60 compared to past games. Charging extra for ultimate edition anymore is just criminal.",
      "rating": 2.0,
      "verified": false,
      "author": "Mitchell Mason",
      "helpful_votes": 0,
      "publication_date": 20150408
    },
    {
      "title": "Worst NHL game in decades.",
      "text": "DON'T BUY IT...YOU WERE WARNED, unlike so many of us. Read their Facebook page to see more about what the fans think.",
      "rating": 1.0,
      "verified": false,
      "author": "dr kzvosky",
      "helpful_votes": 0,
      "publication_date": 20140909
    },
    {
      "title": "Garbage",
      "text": "They deleted all the good parts of the game and expect you to pay another $60 for the worthless parts, don't wate your money or your time",
      "rating": 1.0,
      "verified": false,
      "author": "GetToTheChopper",
      "helpful_votes": 0,
      "publication_date": 20141220
    },
    {
      "title": "EASHL player? AVOID AT ALL COSTS.",
      "text": "I am a long time player of the NHL franchise, but this year I had to avoid purchasing it to try and make a statement (I played the demo and some more in EA access). It lacks many of the best modes such as EA Sports Hockey League among others. The graphics and presentation took a positive leap forward, but the game play remains he same and the variety of game modes took 20 steps backwards.",
      "rating": 1.0,
      "verified": false,
      "author": "Patrick Tobin",
      "helpful_votes": 3,
      "publication_date": 20140913
    },
    {
      "title": "the only ones missing are EASHL and some of the single game modes like NHL 94 and the winter classic modes",
      "text": "Im not sure why everyone is saying this game is incomplete, there are plenty of game modes, Be a Pro, GM, HUT, online play, the only ones missing are EASHL and some of the single game modes like NHL 94 and the winter classic modes, the game looks way better than on 360, i own a copy for each and the Xbox One version is way better, the NBC Sports overlay and intros are awesome and the game feels like real hockey, pick this one up for sure",
      "rating": 4.0,
      "verified": false,
      "author": "Chris",
      "helpful_votes": 2,
      "publication_date": 20140918
    },
    {
      "title": "DO NOT BUY. This game no longer has any ...",
      "text": "DO NOT BUY. This game no longer has any more extra content. It is essentially the same as a regular version worth $50.",
      "rating": 1.0,
      "verified": false,
      "author": "Joseph Tyahla",
      "helpful_votes": 0,
      "publication_date": 20150317
    },
    {
      "title": "not good",
      "text": "If you dont play Ultimate Team for regular games I would not buy it they took out the Winter Classicand a bunch of other game modesand even the ultimate team is not that great",
      "rating": 2.0,
      "verified": false,
      "author": "tyler dziendziel",
      "helpful_votes": 2,
      "publication_date": 20140909
    },
    {
      "title": "DO NOT BUY.",
      "text": "Any aspect of this game that I patiently waited for over the years of the series existence, are now gone. I have NEVER been so disappointed in a game. Just plain awful. Unfathomable",
      "rating": 1.0,
      "verified": false,
      "author": "JONATHAN P WILLAX",
      "helpful_votes": 2,
      "publication_date": 20140910
    },
    {
      "title": "One Star",
      "text": "I preordered the game... big mistake. Wait to buy when they fix the connection issues and add content.",
      "rating": 1.0,
      "verified": false,
      "author": "Ryan A JAckobek",
      "helpful_votes": 0,
      "publication_date": 20140929
    },
    {
      "title": "If you like playing as the blues don't get this game they ...",
      "text": "If you like playing as the blues don't get this game they screw you over penalties and our goalies can't save anything",
      "rating": 1.0,
      "verified": false,
      "author": "alex  korn",
      "helpful_votes": 0,
      "publication_date": 20141206
    },
    {
      "title": "I have owned every nhl game since nhl 94. ...",
      "text": "I have owned every nhl game since nhl 94. I would rather play nhl 94 than this version for Xbox one. They dropped the ball on this one big time. Disappointing.",
      "rating": 1.0,
      "verified": false,
      "author": "Rob",
      "helpful_votes": 0,
      "publication_date": 20141109
    },
    {
      "title": "Great game! I love it",
      "text": "Great game! I love it. It is so addictive. This is one of the best games I have ever played.",
      "rating": 5.0,
      "verified": false,
      "author": "Riley",
      "helpful_votes": 0,
      "publication_date": 20141103
    }
  ],
  "product_meta": {
    "title": "NHL 15 (Ultimate Edition) - Xbox One",
    "description": "Built to harness the power of the next generation console - NHL 15 brings hockey to life the sights, sounds and feel of real NHL action like never before. Every player is affected by real-world physics leading to multiplayer collisions and pileups through 12 Player NHL Collision Physics. NHL 15 welcomes Mike ‘Doc’ Emrick, Eddie Olczyk and analyst Ray Ferraro providing insight through revolutionary real life visuals all presented in an authentic NBC Sports Broadcast Package. This is the next generation of Hockey. \n\nKick start your Hockey Ultimate Team with the NHL 15 Ultimate Edition. With over $40 added value of exclusive content, you’ll have everything you need to dominate the hockey world.\n\nKEY FEATURES\n• True Hockey Physics — For the first time in any sports game, real-world physics affects every player through every on-ice collision with the new 12 Player NHL ® Collision Physics. Completely rebuilt Real Puck Physics result in a more realistic feel to every puck interaction. Everything on the ice, including the ice surface itself, is live which leads to the unpredictable and authentic puck spins, rolls and bounces seen in a real NHL game.\n\n• The Next-Generation Hockey Player — The Next Generation Hockey Player has been rebuilt from the ice up using Authentic Player & Equipment Models which has three distinct layers - the body, equipment, and jersey. Each layer interacts independently, making every contact with the puck or other players even more realistic. Combined with Unprecedented Player Likeness NHL 15 delivers groundbreaking player likeness, emotion and animation.\n• Superstar Skill Stick — Now all the tools of an NHL superstar are in your hands. The revolutionary Skill Stick has evolved to give even more control to the player. Protect the puck, receive passes without breaking stride, and discover an arsenal of sweet new dekes, all with an intuitive right stick control scheme that is easy to use but packed with depth. \n\n• World Class Broadcast Package — Witness the sights and sounds of authentic arenas across the National Hockey League, as 9,000 individual crowd models - the most ever in a sports videogame - hang on every play called by an all-new three man commentary team. In addition, a new partnership with NBC Sports™ brings a world class broadcast package to the game.",
    "rating": 3,
    "feature_bullets": [
      "Bonus: Receive $40 of Hockey Ultimate Team content",
      "NHL 15 is the start of a new generation of hockey video games, where the sights, sounds and feel of the fastest team sport on the planet come to life in a way you've never experience before."
    ],
    "specifications": {
      "ASIN": "B00KQV9TRI",
      "Release date": "September 9, 2014",
      "Customer Reviews": "3.0 out of 5 stars46 ratings3.0 out of 5 stars",
      "Best Sellers Rank": "#57,641 in Video Games",
      "Pricing": "The strikethrough price is the List Price. Savings represents a discount off the List Price.",
      "Product Dimensions": "6.73 x 5.24 x 0.43 inches; 2.88 Ounces",
      "Binding": "Video Game",
      "Rated": "Everyone 10+",
      "Item model number": "36846",
      "Item Weight": "2.88 ounces",
      "Manufacturer": "Electronic Arts",
      "Date First Available": "June 8, 2014"
    },
    "categories": [
      "Xbox One",
      "Games",
      "Video Games"
    ],
    "price": 19.98
  }
}