{
  "website_summaries": [
    {
      "verdict": "The latest Dell Inspiron 15 is an incredibly affordable desktop-replacement laptop offering good battery life and a slim profile.",
      "pros": [
        "Very affordable",
        "Good battery life",
        "Thin chassis"
      ],
      "cons": [
        "No LAN port",
        "No optical drive"
      ],
      "aspects": {},
      "publication_date": 20141113,
      "rating": 7.0,
      "source": "pcmag"
    }
  ],
  "customer_reviews": [
    {
      "title": "Not very good at all. A huge waste!",
      "text": "I originally wrote a good review for this laptop, but with further use and a few months later I can now say that it is not a good buy at all. It is so slow. The slowest computer I have ever used, and it will freeze up while typing because it can't process what you are doing fast enough. If you go to a \"heavy\" webpage that requires a lot of processing power, it will freeze for minutes sometimes. It is not good at all and I wish I could return it or better ye, never bought it at all.",
      "rating": 1.0,
      "verified": true,
      "author": "jason",
      "helpful_votes": 9,
      "publication_date": 20140827
    },
    {
      "title": "Going Strong Since 2014!",
      "text": "I have always went with Dell laptops - especially the Inspiron series. This laptop in particular has been going strong since 2014. It has not had even one crash, bug, or glitch with it. Nothing in this laptop has been replaced or needs to be replaced yet. The fan runs very cool which prevents it from over heating. The hardware in this laptop is adequate for the price. It is used all day for gaming (bought it for a sister) and it runs smooth and fast without any noticeable decreases during the day. It has a very strong connection strength and can connect to the router - even from outside. This is an ideal laptop for children or for family.",
      "rating": 5.0,
      "verified": true,
      "author": "SiamicTop Contributor: Pets",
      "helpful_votes": 2,
      "publication_date": 20170605
    },
    {
      "title": "Good fanless laptop",
      "text": "While this laptop is not going to win any awards for an awesome screen or speed, it has been a good FANLESS laptop. Over time, I've become more sensitive to PC fan noise. Since this laptop runs such a low power chipset, it is fanless and that's great. I've upgraded to 8GB of RAM and to a 250GB SSD, which makes this laptop run much better than the stock setup. The upgrade process for both was easy. If you're looking for a low cost fanless laptop that is easy to upgrade (not a chromebook), this is a good choice. By the way I run Ubuntu on this laptop with no issues.",
      "rating": 4.0,
      "verified": true,
      "author": "R Ridley",
      "helpful_votes": 0,
      "publication_date": 20170609
    },
    {
      "title": "Awesome Laptop Depending on Your Philosophy of Use",
      "text": "You simply CANNOT beat this laptop for $220. Don't expect the performance of a $1000 well oiled machine and you won't be disappointed. This laptop is a no frills, gets the job done kind of thing. My philosophy of use for this laptop: - Use Microsoft Word for school - Use Microsoft Powerpoint for school - Watch YouTube Videos - Occasionally watch Netflix If this is what you need a laptop for then buy this one. I see people with $1200 MacBooks using their laptops for the EXACT same things I'm using this laptop for. What I do not like: - Does not come with a disc drive",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20150509
    },
    {
      "title": "Would not buy this again.",
      "text": "I should have known that buying a low priced computer would cost money and frustration in the future. First, it did not come with Office--probably says this in the information about it, but I did so many comparisons, I missed it. Second, it came loaded with pop up ware, ad ware, etc so that it's very difficult to use the internet. I removed some of the pre loaded programs, and this helped very little. I would not buy this again, and am so frustrated that I am considering throwing it away. I would give it away if I could find someone tech savvy enough to figure out how to get rid of the adware and malware.",
      "rating": 2.0,
      "verified": true,
      "author": "Dianne",
      "helpful_votes": 0,
      "publication_date": 20150901
    },
    {
      "title": "I recommend it over a desktop pc",
      "text": "Excellent performance, especially given its price point. It's performing very well after a week's use and I don't anticipate any trouble given my past experiences with Dell pcs. The screen is wide and provides excellent clarity. In addition to some usage on the road, this is also my desktop unit. It is not a small, compact laptop, but I won't be traveling via air often, so its size and weight is not a problem for me. This was recommended to me by an IT support specialist in the local school district. I can appreciate why she recommended it! If you are undecided between a desktop or laptop pc, I strongly recommend this pc as a solution.",
      "rating": 5.0,
      "verified": true,
      "author": "Tschudi",
      "helpful_votes": 3,
      "publication_date": 20140831
    },
    {
      "title": "Perfect for student or casual user",
      "text": "Look, If you are looking for a hardcore gaming computer or an editing powerhouse, this probably isn't your machine. I bought this for school and as a bed side laptop. It watches movies on Amazon Prime and writes papers like a champ. It's pretty basic, but it gets the job done for a student or casual user. There are a few reviews with tips to improve performance, follow these. The keyboard is comfortable and I am slowly getting used to Windows 8.1. For $250, it's a pretty good buy. Ignore all the people who were looking for a $500 computer for $250...it gets the job done.",
      "rating": 5.0,
      "verified": true,
      "author": "HHOMedia",
      "helpful_votes": 3,
      "publication_date": 20140916
    },
    {
      "title": "Avoid! Major Battery Charging Issues.",
      "text": "I ordered 5 of these inexpensive laptops for our school. I wasn't expecting a lot because our needs are pretty simple. However, I've had to send one back for service because it stopped charging after 1 week. The motherboard failed. Another laptop also had intermittent charging issues. Dell Tech Support diagnosed the problem and said the bios had to be updated. Unfortunately after 3 unsuccessful attempts to update bios, Dell decided to replace the laptop. Dell Customer Service was great. All the follow-up was very professional. I'm just sorry that the laptop has major charging / power issues.",
      "rating": 1.0,
      "verified": true,
      "author": "R. Hirt",
      "helpful_votes": 0,
      "publication_date": 20150405
    },
    {
      "title": "Get rid of Windows 8 it comes with and use Linux!",
      "text": "Straight out of the box, this laptop is just crap. Windows 8 is just too much for its processor to take, despite the amount of memory it has: it's really laggy and clicking anything just takes forever to load. The solution? Dump Windows and install a recent Linux distribution. I installed Linux Mint 17 - Cinnamon 64bit ( and it's now snappy as it gets.",
      "rating": 5.0,
      "verified": true,
      "author": "andersonvom",
      "helpful_votes": 5,
      "publication_date": 20141018
    },
    {
      "title": "Good for more than just web surfing and YouTube!",
      "text": "The Dell Inspiron is an amazing laptop. I truly have no idea why people say this computer is terrible and only good for basic web and YouTube. While it is great at those things, it's very fast with the Intel Celeron and 4GB of RAM. Cold starts take me 8-10 seconds before I'm at the Windows 8.1 lock screen. I use it for school, and it's amazing. I know it's not too impressive, but it also gets about 20 FPS on Goat Simulator, so I'm sure it can play Garry's Mod and Team Fortress 2 at a FAIR FPS.",
      "rating": 5.0,
      "verified": true,
      "author": "Samuel Cadora",
      "helpful_votes": 5,
      "publication_date": 20140928
    },
    {
      "title": "Wait a full minute to load a tab? No, thank you.",
      "text": "I have a positive opinion of Dell products as they seem to last forever in offices. This one just did not perform well. I can't say for sure that I got a bad one but it was slower than my six year old Toshiba Celeron. Also, not sure what to think of it, but this was the second Dell through Amazon Warehouse program that disappointed. Price and service are great, but got to wonder what their process is for sending computers back out. For even less money I bought a refurbished ACER quad-core full HD chromebook directly from ACER and have to say that it is a vastly better machine for all things browser related.",
      "rating": 1.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20150313
    },
    {
      "title": "I like DELL but....",
      "text": "Well when I originally purchase this computer price was right even though the bells and whistles was not there.. My major issue is it came with NO manual of what it can do. I'm a big reader for instruction manuals and I've yet to find for this computer online. Also I'm not liking the Key board set up. The numeric keys on the right is rarely used and not comfortable to type. And I'm not able to use a DVD on the computer, so I may research and purchase a new system that can.",
      "rating": 3.0,
      "verified": true,
      "author": "Mary Irizarry",
      "helpful_votes": 0,
      "publication_date": 20170525
    },
    {
      "title": "Useless, Frustrating Garbage",
      "text": "I've had this laptop for a year. Do yourself a favor - spend a little more money. A computer is not something you can try to get on the cheap or you just end up with a frustrating piece of garbage. This machine constantly forces updates that take no less than an hour to complete. The next obstacle is the infinite login. It takes far too long to boot up. Once it appears the login is complete and you are finally ready to roll, you're not. It takes a solid ten minutes to get onto the internet, then the long delay between pages on websites. It sucks all the fun out of online shopping! This laptop is virtually useless.",
      "rating": 2.0,
      "verified": true,
      "author": "Lori Earl",
      "helpful_votes": 0,
      "publication_date": 20160124
    },
    {
      "title": "Uncomfortable to use...",
      "text": "I'm still playing around with it, trying to get it set up... but the biggest downfall of this computer is the edge around the bottom of it where your wrists rest or your hands when typing is very uncomfortable - there is a small 'lip' that is rough and is making dents in my skin already. Tempted to put tape around the edges to smooth it out! (which is not something I'd want to do with any laptop, let alone a brand new one!) I'm almost wondering if it's a flaw in mine specifically with the manufacturing as I'm not seeing other complaints about this...",
      "rating": 3.0,
      "verified": true,
      "author": "julie98033",
      "helpful_votes": 2,
      "publication_date": 20141006
    },
    {
      "title": "Great computer Great Price",
      "text": "for the price this is a super product out of the box. It wont wow you with its speed but who can complain at $249. plus this computer comes with a full size keyboard. NO junkware!! This computer is great for someone who is looking to manage their online life(banling, facebook etc) and some basic offline work using MS Office. the only drawback is no DVD player.. but for $20 you can buy an external one",
      "rating": 5.0,
      "verified": true,
      "author": "TBRDATA",
      "helpful_votes": 5,
      "publication_date": 20140831
    },
    {
      "title": "Worst computer purchase ever",
      "text": "Do not buy this POS. I bought for my 8 yo son for homework, etc., and to play some games (Minecraft, etc.). I never expected this to be a gaming computer, however it falls way, way, short of any computer I have ever purchased (and I bought my first PC in 1984). It is slow, laggy, erratic, and the charger quit working after 4 months of use. I tried calling Dell customer service and what a nightmare. No help whatsoever...just a game of rerouting calls to yet another person who is more worthless than the last. I will never, ever buy a Dell computer again.",
      "rating": 1.0,
      "verified": true,
      "author": "Bob F.",
      "helpful_votes": 0,
      "publication_date": 20150414
    },
    {
      "title": "Not what I wanted at all",
      "text": "I thought the computer came with an operating system and disk drive, since I didn't know what I was looking for, I didn't know they could come without it. Once purchased, I wasn't aware that I could return it before 30 days, I guess I should have read the fine print. Either way, I now have a computer that is not really functional for me, since I need a disk drive, which will now have to purchase as well as Word operating system, which I really need. So, next time, I will have some assistance before spending this kind of money on something that doesn't have what I need on it without additional purchases.",
      "rating": 1.0,
      "verified": true,
      "author": "Bri “What Bri’s Cooking” Harris",
      "helpful_votes": 0,
      "publication_date": 20150116
    },
    {
      "title": "Good For the Basic Jobs",
      "text": "For everyday use, you can't really go wrong with this laptop. If, like me, you will be paying bills, occasionally reading the news, or just buying stuff on line, Then this is a winner. If you are a gamer or need it for heavy computer use, get something else. It's a good starter computer that is extremely light on the wallet. Like i said, Good for basic stuff and as a starter. Still getting use to Window 8. Has a built in camera which i do not use. Sturdy but only for typical wear and tear.",
      "rating": 4.0,
      "verified": true,
      "author": "comfortable dave",
      "helpful_votes": 2,
      "publication_date": 20140914
    },
    {
      "title": "What an awful laptop! I was looking for something ...",
      "text": "What an awful laptop! I was looking for something cheap and basic to serve as my primary laptop. I don't do very much besides browsing the internet, checking email, streaming netflix. The new windows is hard to navigate, and overloaded with features I don't want or need. This thing is heavy. I did not even realize they still made laptops this heavy. Takes forever to start up even after eliminating a large number of programs that open on startup. Battery life is awful. I am constantly tethered to plugging in.",
      "rating": 1.0,
      "verified": true,
      "author": "Steve",
      "helpful_votes": 0,
      "publication_date": 20150421
    },
    {
      "title": "Not bad for a basic Computer.",
      "text": "I found this computer useful but not for running Graphics or NLE programs like Adobe CS. This will work better on a business level like using Office package or just to read PDF files. Nowadays software require a lot of power and this computer cant keep up with that level, at least in the Motion Graphics or Digital Editing arena. So make sure to select a computer that will fulfill your need and select the right tool with the right power that will do the job.",
      "rating": 3.0,
      "verified": true,
      "author": "Richard",
      "helpful_votes": 0,
      "publication_date": 20161005
    },
    {
      "title": "Not worth the money.",
      "text": "I thought this was going to be an amazing laptop. That's what I thought looking at the actual physical aspect. It was thinner and large size screen with decent specifications. However, I found even with the faster 2.16 GHz compared to my old laptop at 1.4 GHz, the Dell laptop is unable to keep up with Windows 8 and the apps lag and even close out when it can't keep up. I can barely get any one program going well enough, much less multitask. Not a good laptop considering the OS in my opinion. I ended up selling it back after 2 weeks of trying to fix the speed issue.",
      "rating": 2.0,
      "verified": true,
      "author": "R.G.P.",
      "helpful_votes": 0,
      "publication_date": 20141213
    },
    {
      "title": "It frustrates the kids when they want to go to websites like coolmathgames. com or friv",
      "text": "You get what you pay for. At this budget price you can expect the laptop to last about 1 year. The processor is too slow to run websites that have video and audio happening in the background. It bogs the computer down so that the javascript application skips. It frustrates the kids when they want to go to websites like coolmathgames.com or friv.com. The screen is nice however and the computer isn't heavy for its realitive size. If I had to do it over again, I would purchase a refurbished machine with a faster processor and windows 7.",
      "rating": 3.0,
      "verified": true,
      "author": "Renee",
      "helpful_votes": 0,
      "publication_date": 20141002
    },
    {
      "title": "Pretty nice!",
      "text": "Got this for my dad who is so computer illiterate, it's comical. I set it up for him and got rid of most of the \"apps\" that just take up space on the desktop screen and confuse him. I left the basics and it's been pretty user friendly. It's sleek looking, light, and nice to type on. The speed/response time is pretty good. My dad mentioned the trackpad being \"too sensitive\" but I think he's just used to his 2007 Dell Inspiron. Great buy, got his money's worth and I will consider one for myself when I need a new device.",
      "rating": 4.0,
      "verified": true,
      "author": "Kate",
      "helpful_votes": 0,
      "publication_date": 20150203
    },
    {
      "title": "so good. Some kinks w/software",
      "text": "Still in the early stages of using but so far, so good. Some kinks w/software. The right side nav shows up more frequently than it should which can be annoying. Software recently updated while I was in the middle of several apps without advance notice so it shut everything down. Size/weight of laptop is great. Nice keyboard -- a bit bigger than my Mac which I find helpful. Does NOT come with MS Office. You can download a free 1-month trial. Battery life is long/keeps a good charge.",
      "rating": 4.0,
      "verified": true,
      "author": "JADSLPMN",
      "helpful_votes": 3,
      "publication_date": 20141123
    },
    {
      "title": "so good. Perfect size and weight - very light",
      "text": "So far, so good. Perfect size and weight - very light. No cd rom drive but we purchased an external one for 10 bucks and thats works great as well. Laptop has everything you need, not for heavy users but speed and ram are just right for casual users.",
      "rating": 4.0,
      "verified": true,
      "author": "NC ROSS",
      "helpful_votes": 9,
      "publication_date": 20140808
    },
    {
      "title": "Excellent Laptop for the price. Missing some small features.",
      "text": "Great laptop for the price. Keep in mind that there are a few things that are NOT included that the consumer should be aware of. First, there is no CD/DVD drive at all. Second, there are only 2 USB ports. Third, there is NO Ethernet port. WIFI only. Other than that, this computer is excellent for the price. It is fast (over 2 GHZ processor) and it can multitask just fine (4gb RAM)",
      "rating": 5.0,
      "verified": true,
      "author": "Forrester B.",
      "helpful_votes": 5,
      "publication_date": 20140910
    },
    {
      "title": "Exceptional Value for the Price",
      "text": "Purchased it for my son. It doesn't work well with video games, Thats not a bug, its a feature. Beware the Norton Anti Virus and all the Dell Bloatware. Remove it though, and its a rock solid dirt cheap computer for word processing, email, spreadsheets, and most basis tasks that 99.9% of computer users who aren't gamers or graphic artists need a computer to do.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Formica",
      "helpful_votes": 2,
      "publication_date": 20150301
    },
    {
      "title": "really nice",
      "text": "works great, great price. fr some reason i began to notice cracks on the sides though. i treat this thing like a baby, which frustrates me seeing that. i also have no idea how to turn off the light of the webcam so i just block it with tape.",
      "rating": 4.0,
      "verified": true,
      "author": "Michael M. Cornejo",
      "helpful_votes": 0,
      "publication_date": 20180301
    },
    {
      "title": "Would Recommend",
      "text": "Awesome for the money. It works well, is fast if power saver mode is disabled, and the battery is good. Its very durable (i have a one year old who has attacked it on multiple occasions) and I haven't had a memory issue, but I only use it for school and occasional browsing. It loses a star though because the screen is very unimpressive. I love to take pictures, but I edit them on the computer and then look at them on my phone because the colors are truer to what will be printed. Overall, I would definitely recommend it for most of what I do.",
      "rating": 4.0,
      "verified": true,
      "author": "Alissa",
      "helpful_votes": 0,
      "publication_date": 20150501
    },
    {
      "title": "Good machine, flimsy and fragile case.",
      "text": "As far as the machine itself goes, it's fast enough and works for just about everything. Haven't done any heavy graphics with it, so I can't speak to that. The seller was fine, delivery was fast and all, which is the only reason I gave the 3rd star. The case is the flimsiest I have ever encountered. Surprised the crap outta me that Dell would descend to releasing such a weak and fragile unit. Don't even consider this for a kid or as a traveling laptop. It just won't hold up. If it's just going to sit on a desk, by all means, get one. The price is right for a stationary unit.",
      "rating": 3.0,
      "verified": true,
      "author": "Swell Swanky Joe",
      "helpful_votes": 0,
      "publication_date": 20150422
    },
    {
      "title": "Stay away from this computer-  Dell should be ashamed",
      "text": "Nice computer but arrived with plenty of unwanted popups and probably a virus. Very slow. Not confidence building when you can't tell if you have virus protection and from who. Windows 8 takes away as much control of the pc as possible and funnels everything to Microsoft products. Tried to load Google Chrome but the system did not allow a functioning version. Will return.",
      "rating": 1.0,
      "verified": true,
      "author": "Trumpr",
      "helpful_votes": 2,
      "publication_date": 20141206
    },
    {
      "title": "Just don't expect the sleek lines and smooth surfaces of a nice Dell. This is just a \"economy car\" if ...",
      "text": "If you're looking for a computer that's durable and sturdy-- this isn't it. This computer is somewhat cheap...but if you just need a computer to check email and write an occasional paper -- this computer could be for you. Windows 8 stinks...so you'll have to get used to it. But for the price it's worth it. Just don't expect the sleek lines and smooth surfaces of a nice Dell. This is just a \"economy car\" if you will.",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 2,
      "publication_date": 20140910
    },
    {
      "title": "It's a laptop",
      "text": "For the price I guess what can you really expect - It's ok - after having Macs for a couple of years you get used to how they work and how to navigate - Windows 8 is not very good. Whats good: Price, 10 key on keyboard Whats not so good - Feels cheap - case is not very sturdy - cheap plastic. Light on forward facing camera turns on randomly to identify my face - so annoying. It's rather slow - thinking about memory upgrade. Keyboard doesn't have a good feel when typing - guess I will get used to it.",
      "rating": 3.0,
      "verified": true,
      "author": "Karlcgray",
      "helpful_votes": 0,
      "publication_date": 20141016
    },
    {
      "title": "An expensive web browser",
      "text": "I've had this for a few months now and I can not stand it. I bought it because it was cheap but I could have bought a nice tablet for the same price ans I wish I had. It is the slowest computer I have owned since the 90s. I bought a laptop for the same price 7 years ago and it out performed this one by far. I don't like the windows 8 interface either. If you are getting it just for web browsing it will work OK but you would be better off with a tablet and if you are getting it for anything else spend more and get anything else.",
      "rating": 2.0,
      "verified": true,
      "author": "Anna",
      "helpful_votes": 0,
      "publication_date": 20141226
    },
    {
      "title": "0 and better audio. There are only two USB2",
      "text": "You get what you pay for... I might have bought the Asus one that has USB3.0 and better audio. There are only two USB2.0 for this one. There is no indicator light to show whether it is running or not. Plastic case looks cheap. But HD screen is pretty impressive. touch pad is loud. And I hate window 8. After two months of usage, I still haven't figured out why it is better than window 7.",
      "rating": 3.0,
      "verified": true,
      "author": "Ning",
      "helpful_votes": 0,
      "publication_date": 20150108
    },
    {
      "title": "total garbage, do yourself a favor and buy something else, slow piece of crap",
      "text": "total garbage, do yourself a favor and buy something else, slow piece of crap bad hard drive all files lost, had to return to get it replaced, never again i mean its a passable pc if your super old or young and don't know the difference update 4/4/15 some thing else crapped out, going to have to return for a second time, in order for them to save money they had me install the hard drive...",
      "rating": 1.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20150104
    },
    {
      "title": "Great computer at a great price.",
      "text": "I purchased this computer for the value offered at a great price. I've owned three Dell desktops over the last twelve years. This is a great laptop for the money although it is \"bare bones\". Many laptops are better on features offered with bigger screens and fast processors, but this serves my needs very well. Besides, I mostly use my desktop when I am not on the road working in sales. Dell makes a very computer. I'm happy.",
      "rating": 4.0,
      "verified": true,
      "author": "Robert",
      "helpful_votes": 0,
      "publication_date": 20141207
    },
    {
      "title": "It's great for casual use",
      "text": "I was pleasantly surprised at how big, thin and light this computer ended up being. It's great for casual use, great for a student like myself who needed something cheap and easy for homework and internet use. I'm not a fan of the low resolution of the screen or the screen itself which can seem washed-out at times, the contrast ratio is actually kinda poor. Everything else about the machine is great. It's quiet (doesn't even have a fan or run hot), ample storage space, decent processing power, and doesn't come loaded down with a ton of bloatware. I've never had problems with Dell or Inspirons.",
      "rating": 5.0,
      "verified": true,
      "author": "Candace",
      "helpful_votes": 0,
      "publication_date": 20150126
    },
    {
      "title": "It's Alright :)",
      "text": "I've had this laptop for almost a year and it's really not so bad. It's more of a stay-at-home laptop for me at least. It's not extremely heavy, battery life's alright I wanted a bit more but it's okay. Compared to a previous laptop I had that always got hot real fast, this one's actually pretty good. You don't feel the heat on your lap. It's good with speed, performance and it's highly recommened for people who are starting off easy. (:",
      "rating": 4.0,
      "verified": true,
      "author": "Lupe",
      "helpful_votes": 0,
      "publication_date": 20150918
    },
    {
      "title": "Great computer for the money",
      "text": "Great computer for the money. I was concerned that the CPU would not have the necessary bandwidth for watching HD video, but the dual-core Celeron handles the task well. I was just streaming the Avengers HD from Netflix and Task Manager showed the CPU bouncing between 20-40% utilization. That was after spending 5-6 hours applying Windows updates and un-installing the anti-virus problem. Also, be sure to make yourself a set of factory image and driver disks. BTW, this computer does have and SD card reader, that I somehow failed to notice in the specs. I have a Samsung external DVD writer the works great on the USB 2 ports.",
      "rating": 5.0,
      "verified": true,
      "author": "Rex Pebble the II",
      "helpful_votes": 0,
      "publication_date": 20141025
    },
    {
      "title": "Darned Good At This Price",
      "text": "Got this as a Christmas present for my sweetie. She had been using an iPad and is ecstatic about the change. She LOVES this laptop. Took a little to adapt to Windows 8, but it is not all that different from Windows 7. Still deciding if it is better, but at least as good. The laptop functions just as you would expect. Only downer so far is just 2 USBs. It really should have 3 minimum.",
      "rating": 5.0,
      "verified": true,
      "author": "Quailrancher",
      "helpful_votes": 0,
      "publication_date": 20150109
    },
    {
      "title": "i would recommend that you be careful",
      "text": "I bought this after researching because I wanted the one with disc player. Alas! I got the one without. I don't have time to find out if it was my mistake or the listing or the seller. I just decided to buy an external drive. So if you plan to buy one with a drive, i would recommend that you be careful. I would advise that you ask the seller if they have the right model you want. I am cool with the deal.",
      "rating": 4.0,
      "verified": true,
      "author": "Jaster Nyasulu",
      "helpful_votes": 0,
      "publication_date": 20141212
    },
    {
      "title": "i'm very happy, this laptop is beatifull",
      "text": "i'm very happy,this laptop is beatifull, is'nt slow at all. but it doesn't have a cd unit, anyway the other thing is that the laptop does not have an ethernet port for cable connecting. just wifi....the screen is big, and everything was as described",
      "rating": 5.0,
      "verified": true,
      "author": "javier",
      "helpful_votes": 5,
      "publication_date": 20140805
    },
    {
      "title": "invest more money into a better machine. It's not the best quality and it ...",
      "text": "If you are looking for a computer for school, invest more money into a better machine. It's not the best quality and it has been sluggish from the get go. This could just be the Windows 8.1 operating system, but it gets hung up while using the office suite products which is annoying. If you are looking for a travel computer or something for your kids to do homework on, this is probably a good choice for you.",
      "rating": 3.0,
      "verified": true,
      "author": "Michelle L.",
      "helpful_votes": 2,
      "publication_date": 20141003
    },
    {
      "title": "Was sad about that part of it",
      "text": "Did not get any paper work with this PC or any disc for it. Was sad about that part of it, but glad I didn't need any to get it running or haven't needed any to keep it running. Hope it doesn't crash on me so I need a disc to start it up again.",
      "rating": 2.0,
      "verified": true,
      "author": "Stanley A. Guerin",
      "helpful_votes": 0,
      "publication_date": 20150728
    },
    {
      "title": "Sharp Front Edge Uncomfortable on Wrists",
      "text": "For some reason Dell engineers decided that the front edge should come to a \"sharp\" edge, rather than a smooth edge. I am thankful that they were able to shave off another 1/2 oz. It was also very nice of them to help prevent carpel tunnel by making the front edge very uncomfortable on my wrists. However, I doubt if they ever have to use this machine for any length of time!!",
      "rating": 3.0,
      "verified": true,
      "author": "LJ",
      "helpful_votes": 0,
      "publication_date": 20141130
    },
    {
      "title": "Basic Computer",
      "text": "Basic computer model. Generally, you would do just as well with an iPad or other tablet, as this computer has no real perks compared to those models, outside of a keyboard and trackpad. I use it to check email, search the internet and run ONE program that can't be run on a mac. For a very basic computer, it is fine. Very heavy, hard plastic shell. Seems durable. Easy to operate. No frills.",
      "rating": 3.0,
      "verified": true,
      "author": "C. Peterson",
      "helpful_votes": 0,
      "publication_date": 20150104
    },
    {
      "title": "Great machine for the price for people who don't use their laptop for more than browsing, word/spreadsheets, video playback.",
      "text": "For browsing, using word and watching videos on youtube this is a fantastic deal. The screen is large, the viewing angle isn't fantastic but neither are most laptops and it's not a problem if you're just sitting in front of it yourself or maybe two people. They keyboard is full-sized (meaning it has a numpad on it) which I think is great. Got no complaints at this price.",
      "rating": 5.0,
      "verified": true,
      "author": "tobbeo",
      "helpful_votes": 0,
      "publication_date": 20141012
    },
    {
      "title": "My only complaint is I don't like the version of Windows that comes installed",
      "text": "I purchased this for very light home use, streaming movies and checking e-mail. It has served its purpose very well. My only complaint is I don't like the version of Windows that comes installed. Also I have had a lot of trouble finding an external CD/DVD drive that I can actually get to work.",
      "rating": 4.0,
      "verified": true,
      "author": "TKHOD13",
      "helpful_votes": 0,
      "publication_date": 20150922
    },
    {
      "title": "Great!",
      "text": "Great price and computer! I bought this laptop computer for my parents, they only access their facebook and e-mail accounts, see family pictures, etc. They loved it. It's easy to operate and it's very light (my parents are almost 60 yo, they can't carry a heavy computer while traveling). But here's something I hadn't realized before buying it: there isn't an optical drive, which means NO CDs or DVDs!",
      "rating": 5.0,
      "verified": true,
      "author": "Talita Sander Pompeu",
      "helpful_votes": 5,
      "publication_date": 20140815
    },
    {
      "title": "Great Mid-Size Laptop",
      "text": "I love my Dell laptop. I have a desktop computer and a smaller Acer laptop, but this Dell is the only one I use. It came with Windows 8.1 and I've since upgraded to Windows 10, which I like better. The specs are sufficient for my needs and it's certainly fast enough for anything I need to do. I recommend it to anyone looking for a general purpose laptop computer.",
      "rating": 5.0,
      "verified": true,
      "author": "Ken Riley",
      "helpful_votes": 0,
      "publication_date": 20151111
    },
    {
      "title": "Worst electronics purchase ever!",
      "text": "Ugh, this thing is a pain. Every time I swipe the touch pad I end up on a different screen. Worst laptop I can imagine. Not at all intuitive. I assumed all laptops came with a disk drive. My bad. It does not. Liked the super cheap price thinking my kids could use it for school work and I wouldn't have to worry about it much (my 5 year old gave my Apple a bath...) but they can't keep the screen they want open and neither can I. Also, it's always updating so I have to wait to use it more often than I'd like. You get what you pay for...",
      "rating": 2.0,
      "verified": true,
      "author": "Amy",
      "helpful_votes": 0,
      "publication_date": 20141230
    },
    {
      "title": "I am a huge Dell fan, in fact, ...",
      "text": "I am a huge Dell fan, in fact, my previous laptop before this one was a Dell. I have had it for 4 years and it is still kicking. I needed a new one for school so I bought this one. BIGGEST mistake. Right out of the box it was the slowest computer. Opening Microsoft or a webpage took FOREVER. I found myself going back to my old windows 7 Dell laptop because I could not stand how slow this computer was. I am returning it promptly!! So very disapointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Victoria",
      "helpful_votes": 0,
      "publication_date": 20150118
    },
    {
      "title": "Worst laptop EVER.",
      "text": "I bought two of these, one for a high school student and one for myself. We needed basic machines and these didn't even qualify for those low expectations. The were both completely unusable in under six months time. One had a manufacturer defect in the power cord whose unstable power had fried the motherboard and the other had a screen that quit. If I didn't live in Palau I may have taken the issue up with Dell....but no such luck. I will never buy another Dell.",
      "rating": 1.0,
      "verified": true,
      "author": "treya schmitt",
      "helpful_votes": 0,
      "publication_date": 20150927
    },
    {
      "title": "The computer is fine. The edge is a little rough and rubs ...",
      "text": "The computer is fine. The edge is a little rough and rubs on your arms. My issue is not with the actual computer, but with the OS. I have done everything that the internet has said to do in order to remove the charm bar. I have checked and rechecked my settings, but the charm bar comes up on it's own. It's supposed to come up when you move the mouse to the right of the screen. Mine comes up randomly, including when my mouse is in the middle of the screen. I can't wait until Windows 10 comes out.",
      "rating": 3.0,
      "verified": true,
      "author": "lsxfan",
      "helpful_votes": 0,
      "publication_date": 20150405
    },
    {
      "title": "Really pleased; keyboard quality was better than I expected",
      "text": "1. Really pleased; keyboard quality was better than I expected. 2. No DVD/CD ROM bit I did not expect one at this price 3. Fan-less which is a plus 4. Compatible SSD upgrade if I want to go in that direction. 5. Windows 8.1 is a ridiculous joke and ripped it out of there as soon as i got it. This is where the complaints about running slow come from. 6. I put Linux Mint 17 on it and it runs like a dream!",
      "rating": 4.0,
      "verified": true,
      "author": "o2bntnn",
      "helpful_votes": 3,
      "publication_date": 20141031
    },
    {
      "title": "He seems to really like it. I'm a power user",
      "text": "Bought this for a nine year old grandson. He seems to really like it. I'm a power user, so this is the first time i had to choose a computer so limited. Didn't want to buy him an expensive computer but I didn't want to by him a piece of crap. Found that this was perfect for a first time computer. I should add that I have never had a problem with a Dell. Don't know if I have just been pain lucky or they are just that good.",
      "rating": 5.0,
      "verified": true,
      "author": "Phillip Goodwin",
      "helpful_votes": 0,
      "publication_date": 20150111
    },
    {
      "title": "Not a good purchase at all.",
      "text": "This laptop is the worst. The hard drive fried after a couple months and there was no recovering all of my lost files. With lack of money to replace the whole laptop, I replaced the hard drive and that one fried too. After replacing it once more, hard drives aren't that expensive, I ran a test and it said that the CPU and RAM was failing. Please save yourself a headache and don't but this. It is not worth the cheap price.",
      "rating": 1.0,
      "verified": true,
      "author": "Anthony D.",
      "helpful_votes": 0,
      "publication_date": 20170603
    },
    {
      "title": "This is an amazing laptop for everyday use",
      "text": "This is an amazing laptop for everyday use ; it is extremely fast and the casing is sturdy. For internet browsing, downloading music and facebook is an excellent choice. I'm very pleased with this DELL laptop. And I received it faster than expected, in 3 working days \"Thank you Amazon and photo store ADORAMA\" for your excellent service.",
      "rating": 5.0,
      "verified": true,
      "author": "verified purchaser",
      "helpful_votes": 0,
      "publication_date": 20141027
    },
    {
      "title": "Please do not buy from Dell. Their products are ...",
      "text": "Please do not buy from Dell. Their products are not the quality they once were and their customer service is meant to break your spirit. The monitor screen on my laptop died after 11 months of use. I sent it back to be repaired, Dell explained it was under warranty and would repair it for free but they sent it back still broken. After four calls and promises of a return call I have still heard nothing and I honestly believe they are hoping I will just go away.Escalations to supervisors are meaningless. I do not think they will ever honor my warranty.",
      "rating": 1.0,
      "verified": true,
      "author": "Kevin Dunn",
      "helpful_votes": 0,
      "publication_date": 20151218
    },
    {
      "title": "Feeling bad about Dell",
      "text": "I got up this morning, one year after purchase, and the computer will not come on. It was purchased for my teenager to do homework on, hence, it is not used that much. I expected a longer working life. Plus, all saved work is not accessible at this time. Feeling bad about Dell!",
      "rating": 1.0,
      "verified": true,
      "author": "brenda l wilberger",
      "helpful_votes": 0,
      "publication_date": 20151020
    },
    {
      "title": "It is amazing the quality and speed for the cheap price",
      "text": "The price of this computer in BestBuy is $550, the double of Amazon. It is not a Sony Vaio, but for the price, it is very fast. It is amazing the quality and speed for the cheap price, I am very pleased. There is no need to spend more than $1000 too buy a Sony Vaio or an Apple Macbook Air, I had both, and the product is near as fast as the top brands.",
      "rating": 5.0,
      "verified": true,
      "author": "O. yips chou",
      "helpful_votes": 0,
      "publication_date": 20141103
    },
    {
      "title": "Oh - and Windows 7 - don't like it. Has nothing to do with the computer",
      "text": "Meh. Not at all fast. Constantly updating. Not impressed whatsoever. Oh - and Windows 7 - don't like it. Has nothing to do with the computer, but just as an aside - hard to manuever. Regardless, This computer does the job, but if I have more than 2 windows open of ANYTHING - it's like a turtle. Too bad.",
      "rating": 3.0,
      "verified": true,
      "author": "Rebecca G.",
      "helpful_votes": 0,
      "publication_date": 20160107
    },
    {
      "title": "Good cheap laptop",
      "text": "The DVD does not open at the touch. For the price not bad.",
      "rating": 3.0,
      "verified": true,
      "author": "Cruzn*k",
      "helpful_votes": 0,
      "publication_date": 20180321
    },
    {
      "title": "Caveat pc's \"on sale\"!",
      "text": "This was bought mainly because of the sale price below all the rest comparable laptops at the time apparently. I had to return it though, simply because it became painfully slow within the first week of use; at times it actually got stuck on the same screen, and it had to be rebooted, which took forever! This was my first (and now last) Dell pc--HP is for me!",
      "rating": 1.0,
      "verified": true,
      "author": "Gerry R.",
      "helpful_votes": 0,
      "publication_date": 20141227
    },
    {
      "title": "price is right, but you'll get what you paid for",
      "text": "would give 3 1/2, if it was an option. price was right;but has windows 8.1, which is terrible version (xp, and 7 were much better, vista even worse), and it is pretty slow. more useful as a second/back up unit; i use a macbook air as a primary, but its difficult to get away from having to use a pc sometimes.",
      "rating": 3.0,
      "verified": true,
      "author": "djlebanza",
      "helpful_votes": 0,
      "publication_date": 20150921
    },
    {
      "title": "Long Setup, Great Computer",
      "text": "My computer came today. It took a LONG time to setup. It detected WiFi and allowed me to sign in, but I could not browse the internet. I did a system restore and was able to get online. I uninstalled a bunch of the apps. I added Chrome, took off IE and it works very well. I will update my review if anything changes.",
      "rating": 4.0,
      "verified": true,
      "author": "JoGo",
      "helpful_votes": 0,
      "publication_date": 20140916
    },
    {
      "title": "A Dell Rolling in the Deep",
      "text": "Awesome computer for the price! Only downside is there is no CD/DVD drive, you will have to get an external one, but that's expected at this price. I am using this laptop for college, and it is awesome for writing papers or watching Netflix. Look forward to getting considerable use out of this (hopefully!).",
      "rating": 5.0,
      "verified": true,
      "author": "Justin Nguyen",
      "helpful_votes": 0,
      "publication_date": 20141215
    },
    {
      "title": "If you need a school laptop at a good price I would suggest this one for a good price",
      "text": "Love this laptop even after 4 years it’s still running like new and it’s the perfect size to travel with and used it for college.",
      "rating": 5.0,
      "verified": true,
      "author": "Adrion Taylor",
      "helpful_votes": 0,
      "publication_date": 20180806
    },
    {
      "title": "The laptop overall is great, if you like windows 8",
      "text": "I initially bought this laptop to do more school work at home and be able to surf the web and watch movies to relax in my bed.The laptop overall is great, if you like windows 8.1. The best part about the laptop is the wide perfect screen and the speed! I have no problem starting it up or shutting it down. The only bad things I could say is that the webcam is crap and the clicks are loud on the mouse pad. This laptop is great for the price and what I use it for.",
      "rating": 5.0,
      "verified": true,
      "author": "Jacob Alexander Vincent McIntosh",
      "helpful_votes": 0,
      "publication_date": 20141116
    },
    {
      "title": "I think I got the best price ever",
      "text": "I think I got the best price ever. however, didn't see that it had no disc drive. fortunately I already had an USB DVD/CD external drive in the office. we all download now, so that is not usually a problem. however, got music CDs for gift, and a new car that doesn't have CD player (has am/fm, xmsirius and external in puts from earphone jack and USB thumb drive). so had to get the external drive out to rip the cds to a thumb drive as mp3.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeffrey M Musser",
      "helpful_votes": 0,
      "publication_date": 20150109
    },
    {
      "title": "Its my baby!",
      "text": "I love my laptop, great audio quality and the screen is super clear and bright. Haven't had any problems for the past few months, and it operates super fast. I might be saying what's already known but I didn't pay too much to the dimensions. The laptop is pretty thin which I love, but the screen is very big. For those people who don't read like me lol. However I love it and it's not crazy big, just a heads up.",
      "rating": 4.0,
      "verified": true,
      "author": "SparkleW",
      "helpful_votes": 0,
      "publication_date": 20150303
    },
    {
      "title": "Still functional after four years.",
      "text": "The laptop is still functional after two years. But the hinge of the screen started breaking apart after 1 year and some months. I have to use a monitor with it now, as sometimes there are lines running through the screen.",
      "rating": 3.0,
      "verified": true,
      "author": "Peter-John Taylor",
      "helpful_votes": 0,
      "publication_date": 20190226
    },
    {
      "title": "I would avoid buying Windows altogether because I hate the interface in general but I have to keep ...",
      "text": "I've had some problems with the wireless connection turning itself off and being unreliable at times, but other than that it works well. I would avoid buying Windows altogether because I hate the interface in general but I have to keep one PC for work purposes. If you must have Windows, this is a decent computer for the cost.",
      "rating": 3.0,
      "verified": true,
      "author": "E Butler",
      "helpful_votes": 0,
      "publication_date": 20150419
    },
    {
      "title": "Terrible, just Terrible",
      "text": "Terrible, just Terrible. Cursor is always floating around screen, I start typing and letters are all over the document. The laptop has troubles connecting to internet. The quality of the whole keyboard and screen is cheap plastic.. I bet it floats in water.. is hollow and cheaply made. I cant express how terrible the user experience is. I bought it used, -- the seller should have known it was a garbage. I'm fearful of making another used purchase at this point. Shame on you for selling this junk.",
      "rating": 1.0,
      "verified": true,
      "author": "Michelle",
      "helpful_votes": 0,
      "publication_date": 20150504
    },
    {
      "title": "Excellent upgrade!",
      "text": "This was purchased for a close, elderly friend replacing an older computer that died. She loves it, especially the larger screen. The only negative is Win-8, which is proving to be confusing after becoming used to Win-7 with her older unit. Definitely a winner!",
      "rating": 5.0,
      "verified": true,
      "author": "R-ROC",
      "helpful_votes": 0,
      "publication_date": 20141228
    },
    {
      "title": "which was a FAR superior operating system",
      "text": "I have NEVER had so much trouble with a laptop. I have spent HOURS on the phone with my IT people trying to fix this computer. We even did a system refresh, but to no avail. Next we do a complete restore, then we return the damned thing! I really wish we could have an option to continue using Windows 7, which was a FAR superior operating system! I don't WANT apps, this is being used for business, it is not a toy. I also don't want all this pre loaded CRAP that just clogs up the works and takes up unnecessary memory. UGH!",
      "rating": 1.0,
      "verified": true,
      "author": "Suzanne D. Macdowell",
      "helpful_votes": 0,
      "publication_date": 20150101
    },
    {
      "title": "Got a fantastic price on an Amazon Warehouse Deal to get a ...",
      "text": "Got a fantastic price on an Amazon Warehouse Deal to get a laptop for my kid sister starting high school. A great entry level device, but there's a screw rattling around in the base that I haven't yet removed. The laptop's run well so far, but it scares me to think of the damage that screw could cause as a short or heat sink....so I'll be opening her up when I get in town for a visit to try and remove. Considering it was a warehouse deal, I'm not really upset given how cheap the device was (~175 brand new, returned). It runs well and other than the screw issue, I've heard no problems from my sister.",
      "rating": 4.0,
      "verified": true,
      "author": "Mr. Haze",
      "helpful_votes": 0,
      "publication_date": 20150415
    },
    {
      "title": "Best bang for the buck",
      "text": "Who could complain about this machine, 4GB/500GB? I've read some gripes that it's not a gaming rig...lol really? You thought you were going to get a gaming machine for $225~$250. A few others complained that it did not have an optical drive, well I was sketched about buying them for my kids at first and thought, I cannot remember the last time I inserted anything into an optical drive. Best bang for the buck",
      "rating": 5.0,
      "verified": true,
      "author": "Nogd",
      "helpful_votes": 0,
      "publication_date": 20150109
    },
    {
      "title": "Great laptop",
      "text": "Worked great up until the moment it got stolen. Wish I could remotely blow it up now that some crim has it. Anyway, my previous laptop was a real lemon (had to reboot half a dozen times a day, blue screen of death, etc). So when I got this one I had high hopes of it just working normally, which it did. Never had a problem with it.",
      "rating": 5.0,
      "verified": true,
      "author": "D",
      "helpful_votes": 0,
      "publication_date": 20150117
    },
    {
      "title": "Poor Quality Control.",
      "text": "This laptop broke within the first hour of use. The 'A' key became jammed so that sometimes it wouldn't press in. Dell claims they test each key with thousands of mechanical key strokes. Also, after restarting the laptop it constantly made high pitched electronic noises. I'm sure I just got a bad egg, but instead of getting a replacement I decided to try a different one.",
      "rating": 1.0,
      "verified": true,
      "author": "Benjamin Nicholson",
      "helpful_votes": 10,
      "publication_date": 20140830
    },
    {
      "title": "Naked machine...Really stripped down",
      "text": "Ok for price I paid of $250 but really stripped down. Not what you expect from Dell. No DVD drive which is weird. Not even an LED to know if NUM lock or CAPS are on. Makes it a little annoying typing in passwords. I guess you get what you pay for. If you just need a secondary laptop like I needed it's fine for the price.",
      "rating": 3.0,
      "verified": true,
      "author": "Gary",
      "helpful_votes": 6,
      "publication_date": 20140819
    },
    {
      "title": "This Laptop is a BEAST for the price!!",
      "text": "I only had it 2 days but it came packed well very fast and does everything I wanted and expected it to do I read all the reviews before buying and was nervous about a few of the bad reviews but I think those are people who want a 500 dollar computer for 250 to be honest this thing is fast huge screen with a nice picture and does all basics functions with no problem at all I do recommend this product I can't speak on its durability seeing i'v only had it for 2 days",
      "rating": 5.0,
      "verified": true,
      "author": "Jonathan",
      "helpful_votes": 2,
      "publication_date": 20140815
    },
    {
      "title": "Stay away",
      "text": "Huge POS. Had it less than a year and it died. Replaced with a nice Toshiba that I like. Went for a \"bargain\", bad bad idea. With computers, the adage that you get what you pay for really holds true. The thing only costs $225 for a reason.",
      "rating": 1.0,
      "verified": true,
      "author": "NJA",
      "helpful_votes": 0,
      "publication_date": 20151029
    },
    {
      "title": "Thanks",
      "text": "This laptop isn't bad, but I was aiming more for something that would be supportive for gaming. This is more for light work. College students should get one .",
      "rating": 5.0,
      "verified": true,
      "author": "Carl taylor",
      "helpful_votes": 0,
      "publication_date": 20170304
    },
    {
      "title": "Perfect for watching videos",
      "text": "I've had this laptop for 2 years and it's still going strong. Perfect for watching videos, online shopping and just home office type use. It's sturdy and great for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Ru Lee",
      "helpful_votes": 0,
      "publication_date": 20160407
    },
    {
      "title": "Great Laptop!",
      "text": "I've had the Dell for over two months and I love it. Getting use to Windows 8.1. Love the speed; use it everyday (like now to send this rating); I would refer this product to anyone, especially, those that like Dell products. Thanks in advance.",
      "rating": 5.0,
      "verified": true,
      "author": "joyceburnette",
      "helpful_votes": 0,
      "publication_date": 20140926
    },
    {
      "title": "It was easy to set up",
      "text": "I needed an inexpensive laptop to connect to the Internet and this little machine did the trick plus much more. It is very fast processing. It was easy to set up. Love the larger size screen. Only wish I could have gotten it with a lower version of windows as it was a learning curve to use the newest version.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20150929
    },
    {
      "title": "extremely disappointed",
      "text": "In purchasing this laptop we knew we were getting a simple computer with few bells and whistles. What we didn't expect was the low quality we would also be purchasing. We have had multiple problems and have to restart the laptop often. Our newest issue is our computer suddenly stopping and showing a \"computer_process_died\" error. While we are no geniuses, we know this is not good. Please save your money and do NOT purchase this laptop. I am wishing we had done the same...",
      "rating": 1.0,
      "verified": true,
      "author": "Schmidt.jandk",
      "helpful_votes": 0,
      "publication_date": 20151015
    },
    {
      "title": "Mother board crashed within 8 months",
      "text": "I bought this laptop 8 months ago and it has been \"glitchy\" from the start. Last week it would not turn on...took it to a computer repair shop and they said the mother board was shot and would cost over $300. to repair. I contacted the company that sold it to me on Amazon...Vegas Traders, I think...and of course I get no response. It will make a quality paperweight though. Buy a Mac and be done with it...",
      "rating": 2.0,
      "verified": true,
      "author": "M   Lewis",
      "helpful_votes": 0,
      "publication_date": 20160329
    },
    {
      "title": "So far so good after a month",
      "text": "This is going to be random and unorganized, but here are my thoughts on the laptop: So far so good after a month. It took some getting used to on the Widows 8.1, after being an XP user for many years. Everything seems to be running smoothly. Only downfall is the preloaded McAfee and other software.They are fine while the free subscription is going, but a pain when they start asking you to spend money every time you login. Device is light weight, quiet during operation and produces little to no heat. It has a quick start up and shut down time. The display is good quality. Just wish there were more USB ports.",
      "rating": 4.0,
      "verified": true,
      "author": "Gregory G. Carlisle 3",
      "helpful_votes": 0,
      "publication_date": 20140819
    },
    {
      "title": "Have had it for over a year",
      "text": "I've had this laptop for well over a year and barely use it. I bought this for school but it is far too slow and because I only use it once in a while now I get mandatory updates all the time. It seems like every time I turn it on it needs two hours to update. It can't even handle playing minecraft.",
      "rating": 1.0,
      "verified": true,
      "author": "Josh Anderson",
      "helpful_votes": 0,
      "publication_date": 20160413
    },
    {
      "title": "Okay, You get what you pay for",
      "text": "Didn't see the lack of cd/dvd drive when purchased, but that's no big deal for me. Big Screen, Cheap, Good Battery. Had to send the first one back, it had a loose screw inside it, no problems there. The Thing is slower than I expected but is only used for typing and basic internet games, so suits the purpose it was bought for. MY main complaint is reserved for windows 8.1. I really really hate metro. It is a PITA for someone like me used to win7, or winxp.",
      "rating": 4.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 2,
      "publication_date": 20141229
    },
    {
      "title": "Windows 10 a Dissapointment.",
      "text": "Great laptop, I bought several, for my daughters and grandkids. They love them. I messed mine up, upgraded to Windows 10. Hate it.",
      "rating": 5.0,
      "verified": true,
      "author": "Blackie",
      "helpful_votes": 0,
      "publication_date": 20161225
    },
    {
      "title": "It's so damn good I bought 2",
      "text": "It's so damn good I bought 2 :D If you're the type of person that just likes to browse the Internet and enjoy media and do light work with Microsoft office, this is the laptop for you. Don't expect it to be a champion performer so if you want to play games or whatever this is not the computer for you. It's extremely light weight and slim because of the lack of an optical drive (who uses those anymore anyways) so it easily fits into any college students bag. I would recommend this to anyone who doesn't need much out of a computer. Bought a spare one for college and one for my mom :D Happy shopping guys",
      "rating": 4.0,
      "verified": true,
      "author": "S. Solomon",
      "helpful_votes": 7,
      "publication_date": 20140827
    },
    {
      "title": "can be better",
      "text": "It's a very good laptop, light and easy to use. What I didn't like about it was that, it has no network port, no status lights to say when the hard drive might be busy or if it's powering up. And most of all Windows 8.1 kept crashing a lot, so I installed Windows 7 and it work well after. I think it's a laptop for kids rather than for a business person like myself.",
      "rating": 3.0,
      "verified": true,
      "author": "jamesbond0074",
      "helpful_votes": 0,
      "publication_date": 20141213
    },
    {
      "title": "The keyboard sucks",
      "text": "I hate the layout of this keyboard. Infactthe reason there are spacesperiodically omitted in the review is because the spacebar is a piece of junk. You have to hit the spacebar exactly in themiddle of the key for it to register. thisis the secondDell that i have had issues with.I would rather eat hose Haribo sugar free gummi bears than type in this thing. In the words of G Bush, \"Fool me once, shame on — shame on you. Fool me....you can't get fooled again.\" . Show less",
      "rating": 1.0,
      "verified": true,
      "author": "NCAgent",
      "helpful_votes": 0,
      "publication_date": 20151223
    },
    {
      "title": "As a web developer this computer is perfect for couch coding ;)",
      "text": "I've had this laptop for about a year. Given the price/quality ratio, I gave it 5 stars. You won't get a better laptop for this price. I'm a web developer, and it handles everything perfectly, I usually have, 20/30 tabs opened in chrome, sublime text, skype and firefox opened at once, and I cant complaint. I run it on Ubuntu 15.04 as of this day, and I've never had any problem. I'll upgrade to an SSD and 8GB RAM next week, so I believe I'll have a laptop for the next couple of years. I do recommend it for every day use laptop.",
      "rating": 5.0,
      "verified": true,
      "author": "Marcos Casagrande",
      "helpful_votes": 0,
      "publication_date": 20151115
    },
    {
      "title": "Returning lemon",
      "text": "I am returning his computer because I was supposedly new but it came with so many viruses that I had it in the computer shop twice and finally gave it up and bought an HP locally. I thought I hated Windows 8 but it is fine so long as your computer is not lousy with viruses. I guess I got a lemon.",
      "rating": 1.0,
      "verified": true,
      "author": "Catherine S.",
      "helpful_votes": 0,
      "publication_date": 20150212
    },
    {
      "title": "Perfect starter computer for a school child who has to ...",
      "text": "Bought this as a gift and my daughter loves it. Lots of extra \"garbage\" loaded on to it but we removed all of that so now it runs very smoothly. Be aware, though, that there is NO CD/DVD ROM. You will, however, find plenty of USB ports. Perfect starter computer for a school child who has to do computer homework every day.",
      "rating": 5.0,
      "verified": true,
      "author": "Jules",
      "helpful_votes": 0,
      "publication_date": 20150107
    }
  ],
  "product_meta": {
    "title": "Dell Inspiron i3531-1200BK Laptop (Windows 8, Intel Celeron N2830, 16\" LED-lit Screen, Storage: 500 GB, RAM: 4 GB) Black",
    "description": "The Inspiron 15 is the most economical member of the family, offering a great combination of portability and plenty of screen real estate along with a 10-key numeric keypad next to the keyboard.\n\nAMAZON.COM",
    "rating": 4.1,
    "feature_bullets": [
      "Intel Celeron N2830 Processor",
      "4 GB DDR3",
      "500 GB Hard Drive",
      "15.6-Inch Screen, Intel HD Graphics",
      "Windows 8.1"
    ],
    "specifications": {
      "Standing screen display size": "16 Inches",
      "Max Screen Resolution": "1366x768",
      "Memory Speed": "1600 MHz",
      "Graphics Coprocessor": "Intel HD Graphics",
      "Chipset Brand": "Intel",
      "Card Description": "Integrated",
      "Wireless Type": "802.11bgn",
      "Number of USB 2.0 Ports": "2",
      "Average Battery Life (in hours)": "6.5 Hours",
      "Brand": "Dell",
      "Series": "Inspiron",
      "Item model number": "i3531-1200BK",
      "Hardware Platform": "PC",
      "Operating System": "Windows 8",
      "Item Weight": "4.67 pounds",
      "Product Dimensions": "10.2 x 15 x 1 inches",
      "Item Dimensions  LxWxH": "10.2 x 15 x 1 inches",
      "Color": "Black",
      "Processor Brand": "Intel Celeron",
      "Processor Count": "2",
      "Computer Memory Type": "DDR3 SDRAM",
      "Flash Memory Size": "4 GB",
      "Hard Drive Rotational Speed": "5400 RPM",
      "Voltage": "14.8 Volts",
      "Batteries": "1 Lithium ion batteries required.",
      "ASIN": "B00KMRGF28",
      "Customer Reviews": "4.1 out of 5 stars1,834 ratings4.1 out of 5 stars",
      "Best Sellers Rank": "#21,860 in Computers & Accessories",
      "Date First Available": "June 1, 2014"
    },
    "categories": [
      "Computers & Accessories",
      "Laptops",
      "Electronics",
      "Traditional Laptops",
      "Computers & Tablets"
    ],
    "price": ""
  }
}