{
  "website_summaries": [
    {
      "verdict": "The PlayStation TV sounds great on paper, but out of the gate, it underwhelms as both a gaming and an entertainment box.",
      "pros": [
        "PlayStation TV has an affordable starting price point, works with existing DualShock 3 and 4 controllers and can play hundreds of games",
        "It also offers game streaming from a networked PS4 or via PlayStation Now, and a handful of video services"
      ],
      "cons": [
        "A surprising amount of content for PSTV is not available in HD, and the Vita's interface doesn't make a graceful jump to the big screen",
        "Remote play is laggy in Wi-Fi mode and PSTV still relies on an expensive flash storage medium",
        "Major streaming services such as Netflix and Hulu Plus are noticeably absent"
      ],
      "aspects": {
        "Design": 6.0,
        "Ecosystem": 5.0,
        "Features": 5.0,
        "Performance": 6.0,
        "Value": 6.0
      },
      "publication_date": 20141014,
      "rating": 5.7,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "A very nice little console, but you will want to modify it's software because proprietary memory cards are expensive",
      "text": "This is a very nice little console, but you will want to modify it's software. Out-of-the-box it requires a proprietary Sony memory card to store downloaded games, but these memory cards are expensive. A software mod allows you to get around that by using regular USB drives instead. As of Jan 2018, all versions of this console are able to be modified. Issues: - Expensive proprietary memory cards - It automatically turns on as soon as it's plugged in. It doesn't wait for you to press the power button - Game library is limited compared to a Playstation 3 or PS4 (but there are some gems) These issues are minor, and there are ways to get around them.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180122
    },
    {
      "title": "Over priced.",
      "text": "Do not pay anywhere near $200 or even $100. I got one when they came out a few years ago and they were selling for about $80 bucks at the time. Dont beel fooled. Not a great great extention or 2nd ps4. Playing games on it has bad lad. Would be a mediocre media streaming device. You can buy an actual PS4 for $200",
      "rating": 3.0,
      "verified": true,
      "author": "James Ryan Veley",
      "helpful_votes": 3,
      "publication_date": 20190103
    },
    {
      "title": "8/10 Cheaper option than an actual Vita",
      "text": "Note; PS vita games like gravity rush that require the gyroscope or motion controls will not work do to incompatibility issues. Either look for a splitter or just by a vita if you want to play those games. Other than that the only issues present are a lack of support for ps4 controller mic meaning you’ll need to either use tv audio or Bluetooth earbuds. Lag is also present if you use the ps4 connected too far from the PSTV, controller lag will also be present under those circumstances.",
      "rating": 4.0,
      "verified": true,
      "author": "Phantom",
      "helpful_votes": 0,
      "publication_date": 20200310
    },
    {
      "title": "Expensive ps one",
      "text": "I personally really like it. I use it to play PS one games, but not much else. Don't buy this if you plan on playing new games or even ps2 games. I really wanted to play jack and daxter but of course it's not supported by the tv. It doesn't make any sense when Sony says it's because of issues with touchscreen; this game never supported touchscreen. Anyway, it's basically an expensive ps one. I kind of wish I just bought cables to start up my ps2 and I can play everything on that. If you want something small and new looking, this is ok to play old games you loved.",
      "rating": 4.0,
      "verified": true,
      "author": "Robert",
      "helpful_votes": 0,
      "publication_date": 20170716
    },
    {
      "title": "Buy this if you have a PlayStation 4",
      "text": "It is a shame that Sony discontinued the PlayStation TV. This is probably the best gaming \"accessory\" I have ever seen. The remote play option allows me to use my PS4 from a different TV. This is great for times when my wife is watching TV. I can go in the other room and have the same exact experience. If I could, I would buy one of these for every TV in my house. If you own a PS4 and have multiple TVs in your house, do yourself a favor and buy one of these.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark Antilla",
      "helpful_votes": 11,
      "publication_date": 20161024
    },
    {
      "title": "I bought this to save my eyesight from the beautiful (but small) screen on my Playstation Vita",
      "text": "I bought this to save my eyesight from the beautiful (but small) screen on my Playstation Vita. I love jRPGs tactical games, and the amount of time that goes into these games can easily run into the hundreds of hours (fans of the Disgaea or Persona/Shin Megami Tensei series can relate). Thankfully I can now play these excellent games and the rest of my Vita library on a nice big TV screen with a nice comfortable Playstation 3 or 4 controller while sitting back on the couch, not huddled over a handheld/portable system. Be sure to purchaseto go with this: you'll need this for your digital library and downloaded games, as well as your game saves.",
      "rating": 5.0,
      "verified": true,
      "author": "Lannister",
      "helpful_votes": 0,
      "publication_date": 20160221
    },
    {
      "title": "Fantastic!!! Adds a great library of games not playable anywhere else!",
      "text": "This is an absolute steal, why this wasn’t more of a success is baffling. If you like JRPGS this is a must. Works great with PS4 controller. VERY easy to set up. Went from opening box to playing Persona 4 Golden within 10 minutes. If you only have a PS4 it also gives you access to a lot of downloadable PS1 (Suikendon, Wild Arms, Persona) from Games not available for PS4. I don’t use my Vita because of screen size. Don’t be confused that you need a Vita to use this, it’s basically a stand alone console that plays Vita Games. (Not all games are compatible I looked on website ‘reviews2go’ to verify what to buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary G",
      "helpful_votes": 0,
      "publication_date": 20180131
    },
    {
      "title": "Waste of money if you want to play vita games",
      "text": "Read the supported games list before buying, 90% chance the games you'll want to play wont be on it. Playstation for some reason blocks all of the goods games from being \"supported\" on the PS TV.",
      "rating": 2.0,
      "verified": true,
      "author": "SuperFrustratedMan",
      "helpful_votes": 3,
      "publication_date": 20171129
    },
    {
      "title": "Just not worth it",
      "text": "Kinda disappointed to be honest. I bought this to play my ps4 remotely and honestly my vita does a better job. There's a input lag no matter how it's configured (I tried hardwired and wireless, and I have a very robust local network setup) and there was always a pretty significant input lag. Also the resolution doesn't seem to be 1080, it looked to be 720i/p at best. Add the fact that you need a vita SD card to really be able to store games and things and it's simply not worth it.",
      "rating": 2.0,
      "verified": true,
      "author": "Dave",
      "helpful_votes": 2,
      "publication_date": 20160815
    },
    {
      "title": "Surprised!",
      "text": "Works a lot better than expected. I won't be playing any PVP games because there's about a half a second away from when you hit the button to when the action starts. But that's not bad considering this is upstairs and my PlayStation 4 is downstairs. The one thing that bothers me is that you have to pair a controller if you use in the PS4 controllers so basically it's good to have a controller for just that because you'll have to repair it with your PS4 when you done using the PlayStation TV. Other than that I'm really impressed.",
      "rating": 5.0,
      "verified": true,
      "author": "chris16",
      "helpful_votes": 2,
      "publication_date": 20160411
    },
    {
      "title": "I did like that it was really small so it didn't take ...",
      "text": "I got this to use for PlayStation Now, and for that it worked really well. But all the other app on it were just clutter as far as I was concerned. I did like that it was really small so it didn't take up much room. Side Note: PlayStation Now is kinda like Netflix for PS games, but all the games are kinda old, and at $20 a month, I realized I'd do better to get an actual PS4 and buy old games if I want them but still be able to buy new games. Since I've now cancelled PlayStation Now, I'll probably get rid of this box.",
      "rating": 4.0,
      "verified": true,
      "author": "J Cain",
      "helpful_votes": 0,
      "publication_date": 20161128
    },
    {
      "title": "Solid gaming device, for what it is",
      "text": "The PS TV is sort of a desk set Vita. It wasn't around for too long and was poorly supported by Sony, which is a real shame. It can run some Vita games, and many PSP and PS1 games. It doesn't provide much in the way of entertainment services. I'm giving this product 5 stars in spite of these limitations because I'm using it strictly as a GTA and Castlevania machine. Chinatown Wars looks great on my set and plays well with the dualshock 4. There is a slight bit of lag which I attribute to my aging high def TV, I do not see this being a problem with a modern set.",
      "rating": 5.0,
      "verified": true,
      "author": "toptenmaterial",
      "helpful_votes": 0,
      "publication_date": 20171220
    },
    {
      "title": "there are delays from ds4 control",
      "text": "3 Stars because of these following reasons - Not using SD or microSD, if you want the 32gb memory card, it will cost more than the system - Wireless controller (DS4 specifically) has random lags that makes it impossible to play games that require precise control - not enough compatible games, there is absolutely no reason for all the games to work with vita tv.. just remap all the buttons This system is only recommended if you already have a spare vita memory card, ps3 or ps4",
      "rating": 3.0,
      "verified": true,
      "author": "S",
      "helpful_votes": 2,
      "publication_date": 20160123
    },
    {
      "title": "Worth the price for what I need",
      "text": "I grabbed this for a few reasons, the room where my PS4 is located gets hot over the summer, so I wanted to have the ability to play games elsewhere in the house(near an AC.) At first, I tried this wirelessly but there were too many issues, so I ended up getting an Ethernet powerline adapter and that fixed any connection issues. It streams from my PS4 pretty well, there is a loss of color/quality though, but ok for casual games like Rocket League. I don't have a vita, so I can now play my free Vita games that come with PS Plus sub. Don't forget to pick up a memory card!",
      "rating": 4.0,
      "verified": true,
      "author": "CC37",
      "helpful_votes": 10,
      "publication_date": 20160728
    },
    {
      "title": "It does what it does, unfortunately that's not much",
      "text": "Here's the thing about the Playstation TV: it does what it does well enough, but it doesn't do everything you might think. This system is not even remotely ready to use out of the box. Though they are upfront about not including a controller, they neglect to mention that it doesn't come with any memory. That means if you want to play a game that is purchased from the Playstation store you have to buy Playstation's special memory card. The memory cards are not cheap. I wish I had read the reviews from CNET and other outlets before we purchased this if I had I may have gone with a different product.",
      "rating": 3.0,
      "verified": true,
      "author": "ReadTheWholeBook",
      "helpful_votes": 2,
      "publication_date": 20150228
    },
    {
      "title": "Could have been a great device",
      "text": "This device had a lot of potential but sadly never lived up to it. I love that some (not all) Vita games can be played on here and that there is the option to stream from your PS4 onto here (though I've not played around with this much so can't say how well it works). However, I wish you could do more, such as watch Netflix/Hulu/etc. If you can get this at a great price (i.e. under $50) I say go for it. However, I wouldn't recommend paying full price for it. There's just not enough there to warrant the cost.",
      "rating": 3.0,
      "verified": true,
      "author": "Gary Coffman",
      "helpful_votes": 2,
      "publication_date": 20151119
    },
    {
      "title": "Great for streaming PS4 at work",
      "text": "I Bought two of these little guys. One for upstairs and one for my classroom (students get rewarded with game time during regular recess). I have my PS4 pro hooked up at home with a wired connection. My PSTV are also hooked up hardwired both at work and home. The streaming for remote play works great even at work and it allows me to have my PlayStation 4 Pro in two extra locations without having to actually purchase two more consoles. Latency is hardly noticeable and even shooters like titan fall 2 work great.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Marroquin",
      "helpful_votes": 0,
      "publication_date": 20170801
    },
    {
      "title": "great compact console to bring on trips",
      "text": "I should have bought 3 of these when they were $20, great compact console to bring on trips. Only bad part is the expensive propriety memory cards. Not completely supported by Sony anymore, kind of a shame since this could have been a great streaming box in addition to a great mini-console. Unfortunately it's NOT a good box for streaming. Would be fantastic if they ported the PS2 library to it, and developed more apps, but sadly, I think that shipped has sailed",
      "rating": 5.0,
      "verified": true,
      "author": "H J Duff",
      "helpful_votes": 2,
      "publication_date": 20160329
    },
    {
      "title": "More expensive than you think",
      "text": "It only comes with 1gb internal memory, and a 32gb memory card is about $80, as you HAVE to use a ps vita memory card. Also, a lot of ps vita games don't play on it, (METAL GEAR HD COLLECTION, UNCHARTED) due to lack of touch controls. To be honest, you'd be better off buying a PS3, as most of those games are on that system. I recommend this product only to those who own a ps vita and want to play on the big screen.",
      "rating": 2.0,
      "verified": true,
      "author": "Jordon",
      "helpful_votes": 2,
      "publication_date": 20160414
    },
    {
      "title": "Quality not great but it works!",
      "text": "Cheaply made for PlayStation i was surprise at the quality of material they used, the software was not good it was very basic. i tested it for a day and had to return the item, it was not what i was looking for in a movie streaming caster.",
      "rating": 1.0,
      "verified": true,
      "author": "Louis Davis",
      "helpful_votes": 0,
      "publication_date": 20191219
    },
    {
      "title": "Love it",
      "text": "Got it was a bday gift from my girl, now she can watch her favorite shows on the main TV while I use any other TV from the house to access my ps4 without having to deal with moving the physical system. Video only streams at about 720p, reduces image quality as well. But it is acceptable. Never had issues with it, I can say that I've used it for hardcore raiding and have not had problems with lag.",
      "rating": 5.0,
      "verified": true,
      "author": "Ernesto J. Silva",
      "helpful_votes": 2,
      "publication_date": 20160421
    },
    {
      "title": "Key Flaws to me. :(",
      "text": "I bought my product primarily for the PlayStation Now I saw in the early trailers. It’s advertised as PlayStation Now Compatible, but Sony has since discontinued PS Now services across all non-PC and non-PlayStation 4 systems. It’s still fun to play Vita and ps1 games on the big screen(that I also had to purchase separately). As long as they’re games without the touchscreen functionality, you’re good. There are no games included, which was shocking, but I could deal with that. In short, Do not buy if you’re hoping to enjoy that PS Now or to play the Vita Games that use touch screen.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180722
    },
    {
      "title": "The premise for this device is great but to be honest the functionality of it lacks ...",
      "text": "The premise for this device is great but to be honest the functionality of it lacks some major stability. Even when hardwired into the same wire stability issues arise which leads to lag time and bad graphic display. It is also locked to one user for the most part if it had the user swap functionality it would have been great. But as we all know this product is amongst the walking dead in the tech world...",
      "rating": 3.0,
      "verified": true,
      "author": "Norm Green",
      "helpful_votes": 2,
      "publication_date": 20160516
    },
    {
      "title": "Still has glitches but despite that, a lot of fun!",
      "text": "Has some glitches, it does not recognize some games as playable even when they are formatted for this PlayStation TV. I managed to get my Sly Cooper game to work on mine, but bought one for my mother and the game will not work on her PlayStation TV (same game). So I do not like that it glitches, but I love the fact that I can play games through the TV screen that I could only play on a handheld device before this.",
      "rating": 4.0,
      "verified": true,
      "author": "Kim",
      "helpful_votes": 0,
      "publication_date": 20170915
    },
    {
      "title": "Great Vita alternative",
      "text": "Bought it for $30, great deal, glad I can now play the Vita games I've wanted without having to throw down tons of money on an actual Vita. However, you do have to by one of Sony's rip off vita memory cards to download anything of substance. Memory card cost me more than the console.",
      "rating": 5.0,
      "verified": true,
      "author": "J. B. Haynes",
      "helpful_votes": 4,
      "publication_date": 20160210
    },
    {
      "title": "This is a Playstation Vita non portable system that connects to your TV.",
      "text": "Badly advertised by Sony of America as a device for streaming the PS4 to another TV. by using the remote play feature but is not mentioned in the box at all that this is a Playstation Vita console capable of playing PSV games on the TV. By the time this review shows up, it may be out of print as people who know what exactly this is buy all of them.",
      "rating": 5.0,
      "verified": true,
      "author": "Kaiser",
      "helpful_votes": 0,
      "publication_date": 20180430
    },
    {
      "title": "Fits in your pocket",
      "text": "Well worth the discounted price i paid for it. You can use it to stream your PS4 and PS3 as well as PSnow and movies from the playstation store. It also acts as a console for your PSvita games which is the real reason i bought it. I figured if anything ever happens to my Vita i can always play my games on this thing. It's small enough to fit into your pocket with ease making it a good travel companion.",
      "rating": 5.0,
      "verified": true,
      "author": "Sonia",
      "helpful_votes": 0,
      "publication_date": 20160919
    },
    {
      "title": "PS Plus IS A MUST",
      "text": "Love this thing, though be warned, sometimes games will freeze or not load right, an issue i have never had on my vita. Also some games wont work at all, like Trails of Cold Steel, or Uncharted. Also the store is not identical to the Vita, so you will miss good sales if you shop only of PSTV store. HIGHLY HIGHLY only recommend PSTV is you have PS Plus as the glitching loading has cause me issues and save losses if it were not for ps plus cloud saves.",
      "rating": 4.0,
      "verified": true,
      "author": "thehelpfulreviewer",
      "helpful_votes": 0,
      "publication_date": 20180224
    },
    {
      "title": "Not what it described",
      "text": "It's the size of a dollar bill, it only streams a PS system currently owned in the house. Can't play multiple accounts because it only mirrors what the PS system is doing. The idea is that you can have one system but the option to play that system in any room of the house without moving te PS system around. We tried multilayer it doesn't do multiple ps accounts. Lucky for me we have 3 ps systems in the house. Needed this for living room",
      "rating": 4.0,
      "verified": true,
      "author": "Sn0wWhiteQu33n",
      "helpful_votes": 0,
      "publication_date": 20160802
    },
    {
      "title": "A Little Useless",
      "text": "I wanted to have the option to play my Playstation in another room in the house when company is over. I found this lagged too much to play online games and this is only good if you have your playstation really close to this (which kinda defeats the purpose) or if you want to watch movies on it. I don't use this to watch movies because I have Chromecast and an AppleTV so this ends up collecting dust.",
      "rating": 3.0,
      "verified": true,
      "author": "Eny Santana",
      "helpful_votes": 0,
      "publication_date": 20161111
    },
    {
      "title": "A wonderfully broken set top box.",
      "text": "I love the Vita. It's a shame the market doesn't, as I think it may be Sony's best product. Alas this means this product is doomed as well. The game selection is dwindling (although the quality is generally much better then found in the Android or iOS). The navigation is a pretty good emulation of the PS Vita touchscreen. If you have a vita or want to own a vita, it's strongly recommended. Alas theare criminally overpriced. If they sorted that... it would be much better.",
      "rating": 4.0,
      "verified": true,
      "author": "Brett Nash",
      "helpful_votes": 0,
      "publication_date": 20150909
    },
    {
      "title": "Viva la Vita!!",
      "text": "Not bad. I own a Vita so it sucks that so many games i own aren't supported but aside from that, I can't complain. PS4 streaming works very well. Media apps aren't really there but I already have roughly a million devices that already run Netflix and Hulu. It's super small, impressively powerful, and surprisingly capable. No regrets at all. Got it for about $40. If you're interested, it's a pretty painless purchase and you just might love it as much as I do.",
      "rating": 4.0,
      "verified": true,
      "author": "Timothy Lewis",
      "helpful_votes": 0,
      "publication_date": 20151012
    },
    {
      "title": "Great for Vita Games! Meh on connecting to PS4",
      "text": "I bought this to play Persona 4 Golden since it was a cheaper option then a Vita and it does just that! I can't wait to play more Vita games now that I have the option. I rated this 4 stars because it will not connect to my PS4. The TV is plugged into the Ethernet with the PS4 being 4 feet away and the router 10 feet away but it says the signal isn't good enough. If it can't connect like that, I would assume others would have problems from doing it on multiple floors or rooms away.",
      "rating": 4.0,
      "verified": true,
      "author": "WitchyWays",
      "helpful_votes": 0,
      "publication_date": 20171227
    },
    {
      "title": "Great device for PS4 Remote Play App",
      "text": "Works extremely well for what I bought it for. I use it specifically to remote play my ps4 from downstairs. The updated software minimized the lag enough that you can even play online multiplayer games and still feel competitive. If you have a bluetooth headset you can even utilize the chat app built into the PS TV. Extremely happy with the purchase as it does exactly what I needed it to do.",
      "rating": 5.0,
      "verified": true,
      "author": "Jonathan S",
      "helpful_votes": 0,
      "publication_date": 20160802
    },
    {
      "title": "PS4 Remote Play is unusable over wifi.",
      "text": "The main feature I wanted to use the Playstation TV for was remote PS4 play. I was able to get it running inside my network but it was/is unusable over wifi, did not try wired. Pretty bad lag as well as quite a bit of artifacts from compression. In the short time I played with it I believe I found that using the headset with the PS4 controller is not supported as well, again didn't dive too far in on that one. Returned.",
      "rating": 1.0,
      "verified": true,
      "author": "Jason J W",
      "helpful_votes": 4,
      "publication_date": 20150729
    },
    {
      "title": "Pretty cool, but not revolutionary by any stretch",
      "text": "It's actually great for what it is, but it still didn't wow me. I really enjoyed the PS Vita and I've owned all the other Sony products. This seemed more like an after thought than a true stand alone device. It's essentially putting the Vita on a TV and the pixelated menus really show that. Pretty cool if you want to play Vita games on the TV, but don't expect it to be much more than that.",
      "rating": 3.0,
      "verified": true,
      "author": "Alan D. Hovanec",
      "helpful_votes": 0,
      "publication_date": 20161127
    },
    {
      "title": "Thank you Sony!",
      "text": "I love that I can connect to my PS4 and stream games when I'm not home. I have been able to play Fallout 4, MKX, and Metal Gear with no lag or dropped connection. If I'm away and my boyfriend is home we can even play Diablo together as if we were on the same system. This is the best thing we could have gotten for our houses. I would get it on amazon for the price, unless you go to a place that price matches.",
      "rating": 5.0,
      "verified": true,
      "author": "Evanna",
      "helpful_votes": 2,
      "publication_date": 20160316
    },
    {
      "title": "I'd recommend just because of how far the price has dropped",
      "text": "3 stars because they removed the ability to just hook up your vita to the tv from the developer models. Otherwise it does what it says. There's little lag when this and the ps4 are in the same house. I'd recommend just because of how far the price has dropped. It saves a lot of hassle.",
      "rating": 3.0,
      "verified": true,
      "author": "bdlk",
      "helpful_votes": 0,
      "publication_date": 20170713
    },
    {
      "title": "A Lacking Micro-Console",
      "text": "It seems like this little micro-console is being phased out. It's capable of playing most PS Vita games at upscaled HD quality, but it is incapable of very basic essentials such as Netflix and a good deal of content from the PS store. It doesn't bear much purpose and isn't worth the $45 price tag or the sold-separately controller.",
      "rating": 2.0,
      "verified": true,
      "author": "zchristianl",
      "helpful_votes": 0,
      "publication_date": 20170318
    },
    {
      "title": "Underrated product for vita owners",
      "text": "There have been so many times where I wished I could play some of my psp or vita games on a large screen with a real controller while at home. This is the perfect solution for playing those rare games that can’t be found on any other platform. I wish I had picked this thing up earlier and really wish Sony had promoted it better because it’s a really great product",
      "rating": 5.0,
      "verified": true,
      "author": "william cronin",
      "helpful_votes": 0,
      "publication_date": 20190214
    },
    {
      "title": "wouldn't not buy it again but for the price its worth keeping",
      "text": "i bought 1 just cause to be honest i paid 30 bucks which is not real expenisve and why i gave it 2 star unstead of 1, the games are just way too limited and remote play works but it hard to play certain games it tents to skip a few frames nothing too serious for a casual game but lets say ur playing something like call of duty 1 skip frame can mean alot, over all the device is promising but dnt think sony will every let it reach its potential",
      "rating": 2.0,
      "verified": true,
      "author": "carlos",
      "helpful_votes": 0,
      "publication_date": 20160105
    },
    {
      "title": "Situationally perfect",
      "text": "Needs more app support. It's runs the PS Vita software. If you want to buy this for your second tv (e.g. Your bedroom) and want to connect up the ps4 to watch movies and Netflix (or whatever), this isn't for you. This is for people who have the unique situation where you keep the ps4 in the living room but want to play their video games in the office or bedroom occasionally. Connectivity is great if wired directly. Hardly any lag. Works great for how I use it.",
      "rating": 5.0,
      "verified": true,
      "author": "Lou",
      "helpful_votes": 0,
      "publication_date": 20160408
    },
    {
      "title": "Save your money if you already have a playstation",
      "text": "This device is pointless. It doesn't do anything I can't already do on my PLaystation as far as I can tell. It came without instructions so, I even had to guess at how to connect it to the tv as well. I was less than impressed with the item as far as usefulness",
      "rating": 1.0,
      "verified": true,
      "author": "Anna Marie Skeens",
      "helpful_votes": 0,
      "publication_date": 20190204
    },
    {
      "title": "Good Times",
      "text": "After ordering this product it came properly packaged and I was excited to receive and try it out. This item is as the directions or the descriptions states it is and the use thereof. I have since enjoyed every minute of using this item and like new item it takes minor adjustments but overall I am happy with my purchase and I’d highly recommend it others, thank you for a great product.",
      "rating": 5.0,
      "verified": true,
      "author": "gary",
      "helpful_votes": 0,
      "publication_date": 20160426
    },
    {
      "title": "Good device",
      "text": "Impressive device. The size of the PlayStation TV is astonishingly small. The device could use a firmware update, but now i'm nitpicking. If you have the internet speed, this can be very useful for remote play. The PlayStation tv lost value when Sony made a desktop app that allows remote play, but if you want a more permanent device to be able to remote play, I can recommend the PlayStation TV.",
      "rating": 4.0,
      "verified": true,
      "author": "Seth Walls",
      "helpful_votes": 2,
      "publication_date": 20160513
    },
    {
      "title": "It aight",
      "text": "Good lil gimmick if your parents Vita breaks I'd recommend a ps4 more, only problem I had with the path is it doesn't play all the games from the Vita only a select few titles. Look on their website for the selection of playable Vita titles compatible with the pstv, as for delivery it was spot on and on time, so we good",
      "rating": 3.0,
      "verified": true,
      "author": "Saul",
      "helpful_votes": 0,
      "publication_date": 20180213
    },
    {
      "title": "Great for PS Now",
      "text": "So far working awesome, it seems like some games are really heavy for it but it manages. What I love the most is using it with ps now. If you already have a vast collection of available titles on the store this would be a cheap and fine choice, also if you are willing to use ps now",
      "rating": 5.0,
      "verified": true,
      "author": "René grete",
      "helpful_votes": 0,
      "publication_date": 20170204
    },
    {
      "title": "This is a great product, but you have to know what you ...",
      "text": "This is a great product, but you have to know what you are getting. This is not a netflix, web app box. This allows you to play SOME of the games you have on Vita memory card on your tv using either a DS 3 or DS 4 controller. If there is a specific game you want to play with it do some research first as not all games will work with this. The OS is pretty much identical to the OS on a Vita.",
      "rating": 5.0,
      "verified": true,
      "author": "Coleman",
      "helpful_votes": 0,
      "publication_date": 20160310
    },
    {
      "title": "Very cool device. Considering a standard a Vita is still ...",
      "text": "Very cool device. Considering a standard a Vita is still in the hundreds of dollars, this was a great alternative that allows play of Vita games. I actually prefer having access to them on a television as well rather than on the handheld's screen. The UX could have used some tweaking for the TV version as it feels a bit awkward to maneuver without a touchscreen and some the UI elements seem out of place on a TV as well like the menu bar at the top. Other than those minor complaints the PSTV is a really solid gaming device.",
      "rating": 5.0,
      "verified": true,
      "author": "Donnie McNeil",
      "helpful_votes": 0,
      "publication_date": 20151226
    },
    {
      "title": "I love this thing",
      "text": "I love this thing. Makes Playstation Plus an even better deal. Only point of frustration: No netflix. No Youtube app either, but you can play youtube videos in the browser, so that's a moot point. The only complaint I have is the stupid proprietary memory cards. If Sony would just make them use the Micro SDHC cards we all have kicking around these would probably sell much better.",
      "rating": 5.0,
      "verified": true,
      "author": "Justus",
      "helpful_votes": 0,
      "publication_date": 20150929
    },
    {
      "title": "and I love it. So far I've played two PSP games ...",
      "text": "I use it to play the handheld games on the big screen, and I love it. So far I've played two PSP games on it and it works great. Of course I had to shell so extra cash for a memory card, but that can't be helped. It was delivered quickly, and came with all the wires. I already own a PS 3 so I just used that controller for the system. Overall if you just want to play Vita and PSP games on one system, this is a good buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Cwolf",
      "helpful_votes": 0,
      "publication_date": 20150704
    },
    {
      "title": "This was the perfect solution.",
      "text": "I've seen lots of reviews that mention this does not work well over Wi-Fi. I have not had any issues so far using the PS4 Direct Connect feature over Wi-Fi. I keep my PS4 in the living room and wanted to be able to play it on my projector in the basement. This was the perfect solution.",
      "rating": 5.0,
      "verified": true,
      "author": "R.F. Knotts",
      "helpful_votes": 0,
      "publication_date": 20180409
    },
    {
      "title": "It's Ok thats about it",
      "text": "It's Ok. That pretty much describes this thing. It does some cool stuff but looks pretty ugly doing so. However, if you want to remote play something (from very close to your PS4) or play extra vita/ps1 games its worth 50 bucks. Not disappointed because I knew what I was getting. An unnecessary but sometimes fun tiny gaming box (and its very tiny).",
      "rating": 3.0,
      "verified": true,
      "author": "RadoBikeNBeer",
      "helpful_votes": 2,
      "publication_date": 20150417
    },
    {
      "title": "SUPER UNDERRATED",
      "text": "Dang this thing is UNDERRATED! its NOT a streaming player, and the youtube videos you see of this, MISLEADING. the lower-res is barely noticeable, and if you don't have much money and want a good console, THIS IS IT!",
      "rating": 5.0,
      "verified": true,
      "author": "Somebody you don't know.",
      "helpful_votes": 3,
      "publication_date": 20160822
    },
    {
      "title": "Great with PS Now account!",
      "text": "I like the options this device provides and still use it weekly a year later. I love the fact I can use my PS Now account with it and at the same time someone else can use the PS4 in the Den. Note: Hard wire network connection is a must. I would buy another no problem.",
      "rating": 5.0,
      "verified": true,
      "author": "D Morgan",
      "helpful_votes": 0,
      "publication_date": 20190106
    },
    {
      "title": "Too much delay",
      "text": "I only bought this for remote play over a home network. My ps4 is setup on a monitor in the basement. I was looking to play sports games on the first floor tv. Wireless is unplayable as it has a terrible picture and lag. Wired, the picture is much better but there is a slight delay in button response in the game and that is frustrating when throwing screen passes or kicking FGs. Once this happened, I promptly boxed it up and returned it",
      "rating": 2.0,
      "verified": true,
      "author": "Skinny",
      "helpful_votes": 0,
      "publication_date": 20171224
    },
    {
      "title": "Good",
      "text": "Sometimes it won't read my memory card, so I have trouble launching a game, but retrying a couple of times will get it to work eventually. It's not that much of a hassle, so I still think it's a good product overall.",
      "rating": 4.0,
      "verified": true,
      "author": "Yannick",
      "helpful_votes": 0,
      "publication_date": 20180521
    },
    {
      "title": "Great device, great price! ... Wish i could say the same about it's memory cards.",
      "text": "I love this little device. The price is great and by now there's a good list of games to play on it that are priced great. If you own a PS3 or PS4 already it's an even better deal as you won't need to buy a controller for it. The only thing I'm not crazy about is the idea of buying Sony's expensive memory cards, but I suppose I can get around that by buying the physical games and staying away from the PSN.",
      "rating": 4.0,
      "verified": true,
      "author": "The Lucky Azazer",
      "helpful_votes": 0,
      "publication_date": 20160118
    },
    {
      "title": "Very slow to do anything. Bought this to stream ...",
      "text": "Very slow to do anything. Bought this to stream games from the PS4 but the lag when streaming from the PS4 makes most games unplayable. Connected via wired ethernet gig on both sides through a gig switch. Still too much lag.",
      "rating": 1.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 3,
      "publication_date": 20160221
    },
    {
      "title": "Great game console, but not for everyone",
      "text": "Nice game console, good price and seller shipped this to Mexico City. I can not be more happy. The main reason to buy this, was to play more comfortable P4 Golden when I play at home. There were 5 PSVita games I own and tested on the PSTV system, just 2 of them can be played. Also tested with PSOne classics and PSP games, and all worked well. Not tested yet, but soon I will, is the PS4 remote play function on a wired LAN, so I hope there will be no problems with the system.",
      "rating": 4.0,
      "verified": true,
      "author": "Benito Godinez",
      "helpful_votes": 0,
      "publication_date": 20180409
    },
    {
      "title": "Great product. Exactly what I ordered",
      "text": "Great product. Exactly what I ordered. Perfect shipping. This thing remotes your ps4! Was able to play online ps4 games from tv in living room with the ps4 turned on in bedroom! Exactly what I wanted! No more moving the system!",
      "rating": 5.0,
      "verified": true,
      "author": "Adam",
      "helpful_votes": 2,
      "publication_date": 20160708
    },
    {
      "title": "Very satisfied",
      "text": "Awesome little device. I took my SD card from my Vita (that has my profile and all my games) and placed it in the Playstation TV and all of my purchased games were now available to play on my big screen. Very nice! All of my Ps1 classics! Final Fantasy! Suikoden! Resident Evil! Yeaaaaaahhhhhh!",
      "rating": 5.0,
      "verified": true,
      "author": "Corrina Byrne",
      "helpful_votes": 2,
      "publication_date": 20151112
    },
    {
      "title": "PS4 remote play is too laggy even with a wired connection",
      "text": "I bought this exclusively for remote play on another TV in the same house as my PS4. Both my PS4 and PSTV were connected via ethernet cable (no wireless), but there was still a 0.25 - 0.50 second lag after button presses. This made my type of games (action) unplayable if I wanted to do well. A game that doesn't need fast responses would be playable.",
      "rating": 2.0,
      "verified": true,
      "author": "JD",
      "helpful_votes": 0,
      "publication_date": 20150909
    },
    {
      "title": "Does exactly what I wanted it to.",
      "text": "I'm very pleased with the PSTV. Yes, it lacks compatible apps such as Netflix. Crunchyroll works with it but is really slow and choppy. However, I got this for the sole purpose of playing my Vita games at home on my tv. It does this perfectly. It can scale the image up to a max of 1080i and some games even run smoother on the PSTV than on the Vita (namely Corpse Party: Blood Drive). It can also play just about any PS1 and PSP games that the Vita can. I highly recommend this. But, DO NOT buy this if all you're looking for is an alternative to Roku or Chromecast. You'll be disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "vaerinurface",
      "helpful_votes": 0,
      "publication_date": 20160131
    },
    {
      "title": "Used for streaming video and audio, not gaming",
      "text": "I did not intend to use this for streaming video games so if this may not be what you are looking for. I basically have a small TV where I play games on but every time I wanted to watch a movie I had to connect either my laptop to the larger TV downstairs or bring my PS4 all the way down. Now I have an external Hard Drive connected to my PS4, and a PSTV connected to the larger TV. No more disconnecting and reconnecting the PS4. As a streaming device for movies, TV shows and music its pretty darn good.",
      "rating": 4.0,
      "verified": true,
      "author": "Muhammad S.",
      "helpful_votes": 0,
      "publication_date": 20170103
    },
    {
      "title": "Does it do the job? Yes it does!",
      "text": "This little device is a steal for what you get. As a dad, it's tough to get any game time with a little one crawling around. This allows me to remote play my ps4 on another TV in my house if I happen to have a free moment. It also lets me finally have access to all of those psOne classics that no longer work on the ps4! My only complaint is that I need to buy a ps vita memory card to store any downloaded games.",
      "rating": 5.0,
      "verified": true,
      "author": "JE",
      "helpful_votes": 2,
      "publication_date": 20151129
    },
    {
      "title": "Game library is surprisingly large",
      "text": "This product deserved more love from PlayStation. I have a psvita already and playing the majority of my games on the big screen is great. Killzone is a must. If your looking for a cheap alternative to a PS console or a way to remote play in a different room. This is a great buy. Keep in mind you'll need a PS Vita memory card and a dualshock 3 or 4 to play. If your like me you'll have extra just sitting around.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew Linkous",
      "helpful_votes": 0,
      "publication_date": 20170323
    },
    {
      "title": "easy and a ton of fun",
      "text": "you can do a lot with this pstv with a little google search. playing old nintendo games and loving the bubble style navigation. sleek and small but packs a big punch. super fast and everything youd expect from sony. you wont be let down.",
      "rating": 5.0,
      "verified": true,
      "author": "PurriousClowder",
      "helpful_votes": 0,
      "publication_date": 20171113
    },
    {
      "title": "Do not recommend you buying this unless you have money",
      "text": "Very decent device to do micro gaming it is has his weaknesses and strengths Sony should have sold it with the memory card at a combined package Sony is greedy also should have came with controller very good product very cheap product",
      "rating": 3.0,
      "verified": true,
      "author": "jamil",
      "helpful_votes": 0,
      "publication_date": 20190404
    },
    {
      "title": "Device didnt work when I got it.",
      "text": "Device would not connect to my controllers now matter what combination I tried. I was never even able to set it up. I would have loved it if it actually played, had the games it comes with and could connect to my PS4 to allow me to play in my bedroom too. Maybe my unit was defective, but I was severely disappointed.",
      "rating": 2.0,
      "verified": true,
      "author": "R. Ray",
      "helpful_votes": 0,
      "publication_date": 20151220
    },
    {
      "title": "Works okay, but remote play has flaws",
      "text": "I bought this for the single purpose of playing my Ps4, which is located in my living room, in my bedroom. It works, but even with a good network, it often lags and distorts. Ps4 is hard wired, but use this wirelessly, as I really don't want to run wires to the upstairs.",
      "rating": 3.0,
      "verified": true,
      "author": "Andy Neff",
      "helpful_votes": 2,
      "publication_date": 20151112
    },
    {
      "title": "When it works well its great, but it frequently locks up",
      "text": "When it works well its great, but it frequently locks up , I bought it mostly to play vita games on since my eyes make it harder every year to see that tiny screen, but not enough games are compatible with the pstv.",
      "rating": 4.0,
      "verified": true,
      "author": "Kyle 07",
      "helpful_votes": 2,
      "publication_date": 20160706
    },
    {
      "title": "Such a good little device.",
      "text": "For those of us who do not want to schlep around a device, and enjoy Vita games, this is the best solution. It's smaller than an iPhone 6. The Vita TV takes zero time to set up. Anyone looking to get into the rich Vita exclusives should pick this up. I use a PS4 controller with this, but it will work with a PS3 controller.",
      "rating": 5.0,
      "verified": true,
      "author": "Benjamin F. Cohen",
      "helpful_votes": 0,
      "publication_date": 20151113
    },
    {
      "title": "It was easy to set up and get a controller working",
      "text": "I have a lot of PSOne ports that I have been wanting to play on a larger screen than my Vita (no PS4 support), and this has done the job. It was easy to set up and get a controller working. Biggest drawback is the interface. It is the hand held Vita's interface and it does not make a seamless transition from Vita to controller. Other than that, the system works exactly like I hoped it would.",
      "rating": 4.0,
      "verified": true,
      "author": "Edward H",
      "helpful_votes": 0,
      "publication_date": 20180326
    },
    {
      "title": "and I have to say I have been really disappointed. There is a noticeable lag when using PS4 ...",
      "text": "I bought PlayStation TV exclusively for PS4 streaming, and I have to say I have been really disappointed. There is a noticeable lag when using PS4 remote play on this, and it makes any FPS/racing game completely unplayable. PS4 is supposed to be adding PC remote play in the future which will make this completely obsolete, although it's probably considered obsolete already...",
      "rating": 2.0,
      "verified": true,
      "author": "Chris Q",
      "helpful_votes": 0,
      "publication_date": 20160121
    },
    {
      "title": "Extremely disappointed...",
      "text": "There is terrible lag time. My husband was so excited when I gave this to him and he even direct wired his PS4 and the PSTV to the modem and it still had a lag that made the game unplayable. I'll note that the game he's playing is a fast paced one. MAYBE it would work good for slower paced games, but that's not what I bought it for. I've since researched this lag issue and found on forums the same problem has been happening since 2014...3 years and they haven't fixed this problem. Shake my head Sony, shake my head. I'll be returning this tomorrow.",
      "rating": 1.0,
      "verified": true,
      "author": "SD",
      "helpful_votes": 5,
      "publication_date": 20170312
    },
    {
      "title": "...rather nice for what it is...",
      "text": "Works rather nicely for what it is. In no way is this even remotley a ps console. But its nice, you can play most vita games on a big screen which is pretty awesome. But you can't access netflix on it which suxs. All in all its an okay addition if you wanna spend the money.",
      "rating": 4.0,
      "verified": true,
      "author": "TimeKiller",
      "helpful_votes": 0,
      "publication_date": 20160317
    },
    {
      "title": "Bought this to stream my ps4 to a TV, ...",
      "text": "Bought this to stream my ps4 to a TV, but it lags a lot its not possible to play with this. Also it doesnt work on video streaming.",
      "rating": 2.0,
      "verified": true,
      "author": "JCarax",
      "helpful_votes": 3,
      "publication_date": 20170502
    },
    {
      "title": "Well worth the money - even better with PSPlus",
      "text": "This absolutely does everything I want, playing my Vita games on the go and then switching them to the big screen by only swapping the game cartridge or downloading the saved game off Playstation Plus. The only downside is it's currently not compatible with the Playstation Wireless Headset despite having USB ports, though I hope Sony adds support for this in a future update.",
      "rating": 5.0,
      "verified": true,
      "author": "AC Ward",
      "helpful_votes": 3,
      "publication_date": 20141218
    },
    {
      "title": "I was surprised it even works with some PSP titles like Dissidia Final Fantasy",
      "text": "The PS TV is a decent buy once you know what you want to use it for. Thanks to the PS TV I can play Freedom Wars, IA/VT Colorful, and Project Diva X on the big screen. I was surprised it even works with some PSP titles like Dissidia Final Fantasy. The only negative I've experienced with it so far is controller input lag. When it comes to button heavy games like Project Diva for example, it doesn't always register button presses on time and instead registers it a little late.",
      "rating": 4.0,
      "verified": true,
      "author": "Jason",
      "helpful_votes": 0,
      "publication_date": 20160724
    },
    {
      "title": "I was pretty shocked how small it actually it",
      "text": "Hubby likes it, you can download PSvita games to it and you can also use the Vita games right in the box. The unit itself is impressively tiny, I was pretty shocked how small it actually it. There are a lot of platforms out for watching hulu and netflix so if that is all you want this box for I would recommend saving your money and buying a cheaper unit.",
      "rating": 4.0,
      "verified": true,
      "author": "firecracker",
      "helpful_votes": 0,
      "publication_date": 20150222
    },
    {
      "title": "If you're playing sports games it may be an issue but ur typical role playing game should be fine.",
      "text": "The only reason I bought this was to play PS4 in another room.... I connected botht he system and the ps4 to ethernet and it worked well with little delay. If you're playing sports games it may be an issue but ur typical role playing game should be fine.",
      "rating": 4.0,
      "verified": true,
      "author": "Harm",
      "helpful_votes": 2,
      "publication_date": 20150914
    },
    {
      "title": "16inch monitor, DS4 controller and let the jrpgs madness run",
      "text": "This is great for enjoying jrpgs with the ds4 on a small monitor and taking advantage of the standby function. Vita games perform great, and the touch pad on the ds4 acts as a touch screen replacement, very nice. It could be better, but for me playing Suikoden 2 at my desk and then taking it on my vita on the road is just too freaking awesome",
      "rating": 4.0,
      "verified": true,
      "author": "O. R. Rodriguez",
      "helpful_votes": 0,
      "publication_date": 20150118
    },
    {
      "title": "Great product for the price!",
      "text": "Very good product for the price. I'm currently attempting to use it for remote play(PS4) across states. It’s not as forgiving or reactive as PS VITA. I suppose the video quality has a lot to do with it. I haven’t had the chance to try it with a LAN connection. I’m sure that with a LAN, the PStv will allow games to be played from a great distance. I admit the system isn’t really designed for this. But hey, I used it the way I want to. The only reason why I gave this product 4 stars is because Netflix wouldn’t load on it whereas on the Vita its fine.",
      "rating": 4.0,
      "verified": true,
      "author": "DeVaughn McKinney",
      "helpful_votes": 0,
      "publication_date": 20160205
    },
    {
      "title": "Very Good replacement for Vita",
      "text": "Giving it a 5 stars because I feel like if I had this before I decided to get my Vita, I would definitely have gotten this instead. Not is only cheaper, but I can play Vita games with my PS4 controller. Simply connect the USB to your PS4 controller, turn the PSTV on, wait until the PSTV screen is fully on and gives you that \"Press PS Button.\" Press the PS4 controller's PS button and there you go. You'll have to do the same thing if you decide to reconnect it back to your PS4.",
      "rating": 5.0,
      "verified": true,
      "author": "Fabian Chang",
      "helpful_votes": 0,
      "publication_date": 20151208
    },
    {
      "title": "I bought one for persona",
      "text": "And it plays persona. So it was wurf for me",
      "rating": 5.0,
      "verified": true,
      "author": "Lucidafflictions",
      "helpful_votes": 4,
      "publication_date": 20170717
    },
    {
      "title": "Get a PS Vita instead.",
      "text": "Product is missing too much functionality to be useful and some games that should be compatible aren't. The amount of scaling done to get the image to 1080p makes everything look like a blurry mess, even the main menu. I see no reason to own this while the PS Vita is still around.",
      "rating": 3.0,
      "verified": true,
      "author": "Darkside Hero",
      "helpful_votes": 2,
      "publication_date": 20150218
    },
    {
      "title": "The interface is just like my PS Vita",
      "text": "Bought this to stream games from my PS4. The interface is just like my PS Vita. Only supports 2.4ghz, (missing 5ghz wifi) which really hurts streaming. Streaming is alright, 720p and there's some minor latency. Just looks bad on my 70\" TV to stream 720p",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160504
    },
    {
      "title": "This thing can do it all",
      "text": "At first I was very sceptical about the uses of this pstv. But I decided to buy it anyway and man am I glad I did! I can now play vita games on a bigger screen! You can also use the remote play for the ps4 which is just another great feature on this little device. I would not recommend buying this if you plan on remote playing any games that are online because it is a little laggy but other than that this thing can do it all! Very satisfied with my purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Mason Davis",
      "helpful_votes": 2,
      "publication_date": 20160122
    },
    {
      "title": "It's great for travel",
      "text": "I got it on a cheap deal ($35). Kind of worth it at that price, totally in at <$30. It's great for travel, but streaming ps4 to bedroom can be rough (2 bdrm apt). If you have a wired setup at home, then this will be pretty close to a 2nd PS4. Also great to play vita games on a tv, and PS Plus keeps it full and fresh.",
      "rating": 4.0,
      "verified": true,
      "author": "John m linehan",
      "helpful_votes": 2,
      "publication_date": 20151202
    },
    {
      "title": "The streaming sucks.",
      "text": "Not supported anymore, and what you'd expect out of a basic 'tv' device is to atleast play netflix but it can't even do that. The streaming sucks.",
      "rating": 1.0,
      "verified": true,
      "author": "frankie riley",
      "helpful_votes": 3,
      "publication_date": 20170722
    },
    {
      "title": "Exactly what I wanted.",
      "text": "Love this device. My eyesight is not too good to be playing on small screens like the PS Vita and this was the perfect fit for me since I can now play my Vita games on the big screen.",
      "rating": 5.0,
      "verified": true,
      "author": "Dan",
      "helpful_votes": 0,
      "publication_date": 20170331
    },
    {
      "title": "I got it for pretty cheap, it's actually pretty amazing for me personally",
      "text": "I got it for pretty cheap, it's actually pretty amazing for me personally, it's a nice smaller portable way to play PSP, PS1, and Vita games in HD. It can literally fit in your pocket, just an HDMI cord, a cable, a memory card, and a tv and you're good to go.",
      "rating": 5.0,
      "verified": true,
      "author": "Jay Johnson",
      "helpful_votes": 0,
      "publication_date": 20151008
    },
    {
      "title": "much smaller than i expected but i am very happy with it",
      "text": "much smaller than i expected but i am very happy with it. it is basically a vita that plays vita games, only some of them arent compatable, very nice to have.",
      "rating": 5.0,
      "verified": true,
      "author": "Jonathan V.",
      "helpful_votes": 2,
      "publication_date": 20170410
    },
    {
      "title": "Good but not great.",
      "text": "There are many reasons to love the PSTV. Remote play is the main reason. Being able to stream your PS4 to another room is awesome. But foe the few short comings it may have they are blaringly annoying. There is a lag in remote play of you're playing an FPS, not terrible if you're running and gunning but good luck sniping. The lack of native apps keeps it from being more than just something that'll play most of your Vita games.",
      "rating": 4.0,
      "verified": true,
      "author": "Americo",
      "helpful_votes": 0,
      "publication_date": 20150116
    },
    {
      "title": "A simple system",
      "text": "I bought this to play Vita games on my TV and it works. However be aware of the fact that not all games are compatible with the PSTV. Otherwise, it's a great system for its price.",
      "rating": 5.0,
      "verified": true,
      "author": "Javier Rodriguez",
      "helpful_votes": 3,
      "publication_date": 20160724
    },
    {
      "title": "Disappointed",
      "text": "The stream from my PS4 to TV was poor quality and it's only one room over. I figured I could use it now just for PlayStation now which I have but it says that service has ended on this device. Now I can only play a couple of games on it that I've bout on the PS3 that was also supported on on the PS Vita but there's not enough internal memory on it to play barely anything I have and I'm not willing to buy a Vita memory card.",
      "rating": 2.0,
      "verified": true,
      "author": "Private",
      "helpful_votes": 0,
      "publication_date": 20180831
    },
    {
      "title": "Horrible.",
      "text": "Sony should refund me. They didn't do anything with this product. It doesn't even have PS Vue, their TV streaming service. Now they've discontinued this product.",
      "rating": 1.0,
      "verified": true,
      "author": "Ryan",
      "helpful_votes": 0,
      "publication_date": 20180325
    },
    {
      "title": "Great Value",
      "text": "It's great so far. I love being able to play my Vita games on the big screen. Only issue is that it does not have a Netflix app. Luckily, Hulu works fine.",
      "rating": 4.0,
      "verified": true,
      "author": "Charles",
      "helpful_votes": 0,
      "publication_date": 20180120
    },
    {
      "title": "Pretty cool Device, Minor Hiccups",
      "text": "I love the PlayStation TV; only with an Ethernet connection to my PlayStation as well as the PS TV from my router. Its the only way to get the optimal performance out of the PS TV. I have streamed The Last of us, Diablo 3, and The Elder Scrolls Online. They all worked perfectly. If you try to run Black ops 3 or a FPS than I would suggest using your original PlayStation. There Is a very noticeable lag that is induced while running Black ops 3. Hope this Posts helps, and I have my router with my ports forwarded.",
      "rating": 4.0,
      "verified": true,
      "author": "V31L",
      "helpful_votes": 0,
      "publication_date": 20160111
    }
  ],
  "product_meta": {
    "title": "PlayStation TV",
    "description": "A new, simple and fun way to enjoy a universe of PlayStation games and entertainment with the entire family. Whether as a second console for your bedroom or the primary gaming system in your living room, PlayStation TV is an easy way for gamers of all ages and skill levels to enjoy playing games together. \n\nA DUALSHOCK 3 or 4 controller (sold separately) is required.\nPlayStation Now Service may not be available in all areas.",
    "rating": 4.3,
    "feature_bullets": [
      "Hundreds of PlayStation games to choose from: Including many PlayStation Vita games such as Killzone: Mercenary, God of War Collection, and Borderlands 2, classic games from PS One and PSP systems, and more.",
      "Remote Play: Stream most of your PS4 games from your PS4 system to your PlayStation TV over local Wi-Fi (robust Wi-Fi or wired connection recommended).",
      "Easy to Set up and Play: Plug in and play on any HDMI compatible TV in your home.",
      "PlayStationNow READY: Available later this year, PlayStation Now will give access to an expanding library of PS3 games to stream directly to PlayStation TV.",
      "Access to Entertainment: Games, movies, TV shows, and apps on PlayStation Store."
    ],
    "specifications": {
      "ASIN": "B00KVMHSUM",
      "Release date": "October 14, 2014",
      "Customer Reviews": "4.3 out of 5 stars1,297 ratings4.3 out of 5 stars",
      "Best Sellers Rank": "#13,260 in Video Games",
      "Pricing": "The strikethrough price is the List Price. Savings represents a discount off the List Price.",
      "Product Dimensions": "6 x 8 x 2 inches; 1 Pounds",
      "Binding": "Video Game",
      "Rated": "Rating Pending",
      "Item model number": "3000413",
      "Is Discontinued By Manufacturer": "No",
      "Item Weight": "1 pounds",
      "Manufacturer": "Sony",
      "Date First Available": "June 8, 2014"
    },
    "categories": [
      "Playstation TV",
      "Microconsoles",
      "Video Games"
    ],
    "price": 174.95
  }
}