{
  "website_summaries": [
    {
      "verdict": "The JBL Clip is good for someone looking for a very compact, travel-friendly wireless speaker that's more affordable than the Jambox Mini.",
      "pros": [
        "The JBL Clip Bluetooth speaker is a compact, hockey-puck size speaker that has a built-in lithium ion rechargeable battery and offers decent enough sound for its size",
        "It also has an integrated line-in cable that stows away in the bottom of the device, as well as speakerphone capabilities"
      ],
      "cons": [
        "Doesn't handle big bass well and distorts at higher volumes"
      ],
      "aspects": {
        "Design": 8.0,
        "Features": 8.0,
        "Sound": 7.0,
        "Value": 8.0
      },
      "publication_date": 20140620,
      "rating": 7.8,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Especially a good buy if you find it on sale",
      "text": "Sound quality is okay. I've taken it snowboarding and sometimes it drops blue tooth connection. Even when the other device is only in my jacket pocket by itself. During the summer I clip it to the side of the BBQ and basically use it as the outdoors music maker. Just don't looks for any sound fidelity. Especially a good buy if you find it on sale.",
      "rating": 3.0,
      "verified": true,
      "author": "T.",
      "helpful_votes": 2,
      "publication_date": 20160610
    },
    {
      "title": "Won’t charge, product is a DUD",
      "text": "Had a few good months using this to supplement audio while watching movies on my iPad. But then it stopped charging. Red charging light comes on for a few minutes and then shuts off. Even if I babysit it and unplug/replug to get the connection going it won’t charge. Tried multiple cables etc and a bit of online research revealed that my issue is common. Stay away, they should not be continuing to sell this product.",
      "rating": 1.0,
      "verified": true,
      "author": "click",
      "helpful_votes": 0,
      "publication_date": 20180101
    },
    {
      "title": "I'm giving this cool yet affordable speaker a 3 out of 5 stars",
      "text": "I'm giving this cool yet affordable speaker a 3 out of 5 stars. The reason it gets a 3 & not a 4 or 5 stars is that it doesn't feature any buttons other then blue tooth connect & power. If this speaker came with a play/pause button & a skip song button which could of all been done with 1 button it would of got 4 stars. With 1 extra button we could, press once to play, double tap to skip to next song & hold to pause. Another issue I found with it was that @ full volume (which is pretty loud) the batter is on red after 45mins of play.",
      "rating": 3.0,
      "verified": true,
      "author": "Michael S.",
      "helpful_votes": 0,
      "publication_date": 20151012
    },
    {
      "title": "No complaints!",
      "text": "I used this as a substitute speaker in my car when the radio went out and I didn't want to pay to fix it. Sounded pretty good, and fooled more than a few of my friends into thinking I just had below average car speakers. I left mine plugged into the charging port, so I can't speak to the battery life. I would recommend this speaker.",
      "rating": 5.0,
      "verified": true,
      "author": "BeardyMan92",
      "helpful_votes": 0,
      "publication_date": 20190224
    },
    {
      "title": "Good speaker",
      "text": "This speaker was great at first but I think the battery doesn't give as much as it did the first couple of weeks, I usually play a lot of death metal, and the speaker gives out at full volume I give it about 45 mins to and hour maybe, it was a good run, I still use it here and there but this item needs to be taken care of more than you would expect, good bass though I'll give it that!",
      "rating": 4.0,
      "verified": true,
      "author": "Fernando Carrillo",
      "helpful_votes": 0,
      "publication_date": 20170226
    },
    {
      "title": "Great sound, short battery life & doesn't hold a charge",
      "text": "The item has great sound. You'll really be surprised how good the sound is from this little thing. Sadly, the battery life is atrocious. At max volume it reaches just over an hour. If you try to keep it charged, it will discharge itself. You have to charge it just before you're going to use it. If you charge it one day before, you'll already have lost half the battery charge. Too bad, because it has great potential, but this is a great annoyance.",
      "rating": 3.0,
      "verified": true,
      "author": "LightAnt",
      "helpful_votes": 0,
      "publication_date": 20151003
    },
    {
      "title": "I loved it, but now it distorts a little bit",
      "text": "When I first got this, I loved it, but now it distorts a little bit. Using it in bluetooth for a phone doesn't work very well. It doesn't work as good as my speakerphone setting on my phone, but it is louder than the phone.",
      "rating": 3.0,
      "verified": true,
      "author": "Larry W.",
      "helpful_votes": 0,
      "publication_date": 20180207
    },
    {
      "title": "Batteries in these are BAD",
      "text": "I liked this little speaker. Had this and the Flip2. The Clip is basically half of a Flip2, but still puts out decent sound, and the clip is really nice. Ihave clipped it to a backpack or a belt loop, and worked great until.... after a few months the battery stapped holding a charge. This happened with my Flip2 also, but that one lasted around 10 months before it stopped holding a charge. Seems like this is a common issue. Maybe the new ones are better, but I'll spend a little extra next time and stay away from JBL.",
      "rating": 2.0,
      "verified": true,
      "author": "Jake",
      "helpful_votes": 0,
      "publication_date": 20151107
    },
    {
      "title": "Loud and no static or stutters",
      "text": "This thing is loud! I'm also quite impressed by its Bluetooth connectivity. I did have a Bose Bluetooth speaker and it seemed like it didn't have the ability to move very far away the music source (my cell phone). This JBL speaker doesn't stutter at all when my phone is upstairs on the other side of the house, still works fine when I leave my phone inside the house and just take the speaker outside to the pool. Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Blue Shampoo",
      "helpful_votes": 0,
      "publication_date": 20150409
    },
    {
      "title": "JBL iClip speaker",
      "text": "sounds GREAT! I bought it to link with my apple iPad, to listen to music while in the car. The quality of sound that it has is very impressive. It can get very loud. The clip is built in so you do not have to worry about losing it. You can daisy chain several together for a more stereo sound. Being able to control the volume from the device as well as my iPad makes it easy to control the volume.",
      "rating": 5.0,
      "verified": true,
      "author": "Thorman",
      "helpful_votes": 0,
      "publication_date": 20151202
    },
    {
      "title": "Fantastic Little Speaker",
      "text": "Great speaker and great price, its small and easily portable, the aux cable in the back is a nice touch, although I dropped it and caught it by that cable once and now its finicky. Its great having the microphone as well. The sound is clear and powerful. Battery life is great. Definitely recommend this, JBL put a lot of thought into these little speakers.",
      "rating": 5.0,
      "verified": true,
      "author": "Cruxcrater",
      "helpful_votes": 0,
      "publication_date": 20170105
    },
    {
      "title": "Big Mistake",
      "text": "This has been a big disapointment, product has a nice deep sound buy the duration of time it will play is not as long as described. Initially I got buy listening to it while plugged in at work while driving. Just got done walking the dog and it won't even last a freakin hour. Save your money and look for something 1/2 the cost.",
      "rating": 1.0,
      "verified": true,
      "author": "Tim P.",
      "helpful_votes": 0,
      "publication_date": 20170310
    },
    {
      "title": "a turn off",
      "text": "this thing is quite irritating. it turns itself off when riding a bike. nothing special I can see causing it. all of a sudden while biking along it shuts off - and, stops the music on the iPhone. then you need to look down and find the button to turn it on. unfortunately, the button doesn't have a firm feel to it when you turn it on, so you need to look down and confirm the light is on that shows it is working. other than that, it plays fine, was easy to connect to my iPhone.",
      "rating": 2.0,
      "verified": true,
      "author": "M. Baxter",
      "helpful_votes": 0,
      "publication_date": 20160306
    },
    {
      "title": "Love it",
      "text": "I love this little thing. If you weren't looking at it yoi would think that it was a bigger and more expensive speaker because it sounds that good. It's not going to sound as good as a bose soundlink or other $200 or $300 bigger speakers, but it does sound amazing for it's size. I've had this for 4 months with very hard use and it has held up very well. It hasn't started to fall apart and the speaker still sounds brand new. Amazing little thing.",
      "rating": 5.0,
      "verified": true,
      "author": "Jake Higgins",
      "helpful_votes": 0,
      "publication_date": 20150913
    },
    {
      "title": "i ws given one of these for my birthday a ...",
      "text": "i ws given one of these for my birthday a year ago. i have used it very much since received. i had it at work one day and a friend asked about it. i decided to get a really birthday present and give him the speaker. he loves it so much.",
      "rating": 5.0,
      "verified": true,
      "author": "Dan Gona",
      "helpful_votes": 0,
      "publication_date": 20170531
    },
    {
      "title": "Great sound for a little speaker",
      "text": "This speaker sounds great and are extremely easy to use / operate. Out of 3 I have had .. I only had issues with one of the units battery's which had a very short battery life.....Half hour and they normally last a few hours. Great soundings portable speaker thou and I would recommend.",
      "rating": 4.0,
      "verified": true,
      "author": "Martini81",
      "helpful_votes": 0,
      "publication_date": 20170909
    },
    {
      "title": "Great Speaker",
      "text": "This was a lot louder than i thought it would be! I love this speaker. The only thing is the battery life. I put this on while i do work on my computer sometimes and it usually lasts some (3-5?) hours till i have to charge it. It's A LOT smaller than i thought it would be - it's tiny! But the sound it huge. If you're looking for a lot of bass though, look elsewhere because this is not a product for bass heads. It charges pretty quickly too.",
      "rating": 5.0,
      "verified": true,
      "author": "Caleb Lewis",
      "helpful_votes": 0,
      "publication_date": 20150811
    },
    {
      "title": "Auto Power off ruins it, won't stay on and really frustrating. Would not buy again",
      "text": "Great sound, size, etc . . . all the goodness is canceled because it won't stay on . . . auto power off makes it virtually worthless the way I use it, which is to improve my laptop speakers and microphone for conference calls. Would not buy this product again, I had the same model without auto power off and it was great, used it so long the cable finally broke . . . wish I could find that old model.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171021
    },
    {
      "title": "Big sound in small package",
      "text": "I read the review on this speaker and made my decision! This is one powerful speaker with no scratchy sound. I synced with an Android tablet and an iPhone with no problems. It also has a jack to plug right in, so easy to use. You will not be disappointed with the sound! It's also a nice size, fits in the pocket easily, nice and flat, but sturdy quality case.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie Urban",
      "helpful_votes": 0,
      "publication_date": 20150105
    },
    {
      "title": "Good if it's staying stationary",
      "text": "Great speaker...good sound. After about a month just know it will most likely have to be charging at all time of use...but it sounds good!",
      "rating": 5.0,
      "verified": true,
      "author": "SD",
      "helpful_votes": 0,
      "publication_date": 20200504
    },
    {
      "title": "Great Small speaker",
      "text": "I don't give many 5 star reviews but this speaker is better then what I thought I was getting. It has nice sound for a small speaker and doesn't distort at high volume. Also it does get to a high volume when needed. The only improvement I think it needs would be a better battery; that said it does last as long as advertised.",
      "rating": 5.0,
      "verified": true,
      "author": "Cleay",
      "helpful_votes": 0,
      "publication_date": 20150323
    },
    {
      "title": "Best portable speaker ever, amazing sound",
      "text": "I definitely love this product, the clip makes a huge difference from the older model, this makes it really portable. Sound is great, very clean, very profesional, and volume is fair enough, not as cheap speakers. I dont need anything bigger. Seller also was ver kind.",
      "rating": 5.0,
      "verified": true,
      "author": "M. J. Diaz Ferretti",
      "helpful_votes": 4,
      "publication_date": 20140822
    },
    {
      "title": "This is a great little speaker",
      "text": "This is a great little speaker. The sound is clear even at high volumes, with as good bass as you can expect from a speaker this size. It also has a handy call answer/end feature with a built in mic. My only complaint is that the battery life leaves much to be desired as it runs out fairly quickly (listed as 5 hours but to me seemed less). Overall I would definitely recommend as a good quality little portable bluetooth speaker.",
      "rating": 4.0,
      "verified": true,
      "author": "Talmage Morgan",
      "helpful_votes": 0,
      "publication_date": 20150309
    },
    {
      "title": "but you can easily wrap your fingers all the way around it",
      "text": "Battery is very quick to die at loud volumes. Clip seems durable enough to last. Louder and clearer than I expected, but again, at any real volume this thing has maybe an hour or two of life. Smaller than I expected, but turning out to be the right size. Enough to fill your hand, but you can easily wrap your fingers all the way around it.",
      "rating": 3.0,
      "verified": true,
      "author": "Ryan Brown",
      "helpful_votes": 0,
      "publication_date": 20150228
    },
    {
      "title": "JBL Clip - Great Little Speaker",
      "text": "JBL Clip Portable Bluetooth Speaker, Black is great! This is a nice little hockey puck sized speaker with a caribiner to use the device as a clip on; great sound from a mono speaker, good volume, some distortion at high levels especially bass heavy music but still a great little speaker, thanks!",
      "rating": 5.0,
      "verified": true,
      "author": "Vernon E. Grier",
      "helpful_votes": 0,
      "publication_date": 20150727
    },
    {
      "title": "Keeping up with my teenagers",
      "text": "I just discovered Bluetooth, so I'm happy to walk around while listening to podcasts. It's a new found freedom. Otherwise, I was glued to my iPad and missed much of what was said. The speaker comes in loud and clear, I can adjust the volume and turn off.",
      "rating": 5.0,
      "verified": true,
      "author": "Mirna",
      "helpful_votes": 0,
      "publication_date": 20160816
    },
    {
      "title": "in particular i really like the clip",
      "text": "Solid little speaker, in particular i really like the clip. It may seem silly at first but it lets you hang it on a bag or from something on the wall to get the sound at ear level rather than table level like most speakers. Feels tough but I haven't abused it much so I can't speak to longevity.",
      "rating": 5.0,
      "verified": true,
      "author": "Bob Patrick",
      "helpful_votes": 0,
      "publication_date": 20150908
    },
    {
      "title": "Five Stars",
      "text": "The size and presentation is very good. The sound is very good also and good portable.",
      "rating": 5.0,
      "verified": true,
      "author": "Carmela Velazquez",
      "helpful_votes": 0,
      "publication_date": 20180129
    },
    {
      "title": "Good sounding portability.",
      "text": "Very nice product. Small and portable, clip it to your belt loop and continue with your daily activities with clear sound from it. It remembers what it is paired with, just press the power button and it pairs with bluetooth right away. No matter what volume the sound is very clear. It is not a huge bass speaker, but there is enough bass there to give full sound. It does not stand up, it only lays flat.",
      "rating": 5.0,
      "verified": true,
      "author": "Kenneth Ocker",
      "helpful_votes": 0,
      "publication_date": 20150122
    },
    {
      "title": "JBL does it again",
      "text": "Pleasantly surprised at the clear sound emitted by this small speaker. To me it sounds similar to the Beats Pill all the kids are buying. Then again, JBL knows speakers, and you seem at every concert hall, church, etc.--you can't say that about Beats.",
      "rating": 5.0,
      "verified": true,
      "author": "Champy",
      "helpful_votes": 0,
      "publication_date": 20151208
    },
    {
      "title": "Great Sound At An Affordable Price",
      "text": "Incredible sound. I originally bought one of the JBL Clips for my nephews for Christmas last year as the reviews had this Bluetooth speaker rated right up there with the $200+ devices for a fraction of the coat. I recently bought one for our family for around $50. Great sound at an affordable price.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian Cox",
      "helpful_votes": 0,
      "publication_date": 20150712
    },
    {
      "title": "Terrible Battery Life",
      "text": "The battery is terrible, absolutely horrendous. The clip isn't very large so I had to hook another clip to the speaker to be able to hang it from other things. It doesn't get as loud as I would like. And it will randomly shut off in the middle of a song (usually because the battery is getting low). I would not recommend this. I bought it to use it during volunteering with Habitat for Humanity and the wouldn't even last half of the work day.",
      "rating": 1.0,
      "verified": true,
      "author": "qtktm",
      "helpful_votes": 0,
      "publication_date": 20150819
    },
    {
      "title": "Love it!",
      "text": "\"Like new\" and original packaging- cannot tell that it is not brand-new and it was exactly what I wanted for both recording playback for investigations and when traveling. thank you so much !",
      "rating": 5.0,
      "verified": true,
      "author": "CAKatwoman",
      "helpful_votes": 0,
      "publication_date": 20160819
    },
    {
      "title": "Highly satisfied!",
      "text": "Excellent value and modest performance. The clip is excellent for attaching to a backpack, and the small design will not get in your way while biking or doing other activities. I can even answer a phone call while mountain biking!",
      "rating": 5.0,
      "verified": true,
      "author": "Brandon",
      "helpful_votes": 0,
      "publication_date": 20160111
    },
    {
      "title": "ARE YOU KIDDING ME????",
      "text": "I bought this so I have tunes when I walk my Dog! I figured it would be waste of money,,,, I just got it and it sounds AMAZING ,It is a little bigger than what i expected , VERY COOL FOR THE PRICE!!",
      "rating": 5.0,
      "verified": true,
      "author": "gsquared38",
      "helpful_votes": 0,
      "publication_date": 20160716
    },
    {
      "title": "Great little speaker",
      "text": "I've only used it a few times but so far I REALLY like this product. I mainly ordered it to use with my smartphone. I did something to my phone speaker that resulted in a very low speaker sound. I was able to use this product with the bluetooth function for hands-free telephone calls. I can think of a lot of uses in the future.",
      "rating": 5.0,
      "verified": true,
      "author": "Lvsportsnut",
      "helpful_votes": 0,
      "publication_date": 20150719
    },
    {
      "title": "Awesome little speaker",
      "text": "Awesome little speaker. Adequate battery life. I was pretty amazed by the sound quality and \"bass\". Obviously the bass isn't going to be pounding your chest with this tiny speaker, but for what it is, it sounds great.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Hunt",
      "helpful_votes": 0,
      "publication_date": 20150610
    },
    {
      "title": "I have used it several times, works as advertised ...",
      "text": "I have used it several times, works as advertised, recharges quickly and is a flexible system. I have not yet used it for a phone call. I suspect the audio quality might be obvious, but I haven't tried.",
      "rating": 5.0,
      "verified": true,
      "author": "jeff rusteen",
      "helpful_votes": 0,
      "publication_date": 20161022
    },
    {
      "title": "JBL Clip Portable Bluetooth Speaker",
      "text": "Purchased this speaker on June 17, 2015 for a Father's Day present for my husband. He loved it and we listened to music, using this speaker and Bluetooth thru our Samsung tablet. So convenient to take it outside on our patio and listen for hours. Last week, we weren't able to use it thru Bluetooth and can only use it while it's plugged into the tablet. While it still works, it's not what I paid for!!",
      "rating": 2.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20150814
    },
    {
      "title": "it's worth your money and has amazing sound quality",
      "text": "BUY IT, it's worth your money and has amazing sound quality. It's battery life is great and it can process Bluetooth from a good distance away. One of the best I've had so far, I recommend getting this Bluetooth one, it's amazing period.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel Colin",
      "helpful_votes": 0,
      "publication_date": 20150616
    },
    {
      "title": "Setup and connection was easy despite absolutely minimal instruction booklet",
      "text": "Setup and connection was easy despite absolutely minimal instruction booklet. How to use features of device not provided. Volume output is low but has good clarity.",
      "rating": 3.0,
      "verified": true,
      "author": "buguy5940",
      "helpful_votes": 0,
      "publication_date": 20160112
    },
    {
      "title": "It didn't sound as good as the JBL clip I already own",
      "text": "Arrived with something on the speaker and a dent on the side. Very disappointing as it was supposed to be new but looked used and damaged. It didn't sound as good as the JBL clip I already own.",
      "rating": 1.0,
      "verified": true,
      "author": "RDM",
      "helpful_votes": 0,
      "publication_date": 20161209
    },
    {
      "title": "Five Stars",
      "text": "Love my JBL clip I now own 4 and they all daisy chain together",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin M.",
      "helpful_votes": 2,
      "publication_date": 20150518
    },
    {
      "title": "sound is loud and great was the best choice i",
      "text": "Amaizing, sound is loud and great was the best choice i made",
      "rating": 5.0,
      "verified": true,
      "author": "Silvana C.",
      "helpful_votes": 0,
      "publication_date": 20170103
    },
    {
      "title": "Five Stars",
      "text": "This was a great purchase. It shipped a lot sooner than I expected it to. It works great no matter where I'm at and best of all this item packs some punch when using it to listen to music.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard Hernandez",
      "helpful_votes": 0,
      "publication_date": 20150315
    },
    {
      "title": "SOUNDS GREAT!!YOU MIGHT WANT TO BUY 2!!",
      "text": "The search is over!! I have been let down countless times to find a good portable speaker for a reasonable price.... Well, I have found it!!! The sound quality is amazing!! The price was a too good to be true!! It's lightweight and perfect for my on-the-go life!! A MUST BUY!!",
      "rating": 5.0,
      "verified": true,
      "author": "Christina johnson",
      "helpful_votes": 0,
      "publication_date": 20150820
    },
    {
      "title": "worth it",
      "text": "The sound is just what I wanted. Perfect reason why JBL is one of the top audio brands. Although I do think battery life could be improved but it's not bad either.",
      "rating": 5.0,
      "verified": true,
      "author": "Rodrigo R.",
      "helpful_votes": 0,
      "publication_date": 20150513
    },
    {
      "title": "Great product. I have purchased 3 additional ones for ...",
      "text": "Great product. I have purchased 3 additional ones for other members of my family and they also liked it very weel",
      "rating": 5.0,
      "verified": true,
      "author": "Gmcbell62",
      "helpful_votes": 0,
      "publication_date": 20160706
    },
    {
      "title": "Sounds good but if you are planning to connect to a ...",
      "text": "Sounds good but if you are planning to connect to a stereo system or other audio source , just know that there is a built in crossover. This means that bass frequencies are totally MIA.",
      "rating": 4.0,
      "verified": true,
      "author": "RMYRIE",
      "helpful_votes": 0,
      "publication_date": 20150321
    },
    {
      "title": "Five Stars",
      "text": "Great for the price. The portability is its strong suit so I can have music when I travel",
      "rating": 5.0,
      "verified": true,
      "author": "Mike E",
      "helpful_votes": 0,
      "publication_date": 20170107
    },
    {
      "title": "JBL is good at this trust me",
      "text": "Perfect Portable speaker own this one and the new one Clip 2",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony Escobedo",
      "helpful_votes": 0,
      "publication_date": 20171105
    },
    {
      "title": "This little speaker is really loud. I have a ...",
      "text": "This little speaker is really loud. I have a JBL Charge 2 that cost $100 and it's just as loud minus the base.",
      "rating": 5.0,
      "verified": true,
      "author": "Aide M",
      "helpful_votes": 0,
      "publication_date": 20161126
    },
    {
      "title": "Small compact and powerful speaker love the deep bass and the blue tooth make it ...",
      "text": "Small compact and powerful speaker love the deep bass and the blue tooth make it even nicer...bougth one for my self and wen my brother hear it he told me to get him one to...just love it..",
      "rating": 5.0,
      "verified": true,
      "author": "juan samuels",
      "helpful_votes": 0,
      "publication_date": 20170807
    },
    {
      "title": "and this little gadget does a fine job letting me listen to my library while I ...",
      "text": "My computer speakers blow, and this little gadget does a fine job letting me listen to my library while I work without wearing headphones or taking up any space.",
      "rating": 4.0,
      "verified": true,
      "author": "Ted the Geek",
      "helpful_votes": 0,
      "publication_date": 20150709
    },
    {
      "title": "JBL Clip packs a punch!",
      "text": "I have had the JBL Clip for a few now and I am enjoying it! At first I was a little resistant in how small it was. I wasn't sure if it would be as loud but it packs in alot of punch for how compact it is. I would recommend buying this before spending a ton of money on bigger bluetooth speakers. This JBL Clip may be all that you need.",
      "rating": 5.0,
      "verified": true,
      "author": "Dee Dee",
      "helpful_votes": 0,
      "publication_date": 20150417
    },
    {
      "title": "This little rascal does the trick.  It has great sound for a small speaker.",
      "text": "Super little speaker. My smartphone and tablets have weak speakers, the JBL Clip does the trick with no wires attached. It does have a auxilery jack to plug into your devices if you need to .Love this little speaker",
      "rating": 5.0,
      "verified": true,
      "author": "BUBBAFAREAST",
      "helpful_votes": 0,
      "publication_date": 20140915
    },
    {
      "title": "lots of power and audio quality for the size",
      "text": "I got this after buying the Highly Recommend JBL Charge 2. It works great, does not have the same volume as the Charge 2 which is no a concern as this is a smaller device. Highly Recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "Wally brooks",
      "helpful_votes": 0,
      "publication_date": 20150912
    },
    {
      "title": "I like this better than the UE Boom because of the ...",
      "text": "I like this better than the UE Boom because of the size factor.. it can easily slip into the outside pocket of a laptop case. Don't expect to have a party with it but it provides decent sound for the price/size.",
      "rating": 5.0,
      "verified": true,
      "author": "jojogadget",
      "helpful_votes": 0,
      "publication_date": 20141120
    },
    {
      "title": "Get this thing.",
      "text": "Get this thing, And get one or two of the similar ones that you can daisy chain with it. It's not perfect -- a little klugy to pair with you phone or tablet. But worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "Artimus Pyle",
      "helpful_votes": 0,
      "publication_date": 20150811
    },
    {
      "title": "Works nicely as a commuter speaker on the handlebars of my ...",
      "text": "Works nicely as a commuter speaker on the handlebars of my bike! Provides substantial volume without distortion. Only con is that the battery life is not all that great if you plan to keep it at high volume.",
      "rating": 4.0,
      "verified": true,
      "author": "MaxMaker",
      "helpful_votes": 0,
      "publication_date": 20150513
    },
    {
      "title": "Good little speaker. Bad battery life.",
      "text": "Good little speaker. I clip it on my coveralls while I work for some motivational music. Only problem I have with it is battery life...",
      "rating": 4.0,
      "verified": true,
      "author": "Eli",
      "helpful_votes": 0,
      "publication_date": 20150428
    },
    {
      "title": "JBL lives up to its reputation",
      "text": "Typical JBL quality: well built and sounds great. A bit weak in the bass which is to expected in a small speaker. Since the treble is strong, I used the bass boost setting in the Spotify App to bring up the low end. Perfect!",
      "rating": 5.0,
      "verified": true,
      "author": "DSC",
      "helpful_votes": 0,
      "publication_date": 20170417
    },
    {
      "title": "Great battery life.",
      "text": "Its a great speaker. I use it around the house and bring it with me while I play disc golf. Its loud enough for either activity.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul Shaver",
      "helpful_votes": 0,
      "publication_date": 20160703
    },
    {
      "title": "Not working",
      "text": "I can't get it to work. It's been plugged in for a couple of hours. No lights of any mind and none of my devices can find it.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160130
    },
    {
      "title": "... the clip is convenient but the battery is not great. It's also inconsistent",
      "text": "Sounds decent and the clip is convenient but the battery is not great. It's also inconsistent, sometimes it lasts a couple hours and sometimes it'll only last ten minutes.",
      "rating": 3.0,
      "verified": true,
      "author": "Nicholas S. Heisler",
      "helpful_votes": 0,
      "publication_date": 20150322
    },
    {
      "title": "Good speaker!",
      "text": "This is a great quality little speaker. The battery life is good. Much better than other speakers I have tried in the same price range.",
      "rating": 5.0,
      "verified": true,
      "author": "Codabug1",
      "helpful_votes": 0,
      "publication_date": 20150720
    },
    {
      "title": "Nice Gift",
      "text": "Sounds great, portable. Gifted to my husband for his woodshop and he uses it daily via bluetooth",
      "rating": 5.0,
      "verified": true,
      "author": "Alli",
      "helpful_votes": 0,
      "publication_date": 20170211
    },
    {
      "title": "This thing sounds great I got to say but here is the problem ...",
      "text": "This thing sounds great I got to say but here is the problem the battery only last 3hours many and stop working after 6 months",
      "rating": 3.0,
      "verified": true,
      "author": "brianhanesworth",
      "helpful_votes": 0,
      "publication_date": 20151121
    },
    {
      "title": "Five Stars",
      "text": "This little speaker is great, for the size, it really puts out some volume and sounds good. Recommended",
      "rating": 5.0,
      "verified": true,
      "author": "Cpl G",
      "helpful_votes": 0,
      "publication_date": 20160329
    },
    {
      "title": "Great buy",
      "text": "Works just as well as the JBL flip but smaller and less expensive. Great buy second time buying it as a gift!",
      "rating": 5.0,
      "verified": true,
      "author": "Akf ",
      "helpful_votes": 0,
      "publication_date": 20150408
    },
    {
      "title": "Me Likey...",
      "text": "For its size this little speaker delivers awesome sounds quality. This unit is well made, with high quality materials that feel good to the touch. It's also easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Toastfactor",
      "helpful_votes": 0,
      "publication_date": 20150327
    },
    {
      "title": "Amazing sound for such a small speaker",
      "text": "Amazing sound for such a small speaker. Easy to connect my Samsung Galaxy 5 phone to use for music or speaker phone.",
      "rating": 5.0,
      "verified": true,
      "author": "TJH",
      "helpful_votes": 0,
      "publication_date": 20150226
    },
    {
      "title": "Decent sound, for such a small speaker. I ...",
      "text": "Decent sound, for such a small speaker. I get about 5 hours per charge, playing at a moderate level. The clip is handy, too.",
      "rating": 4.0,
      "verified": true,
      "author": "D",
      "helpful_votes": 0,
      "publication_date": 20150721
    },
    {
      "title": "very good sound and volume for the tiny speaker",
      "text": "very good sound and volume for the tiny speaker, enough volume for a normal 3 bed, 1 story house. and a very handy speaker/mic for conference calls ;)",
      "rating": 5.0,
      "verified": true,
      "author": "Adrian R.",
      "helpful_votes": 0,
      "publication_date": 20150215
    },
    {
      "title": "Much louder than anticipated and very clear. Well worth ...",
      "text": "Much louder than anticipated and very clear. Well worth the little bit I feel I paid for it once I heard it in action.",
      "rating": 5.0,
      "verified": true,
      "author": "Pure DeCorelli",
      "helpful_votes": 0,
      "publication_date": 20150707
    },
    {
      "title": "Five Stars",
      "text": "best decision i've made about buying myself something online!!!!! love this speaker. It can be really loud and still have very good sound quality. Works good and looks good. Also I bought it almost a year ago and it still works like new!",
      "rating": 5.0,
      "verified": true,
      "author": "Audra",
      "helpful_votes": 0,
      "publication_date": 20170226
    },
    {
      "title": "Excellent, Great Speaker",
      "text": "Excellent, Great Speaker.....Hook on to anything,\"take it with you\"...Friend in the morning, still their at night to lull you to sleep. Definitely recommend it to a friend.",
      "rating": 5.0,
      "verified": true,
      "author": "Ron",
      "helpful_votes": 0,
      "publication_date": 20141121
    },
    {
      "title": "The Blue tooth is the best I've seen",
      "text": "This is the 3rd one I own, The Blue tooth is the best I've seen, great volume, Phone works great, Buttons easy to get to",
      "rating": 5.0,
      "verified": true,
      "author": "Colby Trumps",
      "helpful_votes": 0,
      "publication_date": 20150601
    },
    {
      "title": "An excellent little speaker to go with my iPod",
      "text": "An excellent little speaker to go with my iPod. Appears well built and a good case to take some rugged outdoor use. The clip-on is very handy and a prime reason for this purchase. Great sound quality, and plenty of volume.",
      "rating": 5.0,
      "verified": true,
      "author": "Geraldean  Jones (Honey)",
      "helpful_votes": 0,
      "publication_date": 20150508
    },
    {
      "title": "Couldn't be better",
      "text": "Very loud and Bluetooth works from a very good distance . Durable and lightweight and the clip is perfect to put on a backpack strap and my belt loops",
      "rating": 5.0,
      "verified": true,
      "author": "Lowks",
      "helpful_votes": 0,
      "publication_date": 20160102
    },
    {
      "title": "Big sound",
      "text": "Great sound for tiny device. I had an older model with dial for volume which I liked better than this one that has buttons. Dropped the new one in my hot tub but after a day of drying out worked fine.",
      "rating": 5.0,
      "verified": true,
      "author": "DW",
      "helpful_votes": 0,
      "publication_date": 20150711
    },
    {
      "title": "Will not hold charge",
      "text": "I loved this speaker at first. However, I've only had it for about 5 months and have used it maybe 5-6 times and it will not hold a charge. After charging it completely, it will only work for 3-4 songs. Very disappointing.",
      "rating": 2.0,
      "verified": true,
      "author": "Kelly Doolan",
      "helpful_votes": 0,
      "publication_date": 20170111
    },
    {
      "title": "Sounds good. Takes a good amount of time to recharge ...",
      "text": "A couple ticks under full volume, I can get it to last three or four hours. Sounds good. Takes a good amount of time to recharge so plan accordingly.",
      "rating": 4.0,
      "verified": true,
      "author": "Charles P. Burruano",
      "helpful_votes": 0,
      "publication_date": 20170910
    },
    {
      "title": "-this is the best small speaker/amp on the market",
      "text": "Have used jbl's professional gear for years! -this is the best small speaker/amp on the market!!",
      "rating": 5.0,
      "verified": true,
      "author": "ringo",
      "helpful_votes": 0,
      "publication_date": 20150219
    },
    {
      "title": "pay less for this branded speaker and get more",
      "text": "the item I received looked new,just a crunched up package. loud and strong and clear.",
      "rating": 5.0,
      "verified": true,
      "author": "SF GIANT-49ER",
      "helpful_votes": 0,
      "publication_date": 20151115
    },
    {
      "title": "Five Stars",
      "text": "Great, perfect gift for boyfriend. Little scratch but great for used",
      "rating": 5.0,
      "verified": true,
      "author": "BaeSlayer",
      "helpful_votes": 0,
      "publication_date": 20161026
    },
    {
      "title": "Really good quality for price.",
      "text": "This a a pocket boom box. The sound is great, do not worry about it not being loud enough. It is better to charge it before using it the first time.",
      "rating": 5.0,
      "verified": true,
      "author": "Gail Campayne",
      "helpful_votes": 0,
      "publication_date": 20150122
    },
    {
      "title": "Incredible value",
      "text": "Versatile, great sound (for a single speaker) and an amazing price. Clip it on my belt loop when working outside, or lay it on the counter for some serious shower karaoke. Any way you cut it, this is one of the best electronic purchases I've made",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160408
    },
    {
      "title": "didnt realize was so tiny",
      "text": "Just got it. It's pretty small. Bass not deep enough for my liking. I guess I need to shell out the bucks for the bass.",
      "rating": 3.0,
      "verified": true,
      "author": "K. D. Neal",
      "helpful_votes": 0,
      "publication_date": 20150801
    },
    {
      "title": "Thus speaker is fantastic!! It sounds great and it a perfect ...",
      "text": "Thus speaker is fantastic!! It sounds great and it a perfect size! Very light and compact with large sound!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole G",
      "helpful_votes": 0,
      "publication_date": 20150113
    },
    {
      "title": "Five Stars",
      "text": "Love this! It connected right away. Sounds is loud and outstanding. Very convenient.",
      "rating": 5.0,
      "verified": true,
      "author": "Nathan Weyerman",
      "helpful_votes": 0,
      "publication_date": 20151018
    },
    {
      "title": "JBL Clip keeps discounting from my phone.",
      "text": "The speaker worked well for a week or two but now when it has a good charge it stop working and discounts from my phone. I need to return it for another. Not very happy right now.",
      "rating": 1.0,
      "verified": true,
      "author": "John A. Cole",
      "helpful_votes": 0,
      "publication_date": 20170609
    },
    {
      "title": "Great Speaker",
      "text": "Great speaker I was really surprised with the quality of the sound.",
      "rating": 5.0,
      "verified": true,
      "author": "Ash",
      "helpful_votes": 0,
      "publication_date": 20150428
    },
    {
      "title": "Handy Little Speaker with a Big Sound",
      "text": "This speaker works exactly as advertised and is a great value.",
      "rating": 5.0,
      "verified": true,
      "author": "Roy McClure",
      "helpful_votes": 0,
      "publication_date": 20150330
    },
    {
      "title": "Great for trips, hikes, hangouts and any portable music lovers",
      "text": "New it was perfect. After a few months it gets a little harder to charge.",
      "rating": 4.0,
      "verified": true,
      "author": "Jesse",
      "helpful_votes": 0,
      "publication_date": 20151216
    },
    {
      "title": "Battery lasts less than an hour",
      "text": "Had decent volume and audio quality but wouldn't even last a full hour on a single charge. Ended up going for a refund and looking for another option still.",
      "rating": 2.0,
      "verified": true,
      "author": "Steven Wagner",
      "helpful_votes": 0,
      "publication_date": 20150108
    },
    {
      "title": "Product was exactly as described and does indeed sound good for such a small enclosure",
      "text": "Product was exactly as described and does indeed sound good for such a small enclosure. Pairs fairly quickly and the battery life is acceptable for, again, a small enclosure. JBL is a quality company and this is a quality device.",
      "rating": 5.0,
      "verified": true,
      "author": "Denny Gallagher",
      "helpful_votes": 0,
      "publication_date": 20150817
    },
    {
      "title": "Has a good sound for a small unit",
      "text": "Exactly as I expected. Has a good sound for a small unit. Sized right to take with you.",
      "rating": 5.0,
      "verified": true,
      "author": "Lulu",
      "helpful_votes": 0,
      "publication_date": 20150725
    },
    {
      "title": "Five Stars",
      "text": "This is great for teenagers, sounds great and will clip to anything, Very satisfied!!",
      "rating": 5.0,
      "verified": true,
      "author": "Deborah L. Montroy",
      "helpful_votes": 0,
      "publication_date": 20150811
    },
    {
      "title": "Nice little speaker",
      "text": "Very useful, small and portable. Good sound from such a small device.",
      "rating": 5.0,
      "verified": true,
      "author": "Piedmont Lady",
      "helpful_votes": 0,
      "publication_date": 20151029
    }
  ],
  "product_meta": {
    "title": "JBL Clip Portable Bluetooth Speaker, Black",
    "description": "Best-in-class sound that goes wherever you go.The JBL clip is the ultra-light, ultra-rugged and ultra-powerful portable speaker. This powerful little box gives you 5 hours of battery power so you can take the music with you where ever you go, plus you can plug it in easily to any portable device using its 3.5mm integrated audio cable, but you can play it wirelessly too using its Bluetooth functionality, streaming your music with no strings or cables attached or talking with your friends using its hands-free speakerphone function. But where the JBL clip truly earns its name is its built-in carabiner, letting you hook it easily to whatever clothes you're wearing or backpack you're shouldering. On-the-go listeners, listen up: Here's a portable speaker that keeps pace with whatever pace you set.",
    "rating": 4.1,
    "feature_bullets": [
      "Ultra-compact high-performance audio",
      "Stream bluetooth music and calls wirelessly and accurately",
      "Ready-to-wear audio with integrated carabiner",
      "5 hour rechargeable battery life"
    ],
    "specifications": {
      "Product Dimensions": "4.3 x 2 x 6.6 inches",
      "Item Weight": "1.44 ounces",
      "ASIN": "B00KH636V2",
      "Item model number": "JBLCLIPBLKAM",
      "Batteries": "1 Lithium ion batteries required.",
      "Customer Reviews": "4.1 out of 5 stars369 ratings4.1 out of 5 stars",
      "Best Sellers Rank": "#3,876 in Portable Bluetooth Speakers#28,964 in MP3 & MP4 Player Accessories",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "May 21, 2014",
      "Manufacturer": "JBL"
    },
    "categories": [
      "Portable Audio & Video",
      "Portable Bluetooth Speakers",
      "Electronics",
      "Portable Speakers & Docks"
    ],
    "price": ""
  }
}