{
  "website_summaries": [
    {
      "verdict": "A copper-colored fabric portable sauna geared toward luxurious comfort.",
      "pros": [
        "Ultra-low EMF emission - under 15 milligauss - much lower than competing brands",
        "Neck collar is washable and comfortable",
        "comes with 2",
        "Big enough for larger individuals",
        "Very effective for detox purposes",
        "Comes with foot pad and folding chair"
      ],
      "cons": [
        "Some users don't like the orange-pink color",
        "Doesn't heat up to 150°F"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Emf",
      "text": "I am no expert. It was important to me to find a low emf sauna. I chose to do a review to help you all out during your search.",
      "rating": 5.0,
      "verified": true,
      "author": "Chrissy",
      "helpful_votes": 147,
      "publication_date": 20180604
    },
    {
      "title": "Works like a charm!",
      "text": "UPDATE: Many months later. Still working great! 👍 . After doing so much research I finally found the lowest EMF sauna with the most benefits, at an affordable price! We are currently traveling around the US with our Fifth Wheel and I was beginning to miss all the luxuries of the gym/spa. I also suffer with auto immune symptoms and every one of my doctors has recommended a product like this. After using it as instructed. I decided to loose the chair and just sit on the floor with a towel and it worked great. I slept like a baby that night! Will update as I continue to use.",
      "rating": 5.0,
      "verified": true,
      "author": "HealthmindedTraveler",
      "helpful_votes": 57,
      "publication_date": 20180825
    },
    {
      "title": "Broke quickly",
      "text": "Only had it for 4 months before the zipper broke. Cant use it anymore after spending $600. Can no longer recommend.",
      "rating": 1.0,
      "verified": true,
      "author": "shesupsideown",
      "helpful_votes": 57,
      "publication_date": 20180307
    },
    {
      "title": "One Star",
      "text": "Lasted less than 7 months and now won't turn on!",
      "rating": 1.0,
      "verified": true,
      "author": "Kelly W",
      "helpful_votes": 53,
      "publication_date": 20171106
    },
    {
      "title": "Lyme disease detox.",
      "text": "I just got diagnosed with Lyme disease and I bought this for me Lyme detox protocol. Heats up very fast. Extremely hot. I keep mine on 150 degrees for 30 minutes. The chair is very uncomfortable so now I just go inside it fully and sit with my leg crossed inside. I bought this for $640 then the next day on amazon the price reduced $100 dollars so I called amazon and they gave me the $100 off. So I bought this for $540 instead of $640. Definitely would reccomend if you have a chronic illness and need massive detox.",
      "rating": 5.0,
      "verified": true,
      "author": "I",
      "helpful_votes": 56,
      "publication_date": 20170421
    },
    {
      "title": "Warning! Not completely low EMF",
      "text": "Warning! Very High electric fields. I measured for all three types of EMF. While it has very low Magnetic and Radio Fields, it has very high electric fields. Even with the unit off but plugged into the wall it is of the charts for electric fields. My meter pegged out! I built a modified fariday cage that virtually eliminated the electric fields, but for the price and claims I shouldn't have to do that! They need to either change their low-emf claim or modify their system. Buyer beware.",
      "rating": 1.0,
      "verified": true,
      "author": "Ben L",
      "helpful_votes": 12,
      "publication_date": 20191227
    },
    {
      "title": "But it really feels good. I would give this 5 stars except for ...",
      "text": "it takes about two 30 min cycles to really break a sweat. But it really feels good. I would give this 5 stars except for the seat that comes with it is a small child's folding camp seat and it is NOT comfortable. Even my \"smaller than me\" husband says it is uncomfortable. We use a wooden crate that a big water bottle came in with a towel on top. That is pretty good. Also the foot heater is a little too hot for me.",
      "rating": 4.0,
      "verified": true,
      "author": "G. Jennings",
      "helpful_votes": 36,
      "publication_date": 20160521
    },
    {
      "title": "I love everything about it",
      "text": "Other than the hideous color of this sauna (it is more orange/brownish than pink, I love everything about it. I place a towel on the floor and sit in it without the chair; it is like a sweat lodge personal retreat. It is especially comforting in the dead of winter. I never sweat otherwise and needed something to help me do so and at max temp for 30 minutes, I start sweating after about 20 minutes. Good detox.",
      "rating": 5.0,
      "verified": true,
      "author": "Amy",
      "helpful_votes": 45,
      "publication_date": 20150613
    },
    {
      "title": "highly recommend",
      "text": "I bought this for detoxing. I have MTHFR mutations & have a hard time detoxing. I have high levels of lead, mercury, & uranium. I use this sauna, seeking health glutathione plus, & advanced TRS & am feeling so much better.",
      "rating": 5.0,
      "verified": true,
      "author": "Diane",
      "helpful_votes": 11,
      "publication_date": 20190112
    },
    {
      "title": "Not sure about this one...",
      "text": "This one did not meet my expectations largely because the footpad burned my feet every time I tried it. It became unbearable in less than 5 minutes. This in itself led me to return the sauna. For the expensive price of $550, being able to use the footpad is only reasonable. Mine could have been defect, I feel it was. At the medium setting of 131, it got so hot that brushing my elbows against the panels burned. It felt like the top of the panels (near my head) was hotter than the bottom of the panel (near the floor).",
      "rating": 2.0,
      "verified": true,
      "author": "fkft_usr",
      "helpful_votes": 5,
      "publication_date": 20190310
    },
    {
      "title": "you will be pleased of the quality and results you will get plus ...",
      "text": "I had purchased other brands of infrared portables saunas in the past and they do not compare with the quality of the Durherm. The others are cheaply made, zippers start breaking at around 6 months time and heaters quit warming up as much as they did at the begining plus they are quite small compare this one. Although this IR Sauna is more expensive, you will be pleased of the quality and results you will get plus ultra low levels of harmful EMF. The company also has great costumer service. I will say that this is the best portable Infrared Sauna in the market. I am very satisfied with the product and company that sells it.",
      "rating": 5.0,
      "verified": true,
      "author": "Lorenzo Maldonado",
      "helpful_votes": 8,
      "publication_date": 20171109
    },
    {
      "title": "I bought it for me and now husband uses it more than me!",
      "text": "Love this sauna. It is portable so I can take it with me when RV'ing throughout the country. Big enough for large ex-football player husband's body. We certainly enjoy the healthy benefits of sauna. Wish the chair was bigger and more comfortable. All in all very satisfied with the product.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 10,
      "publication_date": 20170125
    },
    {
      "title": "Easy to set up, easy to use!",
      "text": "I love this sauna! It's easy to set up, easy to use, and I like that it has little to no EMFs, especially compared to other units I looked at. The company also has excellent service. The unit arrived 4 days ahead of the scheduled time. This company gets 5 stars in all areas.",
      "rating": 5.0,
      "verified": true,
      "author": "J. George",
      "helpful_votes": 10,
      "publication_date": 20161002
    },
    {
      "title": "It really makes you sweat and relaxing the muscles quickly.  Enough room to sit inside.",
      "text": "I'm in love! I don't like the color much. Everyone that sees it mentions the same thing. It works very well though. You have the option of sitting inside and containing the heat or it comes with a little folding chair to sit with your head outside the device. Heats up quick and is not loud. The control beeps when you have 1 minute left to prepare for shutoff. You can set the timer for no longer then 30 min and no higher then 150 degrees. It also comes with a headed foot pad that can be turned off and on independently. I purchased this sauna to fascia blast in and its just what I was looking for.",
      "rating": 5.0,
      "verified": true,
      "author": "Lindsey",
      "helpful_votes": 5,
      "publication_date": 20180623
    },
    {
      "title": "Manufacturer responded!",
      "text": "I purchased this product Nov 2017 and loved it however, a week ago it stopped working. I was able to contact the manufacturer and get a replacement sauna still under warranty!",
      "rating": 4.0,
      "verified": true,
      "author": "Chrissy L",
      "helpful_votes": 10,
      "publication_date": 20180810
    },
    {
      "title": "NEEDS A LONGER WARRANTY",
      "text": "Purchased Jan 21, 2018. I have used very little winter of 2018 . about 30 hours in 2019. I plugged it in yesterday and worked fine. Today I set control to heat up. checked 10 minutes later, All lights out KAPUT !! For $600 this should have an extended warranty. I would not recommend this product.",
      "rating": 1.0,
      "verified": true,
      "author": "R.E.A.D.Y.",
      "helpful_votes": 3,
      "publication_date": 20200201
    },
    {
      "title": "Can lower BP, but may cause other problems",
      "text": "Definitely lowered my blood pressure. I should mention that it's impossible to use the chair without leaning over with my head in my lap. I'm 5'3\". I put a beach towel on the floor and lie on my back with my knees bent, which is fine with me. Also, be careful if you have B-12 problems or MS, or probably any disease or disorder causing numbness and tingling,. The heat can cause a flare-up of those symptoms, as it did for me. For that reason, I haven't used it in a while, but hope to get back to it using a lower temp and shorter time.",
      "rating": 4.0,
      "verified": true,
      "author": "Vivian",
      "helpful_votes": 4,
      "publication_date": 20180618
    },
    {
      "title": "The product broke after 1.5 years.",
      "text": "Tried to get a hold of support and left a message on an answering machine and haven't heard back. The product worked as advertised when it powered on. The product doesn't turn on, and there are no troubleshooting instructions to see if a fuse is blown. The outlet that it is plugged into works. Would not recommend anyone spending $549 on a product that doesn't last long and has inadequate support. The limited warranty is only for 1 yar.",
      "rating": 1.0,
      "verified": true,
      "author": "Colin B Wardlaw",
      "helpful_votes": 5,
      "publication_date": 20190503
    },
    {
      "title": "Broken less than a year later",
      "text": "I purchased this sauna in February this year. I really enjoyed it for a few months. It was working properly until beginning of October. And then all of the sudden it stopped working. It would not turn on anymore. I've tried to reach out to the customer service through the email, provided in the warranty note. Unfortunately, I've got no response. That is very sad because I really liked this sauna in the beginning. I am not going to buy it again since it's very expensive to purchase a new one less than a year later.",
      "rating": 1.0,
      "verified": true,
      "author": "Vitaliy Greben",
      "helpful_votes": 3,
      "publication_date": 20191126
    },
    {
      "title": "Good beads. Great beads.",
      "text": "I crank this up to the max, 150, and get a really good sweat. I sit in it for 20 minutes a day. It's really easy to set up. It's very relaxing and feels nice. I could use an extra pocket for my cell phone and a bottle of water but other than that it's perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Slumberingdragon",
      "helpful_votes": 7,
      "publication_date": 20170602
    },
    {
      "title": "Game changer",
      "text": "I cannot stress enough how glad I am that I invested in this. With the pandemic I don't know when I'll feel comfortable going back to the spa. But since the spa was pricey, I'd go a few times a year. Now that I have it at home, in a few weeks I've gotten 2 or 3 years' worth of spa visits! It's so easy to use and you will definitely come out drenched in sweat. I can feel the serotonin boost immediately and I've been so cheerful. I haven't used the chair yet--I just sit inside.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20200914
    },
    {
      "title": "It's wonderful for circulation",
      "text": "My husband and I use this sauna many times a week. It's wonderful for circulation, better sleep and temporarily relieving pain. Although we would have chosen Black for the color, we are very happy with this color. It's very tropical looking. It's heats up fast and the chair is supportive. Was more then the others, but we definitely recommend this item. Good for the heart and vessels.",
      "rating": 5.0,
      "verified": true,
      "author": "Good Neighbors",
      "helpful_votes": 3,
      "publication_date": 20180605
    },
    {
      "title": "Helps with joint pain and feels soooo good!",
      "text": "I have such painful joints that I thought I'd try this......Soooooo glad that I did!!! Heaven! I know that it looks a little odd, but it works like nothing else has. I can use it before or after a workout and it really helps! I am going to live in it.....I have already informed everyone in my house!",
      "rating": 5.0,
      "verified": true,
      "author": "love teaching!",
      "helpful_votes": 5,
      "publication_date": 20170417
    },
    {
      "title": "Missing parts!!!",
      "text": "No instruction booklet or extra neck collar included as advertised.",
      "rating": 1.0,
      "verified": true,
      "author": "Jennifer Wilson",
      "helpful_votes": 12,
      "publication_date": 20180322
    },
    {
      "title": "Low emf but doesnt heat up",
      "text": "I bought this sauna because of the low levels of emf. I used my meter to measure the emf level. The reading was a low 1.0 mG well within safe levels. The only problem is it doesn't heat up to 150 degrees. I've used other portable saunas and normally sweat heavily in ten minutes. The Durherm sauna took a long time to heat up. It took me three times as long to sweat. I had to return it.",
      "rating": 4.0,
      "verified": true,
      "author": "AmazonCustomer",
      "helpful_votes": 2,
      "publication_date": 20190423
    },
    {
      "title": "Wonderful product!",
      "text": "This is an awesome Portable Sauna! I am heat intolerant, mainly because I cannot handle breathing hot, moist air. No problem with this Sauna! Having my head and hands out is very helpful to be able to read, watch a movie, and especially, to have a fan blowing on my face. Wonderful product!",
      "rating": 5.0,
      "verified": true,
      "author": "Susan V.",
      "helpful_votes": 3,
      "publication_date": 20181019
    },
    {
      "title": "Works like a CHAMP!",
      "text": "This sauna is great! It heats up fast, has variable settings, doesn't take up too much space if you leave it up, is easy to fold up for storage, is roomy enough to sit down on the floor inside with the hole flap over the neck hole, is sturdy for a portable sauna, and it gets the sweat rolling! I'm so glad I purchased this sauna! The biggest draw for me was the low/no EMF and the Negative Ionizer. LOVE IT! The chair it comes with is tolerable, but I will be purchasing a wooden sauna seat later.",
      "rating": 5.0,
      "verified": true,
      "author": "Rebecca Wormer",
      "helpful_votes": 2,
      "publication_date": 20190622
    },
    {
      "title": "Stopped Working after using 5 times",
      "text": "This worked great when it worked. I received and everything seemed to be in order and no damage. I used this item 5 times and just went down this morning to use again and the system wouldn't even power up. I checked and used different outlets to make sure there was power and it still wouldn't work. Other users mentioned similar issues. Definitely not worth $500 if it breaks after limited uses.",
      "rating": 1.0,
      "verified": true,
      "author": "Ben Boring",
      "helpful_votes": 2,
      "publication_date": 20200620
    },
    {
      "title": "Happy so far, hope the zipper doesn't break",
      "text": "I don't normally buy large items like this sight unseen. It produces a warm heat, but not uncomfortable. I've read different opinions that near- versus far- infrared may be better, but have concluded there's some benefit to both. I sweat a lot in it and it's roomy enough for me to sit in. It folds up into the size of a large painting carrying-case. If the low-EMF reviews are to believed then this is a great choice.",
      "rating": 5.0,
      "verified": true,
      "author": "Regulus212",
      "helpful_votes": 0,
      "publication_date": 20201010
    },
    {
      "title": "Health treatment actually feels good!",
      "text": "I had a lot of trouble getting delivery, but once this sauna arrived, I've been very satisfied. I was afraid it would be too tight getting in and out, but it's actually quite easy. The little fold up chair needs some padding, which I added, but I'm quite comfortable as I sweat. I appreciate knowing that the EMF radiation is very low.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathy Wexler",
      "helpful_votes": 0,
      "publication_date": 20190908
    },
    {
      "title": "I love this. I use it several times a week",
      "text": "I love this. I use it several times a week. It gets pretty hot, but usually takes about 20 minutes to really start to sweat. The chair it comes with isn't great. Overall, I love this sauna and I'm glad I purchased it.",
      "rating": 5.0,
      "verified": true,
      "author": "Yo Adriane!",
      "helpful_votes": 3,
      "publication_date": 20180406
    },
    {
      "title": "This thing is awesome",
      "text": "I hardly ever leave reviews but here I am. I am battling neurological Lyme Disease, and this thing helps me detox. It makes me sweat more than any other IFR sauna I've ever used, and for the price very worth it . I use it twice a day, and so far it works great with no issues. I would definitely recommend!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20200604
    },
    {
      "title": "Stand behind your product",
      "text": "I received my replacement sauna, it is working wonderfully. Thank you for your prompt response to my claim. Your company was professional and stood behind your product warranty. I had my replacement within one week. Now I can continue to receive the relaxation benefits for my muscles and detoxification as well. All my muscles feel so much better since I started using my sauna. Satisfied customer, Pam",
      "rating": 4.0,
      "verified": true,
      "author": "Pam ",
      "helpful_votes": 0,
      "publication_date": 20200406
    },
    {
      "title": "Hope in long term low epf will help!",
      "text": "Very effective. I don’t know about low emf I didn’t test, trust it’s worth the extra 400 dollars I spent on this! Looks like quality is good and will last long but don’t take my word for it as I am using it for less than one month.",
      "rating": 5.0,
      "verified": true,
      "author": "iShop",
      "helpful_votes": 3,
      "publication_date": 20180321
    },
    {
      "title": "Works Great & Convenient!",
      "text": "I purchased this to detox since the gym saunas are closed now. I love that I can use it in the comfort & privacy of my own home then shower directly afterwards. I lay a towel on the chair before I begin, it's very easy to use & heats up very well!",
      "rating": 5.0,
      "verified": true,
      "author": "Lola Zen",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "Broke after 3 months, no service despite begs, threats and even offering to pay.Do not buy!",
      "text": "Broke after less than 3 months and at most 25 mins./day use and I cannot find any way to contact the company. Just stopped turning on. Lil gadgets in the warranty page claims they don't even sell it and amazon left their info up for months After much cajoling Amazon took it back and gave us about 80% of our money back. If i could i'd give it no stars.",
      "rating": 1.0,
      "verified": true,
      "author": "Marta of Hack",
      "helpful_votes": 28,
      "publication_date": 20170402
    },
    {
      "title": "Great Experience",
      "text": "For those not having space for the full cabinet this is great. I still sit a little tall for it but I am enjoying at least three times a week and can feel a difference.",
      "rating": 5.0,
      "verified": true,
      "author": "Chuck Barrett",
      "helpful_votes": 11,
      "publication_date": 20150504
    },
    {
      "title": "Awesome heat hut.",
      "text": "Yes the stitching isn't the best but it's a quality product that works as intended. I changed the seat and now can live in there for hours.",
      "rating": 5.0,
      "verified": true,
      "author": "ChunkaChange",
      "helpful_votes": 8,
      "publication_date": 20160505
    },
    {
      "title": "WORTH IT",
      "text": "best low EMF sauna there is. Gets hot and gets me sweating real nice and good.",
      "rating": 5.0,
      "verified": true,
      "author": "Aaron Cowee",
      "helpful_votes": 2,
      "publication_date": 20181212
    },
    {
      "title": "Great at home/ portable sauna",
      "text": "I bought this as a B-day present for my Wife. It was very easy to set up and break down and it works great. Heats up fast ! The only thing I would recommend is getting a small chair that you like to sit on. the one it came with works but isn't very comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Justin Normand",
      "helpful_votes": 0,
      "publication_date": 20190328
    },
    {
      "title": "The sauna is easy to set up",
      "text": "The sauna is easy to set up. The sauna heats up very quickly and is easy to clean. The sauna is very compact and can fit in many spaces. Great!",
      "rating": 5.0,
      "verified": true,
      "author": "XTWO",
      "helpful_votes": 0,
      "publication_date": 20180622
    },
    {
      "title": "Great product!",
      "text": "Love, love, love. I've only used it twice so far. Took literally 1 min to assemble. Works great. Worth the investment. I have Lyme disease. Saunas are recommended for eliminating microbes.",
      "rating": 5.0,
      "verified": true,
      "author": "Jan Naud",
      "helpful_votes": 2,
      "publication_date": 20181115
    },
    {
      "title": "Still works great 👍!",
      "text": "I purchased the sauna almost two years ago and I am still satisfied with my purchase ☺! Works great! Love how my skin looks afterwards!",
      "rating": 5.0,
      "verified": true,
      "author": "Travis Singletary",
      "helpful_votes": 0,
      "publication_date": 20200902
    },
    {
      "title": "Five Stars",
      "text": "Really enjoy this. Purchased to see if we liked sauna experience before investing further. Works great",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin Willmorth",
      "helpful_votes": 0,
      "publication_date": 20180301
    },
    {
      "title": "Five Stars",
      "text": "It gets really hot and great for detoxing and warming up my body to stretch",
      "rating": 5.0,
      "verified": true,
      "author": "stephanie lawrence",
      "helpful_votes": 2,
      "publication_date": 20170915
    },
    {
      "title": "Great low EMF sauna",
      "text": "Easy to use, comfortable to sit in, I am really happy with our sauna. I bought it for myself but now my husband uses it too.",
      "rating": 5.0,
      "verified": true,
      "author": "Lindsay B Fischer",
      "helpful_votes": 0,
      "publication_date": 20200916
    },
    {
      "title": "This is my happy place.",
      "text": "I love my little bubble. It is my happy place. Don't know how I went 49 years without it. I sit inside and close the top (covered with a thin towel) rather than in the chair. I get more out of it if I am facing the back wall. It is amazing how fast it heats you up. I do 30 minutes @ 150 and just have sweat running off me when the timer goes off.",
      "rating": 5.0,
      "verified": true,
      "author": "Patricia Overn",
      "helpful_votes": 19,
      "publication_date": 20160512
    },
    {
      "title": "Unit tripped power strip ckt breaker, now dead after 17 months of minimal use",
      "text": "After about 2 dozen use in 17 months, the unit is now dead. It appears something shorted out inside causing my power strip ckt breaker to trip. I can reset the ckt breaker, but unit still won't turn on. As far as I can tell, there are no built in ckt breaker.. It was a great disappointment because when it was working, it was efficient and heated up within minutes.",
      "rating": 1.0,
      "verified": true,
      "author": "Jockeye",
      "helpful_votes": 6,
      "publication_date": 20180116
    },
    {
      "title": "Great sauna!",
      "text": "Love it! Saves the expense of going to the spa every week...the unit stays put with the support bar snapped across. Chair is a small camp style chair but it's held up..easy to clean..gets very hot...worth the $$$! UPDATE: Still working like a charm in 2019! Had to buy a replacement seat after a year or so but other than that still happy with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Ms. Raye",
      "helpful_votes": 8,
      "publication_date": 20160722
    },
    {
      "title": "Get one!",
      "text": "I love it! When I'm done with the 30 min session I feel like a million bucks!",
      "rating": 5.0,
      "verified": true,
      "author": "Linda Carnes",
      "helpful_votes": 0,
      "publication_date": 20200805
    },
    {
      "title": "Great buy for the price",
      "text": "Sweating never felt so good. Heats up quickly! I usually sit inside the unit in a meditative pose, but it's fantastic any way you slice it!",
      "rating": 5.0,
      "verified": true,
      "author": "sarah miller",
      "helpful_votes": 10,
      "publication_date": 20160616
    },
    {
      "title": "I love it in general",
      "text": "I love it in general. The only drawback is that the seat is very uncomfortable. I'm around 5'10\". My legs tend to go numb and I slouch due to the odd position I need to sit in for the chair, but that just might be me.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 6,
      "publication_date": 20170316
    },
    {
      "title": "On cloud 9.5",
      "text": "I am loving my new sauna. It is exactly what I expected because I had done lots of research prior to the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Elaine Payne",
      "helpful_votes": 2,
      "publication_date": 20170304
    },
    {
      "title": "Great buy",
      "text": "Amazing for detox purposes. In 30 min, I’m drenched with sweat.",
      "rating": 5.0,
      "verified": true,
      "author": "Bernadine",
      "helpful_votes": 0,
      "publication_date": 20200610
    },
    {
      "title": "Love this thing! Have had zero issues!",
      "text": "Gets hotter than expected. Very relaxing to hang out, watch tv, and enjoy this sauna! Make sure to buy cleaning products to clean the sweat from the floor",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin D",
      "helpful_votes": 0,
      "publication_date": 20180510
    },
    {
      "title": "I love it!",
      "text": "So, I had read the reviews, and yes the chair is simply a small camping sort of chair, but I knew going in this was the case. It is not HORRIBLE. I sit there just fine for 45 minutes. I do love this sauna and it is doing well for me. It does take a little bit to heat up, but I honestly didn't expect it to go from zero to 150 degree in 2 seconds. Mine is well made and I love the extra zippers for your hand and the pocket to keep the control and my phone in.",
      "rating": 5.0,
      "verified": true,
      "author": "horseman",
      "helpful_votes": 4,
      "publication_date": 20170228
    },
    {
      "title": "Stopped working after 3 months",
      "text": "Purchased back in April 2019 and the sauna just stopped working. Loved it up until now.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190713
    },
    {
      "title": "best portable sauna",
      "text": "Love the Durherm portable sauna ,best one i have ever had and i have had a few.sweated so much without being uncomfortable. best Christmas present from myself.Can highly recommend this",
      "rating": 5.0,
      "verified": true,
      "author": "gail mather",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "I love the way it heats up so quickly i use ...",
      "text": "I love the way it heats up so quickly i use it everyday i just love everyone should have one so relaxing",
      "rating": 5.0,
      "verified": true,
      "author": "thomas jenkins",
      "helpful_votes": 0,
      "publication_date": 20180303
    },
    {
      "title": "Five Stars",
      "text": "So easy to set up- less than 5 minutes. Heats up fast. Exactly what I was looking for!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170214
    },
    {
      "title": "Roomy and well constructed",
      "text": "Heats up fast, seems sturdy and zippers work well. Roomy- worth the extra money",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161214
    },
    {
      "title": "Could never get comfortable in it",
      "text": "Sent it back. Could never get comfortable in it. I'm 5'9\", about 180 and could not make that tiny little chair work, so I tried 2 of my own and no deal. It's really cramped in there. The idea is great, but it's just too small to get comfy.",
      "rating": 1.0,
      "verified": true,
      "author": "LISA RAVEN",
      "helpful_votes": 14,
      "publication_date": 20170719
    },
    {
      "title": "Poor Workmanship",
      "text": "I bought this item, but never had a chance to use it. When I unpacked the item and inspected it, I saw that areas of the quilt cover next to the zipper had missing and loose stitching. Obviously, problems would arise immediately with normal use. I was not offered a replacement, so I returned the unit for a refund. I still want a portable sauna, but won't buy another one by this manufacturer.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 28,
      "publication_date": 20151116
    },
    {
      "title": "Love this unit; exactly as described in these reviews.",
      "text": "Based on reviews here, what I received was exactly as described. I love it. No issues. I am 6'2\", 300+ and had no issues sitting inside even on the chair provided although I am uncertain I am not vouching for its weight limit. The unit heats quickly and it is truly portable. I will update this review as time goes on. My only shortcoming is that there is not enough space for me to sit totally enclosed but it is not due to the unit but my size.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Murphy",
      "helpful_votes": 9,
      "publication_date": 20161030
    },
    {
      "title": "Five Stars",
      "text": "Grate for people that can't get to work out :)",
      "rating": 5.0,
      "verified": true,
      "author": "michelle",
      "helpful_votes": 8,
      "publication_date": 20150502
    },
    {
      "title": "Great Value--",
      "text": "Use this product almost every day. I use it for Detoxification, relaxation, and joint pain. My doctor recommended a similar sauna but cost much more. both saunas had the same specifications. So far I really like it. Only problem is with the chair. The screws come out of the front, and I landed on my but while inside the sauna. They are easy to fix but could have been injured. It heats up fast, is portable and is easy to fold.",
      "rating": 5.0,
      "verified": true,
      "author": "Christine Jones",
      "helpful_votes": 12,
      "publication_date": 20150306
    },
    {
      "title": "Bad Quality",
      "text": "I had it for less than 2 months at it already broke.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20180711
    },
    {
      "title": "I love this sauna",
      "text": "I love this sauna so much. I'm in at least three times a week. I wish I had time to be in it more. Sure easy to assemble. It's basically pops open. The chair is sturdy and the perfect size for me. I'm 5'8 180 pounds. The controller is easy to operate. The size of the sauna is great for the space. I use one of my bedrooms for a workout room. I sit in the sauna for 5 minutes before I work out to warm up my muscles. After my workout, I get in it to relax. I love that it comes with an extra neck collar that is washable. The best thing is NO EMF!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Dee W.",
      "helpful_votes": 5,
      "publication_date": 20170401
    },
    {
      "title": "I'm pleased with this unit",
      "text": "I received it within 48 hours of ordering. I had to return a FIR sauna blanket because it stopped working properly and burned through the plastic. So far, I'm pleased with this unit. I'm sweating profusely. The chair isn't the most comfortable and the foot pad does get too",
      "rating": 4.0,
      "verified": true,
      "author": "Igaligal",
      "helpful_votes": 13,
      "publication_date": 20140817
    },
    {
      "title": "and am very pleased with this one that I chose to purchase",
      "text": "Researched portable saunas, and am very pleased with this one that I chose to purchase! Heats up very quickly, & only takes a few minutes to set up, or fold for storage. Would highly recommend this item, over other portable units on the market.",
      "rating": 5.0,
      "verified": true,
      "author": "carole g mccollum",
      "helpful_votes": 9,
      "publication_date": 20160614
    },
    {
      "title": "which is good for us",
      "text": "The sauna arrived qiuckly. It is light weight , which is good for us. One complaint is that the chair it came with was uncomfortable and we had to get a different chair.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20161025
    },
    {
      "title": "It'll make you sweat",
      "text": "This is my second infrared sauna(the first died after 6 years). With the exception of the exterior color, it is great. Heats up to 150 degrees and really gets me sweating. It's big enough for me(6'5\" and 290lbs). I use a different seat that allows me to sit lower. After about 20 minutes, the sweat is rolling. I use a large towel on the floor inside of the sauna and wear a long sleeve shirt to catch the sweat and reduce any accumulated sweat smell. So far, so good.",
      "rating": 5.0,
      "verified": true,
      "author": "BigBob",
      "helpful_votes": 2,
      "publication_date": 20161213
    },
    {
      "title": "A great private, personal home sauna",
      "text": "The only downside to this product for me is that the heat source is so close to my back that it doesn't quite feel like I'm getting such an even heating as in a large sauna; however, this is entirely outweighed by the advantage of having a private personal sauna in my home that is low EMF, and FIR with its health benefits. No more need to go to the spa and share the sauna with a number of other (sometimes very talkative) women. I use it several times a week as it's very easy to set up and put away.",
      "rating": 4.0,
      "verified": true,
      "author": "Dolphin Girl",
      "helpful_votes": 13,
      "publication_date": 20160306
    },
    {
      "title": "The three stars are due to the fact that the color is terrible. The shiny copper cover does not match in ...",
      "text": "This product does everything I want it to, just a little too big for my size but I am small. The three stars are due to the fact that the color is terrible. The shiny copper cover does not match in any way with the blue zippers. I think it would be a much better choice to manufacture the whole thing in black. I like to leave it out so that I will use it more often but the colors really bother me.",
      "rating": 4.0,
      "verified": true,
      "author": "Leticia C. Ribeiro",
      "helpful_votes": 11,
      "publication_date": 20141214
    }
  ],
  "product_meta": {
    "title": "Durherm Infrared Sauna, Low EMF Negative Ion Portable Indoor Sauna with Chair and Heated Footpad, Copper, Large",
    "description": "This unique high quality far infrared, fir portable sauna with exclusive beneficial features, finally can be affordable and used in privacy of your home or apartment or any living environment without large spaces & special accommodations for it. The larger size is perfect for those who need a little extra room for their legs, while still small enough to be stored when not in use. Its design includes the most desirable features the expensive and fancy saunas have. This far infrared, fir sauna has 3 heaters that are hi-tech of super conductive and ultra thin carbon fiber heating element. The time settings range from 5-30 minutes with increments up or down of 5 minutes. The surface temperature on the heat panels ranges from 104-140 degrees Fahrenheit with increments of 9 degrees. While the air inside the sauna will reach up to 110+ degrees, giving you plenty of heat. Levels of EMF range from 5-15 milligauss, very low compared to other brands on the market. Designed to deliver performance while using tough materials, which will allow you to use it for years to come. With its satisfying design, your head and hands can extend out for reading, watching TV, or listening to music. The advantage of infrared out performs a conventional sauna. It only takes a few minutes to unfold and setup. Specifications: Included: DIF-5000_Copper Sauna, Wired Handheld Controller, Heated Foot-pad, Sports Chair, 2x Terry Cloth Neck, Foam Pad, Manual Dimensions: 31.5″ W x 33″ D x 41″ H Power: AC 110-120V, 60Hz Weight: 25 LBS Model No: DIF-5000_Copper",
    "rating": 4.1,
    "feature_bullets": [
      "Included: DIF-5000_Copper Sauna, Wired Handheld Controller, Heated Foot-pad, Sports Chair, 2x Terry Cloth Neck, Foam Pad, Manual",
      "Dimensions: 31.5″ W x 33″ D x 41″ H",
      "Power: AC 110-120V, 60Hz",
      "Weight: 25 LBS",
      "Model No: DIF-5000_Copper"
    ],
    "specifications": {
      "Product Dimensions": "31.5 x 33 x 41 inches",
      "Item Weight": "25 pounds",
      "Manufacturer": "Durherm",
      "ASIN": "B00KQ4NFTI",
      "Item model number": "DIF-5000",
      "Customer Reviews": "4.1 out of 5 stars136 ratings4.1 out of 5 stars",
      "Best Sellers Rank": "#49,180 in Patio, Lawn & Garden",
      "Is Discontinued By Manufacturer": "No"
    },
    "categories": [
      "Patio, Lawn & Garden",
      "Pools, Hot Tubs & Supplies",
      "Saunas",
      "Garden & Outdoor"
    ],
    "price": 539.95
  }
}