{
  "website_summaries": [
    {
      "verdict": "Great everyday watch with a distinctly classic appeal.",
      "pros": [
        "Dressy and fashionable ladies Seiko watch powered by light and solar energy",
        "6-month power reserve in a stylish champagne and leather watch",
        "LumiBrite hands and markers",
        "30M water resistant"
      ],
      "cons": [
        "18mm size is tiny"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Beautiful, but only buy if your wrist is very slender",
      "text": "Beautiful, quality watch BUT the band is simply too short. My wife is 5'3\", petite and certainly not overweight. The band barely fits around her wrist when buckled on the last available hole. Had to return and am shopping for something similar to replace it.",
      "rating": 2.0,
      "verified": true,
      "author": "A. DiBianca",
      "helpful_votes": 17,
      "publication_date": 20170306
    },
    {
      "title": "High quality but solar charging is time consuming",
      "text": "Because of its small solar cell it has the following charge requirements were taken from their manual: *General Office (700 lux): 180 minutes for 1 day of power, 60 hours for steady operation, [apparently it can't get a full charge for this light level] *Fluorescent light (3000 lux): 35 minutes for 1 day of power, 10 hours for steady operation, 180 hours for full charge (1 year operation) *Cloudy weather/sunlight (10000 lux): 12 minutes for 1 day of power, 4 hours for steady operation, 60 hours for full charge (1 year operation) *Fair weather/sunlight (100000 lux): 2 minutes for 1 day of power, 0.5 hours for steady operation, 10 hours for full charge (1 year operation)",
      "rating": 4.0,
      "verified": true,
      "author": "Alfred",
      "helpful_votes": 5,
      "publication_date": 20181104
    },
    {
      "title": "LOVE IT!  My wrist is 15 centimeters and I wear the band on the 3rd loosest hole.",
      "text": "In Wall Street Journal, a top athlete said this is one of her favorite possessions. I owned a Seiko years ago and loved it. I hate replacing watch batteries so I immediately found this SOLAR powered watch on Amazon and ordered one. My wrist is 15 centimeters or just over 6 inches and I wear the band on the 3rd loosest hole. The holes are .5 centimeter apart. I love knowing that I can set this aside and no matter when I come back to it, there won't be a dead battery.",
      "rating": 5.0,
      "verified": true,
      "author": "M. McDonald",
      "helpful_votes": 8,
      "publication_date": 20171224
    },
    {
      "title": "Love My New Tank-Style Seiko!",
      "text": "Love my new Seiko! I've waited several years to replace a Seiko I lost some time ago because I'm actually very hard on watches. Over the years, I've learned to not purchase brand name watches usually because of my track record. Basic Timex watches have served me well, and I usually go for the ones without bells and whistles. Why spend money on something you're going to lose? But saw this Seiko tank-look watch and remembered a tank watch I had years ago that lasted forever, but could not be repaired (can't believe I held on to that one so long). Anyway, if you love the look of a classic tank watch, this Seiko is for you!",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy",
      "helpful_votes": 6,
      "publication_date": 20180225
    },
    {
      "title": "classic beauty",
      "text": "i love clunky big watches, but everyone should have a classic dress watch. and this is the one. comfortable on the wrist beautiful to look at can be worn formal or casual. the solar charge last at least 6 months per exposure. if it came in another band color or face color i would deffinately own that one too. great price first seen at local dept stores and the prices were $60.00 to $90.00 dollars more. go amazon",
      "rating": 5.0,
      "verified": true,
      "author": "Janice Jetter",
      "helpful_votes": 21,
      "publication_date": 20150306
    },
    {
      "title": "A nice beatiful watch for thin wrists",
      "text": "This is a nice beautiful watch. Looks rich and classy. Meant for women with thin wrists. If you wear long sleeves in winter covering the watch for most part of the day remember to leave it under a lamp to charge when you get home. Earlier bought a Citizen eco drive but was to large for the wrist. This one was perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Doug",
      "helpful_votes": 4,
      "publication_date": 20181124
    },
    {
      "title": "Excellent! I Don't Know How Seiko Can Sell At This Low Price.",
      "text": "My wife loves this watch, and relishes the thought of not having to purchase batteries. Excellent three year warranty, keeps perfect time, and at a very good price here, compared to other retailers. The packaging it comes in from Seiko is something one would find on a much more expensive watch.",
      "rating": 5.0,
      "verified": true,
      "author": "Andy S",
      "helpful_votes": 9,
      "publication_date": 20150824
    },
    {
      "title": "Lovely to look and easy to read",
      "text": "I wanted this watch for a very long time, then received it as a gift for Mother's Day. I like it very much. It's classic, beautiful to look at, and easy to read. I love that it is solar. What is not so great (and the reason for 4 stars), is that the buckle side of the band is about 1/2 inch too short. I haven't been able to find a replacement band as nice (or that fits), so I am living with it, because, like I said, it is quite lovely.",
      "rating": 4.0,
      "verified": true,
      "author": "Paula Braley",
      "helpful_votes": 0,
      "publication_date": 20190920
    },
    {
      "title": "Very expensive looking watch!",
      "text": "This was a Christmas gift from my husband. I wanted something in this shape and some people that saw mine thought it was a very, very expensive. Can you say C------.? I love the Seiko brand and have always had good luck with it. No problem with the fit of the band. I have plenty of room with it. FYI my wrist is 6 1/8th inches.",
      "rating": 5.0,
      "verified": true,
      "author": "Sheila G..",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Timeless Classic",
      "text": "I am 5\"9\" - very active - not heavy, but not a willow and this fit just great - a beautiful classic watch. Thank you for making it! Love Love Love the solar charge. I had the original version in the 80\"s and it fell off my arm in Manhattan somewhere. So sad and so happy to have found it again in a new version!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180416
    },
    {
      "title": "Beautiful Watch, Great Value but inferior strap.",
      "text": "I love the watch. It is beautiful to look at and doesn't require a battery. That said,because the first hole doesn't allow enough material to slip through the loop the watch fits uncomfortably tight even though my wrist is smaller than average. I eventually hope to replace it if I can get to a jewelry store.",
      "rating": 5.0,
      "verified": true,
      "author": "jtass",
      "helpful_votes": 0,
      "publication_date": 20180908
    },
    {
      "title": "Watch band is too short for the watch.",
      "text": "Watch band is way too short for the watch. I have an average size wrist. The band is only 16mm. The watch is 2.5mm. Can not buckle strap. Watch band size was called standard. Would have been fine on a larger watch. Love the watch and price. I purchased a comfort strap Long S/S expansion band from Wal Mart $12.00. It's well worth the added price. (A Long S/S expansion band) It's a Stainless Steel band, size long, that is flexible with, no clasp or buckle, you pull it over your wrist. See photo.",
      "rating": 4.0,
      "verified": true,
      "author": "L Allen",
      "helpful_votes": 0,
      "publication_date": 20181210
    },
    {
      "title": "Beautiful watch.",
      "text": "Beautiful watch on my wife's wrist. I've seen reviews where people complained that the band isn't long enough, but my wife has a small wrist. The band is a bit stiff but with where, this should improve.",
      "rating": 5.0,
      "verified": true,
      "author": "subbernh",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "Wondefrful watch",
      "text": "It is exactly what I wanted. It is hard to find a small, elegantly styled woman's watch these days. This is perfect!! Powered by light so I don't have to wind or fool with batteries. Great!",
      "rating": 5.0,
      "verified": true,
      "author": "Charlie",
      "helpful_votes": 2,
      "publication_date": 20170813
    },
    {
      "title": "LOVE IT SHE SAID",
      "text": "HAD ONE WITH BATTERY WHICH KEPT RUNNING OUT AND LOW AND THIS BEING SOLAR SHE LOVE IT AND THE FEATURES, GREA WATCH AND GOT IT AT GOOD PRICE ALSO",
      "rating": 5.0,
      "verified": true,
      "author": "joseph",
      "helpful_votes": 0,
      "publication_date": 20201016
    },
    {
      "title": "Looks like the real thing!",
      "text": "This is my favorite watch style. It can be “dressy” or casual. And the best part is that no battery ever needs to be replaced or that you must remember to wind it. My only issue is that band is pretty stiff and a bit short. Otherwise, I’m VERY pleased with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara Dell",
      "helpful_votes": 0,
      "publication_date": 20200129
    },
    {
      "title": "I am very pleased with this watch",
      "text": "I am very pleased with this watch. It is solar-powered, which is very convenient, and it is very attractive. The leather band looks durable, too, and that has not always been the case with watches that I've bought in the past. I would definitely recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Kay",
      "helpful_votes": 0,
      "publication_date": 20180210
    },
    {
      "title": "Very small",
      "text": "Good watch for the money. My wife likes it but the face is very small and she would prefer a larger one.",
      "rating": 4.0,
      "verified": true,
      "author": "James Biggerstaff MD",
      "helpful_votes": 0,
      "publication_date": 20190724
    },
    {
      "title": "I’m a fan now!",
      "text": "This is a really beautiful classic watch. I love that I don’t have to worry about winding it or about batteries! My only wish is that the face was a little bit bigger. But I really love this watch!",
      "rating": 5.0,
      "verified": true,
      "author": "RgHound",
      "helpful_votes": 0,
      "publication_date": 20180801
    },
    {
      "title": "Wristband is not quite right",
      "text": "I like the face of the wristwatch but I find the leather band does not fall in the correct place on the back of my wrist. It seems they should have made one of the lengths longer so that it falls in the center of my back wrist. I have a very small wrist and it falls off to the side rather than being in the center as all my previous wristbands have been.",
      "rating": 3.0,
      "verified": true,
      "author": "madeline ditta",
      "helpful_votes": 0,
      "publication_date": 20181103
    },
    {
      "title": "Could be better.",
      "text": "The watch is great but the watch band is not long enough. It fits but not comfortably. I am a woman with average size wrist and I am not happy with the band. It is also very pretty.",
      "rating": 3.0,
      "verified": true,
      "author": "Irene",
      "helpful_votes": 2,
      "publication_date": 20170720
    },
    {
      "title": "Beautiful watch perfect for a small wrist",
      "text": "This is a beautiful watch that fits perfectly on a woman's wrist that is small. Clear display and works like a charm. Very happy with this watch.",
      "rating": 5.0,
      "verified": true,
      "author": "Jacqueline Rodriguez",
      "helpful_votes": 0,
      "publication_date": 20180722
    },
    {
      "title": "Beautiful watch!",
      "text": "Beautiful watch, and like the solar battery feature. Not sure why others commented on band being too short. I have pretty normal sized wrists, and I am using the fourth from last home. Plenty long. I love Seiko watches-only brand I buy.",
      "rating": 5.0,
      "verified": true,
      "author": "A.L",
      "helpful_votes": 0,
      "publication_date": 20200307
    },
    {
      "title": "Five Stars",
      "text": "This is a beautiful watch which keeps great time.....Watch band is also very nice and fits well.",
      "rating": 5.0,
      "verified": true,
      "author": "Basha martin",
      "helpful_votes": 2,
      "publication_date": 20170405
    },
    {
      "title": "Classic and Classy",
      "text": "Really nice watch. Classic. And I love that it has a solar battery.",
      "rating": 5.0,
      "verified": true,
      "author": "Dreamer",
      "helpful_votes": 0,
      "publication_date": 20180703
    },
    {
      "title": "Classically Gorgeous Watch",
      "text": "Beautiful watch - smaller than expected but still, high quality and lovely. Definitely recommend to others and even as a gift",
      "rating": 5.0,
      "verified": true,
      "author": "Beanaford",
      "helpful_votes": 0,
      "publication_date": 20180915
    },
    {
      "title": "Lovely watch, great for small wrist",
      "text": "Love it. It's a little more \"bling\" than I thought as the markers for the hours are raised and catch the light. But it's pretty and small (small wrists) and keeps excellent time...Goes from day to evening wear because of the \"bling\" but not a formal event really because of what is a great looking strap. Just not an evening style strap",
      "rating": 5.0,
      "verified": true,
      "author": "Jean H",
      "helpful_votes": 8,
      "publication_date": 20160503
    },
    {
      "title": "she absolutely love it! It's a gorgeous little watch that remind ...",
      "text": "Bought it as a gift for my mother, she absolutely love it! It's a gorgeous little watch that remind her of the old times when she had an automatic Seiko. The solar ensure the battery would never have to be change so that's great news!",
      "rating": 5.0,
      "verified": true,
      "author": "Hoan",
      "helpful_votes": 0,
      "publication_date": 20161228
    },
    {
      "title": "Good buy.",
      "text": "Great watch. My wife had complained that the belt was too tight and rigid. But after weeks use now she is used to it.",
      "rating": 5.0,
      "verified": true,
      "author": "RB Patel",
      "helpful_votes": 0,
      "publication_date": 20180905
    },
    {
      "title": "beautiful small face",
      "text": "I love the rectangular face and the size is just perfect! It is easy to read and fits perfectly on my wrist. The leather band is beautiful and seems to be of high quality. Very happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Joanne W.",
      "helpful_votes": 0,
      "publication_date": 20190920
    },
    {
      "title": "Band is terrible",
      "text": "Really nice Watch. The leather band is impossible. Need to replace it before I can wear it.",
      "rating": 2.0,
      "verified": true,
      "author": "Nancy Plant",
      "helpful_votes": 0,
      "publication_date": 20200910
    },
    {
      "title": "Solar Watches is the best,",
      "text": "My wife loves it I have the exact same one in a male Style",
      "rating": 5.0,
      "verified": true,
      "author": "DonJMac",
      "helpful_votes": 0,
      "publication_date": 20171216
    },
    {
      "title": "Beautiful watch but band could be longer",
      "text": "Beautiful watch but band could be longer!!i have a small wrist & still have to put it on the last hole to fit comfortably",
      "rating": 4.0,
      "verified": true,
      "author": "martha",
      "helpful_votes": 0,
      "publication_date": 20170619
    },
    {
      "title": "Probably for medium to smaller wrists",
      "text": "Beautiful watch. Keeps perfect time with no battery to worry about. It’s a petite watch, not huge and clunky. The face is off white with gold tone markers. I have a small wrist, about 6 1/2 inches and there are 3 more holes to adjust it larger.",
      "rating": 5.0,
      "verified": true,
      "author": "Cherie ",
      "helpful_votes": 0,
      "publication_date": 20190510
    },
    {
      "title": "Love",
      "text": "I love this watch! I had another one that my Lab puppy ate. I was thrilled to find a replacement!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer,",
      "helpful_votes": 0,
      "publication_date": 20160927
    },
    {
      "title": "its pretty and a nice size - however it lacks a ...",
      "text": "its pretty and a nice size - however it lacks a second hand! The second hand is important to me!",
      "rating": 3.0,
      "verified": true,
      "author": "Lorie",
      "helpful_votes": 0,
      "publication_date": 20180328
    },
    {
      "title": "Very small",
      "text": "It is a beautifully made product. However, it is very small. Some people commented here that it is made for a child. It is true. The real size of the watch face is 14 mm in length and 18 mm in height. Japanese women are very tiny, so I guess the product is designed for very tiny women. Other than that, the quality is superior, and it is beautiful overall.",
      "rating": 4.0,
      "verified": true,
      "author": "Natasha R",
      "helpful_votes": 5,
      "publication_date": 20161228
    },
    {
      "title": "My wife could not be happier. And to top it off",
      "text": "The watched charged up after a couple of hours under a bright light. That's been at least three weeks and it has been running ever since. My wife could not be happier. And to top it off, it looks great.",
      "rating": 5.0,
      "verified": true,
      "author": "Christopher R",
      "helpful_votes": 0,
      "publication_date": 20170302
    },
    {
      "title": "Fantastic item, perfect for small wrists...",
      "text": "My wife LOVES this item... super high quality, Seiko through and through... LOVE it...",
      "rating": 5.0,
      "verified": true,
      "author": "s c",
      "helpful_votes": 0,
      "publication_date": 20170831
    },
    {
      "title": "Quality",
      "text": "Seiko has always been considered a great quality brand and I’m very happy to know that I can get my beautiful wife this elegant watch",
      "rating": 5.0,
      "verified": true,
      "author": "Albert Garcia",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "Excellent choice.",
      "text": "Comfort and function combined with a stylish appearance... just what I needed.",
      "rating": 4.0,
      "verified": true,
      "author": "AnnaMarie Murphy",
      "helpful_votes": 0,
      "publication_date": 20180911
    },
    {
      "title": "Good watch.",
      "text": "Nice watch, wear it every day. I have accidentally gotten it wet and it keeps on ticking.",
      "rating": 5.0,
      "verified": true,
      "author": "Judith",
      "helpful_votes": 0,
      "publication_date": 20181124
    },
    {
      "title": "but this is so beautiful.",
      "text": "I just wish the leather strap was a lighter brown, but this is so beautiful.",
      "rating": 5.0,
      "verified": true,
      "author": "haewon225",
      "helpful_votes": 0,
      "publication_date": 20170908
    },
    {
      "title": "I absolutely LOVE this timeless and classic look",
      "text": "I haven't worn a leather strapped watch in ages. I absolutely LOVE this timeless and classic look.",
      "rating": 5.0,
      "verified": true,
      "author": "I.C.",
      "helpful_votes": 0,
      "publication_date": 20180220
    },
    {
      "title": "Great Value for the Price!",
      "text": "Amazing! Once charged this watch keeps perfect time and looks just great on a small wrist --- much like mine!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170102
    },
    {
      "title": "Nice band. Fits my wrist well",
      "text": "Very classy looking watch. Nice band. Fits my wrist well.",
      "rating": 5.0,
      "verified": true,
      "author": "r silver",
      "helpful_votes": 0,
      "publication_date": 20161112
    },
    {
      "title": "Four Stars",
      "text": "very nice looking watch at a great price. the band is a bit small but nice quality.",
      "rating": 4.0,
      "verified": true,
      "author": "Linda Zehnbauer",
      "helpful_votes": 0,
      "publication_date": 20150910
    },
    {
      "title": "The watch is beautiful, however",
      "text": "The watch is beautiful, however, it did not have any of the features it claimed to have. I bought another Seiko with the features described which I love.",
      "rating": 1.0,
      "verified": true,
      "author": "DebJohn",
      "helpful_votes": 4,
      "publication_date": 20161226
    },
    {
      "title": "Disappointment",
      "text": "really nice looking watch. I loved it until it stopped working after only a few months. put it in the sun, wound it up, still wouldn't work. too much time has gone by and I cannot return it. disappointed.",
      "rating": 2.0,
      "verified": true,
      "author": "sammyj",
      "helpful_votes": 6,
      "publication_date": 20170206
    },
    {
      "title": "Four Stars",
      "text": "Watch face a bit smaller than I would ideally like.",
      "rating": 4.0,
      "verified": true,
      "author": "Dr Patricia Coughlin",
      "helpful_votes": 0,
      "publication_date": 20160217
    },
    {
      "title": "Three Stars",
      "text": "I was looking for a watch with a smaller face. Seiko is a reliable brand, so no complaints there.",
      "rating": 3.0,
      "verified": true,
      "author": "SEHH",
      "helpful_votes": 0,
      "publication_date": 20160220
    },
    {
      "title": "Five Stars",
      "text": "Perfect for my small wrist. Simple, clean style. Love it.",
      "rating": 5.0,
      "verified": true,
      "author": "mimi10",
      "helpful_votes": 0,
      "publication_date": 20160302
    },
    {
      "title": "Five Stars",
      "text": "This watch is very pretty, the size is perfect for my tiny wrist.",
      "rating": 5.0,
      "verified": true,
      "author": "Laura Duca",
      "helpful_votes": 0,
      "publication_date": 20160115
    },
    {
      "title": "The watch is attractive and seems to keep good time it is much smaller than one would think ...",
      "text": "The watch is attractive and seems to keep good time it is much smaller than one would think from the picture. Haven't decided if we will keep it or return it.",
      "rating": 3.0,
      "verified": true,
      "author": "Al1708",
      "helpful_votes": 2,
      "publication_date": 20161205
    },
    {
      "title": "Bad Experience",
      "text": "This watch stopped working 5mos. after purchase. Nothing happened to cause this like dropping, submerged in water, etc., it just stopped. Because the return time has expired I have no recourse for return/refund.",
      "rating": 1.0,
      "verified": true,
      "author": "Jane",
      "helpful_votes": 9,
      "publication_date": 20160705
    },
    {
      "title": "Nice watch, attractive",
      "text": "Nice watch, attractive, only bad thing is the face is a bit small, picture is kind of deceiving, as the face is even smaller than band so it looks a bit strange but once you get used to it it is OK.",
      "rating": 3.0,
      "verified": true,
      "author": "AW DSM",
      "helpful_votes": 0,
      "publication_date": 20160602
    },
    {
      "title": "nicewatch well worth the money paid",
      "text": "nice watch well worth the money paid,my wife just loves this watch ,she has a small wrist ,it fits perfect",
      "rating": 5.0,
      "verified": true,
      "author": "William W.",
      "helpful_votes": 0,
      "publication_date": 20160117
    }
  ],
  "product_meta": {
    "title": "Seiko Women's SUP252 Analog Display Japanese Quartz Brown Watch",
    "description": "From Humble beginnings, Kintaro Hattori’s Vision for Seiko has become reality. A consuming passion for excellence - imprinted in our Corporate DNA passed from generation to generation. Seiko, for 125 years committed to the art and science of time.\n\n A culture of innovation connects a 19th century Tokyo clock shop with 20th century advances in timekeeping to an extraordinary 21st century \"quiet revolution.\" Continually driven by dedication and passion, established a multitude of world’s first technologies… transforming the principles of timekeeping. \n\n The first quartz wristwatch – changed the history of time. \n\n The first Kinetic – marked a new era in quartz watch technology. \n\n In 1969, Seiko Astron, the first quartz wristwatch - was introduced. \n\n In an instant, Seiko exponentially improved the accuracy of wristwatches –And Seiko technology firmly established today’s standard in Olympic and sports timing. \n\n 1984, another celebrated first – Kinetic Technology – powered by body movement. \n\n Kinetic – a quartz mechanism with unparalleled accuracy –the driving force behind more world’s firsts. \n\n Kinetic Chronograph – the next generation of high performance timekeeping. \n\n Kinetic Auto Relay – automatically resets to the correct time. \n\n Kinetic Perpetual - combining the date perfect technology of perpetual calendar with the genius of Kinetic Auto Relay. \n\n And now Kinetic Direct Drive – move, and the watch is powered automatically. Or hand wind it and see the power you are generating in real time. \n\n In the realm of fine watches, time is measured by Seiko innovation – A heritage of dedication to the art and science of time.\n\n\n\nSeiko Solar. No battery change required and powered by all types of light. Solar cell with high performance electricity generation. Energy-efficient movement with a 6 month power reserve. This stunning dress watch has a gold tone stainless steel case with a brown leather strap. Gold hands and markers compliment the champagne dial. 30 meters water resistant.\n\n\n\n\nPRODUCT DETAILS\n * Is Discontinued By Manufacturer :No\n * Package Dimensions :11.9 x 5.8 x 3.7 inches; 6.38 Ounces\n * Item model number :SUP252\n * Department :Womens\n * Batteries :1 CR2 batteries required. (included)\n * Date First Available :July 3, 2014\n * Manufacturer :Seiko\n * ASIN :B00LI6FOGA\n * \n * Domestic Shipping:Currently, item can be shipped only within the U.S. and to APO/FPO addresses. For APO/FPO shipments, please check with the manufacturer regarding warranty and support issues.\n * International Shipping:This item can be shipped to select countries outside of the U.S. Learn More\n\n * .zg_hrsr_item {list-style : none};\n * Amazon Best Sellers Rank: #273,537 in Clothing, Shoes & Jewelry (See Top 100 in Clothing, Shoes & Jewelry)  *  #120259 inWomen's Shops \n    *  #1225 inWomen's Wrist Watches \n   \n   \n\n * Customer Reviews:4.5 out of 5 stars142 ratings \n\n\nFrom Humble beginnings, Kintaro Hattori’s Vision for Seiko has become reality. A consuming passion for excellence - imprinted in our Corporate DNA passed from generation to generation. Seiko, for 125 years committed to the art and science of time.\n\n A culture of innovation connects a 19th century Tokyo clock shop with 20th century advances in timekeeping to an extraordinary 21st century \"quiet revolution.\" Continually driven by dedication and passion, established a multitude of world’s first technologies… transforming the principles of timekeeping. \n\n The first quartz wristwatch – changed the history of time. \n\n The first Kinetic – marked a new era in quartz watch technology. \n\n In 1969, Seiko Astron, the first quartz wristwatch - was introduced. \n\n In an instant, Seiko exponentially improved the accuracy of wristwatches –And Seiko technology firmly established today’s standard in Olympic and sports timing. \n\n 1984, another celebrated first – Kinetic Technology – powered by body movement. \n\n Kinetic – a quartz mechanism with unparalleled accuracy –the driving force behind more world’s firsts. \n\n Kinetic Chronograph – the next generation of high performance timekeeping. \n\n Kinetic Auto Relay – automatically resets to the correct time. \n\n Kinetic Perpetual - combining the date perfect technology of perpetual calendar with the genius of Kinetic Auto Relay. \n\n And now Kinetic Direct Drive – move, and the watch is powered automatically. Or hand wind it and see the power you are generating in real time. \n\n In the realm of fine watches, time is measured by Seiko innovation – A heritage of dedication to the art and science of time.\n\n\n\nSeiko Solar. No battery change required and powered by all types of light. Solar cell with high performance electricity generation. Energy-efficient movement with a 6 month power reserve. This stunning dress watch has a gold tone stainless steel case with a brown leather strap. Gold hands and markers compliment the champagne dial. 30 meters water resistant.",
    "rating": 4.5,
    "feature_bullets": [
      "Made in USA or Imported",
      "Case diameter : 18 mm",
      "Powered by light/Solar energy ; 6-month power reserve once fully charged",
      "Day/Date calendar. Keep the watch exposed to the light until the second hand moves at 1-second intervals",
      "LumiBrite hands and markers ; 30M water resistant",
      "Caliber V138, Leather Strap. Pull out the crown to set the time",
      "Japanese-quartz movement with analog display",
      "Hardlex crystal dial window",
      "Water resistant to 99 ft (30 m)",
      "Rectangle watch in gold-tone stainless steel with solar power source and six-month power reserve"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "11.9 x 5.8 x 3.7 inches; 6.38 Ounces",
      "Item model number": "SUP252",
      "Department": "Womens",
      "Batteries": "1 CR2 batteries required. (included)",
      "Date First Available": "July 3, 2014",
      "Manufacturer": "Seiko",
      "ASIN": "B00LI6FOGA",
      "Domestic Shipping": "Currently, item can be shipped only within the U.S. and to APO/FPO addresses. For APO/FPO shipments, please check with the manufacturer regarding warranty and support issues.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S."
    },
    "categories": [
      "Women",
      "Watches",
      "Wrist Watches",
      "Clothing, Shoes & Jewelry"
    ],
    "price": 125.8
  }
}