{
  "website_summaries": [
    {
      "verdict": "Advanced monitoring and control features for media files puts this case above others on the market.",
      "pros": [
        "The tower is smaller than most other options to minimize its footprint",
        "The case inside sports an intelligent 900W battery backup with a built-in front LCD panel, offering more control over basic computer functions"
      ],
      "cons": [
        "Case interior is more noisy from cooling fans than other computer tower options"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "A fire hazard !",
      "text": "I don't feel safe with this product. As in, I'm afraid of what this CyberPower UPS did. I had this CyberPower UPS for one day and it went bad. Here's what happened. I ran a self-test through CyberPower's PowerPanel Personal software for Windows via USB, and the moment I clicked on \"Initiate self-test\" the CyberPower UPS made a loud pop noise, it turned itself off, and then smoke came out of the sides of this product through its vents. This product has filled my bedroom with a horrendous burnt-electronics smell. I do not recommend this product at all. I'm afraid of this thing igniting itself in flames and burning my house down.",
      "rating": 1.0,
      "verified": true,
      "author": "Luc LeGuiverne",
      "helpful_votes": 51,
      "publication_date": 20160618
    },
    {
      "title": "It causes what it should prevent",
      "text": "I purchased this item less than two years ago for my TV and receiver. I worked fine for a while then started alarming for no reason. Now its gotten to the point where it will just stop supplying electric to attached electronics for no reason at all, no warning just \"off\". The power supply itself shuts down shortly there after. You can turn the UPS back on at this point and it will merrily work fine until next time. Other UPS's I have show no \"events\" during this same time. May have to go back to APC.",
      "rating": 1.0,
      "verified": true,
      "author": "Scott G.",
      "helpful_votes": 25,
      "publication_date": 20180216
    },
    {
      "title": "Unit failed after 3 years",
      "text": "Easy to setup and was working great up until the 3 year mark. Now, if the electricity flickers or power goes out, the UPS just shuts off, the battery does not kick in and provide backup. I have to hold the power button on the UPS to turn it back on. The unit indicates that it is fully charged and can provide ### mins of backup, but it just turns off now. Update: Contacted cyberpower. Customer service is super slow, takes weeks to respond. They determined it’s bad battery but not willing to replace it under warranty. 5 year warranty is useless. Poor customer service.",
      "rating": 1.0,
      "verified": true,
      "author": "G2",
      "helpful_votes": 7,
      "publication_date": 20181220
    },
    {
      "title": "Great UPS if on generator",
      "text": "It's a UPS - it provides power when there is none...but what I really like about it, is that it doesn't cycle on and off when I switch over to our non-invester generator. The one I replaced was much more finicky and would not do well on the dirty power that my generator provides.",
      "rating": 5.0,
      "verified": true,
      "author": "D.N.",
      "helpful_votes": 5,
      "publication_date": 20190413
    },
    {
      "title": "Useless with VM host",
      "text": "I bought this to use with a VM host running ESXi. Cyberpower offers a virtual appliance that will shut down servers if battery power gets low. That virtual appliance used to work fine for me but it seems that cyber power isn't maintaining it and it's not working with the current version of ESXi. I'm not going to roll back to an older version of ESXi so this UPS has become essentially useless due to their lack of support. I opened a support case with them several days ago and have gotten no response.",
      "rating": 1.0,
      "verified": true,
      "author": "Bryan Simms",
      "helpful_votes": 5,
      "publication_date": 20180915
    },
    {
      "title": "Dead on arrival.",
      "text": "Dead on arrival as it says. I opened the box, plugged it in and let it charge for more than 24 hours. After which I tried to power it on and got one long beep and then two short beeps. The unit never passed power through to any device plugged in. I loaded the software and hooked up the USB connection. My computer would detect the device, tell me it was charged or charging and within ten seconds it would lose the connection as though the device was gone. The return policy doesn't allow the device to be shipped back. So it appears I have a $150 and 45 pound brick now. I won't buy from this brand again.",
      "rating": 1.0,
      "verified": true,
      "author": "survivor42",
      "helpful_votes": 18,
      "publication_date": 20170308
    },
    {
      "title": "Plug it in and everything working fine until, electricity went and the UPS and a ...",
      "text": "Plug it in and everything working fine until, electricity went and the UPS and a msg came up saying \"F02 \" so even though the UPS is fully charged it still went off. So I got a faulty product.",
      "rating": 1.0,
      "verified": true,
      "author": "Alung",
      "helpful_votes": 11,
      "publication_date": 20171228
    },
    {
      "title": "Plenty of Power",
      "text": "A lot of data was lost during a lightning storm. This happened because I was too cheap to purchase an UPS. Not anymore, this UPS has already saved my system during a few other power killing storms. The 12 outlets make it easy to plug in a computer and accessories with room to spare. On the battery, it has plenty of power to run 2 LCD displays, a beast of a PC, router and cable modem for about 60 minutes; plenty of time to finish a show and shutdown.",
      "rating": 5.0,
      "verified": true,
      "author": "GregAndFamily",
      "helpful_votes": 9,
      "publication_date": 20160502
    },
    {
      "title": "Using for Church PA system.",
      "text": "Remarkable unit. I've been a CyberPower fan for some time. Have them for my home and recording studio. So when it came time to keep power at the Church the only question was \"How big does it need to be?\" This unit is perfect. We've unplugged (haven't had any outages since we got it) it for over 30 minutes with computer, monitor, 32 channel digital mixer, and 5 wireless mic receivers plugged in. No problems whatsoever. This should work perfectly for those little 2 second power outs that make the big loud KA-THUMP's in the PA. (Bought a smaller unit for the power amplifier behind the platform).",
      "rating": 5.0,
      "verified": true,
      "author": "Pam Harrison",
      "helpful_votes": 0,
      "publication_date": 20190410
    },
    {
      "title": "Good value",
      "text": "I have had about six months and have experienced 4 power failures. Duration from 1-6 hours. I have most my critical components attached such as computer (desk top), wifi router, over the air internet, and Ooma VoiP. I shut down the pc because I will only get about an hour out of the UPS. When I turn off the desk top I have at least 4 hours plus. This is important because I dumped my landline and my cell coverage is poor. It keeps my Ooma and tablets (as long as their charged) going over that 4 hour stretch. Haven't missed a beat. Really happy with this unit.",
      "rating": 5.0,
      "verified": true,
      "author": "dbld",
      "helpful_votes": 0,
      "publication_date": 20200128
    },
    {
      "title": "Battery backup holds up fine",
      "text": "I have a computer, two 17 inches monitors, work modem, house modem, Wi-Fi Orbi router and an led lamp all plug into the battery backup side. I had power failure lasting 36 minutes and the battery backup power everything without any problems. When the power came back the battery backup still had 49 percent of it battery power left. Also we have power drop outs every week, the system keeps everything running smoothly and it inform us that an event has accord.",
      "rating": 5.0,
      "verified": true,
      "author": "Leo",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "Every home should have one",
      "text": "I first became familiar with this product while working in Puerto Rico after Hurricanes Irma and Maria. There were days when power was very iffy. The local COSTCO had these on sale so I bought one and was very pleased. When I returned to the mainland USA I looked high and low to find one. So glad that Amazon had it. This is a back up battery every home should have. I'm buying another one for my living room; this one is in my bedroom.",
      "rating": 5.0,
      "verified": true,
      "author": "KT Sta75",
      "helpful_votes": 0,
      "publication_date": 20200901
    },
    {
      "title": "2nd time was the charm",
      "text": "The first unit I bought was defective--none of the buttons on the front of the unit worked at all. Tech support was helpful, sent out a replacement (brand new, not refurbished) immediately. The new unit is working fine. I would have deducted a star, but the replacement/service was so good...it warrants 5 stars for now. I will adjust this review if the unit fails.",
      "rating": 5.0,
      "verified": true,
      "author": "Uncle Loodis",
      "helpful_votes": 0,
      "publication_date": 20200923
    },
    {
      "title": "Must have",
      "text": "I've replaced my APC UPS's with these. When a got a power sag the APC would allow my computers etc. to lose power, while the Cyber Power unit kicked in and keep my other computers online. I first bought one to see how I liked it and was using both Cyber Power and APC. Don't know how the other models of the Cyber Power work. But THIS model does the job for me. I now have two of them and will be buying more of this model or perhaps a bigger unit of the same style. Losing power to a computer can cause you to corrupt your hard drive making your computer not boot up or lose valuable data.",
      "rating": 5.0,
      "verified": true,
      "author": "Dan",
      "helpful_votes": 0,
      "publication_date": 20181104
    },
    {
      "title": "My second Cyberpower battery backup",
      "text": "I keep having issues with APC brand UPS, replacing the battery only gives me another year before even the smallest brown-out shuts everything down and it starts beeping. I replaced my Cyberpower battery a couple years ago and it's been phenomenal ever since, like it was brand new. I have no reservations about having bought this second unit with my experiences so far, looking forward to years and years of use.",
      "rating": 5.0,
      "verified": true,
      "author": "KRAM02",
      "helpful_votes": 0,
      "publication_date": 20190908
    },
    {
      "title": "Great product, great support. A++ from me",
      "text": "Performs exactly as described and works well. I've had this unit for 2 years and the self-test just started to fail, meaning the battery probably needs replacement, I called support and all they asked for was the serial number then said they'd get a new battery out to me free of charge, can't ask for better support than that! 5 year parts warranty comes standard & lifelong warranty on the devices protected by it, pretty impressive.",
      "rating": 5.0,
      "verified": true,
      "author": "Dave",
      "helpful_votes": 0,
      "publication_date": 20180709
    },
    {
      "title": "Very glad I splurged for 10 outlets!",
      "text": "I've had this for a week and it meets expectations so far. I'm VERY glad I bought the 10 outlet version: I was a little annoyed that there isn't enough space between outlets for plugs with small adapter bricks on them. Specifically, my NVIDIA Shield TV Pro plug essentially takes up two outlets, unfortunately. No technical issues, but I've had consistent power and haven't needed the backup power yet. Good size and the unit feels solid. The display is nice. I dulled the brightness of the power light with some black electrical tape, but I do that for most gadgets near my TV.",
      "rating": 4.0,
      "verified": true,
      "author": "Mark Twain",
      "helpful_votes": 0,
      "publication_date": 20200717
    },
    {
      "title": "3rd one of these models I have purchased",
      "text": "Like this model. Very reliable and does a fine job. Plenty of backup time in my usage. My primary reason for using AVR/UPS units is the fact that the line quality in my area is poor. Lots of variation, brown-outs and frequent loss. All of my electronics get plugged into an AVR/UPS unit to protect the devices. CyberPower has always been reliable whereas I have had equipment loss with at least one other popular brand.",
      "rating": 5.0,
      "verified": true,
      "author": "RRM",
      "helpful_votes": 0,
      "publication_date": 20190909
    },
    {
      "title": "Noisy!!!",
      "text": "Have had this for about a year, and it has always been noisy. However the noise was tolerable until our last power outing a day ago, it now emits an excrutiating, low volume squeal. I would not recommend for those reasons, I am searching for something better to replace this now.",
      "rating": 2.0,
      "verified": true,
      "author": "DDarko",
      "helpful_votes": 4,
      "publication_date": 20170817
    },
    {
      "title": "Great for my computer",
      "text": "This is the second unit I have owned. They are durable and really work well in power outage. It beeps when the power is out. We have a lot of momentary outages (1 to 5 minutes) and this carries our computers over until the power returns. It also helps with spikes coming in. I highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "J. O.",
      "helpful_votes": 0,
      "publication_date": 20200724
    },
    {
      "title": "Already Getting A Return On The Investment!",
      "text": "So, Amazon delivered this to my door step yesterday around noon. The instructions say to fully charge the battery before uses, but when I check, it had a full charge. So I went ahead an hooked it up.......So, in came a thunderstorm around 6:30p and I had a power blip.....I was in an online zoom meeting at the time.......DIDN’T MISS A BEAT! Router never flinched, internet never blipped. Already started to get a return on the investment.",
      "rating": 5.0,
      "verified": true,
      "author": "Swiftwater",
      "helpful_votes": 0,
      "publication_date": 20200904
    },
    {
      "title": "so far so good, works as advertised.",
      "text": "it's been working great so far. We have had a couple of power outages during the holidays and I wasn't even home but this UPS kept my system running and crunching on its tasks. I would've not been able to restart my box to do its thing but thanks to this puppy, we breezed right through the quick black out and power surges.",
      "rating": 5.0,
      "verified": true,
      "author": "Punn Wiantrakoon",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Would be happy to buy another one of these!",
      "text": "I've had this UPS (1500VA) for 3 years now and it's worked perfectly! It has been through brown outs, black outs, and many tripped breakers and it's still works great! For reference, I have a gaming PC with a 800W PSU, 27\" 144Hz monitor, 2.1 speakers, and a mesh router running off the battery. When the battery kicks in, I have ~12 minutes of battery which is more than enough time for me to finish a D2 crucible match/comp game in OW, and shut down my computer (or flip the breaker). Would be happy to buy another one of these if the need arose.",
      "rating": 5.0,
      "verified": true,
      "author": "Bill W",
      "helpful_votes": 0,
      "publication_date": 20191202
    },
    {
      "title": "Great Unit...",
      "text": "Great Item works as advertised. I've had it for a few months now and have had no problems. It has protected my home entertainment center many times over the past few months. I live in South FL. and had many short power outages and brown outs due to some work FPL was doing. This unit was powerful enough to protect a 50 inch plasma, PS4, Sony Home Theater Receiver, Xfinity Modem, Asus Router, and Xfinity Cable Box. It can power all these devices non-stop for 12 minutes. Pretty impressive. The outages I experienced only lasted a few seconds to 3 minutes. I would definitely recommend this UPS to anyone with similar short outages and power fluctuations.",
      "rating": 4.0,
      "verified": true,
      "author": "Michael D.",
      "helpful_votes": 0,
      "publication_date": 20160226
    },
    {
      "title": "Works as expected",
      "text": "It is really hard to judge a device like this until it fails. We have small power glitches daily that reset our home network. This device has prevented the resets so far. We have very few actual power outages. Usually less than one a year so the battery backup may take a while to prove its worth.",
      "rating": 5.0,
      "verified": true,
      "author": "KKrofft",
      "helpful_votes": 0,
      "publication_date": 20200129
    },
    {
      "title": "Works great. I have a power hungry desktop",
      "text": "Purchased this to replace an APC that kept claiming the batteries were non functional. Works great. I have a power hungry desktop, a cable modem, a router, 4 monitors, a macbook pro, and a mac mini hooked up to this thing and I can get 20-25 minutes of runtime during power outages. Edit: 5 months later and this thing is STILL doing great! I have it powering 2 PCs and a mac, 4 monitors and 2 sets of speakers. The power has gone off a few times, and yet this unit seems to outperform my now dead APC with the same VA. Will update this review in the future, but so far I'm now a CyberPower fanboy!",
      "rating": 5.0,
      "verified": true,
      "author": "Richard C.",
      "helpful_votes": 2,
      "publication_date": 20150710
    },
    {
      "title": "F02 error. Boxed it up, sent it back.",
      "text": "F 02 error strikes again! I pre charged the system, then plugged in my PC and monitor. The system worked fine for a week, then it started beeping. The screen had the F 02 error. After troubleshooting and resetting multiple times, I got it to work again, for about an hour. Then it F 02ed on me again. Boxed it up, sent it back.",
      "rating": 1.0,
      "verified": true,
      "author": "SterlingEdge",
      "helpful_votes": 7,
      "publication_date": 20151005
    },
    {
      "title": "good product",
      "text": "good UPS system. battery lasts long enough to save and shutdown electrical systems. the unit gets tested once a month. battery life varies on how much and what is plugged in. lasts from an hour to a few hours. no problems so far with this unit",
      "rating": 5.0,
      "verified": true,
      "author": "wilson",
      "helpful_votes": 0,
      "publication_date": 20190429
    },
    {
      "title": "I had bad luck!",
      "text": "Guess I have been unlucky with this one. Every now and then, it starts beeping with an \"F02\" error. Unfortunately, I kept resetting it without investigating, and it turns out that it was not charging, so today when the power went out, it didn't backup anything at all. My fault for not returning it when I had the chance. Now I must rely on MFGR warranty, and I plan to buy a replacement, probably APC true sine wave. I have a bigger CyberPower unit (1500VA sine wave) that has been working fine since 2013.",
      "rating": 2.0,
      "verified": true,
      "author": "J. Richards",
      "helpful_votes": 3,
      "publication_date": 20150718
    },
    {
      "title": "Failed to protect my home theather system and TV.",
      "text": "I have had this product for a few years and everything seemed fine. Couple days ago lighting struck near by surge protecter failed and fryed my home theater and TV and who know whats else got damaged. We werent even useing the equipment at the moment. You let me down cyberpower !!",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190522
    },
    {
      "title": "Good product",
      "text": "Two months in and it’s worked every time we’ve needed it to. We have had several brown outs that were enough to reset clocks in the house, and at least one short black out. The computer and monitors never batted an eye. The UPS kicked in as expected, beeped to let us know, and did it’s job. No issues thus far.",
      "rating": 5.0,
      "verified": true,
      "author": "Tonya murray",
      "helpful_votes": 0,
      "publication_date": 20190819
    },
    {
      "title": "Well worth the money !",
      "text": "Live in Florida where the power seems to go out daily for brief periods. 20 minutes after hooking this up we had a power failure. It was great !!! no loss of power to the TV or satellite equipment, stereo equipment, etc, meaning no annoying resetting of devices and clocks. Have one on my PC in another part of the house and am ordering one to protect my HAM radio equipment. Well worth the money. Lightening yesterday took out several unprotected light bulbs in other parts of the house, a common occurrence here in the lightening capital of the USA... no harm to any of the protected products.",
      "rating": 5.0,
      "verified": true,
      "author": "rb",
      "helpful_votes": 0,
      "publication_date": 20150925
    },
    {
      "title": "Very pleased - performs better than I expected",
      "text": "I purchased this UPS to replace two individual units that provide backup power and conditioning to our entertainment center. I have been using this for a while now, and have experienced numerous power fluctuations and outages, and it works like a charm. It can provide power to my 42\" television, audio system,and cable box for about 30 minutes. This gives me plenty of time to start the generator. Actually, for the price Amazon charges for this you would probably spend close to that just replacing a couple of batteries in an old UPS.",
      "rating": 5.0,
      "verified": true,
      "author": "Ron Morgan",
      "helpful_votes": 2,
      "publication_date": 20150907
    },
    {
      "title": "Needed a Battery Backup",
      "text": "This Backup worked as expected, when im trading on stock market i need my computer up in case power outtage and a few days after i purchased this Battery Backup , power went out and i worked great 1 Computer , 3 monitors, Cable Modem, and Routers are hooked to it. as the power went out, everything was still on, and all of my hardware was still running i dont know how long they would of ran, i'll test that next time, I was able to shut all down with out being stuck in a Stock Trade.",
      "rating": 5.0,
      "verified": true,
      "author": "Dave Palmer",
      "helpful_votes": 0,
      "publication_date": 20200926
    },
    {
      "title": "Worked so well I bought a second one.",
      "text": "This is my second purchase of this model. The first worked so well I bought another for my other system. Connected to computer very easily. Works invisibly in the background without any noises. However, it does beep like crazy when the power goes out. I plugged a power strip into the back and route my power lines from there. Makes for a bit cleaner installation since the short computer power cords did not reach where I wanted to place the battery pack-up.",
      "rating": 5.0,
      "verified": true,
      "author": "Kenneth W. Church",
      "helpful_votes": 0,
      "publication_date": 20171220
    },
    {
      "title": "Great Value",
      "text": "I have purchase many of this model and never had any issues. I have used this model on Servers as well and desktops for a reasonable up time in a lightening prone area.",
      "rating": 5.0,
      "verified": true,
      "author": "George Loring",
      "helpful_votes": 0,
      "publication_date": 20190828
    },
    {
      "title": "A Good UPS at a Good Price",
      "text": "My 6 year old UPS died recently. It was from another manufacturer and had served me well. It of course decided to die at 4:30 AM with a loud squeal. I searched and the CyberPower model was highly recommended with more options than the locally available models. It isn't available for 2-day shipping given the requirement for it to come by regular ground, no big deal. It is smaller than expected. It is clearly labeled with an adequate amount of outlets. I've only had it for a few days, but so far so good.",
      "rating": 5.0,
      "verified": true,
      "author": "awraynor",
      "helpful_votes": 0,
      "publication_date": 20151007
    },
    {
      "title": "Can't beat CyberPower",
      "text": "Since I opted out of buying the extended protection plans I decided to buy this to protect my new LG 60 inch 4k TV & Vizio Sound bar. Supplies cleaner power that I hope will extend the life out of both components, well in theory that is. It was also a lightning sale, a deal I couldn't pass up. Also in the event of a power outage, I can still watch TV uninterrupted for 20 minutes according to the built in LCD screen. I have a older CyberPower CP1500PFCLCD 900w model for my computer that is over 3 years old that still works great so it was another reason for a second purchase from Cyberpower.",
      "rating": 5.0,
      "verified": true,
      "author": "Orlean",
      "helpful_votes": 0,
      "publication_date": 20160228
    },
    {
      "title": "This is a good little product",
      "text": "I rate it a 3 because what they don't tell you it does absolutely nothing in a thunder storm. My stereo receiver channel a burnt out because the lightning was 3 miles away. Don't be fooled. All these products just protect for simple surges and not a thunder storm. If you want to save your tv.....unplug it in monsoon season when not watching it.",
      "rating": 3.0,
      "verified": true,
      "author": "Lois",
      "helpful_votes": 0,
      "publication_date": 20180814
    },
    {
      "title": "so my machine acts very much like a plugged in laptop",
      "text": "I've got it powering my desktop computer with several hard drives, and my samsung 28\" 4k monitor, plus HP Microservers and an HP 22\" monitor. It recently ran for about 45 minutes before I started shutting down my servers. It's plugged into my Windows 10 desktop via the USB monitoring port. I didn't add any custom software, so my machine acts very much like a plugged in laptop, with basic details about the battery status and differing power profiles run when on battery from plugged in. I didn't lose any data, even from open web browser tabs, during a recent multi hour power outage, so it was completely worth the purchase for ongoing peace of mind.",
      "rating": 4.0,
      "verified": true,
      "author": "William C. Bonner",
      "helpful_votes": 2,
      "publication_date": 20161123
    },
    {
      "title": "Extremely dissapointed",
      "text": "Like most people, I never write reviews as it is inconvenient. This time I feel I should to warm other people. In short, I unpacked the CyberPower BRG1500AVRLCD unit and plugged it in to charge to the 8 hours as stated by the manufacturer. After 2 hours I started noticing a bad smell and irritated my throat. I power it off waiting it out for a day and tried again. The same thing happened after 4 hours and this time it gave me a worse soar throat. I am removing this device and sending it back.",
      "rating": 1.0,
      "verified": true,
      "author": "Al",
      "helpful_votes": 0,
      "publication_date": 20200624
    },
    {
      "title": "Great BUT DO NOT PLUG YOUR ETHERNET INTO IT",
      "text": "Great BUT DO NOT PLUG YOUR ETHERNET INTO IT. I DID THIS and my speed went from 90 MBPS to 10 and I even called comcast out to fix it we tried everything and finally figured out it was the Cyber power. Other than that its great !",
      "rating": 4.0,
      "verified": true,
      "author": "Winship",
      "helpful_votes": 6,
      "publication_date": 20170720
    },
    {
      "title": "but fortunately I did not have any documents being created",
      "text": "Purchase on October 23, 2014. It has performed flawlessly until tonight (03-08-2016). I heard a click from the Battery backup unit and everything that is hooked up to the Cyber Power Unit took a hard shut down. All devices immediately restarted. I then disconnected the battery backup unit from the AC and it started running on the batteries. I have no idea what happened, but fortunately I did not have any documents being created. I would have given the Cyber Power Battery backup a 5 star if it was not for this one bad experience.",
      "rating": 4.0,
      "verified": true,
      "author": "Richard H",
      "helpful_votes": 0,
      "publication_date": 20160308
    },
    {
      "title": "Works Great!",
      "text": "I have had this for over a year and it works great. I have had two power outages and it worked without hesitation. It has easy to read detailed information about the battery and the estimated time left. I would most definitely buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Elite Sales",
      "helpful_votes": 0,
      "publication_date": 20190806
    },
    {
      "title": "Good value for the money.",
      "text": "I am a heavy user with multiple computers and electronics at home that I use UPS's on. I've gone through many of these from different brands over the years and believe that the CyberPower UPS's are as good or better than any other on the market with similar specs but usually at a better price.",
      "rating": 5.0,
      "verified": true,
      "author": "Rob W",
      "helpful_votes": 0,
      "publication_date": 20181128
    },
    {
      "title": "Fantastic product. Love it!",
      "text": "Love this CyberPower unit. Wish I'd bought this one first. Plenty of plugs (5 each - surge and backup surge protected) and fairly easy to set up. The usb ports can be used for charging whether the power is on or back up is operating. (If not, contact support.) Love the lighted front display. Wished I'd measured where it was going. Much taller than I guessed and had to relocate the unit. If the plugs were spaced further apart things would be easier to plug in. Power-on-plug units will cover 2 plug sockets.",
      "rating": 5.0,
      "verified": true,
      "author": "mrfixit01",
      "helpful_votes": 0,
      "publication_date": 20150219
    },
    {
      "title": "Very easy installation and perfect for home",
      "text": "I'm not at expert at all installing anything, but this one was super easy. Just plug in everything you need, and you're ready to go. All my equipment is protected now.",
      "rating": 5.0,
      "verified": true,
      "author": "Aumar",
      "helpful_votes": 0,
      "publication_date": 20200723
    },
    {
      "title": "Very good unit and great price",
      "text": "awesome ups very compact and give about 1 hour of run time when power fails. I rewired it to An external bank of 4 50 amp hour batteries and now have about 25 hours of run time. The power inverter is only 900 watts so it will only run the computer, monitor and A light. (I have power hungry equipment)",
      "rating": 5.0,
      "verified": true,
      "author": "Russell Montgomery",
      "helpful_votes": 2,
      "publication_date": 20161122
    },
    {
      "title": "Good compact UPS",
      "text": "Compact unit, good data readouts so you know what is what. Had its predecessor for many years, finally was replacement time and I selected the successor unit. Improvements include UPS charging ports, a nice touch. I've always been happy with CyberPower products.",
      "rating": 5.0,
      "verified": true,
      "author": "video_man",
      "helpful_votes": 0,
      "publication_date": 20181211
    },
    {
      "title": "The CyberPower business software works pretty well too",
      "text": "I needed a higher capacity UPS and when this came up as a lightning deal, I bought it. It's been in service for ten months with no issues. Loads range from routing equipment to several servers and it handles all with ease. The CyberPower business software works pretty well too. Update: Nearly four years of continuous use and still no issues. I haven't replaced the batteries yet, but I still have sufficient run time.",
      "rating": 5.0,
      "verified": true,
      "author": "Austin",
      "helpful_votes": 0,
      "publication_date": 20161011
    },
    {
      "title": "Silent Running and Works...",
      "text": "Its a functional UPS... Not much more to say about it except its silent... Which I highly appreciate.",
      "rating": 5.0,
      "verified": true,
      "author": "WESSEC",
      "helpful_votes": 0,
      "publication_date": 20190726
    },
    {
      "title": "Very Robust",
      "text": "PROS: - Outstanding battery life - Can support my computer and router for a full 70 minutes! - Included software is useful in many applications - I've configured mine to shutdown my computer before the battery runs out to prevent data loss - Extemely solid build quality - Display provides useful information - Minutes until shutdown is especially helpful - The fast charging USBs are nice amenities in home applications - Well documented instructions CONS (sort of): - Not cheap, but is well priced compared to other brands Overall, this CyberPower is a very nice addition to any home or business with critical power needs. If you can manage the price, it's worth it!",
      "rating": 5.0,
      "verified": true,
      "author": "John Hollowell",
      "helpful_votes": 2,
      "publication_date": 20150829
    },
    {
      "title": "Great Back-up",
      "text": "I have 4 cyberpower units for my security cameras, computer and My stereo system. All are working great love the backup time it give me. Plus the lightning protection. Also helps during hurricane season.",
      "rating": 4.0,
      "verified": true,
      "author": "steve",
      "helpful_votes": 0,
      "publication_date": 20190724
    },
    {
      "title": "So far, so good.......",
      "text": "So far, i'm happy with it. Haven't had a power outage since i got it, but did the self test and everything stayed on. Larger and heavier than i thought, i guess that's a good thing. Will know better once we have another power loss",
      "rating": 5.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 0,
      "publication_date": 20180329
    },
    {
      "title": "Protect your equipment, completely",
      "text": "Excellent unit. I have cyberpower units on all of my electronics. This unit handles my led lcd tv, dish box and sound bar with ease. We have numerous power surges and short interruptions in power here, so these units protect all of my equipment. If you dont use a ups on your expensive equipment, you may regret it as just using surge protectors will not protect from over and under voltage and other problems.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert",
      "helpful_votes": 0,
      "publication_date": 20160203
    },
    {
      "title": "Backup does not work",
      "text": "I’ve had this for a year and a half. I suspected something was wrong with it. In the past week I’ve had two power outages and it has failed to work. It does not offer any back up power supply. I have several devices plugged in to the side labeled power and surge. Too late to return now. I wish I bought it at Costco and then I could still return it.",
      "rating": 1.0,
      "verified": true,
      "author": "FlynE",
      "helpful_votes": 0,
      "publication_date": 20200207
    },
    {
      "title": "Works great",
      "text": "I love this thing had a Few blackout's and was playing my PlayStation 4 pro and power went out gave me time to save my game and turn it off.",
      "rating": 5.0,
      "verified": true,
      "author": "Manuel",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "Very easy to install and use",
      "text": "Stands there in complete silence and does its job without me needing to ever give it a second thought. Just exactly what I want my UPS to do.",
      "rating": 5.0,
      "verified": true,
      "author": "BMoore",
      "helpful_votes": 0,
      "publication_date": 20200122
    },
    {
      "title": "Great backup power!",
      "text": "Power for all but the most power hungry gaming systems. Runs a pc, modem, router and monitor (right at 900W) for an hour with no issues. Haven't tested it to see how long it will power all these devices. I like it so much I bought another to power two servers. No issues through three power outages in the six weeks I've had it hooked up.",
      "rating": 5.0,
      "verified": true,
      "author": "G. Reon",
      "helpful_votes": 3,
      "publication_date": 20150729
    },
    {
      "title": "Best UPS I've Owned, very user friendly",
      "text": "Plug and play, I have several of these UPS for various computers and have had absolute great results. They work every time and when they reach their life span you can replace the batteries for a fraction of the unit cost. These are not a vanity item, they are a necessity when it comes to protecting data. Read the instructions and its very easy to use. Comes with useful software if you want your computer to control its environment.",
      "rating": 5.0,
      "verified": true,
      "author": "zcarp",
      "helpful_votes": 0,
      "publication_date": 20160312
    },
    {
      "title": "3+ hours",
      "text": "First test, went 3 hours and 25 minutes and was still going when power came back on. Had cable modem and wifi router plugged in to backup and never lost signal.",
      "rating": 5.0,
      "verified": true,
      "author": "Kimball",
      "helpful_votes": 0,
      "publication_date": 20191030
    },
    {
      "title": "So far so good. Bought this model for battery size",
      "text": "So far so good. Bought this model for battery size. I love that it has the USB charging ports so you can charge phone even during a power outage.",
      "rating": 5.0,
      "verified": true,
      "author": "Todd",
      "helpful_votes": 3,
      "publication_date": 20170519
    },
    {
      "title": "Not recommend",
      "text": "I bought this on deal of the day around 16 months ago. Last night power shut off, this UPS only hold less then 10 mins. Only modem and NAS were on battery side, which took just 34W(measure by cyberpower software). Battery inside was manufactured 050218. This UPS is very unreliable.",
      "rating": 2.0,
      "verified": true,
      "author": "Nando Ni",
      "helpful_votes": 0,
      "publication_date": 20191207
    },
    {
      "title": "Only works in the US.",
      "text": "Does not work outside of the United States. Will not accept and charge of 50hz power which is most of the world outside of the US. Specs are not clear on this point,",
      "rating": 3.0,
      "verified": true,
      "author": "Mark J.",
      "helpful_votes": 0,
      "publication_date": 20181206
    },
    {
      "title": "Best Power Backup on the market!!!",
      "text": "My old one of this same brand and style just died after MANY years of use and MANY/COUNTLESS power outages and bumps in this rural little town I live in. This is the only brand that holds up to the abuse my Power Company insists on throws at us!!!",
      "rating": 5.0,
      "verified": true,
      "author": "LyndaZP",
      "helpful_votes": 2,
      "publication_date": 20161215
    },
    {
      "title": "Awesome product and delivery time,",
      "text": "Great product, great price and shipping lime that is frankly, unbelievable. I finally got tired of my Ultra xfinity POS and ordered this yesterday in the afternoon. Great packaging, looks nice and installed in minutes. Software downloaded, check. Fired right up and works perfect. I recieved this in less than 24 hours. Whisky, Tango, Foxtrot! how can they even do that? Amazon=Amazing A+A+A+",
      "rating": 5.0,
      "verified": true,
      "author": "Richard D. Navarro",
      "helpful_votes": 0,
      "publication_date": 20160610
    },
    {
      "title": "Saved my computer from surges and brown outs from unstable currents.",
      "text": "Using this to protect a $2000 PC setup after my block was getting insane surges and rolls of brownouts. My system has been running flawlessly and seamlessly. I enjoy the LCD display and the usage function to see how many watts im drawing. I wish the display would stay on but it times out fairly quick. I think this is a great investment and would recommend it to those who can afford it.",
      "rating": 5.0,
      "verified": true,
      "author": "Tran",
      "helpful_votes": 0,
      "publication_date": 20150704
    },
    {
      "title": "Saving our equipment and our sanity!",
      "text": "This UPS has performed perfectly! My power is notoriously unstable. I have my gaming PC, monitor and cable router connected to it. When the power blinks out I typically shut down the PC and then my internet will stay up for 5 hours on this unit so that me and the kids can still use our phones and tablets to stay entertained while we wait for the power to come back on. Solid, reliable and effective.",
      "rating": 5.0,
      "verified": true,
      "author": "WebGuyMike",
      "helpful_votes": 0,
      "publication_date": 20160208
    },
    {
      "title": "Great product.",
      "text": "I use this for my entertainment system in my living room. We’ve had several power flickers and I was tired of having to restart my TV and sound system. This solved the issue. It has no problem powering everything and keeps us enjoying our shows. Easy to set up.",
      "rating": 5.0,
      "verified": true,
      "author": "Edwin E. Taylor Jr.",
      "helpful_votes": 0,
      "publication_date": 20171217
    },
    {
      "title": "DO NOT COUNT ON WARRANTY SERVICE.",
      "text": "IT was great until it stop working... Then try to use the warranty, not so great. I was informed by \"text support\" (after 30 min. on hold) that I will have a replacement unit within 1-2 weeks, now I am told , sometime \"next year\". Would not recommend this product or company",
      "rating": 1.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 4,
      "publication_date": 20150120
    },
    {
      "title": "No Support",
      "text": "\"no agents are available\"; that about sums it up. The software (power panel personal) doesn't work.",
      "rating": 3.0,
      "verified": true,
      "author": "Hlow",
      "helpful_votes": 0,
      "publication_date": 20190104
    },
    {
      "title": "The return process was easy, HOWEVER",
      "text": "I ordered on July 25, 2015. A couple of months ago I noticed that the battery backup was turning off and turning off everything connected to it. I reached out to CyberPower support for assistance as the device is still covered by the manufacturers warranty. The return process was easy, HOWEVER, they are requiring me to pay to ship the DEFECTIVE product back to them. Sure they pay to ship it back but how is this even fair? I am extremely disappointed with this decision and I want to make sure other people know about it.",
      "rating": 1.0,
      "verified": true,
      "author": "Richard G.",
      "helpful_votes": 22,
      "publication_date": 20170913
    },
    {
      "title": "Not Charging",
      "text": "Bought it July 2018, it stopped charging in November 2019. You won't notice, until you don't have power. I don't recommend this unit.",
      "rating": 1.0,
      "verified": true,
      "author": "Lizzie",
      "helpful_votes": 0,
      "publication_date": 20191130
    },
    {
      "title": "Good product -",
      "text": "Does what's expected. Batteries have reduced in weight over the years and surprised at the weight of this is 1500va unit. Email notification alerts from the pc software would have been a nice feature - unless I missed the how-to on this. Useful see how much power your ups connected devices are drawing as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Marcel Da Silva",
      "helpful_votes": 0,
      "publication_date": 20151008
    },
    {
      "title": "Great if they can be delivered in working condition.",
      "text": "Ordered two of these. One worked perfectly. The other had its battery non-functional. Had to do a warranty return with the manufacture. They sent me back a working product. Only problem is they bent the prongs for the power connector in the process. Luckily I was able to bend them back into place to fit into the power socket and works fine now. Quite the hassle in just getting it to you in working condition.",
      "rating": 3.0,
      "verified": true,
      "author": "Azure",
      "helpful_votes": 0,
      "publication_date": 20171027
    },
    {
      "title": "3 months and so far so good. I have pretty good power delivery already",
      "text": "3 months and so far so good. I have pretty good power delivery already, so i bought this mainly for the UPS. It does what it's suppose to. Getting 45+ minutes of run time on a fairly beefy computer. (AMD 8core, 8GB RAM, 6 NAS Drives, 2 Video Cards, 24\" LED Monitor). Got it for a steal during the Black Friday sale.",
      "rating": 4.0,
      "verified": true,
      "author": "JonGP3",
      "helpful_votes": 2,
      "publication_date": 20150117
    },
    {
      "title": "Dead on Arrival, Can Not Return, Do Not Buy",
      "text": "BEWARE, dead on arrival and can not return! The company is sending out bad units purposely! Do Not Buy!",
      "rating": 1.0,
      "verified": true,
      "author": "Byron N.",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "Great protection for pricey purchases",
      "text": "Been working great so far ! Lots of power surges at my house and protects multiple devices.",
      "rating": 5.0,
      "verified": true,
      "author": "Brett Baker",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "Works great. Had a power outage recently and it kept ...",
      "text": "Had this for a couple of months now. Works great. Had a power outage recently and it kept the power on without blinking. With my 55\" LED TV, Surround Sound System, and the Comcast DVR box hooked up, I can watch TV for about 35 minutes if need be, and the cable box alone would last for 6 hours in case I wanted to record something while the power was out.Lots of outlets for whatever you need in your entertainment center.",
      "rating": 5.0,
      "verified": true,
      "author": "Alan J.",
      "helpful_votes": 30,
      "publication_date": 20150104
    },
    {
      "title": "This has to be one of my best purchases lately",
      "text": "This has to be one of my best purchases lately. Plenty of outlets both for battery protected and for surge protected. Since purchased and installed, it's kept my important gear running through one outage and six or seven short glitches that cut power throughout the house. I highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard Moore",
      "helpful_votes": 0,
      "publication_date": 20160607
    },
    {
      "title": "Great little UPS",
      "text": "Benn using it for months for a super low powered server computer. The computer runs at about 11 watts constant and this thing will keep it going for hours with no power. The software for it works really cool too, i have the computer set to turn itself off gracefully when this battery hits 5%.",
      "rating": 5.0,
      "verified": true,
      "author": "Spartan F8",
      "helpful_votes": 0,
      "publication_date": 20160701
    },
    {
      "title": "Solid and dependable with lots of outlets",
      "text": "Exactly what I needed. It allows me to plug in everything, multiple hard drives, etc. into one unit and it does the job. My only gripe is that I wished it allowed the beeps to be disabled when starting or shutting it down. Sometimes I start to work early in the morning and it is loud enough to wake people up.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe Mac",
      "helpful_votes": 0,
      "publication_date": 20150127
    },
    {
      "title": "This is a great UPS. I already had a Tripp Lite UPS",
      "text": "This is a great UPS. I already had a Tripp Lite UPS, but that one had a plastic smell that made me weezy. This one did not come with any, and also the fan is a lot quieter than the Tripp Lite. Would buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Casey Co",
      "helpful_votes": 0,
      "publication_date": 20161109
    },
    {
      "title": "SO FAR SO GOOD.",
      "text": "So far it is working just fine. I like the digital front, but it doesn't stay on all the time, just when you want to make a setting or change something. For the sale price I got it for (107), it was a very good buy. Never really got to test a power failure yet. I guess I could unplug it, to see if it works correctly, but probably won't do that.",
      "rating": 4.0,
      "verified": true,
      "author": "Craig",
      "helpful_votes": 0,
      "publication_date": 20150420
    },
    {
      "title": "Save your computer",
      "text": "I have two computers and monitors attached and though three power outages they never so much as flickered.",
      "rating": 5.0,
      "verified": true,
      "author": "Harold",
      "helpful_votes": 0,
      "publication_date": 20190201
    },
    {
      "title": "Worth the price",
      "text": "Using this UPS to replace one where the battery cannot be replaced. A good warranty and fair price and the battery is replaceable and under warranty too.. Shipped well packed.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael K",
      "helpful_votes": 0,
      "publication_date": 20170313
    },
    {
      "title": "Works perfectly so far.",
      "text": "Replaced an aging APC that was on it's second battery. So far, I'm happier with this CyberPower than I ever was with the APC. I haven't done any real testing or diagnostics on the unit, but our power is notorious for being dirty and I've have absolutely no issues running through the BRG1500",
      "rating": 5.0,
      "verified": true,
      "author": "Darbonzo",
      "helpful_votes": 0,
      "publication_date": 20160313
    },
    {
      "title": "play from or have devices like backup drives or anything important",
      "text": "Life saver! if you don't have one and you use your machine to work from, play from or have devices like backup drives or anything important, this is a MUST. I've had a few power outages thanks to the faulty wiring at where I live and this has saved my machines and work from abrupt and possibly violent power breaks.",
      "rating": 4.0,
      "verified": true,
      "author": "Allan R. Bayaua",
      "helpful_votes": 0,
      "publication_date": 20151101
    },
    {
      "title": "seems to be working like my other has been",
      "text": "seems to be working like my other has been. Haven't had a problem with either one at this point. Have to let you all know further in the future. See what comes in time on both models I have. Will say this, any apc I had , never worked as well as cyber power. Too bad they won't let you list good sites on here and others to stay away from.",
      "rating": 5.0,
      "verified": true,
      "author": "bdeath",
      "helpful_votes": 0,
      "publication_date": 20141226
    },
    {
      "title": "You can turn off the annoying beeping and screen",
      "text": "Software is a little buggy and the battery capacity is a little under performing in my eyes...",
      "rating": 4.0,
      "verified": true,
      "author": "Ron",
      "helpful_votes": 0,
      "publication_date": 20190129
    },
    {
      "title": "Works Great! Good price!",
      "text": "I usually purchase APC brand but I noticed my company uses CyberPower so I gave it a try. Less expensive and Just as good. Had power loss for half hour and this back up did the job. Was able to still use the computer till the power came on. I have one computer on this so it gave me over 45 min to before it shut down. My other Back ups gave me 5 min on the other computer. I would buy this again.",
      "rating": 5.0,
      "verified": true,
      "author": "anlazzari",
      "helpful_votes": 0,
      "publication_date": 20150912
    },
    {
      "title": "A great UPS!",
      "text": "Easy to set up. Downloadable software shows real time wattage. Lots of connections that allow you to protect multiple devices. Backup power for up to 5 devices. Pass through for your cable modem and router protects these devices as well.",
      "rating": 5.0,
      "verified": true,
      "author": "F. Fota",
      "helpful_votes": 0,
      "publication_date": 20160713
    },
    {
      "title": "These are smaller and more light weight than the previous ...",
      "text": "These are smaller and more light weight than the previous types of back up power we have purchased in the past. We are slowly switching all of our computers, network and printer devices over to these.",
      "rating": 5.0,
      "verified": true,
      "author": "William C.",
      "helpful_votes": 0,
      "publication_date": 20180222
    },
    {
      "title": "Works great",
      "text": "I have 6 of these units running in various locations. No problems out of any of them. I'm very pleased and purchased more than one. I would suggest for mid sized computer system. I live in Florida; in lightning alley. I know power outages, brown outs and power surges. This product has not let me down yet.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20150611
    },
    {
      "title": "Fortunately it hasn't had to activate yet",
      "text": "very nice, slim design, smaller than I thought it might have to be (this is good) The battery clock indicates that my computer would not remain on for as long as I expected when I bought this big an APC. But still long enough to save any work and probably last through many of our power outages.",
      "rating": 4.0,
      "verified": true,
      "author": "Timothy Wittik",
      "helpful_votes": 0,
      "publication_date": 20150705
    },
    {
      "title": "Great priduct this my second one",
      "text": "Keep my tv on for over A hours after power went out",
      "rating": 5.0,
      "verified": true,
      "author": "Helena G W",
      "helpful_votes": 0,
      "publication_date": 20190709
    },
    {
      "title": "I like these digital readout ones for knowing at a glance ...",
      "text": "I started switching to CyberPower from APCC due to short life on APC stuff. I like these digital readout ones for knowing at a glance what my load and life expectancy is. I have one on my PC, one on my big aquarium, and one on my nightstand to keep everything running and charged in the event of an outage.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20150406
    },
    {
      "title": "Use this as backup power supply for my garage door opener.... Super",
      "text": "I use this UPS as a backup power supply for my Liftmaster Garage Door Opener. When the power goes out, it jumps in and runs the motor. The 1500 VA is twice a bit more than I needed. It works great.",
      "rating": 5.0,
      "verified": true,
      "author": "AGumb",
      "helpful_votes": 2,
      "publication_date": 20151120
    },
    {
      "title": "Impressed. This is awesome.",
      "text": "Impressed. This is awesome. I compared with the other brands, and this model from CyberPower came out on top. Will defiantly purchase more.",
      "rating": 5.0,
      "verified": true,
      "author": "MikeBWCA",
      "helpful_votes": 0,
      "publication_date": 20180407
    },
    {
      "title": "works great. Had a short power failure due to Harvey ...",
      "text": "Was simple to set up, works great. Had a short power failure due to Harvey here in Texas and it did the job.",
      "rating": 5.0,
      "verified": true,
      "author": "Ronald Albrecht",
      "helpful_votes": 0,
      "publication_date": 20170908
    }
  ],
  "product_meta": {
    "title": "CyberPower BRG1500AVRLCD Intelligent LCD UPS System, 1500VA/900W, 12 Outlets, AVR, Mini-Tower, 5-Year Warranty,Black",
    "description": "Size:1500VA| Style:UPSA mini-tower UPS with line interactive topology the CyberPower Intelligent LCD Series BRG1500AVRLCD provides battery backup (using simulated sine wave output) and surge protection for desktop computers workstations networking devices and home entertainment systems. The BRG1500AVRLCD uses Automatic Voltage Regulation (AVR) to correct minor power fluctuations without switching to battery power which extends battery life AVR is essential in areas where power fluctuations occur frequently. Two USB charge ports (2 1 Amp shared) rapidly power portable devices such as mobile phones MP3 players and cameras. The BRG1500AVRLCD comes with a five-year (including coverage of batteries) and a 500 000 connected equipment.",
    "rating": 4.5,
    "feature_bullets": [
      "1500VA/900W Intelligent LCD Battery Backup Uninterruptible Power Supply (UPS) System",
      "12 NEMA 5-15R outlets: 6 battery backup & surge protected outlets, 6 surge protected outlets safeguard desktop computers, workstations, networking devices and home entertainment equipment. The UPS also includes two USB charge ports (2.1 Amps shared) to power portable devices",
      "Multifunction LCD panel: Displays immediate, detailed information on battery and power conditions, including: Estimated runtime, battery capacity, load capacity, etc.",
      "Automatic Voltage Regulation (AVR): Corrects minor power fluctuations without switching to battery power, thereby extending the life of the battery.",
      "5-year warranty including the battery; $500,000 connected equipment guarantee and free PowerPanel personal edition management software (Download)"
    ],
    "specifications": {
      "Product Dimensions": "14 x 3.9 x 11 inches",
      "Item Weight": "25 pounds",
      "Manufacturer": "Cyber Power",
      "ASIN": "B00LEFYISA",
      "Item model number": "BRG1500AVRLCD",
      "Batteries": "2 12V batteries required.",
      "Customer Reviews": "4.5 out of 5 stars762 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#38 in Computer Uninterruptible Power Supply Units",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "June 24, 2014"
    },
    "categories": [
      "Computers & Accessories",
      "Electronics",
      "Uninterruptible Power Supply (UPS)",
      "Computer Accessories & Peripherals"
    ],
    "price": 169.95
  }
}