{
  "website_summaries": [
    {
      "verdict": "Dependable, affordable, and straightforward to use. An excellent glucometer and comprehensive kit.",
      "pros": [
        "Easy to use",
        "Highly accurate with spacious memory for tracking trends",
        "Doesn't require a lot of blood",
        "Affordable kit includes 110 strips and carrying case"
      ],
      "cons": [
        "Strips are somewhat costly",
        "A few reports of faulty models with inconsistent readings"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "YOUR LIFE IS WORTH IT!",
      "text": "Don't buy cheep knock-off meters when your life is at stake! Blood sugar testing devices ARE DIFFERENT! like the difference between a 10 dollar cheep bathroom scale to a scientific scale, there IS a BIG DIFFERENCE. You only have 1 life and ACCURACY means the difference between too much insulin and not enough. Stay with the QUALITY!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 9,
      "publication_date": 20181204
    },
    {
      "title": "Although the meter is fine trying to get support from Roche is impossible",
      "text": "Although the meter is fine trying to get support from Roche is impossible, all I wanted was a download kit they are useless. As soon as I am done with the supplies for this I am done with it! The vendor and the delivery we great .... what a shame the mother ship is so bad!",
      "rating": 1.0,
      "verified": true,
      "author": "John R Peterson",
      "helpful_votes": 13,
      "publication_date": 20180221
    },
    {
      "title": "Easy to Use but Questionable Accuracy",
      "text": "Easy to use but I question its accuracy. I used it 30 minutes before a fasting lab test and the Accu Chek's number was 15 points below the lab's. That worried me so I contacted Roche for a control solution and they responded: Dear Ed, The Accu-Chek Performa is not approved for use in the U.S. We do not manufacture the control solution for this model. Kind Regards, cid:image001.png@01D2A4B2.B3A45130 Explore. Discover. Experience Phone: 1-800-816-4373 Website: www.accu-chekto.com",
      "rating": 3.0,
      "verified": true,
      "author": "Ed McCarthy",
      "helpful_votes": 15,
      "publication_date": 20180320
    },
    {
      "title": "Accu Chek Performance blood glucose.  ;)",
      "text": "Items were expiring in 2 months. One box of strips wasnt included. Boxes were tampered with and the seal had been broken. Also...1 extra box of test strips was missing.",
      "rating": 1.0,
      "verified": true,
      "author": "Bridget Bravenwolf",
      "helpful_votes": 7,
      "publication_date": 20180720
    },
    {
      "title": "My package is no new, the Roche security Seal ...",
      "text": "My package is no new, the Roche security Seal is broken and is missing one test strip box! Tell me what to do!",
      "rating": 1.0,
      "verified": true,
      "author": "Gaby P.",
      "helpful_votes": 10,
      "publication_date": 20180113
    },
    {
      "title": "Purchased two of these - these were for my parents ...",
      "text": "Purchased two of these - these were for my parents and in-laws living in another country. One seems to be always off and never consistent. The other one is off between 10 and 15 points but is consistent. The numbers were compared to regular lab tests.",
      "rating": 2.0,
      "verified": true,
      "author": "Leo",
      "helpful_votes": 8,
      "publication_date": 20170418
    },
    {
      "title": "Very not good!",
      "text": "When I got the kit.I find that the battery inside already low power,and the 10 test strips is 2 days before out ofdate.The rest 100 test strips will out of date by jan 2019,it's terrible!",
      "rating": 1.0,
      "verified": true,
      "author": "lipeng",
      "helpful_votes": 6,
      "publication_date": 20181113
    },
    {
      "title": "I have `had Accu-Cheks for years but this one developed ...",
      "text": "I have `had Accu-Cheks for years but this one developed an E-9 (battery) error two weeks after It arrived. I bought brand new batteries, inserted them and it still didn't work. A couple of days later I got an email from Accu-Chek to get an upgrade for free. However it required that I get a prescription from a doctor for a new type of tester strip.. I consider this a bate and switch dodge and will never buy another Accu-Chek device!!! I advise others to beware of them, too. I am replacing this one with a DIFFERENT BRAND!",
      "rating": 1.0,
      "verified": true,
      "author": "Virginia Chittick",
      "helpful_votes": 9,
      "publication_date": 20180321
    },
    {
      "title": "JUNK",
      "text": "DO NOT BUY FROM THIS SELLER. The seal was broken on the package, the battery in the glucometer was already dead, and the lancing device does not work. I'm furious that I waited the couple extra days for this item to ship. The seller should be removed from Amazon for distributing defective healthcare equipment.",
      "rating": 1.0,
      "verified": true,
      "author": "Alyssa",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "Mobile Health Clinic",
      "text": "We are using the Accu-Chek Performa Glucometer Kit for a trial run at one of our remote rural community mobile clinics in central Mexico. If successful we will begin to add them to other units as we elevate access to healthcare for 55,000 Otomi and Chichimeca Indians who reside there.",
      "rating": 5.0,
      "verified": true,
      "author": "Missions for Life",
      "helpful_votes": 0,
      "publication_date": 20190309
    },
    {
      "title": "I did not Receive the product",
      "text": "1 . product reached late and the hotel which i was staying in orlando did not accept the product and send back because i had told them not to accept . 2. whne i made a place a order it was showing me that it would deliver my stay in hotel before 21st aug but on 19th aug it was showing the product will deliver on 22 nd aug which i will be not available in orlando .",
      "rating": 1.0,
      "verified": true,
      "author": "dileep",
      "helpful_votes": 0,
      "publication_date": 20190827
    },
    {
      "title": "No product support in the US",
      "text": "I had a problem with the meter after several months of use. Roche Diabetic Products is the manufacturer of the product, however, when I contacted them I was advised that this particular product is not to be sold in the US and is, therefore, not supported by them. DO NOT BUY this product if you live in the US",
      "rating": 1.0,
      "verified": true,
      "author": "Mingy1",
      "helpful_votes": 0,
      "publication_date": 20200221
    },
    {
      "title": "Meter Expires in 4 Months",
      "text": "Very disappointed. Other new meters I've purchased have at least two years of service. This meter expires 9/30/2019. The 100 test strip package expires 3/31/2020. My experience has been that those dates matter and accuracy falls off as the meter ages. I placed my order in April and it arrived June 1 - over a month in transit from India. I guess I missed that info in the sales process! Won't buy from this supplier again.",
      "rating": 1.0,
      "verified": true,
      "author": "Margaret Gonzalez",
      "helpful_votes": 0,
      "publication_date": 20190601
    },
    {
      "title": "Pen is a throwaway",
      "text": "The pen that comes with this is unnecessarily complicated to ready, and the pouch for the kit is one of the worst I've seen. The meter and strips are fine. My advice is use a different pen if you have one.",
      "rating": 2.0,
      "verified": true,
      "author": "S. Watkins",
      "helpful_votes": 0,
      "publication_date": 20180722
    },
    {
      "title": "Glucometer",
      "text": "Works fast but battery life isn't very long, so not a 5 star in my book.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190228
    },
    {
      "title": "Battery died soon, but except it, good products",
      "text": "I ordered this from Japan, and shipping is free. I appreciate it to Amazon. In Japan, it's much more expensive. The product is really great even though the battery died after using a couple of times. I was anxious for the pain, but actually, I don't feel pain with the needles. I recommend this products.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20161218
    },
    {
      "title": "You can relay on Amazon for your needs",
      "text": "I have been using my mother's unit it was time for a new one. Very easy to use. My mother use to buy from Amazon quite offen. I'm very pleased",
      "rating": 5.0,
      "verified": true,
      "author": "Cathy Morse",
      "helpful_votes": 0,
      "publication_date": 20200629
    },
    {
      "title": "quit working",
      "text": "Bought this monitor in October 2019. February 1, 2020 would not power on, changed the battery (twice) - DEAD. Amazon says return window closed November 1, 2019 so it apparently had a 27 day warranty.",
      "rating": 1.0,
      "verified": true,
      "author": "Al Nagel",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "Recommend",
      "text": "Very easy to use, uses very little blood. Nice kit.",
      "rating": 5.0,
      "verified": true,
      "author": "D.B",
      "helpful_votes": 0,
      "publication_date": 20181211
    },
    {
      "title": "Trouble",
      "text": "Machine worked well for a couple of months. Then it started to drain the battery too fast. I was buying battery replacements every week. I didn’t report or exchange.",
      "rating": 5.0,
      "verified": true,
      "author": "Susana Iturbe",
      "helpful_votes": 0,
      "publication_date": 20190919
    },
    {
      "title": "Not for U.S. Consumer",
      "text": "DO NOT BUY THIS METER IF YOU ARE A CONSUMER IN THE U.S. you won,t be able to buy supplies or get support from Accu-Chek unless you are a healthcare professional or a healthcare institution.",
      "rating": 1.0,
      "verified": true,
      "author": "JAC",
      "helpful_votes": 0,
      "publication_date": 20190426
    },
    {
      "title": "Battery issue",
      "text": "The product has been giving problem from day one with error message E9 - battery needs replacement. I would like it to be resolved by getting a replacement urgently.",
      "rating": 2.0,
      "verified": true,
      "author": "Pramod ",
      "helpful_votes": 0,
      "publication_date": 20181228
    },
    {
      "title": "Great Glucometer!",
      "text": "This glucometer is excellent. Its small size is convenient for travel. It is extremely easy to use and gives reults immediately.",
      "rating": 5.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20170211
    },
    {
      "title": "Works great, at a great price for strips as well",
      "text": "Works great, at a great price for strips as well. My wife's insurance on her supplies and we were able to get these at a much better price than her copay.",
      "rating": 5.0,
      "verified": true,
      "author": "Tom H",
      "helpful_votes": 0,
      "publication_date": 20180521
    },
    {
      "title": "Good!!",
      "text": "Perfect!! It works very well and is easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "José Gimenez",
      "helpful_votes": 0,
      "publication_date": 20181104
    },
    {
      "title": "can not trust the strips are new or old",
      "text": "The original box of the strips had been opened, wrapped with plastic wrap",
      "rating": 1.0,
      "verified": true,
      "author": "Mun kim",
      "helpful_votes": 0,
      "publication_date": 20190926
    },
    {
      "title": "Five Stars",
      "text": "work well and easy to control blood sugar and very limit pain. Thank you.",
      "rating": 5.0,
      "verified": true,
      "author": "Hanh Pham",
      "helpful_votes": 0,
      "publication_date": 20180724
    },
    {
      "title": "it doe snot perform correctly",
      "text": "do not buy this, it cant be serviced or get help for it in usa .",
      "rating": 1.0,
      "verified": true,
      "author": "Michael R",
      "helpful_votes": 0,
      "publication_date": 20190306
    },
    {
      "title": "Buyer Beware. Do not buy this product. It ...",
      "text": "Buyer Beware. Do not buy this product. It is not a US Accu Chek and is way off. I did a test at the doctor with there Glucometer at the same time as this one. Thire's read 127. this one read 230. When I called Accu Chek, they said it was not supported by them because it's not one of their US products.",
      "rating": 1.0,
      "verified": true,
      "author": "Rick Ross",
      "helpful_votes": 5,
      "publication_date": 20171207
    },
    {
      "title": "Got it before expected delivery date",
      "text": "Got right way before the expected time. Everything was great.",
      "rating": 5.0,
      "verified": true,
      "author": "Layane Maximiliano",
      "helpful_votes": 0,
      "publication_date": 20160217
    },
    {
      "title": "it is a good meter, but I just wonder about the test ...",
      "text": "it is a good meter, but I just wonder about the test solutions for this meter. I did not get any for this meter do you need any solution",
      "rating": 4.0,
      "verified": true,
      "author": "deborah b bartley",
      "helpful_votes": 0,
      "publication_date": 20171116
    },
    {
      "title": "Do not buy! The testing units is dated for ...",
      "text": "Do not buy! The testing units is dated for April 30th 2017 today's date is January 12th 2017 I was under the impression that the meter would be a newer model with a longer expiration date. This strips are dated for July 2017 I have been a diabetic and testing for many years I have never had a unit that had expiration date this soon and my other test strips for my two years ahead of time.",
      "rating": 1.0,
      "verified": true,
      "author": "luv shopping",
      "helpful_votes": 5,
      "publication_date": 20170112
    },
    {
      "title": "Thank you Fred, for your correction, or I ...",
      "text": "Thank you Fred,for your correction,or I would think something missing during the delivery.anyway,I hope this kit should include the same number of lancets,in my kit there are only six lancets but 100test strips.",
      "rating": 5.0,
      "verified": true,
      "author": "jasminepeng",
      "helpful_votes": 2,
      "publication_date": 20150819
    },
    {
      "title": "Accurate device",
      "text": "In fact this is the second device I purchased to monitor my blood glucose. The previous one was from another brand, however I had big trouble with that because the inaccurate readings. So I returned previous one and do some research. Found many physicians suggested this Accu Chek device, and I decide to give a try. Have to say Accu Chek doing its job perfectly by providing me consistent accurate readings. Yes maybe the test strips cost more than others and it mighe “eat” battery, but compare to your health it worth that!",
      "rating": 5.0,
      "verified": true,
      "author": "Dong Zhang",
      "helpful_votes": 0,
      "publication_date": 20190205
    },
    {
      "title": "Little pricey - NOT TO BE SOLD IN USA.",
      "text": "On the positive side Accucheck are good meters this will be my 4th one in 12 years . Update 12/28/2018 I used the meter in the AM. it worked fine in the afternoon I tried checking my sugar ever strip I put in said E-9 after 15 I said enough called Roche they inform me this meter is not to be sold in the US. . I boxed it up and now its a return ..",
      "rating": 1.0,
      "verified": true,
      "author": "Rodney",
      "helpful_votes": 2,
      "publication_date": 20181127
    },
    {
      "title": "I like it alot very easy to use",
      "text": "Just got it and tested it out. The lancets are right inside the black bag inside the zipper part I was looking for it. It comes with it's own battery but I don't know how long this will last so I suggest you order a few off amazon. It's a 2034 3v flat battery. You mite want to order more lancets too because it only has like 10-15.",
      "rating": 5.0,
      "verified": true,
      "author": "MrPurchaser001",
      "helpful_votes": 3,
      "publication_date": 20170125
    },
    {
      "title": "This is an excellent product, however I am having one problem",
      "text": "I purchased this product before from a pharmacy. This is an excellent product, however I am having one problem. From the very first day the product is displaying E-9 error which means battery needs to be replaced or you have to go through a cumbersome process; take out the battery then press one of the arrows and put the battery back.... after that it works. But I need to do the same thing everyday which is very irritating.",
      "rating": 3.0,
      "verified": true,
      "author": "JC",
      "helpful_votes": 2,
      "publication_date": 20180426
    },
    {
      "title": "Like buying yesterday's newspaper!  Strips past expiration.",
      "text": "Might be nice to use if it came with unexpired test strips! Not supported in the USA. Wasted my money, because I couldn't find non-expired test strips. Buy the USA supported ACCU-CHEK Guide and be assured of getting fresh supplies.",
      "rating": 1.0,
      "verified": true,
      "author": "Manzaraliman",
      "helpful_votes": 0,
      "publication_date": 20181105
    },
    {
      "title": "Great Meter, Test Strips are Better Priced",
      "text": "The meter is surprisingly accurate and compares well to my much more expensive meters, test strips are much more reasonably priced.",
      "rating": 5.0,
      "verified": true,
      "author": "qcdude3",
      "helpful_votes": 2,
      "publication_date": 20171218
    },
    {
      "title": "Per Accu-chek this meter is not for sale to the ...",
      "text": "Per Accu-chek this meter is not for sale to the USA market. THIS IS A iNTERNATIONAL METER. They will not support it. They do not sell these meter strips in the USA",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20170814
    },
    {
      "title": "Medical product manufactured for India sales.",
      "text": "This item and accessories are manufactured for foreign markets and I hesitate to use anything that punctures my skin medically is packaged overseas.",
      "rating": 1.0,
      "verified": true,
      "author": "SueL",
      "helpful_votes": 0,
      "publication_date": 20191008
    },
    {
      "title": "DId not have test fluid. Not available. Returned.",
      "text": "Can't calibrate and then I find out these are not meant for sale. These should be removed or customers advised about this.",
      "rating": 1.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190316
    },
    {
      "title": "Five Stars",
      "text": "Easy to use and seems to be accurate. Would buy againl",
      "rating": 5.0,
      "verified": true,
      "author": "Linda Williams",
      "helpful_votes": 0,
      "publication_date": 20180627
    },
    {
      "title": "The Softclix Lancing Device broke after less than a week of use",
      "text": "While I like the meter the lancing device stopped working after less than a week.",
      "rating": 1.0,
      "verified": true,
      "author": "MrMojoRisin",
      "helpful_votes": 0,
      "publication_date": 20190120
    },
    {
      "title": "Easy to Use!",
      "text": "My husband loves this. His old one was too old to get supplies for but he likes the updated one even better. Great product and easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan J Tschider",
      "helpful_votes": 0,
      "publication_date": 20161220
    },
    {
      "title": "Five Stars",
      "text": "i got it for a friend and i have not heard of any problems.",
      "rating": 5.0,
      "verified": true,
      "author": "Denis E Matal",
      "helpful_votes": 0,
      "publication_date": 20180131
    },
    {
      "title": "And it was a good item.",
      "text": "The items arrived as soon as they were surprised. And it was a good item.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161221
    },
    {
      "title": "Correction to previous post.",
      "text": "I previously responded to a question from someone that asked about getting the lances with the kit. I think my answer was not quite correct. I did for sure receive 100 test strips with the kit, but I think there were only a handful of the lances that were in the kit in the zippered pouch on the kit. However, I don't think I got a box of the lancets with the kit.",
      "rating": 5.0,
      "verified": true,
      "author": "Fred",
      "helpful_votes": 6,
      "publication_date": 20150805
    },
    {
      "title": "Five Stars",
      "text": "it had work out great, helps me to keep track of my blood sugar levels",
      "rating": 5.0,
      "verified": true,
      "author": "george",
      "helpful_votes": 0,
      "publication_date": 20161017
    },
    {
      "title": "Not what I expected!",
      "text": "This product took long to be delivered because it came from India and it was tattered and the strips had 2 weeks left before it expired! Horrible!",
      "rating": 1.0,
      "verified": true,
      "author": "nina palomas",
      "helpful_votes": 6,
      "publication_date": 20161208
    }
  ],
  "product_meta": {
    "title": "Accu Chek Performa Glucometer Kit with 110 Test Strips",
    "description": "Glucometer kit with 110 strips. Strips expiry 08/18 and above.",
    "rating": 4,
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "7.4 x 7 x 2.9 inches; 1 Pounds",
      "Date First Available": "July 12, 2014",
      "Manufacturer": "Accu Chek",
      "ASIN": "B00LQDKR9Y",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Health Care",
      "Blood Glucose Monitors",
      "Diabetes Care",
      "Health & Household",
      "Health, Household & Baby Care"
    ],
    "price": ""
  }
}