{
  "website_summaries": [
    {
      "verdict": "Lightweight power tool that also has tremendous toughness for high performance in rough conditions.",
      "pros": [
        "Excellent performance level of 1,350 ft-lbs of torque that can handle most jobs",
        "Extremely tough materials in the device",
        "Offers 4 power settings to adjust torque",
        "Easy-to-use forward and reverse button",
        "Minimal vibration during use will prevent you from feeling fatigued",
        "Runs quieter than you'd think"
      ],
      "cons": [
        "Some questions over longevity if you're going to use it all day long on really tough jobs"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Broken right out of the box",
      "text": "Ordered when on vacation. Item came. Looked and feels just like my other IR titanium 1/2 guns ( own 3). By the time I got back to work I plugged it in and oiled it. Everything seemed good. When trying to remove a bolt in the vertical position ( tool facing up) it would not work. Thought maybe it needs to break in ( hoping for the best). Well as a week goes by. It gets worse, then started loosing power in and position. Broken from day 1. It is under warranty, through an outside source ( as per IR) that I have to pay to ship it too and hope they can fix it .",
      "rating": 1.0,
      "verified": true,
      "author": "J. Keidel",
      "helpful_votes": 8,
      "publication_date": 20191112
    },
    {
      "title": "It is the best one I've ever used so far",
      "text": "I should have both this ten years ago when I began working on cars. It is the best one I've ever used so far. My new coworker had just purchased the Snap On one for like $500 plus or whatever astronomical price it was. It is deafeningly loud and not any stronger than this one that I got. This one is quiet and powerful and relatively cheap - it's a sleeper! The ergonomics could be a little better on the handle, but it doesn't lose any points for that from me. It's durable, too. It has fallen off of my tool cart a couple times with no problem.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel",
      "helpful_votes": 13,
      "publication_date": 20171207
    },
    {
      "title": "Worth the money, lives up to reputation for automotive",
      "text": "Read the reviews, product lives up to reputation. Used with 3/8\" hose and inexpensive harborfreight 21gal compressor with amazing results. This tool does great with heavy rusty automotive hardware, and by adjusting down power light stuff too. Oh and it spun off the notorious flywheel bolt from my Honda Pilot 3.5L engine after only a few attempts at the trigger, of course with the help of one of those specialty thick sockets - look on YouTube or Amazon you will find out what I mean if you have a Honda needing a timing belt change.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason",
      "helpful_votes": 6,
      "publication_date": 20170701
    },
    {
      "title": "lacks power",
      "text": "this thing lacks power right out of the box. i thought maybe i just had a defected unit so i sent back and got another. the 2nd one is just the same. the restrictions is in the filter for the quiet operation. you would have to remove the filter for it to work correctly but then it would defeat the purpose of buying a quiet version. i ending up returning both and bought the non quiet version as ingersol is a reputable name brand.",
      "rating": 1.0,
      "verified": true,
      "author": "theNinja",
      "helpful_votes": 0,
      "publication_date": 20200729
    },
    {
      "title": "Excellent - Heavy duty",
      "text": "In the pic you can see we are working on the front suspension of a 1994 Pathfinder. There is no way we could tackle this job without a good air wrench. Most of the nuts and bolts are rusted on from 26 years of use. We use the tried and true, homemade liquid wrench, acetone and automatic transmission fluid mixture on the really bad ones. We particularly like the 4 torque settings. We can start out on the low setting and gradually work our way up to higher settings until the nut or bolts pops free. We wonder why we didn't buy this thing 10 years ago, it works so well.",
      "rating": 5.0,
      "verified": true,
      "author": "david",
      "helpful_votes": 0,
      "publication_date": 20190720
    },
    {
      "title": "Not enough power to do simple job- stay away!",
      "text": "The person I bought this as a gift for had an IR for many many years. Even after the trigger fell out he used it until he decided it needed to be replaced. He was not able to use right away due to an injury so it sat in the box for over 3 months until he was able to. When he finally did, he was extremely disappointed in the lack of power this had. I now have an expensive paperweight that was used one time because my return window was closed. Very disappointed in IR!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Tammy H",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "Mostly does the job",
      "text": "According to the lab equipment I have available to me, it doesn't put out the torque advertised as the maximum, but it does a great job on riding mower wheel lugs and smaller cars, but just couldn't do much better than the Chinese junk out there of the same size to remove the lugs off my one-ton diesel, even when using a 1\" hose and accumulator tank close to the impactor to ensure volume was available.",
      "rating": 4.0,
      "verified": true,
      "author": "SwordmanJr",
      "helpful_votes": 2,
      "publication_date": 20190425
    },
    {
      "title": "Fantastic, ultra quiet, hits like a Rhinoceros.",
      "text": "Professional tech. Incredible smooth power. Incredibly lightweight and unbelievable how quiet it is. Hits like a truck but somehow doesn’t transfer the hammer into you hand. Hits hard but knows how to back itself off so as to not snap the heads off. Only drawback is I have a 9.5” hand (NFL QB avg) and the grip is pretty big in circumference making it rub on my knuckle. Maybe there was a slimmer option and I missed it. Dunno, I’m sure I’ll get used to it and even knowing this I wouldn’t trade it.",
      "rating": 5.0,
      "verified": true,
      "author": "David Z",
      "helpful_votes": 0,
      "publication_date": 20200902
    },
    {
      "title": "Great tool but wish it were lighter in weight.",
      "text": "Solid tool, but I wish it was a little lighter. Yes, the Ti is a tad lighter than their regular line of impact guns, but these are not as light as the Matco units. This is why I can't give it a full 5 star rating. So far, though, my 2235TiMAX has removed everything I have thrown at it. My profession is an automotive mechanic technician, so I put these types of tools through a lot. For the price, you can't go wrong.",
      "rating": 4.0,
      "verified": true,
      "author": "f8ldzz",
      "helpful_votes": 3,
      "publication_date": 20171119
    },
    {
      "title": "A Beast of an Impact Driver",
      "text": "I got this impact driver while redoing all the suspension components on a 10 year old F150. It handles big bolts really well. I’d say the biggest dragon it’s slayed so far were the 20mm bolts with thread locker that hold on the lower control arms. Bolts were about about a foot long with a 36mm head, so massive by DIY mechanic standards. I have this paired with an old 4 gallon compressor and it runs just fine. I did upgrade the air lines though to the 3/8” rubber lines with high flow 1/4 NPT fittings. Very durable tool, no regrets.",
      "rating": 5.0,
      "verified": true,
      "author": "Wayne",
      "helpful_votes": 0,
      "publication_date": 20190621
    },
    {
      "title": "Glad I got the quiet version! 2235QTiMAX",
      "text": "All the great noises of an air impact without the busted eardrums! This thing is QUIET (quiet version) and still packs incredible power. Just make sure to keep it maintained! Great tool. Only thing is the hog ring that holds the sockets at first is tight and extremely hard to get a socket on. Probably can adjust this with pliers or it will get easier overtime.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew S.",
      "helpful_votes": 0,
      "publication_date": 20200317
    },
    {
      "title": "Best Impact on The Market!",
      "text": "This is my second 2235TiMAX. I rebuilt my first one after 7 years of hard service, it was stolen last week which is the only reason why I'm buying this one. I have used many 1/2\" impact guns but this one is the best for durability, light weight, performance and quietness. Ingersoll Rand hit it out of the park with this gun! If anyone is thinking of purchasing an impact gun look no further! This is the one the pro's use!",
      "rating": 5.0,
      "verified": true,
      "author": "Ghost Tech",
      "helpful_votes": 2,
      "publication_date": 20180325
    },
    {
      "title": "This gun smokes",
      "text": "I’ve only used it 3 times and it started to smoke. It barely spins now, has no power. I oil my air tools daily, I’ve never had this problem ever. Had to leave the job site to buy another brand to finish the job I had literally just started.",
      "rating": 1.0,
      "verified": true,
      "author": "Jay Dee",
      "helpful_votes": 2,
      "publication_date": 20191113
    },
    {
      "title": "It’s really the impact made best made",
      "text": "It’s a nice impact. I quit mechanics for about 10 years now just getting back into it bought this 2235 is awesome got the cover to when ordered with it...use a hair drier put it on works great fit like a glove protect it good... they take a beating...but everybody in the shop paid gastronomic prices for snap on or Matco this isn’t cheap but it’s better then the big names IR is a big name but snap on is tools and this smokes there best...",
      "rating": 5.0,
      "verified": true,
      "author": "tony",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "Awesome impact gun",
      "text": "THIS GUN IS AWESOME Ive had snap on and other brand impact guns and never really liked them. Ive had quit a few ingersoll rand guns and liked all of them. They're lighter stronger and last longer dont waist your money on anything else. Highly recommend super fast shipping",
      "rating": 5.0,
      "verified": true,
      "author": "Terry",
      "helpful_votes": 0,
      "publication_date": 20200928
    },
    {
      "title": "Decent gun overall",
      "text": "Overall a thumbs up but only just. Not all that light or compact . Reasonable power for my everyday automotive use. 0 for 2 on the first 2 honda crank bolts i used it on. No shame in that, my 3/4 gun hit them a little before they broke loose. I'm not sure other guns would have pulled them. 1300 pounds breakaway ? Dunno about that, The gun torques quite a bit in my hand when spooiling up, almost to the point of discomfort. It is very quiet, I do like that. So, decent power, and sound level are the positives for me.",
      "rating": 3.0,
      "verified": true,
      "author": "PointlessBoob",
      "helpful_votes": 0,
      "publication_date": 20200523
    },
    {
      "title": "Didn't work out of the box",
      "text": "My husband finally got around to using this gift and it didn't even work right out of the box. No torque just clicks. Wouldn't take the lugs off a small car. Very disappointed....",
      "rating": 1.0,
      "verified": true,
      "author": "C. Boghosian",
      "helpful_votes": 2,
      "publication_date": 20190903
    },
    {
      "title": "It's a bolt destroyer if you are not careful...Lot of power...",
      "text": "This is one of the most versatile guns out there. I had 2 generations of this guns and this one is even better....Light weight and great reverse power to remove bolts...I am a Honda Master Tech and been using this type of gun for over ten years. Used everyday on the day Monday thru Sat and always out perform. This design I find myself turning the power down due to being so powerful dont need full blast strength all the time. Keep it lubes and will not fail you...",
      "rating": 5.0,
      "verified": true,
      "author": "CHERAD",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "Defective construction, Ingersoll should be better than this.",
      "text": "Have barely used this tool, and every time I do the air fitting end pulls right out of the handle. Poorly designed and machined. This is the kind of problem I expect when I buy a cheap tool. This isn't a cheap tool. And their customer support is crap. 40 minutes on hold and no answer. Take your money elsewhere.",
      "rating": 1.0,
      "verified": true,
      "author": "Working Man",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "Probably the best impact in its size for the industry",
      "text": "This thing is a beast! Probably the best impact in its size for the industry. I got to try it a couple weeks ago on a stubborn 36 mm bolt that was cross threaded like no other and it ripped it rite out of there like it was nothing.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 6,
      "publication_date": 20161210
    },
    {
      "title": "com Ingersoll Rand impact durability is great. furthermore 2235 is very powerfull",
      "text": "I used Ingersoll Rand 2125Qtimax 7years ago.(120~130 loosen&fasten everyday.5~6 days a week) I found This gun is very expensive to amazon,com Ingersoll Rand impact durability is great. furthermore 2235 is very powerfull. Until now I used a 3/4inch impact gun,To substitute this gun. If u a looking for impact gun ... There is no choice but to buy Ingersoll Impact. I do not keep other things for one year.",
      "rating": 5.0,
      "verified": true,
      "author": "from japan",
      "helpful_votes": 4,
      "publication_date": 20170626
    },
    {
      "title": "Very powerful!!!",
      "text": "Operates at full potential using Milton v style high flow fittings,so far I haven't ran into a nut or bolt that this would not undo strongest impact out of my assortment hands down",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. & Mrs. Maye",
      "helpful_votes": 2,
      "publication_date": 20181027
    },
    {
      "title": "Zipiddy-Do-Dah",
      "text": "This. Will. Zip. Off. Anything. I think only one time has this thing ever hesitated on lug nuts. All other times, I had never hesitated on stubborn suspension parts. It’s not loud enough to damage your ears either, from what I think any way; I mean you only use it for like 5 seconds at a time. I would buy this every time over a Snap On, Aircat, MAC, it Matco.",
      "rating": 5.0,
      "verified": true,
      "author": "Neal Archer",
      "helpful_votes": 0,
      "publication_date": 20190713
    },
    {
      "title": "Crap",
      "text": "Crapped out after 31 days so I couldn't return it.",
      "rating": 1.0,
      "verified": true,
      "author": "charlie",
      "helpful_votes": 2,
      "publication_date": 20200210
    },
    {
      "title": "quality of product",
      "text": "As a mechanic, I can't afford to be without my tools. This was to replace a tool I've had for years, so I know the quality of the product, and with Amazon I can rely on FAST delivery. My time is money, the delivery of a quality product is of the utmost importance to me.",
      "rating": 5.0,
      "verified": true,
      "author": "Suzee",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "Hang on as it spins bolts off with ease! Definately recommend this for expert use",
      "text": "This gun is a killer! It breaks loose bolts like they were loose. The clip retainer for sockets is hard to get them on and off but I expect that to loosen with use. I use this gun daily and has not let me down yet!",
      "rating": 5.0,
      "verified": true,
      "author": "Flower Lover",
      "helpful_votes": 4,
      "publication_date": 20170226
    },
    {
      "title": "Great impact for the price!",
      "text": "I needed a new impact that packed a punch, this was recommended to me by a friend and I am glad I picked it up, so far it has been able to knock loose everything I have used it on with little effort. I don't use it daily, most of my work is DIY stuff, so I can't speak for shop/daily use. The quality is great & it is lighter than my older all aluminum IR impact.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180705
    },
    {
      "title": "Awesome product",
      "text": "Got this gun to replace my previous impact from IR. I wanted something with more power and thats exactly what I got with double the power. I have yet to find anything this gun cannot unbolt or a nut it cannot get off except one one car that the lug nut was frozen on but the 2235ti max made it come off by breaking it off instead of taking it off. but other than that the gun hits hard enough to break rust loose and its pretty light and very powerful. do not see the need to replace it for something with more power ever.",
      "rating": 5.0,
      "verified": true,
      "author": "Vincent DiGeronimo",
      "helpful_votes": 0,
      "publication_date": 20180921
    },
    {
      "title": "What a waste!",
      "text": "Fell apart the first time I tried it, didn’t even get the chance to actually use it! Returned it 20 minutes after receiving it. Waste of time and money.",
      "rating": 1.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 2,
      "publication_date": 20200313
    },
    {
      "title": "Excellent driver!",
      "text": "This driver rocks! I absolutely love it. The fit, finish and the feel is solid and tight. Top quality. It is well balanced, ergonomic and has tons of power. Good speed control too! I've used it a fair amount, but I am not a professional, so I have not used it daily or anything like that. However I doubt you could find a much better one at any cost. Big thumbs up!",
      "rating": 5.0,
      "verified": true,
      "author": "Dave K",
      "helpful_votes": 0,
      "publication_date": 20180515
    },
    {
      "title": "Never again",
      "text": "Don’t waste your money. Lasted a few months. Ingersoll has always been good to me, quality has obviously gone down hill.",
      "rating": 1.0,
      "verified": true,
      "author": "Tim Andrews",
      "helpful_votes": 4,
      "publication_date": 20190110
    },
    {
      "title": "Super quite and comfortable",
      "text": "This is my everyday impact at work. It removes hundreds of lug nuts a week on varying sizes of vehicles (passenger, light commercial) and doesn’t skip a beat. It is super comfortable to hold and doesn’t rattle you too bad when your digging in to get a tough nut off. Plenty of torque, anvil makes socket changes easy. Just keep it oiled and it will serve you well",
      "rating": 5.0,
      "verified": true,
      "author": "Aaron B.",
      "helpful_votes": 0,
      "publication_date": 20190618
    },
    {
      "title": "Very powerful",
      "text": "Bought this for the significant other who works at a dealership, said they may not last as long as Snap On but they are just as good as far as their power and ability to get the job done well. Will be buying again whenever it's time, worth it!",
      "rating": 5.0,
      "verified": true,
      "author": "Sharon",
      "helpful_votes": 0,
      "publication_date": 20190726
    },
    {
      "title": "So-so",
      "text": "This gun does not break anything close to 1200lbs. Maybe 500lbs. It struggles with removing suspension on heavy duty vehicles. Most bolts are torqued to 500-600lbs.",
      "rating": 2.0,
      "verified": true,
      "author": "Cesar Amazo",
      "helpful_votes": 0,
      "publication_date": 20190315
    },
    {
      "title": "2235TI MAX",
      "text": "The item 2235Ti Max arrived very fast. The item is a little bit lighter than 231C. It is not exactly light. It is excellent that I received the item in good condition.",
      "rating": 5.0,
      "verified": true,
      "author": "LYNDON",
      "helpful_votes": 2,
      "publication_date": 20190711
    },
    {
      "title": "Well-built, solid, effective.",
      "text": "What a beast! This turned a job that normally took five seconds per bolt into one second each. It replaces a cordless that didn't make the grade...or even a year.",
      "rating": 5.0,
      "verified": true,
      "author": "Music Lover",
      "helpful_votes": 0,
      "publication_date": 20200521
    },
    {
      "title": "Reliable",
      "text": "This is the second one we have purchased to replace our 20 plus year old Ingersoll impact drivers. It is very easy and pleasing to use and I am quite confident that these will survive another 20 years. These tools are used daily in a busy car dealership, so we have to be able to rely on them. Based on prior experience, I'd recommend these to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer A.",
      "helpful_votes": 0,
      "publication_date": 20171116
    },
    {
      "title": "Perfect for those tough nuts.",
      "text": "I ordered this impact driver for one job only. To remove a nut on my f250 that had been torqued to 300 ftlbs. I had tried a cheater bar and my 250 lb body to break it free. Nothing. It took me less time to get that nut of with this Tool then it took me to open the box! Awesome quality and works better then expected.",
      "rating": 5.0,
      "verified": true,
      "author": "bigfoot",
      "helpful_votes": 0,
      "publication_date": 20200220
    },
    {
      "title": "Super powerful impact for a great price",
      "text": "This impact will remove anything, including super rusty bolts. Even removes the pen hard bar upper bolts on a Ford super duty with ease I use it on my tractor work all the time no issues",
      "rating": 5.0,
      "verified": true,
      "author": "mtcowboy2000",
      "helpful_votes": 0,
      "publication_date": 20200202
    },
    {
      "title": "Nut buster",
      "text": "I've had the older version for years and recently handed it down to my son who needed an impact. After 20+ years it still out-thumps them all. So, I was happy to see this new version. Super powerful(first run was on an oversized rusted solid nut and bolt-it snapped the nut and part of the bolt right in half!)lightweight, and with the addition of an air swivel, is really maneuverable. Best, hands down and well worth the affordable price.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike ",
      "helpful_votes": 0,
      "publication_date": 20200920
    },
    {
      "title": "Great power",
      "text": "its been 2 months, and already working great, externally powerful. Busted already 3 nuts from the rim when needed.",
      "rating": 5.0,
      "verified": true,
      "author": "Roger",
      "helpful_votes": 7,
      "publication_date": 20160627
    },
    {
      "title": "High quality",
      "text": "As a millwright welder i work on equipment that is in hard to reach areas and on lots of stuck and rusted out bolts this thing makes light work of almost everything unless ur over a 2 inch socket you want have a problem",
      "rating": 5.0,
      "verified": true,
      "author": "Dustin Frost",
      "helpful_votes": 0,
      "publication_date": 20200124
    },
    {
      "title": "165ft/lbs is no sweat for this beast!",
      "text": "It is hard to beat a quality impact wrench. I can't say enough good things about this one. My old one had just enough torque to remove a lawn mower blade. This guy EASILY loosens and removes the lug nuts on my F250 that are torqued down to 165ft/lbs.",
      "rating": 5.0,
      "verified": true,
      "author": "Brute Engine",
      "helpful_votes": 0,
      "publication_date": 20190627
    },
    {
      "title": "Great power.",
      "text": "Not too heavy. Power is very good. Like the rear direction buttons. Have used other Ingersoll Rand products and have been happy with all of them. Gun looks and works great.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris ",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "Powerful even with 15 gallon compressor. Took out anode ...",
      "text": "Powerful even with 15 gallon compressor. Took out anode rod that I can't get out with a breaker bar. I tried other impact wrench and won't budge. This did it! Im impress with the power and its lighter than the ones I've tried. Returned those to the store and kept this one.",
      "rating": 5.0,
      "verified": true,
      "author": "Tirso Cruise",
      "helpful_votes": 0,
      "publication_date": 20171114
    },
    {
      "title": "best impact wrench i have ever seen",
      "text": "i have worked as mechanic for nearly 50 years, this is the most powerful impact i have ever used, by far woirth every penny",
      "rating": 5.0,
      "verified": true,
      "author": "robert erdlen",
      "helpful_votes": 0,
      "publication_date": 20201019
    },
    {
      "title": "Powerful",
      "text": "I have yet to see this impact fail to remove anything I've thrown at it. It's extremely powerful and has the durability you'd expect from Ingersoll Rand. It's also available at a price below many of it's competitors.",
      "rating": 5.0,
      "verified": true,
      "author": "Parker Rippinger",
      "helpful_votes": 0,
      "publication_date": 20190704
    },
    {
      "title": "Works great",
      "text": "I was recommended to get this from 2 of my mechanic friends and it’s worked very well so far. It’s heavier than most but I like that feeling of sturdiness. Great torque",
      "rating": 5.0,
      "verified": true,
      "author": "Brandon A",
      "helpful_votes": 0,
      "publication_date": 20200207
    },
    {
      "title": "this impact wrench is a great addition to any shop",
      "text": "I had my last Ingersoll Rand impact for 20 years, I am expecting to get that out of this one, if not I'll be back to amend my rating to 4 stars. Extremely powerful and light, this impact wrench is a great addition to any shop. It is a little louder than I had anticipated but not obnoxious and there is a quiet version of it. See you in 20 years.",
      "rating": 5.0,
      "verified": true,
      "author": "Pat Shay",
      "helpful_votes": 0,
      "publication_date": 20180406
    },
    {
      "title": "Powerful and fairly quiet",
      "text": "It has plenty of power for taking off most automotive bolts/nuts. The quiet model is quieter than the regular version, but not very much. It mainly just reduces the higher pitch noise.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "Good price and dependable.",
      "text": "Working for a caterpillar dealership repairing heavy equipment, I need really good tools. Ingersoll rand is one of the best brands in pneumatic tools to own. This purchase makes my third IR air wrench. They last a long time and are very strong. The composite design makes them light and buying them from amazon makes them affordable. This 2133timax has lived up to its normal dependability.",
      "rating": 5.0,
      "verified": true,
      "author": "jdb",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "Best 1/2\" impact I've owned yet.",
      "text": "I've always liked the power and feel of an IR impact and this one did not disappoint, it is a little heavier than my old 2135 ti-max but it hits far harder. I gladly traded the extra few ounces for the increase in power!",
      "rating": 5.0,
      "verified": true,
      "author": "Adam",
      "helpful_votes": 0,
      "publication_date": 20190621
    },
    {
      "title": "Professional user quality",
      "text": "Very nice impact wrench. Ingersoll-rand has a reputation for quality and this one seems to meet the standard. Power beats any other impact gun of it's size I've used. Be careful, it will break bolts right off before you can slow it down. Professional user quality.",
      "rating": 5.0,
      "verified": true,
      "author": "W. Parks",
      "helpful_votes": 0,
      "publication_date": 20171027
    },
    {
      "title": "Best impact on the market",
      "text": "It's a little bit heavier then my last IR ti impact gun was a little disappointing. But over all this thing packs a punch still one of the lightest on the market I want power over sound but still its mildy loud comparison with other gun like mac/ snap-on ectwith way more power and more reliable.",
      "rating": 5.0,
      "verified": true,
      "author": "Ike",
      "helpful_votes": 0,
      "publication_date": 20190330
    },
    {
      "title": "Lots of power but...",
      "text": "powerful tool but so heavy and ridiculously noisy.. does a tool like this really need to be this loud?.. had to return it",
      "rating": 2.0,
      "verified": true,
      "author": "robert semet",
      "helpful_votes": 0,
      "publication_date": 20191022
    },
    {
      "title": "Lightweight and lots of torque",
      "text": "My husband is a mechanic and he requested this impact gun specifically because he's had great success with it in the past. It's so much lighter than many of the other guns out there, which makes a difference when you're using it throughout a 12-hour shift. It is reliable and the torque gets the job done.",
      "rating": 5.0,
      "verified": true,
      "author": "JeepChick",
      "helpful_votes": 0,
      "publication_date": 20180514
    },
    {
      "title": "lighter and quieter than MAC or Snap-On",
      "text": "Purchased it for one of the tech's in my shop. He loves it. Compared to the snap on and mac guns we have its actually lighter and quieter - and does the EXACT same thing for a fraction of the price. Next tech that needs one we will buy another.",
      "rating": 5.0,
      "verified": true,
      "author": "Mrbona",
      "helpful_votes": 0,
      "publication_date": 20191125
    },
    {
      "title": "MUCH quieter that \"regular\" air wrenches, though still not exactly what I'd call \"quiet.\"",
      "text": "Great tool! MUCH quieter that \"regular\" air wrenches, though still not exactly what I'd call \"quiet.\" Light and easy to use, with a nice \"feel.\" I would recommend this tool to anyone who uses an air wrench frequently, as, over time, your ears will thank you.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric",
      "helpful_votes": 0,
      "publication_date": 20180513
    },
    {
      "title": "Most Powerful and Assembled in the USA",
      "text": "Best Impact I've ever owned. Most powerful, best control, best sounding, lightest, and best looking. I was surprised to also find that its assembled in the USA from foreign and domestic components. Its got to be the only one on the market that has that going for it.",
      "rating": 5.0,
      "verified": true,
      "author": "John M.",
      "helpful_votes": 0,
      "publication_date": 20191031
    },
    {
      "title": "GREAT PRICE",
      "text": "This is a great impact, I've Been a tech for 30 years and it's the most powerful impact I've owned. however the protective boot that came with it is for the 2135TiMAXnot the 2235TiMAX so I had to reorder the correct boot.;",
      "rating": 5.0,
      "verified": true,
      "author": "Torqtec",
      "helpful_votes": 2,
      "publication_date": 20170601
    },
    {
      "title": "Powerful and quite",
      "text": "Strong and quite. I’m been using the old version for over 10 years finally gave up so I got this.",
      "rating": 5.0,
      "verified": true,
      "author": "Johnny",
      "helpful_votes": 0,
      "publication_date": 20200901
    },
    {
      "title": "Powerful tool but very quiet",
      "text": "So far I have only tested this impact for one day but it has worked flawlessly. This impact is very strong, the strength is the same if not greater than my co-workers Snap-On air impact. The muffled version is very worthwhile as the unmuffled version is extremely loud. TRUST ME SAVING YOUR EARS IS WORTH WAY MORE THAN THE $10 EXTRA YOU PAY FOR THE MUFFLED VERSION. The only downside to this tool is the weight and thats not a very big deal.",
      "rating": 5.0,
      "verified": true,
      "author": "samboni",
      "helpful_votes": 0,
      "publication_date": 20200128
    },
    {
      "title": "You don't always have to buy from tool trucks.",
      "text": "Freakin' awesome! If your in the auto industry, buying from trucks is a joke. This is almost half the price of the exact same product on a truck. Tools are my life blood. Any chance to make a better and less costly investment in tools is of utmost importance. This is worth the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Dean Corso",
      "helpful_votes": 0,
      "publication_date": 20180509
    },
    {
      "title": "I think they had a bad batch.",
      "text": "First one broke withing a couple months. The shank just broke off. The replacement has premature wear on the shank. Having used others of this brand, I think they had a bad batch.",
      "rating": 2.0,
      "verified": true,
      "author": "Mark Stange",
      "helpful_votes": 0,
      "publication_date": 20180709
    },
    {
      "title": "this is the king of 1/2 impact wrenches",
      "text": "I use this when more torque is needed, it's too loud for removing lug nuts all day long, I use a Snap-On 6100 for that because of it's quiet/low power setting. When I need more power, this one never fails to get the job done. great tool.",
      "rating": 5.0,
      "verified": true,
      "author": "Born West USA",
      "helpful_votes": 0,
      "publication_date": 20180919
    },
    {
      "title": "Heavy buy powerful best impact wrench ever",
      "text": "Not a light weight, but the best impact wrench I ever owned. This Ingersoll Rand 1/2 inch impact is better than anything AirCat Matco or Snap-on sells. Heck of a deal.",
      "rating": 5.0,
      "verified": true,
      "author": "Jack",
      "helpful_votes": 0,
      "publication_date": 20191122
    },
    {
      "title": "Not powerful for the described jobs",
      "text": "Not powerful at all to use for my trucks, returned",
      "rating": 1.0,
      "verified": true,
      "author": "T.A.",
      "helpful_votes": 0,
      "publication_date": 20190903
    },
    {
      "title": "Super quiet",
      "text": "Haven’t used it yet but love the size, weight and feel of this gun. The noise level is unreal (quiet that is)",
      "rating": 5.0,
      "verified": true,
      "author": "Spenland",
      "helpful_votes": 0,
      "publication_date": 20200509
    },
    {
      "title": "Ideal for the DIY guy that does a lot",
      "text": "My son and I work in my shop a lot. We work on everything from 1 ton trucks to lawn mowers. This makes my 3rd air impact wrench and I can tell immediately it is well built and will be perfect to withstand our medium/heavy use. Very well made, outstanding torque, light weight.",
      "rating": 5.0,
      "verified": true,
      "author": "Ken",
      "helpful_votes": 0,
      "publication_date": 20190528
    },
    {
      "title": "Best impact I’ve ever owned.",
      "text": "I’ve had a Snapon MG725 ($575) impact for about 6 years with nothing but issues from day one. Finally decided I wasn’t about to pay for yet another rebuild when I saw the price of this bad boy. Man oh man am I impressed with this gun. It is VERY powerful, light and fits nice in the hand.",
      "rating": 5.0,
      "verified": true,
      "author": "viperjuice",
      "helpful_votes": 0,
      "publication_date": 20180315
    },
    {
      "title": "This gun fights above it's weight class",
      "text": "Holy torque! This bad boy will break a lot of bolts if you're not careful. Great gun, weight of a 1/2\" gun, torque of a 3/4\" gun. Great product from Ingersol, excellent buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Nathan K.",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "Quiet, light and reliable",
      "text": "Just like my old one. Quiet, light and reliable. Hopefully buttons don’t break out of the back like my old one did. Buttons didn’t break for seven years though. That’s why I bought another. Good price too.",
      "rating": 5.0,
      "verified": true,
      "author": "SHIZO",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "Why didn't I get it sooner?",
      "text": "Right from the box - 15 degree in garage - first hit barely moved cv axle bolt on 03 passat - heated up bolt to 70 degrees (heat gun and infra-red thermometer) - spun the bolt right off - -No problem - no hesitation - Trigger is very good - easy and calibrated - can inch bolts around 1/4 turn-- light weight , feels good in the hands well balanced - not that loud - very satisfied --only thing i didn't realize was that the operators and parts manuals are both on line - link is on card in box -With regular maintenance should last 15 years like the IR pneumatic it has replaced ----",
      "rating": 5.0,
      "verified": true,
      "author": "drawing",
      "helpful_votes": 0,
      "publication_date": 20180102
    },
    {
      "title": "Awesome impact Driver",
      "text": "I have always wanted one of these because I knew how good they were and now I have one and with care it will last me the rest of my life using it around my home shop. Plenty of nut busting power forward and reverse.",
      "rating": 5.0,
      "verified": true,
      "author": "BigE",
      "helpful_votes": 0,
      "publication_date": 20181110
    },
    {
      "title": "Amazing Brand",
      "text": "Bought this gun along with a cover and an Ingersoll Rand air hammer. I run them with a Harbor Freight 3/8in 50ft black rubber hose. They both work like a charm. If you're looking to buy an impact that's strong, comfortable and fairly quiet, I would look no further and purchase this",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20170720
    },
    {
      "title": "Great Snap-On alternative. Best bamg for your buck for sure.",
      "text": "Love this gun, i use it everyday at the shop and it hasnt failed me once. Its fast and extremely powerful. Id have to say its quite loud and will piss of your neighbors at work.",
      "rating": 4.0,
      "verified": true,
      "author": "James J",
      "helpful_votes": 0,
      "publication_date": 20190618
    },
    {
      "title": "Long lasting performance.",
      "text": "Like the reliability and power, plenty of co workers have had this for years. Dont like how loud it is. Would of got the quiet version if it wasn't $50 more",
      "rating": 4.0,
      "verified": true,
      "author": "David Bent",
      "helpful_votes": 0,
      "publication_date": 20190630
    },
    {
      "title": "Works great",
      "text": "The impact wrench works great, even though I had to take it a part to put the clip back in that wasn't fully installed from the factory.",
      "rating": 5.0,
      "verified": true,
      "author": "Terry Rummler II",
      "helpful_votes": 0,
      "publication_date": 20200128
    },
    {
      "title": "Excellent!",
      "text": "This is the best 1/2 inch impact in think on the market. Lots of torque and reliable!!",
      "rating": 5.0,
      "verified": true,
      "author": "Sergio romero",
      "helpful_votes": 0,
      "publication_date": 20200219
    },
    {
      "title": "Beats my $600 matco impact",
      "text": "This gun is great. I had my matco gun for a while when I got this it was a little heavy compared to the matco gun but felt great in my hand. I wasn’t sure if I should of gotten the quiet model but I did and it takes getting used to. Great power and I love the color of the handle it doesn’t show dirt or grease from my hands.",
      "rating": 5.0,
      "verified": true,
      "author": "Rita Trimble",
      "helpful_votes": 0,
      "publication_date": 20190922
    },
    {
      "title": "Powerful and lightweight",
      "text": "Been a mechanic for very long time this is powerful and light weight works very well for my needs as a professional mechanic",
      "rating": 5.0,
      "verified": true,
      "author": "JIM H",
      "helpful_votes": 0,
      "publication_date": 20190928
    },
    {
      "title": "Was a Great Gift",
      "text": "Bought it for husband. He loves it, says it is better than either of the others that he has had.",
      "rating": 5.0,
      "verified": true,
      "author": "Donna S",
      "helpful_votes": 0,
      "publication_date": 20191224
    },
    {
      "title": "Overall the best!!!!",
      "text": "This gun is the better and less expensive than the trucks. This is the way to go, make sure to oil it daily and grease it every 3 months",
      "rating": 5.0,
      "verified": true,
      "author": "angello",
      "helpful_votes": 0,
      "publication_date": 20191124
    },
    {
      "title": "Industrial must",
      "text": "When you go around the shop and see the old tools the ole dogs have in their boxes, the IR impact is one I see often. I’ve heard stories or techs dragging it behind the work truck and it keeps on ticking. Well, I gave in and got one. Way things are going I’ll have a good impact for some time. Good torque, sturdy, and can pull lugs off of a wheel loader. Nuff said.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric",
      "helpful_votes": 0,
      "publication_date": 20200216
    },
    {
      "title": "Big-time 1/2\" impact gun-just what I was looking for, best price - Black Friday special",
      "text": "Big-time power. Haven't found anything this thing can't handle plus fast shipping. I did have to pick up at Post office, didn't leave on porch, that's ok. Light weight- purchased on Black Friday-super low price!",
      "rating": 5.0,
      "verified": true,
      "author": "John L",
      "helpful_votes": 0,
      "publication_date": 20180615
    },
    {
      "title": "If you’re looking for a top of the line impact, no need to look any further.",
      "text": "Great power. No need to buy Snap On or Matco for double the cost. If you’re worried about it, for just a few dollars more, you can purchase an extended warranty for it.",
      "rating": 5.0,
      "verified": true,
      "author": "Kari B.",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "Gift for husband",
      "text": "My husband seems to like it. States easier to use cause it is lightweight",
      "rating": 5.0,
      "verified": true,
      "author": "Dawn",
      "helpful_votes": 0,
      "publication_date": 20200223
    },
    {
      "title": "Buy it NOW!",
      "text": "Strong gun! Keep it lubed and your air dry, and this gun will work with you! Let those ballin professionals buy their \"buy it once buy it for life\" tools and you save your hard earned cash and buy this quality gun!",
      "rating": 5.0,
      "verified": true,
      "author": "Uncle Randy",
      "helpful_votes": 2,
      "publication_date": 20161125
    },
    {
      "title": "Not quiet enough",
      "text": "Bought quiet version, but it wasn't quiet enough. But has good power",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201004
    },
    {
      "title": "Very good product for the money",
      "text": "I like the product. Use it for rotating tires in my garage",
      "rating": 5.0,
      "verified": true,
      "author": "ROBERT GARRITY",
      "helpful_votes": 0,
      "publication_date": 20200801
    },
    {
      "title": "Great tool from IR",
      "text": "Great tool like always from IR just very loud only thing I don’t like about it",
      "rating": 5.0,
      "verified": true,
      "author": "Monica",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "GREAT PRODUCT !!!",
      "text": "My husband works for a big company and he needs heavy duty tools. He just started using it and hes tickled with it. Many of the guys in his shop use the same tool. They love theirs also!",
      "rating": 5.0,
      "verified": true,
      "author": "Elowe",
      "helpful_votes": 0,
      "publication_date": 20170912
    },
    {
      "title": "First time using it after having it after almost three ...",
      "text": "First time using it after having it after almost three months and the trigger broke. Need a way to get a hold of the seller was hoping for a replacement because it was not yet even 90 days before having the issue! Very powerful though...",
      "rating": 2.0,
      "verified": true,
      "author": "mikenikestudios",
      "helpful_votes": 2,
      "publication_date": 20170803
    },
    {
      "title": "Beast",
      "text": "Only used it once so far but it seems a lot stronger than my old craftsman. Had no hesitation at all busting loose some lawn mower blades",
      "rating": 5.0,
      "verified": true,
      "author": "Coxter",
      "helpful_votes": 0,
      "publication_date": 20190407
    },
    {
      "title": "This is a great impact gun I have owned a previous model for ...",
      "text": "This is a great impact gun I have owned a previous model for 5 years and it worked absolutely great decided to buy this one for more power and breaking tight bolts loose",
      "rating": 5.0,
      "verified": true,
      "author": "Bonnie R White",
      "helpful_votes": 0,
      "publication_date": 20171120
    },
    {
      "title": "Good quality and good price",
      "text": "Beats the snap on mac and matco brand for the price and the power highly recommended bang for the buck.",
      "rating": 5.0,
      "verified": true,
      "author": "SBG",
      "helpful_votes": 0,
      "publication_date": 20200217
    },
    {
      "title": "This is super handy when you work on the suspension job",
      "text": "This is super handy when you work on the suspension job. Don't need to worry about losing torque when you need an extension to reach the bolt. Ingersoll Rand makes high-quality air tool for a reasonable price. Plus if it breaks, many places can rebuild it with low cost. Doesn't like snap-on. If it's out of warranty, rebuild is a pain.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason Feng",
      "helpful_votes": 0,
      "publication_date": 20180802
    },
    {
      "title": "Very good impact",
      "text": "This unit is very lightweight, easy to handle and has a good feel to it. So far, there isnt anything it couldnt break loose or break off lol. Probable the only complaint, if there is any, is the way the forward/reverse buttons are set up. I prefer the button on the back and above the trigger to change directions, but that is just preference. It is pretty quiet, but powerful. I recommend this product!",
      "rating": 5.0,
      "verified": true,
      "author": "Tim Pringle",
      "helpful_votes": 0,
      "publication_date": 20190903
    },
    {
      "title": "This is so much better than the Air Cat I regret buying",
      "text": "This is so much better than the Air Cat I regret buying. It does not damage sockets, and the the trigger and reverse controls are much smoother. This is quality I can feel plus it is much more of a brute. Worth more than I paid to me.",
      "rating": 5.0,
      "verified": true,
      "author": "The D's",
      "helpful_votes": 2,
      "publication_date": 20160521
    },
    {
      "title": "Great gun for the money",
      "text": "For the money, this is a great gun for someone in the automotive industry. Not the heaviest nor the lightest. I like it.",
      "rating": 5.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20190817
    }
  ],
  "product_meta": {
    "title": "Ingersoll Rand 2235TiMAX Drive Air Impact Wrench, 1/2 Inch",
    "description": "Style:2235TiMAX Standard Tool| Pattern Name:WrenchFeaturing the best power-to-weight ratio of any impact wrench on the market, the Ingersoll Rand 2235TiMAX 1/2-Inch Drive Air Impact Wrench is built to tackle the toughest bolts. This powerful, durable impact wrench packs up to 1,350 foot-pounds of nut-busting torque into a compact and lightweight design. Weighing only 4.6 pounds, it allows you to work for longer stretches of time without fatigue. The four-position power regulator and one-handed forward/reverse push button give you the control and versatility needed to tackle a variety of automotive and industrial jobs. And thanks to its titanium hammer case and rugged composite housing, this impact wrench is tough enough to endure the harshest working environments--from garages to demanding industrial jobsites.",
    "rating": 4.8,
    "feature_bullets": [
      "Plastic / Metal",
      "Imported",
      "930 feet-pounds of maximum reverse torque",
      "Nut-busting torque of 1350 feet-pounds. Air Consumption @ Load (cfm) - 24. Air Consumption @ Load (L/min) - 680. Average Air Consumption (cfm) - 6",
      "Finely tuned twin-hammer impact mechanism",
      "Born from the legendary durability of the Ingersoll Rand 2135 Series.Driver type:Square, Hog-Ring",
      "Built with a titanium hammer case, steel-wear plate and composite housing that protect the tool from the harshest environments"
    ],
    "specifications": {
      "Manufacturer": "Ingersoll Rand",
      "Part Number": "2235TIMAX",
      "Item Weight": "4.62 pounds",
      "Product Dimensions": "7.6 x 2.91 x 7.48 inches",
      "Item model number": "2235TIMAX",
      "Is Discontinued By Manufacturer": "No",
      "Size": "42371",
      "Style": "2235TiMAX Standard Tool",
      "Material": "Metal",
      "Pattern": "Wrench",
      "Power Source": "Air-Powered",
      "Item Package Quantity": "1",
      "Head Style": "Fixed Square",
      "Measurement System": "Inch",
      "Included Components": "Bare-Tool",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "Battery Cell Type": "Lithium Ion",
      "ASIN": "B00LV9Y1FE",
      "Customer Reviews": "4.8 out of 5 stars1,280 ratings4.8 out of 5 stars",
      "Best Sellers Rank": "#11,542 in Tools & Home Improvement",
      "Domestic Shipping": "Item can be shipped within U.S.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S. Learn More",
      "Date First Available": "July 16, 2014"
    },
    "categories": [
      "Power & Hand Tools",
      "Tools & Home Improvement",
      "Power Tools",
      "Impact Wrenches"
    ],
    "price": 277.18
  }
}