{
  "website_summaries": [
    {
      "verdict": "A set that contains 17 plastic cupping cups and a pump gun.",
      "pros": [
        "Popular product provides strong suction",
        "Most buyers found them to be effective and durable",
        "The cups are clear for better handling and visibility",
        "Easy to clean",
        "Comes with guarantee of 100% satisfaction or money back"
      ],
      "cons": [
        "Cannot be used with oil",
        "Several buyers complained of the cups cracking too easily",
        "Pump is difficult to remove from the cups"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "1) there is no extension tube for self application 2) ...",
      "text": "1) there is no extension tube for self application 2) they are \"disposable cups\" 3] description says they are not for use with oil or sliding",
      "rating": 1.0,
      "verified": true,
      "author": "Marni",
      "helpful_votes": 35,
      "publication_date": 20170811
    },
    {
      "title": "Good quality.  Easy to use.",
      "text": "Love this set. I dropped one star because the hose connector cracked after the third use. I do not think that I was rough or aggressive with it to cause it to crack. The cups can be used even without the extension hose. I advise getting a good book on cupping. Understanding the meridians of the body will help get the most beneficial use of the cupping system.",
      "rating": 4.0,
      "verified": true,
      "author": "Cory",
      "helpful_votes": 48,
      "publication_date": 20160727
    },
    {
      "title": "Not suitable for professional use",
      "text": "Using these even in a part-time capacity on clients in my massage practice was not possible. Almost all of the cups have broken with most of them breaking within @ 2 weeks of initial use. Good purchase if you just want to practice or use on your self from time to time...not suitable for professional use.",
      "rating": 1.0,
      "verified": true,
      "author": "shannon ditzel",
      "helpful_votes": 23,
      "publication_date": 20170722
    },
    {
      "title": "Cracked.",
      "text": "After about 3 uses, the cups started cracking down the sides. I did not use more than 2 pumps per cup, so there should have been no reason for the cracking. Though they did hold suction --even while being cracked-- eventually, they got too cracked to continue use. Also, it doesn't come with a hose to attach to yourself.",
      "rating": 1.0,
      "verified": true,
      "author": "Nevada W",
      "helpful_votes": 15,
      "publication_date": 20180130
    },
    {
      "title": "Works, just not for us",
      "text": "I used these on my husband's back and shoulders to try to alleviate knots he gets. In order to ensure adequate suction, we had to shave any hair off the area. He indicated it felt somewhat relieving while the cups were on, but the next day or two just felt sore, and the knots never really went away. We tried this for several weeks before deciding it wasn't worth the effort. We had high hopes. I don't think it has to do with a faulty product, though. The product did exactly what it advertised. The therapy just wasn't what my husband needed to calm the tension in his back and shoulders.",
      "rating": 2.0,
      "verified": true,
      "author": "MLM",
      "helpful_votes": 5,
      "publication_date": 20190530
    },
    {
      "title": "It’s compeltely useless.",
      "text": "I would give zero stars but I can’t. I got my kit today and the case is falling apart. It’s compeltely useless.",
      "rating": 1.0,
      "verified": true,
      "author": "katie",
      "helpful_votes": 14,
      "publication_date": 20180316
    },
    {
      "title": "Fell in love with it and bought it for myself",
      "text": "I was shown this product by my physical therapist. Fell in love with it and bought it for myself. I used it all the time. I use it to help break down scar tissue and increase circulation in sore muscles. It's wonderful.",
      "rating": 5.0,
      "verified": true,
      "author": "Sherry B.",
      "helpful_votes": 18,
      "publication_date": 20161010
    },
    {
      "title": "GREAT cupping set!",
      "text": "I'm a retired massage therapist and this cupping set is a great starter set. Well made, we use it a few times a week and the seals are working great and it's helping relieve back and shoulder pain. All the instructions are in Asian languages so best to watch youtube videos to understand how to work the cups, how long to leave on and where to place them.",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan",
      "helpful_votes": 5,
      "publication_date": 20190102
    },
    {
      "title": "stress and toxins, be gone!",
      "text": "super easy to use. its best to use with your favorite massage oil. a few pumps to get a good suction, leave it on for a bit and release... away goes your tension and toxins! i LOVE it. i've even bought this item a few times to gift and everyone has thanked me since it's helped them as it's helped me.",
      "rating": 5.0,
      "verified": true,
      "author": "ErNeLL",
      "helpful_votes": 2,
      "publication_date": 20200310
    },
    {
      "title": "Step up from the other sets with the green pump",
      "text": "Pros- These cups are a bit more durable they have a much stronger suction It has a carrying case if you travel with it like I do since I need my fiancee to help me Cons- These don't have the plastic tube so you can't do your own back which really sucks They don't have a large size cup..biggest one is small/medium sized",
      "rating": 4.0,
      "verified": true,
      "author": "RED",
      "helpful_votes": 0,
      "publication_date": 20200327
    },
    {
      "title": "Good Quality",
      "text": "My physical therapist started doing cupping on me and it was really helping. I took a picture of the brand and box they use at their facility. I could not find the exact one but this is the same brand and a very similar set that my physical therapist used. It works just like the one she has so I am assuming this is a good quality. I have never been to Korea and used and authentic set but I am very happy with this one!",
      "rating": 5.0,
      "verified": true,
      "author": "Alison C.",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "Definitely a great home health aide to combat pain",
      "text": "My Dr. recommended this particular set so that I could have constant access to cupping and showed my husband how to use the set. I’ve had 3 major spine surgeries and one shoulder surgery, so pain is a daily factor in my life. This set is very nicely prepared in a sturdy case and I’m definitely pleased to be able to have this extra help without having to have a Dr’s appointment to obtain some pain relief. If the cups start to not stick after use, simply clean them with rubbing alcohol and they will resume making suction with your skin.",
      "rating": 5.0,
      "verified": true,
      "author": "Book Friend",
      "helpful_votes": 0,
      "publication_date": 20190716
    },
    {
      "title": "Great set of cupping",
      "text": "This cupping set is my 4th set of cupping. The cups have great suction, tight on the skin and stay on longer than other sets. I have. I have tried them on my upper arm (in the pictures), and after 5 minutes, the cup was taken out, and I didn’t have much of the mark left. Also, the extension hose has a nice angle that really helps while I was trying to pump with the “gun”.",
      "rating": 5.0,
      "verified": true,
      "author": "No-Fake-Reviews",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "Easy to use",
      "text": "This is my second, first one had to give it to Dad. It works as advertised. Comes in handy esp when want to avoid taking NSAIDs on regular basis",
      "rating": 5.0,
      "verified": true,
      "author": "BK",
      "helpful_votes": 9,
      "publication_date": 20170320
    },
    {
      "title": "it is OK, not my favorite",
      "text": "This price is reasonable for whole set, the cupping set is made with the plastic, but I don't get the same treatment as the therapist does with the glass cupping, but it still works for my pain a little bit. The length of extension tube is still short if I want to do on the back and the shoulder, and I don't know why the cups fall off by themselves sometimes, I need to ask my son help me again.",
      "rating": 3.0,
      "verified": true,
      "author": "Captain 007",
      "helpful_votes": 0,
      "publication_date": 20200930
    },
    {
      "title": "Good kit",
      "text": "Awesome kit. Quality product; the extension hose is a nice addition. I am able to reach most of my back with it. The pressure point prongs can be painful so don't pump the cup too much.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 9,
      "publication_date": 20161210
    },
    {
      "title": "Good for AT students",
      "text": "I got this cupping set to use through school and clinical. I have been impressed with its use and it’s very easy. The gold flake on the outside has worn off as I have disinfected and cleaned to cups. I’ve had 1 cup that stopped holding suction but everything else appears to be working well. For the price this product seems like a good buy.",
      "rating": 4.0,
      "verified": true,
      "author": "Brittany Carlson",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "Professional use",
      "text": "I use this both in my massage therapy practice and at home. I don’t prefer the trigger point attachment points on myself or on my clients. Cupping has helped me be able to get more range of motion in my neck after a long day",
      "rating": 5.0,
      "verified": true,
      "author": "Irwing",
      "helpful_votes": 2,
      "publication_date": 20190714
    },
    {
      "title": "LOVE THEM!",
      "text": "I absolutely LOVE my cups! I actually bought a second set. As a license massage therapist, these are a wonderful addition to my services. I even use them on myself when I need to. You must know what you are doing with these cups or you can injure yourself or someone else. So please do your research before purchasing. They are also easy to clean and very easy to store away!",
      "rating": 5.0,
      "verified": true,
      "author": "April S.",
      "helpful_votes": 3,
      "publication_date": 20171217
    },
    {
      "title": "Prduct as described",
      "text": "I purchased this to see if would help out with my knots I get in my back as well as using on sore muscles. I feel it does the job it describes. Hard to use on yourself if trying to do the back area. I am a thinner person so some of the cups do not suction as well. For the price it is a nice product. Not sure if it has helped or not.",
      "rating": 4.0,
      "verified": true,
      "author": "Djag12",
      "helpful_votes": 4,
      "publication_date": 20170103
    },
    {
      "title": "Easy to use and helps release tension",
      "text": "This is the cheaper way to get treatment for sore back pain. The suction is really good. During COVID there were no other options to release tension and knots on my back and shoulders so I decided to try this. Very sore after use but after a couple of days those areas felt very light.",
      "rating": 5.0,
      "verified": true,
      "author": "LuCy",
      "helpful_votes": 0,
      "publication_date": 20201009
    },
    {
      "title": "Very Theraputic",
      "text": "The product was just as described and works excellent. Plus for this product is the minimal pumps needed for the cups to securely seal onto the skin. The carry case makes containing the cups and pump easy and very portable. Took it on vacation and enjoyed using it after swimming in the pool or relaxing in the hot tub.",
      "rating": 5.0,
      "verified": true,
      "author": "NobodysCandy",
      "helpful_votes": 3,
      "publication_date": 20170531
    },
    {
      "title": "Variety of Cup Sizes, Easy to Use.",
      "text": "I bought this as a gift for my husband who is a Massage Therapist. He absolutely loves it and has used it successfully on several clients already. He likes the fact that it has a wide variety of cup sizes and the handle is easy to attach. He also likes the cool chrome look and the carrying case! He took it to the studio where he works and the owner saw it and ordered a kit for each of the massage rooms.",
      "rating": 5.0,
      "verified": true,
      "author": "Pinx",
      "helpful_votes": 3,
      "publication_date": 20160918
    },
    {
      "title": "My favorite equipment for my shoulder!!",
      "text": "I wanted to buy this item a long time ago, but I have no idea where was sold it. Finally, I found it in the amazon!!! Not only this is amazon prime but also it is very reasonable price. I'll use it for my shoulder and back health, and I know how to use it ^^ Thank you for providing good product very much.",
      "rating": 5.0,
      "verified": true,
      "author": "Esther",
      "helpful_votes": 4,
      "publication_date": 20161121
    },
    {
      "title": "Good value and brings blood to heal injured areas",
      "text": "It works well enough. you need someone to demonstrate it for you or watch a YouTube video as the directions are in Chinese and I don’t know what some of the parts are for.",
      "rating": 5.0,
      "verified": true,
      "author": "Meme B",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "Great Cupping set!  Very Professional Set",
      "text": "This is my third set, my first set was great, last set I went with a different brand and very poor quality. This is nothing like that, I will probably not ever have to by another set again. This case that houses the cups is solid and holds cups in place and keeps them easily organized. It looks professional and makes me feel more confident when I have to pull these out and use them on clients. I think it makes the clients feel a little more at ease if they are unfamiliar with cupping. Such a great quality set.",
      "rating": 5.0,
      "verified": true,
      "author": "Bryan Mortensen ",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "Worth the investment",
      "text": "Due to COVID-19 I have not been able to visit my chiropractor and massage therapist. Decided to invest on my health and self care and I love it. Great purchased",
      "rating": 5.0,
      "verified": true,
      "author": "monina_found_a_deal",
      "helpful_votes": 0,
      "publication_date": 20200630
    },
    {
      "title": "Great product",
      "text": "Recommend by my ATC and he was spot on! Great kit and easy to get certified.",
      "rating": 5.0,
      "verified": true,
      "author": "Cooper",
      "helpful_votes": 0,
      "publication_date": 20200617
    },
    {
      "title": "easy to use",
      "text": "I was shown this product by my physical therapist. Fell in love with it and bought it for myself. I used it all the time. It's wonderful.",
      "rating": 4.0,
      "verified": true,
      "author": "DiDi",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "Great suction!",
      "text": "Love it!!! Exactly what I want! But please send me the tubing for the hard to reach places. Mine was sent without it. Will change to five stars after it is sent. Thank you.",
      "rating": 3.0,
      "verified": true,
      "author": "Ryan ",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "Just perfect for me.",
      "text": "This is similar if not the same one I had in physical therapy. I am pleased that I can continue my treatment at home using this. Very pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "Rockford57",
      "helpful_votes": 0,
      "publication_date": 20200710
    },
    {
      "title": "Highly recommend this set",
      "text": "I love my cupping set. It works perfectly! I mainly use it for knee and shoulder pain and it helps right away everytime! I highly recommend this set.",
      "rating": 5.0,
      "verified": true,
      "author": "Ellie",
      "helpful_votes": 0,
      "publication_date": 20200410
    },
    {
      "title": "Works Great!",
      "text": "We've bought these for ourselves, and now for friends as gifts. They're fun to play with, but ultimately do the job we bought it for. Great price for 17 cups, a sturdy suction gun, and a nice case. Would highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie W",
      "helpful_votes": 0,
      "publication_date": 20190614
    },
    {
      "title": "Good cups",
      "text": "Bought it for my massage business, recommended by a colleague. The suction is stronger than the silicone cups. Easy to use, easier to clean. Highly recommend",
      "rating": 5.0,
      "verified": true,
      "author": "MaryAnne",
      "helpful_votes": 2,
      "publication_date": 20191204
    },
    {
      "title": "I did not receive an extension tool",
      "text": "I did not receive the extension tube making self cupping on the back impossible. I would certainly change my review if I could receive the extender.",
      "rating": 1.0,
      "verified": true,
      "author": "tfortrue",
      "helpful_votes": 4,
      "publication_date": 20181108
    },
    {
      "title": "Great item!",
      "text": "Great for at home therapy! Wish the instructions were a bit better but really nothing more to improve on this.",
      "rating": 5.0,
      "verified": true,
      "author": "Elvis",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "Quality set!",
      "text": "This is the exact same set my physical therapist uses! Its a no brained... $25 for this set that I can use at my leisure or $65 per session if physical therapy? I get instant relief when I cup and this set is so easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "tree",
      "helpful_votes": 0,
      "publication_date": 20190828
    },
    {
      "title": "Great!",
      "text": "Pump and cups work well. The printed gold detail on the cups do come off on ur hands which is quite annoying. I would recommend using exam gloves or remember to wash your hands after giving someone a treatment. Can't complain because the price is so reasonable.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Lee",
      "helpful_votes": 2,
      "publication_date": 20170128
    },
    {
      "title": "Best value for the product and is effectiveness",
      "text": "Love this so much!! I bought my set at a local korean store and costed me $60 for it. I found the exact same one on here for half of what I paid. I love it so much i ended ordering 4 sets as gifts to my aunties and sister.",
      "rating": 5.0,
      "verified": true,
      "author": "Meuy",
      "helpful_votes": 0,
      "publication_date": 20200502
    },
    {
      "title": "Worth having for personal used.",
      "text": "Wonderful personal used cups, it relieves muscle pain and stagnant circulation which usually occur on winter months and post exercise. Not prone to break, and well made. I am very satisfied with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Vinceley",
      "helpful_votes": 2,
      "publication_date": 20171102
    },
    {
      "title": "Defective Elbow",
      "text": "Product defective on first time use. Elbow had crack therefore reduced air sunction to nothing.",
      "rating": 1.0,
      "verified": true,
      "author": "WILLIAM",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "LOVE LOVE LOVE",
      "text": "Did some research before purchasing these. They weren't the cheapest nor the more expensive ones. However, they work great and perfect amount of cups. SO glad to have found these so that we can do them ourselves rather than paying the 25 each visit to have them done.",
      "rating": 5.0,
      "verified": true,
      "author": "momof3aussies",
      "helpful_votes": 0,
      "publication_date": 20180802
    },
    {
      "title": "Excellent Value - no need to splurge on glass",
      "text": "Was hesitant to purchase because it is plastic and cheaper but after some research I learned it really isn’t necessary to get glass cups if you aren’t heating them. This package, the products, and the quality are all 5star especially because of the price.",
      "rating": 5.0,
      "verified": true,
      "author": "vmasters",
      "helpful_votes": 0,
      "publication_date": 20181010
    },
    {
      "title": "Awesome",
      "text": "I use these cups daily and have not had an issue. They have fallen and have not cracked or broken. They also fit my medical cupping machine",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "Physical therapist approved!",
      "text": "As a physical therapist, I utilize cupping in the clinic a lot. This brand is a reputable and cost effective option for those looking for pain relief from tight/tense muscles. Love these!",
      "rating": 5.0,
      "verified": true,
      "author": "Liz Wood",
      "helpful_votes": 0,
      "publication_date": 20201003
    },
    {
      "title": "Great product.",
      "text": "Great suction. Good quality. Just like professional cupping device. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "misha perez",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "Confusing directions/instructions but they work well",
      "text": "They said two different things in product description and the FAQs. The product said the cups are for static use only but the company said they can be mobilized. Kind of confusing. I don’t believe these are for moving around on the skin.",
      "rating": 2.0,
      "verified": true,
      "author": "Jamie Paugam",
      "helpful_votes": 0,
      "publication_date": 20200301
    },
    {
      "title": "Self-care",
      "text": "I love the vacuum cups for the ease of working on myself! So far, good quality. It would be helpful to have some instructions in English however, and to explain what the other parts are for.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190322
    },
    {
      "title": "CHEAP, DOESN'T WORK PROPERLY!",
      "text": "BUYER BEWARE!!! The suction is awful on these and is not easy to regulate. Cheap material and doesn't allow returns. DON'T REGRET YOUR PURCHASE LIKE I DID, LOOK ELSEWHERE FOR THESE!",
      "rating": 1.0,
      "verified": true,
      "author": "JB",
      "helpful_votes": 0,
      "publication_date": 20200305
    },
    {
      "title": "Good purchase",
      "text": "I love this set and my wife does too. She knows how to use these on my aching muscles and I find great relief from them. She has dropped one or two a few times and has yet to break any so I suspect they are of decent quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Baron",
      "helpful_votes": 0,
      "publication_date": 20180813
    },
    {
      "title": "LOVE it!",
      "text": "Why pay for physical therapist when you can do this on your own? I love this! Just get any hand/body lotion for lubrication on your skin before cupping. And you are set!",
      "rating": 5.0,
      "verified": true,
      "author": "rosycheeks",
      "helpful_votes": 0,
      "publication_date": 20180302
    },
    {
      "title": "Easy to use",
      "text": "Easy to use. Provides pain relief and easy to clean.",
      "rating": 5.0,
      "verified": true,
      "author": "3RowerMom",
      "helpful_votes": 0,
      "publication_date": 20200823
    },
    {
      "title": "Cupping set",
      "text": "I’m a license massage therapist and I use this kit for work. I have 2 Different kits. The other one has larger cups but the tubing that came with it keeps slipping off. I use this one more often because I don’t have to worry about a tube",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Weishaar",
      "helpful_votes": 0,
      "publication_date": 20200310
    },
    {
      "title": "Great for blood circulation",
      "text": "Helps relieve my back pain. Also its great for blood circulation.",
      "rating": 5.0,
      "verified": true,
      "author": "Sadig",
      "helpful_votes": 0,
      "publication_date": 20200412
    },
    {
      "title": "Great Item",
      "text": "Love the suction easy to use and very effective to use on different parts of teh body because of the selection of sizes for the cups. The suction is great and that is good because in the past i have only used Fire Cupping method but this item works and is very easy and effective. Great Buy!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "CZ",
      "helpful_votes": 0,
      "publication_date": 20191126
    },
    {
      "title": "Very good Cupping. I first brought a cheaper one",
      "text": "Buy with convenience! Very good Cupping. I first brought a cheaper one........half the cups broke in the first three weeks, the cups suction would not take, etc. I love this one, stronger cups and use it every day with no problems.",
      "rating": 5.0,
      "verified": true,
      "author": "Theo",
      "helpful_votes": 2,
      "publication_date": 20160821
    },
    {
      "title": "Nothing but pros",
      "text": "My boyfriend and I love them so much that we got another set for my mom. We use them once or twice a week and we leave them on for about 5 mins a round. Super easy to use, indeed no brainer and great stress and pain releive. The marks last about 5 days depending on the darkness of it.",
      "rating": 5.0,
      "verified": true,
      "author": "Yael",
      "helpful_votes": 0,
      "publication_date": 20200528
    },
    {
      "title": "Great",
      "text": "Great for the college athlete low budget. So happy with this purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "Jessica Kursinsky",
      "helpful_votes": 0,
      "publication_date": 20201020
    },
    {
      "title": "Theses cups really suck!",
      "text": "This is a good set of vacuum cups. You get an assortment of sizes. For self treatment also get the extension to treat the lower back, for example. Much safer than using the traditional fire method of cupping.",
      "rating": 5.0,
      "verified": true,
      "author": "MetaBuyer",
      "helpful_votes": 0,
      "publication_date": 20190424
    },
    {
      "title": "You won't regret purchasing this!",
      "text": "Love this!! My husband and I use it weekly...has helped sooo much. My husband has a very physical job and gets lots of arm..back strain..works awesome. Well made@",
      "rating": 5.0,
      "verified": true,
      "author": "Scott & Christy Reynolds",
      "helpful_votes": 0,
      "publication_date": 20181217
    },
    {
      "title": "great product. I would recommend this and I have",
      "text": "great product. I would recommend this and I have. the only downside to this is that the main size isn't as big as some other cups I own. however the is well made, easy to use and I love the case that it is stored in. would buy again. great deal",
      "rating": 5.0,
      "verified": true,
      "author": "Kristina",
      "helpful_votes": 0,
      "publication_date": 20171122
    },
    {
      "title": "Great set of cups!",
      "text": "Lots of medium and large cups. Much more useful than the previous ones I’ve had. These provide pain relief and great suction.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica P",
      "helpful_votes": 0,
      "publication_date": 20190728
    },
    {
      "title": "Great Purchase",
      "text": "I expected to find the hose that these sets normally have that connects the cup with the suction tool, but there is none LOL! Simple is good - the quality of the cups is exceptional and I would recommend this set.",
      "rating": 5.0,
      "verified": true,
      "author": "NachorGirl",
      "helpful_votes": 0,
      "publication_date": 20200920
    },
    {
      "title": "Five Stars",
      "text": "Good product. Works well, despite inexpensive price. The brand my acupressurest recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Kerry",
      "helpful_votes": 2,
      "publication_date": 20170918
    },
    {
      "title": "Such a deal!",
      "text": "My daughter loves it. Great for sleepovers. Everyone goes home with those round hickey marks. But not as dark as the pro cupping gives you,so...",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181206
    },
    {
      "title": "Ok for the price",
      "text": "Product is ok for the price- the extension tube is hard to use and it keeps popping off the cups, and the carrying case arrive damaged.",
      "rating": 3.0,
      "verified": true,
      "author": "Chastity B. Thompson",
      "helpful_votes": 0,
      "publication_date": 20180312
    },
    {
      "title": "Was a present",
      "text": "Got this for a present for My friend and she loved it!",
      "rating": 5.0,
      "verified": true,
      "author": "Heather Logan",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "Cups will crack if dropped.",
      "text": "Amazing set, perfect, lovely case. Cups will not survive being dropped; even if just into the sink. Cracks will appear in the neck and they lose force of suction.",
      "rating": 4.0,
      "verified": true,
      "author": "brittany c zerkle",
      "helpful_votes": 0,
      "publication_date": 20180823
    },
    {
      "title": "Great product would purchase again.",
      "text": "I use these in my wellness practice. I also have silicone cups but these are best for athletes and those seeking sweeper work.",
      "rating": 5.0,
      "verified": true,
      "author": "Wonder Woman",
      "helpful_votes": 0,
      "publication_date": 20190922
    },
    {
      "title": "Great cupping set",
      "text": "Great cupping set, different from my old set where the seals dry rot and break. I think this is much better quality",
      "rating": 5.0,
      "verified": true,
      "author": "muddy joe",
      "helpful_votes": 3,
      "publication_date": 20161116
    },
    {
      "title": "Five Stars",
      "text": "Overall very good set with plenty of supplies and varying sizes. Suction is solid and materials/accessories seem durable.",
      "rating": 5.0,
      "verified": true,
      "author": "LA ShopperTop Contributor: Golf",
      "helpful_votes": 3,
      "publication_date": 20161016
    },
    {
      "title": "Great product",
      "text": "This is awesome, exteamly easy to use And very practical. Highly recommend it",
      "rating": 5.0,
      "verified": true,
      "author": "VeraVorac",
      "helpful_votes": 0,
      "publication_date": 20191203
    },
    {
      "title": "Great value and good quality.",
      "text": "Top quality product for the price. Suction pump gun fits the cups firmly and ease of use is excellent. Great for removing xha from trigger points with stagnation or soreness. Great for practitioner or at home use. Have used multiple methodologies for cupping and this one does the trick. Would recommend for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "marshall maxwell",
      "helpful_votes": 0,
      "publication_date": 20170913
    },
    {
      "title": "ok",
      "text": "Using the products have no problem, but there's scratches and lousy prints on cupping cups.",
      "rating": 3.0,
      "verified": true,
      "author": "Neo",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "Stiff away",
      "text": "We use this in my office quite a bit so I had to get one for myself. Best way to help prevent soreness and tight muscles. Always my go to.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. Haag",
      "helpful_votes": 0,
      "publication_date": 20190108
    },
    {
      "title": "Great portable set for a professional.",
      "text": "I love this set, it's small enough to carry around to the various places I work while still having more than enough cups to use professionally. Everything came in good condition and the case is great for keeping things organized, protected, and clean as I move between locations. I also like that when I put the tube on it's easier to up the intensity while doing running cupping (where the cups are moving), making it easier to slowly increase the intensity.",
      "rating": 5.0,
      "verified": true,
      "author": "Juliana",
      "helpful_votes": 0,
      "publication_date": 20180108
    },
    {
      "title": "Great product overall",
      "text": "Good product but the quality could be improved. I gave 4/5 because of there were 2 cups were loosing air. So yeah expect this product comes with factory defect units. Overall is good.",
      "rating": 4.0,
      "verified": true,
      "author": "Sam",
      "helpful_votes": 0,
      "publication_date": 20200312
    },
    {
      "title": "Easy to use and sturdy",
      "text": "These are very user friendly for both private and professional use. Sturdy, durable, nice carrying case. The lettering washes off, but that doesn't matter much to me. I do wish there were more of the smaller sized cups as the vast majority are the largest size. But it definitely gets the job done.",
      "rating": 5.0,
      "verified": true,
      "author": "da",
      "helpful_votes": 0,
      "publication_date": 20190920
    },
    {
      "title": "Overall good",
      "text": "Better to get the set with the rubber extension cord.",
      "rating": 5.0,
      "verified": true,
      "author": "Lee H.",
      "helpful_votes": 0,
      "publication_date": 20200611
    },
    {
      "title": "Most liked item",
      "text": "I m using it over a year now. Still love it. Very good quality for this price. Using it always. One thing if they can make case of cupping set a little bit more quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Joy Baganaa",
      "helpful_votes": 0,
      "publication_date": 20190615
    },
    {
      "title": "😍",
      "text": "I love this set. It’s so much better, safer and more convenient than light a fire in a jam jar and worry about burning someone’s skin 😀",
      "rating": 5.0,
      "verified": true,
      "author": "Corgi Lover",
      "helpful_votes": 0,
      "publication_date": 20200701
    },
    {
      "title": "need to order extension tube separately .",
      "text": "I did not pay attention when i order, there is no extension tube included, so i have to order one again (separately) . I ordered another two 12 cup set for my friends, I like it better with the price and product.",
      "rating": 3.0,
      "verified": true,
      "author": "Hoover",
      "helpful_votes": 0,
      "publication_date": 20180616
    },
    {
      "title": "Read and follow the instruction",
      "text": "I bought 3 of these and works really well and easy to use. My mom and sister loved it. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Mari",
      "helpful_votes": 0,
      "publication_date": 20190119
    },
    {
      "title": "Good cupping set",
      "text": "This that was shipped in great condition and it works great for its money,",
      "rating": 5.0,
      "verified": true,
      "author": "Crystal Hendrickson",
      "helpful_votes": 0,
      "publication_date": 20190610
    },
    {
      "title": "Not working well",
      "text": "When the suctions part is very rough, u can fell little scathing. Don’t how describe.",
      "rating": 1.0,
      "verified": true,
      "author": "Yoke",
      "helpful_votes": 0,
      "publication_date": 20190505
    },
    {
      "title": "Use them frequently at my work for manual therapy. ...",
      "text": "Use them frequently at my work for manual therapy. Not too thrilled with the quality and they don't stay in as well as desired/expected.",
      "rating": 4.0,
      "verified": true,
      "author": "Eli",
      "helpful_votes": 0,
      "publication_date": 20170807
    },
    {
      "title": "Cupping",
      "text": "Box is cheap and became slightly ripped. But the cups work great.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190705
    },
    {
      "title": "Excellent quality",
      "text": "Excellent quality. Make sure you use some sort of lubricant (e.g. baby lotion) when putting these on. Failing to do so makes removal a tad painful.",
      "rating": 5.0,
      "verified": true,
      "author": "D Parkhurst",
      "helpful_votes": 0,
      "publication_date": 20170523
    },
    {
      "title": "My lifesaver!!! Cupping takes away my Fibromyalgia ...",
      "text": "My lifesaver!!! Cupping takes away my Fibromyalgia pain....it literally saved my life",
      "rating": 5.0,
      "verified": true,
      "author": "lsrdar",
      "helpful_votes": 3,
      "publication_date": 20170204
    },
    {
      "title": "Exact same set as my acupuncturist uses.",
      "text": "This is the exact set that my acupuncturist uses. They worked great, the gun applied a lot of pressure easily. I'd highly recommend these!",
      "rating": 5.0,
      "verified": true,
      "author": "L. Pinson",
      "helpful_votes": 0,
      "publication_date": 20170626
    },
    {
      "title": "Easy to use",
      "text": "I workout, so this is really helps for muscle pain. Easy to use. Just put on pain location (muscle) then use the suction wait 10-15 mins pain relief.",
      "rating": 5.0,
      "verified": true,
      "author": "Long Vuong",
      "helpful_votes": 0,
      "publication_date": 20200314
    },
    {
      "title": "Great quality for price",
      "text": "Very happy with my set. Great quality for the price!",
      "rating": 5.0,
      "verified": true,
      "author": "Monte",
      "helpful_votes": 0,
      "publication_date": 20190819
    },
    {
      "title": "Relief",
      "text": "This one is great! I only wish it had bigger cups but I love it the suctioning works well!",
      "rating": 4.0,
      "verified": true,
      "author": "Julie",
      "helpful_votes": 0,
      "publication_date": 20190818
    },
    {
      "title": "Great for adhesions",
      "text": "Tight muscles or muscle adhesion. You do need to be aware that you can bruise yourself using this tool",
      "rating": 5.0,
      "verified": true,
      "author": "MikeMcG",
      "helpful_votes": 0,
      "publication_date": 20181102
    },
    {
      "title": "and once the plug on top comes out the cup becomes useless. Still",
      "text": "Last set lasted me over two years! The cups are liable to break if they are dropped, and once the plug on top comes out the cup becomes useless. Still, this is only with rough-handling.",
      "rating": 5.0,
      "verified": true,
      "author": "Jesse M",
      "helpful_votes": 0,
      "publication_date": 20180109
    },
    {
      "title": "My GF uses these things all the time. All ...",
      "text": "My GF uses these things all the time. All her friends come over to have a cupping session. They have become the purpose for our friends to visit us haa",
      "rating": 5.0,
      "verified": true,
      "author": "Er H.",
      "helpful_votes": 0,
      "publication_date": 20170306
    },
    {
      "title": "Health",
      "text": "I’m using it for many years,, Lot of my friend buying it!",
      "rating": 5.0,
      "verified": true,
      "author": "viktoriya",
      "helpful_votes": 0,
      "publication_date": 20200331
    },
    {
      "title": "This cupping set is amazing, the extension hose hose was cracked and air ...",
      "text": "This cupping set is amazing, the extension hose hose was cracked and air escapes on arrival, If you use the pump straight to cup it still works.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20161208
    },
    {
      "title": "Works Great",
      "text": "Recommend by my acupuncturist. They are easy to use. They arrived on time and undamaged. The instructions are not in English, but one can understand the diagram. My acupuncturist did make me a copy of hers that were in English. My husband and I use them on each other and our son has also requested to have them used on him. He is 12 years old.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathy",
      "helpful_votes": 0,
      "publication_date": 20160205
    },
    {
      "title": "Durable",
      "text": "This has worked very well for my fiancé and I. We have even used these for ‘sliding’ and have had no problems. Very durable.",
      "rating": 5.0,
      "verified": true,
      "author": "Jes",
      "helpful_votes": 0,
      "publication_date": 20180809
    }
  ],
  "product_meta": {
    "title": "Hansol Cupping Therapy Equipment Set with Pumping Handle 17 Cups (Made in Korea)",
    "description": "Size:17 CUPS*Cupping is an ancient Chinese method of massage for comfort. Cupping, the technique, is very useful and very safe and can be easily learned and incorporated into your family health practices. The new cups have done away with the traditional firing. This has made the application of the cups easy and safe. It has not only improved efficacy but also simplified the procedures of cupping therapy. They are easier to be handled and safer to be used for massage at home. In China, the new cups are very popular for family cupping massage. CAUTION: Thoroughly clean skin and remove body hair before cupping. Excessive body hair will result in weak suction (not strong). **DO NOT BOIL CUPS. DO NOT USE for slide/oil cupping massage. Our company is not responsible for damage to cups, which may result from slide/oil cupping technique or any massage techniques. **Please note that all the cupping cups are disposable**",
    "rating": 4.6,
    "feature_bullets": [
      "17 x Plastic Cupping Cups (13 of the 2\" dia cups and 1 each of the 1.75\", 1.5\", 1.25\", and 1\" dia cups)",
      "1 x Hand Pump",
      "1 x Carrying Case"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "13.5 x 10 x 3.5 inches; 2.93 Pounds",
      "Item model number": "Hansol Cupping 17pcs",
      "Date First Available": "October 24, 2013",
      "Manufacturer": "Hansol Medical Equipment",
      "ASIN": "B00L319LIM",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Back Massagers",
      "Massage Tools",
      "Health & Household",
      "Massage Tools & Equipment",
      "Wellness & Relaxation",
      "Health, Household & Baby Care"
    ],
    "price": 25.99
  }
}