{
  "website_summaries": [
    {
      "verdict": "Offers performance comparable to the Physen and is easy to scale for large properties. Consider which design appeals to you and fits your home.",
      "pros": [
        "This durable, wireless system features two buttons and two chimes, but can be expanded to include additional buttons, chimes, and motion sensors",
        "Very easy to install and configure to suit your needs, especially for large spaces"
      ],
      "cons": [
        "Buttons are weather resistant (but not water proof), so they must be mounted where they will not come in direct contact with rain",
        "Chimes must be plugged into electrical outlets, which may limit placement options"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Cool device! Great service!",
      "text": "Works great, and so easy to setup. I put one button on the gate by the backdoor which is always locked. Visitors always complained when they came over, because they'd have to go all the way around to the front door. The instructions say to put the receiver up high, but both mine are in a recrpticle low by the floor...both work perfect. One other thing...I put the buttons in the wrong place. So I contacted the seller to purchase two double sided adhesive strips...they shipped me two at no charge! Excellent customer service!",
      "rating": 5.0,
      "verified": true,
      "author": "Clay C.",
      "helpful_votes": 72,
      "publication_date": 20190130
    },
    {
      "title": "Good price for an excellent wireless doorbell",
      "text": "Easily installed, working extremely well. Almost too many choices of ring tones, lol 😊",
      "rating": 5.0,
      "verified": true,
      "author": "MikeyrInJeff",
      "helpful_votes": 81,
      "publication_date": 20170519
    },
    {
      "title": "A doorbell you can HEAR.",
      "text": "Just got it. It is all contained in a small box. Units plug in, put my buttons up and bingo, works like a charm. You do have to unassemble the buttons and place the battery where it makes contact. Nice loud doorbell sound! If it lasts more than 6 months, it's a home run.",
      "rating": 5.0,
      "verified": true,
      "author": "George L",
      "helpful_votes": 81,
      "publication_date": 20170130
    },
    {
      "title": "DO NOT Buy!!!",
      "text": "DO NOT BUY. The product is defective. After a month the product stopped working. I changed the batteries. Not even a month later, it would chime for no apparent reason. Early one morning it started ringing persistently. I thought it was an emergency jumped out of bed and ran to the door only to find no one was there. Before I could close the door, it started again this time it would not stop. I had to unplug them. Very disappointed because they look great and based on other reviews I thought I would have a great experience. I've had them for less than a year.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 8,
      "publication_date": 20180804
    },
    {
      "title": "you have to repeat all 50+ again and try to remember which one you liked. Many sound very similar",
      "text": "Product works well, but going through the 50+ tones to find the one you want is a real pain. If you go past it, you have to repeat all 50+ again and try to remember which one you liked. Many sound very similar. The unit has very good range and I set it up to have a different chime between front and back doors. The four volume settings are very acceptable.",
      "rating": 3.0,
      "verified": true,
      "author": "REM",
      "helpful_votes": 31,
      "publication_date": 20160426
    },
    {
      "title": "Product works great, I have two doors and never knew what ...",
      "text": "Product works great, I have two doors and never knew what dude of the house someone was at. Now we have two different rings for the the doors. I put the second chime in my garage so I know when someone is at the house when I'm out back working. Distance is about 50 feet through a brick wall and two stud walls. My only complaint is the selection of tones. There are about 4-5 tones that won't drive you mad, each as a sing or repeated chime. The rest are ungodly annoying. You have to scroll through them all to get back to the one you want, so setup isn't great. However, once you have it it is good.",
      "rating": 4.0,
      "verified": true,
      "author": "Kyle B.",
      "helpful_votes": 5,
      "publication_date": 20170407
    },
    {
      "title": "Not good with rain",
      "text": "The doorbell buttons that come with this do NOT work well outside as you might think they would. They do not seal, and they will short, causing your doorbell to ring non-stop all night long in the middle of a thunderstorm. Woke up in a daze unsure what was going on for 30 seconds until I became aware enough to realize it was the new doorbell system. I unplugged them from the wall. Tried again... same thing on the very next rainy day. Not usable like this - if I need my guests to open my door and ring a button inside, then what's the point?",
      "rating": 1.0,
      "verified": true,
      "author": "SamS",
      "helpful_votes": 0,
      "publication_date": 20190908
    },
    {
      "title": "Just what we wanted,",
      "text": "The Starlight Alert System is just what we wanted. We are an elderly couple, living in a spacious home, sleeping in separate bedrooms across the hallway. Since I have trouble hearing and sleeping without my hearing aids, I have the receiver plugged into a Multi Surge Receptible Unit mounted on my night stand along with my smartphone. We have chose a long playing melody and only have to push the transmitter once. The alert light also lights up the room during transmission. We love it. I also ordered an add on, battery operate, since I'm an early riser and spend early morning hours in my den. Highly recommend it. Robt.",
      "rating": 5.0,
      "verified": true,
      "author": "Robt.",
      "helpful_votes": 0,
      "publication_date": 20190827
    },
    {
      "title": "Works OK, not weatherproof",
      "text": "Was awoken at 2 am during a rain storm to the doorbell ringing non-stop. I had to go outside and remove the battery from the button to make it stop. It seems that when it gets wet, it malfunctions. After it dried out, I sealed it up with a little silicone caulking and it hasnt happened again, but we will see. A month later, one chime stopped working completely. I reported the issue and their customer service was pleasant and responsive and offered a replacement chime which arrived in about a week.",
      "rating": 3.0,
      "verified": true,
      "author": "Anpbabaki",
      "helpful_votes": 4,
      "publication_date": 20170802
    },
    {
      "title": "Don’t buy this",
      "text": "Bought this unit in July 2016. One of the plug in receivers died a year later. Both push buttons are in protected areas away from weather. One button works. The other is on my front door. Unless you press it just right and the stars are all aligned in your favor, the inside unit WILL NOT RING. I have missed more people. Don’t waste your money. Buy something else. I’m now shopping for a replacement. Grrrrr........",
      "rating": 1.0,
      "verified": true,
      "author": "fussy shopper",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "This is a 5 star product, except",
      "text": "This is a great product - good design, easy to install works great. My problem is that one of the chime units has a wonderful array of chimes - the other has the most obnoxious collection of diddies - happy birthday, row your boat, etc, etc. I had no idea this was coming. It has one acceptable chime - that's all. I know this is a matter of taste and opinion but I would have appreciated a choice in having both the same selections.",
      "rating": 3.0,
      "verified": true,
      "author": "Clyde",
      "helpful_votes": 0,
      "publication_date": 20190406
    },
    {
      "title": "Luv It",
      "text": "This economical doorbell works very well. It has lots of different rings and tunes. If you pass the one you want, you have to go back through the entire list until you get back. But, there should be something for everyone on their list of rings. It was easy to set up. Plug receiver into outlet, put transmitter where you want and you're ready to go. The hardest part of setup was deciding which ring I wanted. Ring can be set loud. There are two so I have a different ring for front and for back doors. Liked it so much, I ordered a second.",
      "rating": 4.0,
      "verified": true,
      "author": "Gramma",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "THIS is the One!",
      "text": "THIS is the one! I ordered another product (the Magicfly Wireless Doorbell) and I simply couldn't get it programmed correctly to give a different chime for the front and back door. This was EVEN after contacting the company via phone (no answer), email (two bad answers), and watching their YouTube video (awful - no voiceover to tell what the hands on the screen are doing or why). I wasted a full day (on and off) on this. Horrible company! This unit I had up and running with those two different chimes within 15-20 minutes of unboxing it. I am VERY happy! Thank you SadoTech.",
      "rating": 5.0,
      "verified": true,
      "author": "Fred W. Anson (aka \"Mr. IT\")",
      "helpful_votes": 0,
      "publication_date": 20180307
    },
    {
      "title": "Great Easy Option if Needing Doorbell",
      "text": "Very Happy with This . We have a gate in front that delivery drivers and company are hesitant to open due to our dogs and just not sure if it’s ok to come in the yard . This bell is a great and allows them to ring and let us know someone is there and having 2 receivers allows me to have one upstairs and down stairs so I can hear no matter where I am in the house . Arrived within 2 days of ordering and was set up and ready to go within minutes . We have days of hard rain n wind since installing and have had no issues .",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200701
    },
    {
      "title": "Re: item and Customer Support",
      "text": "The product I received was faulty. One of the receivers didn’t work. The two transmitters and other receiver worked exactly like I hoped they would. I contacted the customer support of the company (support@sadotech.com) and informed them of the issue. They sent me a replacement-a transmitter though. I emailed back and let them know I needed a receiver and not the transmitter. They had me send a short video of the issue. Within a week of that I have a new receiver, that works great, and they didn’t want the transmitter back that was incorrectly sent.",
      "rating": 5.0,
      "verified": true,
      "author": "Tara",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "Just what we needed",
      "text": "My dad is in his 90s and was recently hospitalized. I put a receiver in my bedroom and one in my brother's bedroom. I have a transmitter in the bathroom, one by my dad's bed and one by his recliner. (I purchased the 3rd transmitter separately). If he needs one of us, he just presses a button. I don't think we needed 500 chime or song choices, but other than that its perfect. Fairly easy to program and set up. I don't know how it works outside because that is not what we are using it for.",
      "rating": 5.0,
      "verified": true,
      "author": "lduch27",
      "helpful_votes": 0,
      "publication_date": 20200222
    },
    {
      "title": "No Warranty",
      "text": "I used this product to help my elderly mother be able to call for help. One of the units failed after 8 months. After contacting the seller, and exchanging countless emails. I received a link to a resolution the went to a blank page. Seller does not stand behind their products",
      "rating": 1.0,
      "verified": true,
      "author": "Paula D",
      "helpful_votes": 4,
      "publication_date": 20180907
    },
    {
      "title": "Great wireless doorbells!",
      "text": "I purchased the set of wireless doorbells before I had back surgery. I wanted to make sure that if I needed anything and my husband was in the back of the house while I was in front, and vice versa, I could get his attention! We set one up in each location with a button for the opposite in each place I would likely be. They worked GREAT! Luckily I only needed to use them a couple of times as the surgery was a huge success, but it was nice knowing that I could get his attention quickly when I needed him! I don't need them any longer, but I plan on keeping them right where they are!!",
      "rating": 5.0,
      "verified": true,
      "author": "pengwen65.",
      "helpful_votes": 0,
      "publication_date": 20190314
    },
    {
      "title": "More then a door bell.....",
      "text": "Just received my wireless long distance doorbell! My need for this was not for the purpose of a doorbell however! My parents home is about 6ft behind mine and the have health issues that they are not able to use or see the phone and that phone is an issue all by itself, so I needed an alert to my house when they needed me ASAP! I plugged it in gave her the button and it worked! I am so very pleased! This just took so much worry away from my mom, my dad has Alzheimer’s and is getting worse and this little gadget will be life saving for us!",
      "rating": 5.0,
      "verified": true,
      "author": "Diana L.Top Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20180925
    },
    {
      "title": "Top Performer At A Reasonable Price.",
      "text": "A very well designed and manufactured wireless door bell. First of all its appearance which is very important for a door bell is very attractive and the white color means it can look good in all backgrounds of color. There are many excellent features that are easy to setup. For instance there a many choices for the door bell sound to cover a wide range impressions. The chime is AC powered and so does not require any batteries. The batteries in the \"button\" will last forever because they are only used during the time the button is being depressed. Lastly, the price was higher the quality justified it very much.",
      "rating": 5.0,
      "verified": true,
      "author": "Dean Luedtke",
      "helpful_votes": 0,
      "publication_date": 20170727
    },
    {
      "title": "Range was excellent, but could use some better waterproofing on the transmitter.",
      "text": "Range reached from a downstairs backdoor to an upstairs bedroom with no issues. There did not appear to be any specific waterproofing which suggests that the unit requires installation in a protected location. Would be good to see a gasket added to the transmitter to increase its weather resistance. While the volume can be increased it would be improved if either the sound could be repeated a number of times, or the volume could be increased even more. You can add additional receivers (bells) which can also assist in notification.",
      "rating": 5.0,
      "verified": true,
      "author": "Tim J.",
      "helpful_votes": 0,
      "publication_date": 20200701
    },
    {
      "title": "Great product for the money",
      "text": "Our receiver quit working and had to find another set. I searched and searched and decided to go with this one because of the distance it worked and that it had 2 receivers/transmitters. We have a 2 story house so it was important that we have 2 receivers. It's even better that we can program all 4 transmitters to have different tones. It was hard to decide on which one to choose. I have 1 sound for the front door and another sound for the back door. My son did the same thing for his upstairs receiver. It was so easy to program too I would definitely recommend this product, especially since it's expandable.",
      "rating": 4.0,
      "verified": true,
      "author": "Kristi",
      "helpful_votes": 0,
      "publication_date": 20180720
    },
    {
      "title": "came disassembled",
      "text": "when i opened the box, one of the sensors were opened and the battery out of the unit.. i feel it was returned and repacked. i think this because the tab on the unit once the battery is in was broke and the unit has to be rubber banded to hold it together. I sent a question about this almost two years ago saying \" just send another piece so i can click the unit together \" no response was given.",
      "rating": 1.0,
      "verified": true,
      "author": "Robert canning",
      "helpful_votes": 4,
      "publication_date": 20190118
    },
    {
      "title": "Bought for elderly parents house / works great so far",
      "text": "Bought 6+ months ago for elderly parent since their old wired doorbell had long ago stopped working. Bought the two button, three plug-in receiver model. Setting up front door vs back door tones was very easy. The units work well and distance has not been a problem. Batteries continue to work after 6 months - curious how long we will get from them. There are two buttons on the side, one for volume level and the other to sample/select the tone to play. Would prefer if the sound level was a switch as it is too easy to inadvertently turn the volume down without realizing it. I would buy this again.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul Pellegrini",
      "helpful_votes": 0,
      "publication_date": 20190111
    },
    {
      "title": "Can program different sound for each button.  Not perfect, but nearly so.  Works very well.",
      "text": "This system allowed for the programming of a different sound for each button. But understand that you have to program each receiver separately to get the same sounds as the other receiver. I programmed the first receiver and then when I plugged in the second one and hit a button, found that the second receiver needed to also be programmed to the new sound selections. Only reason I didnt give 5 stars is that there is no battery backup for receivers. A battery backup that maintains operation during power outages and maintains button selection programming would make this set perfect.",
      "rating": 4.0,
      "verified": true,
      "author": "WmGoatHuntleyIL",
      "helpful_votes": 0,
      "publication_date": 20170721
    },
    {
      "title": "Nice Unit",
      "text": "Nice door bell system. Can be heard from all parts of our home...and with the length of our home we definitely needed two. Our only complaint...not being able to scroll forwards And backwards thru all of the tones...52 tones. Would like it if it had that option. It would also be nice to have a display counter showing the number for the tones, so if you like a particular sound(s) you can write it down then go back and listen to them again and decide on the one you like and set it. Other than that...nice unit.",
      "rating": 4.0,
      "verified": true,
      "author": "K. Fox",
      "helpful_votes": 2,
      "publication_date": 20170210
    },
    {
      "title": "ridiculously easy",
      "text": "I genuinely cannot believe that they sell this with the batteries in it and basically make it a 3 minute setup. That includes opening the box and throwing away the minimal packaging, also much appreciated. I saw something in a review about watching a you tube video...if you have to do that I have to wonder if you aren't overthinking this. It was SO easy. Looks nice, sounds great, easy to adjust ringtone and volume. Shockingly simple. Love it.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Levy",
      "helpful_votes": 0,
      "publication_date": 20181230
    },
    {
      "title": "they work great through several walls (including leaded ones)",
      "text": "We purchased these for our medical office. We have a solo x-ray technician who is frequently in an isolated environment with patients. We needed something for her to be able to utilize in the event of an emergency. So far, they work great through several walls (including leaded ones). I appreciate the options for ring tones, though it is a bit of a pain to pick one out - you just have to keep moving through them until you find one you like. Also purchased an additional transmitter to have the buttons in multiple locations.",
      "rating": 5.0,
      "verified": true,
      "author": "HeidiLeah",
      "helpful_votes": 0,
      "publication_date": 20171010
    },
    {
      "title": "Great for houses with multiple doors and multiple floors",
      "text": "Very pleased with this set up. Set back door and front door bells to different rings. Bought expansions so that I can hear the doorbell in every floor of the house including in the basement. Bought one of the portables to have with me in the back yard so I can hear if someone comes to the front door. Batteries have lasted through the -23 winter we just had. The one gripe I have is that ring tone selection isn't friendly. You cycle through all of them in one direction only.",
      "rating": 4.0,
      "verified": true,
      "author": "B. Havens",
      "helpful_votes": 0,
      "publication_date": 20190220
    },
    {
      "title": "Love this product!",
      "text": "I love this product. We are using this for my mom who lives with us. She is wheelchair bound and we have been racking our brains on how to allow her to communicate with us easily if we are on another floor (5 level house). This item is just perfect. I have a doorbell on each floor, all keyed the same. She can now just push the button on the transmitter and one of us will always hear it. Very easy to set up. Takes less than one minute (I think I did all 5 in under 2 minutes). Spectacular customer service, quick response to questions, friendly and well versed in the produce. Kuddos Starpoint.",
      "rating": 5.0,
      "verified": true,
      "author": "tigerlilly",
      "helpful_votes": 0,
      "publication_date": 20170327
    },
    {
      "title": "Not as advertised",
      "text": "I just received my Waterproof Door Bells & Chimes Wireless kit from Amazon. I was disappointed to see that the transmitter buttons included WERE NOT waterproof. They are listed as \"weather resistant\". Weather resistant doesn't work real well here on the SW Washington coast. On the SadoTech website, you can purchase the weather proof transmitters for $16/each. $32 to upgrade to the waterproof transmitter buttons is as much as I paid for the initial 2 transmitter/receiver kit. Would help if the product received matched the description on Amazon.",
      "rating": 2.0,
      "verified": true,
      "author": "Duane Goodman",
      "helpful_votes": 0,
      "publication_date": 20200523
    },
    {
      "title": "But so far so good. A good product and a satisfactory purchase",
      "text": "Amazingly I received this item the next day [having anticipated two day delivery], naturally I had no complaints. The item was packaged correctly and as advertised. Worked straight out of the box. Only installed one transmitter and two receivers for now. Needed a second transmitter to hear the front doorbell while in my apartment. I have no complaints at this time. The only aspect that is unknown to me is the battery life span. I bought replacement batteries just in case. But so far so good. A good product and a satisfactory purchase. It is plug and play.",
      "rating": 5.0,
      "verified": true,
      "author": "Rickard",
      "helpful_votes": 0,
      "publication_date": 20170905
    },
    {
      "title": "SADO TECH Wireless Door Bell",
      "text": "I don’t know about weather proof at this time. I installed in minutes and placed one button at front door and receiver close to wall for lanai. SADOTech product worked immediately! I did not have to buy batteries etc. Thank You! You will need to purchase heavy duty Dual Sided tape to make this secure for install. The tape on back of door bell items Will Not hold up.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeanie",
      "helpful_votes": 0,
      "publication_date": 20200625
    },
    {
      "title": "Great Product Except for Mounting Screws",
      "text": "The included screws for mounting the buttons must be made of aluminum or tin or something. First, I bent one trying to drive it with a drill. Then, I switched to a screwdriver, and by the time I had driven the next one all the way in, the head was completely stripped. Luckily, for mounting the second button, I had some screws laying around that were a good fit, and I used those. I recommend supplying your own screws.",
      "rating": 4.0,
      "verified": true,
      "author": "Greg",
      "helpful_votes": 0,
      "publication_date": 20191214
    },
    {
      "title": "Perfect for What I Needed.",
      "text": "I set up this unit for a relative to use as a HELP/ASSISTANCE chime when in their bedroom or bathroom. Chime/Tone units setup in living room and masterbedroom while button/switches are placed in relatives bedside and bathroom counter if they need to signal someone for help. Works great throughout the house and through walls and closed doors. Plenty loud on highest setting and what seems like an endless amount of ringtones/songs to choose from to distinguish from normal doorbell and cellphones.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel",
      "helpful_votes": 0,
      "publication_date": 20190321
    },
    {
      "title": "EASY INSTALLATION..",
      "text": "Simple installation, very versatile unit. I work in my garage constantly, where I installed a second unit. I like the ease of moving a inside unit where ever it is needed, house, basement, garage or shed, you will always know if someone rings u you our doorbell... PLUS between the several different tones, or melodies you should have no problem finding the one that fits your needs...",
      "rating": 5.0,
      "verified": true,
      "author": "Norm",
      "helpful_votes": 0,
      "publication_date": 20200407
    },
    {
      "title": "Excellent so far",
      "text": "I have 2 receivers and 3 buttons (duplex apt) and the units are working flawlessly so far. Love that you can input which chime to play for each button letting you know which door to go to. 52 different chimes and volume level can be adjusted to a loud level for the hearing impaired. Bought a doorbell set from HD and they failed when Ohio cold weather set in but these work in cold. Buttons install using screws or that amazing 3m double sided tape that really, really sticks. Receivers just plug into an outlet. Good purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Bob",
      "helpful_votes": 0,
      "publication_date": 20170322
    },
    {
      "title": "Easy to install with a nice clear tone.",
      "text": "This item is very easy to install and comes with a nice variety of tones. I chose the normal ding-dong tone. I found the controls easy to use. You do need to pay attention as you scroll thru the available ring tones, but it is easy to select the one you want. The volume is easy to adjust. Both the button and the ringer have lights that illuminate during use. I can easily recommend this unit and may buy another in the future.",
      "rating": 5.0,
      "verified": true,
      "author": "P. Miller",
      "helpful_votes": 0,
      "publication_date": 20181215
    },
    {
      "title": "I love mine and my mother loves hers",
      "text": "I've been using my wireless doorbell system from this company for over a year, now. It is reliable and economical. I bought this set for my elderly mother and she is exceptionally happy with the item. Strangely enough, her old doorbell transmitter from the mid-90's works with and activates these receivers; So we have one extra transmitter if the old one ever fails.",
      "rating": 5.0,
      "verified": true,
      "author": "Tx-Bill",
      "helpful_votes": 0,
      "publication_date": 20190601
    },
    {
      "title": "Worth the money",
      "text": "Easy to use. One stopped working after a month. Followed all troubleshooting. Contacted company. Still have not heard back. Still does not work.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190822
    },
    {
      "title": "Not waterproof.",
      "text": "Not waterproof at all. After having these doorbells installed for about 18 months I am looking for something new. These things start going off over and over when it rains. It's to the point where I have to unplug them until they dry completely. This makes them virtually useless outdoors. These should only be used indoors. And the range is iffy.",
      "rating": 2.0,
      "verified": true,
      "author": "Princess JB",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "Five star!! for the product and customer service.",
      "text": "I have installed one receiver inside 2nd floor and 2nd receiver at the back yard shed (about 150 feet away from the front door); after nine month both receivers stop sounding; so, called the customer service; went thru a few diagnostic check over the phone and concluded might be defected; I received the replacement receivers; setting the new receivers learn to the existing transmitter was easy, following the operating instructions; now both are sounding fine, one dingdoinging and the other dinging.",
      "rating": 5.0,
      "verified": true,
      "author": "Mariposa",
      "helpful_votes": 0,
      "publication_date": 20171230
    },
    {
      "title": "Going strong!",
      "text": "We've had our wireless doorbells for over a year, and they are doing very well. We haven't had to do a thing, regarding them. In fact, we have even forgotten about them; they just work! Plugged into our upstairs and main floor outlets, they are easily heard and able to be adjusted for volume and tones.",
      "rating": 5.0,
      "verified": true,
      "author": "moldynorthwester",
      "helpful_votes": 0,
      "publication_date": 20200310
    },
    {
      "title": "Easy to setup and install",
      "text": "Good product, allows you to have multiple receivers(chimes) hooked to multiple senders (door buttons) and each sound a different ring or chime. Description on Amazon indicates buttons are waterproof but instructions packed with product say otherwise, door button must be placed in a covered or sheltered spot or it will not work?",
      "rating": 4.0,
      "verified": true,
      "author": "Camera Man",
      "helpful_votes": 0,
      "publication_date": 20200903
    },
    {
      "title": "Just What I was looking for.",
      "text": "These football's were exactly what I was looking for and work great. The only reason for four stars is that it was not made clear that the outside button should be under cover and not weather proof. I hope the back door button survives, and I won't have to make another purchase at some point for the weather proof one. Also if you are using different chimes for different doors, make sure the units are not near each other while programming. It's easily fixed if you mess up like me!",
      "rating": 4.0,
      "verified": true,
      "author": "Marcie S.",
      "helpful_votes": 0,
      "publication_date": 20190504
    },
    {
      "title": "Works great",
      "text": "You need to have the receivers plugged in very close to the location of the transmitter to pair them. Having a slightly longer time would make things a lot easier. Especially when the transmitters are mounted semi permanently. I just installed a set of two transmitters and two receivers. I have bot looked in the receiver to find if there is an output available to trigger larger and louder sounds. Might have to hack in for that.",
      "rating": 5.0,
      "verified": true,
      "author": "VirginiaGuy",
      "helpful_votes": 0,
      "publication_date": 20180927
    },
    {
      "title": "Works as advertised",
      "text": "These units are replacing a Carlon unit I bought at Menards. That unit couldn't transmit 12 feet through 2 wood walls and the batteries in the transmitters only last a couple of months. I have both receivers set to go off with either button and both go off when I push the button at the front door and the back door. This unit works like it is supposed to. I think the 12 volt battery is why it works so well. I hope the battery lasts as long as people in other reviews says it does.",
      "rating": 5.0,
      "verified": true,
      "author": "Nadine",
      "helpful_votes": 0,
      "publication_date": 20180803
    },
    {
      "title": "A neat concept!",
      "text": "These are really cool! I was able to program them in a few minutes. They have several loudness levels and doorbell sound options. There is everything from a standard \"ding dong\" to melodies. They are more durable in person than the pictures show. They are really dense plastic and smooth and shiny. My only complaint is that if you unplug the sound unit it forgets which doorbell sound you picked and just goes back to the default ring. You then have to hit the sound choice button over and over to find the ringtone you picked. Other than that it is great!",
      "rating": 4.0,
      "verified": true,
      "author": "Grassshopper021",
      "helpful_votes": 0,
      "publication_date": 20170328
    },
    {
      "title": "Solid and expandable",
      "text": "We put one button on the front door, one on the back, and set them with different ringtones so we would know which door to go to. We ordered an extra receiver and put one upstairs, one downstairs, one in our attached garage. The range is good and the batteries have lasted 14 months so far. I came back to order a fourth receiver for the basement. My biggest problem is, the ringtones we picked are too similar to each other and we cannot seem to learn which is which. We should adjust one of them.",
      "rating": 5.0,
      "verified": true,
      "author": "Katherine",
      "helpful_votes": 0,
      "publication_date": 20180510
    },
    {
      "title": "Finally wireless doorbell that works",
      "text": "These are excellent, simple setup and works very well. You don't need to hold your tongue just right for it to actually ring like many other wireless doorbells which are absolute junk. These ring first and everytime with 50 different tones. I ordered the waterproof doorbell also just in case patio cover was insufficient to keep outside unit dry long term. Would buy again for sure, excellent product.",
      "rating": 5.0,
      "verified": true,
      "author": "Randy M",
      "helpful_votes": 0,
      "publication_date": 20180920
    },
    {
      "title": "Doorbell rings when no one’s at the door ringing the doorbell",
      "text": "So the receiver randomly constantly goes off when no one’s ringing the doorbell these are cheap and terrible I would not recommend easy to install but not worth the headache constantly having to run to the door to check if somebody’s there and nobody’s there every single day I’m returning now",
      "rating": 1.0,
      "verified": true,
      "author": "Kaaleb Terrell",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "So far, so good",
      "text": "I was disappointment that the doorbells are not water proof. Both my door are open to rain. I resolve this problem with my vacuum seal. Made a little bag to cover each one, the sealed it in. Put the sticky pad outside the bag. They have multiple chimes that you can match to one or both indoor units. I set mine so that both chimes ring with on doorbell, but the front and back door have different sounds.",
      "rating": 4.0,
      "verified": true,
      "author": "Jean Green",
      "helpful_votes": 0,
      "publication_date": 20181008
    },
    {
      "title": "Glad I got this!",
      "text": "The volume is loud enough that, turned all the way up, I can hear. Not loudly, but well enough. (I'm hard of hearing.) Unfortunately, I can't hear it while sleeping even though I put the second speaker within 6 inches of my bed. But that's my ears' fault, not the product's.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Kloss",
      "helpful_votes": 0,
      "publication_date": 20200310
    },
    {
      "title": "20 months later.",
      "text": "OK so it's been 20 months. Both bells have been kept under cover. The receiving units are kept inside plugged in and one of the receiving units has quit on me. I was hoping for a reset button or something but the things deader than a door nail. Not sure what kind of longevity I expected but I feel 20 months is a little short. We don't have kids constantly pushing on the bell making it ring so I'm disappointed. They worked great while they lasted and thankfully I have two receiving units so the bell is still working....just a little disappointed",
      "rating": 2.0,
      "verified": true,
      "author": "Paulsbud",
      "helpful_votes": 0,
      "publication_date": 20170515
    },
    {
      "title": "Works well.  Easy to setup.",
      "text": "Worked perfectly. For some reason, the wiring for the doorbell in our old house just doesn't work. We installed this as a quick fix until we have a chance to troubleshoot the other issue. I was able to install 1 unit a the back and another at the front of my 1500 sq ft house. The ringing sound is clear and loud enough to hear wherever we are in the house.",
      "rating": 5.0,
      "verified": true,
      "author": "ToraZiyal",
      "helpful_votes": 0,
      "publication_date": 20171204
    },
    {
      "title": "I would give it a 10 if I could",
      "text": "This doorbell works great. It was very easy to install and set up. I wanted to have 2 doorbells, one at each door and this came with 2. I also wanted to be able to set 2 different chimes and it was so easy to sink both doorbells together in one chime so now I have a chime upstairs and downstairs. If given the choice I would have given this 10.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard",
      "helpful_votes": 0,
      "publication_date": 20190503
    },
    {
      "title": "Simple to set up and works great",
      "text": "No wiring required and easy to set up following the simple instructions that came with the product. Volume can be set so even hearing impaired person like me can hear the sound, although softer rings can be chosen and volume reduced. Just plug the receivers into an electrical outlet, and attach transmitters (doorbell buttons) using either screws or tape adhesive included. I chose this set because I wanted buttons for two doors, and I wanted a receiver in two different areas of my house. I can't advise as to range because range required for my house is less than 100 feet, but they work perfectly for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan Dunn",
      "helpful_votes": 0,
      "publication_date": 20160416
    },
    {
      "title": "Perfect for our small office.",
      "text": "Perfect for our small warehouse/office space. We had another highly-rated wireless doorbell, but quickly realized we couldn't tell the front door from the back door. This system, which allows multiple remotes to be paired each with their own chime, is perfect. And the ability to put an annunciator in the front office and in the back is just what we needed. Heed the instructions to put the receiver 3' above the ground. We first had these installed in a lower outlet and were not getting good range. Moving it up to a counter-height outlet did the trick.",
      "rating": 5.0,
      "verified": true,
      "author": "Lee Dickinson",
      "helpful_votes": 0,
      "publication_date": 20171002
    },
    {
      "title": "Great wireless doorbell",
      "text": "I don't have a huge house and this works perfectly. Got the doorbell mounted outside next to the front door and two chimes inside, one upstairs, one downstairs. We hear it throughout our whole home. Pretty much exactly what I was looking for. (There are a bunch of fun sounds and tunes for the chime but in the end I just set them both to a basic doorbell sound.)",
      "rating": 5.0,
      "verified": true,
      "author": "E",
      "helpful_votes": 0,
      "publication_date": 20190603
    },
    {
      "title": "Needed for wide range of instances",
      "text": "The doorbells are heard throughout the house and was much needed for the detached garage. The different chimes and volumes makes it easy to customize to your individual needs. I am thoroughly pleased with the purchase and will look into other products from the company.",
      "rating": 5.0,
      "verified": true,
      "author": "faithlj",
      "helpful_votes": 0,
      "publication_date": 20200516
    },
    {
      "title": "This doorbell product is perfect for a large house",
      "text": "This is a wonderful product and did exactly what I needed. I have a home office way in the back of the house and, with this product, I was able to put a receiver in the front of the house as well as one in my office. Now I can hear the door bell when it rings even if I am in the backyard with the windows open. The doorbell itself is a great design with the oval button that lights up when you push it. My old door bell button was long and thin and often people would push it in the wrong place and it wouldn't ring. This is an excellent product and I highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "pennyj26",
      "helpful_votes": 0,
      "publication_date": 20160304
    },
    {
      "title": "Customer Service was responsive",
      "text": "I bought these this package, two doorbell pushbuttons, and two receivers. We have a door on the first floor and on the second floor where guests can ring the doorbell. We program them to ring two bells for the second floor and one deep bong! for the first floor. They worked perfectly for 2 years, then one of the receivers (bell loudspeakers) failed. I contacted the company and they sent out a new receiver which now works fine. I was disappointed that one of the units failed after 2 years, since one expects the doorbell to work indefinitely, at least 20 years. But the company was helpful and responded with a replacement.",
      "rating": 4.0,
      "verified": true,
      "author": "Michael E.",
      "helpful_votes": 0,
      "publication_date": 20200210
    },
    {
      "title": "Now like magic, I plugged in a reciever upstairs and ...",
      "text": "I have a small apt attached to my main house that had no doorbell. It was very frustrating because i could not hear if anyone came to that side of the house...Now like magic , I plugged in a reciever upstairs and one in the apt and it has been huge difference in knowing when packages arrive, company visits etc etc. I have two entrances and I never knew which entrance they came ito. Now i do. Love it. My neighbor down the street ordered a set also after seeing mine. She had the same problem. Two separate entrances. It also has 52 different ringtones, including songs. Even songs for Christmas. Fun right!?",
      "rating": 5.0,
      "verified": true,
      "author": "L.B.",
      "helpful_votes": 0,
      "publication_date": 20161009
    },
    {
      "title": "Ring tones, eh.",
      "text": "Liked the Product. Volume was good, soft to loud. Easy adjustments on volume and ringtones. Only one negative for me.. the Ringtones. Yes there are a lot, but the majority of them are old, old music. More usable Doorbell Rings and less music would make for more marketability in a wider range of the potential customer segments, it's a Doorbell, not a Phone or Radio! The outside button, installation not so easy on Stucco. Weather proof yet to be seen.",
      "rating": 4.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 0,
      "publication_date": 20200901
    },
    {
      "title": "Powerful ring and simple install",
      "text": "Not sure why I waited to long to install this but I set it up and had it paired and working in less than 5 minutes. I really like the variety of ring choices and the volume options go from fairly quiet to really loud which is good if you have a 2 story home.",
      "rating": 5.0,
      "verified": true,
      "author": "T Warren",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "She wanted it fixed for awhile",
      "text": "This was what was needed. The house we bought had an on again, off again front door bell, and not back door bell. The hardest part of the instillation was removing the old door bell. The ringers went up very easily and the two ringers were just perfect for close to the front and back of the house. My wife was displeased that it had taken me so long to decided to do the replacement. We played all the chimes and rings and ended up at the default which the ringers had to begin with. The only thing I can say to my wife is \"I'm sorry it took me so long to do this simple installation.\"",
      "rating": 5.0,
      "verified": true,
      "author": "JWJ",
      "helpful_votes": 0,
      "publication_date": 20160827
    },
    {
      "title": "Flexible, easy, light years ahead of the competition",
      "text": "I am impressed. We have a large house with entrances at both ends. Both entrances must ring multiple receivers so we can hear them anywhere in the house but with different ring tones for each door. This system handled the job flawlessly. I purchased another brand initially for slightly less money but it wasn't flexible enough to meet these requirements. For a few extra dollars this doorbell system is light years ahead of the competition. My only suggestion is, with 52 ring tones to choose from, it would be nice if you could move forward and backward through the list while sampling them rather than just forward.",
      "rating": 5.0,
      "verified": true,
      "author": "Father of 10 Daughters",
      "helpful_votes": 0,
      "publication_date": 20161119
    },
    {
      "title": "Easy to install, loud sound, looks good",
      "text": "My original doorbell was no longer ringing in the back of the house. I got this one with two buttons and two ringers, one at one end and one at the other or the house. And now i have a doorbell on the back door. I've only had it up about three months but everything is working fine. I couldn't be happier. Nice loud ring so I can hear it anywhere in the house.",
      "rating": 5.0,
      "verified": true,
      "author": "GJ Brauch",
      "helpful_votes": 0,
      "publication_date": 20200421
    },
    {
      "title": "Great product so far, as advertised!",
      "text": "After installation, which was exceptionally easy, it is working well. My struggle is the distance from the door bell to the outlet where the bell units plug in. But, so far it is working great, even in the extremely cold Montana winter. I will give it a five star when it reaches it's warranty end and is still working.",
      "rating": 4.0,
      "verified": true,
      "author": "campdirector406",
      "helpful_votes": 0,
      "publication_date": 20190305
    },
    {
      "title": "Not waterproof",
      "text": "I received this product and was very, pleased in the beginning. I live in a dryer climate and just got our first major rain yesterday. The doorbell would not quit ringing. I had to unplug it. I plugged it in an hour later, it was quiet, but then it woke me up in the middle of the night ringing non stop again. I am disappointed because it plainly says it is waterproof, but yet with the first rain it quits working. And, my cut off day to return was Aug. 20.",
      "rating": 1.0,
      "verified": true,
      "author": "KLS",
      "helpful_votes": 0,
      "publication_date": 20200903
    },
    {
      "title": ".Value and feature laden Doorbell",
      "text": "This is an excellent product at a very reasonable price. It was easy to set up and install. The biggest feature, separate chimes for each doorbell, allowed me to place a transmitter at the front and back door with a different tone for each. Durable but not weather proof. The rear door unit isn’t protected from the weather and is holding up well. Follow the installation instructions to insure the transmitter’s survival. AC powered.”",
      "rating": 5.0,
      "verified": true,
      "author": "H.E. TyreeTop Contributor: Photography",
      "helpful_votes": 0,
      "publication_date": 20180101
    },
    {
      "title": "I'm very pleased with the quality but I will say this",
      "text": "This was bought as a gift. This order arrived on time. I'm very pleased with the quality but I will say this... when the system was installed it was installed with both receivers and 1 button (one receiver plugged in towards the front of the house, one towards the back). When the button is pressed the receivers would ring out of sync. I believe that may be because depending on where the receiver is plugged in the house it will ring when it receives the signal from the wireless button. Perhaps the further away the receiver, the further away the signal has to travel, resulting in that minor delay. Still a great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Micaarde",
      "helpful_votes": 0,
      "publication_date": 20160115
    },
    {
      "title": "Great for older ears!",
      "text": "Mom was unable to hear the doorbell throughout her house. Had been missing visitors since she could not hear them knocking or the single traditional doorbell on the hallway. Easily installed with an additional receiver and now she can hear the system throughout the entire house. She was very impressed and is very happy with this setup.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Anderson",
      "helpful_votes": 0,
      "publication_date": 20190907
    },
    {
      "title": "I love this doorbell",
      "text": "I love this doorbell! My wired doorbell button had a broken wire, and instead of fishing a new wire through brick, we decided to purchase a wireless unit. This unit has several 'real' bell tones, which was important to me, not just 'midi' music (yuk). It has over 50 alerts, so getting through them all was a bit of a pain. But, once I decided on a tone for each door, set up was easy. I have about 1500 sq ft, in a tri-level house with a basement. I can hear it well with two bells plugged in on two different floors throughout the house.",
      "rating": 5.0,
      "verified": true,
      "author": "Jillian",
      "helpful_votes": 0,
      "publication_date": 20170811
    },
    {
      "title": "good system but needs different sound options",
      "text": "i appreciate the add-on technology of the system. the sound levels are good such that i don't have the volume at it's highest and the unit can be heard from downstairs to upstairs in a back room with the door closed. my only issue is that most of the ring tones are songs, which i don't like. plus, they're long. there are only less than a handful of regular doorbell type sounds. so, while they advertise a lot of variety, if you don't want a song ring tone for your doorbell, the selection is actually quite limited.",
      "rating": 4.0,
      "verified": true,
      "author": "ajtp",
      "helpful_votes": 0,
      "publication_date": 20160401
    },
    {
      "title": "is easy to install and the ability to recognize from which ...",
      "text": "All of the product information published by the seller is absolutely correct. This system works flawlessly, is easy to install and the ability to recognize from which door the visitor is pressing the button confirms its great value. This could also be used as an alerting device within the home ( for example, someone who has a medical condition could keep the transmitter at hand and use it when help is required from a person elsewhere in the house ). To recap, there is a choice of 56 different chimes and tunes, 4 volume settings, and the pairing and installation process take a matter of seconds.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20161204
    },
    {
      "title": "Awesome product",
      "text": "Easy to install, took minutes (The video helped). Completely wireless and portable too (receivers can be placed anywhere in the house -- connected to an electrical outlet). i have 2 of these. One for the first floor and one for the basement. Both the transmitters are connected to both the receivers with a distinct sound so I know who's ringing from where. Dont have to wire anything and that's a huge advantage",
      "rating": 5.0,
      "verified": true,
      "author": "Satish",
      "helpful_votes": 3,
      "publication_date": 20160125
    },
    {
      "title": "... so we no if its upstairs or down stairs easily installed this is a must if your house is ...",
      "text": "This is the one to buy installed on a ranch house ringer was put in the middle of the house and can hear everywhere in the house a seperate ringer was put in the basement with a programmed chime so we no if its upstairs or down stairs easily installed this is a must if your house is not wired for a doorbell. Thanks to amazon and starpoint for having reviews that if you took a chance this one had the reviews to back it up.Now we will see how long the componets last but for right now this is an excellent product",
      "rating": 5.0,
      "verified": true,
      "author": "tamoss",
      "helpful_votes": 0,
      "publication_date": 20171126
    },
    {
      "title": "Be fully aware that the receivers do not have the option of battery power. They are plug-in only.",
      "text": "I love it!! The product came quickly and in perfect condition. As promised, It was an easy and fast installation. Setting the desired ringtones for each transmitter(doorbell) and receiver(speaker) was so simple my 9yr old could do it. The only reason they had to have more than one page for an instruction booklet was so that they could have different language translations! I love that not only can you set different tones to different doorbells(front door, back door), but you can also set different tones to different speakers(upstairs, downstairs)! The only hard part about this whole process is choosing and agreeing on which of the 52 ringtones you want to use where.",
      "rating": 5.0,
      "verified": true,
      "author": "Joseph D Weaver",
      "helpful_votes": 0,
      "publication_date": 20171218
    },
    {
      "title": "It was easy to match the ringer to the transmitter/button",
      "text": "Bought this a few weeks ago and finally got time to install today... It was easy to match the ringer to the transmitter/button... Seems to be well made and easy to set up... The seller sent a link to a youtube video concerning the install... The install was easy with the enclosed instructions and if there was any questions the video would help... I think I'm going to try the matching motion detector for the garage... Hopefully it will last as previous owners and users have noted...Would recommend...",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin Taylor",
      "helpful_votes": 0,
      "publication_date": 20160528
    },
    {
      "title": "Love it for our 6000+ sf office building",
      "text": "We have a bunch of these in our 6000 sf+ warehouse. They work great. We have a lot of machinery running and so I bought a bunch for the office area and the front and back of the warehouse and we can hear the door bell all throughout our building plus it has tons of different bell sounds. Make sure you connect one at a time though. The set up was a little complicated.",
      "rating": 5.0,
      "verified": true,
      "author": "Tracy M.",
      "helpful_votes": 0,
      "publication_date": 20170629
    },
    {
      "title": "UPDATE !! Five Stars",
      "text": "Easy to install in minutes, works great with all functions and loud. UPDATE: Both base units stopped working completely after 2 years, you don't receive too many guests so the bell is not used that often. After 2 years, both receivers are completely dark, noticed when people outside the door called my cell to get them in the house. the product quality is junk. prepare to replace within a year or 2 if you purchase it.",
      "rating": 2.0,
      "verified": true,
      "author": "BEN",
      "helpful_votes": 0,
      "publication_date": 20170323
    },
    {
      "title": "Exactly what I wanted, amazingly simple.",
      "text": "Exactly what I wanted, amazingly simple to deploy. I was impressed by the functional range, even with the receivers in the basement. I placed the home phone as a listener and I could trigger the bell 30-40ft beyond the front or side porch.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200707
    },
    {
      "title": "Easy to connect and sounds like a doorbell",
      "text": "I purchased for my 2 family home. Doorbells can be synced to work independently (like my setup one unit for each floor) or can be used together for one unit ( front and back door synced) Doorbells work great I stick with the basic doorbell sound and I like there are multiple volume options. Easy to install but if you have questions customer support is quick to respond by email. My only \"complaint\" is the logo on the button itself. It is not any bigger or different from the product photos. I just wish it was not so prominent.",
      "rating": 4.0,
      "verified": true,
      "author": "Michael H",
      "helpful_votes": 0,
      "publication_date": 20160123
    },
    {
      "title": "I located the chimes throughout the house so they can be heard easily no matter where I am",
      "text": "The product arrived a day earlier than anticipated. What was particularly impressive to me was that the company e-mailed a video showing how to set up the door bell and choose the specific sounds you desire. The system works so well that I ordered additional chimes directly from Sado Tech. I now have two door bell buttons and 4 chimes. I located the chimes throughout the house so they can be heard easily no matter where I am. The volume can be adjusted so that no matter where I am in the house the sound is easily heard without being overpowering. I am very pleased with the product as well as the service from Amazon and Sado Tech.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim",
      "helpful_votes": 0,
      "publication_date": 20151015
    },
    {
      "title": "GOOD SYSTEM, GREAT WARRANTY SUPPORT",
      "text": "Purchased in February 2017 for our business. The setup was easy and having two receivers with different sounds for different doors was very nice to have for our office and warehouse. Shipping Jeff approves. One of the receivers failed August 2017. I opened a ticket with SadoTech. They were quick to respond and sent out a new receiver without any issues. The warranty is real, if you ever need to use.",
      "rating": 4.0,
      "verified": true,
      "author": "StevieT",
      "helpful_votes": 0,
      "publication_date": 20170915
    },
    {
      "title": "Good doorbell. Great customer service. Need more stars. Very pleased with this.",
      "text": "Easy to install. Lots (maybe too many) rign tones. Works great. Survived Montana winters. -------------------------------------------------------------------------------------- After almost two years, I started getting ghost rings on one receiver. Customer service helped me. I am disabled so a bit difficult to work with. All is back to working great again. I wish I could do another review so I could give it five stars twice. Now if there was just some way to get FedEx to use this.",
      "rating": 5.0,
      "verified": true,
      "author": "Debbi T.",
      "helpful_votes": 0,
      "publication_date": 20170104
    },
    {
      "title": "The BEST Customer Support!",
      "text": "I ordered this double set for my Kindergarten classroom: as an attention getter and as “game show-type buzzers” for academic practices/reviews. The doorbell is super easy to set up, has great sound, tons of choices for chimes/songs, and is also very affordable. However, when I paired the receivers and transmitters they both worked simultaneously... which is not what I wanted. I emailed support and within a few minutes I received a response. When that didn’t work, the customer service rep had me connect via phone and quickly solved my problem. Now each transmitter signals its own receiver with its own distinct sound. Yay! I highly recommend this brand/company.",
      "rating": 5.0,
      "verified": true,
      "author": "Texas Kindergarten Teacher",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "Easy to install & lots of options",
      "text": "Yay!! We got a new doorbell without having to do any rewriting! We love all the options. We also love that we could put a button at the back gate and a ring ding dong thing in the back of our house. No more missing the doorbell!",
      "rating": 5.0,
      "verified": true,
      "author": "Mary-Allegra Findlay",
      "helpful_votes": 0,
      "publication_date": 20200717
    },
    {
      "title": "It works great and good tech support",
      "text": "I've got the starter set in last November 2016. It worked great until today (July 2017) one of the receiver died and no sound came from it :( I rated it 3 stars. Update 7/31 - I updated this review to 4 stars given Tech Support promptly sent me a replacement receiver after I contacted them about the broken receiver.",
      "rating": 4.0,
      "verified": true,
      "author": "Liem Tran",
      "helpful_votes": 0,
      "publication_date": 20170722
    },
    {
      "title": "Love these!",
      "text": "These wireless door bells are genius! Super easy to install, adjustable volume and numerous ring options. My only complaint ( as stated in a previous review) is that you have to go through every ring tone when selecting your tone. So when pairing that can be a pain. But other then that I love these! I bought a set of two and will be buying a third as a call button for our elderly mom who lives with us.",
      "rating": 5.0,
      "verified": true,
      "author": "Kaylynn",
      "helpful_votes": 0,
      "publication_date": 20180625
    },
    {
      "title": "They work as advertized",
      "text": "Delivered in a very timely manner, worked right out of the box. Directions were very clear, had them up an operational in just minutes. No wires, no drilling. Range was very good, far better then the previous set I had from another manufacturer. They came with multiple options to mount them, screws (included) or double sided 3M tape (the option I used). These are supposed to be expandable with more door units as well as motion sensors, but have not tried that yet.",
      "rating": 5.0,
      "verified": true,
      "author": "David  Ramsey",
      "helpful_votes": 0,
      "publication_date": 20181016
    },
    {
      "title": "Excellent wireless doorbell",
      "text": "I purchased one of these for a neighbor whose doorbell was on the fritz. I was so pleased with it that I decided to buy one for my own house to replace the hard-wired doorbell that I could never seem to hear. The doorbell is easy to set up. The receivers and transmitter are very attractive. The fact that the receivers simply plug into a household outlet allows me the flexibility to put them where I can hear them easily wherever I am in the house. I'm very pleased with the product.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Ward",
      "helpful_votes": 0,
      "publication_date": 20170125
    },
    {
      "title": "Perfect setup for 3 doors with 3 different chimes.",
      "text": "Perfect replacement for my doorbell. I have three doors that could be seen as a \"front door\" when I have guests, so I bought this and added on another transmitter to give me a button at each door. I bought an extra receiver as well so I could have a chime at both ends of the house as well as in the basement. Now, I can hear when somebody shows up regardless of which door they are at or where in the house I am, and I always know which door to answer.",
      "rating": 5.0,
      "verified": true,
      "author": "Alex Schnautz",
      "helpful_votes": 0,
      "publication_date": 20170517
    },
    {
      "title": "The large button on the remote is easy for him to push and is located next to ...",
      "text": "Product is as delivered. The \"music\" for the door bell rings is very elementary and digital, but it's just a doorbell, NOT a stereo system! Works as advertised. I am using it as an emergency notification for my elderly father. He lives upstairs and I am downstairs. The door bell lets him call me without having to come down the stairs and if he needs me in the middle of the night he can activate the door bell to get help. The large button on the remote is easy for him to push and is located next to his bed for convenience.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160131
    },
    {
      "title": "Very solid ..Not cheaply made.",
      "text": "Delivered as promised. On time and well packaged. Amazingly simple to install. Works better than others that cost more. Has a wide assortment of sounds. We love it and highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Rusty Cason",
      "helpful_votes": 0,
      "publication_date": 20191130
    },
    {
      "title": "Great doorbell!",
      "text": "We purchased this door bell for a neighbor whose hearing is failing. I would knock and knock, and leave his house not knowing if he could not hear me, or if he was ill, or not at home. I purchased this and it could not work better! After installing it, setting the tone, and volume, the first time I rang it, he came to the door with a big grin on his face and said, \"Came through loud and clear!\" I only wish I had thought of it sooner!",
      "rating": 5.0,
      "verified": true,
      "author": "Kim H.",
      "helpful_votes": 0,
      "publication_date": 20180519
    },
    {
      "title": "Sound quality exceeded my expectations",
      "text": "The units worked well and had adequate, if not extreme, maximum volume. Their tone quality was impressive for such small devices. I consider the ability to plug all three bell units (I bought an extra unit) into an outlet strip and program them together, then unplug them and move them where they are needed without their loosing their memories an essential feature, but this line seems to be the only one that features that along with expandability. Over-all, it's an excellent product.",
      "rating": 5.0,
      "verified": true,
      "author": "Harold McFarland",
      "helpful_votes": 0,
      "publication_date": 20170317
    },
    {
      "title": "\"I could hear the doorbell and know which door.\"",
      "text": "So far, very good. We installed our Starpoints less than a week ago [It is 9/23/2017] and therefore have not had a lot of time to test and try. If they perform well, we shall probably acquire more speakers. I have installed the water-resistant \"buttons\" \"out of the direct rain\" but not in \"totally dry.\" If moisture gets to them anytime soon, we may re-order the waterproof versions.",
      "rating": 5.0,
      "verified": true,
      "author": "Kenneth E. George",
      "helpful_votes": 0,
      "publication_date": 20170923
    },
    {
      "title": "Easy to Install",
      "text": "Just plug the receiver into a handy outlet, mount the button outside (battery incl) and it works. If you want to get creative you can program one of 52 sounds/songs into the receiver but the factory setting is great. Extra buttons can each have a different sound if you want.",
      "rating": 5.0,
      "verified": true,
      "author": "Al",
      "helpful_votes": 0,
      "publication_date": 20190704
    }
  ],
  "product_meta": {
    "title": "Wireless Doorbell by SadoTech - Waterproof Door Bells & Chimes Wireless Kit,1000-ft Range,52 Door Chimes, 4 Volume Levels with LED,Wireless Doorbells w/ 2 Receivers & 2 Buttons, Starpoint, Matte Black",
    "rating": 4.6,
    "feature_bullets": [
      "★SMART DOORBELL RING CHIME SYSTEM - Multiple door bell receivers can be configured to RING WITH DIFFERENT door chimes or ringtones to let you know which transmitter was triggered.",
      "★UNLIKE IMITATION door chimes for home THAT STOP WORKING after months or even days, the SadoTech Door Chime is the real deal. Featured on QVC, FOX, ABC, NBC & CBS News, our PATENTED DESIGN uses only the HIGHEST QUALITY microchips & electronics for LONG RANGE WIRELESS & even LONGER BATTERY LIFE. Avoid the disappointment & frustration of other doorbell chimes & enjoy the FLEXIBILITY our doorbell button creates. \"It's built well, and it has a nice minimalist style\" - Business Insider.",
      "★PAIRS & CONNECTS EASILY FOR quick, frustration-free installation anywhere in your home. WHILE OTHER doorbells wireless are DIFFICULT TO SET UP or DON’T WORK CONSISTENTLY, door bells by SadoTech extend OVER 1000FT of RANGE in open areas & are PROVEN TO WORK THROUGH DOORS & WALLS. Great for large homes, apartments, offices & warehouses. And with BATTERY LIFE of UP TO 3 YEARS, you’ll never miss a chime! Use as door chime for business when entering or classroom doorbell for teachers!",
      "★THIS WIRELESS DOORBELL KIT IS the perfect starter for any wireless door bell user. KIT CONTAINS: 2 wireless doorbell transmitters and 2 plug in smart doorbell receiver, double sided mounting tape, anchors, screws and A23 BATTERY INCLUDED. Sleek, modern LED INDICATOR lights illuminate both transmitter & receiver & can be set at 4 VOLUME SETTINGS, from low for naptime to high during a party. Our extensive COLOR SELECTION means you’ll find the right door bell push button to suit your style.",
      "★BUILD THE ULTIMATE SMART door bell system – With multiple wireless door bells you can CONFIGURE each door with A DIFFERENT CHIME or ringtone. KNOW EXACTLY WHICH DOOR your visitors are calling from. For homes or offices with multiple entry points, this is CONVENIENT & TIME-SAVING. You’ll soon wonder how you lived without it. And UNLIKE SOME OTHER doorbell wireless, this door bell by SadoTech is truly WATERPROOF & WEATHERPROOF to -4°F/140°F for a system that lasts for years to come.",
      "★OUR PATENT-PENDING SOUND CHIP holds the LARGEST SELECTION of classy, high-quality ding-dong chimes, NO “TINNY”, ANNOYING ringtones. With 52 TOTAL RINGTONES at 4 VOLUME LEVELS, you’ll feel good knowing our ring chime MEMORY CHIP STORES your chosen doorbell chime selections even when unplugged or turned off. LISTEN FOR YOURSELF! Just SCROLL DOWN to the Technical Specs section below & click the Specification Sheet link to DOWNLOAD the PDF. Open the PDF and play all ringtones.",
      "★AT SADOTECH, OUR GOAL IS to provide INNOVATIVE, HIGH-QUALITY PRODUCTS at a price everyone can afford. QUALITY IS KEY! We love that our products bring ADDED SECURITY, CONTROL & peace of mind to you, our customers. NEED SPARE BATTERIES, extra add-on buttons, receivers, sensors or a CUSTOMIZED DOORBELL button? Visit our store ➔ www.amazon.com/sadotech. If, for any reason, you don’t love your wireless doorbells by SadoTech, reach out and WE WILL MAKE IT RIGHT."
    ],
    "specifications": {
      "Manufacturer": "SadoTech",
      "Part Number": "ST-FX-XCBASE-MBL",
      "Item Weight": "11.2 ounces",
      "Product Dimensions": "7 x 3.8 x 3.1 inches",
      "Is Discontinued By Manufacturer": "No",
      "Size": "1 Base Set",
      "Color": "Black",
      "Finish": "Matte Black",
      "Material": "ABS Plastic",
      "Item Package Quantity": "1",
      "Coverage": "600 feet",
      "Special Features": "SadoTech",
      "Included Components": "SadoTech",
      "Batteries Included?": "Yes",
      "Batteries Required?": "Yes",
      "Battery Cell Type": "Alkaline",
      "Description Pile": "A23 12V",
      "ASIN": "B018UYS8AG",
      "Customer Reviews": "4.6 out of 5 stars2,233 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#19,228 in Tools & Home Improvement",
      "Date First Available": "December 2, 2015"
    },
    "categories": [
      "Tools & Home Improvement",
      "Kits",
      "Door Chimes & Bells",
      "Electrical"
    ],
    "price": 34.99
  }
}