{
  "website_summaries": [
    {
      "verdict": "A gorgeous tub that will compliment just about any bathroom style, from vintage to contemporary.",
      "pros": [
        "Features oil-rubbed bronze feet that give it an elegant appearance",
        "Slipper design is attractive, and porcelain finish is durable and easy to clean"
      ],
      "cons": [
        "Although rare, tubs with ill-fitting feet have been reported"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "I love this tub!",
      "text": "Great deal on a cast iron tub that literally all visitors to my home comment on and instantly want, so I know it will be a great selling point someday. Great quality and beautiful chrome accents! Even the plumber and remodeling contractor wanted to know where I got it. This tub has made my master bath my favorite room in the house. We had a tight spot for our tub replacement and this tub barely fit. I'm 5'5\" and 125 lbs, and it's the perfect size for me to relax in. Anyone over 5'10\" & 165 lbs might prefer a longer/wider tub. BTW it is VERY heavy and needs 3-4 people to move for installation.",
      "rating": 5.0,
      "verified": true,
      "author": "Mazie",
      "helpful_votes": 9,
      "publication_date": 20180601
    },
    {
      "title": "Positives outweigh negative",
      "text": "I love this tub for the looks but hate how it doesn't drain all the water, you have to physically remove a larg amount of water that settles in the middle of the tub. One other positive that I didn't think of when I decided to buy a cast iron tub, you use less hot water and it stays the same temp the entire bath.",
      "rating": 4.0,
      "verified": true,
      "author": "Sherri Foote",
      "helpful_votes": 15,
      "publication_date": 20161008
    },
    {
      "title": "Great tub Great price!",
      "text": "My wife loves her new tub. Part of our master bath remodel. Easy to install if you have 3-4 strong friends to help get it in the bathroom. We used a piano dolly and still needed to remove two legs to get it through the door. Make sure you can get it in. It weighs over 300 lbs!",
      "rating": 5.0,
      "verified": true,
      "author": "Toyotamike",
      "helpful_votes": 2,
      "publication_date": 20200223
    },
    {
      "title": "Beautiful tub!",
      "text": "Beautiful tub !!! It was delivered in perfect condition. Very Heavy !! Draw back ~ Feet never fit snug to the tub, little disappointed with that. Buying from Amazon was a great experience !!",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly S Neese",
      "helpful_votes": 5,
      "publication_date": 20170927
    },
    {
      "title": "They still don't make good contact with the tub",
      "text": "The claw feet fit poorly. We used epoxy to hold_ them in place. They still don't make good contact with the tub. Called customer service, he told me out was normal for them to not fit well.",
      "rating": 1.0,
      "verified": true,
      "author": "john hicks",
      "helpful_votes": 10,
      "publication_date": 20180301
    },
    {
      "title": "Tub's too small",
      "text": "Was excited to receive our new tub. Looked beautiful once unpackaged. Was extremely disappointed in how narrow and cramped the tub felt. I'm only 5'5\" and can't stretch out to a comfortable feel. The measurements are very deceptive and the 42\" it shows on the diagram is only 35\" when I measure. Hope I can find somebody who'll buy this tub at a discount while I have to find a new tub.",
      "rating": 1.0,
      "verified": true,
      "author": "Lonna Yearwood",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "The tub has a nice finish. The feet are nice also",
      "text": "The tub has a nice finish. The feet are nice also. Very heavy solid construction. What I didn't like was the feet don't sit tight to the tub on the back end (opposite the drain end). The drain end feet fit perfect. Not the case with the opposite. Still looks ok just not as crisp of a seem.",
      "rating": 4.0,
      "verified": true,
      "author": "Craig",
      "helpful_votes": 7,
      "publication_date": 20170611
    },
    {
      "title": "buy it...if you dont play in the NBA",
      "text": "Love it...just not idea if you are over 6'3''. I'm 6'2''and its just good where I.can scoot down and warm unnder water... but its really dope and fly looking especially for the price...we searched for weeks and found this gem",
      "rating": 4.0,
      "verified": true,
      "author": "Lee",
      "helpful_votes": 11,
      "publication_date": 20150407
    },
    {
      "title": "Some imperfections",
      "text": "Tub has marks on it. Paint is missing in spots.",
      "rating": 2.0,
      "verified": true,
      "author": "fredrick peters",
      "helpful_votes": 0,
      "publication_date": 20200918
    },
    {
      "title": "This tub arrived on time and in perfect condition! It looks fantastic in our home and ...",
      "text": "This tub arrived on time and in perfect condition! It looks fantastic in our home and the price cannot be beat!",
      "rating": 5.0,
      "verified": true,
      "author": "27 Gal",
      "helpful_votes": 4,
      "publication_date": 20161001
    },
    {
      "title": "Quite Nice!",
      "text": "Awesome quality. Quick Delivery. I called and talked to the tub connection and their staff was great!",
      "rating": 5.0,
      "verified": true,
      "author": "Lauren E Merrill",
      "helpful_votes": 10,
      "publication_date": 20150209
    },
    {
      "title": "We are VERY happy with the quality and the look of this tub",
      "text": "My wife and I were waffling on cast iron vs acrylic. The weight was about 500lb vs 75 lb and we thought this might be an issue for a second floor installation. We are VERY happy with the quality and the look of this tub. It is more sturdy than we anticipated, no rough edges and the feet look great too.",
      "rating": 5.0,
      "verified": false,
      "author": "Glenn",
      "helpful_votes": 11,
      "publication_date": 20160209
    }
  ],
  "product_meta": {
    "title": "61\" Cast Iron Slipper Tub with 7\" Faucet hole Drillings & Oil Rubbed Bronze Feet-\"Chariton\"",
    "description": "Color:Oil Rubbed Bronze FeetThe \"Chariton\" provides you a superb bathing experience. Built from long lasting Cast Iron, the \"Chariton\" gives you a beautiful Porcelain interior to relax in with this Vintage Slipper freestanding tub design. Designing your bathroom to include a cast iron slipper clawfoot bathtub reveals both your taste for luxury and elegance in your bathroom design and furnishings. This 61\" cast iron tub is perfect for increasing the overall beauty of your luxury fashionable bathroom, offering you the most unique look and feel of a vintage claw foot tub. To complete the installation of your clawfoot bathtub, you will need a: faucet, supply lines, and a drain and overflow assembly. Save time searching for each individual plumbing fixture and purchase one of our “complete plumbing packages”. Using the links below, you can purchase our Chariton tub, along with all the plumbing fixtures you need to complete the installation. Everything you need, guaranteed compatible, all in one listing- delivered! Chariton tub with TTC463D complete plumbing package: https://www.amazon.com/dp/B075KRYLV6 Chariton tub with TTC684D complete plumbing package: https://www.amazon.com/dp/B075KQZ6XQ",
    "rating": 3.9,
    "feature_bullets": [
      "Slipper Design: 30\" x 61\"",
      "14 inches to overflow. 46 Gallons of Water Capacity",
      "Pure white inside and out",
      "Requires Deck (rim) mount faucet with 7\" spread. This tub can also be purchased as a package with all the plumbing you need to install. Links in the product description below",
      "Smooth, Easy to Clean Porcelain Interior"
    ],
    "specifications": {
      "Manufacturer": "The Tub Connection",
      "Part Number": "TC61STCIORB-7",
      "Item Weight": "300 pounds",
      "Product Dimensions": "61 x 30 x 29 inches",
      "Is Discontinued By Manufacturer": "No",
      "Color": "Oil Rubbed Bronze Feet",
      "Style": "Antique",
      "Finish": "Oil Rubbed",
      "Material": "Porcelain, Cast Iron",
      "Shape": "Oval",
      "Installation Method": "Freestanding",
      "Item Package Quantity": "1",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "ASIN": "B00LML761C",
      "Customer Reviews": "3.9 out of 5 stars19 ratings3.9 out of 5 stars",
      "Best Sellers Rank": "#337,188 in Tools & Home Improvement",
      "Date First Available": "July 8, 2014"
    },
    "categories": [
      "Bathroom Fixtures",
      "Kitchen & Bath Fixtures",
      "Tools & Home Improvement",
      "Bathtubs",
      "Clawfoot Bathtubs"
    ],
    "price": 1199.0
  }
}