{
  "website_summaries": [
    {
      "verdict": "A unique set of handmade greeting cards that comes in a quality storage box.",
      "pros": [
        "Set of 25 cards includes a mix of blank and occasion-specific messages",
        "Comes with a storage box with divider tabs to keep everything in order",
        "Each card and envelope is individually wrapped for protection",
        "Lovely handmade designs with some embellishment"
      ],
      "cons": [
        "Envelopes are quite thin",
        "cards can be seen through the paper"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Super cheaply made",
      "text": "I have bought several brands of this style of hand-made card over the years. (These are Paper Magic Group.) I have never seen one so cheaply made. The embellishments were few and far between and look cheap. The paper is super cheap. The envelopes are thin. And lastly the cards are sealed in plastic sleeves that give no indication on what type of card is enclosed or what the card says on the inside. In order to use the box they come in and sort the cards by occasion as intended, you have to remove them from their protective sleeves. I won't buy again.",
      "rating": 1.0,
      "verified": true,
      "author": "M SHARP",
      "helpful_votes": 2,
      "publication_date": 20200108
    },
    {
      "title": "Cards to keep on hand",
      "text": "Like all the Paper Magic assortments, these cards are a bargain. I had previously purchased the assortment that comes in the box with the pink lid. Those cards have the inside verse or \"blank inside\" printed on the outer wrapper. This bunch does not, so you have to unwrap the card to see if there is a verse and if it's appropriate for the recipient. Naturally, some cards are nicer than others, but I think I will use most of them. The boxes are great for storage.",
      "rating": 4.0,
      "verified": true,
      "author": "Ginger",
      "helpful_votes": 3,
      "publication_date": 20161014
    },
    {
      "title": "My 3rd Order",
      "text": "A great way to keep an assortment of cards in your stash to celebrate & appreciate life with others! I have a large social circle and love these cards so much, this is my third order. The cards are well made (no faded off handmade stamps here) and fun. I love the variety and the embellishments. I have dipped into other card lines and continuously end up disappointed because they are not nearly as lively or just look half-hazzardly made. I will keep a mix of these offerings to have the perfect card for the occasion.",
      "rating": 5.0,
      "verified": true,
      "author": "In Phoenix",
      "helpful_votes": 5,
      "publication_date": 20170317
    },
    {
      "title": "envelopes are no good",
      "text": "The cards are beautiful but the envelopes are awful. The first thing was that the envelopes do not match the card size. Some do, but there are a number of square-shaped cards in the box and the envelopes are too big and rectangle in shape. See picture. The second thing is that the glue from the envelope bled through and glued the front of the envelope to the back. I have used one care (or wanted to) and found the envelope tore when I tried to insert the card then pulled another envelope and the same thing happened. So disappointed. because I did not open the box until now and my window of returns is expired.",
      "rating": 1.0,
      "verified": true,
      "author": "Anthony Baker",
      "helpful_votes": 0,
      "publication_date": 20200801
    },
    {
      "title": "Amazing Value",
      "text": "Good variety, EXCELLENT VALUE for the price. The cards are high-quality, attractive cards and would probably cost around 5 bucks each at the store. The box is also sturdy and pretty and can be re-used. Happy Birthday: 12 Congratulations: 3 (2 baby and one wedding) Care and Concern: 4 Friendship/Thank You/Blank: 6 I have no complaints, and I highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Irene",
      "helpful_votes": 69,
      "publication_date": 20130324
    },
    {
      "title": "Great cards!",
      "text": "So glad Amazon carries these boxed handmade cards, 'cause where I was getting them discontinued them! My family always tells me they love getting my cards, especially the kids. The 3-D look & feel makes them very special, and the price per card is even less than I would pay in a store for a non-handmade 3-D card. And, if I have extras of certain types (like new baby), they sell really well at yard sales!",
      "rating": 5.0,
      "verified": true,
      "author": "Ann Marie Morris",
      "helpful_votes": 2,
      "publication_date": 20170305
    },
    {
      "title": "Just ok",
      "text": "I typically purchase the ones from Costco that are similar to these however they have been out of stock. I thought these were exactly the same when I ordered. They are not. Not as good quality and you need to completely take the care out of the packaging in order to see what it says inside. That is rather annoying to be honest. It is nice to have a set of cards on hand at all time but I will definitely only be purchasing the ones from Costco from now on. The quality is just so, so much better.",
      "rating": 3.0,
      "verified": true,
      "author": "S. OGrady",
      "helpful_votes": 3,
      "publication_date": 20160309
    },
    {
      "title": "Cute set, nice variety",
      "text": "This is a very cute collection of cards! They are well made and there is a nice variety! Ive used about 1/3 of them so far and have gotten compliments on how cute/pretty they are. Each card and envelope are individually wrapped to keep them nice and neat. The box is a very sturdy cardboard and not at all flimsy. I really wish that i was able to read the cards before I opened them. Its a little hard to decide which one I'd like to use without seeing the message first. Other than that I like this set and would purchase it again.",
      "rating": 4.0,
      "verified": true,
      "author": "Mommy of 4",
      "helpful_votes": 0,
      "publication_date": 20161015
    },
    {
      "title": "Great buy for all homes!",
      "text": "These cards are amazing! Not only are they a great price, the quality of the cards is REMARKABLE. They are Hallmark quality, for .99 cents store prices! Each card comes individually wrapped, which makes it great for storage and organization. The box the cards come in is solid and shouldn't get crushed during shipment or storage. It also comes with nice categorical dividers for different types of cards. This product is great to have lying around your home, as it has cards for most occasions.",
      "rating": 5.0,
      "verified": true,
      "author": "cteras",
      "helpful_votes": 0,
      "publication_date": 20180207
    },
    {
      "title": "Box-o-Cards",
      "text": "Decent selection of cards :) Wish there was less bday cards and some more variety but we were still very happy with the purchase and do not have any regrets. They have cool designs, pictures, and envelopes (see the pictures attached to amazon-think you can zoom in on all of them). We have purchased a couple of these boxes because if you use 3-4 of them it is the same price as buying individual cards from the store.",
      "rating": 5.0,
      "verified": true,
      "author": "Ringydwm",
      "helpful_votes": 3,
      "publication_date": 20141229
    },
    {
      "title": "Three fancy ones, forget the rest, dollar store type.. Kept 25% only.",
      "text": "I was sadly disappointed in the box that arrived today. I found two smashing cards, both cars, another pretty one and two halfway decent ones that I will use . No interest in the rest. Too many birthday cards. I like the fact thar there were some blank ones. I was expecting a box like the one I had a few years ago with creative cards. I had bought another box of those.",
      "rating": 2.0,
      "verified": true,
      "author": "Advocate",
      "helpful_votes": 0,
      "publication_date": 20180806
    },
    {
      "title": "Less (verbiage) would be more (value)",
      "text": "I have ordered these before and been pleased but this time I selected the orange striped box and was disappointed. The cards are cute and unique but in my opinion not so great on the inside where all messages feel directed at five year olds. Too cutesie. Happy Birthday! would be great. \"make a wish too! Today is to celebrate you!\" makes these hard to give especially as a boss trying to have cards for my team. Really corny stuff. Less would be more.",
      "rating": 3.0,
      "verified": true,
      "author": "LE P. Seattle",
      "helpful_votes": 0,
      "publication_date": 20161217
    },
    {
      "title": "These Handmade cards are cute. They are mostly Birthday ...",
      "text": "These Handmade cards are cute. They are mostly Birthday and Get Well. A couple for Baby, Anniversary, and Congratulations. They are of quality paper and color. There are dividers labeled for two categories. The Birthday and Get Well each have their own divider. The lid flips up, with also a card attached to the back, that pictures each card and its wording.",
      "rating": 5.0,
      "verified": true,
      "author": "t-t",
      "helpful_votes": 3,
      "publication_date": 20150313
    },
    {
      "title": "Paper Magic Handmade All Occasion Greeting Cards",
      "text": "I bought these cards about a year ago and was surprised at the quality of the cards based on the price I paid for them. The cards are beautiful and each card is individually wrapped for protection. There are also dividers included, so it's easy to select the type of card you want by category: birthday, get well, sympathy etc... It has been so convenient to have these cards at my fingertips and not have to run to the store at the last minute to buy a card that I've forgotten to buy.I would definitely recommend buying these cards . They would also be great little gifts.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20151112
    },
    {
      "title": "Great value",
      "text": "Received these today and they are great. Plenty of birthday cards! They are neatly arranged with dividers on the inside and individually wrapped. There is also a reference sheet on the back of box that shows what each card says on the inside. Most of the envelopes are decorated which gives it a nice touch. Couple reasons for 4 star rather than 5 star - some of the envelopes are much to big for the smaller cards. Makes the cards look kinda cheap imho. There is only one wedding card, one congrats card and one new baby card. Overall though I will use all of them and save money! Very pleased, would purchase again.",
      "rating": 4.0,
      "verified": true,
      "author": "melhels",
      "helpful_votes": 0,
      "publication_date": 20150524
    },
    {
      "title": "very nice, a gift for my 90+ mom who loves to mail cards to friends.",
      "text": "These are great! I bought them for my 90+ mom who loves to send cards, but has a hard to getting to a store to pick out and buy. I also included stamps. My mom loves to send cards to friends and family! We all love receiving them! This storage box is precious and is something my mom will love using also. She already has her organization for storing cards, but I noticed she was running out of cards. This will be so helpful for her and the cards are really nice---all cards wrapped individually too!",
      "rating": 4.0,
      "verified": true,
      "author": "Peggy Cochran",
      "helpful_votes": 0,
      "publication_date": 20170722
    },
    {
      "title": "Nice cards",
      "text": "I like to have a box of these type of cards around. It's nice to always have a greeting card because I'm not the best at remembering birthdays and special occasions. I wish more were handmade as most are printed (still nice though). Overall I'm happy with my purchase and will buy this brand again when I run out.",
      "rating": 4.0,
      "verified": true,
      "author": "Sarah A.",
      "helpful_votes": 0,
      "publication_date": 20171007
    },
    {
      "title": "Overall a great deal! There were a couple of cards that ...",
      "text": "Overall a great deal! There were a couple of cards that were a little odd and we probably won't use, but we are getting great use out of the collection. The only odd thing is that the envelopes aren't all the exact size of the cards (for example, smaller square cards still go in large rectangular envelopes). The box is great to store all of our other spare greeting cards.",
      "rating": 4.0,
      "verified": true,
      "author": "Reve",
      "helpful_votes": 3,
      "publication_date": 20160622
    },
    {
      "title": "great collection at a great price",
      "text": "A pretty great collection. The cards all seem sturdy and good quality, and there's a great selection. I like that there are several blank cards included too, to use for specific occasions. I've used several of the blank cards for Mother's Day greetings. I bought the orange collection this time; I plan on buying the other collections when I need more cards. Very affordable and charming options for cards.",
      "rating": 4.0,
      "verified": true,
      "author": "Tawn",
      "helpful_votes": 0,
      "publication_date": 20170516
    },
    {
      "title": "Best $17 I've ever spent",
      "text": "Best $17 I've ever spent. The quality of these cards are outstanding! I hate paying outrageous prices for greeting cards and having to shop for them for that matter. This box of cards makes picking out cards fun! Some of the cards in this box would cost $4-6 in the store.",
      "rating": 5.0,
      "verified": true,
      "author": "Hlaw2016",
      "helpful_votes": 5,
      "publication_date": 20161012
    },
    {
      "title": "Great Purchase!",
      "text": "I am VERY impressed with the quality of these cards for the price. The cards in this box would likely cost anywhere from $3-$5 in a store. We have a lot of birthdays and anniversaries over the summer and cards are just so expensive. This was a great decision to save $ but still be able to give nice, quality cards. I will DEFINITELY be buying from Paper Magic again.",
      "rating": 5.0,
      "verified": true,
      "author": "Carrie",
      "helpful_votes": 0,
      "publication_date": 20150609
    },
    {
      "title": "Excellent value and good variety",
      "text": "Excellent value and good variety. I wish there were fewer new baby cards [not a thing I am using very often at my current life stage!] but the designs are just beautiful. Box is sturdy and comes with dividers for easy card selection. Exactly as pictured, and each card is truly special looking. Definitely a steal at this price!",
      "rating": 5.0,
      "verified": true,
      "author": "Catherine C",
      "helpful_votes": 0,
      "publication_date": 20160601
    },
    {
      "title": "Just what I was looking for.",
      "text": "It is a decent sized, paper based box with 3 dividers. Each card is wrapped in plastic and I was impressed at the quality of them. They were pre-sorted into their respective dividers and personally I think it's easy to figure out what occasion each card is for. The product is just as described and arrived intact.",
      "rating": 5.0,
      "verified": true,
      "author": "aowam",
      "helpful_votes": 0,
      "publication_date": 20170820
    },
    {
      "title": "Great for everyday ocassions",
      "text": "These cards are great! With a newborn and toddler at home it's really hard to get to the store for every occasion to buy a card. These cards are wonderful quality and have unique little touches to them such as rhinestones or other added things. I would highly recommend these for everyday occasions.",
      "rating": 5.0,
      "verified": true,
      "author": "Sassy homemaker",
      "helpful_votes": 3,
      "publication_date": 20160702
    },
    {
      "title": "Pleasantly Surprised",
      "text": "I was doubtful going into the purchase of these cards, but I was so sick of running out to the store every few days to buy another card. I was pleasantly surprised by the quality and range of cards available in this box set. I've purchased two since the initial one and love ALL of them.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Pitts",
      "helpful_votes": 17,
      "publication_date": 20130501
    },
    {
      "title": "Nice cards, wish there were more birthday cards",
      "text": "These greeting cards are great quality with a variety of occasions. I was disappointed that there weren't more birthday cards as most boxes of cards I purchase have more birthday cards than other categories because they are used more often. So I of course ran out of those very quickly.",
      "rating": 4.0,
      "verified": true,
      "author": "AmazonAddict",
      "helpful_votes": 0,
      "publication_date": 20160921
    },
    {
      "title": "Big assortment.",
      "text": "I love these cards. It’s so nice to have a card handy when you need one. They are all beautiful and a large assortment.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda Burch",
      "helpful_votes": 0,
      "publication_date": 20180308
    },
    {
      "title": "Amazing selection",
      "text": "These are actually high quality cards. There are 3D cards and cards with unique designs. I thought they would be cheap, poor quality, boring cards. They are far from that! I love the fact that it comes with dividers that separate the different type of cards. I highly recommend these!",
      "rating": 5.0,
      "verified": true,
      "author": "shopaholic",
      "helpful_votes": 0,
      "publication_date": 20170108
    },
    {
      "title": "Comparison to Burgoyne",
      "text": "Fun variety of cards. I have purchased Burgoyne cards before which charges more, however Burgoyne adds in a protective sheet for mailing and also shows the inside message on a back cover, so you don't have to pull out each card from its protector, just to see the message. So Paper Magic is less expensive, but doesn't include a couple of extra perks.",
      "rating": 5.0,
      "verified": true,
      "author": "lani girl*",
      "helpful_votes": 0,
      "publication_date": 20160318
    },
    {
      "title": "Well made and convenient!",
      "text": "These are super fun greeting cards. Very well made. While they are a little generic with the verbiage, they are priced well and the convenience of having a variety of cards on hand is so nice. I keep them at the office so I can send out greetings as I need them and one box at home too. . . great product at a great price!",
      "rating": 5.0,
      "verified": true,
      "author": "Dianne Gaffney",
      "helpful_votes": 3,
      "publication_date": 20141125
    },
    {
      "title": "Nice quality cards with plenty of selections!",
      "text": "I use to purchase these types of hand-made cards from a club warehouse but they didn't have them in stock when I needed them so I ended up buying these. The quality is not as good as the previous brand but the overall selection was fine and the quality was OK. The price was also a factor so considering 25 cards for the price purchased on Amazon, it is a good deal. Good variety of selections for every occasion which is important in bulk cards.",
      "rating": 4.0,
      "verified": true,
      "author": "ichiban3",
      "helpful_votes": 0,
      "publication_date": 20150701
    },
    {
      "title": "Great Cards",
      "text": "I really like the quality of these cards. They are really nice and a wonderful selection. I purchased one a while ago and believe me you will use these cards. The nicest part is I don,t need to go shopping for cards every time I need one. The convince of having these has been awesome for me. You will find how much you will save by buying these. As time goes by I can,t believe how many that I use every year. Fast shipping and great packaging. Thank you Amazon and thank you seller.",
      "rating": 5.0,
      "verified": true,
      "author": "BON-JOVI  UTAH",
      "helpful_votes": 0,
      "publication_date": 20131003
    },
    {
      "title": "Not a handmade card",
      "text": "I ordered these because the discription states handmade. So, I expected something that looked handmade. Crafty. Nope. Look like a generic card.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200520
    },
    {
      "title": "Great to have on hand",
      "text": "Box of assorted cards and coordinated envelopes, Each one lovely, and now while under \"Stay At Home\" rules, it is the best to have ready, since running out for a card each time needed would not be doable now. Regardless of being at home or not would buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Senortap",
      "helpful_votes": 0,
      "publication_date": 20200525
    },
    {
      "title": "Very nice detailed card set",
      "text": "I used to buy these sets at Costco but I haven't seen them there for a while so I thought I would search on amazon and I found this. It's the exact same ones I used to buy with awesome handmade cards with great detail and embellishments. They aren't just flat cards. Super cute and a variety for all events. I love having these on hand.",
      "rating": 5.0,
      "verified": true,
      "author": "Ken Remijn",
      "helpful_votes": 2,
      "publication_date": 20160707
    },
    {
      "title": "NO GET WELL OR SYMPATHY CARDS",
      "text": "These cards are very nice quality, but there are NO Get Well or Sympathy Cards as advertised on this site. They are very pretty, but not much variety in occasions.",
      "rating": 3.0,
      "verified": true,
      "author": "Lisa J. Rief",
      "helpful_votes": 0,
      "publication_date": 20180119
    },
    {
      "title": "Nice variety, expensive looking, and not overly wordy, and love the file box they come in.",
      "text": "Beyond my expectations. The box is beautiful in its own right, and each card is wrapped in plastic to keep it new. The cards are also indexed so I can easily find what I need. Best of all, the cards are varied, expensive looking, and not overly wordy, so I can customize the sentiments. Really happy with this purchase",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs. Johnson",
      "helpful_votes": 0,
      "publication_date": 20150214
    },
    {
      "title": "Nice selection for value",
      "text": "Bought as a gift for 90yo aunt and was well worth it. She loved the convenience and divider sections and easy to refill.",
      "rating": 5.0,
      "verified": true,
      "author": "victor jordan",
      "helpful_votes": 0,
      "publication_date": 20200430
    },
    {
      "title": "The cards were average",
      "text": "The cards are ok. They would be comparable to those found at the Family Dollar. I thought there would be more \"hand crafted\" cards but there weren't. Still a good deal for the price when compared to card prices in stores. And its invaluable to have cards for all occasions on hand for a surprise reminder of an event or a last minute get together.",
      "rating": 3.0,
      "verified": true,
      "author": "Benny",
      "helpful_votes": 0,
      "publication_date": 20160715
    },
    {
      "title": "Good selection.",
      "text": "I liked knowing I had a card for every occasion because I'm a last minute person. I could run to the box and pull out an appropriate card without having to wade through the stacks at the store. Good quality, some were not my style (nods to drinking on a card), but overall tasteful.",
      "rating": 4.0,
      "verified": true,
      "author": "Mommy Carter",
      "helpful_votes": 2,
      "publication_date": 20151014
    },
    {
      "title": "Excellent purchase. Beautiful cards. Highly recommend",
      "text": "Bought this set recently because I was tired of paying $5 for cards now a days. What I received totally surpassed my expectations. They are BEAUTIFUL! Handmade and organized into a nice box with labels of what is what. Love.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristine",
      "helpful_votes": 0,
      "publication_date": 20161013
    },
    {
      "title": "Very Unique Cards!!",
      "text": "Very cute cards. Also a nice reusable box with dividers, very well made. Each card is very special, uniquely made. I especially like they give you a good amount of non-specific cards, so you have a good choice of cards that are truly for any occasion. Will purchase again. Just be aware, they take nearly two months to get, I didn't pay attention to that when I ordered, now I can plan ahead enough to not be waiting so long for them.",
      "rating": 5.0,
      "verified": true,
      "author": "Debi S.",
      "helpful_votes": 0,
      "publication_date": 20140723
    },
    {
      "title": "A nice selection for all occasions",
      "text": "These cards are top quality, and the price is outstanding. A nice selection for all occasions, you won't be sorry if you purchase these. I'll be reordering for sure.",
      "rating": 5.0,
      "verified": true,
      "author": "Garden Girl",
      "helpful_votes": 0,
      "publication_date": 20171017
    },
    {
      "title": "Few handmade cards",
      "text": "My mother used to purchase this product from Costco. Seems like the paper material got cheaper through the years. Overall still a good product just expected more handmade cards.",
      "rating": 3.0,
      "verified": true,
      "author": "R8chelle",
      "helpful_votes": 0,
      "publication_date": 20180822
    },
    {
      "title": "... for years now and the quality and variety were excellent. I see a downward trend in these cards",
      "text": "I've been buyer Paper Magic cards for years now and the quality and variety were excellent. I see a downward trend in these cards. Just not as nice, not as fancy. Disappointed.",
      "rating": 3.0,
      "verified": true,
      "author": "Delaine",
      "helpful_votes": 2,
      "publication_date": 20161115
    },
    {
      "title": "Love this product",
      "text": "I always seem to have to stop at the store to get a card before going to a party, which means I'm always rushing. After seeing one of my co-workers with a greeting card box (we needed a card in a pinch), I knew I had to find my own. I love this set because of the variety of cards. It also comes with an index that lets you know what each card says so you don't have to take it out of the wrapping to look inside. Plus the box is really nice. Highly recommend for anyone. Also makes a great gift.",
      "rating": 5.0,
      "verified": true,
      "author": "Jheneya",
      "helpful_votes": 0,
      "publication_date": 20131230
    },
    {
      "title": "great buy",
      "text": "Great buy for those of you who go through a lot of cards because of all of the events and occasions you have to attend. Many of the designs are cute, only downside is some of the envelopes are bigger than the actual cards themselves. Other than that, this is definitely worth the money. I've already used at least 5 of the cards in the span of a few months. I hope to find a refill for it so I don't have to buy the box again.",
      "rating": 4.0,
      "verified": true,
      "author": "agnes s.",
      "helpful_votes": 2,
      "publication_date": 20141105
    },
    {
      "title": "Excellent for someone who is not able to leave the house",
      "text": "I purchased these for my mother-in-law who is elderly and not able to drive. One of her greatest pleasures is to be able to send greeting cards to stay in touch with loved ones. She loved these! They are quality cards and the packing is very nice. The variety of the cards is also great! It is a great gift idea for a senior relative.",
      "rating": 5.0,
      "verified": true,
      "author": "danam",
      "helpful_votes": 0,
      "publication_date": 20160205
    },
    {
      "title": "Having cards around for any occasion is super helpful for those moments when you just don't have ...",
      "text": "Having cards around for any occasion is super helpful for those moments when you just don't have time to get to the store to pick one out. I also buy extra cards at the store when I do have time and store them in this box for future use. It's handy to have around",
      "rating": 4.0,
      "verified": true,
      "author": "mom2L",
      "helpful_votes": 0,
      "publication_date": 20170511
    },
    {
      "title": "some are five star and some are two",
      "text": "Having been absolutely blown away by another handmade greeting card assortment earlier this week, this one paled by comparison. Some of the cards (maybe half of them) are freaking adorable. Others look kind of like the super cheap cards you get in the super cheap card assortments (super cheap). I will absolutely use them and this assortment was less expensive than the other set I got. Maybe I'll just send the boring ones to people I don't like very much ;)",
      "rating": 3.0,
      "verified": true,
      "author": "Kate M.Top Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20140404
    },
    {
      "title": "Five Stars",
      "text": "Love, love these greeting cards. Will continue to purchase them.",
      "rating": 5.0,
      "verified": true,
      "author": "Maria",
      "helpful_votes": 0,
      "publication_date": 20180118
    },
    {
      "title": "Great quality",
      "text": "The cards are attractive and it is nice to have the box to keep the cards organized. In the past, I have bought cards ahead of time for all occasions and had to go through them each time before I found one that was appropriate. The box keeps all of my cards organized by type so that I can look just in the section designated. U have organized all of my cards in the box. The cards are on quality paper and are unique.",
      "rating": 4.0,
      "verified": true,
      "author": "CherylB",
      "helpful_votes": 0,
      "publication_date": 20140612
    },
    {
      "title": "cards are better than dollar store value",
      "text": "cards are better than dollar store value, but not as nice as Costco. I was looking for thank you cards or blank cards mostly and the thank you card was no larger than the one found in boxed sets of thank you notes. Several cards have no embelishments.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20150921
    },
    {
      "title": "Disappointed in the quality of these cards.  Not what I expected!",
      "text": "I was a bit disappointed in these Paper Magic Group cards. They were not as nice and elaborate as ones I have purchased in the past. I wonder if these are knock offs of the original Paper Magic Cards.....just not as nice. I have had at least 3-4 different boxes of 24 count Paper Magic All Occasion Cards, and these look much cheaper made.",
      "rating": 3.0,
      "verified": true,
      "author": "Anita J.",
      "helpful_votes": 0,
      "publication_date": 20160324
    },
    {
      "title": "Greeting card organizer and nice cards.",
      "text": "Especially like the pretty box with separators inside for different categories.",
      "rating": 5.0,
      "verified": true,
      "author": "Southwest Rain lover",
      "helpful_votes": 0,
      "publication_date": 20170415
    },
    {
      "title": "Beyond my expectations",
      "text": "I just received my order & I am so pleased ! The cards are beautiful, way beyond my expectations. Delivery was super fast. I wish they would make refill packs of cards. When you used up most of them you can just order the cards without the box, the box is very sturdy and will last a very long time.",
      "rating": 5.0,
      "verified": true,
      "author": "Ros R",
      "helpful_votes": 0,
      "publication_date": 20150308
    },
    {
      "title": "Highly recommend",
      "text": "Very very nice selection of cards. Even nicer than in the stores. Nice size",
      "rating": 5.0,
      "verified": true,
      "author": "Peg55",
      "helpful_votes": 0,
      "publication_date": 20190316
    },
    {
      "title": "AWESOME QUALITY!!! Beautiful cards.",
      "text": "I love the quality. I love the prints. I love almost everything except the smaller cards do not have the appropriate size envelope. They have general size envelopes, which hurts my OCD heart, as I need the fit to be perfect. Other than the envelope not fitting, these are wonderful. Even the box is fabulous.",
      "rating": 4.0,
      "verified": true,
      "author": "Ashley Baker",
      "helpful_votes": 0,
      "publication_date": 20160723
    },
    {
      "title": "Economy and convenience",
      "text": "I like the Paper Magic sets, and this is clearly the most economical and convenient way to have cards ready when you need them, My only issue is that the sets tend to have too many juvenile-themed cards, which are of limited use to me. I wish they had an option for same quality, but with exclusively adult or contemporary themes.",
      "rating": 4.0,
      "verified": true,
      "author": "Lisa DiPrete",
      "helpful_votes": 0,
      "publication_date": 20150307
    },
    {
      "title": "The cards are fine, EXCEPT that you have to open the cellophane ...",
      "text": "The cards are fine, EXCEPT that you have to open the cellophane on each one to determine what the inside says or doesn't say. The last similar box I got contained little notes which hinted what the inside said.",
      "rating": 3.0,
      "verified": true,
      "author": "Gazebomomma",
      "helpful_votes": 0,
      "publication_date": 20170905
    },
    {
      "title": "I was disappointed very with this purchase",
      "text": "I was disappointed very with this purchase. First of all it did not have the variety that the last set of cars had. Furthermore, you had to open each card to see what was written inside. In the last set, the message was printed on the outside. The cards are pretty but I would not purchase thses again.",
      "rating": 3.0,
      "verified": true,
      "author": "Ruth D. Bubba",
      "helpful_votes": 0,
      "publication_date": 20141222
    },
    {
      "title": "UNIQUE & BEAUTIFUL",
      "text": "Another unique and beautiful box of greeting cards. Recipients always give compliments on these cards. A+++",
      "rating": 5.0,
      "verified": true,
      "author": "ccomeaux",
      "helpful_votes": 0,
      "publication_date": 20180807
    },
    {
      "title": "The cards are nice. One thing the other box of greeting cards ...",
      "text": "The cards are nice. One thing the other box of greeting cards I had was, that this box doesn't, is the text of the greeting on the inside of the card written on the back of the plastic. You don't know what the inside says unless you open each card and some cards have no words on the front of the card. Kind of frustrating.",
      "rating": 3.0,
      "verified": true,
      "author": "leiana",
      "helpful_votes": 0,
      "publication_date": 20161024
    },
    {
      "title": "Not so good!",
      "text": "Not happy with these cards. The first box I ever bought was at Costco and the cards were beautiful, very detailed and elaborate with a decent expression on it. These are very simple and not very pretty in general with a cheaper quality. I won't buy them again.",
      "rating": 2.0,
      "verified": true,
      "author": "desertjasmin",
      "helpful_votes": 0,
      "publication_date": 20150926
    },
    {
      "title": "Buy the cards at Costco",
      "text": "Not as good as the ones I have bought at Costco.",
      "rating": 1.0,
      "verified": true,
      "author": "Gramma",
      "helpful_votes": 2,
      "publication_date": 20180129
    },
    {
      "title": "Fab cards",
      "text": "Very nice card assortment. I police being able to shop for a card at home right before leaving for an event. These are not crazy pricey, but they look fabulous. Not the 99 cent shoebox style cards here.",
      "rating": 5.0,
      "verified": true,
      "author": "Joy R.",
      "helpful_votes": 0,
      "publication_date": 20161005
    },
    {
      "title": "They're nice but not the best",
      "text": "These are cute cards but not as nice as a similar assortment I found at Costco several years ago. I'll definitely use them and for the price of greeting cards these days, you can't really go wrong. It just seems that most of them are geared toward kids and the embellishments aren't as nice as others.",
      "rating": 3.0,
      "verified": true,
      "author": "Toni D.",
      "helpful_votes": 0,
      "publication_date": 20141023
    },
    {
      "title": "I really love having these cards on hand",
      "text": "I really love having these cards on hand. There have been so many time that I'm in a rush to go to a party or an event and had forgotten to pick up a card. There is a good variety in this box but it also is nice enough for you to collect and sort other cards you may have picked up along the way.",
      "rating": 5.0,
      "verified": true,
      "author": "MVTTC4393",
      "helpful_votes": 0,
      "publication_date": 20160622
    },
    {
      "title": "Beautiful box & cards, but not a monthly card organizer",
      "text": "It definitely has some beautiful cards for many occasions and is really a great price for what you get. The box looks beautiful. I would have liked something that would organize birthday cards by month (it just has a divider in the front to write occasions on), and a little more room to add my own cards too. I was able to stuff about 20 extra cards in here, though.",
      "rating": 5.0,
      "verified": true,
      "author": "Northbird",
      "helpful_votes": 0,
      "publication_date": 20140328
    },
    {
      "title": "The quality of these cards is good, but there were NO Get Well or Sympathy ...",
      "text": "The quality of these cards is good, but there were NO Get Well or Sympathy cards. Those are what I need most these days. I was disappointed in that for sure.",
      "rating": 3.0,
      "verified": true,
      "author": "C. O'driscoll",
      "helpful_votes": 0,
      "publication_date": 20171101
    },
    {
      "title": "Time saver",
      "text": "Cards are so pretty , great to have them on hand.",
      "rating": 4.0,
      "verified": true,
      "author": "Valerie",
      "helpful_votes": 0,
      "publication_date": 20190215
    },
    {
      "title": "Love it!",
      "text": "I'm a firm believer that people need to send more greeting cards in the mail. My husband did make fun of me for needing to purchase an organizer for greeting cards but it's come in handy numerous times for those last minute invites to birthdays or for when other unexpected occasions came up. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "ESB",
      "helpful_votes": 0,
      "publication_date": 20140504
    },
    {
      "title": "Great deal",
      "text": "This is a great deal! The cards all appear to be high quality, and the box and dividers are well made. Perfect for always having cards on hand, and much cheaper than buying cards at the pharmacy!",
      "rating": 5.0,
      "verified": true,
      "author": "Lindsay",
      "helpful_votes": 0,
      "publication_date": 20160418
    },
    {
      "title": "Although the price was good for the amount of cards you receive",
      "text": "Although the price was good for the amount of cards you receive, I thought the quality was poor. I have gotten other boxes from Cosco and they put these to shame!",
      "rating": 2.0,
      "verified": true,
      "author": "Beanie",
      "helpful_votes": 0,
      "publication_date": 20170825
    },
    {
      "title": "Disappointing !",
      "text": "Colorful but simplistic . Not as impressive as past orders from this Mfgr .",
      "rating": 3.0,
      "verified": true,
      "author": "N. Solanko",
      "helpful_votes": 0,
      "publication_date": 20190224
    },
    {
      "title": "Cute cards",
      "text": "I love the cards! They're so adorable. It's also a way better value than getting 1 card at the store for $4. This helps me out with having the cards on hand when I need it without having to drive and get one. There's also a reminder card-stock inside to list b-days or other occasions you need to remember.",
      "rating": 5.0,
      "verified": true,
      "author": "Marnie Reyes",
      "helpful_votes": 0,
      "publication_date": 20140126
    },
    {
      "title": "bargain for nice greeting cards",
      "text": "I hate paying $3.50 to over $5.00 for a greeting card from Hallmark or American Greetings. These cards are all hand made with all kinds of embellishments added to them. This way, I get a whole box of really nice cars for a nominal price for card.",
      "rating": 5.0,
      "verified": true,
      "author": "Lotus Blossom",
      "helpful_votes": 0,
      "publication_date": 20150817
    },
    {
      "title": "Four Stars",
      "text": "These cards were okay not the creative and unique design of previous sets I purchased from Paper Magic Group.",
      "rating": 4.0,
      "verified": true,
      "author": "Sharon Davis",
      "helpful_votes": 0,
      "publication_date": 20171203
    },
    {
      "title": "So adorable",
      "text": "I usually get these at Costco but couldn't find them. These are just as cute and a lil cheaper too!",
      "rating": 5.0,
      "verified": true,
      "author": "sarpow",
      "helpful_votes": 0,
      "publication_date": 20170513
    },
    {
      "title": "Love this product",
      "text": "I loved all of the handmade cards. I always keep cards on hand for birthdays and holidays because there are so many that I need throughout the year. All the cards have well thought out designs on them- they do not look cheap at all even though it ends up being less than a dollar per card. Much cheaper than buying cards in the store.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer Miller",
      "helpful_votes": 0,
      "publication_date": 20140128
    },
    {
      "title": "Product OK.",
      "text": "Cards are lovely. I am concerned because several cards have designated envelopes that are WAY too large. I always believed that envelopes and cards should be the same size. Maybe I am mistaken.",
      "rating": 3.0,
      "verified": true,
      "author": "Heyygirl",
      "helpful_votes": 8,
      "publication_date": 20140330
    },
    {
      "title": "A must have set!",
      "text": "I needed a card set to keep on hand because lately it seemed I was running to the store for cards. Now I have an organized box which has plenty of room to add more cards.",
      "rating": 5.0,
      "verified": true,
      "author": "cared99",
      "helpful_votes": 0,
      "publication_date": 20170509
    },
    {
      "title": "Nice card set",
      "text": "I hate having to run to store and buy cards every time we need one for special occasions and having to spend a small fortune to get one......these may not be Hallmark quality cards but they are close and you get 25 cards for price of two at store....good deal to me and cards are simple in sayings but look like good handmade cards",
      "rating": 4.0,
      "verified": true,
      "author": "L. Hampton",
      "helpful_votes": 0,
      "publication_date": 20140310
    },
    {
      "title": "Great time-saver",
      "text": "Good set of assorted cards. I tend to forget to buy cards, so this saves me from having to stop at the store on my way to an event. There were a few cards I'll probably never use, but for the most part, this box has come in very handy.",
      "rating": 4.0,
      "verified": true,
      "author": "Erica",
      "helpful_votes": 0,
      "publication_date": 20160615
    },
    {
      "title": "These cards are great to have for those last minute races out the ...",
      "text": "These cards are great to have for those last minute races out the door to a party and realizing you don't have a card! With 2 kids, it happens every time, so these are a life saver! And super cute!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Crystal U.",
      "helpful_votes": 0,
      "publication_date": 20160407
    },
    {
      "title": "I love these go to boxes for cards of all occasions",
      "text": "I love these go to boxes for cards of all occasions. It's a great deal for something that you know people are going to throw away anyway, but they are so cutsey that I think they really relay the thought that counts.",
      "rating": 5.0,
      "verified": true,
      "author": "Krystal Dobron",
      "helpful_votes": 0,
      "publication_date": 20150506
    },
    {
      "title": "Got this for my mom as a gift. She ...",
      "text": "Got this for my mom as a gift. She loves it. She has a shoebox currently with cards in it so she loves being able to organize all her cards.",
      "rating": 5.0,
      "verified": true,
      "author": "Lauren",
      "helpful_votes": 0,
      "publication_date": 20180325
    },
    {
      "title": "Yup",
      "text": "This came to the rescue for so many birthdays where I needed a card right away!",
      "rating": 5.0,
      "verified": true,
      "author": "Adrienne",
      "helpful_votes": 0,
      "publication_date": 20190120
    },
    {
      "title": "Good value",
      "text": "Great price, good assortment. Much cheaper than buying cards at a store one by one.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170414
    },
    {
      "title": "Very nice cards - paper quality and content is excellent",
      "text": "Very nice cards - paper quality and content is excellent. Some are thicker than others, and may require slightly more postage, but most would mail as standard. Very happy with these cards!",
      "rating": 5.0,
      "verified": true,
      "author": "roxie13",
      "helpful_votes": 0,
      "publication_date": 20160203
    },
    {
      "title": "Nice cards",
      "text": "Convenient and nice. Some of the cards are small, which is okay except that the envelopes are regular sized card envelopes so they are way too big for the little cards, but this is very nice to have, especially if you don't get out much. The cardboard storage box is also a nice plus.",
      "rating": 4.0,
      "verified": true,
      "author": "Kerry",
      "helpful_votes": 0,
      "publication_date": 20141209
    },
    {
      "title": "One Star",
      "text": "Totally disappointed. Low quality compared to the one sold at costco. Not worth the price. Will not buy again.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170831
    },
    {
      "title": "Cards are kind of cheaply made",
      "text": "I had bought the packs of handmade cards at Costco and I loved them, so I thought this would be similar, but these are mostly flat cards. They are nice to have on hand instead of spending $3-$4 on a card every time you go to a kids birthday party, but I don't think I would buy these again.",
      "rating": 3.0,
      "verified": true,
      "author": "kt12883",
      "helpful_votes": 0,
      "publication_date": 20130916
    },
    {
      "title": "Unique cards",
      "text": "I like the designs, colors, and sentiments. The box will be used to hold all my c greeting cards, postcards,and blank cards.It has handy dividers inside and is sturdy. I'd have given this Paper Magic Greeting Card Assortment 5 stars, except that some of the cards are smaller than their envelopes, which to me, is misleading.",
      "rating": 4.0,
      "verified": true,
      "author": "In My Opinion",
      "helpful_votes": 0,
      "publication_date": 20130731
    },
    {
      "title": "Nice product!",
      "text": "The individually wrapped cards of a nice quality and offer a wide assortment of styles. At about 50cents per card, I would definitely purchase these again. The box itself is pretty sturdy and the wife will use it for something, I'm sure.",
      "rating": 5.0,
      "verified": true,
      "author": "JamesR",
      "helpful_votes": 8,
      "publication_date": 20130329
    },
    {
      "title": "I've bought these similar at Costco with much more embellishment & better quality generally",
      "text": "Was expecting more embellishments for the price. I've bought these similar at Costco with much more embellishment & better quality generally.",
      "rating": 3.0,
      "verified": true,
      "author": "Gabs2much",
      "helpful_votes": 0,
      "publication_date": 20170901
    },
    {
      "title": "Just okay...",
      "text": "These arrived complete with the box not crushed, I was hoping for more cards that have that \"wow\" look...not too many in the bunch, some of the cards look cheap.",
      "rating": 3.0,
      "verified": true,
      "author": "2Believe33",
      "helpful_votes": 0,
      "publication_date": 20170530
    },
    {
      "title": "But nice ans cheaper than individual",
      "text": "Not as fancy as the ones they made and sold at Costco. But nice ans cheaper than individual cards",
      "rating": 4.0,
      "verified": true,
      "author": "Teresa",
      "helpful_votes": 7,
      "publication_date": 20141022
    },
    {
      "title": "Cards",
      "text": "This is the second box of cards that Ive ordered. Ive ordered these for a friends mother. They are so easy to order and are so beautiful. I will buy these over and over.,",
      "rating": 5.0,
      "verified": true,
      "author": "Biff Owens",
      "helpful_votes": 0,
      "publication_date": 20170417
    },
    {
      "title": "Great cards",
      "text": "I love these cards. Each box is organized by occasion and the cards are nicely written. They are of good quality and can be used for anyone. Definitely a good value for your money.",
      "rating": 5.0,
      "verified": true,
      "author": "CHERYL A GENTIL",
      "helpful_votes": 0,
      "publication_date": 20200205
    }
  ],
  "product_meta": {
    "title": "Paper Magic Handmade and Embellished All Occasion Greeting Cards with Orange Keepsake Box, 25pc",
    "description": "Paper Magic Group brings convenience and beautifully embellished cards to you in this handy re-usable keepsake box. Never again will you need to rush to the store for a card, paying too much and wasting time. The box contains 25 cards and coordinating envelopes. Card prints range from photographic to whimsical; artsy to heartfelt. Since 1986, The Paper Magic Group, Inc. has created and distributed a variety of educational and seasonal products. We are proud to offer the best stationery, educational and motivational merchandise for home and school, including games and puzzles, bulletin board decorating sets, banners, recognition awards, bookmarks, and success stickers. PMG also offers boxed greeting cards for Christmas, gift tags and seals, vinyl window clings, and home décor products, Valentine products, classroom-exchange Valentines, stickers, treat sacks, cutouts, and danglers. The company provides a terrific variety of Easter and Halloween products. All Paper Magic divisions maintain large product development and creative teams, investing significantly in consumer and product trend research to bring our customers the latest in design. The divisions share distribution facilities in Pennsylvania, goods are manufactured in Paper Magic's domestic production facilities or produced under the company's direction in factories worldwide.",
    "rating": 4.4,
    "feature_bullets": [
      "Box of greeting cards includes (15) handmade cards and (10) embellished cards with corresponding envelopes.",
      "With blank greeting cards as well as cards themed after tons of different events, our all occasion card set will ensure you're never unprepared for any celebration!",
      "Comes with cards that are perfect for young children as well as teens an adults.",
      "This cute and handy kit includes happy birthday cards, congratulations/new baby/wedding cards, and friendship/blank/thank you cards.",
      "Use the included blank cards for anniversaries, sympathy acknolwedgments, and more."
    ],
    "specifications": {
      "Manufacturer": "Paper Magic Group, Inc.",
      "Brand": "Eureka School",
      "Item Weight": "1.8 pounds",
      "Product Dimensions": "14 x 3 x 8.1 inches",
      "Item model number": "2333109",
      "Color": "Orange",
      "Number of Items": "1",
      "Manufacturer Part Number": "2333109",
      "ASIN": "B00L4ATO7U",
      "Customer Reviews": "4.4 out of 5 stars795 ratings4.4 out of 5 stars",
      "Best Sellers Rank": "#102,535 in Office Products",
      "Date First Available": "June 20, 2014"
    },
    "categories": [
      "Office Products",
      "Office & School Supplies",
      "Greeting Cards",
      "Cards & Card Stock",
      "Paper"
    ],
    "price": ""
  }
}