{
  "website_summaries": [
    {
      "verdict": "Low-priced model that can handle small jobs. Offers fast rotational speed considering the price.",
      "pros": [
        "Good option for basic jobs at home",
        "Motor  offers 3,450 rpm, which is impressive for a low-priced bench grinder",
        "Includes a mounted work light for better visibility",
        "Small – would work well for someone with limited work space"
      ],
      "cons": [
        "Not able to handle large jobs",
        "Smaller than some other bench grinders"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Nice little bench grinder!",
      "text": "It works as advertised. Good for sharpening tools and lawnmower blades. It’s nice and compact which is good for saving space on a work area. I included a pic with a corona bottle for size reference.",
      "rating": 5.0,
      "verified": true,
      "author": "Jb",
      "helpful_votes": 26,
      "publication_date": 20190310
    },
    {
      "title": "Awful",
      "text": "Takes for ever to get up to speed, very cheaply made, again disappointed with Wen products and I own a lot of them. Don't put thr m on a public wishlist!",
      "rating": 1.0,
      "verified": true,
      "author": "Starkster",
      "helpful_votes": 22,
      "publication_date": 20170908
    },
    {
      "title": "Weak",
      "text": "Very disappointed in this grinder. Only used it twice since I got it and it won't keep up speed. Even a piece of aluminum stopped the wheel. Of course I should have tried it earlier as it is now past time to return it....which I would in an instant. Also, it takes forever to get up to speed. *Update - tried to use the light for the first time and it won't work either. Wish I could return it.",
      "rating": 1.0,
      "verified": true,
      "author": "Jake3055",
      "helpful_votes": 10,
      "publication_date": 20190128
    },
    {
      "title": "... has no walk to it at all which is amazing to me most rotary style tools will move themselves ...",
      "text": "Works well isnt too loud and I haven't even had to bolt it down to the bench it has no walk to it at all which is amazing to me most rotary style tools will move themselves and this stays in place, the light only works when the wheels are turning which is a little bit of a bummer I wish it was independent other than that it works great and I'm very happy with it. If my review helped you in anyway please hit the button.",
      "rating": 5.0,
      "verified": true,
      "author": "XF",
      "helpful_votes": 12,
      "publication_date": 20170614
    },
    {
      "title": "Satisfactory but Could be Better",
      "text": "The product is performing the required functions, after modifications. Installed a Dewalt 6\" wire wheel and the machine would not run as the wire wheel was too wide for the existing configuration. Had to install spacers to reposition the cover guard approx 3/8\" out. After the modifications it worked fine. Also, the tool rest for the right hand wheel just fell off with normal vibrations due to a faulty rivet. Replaced with a screw and lock nut and it is securely attached now.",
      "rating": 3.0,
      "verified": true,
      "author": "Michael F Barbour",
      "helpful_votes": 0,
      "publication_date": 20200920
    },
    {
      "title": "Worth the money!",
      "text": "This is a perfect grinder for my mower blades. Assembly was easy and the wheels are perfectly balanced. I got this 6\" grinder over an 8\" grinder because of the reviews and I'm not disappointed. Great safety features with the spark shields and eye shields. I mounted it on a nice piece of wood and just set that on my sawhorses when I need to use it. After I'm done it just hangs on a hook in the garage until next time. Seems very sturdy and solid for a smaller sized grinder. As a bonus it also looks pretty sharp with its reddish orange color.",
      "rating": 5.0,
      "verified": true,
      "author": "Roger E. Dickerson",
      "helpful_votes": 0,
      "publication_date": 20200411
    },
    {
      "title": "Nearly Perfect",
      "text": "This grinder came with minimal assembly, easy about 15 minutes. The wheels are factory installed. I had to re-install the left wheel because it wobbled. When I took it off I found the washer wasn't on all the way and the wheel had play in it. No big deal, easy fix. Also don't be a dummy like me. The light doesn't go on unless the machine is running. I think I spent 20 minutes troubleshooting the lamp and didn't realize this. LOL. Well made, easy setup.",
      "rating": 4.0,
      "verified": true,
      "author": "VinceB",
      "helpful_votes": 2,
      "publication_date": 20190906
    },
    {
      "title": "Great value",
      "text": "Exactly what I expected from Wen products. High quality for home shop or medium commercial duties. Sharpened my mower blades easily, enough power if you are familiar with not bogging down motors with too much pressure. Shields a little wonky getting attached but work fine. States not lightbulb included, so no gripe there. After several small bends, light stays where it's needed. My grinder is very steady and \"quiet\". Great inexpensive product.",
      "rating": 5.0,
      "verified": true,
      "author": "philip hopkins",
      "helpful_votes": 0,
      "publication_date": 20200512
    },
    {
      "title": "Power, quality control. Rattled but it was fixed.",
      "text": "Just like anything made in China, i do a quick check up before i start using it. It rattled once i powered it on. Took it a apart and found out that a little screw that holds the base for the grinder was missing. Found a screw that was the same size and voila, it worked as intended. Overall pretty happy with the purchase because of the low cost but quality control could definitely improve",
      "rating": 4.0,
      "verified": true,
      "author": "..",
      "helpful_votes": 0,
      "publication_date": 20200414
    },
    {
      "title": "Very light passes - not working now after 10 uses (in 5 months)",
      "text": "I used this to polish some rusted tools (adding a wire wheel) - and used it to sharpen blade on lawmower. Total use? Maybe 10 times or so. I even ordered the Wen stand. Well... now I have a non-working unit. It just hums. You can spin the wheel by hand and the light comes on - but doesn't work. Needless to say, I'm very disappointed. Also, someone else mentioned - very light passes - yes, it doesn't have the torque you will need - and mine is now dead. Good luck!",
      "rating": 2.0,
      "verified": true,
      "author": "CaptainJack",
      "helpful_votes": 0,
      "publication_date": 20200913
    },
    {
      "title": "Good but not perfect",
      "text": "I purchased this small bench grinder to sharpen some kitchen knives. It delivered in perfect shape with an installation guide. Completed installation and booted up... It made couple of spins and stopped. I opened one side where a grinding noise was coming from. I found one of the bolts for the side cover was touching the grinder stone. I had to remove the bolt to run the grinder. It is a nice small bench grinder for the money. Now my wife has many well-sharpened weapons...",
      "rating": 4.0,
      "verified": true,
      "author": "Don Y.",
      "helpful_votes": 0,
      "publication_date": 20200514
    },
    {
      "title": "A reliable grinder at an affordable price.",
      "text": "I bought this grinder to keep a sharp blade for my tools—lawn mower, ax, knives, etc. This one is easy to use, relatively simply to assemble (you have to screw on the protective plates and a couple of brackets), and simple to operate. I have not subjected this to extremely heavy use—I’m not professional contractor or anything like that. But for my household needs, this grinder is up to the task and didn’t break my budget. I definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Johnson",
      "helpful_votes": 0,
      "publication_date": 20201003
    },
    {
      "title": "works okay according to the man of the house",
      "text": "You have to understand that my husband wouldn't give five stars to anything. He says he has a difficult time saying he loves anything (except his wife, kids and grandkids). Oh. and he loves cool weather. But he says this bench grinder meets his needs and works well. the instructions for setup were clear, and it attached easily to his workbench. He has had difficulty finding a fine wire brush attachment that will fit. He cannot find one that is 3/4 inch thick. Most grinder brush attachments are 1/2 inch thick and you can't tighten it down.",
      "rating": 4.0,
      "verified": true,
      "author": "Anita Howard",
      "helpful_votes": 2,
      "publication_date": 20170929
    },
    {
      "title": "A good value for a dedicated light duty grinder",
      "text": "It’s perfect for the use I intend it for . It’s to be set up for sharping knifes and some tools . It runs smoothly and quietly with out much vibration.i It appears to be well made and definitely it is well thought out . I will keep good wheels on it to hand sharpen drills and jig sharpen tools . It’s a Big Bang for the buck .",
      "rating": 5.0,
      "verified": true,
      "author": "Emory",
      "helpful_votes": 0,
      "publication_date": 20191025
    },
    {
      "title": "A high quality machine, quiet Power",
      "text": "The quality of the manufacturing is evident in the smooth finish and quiet operation, as the wheels run up to speed, a low sound of power can be heard. Once full speed is achieved a moderate hum of power tells you it's ready for work. The work light adds safety, in that it helps you see what your hands are doing.and where the spinning wheel is. The eye shields and spark dampeners keep your work environment safe. It grinds metal smoothly as it should. The wheels track straight with no vibration. A pleasure to use.",
      "rating": 5.0,
      "verified": true,
      "author": "A. C. Doyle",
      "helpful_votes": 0,
      "publication_date": 20190813
    },
    {
      "title": "Mostly Junk",
      "text": "Not the first WEN product I have purchased. I have been happy with both their cordless drills model #49120 and their 10 inch drill press 4210 but this model #4276 bench grinder is just junk. If you want a $40 pencil sharpener then go ahead and buy it but for anything else stay away from this one.",
      "rating": 1.0,
      "verified": true,
      "author": "KansasBornAndBred",
      "helpful_votes": 3,
      "publication_date": 20190314
    },
    {
      "title": "Motor produces plenty of torque",
      "text": "I bought this bench grinder for my remote woodshop assuming that it would be underpowered but OK for light duty grinding... I would take serious grinding needs back to my garage and use my Delta. I was wrong! This Wen produces enough torque to tackle any grinding need that I'll ever encounter in my woodshop! Easy to assemble and impressive features at a value price point.",
      "rating": 4.0,
      "verified": true,
      "author": "Dewey Bumstead",
      "helpful_votes": 0,
      "publication_date": 20200622
    },
    {
      "title": "Good for light, and I mean LIGHT, grinding but not much else",
      "text": "I purchased this grinder based on the reviews here, and all I can say is I'm glad it was only 40 bucks. I replaced one of the grinding wheels with a wire wheel and the slightest bit of pressure all but stopped the grinder dead. The vibration put out by this grinder is so much so that if you have anything on your work bench that moves it will likely end up on the floor. For all of the great reviews this received, it's not really as great as it's made out to be. The saying holds true, you get what you pay for...",
      "rating": 2.0,
      "verified": true,
      "author": "Jay",
      "helpful_votes": 2,
      "publication_date": 20190528
    },
    {
      "title": "Dissatisfied, do not buy people. It’s too weak for simplest of tasks.",
      "text": "This grinder is not worth buying. It is so weak you can barely grind down a 7/8 piece of aluminum to make the diameter 5/8. And after about 2 hours of dealing with it. Then it has a serious vibration. I also purchased the stand for it. And you can imagine it will walk all over the place unless you put your entire body weight in it. And it will still be hard to keep still. Do not buy this thing people. Save yourself some disappointment.",
      "rating": 1.0,
      "verified": true,
      "author": "Laby",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "Good grinder for the price",
      "text": "I put a wire wheel on one side so I could clean and polish some valves. It would not spin with it on. I had to find some shims to push it against the retaining nut. Lucky I had some that fit just right. But the wire wheel flays outward and mars up the finish on the tool rest and the guards. The light will only turn on if power to the grinder is on. Not a very good idea in my opinion. It should be wired directly to power instead of reliant on grinder power. Overall, I like it and bought it with the cast iron stand. They work well together.",
      "rating": 4.0,
      "verified": true,
      "author": "CK",
      "helpful_votes": 11,
      "publication_date": 20170613
    },
    {
      "title": "Great for Light or Occasional Use",
      "text": "What a price. I didn't have a compelling need for a bench grinder, but couldn't pass this up because was so affordable. Performs respectively. The lights just get in the way for me, but not that hard to just push them to the side. Big step up from an item I just bought to have a bench grinder, but if you use on a regular basis probably want to upgrade. Nice happy medium for the causal user.",
      "rating": 4.0,
      "verified": true,
      "author": "Attention to Detail ",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "Ok grinder",
      "text": "Not needing a big bench grinder or needing to use one often this seems to do the trick. Slow to spool-up, not very powerful, wheels not true/vibrates a bit (better wheels should take care of that), light is nice, rests are a bit small and cheapo, but about par for it's price. Wouldn't call it great, wouldn't pan it.",
      "rating": 3.0,
      "verified": true,
      "author": "Marc Poletti",
      "helpful_votes": 5,
      "publication_date": 20170316
    },
    {
      "title": "Received an unexpected, unreconditioned used grinder, though it still works.",
      "text": "Was sent an obviously used unit (although I ordered new). It was not reconditioned very well (if indeed reconditioning was the goal and not outright fraud). Wheels showed use (the finer wheel VERY much so, enough that it needed replacing), one of the eye shield for that side shows spark splatter impacts. Grind dust in both wheel guards. Spark deflector bent but easily enough to straighten out. Deep gouging on one tool rest support, but still serviceable. Despite what appears to be that deception or fraud, unit spins up nicely, is quiet, and the arbors run nice and true. Only reason this gets 3 stars - average rating. Not awful I suppose for a 40 buck tool.",
      "rating": 3.0,
      "verified": true,
      "author": "Christopher J Brown",
      "helpful_votes": 0,
      "publication_date": 20200908
    },
    {
      "title": "So so weak",
      "text": "Mine did not have the vibration issues the others described. Bolted it to the pedestal; no issues. It came without the eye shields (missing in the box). My biggest beef is how weak it is - I could stop the buffing wheel (swapped in) with my fingers. The motor gets supremely hot very quickly, which I suspect may be a defect. Going back.",
      "rating": 1.0,
      "verified": true,
      "author": "Maestro",
      "helpful_votes": 0,
      "publication_date": 20200619
    },
    {
      "title": "VERY GOOD PRODUCT.",
      "text": "VERY GOOD PRODUCT ..SOLID...GREAT LIGHT ..ONLY THING I DON'T LIKE IS THE LIGHT WILL NOT STAY ON \"UNLESS MOTOR IS RUNNING\" .REALLY DUMB FEATURE .RETIRED MECHANIC..",
      "rating": 3.0,
      "verified": true,
      "author": "George A. Mitchell",
      "helpful_votes": 6,
      "publication_date": 20170721
    },
    {
      "title": "Out of balance wheel & can not assemble completely",
      "text": "Good size for light duty grinding and having a work light was an important consideration for my purchase. Two problems: 1.) One grinding wheel is out of balance despite my two attempts to adjust. Grinder vibrates during operation. 2.) Right side guard has no mounting hole to mount safety shield. Apparently quality control missed some manufacturing tooling flaws.",
      "rating": 3.0,
      "verified": true,
      "author": "John Hughitt",
      "helpful_votes": 0,
      "publication_date": 20200711
    },
    {
      "title": "Great value but no torque/power",
      "text": "Seems to be good quality and straightforward assembly. Not a lot of torque/power so on hard grinding it slows down. Also I bought the wire wheel that supposedly is for this model but when installed the machine won’t rotate. The bristles cause enough friction or tension to freeze the unit up. Bummer because that’s what I really wanted it for. Maybe a smaller thinner wheel might work?",
      "rating": 3.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200521
    },
    {
      "title": "Crappy",
      "text": "Weak motor boggs down to easy, second time I turn it on wheels were wobbly and vibration like crazy",
      "rating": 1.0,
      "verified": true,
      "author": "BiteThatSukka",
      "helpful_votes": 4,
      "publication_date": 20190404
    },
    {
      "title": "You get what you pay for...",
      "text": "If you want a simple bench grinder for light sharpening on an occasional basis this will work for you. Don’t expect power or versatility. The motor is very weak and it’s almost impossible to put a buffing or wire wheel on it - the two grinding wheels are weight balanced and if you replace one with a lighter wheel it will vibrate. I only use it to sharpen chisels, knives and brush cutter/ mower blades.",
      "rating": 3.0,
      "verified": true,
      "author": "Virginia Gerhart",
      "helpful_votes": 0,
      "publication_date": 20200627
    },
    {
      "title": "Amazing Grinder!!",
      "text": "I don't know what other reviewers are using on this but all I can say is this is an amazing grinder! The first day I got it I sharpened everything I owned that needed sharpening. I touched up chishels, large crowbars, prybars, and axes with no problems! I would give it 6 stars of I could! For $42 hurry up and buy it!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Big \"C\"",
      "helpful_votes": 0,
      "publication_date": 20200404
    },
    {
      "title": "Great deal",
      "text": "I am an on-site auto repair technician, and this is perfect for my needs: occasional tool sharpening, deburring, cleaning rust from small parts. Small, portable, and inexpensive enough to be almost disposable. Just got it, so time will tell. It can only exceed my expectations.",
      "rating": 5.0,
      "verified": true,
      "author": "Emerick H. Bultman",
      "helpful_votes": 0,
      "publication_date": 20200912
    },
    {
      "title": "Missing assembly items.",
      "text": "I just received the WEN 4276 and while assembling, I found that five (5) of the eleven (11) assembly items were not included which amounts to roughly 50% of missing items. I have no idea how many of these units get sold in a given period of time but given that I've read several other reviews of missing items, I'd have to say that the manufacturing facility has little quality control procedures. I will update my review once I contact their customer service and have a response.",
      "rating": 1.0,
      "verified": true,
      "author": "Joel Janssen",
      "helpful_votes": 0,
      "publication_date": 20190302
    },
    {
      "title": "Well Made",
      "text": "Solid unit. Good for the price. Slow startup winds up to speed slowly, which must reduce strain on motor and reduce electrical start up surge. Runs surprisingly smoothly and quietly. Satisfyingly thick power cable. Light cable doesn't hold position for which I deducted a star.",
      "rating": 4.0,
      "verified": true,
      "author": "TomBrooklyn",
      "helpful_votes": 0,
      "publication_date": 20181222
    },
    {
      "title": "good starter grinder",
      "text": "A fine starter grinder for the DIY. Cheap. Get what you pay for. Not for contractor level jobs. A good purchase to see if you get good enough to use a better one that would cost more money. If I dull all my blades, then I know I am not cut out for a real grinder. Only out $40. Good for every high school kid to learn on.",
      "rating": 5.0,
      "verified": true,
      "author": "Larry",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "Good for small projects but underpowered",
      "text": "Very small and I think it is underpowered. I was playing with it just trying to sharpen a little piece of scrap aluminum. Each time I lightly pressed the aluminum to the wheel, it would bog down and stop. I replaced the wheels with a wire brush and buffing wheel though and works fine for what I need. Not sure about other uses though for sharpening metal items. I would get a more powerful one. Very stable though. No vibration or wobble.",
      "rating": 3.0,
      "verified": true,
      "author": "brett j.",
      "helpful_votes": 0,
      "publication_date": 20190103
    },
    {
      "title": "Nice economy grinder",
      "text": "For the money you can't go wrong with this grinder. With the coarse and fine stones it sharpens lawn mower blades fast. No this is not an industrial grinder and the price shows that. If you need a grinder to use for small projects it is a great buy. I would recommend getting the Wen Cast Pedestal stand  which makes this portable.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 2,
      "publication_date": 20170515
    },
    {
      "title": "Buyer beware!",
      "text": "Even following the manufacturers recommendations for bulb wattage, the lamp becomes very hot, really fast. Also, the motor is easily slowed down by applied pressure while using device. It’s an overpriced piece of junk. Buyer beware! Use at your own risk with EXTREME caution.",
      "rating": 2.0,
      "verified": true,
      "author": "Samuel",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "Good product.",
      "text": "Very decent product especially for its price. Starts up a bit slow. Definitely out of balance until it gets up to full speed then has an acceptable hum to it. Hardware is of fair quality. Steel tool rests could be heavier steel. Paint and anodizing looks great. Would definitely recommend for a home owner that isn’t going to be metalworking all the time.",
      "rating": 5.0,
      "verified": true,
      "author": "Rylan",
      "helpful_votes": 0,
      "publication_date": 20200606
    },
    {
      "title": "Not very powerful, just ok for the price.",
      "text": "Got it for the price. Its just ok. Not very powerful but in the back of my mind I knew that going in. OK for sharpening mower blades if you do it gingerly. When trying to use a wire brush wheel to clean off some old tools the motor slows down and almost stops... Maybe I was used to my old grinder that had more power. Bottom line for light jobs this is ok.",
      "rating": 3.0,
      "verified": true,
      "author": "dvdmaniac",
      "helpful_votes": 4,
      "publication_date": 20160926
    },
    {
      "title": "Meh",
      "text": "Pretty out of the box but motor is gutless, wheel bolt threads are wrong with no locking feature, mounting holes are incorrect on the base mount, should be on the four corners, not 2 centered below the main body blocking any tool to tighten a bolt. You get what you pay for I guess.",
      "rating": 2.0,
      "verified": true,
      "author": "HempOrDie",
      "helpful_votes": 0,
      "publication_date": 20200527
    },
    {
      "title": "Good motor",
      "text": "Pros: - Motor is very smooth. Low vibration Cons: - Both wheels were mildly out of round and out of true, if still usable. So not a deal breaker. - The tool rests are useless; they are undersized and not rock solid as they hang on the wheel enclosure which seems to flex a bit. This may be a characteristic shared with more expensive grinders. Perhaps mounting with an external third-party rest is the way to go.",
      "rating": 3.0,
      "verified": true,
      "author": "B. Sternlieb",
      "helpful_votes": 0,
      "publication_date": 20190914
    },
    {
      "title": "Nope",
      "text": "I should have listen to others. when turned on it didn't even have enough power to even start to turn or turn soo slow it just wouldn't build up speed. I had to start turn the wheel to help it build up speed. Decided it wasn't worth it.. sent it back.",
      "rating": 1.0,
      "verified": true,
      "author": "RogueM4",
      "helpful_votes": 2,
      "publication_date": 20190908
    },
    {
      "title": "light",
      "text": "It's a decent little grinder. One thing I didn't like on it was the fact that the light only went on when you turned the grinder. Had to do a adjustment inside with the wires and now light goes on without grinder.",
      "rating": 3.0,
      "verified": true,
      "author": "joe",
      "helpful_votes": 0,
      "publication_date": 20190823
    },
    {
      "title": "Great Deal and works just fine...",
      "text": "Set it up with no issues. Ive used it to sharpen commercial lawn mower blades several times already and it does a great job. Its a bargain. Sure, there are better bench grinders out there but for the price, it does a GREAT job for me. Would get it again.",
      "rating": 5.0,
      "verified": true,
      "author": "Stacey C.",
      "helpful_votes": 0,
      "publication_date": 20200420
    },
    {
      "title": "all good with one minor issue",
      "text": "Happy with purchase - the only problem was the mounting to a workbench was difficult because of the restricted space between the base and the motor, where the mounting bolts are located. could not get a wrench or screw driver in there to tighten the mounting bolts from the top.",
      "rating": 5.0,
      "verified": true,
      "author": "justaguy",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "Both grinding wheels SUCK",
      "text": "The grinder itself is OK: went to use it for the first time and had more of the grinding wheel on , well, everywhere. At this rate I'll be buying new wheels a whole lot sooner than I thought would and you will Too . Again the grinder itself is heavy enough, really quiet and hardly any vibration , which other reviews say it vibrates itself off the bench. Would rate the unit , but the wheels Suck",
      "rating": 2.0,
      "verified": true,
      "author": "BRMOUNTAINS",
      "helpful_votes": 0,
      "publication_date": 20200811
    },
    {
      "title": "Freaking Wow!!! wowaaa wowaaa!!!",
      "text": "We used to use these things all the time in the military machine shops! This thing is amazing and better than our old equipment! It actually has a smooth start! It runs extremely quiet! Wow! I'd buy again in a heart beat! :)",
      "rating": 5.0,
      "verified": true,
      "author": "Blair",
      "helpful_votes": 0,
      "publication_date": 20200605
    },
    {
      "title": "Didn’t spin got super hot right out of box smh",
      "text": "Received it today hooked it up and just hums and don’t spin. After trying to spin wheel and waiting for it to work within 2-3 mins base and motor almost to hot to touch. Faulty upon delievery this thing got so hot I unplugged it I thought it was gunna catch fire! And fast!",
      "rating": 1.0,
      "verified": true,
      "author": "J.J.",
      "helpful_votes": 0,
      "publication_date": 20200529
    },
    {
      "title": "poor quality wheel stones are soft",
      "text": "over all low power cannot push to hard on grinding,wheel stones are very soft and etch. not very pleased for the cost would not buy again! maybe ok for someone to putz around with but on a scale of one to ten? a 3",
      "rating": 2.0,
      "verified": true,
      "author": "T. L. Peters",
      "helpful_votes": 0,
      "publication_date": 20200725
    },
    {
      "title": "Good price",
      "text": "Great little grinder so far sharpened up my chisels and my lawn mower blade blades no problem. It has plenty of power to get the job done keep in mind this unit comes with two different grinding wheels fine and course . It should get the job done for the average homeowner if you were looking for a commercial grade but commercial grade",
      "rating": 5.0,
      "verified": true,
      "author": "Harold",
      "helpful_votes": 0,
      "publication_date": 20190302
    },
    {
      "title": "Needed some alterations but should work",
      "text": "The light head was put on 180degrees incorrectly so I had to pop the cover off and and re-apply the light. As delivered, the light would not actually turn toward either of the grinding wheels due to the spring in the cable cover. Also, the directions say to drill holes for four mounting bolts but there are only two available on the product. Perhaps there are more available on other products from them? Haven’t fired it up yet but will shortly.",
      "rating": 3.0,
      "verified": true,
      "author": "The Happy Chef",
      "helpful_votes": 0,
      "publication_date": 20200318
    },
    {
      "title": "Nice bench grinder, great price!",
      "text": "I looked and looked at these on Amazon. This one seemed to be a good buy and had features some of the others didn't - like the light, which is a great help when using the tool. I would recommend this bench grinder to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Joel B",
      "helpful_votes": 0,
      "publication_date": 20200407
    },
    {
      "title": "Junk, save your money",
      "text": "Itll vibrate even bolted down it has a super bad vibration which I've added rubber layers after another and still figuring it out right now. Not wasting my time resending back, take the review though.",
      "rating": 1.0,
      "verified": true,
      "author": "Tracie ",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "A little better than I expected",
      "text": "Not professional quality but I don't need professional quality. I have used this so far to grind down a piece of metal that was preventing my A/C floor vent from seating properly. I have also used to sharpen my lawn mower blades both times it did what I needed it to do with no problems.",
      "rating": 4.0,
      "verified": true,
      "author": "thomas",
      "helpful_votes": 0,
      "publication_date": 20180803
    },
    {
      "title": "Works Great For Me!",
      "text": "For the money, this grinder gets the job done! I use it on rotary lawn mower blades, pruners, shears, scissors, etc. Should have bought one years ago and saved money. This has already paid for itself with two mower blade sharpenings! Light is a very helpful addition and the motor is really quiet. Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "ResvorDog",
      "helpful_votes": 0,
      "publication_date": 20190412
    },
    {
      "title": "Frozen quicker that it took me to unload it!",
      "text": "Purchased this while hoping that some of the negative reviews would not connect with me. Oh well! Enjoyed the easy set-up but when I turned the switch the motor seized up within 10 seconds. Am in the process of returning for a refund!",
      "rating": 1.0,
      "verified": true,
      "author": "kevin hutchinson",
      "helpful_votes": 9,
      "publication_date": 20170114
    },
    {
      "title": "Great for around the house projects!",
      "text": "Great for around the house projects. I just needed to sharpen some lawnmower blades, scissors, shears and keep other things clean around the house. It's perfect for the job.",
      "rating": 4.0,
      "verified": true,
      "author": "Jeff R.",
      "helpful_votes": 0,
      "publication_date": 20201010
    },
    {
      "title": "Cheap wheels but works great",
      "text": "Wheels that come on are cheap but unit works well. It ir quiet and works really great but I wore the original wheels out in 2 days just rounding edges on flat steel project.",
      "rating": 3.0,
      "verified": true,
      "author": "Joshua Jones",
      "helpful_votes": 0,
      "publication_date": 20200909
    },
    {
      "title": "So easy to setup and very sturdy",
      "text": "Absolutely amazing product, and the price is unbeatable. Most of these are around 150+ and that's with no light. I absolutely love this little tool, and the orange adds to my collection of tools from tacklife even though this is a WEN product.",
      "rating": 5.0,
      "verified": true,
      "author": "Farrell",
      "helpful_votes": 0,
      "publication_date": 20200724
    },
    {
      "title": "Run, Don’t Walk",
      "text": "This is a good grinder. I use it more often than I thought I would. It’s a great conversation starter, and it is more fun to use when buffing out adhesives on drywall. Run, don’t walk, to get this snazzy little grinder for use in your kitchen cupboards.",
      "rating": 5.0,
      "verified": true,
      "author": "Knuckleheadpa",
      "helpful_votes": 0,
      "publication_date": 20200217
    },
    {
      "title": "Economical grinder",
      "text": "Well packaged. Easy assembly,with only a phillips screwdriver and small crescent wrench. Brought an abused slot srewdriver to like new in minutes. A bit more clumsy and I might have made a swell ice pick instead. Just fine for my occasional need for a grinder. Just set it on the work bench, plug it in and watch it spin, vibration free and no \"walking around.\" Simple and effective. One complaint: grinder has to be running for the light to work; grinder off, no power to the light. Seems like a good tool for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "SoCalBill",
      "helpful_votes": 0,
      "publication_date": 20160714
    },
    {
      "title": "Great 1st Bench Grinder",
      "text": "This is a great 1st bench grinder. It doesn't have a lot of power. You also need to take caution if you change the wheels that you have it balanced on each side or it will vibrate really heavily.",
      "rating": 4.0,
      "verified": true,
      "author": "Jimmy Johnson",
      "helpful_votes": 0,
      "publication_date": 20200602
    },
    {
      "title": "You'll get more than you pay for",
      "text": "Even though I was looking for an inexpensive base model grinder for my home shop. I ended up with a grinder which hasn't had trouble with anything I've asked it to do! Minor assembly when getting started but all went together easily. It runs quietly with no major vibrations. Everything is easily adjustable. spark guards, eye shields and the work rest platforms.",
      "rating": 5.0,
      "verified": true,
      "author": "James R. Ellenbacher",
      "helpful_votes": 0,
      "publication_date": 20180628
    },
    {
      "title": "Great for the price.",
      "text": "Great grinder for the price. I got this mostly to sharpen lawnmower blades. It made quick work of that task. Make sure to balance your blades after and you will have well sharpened blades in no time. I attached it to my work bench in a couple minutes. I’m very happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Tommy",
      "helpful_votes": 0,
      "publication_date": 20190602
    },
    {
      "title": "Annoying little problem...",
      "text": "The bench grinder is fine, but the work light doesn't work. Call to manufacturer, new light being shipped.",
      "rating": 3.0,
      "verified": true,
      "author": "Quotashare, Hill Country Texas",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "Beautiful!",
      "text": "Pretty unreal for the price. Works well. Bigger and heavier than I thought. But of course \"Made in China\". Everything is \"Designed by Americans\" because we are the innovators. Profits by both countries. Cannot buy it made here because unions ruined this country with greed. Welcome to the 21st Century........",
      "rating": 5.0,
      "verified": true,
      "author": "T. Treanor",
      "helpful_votes": 0,
      "publication_date": 20190220
    },
    {
      "title": "4 out of 5 Stars!",
      "text": "This is a great little grinder and I highly recommend it. The only reason that I gave it 4 stars instead of three is because of the screws that hold the plastic guard. They are too long. When trying to put them on, the bolts will contact the wheel and make it impossible for them to turn. I had to cut some length off of the bolts and now it works perfectly. It's a small defect, but not one that would keep me from buying this model again.",
      "rating": 4.0,
      "verified": true,
      "author": "Bill D.",
      "helpful_votes": 0,
      "publication_date": 20170508
    },
    {
      "title": "Great Grinder!",
      "text": "Just perfect for what I need as a handyman and homeowner. Sharpen chisels, tools and knives. So far so good...runs smooth and quiet and simple set up. Can't beat the price!",
      "rating": 5.0,
      "verified": true,
      "author": "Steve",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "Nice buy and quality",
      "text": "I actually don’t use the light, seemed to get in the way more but a very nice bench grinder I’ve been using for about two years now with no issues. Haven’t even had to change the stones yet, but when I do I’ll definitely buy from here again",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191111
    },
    {
      "title": "Works well but slow to start up.",
      "text": "Grinder is decent for the occasional user. On start up wheels take a minute to get up to speed also when applying force to the piece being grinded on the machine starts to bog down. After assembly I had a bit of a wobble in the right wheel that I had to fix but after that it went away and has not returned. Product is not a bad machine for the price but again this is for the occasional DIY user not something for heavy shop use.",
      "rating": 5.0,
      "verified": true,
      "author": "michael bennett",
      "helpful_votes": 0,
      "publication_date": 20190829
    },
    {
      "title": "Works great easy to use and awsome price",
      "text": "Easy to put together. Very compact very sturdy and we'll built. Great for sharpening my axes or other stuff .also good for smoothing metal surfaces. Enough power for the average guy that needs tools and blades sharp",
      "rating": 5.0,
      "verified": true,
      "author": "Jeremy robert davenport",
      "helpful_votes": 0,
      "publication_date": 20201018
    },
    {
      "title": "I don't always like buying cheap tools but I'm really glad I picked ...",
      "text": "I don't always like buying cheap tools but I'm really glad I picked this up. Take a look at every bench grinder you see in the stores & then take a look at this one, they're nearly all the same! It's essentially a motor with shafts out either side that you put your discs on, there's not much to fork up on these so don't spend more than you need to.",
      "rating": 5.0,
      "verified": true,
      "author": "tllong2",
      "helpful_votes": 2,
      "publication_date": 20161205
    },
    {
      "title": "Both wheels wobble",
      "text": "After checking and rechecking both wheels wobble. Corse one wobbles enough to be completely useless and had chips missing. Either I get a lemon or there are fake reviews?",
      "rating": 2.0,
      "verified": true,
      "author": "K M",
      "helpful_votes": 0,
      "publication_date": 20200628
    },
    {
      "title": "Nice grinder",
      "text": "I bought this because I do a lot of my own up keep on my vehicles and lawn mowers. I had specifically bought this to sharpen the blades on my lawn mower. I have used several times and it has done a nice job for me.",
      "rating": 5.0,
      "verified": true,
      "author": "allen",
      "helpful_votes": 0,
      "publication_date": 20200924
    },
    {
      "title": "Nice Little unit.",
      "text": "I like the size and quality of this unit. I replaced the grinding wheels with wire wheels, as was my intent when I purchased it. Built solid and does the job. Put in on a HFT grinder pedestal and it fit perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "raylap",
      "helpful_votes": 0,
      "publication_date": 20181111
    },
    {
      "title": "LIGHT-DUTY GRINDER",
      "text": "THIS IS A VERY LIGHT-WEIGHT GRINDER, NOT FOR HEAVY, RUGGED WORK....GOOD FOR MAYBE HOBBY WORK, REALLY HARD TO ACCESS HOLD-DOWN BOLTS FOR MOUNTING. IT DID RUN SMOOTH WITH VERY LITTLE VIBRATION. WOULD LIKE TO SEE HEAVIER, MORE SOLID TOOL RESTS. BUT WHAT DO YOU EXPECT FOR $40.",
      "rating": 3.0,
      "verified": true,
      "author": "missouripop",
      "helpful_votes": 0,
      "publication_date": 20190411
    },
    {
      "title": "vibration",
      "text": "several 5 start reviews said \"smooth\". mines not. vibrates badly. tools walk across my work table while its running. im sure its the stones over the unit, but regardless now wish i had paid for a better one.",
      "rating": 1.0,
      "verified": true,
      "author": "data",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "Good but for the price",
      "text": "I bought to sharpen stump grinder teeth and it does ok. Has enough power to do what I need. I would say if your going to be doing a lot of grinding to spend the extra money and buy a good grinder. The motor part on this one is good and the light is nice but wheel guards are cheap and flimsy. But you get what you pay for. Over all happy with product.",
      "rating": 3.0,
      "verified": true,
      "author": "Joey S.",
      "helpful_votes": 0,
      "publication_date": 20180702
    },
    {
      "title": "Not bad for hobby applications",
      "text": "Ok for works needed by a typical homeowner or for hobby application. Not heavy duty but has advanced safety features which is good. Not a bad product do far.",
      "rating": 3.0,
      "verified": true,
      "author": "Las Vegas Engineer",
      "helpful_votes": 0,
      "publication_date": 20200828
    },
    {
      "title": "Replacement spun up fine but had a wobbly grinder wheel",
      "text": "First one of these I ordered did not spin up to speed. Returned it. Replacement spun up fine but had a wobbly grinder wheel. Returned that one as well. Gave up on WEN and bought a different brand.",
      "rating": 1.0,
      "verified": true,
      "author": "Peter K",
      "helpful_votes": 13,
      "publication_date": 20170524
    },
    {
      "title": "Not super powerful, but gets the job done",
      "text": "Not super powerful, but gets the job done. Seems very well balanced as it does not shake when turned on (no load). Work light is nice to see what is being sharpened. I have several wire brushes and buff pads for it, but have not changed from the ones that came on it.",
      "rating": 4.0,
      "verified": true,
      "author": "PrimeShopper",
      "helpful_votes": 2,
      "publication_date": 20170705
    },
    {
      "title": "No power...",
      "text": "I have used this many time since receiving it and I am ALWAYS disappointed. It doesn’t even have enough power to use a wire wheel much less the stone wheel. It bogs down with the very little pressure.",
      "rating": 2.0,
      "verified": true,
      "author": "James Pommerer",
      "helpful_votes": 2,
      "publication_date": 20190430
    },
    {
      "title": "You need to make your own mounting holes",
      "text": "Light weight Dislike mounting holes. It’s under the motor housing so unable to get bolts to screw it to your work bench",
      "rating": 5.0,
      "verified": true,
      "author": "Ron ",
      "helpful_votes": 0,
      "publication_date": 20200128
    },
    {
      "title": "Great little bench grinder",
      "text": "Love this bench grinder, it does everything that I need it to do. The light even comes on if the grinder is not running, very convenient.",
      "rating": 5.0,
      "verified": true,
      "author": "T.",
      "helpful_votes": 0,
      "publication_date": 20200822
    },
    {
      "title": "WEN makes excellent tools.",
      "text": "I have the WEN rotary, now I have this and it was so much cheaper than it's closest competitor that I thought it was a scam at first. Just buy it and you will thank me later.",
      "rating": 5.0,
      "verified": true,
      "author": "LTLTop Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20200307
    },
    {
      "title": "Nice little grinder",
      "text": "Glad I got the 6-inch grinder as that is all that I will ever need for sharpening or minor grinding. Nice rubber feet to hold the grinder in place while it is on. Smooth with good power. At the asking price, it is a real bargain!!!! 5 stars!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff Sullivan",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "Good bench grinder for the price.",
      "text": "I needed this grinder to sharpen turning tools and it'll work just fine. I does vibrate so make sure you mount it to a good, heavy bench and not the POS Stand that is sold separately (review up next). Again, the grinder is good, DO NOT GET THE STAND!",
      "rating": 4.0,
      "verified": true,
      "author": "Kevin L. Mcglothlin",
      "helpful_votes": 0,
      "publication_date": 20190730
    },
    {
      "title": "Missing one thing.",
      "text": "Not to loud, sturdy design. My own complaint is that it didn't come with it own brush wheel but not that big of a problem.",
      "rating": 5.0,
      "verified": true,
      "author": "Maria L",
      "helpful_votes": 0,
      "publication_date": 20200919
    },
    {
      "title": "Great for small work areas like mine!",
      "text": "Quite happy with this purchase. As advertised, it is pretty quiet for a bench grinder. I enjoy having the light though wish it operated independently from the motor so I could also use it as a bench light when not in use. It's well balanced and doesn't vibrate around, the rubber feet are perfect for tiny work areas like mine where I don't have space to permanently mount to a table top and need to move it around when needed or not in use.",
      "rating": 5.0,
      "verified": true,
      "author": "L. Lorden",
      "helpful_votes": 0,
      "publication_date": 20161112
    },
    {
      "title": "How can they make these for so cheap?",
      "text": "I don't understand how this awesome grinder can be priced so low. It's a quality product WITH a light arm attached AND 2 grinding disks already installed. I'm pleased with my grinder, and it matches my Wen drill press!",
      "rating": 4.0,
      "verified": true,
      "author": "Mazduhz",
      "helpful_votes": 0,
      "publication_date": 20190809
    },
    {
      "title": "Gooseneck Lamp won’t Remain in Position",
      "text": "Seems fine in all respects except for gooseneck lamp which will not remain in place when machine is vibrating in use.",
      "rating": 3.0,
      "verified": true,
      "author": "Jayrbee",
      "helpful_votes": 0,
      "publication_date": 20200929
    },
    {
      "title": "This bench grinder is good",
      "text": "I have owned a couple different brands of bench grinders over the years and can honestly say, this WEN bench grinder is very good",
      "rating": 5.0,
      "verified": true,
      "author": "Vitaley O.",
      "helpful_votes": 0,
      "publication_date": 20200707
    },
    {
      "title": "Great product",
      "text": "Great product! The instructions say to have the gaurd no further than 1/16th of an inch away from wheel and to use a 1/4” bolt to bolt it down but the bolts they provide you with, are freaking metric!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Eric Klingensmith",
      "helpful_votes": 0,
      "publication_date": 20190902
    },
    {
      "title": "Decent bench grinder",
      "text": "Why the heck does WEN make it so that the grinder has to be running in order to turn the light on.. Jeeebus that's annoying, other than that the thing is as expected. Didn't come with a bulb for those expecting that it would. I own several WEN products, they all work but you get what you pay for. I would recommend it to others.",
      "rating": 4.0,
      "verified": true,
      "author": "D33PZ3R0",
      "helpful_votes": 0,
      "publication_date": 20180307
    },
    {
      "title": "Not bad for a small grinder",
      "text": "This grinder is small, hence the low price. I do wish it was more powerful but for small light duty it’s not bad.",
      "rating": 4.0,
      "verified": true,
      "author": "Matthew T",
      "helpful_votes": 0,
      "publication_date": 20200928
    },
    {
      "title": "pretty great - cant beat the price",
      "text": "the setup was about 3 minutes. The hardest part I had was putting on a wire wheel as both wheels are on the same axle. however once on - it was relatively stable and steady. had no issues and love the cheap thing.",
      "rating": 4.0,
      "verified": true,
      "author": "a dahlin",
      "helpful_votes": 0,
      "publication_date": 20200204
    },
    {
      "title": "power",
      "text": "while this unit may be great for small jobs it does not work well-sharpening lawnmower blades.the unit bogs down and is not powerful enough. This unit is made for smaller jobs and seems to work all right on knives that do not require heavy pressure.",
      "rating": 3.0,
      "verified": true,
      "author": "randy knight",
      "helpful_votes": 0,
      "publication_date": 20190622
    },
    {
      "title": "One small complaint.",
      "text": "Does a good just I just wish the work light turned on. Without turning the grinder on. Hard to complain but I did anyway.",
      "rating": 4.0,
      "verified": true,
      "author": "Andy",
      "helpful_votes": 0,
      "publication_date": 20190606
    },
    {
      "title": "What I like about it is that it is quiet compact and ...",
      "text": "It's a bench grinder. I don't have a big budget so this fit the bill. What I like about it is that it is quiet compact and fits the WEN stand 4288 just fine. What I don't like is that the tool rest is small and not really adjustable for angle grinds.",
      "rating": 4.0,
      "verified": true,
      "author": "Steve",
      "helpful_votes": 2,
      "publication_date": 20170425
    },
    {
      "title": "Handy little grinder",
      "text": "Lots of parts to put together but good directions on how to do it. Runs smooth once it reaches high speed but shakes a bit when first starting out. The rubber base tabs absorb the vibration well and keeps the grinder from moving around on the table top while in use.",
      "rating": 4.0,
      "verified": true,
      "author": "Phil",
      "helpful_votes": 0,
      "publication_date": 20181004
    }
  ],
  "product_meta": {
    "title": "WEN 4276 2.1-Amp 6-Inch Bench Grinder with Flexible Work Light",
    "description": "Style:With LightRemember when you spent all that money replacing dull rusty tools? From deburring ragged edges to cleaning objects to sharpening blades, the WEN 6-inch Bench Grinder is the ideal companion for any workshop. These machines allow for simple resuscitation of dull blades, scissors, screwdrivers, and more. Compact yet powerful, the WEN 6-Inch Bench Grinder provides reliability even in the face of the most difficult tasks. Our package includes two 6-inch by 3/4-inch wheels: a 60-grit wheel for material removal and general purpose grinding and a coarse 36-grit wheel for faster material removal. With our quiet 2.1 amp motor, expect quick startups, smooth performance and steady speeds of 3450 RPM. This fast speed is ideal for deburring unwanted edges and rust removal. Built with you in mind, our design makes wheel guard removal simple for easy wheel changes. The included eye guards can adjust to prevent them from interfering with your project. Also, don't forget about the flexible work light helping to illuminate your grinding for an increase in accuracy and precision. Of course, as with all WEN Products, our 6-Inch Bench Grinder is covered with a two-year warranty, a friendly and knowledgeable customer service hotline and a national service network. No need to waste anymore money on new tools. The WEN 6-Inch Bench Grinder will save you money by leaving all of your tools as sharp and clean as the day you bought them. Remember when your blades could actually cut through something other than butter? Remember WEN.",
    "rating": 4.5,
    "feature_bullets": [
      "2.1-Amp motor",
      "3450 RPM at no load",
      "6 in. by 3/4 in. wheels, 1/2 in. arbor size",
      "Lightweight design weighs in at 16 lb.Lamp:120V, 40W (Bulb not included)",
      "Worklight for maximum precision and visibility"
    ],
    "specifications": {
      "Manufacturer": "WEN Products",
      "Part Number": "4276",
      "Item Weight": "4 pounds",
      "Product Dimensions": "14 x 9.75 x 15 inches",
      "Item model number": "4276",
      "Is Discontinued By Manufacturer": "No",
      "Size": "6-Inch",
      "Style": "With Light",
      "Material": "Iron",
      "Item Package Quantity": "1",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "Warranty Description": "2 year",
      "ASIN": "B00LPFIPQ0",
      "Customer Reviews": "4.5 out of 5 stars1,767 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#3,404 in Tools & Home Improvement",
      "Domestic Shipping": "Item can be shipped within U.S.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S. Learn More",
      "Date First Available": "July 10, 2014"
    },
    "categories": [
      "Bench Grinders",
      "Power Tools",
      "Tools & Home Improvement",
      "Power & Hand Tools",
      "Grinders"
    ],
    "price": 42.85
  }
}