{
  "website_summaries": [
    {
      "verdict": "A top contender for an all-in-one washer and dryer that works well and has plenty of options.",
      "pros": [
        "Consumers praise the flexibility and convenience of this model, reporting that it cleans well and is versatile enough for many different items",
        "We love the space-saving design, and it also has the bonus of eliminating static during the drying cycle",
        "Comes with a convenient storage drawer"
      ],
      "cons": [
        "Tends to take longer to dry than standard models",
        "Some consumers reported having difficulty with pet hair accumulating in the unit"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Excellent Investment!!",
      "text": "LOVE THIS MACHINE!!!!! Definitely a great investment!! I've read the reviews over and over before I brought because I was a little skeptical at first because of what people was saying about how this machine doesnt dry well. I can honestly say, I have a family of 6, 3 being teenagers and we use this machine constantly, never had a problem with the dryer!!!!Love Love Love this Machine. Love the fact it can be set to continue to dry once the wash cycle is finish!!",
      "rating": 5.0,
      "verified": true,
      "author": "Goldie T",
      "helpful_votes": 38,
      "publication_date": 20170404
    },
    {
      "title": "Faulty Pump has been replaced 4 times.",
      "text": "This Washer\\Dryer has a fatal flaw with its pump. It uses a plastic impeller which has broken on our machine 4 times. Twice it was covered with warranty and twice I've done it myself (Search: LG 4681EA2001T Drain Pump Washing Machine). It's difficult and annoying to continue to replace these every 3 to 6 months. We are _avid_ about cleaning the lint trap and ensuring pockets are empty in clothing. I'm so frustrated with this thing. Save yourself. I'm literally about to tear it down again to replace the 4th one, and thought I might save you some trouble as well.",
      "rating": 1.0,
      "verified": true,
      "author": "George E.",
      "helpful_votes": 19,
      "publication_date": 20190226
    },
    {
      "title": "What could be better?",
      "text": "We have had our LG Ventless Washer/Dryer for about a month now. We LOVE IT. Used it with the pedestal from day one, and as a result, have had clothes/towels/sheets come out dry. If we had a bigger house, or a dryer vent, we might not have chosen this because of the price. Frankly, we would have been missing out.",
      "rating": 5.0,
      "verified": true,
      "author": "Lindsey",
      "helpful_votes": 24,
      "publication_date": 20170106
    },
    {
      "title": "could not be happier. Arrived packed well",
      "text": "Fabulous, could not be happier. Arrived packed well . Anyone considering this do it it is the best washer dryer I have ever had. This is not a new concept the combination washer dryer, my mother had one in 1965. I remembered it. This one performs better than expected. The modern features of steam, sometimes it tells me what to do better for that wash!! It's great, just buy it. I have not had one problem. The lint filter concerned me, but it is very easy. Load size, you will be surprised it is not much smaller than my extra large capacity ones that are in the lower level and not used much at all now.",
      "rating": 5.0,
      "verified": true,
      "author": "cc",
      "helpful_votes": 17,
      "publication_date": 20160920
    },
    {
      "title": "Complete garbage.",
      "text": "What a piece of junk. Drain pump went out at 16 months old immediately followed by the main logic board. Hundreds of dollars in repair work just after the \"Warranty\" expired. Also have a Maytag pair from 2001 which have never had a single issue. Garbage. Avoid.",
      "rating": 1.0,
      "verified": true,
      "author": "Ireviewedit",
      "helpful_votes": 14,
      "publication_date": 20180703
    },
    {
      "title": "Repeated Drain Pump Failure!!",
      "text": "Works fine - but I have replaced the drain pump twice on both my machines!!! Royal Pain!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Jon Hornbeck",
      "helpful_votes": 15,
      "publication_date": 20180702
    },
    {
      "title": "Either elevate the washer or lower where the drain tubs goes",
      "text": "Dont listen to people claiming it takes 3 hours to dry small loads. The issue is this washer does not have a powerful drain pump ( and you may need to replace the drain pump ~$30 every couple years when it fails because it will). So you will need to make sure the washing machines drain tube is as LOW as possible. It will not be able to push water out to a drain higher two feet which most drains are over that high. So you can do what I did and buy a grey water pump to push water to where it needs to go.",
      "rating": 4.0,
      "verified": true,
      "author": "Kris Hinds",
      "helpful_votes": 0,
      "publication_date": 20200521
    },
    {
      "title": "Works great...for me1",
      "text": "Worked as other reviews indicate. Yes, the slightly damp feel is odd at first but quickly goes away. I have yet to use extensively so can post an update after a few months. easy set-up and easy to use. Potential issue I want to play with more is getting clothes more wrinkle-free if a load is left overnight. Full disclosure: I am single man so concept may not be as usable for larger families unless you want to do lots of smaller loads.",
      "rating": 5.0,
      "verified": true,
      "author": "John J.",
      "helpful_votes": 3,
      "publication_date": 20180816
    },
    {
      "title": "Awesome laundry machine 😘",
      "text": "I had been researching this machine for about 2 years before buying it. 🤔 I need 110v with no wall vent required for the next trailer I plan to buy later this year. I wish I had bought it sooner, it's fabulous!🥰 I read the book first to learn about all the programing options, and every load has come out perfect using only 1 Tide Pod. I have the drain hose emptying into my bathroom sink (33\" high), it works well and my clothes are dry. It replaced a 12 year old LG front loader set (still working well, so I donated the set). I would buy this machine again.",
      "rating": 5.0,
      "verified": true,
      "author": "soloangel58",
      "helpful_votes": 0,
      "publication_date": 20200324
    },
    {
      "title": "Love this machine",
      "text": "Love this machine! This is the second one I have purchased. When I sold my last house buyer wanted it so I needed to buyer a second one.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 7,
      "publication_date": 20170401
    },
    {
      "title": "Love it",
      "text": "Delivery was prompt, and the machine was easy to set up and use. Very quiet and surprisingly effective as a dryer. The capacity is fantastic; just don't overload it. We love it.",
      "rating": 5.0,
      "verified": true,
      "author": "peter burka",
      "helpful_votes": 8,
      "publication_date": 20160416
    },
    {
      "title": "Takes Longer than a Traditional Washer/Dryer",
      "text": "I'm only giving it 4 stars and not 5 because it takes a long time for it to wash and dry one load. Usually 4-5 hours! However, it works just as well as the normal washer and dryer and doesn't take up as much space! It is also very nice looking, and as long as you put the drain in the floor, clothes come out dry every time. It will have a tiny bit of humidity on it when it comes out. Shake it once and it's dry. Make sure to clean the lint off the gasket every once in awhile and run a clean washer cycle as well. We've had this almost a year now, and no problems.",
      "rating": 4.0,
      "verified": true,
      "author": "j",
      "helpful_votes": 12,
      "publication_date": 20160824
    },
    {
      "title": "I'm In Love",
      "text": "The machine works great. The only reason I left out a star is simply because I feel LG can improve on some features if possible. The thing that bothers me the most is that I can not child lock the power button and I know this is not possible on many machines but I don't really see the point if my kid can just cut the whole thing off anyway. Two ideas here, place the power button on top or give the machine memory that remembers where it was last even if cut off. I guess no relationship is perfect.",
      "rating": 4.0,
      "verified": true,
      "author": "HB",
      "helpful_votes": 5,
      "publication_date": 20160603
    },
    {
      "title": "THIS WASHER AND DRYER IS THE BEST. The spen isn't like what I worried",
      "text": "I am living in apartment. I never thought there's a washer and dryer combo, until I saw in the apartment manager room. The I did some research and I found this. THIS WASHER AND DRYER IS THE BEST. The spen isn't like what I worried. The best combo.",
      "rating": 5.0,
      "verified": true,
      "author": "bucchie",
      "helpful_votes": 5,
      "publication_date": 20170324
    },
    {
      "title": "I'd buy again!",
      "text": "I was so limited for space... this was my only option. And I LOVE IT! we do a load or two every day. I try and line dry as much as possible. When I use this machine, after the dry cycle the cloths seem damp, but they dry in moments. Its capacity it really great! We don't overpack it, and favour lighter loads if we use the dry option. Been using \"pods\" detergent. And it's cool looking! We did buy the base too... but the machine itself has decent height. Oh... and Shipping and transport were flawless.",
      "rating": 5.0,
      "verified": true,
      "author": "Theresa",
      "helpful_votes": 0,
      "publication_date": 20200416
    },
    {
      "title": "Cannot live without now!!!",
      "text": "Absolutely love this unit sitting on the bottom height booster!! Placed on main floor of house so we not longer have to attack stairs to wash and fetch clothing ---old age concession!!! Very happy we made the decision to go ahead with this. Very successful decision with larger washing capacity that one might have expected from a unit this size.",
      "rating": 5.0,
      "verified": true,
      "author": "Cannot live without",
      "helpful_votes": 2,
      "publication_date": 20180812
    },
    {
      "title": "LG STANDS FOR LOOKIN GOOD - AND A GREAT VENDOR",
      "text": "This might be a little early for a review but i have had this machine for about two months and it works great! I also purchased the base drawer unit which makes it really easy to use.. After setting it up i actually have to go check on it becuase it is much too quiet for an operating machine, but... it is working as advertised. The vendor was really good about explaining what to expect when the machine arrives and how to check it out carefully before signing the delivery acceptance.",
      "rating": 5.0,
      "verified": true,
      "author": "richard rochat",
      "helpful_votes": 0,
      "publication_date": 20170810
    },
    {
      "title": "Proceed with caution and understand how this unit dries clothes",
      "text": "Spent 2 weeks trying to figure the right settings to avoid the worst wrinkled clothing. Clothes wash and dry but it is odorous, excessive surface heat and excessive wrinkled clothing. I have used just “cold only” water setting only to have the unit almost steam dry clothing usually setting in wrinkles. I had it professionally installed and paid for a pedestal to ensure water flow from the pump when drying wasn’t an issue as described by other owners. Getting ready to call LG after exhausting every recommendation.",
      "rating": 2.0,
      "verified": true,
      "author": "Philip Jones",
      "helpful_votes": 2,
      "publication_date": 20171221
    },
    {
      "title": "3 break downs in 2.5 years!",
      "text": "Though I would love this machine, but it has been nothing but problems! Each repair was a different thing , mostly computer related. This last time It was not able to be repaired. I purchased the SQARE TRADE Warranty, Now I am waiting to get this resolved. They are supposed to give me the purchase price! Back to a conventional machine for me",
      "rating": 1.0,
      "verified": true,
      "author": "patty",
      "helpful_votes": 0,
      "publication_date": 20200811
    },
    {
      "title": "Love it!",
      "text": "Many reviews for this unit online say it doesn't dry clothes. I have only had that issue once and it was due to overfilling the unit. The drum is meant to be packed gently and only to the marked line. The instructions clearly state that. Excess water is pumped out of the drain tube just fine even when the tube is angled up. Follow the instructions like you're supposed to and there won't be any issues.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Gage",
      "helpful_votes": 13,
      "publication_date": 20170101
    },
    {
      "title": "i find that disturbing on a great number of levels",
      "text": "it sings when its done. i find that disturbing on a great number of levels. besides that amazing combo, runs quiet and at least sings on key.",
      "rating": 4.0,
      "verified": true,
      "author": "Ben",
      "helpful_votes": 3,
      "publication_date": 20180529
    },
    {
      "title": "This is the best investment I have made in a long time",
      "text": "This is the best investment I have made in a long time. Purchased this unit for my grooming salon to wash towels and dog beds and I couldn't be happier. Well made, easy to use and it makes our job so much easier with the wash then dry features. We're never out of towels and they are clean and sanitized just like we want!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171106
    },
    {
      "title": "Do not buy this from Amazon.",
      "text": "Do not buy this from Amazon. Three months after I got mine, the drain pump stopped working. Appliance Giant has not responded to my request for servicing information. Fifteen hundred for 3 months of clean clothes is not a good deal when all you get is no contact from seller and no clue of how to get it repaired if it stops working.",
      "rating": 1.0,
      "verified": true,
      "author": "Snowden",
      "helpful_votes": 0,
      "publication_date": 20200801
    },
    {
      "title": "I would highly recommend this machine",
      "text": "I would highly recommend this machine. We had a junk Haier that we replaced with this one and are very pleased with it. We can now do whole loads of laundry again. The trick with any of these machines is to take the laundry out as soon as the dryer finishes.",
      "rating": 5.0,
      "verified": true,
      "author": "Driveinfilm",
      "helpful_votes": 11,
      "publication_date": 20160229
    },
    {
      "title": "A Fine Replacement Washer/Dryer",
      "text": "I was looking for something to make it easier for my mother to do her laundry, and this combo unit on a pedestal (bought separately) was just the trick. After a couple of weeks of getting used to the new machine she seems quite happy with it. Excellent machines, runs quickly and quietly, fairly easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Steven Woodcock",
      "helpful_votes": 0,
      "publication_date": 20200531
    },
    {
      "title": "Would gladly recommend!",
      "text": "Absolutely perfect for a small space. Handles much more than expected and results are terrific. Couldn't be more pleased. We did not have a dryer vent access in our rental condo unit so this option without the need for one was amazing. Grabbing the clothing out as soon as it is finished has all but eliminated any wrinkling concerns. This machine does as good or better than my full sized units at our full time residence.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200610
    },
    {
      "title": "Perfect!",
      "text": "I totally love this. I have recommended it to others. Keep in mind there is a learning curve especially with drying but I have had no major issues with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20161227
    },
    {
      "title": "Quit working in less than a year!",
      "text": "We thought this machine would be a good option since just two of us but it takes too long to dry and if clothes not removed promptly, wrinkling issues. We purchased less than a year ago and the bearing has gone out. Should be covered under warranty but LG only going to pay repair shop $90 for $350 needed repairs.",
      "rating": 1.0,
      "verified": true,
      "author": "Brian J.",
      "helpful_votes": 2,
      "publication_date": 20190919
    },
    {
      "title": "... live in a very small cottage and this is perfect for us",
      "text": "We live in a very small cottage and this is perfect for us!! The seller was absolutely fabulous!! Answered all my questions and was so helpful. Super fast shipping too - ordered it on a Friday and it was delivered on a Tuesday! The machine does a great job getting our clothes clean (which says a lot since we are farmers and our clothes get DIRTY). ;)",
      "rating": 5.0,
      "verified": true,
      "author": "Tlaing",
      "helpful_votes": 0,
      "publication_date": 20171108
    },
    {
      "title": "Quit Drying after Warranty Expired",
      "text": "The drying feature worked great for a year, but literally 3 three weeks after the warranty expired it quit drying! :{",
      "rating": 1.0,
      "verified": true,
      "author": "JLJ",
      "helpful_votes": 7,
      "publication_date": 20181127
    },
    {
      "title": "A money saver",
      "text": "It is super silent, super economic, as I didn't se big changes in my energy bill, and uses way less water than a regular washer, even though it uses water to dry the clothes, and it is economic when talking about soap too. Of course it takes more time to do the whole cycle, but once you put the dirty clothes in it, the only thing you have to do next, is take them out when do whatever you usually do, fold it or not. The clothes come out completely dry, and it keeps the smell of clean clothes.",
      "rating": 5.0,
      "verified": true,
      "author": "J S",
      "helpful_votes": 0,
      "publication_date": 20200626
    },
    {
      "title": "Overal a good all in one machine.",
      "text": "I read many reviews for this item before purchasing. I like not having to worry about needing to run a vent to the outside. Like many other reviews state, it does take a little longer to wash and dry than doing it in two separate machines. Thinking about getting that pedelstle to help with the drying time. When it finishes, the clothes may seem a little damp but as soon as you take them out to fold, they dry out. Still getting used it. I would recommended this product.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 7,
      "publication_date": 20150805
    },
    {
      "title": "Great solution for a small space and two people",
      "text": "Works great for two people. The dry cycles times are fairly lengthy as other reviewers have commented. I wouldn’t recommend this machine for war climates it does put off a tremendous amount of heat when drying. Other reviewers have commented that clothes feel damp when first removing them from the dryer, while this is true if you remove clothes when they are still warm and give them a shake they will be perfectly dry.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180706
    },
    {
      "title": "After 6 weeks.. a great machine.",
      "text": "As advertised. If you follow instructions and don't overload the machine it works fine. I wouldn't recommend for a large family because it will take a little longer than conventional appliances. I also believe it will prolong the life of your clothing, items come out a little damp. After a few whisps of air they are dry. With the delay start you can time the load to be ready when you awake the next day.",
      "rating": 5.0,
      "verified": true,
      "author": "jim lawson",
      "helpful_votes": 5,
      "publication_date": 20150818
    },
    {
      "title": "Not worth the hassle",
      "text": "I highly recommend NOT buying this machine. I have had a lot of trouble with this machine. I bought it just over a year ago and it has had several service calls the most recent one has yet to solve a drainage problem. The machine isn't working, nobody within 50miles of my house can repair it, its no longer under warranty and the company that sold to me will only accept it back if it is returned in its original packaging. Buyer Beware!",
      "rating": 2.0,
      "verified": true,
      "author": "Nicky Roberts",
      "helpful_votes": 0,
      "publication_date": 20200203
    },
    {
      "title": "You have to take the wrinkles with the good",
      "text": "Wrinkles my clothes like crazy. Luckily I am just a shop guy where clothes doesn't matter. If I was an office person or similar, I'd have to iron every load. Also the lint gets out of hand sometimes. Even still, I love the digital display and options such as delay wash",
      "rating": 5.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20190426
    },
    {
      "title": "My fiancee and I love this thing",
      "text": "My fiancee and I love this thing! Though it does take longer to dry, I really don't feel the difference. We live in an apartment with a common laundry room which we can now avoid entirely, saving us time and frustration from waiting for available machines!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 7,
      "publication_date": 20160305
    },
    {
      "title": "Will Make Most of Your Wishes Come True",
      "text": "This is the most amazing creation upon which I have ever laid eyes. It works well. I think my only critiques would be that some lint may get on the clean clothes (there is no traditional lint trap) and that the machine is incapable of posting updates to Facebook. 10/10 would, well, hopefully not buy again because 'spensive, but zero regrets on buying this one (other than not planning on how to get it down stairs, but irrelevant for this review).",
      "rating": 5.0,
      "verified": true,
      "author": "John D. Volosin",
      "helpful_votes": 2,
      "publication_date": 20180221
    },
    {
      "title": "Delivery for this was almost impossible, I wouldn't do it again",
      "text": "I love the washer I've had it for about a year or so and everything works. one thing to note is that if you stuff the washer and you dont use fabric softener the clothes come out extremely wrinkled. love not having to switch the laundry from washer to dryer.",
      "rating": 4.0,
      "verified": true,
      "author": "jorge galvan",
      "helpful_votes": 0,
      "publication_date": 20191219
    },
    {
      "title": "Great machine",
      "text": "Love this machine. Just put everything in and come back later, all done. It is not fast, taking 2.5-3 hours for a load, but thats washing and drying together. I use the \"more dry\" setting and everything comes out perfect. Takes up half the space and I can set it up when I leave and everything is done when I come back.",
      "rating": 5.0,
      "verified": true,
      "author": "Midnight",
      "helpful_votes": 3,
      "publication_date": 20151105
    },
    {
      "title": "It does what it says it does !",
      "text": "I love this washer dryer It works so well . My clothes are clean and dry at the end of the cycle I wouldn’t take a million dollars for it Really great product!",
      "rating": 5.0,
      "verified": true,
      "author": "Sadie",
      "helpful_votes": 0,
      "publication_date": 20200524
    },
    {
      "title": "Fantastic machine!",
      "text": "Fantastic machine. Takes a slightly different mindset than using a traditional American dryer. It we adapted quick, saved a ton of time moving clothes between two machines, cleans as good as any machine we have owned. Also is daving a ton of energy and we can block the dryer vent so our house stays warmer in winter.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr",
      "helpful_votes": 0,
      "publication_date": 20170528
    },
    {
      "title": "I thought it would be great",
      "text": "I give up ! I can’t get anything dry . I don’t understand!",
      "rating": 1.0,
      "verified": true,
      "author": "Sasandra Preston",
      "helpful_votes": 2,
      "publication_date": 20190815
    },
    {
      "title": "Works great for us",
      "text": "Works great for us, and saves a lot of space vs. having a separate washer + dryer. Sometimes it doesn't get the clothes completely dry but when that happens we just run another dry cycle, no biggie.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Bluejay",
      "helpful_votes": 0,
      "publication_date": 20170710
    },
    {
      "title": "Love This Machine!!",
      "text": "At the end of first week I love this machine! Clothes are cleaner than top loader gets them. Much quieter than old set. So many washing setting options!! Yes, it tzkes awhile to dry. But I can now put in a load and when I remember it hours later, or the next day, the clothes ate are clean and fluffy dry. Yes it does get warm but so did my old dryer. And no lint blowing around. There is even a feature where you can make the machine \"talk\" on your phone to get a diagnosis if there is a oroblem.And so much space freed up!",
      "rating": 5.0,
      "verified": true,
      "author": "Shawn Olson",
      "helpful_votes": 8,
      "publication_date": 20170113
    },
    {
      "title": "excellent product. I would recommend it for anyone with ...",
      "text": "excellent product. I would recommend it for anyone with limited space and venting problems. we installed it in upstairs closet, freeing up washer and dryer space downstairs creating a storage pantry.. works great and is very quiet.",
      "rating": 5.0,
      "verified": true,
      "author": "chasdep",
      "helpful_votes": 2,
      "publication_date": 20170421
    },
    {
      "title": "Highly Recommend...",
      "text": "Purchased this unit about 8 months ago for use in our 5th wheel. I absolutely love it, I wish the set in my home would die, I'd buy another one of these for my full time laundry.",
      "rating": 5.0,
      "verified": true,
      "author": "EFD",
      "helpful_votes": 0,
      "publication_date": 20170522
    },
    {
      "title": "Convenient",
      "text": "We have had our unit for about three years now, and have had zero issues with it. It performs great, has loads of options for soil types, and is incredibly convenient. What I love the most is not having to switch loads, and accidentally drop wet laundry onto the floor. Just set it and forget it.",
      "rating": 5.0,
      "verified": true,
      "author": "Abraham M. Fillar",
      "helpful_votes": 0,
      "publication_date": 20200224
    },
    {
      "title": "Pretty Great",
      "text": "Pretty freaking good. Can't handle larger loads, but these things wash and dry without moving things between machines. Pretty fantastic.",
      "rating": 5.0,
      "verified": true,
      "author": "Justin Irving",
      "helpful_votes": 0,
      "publication_date": 20191110
    },
    {
      "title": "Love this machine!",
      "text": "This is excellent for a small family or a single person. The machine cleans and drys amazingly! It takes a little longer to dry than traditional machines but it seems to work much better in my opinion. Clothes are cleaner and wrinkle free. Love this machine!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Bridget A Gunthner",
      "helpful_votes": 0,
      "publication_date": 20200414
    },
    {
      "title": "but it works like a dream 👍",
      "text": "Takes a little getting used to from normal machines, but it works like a dream 👍",
      "rating": 5.0,
      "verified": true,
      "author": "GonZo Jenny",
      "helpful_votes": 0,
      "publication_date": 20180817
    },
    {
      "title": "Very pleased to have this machine",
      "text": "I live in a apartment with no washer and dryer hook up. I hook up to my kitchen sink. Washes and dries great. If anyone has a problem with the dryer just put the settings on normal and you will be fine. I’m a happy camper.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190817
    },
    {
      "title": "Good but only half loads with drying.",
      "text": "Should tell you that you can only do a half of load at a time if you want the drying to work. Also when drying you may get a 5-6 hour time begin till end.",
      "rating": 3.0,
      "verified": true,
      "author": "Tim Messmaker",
      "helpful_votes": 4,
      "publication_date": 20160812
    },
    {
      "title": "Breaks often",
      "text": "Do not buy this. Bought new in oct 2019. It has broken every 5 mo like clockwork. Does not drain well. They have not perfected the design yet well enough to offer a washer dryer combo. Highly highly disappointed",
      "rating": 1.0,
      "verified": true,
      "author": "Master",
      "helpful_votes": 0,
      "publication_date": 20200814
    },
    {
      "title": "Love it !!!!",
      "text": "Still getting used to it. But as we use it more and more we are learning to get the most out of it. So far we love it.....",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20151103
    },
    {
      "title": "Great washer dryer combo",
      "text": "Purchased on Monday. Received on Friday in San Diego CA. Amazing washer and dryer combo. Large capacity. Dried perfectly. Full cycle time about 3 hours.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170624
    },
    {
      "title": "Combo washer and dryer",
      "text": "I love this machine! Easy to hook up to use.",
      "rating": 5.0,
      "verified": true,
      "author": "D Galarreta",
      "helpful_votes": 0,
      "publication_date": 20191008
    },
    {
      "title": "A lot of people in Europe and in Asia use ...",
      "text": "A lot of people in Europe and in Asia use wash/dryer combos; why they have not caught on in the US is beyond me.",
      "rating": 5.0,
      "verified": true,
      "author": "BOB",
      "helpful_votes": 4,
      "publication_date": 20151114
    },
    {
      "title": "Easy to use.",
      "text": "Easy to use, once you get used to the settings, you can use delay timer to make your clothes come out just as you wake up in the morning, dry and wrinkle free.",
      "rating": 5.0,
      "verified": true,
      "author": "ERIC DAVIS",
      "helpful_votes": 2,
      "publication_date": 20151008
    },
    {
      "title": "Awesome washer dryer combo",
      "text": "We bought this machine to replace a failing washer dryer set. We chose the combo because the space we have is very small, being a combo unit, it freed up a lot of space in the room. The performance exceeded our expectations. You put dirty clothes in, they come out clean and dry. What could be simpler. No problems with drainage, wet clothes or any of the other issues some are having. That said, it is important to heed the recommendations regarding height of drain hose and load size.",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony Daniel",
      "helpful_votes": 9,
      "publication_date": 20160326
    },
    {
      "title": "I love it.",
      "text": "Does take a long time to dry but it holds huge loads and it's all done in one. I love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20161112
    },
    {
      "title": "It’s great",
      "text": "Wish it had a regular lint catcher thingy but other than that this thing is awesome",
      "rating": 4.0,
      "verified": true,
      "author": "carlos a",
      "helpful_votes": 0,
      "publication_date": 20190402
    },
    {
      "title": "Awesome appliance!",
      "text": "This washer/dryer combo is amazing! I am so happy I took the chance after reading the reviews! I have not had any issues and my clothes look amazing! There is a slight learning curve, but well worth it!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170504
    },
    {
      "title": "Best, best, best ever",
      "text": "One of the best things I ever took a chance on. Absolutely none of the problems I've occasionally seen commented on. Just follow the directions and it's a dream machine.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 4,
      "publication_date": 20150310
    },
    {
      "title": "Five Stars",
      "text": "Fantasic machine you must get one you will love it for life !",
      "rating": 5.0,
      "verified": true,
      "author": "M. Coles",
      "helpful_votes": 0,
      "publication_date": 20180101
    },
    {
      "title": "An Elegant Solution",
      "text": "I'm sold on the technology. Especially for a single occupancy condo situation, or even two people who go light on the laundry. I will keep buying these combo units!",
      "rating": 5.0,
      "verified": true,
      "author": "PH",
      "helpful_votes": 0,
      "publication_date": 20200128
    },
    {
      "title": "Pump fails",
      "text": "When it works it's great. Getting ready to replace pump for the second time - not great.",
      "rating": 1.0,
      "verified": true,
      "author": "Barbara A",
      "helpful_votes": 0,
      "publication_date": 20200323
    },
    {
      "title": "Best of the best",
      "text": "Best of the best. My wife loves it. No more loads waiting between washing and drying. No more clean loads forgotten in the washer. Everything gets done with just one machine. The machine can be plugged into any regular outlet.",
      "rating": 5.0,
      "verified": true,
      "author": "Al Hernandez",
      "helpful_votes": 3,
      "publication_date": 20150306
    },
    {
      "title": "We're very pleased with it",
      "text": "I really don't understand the negative reviews. Our LG washer combo works amazingly well. You could not have been easier to install. It's very quiet and it has so many options between steaming washing and drying. We're very pleased with it.",
      "rating": 5.0,
      "verified": true,
      "author": "E Art Thomas",
      "helpful_votes": 5,
      "publication_date": 20170314
    },
    {
      "title": "though nice it only needs a 110 plug",
      "text": "Drying takes a long time, though nice it only needs a 110 plug.",
      "rating": 4.0,
      "verified": true,
      "author": "John R. Casselman",
      "helpful_votes": 3,
      "publication_date": 20151104
    },
    {
      "title": "This amazing laundry unit is the best buy I have made ...",
      "text": "This amazing laundry unit is the best buy I have made in a long time. It is beautiful and was at a very reasonable price. Perfect for the forgetful person who leaves laundry in the washer until it mildews. This one will do everything needed except to iron the dresses!",
      "rating": 5.0,
      "verified": true,
      "author": "KippersMa",
      "helpful_votes": 5,
      "publication_date": 20160919
    },
    {
      "title": "Efficient and low impact washer dryer",
      "text": "Glad that we found this washer/ dryer combo for our dental office.",
      "rating": 5.0,
      "verified": true,
      "author": "dennis stiles",
      "helpful_votes": 0,
      "publication_date": 20200609
    },
    {
      "title": "We love it!",
      "text": "It has met every expectation for quality and functionality that we had. I'd sell one to my mother if she needed one. Seriously. It's awesome.",
      "rating": 5.0,
      "verified": true,
      "author": "P. Anderson",
      "helpful_votes": 3,
      "publication_date": 20150825
    },
    {
      "title": "Heaven sent",
      "text": "Thank you so much I love this thing, it was worth the investment!",
      "rating": 5.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 2,
      "publication_date": 20150924
    },
    {
      "title": "The problem is worse than before",
      "text": "The machine was not drying clothes. They were quite damp. I read the reviews and knew it would be different than traditional dryers. However, an LG repair man came and said something needed to be replaced so he replaced it. Now the clothes are not just damp, they are WET. The problem is worse than before. What a disappointment. Please do not buy this machine. It's not even worth what they charge to ship it back and restock it. It would be better to buy from your local appliance store and deal with them directly.",
      "rating": 1.0,
      "verified": true,
      "author": "marber",
      "helpful_votes": 37,
      "publication_date": 20151119
    },
    {
      "title": "The good news is that it does the job one would ...",
      "text": "The price of the unit is okay. The main door is a cheap plastic and that is a little disheartening. The good news is that it does the job one would expect in an all in one unit. One must remember that it is drying with the power of a hair dryer.",
      "rating": 4.0,
      "verified": true,
      "author": "Abigail M. Q. Utt",
      "helpful_votes": 4,
      "publication_date": 20160519
    },
    {
      "title": "... difficult to transport here even if you choose the best shipping option",
      "text": "220 lb machine was difficult to transport here even if you choose the best shipping option. other than that it works pretty well just make sure you dont overload it and do towel loads separately or it will take longer to dry. It's very simple to use and has lots of nice functions and options. had it for a few months no problems",
      "rating": 4.0,
      "verified": true,
      "author": "mesha",
      "helpful_votes": 2,
      "publication_date": 20151021
    },
    {
      "title": "If you need ventless, maybe...",
      "text": "Top and edge of plastic molding cracked within 4 months. Print on buttons came off after 2 months.",
      "rating": 3.0,
      "verified": true,
      "author": "Boo",
      "helpful_votes": 6,
      "publication_date": 20160111
    },
    {
      "title": "Awesome machine!!",
      "text": "Have had this LG Combo for a little over a month, and I absolutely love it. Am 72 with arthritis, and it now saves me going up and down stairs, to do laundry. Son-in-law installed in no time. Everyone who sees it, is very impressed. Have even done blankets, and it does a great job. Would highly recommend, to anyone who needs to save space.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20150327
    },
    {
      "title": "Love it! Love the space is saves",
      "text": "Love it! Love the space is saves. Love the ease of throwing in dirty clothes and 2 hours later I have clean and dry clothes. Love the water and electricity it saves! I have not had any issues. When I did a larger load it took over 2 hours, but not too long. At first, I thought the clothes kind of felt damp when I got them out, but I realized that was just the steam, and they really were dry. I think it cleans much better than my old top loader. Very happy with this purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Michael K Tillis",
      "helpful_votes": 3,
      "publication_date": 20150323
    },
    {
      "title": "We like the compact efficiencies this product provides",
      "text": "Still trying to figure out the dry cycle and time it takes to dry our clothes / towels",
      "rating": 4.0,
      "verified": true,
      "author": "Dale Hlavin",
      "helpful_votes": 2,
      "publication_date": 20150914
    },
    {
      "title": "I love it.",
      "text": "Works great. My clothes are dry and there is no weird odor that others mention. Read the instruction manual and follow the instructions and you'll get great results.",
      "rating": 5.0,
      "verified": true,
      "author": "nellierosie",
      "helpful_votes": 3,
      "publication_date": 20160803
    },
    {
      "title": "Not a dryer, more of a ‘less-damper’",
      "text": "Quite simply the worst product I have ever bought in my life. Two leaks within one day (door seal and from the back) and very poor drying performance (as noted in numerous reviews here.",
      "rating": 1.0,
      "verified": true,
      "author": "Craig Smail",
      "helpful_votes": 7,
      "publication_date": 20171223
    },
    {
      "title": "This is a nice combination, but mine broke down in about 5 ...",
      "text": "This is a nice combination, but mine broke down in about 5 months under heavy use. The main problem lies in that this is washer and dryer combo. The dryer part of it produces *a lot* of lint, which surprisingly is not caught with a conventional filter. In my case, the lint accumulates so much that eventually it got to clone the drain and causing the drain motor to fail. If you take a close look at the drain filter, it is not really designed to catch any of it. I now have a conventional back up washer/dryer in case it fails again.",
      "rating": 4.0,
      "verified": true,
      "author": "Tao Long",
      "helpful_votes": 0,
      "publication_date": 20170727
    },
    {
      "title": "Go with a standard Elec. / gas clothes dryer.",
      "text": "Doesn't work very well. It wouldn't even attempt to dry anything more than damp, very damp. When run through a second time under dry only, it blew a fuse! I wouldn't buy another washer combo!",
      "rating": 2.0,
      "verified": true,
      "author": "Wayne Swisher",
      "helpful_votes": 7,
      "publication_date": 20161030
    },
    {
      "title": "BIG MISTAKE",
      "text": "Love everything except one big one I hate there is no way to vent it outdoors. ever try clean one these out after drying bath towels?? my worst nightmare!! if had do again would not get this product LG WM3997HWA Ventless 4.3 Cu. Ft. Capacity...",
      "rating": 3.0,
      "verified": true,
      "author": "travelinggranny",
      "helpful_votes": 5,
      "publication_date": 20161128
    },
    {
      "title": "this machine is doing great. I have had it for a few months ...",
      "text": "So far, this machine is doing great. I have had it for a few months now and it's been working great. Just understand that this machine does not dry like a normal dryer and takes longer. For situations where you need this and don't have a gas line to use, this is great.",
      "rating": 5.0,
      "verified": true,
      "author": "SaveMoneyMerchant21",
      "helpful_votes": 0,
      "publication_date": 20151020
    },
    {
      "title": "Lint all over! Never completely dry!",
      "text": "This is horrible! This machine does not catch any lint! It disgusting that I need to clean the lint every time ( only used twice). I had a small version lg washer dryer combo and never had this issue. Did the seller sell me a defected unit or what? We made cabinet next to the washer and also add granite on top so it looks like build in! Now what should I do? Such hassle for $1700!",
      "rating": 1.0,
      "verified": true,
      "author": "Natalie Kwok :p",
      "helpful_votes": 5,
      "publication_date": 20170612
    },
    {
      "title": "OK....but not great.",
      "text": "I love everything about this product except one thing: it doesn't dry my clothes enough. Especially bath and dog towels. I have installed hooks in my laundry room to hang damp items.",
      "rating": 3.0,
      "verified": true,
      "author": "RedHeadwithFire",
      "helpful_votes": 7,
      "publication_date": 20150715
    },
    {
      "title": "wonderful product",
      "text": "It is the best thing I could have bought. Wonderful product. My kids love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Patricia",
      "helpful_votes": 3,
      "publication_date": 20150521
    },
    {
      "title": "Failed after 8 weeks nor warrantied normal use",
      "text": "This product was misrepresented as useful for normal wash and dry, it failed within 8 weeks and the LG service tech said it is designed for use in a well ventilated area for light linens only and will not be covered under warranty. Do not buy this to wash and dry anything close to normal use.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 15,
      "publication_date": 20160729
    },
    {
      "title": "Please don't risk it! Not worth it!",
      "text": "This is honestly the worst purchase I have ever made. I am unhappy every day with the length of time it takes to wash a load, The leaky door, the damp clothes, and lg customer service dies not include service unless you pay for every complaint. As soon as i can afford to, I will throw this 1 year old unit to the dump where it belongs and buy some that work! ugh!",
      "rating": 1.0,
      "verified": true,
      "author": "Jennifer Summers",
      "helpful_votes": 5,
      "publication_date": 20170531
    },
    {
      "title": "Waste of money",
      "text": "I am baffled that people are getting dry clothes. I had an LG technician come out and he told me that it's not really a dryer, just a washer with a small heating element . Waste of money. NEVER DRIES CLOTHES ON ANY SETTING. Seller also refused to refund and cut off communication.",
      "rating": 1.0,
      "verified": true,
      "author": "Travis C.",
      "helpful_votes": 16,
      "publication_date": 20160414
    },
    {
      "title": "Stay away",
      "text": "I would recommend staying away from this it takes 3 hours for clothes to dry if they don't dry it within that time they still may be dumped",
      "rating": 1.0,
      "verified": true,
      "author": "Justin",
      "helpful_votes": 9,
      "publication_date": 20161217
    }
  ],
  "product_meta": {
    "title": "LG WM3997HWA Ventless 4.3 Cu. Ft. Capacity Steam Washer/Dryer Combination with TurboWash, TrueBalance Anti-Vibration System, NeveRust Stainless Steel Drum, Allergiene Cycle in White",
    "description": "27\" Electric Washer/Dryer Combo 4.3 cu. ft. Capacity 14 Wash Cycles Steam Technology ColdWash Option 1,300 RPM Spin Speed Ventless Condensing Drying",
    "rating": 3.9,
    "feature_bullets": [
      "4.3 Cu. Ft. Capacity NeveRust Stainless Steel Drum",
      "14 Wash Cycles / 4 Dry Cycles / 8 Options / 5 Temperatures",
      "Steam Gently But Powerfully Penetrates Fabrics",
      "ColdWash Enhanced Motions Penetrate Deep Into Fabrics"
    ],
    "specifications": {
      "Brand Name": "LG",
      "Model Info": "WM3997HWA",
      "Item Weight": "226 pounds",
      "Product Dimensions": "30 x 32 x 43 inches",
      "Item model number": "WM3997HWA",
      "Is Discontinued By Manufacturer": "No",
      "Part Number": "WM3997HWA",
      "Color": "White",
      "Fuel type": "Electric",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "ASIN": "B00LIAP2ZY",
      "Customer Reviews": "3.9 out of 5 stars280 ratings3.9 out of 5 stars",
      "Best Sellers Rank": "#1,690 in Appliances",
      "Date First Available": "July 3, 2014"
    },
    "categories": [
      "Appliances",
      "All-in-One Combination Washers & Dryers",
      "Washers & Dryers",
      "Laundry Appliances"
    ],
    "price": ""
  }
}