{
  "website_summaries": [
    {
      "verdict": "Nice price per ounce for black organic chia seeds that will perfectly mix into other foods.",
      "pros": [
        "Gives you the omega fats, proteins, and fiber you want",
        "USDA-certified organic quality",
        "Works well as a mix-in for baking or smoothies",
        "Offered at a reasonable price for an organic product"
      ],
      "cons": [
        "Sometimes will have foreign plant matter in the bag",
        "Some problems with quality of seal on bag"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Dirty Chia",
      "text": "Tastes like dirt and there are little black seeds or pebbles that aren't chia. They don't swell up after sitting in liquid for 9 hours. Very disappointed since all the other organic brands seem to have the same issue. At least no bugs that I'm aware of :/",
      "rating": 2.0,
      "verified": true,
      "author": "KR",
      "helpful_votes": 45,
      "publication_date": 20190516
    },
    {
      "title": "Things crawling/hopping in bag when I opened.",
      "text": "I wanted to use the chia seeds in recipes,; altho the bag was sealed when it arrived, when I attempted to spoon chia seeds into other containers for storage, things appeared to be flying, creeping, moving in the bag. I realize this is not a returnable item. Of course I won't use it. Maybe the birds will eat it. Won't buy again.",
      "rating": 1.0,
      "verified": true,
      "author": "DG Cincinnaati",
      "helpful_votes": 40,
      "publication_date": 20190724
    },
    {
      "title": "Poo poo good!",
      "text": "Let's be honest folks. Chia seeds is a great source of fiber. I bought this because I had issues doing you know what. Just like many others, Metamucil and other fiber remedies never worked until I tried chia seeds in my steel cut oatmeal. Thank you so much for helping me avoid being constipated! It's not funny, it's a serious matter",
      "rating": 5.0,
      "verified": true,
      "author": "NonstopInk",
      "helpful_votes": 79,
      "publication_date": 20170417
    },
    {
      "title": "I don't like to eat before I exercise",
      "text": "I've been very please with the quality and amount you get for the price of this chia. I mix it up with water, lime juice, and monk fruit sweetener in a big glass jug I keep in my fridge and drink a glass of it every morning as a pre-workout. I don't like to eat before I exercise, but I know it's also not good to exercise on an empty stomach and it makes me nauseous. My chia drink has been the perfect solution. It puts something light in my stomach, gives me energy, and keeps me hydrated while I work out (of course you've got to keep drinking water throughout the workout, too). I love it!",
      "rating": 5.0,
      "verified": true,
      "author": "shivermytimberwolves",
      "helpful_votes": 34,
      "publication_date": 20170209
    },
    {
      "title": "A Superb Product",
      "text": "This package is on the top shelf of my refrigerator and allows me to add the protein and Omega 3s to fight inflammation to breakfasts and desserts. Mixing this chia with cocoa, soy milk, cinnamon, and a little honey provides an exquisite chocolate tapioca pudding. Cooking it in oatmeal with blueberries or mango pieces makes a dessert-like breakfast. Added to smoothies, the nutty flavor and tapioca like texture are a delight. Breads baked at home are improved with chia as a thickening agent. Knowing this is organic adds to the pleasure. Anthony's Organic Chia Seeds is a superb product!",
      "rating": 5.0,
      "verified": true,
      "author": "Observer One",
      "helpful_votes": 24,
      "publication_date": 20170903
    },
    {
      "title": "Glad I found this",
      "text": "Glad I found this! Was on the hunt for chia to add to my morning yogurt, lunch salads, whatever and everything in the shops around me seemed rather pricey. Was a delight to find it in bulk, for a reasonable price and certified organic. I've been using it for a couple months now and have no complaints (other than if you spill this stuff the little buggers go EVERYWHERE, but that is my fault not the chia!). Good quality, arrived quickly - this is going on the list of things to buy again when I start getting to the end of the bag!",
      "rating": 4.0,
      "verified": true,
      "author": "H. Lloyd",
      "helpful_votes": 36,
      "publication_date": 20160126
    },
    {
      "title": "The seeds smelled very fishy. I have never had a problem with Anthony's products before.",
      "text": "They smelled very fishy and there's no way to return them or contact the seller that I can see. I would have rather contacted the seller. There's usually a way to correct these sort of issues before customers had to resort to giving a harsh review. I've always enjoyed Anthony's products in the past.",
      "rating": 1.0,
      "verified": true,
      "author": "Josey",
      "helpful_votes": 9,
      "publication_date": 20200112
    },
    {
      "title": "Several small black hard pieces in the bag",
      "text": "So I'm about halfway through the bag & I have come across more than a few very small hard, rock-like pieces in the bag. And these are only the ones I have noticed, who knows how many others have slipped by. No idea what they are, but this is the first brand I have ever purchased where this was an issue. Would not purchase again!",
      "rating": 1.0,
      "verified": true,
      "author": "Shelley",
      "helpful_votes": 29,
      "publication_date": 20170720
    },
    {
      "title": "Tastes absolutely disgusting.",
      "text": "Tastes disgusting. Tastes as if someone mixed blood and dirt together and added a bit of bitterness to the mixture. I could not return it due to Amazon’s return policy. It was a waste of money and I ended up throwing it in the trash. Honestly, my favorite brand so far has been the Great Value brand chia seeds from Walmart. Grind them up yourself. They’re much cheaper too.",
      "rating": 1.0,
      "verified": true,
      "author": "Youssef Taha",
      "helpful_votes": 9,
      "publication_date": 20191223
    },
    {
      "title": "Pantry Staple",
      "text": "Kinda obsessed with Anthony’s. Amazing quality and crazy affordable. I use these mostly for smoothies. They do gel and plump up but maybe not as much as some others, I did read that previously before I purchased but it doesn’t bother me at all. I prefer these actually. I can’t believe how much you get for the price, I’ll definitely be able to make chia pudding more frequently without worrying about cost.",
      "rating": 5.0,
      "verified": true,
      "author": "Alletse",
      "helpful_votes": 10,
      "publication_date": 20180520
    },
    {
      "title": "Great product, but defective packaging",
      "text": "The value with this product is great. The chia seeds are clean with no strange residue, they absorb liquid well, and they taste just as they should. I like to make chocolate pudding with them. 1 star off because my bag was defective - one side of the pouch was missing the strip that you need to seal up the bag! This resulted in a bit of a spill and I had to transfer the contents to another container. Fortunately, Amazon's customer service was excellent and helped remedy the issue promptly.",
      "rating": 4.0,
      "verified": true,
      "author": "Tiffany P.",
      "helpful_votes": 4,
      "publication_date": 20190425
    },
    {
      "title": "does not say raw as picture indicates.",
      "text": "item pictured says raw, package i received does not say raw. not eligible for returns. very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Casey Peterson",
      "helpful_votes": 8,
      "publication_date": 20190411
    },
    {
      "title": "Rocks, debree",
      "text": "So many rocks inside the chia seed mixture. Every time I take a serving I get bits of rocks. Terrible. I’d recommend the 365 brand instead. Better quality, surprisingly better taste, and the only brand that I’ve tried that’s not terrible.",
      "rating": 1.0,
      "verified": true,
      "author": "HairPep",
      "helpful_votes": 4,
      "publication_date": 20191218
    },
    {
      "title": "Good Price Good Product",
      "text": "I switched to this brand because my other brand became unavailable. These seeds are as good as any I've ever had and I've been eating them for years from many different providers.",
      "rating": 5.0,
      "verified": true,
      "author": "Clint",
      "helpful_votes": 3,
      "publication_date": 20200609
    },
    {
      "title": "Nice Chia seeds - good quality",
      "text": "These chia seeds were very good and I liked the packaging and the cleanness of the seeds. No sticks or other items, just seeds. I liked the packaging and I thought the price was good. I will purchase again.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 7,
      "publication_date": 20160921
    },
    {
      "title": "these ones bulk up much better and more consistently though the glass jar of water ...",
      "text": "In comparison with the chia seeds I bought in the past, these ones bulk up much better and more consistently though the glass jar of water that I put them in.",
      "rating": 5.0,
      "verified": true,
      "author": "E. E. Malinovsky",
      "helpful_votes": 7,
      "publication_date": 20170412
    },
    {
      "title": "Dont absorb as much water.",
      "text": "These don't absorb as much water as I have seen with some other products, but they are clean (no twists or small stones). I make a special protein \"pudding\" with these. 1 cup evaporated milk, 1 scoop pure whey protein (vanilla flavor), 1/2 tsp vanilla extract and 3 tbs of Chia seeds. Mix the protein in the milk, add the vanilla extract and mix in the chia seeds. Let it sit in the fridge for a day. I have used other products and they seem to bulge a bit more. These are more flat.",
      "rating": 4.0,
      "verified": true,
      "author": "vc",
      "helpful_votes": 2,
      "publication_date": 20180801
    },
    {
      "title": "Tiny rocks within can break your teeth",
      "text": "There are tiny rocks all through these chai seeds and I could break a tooth eating them, plus what the heck kind of rocks am I eating? I can’t even eat them anymore. I do not recommend.",
      "rating": 1.0,
      "verified": true,
      "author": "I. Tauber",
      "helpful_votes": 2,
      "publication_date": 20200109
    },
    {
      "title": "Chia DELICIOUS!",
      "text": "I was never a fan of Chia Seeds - when I got on board with them ,I became addicted and this brand sealed the deal on my new LOVE of Chia. These were the BEST Chia Seeds , so fresh, beautifully fragrant ( I didn't know they had a fragrance!) This brand is wonderful!",
      "rating": 5.0,
      "verified": true,
      "author": "susan",
      "helpful_votes": 0,
      "publication_date": 20200719
    },
    {
      "title": "Slice in bag",
      "text": "This product arrived with a large slice in the bag and chia seeds ALL OVER the inside of box-see pics. You cannot return this product!! Beware",
      "rating": 1.0,
      "verified": true,
      "author": "Lin2",
      "helpful_votes": 3,
      "publication_date": 20200311
    },
    {
      "title": "Wonderfully nutritious & tasty",
      "text": "Anthony’s is home to some of the best supplements on Amazon! Avoid the “BULK SUPPLEMENTS” scam companies importing questionable and untested products like, for instance, BULK SUPPLEMENTS, and stick with a company you can trust like Anthony’s.",
      "rating": 5.0,
      "verified": true,
      "author": "Heath",
      "helpful_votes": 2,
      "publication_date": 20180726
    },
    {
      "title": "Wonderful seeds!",
      "text": "I consume many different seeds whole, blended and sprouted. These are some of the best Chia seeds I've purchased. I've come to trust Anthony's products, have not been disappointed, they are my go to brand.",
      "rating": 5.0,
      "verified": true,
      "author": "gabriel J. forzano",
      "helpful_votes": 0,
      "publication_date": 20200906
    },
    {
      "title": "Thumbs up",
      "text": "Very happy. I've bought several items from this company and find it dependable and high quality. I put it in my morning protein shakes and grind it up to put in our pancakes. I also buy the turmeric for myself and my 14 year old dog. She loves it mixed in her food. she has had a noticeable difference with her skin rashes, itching and energy. It took several months.",
      "rating": 5.0,
      "verified": true,
      "author": "Packgirl",
      "helpful_votes": 5,
      "publication_date": 20170118
    },
    {
      "title": "Nice super food nourishment!",
      "text": "Nice large bag of chia seeds. Nothing more, nothing less. I was skeptical before buying because chia is usually much more expensive. After reading the review I decided to give this bag a shot and am glad I did. I’ve used this to make iskiate to drink before my runs and it keeps me energized for a long while. Great seeds from a great company.",
      "rating": 5.0,
      "verified": true,
      "author": "Gabe",
      "helpful_votes": 2,
      "publication_date": 20180713
    },
    {
      "title": "Great price for chia seeds",
      "text": "The packaging has changed since my last purchase, and not in a good way for me. The new package is a snug fit and once opened, not large enough to easily close without losing lots of seeds. Fortunately I still had the old, roomier package and was able to transfer the contents. Love the chia seeds, the quality, and the price!",
      "rating": 4.0,
      "verified": true,
      "author": "Carol J",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "Too many hard pieces",
      "text": "Like other reviews, I found it to contain lots of hard little pieces. On at least three occasions, I thought I broke my tooth on the hard pieces and that was only halfway through the package. I threw the rest out. Very disappointing since I bought their other products and they were good. I wont buy their chia seeds again.",
      "rating": 2.0,
      "verified": true,
      "author": "P. Jensen",
      "helpful_votes": 0,
      "publication_date": 20200830
    },
    {
      "title": "Wonderful & Fantastic Product - Makes Great Smoothies!",
      "text": "Amazon unfortunately in shipping, one of the TWO packages of Anthony's Organic Chia Seed, 2.5 lb, Gluten Free, Vegan, etc. was damaged. This item was shipped with a number of other items and when the box arrived one of the Anthony's items was significantly damaged with chia seeds everywhere in the shipping box. I would appreciate a replacement package for this damaged item. This was not Anthony's fault but the Amazon Fulfillment center which processed and shipped the item. WE LOVE ANTHONY'S CHIA SEEDS, THEY ARE THE BEST!!! compared to all other brands. TIA, whoever will address this situation.",
      "rating": 5.0,
      "verified": true,
      "author": "Bob Hardy",
      "helpful_votes": 0,
      "publication_date": 20200917
    },
    {
      "title": "May be perfect for you, not me",
      "text": "This, in my finished bread, made me really ill. It is a fine grind which is nice, but maybe that was the problem. All I can says is that the taste vs the more grainy variety was much greater and I didn't like it. This is probably just me because it is a good company. I threw out the bread after that first sandwich.",
      "rating": 2.0,
      "verified": true,
      "author": "TCTop Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20200923
    },
    {
      "title": "There’s a moth and a worm and webs in my seeds upon unsealing the bag",
      "text": "I unsealed the chia seeds for the first time since ordering them. A moth flew out and a moth larvae was in it which I have a picture of and the inside of the bag had webs in it from the moth.",
      "rating": 2.0,
      "verified": true,
      "author": "Brenda C",
      "helpful_votes": 0,
      "publication_date": 20201014
    },
    {
      "title": "Good for constipation",
      "text": "I have been struggling with constipation since long time ago, while I was searching for thing rich in fiber I found this product. It really works for me since I start taking it. Free form constipation now. I add it to salad, smoothie, water ect... Very good product",
      "rating": 5.0,
      "verified": true,
      "author": "🦋🦋Arisma🦋 🦋",
      "helpful_votes": 0,
      "publication_date": 20200315
    },
    {
      "title": "Clean and fresh chia seeds",
      "text": "Bag was full. Nothing other than chia seeds in the bag (no contamination and no dirty elements). These have kept their freshness in the 2 weeks I have had them. Great for smoothies.",
      "rating": 5.0,
      "verified": true,
      "author": "Victor Noe",
      "helpful_votes": 0,
      "publication_date": 20200612
    },
    {
      "title": "Loving this product. I've been usuing it before bed ...",
      "text": "Loving this product. I've been usuing it before bed. I add chia seeds to organic juice and drink it before bed to avoid getting hungry at night. They are very filling and have helped me with bloating.",
      "rating": 5.0,
      "verified": true,
      "author": "cindy",
      "helpful_votes": 2,
      "publication_date": 20180128
    },
    {
      "title": "It is a great addition to my weekly meals and cooking",
      "text": "I got these when I found out the low-carb attributes of chia seeds for my diet for reactive hypoglycemia. It is a great addition to my weekly meals and cooking. There are all sorts of things you can do with chia I've found, including baking with it, putting it in yogurt, etc. that works with my diet. I sprinkle them on cheese crispies before I microwave them...a winner!",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin P.",
      "helpful_votes": 0,
      "publication_date": 20180606
    },
    {
      "title": "Awesome Chia",
      "text": "I love these chia seeds. I have them everyday. Mostly use them when I make my oatmeal. The flavor and texture are awesome!!! The plus is that I know that they are so good for me!",
      "rating": 5.0,
      "verified": true,
      "author": "Rhonda H",
      "helpful_votes": 0,
      "publication_date": 20200314
    },
    {
      "title": "Good price for 2.5 pounds of organic chia seeds",
      "text": "Happy with this purchase! I use chia seeds as an egg substitute in vegan baking, chia seed pudding, overnight oats, smoothies, even add to drinking water. There are recipes online using chia seeds for grain free crackers and ‘seeded breads’. They can absorb 10X their weight in liquid. Can be ground to make chia powder. Good fiber & protein, many other nutritional benefits. Chia seeds don’t have a strong flavor. Great for digestion.",
      "rating": 5.0,
      "verified": true,
      "author": "BenDee",
      "helpful_votes": 0,
      "publication_date": 20181210
    },
    {
      "title": "Bad packaging",
      "text": "The bag was damaged and the chia seeds were everywhere!",
      "rating": 1.0,
      "verified": true,
      "author": "carmen blanco",
      "helpful_votes": 6,
      "publication_date": 20180319
    },
    {
      "title": "Open when arrived. Otherwise good",
      "text": "Came to my house open and half out in the box. Can’t find where I can ask for another one.",
      "rating": 1.0,
      "verified": true,
      "author": "Kelsey Mills",
      "helpful_votes": 3,
      "publication_date": 20190417
    },
    {
      "title": "Nutrition and great price all in one!",
      "text": "Don't believe any of the negatives about this product. Bunch of whiners. This product is perfect, nothing wrong with packaging or contents. Bought it as an ingredient for my own energy bars, but I also love adding a sprinkle of this on a piece of toast with nut butter.",
      "rating": 5.0,
      "verified": true,
      "author": "TroutChaser",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "Nicely milled",
      "text": "Nicely milled . Better than expected . Will buy again . I’m currently using it as a add in to overnight oats .",
      "rating": 5.0,
      "verified": true,
      "author": "amber keown",
      "helpful_votes": 0,
      "publication_date": 20190914
    },
    {
      "title": "Bad batch",
      "text": "So disappointed, I got a bad batch this time. It came with tiny rocks in it. Very unpleasant to chew into that.",
      "rating": 1.0,
      "verified": true,
      "author": "Benavides",
      "helpful_votes": 2,
      "publication_date": 20200204
    },
    {
      "title": "Good Value and Consistent Quality",
      "text": "I've ordered this product several times. I use it in the morning by mixing it in my oatmeal along with sliced almonds, roasted sunflower seeds, and cinnamon. I cover it with warm almond milk for a delicious meal with a little extra energy and nutrition boost. This is a large bag that lasts a long time.",
      "rating": 5.0,
      "verified": true,
      "author": "Marilyn G.",
      "helpful_votes": 0,
      "publication_date": 20190929
    },
    {
      "title": "What is it?",
      "text": "Not a single one sprouted. Who knows what they are but they are not raw chia seeds, that is for certain.",
      "rating": 1.0,
      "verified": true,
      "author": "MagarityTop Contributor: Photography",
      "helpful_votes": 0,
      "publication_date": 20200528
    },
    {
      "title": "Wrong label on site!",
      "text": "I ordered ground seed. That is what it was labeled on line. What I got was regular seed. I am very disappointed!",
      "rating": 1.0,
      "verified": true,
      "author": "Carol S",
      "helpful_votes": 2,
      "publication_date": 20200401
    },
    {
      "title": "5 Stars",
      "text": "I use chia seeds for indigestion and they work great! Chia seeds are also high in protein and they definitely give me an energy boost in the morning instead of drinking coffee with additional calories. I recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Janell",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "Great quality product!",
      "text": "Product arrived on time. Packaging looks great, descriptive, clear labeling and comes in a resealable bag which is always nice. Product looks clean, whole seeds, NO SIGNS of crushed low quality contents as you might see from other sources. Great price (apx $12) quantity/quality of 2.5 pounds compared to other brands in stores. Will definitely be purchasing more of this product in the future.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica Gonzalez",
      "helpful_votes": 0,
      "publication_date": 20200812
    },
    {
      "title": "Busted open",
      "text": "The product is great if it comes intact. I ordered a second bag because I enjoyed the first but when she opened the padded envelope it came in, half the bag was out in the envelope. Very sad because I like them but not like this.",
      "rating": 1.0,
      "verified": true,
      "author": "carrie Lynn kennedy",
      "helpful_votes": 12,
      "publication_date": 20180123
    },
    {
      "title": "Just like Chia seeds are supposed to be",
      "text": "Seems perfectly fine, clean and fresh. I made some chia pudding with Anthony’s powdered coconut milk and 3 tbsps of seeds and it turned out great. Just like the chia seeds I get from Trader Joe’s or Whole Foods.",
      "rating": 5.0,
      "verified": true,
      "author": "CAA in NYC",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "Like the package material.",
      "text": "I purchased other similar products before but I like this one better for the package, especially the inside. As I transfer the contents into another container, the seeds don't stick to the inside like others I had before. It seems thatb the difference is the type of material used with this one which doesn't cause static. I'll buy it again.",
      "rating": 5.0,
      "verified": true,
      "author": "Tanoshie's mom",
      "helpful_votes": 0,
      "publication_date": 20170417
    },
    {
      "title": "Great for a variety of uses",
      "text": "Never knew abut chia until recently. Now I use it for puddings, in home made breads, in smoothies and more. This is the second order From Anthony's and I totally pleased, both with the company and with their products. I will order again, for sure",
      "rating": 5.0,
      "verified": true,
      "author": "John Charles",
      "helpful_votes": 0,
      "publication_date": 20190503
    },
    {
      "title": "Good seeds, good price",
      "text": "Good seeds, good price. What else can I say? If you need some chia seeds, then these are probably as good as any other brand, and you're already here, reading this comment, so you should just save yourself some time and buy these right now?",
      "rating": 5.0,
      "verified": true,
      "author": "Michael A. Kato",
      "helpful_votes": 3,
      "publication_date": 20160505
    },
    {
      "title": "Not fresh, probably left in warehouse too long",
      "text": "The date is not expired yet, 6 months left when I received it 2 to 3 days ago. I buy usually products from Anthony's. This is the second time I buy mulberries here, and the last time. These mulberries are old, and already disintegrating. And I am thinking to trash them all.",
      "rating": 2.0,
      "verified": true,
      "author": "A. HADAVI",
      "helpful_votes": 0,
      "publication_date": 20200523
    },
    {
      "title": "One Star",
      "text": "The package was open on receipt now i have to throw it all away!",
      "rating": 1.0,
      "verified": true,
      "author": "Esther Igu",
      "helpful_votes": 5,
      "publication_date": 20180503
    },
    {
      "title": "Able to have fresh and clean chia",
      "text": "This product was very fresh and clean I really checked it myself I dumped the whole bag little by little and it was all chia and very clean and not dusty I would recommend this product because this bag is huge and a little goes along way.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190225
    },
    {
      "title": "The best organic healthy chia seed for you!",
      "text": "I eat this everyday and it’s the best, you will love it and it’s so fine with no after taste.",
      "rating": 5.0,
      "verified": true,
      "author": "P Rams",
      "helpful_votes": 0,
      "publication_date": 20200427
    },
    {
      "title": "Hole in bag",
      "text": "Came with a hole in the bottom of the bag 😒",
      "rating": 1.0,
      "verified": true,
      "author": "L",
      "helpful_votes": 4,
      "publication_date": 20190402
    },
    {
      "title": "Amazing",
      "text": "I gave it 3 stars for Presentation, because it is black chia -I'm not concerned with the color, but others might be. We use it for puddings, popsicles (so good), drinks, etc. So healthy.",
      "rating": 5.0,
      "verified": true,
      "author": "Waterwoman",
      "helpful_votes": 0,
      "publication_date": 20190701
    },
    {
      "title": "Nice easy to open packaging",
      "text": "I’ve been eagerly waiting for these to arrive since I ran out of my other brand. These do not plump up as well as the last ones I’ve tried. They are very clean and nicely packaged though so that’s a plus.",
      "rating": 3.0,
      "verified": true,
      "author": "Anna",
      "helpful_votes": 0,
      "publication_date": 20190503
    },
    {
      "title": "Exactly what it said it would be",
      "text": "I don't know why people complain of foreign matter in the Chia seeds. Everything was fine in my bag. I ordered Chia seeds. I received Chia seeds. No furry things grew in my tummy. So, i guess that everything is A-OK.",
      "rating": 5.0,
      "verified": true,
      "author": "Houston Retiree",
      "helpful_votes": 0,
      "publication_date": 20200308
    },
    {
      "title": "Funny packaging! Great Product!",
      "text": "I add these to everything! Smoothies, lemonade, coconut water, etc! Make sure to let these puppies 'marinate' in whatever drink you choose to put them in because I've heard that they'll go straight to your appendix if they're too hard! So be careful. Virtually tasteless and add a nice texture to the drinks you put them in.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazonian",
      "helpful_votes": 0,
      "publication_date": 20180921
    },
    {
      "title": "Excellent!",
      "text": "So good in my fruit smoothies! I grind them up in a coffee grinder and sprinkle the powder into my blender with the frozen fruit and juice. Its quite delicious. The bag is massive and it will last me a very long time!",
      "rating": 5.0,
      "verified": true,
      "author": "Erin",
      "helpful_votes": 0,
      "publication_date": 20170810
    },
    {
      "title": "Excellent product.",
      "text": "Quite satisfied with my purchase. In my local grocery stores, Chia seeds were sold more like an exotic food with the prices showing just that, almost double Anthony's. I sprinkle them on morning cereal, steel cut oats w/ raisins, then add them to a late night snack of low-fat yogurt with Chia seeds sprinkled on the yogurt. No guilt and i like that. Easily measures up to late night ice cream urge. Think healthy-eat healthy.",
      "rating": 5.0,
      "verified": true,
      "author": "pajude",
      "helpful_votes": 0,
      "publication_date": 20190320
    },
    {
      "title": "Anthony's never disappoints!!",
      "text": "Whenever I need bulk sized organic products, I always turn to Anthony's! Their products are organic and come in an easily resealable bag to keep freshness. I have never been disappointed! It is a very large size, but I feel that it is WELL worth the price you are paying. I have done a lot of research on buying bulk organic products. Usually you spend a pretty penny but Anthony's is always best priced for the size and guaranteed quality!",
      "rating": 5.0,
      "verified": true,
      "author": "Hailey B",
      "helpful_votes": 0,
      "publication_date": 20170724
    },
    {
      "title": "Anthony's Organic Chia Seeds 2.5lbs, Batch Tested Gluten-Free",
      "text": "I have been using chia seeds in my smoothies, in my hand made bread, and I sprinkle it on my food It is a good, natural source of fiber. It barely has any flavor. Great value for the money..will buy again..!",
      "rating": 5.0,
      "verified": true,
      "author": "NH",
      "helpful_votes": 0,
      "publication_date": 20190425
    },
    {
      "title": "Good for vegan cooking",
      "text": "We burn through a lot of these little guys. We put them in our daily smoothies. Maybe use up to one bag a month or so. Good for vegan cooking also.",
      "rating": 5.0,
      "verified": true,
      "author": "Suzanne D.",
      "helpful_votes": 0,
      "publication_date": 20191204
    },
    {
      "title": "Good but don't like the newer smaller packaging.",
      "text": "Love these and will keep ordering but not a fan of the new smaller package with it crammed in. Chia seeds everywhere when opening. I actually poured these into my last old bag.",
      "rating": 4.0,
      "verified": true,
      "author": "JP",
      "helpful_votes": 0,
      "publication_date": 20191102
    },
    {
      "title": "I am going to try to grind them up first and see if it works better",
      "text": "These don't Gel up as quickly or as thoroughly as my usual brand. I am going to try to grind them up first and see if it works better",
      "rating": 3.0,
      "verified": true,
      "author": "KT",
      "helpful_votes": 4,
      "publication_date": 20160817
    },
    {
      "title": "It organic",
      "text": "I use this t in my smoothie every morning and love it",
      "rating": 5.0,
      "verified": true,
      "author": "Carol Zampa",
      "helpful_votes": 0,
      "publication_date": 20191028
    },
    {
      "title": "Strong dirty aftertaste",
      "text": "I've been using these in my morning smoothies. The dirty taste is too overwhelming to use in my mixed berry recipe. I now stick to peanut butter banana when I add in the Chia seeds, as the peanut butter tastes masks the dirty aftertaste.",
      "rating": 3.0,
      "verified": true,
      "author": "Kyle H",
      "helpful_votes": 0,
      "publication_date": 20180824
    },
    {
      "title": "This is GROUND Chia seed",
      "text": "I didn't realize I was getting grounds seeds. I'm sure they're meant for cooking or something, but just beware when you order.",
      "rating": 4.0,
      "verified": true,
      "author": "Angela D",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "Some Gritty-ness",
      "text": "The price is great, shipped quickly, and product was packaged well. I have been finding gritty seeds that are not chia mixed in. Not a whole lot, and I do realize this is a natural product, and there could be some irregularities, but it's not pleasant when eaten.",
      "rating": 3.0,
      "verified": true,
      "author": "juju",
      "helpful_votes": 6,
      "publication_date": 20170420
    },
    {
      "title": "Weight loss magic? Possibly!",
      "text": "Perfect for smoothies. Adds texture, fiber and protein just to name a few! I believe it has contributed to my weight loss. Will definitely order again.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric",
      "helpful_votes": 0,
      "publication_date": 20190403
    },
    {
      "title": "So much in there",
      "text": "Love love these! The bag is huge and packed so tightly i couldnt reseal it without using extra! Super great and good for you! Enjoy",
      "rating": 5.0,
      "verified": true,
      "author": "Jewel",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "Good quality at a good price",
      "text": "I’ve been eating Chia seeds for years and love them, but ever since they started gaining in popularity, they have been increasingly more expensive. The quality of these Chia seeds is very good and the price is decent for the size.",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda  McKenzie",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "Repeat buyer",
      "text": "I've bought these before & will buy them again -- always a consistently good product and I feel the price is very reasonable. Love adding them into my smoothies, as a topping for yogurt, or making chia pudding!",
      "rating": 5.0,
      "verified": true,
      "author": "A.B.",
      "helpful_votes": 0,
      "publication_date": 20200627
    },
    {
      "title": "Anthony's Organic Chia Seeds",
      "text": "I really like these seeds. I read reports on some that talked about debris. These are clean. I sprinkle on my morning toast. I like the crunch they add. I will definately buy these again.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Shaw",
      "helpful_votes": 0,
      "publication_date": 20181211
    },
    {
      "title": "Excellent quality!",
      "text": "I cannot order these locally and order online. The quality of these was excellent and I store them in glass containers for longer storage. Because of health problems I eat while grains and seeds to replace nutrition that I would normally get from red meat and chia seeds have a lot of the nutrition that a body needs.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181025
    },
    {
      "title": "Great Chia Seeds",
      "text": "Nice product that is exactly as described. I enjoy mixing it with some other natural and high fiber ingredients to make cereal in the morning and I'll likely buy it again when it runs out.",
      "rating": 5.0,
      "verified": true,
      "author": "garrett",
      "helpful_votes": 0,
      "publication_date": 20170612
    },
    {
      "title": "Makes a great guilt free desert",
      "text": "i have these on my oatmeal on oatmeal days. Makes a great pudding with coconut milk, sweetener and fruit topping.",
      "rating": 5.0,
      "verified": true,
      "author": "Orchid",
      "helpful_votes": 0,
      "publication_date": 20191012
    },
    {
      "title": "Poor",
      "text": "There are many sand peicies in between the chia seeds .They are not clean",
      "rating": 2.0,
      "verified": true,
      "author": "Ashu",
      "helpful_votes": 0,
      "publication_date": 20190505
    },
    {
      "title": "first time chia seed user, I like these",
      "text": "First time using these in smooties and protein drinks. they appear to be good quality and the package and resealable bag is nice. Just be weary of how gelatinous chia seeds can be in fluid, but I think thats to be expected.",
      "rating": 5.0,
      "verified": true,
      "author": "Charles",
      "helpful_votes": 0,
      "publication_date": 20180927
    },
    {
      "title": "Chia Seeds organic",
      "text": "good product - fresh - great packaging - arrived in good condition. I use these to lower my cholesterol/LDL and they plump up great. Recommend!!",
      "rating": 5.0,
      "verified": true,
      "author": "redzenskyca",
      "helpful_votes": 0,
      "publication_date": 20200605
    },
    {
      "title": "Works well",
      "text": "Added to my wife's shake for fiber and overall health. She seems happy, so that means I'm happy. Lol.",
      "rating": 5.0,
      "verified": true,
      "author": "E-Train",
      "helpful_votes": 0,
      "publication_date": 20200920
    },
    {
      "title": "LOTS of chia for your dollar!",
      "text": "You get a LOT of chia seeds for the money. If you eat chia on a regular basis, this bag is handy!",
      "rating": 5.0,
      "verified": true,
      "author": "Polymer Clay Crafter",
      "helpful_votes": 0,
      "publication_date": 20200502
    },
    {
      "title": "Love my chia seeds",
      "text": "Anthonys Products are always my go to company as products are always fresh, great Chia seeds",
      "rating": 5.0,
      "verified": true,
      "author": "wendi sirota-gruskin",
      "helpful_votes": 0,
      "publication_date": 20200504
    },
    {
      "title": "great product",
      "text": "I read a lot about people finding bugs in their package? but Mine didnt have any bugs. very fresh product and lasts a good amount of time!",
      "rating": 5.0,
      "verified": true,
      "author": "Alissa A",
      "helpful_votes": 0,
      "publication_date": 20190712
    },
    {
      "title": "no problems",
      "text": "use this for making a brkfst pudding. fill bowl with chia, hemp, almond milk and let it sit and jell for a bit.",
      "rating": 5.0,
      "verified": true,
      "author": "Nam myoho range Kyo",
      "helpful_votes": 0,
      "publication_date": 20190827
    },
    {
      "title": "Great value",
      "text": "Great value for this giant bag of chia seeds. Seem very fresh. Use them on everything. Even the kids like them. Will buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "HC",
      "helpful_votes": 2,
      "publication_date": 20170331
    },
    {
      "title": "Great flavor & good bulk price",
      "text": "This stuff tastes awesome and bakes really well! It tastes great in salads as well.",
      "rating": 5.0,
      "verified": true,
      "author": "pennedname",
      "helpful_votes": 0,
      "publication_date": 20200402
    },
    {
      "title": "Love",
      "text": "My favorite brand of ground chia seed (and a few other of our household staples) to buy!",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley",
      "helpful_votes": 0,
      "publication_date": 20200820
    },
    {
      "title": "The seeds were great but I think I got a really old batch",
      "text": "Purchased late June and had to throw out in late August due to that cobwebby thing that happens when dry goods are too old. The seeds were great but I think I got a really old batch.",
      "rating": 2.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20180904
    },
    {
      "title": "Great value and great taste.",
      "text": "I forgot how big a bag I ordered. Man does this chia go a long way. And it is great for you!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191020
    },
    {
      "title": "Great product",
      "text": "This was my first time buying chia seeds and I was pleased with the product!",
      "rating": 5.0,
      "verified": true,
      "author": "RachichiLu",
      "helpful_votes": 0,
      "publication_date": 20200502
    },
    {
      "title": "Superfood",
      "text": "Large amount in the bag, speedy shipment & they expanded nicely in my yogurt. Happy customer.",
      "rating": 5.0,
      "verified": true,
      "author": "Ladd",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "Always good",
      "text": "Perfect seeds. Other brands had bad reviews. I trust this one and price is good.",
      "rating": 5.0,
      "verified": true,
      "author": "Bernadette Conroy ",
      "helpful_votes": 0,
      "publication_date": 20200221
    },
    {
      "title": "Great quality, great price",
      "text": "I was happy to find a big bag of great quality chia seeds to fill up my 1/2 gallon mason jar. I use them mostly for chia seed pudding, and these taste great! I'm thrilled to report that I'm now on my second bag, and still no dust or stick debris to be found.",
      "rating": 5.0,
      "verified": true,
      "author": "Victoria J.",
      "helpful_votes": 0,
      "publication_date": 20171120
    },
    {
      "title": "My 2nd Order!",
      "text": "Second order from Anthony’s. I am very picky on my Chia Seeds. I find that these are a step ahead of other brands. 21/2 pounds for a great and fair price!",
      "rating": 5.0,
      "verified": true,
      "author": "Gary -Florida",
      "helpful_votes": 0,
      "publication_date": 20190313
    },
    {
      "title": "Love Anthony Organics",
      "text": "Love Anthony Organics!!! Huge bag of chia seeds for cheap and great quality. I couldn't ask for more",
      "rating": 5.0,
      "verified": true,
      "author": "shaun",
      "helpful_votes": 0,
      "publication_date": 20201014
    },
    {
      "title": "Very good",
      "text": "These were very good. I ground them all first for easy mixing into my breakfast",
      "rating": 5.0,
      "verified": true,
      "author": "Patricia A. Fleetwood",
      "helpful_votes": 0,
      "publication_date": 20200709
    },
    {
      "title": "Worst shipping / packaging job ever!",
      "text": "This is how my package arrived. Packaging wrapper inside bubble envelope with chia completely poured out into the envelope. With no return policy. Would never buy again.",
      "rating": 1.0,
      "verified": true,
      "author": "MZ",
      "helpful_votes": 0,
      "publication_date": 20200909
    },
    {
      "title": "Organic raw health!",
      "text": "I go through raw chia seeds so quickly, purchasing in bulk makes sense. These are perfect for me to keep in the resealable bag in between uses for chia puddings of all kinds and raw cookies. Love this stuff!",
      "rating": 5.0,
      "verified": true,
      "author": "lissome lin",
      "helpful_votes": 0,
      "publication_date": 20190116
    }
  ],
  "product_meta": {
    "title": "Anthony's Organic Chia Seed, 2.5 lb, Gluten Free, Vegan, Raw, Keto Friendly",
    "rating": 4.7,
    "feature_bullets": [
      "USDA Certified Organic Black Chia Seeds",
      "Batch Tested and Verified Gluten Free",
      "Great source of Omega-3 fatty acids, protein, antioxidants and fiber",
      "Product of Latin America, Packed in California",
      "Add these versatile seeds to your favorite juices, sprinkle them on salads and oatmeal, or give your smoothie bowl a little chia kick!"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "10.2 x 5.9 x 3 inches; 2.5 Pounds",
      "UPC": "784672404808",
      "Manufacturer": "Anthony's",
      "ASIN": "B00MEUUBZI",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Grocery & Gourmet Food",
      "Chia Seeds",
      "Nuts & Seeds",
      "Cooking & Baking",
      "Pantry Staples"
    ],
    "price": 11.79
  }
}