{
  "website_summaries": [
    {
      "verdict": "The Nike Air Mavin Low is a value-oriented basketball sneaker that gets the job done on and off the hardwood. The leather and synthetic material deliver standout style and performance. The shoe's encapsulated Nike Air unit also keeps the foot supported all day long. So, if you are looking for a durable, stylish, and affordable everyday sneaker, then you should try on a pair of the Air Mavin Lows from Nike.",
      "pros": [
        "According to most buyers, the Nike Air Mavin Low looks incredible",
        "Like the Nike Kyrie Flytrap III, most wearers are commenting that these low-top basketball shoes are incredibly comfortable to wear",
        "A good number of users are claiming that the low-top Nike Air Mavin is quite durable",
        "According to a few owners, these Nike basketball shoes are water-resistant and can be worn in the rain",
        "A significant number of players are saying that the Air Mavin Low has excellent traction",
        "These low-top basketball shoes from Nike are very supportive, several reviewers observe"
      ],
      "cons": [
        "Some buyers are complaining that the Air Mavin Low fits a little too tight",
        "The cushioning is a bit too stiff for basketball, several players gripe",
        "Owners of the UA Curry 7 have a similar complaint",
        "According to a few users, the upper material creases easily"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": 7.5,
      "source": "runrepeat"
    }
  ],
  "customer_reviews": [
    {
      "title": "My son likes them but...",
      "text": "The shoes are nice and appear to be new but the box they came in was all beat up and damaged. At first I thought someone took the shoes I bought and kept them for themselves and replaced them with an old pair from their closet. For what I paid for the shoes, I expected them to arrive in a decent package. Safe to say I won't be ordering from this seller again.",
      "rating": 2.0,
      "verified": true,
      "author": "Atiya Burks",
      "helpful_votes": 4,
      "publication_date": 20200812
    },
    {
      "title": "A neater look than other athletic shoes",
      "text": "My teenage kid is very finicky about his shoes and has stuck to the same model of Nike sneakers for a while now. I demanded that he try something different so he chose these shoes---and surprise, he actually loves them! Nice light color, but with enough black and white accents to break things up. Fit was just as expected. My one star off is minor. The shoe is a little stiffer in construction than the Nikes he usually wears: this is a good thing in my opinion---I hate the way some sneakers get stretched as they're broken in---but my son says the shoes make a little more noise than he likes.",
      "rating": 4.0,
      "verified": true,
      "author": "LegoGirl",
      "helpful_votes": 6,
      "publication_date": 20170323
    },
    {
      "title": "GLUE WILL NOT HOLD",
      "text": "I don't want to be mean but for basketball shoes these are extremely unreliable. works good for a fey weeks but if your coach makes you run a lot the glue will peal off. The name brand doesn't do anything. If it was five bucks i mite buy it, but my 20 dollar Walmart shoes lasted a whole year loner than these things. for 100 bucks you'd expect something to last for more than a month.",
      "rating": 2.0,
      "verified": true,
      "author": "Samuel Ted Dunagan",
      "helpful_votes": 2,
      "publication_date": 20200303
    },
    {
      "title": "Decent Shoes, Box was Gross",
      "text": "I bought these as a gift and the box looked like something I bought it at a garage sale that had sat under a pile of junk for years. The paper inside the box was torn and wrinkled. I half expected the shoes to be knockoffs at that point...The shoes were new though and the person I gifted them to liked them but if you're not buying these for yourself, I'd have an alternate plan to box them in as a gift.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20200827
    },
    {
      "title": "Great looking and very comfortable shoes!",
      "text": "I have a grey pair that I love, so I wanted a second pair, but of a different color. These look awesome. I have nerve damage in my feet and these are very comfortable and I have no trouble wearing them for an extended period of time.",
      "rating": 5.0,
      "verified": true,
      "author": "James A. Settecase",
      "helpful_votes": 5,
      "publication_date": 20180321
    },
    {
      "title": "Nice Nikes!",
      "text": "I bought these for my son - he is a 9 1/2 size but we got a 10 since it is cheaper (don't know why) but they fit him very well and he loves them.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20170929
    },
    {
      "title": "Tight fit for men size 9.5",
      "text": "The shoe is narrow at the baby toe region of my foot. I wear a size 9.5 men and my Reebok cushion work shoes are more comfortable than this shoe. I bought the shoe for basketball but I don't like the tight fit. Thus, I could not wear this shoe for the whole day or for a whole basketball game.",
      "rating": 2.0,
      "verified": true,
      "author": "Long Live Sports",
      "helpful_votes": 4,
      "publication_date": 20160304
    },
    {
      "title": "Very good product for a fair price",
      "text": "The tennis is not so much confortable as expected, being a basketball tennis. But I would be unfair if I rate it as unconfortable. Coud be little softer, but it fits its purpose well. And has an excellent design.",
      "rating": 4.0,
      "verified": true,
      "author": "Leonardo",
      "helpful_votes": 0,
      "publication_date": 20201005
    },
    {
      "title": "Excellent fit and customer service",
      "text": "These shoes were more than worth the price. They took a little longer to get but due to the current situation this seller had excellent service and sold me exactly what I wanted",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200525
    },
    {
      "title": "Great comfort",
      "text": "Fit just right. I used them all day and they were comfortable. Good style loved the color. I got the grey with white.",
      "rating": 5.0,
      "verified": true,
      "author": "Jesse Orta",
      "helpful_votes": 0,
      "publication_date": 20200907
    },
    {
      "title": "Picture is better than in person",
      "text": "The picture looks way better than in person they grey has a shine to it makes it look a pinkish blue. So really dont like the shoes",
      "rating": 3.0,
      "verified": true,
      "author": "violet",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Cool",
      "text": "Box was beat up but gift inside was nice thanks a lot Nike shoes",
      "rating": 5.0,
      "verified": true,
      "author": "Dennis Waters",
      "helpful_votes": 0,
      "publication_date": 20201001
    },
    {
      "title": "Good Look and Comfort",
      "text": "Good looking shoe and fits well! This is actually my second pair. Both stylish and comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "maui1954",
      "helpful_votes": 0,
      "publication_date": 20200828
    },
    {
      "title": "Gotta love Nike!",
      "text": "Wear these as regular black shoes around running errands and such. They work with just about every pant from jeans, sweats, or simple trousers.. Had a pair similar to these for 7 yrs and wore till only used for yardwork/ holes in em' lol.",
      "rating": 5.0,
      "verified": true,
      "author": "Joshua P. - California",
      "helpful_votes": 0,
      "publication_date": 20161024
    },
    {
      "title": "Very nice looking and comfortable shoe",
      "text": "Very nice looking and comfortable shoe. One of my sons really liked them, so I bought him a pair! Good price!",
      "rating": 5.0,
      "verified": true,
      "author": "Ricardo J. Diaz",
      "helpful_votes": 2,
      "publication_date": 20161202
    },
    {
      "title": "Three Stars",
      "text": "gave them to my son and purchased half size bigger",
      "rating": 3.0,
      "verified": true,
      "author": "Robert",
      "helpful_votes": 2,
      "publication_date": 20160926
    },
    {
      "title": "Basketball shoes",
      "text": "The shoes looks nice and I good shape when it was delivered. I love the way it looks in actual.",
      "rating": 5.0,
      "verified": true,
      "author": "Lotus Shoemaker",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "Great buy",
      "text": "A repeat purchase and I just add my orthotic and I am good to go. Durable and comfortable",
      "rating": 5.0,
      "verified": true,
      "author": "Daphne B",
      "helpful_votes": 0,
      "publication_date": 20190628
    },
    {
      "title": "Nike Rules",
      "text": "Very happy with my purchase. Love the style and couldn't find anywhere in my size. Pleasure to do business with.",
      "rating": 5.0,
      "verified": true,
      "author": "JeffK888",
      "helpful_votes": 0,
      "publication_date": 20161121
    },
    {
      "title": "Great shoe",
      "text": "Good shoe, good price. This is my second pair of these and I love em!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181011
    },
    {
      "title": "Nice",
      "text": "The white part of the shoe has an iridescent gleam to it.",
      "rating": 4.0,
      "verified": true,
      "author": "A.Rose",
      "helpful_votes": 0,
      "publication_date": 20201025
    },
    {
      "title": "Five Stars",
      "text": "Best pair of NIKE's that I have ever worn. Could not be happier.",
      "rating": 5.0,
      "verified": true,
      "author": "idaho canuck",
      "helpful_votes": 0,
      "publication_date": 20161218
    },
    {
      "title": "satisfied with shoes",
      "text": "Bought for my fiances birthday. He really liked the look and the fit",
      "rating": 5.0,
      "verified": true,
      "author": "Angela Ross",
      "helpful_votes": 0,
      "publication_date": 20200825
    },
    {
      "title": "... times a week and find this to be a nice light basketball shoe with good support",
      "text": "I play ball 2 or 3 times a week and find this to be a nice light basketball shoe with good support. Currently on my third pair.",
      "rating": 4.0,
      "verified": true,
      "author": "Carolina Boy",
      "helpful_votes": 0,
      "publication_date": 20180508
    },
    {
      "title": "kill my feet will return",
      "text": "I went for a 45 minutes walk and had to take them off. My feet feel terrible in them and in 30 minutes I got bruises. Will return.",
      "rating": 1.0,
      "verified": true,
      "author": "Voicu Chis",
      "helpful_votes": 0,
      "publication_date": 20200813
    },
    {
      "title": "Best tennis shoe I have ever owned!",
      "text": "Great shoes! I like them so much I have purchased four pairs total to hedge against Nike discontinuing production if this model.",
      "rating": 5.0,
      "verified": true,
      "author": "Ken Degenhart",
      "helpful_votes": 0,
      "publication_date": 20170401
    },
    {
      "title": "Nike shoes",
      "text": "Product fits as expected and my son loves them, awesome style and arch support.",
      "rating": 5.0,
      "verified": true,
      "author": "RACHEL K.",
      "helpful_votes": 0,
      "publication_date": 20201019
    },
    {
      "title": "Poor quality",
      "text": "These shoes were tearing apart after only a few months. Totally out of the usual Nike quality. Someone should make this good!",
      "rating": 1.0,
      "verified": true,
      "author": "Billy G.",
      "helpful_votes": 0,
      "publication_date": 20201017
    },
    {
      "title": "Disappointed",
      "text": "Very disappointed with the shoes that I brought thought they were kind of high tops but they're low just not my style",
      "rating": 1.0,
      "verified": true,
      "author": "Nicholas",
      "helpful_votes": 0,
      "publication_date": 20200611
    },
    {
      "title": "shines pink but other than that comfy and great looking shoe",
      "text": "Great shoe looks awesome. But it does kinda shine pink. Other than that great buy 👍",
      "rating": 4.0,
      "verified": true,
      "author": "Zach C Watson",
      "helpful_votes": 0,
      "publication_date": 20200814
    },
    {
      "title": "Good product",
      "text": "Bought these as a gift. Got them on time. Shoe was a little small but that isn’t the sellers fault.",
      "rating": 4.0,
      "verified": true,
      "author": "Betsy Blackiston",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "Great fit",
      "text": "Already own some Nike shoes do I knew what size to order. Fit just as expected.",
      "rating": 5.0,
      "verified": true,
      "author": "jjr",
      "helpful_votes": 0,
      "publication_date": 20200926
    },
    {
      "title": "Great shoe",
      "text": "Price. Kohl’s has them for cheaper when you use coupon. Just didn’t have my size.",
      "rating": 5.0,
      "verified": true,
      "author": "Diana Athey",
      "helpful_votes": 0,
      "publication_date": 20200611
    },
    {
      "title": "Nice",
      "text": "I got exactly what I expected for my son. He loves them.",
      "rating": 5.0,
      "verified": true,
      "author": "Lizita",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "Delivered on time",
      "text": "I love the color, my dad is happy with these shoes",
      "rating": 5.0,
      "verified": true,
      "author": "Tamu Stanberry",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "I recommend this item",
      "text": "They got here on time.The color was right and the shoes fit.",
      "rating": 3.0,
      "verified": true,
      "author": "Corley Ray Colburn",
      "helpful_votes": 0,
      "publication_date": 20201029
    },
    {
      "title": "Love this shoe!",
      "text": "Cars, design is some of the best I've seen from Nike",
      "rating": 5.0,
      "verified": true,
      "author": "Joshua Thompson",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "Didn’t fit.",
      "text": "I like this product but they are too small for me.",
      "rating": 3.0,
      "verified": true,
      "author": "Dilli Adhikari",
      "helpful_votes": 0,
      "publication_date": 20200626
    },
    {
      "title": "Great",
      "text": "Delete this from my page, a gift don't want seen. Thanks",
      "rating": 1.0,
      "verified": true,
      "author": "lanell dugat",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "This is my second pair. They fit so well ...",
      "text": "This is my second pair. They fit so well and I was afraid that my 1st pair would wear out and that I wouldn’t find another pair.",
      "rating": 5.0,
      "verified": true,
      "author": "Heather Mason",
      "helpful_votes": 0,
      "publication_date": 20180301
    },
    {
      "title": "The half size up fits him perfect and he loves the colors",
      "text": "Ordered a a half size up for my boyfriend because previous reviews said they were a bit small. The half size up fits him perfect and he loves the colors!",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie",
      "helpful_votes": 0,
      "publication_date": 20170127
    },
    {
      "title": "'Cushy' and grip!",
      "text": "Perfect size and weight. These shoes are low tops so please beware. They are just what I wanted and have broken in just fine. I do not wear them outside.",
      "rating": 5.0,
      "verified": true,
      "author": "brendan gene",
      "helpful_votes": 0,
      "publication_date": 20170102
    },
    {
      "title": "Disappointed with Quality from Seller",
      "text": "The insole of the shoe came to me being loose and made a sticky noise with each step. There was also a couple spots that were scuffed. Very disappointed in the quality or lack thereof that this shoe was manufactured with!",
      "rating": 2.0,
      "verified": true,
      "author": "Katelyn M.",
      "helpful_votes": 0,
      "publication_date": 20160203
    },
    {
      "title": "Great shoes",
      "text": "Bought them for my husband. He likes very simple designs and these were perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "gz",
      "helpful_votes": 0,
      "publication_date": 20170116
    },
    {
      "title": "wrong item",
      "text": "i need black one and they give me white i dont like this item",
      "rating": 1.0,
      "verified": true,
      "author": "lasha",
      "helpful_votes": 0,
      "publication_date": 20160721
    },
    {
      "title": "DO NOT BUY. WORST EXPERIENCE EVER.",
      "text": "The worst product I have ever received. It looked like someone took a marker to put on the print of the sole and when the package received it was smeared all over the place and totally gone on one shoe.",
      "rating": 1.0,
      "verified": true,
      "author": "Honest review",
      "helpful_votes": 0,
      "publication_date": 20170105
    }
  ],
  "product_meta": {
    "title": "Nike Air Mavin Low Basketball Shoe",
    "description": "Nike Men's Air Mavin Low Basketball Shoe…",
    "rating": 4.4,
    "feature_bullets": [
      "Closure: Lace-Up",
      "Shoe Width: D(M) mens_us"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "1 Jan. 2014",
      "Manufacturer": "Nike",
      "ASIN": "B01BU05EAO",
      "Item model number": "719929",
      "Department": "Men’s"
    },
    "categories": [
      "Basketball Shoes",
      "Fashion & Athletic Trainers",
      "Shoes",
      "Sports & Outdoor Shoes",
      "Men's Shoes",
      "Shoes & Bags"
    ],
    "price": ""
  }
}