{
  "website_summaries": [
    {
      "verdict": "Easy to install and operate, with a very simple design. Has multiple uses but is ideal for bunk beds and loft beds.",
      "pros": [
        "Easily twist and lock the clamp on this tray on the side of your bed",
        "Great for when you need an extra bit of storage space, or if you are on the top bunk and can't install a shelf",
        "Simple heavyweight plastic design is easy to clean"
      ],
      "cons": [
        "Not useful for beds with very thick frames or rounded metal frames"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "perfect!",
      "text": "This was perfect I was recently diagnosed with sleep apnea and needed a place to put my cpap machine I didn't have room for a traditional side table but the did the trick I can easily fit my machine my cell phone and my glasses on this table.",
      "rating": 5.0,
      "verified": true,
      "author": "Laura McGuffin",
      "helpful_votes": 47,
      "publication_date": 20170807
    },
    {
      "title": "Good idea, but cheaply made and too small",
      "text": "The space between clamps was about 1/2\" too small for my situation. It says the clamp is 2\", but the space between the clamp is only about 1.5\" so will only fit bed frames 1.5\" or smaller. I was also disappointed at what a cheap piece of plastic it was for such a high cost. Returning item.",
      "rating": 1.0,
      "verified": true,
      "author": "coastalrn",
      "helpful_votes": 9,
      "publication_date": 20180529
    },
    {
      "title": "Works perfectly with IKEA metal bunk bed.",
      "text": "Perfect four my kids' Ikea metal bunkbed. You can't put anything too heavy on it, but it is very sturdy. It fits on the frame, just below the bars (level with the bottom of the mattress). My son loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "soigne",
      "helpful_votes": 52,
      "publication_date": 20160226
    },
    {
      "title": "Great shelf for my daughter's bunk bed",
      "text": "Great shelf for my daughter's bunk bed! She just got a bunk bed and we were wondering how to keep her kleenex and water on the top bunk with her. This is great! It was easy to put up and seems to hold quite a bit. Only issue I had was that the shelf came in white, instead of black (like shown).... I'm not sure if I missed that detail when I bought it, but something to check when ordering. Other than that, we LOVE it!!",
      "rating": 4.0,
      "verified": true,
      "author": "HTCuillier",
      "helpful_votes": 8,
      "publication_date": 20160128
    },
    {
      "title": "It's pretty cool, My son loves it and it has ...",
      "text": "It's pretty cool , My son loves it and it has served it's purpose",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 14,
      "publication_date": 20170428
    },
    {
      "title": "Almost perfect.",
      "text": "I bought this as a gift for my husband because he doesn't have a nightstand next to his side of the bed. He puts his phone on here and headphones during the night for charging. He loves it! The only thing that would make this product better, hence the 4 stars, would be to have some kind of soft material that would prevent phone vibrations from making noise. We fixed this by putting a hand towel on there, but it would be nice for it to include this feature.",
      "rating": 4.0,
      "verified": true,
      "author": "Stela",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Otherwise we're happy with the purchase",
      "text": "It was a tight fit on my son's Ikea bunk bed, but now that it's on he loves having a little spot to put his water bottle and other nighttime items. It came with a big sticker/label on the tray, which has left behind a sticky residue I can't get off...why do companies always do that??? Otherwise we're happy with the purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "Carmen Welton",
      "helpful_votes": 2,
      "publication_date": 20170808
    },
    {
      "title": "Great for bunks.",
      "text": "We got one of these gifted to our family and we have a set a bunk beds. It worked so well on the top bunk that I wanted one for the bottom bunk. I looked on Amazon to find this product priced double what they paid for the original (price tag was left on from Menard's). But they are sturdy and if you wanted you could double for an even larger table. They are designed with lips to prevent items from falling off and the clamps that attach them to the bed are sturdy. I like that it give you some freedom for bed placement too--you don't have to worry if there is enough room for your bedside table.",
      "rating": 5.0,
      "verified": true,
      "author": "Saavik",
      "helpful_votes": 6,
      "publication_date": 20150222
    },
    {
      "title": "Good product, works as advertised, price may be a little high but haven’t found anything better",
      "text": "It’s a simple product, but it works well. I liked it so much that I have six of them. They can bear a decent bit of weight (I’ve definitely left a few textbooks on one, and it’s been fine). The gross margins on this are probably astronomical, but hey, I haven’t found anything comparable at a lower price point so no stars off for that (if I do, maybe 4 stars for the price). The white ones can stain if stuff is spilled on them, so I suggest going with a darker color.",
      "rating": 5.0,
      "verified": true,
      "author": "Sai Parepally",
      "helpful_votes": 0,
      "publication_date": 20190306
    },
    {
      "title": "Great for Dorm Rooms",
      "text": "Though this piece of plastic is way too expensive, it is well worth it. I got it for my dorm room bed, which I trundled above my roommates. It's large enough to hold my 13\" laptop and generally also put my phone and water bottle in it. I'll continue using it for a very long time! Super useful.",
      "rating": 5.0,
      "verified": true,
      "author": "ICONMAKER",
      "helpful_votes": 0,
      "publication_date": 20181108
    },
    {
      "title": "A must have for a dorm",
      "text": "This is a must have for a college dorm . Especially if the bed is lofted.",
      "rating": 5.0,
      "verified": true,
      "author": "Christine A. Robidoux",
      "helpful_votes": 0,
      "publication_date": 20191209
    },
    {
      "title": "this item is far superior than any other we've tried",
      "text": "After trying several products and looking multiple places for a bedside stand for my sons lofted bed, this item is far superior than any other we've tried. It can hold multiple books AND a full glass of water with no problem. Incredibly sturdy and easy to place. My son and I are both thrilled!",
      "rating": 5.0,
      "verified": true,
      "author": "LPB",
      "helpful_votes": 5,
      "publication_date": 20151108
    },
    {
      "title": "Great bedside shelf",
      "text": "I bought a different brand a couple months ago, but it arrived with a carcinogen warning. Nope. This one is made of plastic, so hopefully the lack of label wasn't an accident. The shelf works great. Holds a sturdy lamp and a couple books, no sweat.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190226
    },
    {
      "title": "Sturdy bedside shelf table.",
      "text": "This product is very sturdy and made well. It can clearly hold heavy items. It did not fit on the side of the dorm bed because the frame was too thick on the bed, so we attached it to the head of the bed and it works well. I mistakenly gave this item 1 star and said that the pieces were not all in the box which is incorrect. That review and rating was for a different bedside buddy shelf but the Amazon site would not let me remove it.",
      "rating": 5.0,
      "verified": true,
      "author": "Chandler",
      "helpful_votes": 0,
      "publication_date": 20161023
    },
    {
      "title": "Very useful",
      "text": "We purchased one of these for our son, who is temporarily using a bunk bed that he can't modify, so attaching a wooden shelf was out of the question. He likes it enough that we got him a second one. Note that he's using these for small items - glasses, wallet, phone, etc., and I doubt they would work as well for large or heavy things. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "eliza",
      "helpful_votes": 2,
      "publication_date": 20160521
    },
    {
      "title": "A bit unsteady but ultimately useful.",
      "text": "If you have a loft bed and cant get a tall desk close enough to your bed, you need something like this. Because of the way my bed was set up, I have this holding on to a circular rail instead of a bigger part of the frame, which is why I saw it's a bit lopsided, but it keeps a tissue box, my phone, and a few other small objects way closer to reach than I could have them otherwise",
      "rating": 4.0,
      "verified": true,
      "author": "Emily Richardson",
      "helpful_votes": 0,
      "publication_date": 20190104
    },
    {
      "title": "Daughter LOVES it!",
      "text": "We got this for our daughter who sleeps on the top bunk. Her sister has one so she wanted one as well. She loves it. It's excellent quality and is easy to put on. It's perfect for her to lay her glasses on at night before falling asleep. It also holds her cellphone, etc. Great product!!!",
      "rating": 5.0,
      "verified": true,
      "author": "kwolff",
      "helpful_votes": 0,
      "publication_date": 20190107
    },
    {
      "title": "Love it, use it all the time",
      "text": "Love it, use it all the time. I live in a tiny apartment so I need all the extra space I can get and this definitely helps since I'm the top bunk. It fits a lamp, my phone and waterbottle without fear of any of them being knocked off the table. Love it and would definitely recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Nhu",
      "helpful_votes": 2,
      "publication_date": 20161130
    },
    {
      "title": "Wrong one",
      "text": "Didn’t see it described as specifically made only for a bunk bed. Really trying to find one for a normal bed. Cute concept but returned it.",
      "rating": 2.0,
      "verified": true,
      "author": "Morgysmom",
      "helpful_votes": 0,
      "publication_date": 20190106
    },
    {
      "title": "Worth the purchase",
      "text": "This is one of those items you don’t know you needed until you have it. When I rearranged my bedroom I lost space beside my bed to place my nightstand on one side, but I needed somewhere to put my glasses at night. It took me forever to find one for the right price, and I’m glad I took my time. It’s sturdy, small yet big enough.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180831
    },
    {
      "title": "Great shelf if you have no place for a nightstand",
      "text": "I just moved to an apartment and there isn't much room next to my bed and I can't really fit a nightstand and didn't want to drill holes for a ledge so anyways this is great. Fits well attached to me bed and so far it's holding everything I put on there: cell phone, book, bottle of water, remote, glasses.",
      "rating": 5.0,
      "verified": true,
      "author": "Caroline",
      "helpful_votes": 0,
      "publication_date": 20170819
    },
    {
      "title": "Perfect for loft bed",
      "text": "My son has a loft bed and need a shelf to put his drink on at night. We didn't want him to ruin his wood shelf (water rings and water swelling), so he got this. It's strong, holds quite a lot, and has a great lip to prevent stuff from falling off. This is a real winner!",
      "rating": 5.0,
      "verified": true,
      "author": "Scoli",
      "helpful_votes": 2,
      "publication_date": 20170217
    },
    {
      "title": "Great product and outstanding customer service!",
      "text": "The shelf is great and very sturdy. One screw arrived bent and could not be tightened. The manufacturer was contacted and two replacement arrived within a few days. Outstanding product, even better customer service. I will be buying more in the future as graduation gifts.",
      "rating": 5.0,
      "verified": true,
      "author": "Angie Mathews ",
      "helpful_votes": 0,
      "publication_date": 20180714
    },
    {
      "title": "Strong and sturdy! A great find!",
      "text": "Bought for 7 yr old who sleeps on the top bunk. It’s plastic, sturdy, and holds several books, a nighttime water glass, and a few trinkets. Fastened on easily. Coupled with a flexible gooseneck lamp clipped on the bed frame, it makes for a great setup. He loves it!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Janet",
      "helpful_votes": 0,
      "publication_date": 20180112
    },
    {
      "title": "Sturdy!",
      "text": "My 5-year-old has this attached to his upper bunk. This is exactly what I was looking for - a sturdy tray with lip to hold his book, snack, drink, remote control, or whatever small toy he takes to bed. Well built, easy to attach, and most importantly, nothing has fallen off of it!",
      "rating": 5.0,
      "verified": true,
      "author": "Lash",
      "helpful_votes": 3,
      "publication_date": 20150805
    },
    {
      "title": "They are pretty sturdy as well",
      "text": "I got 2 of these for my son in college and he loves them. He sleep s on the top bunk so he can keep his phone and glasses close at night. They are pretty sturdy as well. He used one to put his computer monitor on for a while.",
      "rating": 5.0,
      "verified": true,
      "author": "Seabee9320",
      "helpful_votes": 2,
      "publication_date": 20170409
    },
    {
      "title": "Very deserving of 5 stars - might just buy another one",
      "text": "This thing was perfect for my needs. We rearranged the bedroom and there wasn't much room between my side of the bed and the door. This shelf was the perfect size and is very sturdy. Perfect balance of forces. My dad was engineer and this shelf is like something he would have built for me if he were still alive. This is the highest praise I can give to any product.",
      "rating": 5.0,
      "verified": true,
      "author": "Lynn E Munro",
      "helpful_votes": 2,
      "publication_date": 20161007
    },
    {
      "title": "Good purchase",
      "text": "It’s a hard plastic so it’s not soft. But I didn’t want it to be. It’s very useful in my dorm.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191102
    },
    {
      "title": "Great find",
      "text": "I don't know why I waited so long to look for something like this. My son has a loft bed - this is perfect for his glasses, a drink, tissues, and the remote control. It is plastic, but is sturdy. Ordering one for my college kid too!",
      "rating": 5.0,
      "verified": true,
      "author": "PAMom",
      "helpful_votes": 0,
      "publication_date": 20170116
    },
    {
      "title": "Works as a great little shelf",
      "text": "I mounted this to my bed rail to keep things handy at night. I wear rx glasses so it's nice to be able to reach in the same place for my stuff without knocking stuff off the night stand",
      "rating": 5.0,
      "verified": true,
      "author": "Monkey fighter level2",
      "helpful_votes": 0,
      "publication_date": 20181031
    },
    {
      "title": "Three Stars",
      "text": "Pretty neat idea and attaches without a problem. However, we have all hit our heads on the corners.",
      "rating": 3.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 0,
      "publication_date": 20180824
    },
    {
      "title": "Not only for bunk beds",
      "text": "My son got rid of the loft bed but he has it on his sleigh bed and it works wonderfully",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa Kennedy",
      "helpful_votes": 0,
      "publication_date": 20190928
    },
    {
      "title": "Recommended",
      "text": "We bought the bunk buddy bedside shelf and it is exactly what we expected; it is as described. It’s lightweight, fits well, and is easy to reposition as needed.",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel",
      "helpful_votes": 0,
      "publication_date": 20191114
    },
    {
      "title": "This is great! Note it has 2 spots to clip to ...",
      "text": "This is great! Note it has 2 spots to clip to bed. Some on the market only have one and they tip very easily. My daughter lofted her bed at school and loves that she has this. The edges are high enough that things don't accidentally slide off.",
      "rating": 5.0,
      "verified": true,
      "author": "busymomof3",
      "helpful_votes": 0,
      "publication_date": 20170822
    },
    {
      "title": "Perfect for a college student",
      "text": "Purchased this for my son who is a freshman in college and he's said it's the number one thing he's thankful he took with him. Having a lofted bed means no side table for water, phone, or an alarm clock and this is the solution! It was easy to install on his dorm bed and he hasn't had any issues with it so far. Great product for the price and perfect for any lofted bed!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181210
    },
    {
      "title": "Just what we needed...",
      "text": "Such a great item! It's lightweight, but sturdy enough to hold what is needed (book light, small cup of water, tablet, etc.).",
      "rating": 5.0,
      "verified": true,
      "author": "MLove80",
      "helpful_votes": 0,
      "publication_date": 20170313
    },
    {
      "title": "Cool product!",
      "text": "This thing is awesome. We bought our son a bunk bed but he really needed somewhere for his alarm clock and maybe a cup of water and this was perfect. He has had it for almost a year now and its held up great!",
      "rating": 5.0,
      "verified": true,
      "author": "Kbrooke22",
      "helpful_votes": 0,
      "publication_date": 20170724
    },
    {
      "title": "Great shelf for any situation",
      "text": "Great shelf for any situation. I like the materials and mounting it was easy. I just with the had a few holes at the end to put cables thru.",
      "rating": 5.0,
      "verified": true,
      "author": "Raffi Red",
      "helpful_votes": 0,
      "publication_date": 20180515
    },
    {
      "title": "It would be nice to know what the demensions are for the clasp",
      "text": "It would be nice to know what the demensions are for the clasp. Overpriced for what it is. Plastic",
      "rating": 3.0,
      "verified": true,
      "author": "HDoubleUB",
      "helpful_votes": 0,
      "publication_date": 20171112
    },
    {
      "title": "Works perfect!",
      "text": "This works perfect for an upper bunk! My daughters had to share a room while my father in law stayed with us and my daughter was able to put a small fan on it, her water, and a flashlight with some room to spare. Worked wonderful!",
      "rating": 5.0,
      "verified": true,
      "author": "Momofsix",
      "helpful_votes": 0,
      "publication_date": 20170610
    },
    {
      "title": "Convenient",
      "text": "I have one of those Ikea beds with drawers on all sides so a nightstand is out of the question. This is really freaking convenient",
      "rating": 5.0,
      "verified": true,
      "author": "Lonnie Allen",
      "helpful_votes": 0,
      "publication_date": 20181015
    },
    {
      "title": "Very Sturdy",
      "text": "This worked great for my daughter’s dorm room – it attaches easily to the side of the bed frame and appears sturdy, and can hold a tablet, drink, and phone all at the same time.",
      "rating": 4.0,
      "verified": true,
      "author": "Michael Gallagher",
      "helpful_votes": 0,
      "publication_date": 20170911
    },
    {
      "title": "Purchased for my daughter who moved into her first college ...",
      "text": "Purchased for my daughter who moved into her first college dorm this fall and SHE LOVES IT! She said it should be required for all students! 😊",
      "rating": 5.0,
      "verified": true,
      "author": "Amy713",
      "helpful_votes": 0,
      "publication_date": 20171008
    },
    {
      "title": "Every loft needs this",
      "text": "This shelf is easy to set up and holds a decent amount. Look no further and buy this shelf",
      "rating": 5.0,
      "verified": true,
      "author": "A.S.",
      "helpful_votes": 0,
      "publication_date": 20190503
    },
    {
      "title": "Five Stars",
      "text": "my sons phone, laptop and remote control kept falling off of his loft bed... problem solved",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180724
    },
    {
      "title": "Love this!",
      "text": "LOVE this. Terribly pricey but the only thing I could find that would work. Now we don't have to eat on our laps at ballgames. 😎",
      "rating": 5.0,
      "verified": true,
      "author": "Eileen Mary",
      "helpful_votes": 0,
      "publication_date": 20170924
    },
    {
      "title": "Works in any bed!",
      "text": "We bought this for my son's dorm room and it's great. There is an adjustment to tighten it on the bar so it fits wherever you need it to. Perfect for close quarters.",
      "rating": 5.0,
      "verified": true,
      "author": "Renee Reads",
      "helpful_votes": 0,
      "publication_date": 20180819
    },
    {
      "title": "Sturdy good shelf",
      "text": "Use it every day in my dorm room. Great shelf for attaching to a college bed.",
      "rating": 5.0,
      "verified": true,
      "author": "Josh",
      "helpful_votes": 0,
      "publication_date": 20180106
    },
    {
      "title": "Good!",
      "text": "Only reason I didn't give it five is that I can only attach it to the long rails. The head and foot boards are too thick. Otherwise it's great.",
      "rating": 4.0,
      "verified": true,
      "author": "Batman2001",
      "helpful_votes": 0,
      "publication_date": 20170610
    },
    {
      "title": "Works Well",
      "text": "Given 3 as gifts to relatives with loft or captain's beds too high for end tables -- all 3 find the shelf a sturdy convenient place to put their phone, water bottle and tissue box.",
      "rating": 5.0,
      "verified": true,
      "author": "Thriftstore Addict",
      "helpful_votes": 0,
      "publication_date": 20170605
    },
    {
      "title": "What do you want?  It's a shelf.",
      "text": "It's flat with a good rim to prevent roll off, clamps on tightly & holds stuff. It's a shelf - it's great. Only time will tell whether or not it can decipher the genetic code.",
      "rating": 5.0,
      "verified": true,
      "author": "Essay",
      "helpful_votes": 0,
      "publication_date": 20151201
    },
    {
      "title": "Works great on dorm bed",
      "text": "Works great on dorm bed. THe first one I purchased was inexpensive and would not hold up, keep falling down had to return it. THis one works perfect! and I would reccommend it",
      "rating": 5.0,
      "verified": true,
      "author": "Cindy",
      "helpful_votes": 0,
      "publication_date": 20160910
    },
    {
      "title": "Necessity for college",
      "text": "It may be overpriced but I use it every single day in my dorm. I usually keep a bottle of water, chapstick, and my phone on it.",
      "rating": 5.0,
      "verified": true,
      "author": "Emily N.",
      "helpful_votes": 0,
      "publication_date": 20170513
    },
    {
      "title": "Perfect for the side of her lofted bed in er ...",
      "text": "Ordered this for our daughter to take to college this fall. Perfect for the side of her lofted bed in er sorority house. Thanks!!",
      "rating": 5.0,
      "verified": true,
      "author": "Vicki L. Wallace",
      "helpful_votes": 0,
      "publication_date": 20160602
    },
    {
      "title": "Convenient",
      "text": "This is perfect for a box of tissues, ear buds, snacks, and much more. It is very sturdy and lasts many years. I wouldn’t put a drink on it though.",
      "rating": 5.0,
      "verified": true,
      "author": "Kenneth A. Dorabialski",
      "helpful_votes": 0,
      "publication_date": 20181228
    },
    {
      "title": "Sturdy shelf.",
      "text": "Surprisingly sturdy for plastic. Clamps down tight with no shifting. I regularly have a 32oz water bottle, my phone, and chargers on it. This doesn't seem to strain the shelf at all.",
      "rating": 5.0,
      "verified": true,
      "author": "Christine A. Reifer",
      "helpful_votes": 0,
      "publication_date": 20160426
    },
    {
      "title": "buy it you poor unfortunate soul",
      "text": "So worth the money. Best purchase for my dorm yet. Makes my life so much easier",
      "rating": 5.0,
      "verified": true,
      "author": "Roni",
      "helpful_votes": 0,
      "publication_date": 20170619
    },
    {
      "title": "Perfect for Kids and Bunkbeds",
      "text": "I've bought 3 of these over the years - once a child gets old enough it is a perfect shelf for their bunk bed! We have three kids and this little shelf is durable enough to keep up with even the roughest treatment! Great value for the money.",
      "rating": 5.0,
      "verified": true,
      "author": "FlyingPigDigital",
      "helpful_votes": 0,
      "publication_date": 20160419
    },
    {
      "title": "Exactly as described",
      "text": "My husband is very pleased with this product! It was exactly what he needed.",
      "rating": 5.0,
      "verified": true,
      "author": "Carol J.",
      "helpful_votes": 0,
      "publication_date": 20170424
    },
    {
      "title": "MUST BUY",
      "text": "Best invest in my college career so far. Perfect for bunk beds or raised beds. It held my watches, phone, water bottles, glasses all at once. Highly impressed with this product. Everyone asked where I got it and I send them the link to it every time.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180706
    },
    {
      "title": "Excellent, Multi-Functional Device",
      "text": "It can be used for a variety of situations — not just bunk beds. Sturdy. Reliable. Well-designed. I'm planning to buy several more either this month or next month.",
      "rating": 5.0,
      "verified": true,
      "author": "Benjamin Franklin",
      "helpful_votes": 0,
      "publication_date": 20160408
    },
    {
      "title": "Five Stars",
      "text": "Wonderful product for bunk or loft beds! Nice, sturdy and ledge is high enough for a drink.",
      "rating": 5.0,
      "verified": true,
      "author": "D Mitchell",
      "helpful_votes": 0,
      "publication_date": 20170829
    },
    {
      "title": "Perfect",
      "text": "Perfect for loft bed in college dorm. MacBook fits perfectly. Holds securely.",
      "rating": 5.0,
      "verified": true,
      "author": "TMR",
      "helpful_votes": 0,
      "publication_date": 20171022
    },
    {
      "title": "I don't have a nightstand so this was a good solution. Sturdy enough for anything I need close ...",
      "text": "I don't have a nightstand so this was a good solution. Sturdy enough for anything I need close at hand.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170429
    },
    {
      "title": "It's a Perfect fit for my Dreamstation CPAP",
      "text": "It's a Perfect fit for my Dreamstation CPAP. It's even strong and clamps on to my metal bed frame.",
      "rating": 5.0,
      "verified": true,
      "author": "E. Perez",
      "helpful_votes": 0,
      "publication_date": 20170522
    },
    {
      "title": "Five Stars",
      "text": "Works VERY well and perfect for upper bunkers to keep a phone, glass of water and book.",
      "rating": 5.0,
      "verified": true,
      "author": "LateNightAnarchy",
      "helpful_votes": 0,
      "publication_date": 20171207
    },
    {
      "title": "Great product",
      "text": "This product is genius. My daughter loves her tray as she uses it for drinks and a book. If you have a loft bed or bunk bed in your house this is a must. She has a wood bed and it tightens great and is very sturdy.",
      "rating": 5.0,
      "verified": true,
      "author": "Doug E.",
      "helpful_votes": 4,
      "publication_date": 20161125
    },
    {
      "title": "Fit my needs perfectly.",
      "text": "I have a loft bed, needed something to keep certain things next to me so that I didn't have to be jumping up and down from the bed. Sturdy material, easy installation, enough space.",
      "rating": 5.0,
      "verified": true,
      "author": "Quiksylva",
      "helpful_votes": 0,
      "publication_date": 20151003
    },
    {
      "title": "Handy & easy to install...",
      "text": "Bought 2 of these to go on the side of my teenage granddaughters' bunk beds. They opened them & went right to their beds to attach them - which only took a minute or two. They're happy with them.",
      "rating": 4.0,
      "verified": true,
      "author": "Phylicity",
      "helpful_votes": 0,
      "publication_date": 20160210
    },
    {
      "title": "Makes life easier at college with lofted bed",
      "text": "I am currently using this in my college dorm since the bed is lofted. I have been keeping my alarm clock, bottle of water and phone on it at night and has made my life a lot more convenient.",
      "rating": 5.0,
      "verified": true,
      "author": "Kent",
      "helpful_votes": 0,
      "publication_date": 20150831
    },
    {
      "title": "Awesome for use on a bunk bed",
      "text": "Awesome for use on a bunk bed. Keeps everything (alarm clock, water bottle, phone) at hand instead of everything sliding under the mattress or onto the floor. So glad we purchased.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen E. Larkin",
      "helpful_votes": 7,
      "publication_date": 20150226
    },
    {
      "title": "Very happy!",
      "text": "These are SO great! I bought 2, one for me and one for my daughter. They are SO sturdy and made great!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170107
    },
    {
      "title": "Perfect solution for my sons bunkbed",
      "text": "Perfect solution for my sons bunkbed. He likes to sleep in the top bunk but loses his fan remote and has no place for a glass of water... Problem solved!",
      "rating": 5.0,
      "verified": true,
      "author": "Michael J. Weir",
      "helpful_votes": 0,
      "publication_date": 20151231
    },
    {
      "title": "she loved everything about this shelf",
      "text": "According to my college freshman daughter, she loved everything about this shelf.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa A. Burmester",
      "helpful_votes": 0,
      "publication_date": 20160806
    },
    {
      "title": "Five Stars",
      "text": "Easy to install on the side of my son's loft dorm bed. Holds phone and drink nicely.",
      "rating": 5.0,
      "verified": true,
      "author": "AMB",
      "helpful_votes": 0,
      "publication_date": 20170911
    },
    {
      "title": "This should be on every college students shopping list, ...",
      "text": "This should be on every college students shopping list, especially for those living in small dorm rooms with limited furniture. I would recomend the bedside shelf for home use as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Finn27",
      "helpful_votes": 0,
      "publication_date": 20160131
    },
    {
      "title": "Decent buy",
      "text": "I bought this for my sins metal loft bed. Thankfully it has a squared off part of the frame because this would not work on a rounded metal part. It slid off.",
      "rating": 4.0,
      "verified": true,
      "author": "momof3",
      "helpful_votes": 0,
      "publication_date": 20160313
    },
    {
      "title": "Great product for top bunk",
      "text": "Great product for top bunk! Sturdy - holds an alarm clock, phone and glasses. Everything it claims to be and a great price.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160607
    },
    {
      "title": "Perfect for college dorm",
      "text": "Our son loves the Bunk Buddy for his raised bed in his dorm. Saves him from climbing down off his bed all the time! Super handy for a drink, cell phone, pens, etc.. The raised edges keep things from rolling off. Sturdy and easy to attach to side railings. Arrived promptly and well packaged. Very handy item. Wish I invented it!",
      "rating": 5.0,
      "verified": true,
      "author": "Cheryl S.",
      "helpful_votes": 0,
      "publication_date": 20151020
    },
    {
      "title": "Great little addition",
      "text": "Great little addition. I don't have room for a large shelf or stand next to my bed, so this has come in handy. Important to note that you can use for almost all types of beds, NOT JUST FOR BUNK BEDS.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve Flores",
      "helpful_votes": 0,
      "publication_date": 20151201
    },
    {
      "title": "Perfect",
      "text": "Graduation gift for nephew. He liked it and is taking it to college",
      "rating": 5.0,
      "verified": true,
      "author": "fairchild",
      "helpful_votes": 0,
      "publication_date": 20170523
    },
    {
      "title": "It's sturdy and works well",
      "text": "It's sturdy and works well. It fits on my frame and is easy to take on and off when needed. It stays in place well. There aren't any surprises; its a shelf.",
      "rating": 4.0,
      "verified": true,
      "author": "Alicia Latham",
      "helpful_votes": 0,
      "publication_date": 20170202
    },
    {
      "title": "perfect shelf.",
      "text": "clamps on easy, my son loves. May buy another. Wish it was a little bigger",
      "rating": 5.0,
      "verified": true,
      "author": "brandon b",
      "helpful_votes": 0,
      "publication_date": 20170901
    },
    {
      "title": "Five Stars",
      "text": "Made a huge difference for my daughter's bunk bed in her dorm room",
      "rating": 5.0,
      "verified": true,
      "author": "Jodi D Tanzman ",
      "helpful_votes": 0,
      "publication_date": 20170523
    },
    {
      "title": "Five Stars",
      "text": "Pretty heavy duty, and screw on brackets make it perfect for any size rails.",
      "rating": 5.0,
      "verified": true,
      "author": "Mom of Three",
      "helpful_votes": 0,
      "publication_date": 20171001
    },
    {
      "title": "Five Stars",
      "text": "Arrived on time, as pictured, and worked as directed. My daughter loves this for her college dorm!",
      "rating": 5.0,
      "verified": true,
      "author": "dhahrangirl",
      "helpful_votes": 0,
      "publication_date": 20161206
    },
    {
      "title": "It's easy to take on and off",
      "text": "Got this for my son's top bunk, he loves it. It's durable and fits snuggly. It's easy to take on and off!",
      "rating": 5.0,
      "verified": true,
      "author": "Susanna H",
      "helpful_votes": 0,
      "publication_date": 20160712
    },
    {
      "title": "Great! No complaints, just suggestions!",
      "text": "Make one that has two column shelves on top of each other and keep on adapting the idea in general. I really like the idea, so market it guys! Well done!",
      "rating": 5.0,
      "verified": true,
      "author": "Joe E.",
      "helpful_votes": 0,
      "publication_date": 20171130
    },
    {
      "title": "Five Stars",
      "text": "Works perfect on the side of the bed, as shown in web pic.",
      "rating": 5.0,
      "verified": true,
      "author": "BlackMagic420",
      "helpful_votes": 0,
      "publication_date": 20170227
    },
    {
      "title": "Five Stars",
      "text": "This is a great product for small rooms when a nightstand won't fit. Easy to install.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Carpenter",
      "helpful_votes": 0,
      "publication_date": 20170522
    },
    {
      "title": "sturdy and good size for essentials",
      "text": "Bought 2 for my girls' bunk bed....sturdy and good size for essentials...super easy installation.",
      "rating": 5.0,
      "verified": true,
      "author": "Zar",
      "helpful_votes": 0,
      "publication_date": 20160412
    },
    {
      "title": "Sturdy and secure",
      "text": "This is a sturdy little shelf. Worked great for my kids' loft beds. Big enough for a book or two and clamps on securely.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott Reston",
      "helpful_votes": 0,
      "publication_date": 20151008
    },
    {
      "title": "Great product. Is also very sturdy",
      "text": "Living in a dorm room has complications with space and accessibility and this tray makes it really convenient for storing things before I go to bed and what not. Great product. Is also very sturdy.",
      "rating": 5.0,
      "verified": true,
      "author": "Gillis Wang",
      "helpful_votes": 0,
      "publication_date": 20151129
    },
    {
      "title": "But made sturdy.",
      "text": "Could be a little bigger for the price. But made sturdy .",
      "rating": 4.0,
      "verified": true,
      "author": "ValiantThor27",
      "helpful_votes": 0,
      "publication_date": 20160914
    },
    {
      "title": "This shelf is AMAZING!! My 9 year old daughter didn't have ...",
      "text": "This shelf is AMAZING!! My 9 year old daughter didn't have anywhere to put her water bottle, tissues, nite light and alarm clock. Now she does. And it's very sturdy! I'm very happy with this item!",
      "rating": 5.0,
      "verified": true,
      "author": "Jami  A Boshnack",
      "helpful_votes": 0,
      "publication_date": 20150929
    },
    {
      "title": "Well constructed",
      "text": "Holds a lamp, two phones, and my Moto 360 charger. Perfect for platform bed with drawers",
      "rating": 5.0,
      "verified": true,
      "author": "Cindave",
      "helpful_votes": 0,
      "publication_date": 20160221
    },
    {
      "title": "Top bunk must have!",
      "text": "Easy to install and clean. It is sturdy and perfect for top bunk sleepers!",
      "rating": 5.0,
      "verified": true,
      "author": "2Feet",
      "helpful_votes": 0,
      "publication_date": 20161230
    },
    {
      "title": "Five Stars",
      "text": "My gr daughter thinks I'm best nana. Got this for her top bunk. She loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "Tweetybus",
      "helpful_votes": 0,
      "publication_date": 20160122
    },
    {
      "title": "Works great. Attaches to slats on bunk bed firmly and ...",
      "text": "Works great. Attaches to slats on bunk bed firmly and the perfect place to set down a drink or phone.",
      "rating": 5.0,
      "verified": true,
      "author": "Love to Read",
      "helpful_votes": 0,
      "publication_date": 20150901
    },
    {
      "title": "Works wonderfully on grandson's loft bed",
      "text": "Works wonderfully on grandson's loft bed. It's a perfect spot for his battery operated alarm clock and his water bottle.",
      "rating": 5.0,
      "verified": true,
      "author": "Debbie L.",
      "helpful_votes": 0,
      "publication_date": 20170817
    }
  ],
  "product_meta": {
    "title": "Bunk Buddy Bedside Shelf - Black",
    "description": "Solution Enterprises, LLC manufactures and distributes the Bunk Buddy tray. The Bunk Buddy is an easily attachable bedside tray designed for bunk beds and lofted beds with the college student in mind. The Bunk Buddy requires only the twist of a thumb to attach to any type bed frame up to 1.6\" thick. Bunk Buddy is great for the college student who needs space for the IPad, computer, cell phone, alarm clock, water, etc. without leaving their bunk or lofted bed. Younger Children who may need things close by such as a cup of water, bedtime books and/or that favorite stuffed animal. Adults use it as a convenient and easily accessible night stand for glasses, medications, flashlights and many other items.",
    "rating": 4.6,
    "feature_bullets": [
      "Easily attachable Bedside Tray - No tools required.",
      "Quick Set-up - Attaches in less than a minute.",
      "College Lofted and Bunk Bed Shelf - Designed with the college student in mind.",
      "Access to cell phone, laptop, drinks, alarm without getting out of bed.",
      "Rugged Design - Built to last. The original bedside shelf."
    ],
    "specifications": {
      "Item Weight": "1.43 pounds",
      "Product Dimensions": "13 x 9 x 2 inches",
      "Item model number": "SYNCHKG039975",
      "Is Discontinued By Manufacturer": "No",
      "ASIN": "B00M0KNZKK",
      "Customer Reviews": "4.6 out of 5 stars262 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#196,085 in Health & Household",
      "Date First Available": "July 22, 2014"
    },
    "categories": [
      "Home & Kitchen",
      "Health & Household",
      "Mobility & Daily Living Aids",
      "Medical Supplies & Equipment"
    ],
    "price": ""
  }
}