{
  "website_summaries": [
    {
      "verdict": "Extra features make Withings Home an attractive webcam or baby monitor, but its inability to store footage and a trigger-happy motion sensor maker it much less useful as a security camera.",
      "pros": [
        "Withings' Home has responsive push alerts and its air-quality sensor gives you ongoing access to carbon-based toxin readings"
      ],
      "cons": [
        "This DIY camera doesn't currently have an Android app, a Web interface or the ability to save recorded video clips",
        "The motion sensor is much too sensitive and its 1080p claims are questionable"
      ],
      "aspects": {
        "Features": 7.0,
        "Usability": 7.0,
        "Design": 8.0,
        "Performance": 6.0
      },
      "publication_date": 20150218,
      "rating": 7.0,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great idea but failed in every aspect",
      "text": "I just received my unit it looks great , had some issues with connection stability , and just found out that it require internet for vedio streaming like dropcam and doesn't support local wifi streaming , i was really excited about my purchase but now i left really disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Mostafa khalifa",
      "helpful_votes": 40,
      "publication_date": 20150210
    },
    {
      "title": "Easy to use and functional in home camera system",
      "text": "We have these all over our house and have had them for two years and love them. Yes, they sometimes disconnect, but only the live feed is affected and the camera continues to record. When they disconnect, it is always a WiFi issue and not a camera issue. We have traveled with them and reset them to work on the WiFi of where we are staying and come home to reset them and use them again. Bottom line is that they are easy to install, viewable from anywhere without an additional cost and have good video. Downside is that they don’t rotate or scan, but the view angle is large enough it really isn’t necessary.",
      "rating": 5.0,
      "verified": true,
      "author": "Krissy",
      "helpful_votes": 0,
      "publication_date": 20190302
    },
    {
      "title": "Great quality footage, quick to setup and easy to access.",
      "text": "This camera is so good. Super simple to setup and connect to my home wifi (I use an Apple Airport Extreme router). I was up and running in minutes. If you ever unplug it (like if you move it to another room), it remembers all it's settings and you're up and running in about 15 secs after it auto connects. The quality is excellent. There's a little fisheye kinda effect around the edges, but nothing really to worry about. Works great with the iPhone and Apple Watch app too. Couldn't be happier.",
      "rating": 5.0,
      "verified": true,
      "author": "GLEN E MCPHERSON",
      "helpful_votes": 7,
      "publication_date": 20160110
    },
    {
      "title": "OK Hardware, Poor Software, Horrible Customer Service = Bad Product",
      "text": "This product actually has a lot of potential. The hardware is great. The software is ambitious but buggy. And Withings customer support is atrocious. There is little to no resources available on their support site to allow you to debug. The only option you are left is is an email address with a 2 week plus response time.",
      "rating": 2.0,
      "verified": true,
      "author": "supernitin",
      "helpful_votes": 3,
      "publication_date": 20160211
    },
    {
      "title": "I liked them at first",
      "text": "I purchased four of these and have come to regret it. I liked them at first, but 5 months later only one is working despite all of the troubleshooting. Everything else really doesn't matter.",
      "rating": 1.0,
      "verified": true,
      "author": "Ryan",
      "helpful_votes": 8,
      "publication_date": 20160801
    },
    {
      "title": "Expensive Paper Weight",
      "text": "I continually have connection issues. It will connect and work fine but later it will disconnect and reconnecting is a problem. I have owned this device for about 2 years and I have always had connection issues. I finally gave up and put it away. I decided to try it out again the other day to see if by chance there was an update and it was fixed. No luck. The same issues. Looses connection. I only wish I could get my money back on this very expensive paper weight.",
      "rating": 1.0,
      "verified": true,
      "author": "that_was_me_ama",
      "helpful_votes": 3,
      "publication_date": 20170228
    },
    {
      "title": "Beware; buyers outside US and UK",
      "text": "While I like the product, this purchase does not come with warranty. Although Amazon shipped it to me in Singapore, they do not have any warranty coverage whatsoever. Withings will ship it to any address in the UK and the US at their cost, but getting it to Singapore is my problem, and so is shipping the defective item back to them. The camera works great for the most part, but one day it decided that it didn't feel like powering up, hence the service request.",
      "rating": 1.0,
      "verified": true,
      "author": "esisoon",
      "helpful_votes": 3,
      "publication_date": 20170128
    },
    {
      "title": "their response time for customer service is good. Email tracking for cases and there is always ...",
      "text": "First I have to say the positive: their response time for customer service is good. Email tracking for cases and there is always email follow up. But that's just about what they can ever do for you. I have brought 2 cameras and both are troublesome to setup. I setup one connecting via ethernet, and the other one via wifi. This device demands REALLY STRONG wifi signal, or it will suffers random disconnects very frequently. The ethernet connection, while stable, still reset itself just about every other day for no particular reasons. This device feels and runs like a beta test products. Stay away!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20160730
    },
    {
      "title": "particularly the combination of a web camera and some more traditional baby monitor features like the background audio",
      "text": "Unfortunately this was a bust. I was really excited about the design concept here, particularly the combination of a web camera and some more traditional baby monitor features like the background audio. In practice the app and camera were both glitchy at best. I found myself several times going into our kids room in the middle of the night, trying desperately not to wake them up, to unplug the camera in order to reset it. This of course creates the flashing \"boot up\" light.",
      "rating": 2.0,
      "verified": true,
      "author": "Buyer XYZ",
      "helpful_votes": 0,
      "publication_date": 20151214
    },
    {
      "title": "Video is not too great, and the claims to pan/tilt/zoom are blatantly false ...",
      "text": "I have now twice connected and setup the device, only to have it stop being \"connectable\" within minutes. Video is not too great, and the claims to pan/tilt/zoom are blatantly false under any reasonable use of those terms. It doesn't move, but just allows you to zoom into the image. I expected better. Looks nice and the app, if it worked with the actual camera, is decent. Apple Watch support is a nice feature. A lot of boxes to check...except the one about reliability.",
      "rating": 2.0,
      "verified": true,
      "author": "TimW",
      "helpful_votes": 4,
      "publication_date": 20150509
    },
    {
      "title": "This camera is terrible. Quality - subpar",
      "text": "This camera is terrible. Quality - subpar, the features - terrible and lacking, the lag and delay - can't be handled. I never use it and doubt I ever will unless they release an update to integrate with iHome or Alexa.",
      "rating": 1.0,
      "verified": true,
      "author": "Gabriel",
      "helpful_votes": 0,
      "publication_date": 20180325
    },
    {
      "title": "Very disappointed with Withings",
      "text": "Unfortunately this camera doesn't meet my expectations. Somehow it keeps resetting itself or disconnects from my network making unreliable. The software update didn't do anything to fix it either. I wish i had listen to my gut feeling and purchase the myfox security camera. Very disappointed with Withings. Their scale works better that the camera!",
      "rating": 2.0,
      "verified": true,
      "author": "Emman M",
      "helpful_votes": 3,
      "publication_date": 20160307
    },
    {
      "title": "Hardware is good but the app does not work",
      "text": "Hardware is good but the app does not work. It crashes and needs to be restarted every hour or so. This makes it totally unusable as a baby monitor because background audio simply stops playing when the app dies. I replaced it with $40 Foscam that works with 3rd party apps and has much better video quality to boot. For the price of this unit, I could have bought the top of line pan/tilt/zoom model and still had $50 left over. Would not recommend.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20161201
    },
    {
      "title": "Adding several more devices to my home",
      "text": "After reading some of the prior reviews, I had my fingers crossed that it would deliver what was described. The device had far exceeded my expectations. Terrific video from a very unobtrusive device. Small hiccups when initially installed using the app and my iPhone. Dropped the Bluetooth connection twice. I went through install again and have been using for 2 days with no connection problems.",
      "rating": 5.0,
      "verified": true,
      "author": "Steven",
      "helpful_votes": 4,
      "publication_date": 20150614
    },
    {
      "title": "Did not work as advertised",
      "text": "Withings set the higher goals by themselves and did not achieve goals. Product concept, design, function and features are very cool if it work as advertised. This camera is using P2P (Point to Point) technology but connection is not stable. Stable connection is most important things as network IP Camera but Withings Home is not. There are so many and cool functions and features but those will work on stable connection. Sometime connect, sometime not. Message is \"Busy\"... But I am only the user and using one single iPhone. Who makes you busy?",
      "rating": 2.0,
      "verified": true,
      "author": "Campbell",
      "helpful_votes": 15,
      "publication_date": 20150306
    },
    {
      "title": "It works, But the IOS app is not great!",
      "text": "It seems to work OKAY but, 1. The Volume of the speaker is very low. 2. There is no way to mute the App on an IOS device when using the app to view the camera. 3. The App is the only way to view the camera. There is no Browser access or direct viewing. 4. There is no Brightness adjustment when viewing the app.",
      "rating": 3.0,
      "verified": true,
      "author": "W.D",
      "helpful_votes": 3,
      "publication_date": 20150209
    },
    {
      "title": "Unreliable video stream",
      "text": "I wanted to like this, but the video stream almost never works and now it won't even power on anymore.",
      "rating": 1.0,
      "verified": true,
      "author": "Adam R",
      "helpful_votes": 3,
      "publication_date": 20161205
    },
    {
      "title": "great cameras",
      "text": "Great cameras! We have two of them for both children’s room! Love that I can access both cameras from one app anywhere!! Super easy to use!",
      "rating": 5.0,
      "verified": true,
      "author": "nikki woehr",
      "helpful_votes": 0,
      "publication_date": 20200910
    },
    {
      "title": "Music feature didn’t work",
      "text": "I bought this to replace the one we currently have because the music/lullaby feature stopped working. When we set this one up, that feature didn’t work as well and we couldn’t find any help online to fix it.",
      "rating": 1.0,
      "verified": true,
      "author": "Zebra kxnnsnsjnjjdjjnjmAmazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191206
    },
    {
      "title": "Thumbs down",
      "text": "Used the camera for 2 months after my daughter was born it was working fine and then the camera stopped working. Tried all the troubleshooting and tried calling the manufacturer. This was a waste of time and money.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190316
    },
    {
      "title": "Completely satisfied with camera, ( I  Believe that they are  correcting defect in all power supplies, change it from a 4 to 5",
      "text": "Completely satisfied with camera , give it 4 stars only because defective power supply , but it was monitored and identified by Withings and replaced in a timely manner. Completely satisfied with customer service ,",
      "rating": 5.0,
      "verified": true,
      "author": "James Ross",
      "helpful_votes": 0,
      "publication_date": 20151223
    },
    {
      "title": "Do NOT buy for baby monitor.",
      "text": "We bought this as a baby monitor. Terrible choice. It turns itself off in the middle of the night, every night. We have zero confidence that it's ever working correctly.",
      "rating": 1.0,
      "verified": true,
      "author": "Rachel A. Holmes",
      "helpful_votes": 0,
      "publication_date": 20170418
    },
    {
      "title": "do not buy, keep looking",
      "text": "buyer beware, this cam is a pos. freezes often, app crashes, wifi disconnects, and impossible to reset.",
      "rating": 1.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20190912
    },
    {
      "title": "Drop cam is better- Air sensor is useless inaccurate and makes this expensive device buggy",
      "text": "This is the worse Wifi camera on the market - It stopped working after a few days. Firmware update pushed by the manufacturer bricked the device. No help online - No help over the phone - Customer service none existent - These folks will ignore you.",
      "rating": 1.0,
      "verified": true,
      "author": "Ramspan",
      "helpful_votes": 22,
      "publication_date": 20150426
    },
    {
      "title": "Is not working",
      "text": "My camera does not work, where Can I do? I did the factory reset 5 times am still not working, the other camera is perfect but this one is not connecting",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20161129
    },
    {
      "title": "Love the ability to have 24hr playback",
      "text": "Love the ability to have 24hr playback. Camera is sensitive to light. When the trees move in the background the camera picks up the motion.",
      "rating": 4.0,
      "verified": true,
      "author": "Clint",
      "helpful_votes": 0,
      "publication_date": 20170621
    },
    {
      "title": "One Star",
      "text": "Camera stop working after they updated the software.Don't buy anything from eLGeo Electronics will not honor manufacturer warranty!",
      "rating": 1.0,
      "verified": true,
      "author": "Michael F.",
      "helpful_votes": 0,
      "publication_date": 20171110
    },
    {
      "title": "Don't buy it!",
      "text": "This product has the potential to be a good product, but this item doesn't come close. It set up and worked for a short time then quit, I tried all of the recommended trouble shooting solutions, only to have it repeat the behavior. I'm tired of spending money on a product and then finding myself as part of a beta testing group which then requires hours of work and frustration in order to get a product up-to-speed. No thanks.",
      "rating": 1.0,
      "verified": true,
      "author": "Paul Myers",
      "helpful_votes": 4,
      "publication_date": 20150612
    },
    {
      "title": "Great product and backed with great support.",
      "text": "Great products for home use. Very easy to install and like the quality of the sound/picture. I'm not at all the best when it comes to simple electronic installations so when I had a problem with one device the tech support was outstanding.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20151222
    },
    {
      "title": "Baby monitor to security camera .....",
      "text": "Awesome video quality and zoom. Have had a few video buffer delays but only with multiple devices connected. No loss in audio has occurred. Biggest issue for baby monitor is the audio is always on unlike dedicated monitors that have audio sensor that turns the mic on and off. That being said the audio quality is great and highly sensitive. Has the ability to grow and change functions.",
      "rating": 4.0,
      "verified": true,
      "author": "C Scooby",
      "helpful_votes": 0,
      "publication_date": 20161121
    },
    {
      "title": "Just not ready for prime time",
      "text": "Love the company but agree they release product prematurely. Massive headache with this camera. Constantly disconnects from WiFi, signal is woeful, video quality poor. Won't work in a home with more than one repeater - will disconnect and require a reset. Hours and hours with tech support. On the goodwill shelf.",
      "rating": 1.0,
      "verified": true,
      "author": "KSL",
      "helpful_votes": 0,
      "publication_date": 20160210
    },
    {
      "title": "Five Stars",
      "text": "Very nice camera and works well with the software downloaded from the app store",
      "rating": 5.0,
      "verified": true,
      "author": "Rick D.",
      "helpful_votes": 0,
      "publication_date": 20150626
    },
    {
      "title": "The wifi is working properly only this camera can't be connected to the wifi I would like a refund of the money or If u replace",
      "text": "Hey there, I don't know who to contact regarding the product failure! This camera that I bought from Amazon LLc is not working ! It worked well for 2 times and then after that it's stopped connecting to wifi! The wifi is working properly only this camera can't be connected to the wifi I would like a refund of the money or If u replace and send a properly functioning piece that would be highly appreciated! Thanks!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20151021
    },
    {
      "title": "So Much Limitations in This Product",
      "text": "I'm kindda disappointed that I have to actually pay money to see yesterdays video captures. Yes, they offer a trial but afterwards they want your money. On top of that, it doesn't really turn right or left as I expected. And finally, it doesn't allow more than one user to access it. So it is either me or my wife.",
      "rating": 2.0,
      "verified": true,
      "author": "Ibrahim B.",
      "helpful_votes": 0,
      "publication_date": 20150916
    },
    {
      "title": "Nothings better than this camera",
      "text": "Nothings better than this camera. It send you time lapse videos when it detects motion. I don't have a baby yet, but its great when you want to monitor staff, animals and whats going on in your room.",
      "rating": 5.0,
      "verified": true,
      "author": "Byram J",
      "helpful_votes": 0,
      "publication_date": 20170228
    },
    {
      "title": "Be Warned! Do not buy!!",
      "text": "Defective product with no sense of support from Withings customer service. Do not buy this ever and save yourself from frustration and wasting your time and money!!! Check their Facebook page and see how many customers' post are left unanswered and how many people are complaining of the same thing. There isn't any customer support number to call and good luck getting a response from customer service! When you do, its even more frustrating as there wouldn't be any resolution to your issue.",
      "rating": 1.0,
      "verified": true,
      "author": "Quoc Tran",
      "helpful_votes": 0,
      "publication_date": 20160127
    },
    {
      "title": "it could've been great",
      "text": "I love this camera but could never got it to work properly in a consistent way... have to reboot several times at least a few times a week. Wish it could've worked.",
      "rating": 2.0,
      "verified": true,
      "author": "GTprivatebeach",
      "helpful_votes": 0,
      "publication_date": 20151107
    },
    {
      "title": "Very pleased with this Wi-Fi Security Camera.",
      "text": "I purchased this Security Camera to watch my rescue Greyhound while I was away from home. So far it is working fine and provides the monitoring I needed. Occasionally it makes strange noises, but that is not an issue for me.",
      "rating": 4.0,
      "verified": true,
      "author": "Mary Ann Warn",
      "helpful_votes": 0,
      "publication_date": 20161213
    },
    {
      "title": "Great idea.",
      "text": "This does not hold a connection. Once you leave the house you have no connection most of the time and can't see anything. Great idea....big disappointment. Same w the baby monitor. Love to return both but it's past 30 days!",
      "rating": 1.0,
      "verified": true,
      "author": "wendy frank",
      "helpful_votes": 0,
      "publication_date": 20151015
    },
    {
      "title": "Very disappointed, seems to be a pattern with Withings",
      "text": "Terrible stability, useless support. Stay away from this one. Yes it looks good but if you want a product that actually works and does not disconnect all the time, look elsewhere.",
      "rating": 1.0,
      "verified": true,
      "author": "PIERRE ROUX",
      "helpful_votes": 0,
      "publication_date": 20160304
    },
    {
      "title": "Withings - top notch equipment and exemplary service",
      "text": "Excellent camera from a very reliable company. I have been using many different Withings gadgets - always with utmost satisfaction. Once when I had a hardware problem the service was impeccable! They replace the equipment immediately without any charges for delivery or anything. I recommend Withings equipment to all.",
      "rating": 5.0,
      "verified": true,
      "author": "Alexander",
      "helpful_votes": 0,
      "publication_date": 20150625
    },
    {
      "title": "Crap",
      "text": "Horrible recording quality! Dont waste your money on this. Way better options out there!",
      "rating": 2.0,
      "verified": true,
      "author": "lisa hartshorn",
      "helpful_votes": 2,
      "publication_date": 20160619
    },
    {
      "title": "I'm glad I purchased it!",
      "text": "I think they must have updated it (reading the 1-star reviews.) I have had no problems with the device or features. The device is amazing, it has every option one would need, LED lights, camera (day/night vision), speaker (to-way), magnet base to tilt the monitor, air quality, lullaby, snapshot, and motion/sound tracking with snapshot! The packaging was top notch, the unit is well made, the App is easy to use, and setup was done in 5-10 minutes. Disclaimer, at first there was some delays in loading, possibly due to the cloud service. However, I have had no issues other than \"unable to connect\" for like 1-5 minutes (closing and resting the app usually works.) Perfect device!",
      "rating": 5.0,
      "verified": true,
      "author": "DrB",
      "helpful_votes": 3,
      "publication_date": 20150526
    },
    {
      "title": "Two Stars",
      "text": "The power cord is very bad had to replace with new power line to power to the unit.",
      "rating": 2.0,
      "verified": true,
      "author": "Minh Nguyen",
      "helpful_votes": 0,
      "publication_date": 20160625
    },
    {
      "title": "RECEIVED AN OPEN BOX AND PAID FOR A NEW ONE.",
      "text": "I bought a new product and I received an open box taped together with scotch tape. I am having a lot of trouble installing it...no image is shown in any device I tried to pair it with.",
      "rating": 1.0,
      "verified": true,
      "author": "sandral83",
      "helpful_votes": 0,
      "publication_date": 20170219
    },
    {
      "title": "Withings... never again.",
      "text": "Considering it wouldn't connect to my Airport Extreme dual band network, I put it back in the box and returned... bought another FOSCAM instead. Had trouble with their baby monitor a few years ago and ended up with FOSCAM then too... looks like nothing has changed. Great feature list with poor implementation does not make for great products.",
      "rating": 1.0,
      "verified": true,
      "author": "Dbl D",
      "helpful_votes": 3,
      "publication_date": 20150805
    },
    {
      "title": "the camera worked well for 15 days, then this ...",
      "text": "the camera worked well for 15 days , then this defectively worked another 15 days until it stopped working , now does not boot when connected to the outlet. it is unfortunate that there is no option to review this product with 0 stars.",
      "rating": 1.0,
      "verified": true,
      "author": "C_H_R_I_STIAN",
      "helpful_votes": 9,
      "publication_date": 20150309
    },
    {
      "title": "Beware! Never worked for us and was unable to return!",
      "text": "Terrible product. Doesn't work. We set it up a few months after purchasing when our baby was ready to sleep in her own room. Realized it doesn't work and reached out to return. They wouldn't accept a return after 60 days. Piece of crap and horrible customer service. Looks cool, but went to market way too soon. Was never able to connect to the feed on any device.",
      "rating": 1.0,
      "verified": true,
      "author": "MKT ST",
      "helpful_votes": 0,
      "publication_date": 20151225
    },
    {
      "title": "Avoid this expensive paperweight at all cost.  Piece. Of. S***.",
      "text": "$200 paperweight. It worked a few days. Then every time I want to access it it tells me to check the power, Wifi or Ethernet connection. I unplug the camera and replying it to momentarily re establish live feed. Later it is the same old crap of NO CONNECTION. what a POS! Money wasted. Withings, how do I get my money back? I've already named this unit \"piece of s***\" when it comes up on my app and can not access the video feed.",
      "rating": 1.0,
      "verified": true,
      "author": "Markle Farkle",
      "helpful_votes": 2,
      "publication_date": 20150811
    },
    {
      "title": "Many better options out there",
      "text": "Not impressed. Very slow to load. To see video playback, you have to have their monthly paid service. Not worth it. Occasionally powers itself off. Many better options out there.",
      "rating": 2.0,
      "verified": true,
      "author": "A.S.",
      "helpful_votes": 0,
      "publication_date": 20171028
    },
    {
      "title": "It worked fine when my viewing device was on WiFi",
      "text": "I could never get this video feed to work when trying to watch over cellular, even though my device would show as having strong cellular connection. It worked fine when my viewing device was on WiFi. I wanted it for when I travel and am on cellular, so it definitely didn’t meet my needs.",
      "rating": 1.0,
      "verified": true,
      "author": "Chad M.",
      "helpful_votes": 0,
      "publication_date": 20171102
    },
    {
      "title": "Work perfectly - IF you have the new power supply cord.",
      "text": "I have three of these units and they all continued to drop off-line. Finally I contacted Withings and they provide me with new power supplies - the units now work perfectly",
      "rating": 5.0,
      "verified": true,
      "author": "Peter Carpenter",
      "helpful_votes": 2,
      "publication_date": 20161010
    },
    {
      "title": "Sent it back. Tried to work with support but ...",
      "text": "Sent it back. Tried to work with support but I couldn't get the mobile app to work consistently. Bought a Canary(about 2 months ago now) and it hasn't missed a beat.",
      "rating": 1.0,
      "verified": true,
      "author": "RollTide",
      "helpful_votes": 2,
      "publication_date": 20161213
    },
    {
      "title": "Excellent to keep an eye about what is happening in ...",
      "text": "Excellent to keep an eye about what is happening in your office/week end home or home when you are away. The only problem is when your internet shuts down for any reason because then the camera shuts down and if you are far away, you cannot reboot it.",
      "rating": 5.0,
      "verified": true,
      "author": "Marie C. Modica",
      "helpful_votes": 2,
      "publication_date": 20151027
    },
    {
      "title": "A waste of money.",
      "text": "Works sporadically. Frequenly just presents me with \"Loading...\" and then no video. Resetting multiple times seems to fix it. This is a completely unreliable product for monitoring your home or child.",
      "rating": 1.0,
      "verified": true,
      "author": "private",
      "helpful_votes": 3,
      "publication_date": 20161109
    },
    {
      "title": "no complaints. I've used many wifi cameras and this ...",
      "text": "no complaints. I've used many wifi cameras and this one out performs them all. it works well form my home and allows us to monitor the baby room from numerous devices at once: appletv, iPhones and apple watches. it works just as well to monitor remotely on an iPhone.",
      "rating": 5.0,
      "verified": true,
      "author": "jscoder",
      "helpful_votes": 4,
      "publication_date": 20151212
    },
    {
      "title": "Good hardware, but bad Android app",
      "text": "The device itself works great, but the Android app that you need to run it is a little finicky as of April 2017. I'm hoping that they will update the app before too long. Currently, it will have trouble connecting or crashing",
      "rating": 3.0,
      "verified": true,
      "author": "S. Kilbourn",
      "helpful_votes": 0,
      "publication_date": 20170420
    },
    {
      "title": "Beautiful camera but such a pain to use",
      "text": "Beautiful camera but such a pain to use. Problems connecting to wifi and for cell phone to connect to camera. Gave up and now using a low tech baby monitor.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180223
    },
    {
      "title": "sadly not ready for market",
      "text": "believe everything everyone else wrote NEGATIVE about the product sadly it is all true. sad very sad, popped up on apple watch one time then nothing.",
      "rating": 2.0,
      "verified": true,
      "author": "Rev Gary",
      "helpful_votes": 0,
      "publication_date": 20150607
    },
    {
      "title": "Excellent product!! Five stars",
      "text": "This is a very good product. It works very well. The set up was really fast in less than 2 minute. It has good video quality, though, it could be better. The only thing that I really don't like to much is that the speakers doesn't sound loud enough, so you have to speak loud in order to the people in the house can hear you when you are talking. Overall, it is a good product if you want to have a eye in your house",
      "rating": 5.0,
      "verified": true,
      "author": "Carlos Augusto Ascanio",
      "helpful_votes": 4,
      "publication_date": 20150513
    },
    {
      "title": "Customer service to be desired. App sub par and ...",
      "text": "Customer service to be desired. App sub par and crushes your battery. No privacy mode without moving a piece on the camera. Air sensor very inaccurate. Not ready at all for prime time",
      "rating": 2.0,
      "verified": true,
      "author": "DJP",
      "helpful_votes": 3,
      "publication_date": 20150712
    },
    {
      "title": "Five Stars",
      "text": "Works flawlessly with Apple Watch. Accurate air quality readings and quick live video feeds. No complaints.",
      "rating": 5.0,
      "verified": true,
      "author": "Jon Bessette",
      "helpful_votes": 0,
      "publication_date": 20150706
    },
    {
      "title": "Great cam",
      "text": "With Apple HomeKit integration on the way, this cam is the best option on the market. Does everything the nest does and more. Super Wide angle lens captures our entire living room",
      "rating": 5.0,
      "verified": true,
      "author": "L Greer",
      "helpful_votes": 0,
      "publication_date": 20151103
    },
    {
      "title": "Better for use with elderly than for baby",
      "text": "Easy installation, good audio quality but poor video quality. We hoped we could use as a baby monitor but the quality just isn't strong enough. We did however use the app to check in verbally and visually with elderly relative who didn't have a cell phone, and that made it worth the purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "Research Queen",
      "helpful_votes": 0,
      "publication_date": 20160731
    },
    {
      "title": "They work great. The video and audio are both clear and ...",
      "text": "Keep trying to understand all the negative reviews but unable to find one flaw. It works great. The video and audio are both clear and there's no long delays. Fantastic product, excellent price.",
      "rating": 5.0,
      "verified": true,
      "author": "Matt D'Arduini",
      "helpful_votes": 0,
      "publication_date": 20170111
    },
    {
      "title": "House Secured",
      "text": "Great product. Captures everything in one room and notifies you if there is any movement, sound or activity in your household.",
      "rating": 5.0,
      "verified": true,
      "author": "MM",
      "helpful_votes": 2,
      "publication_date": 20150209
    },
    {
      "title": "Great security camera",
      "text": "Easy to install, good night view, could have a better, constant, wifi reception.",
      "rating": 4.0,
      "verified": true,
      "author": "E Azcar",
      "helpful_votes": 0,
      "publication_date": 20150818
    },
    {
      "title": "It looks great in our living room",
      "text": "It looks great in our living room. The camera captures a large space (wide angle). It stream high quality video and the alerts are helpful for when we are out of the house and the baby is alone with the nanny. The two audio also work great and we use it to communicate with our children when we are away. We are very happy with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Ali Esfahani",
      "helpful_votes": 0,
      "publication_date": 20161006
    },
    {
      "title": "Best Baby Monitor!",
      "text": "Excellent product! This is the best gift I have ever purchased for my grandchild.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathleen Claycomb",
      "helpful_votes": 0,
      "publication_date": 20161222
    },
    {
      "title": "Updates can trash your camera!",
      "text": "Beware of the auto updates. I have 2 of these cameras and bought 2 for my mother. Just a few weeks ago Withings pushed out a update over the internet and one of my mothers cameras was rendered inoperable. Today I find another update was sent to my cameras and until I returned home to restart them they were down. Withings should have released this camera with working software and leave it alone. I will stay away from any more of their products.",
      "rating": 3.0,
      "verified": true,
      "author": "David Alan E.",
      "helpful_votes": 0,
      "publication_date": 20151125
    },
    {
      "title": "Omg, I thought their second gen product would learn ...",
      "text": "Omg, I thought their second gen product would learn something from their 1st gen product. This thing never worked. Always had to unplug and force reboot. What kind of monitor is never able to monitor because of it's own flaws which keep it from functioning. Epic fail. Returning.",
      "rating": 1.0,
      "verified": true,
      "author": "B",
      "helpful_votes": 2,
      "publication_date": 20150808
    }
  ],
  "product_meta": {
    "title": "Withings 3700546700477_Wood Home Wi-Fi Security Camera with Air Quality Sensors, Brown",
    "description": "Colour Name:BrownMANUFACTURER'S DESCRIPTION\n \n\n\nConnect live in HD to your home anywhere, day and night Live secure streaming featuring high quality night vision with infrared mechanical lens, high definition CMOS sensor (5 mega pixels), the latest latency reducing technology, 12x zoom with auto-enhancing and a 135° wide angle. Crystal clear two-way communication through an embedded microphone and speaker allows you to check in easily, at any time. \n\n24/7 Security Receive notifications when an event is detected by your Home. Noise, motion and air quality level alert sensitivities are adjustable in the Home app. \n\n\nTrack Memorable Events The Home app creates a daily Home Diary, displayed as a timeline of events. 5-second animated sequences are included in the timeline each time an event is detected. Watch up to 48 hours of events through animated sequences and time-lapses. Optional Cloud Video Recording automatically saves up to 30 days of continuous footage. \n\n\nMonitor air quality Indoor air pollution is often up to 10x higher than outdoor pollution. Volatile Organic Compounds (VOC) are one of the main sources. To assess air quality, Home tracks the presence of Volatile Organic Compounds (VOC). If VOCs reach unhealthy levels, Home sends you a notification and will blink red to warn you (if feature is turned on). \n\n\nBaby Monitor Mode Your smartphone controls a variety of Lulla Light and Sound programs (music paired with customized LED light sequences) that are designed to entertain and soothe your baby. \n\n\n\nWatch, listen and control your camera from your iOS (iPhone, iPad, Apple Watch, Apple TV) or Android device. \n\nAbout the Startup \nDescribe your product in 3 words.\n\nReliable, smart, beautiful \n\nHow did you come up with the idea for this product?\n\nWe wanted to create the perfect device to watch over the whole family, and go far beyond an old-fashioned security camera. \n\nWhat makes your product special?\n\nThe fact that it monitors the visible and the invisible, with a design that blends into your interior. \n\nWhat has been the best part of your startup experience?\n\nParticipating to the Connected Health revolution. It means empowering people to take control over their own health and wellness thanks to beautiful devices and apps. \n\n\n\nBOX CONTAINS\n1 x Withings Home 1 x Table Stand Micro-USB charging cable with 3 adaptors EU/US/UK Quick Start Guide (FR/EN/DE/ES/IT/PT)",
    "rating": 3.3,
    "feature_bullets": [
      "HD Video: Connect in HD to your home on your phone, from anywhere",
      "Smart Alerts: Get notifications when an event is detected (noise or movement)",
      "24/7 Security: 24h- Timelapse, 2-day diary of events & continuous recording options",
      "Air Quality: Monitor indoor air quality & be notified of pollution spikes",
      "Baby Monitor Mode: Hear and watch your baby, talk to them or entertain them with light & sound lullabies from your smartphone"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "7.62 x 7.62 x 8.26 cm; 589.67 Grams",
      "Date First Available": "6 Nov. 2014",
      "Manufacturer": "Withings",
      "ASIN": "B00MNM0T4A",
      "Item model number": "WBP02_18",
      "Customer reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Spy Cameras",
      "Electronics & Photo",
      "Camera & Photo",
      "Surveillance Cameras"
    ],
    "price": 65.17
  }
}