{
  "website_summaries": [
    {
      "verdict": "A high end charcoal grill from Weber that offers a wide variety of luxury features.",
      "pros": [
        "Designed with creature comforts in mind, this Weber grill offers a number of desirable features such as one-touch ignition, precision temperature control, and a built-in cleaning system",
        "Additionally, the grill offers an extra large work space and convenient storage for charcoal and grilling tools"
      ],
      "cons": [
        "The biggest drawback to purchasing this charcoal grill is the unit's higher price"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "A great Weber grill that costs considerably less than most of its cousins.",
      "pros": [
        "Weber quality at an affordable price",
        "Automatic charcoal lighting system is very convenient"
      ],
      "cons": [
        "Not as convenient as gas grill, and ignition system requires purchase of small propane capsules"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "Assemble in an hour and start cooking in all kinds of ways with this stylish grill.",
      "pros": [
        "Ignites charcoal briquettes with the push of a button",
        "You can use either gas or charcoal methods to grill",
        "363 square inches of cooking space",
        "Features LCD countdown cook timer",
        "We love the metal finish",
        "Loyal brand customers appreciate the warranty and dedicated customer service"
      ],
      "cons": [
        "We wish it also came with a lid on the fuel bin"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Awesome!",
      "text": "I absolutely love this grill. Great quality and looks awesome. It took me just over an hour or so to put together from start to finish. It was quite a simple build. There are so many positives about this grill I won't bother mentioning, because you probably already know the quality Weber brings. The only con if I had to pick one, is that there are two bolts/nuts that are inside the grill that pop out, so when inserting and removing the cooking grate they sometimes get in the way. Other than that minor issue, this grill is a must have for any griller out there.",
      "rating": 5.0,
      "verified": true,
      "author": "Loop",
      "helpful_votes": 248,
      "publication_date": 20150214
    },
    {
      "title": "Weber continues to keep charcoal people happy.",
      "text": "I have not had a chance to use this yet. It arrived too late for Thanksgiving, but based on many Weber kettles owned in the past, I anticipate no problems with this unit. It went together easily, and the new features like briquet storage and gas ignition promise to be highly useful. As always, the thermometer in the lid did not reflect the actual temperature as measured by an instant-read probe during the initial “burn-in” fire.",
      "rating": 5.0,
      "verified": true,
      "author": "E. Williamson",
      "helpful_votes": 2,
      "publication_date": 20181217
    },
    {
      "title": "Even better than previous Performer, but......",
      "text": "A couple of the newer features and optional accessories make this Performer even better than my old one, which we had over 12 years. But.......while the assembly option works extremely well (based on the positive reviews) for almost everybody they failed us in a big way in the Sacramento region. We had a 3 hour window for their arrival, but 10 minutes before the window expired we got an Amazon text saying they wouldn't arrive and to re-schedule. There are terms for that kind of service....and they're all profane. Fortunately if you take your time, even for someone like myself who will never be mistaken for a \"handyman\", assembly is pretty easy. Great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert L. Fenton",
      "helpful_votes": 0,
      "publication_date": 20190713
    },
    {
      "title": "Weber Keeps Getting Better!",
      "text": "We have been fans of the Weber charcoal grills for many, many years, and this new design is perfect. Plenty of grilling space inside, and lots of versatility when you have the right accessories. It comes with metal bins for cooking with indirect heat or smoking, and the redesigned gas-assisted ignition is a definite improvement. Only needs the small propane cylinder (like the type sold for Coleman stoves, and can be purchased at WalMart or Target), which is so much better than those clunky white tanks. You can't go wrong with a Weber!",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy Ligos",
      "helpful_votes": 2,
      "publication_date": 20181123
    },
    {
      "title": "GREAT ALL AROUND BBQ GRILL",
      "text": "I first saw this item at a friends BBQ party, which I helped to set-up and cook. My wife just had to have it when she saw it and the ease of lighting the charcoals with the propane cylinder enclosed. I've had Weber grills before including: Little Joe, 22\" stand alone Kettle and recently the Q1200 gas grill. I always missed the flavor and cooking ease with REAL Charcoal, and now we have that back. This unit was easy to assemble alone (1.5hr.), and had all the parts and no damage during shipment. Everything works perfectly, and is as dependable as every Weber product is. Amazon Fed Ex Shipping was excellent and on-time.",
      "rating": 5.0,
      "verified": true,
      "author": "David Camper",
      "helpful_votes": 2,
      "publication_date": 20170829
    },
    {
      "title": "I'm very happy. I don't use the charchol holders",
      "text": "I've wanted this for a few years prior to getting it. Researched different grills a lot and decided on this. After having it about 6 months and using it several times a week, I'm very happy. I don't use the charchol holders. I just put a chimney over the gas flame, let them light (about 2 mins), turn off the gas and let the chimney do it's thing. Then I dump out the charcoal on just one half and I have a perfect 2 zone cooking grill. It's a great grill.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170825
    },
    {
      "title": "Great charcoal grill",
      "text": "Awesome grill. The propane igniter saves time. The extra table space on the side was what we needed and the grill has exceeded expectations. Assembly isn’t too bad, just follow the instructions. The charcoal dust bin is a great feature. It doesn’t remove 100% of the dust, but it’s really convenient. Can’t imagine getting a different charcoal grill after going from a travel Weber to this one",
      "rating": 5.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 0,
      "publication_date": 20200616
    },
    {
      "title": "Excellent but Expensive Charcoal Grill",
      "text": "This Weber charcoal grill with propane ignition is easy to use and quick to light and be ready to cook. It cooks food great with the lid open or closed. The storage area for charcoal is handy. It could be a little easier to assemble but instructions were adequate. It is a bit expensive for what it is.",
      "rating": 4.0,
      "verified": true,
      "author": "Jerry L. Price",
      "helpful_votes": 0,
      "publication_date": 20201003
    },
    {
      "title": "Never had a Weber I didn't like. THis is no exception.",
      "text": "It took two of us two hours and a couple of youtube videos to fully assemble it. I used it today for the first time and didn't realize there is such a learning curve coming from a lifetime of gas grilling. I love, love, love the propane ignition. It's very easy to use and works very well. The surface area is deceptively large. In other words, it looks smaller online than what you really get. True to Weber standards, the build quality is top notch. It's going to take some getting used to but I look forward to getting better at charcoal grilling.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170115
    },
    {
      "title": "Nice electronic starter/igniter",
      "text": "Love the electronic starter for lighting propane to light the coals before pushing the button on mechanical starter several times hoping it will ignite also new steel top or tray table 10 X easier to clean",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "Absolutely love this grill",
      "text": "This is the perfect grill for my home. Not too big and can accommodate more meats and things on the grill if friends want to toss something on. The middle comes out if you need to add more coals and everything fits in a nice package. the thermometer in the lid could be better though.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris M.",
      "helpful_votes": 2,
      "publication_date": 20181106
    },
    {
      "title": "Great Grill!",
      "text": "Weber never lets us down! Another great grill at a great price. The quality of this item is top notch. I recommend this grill to anyone who loves Charcoal grilling for that great backyard taste! My husband loves the automatic briquette starter. No starting fluid needed. Just a small bottle of propane. So easy! You will love this grill!!",
      "rating": 5.0,
      "verified": true,
      "author": "Leigh Taylor",
      "helpful_votes": 0,
      "publication_date": 20190612
    },
    {
      "title": "Great so far.",
      "text": "This is a great grill. The propane lighter gets the coals lit much faster than the charcoal towers. The working table is a god send. My only complaint would be where you hang the grate. The middle of the grate comes off if you want to put a wok/pan for cooking. When you try and hang the grate On the back hook the middle always falls off because it doesn't account for the loose middle piece. Overall it is a grate grill.",
      "rating": 5.0,
      "verified": true,
      "author": "Brandie R.",
      "helpful_votes": 0,
      "publication_date": 20170509
    },
    {
      "title": "awesome!",
      "text": "we have it for almost 2 months already and it's just works fine! We grill and smoke in it, and everything tastes delicious. we did have a little issue with the grates but amazon kindly fixed it for us.",
      "rating": 5.0,
      "verified": true,
      "author": "Martin & Adrienn",
      "helpful_votes": 0,
      "publication_date": 20200629
    },
    {
      "title": "Always solid Weber product",
      "text": "I love this grill! I'm still figuring out the right amount of charcoal but it works great, plenty of room, storage for the charcoal, and some tools. I love the gas burner to help get the charcoal going, it's very convenient.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin Reed",
      "helpful_votes": 0,
      "publication_date": 20191107
    },
    {
      "title": "A Great Grill",
      "text": "This is a replacement for an older Performer charcoal grill I had, after using the previous grill for close to 20 years, I figured it was time for another one. My new grill cooks great (as did the previous one) has lots of cooking options, and holds temps with very little fuss.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin S.",
      "helpful_votes": 3,
      "publication_date": 20180814
    },
    {
      "title": "Does everything you need.",
      "text": "Mine was shipped with a bent bottom shelf, and wouldn't fit. Called Weber, and after 2 weeks sent me another. Awesome grill!!",
      "rating": 4.0,
      "verified": true,
      "author": " Customer",
      "helpful_votes": 0,
      "publication_date": 20200713
    },
    {
      "title": "... I can say is this grill is just as nice as the Weber Preformer I purchased over 20 years ...",
      "text": "Well all I can say is this grill is just as nice as the Weber Preformer I purchased over 20 years ago. Don't throw your money away on high priced cookers on the market. If you are a serious about outdoor grilling, this Weber is where it started years ago, and is where your search should stop now. Weber has made very few, and small changes to this grill over the years, but the performance and quality has not changed. Simply put this is the best grill for any amount of money on the market.",
      "rating": 5.0,
      "verified": true,
      "author": "Ray Roberts",
      "helpful_votes": 0,
      "publication_date": 20150704
    },
    {
      "title": "The best one yet..",
      "text": "This is my third one of the EXACT SAME model over a 10 year span. They finally got it right, metal table surface, paint that doesn't blister on the inside of the hood, a better handle and much better draft and control of that draft. Good job!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200524
    },
    {
      "title": "Great grill",
      "text": "Great grill for those who still want the taste of charcoal grilling. My husband never did master the gas grill. He has had a bit of trouble getting the propane igniter switch to work properly but he seems to easily light the grill with a lighter. Everything we have cooked so far has come out perfectly. He had a friend help with assembly. That seemed to go well.",
      "rating": 5.0,
      "verified": true,
      "author": "Grateful Grandmom",
      "helpful_votes": 0,
      "publication_date": 20190623
    },
    {
      "title": "Weber Charcoal Grill",
      "text": "Excellent product! I replaced a Weber Grill that is 33 years old and still in good shape. The gas charcoal starter is an excellent improvement. I'm 69 yoa, so if it last me another 33 years, it's the last one I will ever have to buy. lol Actually, I bought it for my wife's birthday and she is very happy with it also. If you are looking for a new grill ,,,, buy it, I highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard Sitz",
      "helpful_votes": 0,
      "publication_date": 20160928
    },
    {
      "title": "Good quality grill",
      "text": "Good quality grill, lights up easily. I took another reviewer's recommendation and purchased an adaptor so I can use it with a regular propane tank. Took me more than two hours to put it together, but could be done inside of two hours by a more experienced person.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170702
    },
    {
      "title": "FAST DELIVERY - GREAT GRILL",
      "text": "I bought this grill for my boyfriend's birthday and he LOVES it. He's a big grilling guy and has an assortment of grills and smokers and really loves his new charcoal grill. Would highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20190601
    },
    {
      "title": "Easy to light and use.",
      "text": "Best charcoal grill on the market... I recommend this grill to anyone that wants to break from a gas grill.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas Kaefring",
      "helpful_votes": 0,
      "publication_date": 20201016
    },
    {
      "title": "Delicious flavor, quick and easy to be ready to cook",
      "text": "We had an older model. Perhaps 15-20 years old. It was done! There are soo many improvements on this newest model!! So easy to use! Quicker wait time for coals to be ready! Extremely sturdier! Cleans easier...",
      "rating": 5.0,
      "verified": true,
      "author": "J. Collins",
      "helpful_votes": 0,
      "publication_date": 20190805
    },
    {
      "title": "Deluxe Quality Weber",
      "text": "Deluxe is the proper term for this grill Weber has made changes over the years and all for the good . I have had several Weber grills over the years and they where always just the lower end of their models and they lasted for years . This time we went for the Deluxe we deserve it I can see many years of good fun cooking and grilling . All parts are made to last true Weber Quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael L. Mansfield",
      "helpful_votes": 0,
      "publication_date": 20160605
    },
    {
      "title": "Worth Every Penny!",
      "text": "I bought this grill because a lot of family members already have it. Absolutely love it. I love how easy it is to start and control the temperature. I've been using it about 2 times a week and have had no issues. The assembly took a little time to make sure I got the right parts in the right places because the instructions are only pictures but there are YouTube videos out there to help if needed. If you're going to buy a charcoal grill buy this one!",
      "rating": 5.0,
      "verified": true,
      "author": "Lee-23",
      "helpful_votes": 0,
      "publication_date": 20170509
    },
    {
      "title": "enjoy",
      "text": "I checked all over for a Weber grills, this one you can attach a small propane tank. Not quite a gas grill but pretty nice with out the additional cost.",
      "rating": 5.0,
      "verified": true,
      "author": "k4pana",
      "helpful_votes": 0,
      "publication_date": 20190815
    },
    {
      "title": "My son loves it!",
      "text": "Bought this as an early Christmas present for my son - who is an avid BBQ-er. He had a traditional Weber kettle but it was on its last legs--and he is having a ball with this unit - much easier to use, clean and cook with. He's very pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "BradB",
      "helpful_votes": 0,
      "publication_date": 20170507
    },
    {
      "title": "Am very happy with this grill",
      "text": "Am very happy with this grill. I purchased it because America's Test Kitchen recommended this grill after testing several of the top grill. Put it together myself. Is very good looking. I am so pleased with it.",
      "rating": 5.0,
      "verified": true,
      "author": "KATHRYN I PHILLIPS",
      "helpful_votes": 0,
      "publication_date": 20180903
    },
    {
      "title": "Works as good  as my old model!",
      "text": "I had an older Weber performer deluxe Charcoal grill. This one works as well as my old one. My only complaint is it looks like some cheaper design decisions are being made as the older one seemed sturdier, and the ash catcher was much easier to remove and install again on the older model.",
      "rating": 4.0,
      "verified": true,
      "author": "nyannac",
      "helpful_votes": 2,
      "publication_date": 20160930
    },
    {
      "title": "Another great product from Weber",
      "text": "I'm not going to get technical on this Grill I'm just going to let you know I've always used Weber I absolutely adore this one and the accessories they make for this are amazing I have a rotisserie ring that adds the space for the meat to rotate, I'm hoping to try out soon",
      "rating": 5.0,
      "verified": true,
      "author": "Stacy LVC",
      "helpful_votes": 0,
      "publication_date": 20170802
    },
    {
      "title": "Absolutely love it. If you love the weber kettle this ...",
      "text": "Have cooked on this a few times now. Absolutely love it. If you love the weber kettle this is the model to get (2015). I love the gas ignition to light the charcoal, works great. The insert system for the grate is awesome. I just put in a StoK,cast iron grate and I'm also trying their insert system. Weber has a better wok, StoK has a great Dutch Oven/cast iron kettle. Fun times ahead.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Patterson",
      "helpful_votes": 0,
      "publication_date": 20150620
    },
    {
      "title": "What's a stove?",
      "text": "What's a stove? Seriously though, I can't remember last time I cooked inside!! My husband and love this grill. We love the charcoal flavor! This grill works great-comes with a starter and 3 cooking utensils. There's also a handy digital timer on it too. Perfect for summer grill outs!",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 0,
      "publication_date": 20160509
    },
    {
      "title": "Needs a small propane tank",
      "text": "LOVE this grill. This is the best and easiest to use grill we have ever owned. The product info pages aren't clear about this, but you do need a small propane canister to use the push button start. The grill was easy to assemble and the directions were very clear.",
      "rating": 5.0,
      "verified": true,
      "author": "Amy N",
      "helpful_votes": 0,
      "publication_date": 20160706
    },
    {
      "title": "overall the best",
      "text": "There is nothing to dislike about this product. It's the second one we have had and it's worth every penny",
      "rating": 5.0,
      "verified": true,
      "author": "Dorothy W.",
      "helpful_votes": 0,
      "publication_date": 20190709
    },
    {
      "title": "Awesome",
      "text": "I love this grill, best grill ever had , bought the rotisserie attachment, best thing ever.",
      "rating": 5.0,
      "verified": true,
      "author": "Vicki R. Zak",
      "helpful_votes": 0,
      "publication_date": 20190930
    },
    {
      "title": "Nice grill",
      "text": "Assembly wasn’t hard, but wasn’t quick & easy. It would have been nice if assembly instructions came in the box. We’ve used the grill a few times so far and it works great.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie Sadler",
      "helpful_votes": 0,
      "publication_date": 20191219
    },
    {
      "title": "fantastic bbq",
      "text": "I bought this for my son for his birthday as he is an avid barbequer.....he absolutely loves it....",
      "rating": 5.0,
      "verified": true,
      "author": "Maureen Flores",
      "helpful_votes": 0,
      "publication_date": 20190625
    },
    {
      "title": "Awesome grill.  Terrible cover.",
      "text": "The grill itself is worth a 5 Star review however, the grill “cover” that’s included may be the worst grill cover I have ever seen. It blows off the grill with the slightest breeze. This problem, however, still warrants a 5 star review because I enjoy the performance of the actual grill. I really expected more from Weber when it comes to anything “grill” related...that includes the cover to protect your expensive Weber grill.",
      "rating": 5.0,
      "verified": true,
      "author": "Bobo",
      "helpful_votes": 0,
      "publication_date": 20180307
    },
    {
      "title": "Arrived in Perfect Cindition",
      "text": "Weber Performer Deluxe given as a gift. Perfect shipping and setup a breeze. Honey+ shopping aid saved me additional sales tax cost. So $399 total.",
      "rating": 5.0,
      "verified": true,
      "author": "M. S. Arledge",
      "helpful_votes": 0,
      "publication_date": 20180919
    },
    {
      "title": "Missing parts",
      "text": "The grill came, upon assembly I noticed that the grill grate and life holder were missing from the box.",
      "rating": 4.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 0,
      "publication_date": 20200529
    },
    {
      "title": "Great setup if you can swing the price",
      "text": "Great setup if you can swing the price! I love the convenience of having the table, charcoal storage, and gear storage that I can roll around the patio. Love the lid storage and the flexibility offered by the grilling surface and available accessories. Weber taking the kettle to the next level!",
      "rating": 5.0,
      "verified": true,
      "author": "BlueArcher",
      "helpful_votes": 0,
      "publication_date": 20160219
    },
    {
      "title": "Easy to assemble with the app",
      "text": "I use the product for grilling. It is so easy to start a fire.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "It's a Weber!",
      "text": "It's a Weber! I wasn't too sure about the propane feature but, it is kind of nice to have. If, and when, it goes bad, I probably won't fix it. But the rest of the grill is great. The charcoal storage bin is nice to have also. I can leave the charcoal outside with my grill (under a cover). I also really like the lid support system. It guides the lid onto the brackets almost effortlessly.",
      "rating": 5.0,
      "verified": true,
      "author": "ShawnNC",
      "helpful_votes": 0,
      "publication_date": 20150615
    },
    {
      "title": "This grill is awesome! After using gas grills and electric smokers last ...",
      "text": "This grill is awesome! After using gas grills and electric smokers last 7 years I have finally found my all in one solution and couldn't be happier. The gas ignition makes all the difference and takes away the \"hassle\" of charcoal. Would definitely recommend to anyone who enjoys great, full flavored bbq",
      "rating": 5.0,
      "verified": true,
      "author": "T M",
      "helpful_votes": 0,
      "publication_date": 20150917
    },
    {
      "title": "Best Grill I've Owned",
      "text": "High quality grill, the workmanship is always apparent with Weber products. I'm not exaggerating when I say we use this grill 5-7 times a week, being in Florida, and it's an outstanding grill for both regular grill cooking as well as for smoking ribs and even a good sized Boston Butt. Highly recommended...",
      "rating": 5.0,
      "verified": true,
      "author": "Gary C. McLean",
      "helpful_votes": 0,
      "publication_date": 20150522
    },
    {
      "title": "No chemical taste with Propane charcoal starter.",
      "text": "Previously had a 18\" Weber. It was still in great condition after 12+ years. Gave it to a friend and bought the Weber 22\" Performer. Like larger grill area. Also, because of Propane starter rather than using lighter fluid, notice better flavor of chicken and meat without chemical taste.",
      "rating": 5.0,
      "verified": true,
      "author": "Lawrence Levine",
      "helpful_votes": 0,
      "publication_date": 20170524
    },
    {
      "title": "love the metal table on the new models",
      "text": "Got it \"used\" one of the end caps had the threaded pieces broken off. $1.79 in hardware from Lowe's and I have a brand new grill for half the price. Also, love the metal table on the new models, a big improvement to the one I bought my father 3 years ago.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel Standridge",
      "helpful_votes": 0,
      "publication_date": 20150423
    },
    {
      "title": "Kinda dirty, but that's charcoal",
      "text": "Much easier to use and to clean and to maintain than my previous propane grill. Kinda dirty, but that's charcoal.",
      "rating": 4.0,
      "verified": true,
      "author": "synapsys",
      "helpful_votes": 0,
      "publication_date": 20180723
    },
    {
      "title": "Nice Grill",
      "text": "Nice grill, I had a broken piece , the ash catcher... called weber... they sent out a new one....",
      "rating": 5.0,
      "verified": true,
      "author": "Richard J. Nagle",
      "helpful_votes": 0,
      "publication_date": 20190623
    },
    {
      "title": "I could not be happier with the results when grilling with this Weber",
      "text": "Exactly as advertised. I could not be happier with the results when grilling with this Weber. I have used it about six time since receiving the grill a month ago and the results are worth the time it took to assemble. Instructions could be a little more detailed, but other than that no complaints. I was sceptical about the gas cole igniter, but it works better than a chimney.",
      "rating": 5.0,
      "verified": true,
      "author": "Dave",
      "helpful_votes": 0,
      "publication_date": 20161001
    },
    {
      "title": "Greatest grill Ive ever owned",
      "text": "Greatest grill Ive ever owned. Very sturdy and great instructions make it a breeze to assemble. Cant beat a Weber charcoal kettle and with the nice metal table and propane ignition this grill will have you cooking out more than ever.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160707
    },
    {
      "title": "This grill has so many great features adding to the ease of grilling",
      "text": "This grill has so many great features adding to the ease of grilling. Definitely a delux model. I have always used a gas grill and decided to scale down the size and change the source of heat. There are times I would like to have a larger cooking surface. All in all, I love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Diana",
      "helpful_votes": 0,
      "publication_date": 20150806
    },
    {
      "title": "severe disappointed with Weber",
      "text": "Hello, severe disappointed with Weber! Had the very simple Weber Charcoal grill that lasted for 10 yeas, our gas one also Weber - no complains since 2011. This one we decided to buy the fancy charcoal version trusting Weber. Used it once and the handle got burnt and so was the charcoal basket. Is it made in China?!!!! Plan to return it.",
      "rating": 2.0,
      "verified": true,
      "author": "Stella Kazansky",
      "helpful_votes": 0,
      "publication_date": 20180525
    },
    {
      "title": "This is the best grill out there",
      "text": "This is the best grill out there, i have used many others and you will not be disappointed. I have had 3 other people i know that purchased this after they had food that came off the grill",
      "rating": 5.0,
      "verified": true,
      "author": "Todd Liguzinski",
      "helpful_votes": 0,
      "publication_date": 20160510
    },
    {
      "title": "Grilling perfection",
      "text": "This grill is simply the best. Simple to assemble and operate. The food is extraordinary.",
      "rating": 5.0,
      "verified": true,
      "author": "Gary L. Smith",
      "helpful_votes": 0,
      "publication_date": 20180801
    },
    {
      "title": "WEBER Charchoal Grill.",
      "text": "Bought this Weber Grill for my daughter's new home. It is of very high quality and exactly what they wanted. Great price. Delivered on time and packaged well. Perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Kat",
      "helpful_votes": 0,
      "publication_date": 20170325
    },
    {
      "title": "Awesome",
      "text": "They thought of everything. Super easy to assemble. My husband is absolutely thrilled with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Kendra Carter",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "Great bbq!",
      "text": "Perfect if you like coal but want to start it with gas!",
      "rating": 5.0,
      "verified": true,
      "author": "Fran",
      "helpful_votes": 0,
      "publication_date": 20190908
    },
    {
      "title": "A cooks delight! This grill offers for amazing flavor",
      "text": "A cooks delight! This grill offers for amazing flavor! No complaints!",
      "rating": 5.0,
      "verified": true,
      "author": "Alisha",
      "helpful_votes": 0,
      "publication_date": 20180411
    },
    {
      "title": "I love this grill",
      "text": "As a person who always used gas, I love this grill. I get the ease of use of gas to start the burn and then the awesome taste of charcoal to finish the flavor. I love Weber and this grill is fantastic!",
      "rating": 5.0,
      "verified": true,
      "author": "Kristin Tucker",
      "helpful_votes": 0,
      "publication_date": 20151005
    },
    {
      "title": "Great grill and very easy to use.",
      "text": "If you've ever used a kettle grill, the Weber Performer will be no different. Although it is clearly made of better materials and retains heat and smoke a lot better. I've grilled everything from hotdogs to Tbone steak and smoked ribs and brisket. It is very predictable and easy to control the heat.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael M.",
      "helpful_votes": 0,
      "publication_date": 20180704
    },
    {
      "title": "Great grill!!!!",
      "text": "My husband has been wanting one of these grills for over a year now. I bought it for him after he talked about getting one.....again. He loves it and uses it as often as he can. We are very pleased!!",
      "rating": 5.0,
      "verified": true,
      "author": "Cindy",
      "helpful_votes": 0,
      "publication_date": 20150831
    },
    {
      "title": "Love using it",
      "text": "Exactly what I expected. Love using it. So easy to start by using gas than convert to Charcoal.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda",
      "helpful_votes": 0,
      "publication_date": 20171223
    },
    {
      "title": "Great quality, tough assembly",
      "text": "Impressive quality but a little tough to assemble. It took me a couple of hours.",
      "rating": 4.0,
      "verified": true,
      "author": "Arthur",
      "helpful_votes": 0,
      "publication_date": 20171117
    },
    {
      "title": "Great grill",
      "text": "Quality grill. I used around 10 times for the first summer, works perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Hunter L.",
      "helpful_votes": 0,
      "publication_date": 20180112
    },
    {
      "title": "LOVE, LOVE This thing",
      "text": "LOVE, LOVE This thing! Super great BBQ! Well worth the money. And if it is anything like my old one it will last me another 25 years.",
      "rating": 5.0,
      "verified": true,
      "author": "Tim Neil",
      "helpful_votes": 0,
      "publication_date": 20170604
    },
    {
      "title": "Just got my new and it works great. The gas lighting system worked perfect and the ...",
      "text": "Just got my new grill and it works great. The gas lighting system worked perfect and the rest of the product was usual Weber quality. Only one small negative is the digital timer, not very useful and kinda cheap looking. Otherwise you can't do better.",
      "rating": 5.0,
      "verified": true,
      "author": "Max Fever",
      "helpful_votes": 0,
      "publication_date": 20150319
    },
    {
      "title": "Kool Tool if you like charcoal. Assenbly went fast and all hardware and ...",
      "text": "Kool Tool if you like charcoal. Assenbly went fast and all hardware and components seemed first rate. Very pleased with the grill. Well designed and made. Really like the ash removal and the charcoal storage.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve Ligon",
      "helpful_votes": 0,
      "publication_date": 20150830
    },
    {
      "title": "it's great",
      "text": "This is a great grill... assembly was really easy... however, be careful what surface you use to assembly it on, you can damage the nice surface finishes if you're nont careful",
      "rating": 5.0,
      "verified": true,
      "author": "FoxHillSpeedShop",
      "helpful_votes": 0,
      "publication_date": 20150708
    },
    {
      "title": "so far it is great. My only complaint",
      "text": "so far it is great. My only complaint... and it's not too serious... is it can be difficult to get the lid to fit on the grill snugly (almost as if it were slightly warped).",
      "rating": 5.0,
      "verified": true,
      "author": "JonPro",
      "helpful_votes": 0,
      "publication_date": 20150719
    },
    {
      "title": "Easy to assemble and so far the best grill I ...",
      "text": "Easy to assemble and so far the best grill I have owned so far. The one touch light works awesome. 2 minutes and the coals are going on their own. Weber has really out done themselves. I bought a quality grill cover so I am hoping this grill will last much longer than our others. Well worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel R Staggs",
      "helpful_votes": 0,
      "publication_date": 20180613
    },
    {
      "title": "Love the grill",
      "text": "Great grill.... Would have given it a 5 if they would redesign the lid holding screws so you can easily remove the grate. Propane lighter works great !!!",
      "rating": 4.0,
      "verified": true,
      "author": "Cody",
      "helpful_votes": 0,
      "publication_date": 20150911
    },
    {
      "title": "Super",
      "text": "Awesome grill with the propane lighter. Only use my gas grill in an emergency.",
      "rating": 5.0,
      "verified": true,
      "author": "minnie",
      "helpful_votes": 0,
      "publication_date": 20170520
    },
    {
      "title": "I'm so glad I upgraded and got the little attached workstation one ...",
      "text": "Husband is obsessed. I'm so glad I upgraded and got the little attached workstation one vs. the standalone model.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer M.",
      "helpful_votes": 0,
      "publication_date": 20161218
    },
    {
      "title": "The perfect charcoal grill!",
      "text": "I love love love my Weber! This grill has become a member of the family. I might try to marry it. The charcoal basket is very handy to have and I absolutely love the one touch propane starter. I am a charcoal griller for life and this is my dream grill!",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda Veronica",
      "helpful_votes": 0,
      "publication_date": 20180525
    },
    {
      "title": "Good purchase",
      "text": "Perfect for us. Used the third party installation which was smooth and professional. Grill works well with no problems.",
      "rating": 5.0,
      "verified": true,
      "author": "AK",
      "helpful_votes": 0,
      "publication_date": 20190729
    },
    {
      "title": "Super easy and versatile!",
      "text": "This grill can be used for nearly anything you can imagine!",
      "rating": 5.0,
      "verified": true,
      "author": "Spencer Scarbrough",
      "helpful_votes": 0,
      "publication_date": 20200725
    },
    {
      "title": "Love the ignition",
      "text": "Automatic ignition is really nice. Time from ignition to ready is about the same. Uniformity of coals not perfect...some coals still have a little \"black\" and other coals still on the verge of past perfect.",
      "rating": 4.0,
      "verified": true,
      "author": "J. Todd",
      "helpful_votes": 0,
      "publication_date": 20150805
    },
    {
      "title": "Weber rocks!",
      "text": "Fantastic grill! Used often. This and a cover was a wedding anniversary gift.",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy Hufford",
      "helpful_votes": 0,
      "publication_date": 20160914
    },
    {
      "title": "Awesome grill, Takes about 30-45 minutes to unpack and ...",
      "text": "Awesome grill, Takes about 30-45 minutes to unpack and assemble. Great Weber quality, The propane charcoal igniter works great under my charcoal chimney.",
      "rating": 5.0,
      "verified": true,
      "author": "MiVanMan",
      "helpful_votes": 0,
      "publication_date": 20160602
    },
    {
      "title": "Best grill I ever owned",
      "text": "The engineer who designed this grill had to be a griller themself. Very well laid out. Best grill I ever owned.",
      "rating": 5.0,
      "verified": true,
      "author": "darryl douglas",
      "helpful_votes": 2,
      "publication_date": 20150525
    },
    {
      "title": "Five Stars",
      "text": "This grill is so awesome!!! Gives your great temperature control and is very easy to start.",
      "rating": 5.0,
      "verified": true,
      "author": "Adam",
      "helpful_votes": 0,
      "publication_date": 20160624
    },
    {
      "title": "Fantastic grill",
      "text": "It is extremely well built and a beautiful grill. Haven't used it yet, just assembled today. I am amazed at the quality",
      "rating": 5.0,
      "verified": true,
      "author": "Andi Swigart",
      "helpful_votes": 0,
      "publication_date": 20160925
    },
    {
      "title": "Weber grills are the best, and this one is designed with all the right features",
      "text": "Weber grills are the best, and this one is designed with all the right features. I really like the fast starting and easy cleanup of the ashes.",
      "rating": 5.0,
      "verified": true,
      "author": "Gregory V. DeBrun",
      "helpful_votes": 0,
      "publication_date": 20170613
    },
    {
      "title": "Love it Love it Love it.",
      "text": "I won't grill with anything but. Love it Love it Love it.",
      "rating": 5.0,
      "verified": true,
      "author": "JSK",
      "helpful_votes": 0,
      "publication_date": 20160921
    },
    {
      "title": "Weber Quality",
      "text": "Great Grill, wouldn't have anything else. Great quality. Love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Norman P. Barrett",
      "helpful_votes": 0,
      "publication_date": 20160812
    },
    {
      "title": "Bent Parts",
      "text": "The unit came damaged, with no directions. Had to bend bottom rack into position to assemble. Unit works pretty well.",
      "rating": 2.0,
      "verified": true,
      "author": "John Marler",
      "helpful_votes": 0,
      "publication_date": 20190627
    },
    {
      "title": "This grill was a present and I've always loved Weber grills",
      "text": "This grill was a present and I've always loved Weber grills. This is no exception. I love the ease of assembly and it works flawlessly. Propane assist starting is a dream and prep table is a nice plus. Worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Unknown",
      "helpful_votes": 0,
      "publication_date": 20160228
    },
    {
      "title": "Love this!",
      "text": "Love this weber! Im kinda addicted to it. Easy to use and clean!",
      "rating": 5.0,
      "verified": true,
      "author": "Wendy",
      "helpful_votes": 0,
      "publication_date": 20200203
    },
    {
      "title": "Third Weber",
      "text": "Hard to beat a Weber quality and service. My third.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190623
    },
    {
      "title": "Easy to assemble",
      "text": "Easy to assemble. I've been ill so have become very weak, but still was able to do it with no help. Did a couple of small cooks on it with good results and the clean up was very easy.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Shiro Kataoka",
      "helpful_votes": 0,
      "publication_date": 20150523
    },
    {
      "title": "Best charcoal grill on the market",
      "text": "Best charcoal grill on the market, buy Steak Grates to go with it they are the best for great grill marks on steaks.",
      "rating": 5.0,
      "verified": true,
      "author": "Kenneth Robertson",
      "helpful_votes": 0,
      "publication_date": 20151023
    },
    {
      "title": "It’s a Weber!!!",
      "text": "This is hands down the best grill I have ever owned!",
      "rating": 5.0,
      "verified": true,
      "author": "Dave B.",
      "helpful_votes": 0,
      "publication_date": 20190716
    },
    {
      "title": "Wel made BBQ grill",
      "text": "Was very fortunate that the parts (Weber grill) arrived with only one damaged. A call to Weber and a few days later the replacement part arrived and was installed. Cannot understand how the part was damaged given the meticulous packaging and lack of cardboard container having any visible damage. All that to say a great unit works fantastically. Love the propane addition to starting the charcoal chimney. It is a cake walk to grill.",
      "rating": 4.0,
      "verified": true,
      "author": "Swede",
      "helpful_votes": 0,
      "publication_date": 20160728
    },
    {
      "title": "Awesome grill!",
      "text": "I got this grill as a birthday present from my wife and absolutely love it! The gas ignition is just perfect in conjunction with a chimney ( purchased separately). I also purchased rotisserie for it (on the pictures) and it's a heaven to use. Love it!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel V.",
      "helpful_votes": 46,
      "publication_date": 20150407
    },
    {
      "title": "Five Stars",
      "text": "Easy lighting, love the features and well worth the money!",
      "rating": 5.0,
      "verified": true,
      "author": "Richard A. Tamashiro-Costa",
      "helpful_votes": 0,
      "publication_date": 20150425
    },
    {
      "title": "You don't know what you have been missing!",
      "text": "It's been better that I ever imagined it could be!",
      "rating": 5.0,
      "verified": true,
      "author": "rR",
      "helpful_votes": 0,
      "publication_date": 20160526
    },
    {
      "title": "A great grill for smoking when tempature control is needed!",
      "text": "Ok so, the way the bolts attach to the inner grill make it difficult to insert the grill face, unless you angle it just right you can burn your hands at the risk of the grill being uneven. The older model I had didn't have this defect, maybe the person putting it together made a mistake? Other than that it has great temperature control and i use it almost every day. The thick, high quality metal is nice and the large counter space is a plus. The igniter button is also easier to use than previous models. When this one wears out, you can bet ill be buying this brand again!",
      "rating": 4.0,
      "verified": true,
      "author": "Uncle Fester",
      "helpful_votes": 0,
      "publication_date": 20170530
    }
  ],
  "product_meta": {
    "title": "Weber 15501001 Performer Deluxe Charcoal Grill, 22-Inch, Touch-N-Go Gas Ignition System, Black",
    "description": "Color:BlackThe Performer Deluxe grill features an exclusive Touch-N-Go gas ignition system that ignites charcoal briquettes with the push of a button. Especially handy is an LCD countdown cook timer with a large readout . The timer attaches to the grill or can be easily removed if you'd prefer to take it inside or keep it with you. The grill is outfitted with innovative heavy-duty Gourmet BBQ System cooking grates, a 2-part grate system that may be used in tandem with Weber's Gourmet BBQ System cookware collection. The grill's classic porcelain-enameled bowl and lid with a One-Touch Cleaning system and high capacity ash catcher make clean up hassle free. Storage options are plentiful with the CharBin storage container which protects your charcoal from the elements and a sturdy painted metal table is right at hand while grilling. Also features a wire bottom shelf, no-rust aluminum vent and a glass-reinforced nylon handle. Uses disposable 14.1 or 16.4 oz. LP cylinders (sold separately). Tuck-Away lid holder",
    "rating": 4.8,
    "feature_bullets": [
      "Electronic Touch-N-Go with Propane Gas powered ignition system (propane tank not included)",
      "Dimensions - Lid Closed: 43.5\"H x 48\"W x 30\"D | Weight: 91 lbs",
      "22-inch diameter porcelain-enameled bowl and lid with a cooking area of 363 square inch",
      "Aluminized steel One-Touch cleaning system with removable, high-capacity, aluminum ash catcher",
      "Removable LCD cook timer and built-in lid thermometer",
      "3D interactive assembly instructions for this product are available through the free BILT app."
    ],
    "specifications": {
      "Product Dimensions": "30 x 48 x 43.5 inches",
      "Item Weight": "91 pounds",
      "Manufacturer": "Weber-Stephen Products LLC",
      "ASIN": "B00MKB5V1A",
      "Item model number": "15501001",
      "Customer Reviews": "4.8 out of 5 stars967 ratings4.8 out of 5 stars",
      "Best Sellers Rank": "#17,364 in Patio, Lawn & Garden",
      "Is Discontinued By Manufacturer": "No"
    },
    "categories": [
      "Patio, Lawn & Garden",
      "Garden & Outdoor",
      "Charcoal Grills",
      "Grills & Outdoor Cooking",
      "Grills & Smokers"
    ],
    "price": ""
  }
}