{
  "website_summaries": [
    {
      "verdict": "Fantastic sound quality from a well-known brand in speakers. You can spend more on a powered subwoofer, but you won't find much better quality than this.",
      "pros": [
        "Produces a clear bass sound without being overpowering",
        "If you're looking for really powerful bass, this subwoofer can do that, too"
      ],
      "cons": [
        "It's a little pricier than other powered subwoofers of the same size, but you're paying for quality"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Clean, tight bass!",
      "text": "I own the 10” and 12”. The 10” puts out cleaner tighter bass compared to the 12”. The 12” obviously has more oomph but the 10” will get the job done. I’m in love with both.",
      "rating": 5.0,
      "verified": true,
      "author": "Alex ",
      "helpful_votes": 138,
      "publication_date": 20171208
    },
    {
      "title": "You won't be disappointed.",
      "text": "After reading some of the negative reviews complaining that this sub was not good compared to the r-110SW I almost cancelled my order. The sub arrived today and I tested it out. WOW. It's great! I've got to keep it turned down to about 10% on the volume knob. It really is that loud. I've got it connected to an Onkyo TX-RZ820 with 5 old Bose surround speakers. If you're a true audiophile that has a $3000 receiver and a $2,000 set of surround speakers then this might not be the sub you're looking for. If you just want something to make your music and movies sound great - this is your sub.",
      "rating": 5.0,
      "verified": true,
      "author": "Aaron",
      "helpful_votes": 59,
      "publication_date": 20180720
    },
    {
      "title": "It sounds bigger than it looks",
      "text": "As someone who owns the 15\" Klipsch Reference Premiere Subwoofer, I didn't expect much out of the Reference 10\", especially after seeing the two next to each other... but wow. It blew me away. I was most impressed by how little coloration and how open the 10\" sounds compared to the 15\" and while it definitely can't fill a room like the 15\", it holds it's own very well. Worth every penny.",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan/Nat",
      "helpful_votes": 98,
      "publication_date": 20160404
    },
    {
      "title": "I have this in my family room paired with the ...",
      "text": "I have this in my family room paired with the Klipsch quintet speakers. This thing packs a punch! Deep, tight bass. I've had this for 2 and 1/2 months now and have family and friends visit us a few times during that time. Everyone is very impressed with this subwoofer. My future project is building a legit home theater in my basement and Klipsch subwoofers will definitely feature there.",
      "rating": 5.0,
      "verified": true,
      "author": "Chunshu",
      "helpful_votes": 23,
      "publication_date": 20180529
    },
    {
      "title": "Worth every cent.",
      "text": "I cannot turn it up more than 1/4 of the way or my house begins to shake violently. This thing performs way better than I ever anticipated. I bought it because of all the good reviews, and they were not exaggerating. My wife hates this speaker with so much passion and it makes me love it that much more. This is the best sub you can get for this price.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert O.",
      "helpful_votes": 27,
      "publication_date": 20180419
    },
    {
      "title": "Best Sub Paired with Two R-15PM Speakers",
      "text": "Size doesn't matter apparently, this thing literally makes my house shake. Outstanding build quality with superior sound i've never experienced before. Ever since using this paired wiyh my two R-15PMs, I barely use my headphones anymore.",
      "rating": 5.0,
      "verified": true,
      "author": "Clark V",
      "helpful_votes": 18,
      "publication_date": 20170516
    },
    {
      "title": "this is one of the best subs out there",
      "text": "For under $200 (bought it on sale), this is one of the best subs out there. House rattling bass and fairly smooth. And enough options to tweak the sound to get the right volume you prefer.",
      "rating": 5.0,
      "verified": true,
      "author": "socal16",
      "helpful_votes": 9,
      "publication_date": 20170714
    },
    {
      "title": "Phenomenal",
      "text": "I orginally ordered the RP260F'S after much research. I really wanted the 280's but couldn't afford them. Sound Distributors upgraded my order to the RP280F'S without my knowing which made me very happy. Excellent seller, I highly recommend them, fast shipping, packages arrived in pretty good shape. Speakers are in perfect condition. The sound is crisp, clear and has so much depth. Huge upgrade from my old towers which I bought roughly 6 years ago. I also purchased the R10SW and it packs a serious punch. Definitely met and exceeded my expectations. My living room shakes at 1/3 gain. Completely satisfied and impressed. Klipsch has my vote. Klipsch for life.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20181107
    },
    {
      "title": "Great for 2.1ch",
      "text": "I use it for listening to music. 2.1 channels. This subwoofer makes the recordings sound bigger. I played with the subwoofer positioning and use a room EQ software to reduce nulls from my listening position. The subwoofer handles jazz recordings fantastically. Bass is tight and dynamic. It looks good, it sounds great. For the price, it is an outstanding product.",
      "rating": 5.0,
      "verified": true,
      "author": "Arachnid",
      "helpful_votes": 2,
      "publication_date": 20200613
    },
    {
      "title": "Good value for the money, subwoofer made a difference.",
      "text": "Wife told me not to believe people promoting speakers oN YouTube..”Just by a sound bar!” Lol First time watching scary movie this Sub thumps and made her jump. Music sounds much better than movies with setup I have. This was a powered subwoofer. From the pictures on Amazon I couldn't tell.(didn' t matter either way) 300watts I expected it to have power cord.",
      "rating": 5.0,
      "verified": true,
      "author": "KennyK923",
      "helpful_votes": 2,
      "publication_date": 20200630
    },
    {
      "title": "Perfect addition to R-15PM + Project turntable",
      "text": "The combination of these 2 products is a great high quality intro to listening to records but it sounds great with other sources too. I've checked out bluetooth and optical out from my cable box and they both sound great. Fills a 20'x24' room with booming low bass and I can still hear the R15-PM clearly. Great for all kinds of music - between everyone in my family I think we've played nearly every genre and they all sound amazing.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve H.",
      "helpful_votes": 3,
      "publication_date": 20190122
    },
    {
      "title": "Room shaking bass!",
      "text": "Omg! I am completely blown away by this sub! Being a 10’ sub I didn’t think the bass would be so deep but let me tell you it will shake the house!!! My wife came downstairs and said the bedroom was shaking!!! And I didn’t even have it turned up!!! So easy to hook up just plug it in and connect your rca cable from your receiver set the switch to auto (for automatic turn on when it sees a signa) and your all set! Clean tight deep bass! Klipsch does not disappoint!",
      "rating": 5.0,
      "verified": true,
      "author": "Ron",
      "helpful_votes": 2,
      "publication_date": 20200710
    },
    {
      "title": "Excellent Subwoofer",
      "text": "I’ve been using this subwoofer for about 4 years in multiple Klipsch configurations — tower, in wall, and now the 3 channel sound bar with in wall surrounds. I think this subwoofer really excels in all areas (movies, tv, music, etc). Really responsive and can deliver impressive base. I’ve used with Yahama, Denton, and now Marantz receivers and generic cables. It’s pretty small and unobtrusive — I’ve always hid it behind a chair or table. Recommend 100%",
      "rating": 5.0,
      "verified": true,
      "author": "Armi",
      "helpful_votes": 2,
      "publication_date": 20180630
    },
    {
      "title": "Great for the price",
      "text": "Have this in my large, open basement with a complete pioneer andrew jones surround sound and an Onkyo receiver. The sub does really well, I was especially impressed with the low range <45htz even across the basement at medium-high volume, but the bass does seem to quit keeping up with the speakers around 75% volume when I get into the music. It also has a bit of port noise in the corner where it sits. The port is against the wall probably 6 inches away which could be the problem but it puts out the most bass there. That being said, for the money it is an incredible speaker",
      "rating": 5.0,
      "verified": true,
      "author": "Austin Sommers",
      "helpful_votes": 2,
      "publication_date": 20180917
    },
    {
      "title": "The yard stick of speakers.",
      "text": "You can't go wrong with Klipsch. You just can't. I was back and forth between this or spending extra for a 12 inch sub from Klipsch, decided I would try my luck and boy am I glad I did NOT go with a 12 inch. I don't even have this thing on 50% gain and it shakes the whole living room and kitchen! This thing delivers bass like you wouldn't believe. In fact I would recommend you go with something even smaller if your living room is less than 15x15ft.",
      "rating": 5.0,
      "verified": true,
      "author": "Justin D.",
      "helpful_votes": 0,
      "publication_date": 20200813
    },
    {
      "title": "Your not getting any younger. Buy this and enjoy it now!",
      "text": "This is an amazing sub woofer that works well with music or watching movies. It offers perfection at a reasonable price. Amazon was as consistent as always delivering this magnificent piece in perfect order. I'm using this with a Yamaha sound bar, which will very soon be upgraded to Klipsch center speaker, the 440 or 450. Already got a 4k Onkyo receiver, so I can't wait to get the tower speakers and be blown away.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20181024
    },
    {
      "title": "Recommended For Music Enthusiasts",
      "text": "Good response. Gain control a little tight, but manageable. Good size unit for my room. Great clarity for the more demanding music.",
      "rating": 4.0,
      "verified": true,
      "author": "JLA",
      "helpful_votes": 8,
      "publication_date": 20170331
    },
    {
      "title": "Subwoofer",
      "text": "Excellent sub. As a musician, I enjoy music that is real. This sub does not over-power the natural sound of an orchestra. By nature, orchestras are not bass heavy. This fits my system perfectly. It has enough power to kick when playing a movie, but relaxed enough when playing symphonic music.",
      "rating": 5.0,
      "verified": true,
      "author": "Geoffrey A. Gray",
      "helpful_votes": 8,
      "publication_date": 20161216
    },
    {
      "title": "Impressive performance from small subwoofer",
      "text": "I’m both a pro audio professional and someone who enjoys home theater. I originally purchased this sub for my second smaller home theater system. My primary system has been underpinned by a 2000 watt 15” sub. When this Klipsh R-105S arrived, I connected it to my main system to test it out. I was impressed with the bass output and quality of sound from this little sub. So much so that I kept it connected to my main system and am using a different sub for the second smaller system. I’m not even using the 15” sub anymore for most of my viewing. This is a fantastic subwoofer.",
      "rating": 5.0,
      "verified": true,
      "author": "Marcelo Caramuta",
      "helpful_votes": 0,
      "publication_date": 20200921
    },
    {
      "title": "Great medium/small sized sub!",
      "text": "Klipsch quality throughout! Intense little bugger. I've had this one for about 6 months now......Bought another one since. ..... Get 2 subs if your amp will power them....=== just adds more complete sound throughout the room with no dead spots. Mine are 1 front firing + the other is down firing. ...nothing crazy with the bass ___just enough to \"complete\" the other speakers outputs + take the bass stress off of them. Crossovers on the subs are adjustable,of course.",
      "rating": 5.0,
      "verified": true,
      "author": "mike",
      "helpful_votes": 0,
      "publication_date": 20190110
    },
    {
      "title": "This review is for the UNPOWERED earlier model (still being made, afaik).",
      "text": "This model gave me a clean harder woofin' punch to my home entertainment speaker collection. My unpowered subwoofer had given up the ghost and I needed a replacement. A few home stereo equipment reviewers 'on the internet' ranked this subwoofer as a top pick. It deserves it's good marks. Even if the speakers you have already rely on a couple, four, conventially large'ish loudspeakers to make up the standard three pair with the typically small center channel speaker, this subwoofer deepens the stereo system's voice. It can blend right in. Also, the price is very reasonable for the unpowered model.",
      "rating": 5.0,
      "verified": true,
      "author": "H. Logan",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "Best 10in. on the market for the price!",
      "text": "Great Speaker with some superb quality and smooth kick! I was debating if this would be big enough for me or if the 12in would be needed but I was blown away at how much bump a speaker of this size can produce!! I would buy again!",
      "rating": 5.0,
      "verified": true,
      "author": "john",
      "helpful_votes": 5,
      "publication_date": 20170906
    },
    {
      "title": "Worth every penny",
      "text": "Ive only had it one day but first impression are awesome for the money it’s pretty heavy great bass fill my needs I have it hook to a Yamaha v485 this thing rocks . Easy to hook up and hits hard it will be used for surround mainly but music too so it’s worth the money for sure",
      "rating": 5.0,
      "verified": true,
      "author": "Carol Pennington",
      "helpful_votes": 2,
      "publication_date": 20200617
    },
    {
      "title": "Gut Clinching Lows",
      "text": "I replaced a very old (ca 1990s) Infinity 8\" subwoofer with this Klipsch 10\" unit. This is a wonderful sub woofer. It adds a depth and richness that the old infinity just could not reach. Honestly, you just can't go wrong with Klipsch speakers. They sound great and exude quality in the build and materials. Love this subwoofer! Make sure you set the power switch to the center position so that it will automatically go into standby mode.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael A. Trivisonno",
      "helpful_votes": 0,
      "publication_date": 20200117
    },
    {
      "title": "Replaced BIC F12 sub: Klipsch is way better",
      "text": "I replaced a BIC subwoofer F12 model with this one . The bass signal as much punchier and accurate and louder than the 12 inch driver in the BIC model. I am using Klipsch indoor outdoor speakers as bookshelf speakers in my man cave. I like their product so that’s why I went with their 10 inch subwoofer. This was a good decision and I’m happy to give it five stars ....it has more than enough power and I have to turn it down a bit to keep it from distorting. I’ll check in a few months and let you know if the five stars are still warranted.",
      "rating": 5.0,
      "verified": true,
      "author": "Macgreenie",
      "helpful_votes": 0,
      "publication_date": 20190916
    },
    {
      "title": "A GREAT Sub",
      "text": "I have this subwoofer paired with Klipsch R-15PMs in my home office for a 2.1 system. I use these with my Macintosh. This system replaced a 4 year old Klipsch Pro-Media 2.1 system that I outgrew, I had to replace the driver in the sub 3 times. Next to my new system, the Pro-Media is a toy. The bass is strong, full and tight and blends very well with my powered R-15PMs.",
      "rating": 5.0,
      "verified": true,
      "author": "Lowrider",
      "helpful_votes": 3,
      "publication_date": 20180724
    },
    {
      "title": "This little Sub will move you.",
      "text": "It continues to shock me. I can't believe how something this compact and attractive can blow out my 18'X18' Home theater room. When I first saw it, I thought I might need to get two of them. Once I tried it, bam! No need for any more power. I'm not shy with the volume knob, gain, or DB settings. I haven't had any distortion. I have had to re-arrange some of the items on my shelf. It will move you.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 35,
      "publication_date": 20160318
    },
    {
      "title": "Feeling my floor vibrate beneath me when I was tuning it was both unnerving and awesome at the same time",
      "text": "Honestly, I am coming from a logitech z5500 set and bought this thinking. HOPING that it'd be \"enough\" bass. It's totally blown me away. I'm still trying to get everything set up but from testing, I'm actually worried now that it will be overbearing on the stereo. Feeling my floor vibrate beneath me when I was tuning it was both unnerving and awesome at the same time.",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley",
      "helpful_votes": 0,
      "publication_date": 20180622
    },
    {
      "title": "Incredible sound",
      "text": "Surpassed my expectations. I bought this to replace a Martin Logan subwoofer (of the same size / power rating) that stopped working and expected this to be about as good. But for whatever reason this is much deeper and richer. I have to dial back the output a bit because it's so intense and powerful! Incredible deal.",
      "rating": 5.0,
      "verified": true,
      "author": "InritWritten",
      "helpful_votes": 0,
      "publication_date": 20200524
    },
    {
      "title": "Used, sold as new. Beware.",
      "text": "Came used, without any owners guide or material, and with sticky stuff on top where it must have had a sticker. Who knows where it was used. Works right now, but I paid for a new speaker, not someone's leftover. Only 90 day warranty from the reseller, not Klipsch. Really? Should state that they are used, even if lightly used. And no manufacturer's warranty and for just 90 days. Hope it lasts. Amazon should de-list this seller.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201009
    },
    {
      "title": "Hard to beat!",
      "text": "I think you would have to spend a lot more money to get a better quality subwoofer than this, at which point you would also have to consider room acoustics to make the added clarity audible. I pair this with a $1,500 pair of ELAC uni-fi slim floor standing speakers, and it really, really adds to the experience of watching movies and listening to non-acoustic music. I’m very happy with this subwoofer.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin Mahaffey",
      "helpful_votes": 0,
      "publication_date": 20200620
    },
    {
      "title": "Loud and clear. Great!",
      "text": "Wow, incredible difference from the Onkyo sub I had. Not an audiophile, so I don't know what to look for but I was amazed. Afraid to turn it up at night because the nextdoor neighbors... You feel it but it stays very clear. Overwhelms the rest of my system. My receiver calibration program even tells me it has a lot more power over Yamaha + Onkyo speakers. Will probably try this brand on the mains next.",
      "rating": 5.0,
      "verified": true,
      "author": "RolyatD",
      "helpful_votes": 0,
      "publication_date": 20200811
    },
    {
      "title": "Overall great unit",
      "text": "Likes: size, power, price, and sound quality* Dislike: The power level of the Subwoofer does not work with the output volume of my receiver. When playing louder, and the stereo receiver output is being heard it sounds great with the subwoofer. but if you turn the volume down, the subwoofer is all you hear. Not good. Make sure your stereo receiver has a true subwoofer out. Don't use the line out for signal to the Subwoofer's amp!!! That is what I had to do and it kind of sucks.",
      "rating": 4.0,
      "verified": true,
      "author": "Mike Tee",
      "helpful_votes": 0,
      "publication_date": 20200830
    },
    {
      "title": "More of a bass speaker than a subwoofer.",
      "text": "This is Klipsch so it sounds good. I wouldn't call it a pure subwoofer. It's more of a bass speaker. 32 hz is the low end. That's not great. I have a bic acoustech that goes down to 24hz for reference. I didn't notice this until I received it. It's fine, it's not my main system. It goes in my bedroom. It is Klipsch and sounds great. So for a secondary setup it's good.",
      "rating": 3.0,
      "verified": true,
      "author": "radio interference",
      "helpful_votes": 0,
      "publication_date": 20200517
    },
    {
      "title": "Great sub. Period.",
      "text": "This sub is very adequate for a small room. It delivers a very clean sounding bass tone. It will capture the intricacies of an upright bass very clean. No noticeable extra noise. I am a bassist of 30 years and I can say that this sub captures a bass tone extremely well. The gain and crossover can be adjusted easily to your liking it you know what kind of sound you are wanting. It is a bit directional which is expected of a single cabinet but if positioned right, it won't matter. Don't let the size fool you. This thing will deliver vibration.",
      "rating": 5.0,
      "verified": true,
      "author": "Gary Wynja",
      "helpful_votes": 0,
      "publication_date": 20191111
    },
    {
      "title": "Best Value for a 10\" Subwoofer",
      "text": "The Klipsch Reference R-10SW doesn't come with any bells or whistles so be cautious when purchasing if multiple subwoofers are used. I feed this subwoofer via my Wharfedale subwoofer which has speaker and RCA line level inputs and outputs. The Klipsch Reference R-10SW only has right and left channel line inputs. In fact this sub does not have a power switch and is auto on only. What you gain with this subwoofer for the price is sound quality and power. The Klipsch Reference R-10SW is a great value for price paid even if it's the older model and it looks gorgeous. Great all around subwoofer!",
      "rating": 5.0,
      "verified": true,
      "author": "poseidon8118",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "Great sub great price (at time of purchase)",
      "text": "Great price for this can't really go wrong with Klipsch unless you move into the audiophile brands but Klipsch is solid. Great powered amp for the price. Powered and adjustable, really good punch from this sub. I use it for my Home Theater set up (60%) and music listening (40%) hip hop alternative rnb classic rock some house and all sound great! Its not gonna compete with a Bowers & Wilkins sub but a great value sub for sure.",
      "rating": 5.0,
      "verified": true,
      "author": "Paymon",
      "helpful_votes": 2,
      "publication_date": 20180327
    },
    {
      "title": "Very good bass, the difference with the R-12SW is not too much in my opinion.",
      "text": "Good subwoofer, powerful with lot of bass. I hope that will be for long time. I had the Klipsch R-12SW before, it was sounding very good but after a few months, it had lost the bass. I am trying this one now, if it is good, I will buy 1 more in order to have 2.",
      "rating": 5.0,
      "verified": true,
      "author": "Nini",
      "helpful_votes": 0,
      "publication_date": 20190423
    },
    {
      "title": "Sweet",
      "text": "Love it. Took some fiddling to get the levels and cross-over just right but now everything sounds right and tight. Looks very nice too. The front-mounted bright green LED is a bit of a questionable decision on Klipsch's part (especially when like me you don't like to cover the nice looking cone with the grille) but it's a minor quip I'm willing to overlook at this point.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike Thompson",
      "helpful_votes": 0,
      "publication_date": 20180614
    },
    {
      "title": "Huge sound. Great value.",
      "text": "This is my second Klipsch subwoofer. My first was a 12\" but my lovely bulldog ate through the grill and tore out the speaker. The 10\" was a replacement and I absolutely loved it - better punch to it. Alas, as I write this, my bulldog destroyed the 10\" as well. Will get another Klipsch but trying to replace the speaker first to see if that's possible. lol",
      "rating": 5.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20190129
    },
    {
      "title": "This is an awesome sub, it really put down some good power ...",
      "text": "This is an awesome sub, it really put down some good power for a 10 in woofer. I have a powered 12in Polk sub, witch is a $200 sub to be fair but this 10 in blows it out of the water, its much tighter sounding base, and hits very hard for a 10. I'm using with Kilipsch R-15PM Powered Monitor speakers as a 2.1 setup for my computer it is awesome!!! love this sound of Klipsch speakers!!",
      "rating": 5.0,
      "verified": true,
      "author": "sean",
      "helpful_votes": 125,
      "publication_date": 20160222
    },
    {
      "title": "I'm not sure the subwoofer always worked",
      "text": "There is a small light indicating when its on, but when watching movies and playing video games, I noticed it wasn't always on. I bought it as part of a set of other Klipsch speakers which I ended up returning. I didn't have such a problem with a different speaker.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190217
    },
    {
      "title": "BOOM BOOM BOOM",
      "text": "This sub is good for movies and special effects. For music, in my opinion, not so much. Spend your money on a more musical/versatile sub from SVS or Yamaha. Returned it. Klipsch can \"Keep The Sound!\"",
      "rating": 3.0,
      "verified": true,
      "author": "Corn Fed",
      "helpful_votes": 3,
      "publication_date": 20180827
    },
    {
      "title": "very happy with my choice",
      "text": "im very glad i choose klipsch.. this is a name u can trust to be exactly what they say they are...im building my home theater system from the ground up and so far im very satisifed with my choices of equipment and speakers,sub and center channel..my reciever is dennon, 2 sets of polk audio monitor 40 series 2...klipsch 12 inch powered sub along with a klipsch center channel....well on the way to POWER......UNLIMITED POWER........LOL ...im a happy customer amazon...tk u",
      "rating": 5.0,
      "verified": true,
      "author": "deanmoore",
      "helpful_votes": 0,
      "publication_date": 20201002
    },
    {
      "title": "Can easily recommend this to a friend",
      "text": "I wasn't expecting much from this 10 inch sub-woofer, I just needed something to supplement the complimenting bookshelf speakers. It has no problem pressurizing a medium sized room with 9 to 14 foot vaulted ceilings. Bass was clean and not overly boomy. And after this I will be looking more into the Klipsch line of sub-woofers, so yes I would recommend to a friend.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeb",
      "helpful_votes": 0,
      "publication_date": 20191124
    },
    {
      "title": "great bang for the buck",
      "text": "I needed a smaller sub for the room I have, I use it for music and guitar. Holy cow this sub is just awesome, I highly recommend it, tons of clean bass with a smaller footprint, excellent buy.",
      "rating": 5.0,
      "verified": true,
      "author": "t obrien",
      "helpful_votes": 0,
      "publication_date": 20190913
    },
    {
      "title": "Sounds Awesome",
      "text": "Super versatile sub. On sale or not, you'll be happy with this sub. My receiver has an output for a second sub but it is not necessary at all. We have a small house - 875 sq/ft or so and this can boom throughout if needed (and piss of neighbors if needed lol). I have the gain turned way down and set to a low hz cutoff because I'm running Jamo 803s with this. They have a great low end by themselves.",
      "rating": 5.0,
      "verified": true,
      "author": "Dave",
      "helpful_votes": 0,
      "publication_date": 20190630
    },
    {
      "title": "This is great, but keep in mind that it is BIG",
      "text": "Its great and the sound quality is amazing, you really are getting what you paid for, it's almost too powerful for a home or room setup, but you wont be disappointed at all.",
      "rating": 5.0,
      "verified": true,
      "author": "Josué Díaz",
      "helpful_votes": 0,
      "publication_date": 20200627
    },
    {
      "title": "best decision ever",
      "text": "my girlfriend told me not to buy it, i bought it, she left me, best decision ever.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20190827
    },
    {
      "title": "Klipsch is the benchmark",
      "text": "Even though is just 10\", it sounds better than the 12\" powered woofer it replaced. Love the auto shutoff feature and size. This powered woofer should be enough for most living rooms. Our great room is 30 x 35 feet and have the gain turned to only 45% and it sounds amazing.",
      "rating": 5.0,
      "verified": true,
      "author": "Jaime Bueno",
      "helpful_votes": 2,
      "publication_date": 20180827
    },
    {
      "title": "Lots of boom, little box",
      "text": "When you're quarantined for months, one thing you can do is have a dance party every day. Get some exercise jumping around the house. But you need good dance music, and for that you need good bass. This Klipsch unit is amazing! It fits easily under my TV - my old subwoofer was too big - but it sounds like it's enormous. The bass is crisp and nicely nuanced. It's easy to tell a string bass from a bass sax from synth thumping even at high levels. Try it out with \"Losing It\" by Fisher with the volume pegged!",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200827
    },
    {
      "title": "money well spent",
      "text": "This thing have tremendous amout of power for a 10 inch ans its beautiful to look at it blends in well with my paradigim speaker and denon reciver i noticed a bit of a booming. However i havent really taking the time to set it properly so the booming part may b in my end . This is money well spent tons of power to my livingroom is pretty big about 20 by 30 and i only had to use 45 percent of power and the low freq . At a 100 i have the paradigm monitor 3 4 of them the atom for surround back and the denin avr 3805 and this this sub can handle all that beautifully",
      "rating": 4.0,
      "verified": true,
      "author": "Rico",
      "helpful_votes": 0,
      "publication_date": 20200628
    },
    {
      "title": "Already stopped working",
      "text": "Already stopped working. Delivered Aug 15 and stopped working Sept 17",
      "rating": 1.0,
      "verified": true,
      "author": "Jodi Clark",
      "helpful_votes": 2,
      "publication_date": 20190918
    },
    {
      "title": "My second klipsch subwoofer both great",
      "text": "Its never a bad thing to buy and older version. Get a good product at a great price",
      "rating": 5.0,
      "verified": true,
      "author": "Pauly Kindler 2",
      "helpful_votes": 2,
      "publication_date": 20181113
    },
    {
      "title": "Daddy likes big boom",
      "text": "I replaced a 12\" Infinity sub that died with the 10\" Klipsch and it is so much louder! Super easy to drop in and get going. Rocked out already today",
      "rating": 5.0,
      "verified": true,
      "author": "Jason Axley",
      "helpful_votes": 0,
      "publication_date": 20200613
    },
    {
      "title": "This Thing is Big",
      "text": "OK. I really didn't check the size of this before ordering. It is about twice the size I thought it would be but I love it. Talk about bass! You can rock your whole house. Let's just say I adapted and made room for this subwoofer.",
      "rating": 5.0,
      "verified": true,
      "author": "Val D. Steed",
      "helpful_votes": 0,
      "publication_date": 20200807
    },
    {
      "title": "The sound is amazing!",
      "text": "I bought these along with the Klipsh R-15PM powered monitors for my turn-table. The sound is amazing! It came with a remote that I only use for the master volume and controlling the amount of bass from the subwoofer. I saw an add for these on Facebook where it said something like ' who said speakers couldn't buy happiness'...I love playing my old records through these!",
      "rating": 5.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20170911
    },
    {
      "title": "Theater ready!",
      "text": "Fantastic sound quality! I used to work as a home theater installer for years. I have heard many expensive systems but the one brand that always stuck out above the rest was Klipsch! Hands down worth every penny!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20171023
    },
    {
      "title": "Completed my 7.1 with a bed rock of bottom.",
      "text": "I was worried about not going with the 12” option but my theater room is small and the 10” has exceed my expectations. I have a piecemealed surround sound speaker system and this was the last piece of the 7.1 system driven by an Onkyo Receiver. I still have the gain on the low side as it will shake the house when I crank it.",
      "rating": 5.0,
      "verified": true,
      "author": "Steven Henricksen",
      "helpful_votes": 0,
      "publication_date": 20190726
    },
    {
      "title": "It's a KLIPSCH!",
      "text": "Not much more to be said. Excellent sound and build quality with big bass sound in a small package. Price point was spot-on. If you know Klipsch products, you will understand the reputation, if not, take the plunge and give them a try.",
      "rating": 5.0,
      "verified": true,
      "author": "dman68",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "Great for movies",
      "text": "Bought this to use with my Denon receiver/home entertainment system. I have the Bose Acoustimas 5 speakers and this subwoofer really made a difference in the sound of action movies. You can feel and hear the difference.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim Lindsay",
      "helpful_votes": 0,
      "publication_date": 20200221
    },
    {
      "title": "Great Value.  Bumps!",
      "text": "For 200$ you can't go wrong. Really bumps. I use with 3.5\" Presonus reference speakers and its is more than enough. I like that you can dial in the gain and low cut-off. I just wish the dials were on the front of the speaker.",
      "rating": 5.0,
      "verified": true,
      "author": "Vance",
      "helpful_votes": 0,
      "publication_date": 20200926
    },
    {
      "title": "Great for turntable with deep, rich bass",
      "text": "I love this subwoofer! It has rich, deep base that’s plays well with my turntable setup. I thought the Polk 10” sub I had originally was really good, but when it went out and I replaced it with this beautiful monster, I learned what true deep, soul-moving bass sounds like on my system. Wonderful purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Hekkubus",
      "helpful_votes": 0,
      "publication_date": 20200206
    },
    {
      "title": "Man the bass sound good. Play from The Lord of the Rings the ...",
      "text": "Got his to use with a pair of Klipsch r-15pm powered Speakers for an upstairs tv room. Man the bass sound good. Play from The Lord of the Rings the part where Saron's hand gets cut in the 1st movie. That bass drop. 😮😮",
      "rating": 5.0,
      "verified": true,
      "author": "ERobinson",
      "helpful_votes": 3,
      "publication_date": 20170925
    },
    {
      "title": "Amazing sub!",
      "text": "This is the best sub woof that I have ever had! Great bass and power control. Great sub at a great price!",
      "rating": 5.0,
      "verified": true,
      "author": "George",
      "helpful_votes": 0,
      "publication_date": 20190529
    },
    {
      "title": "WOW",
      "text": "WOW. What a difference. I thought my old sub was decent until I installed this sub on my home theater.. I realized I was bringing a knife to a gun fight. Just click Buy Now! You won’t regret it.",
      "rating": 5.0,
      "verified": true,
      "author": "T. Chapman",
      "helpful_votes": 0,
      "publication_date": 20200725
    },
    {
      "title": "Fantastic bass that fills the whole room.",
      "text": "Finally completed my 5.1 Klipsch surround set up downstairs with this subwoofer. I've had Klipsch speakers for years in my media room, so it was inevitable that I would complete my 'smaller' surround system with Klipsch as well. Well packaged product, worked nicely right out of the box.",
      "rating": 5.0,
      "verified": true,
      "author": "Cupra",
      "helpful_votes": 0,
      "publication_date": 20180830
    },
    {
      "title": "Great value wonderful bass sound",
      "text": "For my home theater system, this subwoofer is just what I needed. It provides the right amount of bass to movies, television programs, and blu-ray dvds. Great value and from a well-known company.",
      "rating": 5.0,
      "verified": true,
      "author": "George H.",
      "helpful_votes": 0,
      "publication_date": 20200826
    },
    {
      "title": "Almost too much... I have to turn ...",
      "text": "Almost too much... I have to turn the gain to about 30% in my living room, but the sound is clean and powerful.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20171031
    },
    {
      "title": "Boom boom boom",
      "text": "As the girlfriend who shares the room with a total audiophile I can guarantee these are loud but not just loud.. great sounding.. but also loud. Only one thing I didn't like ... I became my mother almost instantly when they kicked in... WILL YOU TURN THAT DOWN.. DO THE NEIGHBORS REALLY WANT TO HEAR THAT?? ITS AFTER 10!'",
      "rating": 5.0,
      "verified": true,
      "author": "Wilda DaBeest",
      "helpful_votes": 0,
      "publication_date": 20201006
    },
    {
      "title": "Killer smooth bass.",
      "text": "Love my Klipsch sub! Replace an old Sony, what a difference. Smooth, powerful, shakes the house when you push it, brings movies to life. Music sounds great as well. Klipsch fan forever.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20200928
    },
    {
      "title": "Sorry neighbors....",
      "text": "This subwoofer has unfortunately gotten me in trouble in my apartment building. It has great sound and really outputs the low end for games, movies, and TV well. It's the perfect size for smaller living rooms or home theaters. Just make sure you are in a concrete building or single family home, otherwise you'll get complaints! :)",
      "rating": 5.0,
      "verified": true,
      "author": "DIP",
      "helpful_votes": 0,
      "publication_date": 20190327
    },
    {
      "title": "This bass kicks some serious ass. Not only can ...",
      "text": "This bass kicks some serious ass. Not only can you feel the base but you can also hear the bass guitarist which is rare.",
      "rating": 5.0,
      "verified": true,
      "author": "chevell65",
      "helpful_votes": 3,
      "publication_date": 20180701
    },
    {
      "title": "Good product for the price",
      "text": "Good product for the price! I used this R-10W for a second sub and it delivers the extra bass desired!",
      "rating": 4.0,
      "verified": true,
      "author": "Jack T.",
      "helpful_votes": 5,
      "publication_date": 20160906
    },
    {
      "title": "Simply Awesome",
      "text": "Sound and build far exceed my expectation, you will not be disappointed! I've been a sound tech, musician, and audiophile all my life starting ou doing pro sound in 1975",
      "rating": 5.0,
      "verified": true,
      "author": "Taiji on Maui",
      "helpful_votes": 0,
      "publication_date": 20200917
    },
    {
      "title": "Very nice",
      "text": "Good improvement over just bookshelf speakers. Perfect for a hardwood floor w lots of dampeners in the room. Not a thumper like a 12\" or larger but tight accentuation.",
      "rating": 5.0,
      "verified": true,
      "author": "davidpnola",
      "helpful_votes": 0,
      "publication_date": 20200926
    },
    {
      "title": "Quality at an affordable price",
      "text": "Can it get any better then this? I've added this 10\" sub wolfer To my other 10\" sub woofer.speaker. I instantly felt the further emersion into various movies, etc. I am very happy to experience what I would believe is close to perfect sound in 5.2 Dimensions.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephen Gresoro",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "Bought this sub on the recommendation of my son who ...",
      "text": "Bought this sub on the recommendation of my son who works in the film industry in LA. It's a prefect addition to our home theater.",
      "rating": 5.0,
      "verified": true,
      "author": "mike v",
      "helpful_votes": 0,
      "publication_date": 20180910
    },
    {
      "title": "Works well.",
      "text": "I'm no audiophile. I just wanted something that sounds good and was fairly inexpensive and this fit the bill. Purchased based on reviews on web and am happy with it.",
      "rating": 4.0,
      "verified": true,
      "author": "S. V. Metre",
      "helpful_votes": 0,
      "publication_date": 20191121
    },
    {
      "title": "Vibrant",
      "text": "Provides just the right amount of base for my listening pleasure",
      "rating": 5.0,
      "verified": true,
      "author": "Jerome",
      "helpful_votes": 0,
      "publication_date": 20191108
    },
    {
      "title": "It really is a remarkable buy!",
      "text": "This subwoofer looks great and sounds fantastic. It may be 10\" but it sounds more like 12\". It's also so easy to set up. I love it and bought a second one!",
      "rating": 5.0,
      "verified": true,
      "author": "Bilbo",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "Very Satisfied",
      "text": "The Klipsch Subwoofer replaced a JBL unit that died. I knew that Klipsch speakers have an excellent reputation. Very pleased with the product. I have the input set for 1/4 volume and the bass is strong. This unit also supports a LFE input, needed to match my older receiver.",
      "rating": 5.0,
      "verified": true,
      "author": "Ron",
      "helpful_votes": 0,
      "publication_date": 20181128
    },
    {
      "title": "I love it, but there is one BUT",
      "text": "I love it, but there is one BUT, after 3 month, the Auto turn On option by signal stopped working",
      "rating": 5.0,
      "verified": true,
      "author": "Larry King",
      "helpful_votes": 4,
      "publication_date": 20171119
    },
    {
      "title": "LOVE. LOVE LOVE this sub woofer",
      "text": "LOVE. LOVE LOVE this sub woofer. My roommates... Not so much. LOL. Produces big base. Took me a couple of weeks to find the correct placement and settings to accommodate the base coming from this woofer. Wish I had purchased this a long time ago. Well worth the money!",
      "rating": 5.0,
      "verified": true,
      "author": "kevin",
      "helpful_votes": 0,
      "publication_date": 20180423
    },
    {
      "title": "Very solid Sub",
      "text": "Had not realized my old Sub had stopped working at some point. This has filled in wonderfully. Absolutely no issue and paired wonderfully with a Sony receiver.",
      "rating": 4.0,
      "verified": true,
      "author": "Some Greg in Colorado",
      "helpful_votes": 0,
      "publication_date": 20190307
    },
    {
      "title": "Outstanding Value",
      "text": "Bought this just as the next model was coming out so got a great price. Had a full Klipsch surround system except not their subwoofer. This thing kicks like it should. Excellent value. My living room is 20’w x 13’d and this one sub is plenty big for the space. I spent a lot of time reading and learning how to tune it properly for the space and to integrate well with my other speakers and the time spent was worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "Adam Allard",
      "helpful_votes": 0,
      "publication_date": 20180902
    },
    {
      "title": "Great Investment!!",
      "text": "I must say that this is the best subwoofer I have ever owned. The bass is so powerful while keeping all the little low end details. This sub goes very low and deep. Also, make sure if you buy this or any other subwoofer you recalibrate your entire speaker reciever setup. You can't go wrong with this sub.. Way to go Klipsch!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180410
    },
    {
      "title": "Great sub at a fantastic price!",
      "text": "Very happy with this subwoofer! I replaced my Polk PSW-110 with this and am very happy with this! Also, a fantastic price as there is a newer model out.",
      "rating": 5.0,
      "verified": true,
      "author": "Ken B",
      "helpful_votes": 0,
      "publication_date": 20191023
    },
    {
      "title": "Very well worth the price & quality is exact;y what I was hoping for.",
      "text": "Purchased this to replace a basic Polk sub I bought on a Black Friday special a couple of years ago. Delivery went smoothly and arrived right on time as stated. Set up could not have been easier and I feel I made an excellent purchase. Huge improvement over what I had before! The majority of the reviews were extremely high which was the main reason I decided to make the purchase. Free 1-2 day Prime shipping sealed the deal as well :)",
      "rating": 5.0,
      "verified": true,
      "author": "jason",
      "helpful_votes": 0,
      "publication_date": 20190309
    },
    {
      "title": "Great bass in a small package.",
      "text": "Great bass in a small package! Needed to replace my included subwoofer that came with my HTIB due to a lightning strike. This sub is about 25% smaller in size (same woofer diameter), but the box it’s in is smaller. It sounds good, does the job! Can’t complain!",
      "rating": 4.0,
      "verified": true,
      "author": "Derek Antol",
      "helpful_votes": 0,
      "publication_date": 20200721
    },
    {
      "title": "Never Again",
      "text": "Great sounding unit, lasted until guarantee ended. Minimal usage! Update: Only the return was out of date, warranty is still in effect (4 mos old) I have created a repair ticket with Klipsch and will advise here! Klipsch would not honor their warranty. I emailed the vendor avsoundz and they replied quickly saying they would replace the unit. At my expense I returned the unit as specified. Over a month now with proof of delivery avsoundz will not respond to my emails. You may want to think long and hard before buying products from this manufacturer or vendor! I was able to secure a full refund through Amazon.",
      "rating": 1.0,
      "verified": true,
      "author": "Audiophile1",
      "helpful_votes": 18,
      "publication_date": 20170410
    },
    {
      "title": "Fantastic Sub",
      "text": "This sub hits so hard I can only run it on 1/2 gain. This thing blows my old sun bout of the water. Love the bass it produces.",
      "rating": 5.0,
      "verified": true,
      "author": "Mayonaise",
      "helpful_votes": 0,
      "publication_date": 20191107
    },
    {
      "title": "Powerful bass for home theater with Klipsch!",
      "text": "This sub sounds great! It is easy to adjust with solid feeling analog dials on the back of the sub. Plenty of power for a medium to large sized room. Though my wife doesn't like floorstanding speakers due to the space they occupy, the complaints are strangely absent during movie night or while listening to music! We listen to all types of music and this sub handles all genres just fine. Punchy enough for kick drum bump and the ported 10\" provides appreciable depth for pop/r&b bass. Very pleased with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "E&E",
      "helpful_votes": 0,
      "publication_date": 20180108
    },
    {
      "title": "10” fills the room and then some.",
      "text": "Sounds great. Good deep bass. 10” is plenty for my 30’x15’ living room. I keep it at about 40% gain. No need to pump it any higher.",
      "rating": 5.0,
      "verified": true,
      "author": "John5",
      "helpful_votes": 0,
      "publication_date": 20190806
    },
    {
      "title": "Transformed my sound",
      "text": "Was just using a sound bar, which was okay, but adding the bass was great. Sounds like a whole different room now :) .",
      "rating": 5.0,
      "verified": true,
      "author": "M. Bascom",
      "helpful_votes": 0,
      "publication_date": 20200818
    },
    {
      "title": "Great subwoofer!",
      "text": "This thing sounds great! My only prob is it came with a European plug, but the seller was awesome and sent me a converter/adapter for US plugs and all was well.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Klaas",
      "helpful_votes": 0,
      "publication_date": 20200313
    },
    {
      "title": "Excellent sub-woofer with plenty of power supporting it",
      "text": "Excellent sub-woofer with plenty of power supporting it. I have the volume on the subwoofer set below reference levels and reduced the output on my receiver and this has no issues rattling the walls. It has a great tight punch to it.",
      "rating": 5.0,
      "verified": true,
      "author": "Jared",
      "helpful_votes": 2,
      "publication_date": 20170210
    },
    {
      "title": "Deep base and quality sound",
      "text": "Very nice deep base. It took about a week for the speaker to break-in where the base would really hit. I’m very satisfied with it. No issues or problems. It was worth the cash.",
      "rating": 5.0,
      "verified": true,
      "author": "Chuck B",
      "helpful_votes": 0,
      "publication_date": 20200221
    },
    {
      "title": "Get ready for",
      "text": "This thing CRANKS!!!! OMG! I wasn’t ready If you love Bass, BOOM and everything in between then this one here will not disappoint....",
      "rating": 5.0,
      "verified": true,
      "author": "Roc",
      "helpful_votes": 0,
      "publication_date": 20200311
    },
    {
      "title": "Not impressed",
      "text": "Doesn’t sound as old as my prior one... only one I could find for my new set up at a reasonable price.. seems more bass comes from my side speakers than this woofer.",
      "rating": 3.0,
      "verified": true,
      "author": "CASS",
      "helpful_votes": 0,
      "publication_date": 20181128
    }
  ],
  "product_meta": {
    "title": "Klipsch Reference R-10SW 10\" 300w Powered Subwoofer (Black)",
    "description": "Style:10\"There are few home entertainment experiences that cannot benefit from the extended base that a subwoofer can provide. Maybe not charades, but ideally everything else. Music, movies and games will have the extra something that they have been missing with the addition of the r–10sw to your home theater. The front firing 10 inch subwoofer offers the flexibility of placement in any room for pulse pounding bass on demand.",
    "rating": 4.8,
    "feature_bullets": [
      "Powerful 10\" copper-spun front-firing woofer",
      "All-digital amplifier delivers 300 watts of dynamic power",
      "Equally impressive with music and movies",
      "Low pass crossover and phase control,Dimensions:14(H) x 12.5(W) x 15.7(D) Inches",
      "Line/LFE inputs for compatibility with most receivers"
    ],
    "specifications": {
      "Product Dimensions": "12.5 x 15.7 x 14 inches",
      "Item Weight": "25.5 pounds",
      "Manufacturer": "Klipsch",
      "ASIN": "B00MH42BBI",
      "Item model number": "R-10SW",
      "Customer Reviews": "4.8 out of 5 stars805 ratings4.8 out of 5 stars",
      "Best Sellers Rank": "#2,199 in Electronics",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "August 6, 2014"
    },
    "categories": [
      "Home Audio",
      "Electronics",
      "Speakers",
      "Subwoofers"
    ],
    "price": 199.95
  }
}