{
  "website_summaries": [
    {
      "verdict": "Despite some image-quality issues with digital video in the brightest mode, the Optoma HD141X home entertainment projector delivers reasonably good image quality overall.",
      "pros": [
        "Full 1080p in 2D and 3D",
        "Two HDMI connectors, one with Mobile High-Definition Link (MHL)"
      ],
      "cons": [
        "Serious image quality problems with some source material at the brightest setting",
        "Shows rainbow artifacts"
      ],
      "aspects": {},
      "publication_date": 20141110,
      "rating": 7.0,
      "source": "pcmag"
    }
  ],
  "customer_reviews": [
    {
      "title": "Excellent!",
      "text": "Probably the best bang-for-buck projector out there right now (at least that I could find). Picture quality is fantastic and bulb is plenty bright to view during the day, even in eco mode. Fantastic for a first HD projector. With great color reproduction, low cost-per-inch, and high contrast ratio, I can't fathom why anybody would buy a TV over this... I would say my only complaint is the keystone correction which causes major distortion, so avoid using it at all costs. I'm sure this is typical of projectors in this price range (if not all), but either way, do yourself a favor and mount/position it properly so you don't have to use it.",
      "rating": 5.0,
      "verified": true,
      "author": "Michal",
      "helpful_votes": 3,
      "publication_date": 20141021
    },
    {
      "title": "really great image! can't expect anything more for the price",
      "text": "really great image! can't expect anything more for the price. i had my doubts buying one that's not sony, epson, ... but those were way more expensive. WATCH OUT: a lot of projectors call themselves \"1080p compatible\". that just means they can read the signal. but their image is still lower resolution. this one here on the other hand, has a native resolution of 1080p. that means the image you see that's being projected, that's a 1080p image. I haven't found any cheaper projector on amazon with a \"real\", native resolution of 1080p. and yet the quality is great. (can't speak for sound though, I use external speakers)",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160909
    },
    {
      "title": "5 yrs later",
      "text": "This really was cutting edge at the time. Purchased 5 years ago and the lamp is still holding up, colors are bright, and MHL inputs and all the output options retain compatibility. I'll probably replace it in a year or two to upgrade to 4K projector. Will look into getting this brand again.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200328
    },
    {
      "title": "Great colors.",
      "text": "Bought this to replace an Optoma HD20 which was about 7 years old and finally died. All I can say is WOW!! Great colors.. Darks are dark and brights are vivid. Extremely quite and easy to install. I did have to move the mount since the throw distance was different than the HD20. I looked up the \"optimal\" color settings and adjusted accordingly and all I can is is HOLY S***!! My neighbor has a 2K unit he bought 4 months ago and even he says the picture is better than his. So far I'm very happy. Sports looks great, Call Of Duty is amazing. Can't wait for football to start!!",
      "rating": 5.0,
      "verified": true,
      "author": "TOM CLAY",
      "helpful_votes": 0,
      "publication_date": 20160828
    },
    {
      "title": "Great picture, greater concern",
      "text": "I initially loved this projector and would have given it 5 stars, beautiful picture and worked well with my A/V setup for PS4, Wii-U, Blu-Ray player, and Directv. I am concerned that the HDMI 1 input is already failing. I occasionally get a fuzzy black/white snow screen that flashes on for a second then back to normal. I tested various things and discovered it was only happening at the projector. Lets see how their customer service is and I may be back to re-rate this.",
      "rating": 3.0,
      "verified": true,
      "author": "NYJAY",
      "helpful_votes": 0,
      "publication_date": 20160721
    },
    {
      "title": "Excellent picture quality (only have tried with 1080p & 720)",
      "text": "Excellent picture quality (only have tried with 1080p & 720). I was worried about bad reviews however I have no complaint until now, just be sure to pair it with a HDMI 2.0 cable. I disabled the integrated speakers since I use a home theater system, but try them before installation, nice quality but not comparable with HSS. Projector was mounted with the following: VideoSecu LCD/DLP Projector Vaulted Ceiling Mount Bracket with 22.4-Inch Extension Pole - Black PJ2B 1C9 (it would be better if you can buy another one, since pieces have to be re-adapted to match projector's mount plate). Fan noise is notable but acceptable. Overall: Projector highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Pablo B",
      "helpful_votes": 0,
      "publication_date": 20141223
    },
    {
      "title": "Very pleased.",
      "text": "This is one great little projector. It's light, bright, and throws a great picture. One item to note if you're thinking of buying this unit; it's either floor or ceiling mount. It cannot throw a direct forward image. Meaning, its projection is either thrown from the floor (up), or from a ceiling (down). No directly in front. So keep that in mind. Be careful when first setting it up. The remote is fast acting and we accidentally set the language to Indonesian. We had a humorous 10 minutes setting it back to \"Inggrish\". So far we love this unit. And I'm happy I picked this simple device for my first projector.",
      "rating": 5.0,
      "verified": true,
      "author": "Ron",
      "helpful_votes": 3,
      "publication_date": 20150313
    },
    {
      "title": "Don't look any further for quality and value for Money",
      "text": "I owned a premium Projector Brand before this, for which I paid 3 times more. The Optical Engine busted twice within 3 years. I chose this Brand/Model based on Amazon reviews alone, and it has exceeded my expectations! I have been using this almost daily for 5.5 Years. The original Lamp has passed 5000 hours, used mostly in Eco mode. The picture quality was 90-95 of the Premium Projector I owned, but really hard to notice the difference, unless you have my Eyes. I am now all set to upgrade to their 4k Projector this Year, hoping to use it for another 10 years. Superb video quality, and definitely worth the Money!!! Have a nice day!",
      "rating": 5.0,
      "verified": true,
      "author": "Runi",
      "helpful_votes": 0,
      "publication_date": 20200621
    },
    {
      "title": "Extremely good value, and an all-around excellent projector",
      "text": "This projector has been excellent for us. It interfaces with my PS3 without issue, as well as my Chromecast. The PS3 is tied to my PC using a media server as well. And after hooking up a set of PC speakers and subwoofer to the audio-out on the projector, I've built up a low-cost (yet excellent) \"poor man's home theater\" setup. Admittedly I don't know enough about projectors to give a technical review of the HD141X, but that's been covered here as well as on other sites. What I can say is that, for the cost, you really get an amazing end result.",
      "rating": 5.0,
      "verified": true,
      "author": "PerfectSetback",
      "helpful_votes": 2,
      "publication_date": 20151128
    },
    {
      "title": "Performance, Quality, Value",
      "text": "The HD141X projector does an amazing job displaying HD content for such a low price. I just tried out the 3d function with a cheap set of Signstek 3d glasses and a PS3 console. 3d movies look great and really pop out at you. When you are in 3d mode, you click the menu function button to set the type of 3d you want to view. I have owned Epson, BenQ, Viewsonic projectors before and I do love Epson machines for their build quality and customer service, this machine tops them in price and performance.",
      "rating": 4.0,
      "verified": true,
      "author": "Mr.T",
      "helpful_votes": 3,
      "publication_date": 20150710
    },
    {
      "title": "Why Buy A Giant TV When You Can Have This For A Fraction Of The Price!!!",
      "text": "In my opinion if your going to buy anything bigger than a 42 inch tv skip it and get this instead the video quality and sound quality through build in speaker is amazing and when it comes to the versatility you can put this thing on any wall and customize to any environment even i have personally bought two of these. The Cons Volume on the unit is kinda loud even on the lowest setting not so nice when your trying to keep it down for the baby i bought the second unit for my brother and the bulb burst within three months easily replaced and under warranty but still concerning Overall amazing product tho would buy again",
      "rating": 4.0,
      "verified": true,
      "author": "Tyler",
      "helpful_votes": 0,
      "publication_date": 20160223
    },
    {
      "title": "Clear ang sharp picture high-quality HD Projector",
      "text": "For less than $600, this is an amazing piece of equipment. It is very easy to set-up and positioned. I did not have to do a lot of adjustment to achieve a 120\" movie screen. My previous projector, a Dell, which I had bought for the same price several years ago looked very amateur in terms of performance when compared to this Optoma model. The colors, especially black, are rich and sharp. It's best for BLURAY discs and maybe for games. We are very happy with this projector. I will need an XBOX one for this projector.",
      "rating": 5.0,
      "verified": true,
      "author": "Toto (Round Rock, TX)",
      "helpful_votes": 3,
      "publication_date": 20151216
    },
    {
      "title": "The brightness is great even with the lights and the speakers are not ...",
      "text": "This projector throws a very clear 120\" picture at around 13 feet. The brightness is great even with the lights and the speakers are not bad for just watching TV, etc. Overall, i am very happy with the projector. The only reason I am not giving it 5 stars is that it keeps reverting to the factory default orientation (upside down) when i turn it off. I am guessing there is some setting I am missing somewhere to stop this but the instructions that come with this and the manual that is downloadable don't seem to show how. Again, for the price, I can't say enough about how good this looks.",
      "rating": 4.0,
      "verified": true,
      "author": "DWood",
      "helpful_votes": 2,
      "publication_date": 20141224
    },
    {
      "title": "Unresponsive Controls fixed with new unit",
      "text": "Its a shame, because when it works - it works well. But several times now I have been unable to power off the unit because the controls become unresponsive. I am returning for a replacement to see if that also has the problem. EDIT: My second unit works fine. I changed my setup to hopefully alleviate issues. I decided against eco-mode and left it in regular mode, and have now left it plugged in, so that the fan can stay on to cool it down after running. My hypothesis was that killing the power right after viewing left it too hot. It has been running fine for a month now.",
      "rating": 3.0,
      "verified": true,
      "author": "Jason",
      "helpful_votes": 0,
      "publication_date": 20150508
    },
    {
      "title": "like with TV's",
      "text": "I have had the projector for over 1 month. I was worried about the rainbow effect. I can't see it, but my wife and daughter can. It doesn't bother them. There really isn't anywhere to see projector quality befor you buy, like with TV's. So reviews are really important. The Picture looks great. I use it inside and out on the porch. Inside you can even get a OK picture during the day time. At night is when this projector really shines. For the $$ to get a 110\" screen is great. For the first projector that I have ever owned, it is great.",
      "rating": 4.0,
      "verified": true,
      "author": "Joseph Conway",
      "helpful_votes": 0,
      "publication_date": 20160523
    },
    {
      "title": "Great home projector",
      "text": "Great home projector. Mounted it on the ceiling in my living room along with a 100\" Projector screen. The wife and I use it to watch Blueray movies and 3D movies rather than going to the movies now. 3D quality is very good and the projector is bright enough that some ambient light doesn't distract from watching the movies. As with most projectors blacks have some wash out and aren't as crisp as you might see with a normal TV but you can't beat the home theater experience we now enjoy.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert S",
      "helpful_votes": 2,
      "publication_date": 20160523
    },
    {
      "title": "Glitchy. Doesn't last. Buy something else",
      "text": "This worked really well for about a year, then started having random glitches where it would turn the sound off and the video would cut in and out. Now, only one input works for about 5 minutes. I have to restart it to get it to work every 5 minutes. I use it very, very sparingly. Maybe once a month for two or three hours. If you want a projector that works for more than a year or two, get something else",
      "rating": 1.0,
      "verified": true,
      "author": "Jennifer Lin",
      "helpful_votes": 0,
      "publication_date": 20191127
    },
    {
      "title": "Amazing projector",
      "text": "I purchased this projector to replace my LED projector that recently died. I can not begin to compare the differences between these projectors. First the packaging from amazon was amazing as the projector was doubled wrapped to prevent any damage. I immediately took the projector out of the box, and the quality was absolutely amazing. The picture is so much brighter than my led projector. The colors were more crisp, and it was truly amazing quality. I hooked it up without any celebrations and the picture was as good as any movie screen that I have ever seen. Excellent product and excellent purchase. I would highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "B. Oakley",
      "helpful_votes": 0,
      "publication_date": 20141109
    },
    {
      "title": "Simple and Easy 3D projector.",
      "text": "BRIGHT, and 3D! Works great with MOST brands of 3D shutter glasses. Automatically becomes 3D, for Playstation 3 connection. Quiet Fan, PROJECTS LARGE AND BRIGHT [My screen is 5 feet, by (up to) 14 feet!] The video inputs are HDMI ! and HDMI 2 [no RCA video, No digital video.] This limits its use for VHS/Laser/CED video sources...so I have to keep an older projector on-hand for that.",
      "rating": 5.0,
      "verified": true,
      "author": "Dean Wall",
      "helpful_votes": 0,
      "publication_date": 20170318
    },
    {
      "title": "Amazing Quality!! WOW!! :-)",
      "text": "Very impressive!! We told people about it but until they saw it with their own two eyes, they didn't really believe us on how amazing it is. Definitely gives the wow factor!!!! :-) We project it onto our 2-car garage (7'x16') door, no sheet or cover necessary, the quality is perfect over the design/depth of garage which surprised us. I think we could go twice a big & still have crystal clear image (honey-do-list project. Haha). We also bought & highly recommend - WORKFORCE Travel Video Projector Hard Case #HD28DSE / HD141x.",
      "rating": 5.0,
      "verified": true,
      "author": "Alexandra Borman",
      "helpful_votes": 0,
      "publication_date": 20160802
    },
    {
      "title": "HD141X is no match for the HD131Xe (I have both of them)",
      "text": "The HD141X is definitely a step down from the HD131Xe...I have both of them. HD141X lacks: 1) Color setting 2) Tint setting 3) Brilliant Color setting 4) The white is chalky (washed out) 5) It defaults to dynamic mode when you are in cinema mode. I want Eco mode at all settings. 6) It is very noisy compared to the HD131Xe, very disappointing! 7) The HD141X has a filter to maintain, a hassle! So my question is, why is Optoma trying to ruin a good thing?",
      "rating": 3.0,
      "verified": true,
      "author": "p",
      "helpful_votes": 6,
      "publication_date": 20150316
    },
    {
      "title": "I love this projector",
      "text": "I love this projector. Honestly, this is the best tech purchase and bang for your buck thing I think I've ever bought. Once you have a projector it's hard to go back. If you're debating a 4K TV, don't, get a projector. Once you have a 100\" screen you'll understand of a difference it makes and how much better movies and sports are when you have a large screen at home. The only thing you need to add is a source selector and nice speakers and you're good to go. The speakers on the projector are surprisingly good, but once you go down the home theater route, you'll demand the best sound and video.",
      "rating": 5.0,
      "verified": true,
      "author": "Nathaniel",
      "helpful_votes": 0,
      "publication_date": 20151113
    },
    {
      "title": "You have to buy this...great product at a great price.",
      "text": "This is fantastic. I haven't had a chance to use the 3D feature yet but the movies and games I play on it are clear and high def. Even in a room that has light coming in the window, the output is bright enough that I can watch it without a problem. I was able to get about 80\" equivalent screen where I was able to mount it in my bedroom. The fan makes a little noise but you don't notice it over the movie. I would definitely buy this again and recommend it to anyone who is considering a projector setup.",
      "rating": 5.0,
      "verified": true,
      "author": "Devon",
      "helpful_votes": 0,
      "publication_date": 20160925
    },
    {
      "title": "I had enjoyed the short time I got to use this projector ...",
      "text": "After 3 months the internal speaker has no audio... Can still get sound if I plug in external speaker but very much a hassle for portability :/ thought this would be a cheaper alternative to the big names but quality isn't there. Should last more than a year without problems, no I'm stuck with a projector with no internal speaker for $600+ Projector hasn't been through any travel or any reason to have issues.. Wondering if any others have this issue? Other than that, I had enjoyed the short time I got to use this projector with everything working fully.",
      "rating": 2.0,
      "verified": true,
      "author": "Trent",
      "helpful_votes": 0,
      "publication_date": 20150225
    },
    {
      "title": "A Sight for Sore Eyes",
      "text": "I spend a lot of time on the computer and it's gotten to the point where it really hurts my eyes. My eyes have become really sensitive to electronic light. This projector allows me to view the \"computer screen\" without the screen's light blasting into my eyes. When I view the computer screen through this projector on the wall, it feels completely different and doesn't hurt or strain my eyes. Awesome projecter, love it! Lots of settings and features to select, great quality image. At night it fills the entire room (with all other lights off) with a soft ambient light. It's a joy to use my laptop through this projector. Would highly recommend this. Wish I got it sooner.",
      "rating": 5.0,
      "verified": true,
      "author": "Seraphim",
      "helpful_votes": 0,
      "publication_date": 20160727
    },
    {
      "title": "Its an awesome projector. I love seeing Movies using this projector",
      "text": "I have this from past two years. Its an awesome projector. I love seeing Movies using this projector. They are really great. At this price, they look great. I agree, some times, i feel that the color is little washed out. But I am ok with that as you will not observe so much. Trust me, you will not be disappointed. I am using a Projector screen though. It might look washed out on a wall or on a cloth. If you have light in the room, then the image quality will drastically go down. This might be expected for this I guess. But with all the lights off, the quality is amazing.",
      "rating": 5.0,
      "verified": true,
      "author": "Vijay",
      "helpful_votes": 0,
      "publication_date": 20160707
    },
    {
      "title": "Exactly What I Had Hoped For",
      "text": "We love this! It has a wonderfully clear and colorful picture, even in daylight, and it works great with my Amazon fire stick. I really debated upgrading to this from an older, non hd projector, but now I am super glad I did. The speaker is not great--not that I expected it to be, but ordered an cable to hook it up to our stereo and now movies are a great experience. By the way, this is the cable I purchased on Amazon for the stereo--I wish I had known to purchase this when I bought the projector:",
      "rating": 5.0,
      "verified": true,
      "author": "WBS",
      "helpful_votes": 0,
      "publication_date": 20141224
    },
    {
      "title": "Optoma HD141X",
      "text": "I wanted to add a projector for my soon to be HT room. After exhausting searching reviews I opted for the HD141X. Being my first projector, I can't really compare the. 141 to other brands. But.... I'm a big fan of plasmas for deep blacks and film like PQ. While this DLP dosent quite get there, it has high lumens and a pretty good picture for the price point not to mention being full 1080 and 3D what else could you ask for. I Would have preferred the connections on the rear of the unit, but I can deal with them on the side. Would I buy this projector again, or recommend this projector? Yes to both.",
      "rating": 4.0,
      "verified": true,
      "author": "Frank W. Bailey",
      "helpful_votes": 0,
      "publication_date": 20160314
    },
    {
      "title": "Great bang for the buck",
      "text": "Its amazing you can get a 1080p 3000 lumen 3d projector for less than $600. This baby is bright, sharp and the 3d is pretty good. I have it paired with incredisonic dlp link glasses. The 3d is good, not mindblowing, but good. Since the resurgence of 3d, only avatar in imax has really impressed me though. The remote is quite bright. It has a slew of features. Edge masking, manual and digital zoom, digital shift, keystone correction, etc. Unlike most projectors it has its inputs on the side. Its not the cleanest setup having my wires stick out the side and not the back, but its a small trade off for this much projector for the money",
      "rating": 5.0,
      "verified": true,
      "author": "SW2",
      "helpful_votes": 0,
      "publication_date": 20150223
    },
    {
      "title": "Great, will buy again if mine ever breaks (3 years and counting)",
      "text": "Perfect. I never had an issue with this thing. Even at 110\" the picture is bright and crystal clear. I do recommend blackout curtains for your living room if you're going to use this. It can't compete with the sun. This plus a dedicated projector screen beats a TV any day of the week, in awesomeness, size, and price.",
      "rating": 5.0,
      "verified": true,
      "author": "Bartley Fouchard",
      "helpful_votes": 0,
      "publication_date": 20170913
    },
    {
      "title": "Life-changing.  TVs are pointless.",
      "text": "I haven't owned a projector since the early days of projectors a decade ago. My last one weighted approximately the same as a VW Bug. The technological advances in newer projectors are incredible. They are small, bright, quiet, cheap, and generally make paying for movies at a theater obsolete. At this price-point, nobody is currently beating the Optoma HD141x for general product and image quality. The picture is incredibly clear, setup is easy, the image is bright enough to be seen during the day (though drawing the shades will make a huge difference).",
      "rating": 5.0,
      "verified": true,
      "author": "Esau",
      "helpful_votes": 0,
      "publication_date": 20141222
    },
    {
      "title": "It don't need no stinkin' review!!!!!  lol",
      "text": "Review? This thing doesn't need a review! It flat blew me away!!! I hooked it to my PC and sat in my chair for 10 minutes just being amazed at how clear and sharp it looked in my living room. I would buy another in a heartbeat, and two of my friends bought one after they saw mine. Update: May 2020 I hit the lottery with this thing. Now going on 6 years and it still looks great. After 6 years I'm guessing the bulb is going to need replacing soon but it still projects a great image. If and when it bites the dust, I'll probably buy another one. I'm super happy with this one.",
      "rating": 5.0,
      "verified": true,
      "author": "JD Jones",
      "helpful_votes": 0,
      "publication_date": 20141211
    },
    {
      "title": "Extremely pleased",
      "text": "Very easy to set up and great picture quality. The photo I posted was during the middle of the day and although the quality is understandably better at night, I can comfortabley watch or play something even during midday! My main worry was where to put it because there is a ceiling fan directly in the spot I would have to hang the projector to project the images in the precut space in my master bedroom wall, but I was able to buy an ottoman and place it on top of it at the foot of my bed, and hide the cords underneath the bed too; Apple TV also works great with it!",
      "rating": 5.0,
      "verified": true,
      "author": "Stacie",
      "helpful_votes": 0,
      "publication_date": 20160604
    },
    {
      "title": "Perfect for any occasion, very bright!",
      "text": "Awesome projector and well worth the money! I've done it all... watched movies, played video games, and sports. Haven't come across any problems and can't think of one negative thing for this projector. Easy plug and play with two HDMI ports as listed above [no AV (red, white, yellow cord) ports]. It does get pretty hot right away, but that's obviously what it's supposed to do and I've had it on no more than 5 hours at a time and it's never over heated, nor did it show any signs of over heating. This product was very well packaged and arrived with no damage at all. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Nate",
      "helpful_votes": 0,
      "publication_date": 20141203
    },
    {
      "title": "Short-lived and Costly",
      "text": "Purchased the HD141X-DLP in April, 2016. Remote stopped working after around one year. In April 2019 the projector would not power up. No indicator lights. I replaced the bulb to find out it wasn't the bulb, although it was practically disintegrated. Alfred, a nice guy at customer service advised me to find a local repair shop or ship it in to check power supply and motherboard. ...Costly.",
      "rating": 1.0,
      "verified": true,
      "author": "J. ACV2",
      "helpful_votes": 0,
      "publication_date": 20190616
    },
    {
      "title": "Works great good picture",
      "text": "Purchased for outside movie night. Works great good picture. 100 inch white screen wish I would have gotten a larger screen. The picture quality is that good. It's hard to see the movie in full daylight. As soon as it's in the shade or dusk it's viewable. By nightfall it's amazing. Some people said the fan was loud at quiet moments. Don't even notice it, nature is louder. It's speaker works fine for small groups. Works so well my kids have taken to watching moves on their textured bedroom wall. Update: purchased a 10'x20' white tarp @ Fred Meyers still get excellent picture. Tarp worked but need to remove the gloss.",
      "rating": 5.0,
      "verified": true,
      "author": "trees",
      "helpful_votes": 0,
      "publication_date": 20160506
    },
    {
      "title": "Optoma HD141X 1080p 3D DLP project works great, I've had it for about a year now",
      "text": "Optoma HD141X 1080p 3D DLP project works great, I've had it for about a year now. makes a great picture is true 1080p, I bring this out for all major family events, the fan on this unit is not loud but does run hot. it dos have a built in 10watt speaker. but you can hook this up to a surround sound or sound bar for your home theater magic, only thing that this projector is missing is the horizontal keystone so you can offset this unit to the side. over all great quality and great picture",
      "rating": 5.0,
      "verified": true,
      "author": "Nathan M.",
      "helpful_votes": 0,
      "publication_date": 20170713
    },
    {
      "title": "Best entertainment purchase made yet",
      "text": "I set this up in the basement to watch movies on. Its currently hooked up to both an XBOX1 and our XFINITY cable. The picture is amazing and extremely clear. Its easy to adjust the picture to the size you need it, and it only takes about 30 sec before its fully ready to start watching your picture on it. I built my own screen and it works perfect for this set up. You'll have to buy the mount if youre going to suspend it, and make sure you buy the right one... I bought the VideoSecu mount and it was a pain to make work. I would steer clear of that one.",
      "rating": 5.0,
      "verified": true,
      "author": "Stringer",
      "helpful_votes": 0,
      "publication_date": 20151013
    },
    {
      "title": "Fantastic Home Theatre Projector!",
      "text": "We were looking for a replacement for a TV and I looked for days and days, even ordered a projector and it shipped and had to send it back, and finally decided on this one. Brightness is stellar for the price, definitely is high definition and up to 300\" looks great. Even with a blank white wall looks good! I was really excited for the 2 HDMI ports and we're glad we went with one that has it. Puts out some heat but mount or self high and it isn't bad at all. Good picture, nice unit, easily replaces a TV! You'll love this purchase for the price!",
      "rating": 5.0,
      "verified": true,
      "author": "kdb",
      "helpful_votes": 0,
      "publication_date": 20141106
    },
    {
      "title": "Best bang for your buck!!!",
      "text": "This is a perfect projector if ur on a budget, this is def the best bang for your buck. I've had it for a few months, watch sports, movies, and have PS4 connected to it and it's just like playing on a ultra HDTV. I was scared at 1st but after reading a lot about the Optoma HD141X I tall u I made the perfect decision. I have it mounted on ceiling and did the install and calibration myself on a 120\" screen. Super easy.",
      "rating": 5.0,
      "verified": true,
      "author": "Santos Boyz",
      "helpful_votes": 0,
      "publication_date": 20161230
    },
    {
      "title": "Projector great... packaging well another story",
      "text": "This projector is the best value for the price considering my requirements. The unit was delivered on time but the packaging was a disappointment for amazon's usual high quality. The manufacturer's box was placed in a very large outer box and only had a single crumpled brown packing paper for protection. While the inner box was not damaged as the outer, I am concerned that the unit was subjected to excessive rough handling and will show up in shortened component life. The projector has delivered what was promised and well worth the money. Matching the projector to your usage is the most important step to avoid disappointment",
      "rating": 4.0,
      "verified": true,
      "author": "Samuel Willcox",
      "helpful_votes": 0,
      "publication_date": 20160718
    },
    {
      "title": "Awesome product, great picture and clarity",
      "text": "Awesome product, great picture and clarity. I have a friend who has a home theater company he owns. He was doing the installation for my \"mancave\" tags about 1500 square feet. The projector his company recommended for the size screen i wanted was around $1300 bucks. He sent me to amazon to find this one. After shipping and protection plan I spent a little over 600 bucks! I am using this for a 12 foot diagonal screen in mid lighting and it works great. I will update with pics and review when completed!",
      "rating": 5.0,
      "verified": true,
      "author": "jerry",
      "helpful_votes": 0,
      "publication_date": 20151108
    },
    {
      "title": "This projector is amazing!!",
      "text": "I have this set up in my basement projecting on a 10.5 foot section of white paint on the wall and use it all the time. Everyone that sees it loves it and wants to watch a movie in this mini theater. This projector is amazing!! You can tweak every setting I can think of, the remote is super bright and glows a slick blue and the lamp is on 350+ hours so far without a problem. If I was going to buy another projector, it would be this exact same one.",
      "rating": 5.0,
      "verified": true,
      "author": "H",
      "helpful_votes": 0,
      "publication_date": 20170127
    },
    {
      "title": "Failed in 14 months. Loud.",
      "text": "The unit produces very good hd quality. But it is very loud. My projector's dpl color wheel broke and ruined the projector. Of course it failed 2 months after the 1yr warranty had elapsed. I would only buy one again as long as I could also get an extended warranty on it.",
      "rating": 2.0,
      "verified": true,
      "author": "Scott A. Jones",
      "helpful_votes": 0,
      "publication_date": 20170912
    },
    {
      "title": "Great value!",
      "text": "Great projector. Very light! To get the best picture quality with minimal color washout, make sure the room is as dark as possible. During the day, I watch it with the shades and blunds open and there is a significant color washout, so I close the blinds and shades if it gets unbearable. Projector is pretty quite, but will heat up the room after several hours of viewing if you do not have good circulation. I am more than happy with this purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "Victor F.",
      "helpful_votes": 0,
      "publication_date": 20150924
    },
    {
      "title": "Awesome Projector. I was always against getting a projector ...",
      "text": "Awesome Projector. I was always against getting a projector because I have only been exposed to low quality projectors or high priced ones that are on a college campus. My brother bought this projector first and the first time I visited him and saw it I immediately ordered mine. It has been incredible. The only problem is that going to a movie theater just isn't as exciting when you have a theater at home.",
      "rating": 5.0,
      "verified": true,
      "author": "Jordan Leszczynski",
      "helpful_votes": 0,
      "publication_date": 20170112
    },
    {
      "title": "Broke - 9 months and 2000 hours in",
      "text": "Great value for the money. Haven't had a problem.. EDIT - 6/16/16 - After about 9 months of use and less than 2000 hours (supposed lamp life of 6000 hours) the unit won't power on. I got a red 'bulb light' so I replaced the main bulb.... still wont power on. Optoma wants me to send it in and spend $125 to fix it. That would be fine except I live in the Caribbean and can't mail anything. Obviously this is a major hassle and now I'm just regretting this purchase. Look elsewhere for a reliable projector",
      "rating": 2.0,
      "verified": true,
      "author": "DougieDougDoug",
      "helpful_votes": 0,
      "publication_date": 20151210
    },
    {
      "title": "Absolutely amazing projector. I replace a 10 year old Optoma ...",
      "text": "Absolutely amazing projector. I replace a 10 year old Optoma with this newer model. It's like being at the movie theater! I'm so glad I bought it. The only problem vs my old one is the zoom feature. My old one got much smaller. This one is huge! I have it about 13' from the wall and the image is massive. Had to do some tweaking. The colors are phenomenal! If you're thinking about it, just do it!",
      "rating": 5.0,
      "verified": true,
      "author": "Brian",
      "helpful_votes": 0,
      "publication_date": 20150717
    },
    {
      "title": "Fantastic picture quality",
      "text": "Fantastic picture quality. We use it to show football games outside, and people always compliment the quality of the picture",
      "rating": 5.0,
      "verified": true,
      "author": "Brian",
      "helpful_votes": 0,
      "publication_date": 20180530
    },
    {
      "title": "Are there better projectors out there",
      "text": "Are there better projectors out there? Probably. Are there better projectors out there for this price? Definitely not. This projector looks amazing. I've had so many compliments on the picture especially considering the size (set up mine at 120 inch screen). The 3D is awesome on such a large screen. It's like having a movie theater in your home. Would recommend to anyone who is looking for a projector but doesn't want to spend an arm and a leg. You won't regret this buy!",
      "rating": 5.0,
      "verified": true,
      "author": "Allison and Gary",
      "helpful_votes": 0,
      "publication_date": 20151226
    },
    {
      "title": "Great projector but the bulb will have to be replaced.",
      "text": "Great projector. Only complaint is the bulb blew at only 4100 hours. The replacement bulb cost $90 and I bought it on Amazon (EWO'S BL-FP190E/SP.8VH01GC01 Projector Lamp Bulb). It was plug and play, but hoped the original bulb would have lasted at least 5000 hours.",
      "rating": 4.0,
      "verified": true,
      "author": "D-Rock",
      "helpful_votes": 0,
      "publication_date": 20171229
    },
    {
      "title": "Very Nice!",
      "text": "For the price this has been awesome! At 110\" projection size you can see pixelation, but the color and light levels are great. This is my first projector, I use it for a basement movie/game space. I can have the window blinds open and the lights on and still can see the picture well enough for games and movies. Works great with Xbox one, wii u, receiver and cable. Mario kart with 4 player split is sweet!",
      "rating": 5.0,
      "verified": true,
      "author": "joel",
      "helpful_votes": 0,
      "publication_date": 20160717
    },
    {
      "title": "Used daily for several hours. I use it as a TV replacement.",
      "text": "Excellent product. Very bright. Not too loud. Speakers are ok for what they are. I would buy it again if I had to. Edit: 3 1/2 years later. 3000 hours on the lamp still bright Still producing a good picture. Seems to be a bit louder than I recall when first purchased. Also seems to be quite hot. Used daily for several hours. I use it as a TV replacement. 11 feet = 106 inch display I use the Optoma BM-5001U Low Profile Universal Ceiling Mount Fire Stick, Soundbar and Kodi. Perfect for me.",
      "rating": 5.0,
      "verified": true,
      "author": "EW",
      "helpful_votes": 0,
      "publication_date": 20151116
    },
    {
      "title": "Great home theater projector.",
      "text": "This thing rocks. Had it for over a year now with zero problems. I play movies off my ipad and computer when we do outdoor theater nights all through the summer. I did go out and buy a soundbar given the internal speaker is weak and quiet, but then again, im pretty sure it was never meant to be used.",
      "rating": 5.0,
      "verified": true,
      "author": "Goodwin",
      "helpful_votes": 0,
      "publication_date": 20171024
    },
    {
      "title": "Best bang for your buck projector",
      "text": "I built a home theater in my basement and wanted a projector to watch movies and play video games for the lowest cost. I've had it a year now and there are no problems to speak of. I have a 10' screen set up but I believe it can project up to 25' wide. The picture quality is great, its not 4K, but for most applications HD 1080p is enough. I have it set up with a pioneer receiver and 5.1 Yamaha sound system, and for around $1000 I have a amazing home theater system. Set up is simple just plug in the power cord and HDMI input and you're ready to go.",
      "rating": 5.0,
      "verified": true,
      "author": "Adam Chrostowski",
      "helpful_votes": 0,
      "publication_date": 20170712
    },
    {
      "title": "With a 10 foot rear projection screen I was amazed at the quality of the picture",
      "text": "With a 10 foot rear projection screen I was amazed at the quality of the picture. Works great for my outdoor theater application.",
      "rating": 5.0,
      "verified": true,
      "author": "JEH",
      "helpful_votes": 0,
      "publication_date": 20180719
    },
    {
      "title": "Decent Projector.",
      "text": "This projector is pretty good, its my first projector and i am amazed by the display quality even projecting on the wall. its pretty good theatre experience at Home. for my room with throway distance of 15 feet I got a 100\" display on the wall. the display is viewable even with normal day light in my room. Very easy to setup. and easy to use with my bose lifestyle home theater system. I bought this Instead of getting a 80\" sharp led tv.",
      "rating": 4.0,
      "verified": true,
      "author": "praveen",
      "helpful_votes": 4,
      "publication_date": 20141123
    },
    {
      "title": "Highly Recommend, movies, games, sports",
      "text": "amazing picture quality, only downfall is that it does not have enough keystone correction to have a downward throw. I simply built a shelf with and with some raisers (pieces of wood), I flipped it upside down. Works great, this is my 4th projector and favorite so far. I bought through amazon warehouse, used. It seems to be working well so far. Highly recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Tyler McCarthy",
      "helpful_votes": 0,
      "publication_date": 20150604
    },
    {
      "title": "This is wonderful for the price",
      "text": "This is wonderful for the price. I had an Epson EX7220 for $600 at Best Buy, which was 720p, but sadly what I gained in resolution I lost in color \"vibrancy\", I could instantly tell the color was much more limited. But after some tweaking and time to forget, I don't notice this anymore. Would still recommend this, but you'd probably be better off shelling out a bit more if you're looking for flawless",
      "rating": 4.0,
      "verified": true,
      "author": "Curtis",
      "helpful_votes": 0,
      "publication_date": 20150629
    },
    {
      "title": "Very good way of viewing digital at home",
      "text": "very good image quality after several months of use....3D has been tested and is quite amazing...mostly use this with blueray rentals. input is only thru HDMI if that is a problem....I view on a 6 foot projector screen from my old film based photography days. Keystone control is an interesting plus.",
      "rating": 5.0,
      "verified": true,
      "author": "Solojourney",
      "helpful_votes": 2,
      "publication_date": 20150714
    },
    {
      "title": "Great projector, get it now!",
      "text": "This is my first projector purchase and I'm am so happy with this product! The image is beautiful and it plays 3D content perfectly! I now watch all of my movies in 3D, it's so much better! I also have my game systems attached to it and the performance is flawless in 2D and 3D modes! I'm so glad I got this instead of a traditional TV! I also have a Minix Neo Android TV Box attached to the Optoma and stream videos from my own cloud drive and it works great!",
      "rating": 5.0,
      "verified": true,
      "author": "D. Hathaway",
      "helpful_votes": 0,
      "publication_date": 20150218
    },
    {
      "title": "This is the best purchase i've made in a long time",
      "text": "I can't say enough about this projector. This is the best purchase i've made in a long time. The only drawbacks i can see are that it needs to be dark to get the full experience (especially for 3d) and i think there's no regular old rca or cable hookup (hdmi only). If you have a good space with no windows this makes the perfect home theater. I used flat interior \"classic silver\" paint on the wall and i get about a ten foot wide screen. I also use a ps4/ps3 (built in 3d blu ray player) and ultra clear dlp link glasses. Like i said, this was a great purchase, and i love movies.",
      "rating": 5.0,
      "verified": true,
      "author": "cletus",
      "helpful_votes": 0,
      "publication_date": 20160523
    },
    {
      "title": "Out of order within a month",
      "text": "I bought it as a gift for my mom and brought it back to China. However, it was out of order in a month. And the warranty does not cover the shipping fee and can not provide service in China, though it was made in China. I was utterly disappointed. I read the instruction and warning carefully and absolutely used it in the right way, and I paid more than $600 on a flimsy product. I'll never buy it again!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Tom Hu",
      "helpful_votes": 5,
      "publication_date": 20150615
    },
    {
      "title": "Great 3D experience",
      "text": "This projector is amazing for the price. I used it to replace a ten year old projector that cost twice as much. The picture quality and 3D are amazing. I opted for the cheaper Estar America ESG600 glasses and RF Emitter. So far so good. The only annoying thing was the menu selection to flip the image from table top to ceiling mount is buried in the on screen menu and of course I had already mounted the thing so I had to fish through it upside down. Also, you need to make sure your hdmi cable is the newest hdmi 1.4a for best 3D",
      "rating": 5.0,
      "verified": true,
      "author": "Nathan K",
      "helpful_votes": 0,
      "publication_date": 20141207
    },
    {
      "title": "Buy it! And the 3D emitter.",
      "text": "It is a great projector. I have a 15 ft wall and it covers the whole thing from about 20 ft away. I wish they were more clear about the projector requiring a separately purchased 3D emitter, and proprietary glasses. Just buy the optoma BC300 (?) emitter, and the zf2300 glasses. Don't waste your time and money trying to get another combination to work. 3D requires the emitter purchased separately! It looks fantastic though. The fan gets a little loud, but I've never had another projector to compare it to.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard Murta",
      "helpful_votes": 0,
      "publication_date": 20150830
    },
    {
      "title": "The quality of the picture is awesome. I really like the built in 3d option ...",
      "text": "This is the first projector I have ever owned. The quality of the picture is awesome. I really like the built in 3d option as well. The only thing I wish it had was a further zoom in and out capability, it doesn't give much distance, size change capability.",
      "rating": 5.0,
      "verified": true,
      "author": "Sean",
      "helpful_votes": 0,
      "publication_date": 20160702
    },
    {
      "title": "I have had two different Optoma models and have loved them until they break",
      "text": "I have had two different Optoma models and have loved them until they break. Each one was sent in for out of warranty repairs, new bulbs at $180 each, etc. Plan on fixing or replacing every couple years if this is your main tv.",
      "rating": 1.0,
      "verified": true,
      "author": "sstockfo",
      "helpful_votes": 0,
      "publication_date": 20180702
    },
    {
      "title": "good picture / misleading bulb life",
      "text": "the picture is good, much better than the led projectors I had before it. It was advertised as having up to an 8,000 hour life on the bulb, I have just over 1,600 hours on the bulb and it is currently unwatchable, I was hoping that spending over $500 dollors would finally get me a projector that would last at least a year. It was the cheapest DLP projector i could find, and it looks good, but if you buy it you might want to get an extra bulb to go with it.",
      "rating": 3.0,
      "verified": true,
      "author": "Ryan P.",
      "helpful_votes": 0,
      "publication_date": 20170415
    },
    {
      "title": "By far the best purchase I have ever made",
      "text": "By far the best purchase I have ever made. This projector has a great picture quality and is essential to any home theater set up. My only complaint is that the sound quality from the internal speaker leaves something to be desired. If you have a home theater sound system this issue won't be a problem for you.",
      "rating": 4.0,
      "verified": true,
      "author": "Joshua",
      "helpful_votes": 0,
      "publication_date": 20161129
    },
    {
      "title": "I'm glad I did the research and decided on this model",
      "text": "I'm glad I did the research and decided on this model. easy to use, easy to install and works great. I paired it with the Vivo 100 inch screen and the Ultra-Clear HD 144 Hz DLP link 3D glasses and the results are awesome. Crystal clear and great 3D depth. Even when I watch regular TV during the day, the sunlight that comes thru the window barely changes the display on the screen. I would definitely buy this product again and the price was right.",
      "rating": 5.0,
      "verified": true,
      "author": "Darren M.",
      "helpful_votes": 0,
      "publication_date": 20151222
    },
    {
      "title": "great picture",
      "text": "Upgraded to this from an Epson ex5210, this is my 3rd projector and is working great for video games, movies & TV. Some have complained about fan noise, but I haven't noticed much a difference. At 20' back I'm throwing around a 180\" image on to a wall and it looks great. I almost purchased a BenQ for $300 more, but took a shot on this and I'm glad I did",
      "rating": 5.0,
      "verified": true,
      "author": "BucBearPig",
      "helpful_votes": 2,
      "publication_date": 20151113
    },
    {
      "title": "Fantastic projector.",
      "text": "This projector has amazing image quality and a nice quiet fan. The fact that it has a 3.5mm out port is really nice, because then I can use headphones with it, and not worry about waking anybody up in my house. The 2 HDMI ports are a plus, since I did not have to buy and HDMI switch for this projector. The focus and zoom are very sturdy and easy to use, and the keystone correction is VERY powerful. I mostly use this projector in the dark, however I have used it a few times in the sunlight (with my windows open) and I was surprised at how bright it still was.",
      "rating": 5.0,
      "verified": true,
      "author": "Nathan Rhodes",
      "helpful_votes": 0,
      "publication_date": 20150804
    },
    {
      "title": "GREAT BUY",
      "text": "In spite of all the reviews I read before purchasing - the bottom line is I've always loved the Optoma hardware - maybe not the bleeding edge but for the price you cannot beat their gear. Was looking for an HDMI 1.3 or higher compliant device and two inputs which is nice and the picture is fantastic. Using with Cinematic and Dynamic Black and awesome picture. No surprises and easy setup. Had to mount mine upside down to fit the screen - but works great (had to do the same with the previous projector also.",
      "rating": 5.0,
      "verified": true,
      "author": "TIM_IA",
      "helpful_votes": 0,
      "publication_date": 20141224
    },
    {
      "title": "For the price this projector is excellent. High 1080p native resolution",
      "text": "Not sure what I can really add to the existing reviews. For the price this projector is excellent. High 1080p native resolution, good brightness and color. Added bonus of decent sound quality from the projector itself. There is some \"rainbow effect\" but that will be true of any one chip DLP projector and any 3 chip DLP is going to be MUCH more expensive. 5 stars!! Edit: 250 hours of use in and still working great. I have had quite a few friends over to watch outdoor movies on a 110 inch screen and everyone agrees it looks great and provides a real feeling of being at the cinema.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Dial",
      "helpful_votes": 0,
      "publication_date": 20160512
    },
    {
      "title": "Great but fragile.",
      "text": "This is a great projector which works well with a bright presentation in a lighted conference room. My only issue is that the adjustable feet are weak. One broke off right away even though it was packed in it's packaging in my suitcase. It's now hung from my ceiling as a part of my home theater.",
      "rating": 4.0,
      "verified": true,
      "author": "Jeff Powell",
      "helpful_votes": 0,
      "publication_date": 20151226
    },
    {
      "title": "Love the Optoma HD141X",
      "text": "Its been a year now and I still love this thing. Watching blu rays on it is just as good as being in the theatre esspecaily when paired with a 120 inch screen, the only thing that's missing is the 30 dollars of soda, popcorn and candy. Gaming with an Xbox one is also a great treat. I can't say I have utilized the 3d aspect of this machine yet but will do so soon.",
      "rating": 5.0,
      "verified": true,
      "author": "Everything Tech",
      "helpful_votes": 0,
      "publication_date": 20160803
    },
    {
      "title": "... had this for about 3 months now and we love it. Ithe has become our main TV and ...",
      "text": "All I can say is awsome Have had this for about 3 months now and we love it. Ithe has become our main TV and sits right in our living room. We have a 110 inch projection and the clarity of amazing. I know there are better projectors out there but with that you have to spend more. If you are looking for a projector in this price range get the optoma it won't dissipoint.",
      "rating": 5.0,
      "verified": true,
      "author": "S.H",
      "helpful_votes": 0,
      "publication_date": 20160731
    },
    {
      "title": "2 years of CONSTANT running you have to replace the bulb for $65. Amazing product!",
      "text": "I used this HARD. Played xbox movies whatever all night pretty much since I bought it and it performed perfectly. No backdrop needed in my opinion. (depends on your wall color) After 2 years of this abuse the bulb needs replacing but it’s only $65 for another 2 years basically constantly on. Sound is a bit too loud since it’s near my head but I hooked up a speaker for better sound anyway. Amazing product for the price",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180511
    },
    {
      "title": "Awesome picture and great durability",
      "text": "This has been an awesome projector. We have had it for 2 years now with constant use and still have not had to change the bulb. the picture is great and the room doesn't even have to be dark in order to be able to see the screen. I would definetly suggest this as a great buy. I picked it up for 550 and at that price it was an absolute steal.",
      "rating": 5.0,
      "verified": true,
      "author": "Jonathan Heslet",
      "helpful_votes": 0,
      "publication_date": 20180417
    },
    {
      "title": "Only lasts a couple of years",
      "text": "Had it for barely two years and both HDMI ports stopped working. Optoma charges nearly 80 bucks just to take a look at it plus another 300 or so to fix it. Might as well just buy a new one but breaking after 2 years is a joke.",
      "rating": 1.0,
      "verified": true,
      "author": "Jon Mickelson",
      "helpful_votes": 3,
      "publication_date": 20171102
    },
    {
      "title": "Best quality for the price",
      "text": "Man cave must have. Can't beat price for this kind of quality. Use it for sports and movies a few hours a week. Still going strong. Everyone is impressed",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190102
    },
    {
      "title": "I am a pretty harsh reviewer and I can't find flaws in this ...",
      "text": "I researched projectors for two months before I went with this one. This unit is absolutely incredible. I am a pretty harsh reviewer and I can't find flaws in this system. When it came I set it up on the wall and used its enternal speakers. I have a a Harmon system I bought for it, but out of the box this system has an amazing quality speaker that's as good as my curved Samsung tv. Of course I don't use the integrated speaker, but it just goes to my point that this is an outstanding system.",
      "rating": 5.0,
      "verified": true,
      "author": "Russell",
      "helpful_votes": 0,
      "publication_date": 20150214
    },
    {
      "title": "Why Do People Still Own TVs? All you need is this!!",
      "text": "I have had this for quite a few months now. I moved into my first house and am using the projector instead of a TV. We set it up in my basement and put sheet rock up on a wall and painted it white (I researched online for a good paint). It's amazing. Anytime someone comes over they say they want to get one. I mean, a TV this big would be about $10,000! Who wouldn't want one? Why do people own TVs anymore?!",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda F",
      "helpful_votes": 0,
      "publication_date": 20150822
    },
    {
      "title": "Overall a good value, but fan noise is becoming a problem",
      "text": "I use this projector in a basic home theater setup with an approx 80\" diagonal screen. Purchased to replace an aging benQ 720p projector. Pros: Allows locking of input to HDMI (prevents delay/timing issues when used with an HDMI receiver). Very bright. Good color. Low latency. Cons: Very small throw adjustments (Required building a new mount closer to the screen than my previous projector). Fan noised has increased dramatically since purchase. This is becoming a larger problem. Eco vs Normal does not solve it. Unlike others, I haven't seen flickering in eco mode, but all dynamic features are disabled.",
      "rating": 3.0,
      "verified": true,
      "author": "Fluffyp",
      "helpful_votes": 0,
      "publication_date": 20150720
    },
    {
      "title": "We love it. Movies just like a movie theater.",
      "text": "Great picture when connected to bluray player for movies in the home movie theater. Plenty of light in the economy mode for our basement-based home theater. Liked how easy it was to set up. Like how easy it was to change to ceiling mount and adjust the keystone. Ours is mounted about 18-feet from the screen and the picture projection size is about 155-inches diagonally. Great experience.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Brown",
      "helpful_votes": 0,
      "publication_date": 20160103
    },
    {
      "title": "A THEATER-SIZE SCREEN IN YOUR HOME",
      "text": "Don't think about it---just do it. It's every bit as good as Blu-ray, but bigger. Much bigger. If you've ever wondered about a projector but aren't sure about the quality of the picture, wonder no more. Not only is the picture excellent, but it's portable and size-adjustable, meaning you can use it anywhere you have a white surface.",
      "rating": 5.0,
      "verified": true,
      "author": "SouthSideShorty",
      "helpful_votes": 0,
      "publication_date": 20150727
    },
    {
      "title": "Nothing but issues",
      "text": "I purchased from Amazon Warehouse which might be the issue. However I've had nothing but issues. The HDMI signals randomly cut out, I have frequent HDCP errors despite changing cables, etc. The sound randomly cuts out. It's not the first time that I've tried to save money and had issues with a product from Amazon Warehouse though. It could be an Amazon quality control issue.",
      "rating": 2.0,
      "verified": true,
      "author": "Prime_Addict77",
      "helpful_votes": 0,
      "publication_date": 20160129
    },
    {
      "title": "I could not be happier. This thing has a AWESOME picture and does ...",
      "text": "After much research and wringing of the hands, I replaced my burned out $6,000.00 JVC projector with this unit. I could not be happier. This thing has a AWESOME picture and does not degrade when ambient light hits it. Hey I can even read a book while watching TV now. Super easy to install and set up. Technology has come a long way since I bought the JVC. Don't be afraid of the low price, it's a bad to the bone little machine.",
      "rating": 5.0,
      "verified": true,
      "author": "Roy Clint",
      "helpful_votes": 2,
      "publication_date": 20151117
    },
    {
      "title": "I love it so much.",
      "text": "Had it for a year now and if I could only save 2 things from my apartment during a fire, this projector would be one of them. Dec 2017: Still love it, no issues, making my girlfriend reorganize her apartment so I can put use there. Aug 2020: still wonderful and no issues. Been using it daily except for in 2019 when I had it stored.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott L.",
      "helpful_votes": 0,
      "publication_date": 20170516
    },
    {
      "title": "It was easy to set up",
      "text": "I use this projector at home and for presenting slide shows and videos at banquet halls. It was easy to set up, the sound is good and quite loud, and most importantly the picture is sharp and bright. The controls and remote are mostly intuitive which is a good thing because the manual is on a CD that I couldn't not get to open on my computer. I like the keystone adjustment which corrects for alignment of the projector and screen. A good price for a good product.",
      "rating": 4.0,
      "verified": true,
      "author": "RonB",
      "helpful_votes": 0,
      "publication_date": 20160223
    },
    {
      "title": "Didn't Last",
      "text": "I am extremely disappointed in the longevity of this product. With fairly light use, the projector has gone through 1 lamp in this time frame, and now doesn't work at all. It attempts to start, then makes odd noises, then the lamp light turns red and the power light flashes red. This is not what I would have expected. Maybe I should have gone with a different brand.",
      "rating": 1.0,
      "verified": true,
      "author": "Katherine rafanelli",
      "helpful_votes": 0,
      "publication_date": 20171223
    },
    {
      "title": "Wow!",
      "text": "Just got this a week ago. Amazing picture. Have been testing all the great graphic movies. Avatar looked great!! 47 Ronin. Star Trek. Star Wars. Godzilla. All have looked amazing. The sound is good but we just added a sound bar. No problem. Easy to set up!! Will keep this posted if we have further updates. We are watching movies outside every nite now. :)",
      "rating": 5.0,
      "verified": true,
      "author": "Erika",
      "helpful_votes": 0,
      "publication_date": 20150728
    },
    {
      "title": "It is now to the point where we can no longer enjoy the theater system we have set up",
      "text": "I purchased this projector for my husband as a Christmas present. Within 6 months of using the projector the picture started to go out. It is now to the point where we can no longer enjoy the theater system we have set up. We attempted to get the projector fixed and after waiting three weeks we were told the part we needed was on back order for an indefinite amount of time. I just purchased this projector again in hopes we have better luck this time. I would have purchased a different model however I know all our existing equipment will work with this particular module. I really hope we do not have to replace in another six months.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160715
    },
    {
      "title": "Amazing quality and performance for the price.",
      "text": "Amazingly bright, crisp, and very accurate color and picture. I am absolutely amazed. The menu interface is easy to use, the 3D is accurate and awesome, and for me, most importantly there is no forced overscan! You see and get all 1920x1080 pixels. You can, if you want make it \"zoom\" in like overscan, but why?? This is simply a great projector for the price you pay.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20150903
    },
    {
      "title": "Great Budget Projector",
      "text": "Great Projector. Previous LG projector I had worked great, but I wanted to upgrade to a full hd projector with a small budget since I had just purchased a new home. I was blown away by the quality of the Optoma HD141X. I haven't tested the 3d features just yet, but I have used it alongside my Onkyo receiver and everything runs and looks great. The mounting holes seem to have a strange layout(my first optoma projector so this may be normal) but I was able to adapt my current mount. Doesnt get to hot when mounted, and isn't to loud.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Cole",
      "helpful_votes": 0,
      "publication_date": 20150805
    },
    {
      "title": "great proyector. good picture quality",
      "text": "bulbs don't last very long if used continuously. great proyector. good picture quality. not so good for gaming",
      "rating": 4.0,
      "verified": true,
      "author": "Angel Cortes",
      "helpful_votes": 0,
      "publication_date": 20180401
    },
    {
      "title": "Good product, loud fan noise.",
      "text": "I didn't give it 5 stars because the fan speed/noise is variable and can be loud and annoying at times. I would prefer to manually set the fan at a constant intermediate speed not available in settings. Otherwise, the HD141x works great and produces a sharp, clear, bright picture. The 3D is amazing and makes watching movies fun again.",
      "rating": 4.0,
      "verified": true,
      "author": "hclinde",
      "helpful_votes": 0,
      "publication_date": 20160901
    },
    {
      "title": "Still running beautifully after 3 solid years",
      "text": "Just wanted to say that this projector is e BEAAST! Still running beautifully after 3 solid years. Have not had to replace the bulb or do anything to keep it running - even surviving two traumatic falls! I so recommend this guy.",
      "rating": 5.0,
      "verified": true,
      "author": "Jacob A. Ferrero",
      "helpful_votes": 0,
      "publication_date": 20171026
    },
    {
      "title": "Awesome!",
      "text": "Unbelieveable picture for the price, my friends cant believe it either. Movies look incredible. I made a 120\" screen and with some adjustments it looks even better than a movie theater screen. Very bright, can be seen even with the lights on. Hosted the superbowl this year and everyone was blown away. You wont regret this purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20160421
    },
    {
      "title": "The quality of the light is fantastic, but like many of the other reviews here ...",
      "text": "The quality of the light is fantastic, but like many of the other reviews here the projector does not turn off. After playing a movie the projector does not respond to the remote or to the buttons. The light nor the fan will turn off. Amazon has sent a replacement - but I'd steer clear of the product and buy one that has a better success factor",
      "rating": 2.0,
      "verified": true,
      "author": "David Jimison",
      "helpful_votes": 2,
      "publication_date": 20150413
    }
  ],
  "product_meta": {
    "title": "Optoma HD141X 1080p 3D DLP Home Theater Projector",
    "description": "Style:HD141XThe Optoma HD141X all-digital home entertainment projector is ideal for watching movies, TV shows, Sports and action-packed video games on screens up to 300\" diagonal. HD141X delivers high performance cinematic quality, HD 1080p video and produces a stunning 3000 lumens bright image with a remarkable 23,000:1 contrast ratio. Amaze your friends with fantastic image detail and superior color reproduction. Packed with advanced features, the Optoma HD141X will take your home entertainment to the next level: 2x HDMI ports, MHL compatibility, VESA 3D Sync port with full 3D compatibility for seamless integration with your favorite Blu-ray 3D player, Xbox, PS3, PS4 and other gaming consoles. It also has a powerful10-Watt audio, Dynamic black for enhanced black levels, 12V jack for motorized screen automation, back-lit remote, up to 6500 hours of lamp life and whisper quiet fan for maximum viewing enjoyment.",
    "rating": 4.4,
    "feature_bullets": [
      "Screen Size Range: 66-inches from 8 feet; 107-inches from 12 feet",
      "3000 ANSI Lumens",
      "Contrast Ratio: 23,000:1; Keystone Correction: Yes, Lens Shift: No",
      "1-Year Limited Parts and Labor, 90-Days on Lamp",
      "2 x HDMI (1.4a 3D support) + MHL v1.2, Audio Out 3.5mm, 12V trigger, 3D-Sync, USB service"
    ],
    "specifications": {
      "Brand Name": "Optoma",
      "Item Weight": "5.4 pounds",
      "Product Dimensions": "8.8 x 12.4 x 4 inches",
      "Item model number": "HD141X",
      "Batteries": "AAA batteries required.",
      "Is Discontinued By Manufacturer": "No",
      "Output Wattage": "10",
      "Color Name": "Black",
      "Special Features": "Speakers",
      "ASIN": "B00MK39P92",
      "Customer Reviews": "4.4 out of 5 stars1,372 ratings4.4 out of 5 stars",
      "Best Sellers Rank": "#742 in Video Projectors",
      "Date First Available": "August 28, 2014"
    },
    "categories": [
      "Office Products",
      "Electronics",
      "Video Projectors"
    ],
    "price": 1499.0
  }
}