{
  "website_summaries": [
    {
      "verdict": "This exceedingly popular hand sink works well for both commercial styles and in-home use.",
      "pros": [
        "Larger bowl size",
        "Includes faucet and turning handles",
        "Tall back splash",
        "Includes a basket strainer for draining",
        "Customers appreciated the easy turning handle design"
      ],
      "cons": [
        "Some buyers claimed their sink began to rust after time",
        "Faucet stems may need some extra work for installation"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Five Stars",
      "text": "Very nice produce exactly as expected. I installed this sink in my garage for hand washing. Perfect!",
      "rating": 5.0,
      "verified": true,
      "author": "Roy Brotherhood",
      "helpful_votes": 42,
      "publication_date": 20150618
    },
    {
      "title": "Comes in handy",
      "text": "Nice little sink added to the Man Cave Bar. Had to stop at home depot as expected. I purchased a drain pipe, two 90 degree angles, two male couplers (faucet inlets are horizontal) and two braided hoses and I was good to go. Took ten minutes to install.",
      "rating": 5.0,
      "verified": true,
      "author": "Geno",
      "helpful_votes": 21,
      "publication_date": 20160428
    },
    {
      "title": "Poor quality",
      "text": "The quality of this product is getting poor. I've been buying these sinks for a while and now they came with metallic paint and some blemishes. They suppose to be new! Nothing like the picture they have for display!",
      "rating": 1.0,
      "verified": true,
      "author": "Eddie",
      "helpful_votes": 6,
      "publication_date": 20190401
    },
    {
      "title": "The package arrived on time and in good shape. It looks just like the add",
      "text": "The package arrived on time and in good shape. It looks just like the add. I needed a smaller wash sink for limited space. This will work good. The fittings for the faucet go straight out the back. So, you either have to have clearance behind the sink, or stand the sink out a little from the wall. I was able to run flexible stainless water hoses through the wall to the sink. Kept the sink up against the wall.",
      "rating": 5.0,
      "verified": true,
      "author": "Blaine",
      "helpful_votes": 5,
      "publication_date": 20161030
    },
    {
      "title": "It looks good",
      "text": "This small sink is great for your small shop. It does the work that is meant for. The material is not that strong, but for the price, you can't ask for a better stainless steel. I'm going to install outside, so I will soon find out the durability of it. I will probably cover the inside part with some paint or other product just in case, to protect it from rust. Hopefully it will last years from now. Overall it seems to be a good quality sink, light weight, but sturdy.",
      "rating": 4.0,
      "verified": true,
      "author": "D Gonzalez",
      "helpful_votes": 0,
      "publication_date": 20200308
    },
    {
      "title": "Product looked nice, new",
      "text": "Product looked nice, new. But after few weeks, started to rust. not sure if truly stainless steel, or just painted.",
      "rating": 3.0,
      "verified": true,
      "author": "Bugs bunny",
      "helpful_votes": 6,
      "publication_date": 20170730
    },
    {
      "title": "maybe the quality is not the best",
      "text": "I have has this sink (professionally installed) for 4 months and probably turned the water on 3x/day.Now, 4 months later, the hot water handle no longer works. You can turn and turn and all you get is a slow stream of water. Cold water handle works perfect.Water pressure in adjoining room is perfect. Water in sink 6 feet away has perfect pressure. Not really sure what happened here, as the sink worked fine for the first 2 weeks.",
      "rating": 4.0,
      "verified": true,
      "author": "Sue Rubin",
      "helpful_votes": 0,
      "publication_date": 20191019
    },
    {
      "title": "Good for the price",
      "text": "The sink I received appeared to have been repackaged and was obviously sold previously and returned. The contents were fine and no damage. There were no installation instructions included ... just the sink and the faucet in a separate box. I went to Home Depot and purchased the necessary accessories for installation. I replaced an old (plastic) outdoor sink that was cracked and falling apart. It's now installed and works fine and looks nice.",
      "rating": 4.0,
      "verified": true,
      "author": "T. A. Walsh",
      "helpful_votes": 2,
      "publication_date": 20170412
    },
    {
      "title": "As described.",
      "text": "Was as described. Don't be put off by reviews that complain about the tight space behind the faucet--just spend a few minutes with someone at a plumbing supply house. I successfully mounted my sink on a masonry wall without having to cut into the wall to fit the supply lines.",
      "rating": 5.0,
      "verified": true,
      "author": "James Wetzstein",
      "helpful_votes": 10,
      "publication_date": 20160718
    },
    {
      "title": "Lesson Learned",
      "text": "The sink was perfect but the faucet was a generic no name and leaked upon installation.Tried to take out the stem on cold side. Was cross threaded from factory. Had to complete job so had to get one at a local plumbing supply house. Between disassembling the faucet, running to a supply house and reinstalling a new faucet ,probably cost me about $300 in lost labor and parts. More than I paid for the original sik and faucet originally. Lesson learned. Will leave it at that.",
      "rating": 1.0,
      "verified": true,
      "author": "Frank T.",
      "helpful_votes": 0,
      "publication_date": 20200224
    },
    {
      "title": "Super cool for use inside or out.",
      "text": "Works as advertised. I made a makeshift table for it because my wife didn't want me to hang it on the wall. \"I don't want you drilling into the granite!\" Anyway, it would have been really easy to hang if I had my way.",
      "rating": 5.0,
      "verified": true,
      "author": "M. W",
      "helpful_votes": 0,
      "publication_date": 20200504
    },
    {
      "title": "Terrible quality",
      "text": "Already broken purchase date March 7 today is July 16th? Really can someone contact me is there a warranty",
      "rating": 1.0,
      "verified": true,
      "author": "barajita",
      "helpful_votes": 3,
      "publication_date": 20180716
    },
    {
      "title": "The faucet fails in a short time. Keeping this ...",
      "text": "The faucet fails in a short time. Keeping this from moving around after installing on the wall is a problem because this is so light. When the sink moves, the drain pipes become loose and will start to leak. I had to drill holes on the side to screw this onto the wall to it from moving. The mounting features can be improved.",
      "rating": 3.0,
      "verified": true,
      "author": "The Man",
      "helpful_votes": 0,
      "publication_date": 20180809
    },
    {
      "title": "Quality product",
      "text": "Quick delivery, easy installation. Good quality product. Update! 2nd one I ordered for our restaurants! Easy to install and works great! Update to my update... hot water handle isn't working... uuugh... waiting for seller to contact me. Update again! Back in business! They sent out a complete new faucet! Working great! Prompt response and prompt delivery!",
      "rating": 5.0,
      "verified": true,
      "author": "Kim Nicholson",
      "helpful_votes": 0,
      "publication_date": 20180214
    },
    {
      "title": "What you are looking for",
      "text": "Proper hand sink and faucet combo. Meets all codes. If you are looking for a restaurant grade handsink. This is it. Price is inline with any wholesale distributors and shipped free to your door. Simple.",
      "rating": 5.0,
      "verified": true,
      "author": "Tanner",
      "helpful_votes": 2,
      "publication_date": 20170722
    },
    {
      "title": "DH loves this sink. Has it already mounted, ...",
      "text": "DH loves this sink. Has it already mounted, plumbed, and in use. Mounted outside under the awning so he can wash his hands before he comes inside. His hands and arms get covered in grease and dirt from \"projects\" and this keeps the mess outside.",
      "rating": 5.0,
      "verified": true,
      "author": "ThunderKitty",
      "helpful_votes": 0,
      "publication_date": 20170813
    },
    {
      "title": "Perfect size, well made, stainless steel. Very reasonably priced!",
      "text": "It was the perfect size, well made, stainless steel. Very reasonably priced for commercial quality. Comes complete with faucets and valves which I hope lasts. We will see.",
      "rating": 5.0,
      "verified": true,
      "author": "Tennessee Al",
      "helpful_votes": 0,
      "publication_date": 20180418
    },
    {
      "title": "this is a better quality sink",
      "text": "Had to replace a advance tabco faucet, it was cheaper to buy this, this is a better quality sink, and the faucet is fair, no change in mounting, but you will need a flanged tailpiece.",
      "rating": 5.0,
      "verified": true,
      "author": "gus",
      "helpful_votes": 2,
      "publication_date": 20170326
    },
    {
      "title": "Handles strip after a couple of months of use.",
      "text": "I purchased this sink in July, and here is it September and the cold handle just spins. We tried to reset the screw and didn't have any luck",
      "rating": 1.0,
      "verified": true,
      "author": "tara",
      "helpful_votes": 2,
      "publication_date": 20190921
    },
    {
      "title": "Leveled the best I could get the sink",
      "text": "It is a little bit off as far as precision build. Leveled the best I could get the sink, it leaves a puddle in one corner. The faucet connections are in the back, which I did not think of when ordering. This made for a challenge when mounting it flush to the wall as there is not sufficient room between the wall and the sink-back to install elbows for bottom-up plumbing. It is an economical choice for the designed use.",
      "rating": 4.0,
      "verified": true,
      "author": "Richard Wahl",
      "helpful_votes": 0,
      "publication_date": 20170928
    },
    {
      "title": "The description does not fit the actual sink.",
      "text": "The sink was smaller than anticipated. It also had 2 hot water faucets. There was no cold water faucet. It also both faucets turn the same way they turn inward. It was definitely over priced with all the problems. I feel like the price should have been half of what I paid. If it was already installed I’d return. I feel like CB I was doooed.",
      "rating": 2.0,
      "verified": true,
      "author": "Pennye Conner",
      "helpful_votes": 0,
      "publication_date": 20200317
    },
    {
      "title": "Nice we’re happy",
      "text": "Wondering why the faucets turn backwards? Perfect for bar or campground bathroom",
      "rating": 5.0,
      "verified": true,
      "author": "Tj",
      "helpful_votes": 0,
      "publication_date": 20190915
    },
    {
      "title": "Wash your hands in the kitchen",
      "text": "Best handsink for your busy kitchen. Hand washing is critical. Buy this item for every handing in your operation. Durable and professional.",
      "rating": 5.0,
      "verified": true,
      "author": "Philly porterhouse",
      "helpful_votes": 0,
      "publication_date": 20190513
    },
    {
      "title": "Rusting",
      "text": "Decent price, but RUSTING in less than a month of installation",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190630
    },
    {
      "title": "Very happy. Good pricing for something I cant find in ...",
      "text": "Very happy. Good pricing for something I cant find in my area. You might want to purchase close elbows if you intend to mount on the wall with standard water stops. The \"male female 1/2inch\" ells are hard to find in my area, too.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Paris",
      "helpful_votes": 0,
      "publication_date": 20170228
    },
    {
      "title": "Great buy!",
      "text": "Everything ya need for a GREAT price!! Solid, nice shined polish. Worked out GREAT!",
      "rating": 5.0,
      "verified": true,
      "author": "Blake",
      "helpful_votes": 0,
      "publication_date": 20200302
    },
    {
      "title": "Recommend!",
      "text": "This is exactly what we were looking for! We have a bathroom in our garage that has only a sink and toilet, space was limited and this was the exact size...getting the faucet set already with the sink saved us some money as well. Recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Kauffman",
      "helpful_votes": 0,
      "publication_date": 20170605
    },
    {
      "title": "a little small",
      "text": "needed a sick for shop..it works but is a little small but it meets the need",
      "rating": 4.0,
      "verified": true,
      "author": "Robert Jernigan",
      "helpful_votes": 0,
      "publication_date": 20181210
    },
    {
      "title": "Perfect for my needs.",
      "text": "Perfect for my smallish laundry room. Wanted a sink, but too tight for a big laundry sink. This works for the small amount of spotting I need to do and the faucet is high enough to fill a bucket full of water. Well made & quite pretty.",
      "rating": 5.0,
      "verified": true,
      "author": "Deserts miss the Rain",
      "helpful_votes": 2,
      "publication_date": 20150912
    },
    {
      "title": "Works has everything but splash guards",
      "text": "You will need splash guards and if you are doing them later check price they are expensive to add on later",
      "rating": 5.0,
      "verified": true,
      "author": "Bridgett A.",
      "helpful_votes": 0,
      "publication_date": 20180702
    },
    {
      "title": "Well built sink.",
      "text": "Great size for our patio room. Well built, good water flow. Comes in very handy.",
      "rating": 5.0,
      "verified": true,
      "author": "Patricia Wise",
      "helpful_votes": 0,
      "publication_date": 20180814
    },
    {
      "title": "Great sink for my dental office.  Works as advertised",
      "text": "Have this sink in my dental office. Been working well for 3 months and it is small, yet effective. I highly recommend it if you need a sink, but tight in space.",
      "rating": 5.0,
      "verified": true,
      "author": "Richnator",
      "helpful_votes": 0,
      "publication_date": 20170731
    },
    {
      "title": "Excellent quality",
      "text": "Faucet is absolute junk! The sink is excellent and the drain plug is excellent !",
      "rating": 4.0,
      "verified": true,
      "author": "Brew",
      "helpful_votes": 0,
      "publication_date": 20180820
    },
    {
      "title": "High quality, low price!",
      "text": "This worked out just right for my small business. It’s very very good quality for the price. They shipped promptly. I will buy from them again.",
      "rating": 5.0,
      "verified": true,
      "author": "Sean Komrosky",
      "helpful_votes": 0,
      "publication_date": 20180413
    },
    {
      "title": "The sink work out great great for small places",
      "text": "The sink work out great great for small places. lite weight yet strong enough for whatever you are using it for. Hung on the wall with my screws none were given. The handles are small for my big hands but again seem to work well. very nice like the look clean and simple.",
      "rating": 5.0,
      "verified": true,
      "author": "Gary B.",
      "helpful_votes": 0,
      "publication_date": 20180131
    },
    {
      "title": "Excellent!",
      "text": "Excellent quality little stainless steel utility sink. Even came with a very nice quality faucet set. Great value!",
      "rating": 5.0,
      "verified": true,
      "author": "DWA",
      "helpful_votes": 0,
      "publication_date": 20171211
    },
    {
      "title": "Very good quality",
      "text": "This is just like the ones I order out of Reno for a much higher cost. This is the same if not better quality. Very happy with product.",
      "rating": 5.0,
      "verified": true,
      "author": "Shawn Szentmiklosy",
      "helpful_votes": 0,
      "publication_date": 20170808
    },
    {
      "title": "Simple mounting bracket and far better in appearance than I needed for a garage sink",
      "text": "Exactly as imaged and explained. Simple mounting bracket and far better in appearance than I needed for a garage sink.",
      "rating": 5.0,
      "verified": true,
      "author": "cinderh",
      "helpful_votes": 0,
      "publication_date": 20170816
    },
    {
      "title": "Recommended!",
      "text": "These work great, produce nice, smooth water stream with no sputtering.",
      "rating": 5.0,
      "verified": true,
      "author": "Inkyneedle",
      "helpful_votes": 0,
      "publication_date": 20180722
    },
    {
      "title": "Exactly as described.",
      "text": "This was the perfect sink! It came with everything you need to install it and hung on the wall simply and securely. AND the price is right.",
      "rating": 5.0,
      "verified": true,
      "author": "Terri",
      "helpful_votes": 0,
      "publication_date": 20171231
    },
    {
      "title": "Defective item",
      "text": "Don't really worth it bought this item and year later hot water got crosstrated and opens on backwords",
      "rating": 1.0,
      "verified": true,
      "author": "Miguel Villasenor Almanza",
      "helpful_votes": 0,
      "publication_date": 20180814
    },
    {
      "title": "Faucet is low quality!",
      "text": "Faucet leaks like crazy from the fitting between hot and cold handles. I tried teflon tape on the threads but nothing makes is stop. Very disappointed, not commercial quality!",
      "rating": 1.0,
      "verified": true,
      "author": "rpete",
      "helpful_votes": 3,
      "publication_date": 20161125
    },
    {
      "title": "Laundry room sink.",
      "text": "This sink is perfect for a small laundry room, which I have. I wanted a sink so I could rinse out things without having to walk to another room and then back to the laundry room. Most sinks were too large, but this one is ideal.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathy D.",
      "helpful_votes": 2,
      "publication_date": 20150710
    },
    {
      "title": "Sink as described",
      "text": "The sink was as described, fit well in my employee bath. The quality is good.",
      "rating": 5.0,
      "verified": true,
      "author": "Dakota",
      "helpful_votes": 0,
      "publication_date": 20180621
    },
    {
      "title": "Four Stars",
      "text": "Works great - may upgrade the tap set as not the easiest turn on with greasy hands",
      "rating": 4.0,
      "verified": true,
      "author": "S McD",
      "helpful_votes": 0,
      "publication_date": 20180321
    },
    {
      "title": "Good Deal",
      "text": "Nice well made hand sink. Even the faucet has a solid brass body. Only bad thing was but cheap washers in the faucet. Easy fix. I would call this a good deal.",
      "rating": 5.0,
      "verified": true,
      "author": "Lost In Florida",
      "helpful_votes": 0,
      "publication_date": 20160126
    },
    {
      "title": "Five Stars",
      "text": "Very happy with this wall-mounted bar sink. Easily installed and it looks nice.",
      "rating": 5.0,
      "verified": true,
      "author": "MAangel",
      "helpful_votes": 0,
      "publication_date": 20180123
    },
    {
      "title": "Why so many 5 star reviews? The facet knobs ...",
      "text": "Why so many 5 star reviews? The facet knobs both turn the same way and then it sticks so far out the back youcant get it flush to the wall. Junk don't buy",
      "rating": 1.0,
      "verified": true,
      "author": "Nthuppe27",
      "helpful_votes": 0,
      "publication_date": 20161023
    },
    {
      "title": "The sinks are good. But the fuacets that came with them needed ...",
      "text": "The sinks are good. But the fuacets that came with them needed some work i had to replaces the stems and handles they were really stif and didnt work hardly at all",
      "rating": 3.0,
      "verified": true,
      "author": "Brian",
      "helpful_votes": 0,
      "publication_date": 20151202
    },
    {
      "title": "Happy",
      "text": "Good quality and the included faucet is much better than I expected for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Fatuous Jeffrey",
      "helpful_votes": 0,
      "publication_date": 20170625
    },
    {
      "title": "Good.",
      "text": "Not the sturdiest sink, but definitely better than paying three times as much at other stores.",
      "rating": 4.0,
      "verified": true,
      "author": "gal2g",
      "helpful_votes": 0,
      "publication_date": 20170208
    },
    {
      "title": "Nice sink, buy 1/2” brass 90s.",
      "text": "For the price this is a fantastic set up. Easy install, make sure to snag a couple 1/2” brass 90’s if it’s a new install or the old ones are shot.",
      "rating": 5.0,
      "verified": true,
      "author": "Justin Pollet",
      "helpful_votes": 0,
      "publication_date": 20180829
    },
    {
      "title": "Faucet leaks",
      "text": "The faucet started leaking within a few months and I guess there no warranty.",
      "rating": 1.0,
      "verified": true,
      "author": "FR",
      "helpful_votes": 0,
      "publication_date": 20190610
    },
    {
      "title": "Good sink for the price",
      "text": "Good sink for the price. The big draw back is sink faucet with supply line bends against wall when hanging which restricts water flow through faucet. I had to cut into drywall to keep supply line from bending to make it work.",
      "rating": 1.0,
      "verified": true,
      "author": "Jeffrey Boyd",
      "helpful_votes": 0,
      "publication_date": 20160206
    },
    {
      "title": "great little sinks for the buck using them in our ...",
      "text": "wow , great little sinks for the buck using them in our resteraunt.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180122
    },
    {
      "title": "Very Happy customer!",
      "text": "A great product for a great price!! Came very quickly too",
      "rating": 5.0,
      "verified": true,
      "author": "Iowamom",
      "helpful_votes": 0,
      "publication_date": 20200317
    },
    {
      "title": "It works great and has been sold for about 2 weeks now ...",
      "text": "It works great and has been sold for about 2 weeks now no problems at all not like the other ratings have stated. there's no leaks at all and it's very easy to clean.",
      "rating": 5.0,
      "verified": true,
      "author": "D.B",
      "helpful_votes": 0,
      "publication_date": 20150310
    },
    {
      "title": "Four Stars",
      "text": "Nice sink, not as big as i was looking for but it gets the job done",
      "rating": 4.0,
      "verified": true,
      "author": "Premier C.",
      "helpful_votes": 0,
      "publication_date": 20170920
    },
    {
      "title": "The quality is excellent, and you cannot find one at this price ...",
      "text": "Husband wanted this wall sink for the garage. The quality is excellent, and you cannot find one at this price at the big box stores.",
      "rating": 4.0,
      "verified": true,
      "author": "blondie sue",
      "helpful_votes": 2,
      "publication_date": 20150825
    },
    {
      "title": "Good product",
      "text": "As expected, no issues shipped and received when they said..",
      "rating": 5.0,
      "verified": true,
      "author": "James R. Shuster",
      "helpful_votes": 0,
      "publication_date": 20170821
    },
    {
      "title": "Great Kitchen Hand Washing Sink",
      "text": "Perfect and great quality for the price. Very happy with this.",
      "rating": 5.0,
      "verified": true,
      "author": "Fly Away ",
      "helpful_votes": 0,
      "publication_date": 20201003
    },
    {
      "title": "Would buy again.",
      "text": "Nice little sink, but poor packaging, so arrived less than perfect.",
      "rating": 4.0,
      "verified": true,
      "author": "Abe Lincoln",
      "helpful_votes": 0,
      "publication_date": 20161123
    },
    {
      "title": "and easy to keep",
      "text": "set it up out side and hooked the hose to it, it is so handy, and easy to keep clean",
      "rating": 5.0,
      "verified": true,
      "author": "Grant Bellm",
      "helpful_votes": 0,
      "publication_date": 20170901
    },
    {
      "title": "leaking cold water",
      "text": "easy to install but my cold side will not fully turn off and leaks water at all times,",
      "rating": 1.0,
      "verified": true,
      "author": "Fatima Lourenco",
      "helpful_votes": 0,
      "publication_date": 20200329
    },
    {
      "title": "Great value!",
      "text": "This a great sink. It is easy to install and is a outstanding value!",
      "rating": 5.0,
      "verified": true,
      "author": "Paul M. Lange",
      "helpful_votes": 0,
      "publication_date": 20190504
    },
    {
      "title": "Evaluate closely.",
      "text": "Quick delivery, good price, but plumber ran into installation problems which added substantially to total installed price. Just make sure your plumber evaluates hookup you want before buying.",
      "rating": 4.0,
      "verified": true,
      "author": "Steve Nix",
      "helpful_votes": 10,
      "publication_date": 20150913
    },
    {
      "title": "Great value sink",
      "text": "This is the second hand wash sink that I have purchased from this company. I am very pleased with the quality and pricing.",
      "rating": 5.0,
      "verified": true,
      "author": "Dara S.",
      "helpful_votes": 0,
      "publication_date": 20190224
    },
    {
      "title": "Need to be a plumber",
      "text": "Faucet leaks . Had to take it apart and clean the gasket",
      "rating": 2.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "powder room sink",
      "text": "Arrived In Alaska in one piece. That is a big plus. We have not installed it yet. looks great & fits the space perfectly",
      "rating": 5.0,
      "verified": true,
      "author": "Kathy Carl",
      "helpful_votes": 0,
      "publication_date": 20161029
    },
    {
      "title": "Good value.",
      "text": "It was a little scratched, but good value for price.",
      "rating": 4.0,
      "verified": true,
      "author": "Aimee jamison",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Great pricing and great service",
      "text": "Theses sinks will be ideal for our application of them.",
      "rating": 5.0,
      "verified": true,
      "author": "Gary Spinks",
      "helpful_votes": 0,
      "publication_date": 20190606
    },
    {
      "title": "Great outdoor sink",
      "text": "Great outdoor sink! We placed next to BBQ and already had the water and drain line in place. The perfect addition to the outdoor mess that is created. Wash your hands outside....don't bring it in!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170621
    },
    {
      "title": "Five Stars",
      "text": "was great product great price and was shipped very quickly",
      "rating": 5.0,
      "verified": true,
      "author": "cranehed",
      "helpful_votes": 0,
      "publication_date": 20150307
    },
    {
      "title": "Two Stars",
      "text": "Faucet and drain is poor quality and lacks adequate mounting parts",
      "rating": 2.0,
      "verified": true,
      "author": "All about the kids",
      "helpful_votes": 0,
      "publication_date": 20180721
    },
    {
      "title": "Four Stars",
      "text": "The wall brackets were below average, had to use different ones.",
      "rating": 4.0,
      "verified": true,
      "author": "Barry D.",
      "helpful_votes": 0,
      "publication_date": 20180129
    },
    {
      "title": "Just received this item and it is definitely NOT a ...",
      "text": "Just received this item and it is definitely NOT a 1&1/2\" drain. The drain is only 1\" across. That means this thing is going to fill up fast with water. I need this for commercial use as I'm sure most of you buying it need it for the same thing. 1.5\" barely gets the job done now we are supposed to go with a 1\" no way. Also I just read some of the other reviews and they are saying you have to cut into the drywall to install. No way can I do that we have stainless steel walls on the location I have for this. Going to have to return it.",
      "rating": 1.0,
      "verified": true,
      "author": "Marco B.",
      "helpful_votes": 0,
      "publication_date": 20180307
    },
    {
      "title": "Sink was easy to install and seems to work fine",
      "text": "Sink was easy to install and seems to work fine. It is quite large for a handwashing sink and I like the large backsplash.",
      "rating": 4.0,
      "verified": true,
      "author": "Larry Judge",
      "helpful_votes": 0,
      "publication_date": 20151129
    },
    {
      "title": "this sink is fond of dropping water over the sides ...",
      "text": "this sink is fond of dropping water over the sides, from just under the faucet. gotta be extra careful, always.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160420
    },
    {
      "title": "Very disappointed",
      "text": "The sink came in but it didn’t have the faucet. Very disappointed",
      "rating": 1.0,
      "verified": true,
      "author": "Russell Ribando",
      "helpful_votes": 0,
      "publication_date": 20180503
    },
    {
      "title": "Installs very easily.",
      "text": "Faucet is a little on the cheap side but does exactly what I need it to do. Installs very easily.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170213
    },
    {
      "title": "Sink is good; included faucet sub-par",
      "text": "It's a sturdy little sink that fits places you couldn't put a full-size utility sink. I hope I never have to replace the faucet because it's a wall-mount type, and those are expensive as hell! And the valves turn the wrong way. Rotate right (clockwise) to turn on, left (counterclockwise) to turn off. What's up with that? The one I received leaked at first because it came with a bad washer.",
      "rating": 3.0,
      "verified": true,
      "author": "Keith Lewis",
      "helpful_votes": 0,
      "publication_date": 20151223
    },
    {
      "title": "Five Stars",
      "text": "Excellent product. Delivered on time. A great deal and excellent service. 100% satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "james mccall",
      "helpful_votes": 0,
      "publication_date": 20170425
    },
    {
      "title": "Quality, without the high dollar cost.",
      "text": "I own a small plumbing service, and was looking for an alternative supplier for products like this. This exceeded my expectations, so much in fact that I ordered another one! Thanks!",
      "rating": 5.0,
      "verified": true,
      "author": "jeff niner",
      "helpful_votes": 3,
      "publication_date": 20170404
    },
    {
      "title": "We love this sink",
      "text": "We love this sink. We use it at our campsite we stay at year around. It is easy to install. Works awesome!",
      "rating": 5.0,
      "verified": true,
      "author": "Kristen May",
      "helpful_votes": 0,
      "publication_date": 20160716
    },
    {
      "title": "One of the best home improvement items that I've ever bought",
      "text": "One of the best home improvement items that I've ever bought. Great quality at great price. Unlike other wall mount sinks out there in the market, this one is very easy to install with the supplied wall mount plate. One suggestion I have for the seller: Provide some information on a replacement faucet should the supplied one goes bad. The supplied faucet is 90 degree while common faucets are straight-through. Will the seller have such replacement faucet available? If not, where can the buyer look for one?",
      "rating": 5.0,
      "verified": true,
      "author": "James Plum",
      "helpful_votes": 0,
      "publication_date": 20160803
    },
    {
      "title": "have not installed yet seems to be of good quality",
      "text": "have not installed yet seems to be of good quality thanx",
      "rating": 4.0,
      "verified": true,
      "author": "cory carter",
      "helpful_votes": 0,
      "publication_date": 20150227
    },
    {
      "title": "... is the second sink I purchased and am very pleased with them both the quality is well made and ...",
      "text": "This is the second sink I purchased and am very pleased with them both the quality is well made and it comes with the faucet so no guessing if you have the correct one to fit the sink ... would like to see plumbing offered as well",
      "rating": 5.0,
      "verified": true,
      "author": "Debbie",
      "helpful_votes": 0,
      "publication_date": 20161109
    },
    {
      "title": "size and faucet with strainer for the price were a great deal. Received it in 1 day but quality ...",
      "text": "Shape, size and faucet with strainer for the price were a great deal. Received it in 1 day but quality of seam grinding were quickly or poorly done. Both the hot and cold faucet handles in the same direction witch in very ODD like the machining was only done with a right handed tap.",
      "rating": 2.0,
      "verified": true,
      "author": "ronnie o",
      "helpful_votes": 2,
      "publication_date": 20150629
    },
    {
      "title": "worse quality ever",
      "text": "worse quality ever ...product looked like embossed by hand in a third world country...price is cheap ...ask yourself why ?",
      "rating": 1.0,
      "verified": true,
      "author": "Flo",
      "helpful_votes": 2,
      "publication_date": 20160121
    },
    {
      "title": "Very poor quility and difficult to install",
      "text": "No instructions,sink leaked because not enough threads to tighten, extra parts at plumbing supply house cost $60, faucet drips. Gridmann customer service said they would email directions twice but never did. Very poor quility and difficult to install. Expensive extra parts required. Have to fix defects and modify design to make it work and still not right.",
      "rating": 1.0,
      "verified": true,
      "author": "John Minter",
      "helpful_votes": 2,
      "publication_date": 20170901
    },
    {
      "title": "overall appearance is great",
      "text": "hot side of the faucet has a small drip. overall appearance is great",
      "rating": 4.0,
      "verified": true,
      "author": "Dennis Cnudde",
      "helpful_votes": 0,
      "publication_date": 20141121
    },
    {
      "title": "Good little sink",
      "text": "Easy to mount, nice 1/2\" pipe connections. Needs something to hold it down because it is only a rail that supports it. Knobs have to turn too many times for flow and shut-off.",
      "rating": 3.0,
      "verified": true,
      "author": "Lewis F. Franklin",
      "helpful_votes": 0,
      "publication_date": 20170822
    },
    {
      "title": "Great quality, great value!",
      "text": "What a great value! It's hard to believe that such a nice product can be offered at such a reasonable price. I now have ordered two of these so that I can have one in each shop. I would definatly recommend this to my friends.",
      "rating": 5.0,
      "verified": true,
      "author": "Jamie",
      "helpful_votes": 0,
      "publication_date": 20170420
    },
    {
      "title": "Three Stars",
      "text": "Good but no back splash, I ordered one with it.",
      "rating": 3.0,
      "verified": true,
      "author": "Gunce Lominy",
      "helpful_votes": 0,
      "publication_date": 20160914
    },
    {
      "title": "Great small sink",
      "text": "Just a couple of parts to connect hoses without drilling into the wall. I modified mine to fir onto a house bib that drains to a tree.",
      "rating": 5.0,
      "verified": true,
      "author": "Beauchamp N. Tran",
      "helpful_votes": 0,
      "publication_date": 20170902
    },
    {
      "title": "Complete and on time.",
      "text": "Hand washing sink arrived complete and on time. It was an easy install, hubby attached 1x2's to the wall studs then the sink to the 1x2's. Sink works well in the small space we have for it and we couldn't beat the price.",
      "rating": 5.0,
      "verified": true,
      "author": "lmb",
      "helpful_votes": 2,
      "publication_date": 20170712
    }
  ],
  "product_meta": {
    "title": "GRIDMANN Commercial NSF Stainless Steel Sink Wall Mount Hand Washing Basin with Faucet",
    "description": "This heavy-duty wall-mount sink by Gridmann is constructed from 18-gauge #304 stainless-steel, and is the perfect hand sink for use in a kitchen, bar, restaurant, laundry, school, hospital, hotel, park, or any other commercial setting. It is NSF certified to meet strict standards for public health protection and built for high-volume use to last a lifetime. This basin features a large bowl size with plenty of room for hand washing, and a pre-drilled 7-5/8\" tall backsplash to accept the included gooseneck chrome faucet. It also has a wall mount bracket for easy installation (screws/anchors required for installation and not included), a 1/2\" wide drip channel surrounding the bowl, a stainless-steel basket strainer, and an attractive honed finish. Fast and easy assembly. Overall Size: 17\" wide, 15-1/2\" front to back, 17-5/8\" overall height (including faucet and drain). Bowl Size: 14\" x 10\" x 5\" deep. Faucet mounting holes: 4\" on-center. Faucet connection: Standard 1/2\" male pipe thread. Spout clearance: 13-1/2\" from bowl bottom (to bottom edge of spout). Drain connection: Made to fit a standard 1-1/2\" tailpiece/trap. Includes: Basin with attached backsplash, gooseneck faucet, basket strainer drain (trap not included), and wall mount bracket.",
    "rating": 4.4,
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "18 x 16 x 13.4 inches; 9.4 Pounds",
      "Item model number": "SINK-HS-GR13-SERV1",
      "Date First Available": "July 16, 2014",
      "Manufacturer": "GRIDMANN",
      "ASIN": "B00M87C39Y",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}",
      "GTIN": "609728833343"
    },
    "categories": [
      "Restaurant Appliances & Equipment",
      "Industrial & Scientific",
      "Food Service Equipment & Supplies",
      "Commercial Sinks"
    ],
    "price": 104.99
  }
}