{
  "website_summaries": [
    {
      "verdict": "An enzyme-based stain remover that is great on food stains.",
      "pros": [
        "Uses enzymes to break down stains and works particularly well on food-based stains",
        "Very good at removing stains on whites",
        "Best if clothes are washed not long after treating them"
      ],
      "cons": [
        "Spray bottle has inconsistent reliability"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Nothing seems to work quite as well",
      "text": "My sister did her science fair project in middle school on this stain remover. She tested a few others with hard dried on stains and Zout did the best on every stain. So now years later I still use this as my stain remover and it still works just as well as ever. My most amazing story with this remover is when my son stained his paints a very dark brown on light gray sweats. The stain wasn’t treated and went through the drier. (That’s the death of a stain, sending it through the drier). But I sprayed it like crazy with Zout and sent it through the wash again anyway and the stain came completely out! Amazing!",
      "rating": 5.0,
      "verified": true,
      "author": "Kikenie",
      "helpful_votes": 11,
      "publication_date": 20181031
    },
    {
      "title": "Great product",
      "text": "I bought this stain reliever because I was looking for a strong enzyme-based stain treater for the clothes of my autistic son. Not only is he a very messy eater, but his hygiene is not so great, which means we frequently have stained stinky clothes. I have to admit that I was starting to go slightly crazy, but this stain reliever and Lysol laundry sanitizer have been life-changing. I feel confident if it works for our issues, it should work for almost any stain.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Kaminski",
      "helpful_votes": 8,
      "publication_date": 20190119
    },
    {
      "title": "This product ruined my shirt.",
      "text": "I purchased this because I saw it was suppose to be good on set-in stains. I have a few shirts I love but I wasn't able to get the stains out, so I put this on. On the back of the bottle it says the product is safe for all colorfast washables. Per the instructions on the bottled, I scrubbed the area with a tooth brush. The t-shirt I used it on is now worse than it was with the stains on it. As you can see by my picture, it took the color right off my shirt. TOTAL WASTE OF MONEY, I will never use this product again.",
      "rating": 2.0,
      "verified": true,
      "author": "Jean",
      "helpful_votes": 6,
      "publication_date": 20170823
    },
    {
      "title": "even so far as calling a manufacturer for a case of product because it was so highly recommended - that one worked also",
      "text": "This spray actually works. I've done the litany of products for stain removal, even so far as calling a manufacturer for a case of product because it was so highly recommended - that one worked also, but this is much easier and readily accessible. THIS IS AN EDIT TO MY REVIEW: I Still prefer this product over others, but when mine arrived, the sprayer on both did not work. LUCKILY, I had an almost empty bottle of it, so I have been forced to open the cap of the new arrivals and pour into old bottle - quite frustrating so I am lowering my star to 4.",
      "rating": 4.0,
      "verified": true,
      "author": "ipka54",
      "helpful_votes": 3,
      "publication_date": 20170608
    },
    {
      "title": "Great stain remover",
      "text": "We have been using this for some time. It takes stains out very well if you let it soak for a little bit prior to washing. It does leave a scent on the laundry and It can put that sent on the full load of laundry a little bit. My children have sensitive skin and have not had any reactions to this product and we use it on their clothes often to spot treat.",
      "rating": 5.0,
      "verified": true,
      "author": "E.P.",
      "helpful_votes": 0,
      "publication_date": 20190811
    },
    {
      "title": "New formula is more effective.",
      "text": "What I like MOST is that I can actually purchase it (through Amazon.com)! It’s like trying to buy hen’s teeth! The formula is now foam, rather than liquid, which makes sense. I did laundry today and sprayed some stains that have been there through 2-3 washes, and it is nearly completely back to normal.",
      "rating": 5.0,
      "verified": true,
      "author": "Ms Zuehl",
      "helpful_votes": 2,
      "publication_date": 20180718
    },
    {
      "title": "The best I have found",
      "text": "I keep one by the laundry hamper and one at the washing machine. Most of the time it will take whateever the stain is out. Not always all of it. But lightens it. I haven't found anything better that will take any kind of stain our of everything. I have been using this as I say for years sometimes along with liquid detergent or baking soda as well on the stain. Follow the directions.",
      "rating": 5.0,
      "verified": true,
      "author": "Sharon",
      "helpful_votes": 2,
      "publication_date": 20170213
    },
    {
      "title": "Not Quite the Same",
      "text": "I was disappointed that this formula was not as good at getting out stains as the one I purchased from the grocery store. The other was a foam, but I can't seem to find it anymore. This formula is a spray, and it does not get the stains out as well as the foam. I purchased 4 bottles, and will continue to use it until I run out.",
      "rating": 3.0,
      "verified": true,
      "author": "Duck Lady",
      "helpful_votes": 0,
      "publication_date": 20171020
    },
    {
      "title": "No stains",
      "text": "This is the second purchase of Zout. It really works!!!!!!! has no real scent to it, gets out all the food stains I tend to get on myself, I eat in bed , back porch whereever (not a table person).way better than Shout or other products available in stores.",
      "rating": 5.0,
      "verified": true,
      "author": "Scoots",
      "helpful_votes": 0,
      "publication_date": 20190624
    },
    {
      "title": "Product works",
      "text": "This is the best stain remover I have ever used. Sometimes it requires more than one application for really stubborn stains like coffee and chocolate. Just don't put it in the dryer until the stain has disappeared.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda H. Rufi",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "Perfect....as advertised!",
      "text": "Purchased to remove salt stains on old caps. Let me tell you this stuff works great! Sprayed on let soak 5 mins scrubbed stains with toothbrush rinsed with warm water and hung them to dry! That easy and gets look great! Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "CG",
      "helpful_votes": 0,
      "publication_date": 20190709
    },
    {
      "title": "This Really Works!!",
      "text": "This is the best product on the market for eliminating stains of ALL KINDS! Don't waste your money on Shout and other products that claim they can do the same. They can't.",
      "rating": 5.0,
      "verified": true,
      "author": "happyjack",
      "helpful_votes": 0,
      "publication_date": 20200215
    },
    {
      "title": "A stain remover that actually removes stains. What a concept!",
      "text": "Zout is the real deal when it comes to removing stains. I had an old football jersey I dearly loved but it had so many stains from grilling etc. that it was basically banished to wearing only in the house. My wife bought Zout and now my jersey is able to make public appearances again. How can a product that only exist to remove stains, not remove stains? I am talking to you Shout! Forget Shout and buy Zout!",
      "rating": 5.0,
      "verified": true,
      "author": "Adam Lawson",
      "helpful_votes": 0,
      "publication_date": 20191121
    },
    {
      "title": "Although it is very effective on carpet stains, it is hard to get a decent spray aimed at the floor.",
      "text": "I like the product but the spray mechanism and/or the shape of the container make spraying to the floor difficult. A stronger spray or a better shape of the container may improve this fault.",
      "rating": 4.0,
      "verified": true,
      "author": "Beatrice K. Rose",
      "helpful_votes": 0,
      "publication_date": 20190829
    },
    {
      "title": "Works",
      "text": "I dislike nothing about this product. This is the only stain remover that I've found that will remove a grease stain after the item has been run through the dryer",
      "rating": 5.0,
      "verified": true,
      "author": "fred12065",
      "helpful_votes": 0,
      "publication_date": 20191122
    },
    {
      "title": "Spray is better",
      "text": "I love Zout, it's the only one that works. I don't care for the foam, so changed out my stray head to make it spray. Heh. Zout is getting hard to find, so thank you Amazon!",
      "rating": 4.0,
      "verified": true,
      "author": "Loo",
      "helpful_votes": 0,
      "publication_date": 20190827
    },
    {
      "title": "It works!",
      "text": "My favorite stain remover! I have a baby and he poops on pretty much every onesie. I put zout on the stain, soak it in cold water, and lay it out in the sun to bleach the stain. It’s gone in a few hours! If not I just repeat the process until it’s fully gone!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191221
    },
    {
      "title": "Great stain. Cleaner",
      "text": "Great product for difficult stains on any fabric. Always have a spray bottle of this product in your laundry room.",
      "rating": 5.0,
      "verified": true,
      "author": "Sophies Mom",
      "helpful_votes": 0,
      "publication_date": 20200925
    },
    {
      "title": "Finally able to buy this",
      "text": "I absolutely love this product for any kind of stain. It will even take out stains that have gone through the dryer. For set in stains, spray the stain, let sit for 24 hours, and then wash. Gone! I can no longer find Zout in my local grocery stores. I'm hoping that the company isn't discontinuing this amazing product. It even took out stains that failed to come out using Shout.",
      "rating": 5.0,
      "verified": true,
      "author": "Leslie J Rogers",
      "helpful_votes": 0,
      "publication_date": 20201021
    },
    {
      "title": "Even mouse poop was vanquished!",
      "text": "My husband went to a meeting in Washington, D.C., and left a blue-striped Brooks Brothers dress shirt neatly stored in a bureau in his hotel room. The next morning, he found that the shirt was covered in mouse feces. He was resigned to throwing it out, once he returned home, but I sprayed it thoroughly with Sout, and it, along with the laundry brush, rubbed away every stain--not much, given the wonders of Sout--and saved the shirt. I washed it in warm water, and it looks fine now.",
      "rating": 5.0,
      "verified": true,
      "author": "anne eisenberg",
      "helpful_votes": 0,
      "publication_date": 20190614
    },
    {
      "title": "Great value",
      "text": "Wonder products works well and will be using again.. better than m anything I’ve found at the local level",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth A. Roberts",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Best stain removal product!!",
      "text": "I've used Zout for years and now can't locate it in my local stores so was happy to be able to order online. It gets most if not all stubborn stains out and if not the first time definitely the second time. Especially when the stain is treated promptly. Best product for stain removal!",
      "rating": 5.0,
      "verified": true,
      "author": "Geeni",
      "helpful_votes": 0,
      "publication_date": 20190816
    },
    {
      "title": "Whitens white clothes the best I've seen.",
      "text": "This has always been a great product. I used it with all my nursing uniforms. It removed blood and a variety of other stains and kept my whites white not yellow.",
      "rating": 5.0,
      "verified": true,
      "author": "Mattricia",
      "helpful_votes": 0,
      "publication_date": 20190808
    },
    {
      "title": "Best stain remover I've ever used.",
      "text": "This stain remover has never failed. I love the way it works and I use it on all colors and all stains.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris J",
      "helpful_votes": 0,
      "publication_date": 20191209
    },
    {
      "title": "Wonderful product",
      "text": "Zout is great for all kinds of stains & does not bleach out your clothes like some stain sprays.",
      "rating": 5.0,
      "verified": true,
      "author": "Okera",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "Good item.",
      "text": "Prefer the foam version better, the foam is more expensive & no refills available on Amazon.",
      "rating": 5.0,
      "verified": true,
      "author": "P Kelly",
      "helpful_votes": 0,
      "publication_date": 20200926
    },
    {
      "title": "Excellent stain remover",
      "text": "The product is excellent and readily available in grocery stores. Online pricing is almost double what is in stores.",
      "rating": 5.0,
      "verified": true,
      "author": "Occasional Shopper",
      "helpful_votes": 0,
      "publication_date": 20200406
    },
    {
      "title": "Best stain remover!",
      "text": "Zout is the best product I have found to remove stains from clothing, especially grease spots. Nothing else I’ve used in the past works as well as this!",
      "rating": 5.0,
      "verified": true,
      "author": "Elisabeth",
      "helpful_votes": 0,
      "publication_date": 20190619
    },
    {
      "title": "Best laundry stain remover for all fabrics",
      "text": "Sour is the best stain remover- I do not use any other product!!",
      "rating": 5.0,
      "verified": true,
      "author": "Dot",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "Awesome",
      "text": "There's nothing about this product that I don't like. It takes out any kind of stain. I just removed hydraulic fluid that spilled on my friends brand new Skechers. Sprayed it on took a sm. scrub brush and after a few minutes the stains are gone. It removes blood, motor oil, grass stains etc. I've been using this for over11yrs. I simply love it. No home should be without it.",
      "rating": 5.0,
      "verified": true,
      "author": "C Lynn Stroh",
      "helpful_votes": 0,
      "publication_date": 20191118
    },
    {
      "title": "Works great.  Pretty amazing",
      "text": "Works great. I use it on the little ring on collars about 5 minutes before I wash clothes. It works even better if you don't wait too long to wash your clothes",
      "rating": 5.0,
      "verified": true,
      "author": "Long Distance Shopper",
      "helpful_votes": 0,
      "publication_date": 20180930
    },
    {
      "title": "Better than the ‘leading competitor’",
      "text": "This is a great value and it outperforms Spray&Wash in my opinion.",
      "rating": 5.0,
      "verified": true,
      "author": "Douglas C.",
      "helpful_votes": 0,
      "publication_date": 20191203
    },
    {
      "title": "Great product",
      "text": "Recommended by a friend, so far has gotten all my kids' stains out.",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth Eichel",
      "helpful_votes": 0,
      "publication_date": 20190815
    },
    {
      "title": "Zout",
      "text": "Hard to find in stores. Works great on stains in clothing.",
      "rating": 5.0,
      "verified": true,
      "author": "Shirl",
      "helpful_votes": 0,
      "publication_date": 20200625
    },
    {
      "title": "Zout it the best for any type of stains",
      "text": "This product is great for stains and on whites .. It takes out old stains by spraying on and letting it set in a few hours or over night . It does a really good job for the material look as new as the day you bought it .. It is the best for any type of stains of old and new stains ..",
      "rating": 5.0,
      "verified": true,
      "author": "Dawn C.",
      "helpful_votes": 0,
      "publication_date": 20161010
    },
    {
      "title": "I think Zout is the best stain remover on the market but",
      "text": "I think Zout is the best stain remover on the market but, unfortunately, I cannot find it in many stores in my area. I'm thrilled to be able to buy a two-pack on Amazon. Good price too.",
      "rating": 5.0,
      "verified": true,
      "author": "Robin C",
      "helpful_votes": 0,
      "publication_date": 20180205
    },
    {
      "title": "REALLY WORKS - especially on grease stains",
      "text": "This product gets out LOTS of stains - grease stains, makeup stains, food stains.",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs Matt",
      "helpful_votes": 0,
      "publication_date": 20200330
    },
    {
      "title": "It works!!!!",
      "text": "This is the best for stains I was a dental asst for 30+ yrs this took care of all different stains it is the best",
      "rating": 5.0,
      "verified": true,
      "author": "pat d",
      "helpful_votes": 0,
      "publication_date": 20190723
    },
    {
      "title": "It works!",
      "text": "Zout is an excellent product which seems to have disappeared from local shelves. It was a fair price and was delivered almost immediately.",
      "rating": 5.0,
      "verified": true,
      "author": "Bernard Zitomer",
      "helpful_votes": 0,
      "publication_date": 20190921
    },
    {
      "title": "Amazing",
      "text": "Absolutely works for me, takes away all stains even old ones.",
      "rating": 5.0,
      "verified": true,
      "author": "Irma B Fernandez",
      "helpful_votes": 0,
      "publication_date": 20200317
    },
    {
      "title": "Great stuff!",
      "text": "Been using this stuff for years! It does a great job. Doesn't smell too much. Generally a great product.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Tate",
      "helpful_votes": 0,
      "publication_date": 20191129
    },
    {
      "title": "The BEST Stain Remover",
      "text": "I have been using this product for years and it has NEVER Failed!",
      "rating": 5.0,
      "verified": true,
      "author": "I Love GOD",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "Best stain remover made",
      "text": "Best product around. This gets rid of every stain imaginable. It even gets out old oil or grease stains! Spray it, let it sit for a few hours and wash!",
      "rating": 5.0,
      "verified": true,
      "author": "Teresa Hoskins",
      "helpful_votes": 0,
      "publication_date": 20191130
    },
    {
      "title": "Best brand so far.",
      "text": "As a mom, I'm always looking for the best stain remover, and Zout definitely works better than S*h*o*u*t. Will definitely reorder.",
      "rating": 5.0,
      "verified": true,
      "author": "LizK",
      "helpful_votes": 0,
      "publication_date": 20191023
    },
    {
      "title": "Gets out even stubborn stains",
      "text": "Have used this for a long time. It became unavailable at stores near me. Gets out even stubborn stains. I will keep buying this product",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190627
    },
    {
      "title": "Works on every stain I’ve tried!",
      "text": "Fantastic product on all food stains, milk stains, grass stains, and even grease.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Prime",
      "helpful_votes": 0,
      "publication_date": 20190627
    },
    {
      "title": "Great product",
      "text": "I love this stuff. It's the only product that actually gets rid of tough stains. For instance, I had washed a load of laundry with a tube if chapstick. Oops. Thought I ruined my husband's shorts but I used Zout on the stained area and it came out. Very pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "Melanie C",
      "helpful_votes": 0,
      "publication_date": 20190820
    },
    {
      "title": "Best Stain Remover out there",
      "text": "Zout is the best stain remover on the market, and I can't seem to find this locally. This stuff works. It removes stains that Shout just can't conquer.",
      "rating": 5.0,
      "verified": true,
      "author": "Niesioa",
      "helpful_votes": 0,
      "publication_date": 20171119
    },
    {
      "title": "Best Product",
      "text": "This product will get most stains out. Best stain remover I have used.",
      "rating": 5.0,
      "verified": true,
      "author": "Randall Childres",
      "helpful_votes": 0,
      "publication_date": 20190817
    },
    {
      "title": "Very Effective in Removing Stains - Best on the Market",
      "text": "This has to be one of the best stain removers on the market. We have been using it for quite a while now and haven't been disappointed. It actually removes stains and does a super job of it. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Abigail",
      "helpful_votes": 0,
      "publication_date": 20170702
    },
    {
      "title": "awesome!!",
      "text": "just what I ordered. More people must have found out my secret formula for getting stains out. This produce is so hard to find in the stores. mostly always sold out. Thanks for having it and will reorder soon/",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190301
    },
    {
      "title": "Excellent stain remover!",
      "text": "With five kids this is all I ever use for removing stains. Works excellent!",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer Allen",
      "helpful_votes": 0,
      "publication_date": 20200217
    },
    {
      "title": "Good Stuff",
      "text": "Got kids. They either poop in their pants or drop all kinds of food on their clothes. I go through a bottle a month. Thankful for Zout and not having to buy new clothes.",
      "rating": 5.0,
      "verified": true,
      "author": "David ",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Five Stars",
      "text": "I think this is one of the best stain cleaners. This was a great price for this product.",
      "rating": 5.0,
      "verified": true,
      "author": "artzyfartzy",
      "helpful_votes": 0,
      "publication_date": 20180720
    },
    {
      "title": "Best stain remover out there",
      "text": "Best stain remover out there, gets almost everything out that I throw at it, which is a lot when you have a toddler!",
      "rating": 5.0,
      "verified": true,
      "author": "Tafadzwa Bwititi",
      "helpful_votes": 0,
      "publication_date": 20180103
    },
    {
      "title": "Great stain remover.",
      "text": "Great to get blood (from bloody noses - due to allergies and weak blood vessel) saved many sheets and pillow cases. Best product I have found!",
      "rating": 5.0,
      "verified": true,
      "author": "VTJAX",
      "helpful_votes": 0,
      "publication_date": 20170825
    },
    {
      "title": "Zout works",
      "text": "I have used this product for years for laundry stains, but it is getting hard to find. I like this product.",
      "rating": 4.0,
      "verified": true,
      "author": "PH",
      "helpful_votes": 0,
      "publication_date": 20180219
    },
    {
      "title": "Awesome product",
      "text": "This is a great product for removing stains on clothing, carpet, etc",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara Scarborough",
      "helpful_votes": 0,
      "publication_date": 20191106
    },
    {
      "title": "Weak",
      "text": "Weak thought it would lessen or remove armpit stains from deodorants",
      "rating": 2.0,
      "verified": true,
      "author": "Jon R.",
      "helpful_votes": 0,
      "publication_date": 20180729
    },
    {
      "title": "Works like the zout that came in the push and pull version.",
      "text": "Works great on all kinds of stains. Used to use the zout with the push and pull spout, but that version is no longer available. This works as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Rosemary Merlo",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "Recommended!",
      "text": "This does the job for a fraction of the price of other \"major brands\". Has gotten every stain I've thrown at it -- so far. Pleasant odor. One for the laundry room and one for the upstairs bedrooms. We're covered!",
      "rating": 5.0,
      "verified": true,
      "author": "rms",
      "helpful_votes": 0,
      "publication_date": 20160321
    },
    {
      "title": "This is the spray, not the foam.",
      "text": "This is a good stain treatment. I was disappointed to receive the spray instead of the foam as shown.",
      "rating": 3.0,
      "verified": true,
      "author": "Chernig",
      "helpful_votes": 0,
      "publication_date": 20190321
    },
    {
      "title": "Very satisfied with the product it works great",
      "text": "I used this product to remove spitup and it takes the stains out",
      "rating": 5.0,
      "verified": true,
      "author": "Liz Conley",
      "helpful_votes": 0,
      "publication_date": 20180920
    },
    {
      "title": "Excellent product!!",
      "text": "Stain removal!! I've had wonderful results using Zout on all types of stains!!",
      "rating": 5.0,
      "verified": true,
      "author": "Carol Peterson",
      "helpful_votes": 0,
      "publication_date": 20201005
    },
    {
      "title": "Fights stains like no other stain remover",
      "text": "This product is the only stain remover I will use!",
      "rating": 5.0,
      "verified": true,
      "author": "Peggy Corazzini ",
      "helpful_votes": 0,
      "publication_date": 20190530
    },
    {
      "title": "Love the formula and the way it works",
      "text": "Love the formula and the way it works...bummed that none of the squitters worked and I have to switch them out to use. Hoping it was just this batch as I have used this product for years!!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180606
    },
    {
      "title": "The best!",
      "text": "This has taken out even old stains. Very hard to find in most stores so I am glad to be able to order on line.",
      "rating": 5.0,
      "verified": true,
      "author": "connie kellogg",
      "helpful_votes": 0,
      "publication_date": 20191030
    },
    {
      "title": "The Best!",
      "text": "Without a doubt, the best stain remover ever! My wife and I use this stuff everywhere.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff Hubbard",
      "helpful_votes": 0,
      "publication_date": 20191001
    },
    {
      "title": "Excellent product!",
      "text": "This product takes out even OKD stains & ive used it for years! Excellent stain remover that other stain removers won’t remove!",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa Gr",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "It’s a great product",
      "text": "Zout is the best stain remover for clothes. I use it on clothes that have oil stains and stains that my grandchildren add to their clothes. It is the best.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "Well worth the cost.",
      "text": "This is the best product for removing stains. Nothing else comes close.",
      "rating": 5.0,
      "verified": true,
      "author": "dawa34444",
      "helpful_votes": 0,
      "publication_date": 20180815
    },
    {
      "title": "Best product on the market for stains!",
      "text": "A great product that is impossible to find in the grocery store. Works so well on carpet pet stains and more.",
      "rating": 5.0,
      "verified": true,
      "author": "Inexperienced Artist",
      "helpful_votes": 0,
      "publication_date": 20180311
    },
    {
      "title": "the best !",
      "text": "the best stain remover on the market - even does a credible job on old stains ! Nurses recommend it for blood stains, too.",
      "rating": 5.0,
      "verified": true,
      "author": "nancy forton",
      "helpful_votes": 0,
      "publication_date": 20190527
    },
    {
      "title": "Not worth it!",
      "text": "Product does not work as well as Shout or Oxy Clean. Smells awful and had to use twice as much to try to get some of the stains out. Super disappointing.",
      "rating": 2.0,
      "verified": true,
      "author": "Denise Everhart",
      "helpful_votes": 0,
      "publication_date": 20191104
    },
    {
      "title": "Best Stain Remover on the Market!",
      "text": "This is the best stain remover on the market but unfortunately so hard to find in local supernarkets. This removes just about any stain you will get on your clothes.",
      "rating": 5.0,
      "verified": true,
      "author": "LINDA R.",
      "helpful_votes": 0,
      "publication_date": 20160805
    },
    {
      "title": "My wife swears by Zout",
      "text": "My wife swears by Zout, over any other stain remover out there—and believe me, she's tried a dozen and more!",
      "rating": 5.0,
      "verified": true,
      "author": "PogeeTop Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20161217
    },
    {
      "title": "Not Foam",
      "text": "Zero stars - if it is the foam you are after, don’t waste your time. This is advertised as Zout Foam but you get Zout spray instead. If you are specifically looking for the foam, do not order this. We tried twice and received the spray both times.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazonian",
      "helpful_votes": 0,
      "publication_date": 20180812
    },
    {
      "title": "Do it is amazing!",
      "text": "Do it gets rid of stains better than all the name brand products I've used...which have been many.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200515
    },
    {
      "title": "It works",
      "text": "I have tried all kinds of spot remover and this is the beat",
      "rating": 5.0,
      "verified": true,
      "author": "Linda Matsumoto",
      "helpful_votes": 0,
      "publication_date": 20191112
    },
    {
      "title": "Great for grease",
      "text": "I work in a restaurant and it removes all the stains",
      "rating": 5.0,
      "verified": true,
      "author": "Jerry Fazio",
      "helpful_votes": 0,
      "publication_date": 20190517
    },
    {
      "title": "Best stain remover ever!",
      "text": "This is the best stain remover I have ever i used.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200403
    },
    {
      "title": "Gets grease out",
      "text": "This gets the grease out of my iron worker husbands clothes like a charm.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190820
    },
    {
      "title": "Works on Everything",
      "text": "This is the only stain remover I use. It is the only one that works on just about everything.",
      "rating": 5.0,
      "verified": true,
      "author": "annie",
      "helpful_votes": 0,
      "publication_date": 20171120
    },
    {
      "title": "The best stuff",
      "text": "Works on all laundry stain like nothing else. The best stuff",
      "rating": 5.0,
      "verified": true,
      "author": "Patricia",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "I liked it that it came early.",
      "text": "Getting spots out of a sweat shirt, and I used it to get some spots out of the carpet before I cleaned it.",
      "rating": 5.0,
      "verified": true,
      "author": "Sharon Thompson",
      "helpful_votes": 0,
      "publication_date": 20200404
    },
    {
      "title": "Handy washing tool",
      "text": "We have used Zout for many years and would not use anything else.",
      "rating": 5.0,
      "verified": true,
      "author": "AZJAM",
      "helpful_votes": 0,
      "publication_date": 20170214
    },
    {
      "title": "Laundry Stains",
      "text": "I love this product for removing laundry stains. Even set in stains. The product arrived on time.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200702
    },
    {
      "title": "this really works!",
      "text": "My family gives me plenty of dirty, stained clothes to use this on. I'm happy for a product that gets out almost 100% of stains out.",
      "rating": 4.0,
      "verified": true,
      "author": "Nadine Stutzman",
      "helpful_votes": 0,
      "publication_date": 20190308
    },
    {
      "title": "In my opinion, it’s the best on the market.",
      "text": "Zout will remove stains that other laundry stain removers fail to remove. I’ve used this product for years. Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Jan R",
      "helpful_votes": 0,
      "publication_date": 20200605
    },
    {
      "title": "Really works!",
      "text": "This is the best of all the stain removers. I've no idea why everyone hasn't discovered it. This one really works!",
      "rating": 5.0,
      "verified": true,
      "author": "Cari",
      "helpful_votes": 0,
      "publication_date": 20160118
    },
    {
      "title": "It works.",
      "text": "Excellent for wine, blood, mustard etc stains. Even acrylic paint if it hasn't dried.",
      "rating": 5.0,
      "verified": true,
      "author": "Elaine Kane",
      "helpful_votes": 0,
      "publication_date": 20191106
    },
    {
      "title": "Amazing!",
      "text": "This stuff is amazing & gets out so many stains!",
      "rating": 5.0,
      "verified": true,
      "author": "Christine Deeke",
      "helpful_votes": 0,
      "publication_date": 20171002
    },
    {
      "title": "It is great product.",
      "text": "I use this spray all the time for cleaning spots on clothes. It is great.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen Myers",
      "helpful_votes": 0,
      "publication_date": 20200426
    },
    {
      "title": "Received regular spray not foam version",
      "text": "Love this stuff. Only 3 stars because I didn’t receive the ‘foam’ version, instead I received the regular spray.",
      "rating": 3.0,
      "verified": true,
      "author": "BR",
      "helpful_votes": 0,
      "publication_date": 20180206
    },
    {
      "title": "Best stain remover ever",
      "text": "Best stain remover ever, even tackles set in stains and wins.",
      "rating": 5.0,
      "verified": true,
      "author": "International Lady",
      "helpful_votes": 0,
      "publication_date": 20160413
    },
    {
      "title": "Great Product!!",
      "text": "The ONLY stain remover I will use. Excellent product!! :)",
      "rating": 5.0,
      "verified": true,
      "author": "seashellsny",
      "helpful_votes": 0,
      "publication_date": 20191126
    },
    {
      "title": "Fantastic!!",
      "text": "Best spot remover I have ever used. Recommend by Better Homes & Gardens magazine.",
      "rating": 5.0,
      "verified": true,
      "author": "Warren T. Kennett",
      "helpful_votes": 0,
      "publication_date": 20180729
    },
    {
      "title": "Works",
      "text": "Clothes and beilieve it or not getting crud out of my horses tail",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Markus",
      "helpful_votes": 0,
      "publication_date": 20190120
    },
    {
      "title": "STAINS DON'T STAND A CHANCE",
      "text": "I SWEAR THIS PRODUCT GETS THE STAINS OUT EVERY TIME",
      "rating": 5.0,
      "verified": true,
      "author": "JERRY",
      "helpful_votes": 0,
      "publication_date": 20190326
    },
    {
      "title": "I did not receive the entire order",
      "text": "I only received 1 bottle not 2 as was listed on the order",
      "rating": 1.0,
      "verified": true,
      "author": "Cindy Wood",
      "helpful_votes": 0,
      "publication_date": 20190620
    }
  ],
  "product_meta": {
    "title": "Zout Triple Enzyme Formula Laundry Stain Remover Foam - 22 oz - 2 pk",
    "rating": 4.8,
    "feature_bullets": [
      "Safe on washables",
      "Amylase for starch stain like BBQ sauce, chocolate syrup, tomato sauce, and baby food",
      "Protease",
      "Zout Formula is safe on a washables.",
      "Triple Enzyme Formula Laundry Stain Remover"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "11 x 8.8 x 2 inches; 3.25 Pounds",
      "Item model number": "ADC-222B",
      "Date First Available": "August 19, 2014",
      "Manufacturer": "Alere",
      "ASIN": "B00MUEAKO0",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Household Supplies",
      "Laundry",
      "Health & Household",
      "Health, Household & Baby Care",
      "Stain Removers"
    ],
    "price": 13.43
  }
}