{
  "website_summaries": [
    {
      "verdict": "Inexpensive fetch toy that consists of extra tough materials for daily play.",
      "pros": [
        "Soft and flexible material will work for most dogs",
        "Has a bacon scent dogs love",
        "Round shape makes it easy to throw and fetch",
        "Ridges on the ball cause it to bounce in crazy directions, which keeps the dog on its toes",
        "Low price"
      ],
      "cons": [
        "Some dogs won't like the smell",
        "Dogs with sharp teeth may tear the latex"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Bad quality. It got ripped in 2 minutes",
      "text": "Bad quality. It got ripped in 2 minutes. Wrong size description 11.2 x 8.2 x 8 and \"teething puppies Dura Play\". After you cut 4 plastic Tag Fasteners that attached to the ball and the package it will have 4 small holes on the ball right away.",
      "rating": 1.0,
      "verified": true,
      "author": "Alexandra",
      "helpful_votes": 59,
      "publication_date": 20171005
    },
    {
      "title": "My dog is madly in love with this ball.",
      "text": "My dog is OBSESSED with this ball. I have a pit mix and she usually destroys any ball she comes in contact with, except this one. She plays with it by herself for hours a day. I think she might believe it's alive or something. I have about 5 or 6 of them that I keep around the house. I don't usually write reviews, but this ball is seriously amazing. And for $6, you can't really go wrong. Your results may vary, obviously every dog is different. But it's definitely worth a shot especially for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelsey J. ",
      "helpful_votes": 38,
      "publication_date": 20170320
    },
    {
      "title": "My dogs favorite and they work well with the medium sized Chuck-It",
      "text": "These balls are awesome and my dog's favorite toy. They are soft and squishy so they're easy to hold on to and the price couldn't be better. We buy the small and they work well with the medium sized Chuck-It. My dog prefers them over every other type of ball so we keep a few around at all times. They are pretty solid but I can see how a large, aggressive chewer could destroy these. My dog is about 17 pounds and I don't think he could tear it up easily, if at all.",
      "rating": 5.0,
      "verified": true,
      "author": "CindyTop Contributor: Pets",
      "helpful_votes": 13,
      "publication_date": 20160209
    },
    {
      "title": "My dog doesn't care for it",
      "text": "I bought this ball thinking that my puppy would love it (after reading all the rave reviews about it) and that it would last longer than the previous versions of dog ball toys I that I got her. Well, I was greatly disappointed. She doesn't want anything to do with it and I'm not sure why. It's almost as if she's afraid of it because she barks and growls at it whenever I put it in front of her. I purchased a small one for her, and it's perfect for her size-wise. I just don't get it and feel I've wasted my money. It's been 3 weeks since I gave it to her and her behavior towards it hasn't changed.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20190712
    },
    {
      "title": "Don’t... just... don’t.",
      "text": "I was really hoping this was truly as long lasting as Hartz believes it is. Nope! These last not longer than ten minutes. I purchased the large, for dogs over 50#.. don’t believe it. And, the inside is filled with some form of crappy foam. If this was made more similarly to the West Paw Designs ball, you’d have a product safe for power chewers. Very disappointing & a huge waste of money. If you’re looking for a well made, power chew ball..... keep looking. This is not a ball I would leave alone with my dog.",
      "rating": 1.0,
      "verified": true,
      "author": "SparkleMeHappy",
      "helpful_votes": 2,
      "publication_date": 20190604
    },
    {
      "title": "Bad purchase",
      "text": "I usually give very good reviews but I regretfully cannot on this item. My little 13-15 pound dog chewed right through it. And I’m not entirely sure what was on the inside but I was afraid to let him have it and had to throw it all away. He’s not an aggressive chewer typically. The scent definitely attracted him but is a moot point if they tear it right up and can’t allow them to continue to chew on whatever is inside.",
      "rating": 1.0,
      "verified": true,
      "author": "CoopsNana",
      "helpful_votes": 2,
      "publication_date": 20191007
    },
    {
      "title": "Came defective",
      "text": "This is the 2nd one of these I have purchased. First one came fine and my dog loved this toy and played with it frequently and it lasted a long time (months) and she is a very destructive little chewer. She finally managed to get a small little chunk out of it which unfortunately destroys the squeak feature. So I got her a new one! This one unfortunately came with a small cut. I did not notice it until all packaging was removed. I thought it would be ok since the squeak was still working. I was wrong. She found that small crack and turned it into tearing a chunk out within and hour, rendering the toy useless and unsafe.",
      "rating": 2.0,
      "verified": true,
      "author": "AuroraGoryAlice",
      "helpful_votes": 0,
      "publication_date": 20200529
    },
    {
      "title": "Lasts, but the squeak...",
      "text": "This toy is durable and does what it is made to do, my black lab loves it. I, on the other hand, cannot stand the squeaker! The noise drives me nuts, It has a super loud squeaker, but it's my dog's favorite toy (and he has way 'cooler' toys)! I'm not knocking the brand or the toy, because it truly does last, at least for my pup. My dog usually rips through toys in seconds flat (including Super Chewer box toys, Kong Extreme, etc.), and this one has lasted weeks already. Although it is a 'special' toy and I have to limit his access (or I'll go squeak-crazy), he still plays with it daily.",
      "rating": 5.0,
      "verified": true,
      "author": "OutdoorDataDude",
      "helpful_votes": 0,
      "publication_date": 20200422
    },
    {
      "title": "Plastic fasteners that stick out can be removed",
      "text": "Nice soft ball. It squeaks for sure. The ball smells more like bacon than plastic, but the dog likes it. At first a bit bummed with those sharp plastic fasteners that stick out after you removed the ball from the carton. Not sure who designed that. Just silly. But maybe more environmental friendly than wrapping the whole thing in plastic. You cannot really push the little thingies in (they come right out) or cut them closely enough, but you can actually pull them out without damaging the ball. My wife used her teeth, I wondered why she didn't use a little plier or some other tool. Ah well, but they are out and the dog is happy.",
      "rating": 3.0,
      "verified": true,
      "author": "treble101",
      "helpful_votes": 0,
      "publication_date": 20200121
    },
    {
      "title": "Favorite Dog Toy!",
      "text": "This toy is awesome! My dog absolutely loves it and I’ve already ordered more toys from DuraPlay. It does have a faint bacon scent which my dog loves but it definitely confused her at first. She thought it was a real bone and kept trying to hide it. I ordered the small which is a little smaller than I was hoping for but realistically I figured it would be that size. My dog is more on the medium size so definitely ordering up next time but she’ll get plenty of use out of the one we got. The rubber is great on her teeth and pretty durable.",
      "rating": 5.0,
      "verified": true,
      "author": "Shannon Cole",
      "helpful_votes": 0,
      "publication_date": 20200927
    },
    {
      "title": "Her favorite toy",
      "text": "My Chihuahua needs many toys for her many moods, and she plays with them all. She esp loves the Dogwood. But this squeaky bone seems to be her favorite, and she prefers the green over the pink. She'll chomp on it and race from one side of the house to the next as I move around. And she goes crazy when I grab and squeeze it, never tires of the squeak. We all should be so easy to please. I have also been sewing long strips of fabric with knots tied along their length. She uses these as dental floss. A cheap and abundant DIY toy for your pup.",
      "rating": 5.0,
      "verified": true,
      "author": "paganesque",
      "helpful_votes": 0,
      "publication_date": 20200430
    },
    {
      "title": "Disappointing",
      "text": "I was disappointed in this toy. Granted dogs’ sense of smell is much greater than humans’, but this toy has practically no scent. Unless I’m blind, the description also doesn’t mention that this toy is a squeak toy or that it is very soft. My dogs—I have 4—don’t seem very interested in this toy at all. The squeaker makes my Aussie perk her ears, but she won’t even pick it up. My Goldendoodle will fetch with it for a few seconds, but definitely not enthusiastically. The other Aussie and the Doxie don’t pay any attention to it at all. So I was terribly disappointed to say the least.",
      "rating": 2.0,
      "verified": true,
      "author": "Erika",
      "helpful_votes": 0,
      "publication_date": 20200316
    },
    {
      "title": "Happy dog, happy life!",
      "text": "Our dog LOVES this toy and any duraplay toy. And any toy that lasts longer than one day is a huge plus in my book and our dog lives to chew up toys, but with the duraplay toys, she keeps them in tact, doesn't mean she doesn't chew on them, she certainly does, they just don't tear up. This our second purchase of this toy and only because the last one got ripped apart in a tug-o-war between our dog and our nephew. It's a very reasonable price and we were happy to buy another because it means a happy doggie. It's a soft toy, but durable, and I think, to a dog, it smells good too.",
      "rating": 5.0,
      "verified": true,
      "author": "jmck",
      "helpful_votes": 0,
      "publication_date": 20200310
    },
    {
      "title": "Feels Cheap & Flimsy",
      "text": "Very disappointed that with great reviews and a name like \"Dura Play\" this ball feels thin, cheap & flimsy. I can guarantee my dogs would destroy it in minutes and won't even give it to them as i don't want to risk the choking hazard or deal with cleanup. Returning but wanted other consumers to be aware that the name/ratings are misleading, if you have strong chewers (we have boston terriers, jaws of steel), keep shopping...",
      "rating": 1.0,
      "verified": true,
      "author": "chefstef612",
      "helpful_votes": 0,
      "publication_date": 20190911
    },
    {
      "title": "Retreivers Favorite Toy",
      "text": "This thing lasts long & yet is soft & squishy. My golden loves everything about it - from the bacon scent to the soft rubber chewiness - His buddy a small breed dog puppy also loves it! Our first one lasted for 2 months & so far it looks like our second one is going to do the same. I recommend the Subscribe & Save so your furry friend always has one on hand.",
      "rating": 5.0,
      "verified": true,
      "author": "ScionMom",
      "helpful_votes": 0,
      "publication_date": 20200627
    },
    {
      "title": "Superb squeaky toy!",
      "text": "Update: squeak lasted three days, but toy is still intact and my pups still enjoy it even though it doesn't squeak. Best squeaky toy yet! Between my four moderate to aggressive chewers, 40# to 65# pups, spent many hours taking turns the first day we got it and it still squeaks. Every squeak toy we've gotten before never lasted past 30 minutes. Will need to buy more to keep the peace between them even though they will still want what the other has. Only issue is, wish I could choose the colors or get the bone shaped ones in a multipack.",
      "rating": 5.0,
      "verified": true,
      "author": "Marcus & CJ Alvarado",
      "helpful_votes": 0,
      "publication_date": 20200405
    },
    {
      "title": "Great toy for chewer!",
      "text": "I have small dogs, but decided to buy the medium balls and I'm glad I did. My youngest dog loves them. She's an aggressive chewer, so I got one size up, figuring she would have to work a bit to get the ball in her mouth enough to make it squeak. It's worked great! Plus, she can't get it far enough in her mouth to chew & chew &...... She loves it & the squeak keeps her running & wrestling with it, giving her the exercise she needs. My older dog just doesn't really play any longer. He prefers to laze in the chair with me.",
      "rating": 5.0,
      "verified": true,
      "author": "Caty Haase",
      "helpful_votes": 0,
      "publication_date": 20200307
    },
    {
      "title": "Totally unappealing to my dog",
      "text": "I thought this was a great idea but my dog doesn’t. The scent is not appealing to him at all. He loves bacon treats and the scent of bacon makes him excited. Unfortunately this product doesn’t smell anything like bacon to him. I’ve even put his bacon treats on it to entice him and it didn’t help. I’ve squeezed it to get his attention with the squeaker (which he likes in other toys) but he sniffs it and walks away. I haven’t been able to interest him in any way.",
      "rating": 1.0,
      "verified": true,
      "author": "Ann",
      "helpful_votes": 0,
      "publication_date": 20190508
    },
    {
      "title": "Puppies love it!",
      "text": "I have a 1 yr old yorkipoo and a 5 mo old mixed breed, they're both about 11lbs right now. They love to tug on toys, but unfortunately the ones I had wouldn't last long as the rope wasn't very durable. The string on my old one would start coming apart and I've even caught them trying to eat it! So this thing now, super durable! They love chewing on it and so far it has withstood the teeth of my little devils. Plus! Each one grabs one wring and they tug on it for hours.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200917
    },
    {
      "title": "Has a fun bounce.. but made in china.",
      "text": "My dogs absolutely love this thing!! Its bounce is as exciting for them as the squeeker, which has yet to be extracted by them, a miracle that might be attributed to the way it's filled. (Sort of a puffy, air pocket feel to it). They haven't been able to chew it to shreds yet (still probably because of the puffy squeezability of it, they cant grind their teeth on it) I'm only giving it 3 stars because it's made in China (which I didnt see when I ordered, so my fault really) and the plastic tag things that hold the new ball in the cardboard packaging cant be completely removed, so they continue to poke out, and are rather sharp.",
      "rating": 3.0,
      "verified": true,
      "author": "Dainah",
      "helpful_votes": 0,
      "publication_date": 20180503
    },
    {
      "title": "Happy Dog, Happy Life",
      "text": "Only had it an hour so I don’t really know, sturdiness or longevity but I do know my Husky has not stopped playing with it for an hour straight! He has destroyed toys in less time and although soft, not hard, it’s holding up, he’s having fun. My pointer had no interest in it at all, may just be tired ? I purchased 4, my Husky has backups. Day 2, no squeakers work anymore and all have teeth holes but the dog still likes them. He’s on the last one, 4th . Good for a smaller dog. Probably not a 50 lb dog like it says, but no complaints here, my Husky was happy for 2 days :)",
      "rating": 5.0,
      "verified": true,
      "author": "CM",
      "helpful_votes": 0,
      "publication_date": 20200128
    },
    {
      "title": "Too Easy to Destroy",
      "text": "My dogs LOVE this ball. They run around the house making it squeak every two seconds. They actually jump for joy when they see a new one. It is their favorite toy; until they decide to tear it to shreds with pieces of the covering and fluff interior all over the place. The second there is one hole in the exterior, it stops squeaking. It is VERY easy to put a hole in it. The exterior feels like its made for a infant. I'm giving one star for my dogs. My rating would be zero. Its too expensive for a 15 minute toy.",
      "rating": 1.0,
      "verified": true,
      "author": "Just Me",
      "helpful_votes": 2,
      "publication_date": 20180215
    },
    {
      "title": "Yes it is worth the money",
      "text": "My dog is a miniature Schnauzer - he is very particular as to what toys he likes or doesn't like. He also seems to like the color blue and if a toy has a squeaker then one of the first things he does is tear it out. Well with this \"blue\" Hartz Dura Play dog toy, he was not able to tear the squeaker out and he has had it several years and it remains in good shape. Now he used it to sing - he squeaks it and then howls one of his \"dog songs\". It's a safe, strong toy and I actually bought an orange one later and he just loves the blue one.",
      "rating": 4.0,
      "verified": true,
      "author": "Jack and Me",
      "helpful_votes": 0,
      "publication_date": 20191204
    },
    {
      "title": "NASA engineered dog toy",
      "text": "I have a pit bull that will chew through a Kong toy in about 20 minutes, especially if it has a squeaker bc all squeakers must die immediately. So I expected this thing to last about 45 seconds. She got it for Christmas and the thing looks like it did Christmas Day and still just as squeaky (all of the time, even in the middle of the night). I don’t know what magical NASA engineered material that thing is made out of, but it has outlasted many $20-$40 dog toys. I actually wound up ordering like six other toys made out of the same material. I highly recommend if you have a “power chewer”.",
      "rating": 5.0,
      "verified": true,
      "author": "erin offord",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "This is now my dog's prize possession",
      "text": "Really cute, nice squeaky sound, and an obvious bacon aroma. I am not sure how durable it would be for an aggressive chewer. It's a kind of interesting soft velvety plastic, not a hard toy. It bounces all over when you throw it and has my new 14 year old rescue dog as a happy as a puppy. He carries it with him everywhere. Note that they come in a range of sizes. The small is quite small, but a perfect size for him--he is a cocker spaniel. They have medium, large, and I think I saw an extra large too. Good value and hours of playtime fun!",
      "rating": 5.0,
      "verified": true,
      "author": "J. Mullally",
      "helpful_votes": 0,
      "publication_date": 20191127
    },
    {
      "title": "Wow it still squeaks!!!!",
      "text": "I originally ordered 2 of these balls since the add-on prices was so good not sure how long it would last with my heavy chewing 80lb Lab, especially having a squeaker in it. My Lab has mastered de-squeaking his toys in two minutes flat that I just stopped wasting my money on buying toys for him. With the add-on prices so good I figured it was worth a try, Not only was this a BIG hit it is still squeaking & holding strong. Because these balls are so durable I had to go back & oder 2 more. I highly recommend these bacon flavored dura-balls!!!",
      "rating": 5.0,
      "verified": true,
      "author": "MarciaMarciaMarcia",
      "helpful_votes": 2,
      "publication_date": 20171223
    },
    {
      "title": "Durable for adult dogs",
      "text": "I see a lot of reviewers saying these are not durable or their dog chewed it to pieces. I buy these for my Golden Retriever 3 yrs and her 5 month old puppy Goldendoodle. My Retiever LOVES these. She will walk all over the house with it in her mouth and chase it every time it’s thrown. I probably wouldn’t leave it with my puppy for any extended period of time because he’s still in his chewing everything stage. I find these are extremely affordable and long lasting fun for my dog and even our pup. Just be smart about it, and don’t leave it out for your puppy to destroy if they are still really bad chewers.",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs. The G.",
      "helpful_votes": 0,
      "publication_date": 20200215
    },
    {
      "title": "Mixed reviews",
      "text": "I have mixed reviews on this. So its definitely scented. My dog could smell it as soon as I opened the amazon box. It was the o ly xmas toy that he ripped open. So in that regards it was great. However he had it tore apart in 10mins. Now my dog is only 13lbs & isn't a puppy so I expected better durability from this brand. But he is a power chewer & nibbler so he rips up alot of toys fast. I'd say maybe if you don't have a power chewer maybe it would last longer.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200614
    },
    {
      "title": "Lasted 2 days",
      "text": "I bought this for my pair of wire fox terriers as they have killed most of their toys recently so we needed some new ones. This toy is not durable at all and the ball portion is filled up with stuffing, not rubber, so during the first day of playing with it, they pulled the ball from the rope which was glued to it and stuffing began to come out. While I don't expect toys to last very long with this pair, the idea of putting stuffing in a tug toy like this is a terrible idea.",
      "rating": 1.0,
      "verified": true,
      "author": "John B",
      "helpful_votes": 0,
      "publication_date": 20200822
    },
    {
      "title": "Sadly this product worsened over the years",
      "text": "My golden retriever LOVES these....they lasted for so long and he loved chewing them. For some reason, this past year, year and a half the quality has gone down. I used to buy one every other year....it lasted a long long time. Now, I buy the packs; it didn't last three weeks! Sad. Still, he loves them the sound and rubber chewing...so I may still get them. But quality has definitely gone downhill. Beware of the styrofoam stuffing inside. They didn't used to have that.",
      "rating": 2.0,
      "verified": true,
      "author": "Pei Kang",
      "helpful_votes": 0,
      "publication_date": 20200220
    },
    {
      "title": "The BEST CHUCKIT SQUEAKY BALL!!!!!",
      "text": "Ok..a tennis ball is fine for dogs. But squeaky balls dogs love. But most are flimsy and get destroyed in minutes. The Hartz duraplay ball is very durable and satisfies the gnawing by squeaking and it's bacon scented! The squeaker does not die out. I have a picture of the medium and small. The medium is good..but GET THE SMALL..IT FITS A CHUCKIT THROWER!!!!! This is a gem and blows away any of the regular tennis balls",
      "rating": 5.0,
      "verified": true,
      "author": "Patfromchicago",
      "helpful_votes": 0,
      "publication_date": 20200820
    },
    {
      "title": "My Puppy LOVES the ball!",
      "text": "I bought this ball for my puppy for Christmas. She is a 9 month old large breed and has been in the phase of destroying her toys. She LOVES this ball. It’s like her security blanket. She carries it everywhere with her. I put it on subscribe and save to make sure I get a replacement ball every few months but I have a feeling I’ll be replacing it because it’s filthy (she likes playing with it in puddles so it does fill with water through the squeaker) or she loses it. She doesn’t seem to damage it at all.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica Ayer",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "\"Durable\" is very misleading...",
      "text": "Ordered two if these for my large dogs... One lasted 20 mins, the other another 10 after that, maybe. The description boasts \"extended durability\" from the thick latex. Nope. I didnt expect these to last forever, but not even an hour is ridiculous. Per the description, it says these toys are good for teething puppies to senior dogs. I believe very small teething puppies and senior dogs are the only ages of dog this toy is appropriate for. Def not going to be purchasing anything else from them.",
      "rating": 1.0,
      "verified": true,
      "author": "Ally S Morgan",
      "helpful_votes": 2,
      "publication_date": 20180321
    },
    {
      "title": "Dura Play?",
      "text": "I thought maybe since this was called “Dura Play” that it would actually stand up to my chomper of a yellow lab. He loves retrieving but gives the balls we throw 3-4 good extra chews before dropping for them next throw. There’s no way this will hold up to his chomps. Perhaps I didn’t read the description well but I was able to squeeze it easily and it squeaked. I imagine this will be done after about a week of play. For the price, I shouldn’t have expected Kong level sturdiness but alas.",
      "rating": 3.0,
      "verified": true,
      "author": "Kaleena Erwin",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "Not for chewers!",
      "text": "My 10 month old Havanese demolished this in 5 minutes - literally - which was longer lasting than the other Hartz toy I got her at the same time and which has little nubs on the rubber. The little nubs meant the pup could grab on and rip immediately. This \"bone\", being smooth, took a few minutes longer for her to figure out how to sink her teeth into it and rip. No more soft Hartz toys for me; they are too easily destroyed by pups that like to chew.",
      "rating": 1.0,
      "verified": true,
      "author": "LW Raboys",
      "helpful_votes": 0,
      "publication_date": 20200401
    },
    {
      "title": "Fun for hours",
      "text": "Our dogs love this toy. Our oldest dog who is a small dachshund type dog was able to chew through the Rope. But he does that with many of his toys rope. I chose this brand because we fought a lot of their dog toy balls in the past and they've always been very durable. And the ball on this rope toy is very sturdy.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Ward",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "Maintains the scent.",
      "text": "I bought this for a friend's blind dog, and he loved it. I believed it would keep him active by seeking the scent when he dropped it, but that didn't happen. Once he lost it, he didn't bother to try to find it again. The smell was still there after a month or so, but the dog was interested only when somebody handed it to him, and he could chew on it a bit. It all depends on the animal, I think. Every one of them is different in their way.",
      "rating": 4.0,
      "verified": true,
      "author": "Carolo",
      "helpful_votes": 0,
      "publication_date": 20200926
    },
    {
      "title": "Such a great toy! Endless hours of fetch!",
      "text": "This toy is amazing! My dog loves it! I have an 80lb Goldendoodle who destroys EVERYTHING (toy wise) and I mean everything within days, sometimes minutes and this ball has held up for a week now and I don't see him being able to destroy it if he hasn't been able to thus far. For the price being under $2 I'm ordering several more.. he literally goes crazy over it, sleeps with it, he brings it outside when he goes to the bathroom.. doesn't let it out of his sight!",
      "rating": 5.0,
      "verified": true,
      "author": "Samantha",
      "helpful_votes": 0,
      "publication_date": 20200220
    },
    {
      "title": "Best ball for dogs that like soft textures",
      "text": "So the first time I ran into this ball was on a walk with my dog and he picked it up. It was his all time favorite ball and I didn’t have the heart to take it away from him. During our move we lost the ball and I decided to purchase one for him. He love love loved the softness and the grip textures of this ball. The softness and texture of the ball doesn’t give it a proper bounce but on a hardwood floor it is definitely something that gets him excited",
      "rating": 5.0,
      "verified": true,
      "author": "Christine Moon",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "Obsessed doggie",
      "text": "My dog is obsessed with these balls! She’s usually not toy obsessed but there’s something about these that she just loves. I’ll give her one and she won’t let it outta her sight for days. They’re pretty hearty balls, as there’s a thick layer of foam inside the rubber. She tends yo wear the squeaky out within a day (I’m fine with that) and the only thing that really destroys these balls are small holes over time which allows the inner foam to break down and spray out.",
      "rating": 5.0,
      "verified": true,
      "author": "boodger1",
      "helpful_votes": 0,
      "publication_date": 20200322
    },
    {
      "title": "Bright Orange",
      "text": "I received the bright orange color one- my 6 lb dog LOVES it! Perfect size and weight for her. Guess I better order another one and hope I get a different color. She is great at plying by herself - keeps herself entertained. Trying to teach her to fetch and bring the ball back, we run at about a 50/50 rate. But with this I can at least get it out of her mount, it is round with that nub sticking out on one side.",
      "rating": 5.0,
      "verified": true,
      "author": "M Dobson",
      "helpful_votes": 0,
      "publication_date": 20200726
    },
    {
      "title": "Dog- nip ball",
      "text": "Our dog just loves his ball it's like catnip but for dogs. He carries it around the house squeaking it all the time. Our only problem with the toy is the out side is not as thick as we were hoping and after a day of paying with the pall he broke the squeaker by putting a hole in it with his teeth. But it kept him entertained for hours flipping and throwing the ball himself. He doesn't want to share it with anyone not even to let someone else throw it for him.",
      "rating": 5.0,
      "verified": true,
      "author": "willis",
      "helpful_votes": 0,
      "publication_date": 20200130
    },
    {
      "title": "Stinky and scares my dog",
      "text": "The squeaker is the kind that makes a high pitched loud squeal as it *refills* with air, rather than squeaking as you push down on it. Which is fine but it scares the absolute sh** out of my poor dog, because it sounds like a scream/cry not like a playful squeak. Also this toy smells so strongly it stunk up my entire living room. It is not a good smell. Basically we had to retire it on day 1, so waste of money.",
      "rating": 2.0,
      "verified": true,
      "author": "Jackie",
      "helpful_votes": 0,
      "publication_date": 20190317
    },
    {
      "title": "My dog loves it, but not durable",
      "text": "I originally purchased this for my mom's dog who is a power chewer. Once it came in, I realized that she would destroy this thing within a matter of minutes. I ended up giving it to my dog, who does not chew on toys, and he loves it. He is very particular about his toys and this one is now one of his favorites. Ended up working out for us. Would not recommend for dogs to tend to destroy things; I don't think it would last.",
      "rating": 4.0,
      "verified": true,
      "author": "Blonde_Wanderer",
      "helpful_votes": 0,
      "publication_date": 20200417
    },
    {
      "title": "Not for power chewers, but all others will love them!",
      "text": "I have bought so many of these. My dogs love them! My husky goes nuts on the box when they come in lol. They do smell like bacon, bounce good. Between my husky and Jack Russell mix they manage to eat the squeaker out within a few hours. Maybe a day. I would not recommend these for power chewers. Ironically it’s the small pup that kills it every time lol. But my husky loves them so I keep getting them for her!",
      "rating": 5.0,
      "verified": true,
      "author": "Misty C.",
      "helpful_votes": 0,
      "publication_date": 20200702
    },
    {
      "title": "Perfect for dogs with sensitive mouths, not good for heavy chewers",
      "text": "This is my dog’s favorite toy! I would not recommend this ball for heavy chewers or dogs who are rough on toys. The rubber is very soft, which is why my dog with a soft, sensitive mouth enjoys these. Perfect for older dogs too that might have tooth issues. My dog is obsessed with the squeak; it’s quite loud. These balls last pretty long for us, but as I mentioned, my dog is very gentle with the balls (she just chases them and squeaks them, no heavy chewing).",
      "rating": 5.0,
      "verified": true,
      "author": "lilpinkbunny",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "My dog loves them",
      "text": "These toys, from my perspective, aren't necessarily the best. They last a decent amount of time, but they do eventually break and leave foam all over the place. The slick surface also makes it difficult to handle after it's been in my dog's mouth a few times. BUT, I've given a lot of toys to my dog and this is her favorite ball. Fortunately they're cheap, so I'm not bothered about their longevity. For reference, my dog is a heavy chewer. These last about 1 month before tearing, and 2 months before the tears start leaking foam and need to be thrown out. Since she love's them, I'd consider them a 5 star toy.",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan",
      "helpful_votes": 0,
      "publication_date": 20180929
    },
    {
      "title": "Labrador puppy loves these balls!",
      "text": "If you don't pull on the ball while in the pups mouth then it holds up real well. My lab loves them! I have several of them. He's a aggressive little 10 month old Labrador and loves chasing them and catching them in the air. I like them because they are easy on his teeth and last a long time IF you don't pull at them like my hubby did. Great deal,fun for pups & dogs & I will order again when I run low. Thank you. Jolie",
      "rating": 4.0,
      "verified": true,
      "author": "Jolie",
      "helpful_votes": 0,
      "publication_date": 20200303
    },
    {
      "title": "AD favorite",
      "text": "Let me start off by saying our dog LOVES this ball. We have bought two already (one for outside and one for inside) she loves playing catch with it and also just chewing on it. My only complaint with these is that the squeaker has stopped working in both of them and we have only had them for about a month. She has not managed to tear it up though which is great because she destroys every toy she gets within a few days!",
      "rating": 4.0,
      "verified": true,
      "author": "Kevin Papaleoni",
      "helpful_votes": 0,
      "publication_date": 20200303
    },
    {
      "title": "Not durable at all",
      "text": "The only reason this gets two stars is because my dog loved it, the name is so misleading. Duraplay makes me believe this thing should be a bit durable, so because my little guy is a bit of an aggressive chewer I got him a large bag for 50lbs and up according to packaging my little guy is thirty. He popped it in a day so the durability for a duraplay toy is very bad. It's quite disappointing. Not for aggressive chewers",
      "rating": 2.0,
      "verified": true,
      "author": "jess",
      "helpful_votes": 0,
      "publication_date": 20200215
    },
    {
      "title": "The absolute best for dogs that ruin toys in seconds",
      "text": "The best ball ever! I bought my husky three of these balls and they are the only toy she has yet to tear apart or chew through in the matter of minutes. I’ve had them for over a month now and not a single hole in them. They are great! And they still smell Like bacon. She is obsessed with these. Almost annoyingly obsessed 😂 I got her a similar ball from target and she tore through it in the matter of minutes. These are great !!",
      "rating": 5.0,
      "verified": true,
      "author": "jessie j",
      "helpful_votes": 0,
      "publication_date": 20200515
    },
    {
      "title": "Great, UNTIL...",
      "text": "I am SO bummed! I bought this for the beastie, and we both LOVED it! He loved to play with it, fetch it, chew it, and squeak it. He liked it so much that I ordered the larger size bone, two of the large balls, and a rubber critter, all of which he loves. This little bone seemed so much more durable than other brands of squeaker toys, until...he got a tiny tear in the rubber. He was able to chew it open and eat a little of the white gummy substance inside. I can only hope it's not toxic!",
      "rating": 1.0,
      "verified": true,
      "author": "Carol E.",
      "helpful_votes": 0,
      "publication_date": 20190918
    },
    {
      "title": "I guess it does smell like bacon 🥓",
      "text": "My 60 pound labradoodle was completely uninterested in this. I thought I wasted a couple bucks which wasn't a big deal but an hour later it's the only toy from Christmas that he's interested in. The squeaker is extremely loud and annoying but he's more interested in chewing on it like it's a treat and not a squeak toy. He hasn't tried to destroy it which is odd but it must be the scent because he keeps going back to this one.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve V.",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "Wish they made a \"tough\" version...",
      "text": "My 9 year old lab/great dane LOVES these balls - she treats them like they are her baby. She is not intentionally rough with them (though, she keeps them in her mouth and chews them constantly), however, they only last about a week or so in our household - so we have to buy them in bulk. I wish they made a tougher version for dogs that are chewers / tough on toys - I would gladly pay for for something like that. Other than that, I can't fault the product for the fact my dog is obsessed with them - and that's okay. I would highly recommend these.",
      "rating": 5.0,
      "verified": true,
      "author": "0REDSOX7",
      "helpful_votes": 0,
      "publication_date": 20190315
    },
    {
      "title": "my dog LOVES the Hartz dura play",
      "text": "My dog entertains herself to exhaustion with this toy! It's a puppy pleaser and if the puppy is active and entertained then I can get my work done! We also play fetch with it- other duraplay toys she was able to choose the ends off and had to be thrown away but she loved them!!! I'm hoping this one being a ball with a rope that she won't be able to chew into it.",
      "rating": 5.0,
      "verified": true,
      "author": "ali",
      "helpful_votes": 0,
      "publication_date": 20201008
    },
    {
      "title": "My 2 year old border collie loves it (large ball)!",
      "text": "My 2 year old border collie, Brandy, loves this toy (large ball). Seems durable, but time will tell. It must have a weird feel to it because Brandy doesn't really like to chew on it, which is nice because she gives it right back to me after fetching. She will come running back with it and practically throw it to me to get it out of her mouth! It's a great price (< $5), and we will definitely be buying more!",
      "rating": 5.0,
      "verified": true,
      "author": "H. Hagedorn",
      "helpful_votes": 0,
      "publication_date": 20200411
    },
    {
      "title": "Worth the money in my opinion",
      "text": "This toy was the only toy I saw my dog play with for a solid 3 days after I revived it. Which is very unusual because tennis balls are usually the go to. This toy became the go to toy for approximate the three weeks it lasted. The squeaker kind of went out after about a week and a half and then it ripped from trying to pull it out of my dogs mouth. She eventually found the hole and was trying to eat the toy so we had to take it away. (Taking away broken toys is very typical) she definitely got the moneys worth out of this toy and I am purchasing another one.",
      "rating": 4.0,
      "verified": true,
      "author": "Hannah",
      "helpful_votes": 0,
      "publication_date": 20200308
    },
    {
      "title": "Great for playtime!",
      "text": "I’m a dog walker & many of my puppy clients love to run & play fetch. It doesn’t matter how many different balls I have with me, this is the only one they ALL want. Yesterday I had 3 dogs chasing each other for this squeaky ball. Today, a formerly nervous, 8 year old pup played fetch for the first time in her life! I wouldn’t use this with strong chewers. My own pups would shred it within a minute. Watch your dogs with it because it’s not a hard toy. But for outside supervised play, it’s great!",
      "rating": 5.0,
      "verified": true,
      "author": "Julie",
      "helpful_votes": 0,
      "publication_date": 20200401
    },
    {
      "title": "My Dog Loves it.",
      "text": "My dog loves this ball. He carried it around for 2 days straight. Its soft, large and squeaks. only reason I gave 4 out of 5 stars was the packaging. It has four zip ties holding the ball to the cardboard, those zip ties go into the ball itself, so you can't completely take they off. I had to try yo push the ball down to cut as far down as I could to cut the tie. other wise it left a sharp point on the ball.",
      "rating": 4.0,
      "verified": true,
      "author": "Mary",
      "helpful_votes": 0,
      "publication_date": 20200224
    },
    {
      "title": "Fun for our pup",
      "text": "Our pup loved this toy until the squeaker quit squeaking. She will still chase it but she absolutely loved that it squeaked! The side of the ball has a small hole but don’t think it’s bad quality. She never tried to tear the ball up. If your dog takes squeakers out of things it wouldn’t hold up, but she would pounce on it. For our use it was sturdy (meaning the ball didn’t come apart) but sad the squeaker didn’t last longer.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristin J",
      "helpful_votes": 0,
      "publication_date": 20200302
    },
    {
      "title": "Durable and fun!",
      "text": "My 3 dogs love these and have never destroyed one yet! That's a Goldendoodle, Golden Retriever and Chug. Smells like bacon? I'm not so sure about that, but they don't seem to care, they love them!",
      "rating": 5.0,
      "verified": true,
      "author": "M. Renner",
      "helpful_votes": 0,
      "publication_date": 20200907
    },
    {
      "title": "Great toy, disappointing durability.",
      "text": "My dog absolutely loved this bone......for the day we had it. The bone is a flexible rubber layered over a foam core. Great for throwing in the house unlike most dense rubber bones. Unfortunately, by the end of the evening my Boston had chewed the squeaker out and was starting to choke on the inner foam portions of the bone. Threw it away for safety concerns. It’s a shame considering how much she enjoyed it.",
      "rating": 1.0,
      "verified": true,
      "author": "Ryan",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "It’s big, but also an ideal tug toy",
      "text": "I bought this for my 2lb dachshund puppy, but it’s about the size of him! He’ll nibble it but does prefer other toys. My 4 year old dachshund loves it though, she loves the squeak and smell! It’s very high quality and durable, however will not be durable for bigger dogs that are chewers and intense players. It’s made of pretty pliable, soft rubber, so big chewers may go through this quickly. Not to say I don’t recommend it, because I DO! It’s a great toy!",
      "rating": 5.0,
      "verified": true,
      "author": "Leah",
      "helpful_votes": 0,
      "publication_date": 20200215
    },
    {
      "title": "Loud but my dog adores it!",
      "text": "My 70 pound St Bernard mix LOVES this ball. The squeak is so loud! It sounds like a loon or a baby crying. The first time he gave it a good squeeze he scared himself and ran away! Once he got used to it though, he can't stop playing with it. It bounces all over. He's not a super chewer but if he was, this ball wouldn't last long, it's thin. It's really bouncy so he can occupy himself for a bit too.",
      "rating": 4.0,
      "verified": true,
      "author": "Allie",
      "helpful_votes": 0,
      "publication_date": 20200226
    },
    {
      "title": "My dog LOVES these!  BUT........",
      "text": "Durability, sturdiness, and longevity??? Those were the options for 1-5 stars,..... seem like all the same thing to me. Anyway, my 7lb Maltese LOVES these things! His favorite toy by far!!! I always have 2 or 3 on hand because he ends up eventually tearing them open and pulling out the foam inside. They last about 2 weeks for him. I ended up getting a medium sized one that lasted longer and even though he's so small, I think he prefers the medium sized one. (small one in picture)",
      "rating": 5.0,
      "verified": true,
      "author": "Reviews4U",
      "helpful_votes": 0,
      "publication_date": 20190611
    },
    {
      "title": "Puppy loves it",
      "text": "This is by far my dogs preferred toy. I happened to grab it because it was on sale and I saw some bad reviews but I figured I’d try it as I’ll give my 4month old puppy anything she will willingly chew on and won’t destroy my house. She carries this bone around with her. She takes it outside, she brings it back in, she plays with the kids with it and she plays alone with it jumping on it to make it squeak.",
      "rating": 4.0,
      "verified": true,
      "author": "Kadie G.",
      "helpful_votes": 0,
      "publication_date": 20200322
    },
    {
      "title": "Dangerous packaging. Why?",
      "text": "I do not understand what the company was thinking when they used 4 separate swift tacks to attach the ball to the cardboard? I've used a cuticle scissors, a tweezer, you cannot fully remove the tack so you have 4 sharp plastic nubs that the dog can cut their mouths on when playing. HOW DISAPPOINTING. I took the rating down on a decent product because of this hazard. Might not look like much, but run your finger over it to understand. Can't even push it in, when they bite down you still feel or worse it protrudes further",
      "rating": 2.0,
      "verified": true,
      "author": "Karen",
      "helpful_votes": 0,
      "publication_date": 20200226
    },
    {
      "title": "Dura Play...more like rips-in-minutes-and-disperses-foam-pellets-all-over play!",
      "text": "This ball is not filled with air but is instead filled with polyester pellets. Those pellets will be all over your house in 2-15 minutes depending on your dog’s chewing strength. My pup decimated his in 5 minutes. It’s too bad because he loved the sound (very loud squeaker, but it becomes defunct very quickly), and texture of the ball. A real waste of money and time!",
      "rating": 1.0,
      "verified": true,
      "author": "T.C.",
      "helpful_votes": 0,
      "publication_date": 20200709
    },
    {
      "title": "Dog approved",
      "text": "My dog loves these bones. He loves that they squeak and will chew until he eventually gets the squeaker out. They last sometimes longer than other times just depends on how often he’s chewing on it. I do however wish the material was slightly stronger to keep him from getting into the stuffing material. But we will continue to buy as long as our four legged baby plays with them.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica Davis",
      "helpful_votes": 0,
      "publication_date": 20200626
    },
    {
      "title": "Labrador resistant",
      "text": "My dog has had a couple of these Dura Play toy since he was a puppy. One of them was finally ripped apart a few weeks ago. The last one survived 11 years, didn't squeak consistently for many years (good by me), but was still in one piece. Being a dog mom of a big boy, those are the only non disposable toys we had, anything else was destroyed in 5 minutes. When the new one arrived my baby was all happy and showing off to everyone. Now for us to deal with the squeaky noise again (he loves it though).",
      "rating": 5.0,
      "verified": true,
      "author": "Deb",
      "helpful_votes": 0,
      "publication_date": 20190414
    },
    {
      "title": "Loved by our dog",
      "text": "Idaho scary couple of Christmas toys and this is the one he likes the best. He treasures have enough that he is not chewing it up. he tries to get out of her sight and hide it somewhere. We work hard to not let him take it out of the house. We keep finding it under beds and tucked behind piles of things. When you find it he is nervous until he is able to have it back and go hide again. Definitely got our money's worth.",
      "rating": 5.0,
      "verified": true,
      "author": "PHS Doc",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "Piece of junk!",
      "text": "Do not buy this item. The reviews must have been made up by the manufacturer because this dog toy is not at all what it claims to be. Not durable, lasted only 4-5 minutes and definitely not sturdy, ALL OF WHICH were claimed by the reviews being written. My dog (not even 25 lbs) had it apart in minutes. He was having so much fun with it until I noticed he had it ripped apart and I had to take it away, fearing he would choke on the pieces!",
      "rating": 1.0,
      "verified": true,
      "author": "MB",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "These are awesome, depending on your dog",
      "text": "My dog has a bad habit of destroying toys... very quickly. But I randomly bought one of these a few years ago, and something changed in him. All of a sudden, I would throw one, and he would bring it back and drop it at my feet. In order to get him his exercise, we play fetch with these nightly. As a result, the little doggo has put on 6 pounds of muscle. he's a monster of a Yorkie. I buy 3 or 4 of these every few months, as he'll eventually gnaw some holes in them. But for him, that's basically the equivalent of forever. So for that, I wholeheartedly endorse this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Britt Hafner",
      "helpful_votes": 0,
      "publication_date": 20200121
    },
    {
      "title": "Our boxer loves it!",
      "text": "We have a 7 year old boxer that loves to chew. He has always been able to chew the squeaker out of every toy...until now. He has had the large bone for 24 hours and has not even a bite mark in it. Typically he chews the squeaker out within 10 minutes. He has tried but has not been able to. The material is soft and rubbery and he likes the feel of that. Great chew toy and you can't beat the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200227
    },
    {
      "title": "Honeys favorite toy!",
      "text": "My doggies favorite toy, upon the dozens we have bought for her, she always chooses this one. She never leaves home without it and she never let's it out of her sight. She gets anxiety when left home alone but upon viewing her on pet cam she lays and cuddles with her squeaky bone. It's like her baby and helps keep her calm. Love it and love how durable it is after over a year its held up well and still squeaks.",
      "rating": 5.0,
      "verified": true,
      "author": "Neeners503",
      "helpful_votes": 0,
      "publication_date": 20200315
    },
    {
      "title": "As durable as wet toilet paper...",
      "text": "My parents have the older version of this toy and my dog absolutely loved it when we visited. Went ahead and ordered my own, but the quality has greatly changed. The description states durable for all dogs and ages. I have an eight-year-old golden retriever who was able to rip it open and pool. Being out in under five minutes. The bigness of the leg checked exterior was just slightly thicker than surgical late text gloves. Not sure what happened to the build quality but will be requesting a refund immediately. Please note, once the dog was able to open the product, he started eating and swallowing the foam inside. Very dangerous product!!",
      "rating": 1.0,
      "verified": true,
      "author": "Roger A. Hughes",
      "helpful_votes": 0,
      "publication_date": 20190709
    },
    {
      "title": "awesome!",
      "text": "our pitty just loves this ball!! it definitely smells like bacon-has a good little bounce--and the squeaker is good n loud-lol- Copper (our pitbull mix) has been playing with it nonstop for the past 2 weeks and has no torn it up and the squeaker is still working--better than all his other toys-i think he prides himself on how fast he can \"kill\" the squeaker-i highly reccomend this for any rambunctious furbaby you may have",
      "rating": 5.0,
      "verified": true,
      "author": "Camie",
      "helpful_votes": 0,
      "publication_date": 20200224
    },
    {
      "title": "My dog’s favorite toy!  Sturdy squeaky ball—",
      "text": "Our dog absolutely loves this ball. It’s his favorite toy. It’s well made and easy for him to pick up and run with. He loves to chew on this ball because of the squeaker and the soft rubber-y texture, and yet he hasn’t destroyed one yet. The exterior has a raised pattern that also makes it easier to grab. Thanks to the amazing price, once I saw how much he loved this ball, I came back and purchased him several more to keep all over the house.",
      "rating": 5.0,
      "verified": true,
      "author": "CarolinaMermaid",
      "helpful_votes": 0,
      "publication_date": 20190821
    },
    {
      "title": "Very functional and durable",
      "text": "I have lost track of how many balls I have bought for our blind dog, but this is by far the best one. It is just the right size for a small dog and made of durable rubber. I believe it has a small bell inside, and I managed to force a small marble through the little hole in the side of the ball. Now it really makes noise as it rolls across the floor and it is very easy for our blind dog to follow where it went. He adores it and spends lots of time just carrying it around and gnawing on it with his teeth so I squeaks. It still looks brand new.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181116
    },
    {
      "title": "My mostly toothless Hairless Chinese Crested rescue can pick these up with ease!!",
      "text": "I was fortunate to find my little Lucy 8 years ago. All of her side teeth were gone, however. Growing up around dogs I'd never seen a dog without teeth. It always tugs at the heart to see her trying to pick up a ball to play, only to drop it. I recently found THESE and let me say ... Lucy is in doggy heaven. She grabs them with ease and makes em squeak like crazy. Originally I bought 3. Since, I've bought another 10 so when they lose their squeakiness, I'll have back-ups. It's GREAT to see her have as much fun as other dogs do! THESE ARE GREAT!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "bluetear",
      "helpful_votes": 0,
      "publication_date": 20181015
    },
    {
      "title": "My dog loves these. Will continue buying them.",
      "text": "I love these toys. The bones and balls are big hitters with my GSD pup. He loves the squeak and the squish. He does puncture them after a while so they don't really squeak after but he still loves them. About a month of heavy use tends to leave them kind of smelly so that's about how long I keep any 1 toy. I will keep buying these for as long as my pup has teeth.",
      "rating": 5.0,
      "verified": true,
      "author": "Hbugg96",
      "helpful_votes": 0,
      "publication_date": 20200530
    },
    {
      "title": "Very Loud Squeak, but Very Durable",
      "text": "6 month old, 50lb, pit mix puppy loves this ball so much. It is extremely durable, and his favorite squeaker because it squeaks SUPER LOUD. Since his adult teeth started coming in, he totally destroys toys; we are lucky to get 3 days out of a toy. But this has held up fantastically, so far, and it is light enough that it won't hurt your walls if it bounces into them.",
      "rating": 5.0,
      "verified": true,
      "author": "Sunahm",
      "helpful_votes": 0,
      "publication_date": 20200426
    },
    {
      "title": "My dog’s favorite toy!",
      "text": "This is my Lab’s absolute favorite toy. In 5 years, I’ve never seen her be so attached to a certain toy. It’s pretty durable, but over time she does manage to puncture it, killing the squeak, but has yet to be able to tear it up.. The bright color makes it easy to find during fetch. The scent of the ball isn’t super heavy, but the ball also never loses it’s smell, so we both win. 100% recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "4th Generation Orangeite",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "Dog's favorite toy",
      "text": "I don't know what's so special about this toy, but we've bought several (because they don't last long, they aren't thick or tough plastic) and they are always the favorite of our dog. Maybe it's the way it easily fits in his mouth while he's playing or maybe the scent, but he loves it. I don't smell the bacon scent after a few months, but maybe he still does? But for this price, you cannot go wrong!",
      "rating": 5.0,
      "verified": true,
      "author": "kfh",
      "helpful_votes": 0,
      "publication_date": 20200325
    },
    {
      "title": "Helps Message Gums With Every Fetch Too",
      "text": "I have an active Maltese puppy that is over the moon for this T~Tiny bone shaped dog toy. This brings her SO much excitement with each fetch due to the squeaker. This has stood up to extra-tough play, and hours of her just gnawing on it. This has held up well..I haven’t seen any problem with this breaking down what so ever. Perfect for small dogs...Happy with my purchase",
      "rating": 4.0,
      "verified": true,
      "author": "Shann 🎀 Shann",
      "helpful_votes": 0,
      "publication_date": 20200303
    },
    {
      "title": "My dog won't touch it :(",
      "text": "For some reason my dog won't put this in her mouth. She will run after it if I throw it, sniffs it and then walks away. I have tried several different ways of playing with it but she doesn't want to put it in her mouth. We don't have a lot of toys for her (which is why I bought this one) but in general she's playful. Wish I could ask her why she doesn't like it!",
      "rating": 3.0,
      "verified": true,
      "author": "book nerd",
      "helpful_votes": 0,
      "publication_date": 20200422
    },
    {
      "title": "Great for very small puppies",
      "text": "I bought this for my 2lb (11 week old) chihuahua puppy. It’s perfect for him. He absolutely loves it! He’s teething right now so sometimes he just sits with it and really goes to town chewing it. We play fetch with it too. He is tiny, but when he bites it with some force he can make it squeak. I like that it is soft for his tiny puppy mouth. For a dog his size, it is very durable and perfectly sized. I wouldn’t give it to a larger puppy though.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200324
    },
    {
      "title": "Durable.",
      "text": "My dogs LOVE this ball. The reason I'm knocking off one star is based on how the product is packaged. The cardboard part is secured into the ball with plastic. There's no way to get the little plastic parts out of the ball and they're pretty sharp /pokey. If they're going to be made like this, then could at least make it so when you cut the plastic you can pull the other side out.",
      "rating": 4.0,
      "verified": true,
      "author": "Arrynt",
      "helpful_votes": 0,
      "publication_date": 20200123
    },
    {
      "title": "This little ball is pretty doap",
      "text": "After i've thrown the ball for 30 minutes straight homegirl will start chewin on it and flinging it around and nomming for 5 minutes straight before i take it away. Usually she rips things within seconds but this ball has actually been holding up. I stopped with squeaking toys because they can get pretty loud, but decided to grab a squeaker ball. She's forgotten what squeaky toys are and loves it all over again.",
      "rating": 5.0,
      "verified": true,
      "author": "Danny C",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "My dog loves the challenge of destroying these but he still plays with them",
      "text": "I have a Siberian husky and he loves these squeaky balls. It used to take him a week or more to figure out how to chew out the squeaker but recently he is down to doing it in one day. For normal dogs that don’t try to tear everything apart they are a good value. My dog however enjoys the challenge of pulling out all the foam inside also. He still plays catch with them when he is done. It is good product for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "LuAnn Hudson",
      "helpful_votes": 0,
      "publication_date": 20200408
    },
    {
      "title": "Our Dr. Destructo hasn't destroyed these yet.",
      "text": "You wouldn't think a 10 pound shih tzu/bichon mix would be such a holy terror with toys, but our lil critter destroys everything. If it says it's hard to destroy, he takes especial delight in ripping it to shreds. Doesn't matter what it is- stuffie, ball, frisbee, nylabone- all trashed within days. But we got him two of these 6 or 7 months ago and they're in perfect condition. We expected them to last minutes, not months. Very happy with these!",
      "rating": 5.0,
      "verified": true,
      "author": "Cams and Jers Mom",
      "helpful_votes": 0,
      "publication_date": 20200928
    },
    {
      "title": "Dog LOVED it...as long as it lasted",
      "text": "Our dog LOVED this ball, and the smell. But, it's very thin plastic, and he had it torn apart and was eating the plastic in about 5 minutes. If you dog doesn't eat his toys, even when they smell like bacon, then you might have better luck. But, for us? This was a complete waste of time and money. I will not buy it again.",
      "rating": 3.0,
      "verified": true,
      "author": "Amy M Ralph",
      "helpful_votes": 0,
      "publication_date": 20200726
    },
    {
      "title": "Ridiculously wonderful!",
      "text": "These are the best squeaker chewy toys. We have the bone & the ball and it is only toy that lasts. Probably had the first one over a year before it needed to be replaced. She's a 60 pound American bulldog mix with a high prey drive who can destroy any other toy within 15 minutes. Most definitely my dog's favorite toy. She picks it up EVERY day, multiple multiple times either offering to play with us or just enjoying chewing on it herself. She seems to enjoy the orange/red color more than the purple. I think she also uses it to try and talk with us. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170716
    },
    {
      "title": "My dog loves it",
      "text": "The squeaker is really annoying for the humans, but boy does the dog love it. We have a sheep dog/poodle cross and she is really hard on chew toys. She shreds balls and destroys rubber, but this ball and the bone by the same company are her favorite and have proven much more durable even against her teeth. Can't complain and may get another one.",
      "rating": 5.0,
      "verified": true,
      "author": "Jana Stocks Brown",
      "helpful_votes": 0,
      "publication_date": 20200316
    },
    {
      "title": "Husky Proof - and they love these.",
      "text": "I bought three of these for my three Siberian Huskies. These dogs destroy all the toys that say sturdy, Doberman proof, etc.... They are 90 second masters at removing squeekers too. But these balls after almost two weeks are in good as new condition. They love them too and have played with them quite a lot. A great find for dogs that destroy other toys.",
      "rating": 5.0,
      "verified": true,
      "author": "Kirbinster (Howard)",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "MY DOG ENJOYS",
      "text": "My dog wasn't sure about this toy at first, he gave me a funny look when I squeaked it. Now he loves it, but the squeaker is damaged. When you squish it down it doesn't squeak, but when you release it it does squeak. He doesn't really squeak it, he mostly just chews on it or carries it around. He still loves it though. If your dog loves toys that squeak then I recommend this. It also has a strong scent.",
      "rating": 4.0,
      "verified": true,
      "author": "Chloe Steiner",
      "helpful_votes": 0,
      "publication_date": 20200605
    },
    {
      "title": "NO idea how this holds up to my aggressive CHEWER",
      "text": "The first ball I ordered like this was an add-on for less than $3. I figured, why not. My lab puppy was tearing through EVERYTHING. I was determined to find her some stuff that would last. Enter this ball. We have had our original version for six months now and there is literally zero damage on it. I think she is attracted to the squeaky noise, so she doesn't try to tear it up? Anyway - this is a second ball because, why not? At least she isn't eating my couch pillows anymore . . .",
      "rating": 5.0,
      "verified": true,
      "author": "Lindsay Thompson",
      "helpful_votes": 0,
      "publication_date": 20181222
    },
    {
      "title": "Our dog loves his new toy.",
      "text": "Our German Shepherd is fourteen years old, so the softer material is good for him. He enjoys biting the ball to make it squeak and insists on dropping it in his food dish while he eats. Maybe the bacon scent gets on the dog food and makes it taste better😊. This is the third ball of this type he has had. The first one lasted about two years before the ball got cracked and needed to be thrown away. He still has the second, medium sized ball, and now the new large one.",
      "rating": 5.0,
      "verified": true,
      "author": "Elzza",
      "helpful_votes": 0,
      "publication_date": 20190118
    },
    {
      "title": "Dog loves it but...",
      "text": "Ok, my dog loves these balls however we're on our 5th ball. The first day he breaks the squeaker, the 3rd week it usually gets cracks, and the 'bacon smell' really smells like a cow's ass. With all of this being said you would wonder why I continue to buy these balls? They are overpriced for what I mentioned. But lets go back to my first sentence .. my dog loves these balls :-( So my average is 3 Stars ..",
      "rating": 3.0,
      "verified": true,
      "author": "Just Me",
      "helpful_votes": 0,
      "publication_date": 20190816
    },
    {
      "title": "Best if your dog has lost all of it's teeth",
      "text": "It was fun for the dog, annoying for me, like typical dog toys. This lasted about 15 minutes before my dog removed the squeaker and the toy ceased to be fun, so now it sets in the toy basket until I feel it's ok to let it go, no one will play with it anymore. My dog will tell you that the 15 minutes of joy was well worth it, don't listen to the dog.",
      "rating": 2.0,
      "verified": true,
      "author": "Kristin",
      "helpful_votes": 0,
      "publication_date": 20200218
    }
  ],
  "product_meta": {
    "title": "Hartz DuraPlay Bacon Scented Dog Toys",
    "description": "Size:Medium| Style:BallFeel the difference with Dura Play natural latex dog toys. Each toy provides long-lasting fun utilizing foam technology that enhances durability, creating an unmatched chew experience with an enticing bacon scent dogs go crazy for. Fun to throw and bounce, Dura Play toys even float and are easy to clean. Soft and flexible to the touch, each fun shape is perfect for dogs of all ages. Remember to supervise your pup with any toy.",
    "rating": 4.3,
    "feature_bullets": [
      "Fun to throw and bounce, Dura Play toys even float and are easy to clean.",
      "Soft and flexible to the touch and perfect for dogs of all ages, even senior dogs and teething puppies.",
      "Exterior is made of firm natural latex for durability, interior consists of a unique foam technology for a chewier bouncier toy and a squeaker.",
      "Irresistible bacon scent dogs love."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "3 x 4.13 x 8 inches; 0.32 Ounces",
      "Item model number": "3270014800",
      "Date First Available": "January 1, 2009",
      "Manufacturer": "Hartz",
      "ASIN": "B00MCN9ZY0",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Chew Toys",
      "Dogs",
      "Toys",
      "Pet Supplies"
    ],
    "price": ""
  }
}