{
  "website_summaries": [
    {
      "verdict": "A sturdy commercial-grade machine with a reasonable price; it can turn out two to three servings per minute.",
      "pros": [
        "Makes cotton candy fast and is easy to disassemble for quick cleanup"
      ],
      "cons": [
        "Takes 5 minutes to reach optimum heat",
        "Tends to vibrate when in operation"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "sparks flew; it does not work",
      "text": "I just received this machine today. I followed all of the instructions, turned on the power button, turned on the heat button...and immediately sparks flew out the side of it. I just sent a message to VIVO through Amazon. I'm hoping to hear back soon. If I get a replacement, then I will revise this review. But, it's fair to say that I have two really disappointed kids even though they did enjoy the sparks flying quite a bit.",
      "rating": 1.0,
      "verified": true,
      "author": "C. Knight",
      "helpful_votes": 32,
      "publication_date": 20170518
    },
    {
      "title": "Great little machine",
      "text": "Great little machine. I sold it and got a bigger professional model and boy do I regret it. This machine is super easy to use and customers love the cotton candy made with hard candies. I will probably buy another one in the spring. The professional machine is such a pain to use and can't do near as much as this little one.",
      "rating": 5.0,
      "verified": true,
      "author": "kayscrochet",
      "helpful_votes": 21,
      "publication_date": 20180106
    },
    {
      "title": "For the grandkids",
      "text": "I got it for the grandkids but I getting a lot more use out it. It's easy to use and fun.",
      "rating": 5.0,
      "verified": true,
      "author": "Karl",
      "helpful_votes": 16,
      "publication_date": 20181024
    },
    {
      "title": "The real deal!",
      "text": "Surprised to get such a big basin. I didn’t realize this was the real deal. Dropped hard jolly Ranchers in the middle and watched it melt to make a few sticks of green apple cotton candy. Good enough for fun. Great for parties. Maybe better to make it an outside thing. It makes a bit of a sugar web on the ceiling if you turn away from it. Make sure you wait and collect all it makes, otherwise you miss some good treats and have candy webs everywhere. Wife and I are considering a plastic cover they suggested in directions but they cost about the same as the machine.",
      "rating": 5.0,
      "verified": true,
      "author": "AnOk AmazonCustomer ",
      "helpful_votes": 12,
      "publication_date": 20190222
    },
    {
      "title": "Backyard Carnival was a success!!",
      "text": "Vivo Cotton candy Machine, works perfectly! So glad I purchased the separate 20\" cover! It catches a LOT of sugar & floss! Also kept the 40 small children hovering around waiting, from getting their hands/faces too close!!! Thank you for making my sons 1st Birthday perfect!!",
      "rating": 5.0,
      "verified": true,
      "author": "Christina M. Dailey",
      "helpful_votes": 16,
      "publication_date": 20170807
    },
    {
      "title": "This machine is not durable at all and has disappointed us twice in a row",
      "text": "Bought 2 of these at this point. 1st one started sparking out the back so we unplugged it and threw it away. Decided to give the product one more time and this time it simply just won't turn on and we only used it once. And no we didn't submerged it in water when we cleaned it. This machine is not durable at all and has disappointed us twice in a row.",
      "rating": 1.0,
      "verified": true,
      "author": "Edwin",
      "helpful_votes": 16,
      "publication_date": 20171009
    },
    {
      "title": "make  candy ion 5 seconds  no  wateing  clean turn off  in the  elect use it  fast  cheeper",
      "text": "made 10 in about 11 minutes use clean tub when hot with water and steam cool down clean holding tub also has a safty can not be turned on unless all is lached , by kids so always leave 1 unlached if you have one that would like to try , when your not round they might try it, wont work unless all are lached in place it is great we love it...",
      "rating": 5.0,
      "verified": true,
      "author": "Opossum",
      "helpful_votes": 4,
      "publication_date": 20181127
    },
    {
      "title": "Died 2nd Use",
      "text": "Great fluffy cotton candy but it died after 2nd use. Started sparking so we turned it off. When we turned it back on it Puls no longer spin.",
      "rating": 1.0,
      "verified": true,
      "author": "Dallas",
      "helpful_votes": 13,
      "publication_date": 20170616
    },
    {
      "title": "Great Machine for price.",
      "text": "The shipping was quick and the machine arrived in great condition. We have used it a couple times and it started right up with no problems. We will be using it at a larger event this weekend and we are hoping it does just as well. We were excited that it came with a spare belt/part as well. UPDATE: We used our machine for a huge event this past weekend and it worker great, we tested it a few times the week prior without trouble! We made about 300 cotton candy cones and ran it for several hours and had no problems!! Definitely a great machine!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20190627
    },
    {
      "title": "Do Not Purchase!!!!! Mine only worked once.",
      "text": "I rarely post bad ratings but I have no choice. Had the chance to use this one time. I pulled it out for a second time with in two weeks of using it the first time and it didnt work. I reached out for assistance with no response. I feel like I just gave away $200 and am very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Terri M",
      "helpful_votes": 4,
      "publication_date": 20190922
    },
    {
      "title": "Does what it says it does.",
      "text": "Once you learn how to twirl the paper cones, you make huge fluffy cotton candy cones every time. Double charge the head for the first run. I have a small arcade in my house with pinball machines. The grand kids, or even old kids, love this thing. Great machine, obviously commercial; may out live you.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel Staggers",
      "helpful_votes": 4,
      "publication_date": 20181103
    },
    {
      "title": "I am very disappointed with this purchase",
      "text": "I am very disappointed with this purchase. I was using it and sparks started flying and the wires melted.",
      "rating": 1.0,
      "verified": true,
      "author": "Adelina",
      "helpful_votes": 10,
      "publication_date": 20171231
    },
    {
      "title": "Awesome Cotton Candy Machine",
      "text": "Fantastic machine! Easy to assemble (assembled by my 13 yr old) in less than 5 min. Easy to work...my 9 yr old can even make it by herself. Terrific tasting cotton candy...just like the fair. Let it warm up for 5 min; put sugar in & starts making floss in less than 5 seconds; made completely in less than 15 seconds.",
      "rating": 5.0,
      "verified": true,
      "author": "Rae Schultz",
      "helpful_votes": 10,
      "publication_date": 20170112
    },
    {
      "title": "Gotta Practice use!",
      "text": "This machine works very quickly and makes really good cotton candy! You just have to practice a bit before you can do it for a crowd! First run for us, we had cotton candy on the ceiling!! 😆",
      "rating": 5.0,
      "verified": true,
      "author": "D. HOCK",
      "helpful_votes": 3,
      "publication_date": 20190407
    },
    {
      "title": "Good product",
      "text": "This does not come with the guard, which you need or you will have cotton candy everywhere. It stopped working correctly after a day of use. I called customer service, they were very helpful and sent me out a replacement belt at no charge. The belt was easy to change out and fixed the problem.",
      "rating": 3.0,
      "verified": true,
      "author": "BKE",
      "helpful_votes": 3,
      "publication_date": 20181214
    },
    {
      "title": "You need to buy the top too!",
      "text": "Impossible to clean the head. Does NOT come with a top. One would think for the price that it should considering you absolutely need the top. We tried it without the top and cotton candy end up flying everywhere. Also, not sure if this is a design flaw but more cotton candy ends up on the side of the drum than on the stick. However the cotton candy it did produce was perfectly fine.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20190304
    },
    {
      "title": "Awesome machine it's a commercial grade machine and well worth ...",
      "text": "Awesome machine it's a commercial grade machine and well worth the money , we had one we paid like 50.00 bucks for and it only worked a couple of times. This one is so much better and it was able to keep up with the demand for cotton candy at my nephew's birthday party. It was a big hit with all the kids , young and old alike.",
      "rating": 5.0,
      "verified": true,
      "author": "Amy Miley",
      "helpful_votes": 4,
      "publication_date": 20171221
    },
    {
      "title": "It doesn’t get better than this machine!",
      "text": "This Cotton Candy Machine is da bomb! To say we love it, is an understatement! Every weekend we use it for family friends and it is literally the highlight of everyone’s evening. Our next project is to make a bag of cotton candy for the Hospital employees our son-in-law works with. It should be a great and welcomed treat for everyone. Thank you for such a GREAT MACHINE...it’s PRETTY, EASY TO USE and makes Cotton Candy that TASTES ABSOLUTELY HEAVENLY. And to finish things off...it’s EASY TO CLEAN too! HIGHLY RECOMMEND! ❤️❤️❤️❤️❤️",
      "rating": 5.0,
      "verified": true,
      "author": "Corralesgal",
      "helpful_votes": 0,
      "publication_date": 20200815
    },
    {
      "title": "Kids and neighbors love it!",
      "text": "Very happy with this purchase. Produces a lot faster than the $60 machines. Definitely worth it if you have neighbors and you don’t want to be spinning all night. We had it out and going within minutes. We’ll be outside a lot this fall and plan on bringing it out frequently for the kids. The separately-purchased lid is not necessary if you catch the cotton candy directly out the top of the center spinner (so the cone is held horizontally right over the middle) rather than circling it around the bowl. The kids LOVED it.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer Duda",
      "helpful_votes": 0,
      "publication_date": 20200906
    },
    {
      "title": "Over Priced",
      "text": "This machine is smaller than I expected and the company's secretary was RUDE, when I called this morning about my purchased. This is item is way over priced and it don’t come with anything. I wouldn’t recommend it to anyone go to another website and get more for your money with friendly customer service.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20190513
    },
    {
      "title": "Fun!",
      "text": "So fun for parties or camping! Kids love this! To rent a unit similar I spent $80. So this will end up saving me money in the long run.",
      "rating": 5.0,
      "verified": true,
      "author": "busybee",
      "helpful_votes": 3,
      "publication_date": 20181230
    },
    {
      "title": "Fast Family Fun!",
      "text": "This is so fun! Straightforward and easy to use and to clean. It makes candy floss SO FAST. Following the clear directions included, the machine is safe enough for my middle-grade grandkids to make their own treat! I now have sugar webs on my ceiling, so I ordered the clear bubble top today. Great memories with family, though! The price is more affordable than commercial models, but it works like a professional. I’m very pleased! Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "lavendarma",
      "helpful_votes": 0,
      "publication_date": 20201013
    },
    {
      "title": "buy it with the cover",
      "text": "Worked infinity times faster than the cute little counter top home ones. It did seem to have more floss sugar build up on the edges as we went, but I didn't know if that was due to the fact that we were producing so much more, or of there is more waste from the machine. YOU WILL WANT THE BUBBLE COVER. I figured it must not need it if its sold separate, but there was cotton candy flying everywhere! So I ordered the cover separately.",
      "rating": 5.0,
      "verified": true,
      "author": "kk",
      "helpful_votes": 0,
      "publication_date": 20201017
    },
    {
      "title": "Machine waste",
      "text": "I read all the reviews on this machine and many others and ordered the machine thinking it would be great to take to gatherings to make cotton candy . The amount of floss sugar that it wastes is unreal. Out of one carton of sugar about half of it melted to the sides of the machine and we got very little cotton candy out of it. It is extremely hard to clean. I have used other machines in the past and was totally unprepared for the time it took to make one stick of cotton candy or how much sugar I would have to use to get the one stick to give out. Would not recommend to anyone.",
      "rating": 2.0,
      "verified": true,
      "author": "Sandra D Freeman",
      "helpful_votes": 0,
      "publication_date": 20200202
    },
    {
      "title": "Family fun",
      "text": "Great product! Big hit with our kids. We brought it to the family reunion and apparently it's just as big of hit with adults! It works very well, you get a full cone from a pour (using the included scoop) and it spins out fast. Don't forget to order the sugar and paper cones...",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel P. Ellenbaum",
      "helpful_votes": 3,
      "publication_date": 20170821
    },
    {
      "title": "Used",
      "text": "My product came used I thought it would be New, I was testing it once i turned it on cotton candy started coming up . Without me even adding any floss. I didn't notice candy in it before starting the machine",
      "rating": 1.0,
      "verified": true,
      "author": "Jackie",
      "helpful_votes": 2,
      "publication_date": 20200202
    },
    {
      "title": "Used this machine for an event one time and it ...",
      "text": "Used this machine for an event one time and it stopped working. The head stopped spinning.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 10,
      "publication_date": 20170913
    },
    {
      "title": "Works good",
      "text": "Awesome machine, we use it for our kids workshops at work and other events we do so this machine runs for 4+ hours at a time and has held up great, we’ve only used it a handful of times though but so far so good! The only issue I have is cleaning inside the small heating element that spins to create the cotton candy",
      "rating": 4.0,
      "verified": true,
      "author": "Customer",
      "helpful_votes": 2,
      "publication_date": 20181121
    },
    {
      "title": "Great Machine",
      "text": "we have a big family, and family parties are common. we have used this machine all summer and it is awesome. It is easy to use, easy to clean, and makes perfect cotton candy. good investment that will last for years.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas Cambell",
      "helpful_votes": 2,
      "publication_date": 20180907
    },
    {
      "title": "Five stars!",
      "text": "Wow! Made 150 cotton candy puffs in 90 minutes. Used inexpensive striped paper straws to make small 8\" puffs, kiddie sized! Two lifesaver candies each. Dipping the end of the paper straws in 1/2 inch of water helped the cotton candy to adhere, to get the ball rollin'. Thank you people for sharing great tips. This machine was the star of the party!!!!!!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Brooklyn is Home",
      "helpful_votes": 0,
      "publication_date": 20191026
    },
    {
      "title": "Need replacement base",
      "text": "Cord snapped, and started sparking. Lid is nearly impossible to remove. I need to remove it to clean it, and almost broke my arm just trying to force the lid off , it says pull up by the lip but I assure you I have tried multiple times. I should be able to easily do.",
      "rating": 1.0,
      "verified": true,
      "author": "Jennifer ",
      "helpful_votes": 0,
      "publication_date": 20200417
    },
    {
      "title": "Love it.",
      "text": "We love this Cotton Candy Machine. We had a smaller one that my daughter used a lot last summer. We decided to upgrade. I debated buying the bubble cover but didn't. I find we don't need it.",
      "rating": 5.0,
      "verified": true,
      "author": "Yawanoc",
      "helpful_votes": 6,
      "publication_date": 20160411
    },
    {
      "title": "Five Stars",
      "text": "Love my machine. Have used it several times (4) since I got it!",
      "rating": 5.0,
      "verified": true,
      "author": "soccarmom",
      "helpful_votes": 4,
      "publication_date": 20171029
    },
    {
      "title": "So fun!!",
      "text": "We love this! It’s easy to set up and clean up is a breeze. My kids have also enjoyed this. We set it up on a card table in the yard because the cotton candy does tend to have whisps that fly off. We also purchased the dome top for it and am so glad we did! We have used the traditional cones as well as bamboo skewers; some of us prefer the cones and some the skewers 🤷🏽‍♀️",
      "rating": 5.0,
      "verified": true,
      "author": "Islandgirl",
      "helpful_votes": 0,
      "publication_date": 20190716
    },
    {
      "title": "Pretty good quality machine",
      "text": "Decent quality machine... Had an issue with leftover floss sugar being stuck in the head.. Head comes apart for cleaning pretty easy with no special tools... Also it's small enough to fit on a standard table and use comfortably I would order again",
      "rating": 4.0,
      "verified": true,
      "author": "Gene Love",
      "helpful_votes": 0,
      "publication_date": 20191111
    },
    {
      "title": "Purchase the separate bubble cover so you can use the machine indoors without any mess.",
      "text": "My order was shipped very quickly. After reading the reviews, I also purchased the cover. Instructions are brief but complete. I made several batches and the machine works perfectly. It also cleans up easily. I highly recommend this machine. The cover is slightly expensive- but well worth it if you plan to use it indoors.",
      "rating": 5.0,
      "verified": true,
      "author": "RJ",
      "helpful_votes": 0,
      "publication_date": 20190612
    },
    {
      "title": "Cotton candy",
      "text": "Don't care for it myself, but the wife and grandson feel like they are at the circus or Zoo, I enjoy using this equipment to make it for them, and I ordered a pretty good selection of flavors for them to choose from.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe Carrier",
      "helpful_votes": 0,
      "publication_date": 20200513
    },
    {
      "title": "Great quality!",
      "text": "Absolutely love it! Easy to use, easy to clean, good quality and made perfect cotton candy!!",
      "rating": 5.0,
      "verified": true,
      "author": "Evelin",
      "helpful_votes": 4,
      "publication_date": 20190130
    },
    {
      "title": "Awesome Machine",
      "text": "So I always read reviews and do my homework on purchases like this. This product had pretty good reviews but I decided to buy a small “home use” machine first for about $40. It was a good machine but not for more than just a few servings of cotton candy. I wanted something for parties, so I decided to come back and buy this machine. I am so impressed!!! It worked better than I expected, it was easy to use, and easy to clean! It is so fast too, the kids weren’t waiting in line long at all. So happy with my purchase and so are all the kids in my family!",
      "rating": 5.0,
      "verified": true,
      "author": "Jen",
      "helpful_votes": 0,
      "publication_date": 20190808
    },
    {
      "title": "Buyer beware!!!!!",
      "text": "Let me say that the machine is great and does what it says. What is NOT great is that it will damage your table. I figured w rubber feet setting it on a table would not be a problem. My $800 table is now ruined. Clearly I should have though better about using the table. But who knew it would happen. And for the life of me I can’t figured out why this happened",
      "rating": 4.0,
      "verified": true,
      "author": "Erika Sims",
      "helpful_votes": 0,
      "publication_date": 20190924
    },
    {
      "title": "Very fast.",
      "text": "Works great, albiet a bit too fast for my beginner status. Immediately after putting sugar it, it starts producing. Wish it would pause foe a moment to get set. Works better with twk people...one to put sugar in and other to start turning ckne quickly.",
      "rating": 5.0,
      "verified": true,
      "author": "Lori",
      "helpful_votes": 0,
      "publication_date": 20190805
    },
    {
      "title": "Great machine",
      "text": "Easy to use great machine can make as much as you want very fast easy to clean used for a few birthday party's kids love I I",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff Jensen",
      "helpful_votes": 4,
      "publication_date": 20170915
    },
    {
      "title": "Supper Happy Cotton Candy Lady",
      "text": "This thing is freaking awesome. Set up was simple. The machine arrived today and of course I had to try it out. I would give 10 stars but it only allows 5.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Robbins",
      "helpful_votes": 0,
      "publication_date": 20200530
    },
    {
      "title": "Great machine and well worth the money",
      "text": "Love this cotton candy machine and so do the customers. Easy to use and clean. Can use sugar free hard candy to make cotton candy for diabetics kids and adults love to watch us spin up a batch.",
      "rating": 5.0,
      "verified": true,
      "author": "Bobbie jo",
      "helpful_votes": 0,
      "publication_date": 20200818
    },
    {
      "title": "Love this thing!",
      "text": "So far this has been the perfect cotton candy machine with a great price. No problems at all.",
      "rating": 5.0,
      "verified": true,
      "author": "Jen",
      "helpful_votes": 2,
      "publication_date": 20190303
    },
    {
      "title": "Very well made machine fun to use",
      "text": "We had so much fun making cotton candy from this machine. (glad we bought the bubble or floss would have been everywhere). It worked very well and was very easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Debbie",
      "helpful_votes": 0,
      "publication_date": 20200409
    },
    {
      "title": "Five Stars",
      "text": "Love this machine! Used it for 3 big school events and it did great! Happy we brought it",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20170708
    },
    {
      "title": "This Machine is Awesome Awesome.",
      "text": "This Machine is Awesome Awesome.. I knew it, a friend of mines who rents them tried to sell me another model for 600 dollars. I do massive events for the Kids. We did 500 Bags of Cotton Candy.. I love it Love ... Thank You",
      "rating": 5.0,
      "verified": true,
      "author": "James H.",
      "helpful_votes": 5,
      "publication_date": 20170905
    },
    {
      "title": "Amazing quality",
      "text": "My ten-year-old loves this thing and I can't stop him from making cotton candy. Just wish I would have knew about the plastic netting and clips that you can get for the inside to make it easier to pull out the cotton candy without having to go around and around with a stick",
      "rating": 5.0,
      "verified": true,
      "author": "JIMMY RAMIREZ",
      "helpful_votes": 0,
      "publication_date": 20200313
    },
    {
      "title": "Great Machine",
      "text": "Goof-proof assembly and safety design. Creates great cotton candy quickly. Just what I was looking for. Also bought the Vivo bubble cover to catch flyaway candy floss; I recommend getting that too.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Shopaholic",
      "helpful_votes": 0,
      "publication_date": 20200524
    },
    {
      "title": "should have a control arm temperature",
      "text": "It should have a way to control the temperature because of some temperatures it will not spin good as other temperatures. But overall good machine",
      "rating": 4.0,
      "verified": true,
      "author": "Pete’s donut shack Wichita ",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Easy and fun",
      "text": "Love it. Used it right out of the box at a wedding so easy to use. Worked great all the guests were able to do it themselves. Easy to clean as well. Do you have a dome cover for it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180917
    },
    {
      "title": "Machine is easy to use and clean",
      "text": "Would not consider this for commercial use. Machine is easy to use and clean, but takes a long time to make each bag; very time consuming.",
      "rating": 2.0,
      "verified": true,
      "author": "Tim Snavley",
      "helpful_votes": 4,
      "publication_date": 20170626
    },
    {
      "title": "Love this machine!",
      "text": "I love this machine! We have a Saturday market here once-n-awhile where anybody who wants to goes there and sells things. I have had this for almost a year now and it works just like new. I highly recommend this for anybody that is looking for a long lasting good machine!",
      "rating": 5.0,
      "verified": true,
      "author": "Beth H.",
      "helpful_votes": 37,
      "publication_date": 20160429
    },
    {
      "title": "This machine is awesome",
      "text": "Very easy to use and you first cotton candy looked like the fair cotton candy Heats up fast super easy to clean .. Quiet running",
      "rating": 5.0,
      "verified": true,
      "author": "sheila shelton",
      "helpful_votes": 0,
      "publication_date": 20200906
    },
    {
      "title": "Industrial, easy to use and clean",
      "text": "Very big. We use it for our rental business. Super easy to clean! Comes a part to be able to clean it good. Industrial for sure.",
      "rating": 5.0,
      "verified": true,
      "author": "Tallulah Simmons",
      "helpful_votes": 0,
      "publication_date": 20180501
    },
    {
      "title": "We had great success with this machine the first time...",
      "text": "I have to edit this review. After such great success with the machine we packed it back in the original box and stored it on a shelf. We pulled it back out a month later for a party and it won't turn on. The motor spins but no heat! The fuse looks fine but I am going to try and replace it. Not sure about warranty? We had great success with this machine! We used it for a fundraising event and it worked like a horse for 6 hours straight. We weren't able to clean it until the next afternoon and it cleaned up beautifully. So much fun!",
      "rating": 3.0,
      "verified": true,
      "author": "Beth Schultz",
      "helpful_votes": 8,
      "publication_date": 20161214
    },
    {
      "title": "Great machine",
      "text": "This is an awesome cotton candy machine. So easy to use and clean. Have used at parties many times. Kids love it!!",
      "rating": 5.0,
      "verified": true,
      "author": "JulesDear",
      "helpful_votes": 0,
      "publication_date": 20190810
    },
    {
      "title": "cotton candy machine",
      "text": "Works great makes cotton candy fast I owned 2 other cotton candy machines and they were nothing like this one would definitely recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Jack morzynske",
      "helpful_votes": 0,
      "publication_date": 20200709
    },
    {
      "title": "WE TOTALY LOVE THIS COTTON CANDY MACHNE",
      "text": "WE TOTALY LOVE THIS COTTON CANDY MACHNE,,MADE. LOTS OF HAPPY KIDS YESTURDAY ,,NOT A PROBLEM ,,,IT IS WELL WORTH THE MONE,,LOTS OF GIGGLES FOLLOWED THE EXCIEMENT OF THE COTTON CANDY.....",
      "rating": 5.0,
      "verified": true,
      "author": "Ann R.",
      "helpful_votes": 0,
      "publication_date": 20180624
    },
    {
      "title": "Best machine",
      "text": "Bought this 3 years ago and it’s still one of the best things we own. It’s so fast to make cotton candy and the easiest clean up.",
      "rating": 5.0,
      "verified": true,
      "author": "Teresa",
      "helpful_votes": 0,
      "publication_date": 20200610
    },
    {
      "title": "No bubble shield sent with floss machine",
      "text": "I purchased the floss machine with shield however I was only sent the machine. I paid more to have a mess free experience and I would like to have the shield sent before my scheduled event.",
      "rating": 1.0,
      "verified": true,
      "author": "Bethanie ",
      "helpful_votes": 0,
      "publication_date": 20200730
    },
    {
      "title": "Five Stars",
      "text": "This is the best impulse buy I've ever made. 👌🏽",
      "rating": 5.0,
      "verified": true,
      "author": "Leslie Michelle Baca",
      "helpful_votes": 5,
      "publication_date": 20170223
    },
    {
      "title": "One Star",
      "text": "Worked great first time, then broke. Machine won't turn on.",
      "rating": 1.0,
      "verified": true,
      "author": "Sun H",
      "helpful_votes": 7,
      "publication_date": 20170320
    },
    {
      "title": "Cotton csndy",
      "text": "Family is loving it and using jolly rancher candy is the best",
      "rating": 5.0,
      "verified": true,
      "author": "Vicki Perkins",
      "helpful_votes": 2,
      "publication_date": 20170530
    },
    {
      "title": "Awesome Machine for a Family Fun Treat",
      "text": "Awesome machine, does what it's supposed to do, the sugar does collect a bit on the side, but you can knock it off and reuse it for next batch. It makes really good and fluffy cotton candy!!",
      "rating": 5.0,
      "verified": true,
      "author": "James A",
      "helpful_votes": 4,
      "publication_date": 20170902
    },
    {
      "title": "Great machine don't waste your money on the small \"toy\" ...",
      "text": "Great machine don't waste your money on the small \"toy\" cotton candy machines this instantly makes cotton candy with out waiting",
      "rating": 5.0,
      "verified": true,
      "author": "Tvb",
      "helpful_votes": 2,
      "publication_date": 20170722
    },
    {
      "title": "Incredible machine!!!",
      "text": "Got this for our daughter's 13th birthday during Covid. It made up for not having a huge party. Our 3 kids enjoyed it and so did my husband & I!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Lorie strazza",
      "helpful_votes": 0,
      "publication_date": 20200908
    },
    {
      "title": "Needs dome cover to use indoors",
      "text": "This is a nice looking machine, however you probably don’t want to use this inside the house without a dome cover. Also used twice and now doesn’t turn on. Used less then 10 min both times. Will be contacting seller to for parts or exchange.",
      "rating": 2.0,
      "verified": true,
      "author": "Sleepless in Seattle ",
      "helpful_votes": 0,
      "publication_date": 20181123
    },
    {
      "title": "The sugar reservoir is entirely too small.",
      "text": "We had an awful experience at our Halloween carnival when we used it for the first time. The sugar reservoir holds about 3 Tablespoons of sugar and makes 1 and half small cotton sticks at a time. I would never recommend this item to anyone. And, plan on returning it.",
      "rating": 1.0,
      "verified": true,
      "author": "Cynthia D. Fowler",
      "helpful_votes": 0,
      "publication_date": 20191102
    },
    {
      "title": "False advertising",
      "text": "Advertised it came with the bubble top. The bubble top never arrived.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20200216
    },
    {
      "title": "Great for heavy use",
      "text": "This machine was purchased for use at parties. It handled constant use for 2.5 hours. The kids loved it! Easy to clean with just water initially, and stainless steel bowl it easily cleaned after final use.",
      "rating": 5.0,
      "verified": true,
      "author": "Zweefer",
      "helpful_votes": 0,
      "publication_date": 20191108
    },
    {
      "title": "One Star",
      "text": "Epic fail... Wire burned within the first 20 minutes of use",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 6,
      "publication_date": 20160506
    },
    {
      "title": "Great Product/Great Customer Service",
      "text": "Great Machine. I am super happy with it. And the company Vivo did a great job in packaging items and a prompt delivery. Also they are quick to answer your emails. I totally recommend this company.",
      "rating": 5.0,
      "verified": true,
      "author": "Cyndy Mora",
      "helpful_votes": 0,
      "publication_date": 20190304
    },
    {
      "title": "defective pos",
      "text": "faulty defective pos. just got it, followed directions to get it started and motor took a crap while warming up. pissed...5 year old son in tears....wtf",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190622
    },
    {
      "title": "Stopped working after 3 uses.",
      "text": "Used 3 times and then it stopped working. Had it less then 30 days. Bought it for my grand daughters Birthday party and of course that’s when it stopped working. IN the process of returning it. Customer service is great ....too bad the product is poor quality.",
      "rating": 2.0,
      "verified": true,
      "author": "T CAMPBELL",
      "helpful_votes": 0,
      "publication_date": 20200724
    },
    {
      "title": "Worth every Penny!!!",
      "text": "We bought this for our children birthday parties. This is a total hit with kids and adults. Being able to use hard candy is amazing. Want flavors that are exploding in your mouth, use jolly ranchers. This is a professional machine.",
      "rating": 5.0,
      "verified": true,
      "author": "Randy D. Velasquez",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "Great Machine",
      "text": "I selling cotton candy at a local farmers market. The machine works great. The only concern is occasionally the candy will \"rope\" coming out of the center. That has been my only negative. Easy to use and kids LOVE watching it being made. I would recommend this machine.",
      "rating": 4.0,
      "verified": true,
      "author": "David W.",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "Easy to use right out of the box",
      "text": "I was concerned about this machine, as I had not used one before. I followed the directions, & made sure the bowl was strapped down . It work great. I have used it twice now. I recommend the cover to help keep the candy contained.",
      "rating": 5.0,
      "verified": true,
      "author": "dgjere",
      "helpful_votes": 0,
      "publication_date": 20190624
    },
    {
      "title": "Made to much money",
      "text": "I just wanted to say i spent about 400 dollars i made $6700. Off the machine i was selling it for 5 dollars a bag for cotton candy i made 1200 bags of cotton candy the machine was on for 3 days no stoping",
      "rating": 5.0,
      "verified": true,
      "author": "Thomasmorosco",
      "helpful_votes": 0,
      "publication_date": 20201022
    },
    {
      "title": "Great product!",
      "text": "We bought this for my son's birthday party 3 years ago. We bring it to school events and block parties and it always works with no issues. It takes about 30 seconds to make a big cone of cotton candy (one scoop = one cone / scoop included with machine). Great product!",
      "rating": 5.0,
      "verified": true,
      "author": "gcarp",
      "helpful_votes": 0,
      "publication_date": 20180204
    },
    {
      "title": "WASTE OF MONEY",
      "text": "Purchased to use for grandchildren’s events. Unable to get any continuity of candy production. Machine walks across surfaces and randomly produced candy. Unable to find service in my area. A TOTAL WASTE OF MONEY.",
      "rating": 1.0,
      "verified": true,
      "author": "Connie M Cooper",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "Dont buy it",
      "text": "First time i used as soon as i started it sparks started coming out of the head , it had a striped wire inside, wont buy this brand ever again",
      "rating": 1.0,
      "verified": true,
      "author": "Javier",
      "helpful_votes": 7,
      "publication_date": 20151119
    },
    {
      "title": "Very good product. We had bought a much cheaper unit ...",
      "text": "Very good product. We had bought a much cheaper unit that was very disappointed appointing. This is very easy to use and clean. Just use outside, it is just like a Fair. It does float around the unit (the sugar)",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170228
    },
    {
      "title": "Falls Apart Fast.",
      "text": "The belt busted on the first use, one of the anchors came off of the pan, and it kept tripping the breaker on gfi protected plugs. I have since got it to work properly, but not happy with the product at all. Will not buy again.",
      "rating": 2.0,
      "verified": true,
      "author": "Simon A. Hernandez",
      "helpful_votes": 0,
      "publication_date": 20170404
    },
    {
      "title": "Sweet Deal!!",
      "text": "Our daughter and her friends loved this cotton candy maker. It is also very easy to clean compared to another model we owned.",
      "rating": 5.0,
      "verified": true,
      "author": "Vee Chimes",
      "helpful_votes": 0,
      "publication_date": 20200713
    },
    {
      "title": "Great purchase",
      "text": "This item work perfectly. Very easy to use and easy to clean",
      "rating": 5.0,
      "verified": true,
      "author": "Joel N.",
      "helpful_votes": 2,
      "publication_date": 20170520
    },
    {
      "title": "Machine did not work after several Cotton candy",
      "text": "Machine did not work after making several Cotton candym.. so upset. Ruin my fundraising. Do not buy it",
      "rating": 1.0,
      "verified": true,
      "author": "Araz ",
      "helpful_votes": 0,
      "publication_date": 20181124
    },
    {
      "title": "Great addition so far!",
      "text": "We use this in our food trailer. It does take up some room when using but taken apart we can store it under the sinks when not in use.",
      "rating": 5.0,
      "verified": true,
      "author": "amgdgg",
      "helpful_votes": 0,
      "publication_date": 20190826
    },
    {
      "title": "Fluffy joy",
      "text": "I have wanted a cotton candy Machine for a really really long time and I love it!!! Easy to use easy to take apart easy to enjoy. I love it. Light enough and makes cotton candy so crazy fast!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191114
    },
    {
      "title": "A quality item! Well worth the additional cost when ...",
      "text": "A quality item! Well worth the additional cost when compared to cheaper machines that are not much more than a toy. It was the star of the party!",
      "rating": 5.0,
      "verified": true,
      "author": "William A. Brack",
      "helpful_votes": 0,
      "publication_date": 20180424
    },
    {
      "title": "Easy to use",
      "text": "This machine met all my needs. It is heavy duty, nice looking and user friendly. I'm very happy with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "JFinn",
      "helpful_votes": 0,
      "publication_date": 20190530
    },
    {
      "title": "cotton candy machine",
      "text": "as described. Prompt delivery. My daughter in law loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Desroches",
      "helpful_votes": 0,
      "publication_date": 20170210
    },
    {
      "title": "Awesome machine!",
      "text": "Works great. Doesn’t vibrate. Works as advertised; just follow the instructions. Be careful of steam while cleaning. I didn’t buy the plastic cover and I’m glad I didn’t. It’s not needed.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200726
    },
    {
      "title": "Four Stars",
      "text": "Makes great cotton candy but without a cover you may have to collect it off the ceiling.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20170327
    },
    {
      "title": "Great!",
      "text": "It's easy to use, and easy to clean. We love it! I highly recommend it",
      "rating": 5.0,
      "verified": true,
      "author": "zabdi",
      "helpful_votes": 6,
      "publication_date": 20161017
    },
    {
      "title": "Not durable",
      "text": "We bought this machine for our children. They love cotton candy. We've used the machine twice and it will not turn on. Very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Norma Jimenez",
      "helpful_votes": 0,
      "publication_date": 20181201
    },
    {
      "title": "Is not a commercial item",
      "text": "After a few hours of it working It stop working",
      "rating": 2.0,
      "verified": true,
      "author": "Robinson M.",
      "helpful_votes": 0,
      "publication_date": 20181226
    },
    {
      "title": "Silky, and perfect.  Glad I purchased.",
      "text": "This machine makes silky perfect cotton candy and for the price it is a great deal. It comes with a small scooper that you add the sugar with. It makes about one cone, then it needs another scoop. I add the sugar to the paper cone and add it that way since it spins it out instantaneously and the cone is there to catch the floss.",
      "rating": 4.0,
      "verified": true,
      "author": "Ana R",
      "helpful_votes": 32,
      "publication_date": 20141219
    },
    {
      "title": "Great pick",
      "text": "Very easy and fast! Can make lots of cotton candy in minutes.",
      "rating": 5.0,
      "verified": true,
      "author": "shallie",
      "helpful_votes": 0,
      "publication_date": 20200828
    }
  ],
  "product_meta": {
    "title": "VIVO Pink Electric Commercial Cotton Candy Machine, Candy Floss Maker (CANDY-V001)",
    "rating": 4.5,
    "feature_bullets": [
      "VIVO COTTON CANDY SOLUTIONS - Electric Cotton Candy Machine, 1030W of power (operates on 110V / 60Hz power)",
      "MAKES 2-3 SERVINGS / MINUTE - Transforms hard candy or sugar into wooly cotton candy, producing up to 2-3 servings per minute",
      "INCLUDED ITEMS - Large 20\" Stainless Steel Bowl with Sugar Scoop",
      "EASY MAINTENANCE - Unit disassembles for easy cleaning",
      "WE’VE GOT YOU COVERED - This cotton candy machine is backed with a 1-year Manufacturer Warranty and friendly tech support to help with any questions or concerns"
    ],
    "specifications": {
      "Product Dimensions": "21 x 21 x 14 inches",
      "Item Weight": "23.1 pounds",
      "Manufacturer": "VIVO",
      "ASIN": "B00MG2N08O",
      "Item model number": "CANDY-V001",
      "Customer Reviews": "4.5 out of 5 stars523 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#10,950 in Kitchen & Dining",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "August 5, 2014"
    },
    "categories": [
      "Small Appliances",
      "Cotton Candy Makers",
      "Home & Kitchen",
      "Specialty Appliances",
      "Kitchen & Dining"
    ],
    "price": 189.99
  }
}