{
  "website_summaries": [
    {
      "verdict": "A solid choice for severe allergy sufferers and those who want lasting relief from a steroidal spray.",
      "pros": [
        "Prescription strength steroid nasal spray relieves symptoms for up to 24 hours",
        "Only requires use once a day for results",
        "Works well at preventing symptoms caused by numerous seasonal allergens",
        "Available in multi-packs"
      ],
      "cons": [
        "Some complaints of leaky bottles on delivery",
        "Can cause various side effects",
        "Some users found the smell and taste unpleasant",
        "Doesn't work for all users"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "Lightning-fast relief from itchy nose, watery eyes, congestion, and sneezing with no drowsiness, thanks to this trusted name in nasal sprays.",
      "pros": [
        "Designed to work directly in nasal passages, and continues to work for 24 hrs",
        "Users find it especially effective for seasonal and pet allergies",
        "Excellent alternative for those who don’t like taking pills",
        "Users love lack of brain fog"
      ],
      "cons": [
        "Should use daily for full benefit",
        "may not work if used occasionally",
        "Some users don't like aftertaste"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Horrible side effects",
      "text": "Made me feel worse. I had to stop using this after a couple of days. It made me so dizzy and nauseous I could barely function. Took me a few days to realize I was having dizzy spells and feeling queasy only when I used this. Stopped using it and dizziness has stopped. Will never by again, an it's not cheap.",
      "rating": 1.0,
      "verified": true,
      "author": "Mominator",
      "helpful_votes": 50,
      "publication_date": 20180402
    },
    {
      "title": "Cheapest place to buy it",
      "text": "I have really bad allergies and this is the only medicine that works.",
      "rating": 5.0,
      "verified": true,
      "author": "Patrick MontoyaTop Contributor: Baby",
      "helpful_votes": 32,
      "publication_date": 20190323
    },
    {
      "title": "Recommended by my doctor",
      "text": "My doctor recommended this to help with my sinus infections that occur like clockwork twice per year. I ordered this from Amazon because it was a little cheaper than my local drug store. Came packaged in a way that I knew it was official and trustworthy. Would order again. Hopefully this will help keep my seasonal allergies and sinus infections at bay.",
      "rating": 5.0,
      "verified": true,
      "author": "KathyP",
      "helpful_votes": 32,
      "publication_date": 20180830
    },
    {
      "title": "Good Stuff!",
      "text": "This year's seasonal allergy was rough for me. Violent sneezing and sore/infected sinuses are a bad combination. My fall back allergy medicine, benadryl, was just too rough to handle this year. Allegra was a fail in previous years. So I decided to try Claritin again. I'd give it a C: I got some relief (most clear breathing) for about four hours after taking it--no where close to the 24 hour promised. My Dr. recommended Flonase. Amazon had the best price. Two days later, my life changed, lol. Good stuff. I now don't need to take it every day, but it's a great option to have.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 44,
      "publication_date": 20170531
    },
    {
      "title": "Horrible side-effects",
      "text": "It's good at first but you'll start developing the side effects. Nausea, headache, dry mouth.",
      "rating": 1.0,
      "verified": true,
      "author": "Gigi",
      "helpful_votes": 22,
      "publication_date": 20180914
    },
    {
      "title": "The first time I thought it was because I had a cold but then when I tried again I lost my sense of smell even worse. Slowly recovering but others are not so lucky",
      "text": "Caused nearly 100% loss of smell. The first time I thought it was because I had a cold but then when I tried again I lost my sense of smell even worse. Slowly recovering but others are not so lucky. Very effective but use with caution and stop if you have any indication your sense of smell is diminished.",
      "rating": 1.0,
      "verified": true,
      "author": "Lucy",
      "helpful_votes": 17,
      "publication_date": 20180520
    },
    {
      "title": "#1 Choice to control my hay fever",
      "text": "Other companies are now making the same medication, so in review of the meds, it's the best I've found to control my hay fever which is year round. What Flonase has that the others don't is a superior spray mechanism. To give an idea, it feels more like a light, dispersed mist verses the cheaper brands that make me feel like I'm blasting some brain cells away. Deducted one star for the price. (Has come down significantly, but still too high)",
      "rating": 4.0,
      "verified": true,
      "author": "Cindy",
      "helpful_votes": 8,
      "publication_date": 20181217
    },
    {
      "title": "Stuff of Miracles!",
      "text": "Marriage saver! With my husband clearing his throat non stop I was at my wits end. Thankfully a friend was having the same issue and suggested we try Flonase. Worked like a charm. Never thought allergies could make me want to wring my husbands neck and now they no longer do.",
      "rating": 5.0,
      "verified": true,
      "author": "Dawn",
      "helpful_votes": 11,
      "publication_date": 20180525
    },
    {
      "title": "Best allergy relief ever!",
      "text": "Ive struggled finding something what actually worked for me and I finally found this spray! Ive made it part of my morning routine to do a spray in each nostril. There is a loading dose which means for the first week you have to do 2 sprays in each nostril then after that is just once spray in each nostril every day. Hold your head back for a couple minutes to avoid the taste going to the back of your throat but even if it does its still not a very unpleasant taste. 10/10 recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Daisy",
      "helpful_votes": 8,
      "publication_date": 20180624
    },
    {
      "title": "Received opened and used Flonase .... horrifying",
      "text": "I’m not sure what happened here but when I opened the amazon box I found my Flonase and the plastic packaging was cracked up and the plastic looked like contents leaked all over the inside. It looked like this was opened. I inspect the bottle to find the seal is removed and this had been used.",
      "rating": 1.0,
      "verified": true,
      "author": "Mrslady",
      "helpful_votes": 13,
      "publication_date": 20180610
    },
    {
      "title": "Worked well for me during allergy season.",
      "text": "I don't always know what is causing my allergies to flare, but this year has been worse than most for me. I haven't used Flonase in the past except once, but I came back to it after trying a bunch of other things that didn't work. Thankfully, Flonase did. I used it for several weeks and over that time, my symptoms all but disappeared. I did not experience any negative side effects.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew",
      "helpful_votes": 8,
      "publication_date": 20180724
    },
    {
      "title": "There is another similar product with an additional additive that is prescription only and it works great but it cost about 4-5 times what this does",
      "text": "Yeah...I know...its aggravating. This stuff does work and there are a couple other trade name products with the same active indignant. I guy this one since it comes in a larger size. There is another similar product with an additional additive that is prescription only and it works great but it cost about 4-5 times what this does, no generic. Anyway this works for me as I have some type of allergy that impacts my breathing at night.",
      "rating": 4.0,
      "verified": true,
      "author": "JoeAverage-User",
      "helpful_votes": 6,
      "publication_date": 20180908
    },
    {
      "title": "Good old Flonase, I should never have turn my back on you...",
      "text": "Don't know why flavor is a rating characteristic, but whatever. I have chronic allergies and I use a CPAP. For some reason over the last few months my nasal passages have been completely clogged. I'm an old dude in was not looking forward to another surgery to open things up. I figured nasal polyps and returned. I forgot until seeing it on Amazon that doctors used to prescribe this product. Now that it is non-prescription I ordered it, and it worked great! I even have it on subscription now. I don't even have to use it everyday. I just use it once a week for maintenance.",
      "rating": 5.0,
      "verified": true,
      "author": "CAR TOP CAMPER",
      "helpful_votes": 3,
      "publication_date": 20190904
    },
    {
      "title": "Love it!",
      "text": "Ok I've had year round allergies since I was 14 (I'm 24 now) and I just started using this about a month ago and I really think it helps me. The thing though is you have to be consistent which I'm not always I'd probably say I use this at least every other day and I still actually notice a difference so I'm sure if someone is using it everyday they'd get even better results. I'd definitely recommend",
      "rating": 5.0,
      "verified": true,
      "author": "rose harding",
      "helpful_votes": 5,
      "publication_date": 20181116
    },
    {
      "title": "and some even like it. It smells like spraying really cheap flower-scented ...",
      "text": "Ok, so some of ya'll are seriously hardcore. I am genuinely impressed that some reviewers can put up with the smell, and some even like it. It smells like spraying really cheap flower-scented air freshener directly into your nose. I cannot comprehend who thought this was a good idea, in product development. To add insult to injury, my girlfriend basically said, can you warn me that you're about to use that nasal spray? I want to kiss you good-night before you use it, since I can't stand to be that close to the flowery smell. So yeah, after two or three uses, I had to throw it away. Avoid if you don't like flowery perfume up your nose.",
      "rating": 1.0,
      "verified": true,
      "author": "Dmitri Zagidulin",
      "helpful_votes": 15,
      "publication_date": 20180522
    },
    {
      "title": "This product doesn't smell right -totally different from the one ...",
      "text": "This product doesn't smell right -totally different from the one I buy at a local store. Not sure that I trust it.",
      "rating": 1.0,
      "verified": true,
      "author": "2175miles",
      "helpful_votes": 9,
      "publication_date": 20180515
    },
    {
      "title": "Allergies Gone! Snoring Reduced!",
      "text": "Allergies hit me hard this year and I tried using the store brand nasal spray but if I didn't use it that day I would have super bad congestion like to the point I was exclusively breathing through my mouth. Gave this a try it seemed a little more expensive but good reviews. Wow super glad I did. Allergies are 90% gone. I also can sleep better at night because my nose isn't clogged and my snoring was slightly reduced according to my wife. Instructions say to start with 2 sprays daily your first week I only did 1 daily and still great results.",
      "rating": 5.0,
      "verified": true,
      "author": "sebastian",
      "helpful_votes": 2,
      "publication_date": 20190515
    },
    {
      "title": "it works",
      "text": "my first time to use it, works great. It starts to work in literally seconds. I start to use it almost every week, and realize that I will spend a lot of money on this. I will not mention its name, but you know where you can find the 3-pack version easily! Go and grab that one if you need more than one bottle. The \"flavor\" is acceptable, even its not my favorite one, but IT WORKS.",
      "rating": 4.0,
      "verified": true,
      "author": "S.theMan",
      "helpful_votes": 0,
      "publication_date": 20200402
    },
    {
      "title": "Wow it works!",
      "text": "I bought this for my dad. He gets congestion and watery eyes every year around the same time and no it’s not due to pollen it’s just I guess because of the temperature change and for the past few years he couldn’t find something that worked but I looked on amazon after seeing him struggle to even go to work and I found this! It works and he didn’t even have to use the whole thing! My dad is back to being a happy man!",
      "rating": 5.0,
      "verified": true,
      "author": "smorale0",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "Works great",
      "text": "This is sent from heaven, I swear. Long story short, I had a very bad cold and couldn't breath through my nose. I put two sprays of this stuff in both of my nostrils and in around twenty to thirty minutes, (imo) it all cleared up. Most medicine that I take that says 24 hour relief usually lasts for around 5 hours for me, but this truly lasts the 24 hours in my experience. Someone else may be different, but this works, and I will continue to buy this medicine.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason Weber",
      "helpful_votes": 2,
      "publication_date": 20190222
    },
    {
      "title": "It somewhat works but ...",
      "text": "I have used this product for years and it does help with nasal issues like sneezing, etc. What I don't like about it is the very small amount of product that comes in such an intentionally deceiving large bottle. I have always felt more money was spent on the packaging than on the product. For the cost of this product I would expect twice the product than what you are given. Big Pharma at its usual game.",
      "rating": 4.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 4,
      "publication_date": 20180303
    },
    {
      "title": "Almost of more value than my allergy pills!",
      "text": "Flonase is almost of more value than my allergy pills! You have to use it carefully, since if you don't aim it correctly you can wind up with a hole in your septum, like my family member. I've been using it longer, and still use it...no hole in my septum. As to how it works--just Great! I can finally get rid of all the stray drips, sneezes and sniffs that get past my allergy pills!",
      "rating": 5.0,
      "verified": true,
      "author": "Sekmet",
      "helpful_votes": 0,
      "publication_date": 20200607
    },
    {
      "title": "Try if allergy pills do not work",
      "text": "I first bought this brand at Costco for my mom who suffered from allergies for years without anything working. But this worked during allergy season! She was feeling better and able to go outside without feeling uncomfortable. Now I buy this from amazon whenever I just want it delivered to my mom. I would recommend trying this if the allergy pills have not worked!",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy Iveth Zamora",
      "helpful_votes": 0,
      "publication_date": 20200529
    },
    {
      "title": "I don't like it",
      "text": "It ’s been a long time since I bought it, and I ’d like to talk about how it feels after using it. First of all, it ’s very convenient to operate, but I think this spray does n’t work for me, and I ’ve bought it for so long, I have n’t used it more than ten times because I Every time I use it, I get a cold! I suspect it contains ingredients that make my throat irritate to become a cold, so I do n’t use it now, because it is better to keep sneezing than changing the cold ...",
      "rating": 2.0,
      "verified": true,
      "author": "goodbyesorrow",
      "helpful_votes": 0,
      "publication_date": 20200130
    },
    {
      "title": "I love these nasals sprays but it was opened.",
      "text": "It was open on the bottom, the plastic container. I worry these days. I was desperate so I used it anyway. I can breath at night. It's the only product that helps my snoring and nasal clarity.",
      "rating": 4.0,
      "verified": true,
      "author": "DD",
      "helpful_votes": 7,
      "publication_date": 20170705
    },
    {
      "title": "Didn't work for me",
      "text": "While this product may work for some people, it is not effective for some other people as it didn't help me. I used it for more than 2 weeks. Not only I didn't get relief from swollen turbinates, the condition was getting worse after an hour of spraying the product. Also make sure to do some research on its side effects for long time using of this product (more than 6 months).",
      "rating": 2.0,
      "verified": true,
      "author": "Masood",
      "helpful_votes": 3,
      "publication_date": 20191206
    },
    {
      "title": "Incredibly effective",
      "text": "Where Benadryl, Zyrtec, and even prescription meds have failed, Flonase has come through for me. This stuff simply works to beat DC allergies, which are notoriously hellish. The only catch is that unlike pills, you need to get a steady loading dose of the spray in your system for it to work, meaning you need to start using it approximately 7-10 days prior to experiencing allergy symptoms. I typically start in mid-March before everything starts to bloom.",
      "rating": 5.0,
      "verified": true,
      "author": "Laura",
      "helpful_votes": 6,
      "publication_date": 20170620
    },
    {
      "title": "I have terrible allergies that make my eyes water and sting like ...",
      "text": "I have terrible allergies that make my eyes water and sting like crazy. I tried everything else before finally breaking down and emailing my doctor. She recommended Flonase and it works amazingly well for me.",
      "rating": 5.0,
      "verified": true,
      "author": "MR29",
      "helpful_votes": 6,
      "publication_date": 20180212
    },
    {
      "title": "I can breathe!",
      "text": "I moved from the midwest to Florida and thought I would be allergy free. I came to find out that my allergies are just different in Florida than in Arkansas...much different. Although my allergies are 10x better here in sunny Florida, I still get watery eyes and a stuffy nose. I've used Flonase over the past few days at night before bed and I have slept much better and feel like I can breathe better now.",
      "rating": 5.0,
      "verified": true,
      "author": "Courtney Lawless",
      "helpful_votes": 2,
      "publication_date": 20190624
    },
    {
      "title": "Definitely buy this for your runny nose",
      "text": "I received this today. My nose was running like Niagara Falls and I have been carrying at least three handkerchiefs to stem the flow. I opened the box, read the directions and used the spray. Within MINUTES my nose dried up completely. 5 stars isn't enough for this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Howard Reisdorf",
      "helpful_votes": 2,
      "publication_date": 20191120
    },
    {
      "title": "good for bacterial infection",
      "text": "got this as a back up to all my meds - good for bacterial sinus infection.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Consumer",
      "helpful_votes": 3,
      "publication_date": 20200328
    },
    {
      "title": "No thank you",
      "text": "Pros- works someone my allergies. Easy to use. Cons- the side effects. \"Serious side effects rare- eye conditions- cataracts or glaucoma. Growth effects in children under 11- slower growth rates in some children when using this product\". No thank you.",
      "rating": 2.0,
      "verified": true,
      "author": "BingBong",
      "helpful_votes": 2,
      "publication_date": 20191118
    },
    {
      "title": "Regular Daily Use Reduces Swollen Nasal Passages",
      "text": "I have year-round allergy-like problems (allergies and sensitivity). In particular, if I don't use my Flonase, which I use one squirt twice a day, I find that my passages get narrower and it becomes difficult to breathe, particularly at night. I combine this with an antihistamine pill. This doesn't resolve all my breathing problems, again particularly at night, but it makes them far far better.",
      "rating": 5.0,
      "verified": true,
      "author": "SkippyJo",
      "helpful_votes": 0,
      "publication_date": 20191117
    },
    {
      "title": "Helped my ongoing allergies and sinus issues.",
      "text": "Omg I can’t say enough good things about this stuff. I bought after reading dozens of Reddit’s about it’s virtues with fighting indoor / seasonal allergies and dealing with an ongoing sinus and hearing issue. After three days of use, I can finally breathe again! And my ears have finally popped and I can ear again.",
      "rating": 5.0,
      "verified": true,
      "author": "Peachy Kween",
      "helpful_votes": 0,
      "publication_date": 20200531
    },
    {
      "title": "The Best Sinus Product For Me",
      "text": "I have sinus issues from hell. They might subside for a slight bit of time in the winter but it seems like anything can set them off. I've tried a similar nasal spray, a saline rinse, pills, etc.... none of them work as well as this product. Sure I wish I didn't have to take anything at all but for the time being, Flonase does the trick.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200212
    },
    {
      "title": "I don't know why I'm using this",
      "text": "My allergist told me I had chronic sinusitis and that I should use this every day. I wasn't having any symptoms so it caught me by surprise. I figured I would try it, maybe it would help with the occasional post nasal drip. But it doesn't seem to have changed anything. I don't know if it's ineffective or that I was asymptomatic in the first place. Either way it was a waste of $15.",
      "rating": 3.0,
      "verified": true,
      "author": "Maria",
      "helpful_votes": 0,
      "publication_date": 20190313
    },
    {
      "title": "Unnecessarily Strong Perfume Smell",
      "text": "Yuck. Smells and tastes like I just shoved a very potent very stinky floral bouquet up my nose. Couldn’t do it. Allergies were preferred to that awful smell. I don’t even know if it helped. I couldn’t get past the smell. Yuck.",
      "rating": 3.0,
      "verified": true,
      "author": "LanieCakes",
      "helpful_votes": 4,
      "publication_date": 20181125
    },
    {
      "title": "Excellent product. In the past",
      "text": "Flonase arrived promptly and just in time to combat all the spring allergies. Excellent product. In the past, my doctor prescribed this to help me with seasonal allergies. Now that it is over the counter, I can keep it on hand until it is needed. Don't spray it more than recommended as it can dry the nose and cause irritation. If this happens to me, I swab it with a little vasoline and leave it off for a few days and resume when nose heals.",
      "rating": 5.0,
      "verified": true,
      "author": "Rosy from the South",
      "helpful_votes": 6,
      "publication_date": 20160326
    },
    {
      "title": "no go for me",
      "text": "after using two weeks - did not help stuffy nose and now have nose bleeds",
      "rating": 1.0,
      "verified": true,
      "author": "country gal",
      "helpful_votes": 7,
      "publication_date": 20171102
    },
    {
      "title": "Great if you have allergies",
      "text": "Great if you have allergies. My doctor recommended this for daily use to prevent stuffy nose. I used to wake up with a sinus headache and this nasal spray helps me to sleep better.",
      "rating": 5.0,
      "verified": true,
      "author": "Rebel hiker",
      "helpful_votes": 7,
      "publication_date": 20170303
    },
    {
      "title": "Helped my stuffy nose!",
      "text": "I don't know if I have allergies, but my nose was getting very stuffy, and my doctor recommended this stuff. It actually worked really well for me. I don't really like the weird grassy feeling/taste/smell whatever it is that kind of slides down the back of the nose, but it only lasts a second. This stuff really provided relief when salt nasal sprays did nothing.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristin Bell",
      "helpful_votes": 0,
      "publication_date": 20180912
    },
    {
      "title": "FLONASE solved my headache problems.",
      "text": "No problems. Arrived as expected. This med works well for me. Turns out headaches were sinus headaches related to allergies and Flonase takes care of it. Edit: June 2018. I found out that my headaches are not allergy after all. I stayed on Flonase year round for over 3 years. Then decided to get off it. My nose would bleed easily with daily Flonase use. I have since focused on gut health (homemade yogurt and kombucha) plus reducing wheat intake (generally none, but occasional exceptions). I feel healthier being off all meds. I still use Excedrin for headaches but I have seen reduced frequecy and less intensity with the dietary changes.",
      "rating": 4.0,
      "verified": true,
      "author": "Just the facts",
      "helpful_votes": 2,
      "publication_date": 20151008
    },
    {
      "title": "One Star",
      "text": "I know its cheaper than pharmacy but EXP 2013 ???? Its Jan 2018 WTF is that ???!!!",
      "rating": 1.0,
      "verified": true,
      "author": "David Kim",
      "helpful_votes": 8,
      "publication_date": 20180110
    },
    {
      "title": "Best ITC nasal congestion product I have purchased",
      "text": "Definitely the best nasal congestion product you can buy. It says for allergy relief but the last few times my Dr has prescribed it during times I have had colds or flu. So happy it is an ITC medication now.",
      "rating": 5.0,
      "verified": true,
      "author": "Robyn",
      "helpful_votes": 0,
      "publication_date": 20190916
    },
    {
      "title": "Poor customer service for defective product",
      "text": "According to the manufacturer, my item has been tampered with because metal tape is absent that is meant to secure the lid to the bottle. If it absent they warn that the item should be returned or discarded. I would like my money returned at the very least or a replacement provided.I didn’t order a defective item. My expectation was that I would be able to use it even though it took so long to get here.",
      "rating": 1.0,
      "verified": true,
      "author": "M Margaret Ashley",
      "helpful_votes": 0,
      "publication_date": 20200525
    },
    {
      "title": "The best",
      "text": "Ok I admit I recently tried to cheap out with a generic version, which didn't do anything. Spend a little bit more for the real deal it's so worth it. No more drippy nose, no itching, no sensitive eyes. Such a relief.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200909
    },
    {
      "title": "Disappointed.",
      "text": "Tried this because my doctor limits me on meds I can use since I have high blood pressure. This is messy. No matter what I did I ended up with liquid running down my nose. I didn't notice any difference after use either. There has to be something better.",
      "rating": 2.0,
      "verified": true,
      "author": "Marcia L.",
      "helpful_votes": 0,
      "publication_date": 20200328
    },
    {
      "title": "It works!",
      "text": "For the first time in almost 2 years of chronic sinus infections, severe indoor allergies which prevented me from getting a good nights rest, I can finally breathe! I tried just about every natural spray and supplement before buying this, and though I still advocate herbal medicine, I will never go without this, so long it keeps working.",
      "rating": 5.0,
      "verified": true,
      "author": "Natatat",
      "helpful_votes": 0,
      "publication_date": 20200330
    },
    {
      "title": "Worked first time!",
      "text": "Great product! I had been suffering with a terribly runny nose;coughing,choking,and I used this spray just once,and the nose stopped running,I stopped coughing and choking. I was amazed! First time I used a nasal spray,instead of pills or capsules.",
      "rating": 5.0,
      "verified": true,
      "author": "ellafan",
      "helpful_votes": 0,
      "publication_date": 20200428
    },
    {
      "title": "Didn't save my life but it improved the quality of it immensely.",
      "text": "I have pet and pollen allergies that caused severe congestion and multiple sneezing fits along with itchy, inflamed eyes. And the worst was the inability to sleep because you don't really sleep when you have 100% sinus blockage. I knew that I needed to try Flonase after when it went over the counter. Even right now with tree pollen falling like fine volcanic dust (it is visible in headlights) I don't have much in the way of symptoms, they've been reduced by about 90 %. The mist that comes from the pump is very fine and has a very faint floral odor. Works.",
      "rating": 5.0,
      "verified": true,
      "author": "Ed Raton",
      "helpful_votes": 2,
      "publication_date": 20150606
    },
    {
      "title": "I prefer Nasacort over Flonase.",
      "text": "I like Nasacort better. It seems to work more effectively and Nasacort is unscented. Now you can purchase unscented Flonase, but it costs more!! Forget it, I'll stick to Nasacort.",
      "rating": 3.0,
      "verified": true,
      "author": "Happy from Boston!! ",
      "helpful_votes": 5,
      "publication_date": 20170517
    },
    {
      "title": "get if you have any type of allergies",
      "text": "get this product if you have allergies and nothing seems to quite work to get rid of all symptoms. I take an allergy pill and this spray-I have 3 cats and am allergic-this helps me get to live with my cats in peace-well worth the money",
      "rating": 5.0,
      "verified": true,
      "author": "Danielle",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "Good medicine but bad packaging!",
      "text": "Doesn't work very well. I've used this two times, I found it doesn't work, you have to prime it every time which wastes so much of the medicine it doesn't last long. It's not worth the price!",
      "rating": 1.0,
      "verified": true,
      "author": "Sue H",
      "helpful_votes": 2,
      "publication_date": 20180604
    },
    {
      "title": "Pump stops working halfway...",
      "text": "I've used Flonase for awhile now its effectiveness seems to be dropping and one big concern is that this is a 120ct spray but the sprayer stops functioning halfway through and this has happened every time I purchase a new bottle. I always check the bottle/nozzle and have to waste sprays just to try and get the mist back. So I'm paying this money for half a bottle? That's not right by the manufacturer.",
      "rating": 2.0,
      "verified": true,
      "author": "RCsmith",
      "helpful_votes": 0,
      "publication_date": 20200929
    },
    {
      "title": "Great allergy medicine",
      "text": "I am currently deployed to Iraq and my allergies were horrible. I tried Zyrtec and banadryl and nothing worked. I ordered Flonase and although it says it may take a few uses to work it worked right away. I highly recommend this product. Just two pumps in each nostril and you are good to go for the entire day.",
      "rating": 5.0,
      "verified": true,
      "author": "yajaira rosario",
      "helpful_votes": 0,
      "publication_date": 20190601
    },
    {
      "title": "Flonase is fantastic, and great that it's over the counter!",
      "text": "Flonase is great. once a day, you're set. IF you have allergies, this is a must. Get it from amazon and save several $ compared to what you would spend at a commercial pharmacy. Works fast, lasts all day. Yes, the first time you spray it feels really weird, but after that it gets easier",
      "rating": 5.0,
      "verified": true,
      "author": "Jason",
      "helpful_votes": 3,
      "publication_date": 20161210
    },
    {
      "title": "Doctor Recommended Product",
      "text": "Recommended by my doctor back when it was prescription only. I love that you can pick it up anywhere now. This stuff gets rid of any swelling in my nose that allows me to breathe better and also avoid sinus infections. Highly recommended product that I'm so happy to have found.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa",
      "helpful_votes": 0,
      "publication_date": 20190605
    },
    {
      "title": "Performs As Advertised......Well Worth The Cost!",
      "text": "New to allergies, I researched and tried numerous brands of tablets in hopes of relieving the symptoms, and breaking my addiction to a popular decongestant nasal spray. Ingesting a substance which enters the blood stream is far less desirable then medication directed to the problem area. In my case, the antihistames in pill version produced elevated blood pressure. Long term effects or damage could possibly lead to other problems. On the third day of using Flonase as prescribed, the results thus far are excellent. Once the supply is exausted, I will be putting Nasacort to the test as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve",
      "helpful_votes": 0,
      "publication_date": 20150323
    },
    {
      "title": "Just ok.",
      "text": "I have used Flonase since it first came out, when it was prescribed and it has always worked well. I am giving it such a low rating for these reasons; it was nearly expired when it arrived and, frustratingly, if used daily it causes my sinuses crack and bleed.",
      "rating": 2.0,
      "verified": true,
      "author": "Victoria M.",
      "helpful_votes": 0,
      "publication_date": 20190907
    },
    {
      "title": "Breath",
      "text": "Ive been using flonase for years now and compared to the other brands this ones really the best. I can breath so easy during the allergy season and it even gets rid of my coughing and eye itching.",
      "rating": 5.0,
      "verified": true,
      "author": "Hauler",
      "helpful_votes": 0,
      "publication_date": 20200813
    },
    {
      "title": "Fixed my allergies",
      "text": "I have issues with allergies. I think my nose naturally has a slow leak and when it got worse and I started sneezing this past spring I tried Flonase (I've tried Claritin, Allegra etc) and it seems to have fixed me. I don't need to blow my nose nearly as often and I have stopped sneezing. I haven't had any issues with the fires going on now either. (I live in CA.)",
      "rating": 5.0,
      "verified": true,
      "author": "E K",
      "helpful_votes": 0,
      "publication_date": 20200919
    },
    {
      "title": "5 months till expire",
      "text": "I order it on March and the expire date is August, which only 5 month later. Mine last one is from cvs which have more than one year till expire. if you don't need it everyday, better get it from a drug store or most of the bottle will waste.",
      "rating": 3.0,
      "verified": true,
      "author": "sss",
      "helpful_votes": 0,
      "publication_date": 20200313
    },
    {
      "title": "Flonase",
      "text": "I'm disappointed with the Flonase allergy nasal spray. I have had severe allergies this year and I really thought that this product would be the answer. It wasn't. It maybe that it's because of my body not responding to the medication.",
      "rating": 3.0,
      "verified": true,
      "author": "Carol Furumoto",
      "helpful_votes": 0,
      "publication_date": 20200602
    },
    {
      "title": "Stopped spraying after using 1/2 the bottle",
      "text": "Stopped spraying with the mist , just dribbles . Contacted Flonase customer relations dept with issue , sent pictures of code on bottle and then never heard anything back from them ? Back to Nasacort for me . Disappointed in this company",
      "rating": 2.0,
      "verified": true,
      "author": "TN Titans ",
      "helpful_votes": 0,
      "publication_date": 20190708
    },
    {
      "title": "I was so happy to see this over the counter",
      "text": "I was so happy to see this over the counter. I use to take this as a teenager when it was prescription only. I love flonase, it seems to work better than any other nasal spray for me. It stops my sneezing, runny nose, itchy eyes (although it does take a couple of doses, dont expect it to work the first time you take it). It has a flowery scent but I like it and it isn't a scent that would make me sneeze. When I was a kid the scent actually helped me take it regularly since it is pleasant to me",
      "rating": 5.0,
      "verified": true,
      "author": "nikarico",
      "helpful_votes": 2,
      "publication_date": 20150529
    },
    {
      "title": "Does what it's supposed to.",
      "text": "Does what it's supposed to, but give it a few days of use to see more long lasting effects. It can be a little difficult to aim if you don't know what your'e doing. Or just take a benedryl.",
      "rating": 5.0,
      "verified": true,
      "author": "Dreygyr",
      "helpful_votes": 0,
      "publication_date": 20191114
    },
    {
      "title": "Wonderful!",
      "text": "I use to have this as a prescription and I could always tell a few days later after I've ran out. So it doesn't work in the sense of immediate relief like some over the counter models. It's more like a medicine that works in the background. It takes a few days to a couple weeks to start working for the first time. But once it does, it helps a lot. I use it for pet dander. Using it more than directed can cause a very stiff neck, so if that happens to you, you'll know why. Following the directions on the bottle is all that is needed.",
      "rating": 5.0,
      "verified": true,
      "author": "D-Man",
      "helpful_votes": 0,
      "publication_date": 20151118
    },
    {
      "title": "Helping immensely with spring allergies and congestion",
      "text": "I've got bad seasonal allergies and chronic rhinitis, and because of this my nose is super congested like 95% of the time. I've been taking this in combination with Xylitol to moisturize and clean out my nose, and my allergies and congestion have gone down like 75%. My eyes are still itchy, and my nose gets a little congested, but its way more clear than it has been in as long as I can remember. Give it a shot if nothing else is working for your allergies and congestion!",
      "rating": 5.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 2,
      "publication_date": 20150504
    },
    {
      "title": "I used Nasonex before and I experience nose bleed. ...",
      "text": "I used Nasonex before and I experience nose bleed...after one week. After 5 year's I decided to give Flonase a try because I was using extreme congestion nasal spray for 3 months.....every day. I have not used it since I started Flonase. Well worth the money be able breath without nasal congestion. Also, it takes a few days for Flonase to start working. I had to use my nose spray until it kicked in. 👍",
      "rating": 5.0,
      "verified": true,
      "author": "Yogi",
      "helpful_votes": 0,
      "publication_date": 20180609
    },
    {
      "title": "Easy to use",
      "text": "Honestly i dont know if this thing works but both of the doctors i went to recommended it. The only reason I am reviewing it is the ease or use.",
      "rating": 5.0,
      "verified": true,
      "author": "Kay",
      "helpful_votes": 0,
      "publication_date": 20200829
    },
    {
      "title": "Flonase WIN",
      "text": "Praise the inventors of Flonase. This stuff works for me better than Claritin, Allegra, etc. etc. etc. I'm thankful that I can be cured of allergy symptoms without remembering to swallow a pill.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelsey",
      "helpful_votes": 0,
      "publication_date": 20191115
    },
    {
      "title": "ENT suggested",
      "text": "Worked well for my seasonal allergies. Chronic sinus issues so I do use this daily with a nasal rinse SinuFlo Ready Rinse by NeilMed.",
      "rating": 5.0,
      "verified": true,
      "author": "BGM",
      "helpful_votes": 0,
      "publication_date": 20200513
    },
    {
      "title": "I can breathe again",
      "text": "Wonderful! Really makes it easier to breathe at night and during the day. If this one is a problem for your nose, you can use the sensitive mist version they make. This is life changing if you have allergies like mine.",
      "rating": 5.0,
      "verified": true,
      "author": "Redpanda500",
      "helpful_votes": 0,
      "publication_date": 20190727
    },
    {
      "title": "Real is better",
      "text": "Wondered if Flonase was better than generic. It’s in the unit itself. Sprays are well metered. Generics spray is not reliable...comes out watery.",
      "rating": 5.0,
      "verified": true,
      "author": "Cavs",
      "helpful_votes": 0,
      "publication_date": 20200713
    },
    {
      "title": "This really works for my allergies",
      "text": "I have tried MANY different allergy medicines. Flonase is the first one that has worked really well and consistently. I start off using it twice a day then taper off to once a day through the summer.",
      "rating": 5.0,
      "verified": true,
      "author": "negburn7",
      "helpful_votes": 0,
      "publication_date": 20190710
    },
    {
      "title": "Better than other allergy meds",
      "text": "Flavor is gross but it works better than other allergy meds, my nose does get blood in my mucous now not heavy. My allergies are terrible I've taken four 24hr allergy meds together along with three four hours. Right now it seems better with the flonase as directed but my allergies still bother me, idk if anything will truly help.",
      "rating": 4.0,
      "verified": true,
      "author": "Lisa",
      "helpful_votes": 0,
      "publication_date": 20190616
    },
    {
      "title": "What a relief!!!",
      "text": "My allergy is so bad that I have to take two types of allergy medicine. One taken orally and this spray. What a relief! I'm enjoying working on my lawn again.",
      "rating": 5.0,
      "verified": true,
      "author": "Luv4 USA",
      "helpful_votes": 0,
      "publication_date": 20191214
    },
    {
      "title": "Product ran out too soon",
      "text": "This product works well for the intended purpose, curbing my allergies when needed. The problem I had is that this is supposed to contain 120 sprays, yet it ran out rather quickly. Should have lasted 2 months based upon single spray once per day, yet was empty after 6 weeks.",
      "rating": 2.0,
      "verified": true,
      "author": "mommylr",
      "helpful_votes": 0,
      "publication_date": 20190531
    },
    {
      "title": "It's great stuff",
      "text": "I used to use Nasacort. It didn't really help my congestion at all. So after using it for about 3-4 months, I decided I had given it plenty of time to 'work' and I started looking for something else. I decided to try Flonase and I'm glad I did. It has helped my congestion a lot! I make sure I never run out.",
      "rating": 4.0,
      "verified": true,
      "author": "nanalores",
      "helpful_votes": 3,
      "publication_date": 20160119
    },
    {
      "title": "It works",
      "text": "Works well for me. Took a few days to kick in but now have no need for oral medications for my allergies. Surprised it works as well as it does.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve Dofelmier",
      "helpful_votes": 0,
      "publication_date": 20200409
    },
    {
      "title": "This product was never received",
      "text": "I love this product, and would like to receive it. After receiving assistance from apartment management (search of name, apartment, number, search of Amazon Hub compartments), it was determined that this product was nowhere on the premesis.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200504
    },
    {
      "title": "BEST Allergy Med EVER",
      "text": "I've got bad allergies. All year allergies. I've taken medicine my WHOLE life. Been through them all, Claritin, Allegra, Zertec, Benadryl etc. What's worse is I have a cat and a dog and they SLEEP WITH ME. This is the ONLY medicine that keeps me from having a miserable, pet free life. I would recommend it to anyone who has had trouble finding the right allergy med to work for them. This just might be the one for you too!",
      "rating": 5.0,
      "verified": true,
      "author": "JennyMarie",
      "helpful_votes": 0,
      "publication_date": 20151030
    },
    {
      "title": "Flonase is the only thing that works for me.",
      "text": "I used to have to go in to get this stuff through prescription, so I was super excited when they decided to sell it without. This is the only thing that has ever worked for my allergies; be warned it takes about a week or two for the product to set in, so if you're like me with seasonal allergies try to plan yourself before your season hits.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 2,
      "publication_date": 20160602
    },
    {
      "title": "Great relief of chronic runny nose",
      "text": "I’ve had a minor but annoying runny nose for probably a year now and an ear nose and throat doctor recommended this. It makes a huge difference and I found I don’t even have to use it every day. I use it a few times a week with no runny nose anymore. No complaints!",
      "rating": 5.0,
      "verified": true,
      "author": "Diego",
      "helpful_votes": 0,
      "publication_date": 20190726
    },
    {
      "title": "Necessary for me in the Spring",
      "text": "I can't take Claritin because it makes me sleepy (even the non-drowsy kind) but this works just as well if not better. The one negative is that its uncomfortable to spray it up your nose and tastes nasty on the way down.",
      "rating": 5.0,
      "verified": true,
      "author": "Songovstorms",
      "helpful_votes": 0,
      "publication_date": 20200416
    },
    {
      "title": "Wonderful Allergy Relief",
      "text": "If you have allergies this product is for you. This is the only thing that really helps me with my allergies.",
      "rating": 5.0,
      "verified": true,
      "author": "Mendotagirl",
      "helpful_votes": 0,
      "publication_date": 20200316
    },
    {
      "title": "Cleared out my allergies",
      "text": "I have been suffering from allergies for a while. Tried a few natural methods but want getting much results. My doctor recommended this and I was cured after 3 or 4 days of using it. Very happy with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Rocio R",
      "helpful_votes": 0,
      "publication_date": 20191114
    },
    {
      "title": "This stuff works.  The competitor does not.",
      "text": "This is the only thing that helps me with my allergies. They're awful and last all year long. I suffered for years with a cough from the postnasal drip. I needed a stronger medication than just using Claritin alone which does nothing for postnasal drip. This fits the bill.",
      "rating": 5.0,
      "verified": true,
      "author": "renemarie",
      "helpful_votes": 3,
      "publication_date": 20160119
    },
    {
      "title": "Sweet relief!",
      "text": "Went from sneezing all day and watery, itchy eyes to feeling almost no symptoms after just a couple days of using this!",
      "rating": 5.0,
      "verified": true,
      "author": "Crista",
      "helpful_votes": 0,
      "publication_date": 20200326
    },
    {
      "title": "Clears the nasal passages well so can sleep.",
      "text": "Ease of use and clears the nasal passage well. More expensive than other products but does the job.",
      "rating": 5.0,
      "verified": true,
      "author": "Marcia Bliss",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "Really happy with this nasal spray",
      "text": "I recently moved to a new part of the country and my allergies have been worse than ever. I've usually been okay with just taking a Benadryl but lately I've needed something else. I got this nasal spray and within a week, I have been feeling significantly better. I recommend this nasal spray for allergy relief because it works fast and it doesn't make me drowsy.",
      "rating": 5.0,
      "verified": true,
      "author": "Fatfrog",
      "helpful_votes": 0,
      "publication_date": 20190330
    },
    {
      "title": "Excellent for Allergy/Asthma !",
      "text": "I have asthma and year round allergies. My doctor recommended I use Flonase and it has made a huge difference for me! I recommend it!",
      "rating": 5.0,
      "verified": true,
      "author": "Daisy",
      "helpful_votes": 0,
      "publication_date": 20200419
    },
    {
      "title": "Sniff sniff no more",
      "text": "Only thing that has worked for my husbands allergies. He is sniffing all day, every day and allergists have recommended he get shot therapy where he has to go in weekly for a few months getting shots to build up his 'tolerance' I guess. Flonase has made a huge difference for him that we won't be needing the couple thousand dollar treatment.",
      "rating": 5.0,
      "verified": true,
      "author": "SBanana",
      "helpful_votes": 0,
      "publication_date": 20160616
    },
    {
      "title": "Flonase",
      "text": "Flonase I find to be one of the best reliefs for allergies Good price from Amazon",
      "rating": 5.0,
      "verified": true,
      "author": "Richard Goldstein",
      "helpful_votes": 0,
      "publication_date": 20200830
    },
    {
      "title": "No prescription needed now.",
      "text": "This stuff works and now I don’t need a prescription. Definitely worth having around if you have sinus issues.",
      "rating": 5.0,
      "verified": true,
      "author": "Christian",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "great product, recommended by doctors i work with everyday",
      "text": "great product, recommended by doctors i work with everyday, i use it 2 to 3 times a week. great price on amazon. product was genuine, used amazon locker, which is super convenient for me. amazon prime is the wonderful, and this price and convenience can't be beat.",
      "rating": 5.0,
      "verified": true,
      "author": "93",
      "helpful_votes": 0,
      "publication_date": 20170408
    },
    {
      "title": "A must for all allergy sufferers",
      "text": "Cannot get through allergy season without Flonase! A must for anyone suffering from allergies!",
      "rating": 5.0,
      "verified": true,
      "author": "Erica G",
      "helpful_votes": 0,
      "publication_date": 20200709
    },
    {
      "title": "amazing",
      "text": "this is even better than Nasonex which I used get with a prescription , 6 hours after using it , I was shocked blowing chunks out of my nose , just don't use it more than a couple of days.",
      "rating": 5.0,
      "verified": true,
      "author": "elena",
      "helpful_votes": 0,
      "publication_date": 20190209
    },
    {
      "title": "Great Price",
      "text": "Great price on this item and works very well for allergies. This is my favorite allergy medicine and I have been using it for years. This flonase works better then the sensi mist in my opinion.",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan",
      "helpful_votes": 0,
      "publication_date": 20181230
    },
    {
      "title": "Exactly what you expected in a bigger package",
      "text": "I gave 3 stars for flavor because it didn't really have a flavor. The spray itself is big and bulky which is great for people like me that easily lose items like this. The product works as described and helps clear your nose.",
      "rating": 5.0,
      "verified": true,
      "author": "MALee",
      "helpful_votes": 0,
      "publication_date": 20191130
    }
  ],
  "product_meta": {
    "title": "Flonase Allergy Relief Nasal Spray, 24 Hour Non Drowsy Allergy Medicine, Metered Nasal Spray - 120 Sprays",
    "description": "Flonase Non Drowsy Allergy Medicine for 24 Hour Allergy Relief relieves your worst allergy symptoms, including nasal congestion, all in an easy-to-use allergy nasal spray that outperforms the top non-drowsy allergy pill. Unlike over the counter allergy medicines that only block one inflammatory substance in the body, this nasal congestion relief spray helps block six allergic substances for powerful multi-symptom relief. Whether you're seeking relief during allergy season or dealing with year-round allergies, this allergy relief nasal spray helps you achieve more complete relief of allergy symptoms caused by pollen, mold, dust and pet dander. It works directly in your nose to relieve a variety of symptoms, including nasal congestion, runny nose, sneezing, itchy nose and itchy, watery eyes. Unlike Flonase allergy relief spray, most allergy pills don't finish the job because they don't relieve nasal congestion. Adults and children 12 years of age and older may use up to two sprays of Flonase nasal spray in each nostril daily. Satisfaction Guarantee If for any reason you are not satisfied with any GSK Consumer Healthcare product, GSK Consumer Healthcare will provide you with a reimbursement within 45 days of the date of purchase. Please note that because GSK is unable to control the quality of our products sold by unauthorized sellers, the Guarantee is not available for products purchased from unauthorized sellers due to potential quality issues outside GSK’s control. Please contact GSK Consumer Healthcare directly for more information.",
    "rating": 4.7,
    "feature_bullets": [
      "One 120-spray bottle of Flonase Allergy Relief Nasal Spray, 24 Hour Non Drowsy Allergy Medicine, Metered Nasal Spray",
      "The most prescribed allergy medicine, Flonase provides nasal congestion relief and alleviates runny nose, sneezing, itchy nose and watery, itchy eyes",
      "The most doctor recommended brand in allergy relief, Flonase creates an allergy shield at the source of your symptoms for unsurpassed symptom relief",
      "Fluticasone propionate allergy medication controls seasonal and year-round allergy symptoms",
      "24 hour allergy medicine that delivers prescription-strength relief all day and night",
      "Easy to use allergy nasal spray formulated for adults and children 12 years of age and older",
      "Use up to two sprays in each nostril daily"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "5.53 x 4.5 x 5.25 inches; 3.84 Ounces",
      "Item model number": "20020",
      "Date First Available": "January 1, 2015",
      "Manufacturer": "Flonase",
      "ASIN": "B00MXOVBO0",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Health Care",
      "Sinus Medicine",
      "OTC Medications & Treatments",
      "Health & Household",
      "Allergy, Sinus & Asthma",
      "Health, Household & Baby Care"
    ],
    "price": 20.25
  }
}