{
  "website_summaries": [
    {
      "verdict": "A quality multi-cooker that acts as an electric pressure cooker but can also slow cook and much more.",
      "pros": [
        "Notable for its flavor infusion technology, which helps create delicious meals",
        "Easy to use with a range of preset options",
        "The nonstick cooking pot is dishwasher safe and easy to clean"
      ],
      "cons": [
        "Some users report their appliance stopped working after only a few months"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "The Teflon is coming off after three uses.",
      "text": "Very disappointed with the quality of the product. The Teflon is coming off after three uses.",
      "rating": 1.0,
      "verified": true,
      "author": "Hobo",
      "helpful_votes": 253,
      "publication_date": 20170903
    },
    {
      "title": "Fail!",
      "text": "I have used this product for one thing only, cooking beans and on the sixth (6) time I used it it would not heat up. No matter what I do it does not work. I contacted the manufacture and they want me to pay 25 bones to ship it to them to see if it can be repaired and another 25 dollars to ship it back to me.. Why would I do that for a defective piece of equipment?? 60 day warranty on defects, You should run, shame on me for not researching this first.. 4 Star when it worked 2 Star on your warranty on workmanship..",
      "rating": 1.0,
      "verified": true,
      "author": "Texas-Hunter",
      "helpful_votes": 75,
      "publication_date": 20170815
    },
    {
      "title": "Very disappointed in short lifespan.",
      "text": "I bought this 10qt Pressure Cooker in June of 2016. In July of 2017 this cooker failed to pressurize. There was steam escaping from the perimeter of the lid and along the black handle of the lid. I had only used it 5 times to cook beef stews and steam broccoli. I am so disappointed. I will not buy this product again.",
      "rating": 1.0,
      "verified": true,
      "author": "B. Burton",
      "helpful_votes": 27,
      "publication_date": 20171002
    },
    {
      "title": "Very poor customer service",
      "text": "UO80 8 Qt 7-in-1 Multi- Use Programmable Pressure Cooker, Slow Cooker, Rice Cooker, Steamer, Sauté, Yogurt Maker and Warmer Very poor customer service. Quit working within 10 months. Byconnie billieon November 24, 2017 Though I LOVED this pot when it was working, I had trouble with the lid malfunctioning within about 2 months . It took me 6 mo to get a replacement and it was a struggle. Then BAM! Quit working within 10 months. Just shut off while I was using it. Tried contacting manufacturer several times. Never answered. And oh, you can’t talk to anyone, it’s like trying to get through Fort Knox. I really want another one bc I love it, but won’t buy this one again.",
      "rating": 1.0,
      "verified": true,
      "author": "connie billie",
      "helpful_votes": 18,
      "publication_date": 20171124
    },
    {
      "title": "another customer with a non-working pressure cooker",
      "text": "do the math. over 440 one-star reviews. wish we saw that before ordering. ours would not pressurize. it leaked steam from all around the lid. i've spent 25+ years building custom kitchens and installing appliances. i am quite adept at working with mechanical and electrical and digital items. there is no explaining why the pressure leak was occuring, except for the disfigured inner lid cover and gasket...",
      "rating": 1.0,
      "verified": true,
      "author": "Sergio Nikita",
      "helpful_votes": 16,
      "publication_date": 20180311
    },
    {
      "title": "Poor quality",
      "text": "We had this product less than 3 months and it just quit working, we missed the return date and now we are stuck with it. VERY UNHAPPY",
      "rating": 1.0,
      "verified": true,
      "author": "Rock Solid",
      "helpful_votes": 26,
      "publication_date": 20170627
    },
    {
      "title": "Heavier than I thought, it does cook fast. ...",
      "text": "Heavier than I thought, it does cook fast. There is a 20 minute warm up time over and above the times quoted.",
      "rating": 3.0,
      "verified": true,
      "author": "Paula J. Hart",
      "helpful_votes": 18,
      "publication_date": 20170401
    },
    {
      "title": "Best pressure cooker ever",
      "text": "After researching several different brands that my friends had I settled with this one and I'm very happy. I've made everything from scrambled eggs to cheesecake in it. I literally use it every night to make dinner and was so happy that I bought a 6-quart one for my office and now make breakfast and lunch at the office for the entire office. Having this instapot has helped me finally be on track to reach my weight loss goal. It's amazing to have warm suits everyday for lunch on these cold days, and breakfast only takes 4 minutes",
      "rating": 5.0,
      "verified": true,
      "author": "boomer806",
      "helpful_votes": 10,
      "publication_date": 20171112
    },
    {
      "title": "This is really bad quality. I would not buy another one",
      "text": "After using it only a couple of times, the tephlon on the bottom of the pan is gone and I can't even clean it. Called the customer care center and they want to charge $30 to replace the pot. This is really bad quality. I would not buy another one.",
      "rating": 1.0,
      "verified": true,
      "author": "Lila R. Dormishian",
      "helpful_votes": 27,
      "publication_date": 20180103
    },
    {
      "title": "Stopped working",
      "text": "I had this for almost exactly 1 year and it stopped working it will not come on. Just quit. I do not recommend buying this. On the cheap side.",
      "rating": 2.0,
      "verified": true,
      "author": "W. Julian",
      "helpful_votes": 15,
      "publication_date": 20170522
    },
    {
      "title": "Pressure cooker lid will not close!",
      "text": "I have only utilized the pressure cooker occasionally, mainly to pressure cook chickens for my dogs. After the last use, I cleaned the pressure cooker as I always have removing the inner lid assembly then placing it back the way it was taken out. I attempted to close the lid back onto the base, and no matter what I tried the lid would not move into the lock position. The unit has never been misused or dropped, so I was a little perplexed on what is going on here, I contacted the manufacturer and they instructed me to return the pressure cooker + $25 for process and handling, I can't imagine what the cost of shipping will be.",
      "rating": 2.0,
      "verified": true,
      "author": "JimDE",
      "helpful_votes": 3,
      "publication_date": 20181126
    },
    {
      "title": "Fast dinner",
      "text": "OK, i love this cooker. i only have one complaint and that is its hard to clean. The pot is too think and the coating seems to be coming off. It should not be that hard to clean. They do need to come up with a new pot that is easy to clean after 5 times. But, i love the cooker and the food it cooks.",
      "rating": 4.0,
      "verified": true,
      "author": "Donald S. Cooper",
      "helpful_votes": 8,
      "publication_date": 20170713
    },
    {
      "title": "but so far I love how it does",
      "text": "I am still learning to cook with this, but so far I love how it does. I have cooked a roast, ribs, pork roast, and a turkey. They have all come out tender and tasty!",
      "rating": 5.0,
      "verified": true,
      "author": "amd1959",
      "helpful_votes": 11,
      "publication_date": 20161213
    },
    {
      "title": "Pressure cooker is good. But DONT BUY USED",
      "text": "Do. Not. Buy. Used. I got previous owners leftover meals, and some of their hair! Oh and they broke it and its unusable. But the device itself is wonderful. My parents have it and I love it so much",
      "rating": 5.0,
      "verified": true,
      "author": "HaleyTop Contributor: Pets",
      "helpful_votes": 8,
      "publication_date": 20180320
    },
    {
      "title": "already bottom flaking",
      "text": "Only had 4 months and the Teflon on the bottom of the pan is already peeling off. Not to happy about that. We are not hard on our cookware and used no stainless steel utensils on it. Very disappointed in the quality of this!",
      "rating": 1.0,
      "verified": true,
      "author": "Karen",
      "helpful_votes": 13,
      "publication_date": 20180210
    },
    {
      "title": "Rip-off; Stopped working after 2 months",
      "text": "Stopped working after 2 months, it worked on rice, but I had to put it through 2 cycles. Probably very cheaply made. Warrantee in marketing material says 1 year. Manual says 60 days. Rip off",
      "rating": 1.0,
      "verified": true,
      "author": "VitualBuyer",
      "helpful_votes": 41,
      "publication_date": 20170414
    },
    {
      "title": "Terrible Quality & Service.",
      "text": "Received the first order with a couple of screws on the lid fallen out. Amazon sent out a replacement right away, that was great. After 9 months of use, twice a week, the Teflon coating of the inner pot is fading revealing the aluminum (?). We contacted the manufacturer today for replacement, they redirected us to Amazon and Amazon on the other hand can't replace it after the 30 days. So we are returning the product today.",
      "rating": 1.0,
      "verified": true,
      "author": "Jess A",
      "helpful_votes": 5,
      "publication_date": 20171019
    },
    {
      "title": "I use my pressure cooker every single day I love cooking with it",
      "text": "I use my pressure cooker every single day. I love cooking with it. I want to get a second one just the cook additional dishes on the side. Sometimes, when I put the lid on, it seems as if it is locked, but it isn't. I will have to readjust the lid which can slow down my cooking time. I'm pleased overall. I like the look of it. I enjoy the ease of cooking with it. Excellent item.",
      "rating": 5.0,
      "verified": true,
      "author": "Shary",
      "helpful_votes": 6,
      "publication_date": 20171217
    },
    {
      "title": "Warranty for Product :(",
      "text": "The pressure coomer worked great for 1 month. Then the screw on top came off. Now pressure wont buildup. Plus warranty information states that i have to pay to send pressure cooker in to be fix or replaced. My happy experience has turned SOUR!",
      "rating": 1.0,
      "verified": true,
      "author": "amelia",
      "helpful_votes": 10,
      "publication_date": 20170922
    },
    {
      "title": "Fast & Easy Meals",
      "text": "Very versatile! Bought for my adult son (at his request) for quick and easy meals. He is very happy with it, loves to cook using it, and says clean-up is a breeze!",
      "rating": 5.0,
      "verified": true,
      "author": "Karen Smith",
      "helpful_votes": 9,
      "publication_date": 20170409
    },
    {
      "title": "Keep searching this pressure cooker will let you downwn",
      "text": "Was very excited to get this pressure cooker. Muchly fissapointed when coating on inner pan started flaking off after second use. I was not able to use for first year due to family medical and other issues I was not home much. I've been trying to find a replacement stainless steele liner but none available by this company. Im going to try and find a comparable one. Wish I had used it before warranty passed but by reading reviews it wouldn't have made a difference.",
      "rating": 1.0,
      "verified": true,
      "author": "OldnFluffy",
      "helpful_votes": 3,
      "publication_date": 20190109
    },
    {
      "title": "i try and never again.",
      "text": "good product when is new. after 10 months starts braking down parts after parts. costumer service very bed. thats why they give you only 60 days warranty. i try and never again.",
      "rating": 1.0,
      "verified": true,
      "author": "Jan Bendzuch",
      "helpful_votes": 13,
      "publication_date": 20161216
    },
    {
      "title": "First off I love the size of the cooker",
      "text": "First off I love the size of the cooker... It cooks food faster than my smaller version ... Downside : it has the food warner selection button but when you get receive the cooker , in the manual it says food warmer option is not included",
      "rating": 3.0,
      "verified": true,
      "author": "bkto22",
      "helpful_votes": 15,
      "publication_date": 20170410
    },
    {
      "title": "Lid leaks, danger",
      "text": "I purchased this 10qt power xl pressure cooker, because I have a smaller 6qt, and never had no problem with it, I could have gotten a cheaper one but I decided to spend the extra money to be trouble free, wrong the lid has leaked steam each time I used it,I would have to keep adjusting it . This machine scares me when it heats up steam flows all around the lid before it seals, and wont seal on it's own without adjusted it..I think it's the seal...but havnt used it much to be worn, but with the easy it is nite it's dangerous.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20181118
    },
    {
      "title": "Wonderful power pressure cooker",
      "text": "Very satisfied with my power pressure cooker,will be using it quite a lot. Love how it turns itself off when done,don't have to worry about running to see if the food is done.",
      "rating": 5.0,
      "verified": true,
      "author": "Frances",
      "helpful_votes": 7,
      "publication_date": 20170509
    },
    {
      "title": "Not Hot at ALL",
      "text": "Just received this item today. Takes forever and a day to heat our get to temperature. I've owned a pressure cooker before but it was a namebrand. I never had this problem with it taking this long to start steaming and locking. I will be returning this product. Don't buy this item!",
      "rating": 1.0,
      "verified": true,
      "author": "William Wright",
      "helpful_votes": 8,
      "publication_date": 20170830
    },
    {
      "title": "Great buy!",
      "text": "Works Great! I love this thing. It comes with a cup, a rack, and a spoon. There is also a chopper that does your veggies, like onions.Wonderful fall apart, moist meat. I live alone, I use this nightly. Its super easy to clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr.Truth",
      "helpful_votes": 7,
      "publication_date": 20170119
    },
    {
      "title": "Not happy",
      "text": "I am really upset. I bought this and I think I bought a lemon. I bought one for my sister and my sister in law also. But mine is not working like the ones they have. I can't close my lid for some reason.",
      "rating": 2.0,
      "verified": true,
      "author": "Donald M.",
      "helpful_votes": 10,
      "publication_date": 20170907
    },
    {
      "title": "GREAT NEW METHOD.  FIRST SAW INFOMERCIAL",
      "text": "IT TAKES SOME STUDY BUT WORKS VERY QUICKLY TO MAKE FOOD TENDER. ALSO, IT COOKS LARGE OR SMALL QUANTITIES.",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara A. Harris",
      "helpful_votes": 11,
      "publication_date": 20170503
    },
    {
      "title": "I love this product",
      "text": "I love this product. I have used it to make bbq pork ribs, pinto beans and look forward to learning more recipes. So far I am very pleased with product. I look forward to learning how to can. I would highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "JS Alaska",
      "helpful_votes": 34,
      "publication_date": 20160827
    },
    {
      "title": "Good Product Bad Customer Support",
      "text": "It is a nice product, however, for some reason the coating inside the cooking pot started to come off, which made us a bit skeptical to cook in it. We called the manufacturer and told us to call Amazon since we bought through Amazon. We asked for a replacement inner pot, and they refused. In general it is a good product but the way they are doing business is WRONG.",
      "rating": 1.0,
      "verified": true,
      "author": "sahraouil",
      "helpful_votes": 14,
      "publication_date": 20170629
    },
    {
      "title": "Excellent gift for a younger cook just starting out",
      "text": "First one that I sent my nephew didn't work, so make sure you test for the seal. Replaced easily by calling customer service number on Amazon page. He has already cooked chicken dinner in 30 minutes. He loves it. Caramelized onions and cooked a frozen roast all after returning from a day of work. He had only good things to say about it and it's many features. He and his roommate are eating great meals! Would have given it another star but the first one did have problems. Recommend doing the test that they recommend doing before cooking in it. That way you know if it works .",
      "rating": 4.0,
      "verified": true,
      "author": "D. GAINER",
      "helpful_votes": 0,
      "publication_date": 20180901
    },
    {
      "title": "Power pressure cooker XL8",
      "text": "Quit working after about 4 months, it costs $50 to ship to & from the manufacturer for repairs, not willing to spend that much money on something that quits working so soon after buying,",
      "rating": 1.0,
      "verified": true,
      "author": "Jacqueline M. Franks",
      "helpful_votes": 16,
      "publication_date": 20170728
    },
    {
      "title": "This thing is so amazing that I actually purchased a second one as a ...",
      "text": "This thing is so amazing that I actually purchased a second one as a wedding gift. I've always been afraid of pressure cookers, but this one is fool proof and makes amazing food in no time flat!",
      "rating": 5.0,
      "verified": true,
      "author": "isweatbutter",
      "helpful_votes": 4,
      "publication_date": 20170704
    },
    {
      "title": "Love it!",
      "text": "I was skeptical about this at first, but started using it because my daughters bought it for Christmas two years ago. I am sold on it! It’s great to be able to cook hard cooked eggs, regardless of their age, and they peel beautifully. Cooking old pinto beans is wonderful, even though it does take about two hours. However, without this pressure pot, they never would cook up. The only thing I don’t like about it is that it is a little difficult to clean the room where the lid fits into the pot. But, that is a minor problem.",
      "rating": 5.0,
      "verified": true,
      "author": "JLGL",
      "helpful_votes": 0,
      "publication_date": 20190110
    },
    {
      "title": "I love this appliance",
      "text": "I love this appliance. It has preformed as advertised. No issues. The food tastes great! Looking forward to canning season.",
      "rating": 5.0,
      "verified": true,
      "author": "Onlydiamondgirl",
      "helpful_votes": 9,
      "publication_date": 20170419
    },
    {
      "title": "Does Not Cook",
      "text": "I mostly wanted this for canning veggies, which is a good thing because you cannot cook in it ! Followed recipe to the letter, cooked one whole chicken for 40 min. Came out pink and bloody near the bone! Had to finish cooking in my oven! With more time it would have cooked ok, but why spend 1 hour 10 min with the pressure cooker??? I can cook in my oven for that amount of time. Haven't canned yet, because it did NOT come with a canning rack. I had to order that separately and wait 10 days for it to arrive. This is ALL HYPE and NO delivery!!! Waste of money !!!",
      "rating": 1.0,
      "verified": true,
      "author": "sarabeth4rd",
      "helpful_votes": 0,
      "publication_date": 20190216
    },
    {
      "title": "It's great for cooking and has a lot of settings",
      "text": "I've been using this for a while now so I feel I can write a review. It's great for cooking and has a lot of settings. Saves a lot of energy over stovetop cooking. You can put frozen meat in here - just up the cooking time a bit. A nice feature is you can brown your meat right in the pot and then set it to pressure cook or slow cook. As far as canning - It only fits 4 pint jars so it's not really functional if you do a lot of canning and I would not trust it for pressure canning. It says it does so that's just my opinion.",
      "rating": 5.0,
      "verified": true,
      "author": "Margaret Dressler",
      "helpful_votes": 5,
      "publication_date": 20151009
    },
    {
      "title": "Awesome invention. My wife has cooked in a stove ...",
      "text": "Awesome invention. My wife has cooked in a stove top pressure cooker for years. This pressure cooker is the best. We have used it to cook several meals. Being from Louisiana, we like our food seasoned and because the food is cooked under pressure the seasoning is infused into whatever one may be cooking. Highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "paul j. stoufflet",
      "helpful_votes": 5,
      "publication_date": 20170214
    },
    {
      "title": "Replace 4 appliances with 1!",
      "text": "The WORST! After a friend raved about it I bought one and haven't even had it 6 months. When I cook rice, I only do two cups at a time and it sounds like a train is coming and spewing water out the top, then rice is crunchy and I have to try again. The bowl is already worn and I do not use any rough cleaning sponge on it so my food sticks so leaving on while at work is out the window. Very disappointed and I've already got rid of all my other appliances it was supposed to replace.",
      "rating": 2.0,
      "verified": true,
      "author": "Jess",
      "helpful_votes": 2,
      "publication_date": 20160724
    },
    {
      "title": "Exceptional cookware.",
      "text": "I used it extensively. 1. Quality of material-outer and inner best I have ever seen. 2. Fastest cooking pressure cooker 3. Somehow able to feel that cooked food could preserve it taste 4. Pressure comes out very fast after cooking. 5. Very easy to use compared to other popular pressure cookers in market 6. Safe too I have used many other pressure cookers but found this one might be top of the the line. -----------",
      "rating": 5.0,
      "verified": true,
      "author": "AM",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "The pressure cookeri is perfect for cooking ribs and a 14 lb turkey love ...",
      "text": "The pressure cookeri is perfect for cooking ribs and a 14 lb turkey love how tender it cooked them and the flavor all the way through the meat it is also good for cooking pinto beans in 1 hour perfect",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Angel",
      "helpful_votes": 5,
      "publication_date": 20170907
    },
    {
      "title": "Buy this Cooker today, it’s totally awesome",
      "text": "If you don’t own one of these Cookers, go out today and buy one, or buy through Amazon. This pot is awesome! I’ve cooked some good family meals with this Cooker. Campfire Stew is to die for! This Cooker cooks anything and while your food is cooking, you can do other things you need to be doing because this Cooker is on a timer and you don’t have to keep checking your food like you do in regular pots. This Cooker is better than any pot or Cooker you’ll ever own. I have an 8 and a ten. You won’t regret buying one.",
      "rating": 5.0,
      "verified": true,
      "author": "Cindy &amp; Kim",
      "helpful_votes": 0,
      "publication_date": 20190108
    },
    {
      "title": "Don't buy Power XL -- broke after 25 days",
      "text": "Worked great 2 months and then DIED. Told by power XL that must send ck for 24.95 to cover return shipment to me; UPS to box and send to them $80.00! Not going to do it and NOT BUYING ANOTHER!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Merilee Conley",
      "helpful_votes": 13,
      "publication_date": 20170515
    },
    {
      "title": "I REPLACED AND OLD ONE WITH THIS ONE AND THIS ONE DOESN'T WORK AS WELL AS THE OLD ONE!",
      "text": "I bought this one to replace one that I wore out. This one doesn't seat well (the top) to the bottom part of the unit and all of the liquid steams out of the rim (not the stem release valve at the top) so things burn on the bottom of it. This one is a crappy unit. My old one (of the same kind) cooked nearly 125#'s of chicken for rescue dogs in 3 days. This one is a pain in my ars!",
      "rating": 3.0,
      "verified": true,
      "author": "Pamela E Tobin",
      "helpful_votes": 0,
      "publication_date": 20200610
    },
    {
      "title": "Doesn't last long.",
      "text": "I have bought 3. two for me because the first one quit working a few months after I got it, now this one quit working. The third one was a gift for my sister. She doesn't use her's much so I haven't heard how she likes it. The first one I didn't buy through Amazon, I bought the second one and the one I bought for my sister through amazon. Not Amazon's fault, but I would not recommend this product again.",
      "rating": 1.0,
      "verified": true,
      "author": "PJ",
      "helpful_votes": 0,
      "publication_date": 20180610
    },
    {
      "title": "Wasted $100.00",
      "text": "Had mine for over a year and the neoprene gasket went bad and the steam leaks out around the lid handle so it will not pressure cook. For $100.00 I would think it would last longer. Very disappointing with the quality as the even the sticker on the lid to release pressure was gone in less than a month. JUNK do not buy",
      "rating": 1.0,
      "verified": true,
      "author": "JT",
      "helpful_votes": 5,
      "publication_date": 20150518
    },
    {
      "title": "Cooks fast! Extra has a chopper and can steam",
      "text": "This pressure cooker is really nice! You can cook anything really fast less than 15 to 30 minutes depending on what your cooking. Soups are about 12 min will cook. Meats like BBq ribs can be cooked in 30 to 35 min very fast. Comes with a little vegetable chopper extra and also has a steaming opposition that gives the option to cook tamales on and steam anything.",
      "rating": 5.0,
      "verified": true,
      "author": "s*u*m*",
      "helpful_votes": 0,
      "publication_date": 20200221
    },
    {
      "title": "Fantastic, a must have!",
      "text": "I love my pressure cooker. Its a must have in my house. I work and with this I can still make my family a roast or a pot of beans at the end of the day! I would recommend this item to any one looking to buy. Its very simple to use and cleans up easily. If you are going to cook anything that has a red sauce I recommend you find a way to remove stains from the silicone ring. It collects odors and quite easily. I just use the gel bleach that I have on it and it works great!!",
      "rating": 5.0,
      "verified": true,
      "author": "Ada Yandell",
      "helpful_votes": 0,
      "publication_date": 20170130
    },
    {
      "title": "Perfect for canning",
      "text": "Great product especially for canning/preserving. Easy to use and perfect size and price If reference to the question about whether or not the red lights go off during canning, no they keep rotating as the pressure is building. Then they change to PO and whatever maximum time to can ex: PO20 for 20 seconds and count down",
      "rating": 5.0,
      "verified": true,
      "author": "Viclyn",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "Doesn't build pressure no matter what setting",
      "text": "I bought this pressure cooker in January when I was moving, and plugged it in to use in in March. This cooker has yet to build pressure. I tried to return it, but was past my 30 days. I've owned 3 pressure cookers over the last 10 years, and 2 were the same kind, no issues. I would be cautious when ordering.",
      "rating": 1.0,
      "verified": true,
      "author": "Stephanie Osborne",
      "helpful_votes": 0,
      "publication_date": 20190922
    },
    {
      "title": "Vapor and liquids escape from any angle of the lid.",
      "text": "I ordered in February 2017 for a member of my family he never took with him, finally few months ago I decide tu use it but just right now is feeling. Vapor start to escape from everywhere but then the liquid too and I hear to much noise and I decide to disconnect from electricity, I need to be specific in the liquid I did not add the liquid and this was the number one hundred times traying to cook the same recipe but this time was terrible I do not wants to touch this thing anymore!",
      "rating": 1.0,
      "verified": true,
      "author": "Adela Tovalin",
      "helpful_votes": 0,
      "publication_date": 20181008
    },
    {
      "title": "Room to spare cooking pot roasts!",
      "text": "Really love the size of this for cooking pot roasts! We used to fill our old crock pot to the rim, but this has room to spare. Use it as a slow cooker for tender meat or as a pressure cooker when you're in a hurry.",
      "rating": 5.0,
      "verified": true,
      "author": "Senator",
      "helpful_votes": 2,
      "publication_date": 20180103
    },
    {
      "title": "Not your Mother's pressure cooker.",
      "text": "Great for me and my kitchen duty. EASY to take apart and clean. Love the new silicon seal. Sure beats my Grandma's rubber seal! Cooked a chicken soup first and it turned out great. Second did rice and it was fast and perfect for me. I like my rice a bit sticky so I didn't pre-soak to remove extra starch. Pre-soak ithe rice and it would have been flaky style. Last did a 3 pound roast. Wonderful, \"Pot roast at Grandma's\" flavor and remembrances.",
      "rating": 5.0,
      "verified": true,
      "author": "N. Fritz",
      "helpful_votes": 0,
      "publication_date": 20160329
    },
    {
      "title": "Top doesn’t close",
      "text": "I purchased this for my mothers birthday which is after Christmas. She was finally going to use it for the first time this week and the top does not close because the inner pan is too tall. Seems to be the wrong pan for the cooker I received. Very disappointed because my return time has expired and I peroannly have one of these in an 8 quart that I live by.",
      "rating": 1.0,
      "verified": true,
      "author": "Lizi",
      "helpful_votes": 0,
      "publication_date": 20190413
    },
    {
      "title": "Doesn't cook right",
      "text": "Cooker doesnt cook at the time stated on time menu, I have to cook items twice to get them cook all the way even with extended time.",
      "rating": 1.0,
      "verified": true,
      "author": "CRAZYmera",
      "helpful_votes": 4,
      "publication_date": 20171006
    },
    {
      "title": "Cooking now",
      "text": "My cousin bought this for me as a gift. Went online to spokesperson and got some great recipes. I love this machine. Put away both of my crockpots since this has a slow cook function button. Since you can saute before cooking it cuts down on dishes and mess. It is also easy easy easy to clean.",
      "rating": 5.0,
      "verified": true,
      "author": "CM",
      "helpful_votes": 2,
      "publication_date": 20170305
    },
    {
      "title": "Great for canning",
      "text": "I bought this as an option to use for canning instead of a traditional stove top canner... this thing is excellent! I canned 19 pints of green beans and 5 pints of sweet relish in less than 4 hours. I highly recommend this canner. As a side note... make sure that you place it on an open counter space so that when it vents it will not vent onto upper cabinets. *** Made that mistake with a coffee maker years ago and ruined a cabinet seam.",
      "rating": 5.0,
      "verified": true,
      "author": "Debroh P. Murphy",
      "helpful_votes": 0,
      "publication_date": 20200629
    },
    {
      "title": "I recommend this product",
      "text": "I have made four of the recipes in the small cookbook and I have found that I was satisfied with the outcome, however the timing is off for me, it is nothing to snapping the lid back on and adding time, I made a roast pork, wings, the pot roast, a modified rigatoni recipe, satisfied with all of them, the fast timing of the finished product is the best. I like this product so far.",
      "rating": 4.0,
      "verified": true,
      "author": "Phyllis Simmons",
      "helpful_votes": 8,
      "publication_date": 20150214
    },
    {
      "title": "It works great for goulash or soup",
      "text": "Don't cook just meat in this as it dries it out. It works great for goulash or soup! The steam lock/release is really awkward with nothing good to grip on to turn it with tongs. There's a little nub but it's barely big enough to grip. The pot inside seems like it will scratch easily so I'm very careful with cleaning it. I thought the cooker was cool at first but I can say I don't use it much so it's not that cool.",
      "rating": 3.0,
      "verified": true,
      "author": "Believing",
      "helpful_votes": 0,
      "publication_date": 20180310
    },
    {
      "title": "Stopped working after a few uses",
      "text": "My pressure cooker worked great until today. I purchased it January 9 and have only used it a few times but today I received an error code E4. When I called the company they told me to get in touch with Amazon to get a replacement.",
      "rating": 3.0,
      "verified": true,
      "author": "Pam Woods",
      "helpful_votes": 6,
      "publication_date": 20170314
    },
    {
      "title": "Did not come with a cord...",
      "text": "Not sure why I spent $160 on a piece of equipment that I can't even use because someone forgot to put the damn cord in the box. Tried to click on the support button and apparently that takes you no where. Someone better fix this issue or it's staying at a 1 star review until I can actually use this.",
      "rating": 1.0,
      "verified": true,
      "author": "Ashley",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "DOES NOT SEAL CORRECT, NOW WONT LIGHT UP ON THE PANNEL",
      "text": "THIS THING IS JUNK THIS THING IS JUNK THIS THING IS JUNK THIS THING IS JUNK THIS THING IS JUNK FIRST IT WOULD NOT SEAL, NOW THAT ITS 8 MONTHS OLD AND OUT OF WARRENTY IT WONT COME ON. DON'T WASTE YOUR MONEY, THEESE PEOPLE ARE THEIVES. YOU THINK YOU ARE DOING SOMETHING WRONG YOU KEEP TRYING , THEN YOUR 60 DAY WARRENTY IS OVER THIS THING IS JUNK THIS THING IS JUNK THIS THING IS JUNK THIS THING IS JUNK",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190405
    },
    {
      "title": "Fast and tasty meals- canning so quick, safe,and time saving",
      "text": "The biggest mistake I’ve ever made is not having one of these along time ago. We have cooked meals-Prescher candy right now from the vegetable garden-unbelievable performance. The cooked meals in such a short time unbelievable and tasty.",
      "rating": 5.0,
      "verified": true,
      "author": "Goose Geeslin",
      "helpful_votes": 0,
      "publication_date": 20200712
    },
    {
      "title": "Third time, the charm.",
      "text": "Great product. I've had earlier versions of electric pressure cookers and either sent one back and donated the other. They were clunky, heavy and not user friendly. I saw a demo on this one and decided to give it another try. There is a small learning curve but, so far, I'm impressed and very happy with the purchase. It's quick, easy and the clean up is a breeze.",
      "rating": 5.0,
      "verified": true,
      "author": "Nashi",
      "helpful_votes": 3,
      "publication_date": 20160208
    },
    {
      "title": "LOVE IT!!",
      "text": "I love this pressure cooker! My old one finally died the pot warped so it couldn’t lock and it was so old they didn’t have replacement parts. I decided to upgrade from the 8qt which I thought was big to the 10qt. It says that you could fit a turkey in it and I definitely didn’t believe until I got it! It may not fit a 20lb turkey but a smaller one no problem! You could put two chickens in there at the same time and have no problems! I will buy again and this is usually my go to wedding gift for others and they have all loved it!",
      "rating": 5.0,
      "verified": true,
      "author": "Merissa Smith",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "So far I have not had a good experience with this item",
      "text": "So far I have not had a good experience with this item. I had to get a replacement part after the first time I tried to use it. When I put the new part in and tried to use it again it still did not work correctly. I will try it one more time and see what happens. Maybe I just got a lemon.",
      "rating": 3.0,
      "verified": true,
      "author": "Loretta",
      "helpful_votes": 4,
      "publication_date": 20160323
    },
    {
      "title": "Dissatisfaction of cooker...",
      "text": "At first, I loved my cooker. But, only after a few times, my cooker started sticking on the bottom. Then, only a short time later, it began not working right. It won't lock & build up pressure to get the timer to work. Very dissatisfied.",
      "rating": 1.0,
      "verified": true,
      "author": "keith woods",
      "helpful_votes": 3,
      "publication_date": 20171015
    },
    {
      "title": "The cord and the receptacle that it plugs into will catch fire.",
      "text": "after nearly flawless performance for two years, the floating valve fell out into the garbage disposal and the cord and receptacle melted and caught fire. Tri Star itself is absolutely no help at all for parts or anything else. Found universal floating valves. changed out the plug and the receptacle wiring and wiring connectors fir heavier duty parts....model still works but scary that it may catch fire. I bought ten of these for my family for christmas...hate to think i might be responsible for burning their respective houses down...",
      "rating": 2.0,
      "verified": true,
      "author": "Kerry G.",
      "helpful_votes": 0,
      "publication_date": 20190817
    },
    {
      "title": "power pressure cooker, instructions not compatable or useful.",
      "text": "it does not function like the manual directions dictate. i made one meal with it, and that was a real pain. it does not build up pressure when you lock the lid in place. there is no click when you rotate the cover to the lock position.",
      "rating": 1.0,
      "verified": true,
      "author": "vern rink",
      "helpful_votes": 3,
      "publication_date": 20170906
    },
    {
      "title": "Three Stars",
      "text": "lacks proper cooking instructions - have to guess how long to cook roasts and turkeys, etc.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 10,
      "publication_date": 20170417
    },
    {
      "title": "Did I get a lemon",
      "text": "BOUGHT THIS 6QT POWER PRESSURE COOKER XL TO REPLACE MY BROKEN(dropped and broke it) 8 QT . FROM DAY one I HAVE BEEN UNABLE TO GET THE LID TO WORK. I ALWAYS GET THE LID ERROR MESSAGE WHENEVER I TURN THE LID TO THE LOCK POSITION. THE LID CAN BE LIFTED ANY TIME DURING THE COOKING . I HAVE READ THE TROUBLESHOOTING SECTION OF THE MANUAL AND NOTHING WORKS.",
      "rating": 1.0,
      "verified": true,
      "author": "psandifer",
      "helpful_votes": 0,
      "publication_date": 20190715
    },
    {
      "title": "we love it!",
      "text": "My daughter absolutely loves this pressure cooker. She said she made chicken adobo in 30 minutes as opposed to the usual two hours!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20170401
    },
    {
      "title": "I loved it for many years and a great birthday gift for your loved one",
      "text": "I actually have the 6qt and I purchased the 10qt for my dad, and he love it. I am actually jealous because it's much bigger than mine so I will be purchasing me one in the near future. Now as far as the quality of what is performance is I give it a 10 it is awesome awesome awesome awesome it will make you a lazy cook and that's a good thing sometime",
      "rating": 5.0,
      "verified": true,
      "author": "pamella mcgrew",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "It's great for slow cooking",
      "text": "This thing is great. You have so many different ways you can cook with it and it's big enough for pretty much anything you want to cook. I do slow cooker meals a lot and this works great as a slow cooker.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171010
    },
    {
      "title": "Ordered a new appliance.  looks used.",
      "text": "I paid for a new item. I do not think it was new. Item had scratches on inside of lid. outside of lid has scratches on it and the item looks used. I was careful whrn I took the item out to use to make sure I did not damage it. Also, the inside pot is not stainless steel. I check the manufacturer does not have a stainless steel pot, only third party sells the stainless steel. I bought an extended warranty. I was told by the company I could return it within 60 days. This may have been incorrect.",
      "rating": 1.0,
      "verified": true,
      "author": " Flowers",
      "helpful_votes": 0,
      "publication_date": 20200310
    },
    {
      "title": "Do Not Buy!!!!!!",
      "text": "I bought the 10qt model eleven months ago. It worked great, until it didn’t. The push button controls quit working. It stays on Warm mode. I called power cooker CS for troubleshooting and they told there was nothing they could do, that I needed to call Amazon. I called Amazon and they were helpful , but ultimately I had to call Power Cooker back. This time I was told to send an purchase invoice along with a check for $24.99 in the return box that I was supposed to pay for, to their return department for them to look at.",
      "rating": 1.0,
      "verified": true,
      "author": "cory",
      "helpful_votes": 0,
      "publication_date": 20180827
    },
    {
      "title": "Safe to use",
      "text": "I like the safety lid locking mechanism. I am petrified of pressure cookers but this lid has taken the fear out of using this pot. Everything we have used it for has come out great.",
      "rating": 5.0,
      "verified": true,
      "author": "Shelvy M. Atkinson",
      "helpful_votes": 0,
      "publication_date": 20200513
    },
    {
      "title": "They work really good but the 6 quart size did not come with ...",
      "text": "This is the third one we have ordered. The first two we ordered is an 8 quart size and the last one we ordered is the 6 quart size. They work really good but the 6 quart size did not come with the metal steamer or the metal grate to place the meat on. Who should I contact to have them delivered? Thank you, Mark",
      "rating": 3.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 3,
      "publication_date": 20170319
    },
    {
      "title": "Awesome Product. Fast Shipping. 5 Stars!",
      "text": "Purchased this as a gift for Mom! She wanted to try this one before she got the Ninja version that has more options. She loves it! Great for busy ppl. She's made ribs, soup, casserole, & more!",
      "rating": 5.0,
      "verified": true,
      "author": "Taylor Mellen",
      "helpful_votes": 0,
      "publication_date": 20190117
    },
    {
      "title": "I Think Someone Made a Mistake",
      "text": "I was so excited by this, as I got one for my mom, and it is incredible. Unfortunately when I ordered mine it came in looking like it had been used. The package was clearly a repack, and the products did not appear new at all. It also appeared to have items missing, especially after I checked online to see what should be in the box. There were no manuals.......",
      "rating": 2.0,
      "verified": true,
      "author": "Florida Engineer",
      "helpful_votes": 9,
      "publication_date": 20171119
    },
    {
      "title": "I LOVE IT",
      "text": "Whats all the fuss. I followed the directions and am pleased at the results. Cooked chicken- whole with vegies. Then added water and family had soup the next day. Cooked pot roast and ribs . So much faster. So whats with the recipe book ? I am looking forward to beans and hamhocks. Add own seasonings and go for it. Really convient. Fast and tasty.",
      "rating": 5.0,
      "verified": true,
      "author": "tyler w slawson",
      "helpful_votes": 3,
      "publication_date": 20150704
    },
    {
      "title": "Check the contents immediately!",
      "text": "When I received it and after opening it I found there was NO paperwork in it! No warranty card, instructions...Nothing!. When I went to the website I was taken to a PDF version which is ok but I was continually going back and forth from the computer to the pressure cooker while getting It set up. When I used it, it worked as expected. I think the attention to detail by not having any documents is shoddy.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20160821
    },
    {
      "title": "First time expert",
      "text": "This is the first time I have ever canned, let alone used a pressure cooker. It took me about a 1/2 to figure it out, but after that easy peasy!!!!! I love it and will continue to can every year!!",
      "rating": 5.0,
      "verified": true,
      "author": "Eileen C.",
      "helpful_votes": 0,
      "publication_date": 20200528
    },
    {
      "title": "Nice",
      "text": "This is the only brand we will buy. Because you can can with it. We had ours last one for so long and it was reliable we had to buy the same brand again",
      "rating": 5.0,
      "verified": true,
      "author": "Chester Shuster II",
      "helpful_votes": 0,
      "publication_date": 20200224
    },
    {
      "title": "Pressure cooker 10 QT XL",
      "text": "I really enjoyed this product but my biggest disappointment was that it only lasted for 1 year. I didn't use it every day, perhaps once every other week. It actually just stopped working in the middle of use one day. My food did not completely cook. I unplugged it and plugged it back in but it did not work. Very dissappointed!",
      "rating": 2.0,
      "verified": true,
      "author": "Martha Clark",
      "helpful_votes": 0,
      "publication_date": 20200615
    },
    {
      "title": "It works!",
      "text": "Nervous at first when steam was leaking out of top but it kept pressure between 8-11#. I make my homemade dog food weekly with it, chicken breast, ground turkey, rice, green beans, carrots, sweet potato & apple. Perfect, hour & 45 minutes done perfect!",
      "rating": 5.0,
      "verified": true,
      "author": "J. Tucker",
      "helpful_votes": 0,
      "publication_date": 20190707
    },
    {
      "title": "Very practical quick cooker!",
      "text": "This item is only a 6quart. It also has a steam release valve that has to be replaced periodically. I order the extra valves for it and it works fine.",
      "rating": 3.0,
      "verified": true,
      "author": "Elizabeth Liedtke",
      "helpful_votes": 0,
      "publication_date": 20191001
    },
    {
      "title": "Best. Pressure",
      "text": "Best. Pressure. Cooker. EVER!! My meals always come out perfect and you can taste the seasonings all throughout the meat as if it had been marinating for hours....all in minutes! I would highly recommend to ANYONE!",
      "rating": 5.0,
      "verified": true,
      "author": "Nichi S.",
      "helpful_votes": 0,
      "publication_date": 20171127
    },
    {
      "title": "Believe what you read and hear about this",
      "text": "Repeat the heading several times!!! Greatly reduced cooking time. Used slow cookers and took 8 hours to do what now takes 1 hour at the longest.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 2,
      "publication_date": 20171013
    },
    {
      "title": "There must be a better alternative",
      "text": "It leaks condensation all over the counter, burns meat to the bottom, takes 45 minutes to pressurize, and is difficult to clean. I’m tired of having to chip burned food off the bottom. Giving it away.",
      "rating": 1.0,
      "verified": true,
      "author": "Sunflower",
      "helpful_votes": 0,
      "publication_date": 20191203
    },
    {
      "title": "Recommended for every kitchen",
      "text": "This appliance gets used at least three times a week. If you want a fast, nutricious meal in minutes, whether it is steaming vegetables, cooking rice, or tendering meat, this item does it all. Even novice chefs can appreciate it's versitility. Recommended for every kitchen.",
      "rating": 5.0,
      "verified": true,
      "author": "Ronald Toles",
      "helpful_votes": 3,
      "publication_date": 20150825
    },
    {
      "title": "Works great",
      "text": "Love it! Such a bargain to the name brand, and has worked great almost daily for 2+ yrs. Only downside is, I lost the pressure toggle to it, cannot get a replacement from the company, and no other one fits! Tried a few \"universal\" ones found on Amazon also, and none worked for it. Without that, cant use it at all.",
      "rating": 5.0,
      "verified": true,
      "author": "Arlo",
      "helpful_votes": 0,
      "publication_date": 20190714
    },
    {
      "title": "BIG 10 Qt. Pressure Cooker",
      "text": "The ONLY way to GO!!! Bigger is Better!!! I can do a Whole Chicken Dinner in 15 Min. I can do a Pot Roast in 45 Min. Fall Apart DONE! Fantastic Product!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Keith W. Kitchen Sr.",
      "helpful_votes": 0,
      "publication_date": 20181016
    },
    {
      "title": "A must have for the home cook",
      "text": "First thing made was mac & cheese. Thought it was too good to be true how fast it cooked. I was impressed by the taste and texture. Perfection is all I can say...too date over 50 pints of various vegetables and preserves canned. Oh and can't forget the salsa...",
      "rating": 5.0,
      "verified": true,
      "author": "Johnny Kool",
      "helpful_votes": 3,
      "publication_date": 20151017
    },
    {
      "title": "You need this cooker!",
      "text": "We bought the 12 quart model a year ago. We love it but we needed a smaller one to go with it. The 6 quart model is really big enough for most cooking. The huge one is excellent if you plan to can or entertain a large group of hungry people.",
      "rating": 5.0,
      "verified": true,
      "author": "C. L. Hill",
      "helpful_votes": 0,
      "publication_date": 20170616
    },
    {
      "title": "Loveeeeee this pot.",
      "text": "How did I ever live without this? Ribs fall apart. And cook in an hour. I do however recommend to put ribs on rack as it creates lots of grease. So unless you want your ribs sitting in grease. Use the rack. This was money well spent. I cook everything in it.",
      "rating": 5.0,
      "verified": true,
      "author": "Brenda Pierce",
      "helpful_votes": 0,
      "publication_date": 20191001
    },
    {
      "title": "Done with this product!!!",
      "text": "I loved this in the beginning however as time went i I became very frustrated!! At first the lid started to not locking right and it would just start beeping and flashing lid like it wouldn’t seal correctly. Then the buttons wouldn’t work right in the front the only one that would work was the soup/ stew button. I’m over it!! I called customer service and they were super rude and no help at all!! I was hung up on 3 times. Done with this product!",
      "rating": 1.0,
      "verified": true,
      "author": "BRANDY SNYDER",
      "helpful_votes": 0,
      "publication_date": 20200424
    },
    {
      "title": "A great buy",
      "text": "I bought this for my wife to help in the kitchen and she absolutely loves it! She’s used it everyday since it was delivered a week ago, pot roasts, bbq chicken, rice, mashed potatoes and especially for canning. The only down side is that it does not fit quart jars only pint and jam jars but overall a great purchase and easy to use and clean!",
      "rating": 5.0,
      "verified": true,
      "author": "jacob r koontz",
      "helpful_votes": 0,
      "publication_date": 20180804
    },
    {
      "title": "Would buy I again!",
      "text": "Works great. Calls for a lot of experimentation. Wish there was more recipes. I am a recipe kind of gal. Just be sure and read all the paper work with it. The 100.00 food coupon is a joke unless you like to go through all those things. I definitely am happy I got the 10 quart. I think I would have been unhappy with the 6 quart. Overall I like it.",
      "rating": 5.0,
      "verified": true,
      "author": "Beverly Provost",
      "helpful_votes": 0,
      "publication_date": 20160425
    }
  ],
  "product_meta": {
    "title": "Power Pressure Cooker XL 6 Quart - Silver",
    "description": "Size:6 QuartPrepare your favorite slow-cooked recipes 70% faster and make one-pot meals with a mere touch of a button with the Power Pressure Cooker XL. Features flavor infusion technology to lock in flavor and nutrients for delicious and healthy cooking results. Ideal for canning fruits, vegetables, and more. Features: 1-touch preset buttons, nonstick and dishwasher safe inner pot, safe lock lid with manual steam release, digital display panel, automatic keep warm mode, and built-in safety features. Capacity: 6 qt, Size. Holds 4 pt Wide Mouth Jars. Stainless Steel. Color: Silver/Black FAQs: What is the capacity of the Pressure Cooker? Both 6 quart and 8 quart units are available. The Power Pressure Cooker XL comes in either 6 quart or 8 quart.",
    "rating": 4.3,
    "feature_bullets": [
      "Allows you to cook delicious, flavorful and healthier meals up to 70% faster than traditional cookware.",
      "Flavor infusion technology traps super heated steam inside the pot to force liquid and moisture into your food",
      "Digital display panel. Slow cooker function prepares your favorite slow-cooked recipes 10x fast.For easiest cleanup,wash Power Pressure Cooker parts immediately after cooking. Place dishwasher-safe parts on the top rack only",
      "Safe lock lid with manual steam release. Automatic keep warm mode. Large and sturdy lid arm handle. Capacity: 6 quarts",
      "Wipe clean brushed stainless steel housing. 1-year manufacturer's warranty. Refer user manual below."
    ],
    "specifications": {
      "Product Dimensions": "11.5 x 13 x 13 inches",
      "Item Weight": "9 pounds",
      "Manufacturer": "Power Pressure Cooker XL",
      "ASIN": "B00MZZXO4W",
      "Item model number": "PPC",
      "Customer Reviews": "4.3 out of 5 stars3,560 ratings4.3 out of 5 stars",
      "Best Sellers Rank": "#59,418 in Kitchen & Dining",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "August 24, 2014"
    },
    "categories": [
      "Home & Kitchen",
      "Electric Pressure Cookers",
      "Small Appliances",
      "Kitchen & Dining"
    ],
    "price": 147.0
  }
}