{
  "website_summaries": [
    {
      "verdict": "The Sony Xperia Z3 is Sony's most formidable to date with a formidable display and promising features that easily give Android competition from HTC, LG and Samsung a run for their money.",
      "pros": [
        "The Sony Xperia Z3 packs great battery life, a brilliant display, beautiful design and waterproof features",
        "If you own a PS4, you'll also be able to play PS4 games remotely on your phone"
      ],
      "cons": [
        "The UI can use updating -- all the icons just look way too big",
        "While it may have a 20.7-megapixel camera, autofocus can be a little off, but nothing a quick tap on the screen can't fix"
      ],
      "aspects": {
        "Design": 9.0,
        "Features": 8.0,
        "Performance": 9.0
      },
      "publication_date": 20141010,
      "rating": 8.6,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Waste of money",
      "text": "Bought this online, after 3-4 days it started showing screen off error phone remains on but screen is black. Total waste of my 234$",
      "rating": 1.0,
      "verified": true,
      "author": "Kaiser",
      "helpful_votes": 0,
      "publication_date": 20190908
    },
    {
      "title": "This is one of the best phones on the market",
      "text": "This is one of the best phones on the market, good screen, great sound, good battery life and sleek design, if you buy love him, because it is a balanced phone.",
      "rating": 5.0,
      "verified": true,
      "author": "Oliver S. Román Viera",
      "helpful_votes": 0,
      "publication_date": 20150418
    },
    {
      "title": "There were 8 pictures of some booty and feet and bad hip hop",
      "text": "It wasn't brand new. There were 8 pictures of some booty and feet and bad hip hop. It is still a fabulous product and I recommend this phone to anyone who wants an enhanced standard of smart phone",
      "rating": 5.0,
      "verified": true,
      "author": "Timothy",
      "helpful_votes": 0,
      "publication_date": 20150723
    },
    {
      "title": "The Xperia Z3 is an amazing cell phone - and seller ir really good",
      "text": "The Xperia Z3 is an amazing cell phone - and seller ir really good. I bought in Miami and use in São Paulo, Brazil with a claro's 4G chip. The only problem is Sony: the company makes no warranty for the phone, since the products are not made in Brazil - absurd, since Sony is a global brand, such as apple and samsung. For instans, if I need a replace, I will not get...",
      "rating": 5.0,
      "verified": true,
      "author": "Glauco de Pierri",
      "helpful_votes": 3,
      "publication_date": 20150113
    },
    {
      "title": "DO NOT BUY!!  WON\"T WORK!",
      "text": "I ordered this phone as a spare. I just needed it, got a sim in it and it will not work. Sony cannot help as they say it should have never been sold to the public. I am stuck with a phone that doesn't work and am out the money! DO NOT PURCHASE FROM THESE PEOPLE!",
      "rating": 1.0,
      "verified": true,
      "author": "Jon Olsen",
      "helpful_votes": 0,
      "publication_date": 20170209
    },
    {
      "title": "Five Stars",
      "text": "Very good, the only bad, is that it came in chinnese",
      "rating": 5.0,
      "verified": true,
      "author": "Joe Fragueiro",
      "helpful_votes": 0,
      "publication_date": 20150730
    },
    {
      "title": "One Star",
      "text": "Do not buy this, It heats up in less than two minutes.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170108
    },
    {
      "title": "Four Stars",
      "text": "Yes wish I could link it to my PS4 with having to yoes a yifi net work thoe",
      "rating": 4.0,
      "verified": true,
      "author": "Jason E Walters",
      "helpful_votes": 0,
      "publication_date": 20150308
    },
    {
      "title": "One Star",
      "text": "I receive the first one send it back got a second one and still don't get internet",
      "rating": 1.0,
      "verified": true,
      "author": "alma",
      "helpful_votes": 0,
      "publication_date": 20150317
    },
    {
      "title": "Four Stars",
      "text": "Very good Cel. I purchased for my son and he is very pleased with it.",
      "rating": 4.0,
      "verified": true,
      "author": "Dagoberto Lopez",
      "helpful_votes": 0,
      "publication_date": 20150917
    },
    {
      "title": "estafado",
      "text": "I bought my phone as a new phone and received a defective and repaired many complaints from users Venzuela of z3 no mistake the phone is not impermiable",
      "rating": 1.0,
      "verified": true,
      "author": "ernesto montilla",
      "helpful_votes": 3,
      "publication_date": 20150213
    },
    {
      "title": "HELP",
      "text": "Good night , a month of buying this phone has been damaged will not start. I would love me solve this problem.",
      "rating": 1.0,
      "verified": true,
      "author": "Shirlys Sandoval",
      "helpful_votes": 0,
      "publication_date": 20150325
    },
    {
      "title": "Five Stars",
      "text": "This phone is wonderful! I am so happy to get it.",
      "rating": 5.0,
      "verified": true,
      "author": "vera",
      "helpful_votes": 0,
      "publication_date": 20141105
    },
    {
      "title": "One Star",
      "text": "It is sucks product, one month they used they block out,deffected item..",
      "rating": 1.0,
      "verified": true,
      "author": "John obtera",
      "helpful_votes": 0,
      "publication_date": 20141115
    },
    {
      "title": "FISH!!!!",
      "text": "Very reliable phone and great for documenting your adventure. If you travels and into outdoor activity then you'll need a reliable phone to document your life adventures. This phone has great hardware and software support to handle all the exciting lifestyle there is. With mico-sd expansion slot you'll never run out of storage. I was hesitant at first but the phone performed wonderfully underwater and I was able to get great shot while snorkeling in hawaii.",
      "rating": 5.0,
      "verified": true,
      "author": "greazly",
      "helpful_votes": 2,
      "publication_date": 20150726
    },
    {
      "title": "Three Stars",
      "text": "Great camera but over heat cause the case broken .I'm looking for the SONY XPERIA Z7 right now ,",
      "rating": 3.0,
      "verified": true,
      "author": "Sam",
      "helpful_votes": 0,
      "publication_date": 20170811
    },
    {
      "title": "this is a most powerful phone I love the fact that it is water proof ad all ...",
      "text": "this is a most powerful phone I love the fact that it is water proof ad all these lovely things. it looks expensive with the all glass unibody battery life so far really is stella screen is vivid for me YOU HAVE TO BUY A PROPER CASE DON'T RISK BREAKING IT LIKE i DID",
      "rating": 5.0,
      "verified": true,
      "author": "happyShopper",
      "helpful_votes": 2,
      "publication_date": 20141207
    },
    {
      "title": "Charging issues!",
      "text": "Has a charging problem. Sometimes I'll leave it on the charger all night and it won't charge past 86% ***edit*** Now won't charge at all. Returning this paperweight.",
      "rating": 1.0,
      "verified": true,
      "author": "Jessica Scroggins",
      "helpful_votes": 0,
      "publication_date": 20160303
    },
    {
      "title": "works perfect, I love my Xperia z3",
      "text": "As described in the box, works perfect, I love my Xperia z3!",
      "rating": 5.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20150821
    },
    {
      "title": "Good phone, bu the magnetic charger not included.",
      "text": "Excellent delyvery time, excellent phone. The only problem: the magnetic charger is not included.",
      "rating": 4.0,
      "verified": true,
      "author": "Sebastian",
      "helpful_votes": 0,
      "publication_date": 20141220
    },
    {
      "title": "One Star",
      "text": "That's all bulls***, is not waterproof, my phone already spoiled",
      "rating": 1.0,
      "verified": true,
      "author": "Diogo Fragão",
      "helpful_votes": 2,
      "publication_date": 20150109
    },
    {
      "title": "Great phone with good configuration",
      "text": "Great phone with good configuration. Not encountered any problem so far. If this would have been available in 64GB this would have become complete phone.",
      "rating": 4.0,
      "verified": false,
      "author": "ketan",
      "helpful_votes": 0,
      "publication_date": 20160306
    },
    {
      "title": "N O T  W A T E R  P R O O F",
      "text": "ON MY FIRST DAY, I PUT SOME WATER FROM THE TAP INTO THE SCREEN, THE PHONE JUST FAILED INMEDIATELY. IM USING A SECOND ONE AND LOST 700USD. YOU ARE WONDERING WHY I BOUGHT THE SECOND ONE? I ALREADY SOLD MY IPHONE 5S AND Z3 IS A GREAT PHONE, WAY BETTER THAN IPHONE(DESPITE THE LIE ABOUT ITS WATER PROOF CLAIM AND LONG LASTING BATTERY). FAKE FAKE FAKE FAKE WATER PROOF, WARRANT AND BATTERY",
      "rating": 1.0,
      "verified": false,
      "author": "CHOWING64",
      "helpful_votes": 4,
      "publication_date": 20150103
    },
    {
      "title": "awesome Phone",
      "text": "Awesome phone! if you love sony then you'll love this though i got a european charger so idk if everyone else got the same but the phone is what matters and its awesome! P.S i got the Silver Green one :D",
      "rating": 5.0,
      "verified": false,
      "author": "christian sanchez",
      "helpful_votes": 0,
      "publication_date": 20141016
    },
    {
      "title": "NO SONY FACTORY WARRANTY...BUYER BEWARE!",
      "text": "BUYER BEWARE.....Sony advises me there is no warranty on these phones purchased from Amazon. If you need warranty service, you will pay big-time if you send it to SONY for repairs. The phone itself is a great phone...it has the highest of high-end specs and performs flawlessly....until something breaks or it needs service, then you are S.O.L. If you want a good strong warranty, get the phone from a seller that can back it up, like SONY, T-Mobile or Sprint. These are the only authorized U.S. sellers of this phone, and they can provide an excellent warranty.",
      "rating": 3.0,
      "verified": false,
      "author": "art",
      "helpful_votes": 16,
      "publication_date": 20141007
    }
  ],
  "product_meta": {
    "title": "Sony XPERIA Z3 D6653 4G LTE (FACTORY UNLOCKED) (Silver Green) - International Version No Warranty",
    "description": "2G Network GSM 850 / 900 / 1800 / 1900 3G Network HSDPA 850 / 900 / 1700 / 1900 / 2100 4G Network LTE 700 / 850 / 900 / 1800 / 2100 / 2600 Please make sure to check with your phone carrier for frequency compatibility issue before you order.",
    "rating": 3.6,
    "feature_bullets": [
      "LTE 700 / 850 / 900 / 1800 / 2100 / 2600 - D6653",
      "Android OS, v4.4.4 (KitKat)",
      "20.7 MP, 5248 х 3936 pixels, autofocus, LED flash",
      "Qualcomm MSM8974AC Snapdragon 801",
      "Quad-core 2.5 GHz Krait 400",
      "Unlocked cell phones are compatible with GSM carriers such as AT&T and T-Mobile, but are not compatible with CDMA carriers such as Verizon and Sprint.",
      "This cell phone may not include a US warranty as some manufacturers do not honor warranties for international version phones. Please contact the seller for specific warranty information."
    ],
    "specifications": {
      "Package Dimensions": "7.99 x 6.46 x 1.69 inches",
      "ASIN": "B00NWRD6MC",
      "Item model number": "XPERIA Z3",
      "Batteries": "1 Lithium ion batteries required.",
      "Customer Reviews": "3.6 out of 5 stars74 ratings3.6 out of 5 stars",
      "Best Sellers Rank": "#272,081 in Cell Phones & Accessories",
      "Is Discontinued By Manufacturer": "No",
      "OS": "Android",
      "RAM": "3 GB",
      "Wireless communication technologies": "Cellular",
      "Additional Features": "Internationally-sourced, Dual-camera, Lte, Smartphone",
      "Display technology": "LED",
      "Display resolution": "1920 x 1080 pixels",
      "Other display features": "Wireless",
      "Other camera features": "20 MP",
      "Colour": "Silver Green",
      "Manufacturer": "Sony",
      "Date First Available": "September 19, 2014"
    },
    "categories": [
      "Cell Phones & Accessories",
      "Cell Phones",
      "Unlocked Cell Phones",
      "All Departments"
    ],
    "price": ""
  }
}