{
  "website_summaries": [
    {
      "verdict": "A keyboard that’s designed for gaming both in appearance and function. The color choices and quiet keys make it a pleasure to use for work and gaming.",
      "pros": [
        "Seven color choices and six lighting modes",
        "Up to 25 keys can be pressed at once, making it a great option for most gamers",
        "Responsive keys that aren’t too loud",
        "Includes a heavy mouse with a smooth glide",
        "Uses Bluetooth"
      ],
      "cons": [
        "Lights reset and flash every time you restart the keyboard"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Works amazing with PS4",
      "text": "I was looking for a keyboard/mouse set to play some games on my PS4 (trying to get used to it before getting a PC) and this set is exactly what I wanted. It works flawlessly, all I had to do was plug it in. No adaptor, no extra USB hub... nothing. It works GREAT right out of the box! It’s also really cool looking; the mouse has a fabric wire which is really nice to have, and both cords are very long. I really love this set and I’m really happy with my purchase! Awesome stuff.",
      "rating": 5.0,
      "verified": true,
      "author": "Kels",
      "helpful_votes": 376,
      "publication_date": 20180423
    },
    {
      "title": "Great inexpensive keyboard and mouse",
      "text": "My son wasn't enjoying my old 2005 logitech wireless and keyboard with his gaming so we grabbed this deal. So far we are all happy, the mouse is accurate and has a nice feel. The keyboard looks great with the backlit colors, which can pulse, scroll, and be dimmed and brightened. The keys have a bit softer of a feel than I am used to but it hasn't hindered me in any way. For this price we couldn't be happier, we very much recommend this.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian S.",
      "helpful_votes": 116,
      "publication_date": 20180825
    },
    {
      "title": "Defective keyboard",
      "text": "I just got this product, after it was delayed for a day. The mouse works great but the keyboard came defective, I will have to return it, because several keys (W, H, ., backspace, delete) don't work. I tried changing the usb port but it did not work.",
      "rating": 1.0,
      "verified": true,
      "author": "Iván",
      "helpful_votes": 102,
      "publication_date": 20171201
    },
    {
      "title": "Failed after 5 months and only includes 30 day warranty",
      "text": "Product worked great and would have been a 5 star but the space bar stopped working after 5 months. The keyboard is considered computer equipment so only a 30 day warranty applies. Took apart to see if there was an issue with a spring and their are cheap rubber buttons that act as springs. The one for the space bar was deteriorated down to nothing and many others looked about to fail.",
      "rating": 1.0,
      "verified": true,
      "author": "Amber",
      "helpful_votes": 16,
      "publication_date": 20190714
    },
    {
      "title": "Good but  no software or support",
      "text": "I got the keyboard and mouse and they are pretty good. Here's the problem. No software, drivers or any instruction. Go to the website to get the software to control the lighting and speed and it does not install properly and caused my windows to crash. After an hour of removing and restarting it is ok. Looks good and I will keep them because they work but I cannot alter the colors or breathing speed or anything. Would be 5 stars with the software. PS. Support on the website is awful. No help at all",
      "rating": 1.0,
      "verified": true,
      "author": "William",
      "helpful_votes": 10,
      "publication_date": 20190503
    },
    {
      "title": "Not up to the level..",
      "text": "This is far far below the level expected. I rarely give a bad review but this is awful. The buttons are mushy and give poor feedback to being struck, they feel like they sightly stick upon being pressed so typing regularly is difficult. The keyboard that came with computer is much better as a comparison. On a plus... It does look good and the cord is solid...",
      "rating": 1.0,
      "verified": true,
      "author": "JPK17",
      "helpful_votes": 18,
      "publication_date": 20170705
    },
    {
      "title": "Non working buttons",
      "text": "Attractive looking keyboard with cool lights, but many of the keyboard buttons never actually worked. Returned.",
      "rating": 1.0,
      "verified": true,
      "author": "TonJook",
      "helpful_votes": 11,
      "publication_date": 20180226
    },
    {
      "title": "It's niccccccccccccccccccccccccce, but...",
      "text": "I've been using this keyboard for a few weeks now. Over all, I reeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeally like it, but I've been having some trouble's witttttttttttttttttttttttttttttttttttttttttttttttttttttttttth it. For sommmmmmmmmmmmmmmmmmmmmme reason at random intervals, one of the keysssssssssssssssssssssssssssss will lock when I'm typing, or playing games. it's nooooooooooooooooooooooooooooot a physical problem, and it's not a drrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrriver issue. It seems to be a problem with the keyboard's firmware. I might see about ordering a replacement iiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiin the case I just got a defective model. I'm sorry if this reviiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiew was annoying to read, but I couldn't think of a better was of illustrating thhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhe problem I was having.",
      "rating": 3.0,
      "verified": true,
      "author": "R.A.H.",
      "helpful_votes": 2,
      "publication_date": 20191226
    },
    {
      "title": "Once you figure it out its worth it.",
      "text": "The instructions are beyond bad- go to the website for redragonusa doc com/downloads and grab drivers for the mouse there- But the Keyboard \"lighting\" info comes with Zero instructions - Use the FN Key + look for [LM1] through [LM5] [Insert, Home, Page Up, Delete, End keys] and Finally the annoying display calms down. also the up down arrows with the FN key softens or brightens the colors too. Simple instructions would make it so much easier and yet non-existing on the box or instructions. (facepalm) But anyways... now that it's all working great... I like it and could happily recommend it. 5 stars if the instructions were better- :-)",
      "rating": 4.0,
      "verified": true,
      "author": "John Roh",
      "helpful_votes": 5,
      "publication_date": 20190208
    },
    {
      "title": "Sticking and non working keys",
      "text": "This was the second one I bought. Since I had a stroke it is easier pm me with the lighted keyboard to see and type. It great looking ley board but the letters on the board started not working. Then the letters would stick making that letter or return button mess up the screen. No software no way to program. Such a waste and total disappointment. 4 months out now Im back where I was before.",
      "rating": 1.0,
      "verified": true,
      "author": "Mike Davis",
      "helpful_votes": 5,
      "publication_date": 20191109
    },
    {
      "title": "crappy mouse",
      "text": "so just i rate 4 if it had drivers as keyboard very nice looking and very layout keyboard with nice key response but no stand alone drivers which I Hate as cause to many more typos more typos and for it cause seizures for some people but it going to some has drivers for keyboard with need the mouse driver a that i would use would not except as a back up,so i just to return in a few days if i driver this as it driven crazy as the option of rgb as i want a blue back lit key board with a few different fixed colors",
      "rating": 1.0,
      "verified": true,
      "author": "D. Hardingham",
      "helpful_votes": 2,
      "publication_date": 20200810
    },
    {
      "title": "Great budget keyboard! Limited Customization. Stiffer Keys.",
      "text": "For a budget, this keyboard is awesome. Enough said! It has customization, but you can't necessarily customize each key's LED independently. You can cycle the rainbow, but it looks pretty rough because the LEDs appear to be in groups, rather than independent. As a result, customization is also limited. The one CON about this keyboard for some however, is the keys are slightly stiffer than one may like for fast typing or games. Other than that, for the price, it's great and will make any kid (or adult!) very happy. You get what you pay for, though!",
      "rating": 4.0,
      "verified": true,
      "author": "SirEpicIndividual",
      "helpful_votes": 3,
      "publication_date": 20181015
    },
    {
      "title": "Can't seem to set defaults",
      "text": "Very quiet. Tested with colleague and he can barely hear me typing while on a call which is why I bought it. Great tactile feel. Would be 5 star, but I can't seem to set the default LED scheme of mouse dpi. I use the keyboard and mouse on a switch between my work laptop and my personal desktop. Everytime I swap back and forth the LED scheme resets back to the annoying blinking rainbow. I have to reset it to a steady single color glow each time. Same with the mouse and dpi setting. I have to reset it each time. Not hard to reset each time, but certainly annoying.",
      "rating": 4.0,
      "verified": true,
      "author": "Buyer named Dale",
      "helpful_votes": 0,
      "publication_date": 20200615
    },
    {
      "title": "function keys misbehave in game play making them less than useless",
      "text": "In the game I play, function keys are used to move from one position to another in a vehicle. When I press any one of them, it is interpreted as a mapping to some (at this point USELESS) utility like \"help\" or notepad. This YANKS YOU OUT OF THE GAME, typically at a critical time. There's no documentation that says how to turn this \"feature\" off, so you're stuck with it. For a keyboard advertised as a \"gaming\" keyboard, I would expect something that works IN GAMES. This makes the keyboard worse than the one I replaced.",
      "rating": 1.0,
      "verified": true,
      "author": "James Paul Williams",
      "helpful_votes": 0,
      "publication_date": 20200426
    },
    {
      "title": "Nice combo!",
      "text": "Solid keyboard and mouse combo for the money. Super easy to adjust the lighting for the keyboard and I even like the key binding in the manual to adjust the volume etc. I was a little disappointed you can’t change the color of the mouse from red, so it doesn’t match the rest of my set up but it’s such a small thing and can be replaced! The mouse itself is great, easy to adjust the sensitivity and with side buttons for gamers- though I’m sure you could bind them for other projects too? Comfortable, nice. Maybe could do without the logo printed twice, top and bottom, but otherwise I’m super happy with this purchase. Definitely recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Karina",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "Good combo",
      "text": "This is a good combo especially for the price. The only thing I don't like about it is that the lights on the keyboard and mouse don't turn off when the computer is put to sleep. Keys aren't as loud when typing as my other similar key style board. Construction isn't razer quality but it is still good enough where I would buy again and we already have another Redragon keyboard which works well. All in all if your not too picky then I would recommend it.",
      "rating": 4.0,
      "verified": true,
      "author": "AmmozonTop Contributor: Smart Home",
      "helpful_votes": 9,
      "publication_date": 20151230
    },
    {
      "title": "Nice keyboard",
      "text": "We bought this keyboard to replace the original equipment that came with a new desktop. My son found this one and really liked the backlight design, the mouse functions, and the keyboard layout of this unit. Set up was easy: just plug in and you're ready to go. Unfortunately, the keyboard stopped working today after 5 months of use. Keys were sticking and causing issues with log-ins and page navigation with multiple keystrikes. My son inspected the keyboard and found that a plastic piece had broken inside the case, under the keys, causing the malfuntion. Customer service helped us out tremendously, but I just wish the keyboard had worked longer than it did.",
      "rating": 4.0,
      "verified": true,
      "author": "Missy",
      "helpful_votes": 0,
      "publication_date": 20191206
    },
    {
      "title": "So far, so good.  I even like it!",
      "text": "I was a bit reluctant as some of the reviews were a little worrisome, but so far it is doing great. I didn't think the lighted keyboard feature was really something I'd care about, but finding that I do like it a lot. I also like that I can change the color and make it blink if I want. (Actually just picked one steady color and stick with it. That works for me.) I like the feel of the keyboard too. So far it's been a delightful surprise.",
      "rating": 5.0,
      "verified": true,
      "author": "Cathy Wright",
      "helpful_votes": 0,
      "publication_date": 20200618
    },
    {
      "title": "Slow response with keyboard",
      "text": "I wanted a replacement keyboard and mouse, not for gaming, but for regular use. This keyboard response is completely useless, it’s slow, I have to type 1 key at a time. The online instructions mention a speed adjustment which does not seem to do any good at all and no amount of adjusting of Windows keyboard options solve the problem entirely. I have no idea what any keyboard with slow key functions are good for but I am going to have to rerun this. Do not buy unless your a gamer and you have the need for these interferences.",
      "rating": 1.0,
      "verified": true,
      "author": "TvTime",
      "helpful_votes": 5,
      "publication_date": 20180313
    },
    {
      "title": "Fantastic, and inexpensive",
      "text": "Fantastic for the price, the keys are quiet and the colors are vibrant but not distractingly bright. My husband uses the mouse and I use the keyboard for pc gaming we have no complaints. Both respond nicely and all the buttons work appropriately. They keyboard is a perfect fit for my hands, and would probably work well for kids. I imagine the color options would appeal to kids as well. Overall a good purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Megan M",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Great Keyboard",
      "text": "This keyboard and mouse feels great, and has an elegant feel to it. Very comfortable with the keystrokes and moving the mouse around. Note: The mouse moves a little slow if it doesn't update via the internet. Once an internet connection is established, the drivers automatically update, increasing efficiency. I don't know why that is, but the overall feel of these two make me give it 5 stars anyway.",
      "rating": 5.0,
      "verified": true,
      "author": "supercyberfunk",
      "helpful_votes": 0,
      "publication_date": 20200709
    },
    {
      "title": "Mouse is great. Keyboard is lacking.",
      "text": "I really like the mouse. No complaints there. I like the button to quickly change DPI depending on your needs/laziness. The keyboard wasn't so great. It wasn't complete mush, but it did feel mushy. But the biggest drawback? No volume keys! I suppose this is my fault for not noticing before buying, but having volume keys on a multi-media keyboard seemed like such an obvious feature to have I didn't bother looking. You have to use an fn key to change the volume, but not only that, the second keys you press are F2 and F3. That's right, you need two hands to change the volume! Returned.",
      "rating": 3.0,
      "verified": true,
      "author": "Tommy",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "Cheap but great for starting out",
      "text": "The keyboard is totally flawless, responsive, good color, love it. The mouse I have one small issue with. The majority of the time it's fine, but every once in a while if you're not holding down the RMB just right, it won't register. This is a problem in fast paced FPS games where ADS is game changing. There's been a handful of times I was on target, only for my mouse to force me out of ADS, and I have to hit it again, not always a big deal, just be aware. Overall, well worth the price.",
      "rating": 4.0,
      "verified": true,
      "author": "InkHeathen ",
      "helpful_votes": 0,
      "publication_date": 20200513
    },
    {
      "title": "Great, beautiful,  good touch feedback",
      "text": "I find this keyboard as nice as any I've ever had. Keys are right where my fingers expect, easy to push, quick response (I type ~70 wpm), which a quiet but noticeable click - which is ideal for me. Keyboard had a nice weight and deep footprint (front to back), so it feels stable on my lap. The RGB lighting makes it very easy to use, even in subdued lighting, and it's pretty as well of course. I figured I'd just switch to single-light constantly on, but instead I find I really like the rainbow pulse effect. Even the strain relief seems solid - which is where some kbds have failed in the past.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe Marfice",
      "helpful_votes": 0,
      "publication_date": 20200210
    },
    {
      "title": "Five Stars",
      "text": "Keyboard looks amazing and works perfectly with my xbox one.",
      "rating": 5.0,
      "verified": true,
      "author": "John A. Murrieta",
      "helpful_votes": 12,
      "publication_date": 20180312
    },
    {
      "title": "Great budget gaming KBM!",
      "text": "Has plenty of light options on the keyboard. And the mouse has easy to change DPI setting with the push of one button. The only con to this combo would be the Redragon software for the mouse button configuration. You have to look it up on their website and download it, it doesn't have that great of a UI but that doesn't matter much to me. The functionality of both the keyboard and mouse is great!",
      "rating": 5.0,
      "verified": true,
      "author": "Luis Campos",
      "helpful_votes": 0,
      "publication_date": 20201001
    },
    {
      "title": "Great keyboard, bad delivery.",
      "text": "Great keyboard, only problem is you guys sent it out in the original box so there was nothing protecting the keyboard. The bottom right corner has a piece missing so, there is damage. I wouldn't have a problem with damage if it was delivered in a protected box, a bit careless. But, other than that everything works perfectly and is a great keyboard, lights up beautifully. I'm amazed at the quality for how cheap it all is. 7/10 (would've been 10/10 if you just sent it in an actual mailing box, seriously everyone could see what the product was on our front step, careless).",
      "rating": 4.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "Looks good but doesn't work",
      "text": "UPDATE: The seller replaced the keyboard for me. The process took a little while. But the result is a MUCH better keyboard. All the keys now work as they should. I would like to thank the seller for taking the time to make this right. If this were the first keyboard I received, I would give this a 5-star rating. I love the look of the keyboard. The lights are dazzling and look great. However, many of the keyboard keys DO NOT work. I have so frustrated, that I have had to remove the keyboard and start using the one I had prior to this purchase. A shame, too. I really liked the keyboard. ;-(",
      "rating": 4.0,
      "verified": true,
      "author": "Michael D. Mc Cullough",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "The Best and Cheapest Mechanical keyboard and mouse combo I have tried +AA great seller.",
      "text": "(When I get everything in the studio finished and sett up I will make a Video review) Like the Title says, this is a awesome and cheap combo packaged. it types really nicely and and has good ergonomics, this feels like a $200 keyboard and not a $30 combo kit. the mouse is also good, it has two minor annoyances, one being the sensitivity, it's either not a lot or A LOT. the other is that you cant change the color on it, it always glows red. keyboard has plenty of RGB functions. I'm not to bothered by this seeing RGB is not my main thing. I just wanted a really nice but cheap keyboard and mouse combo.",
      "rating": 5.0,
      "verified": true,
      "author": "Kim",
      "helpful_votes": 0,
      "publication_date": 20200530
    },
    {
      "title": "Colorful LED Keyboard Perfect for Gaming and Daily Tasks",
      "text": "Great feel for gaming, LED's are colorful and helpful when doing any task. I do not know much on how to program it outside of the default macros. I keep mine on the solid rainbow color and it looks great. Keyboard feels like there is a slightly deep click, for gaming if you need to click faster, it may feel a bit off, but I got used to it fairly quick and now the clicks feel smooth. Been using it for about 3 months and all works well. I am unsure if the mouse has programable dpi, but the middle button under the scroll wheel allows for a dpi adjustment. Overall great product!",
      "rating": 5.0,
      "verified": true,
      "author": "Shane Victorino",
      "helpful_votes": 0,
      "publication_date": 20191022
    },
    {
      "title": "Lasted about a year.  Although admittedly, it was probably abused",
      "text": "Bought this keyboard for my teenage son who wanted a \"gaming\" keyboard. It did the job but now some keys are messed up. So it lasted about a year. I guess the fact that it lasted that long could be a testament to the durability, but I was just never impressed with the keyboard (although I was not the primary user). Lights were good though, so if you need to see the keys in a darkened room it's a good choice. I really want to say something good about this keyboard, but I was just never impressed with it. Not sure what happened to the mouse.",
      "rating": 2.0,
      "verified": true,
      "author": "F. Young",
      "helpful_votes": 0,
      "publication_date": 20201022
    },
    {
      "title": "Side Button Sticks After 2 Months",
      "text": "First the keyboard is great; it's nice and bright and easy to see in the dark. The colors are vibrant and typing on the keyboard is a breeze. However, the mouse has a sticky side button now after 2 months of use. I wash my hands and use hand sanitizer religiously so I never have grease on my keyboard or mice. It is very disappointing to have to purchase a replacement mouse, unless I am able to reach out to the manufacturer and arrange a replacement I do _not_ recommend this combo. If an exchange/replacement is granted I will update this review.",
      "rating": 2.0,
      "verified": true,
      "author": "Kinetic Web Design",
      "helpful_votes": 0,
      "publication_date": 20201007
    },
    {
      "title": "Great keyboard and mouse",
      "text": "For the price, you cannot beat this keyboard and mouse. I use this for my teleworking business computer and appreciate the ability to set a static back-light on the keyboard (in multiple colors). My kids like the different rainbow displays. My only recommendations for improvement are that the palm rest area be extended out far enough to allow the user to rest their palms and that the keyboard was a little bit wider with a little more spacing between the keys (feels condensed a bit). Believe both of these would help with the ergonomics of the keyboard.",
      "rating": 5.0,
      "verified": true,
      "author": "netwebdave",
      "helpful_votes": 0,
      "publication_date": 20200401
    },
    {
      "title": "Kinda Gucci",
      "text": "For the price it's worth it. The keyboard and mouse are so far holding up well and mouse works fine without installing the driver's. The only bad thing I come across is that sometimes when I press keys to rapidly the keyboard can't keep up and doesn't register it. Update: The mouse wheel couldn't hold up to daily gaming and now doesn't work. Rip",
      "rating": 4.0,
      "verified": true,
      "author": "Annazim",
      "helpful_votes": 3,
      "publication_date": 20171203
    },
    {
      "title": "If you game and are on a budget, this is a GREAT BUY!!!!",
      "text": "LOVE this keyboard/ mouse set!!!!! It comes with a little pamphlet! So make sure you read it!!!! It was packaged really well. SO no damage to any of the items upon arrival. Just plugged it in, adjusted it to how I wanted it set, and was gaming in no time! The keyboard and mouse are very comfortable to use - especially for long periods of time, like raiding! Above all, the price is excellent!!!!! As cheap as this was, I wasn't sure if I'd like it. I will definitely get the newest version when I need to replace this one! Red Dragon, you have my support! Keep up the great work!",
      "rating": 5.0,
      "verified": true,
      "author": "ZWP",
      "helpful_votes": 3,
      "publication_date": 20170920
    },
    {
      "title": "Great for Windows, not for Mac",
      "text": "So I bought one of these months ago to use at work and I love everything about it. Then last week I'm told to work from home so I bought another for my new \"home office\".... not even thinking about the fact that I have an iMac at home. Many features don't work with Mac and you have to reprogram keys from your System Preferences but the basic functions work that way. That's just a simple warning for Mac users if you're a dummy like me, but this really is a great keyboard and mouse that I enjoy using, which is why I ordered a second one in the first place!",
      "rating": 5.0,
      "verified": true,
      "author": "Emily J.",
      "helpful_votes": 0,
      "publication_date": 20200324
    },
    {
      "title": "Not just for gamers",
      "text": "I didn't rate it for gaming, as I haven't used it for that, but I love this keyboard. The feel of the keys and the click are really nice. My daughter likes it so much that she now uses my computer just for the keyboard! The mouse is great too, although it took me a minute to figure out all the different buttons on it. I mainly do school work, so I needed a much more ergonomically designed keyboard than my computer came with. This one more than fits my needs. My son is extremely jealous, even though he got a different gaming keyboard for Christmas.",
      "rating": 5.0,
      "verified": true,
      "author": "amarsano",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "Gamer gear is the write way to go...",
      "text": "As a writer, I'm at a keyboard most of the day. I'd read an article about gamer gear being the best for ergonomics, so I started looking at keyboards and mice. Then I happened upon this set. My friends are jealous and I find myself turning it on just to stare at the keyboard (I use a laptop, so it's hooked up to a USB extender). The keyboard currently at an odd angle, but I find that this angle seems to work best for my long ago injured wrist. The mouse is just comfortable. I can't say enough good things about this set.",
      "rating": 5.0,
      "verified": true,
      "author": "CrazyHorrorGirl",
      "helpful_votes": 0,
      "publication_date": 20200506
    },
    {
      "title": "Faulty parts, unhelpful response from customer service",
      "text": "This product started to experience issues in less than 3 months of purchase. when contacting the seller about it they proposed a replacement that would have put me 2 weeks without a keyboard. (ship it to them and wait for them to process) As anyone who has to work from home knows, you cannot go 2 weeks without the ability to use a keyboard. I determined I needed to order a new keyboard and requested a refund. Due to the sellers policies they were unwilling to work out a reasonable refund request since it was outside of their 30 day window. Highly unsatisfied and would not recommend this product.",
      "rating": 1.0,
      "verified": true,
      "author": "Brandon Theinert",
      "helpful_votes": 0,
      "publication_date": 20200901
    },
    {
      "title": "Do Not Buy This Product",
      "text": "While the keyboard and mouse are fine as a dumb keyboard an mouse this product gets no support from Redragon. There are no drivers so you are not getting anything but a keyboard and mouse which you can get cheaper elsewhere. This product should be pulled or at the very least have a notice at the top that states it is EOL, has no drivers, and is no longer supported by the manufacturer.",
      "rating": 1.0,
      "verified": true,
      "author": "Erin",
      "helpful_votes": 0,
      "publication_date": 20200502
    },
    {
      "title": "Best feeling keyboard I've had in awhile",
      "text": "I've gone through numerous keyboards lately, and the touch of the keys just hasn't felt right. I like keys that aren't too light as I'm always accidentally hitting a key I didn't mean too. Or keys that are too short and hard to feel. This keyboard has a nice semi firm feel to it, not to soft, not to firm and the clicking sound is just right also. I don't like loud keyboards, but I do like to hear it and this is perfect. The colors look cool at night and I like the adjust ability of the light levels, patterns etc. Had my concerns about such an affordable keyboard, but I'm super happy now.",
      "rating": 5.0,
      "verified": true,
      "author": "Guy Purcella, That Kilted Guy DIY",
      "helpful_votes": 0,
      "publication_date": 20191124
    },
    {
      "title": "Malfunction and Packing",
      "text": "I received this keyboard the first time and the v, b and number pad were not working. The seller was great and quickly set up the return and sent a new keyboard but there was no mouse...or I thought. I did end up finding the mouse stuck under cardboard that was crammed in the bottom of the box. I love the keyboard and mouse so far, but please be aware of your packaging. It damaged the first keyboard and I only found the mouse when my I went to repack to return the second keyboard as it was stuck in cardboard that was wadded and crammed in the box.",
      "rating": 3.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200306
    },
    {
      "title": "Its just ok with big flaw",
      "text": "The problem with this keyboard is the lack of software. The mouse has SW that you can customize the keys. They keyboard has none. There are ways to program macros with a function key but you dont know if it started recording or if it will work the next time you power down. The colors do not save so when you reboot you get the breathing rainbow that you need to change every time. EVERY TIME. Its cheap, it works, it seems pretty solid after 3 weeks. Ill keep it but its meh for me.",
      "rating": 2.0,
      "verified": true,
      "author": "storm",
      "helpful_votes": 0,
      "publication_date": 20200322
    },
    {
      "title": "You get what you pay for.",
      "text": "Colors are not as bright and vibrant as pictured. Mouse is red ONLY. There is no software for the keyboard, only the mouse. Keyboard has 6 setting set with key combinations. I have to reset this everytime I restart my computer. You can not lower brightness of the keyboard but thankfully it's not very bright. Mouse is VERY bright. Keyboard feels great. Mouse has multiple dpi settings and you can set I think 6 profiles once you find and download the software. Very disappointed it is only red. Mouse has a thread cord as well. Overall its a great cheaper version of a gaming set.",
      "rating": 3.0,
      "verified": true,
      "author": "stephanni",
      "helpful_votes": 0,
      "publication_date": 20190705
    },
    {
      "title": "Pretty damn good for office computing and ambiance...",
      "text": "I'm not a gamer. But being a night-owl, I do tend to work in the dark. This is the keyboard I'd always wanted but never knew I NEEDED! Only beef is that there are a few hidden shortcut keys that sometimes foul up simple office work. I also wish I could turn off the \"breathing\" mode on the mouse. (Instruction manual says you can, but the software is not provided, nor evident.) I love the solid green and solid red features the best, as they are the most compatible with both colorblind-issues and night-time use.",
      "rating": 5.0,
      "verified": true,
      "author": "[ sc'Que? ]",
      "helpful_votes": 0,
      "publication_date": 20190729
    },
    {
      "title": "Best light up keyboard, can't be beat",
      "text": "Really cool set, very high quality and a wonderful value for the price. Mouse is super fast and precise, perfect for gaming, no issues at all :) The only thing that might be a concern is for people with Epilepsy (EP Warning) when you first plug in the keyboard it rapidly flashes between the colors so just so you know! The colors can be turned off, set to static, rotate through, and several options. Very nice and bright, I really love it. I've only had it for a week but I haven't experienced any issues. Also there's super cool buttons on the keyboard to turn your computer off and make it go to sleep so that's really neat!",
      "rating": 5.0,
      "verified": true,
      "author": "S. Bezar",
      "helpful_votes": 8,
      "publication_date": 20170923
    },
    {
      "title": "Very Quiet Keystrokes and Back-lit Keys are great for dark rooms",
      "text": "This is exactly what I was looking for, and I'm not even a gamer (besides WOW occasionally). I wanted a nice desktop keybaord that had both back-lit keys, and quiet operation. I was expecting to spend $60 or & $70 for a quality keybaord. This one has not disappointed at all. It's very quiet and the back-lit key are easily set to a solid color, or moving patterns if that's your bag. Conclusion: it's both quiet and the back-lit keys make it easy to see at night.",
      "rating": 5.0,
      "verified": true,
      "author": "BigJay",
      "helpful_votes": 0,
      "publication_date": 20180320
    },
    {
      "title": "Perfectly Fine Keyboard and Mouse",
      "text": "I was looking for a nice and affordable keyboard and mouse because I have a tendency to spill things on mine and ruin them. This keyboard and mouse works perfectly fine. I haven't tested them with gaming yet, but I much prefer an MMO mouse for gaming. The rainbow color settings are very pretty, and the multiple light levels are nice.",
      "rating": 5.0,
      "verified": true,
      "author": "Felicia Dawn",
      "helpful_votes": 0,
      "publication_date": 20190311
    },
    {
      "title": "Two defective units",
      "text": "First unit would randomly turn itself on then on. Sent it back, second one came in - the shift keys do not work on all keys - right shift does not shift #1 and #2 key, left shift key does not work with Z. Both keyboards would not let my PC go to sleep - manually or automatically. PC would go to sleep, then wake up within 3 seconds. Unplugged keyboard as this started happening right after I got it, PC went to sleep perfectly. Plugged in another keyboard - no issues. Not recommended.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200628
    },
    {
      "title": "Weird",
      "text": "All functions seem to work. Mouse ergonomics is weird. The scroll wheel area is really wide and it causes you to use an uncomfortable position in use. The keys on the keyboard have a cheaper feel than my microsoft keyboard. But what bothers me most is that the keyboard lighting default setting can't be changed. So everytime I start the computer I have to change the setting on the lights, away from the pulsating rainbow default. On the plus side is the power off button on the keyboard. This is a long lost function from bygone days that I am happy to get back.",
      "rating": 3.0,
      "verified": true,
      "author": "Donald E. Williams",
      "helpful_votes": 0,
      "publication_date": 20181018
    },
    {
      "title": "Needed a new keyboard....",
      "text": "And this one stuck out to me, I looked at others and decided this was the one i needed. Once it arrived I hooked it up and went about getting used to it, didn't take long to do so. And it has been a joy to use the only problem I have with this KB is the #8 key on the right side sticks a little and will do 2 8's or more with a single click, so I mainly use the one at the top of the KB In the end this is a good product and will suit your needs nicely.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Cline",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "No software, mushy keys, computer didn't like it",
      "text": "The keyboard is cool, and if not for the really weird tactile feel of the keys, I would really like it. Feels like a worn out $9.99 keyboard. It takes a minute for the computer to recognize either the mouse or the keyboard when it starts up which is super annoying, not able to figure out what's up with that but it is specific to this keyboard/mouse. The mouse is nothing to brag about either, I wasn't able to turn off the 'breathing\" (pulsing) red lights on the mouse. I won't return it, but will get something else from Best Buy where I can see and feel what I am getting",
      "rating": 2.0,
      "verified": true,
      "author": "Anita Lynne Holdren",
      "helpful_votes": 0,
      "publication_date": 20191201
    },
    {
      "title": "Nice low cost option",
      "text": "I got 2 of these for my sister and I but we've only been using them for a few days. We both game (not heavily) and thought the colors would be cool. It's a nice keyboard, nothing outstanding but worth the price. Connecting was super easy, plug and play. Instructions for changing the colors was easy. The mouse doesn't change colors which kind of sucks but for the money it's a decent mouse. If you're on a budget then it's a good option. I'll update on the durability after we've had them a while.",
      "rating": 5.0,
      "verified": true,
      "author": "SJ",
      "helpful_votes": 0,
      "publication_date": 20200420
    },
    {
      "title": "Cool looking,  ergonomic and quiet keyboard and mouse combo",
      "text": "Amazing back lit keyboard with edgy features and color customization. Mouse clicks have nice matte/velvet-like, gritty finish which I found very cool. Cord length is good. Only drawback is that I wish the backlit would be brighter. Also every time I turn on my laptop the color scheme defaults to rainbow which I change by pressing FN + Home to arrive at my favorite color (green seems to be the brightest). These points aside, amazing keyboard and no regrets.",
      "rating": 5.0,
      "verified": true,
      "author": "Ren",
      "helpful_votes": 0,
      "publication_date": 20200928
    },
    {
      "title": "Mouse breaks at collar betweet usb plug & cord",
      "text": "If you frequently plug-in and unplug (due to travel, for instance ), the mouse cord weakens and fails at where it joins the usb plug. Annoying waste. I also wish a compact, led ;lit keyboard, with spill=proofing, as this has, were avalanche, with only the characters lit, again, as this one, but no grid light leaks, as is dumb, dominate market design., currently. Overall, I buy this resentfully, as better choice is elusive.",
      "rating": 2.0,
      "verified": true,
      "author": "Buddy",
      "helpful_votes": 0,
      "publication_date": 20200301
    },
    {
      "title": "FINALLY an inexpensive gaming keyboard",
      "text": "I tried 4 different keyboards in this price range before finding this one. The first two felt incredibly cheap. They felt like they'd break after a month of use. The third was incredibly loud. This one feels sturdy, it's quiet, and the lights and extra function buttons are a nice touch. I would definitely recommend this if you are looking for a high-quality product in this price range. The mouse seems a little cheaper but not terrible. I gave it to my son and so far he likes it.",
      "rating": 5.0,
      "verified": true,
      "author": "HannahBannah",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "WOW",
      "text": "I needed a keyboard and mouse that I could see in the dark as I am awake at night occasionally. The keys as well as the mouse have such a light touch to them. The wrist guard/handguard is a wonderful plus. And the colors, oh the colors; the main reason I picked this set. I can see them so clearly that I don't have to turn on all the lights in the room to use my computer now. No lights means my roommate (who sleeps with the door open) will not be disturbed in the night. Also the keys are so quiet; another plus. I am so glad I purchased this model!",
      "rating": 5.0,
      "verified": true,
      "author": "Carol",
      "helpful_votes": 0,
      "publication_date": 20200204
    },
    {
      "title": "Awesome Keyboard/Mouse Combo",
      "text": "Really happy with this keyboard. Super soft touch and quiet when typing. Really cool design and color changing to how you want. Mouse has almost a light grain of sandpaper feel for extra grip and prevent slimy ness from hands being possibly clamy. Definitely recommend as a starter keyboard mouse set or even for work preferences",
      "rating": 5.0,
      "verified": true,
      "author": "Charlie Albert Reynolds II",
      "helpful_votes": 0,
      "publication_date": 20191026
    },
    {
      "title": "Very sturdy and attractive in appearance!!",
      "text": "We've only had this for one day. I bought it for my grandson. He absolutely LOVES it!! I even like it. The mouse is very nice and fits his hand well, but it would probably fit most hands just fine. The lights are really pretty, but not too bright so it wouldn't disturb anyone else in the room. It's perfect so far!! I can't believe we got this for such a reasonable price. I hope it holds up well and my Grandson gets a few years of use out of it. I would buy it again in a heartbeat!",
      "rating": 5.0,
      "verified": true,
      "author": "Cheri Fleming",
      "helpful_votes": 0,
      "publication_date": 20190729
    },
    {
      "title": "Keys will stop working",
      "text": "I have not even had this thing for 24 hrs hooked up to my Xbox one 2 of the keys I use don’t work when I first got it it worked fine but last night I noticed 1 key not working and just now a second key stopped working this keyboard looks good but don’t work for very long",
      "rating": 1.0,
      "verified": true,
      "author": "Wingnut",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "Good feel to it and it works...fun colors!",
      "text": "Bought this for my 9 year old daughter as she is exploring the keyboard/mouse gaming, she is a Xbox one Nintendo switch gamer now...she loves it...she plays fortnite, Minecraft, overwatch and is getting used to not using a controller...it has worked well for her, but she isn’t at the competitive level yet, so I can’t speak to how well it works when you get to to that level of play, but so far it has worked well, no complaints from her...good, inexpensive option and the colors make it even better...",
      "rating": 4.0,
      "verified": true,
      "author": "David Koerner",
      "helpful_votes": 0,
      "publication_date": 20190313
    },
    {
      "title": "started out good, serious issues after",
      "text": "I liked this keyboard to start. Good brightness behind the keys, good feel and style. But within a few weeks, when I hit certain key sequences while holding shift, it would not 'shift' all of the keys. So \"shift so..\" should produce \"SO\" but it would always produce \"So\". It's hard to think that is a physical defect since the rest of the word would typically be in caps as well. Ultimately it ended up being enough of a hassle that I had to replace it.",
      "rating": 3.0,
      "verified": true,
      "author": "Brian Martin",
      "helpful_votes": 0,
      "publication_date": 20200322
    },
    {
      "title": "Great gaming keyboard with nice feeling keys.",
      "text": "I’ve loved this keyboard so far. It seems to be made from some great material on the keys. My last keyboard, the space bar would not press down well. This one presses great. The keys by far are the best part. There’s some soft leathery suede maybe? Like definitely not hard plastic (maybe it is) but I love the fee of the keys. In terms of function I’m super basic so I don’t even use or hook up all the bells and whistles.",
      "rating": 5.0,
      "verified": true,
      "author": "Myke",
      "helpful_votes": 0,
      "publication_date": 20200323
    },
    {
      "title": "Mouse is Glitchy",
      "text": "I’m about to throw away this keyboard set I bought last year and replace it with an upgraded corsair k95. The mouse was really starting to annoy me and I had to bang it on the desk a few times to get it to work because it kept lagging. It did hold up fine for awhile and the lights still work, I’m just disappointed I could not reprogram the colors to where I want it. My first impressions were good, but eventually; down the road, this is a cheap poorly made keyboard and I am not satisfied with it. Buy corsair and logitech instead.",
      "rating": 3.0,
      "verified": true,
      "author": "Dylan",
      "helpful_votes": 0,
      "publication_date": 20200510
    },
    {
      "title": "Love this keyboard (updated review)",
      "text": "Love this keyboard, I got it and tested the keys they all worked as a keyboard should so that was a relief based on what I seen on other reviews. It looks nice and I love it a lot. The mouse is actually pretty good too normally they are crap in combos! Well I use to love this keyboard but as of late, The lights have been going out and it has stopped responding. Makes me sad I really do love this keyboard but it is acting up pretty bad now.",
      "rating": 2.0,
      "verified": true,
      "author": "CK",
      "helpful_votes": 0,
      "publication_date": 20180606
    },
    {
      "title": "Mouse is usless, keyboard is great",
      "text": "So I like this keyboard, I do, however the mouse is a different story. While the keyboard is flawless, the mouse is unresponsive at times, and honestly the constantly changing of colors on tbe mouse is annoying, but that's more a preference issuse.",
      "rating": 3.0,
      "verified": true,
      "author": "Agina Brackett",
      "helpful_votes": 0,
      "publication_date": 20191027
    },
    {
      "title": "Great keyboard for beginners!",
      "text": "Bought this keyboard/mouse setup for my little brother's birthday. He's always been wanting a gaming keyboard/mouse like mine, and I put some scrap parts in a case and got him a little PC setup going. He love's the keyboard and mouse, only complaint is the brightness could be a little brighter, but hey you can't win it all with this kinda price. Can't beat it, I would recommend for any beginners, or you just simply don't wanna pay $200 for a keyboard lol.",
      "rating": 5.0,
      "verified": true,
      "author": "Nathaniel E",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "For the price, it packs great value",
      "text": "My son wanted a gaming keyboard. While this one is not a mechanical keyboard/mouse, it performs and it looks nice doing it. LED’s are important for kids and this has them. I believe the mouse is only red lights, though the keyboard has many rainbow settings. All good and he’s deadly in fortnight as a result versus his wireless keyboard that would lose connectivity from time to time. Wired is king for gaming.",
      "rating": 5.0,
      "verified": true,
      "author": "H. Martin Capurro",
      "helpful_votes": 0,
      "publication_date": 20200919
    },
    {
      "title": "Good option for gaming",
      "text": "Built a gaming PC for my sons first computer. It was his 10th birthday. This may not be the best option for gaming, but he has been very happy with t. Of course because it lights up, but he also like the fact that he can change the mouse dpi setting with just the click of a button on the mouse. He was also impressed with the removable weights in the bottom of the mouse. Overall it’s a pretty good keyboard and are very happy with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Nic",
      "helpful_votes": 0,
      "publication_date": 20200531
    },
    {
      "title": "Im impressed",
      "text": "I had one of the red dragon mice as a quick replacement for a while and it quickly became my main gaming mouse. Thought it didn't last but maybe 2 years of gaming before the right mouse button broke, but being as I liked it enough I wen't ahead and got the combo. I like the keyboard a lot as well and the feeling of the buttons is pretty nice, so if you are on a budget or just looking for a good but cheap gaming set up, I'd go with this.",
      "rating": 5.0,
      "verified": true,
      "author": "Osman",
      "helpful_votes": 0,
      "publication_date": 20200512
    },
    {
      "title": "Good keyboard on it's own.",
      "text": "Pros: The keyboard has a great feel for typing. I did not get this board for gaming. The glowing feature works very well and perfect for evening when I work on projects. The choice of colors is nice, except that it does not include yellow. The dragon breathing light feature on the mouse is a nice perk. Cons: If i could give the mouse a zero by itself I would. the wheel does not have enough of a spin on the computer screen for scrolling. It also does not change colors.",
      "rating": 5.0,
      "verified": true,
      "author": "Vrekords",
      "helpful_votes": 0,
      "publication_date": 20191112
    },
    {
      "title": "Difficult to program",
      "text": "I am disappointed with this purchase. The feel of the mouse and keyboard are alright, but feel light and cheap. My biggest issues is that it is very difficult to program. I got the mouse good to go, but I could not get the keyboard to program. When they say \"7 different RGB Lighting modes & effects, 4 backlight brightness levels, adjustable breathing speed. \" You can only do the 7 different RGB Lighting modes & effects, because the other are programmable through software that I can't get.",
      "rating": 1.0,
      "verified": true,
      "author": "Lucky Lee",
      "helpful_votes": 0,
      "publication_date": 20200605
    },
    {
      "title": "Non English directions, keys look like kanji.",
      "text": "Directions in English please. I'm not trying to be mean, but it should be clarified in the product information that there is no English directions which is pretty important when you're trying to figure out the led light functions. And also that all the keys basically look like kanji or Chinese lettering. You can make it work, but there's better options for the price. just seems dishonest to me. Hope you guys improve. Thanks",
      "rating": 3.0,
      "verified": true,
      "author": "Robert",
      "helpful_votes": 0,
      "publication_date": 20200427
    },
    {
      "title": "Mouse came defective",
      "text": "Firstly, I was excited about the product but not only did it arrive late \"Thanks UPS\" but the mouse right and left click buttons didn't work. Wasn't until i did my own research to find a few others with the same issue. Would love to rate this 5 stars but the work it takes to repair something that should of been checked before shipment isn't worth the trouble. Not only that the mouse itself is flimsy made with some sort of plastic, its a beautiful mouse sure but all i care about is it working properly, wish the last guy posted the video about repairing it would definitely help some people out.",
      "rating": 3.0,
      "verified": true,
      "author": "Jeremy W.",
      "helpful_votes": 0,
      "publication_date": 20190619
    },
    {
      "title": "I like it a lot!",
      "text": "Kids want to steal my keyboard and mouse! They love changing the colors. I like that I can see the keys when's it's dark in the room. I've used the video functions, works nice, I'm still not used to having buttons there to use. I miss my control F11 to lock my computer but otherwise it's a cool keyboard that I dont have to change batteries in anymore and the littles cannot walk off with my mouse!",
      "rating": 5.0,
      "verified": true,
      "author": "JennyA",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Not a very good keyboard.",
      "text": "I of course loved this keyboard at first, as it was my very first gaming keyboard. The mouse is all right, a bit cheap, but the keyboard is the main specialty. When I first got this it was great, all the keys worked, the Lights were amazing looking, But after a few days with it, I noticed two major problems, it started to type random \"+\" signs and random \"0\"s, I tried using a screwdriver to remove the keys and then put them back on, and it still continued doing it. It also makes it hard for me to type anything or even sign in because it randomly types \"+\" signs and \"0\"s all on it's own.",
      "rating": 1.0,
      "verified": true,
      "author": "Alan huebner",
      "helpful_votes": 0,
      "publication_date": 20200419
    },
    {
      "title": "Not comfortable and the mouse is not impressive",
      "text": "The main reason I bought this package was for the keyboard. The mouse was a bonus, but it is so disappointing that it really isn't even a bonus. The keyboard lights up with great RGB lighting, but it does not feel like a gaming keyboard. The keys are too close together and my hands instantly cramp up. Typing on it is a nightmare, except the backspace key is actually the proper size compared to the one I use now. It is NOT like the mechanical keyboards most people expect, and it was a complete waste of money. All of it. I hate myself for buying it.",
      "rating": 2.0,
      "verified": true,
      "author": "Aaburchett",
      "helpful_votes": 0,
      "publication_date": 20190502
    },
    {
      "title": "very nice and bright",
      "text": "so the keys are very responsive, and the ability to brighten and dim the keyboard is great. The DPI selection on the mouse is great, it took me a moment to get the software and then set the 3 dpi settings to where I need them to be for my game play. the only draw back is that I am use to a little taller of a mouse, but that is a personal preference and not an actual issue.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Pace",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "Woah! This is pretty nice!",
      "text": "I’m really impressed. I was expecting something kind of blah and it looks awesome. I’m really happy about it and highly recommend this keyboard. The mouse works really well to. I use it mostly for editing photos. I have nothing bad to say at all. Great price and great items.",
      "rating": 5.0,
      "verified": true,
      "author": "JKeller",
      "helpful_votes": 0,
      "publication_date": 20190909
    },
    {
      "title": "Cant beat the price Combo",
      "text": "decent mouse and keyboard for a small price of entry. I originally bought this for my xbox, to help enhance certain games, having access to keyboard/mouse over controller. It has now made its way as my budget keyboard for the PC setup, and i have had zero issues. The mouse allows for a diver to be installed on pc to finetune everything, but is not necessary. I had this running on my XBOX for 2 months before PC, zero issues. Keyboard has 6 RGB modes, can be accessed with FN and the insert/home etc keys. very handy",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda Hembree",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "This is the best possible bundle for beginners",
      "text": "This is the best possible bundle for beginners. The mouse is of good quality and does very good. I really like how you can change the dpi and how the mouse looks. Although i know red dragon did copy msi for this one, it's a really good clone for a sub 15 dollar mouse. The keyboard is really nice mainly because of the lighting but also the gaming and typing experiences. The bundle is amazing for new gamers who are looking for a budget bundle, or just a back up keyboard.",
      "rating": 5.0,
      "verified": true,
      "author": "kuo ching chen",
      "helpful_votes": 2,
      "publication_date": 20171210
    },
    {
      "title": "Love the mouse, and the way the keyboard clicks",
      "text": "Gotta say, RGB is nice, and all but the clickiness is so satisfying. Good response time and well around the keyboard. The mouse is very good as well, 2 side buttons that work as well as an ergonomic wheel.",
      "rating": 5.0,
      "verified": true,
      "author": "Carson Backus",
      "helpful_votes": 0,
      "publication_date": 20200302
    },
    {
      "title": "No software won’t work right",
      "text": "This keyboard and mouse could be a nice setup but there are no drivers to be found anywhere. They say download from their site but they don’t have them for this model. You can’t set functions for the mouse buttons without it. The mouse speed defaults to the slowest ever time you restart. The keyboard defaults to blinking lights every time you restart. Very annoying.",
      "rating": 1.0,
      "verified": true,
      "author": "O'gene",
      "helpful_votes": 0,
      "publication_date": 20200207
    },
    {
      "title": "I get a lot of compliments!",
      "text": "I use this for work. I'm older, so it gives me the feeling of being on an Old School Keyboard. I like to feel the keys being pressed! I have purchased 4 of these for myself, for each of my office locations and have gotten so many compliments that several people have asked me for the link, so they can purchase. The mouse is comfortable and responsive. I love the colors, puts a little fun into being behind a computer all day at my desk. And you can't beat the price!",
      "rating": 5.0,
      "verified": true,
      "author": "Linda Schofield",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "The gaming keyboard is awesome and you can set it up any way you want it to play",
      "text": "This is a excellent keyboard for gaming we got it to play on a PS4 . This key board is excellent you can change just about everything the way you want it to be. We used it on a laptop and it works very . The mouse is awesome also. One thing about the keyboard is that the movement on the pa4 is excellent it has changed the way he plays and had made him a better player",
      "rating": 5.0,
      "verified": true,
      "author": "grillman39",
      "helpful_votes": 0,
      "publication_date": 20190310
    },
    {
      "title": "Cheap and lacks features, no software to control led or config",
      "text": "Cheap and lacks features, no software to control led or config. Product can't even be found on RedDragon's website for this model. volume control requires a function button to use, this isn't a \"Quick\" button action. Very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "tim velo",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "Not for the left handed gamer.",
      "text": "Seems pretty nice so far, but the \"thumb\" buttons are an absolutely terrible nusiance for left handed use in gaming. I had to turn those buttons off in-game. The keyboard looks great. The cables are quite sturdy. I wish game accessory makers didn't treat lefties like a specialty market. To be clear, I'm rating this as a person who mouses with the left hand. I'd love to try this as a lefty model.",
      "rating": 4.0,
      "verified": true,
      "author": "Chris Moran",
      "helpful_votes": 0,
      "publication_date": 20191124
    },
    {
      "title": "Very cool!",
      "text": "For the price this is actually pretty good. The key board is by all means pretty with the lights and works well. The mouse is comfy and fits my hand well. The lights are bright and vibrant colors with many different colors and modes to choose from. If you don't want to spend the money for a fancy mechanical keyboard I would definitely recommend this one.",
      "rating": 5.0,
      "verified": true,
      "author": "bradams115",
      "helpful_votes": 0,
      "publication_date": 20200906
    },
    {
      "title": "I wanted to like this but mine came defective from factory",
      "text": "I wanted to like this but mine came defective from factory. J L and I keys wouldn't work. Checked drivers. Nope, they didn't even work in the BIOS when I tried which confirmed the hardware was defective. It looks gorgeous and maybe I just got unlucky with this one in particular. The box arrived in perfect condition and it was well packaged which makes me believe there was not too much effort in quality control. I ended up buying an Eagletec mechanical keyboard which worked just fine for me. I like Redragon, so I hope they do a bit more to make sure their peripherals leave the factory fully functional.",
      "rating": 2.0,
      "verified": true,
      "author": "CHRISTIAN T",
      "helpful_votes": 0,
      "publication_date": 20170918
    },
    {
      "title": "Lights are good the rest not so much",
      "text": "Keyboard does not feel good, very mushy and cheap feeling. The mouse feels just as bad as the keyboard does. These both look nice but I'll stick with my G110 and G402. They were inexpensive. Maybe this would be good for a child who doesn't know any better. Going from my current KB and mouse these felt like a huge downgrade. Would not recommend except perhaps as a starter mouse and kb for someone on a tight budget.",
      "rating": 2.0,
      "verified": true,
      "author": "Bic Boi Buk Lau",
      "helpful_votes": 0,
      "publication_date": 20190814
    },
    {
      "title": "Dont waste your money",
      "text": "Purchased for my son as a Christmas present. He started using it after Christmas 2019. He does not use it all the time and now the mouse stopped working after just 2 months. Keep on looking",
      "rating": 2.0,
      "verified": true,
      "author": "TattoodMommy",
      "helpful_votes": 0,
      "publication_date": 20200224
    },
    {
      "title": "Shady shipping. I'll let you know further about quality. It's a Christmas present",
      "text": "Not sure of quality...but rcvd keyboard in original box with shipping label affixed to it. Not too pleased about that.",
      "rating": 1.0,
      "verified": true,
      "author": "Chrystal N.",
      "helpful_votes": 4,
      "publication_date": 20181128
    },
    {
      "title": "Quiet and colorful",
      "text": "After tons of research I bought this keyboard because I work in the wee morning hours and needed to be able to see my keyboard without turning on lights and disturbing the house and I lost the USB connection for my previous mouse somewhere in my couch. The keys are quiet and the lights are perfect. You can change to any color in the rainbow or just leave the whole rainbow, which is what I settled on. You can have a pulsing light as well, but I don’t use that because I find it distracting. All in all I am very happy with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180831
    },
    {
      "title": "This is Flaming Dragon!!",
      "text": "I was a little worried at first about the \"you get what you pay for\".... at this price I was sure things would have gone bad by now... I have had this set for 4 months now, keys are nice and quite. Mouse is super responsive and is weighted so if it is too heavy for you at 1st, you can lighten it. I use the red lights only, but all lights and functions still work, including rainbows & glitter! THIS IS FLAMING DRAGON!!!!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Romeo Foxtrot",
      "helpful_votes": 0,
      "publication_date": 20190808
    },
    {
      "title": "pandemic upgrade",
      "text": "I got this because it is not healthy for a kid to be hunched over a laptop screen with a small keyboard and no mouse for hours on end. Since school may very well be at home the full year, this is totally worth the money. To complete the ergo set up, we raised the screen to eye level. It took some getting used to, but it is a much better setup.",
      "rating": 5.0,
      "verified": true,
      "author": "Logan S.",
      "helpful_votes": 0,
      "publication_date": 20200818
    },
    {
      "title": "Keyboard and mouse have a well built quality feel...",
      "text": "Keyboard and mouse have a well built quality feel and work as well as my high end gaming laptop keyboard and track mouse. I needed a temporary keyboard and mouse while my laptop keyboard and track mouse was broken, so I purchased this replacement as a temporary solution, but the quality of the keyboard and mouse exceeded my expectation and I'm now using them every day. I highly recommend this product for anyone in need of something a little nicer than OEM equipment and not wanting to spend a fortune.",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole Faucher",
      "helpful_votes": 0,
      "publication_date": 20190612
    },
    {
      "title": "good product for the price range",
      "text": "Pretty good for the price range. Weird to have a smaller mouse, my last one was about 1.5x bigger and had more buttons. But this gets the job done. I am horid at not reading instructions, so I have no idea if the lights turn on, off, or if they even change. It's smaller than I thought it would be, but still works well. Good product for the price range.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 0,
      "publication_date": 20200719
    },
    {
      "title": "Some of the Keys stopped working",
      "text": "I like the keyboard and everything but some of the keys have stopped working and I need it to do school work but I cant do that when the S and N and some of the other keys do not work.",
      "rating": 2.0,
      "verified": true,
      "author": "DACOW",
      "helpful_votes": 0,
      "publication_date": 20200830
    },
    {
      "title": "Dead Mouse",
      "text": "Bought this in April 2020 it is now Sept 2020 mouse died! tried several different machines but no luck. Also, there are no driver downloads for this product... the S101 maybe that would help, cant adjust colors on the keyboard or anything. If someone has some insight here feel free to let me know. All in all, when working it was just great",
      "rating": 2.0,
      "verified": true,
      "author": "Just Me",
      "helpful_votes": 0,
      "publication_date": 20200910
    },
    {
      "title": "Holds up to my abuse",
      "text": "Granted I've only had this for a month or so but it has held up to my gamer habits pretty well. I found I couldn't give it a full 5 stars due to how awkward the shift button is to press due to where the key is centered making my fast typing a little slower at times. I don't really use the right shift so this might be a left-handed kind of thing. I have not used the mouse yet (it's a backup mouse) so I can't comment on it's functionality yet but I'm sure it's of good quality if the keyboard is good.",
      "rating": 4.0,
      "verified": true,
      "author": "Katie",
      "helpful_votes": 0,
      "publication_date": 20190109
    }
  ],
  "product_meta": {
    "title": "Redragon S101 Wired Gaming Keyboard and Mouse Combo RGB Backlit Gaming Keyboard with Multimedia Keys Wrist Rest and Red Backlit Gaming Mouse 3200 DPI for Windows PC Gamers (Black)",
    "rating": 4.5,
    "feature_bullets": [
      "PC GAMING KEYBOARD AND GAMING MOUSE COMBO: Includes Redragon RGB Backlit Computer Gaming Keyboard and RGB Backlit Gaming Mouse. ALL-IN-ONE PC GAMER VALUE KIT, Fantastic for Gamers (New Improved Version)",
      "RGB BACKLIT GAMING KEYBOARD; 7 different RGB Lighting modes & effects, 4 backlight brightness levels, adjustable breathing speed. The keycaps offering clear uniform backlighting WIN key can be disabled for gaming. The PC Gaming Keyboard has been ergonomically designed to be a superb typing tool for office work as well. The gaming Keyboard is built to withstand the average liquid spill. The integrated wrist rest gives you the comfort you need for marathon gaming sessions",
      "MULTI MEDIA & ANTI GHOSTING; The Gaming Keyboard has 25 conflict free (n-Key Rollover) 10 Dedicated Multimedia keys plus 12 additional FN+ Multimedia keys (Total 114 keys). Keys are quiet, designed for longevity, durability delivering precise tactile feedback. Comes with Full numeric keypad and a gold-plated corrosion free USB connector for a reliable connection and ultimate Gaming performance",
      "WIRED GAMING MOUSE; Ergonomic Redragon RED Backlit Gaming Mouse up to 3200 DPI (user adjustable 800/1600/2400/3200 DPI), 30G acceleration and Weight Tuning set. Total 6 Buttons of which 5 are programmable. The High-Precision Sensor delivers Pinpoint Accuracy while the Gaming Grade Micro Switches ensure longevity, greater durability and extreme responsiveness, giving you an even greater edge over your competition",
      "PC GAMING KEYBOARD AND GAMING MOUSE COMPATIBILITY: Windows 10, Windows 8, Windows 7, Windows Vista, or Windows XP, Limited Mac OS keyboard support. Works well with all major Computers Brands and Gaming PCs MSI, Dell, Corsair, Alienware, Razer, Asus and others"
    ],
    "specifications": {
      "Product Dimensions": "18.11 x 7.48 x 0.79 inches",
      "Item Weight": "2.16 pounds",
      "Manufacturer": "Redragon",
      "ASIN": "B00NLZUM36",
      "Item model number": "S101",
      "Customer Reviews": "4.5 out of 5 stars9,983 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#32 in Video Games",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "September 16, 2014"
    },
    "categories": [
      "PC",
      "Accessories",
      "Gaming Keyboards",
      "Video Games",
      "Electronics"
    ],
    "price": 39.98
  }
}