{
  "website_summaries": [
    {
      "verdict": "A flexible towel rack that gives you a huge storage capacity in a small bathroom.",
      "pros": [
        "Available in 2- to 6-arm models",
        "Swings in and out to conserve space",
        "Ideal for small bathrooms"
      ],
      "cons": [
        "Some have had trouble with  installation"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Would recommend, very sturdy.",
      "text": "So far this has far exceeded my expectations. We have a wall that can't hold a traditional towel rack becasuse the stud is in the middle of the wall the the other two are too far apart. While the poles that hold the towels are a bit short, any longer and I don't think it would be so sturdy, and it is very sturdy as it is. Not cheap at all. I would recommend this product!",
      "rating": 5.0,
      "verified": true,
      "author": "LB MCA",
      "helpful_votes": 98,
      "publication_date": 20180104
    },
    {
      "title": "I purchased this item for my closet to hang tanks ...",
      "text": "I purchased this item for my closet to hang tanks tops . It moves and holds them well .",
      "rating": 5.0,
      "verified": true,
      "author": "Jaimee Williamson",
      "helpful_votes": 150,
      "publication_date": 20160103
    },
    {
      "title": "Pros & Cons, Cons & Pros",
      "text": "Cons: 1. 1 screw cover will not stay 2. In a perfect world, the arms would be longer to better accommodate \"bath sheet\" sized towels 3. The wall anchors were crap, thank god I had my own to replace the stock ones I broke Pros: None of those things are really deal breakers and I'd order this item again because the rack itself is quite nice. Sturdy, arms are mobile yet stay positioned where you choose & attractive finish. Matches all of my other brushed fixtures and is currently holding a towel, rubber tub mat, bath toy holder w/ toys and another towel.",
      "rating": 4.0,
      "verified": true,
      "author": "Jessica DeMilio",
      "helpful_votes": 43,
      "publication_date": 20151206
    },
    {
      "title": "WARNING: comically small",
      "text": "Item was ridiculously small. No chance of holding BATH TOWELS which is why I bought it (and how it's described). Maybe WASH CLOTHES or KITCHEN towels. It's a really nicely crafted, polished, pretty ... JOKE. I would not be so harsh if the product title was: *KES Kitchen Towel Holder Swing Out Towel Bar* But instead its called: *KES Bath Towel Holder Swing Out Towel Bar* WHICH IT IS NOT. Maybe for the NICU so that nurses can give little babies baths.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20200224
    },
    {
      "title": "Looks Can Be Deceptive!",
      "text": "I purchased over a dozen of these for my vacation rental property. But, after a couple of months, the arms start breaking off (or dislocating) from the stem! The rack looks sturdy and durable but it is fake. The arms are weakly attached to the stem and, unless, the user is an angel, these racks are destined to fail. I am switching to a different brand for my future purchase.",
      "rating": 1.0,
      "verified": true,
      "author": "Baba",
      "helpful_votes": 5,
      "publication_date": 20190501
    },
    {
      "title": "Small bathroom solution",
      "text": "This rack arrived quickly and was easy to install. Looks beautiful. I have a very small bathroom with no room for a regular towel rack. This is the perfect solution. Already received compliments from guests.",
      "rating": 5.0,
      "verified": true,
      "author": "KAT",
      "helpful_votes": 66,
      "publication_date": 20151128
    },
    {
      "title": "well built, poor design",
      "text": "This towel holder replaced a previous one of similar design. What I did not notice in the ad for this one is that the arms lay flat against the wall when empty - there is no offset or accommodation for thick towels, and will stick out from the wall if you use more than one of the arms. also, unless you fan out the arms so there is space between each towel, wet towels do not air dry. That said, it is built well, is hefty, and the chrome appears to be of good quality. But because it sticks out so far from the wall when loaded with towels, I am seriously considering removing this and using standard hooks, instead.",
      "rating": 3.0,
      "verified": true,
      "author": "Suzanne Rhodes",
      "helpful_votes": 0,
      "publication_date": 20191124
    },
    {
      "title": "Built To Last",
      "text": "The unit is made of sturdy construction and the screws provided are enough to secure it into your studs well enough to hang any towels or robes you want. When you move the positioning of each of the arms it's firm, but not hard to move. Your arms won't all end up sagging to a certain side though, there's enough resistance in the friction to prevent any of that nonsense. We like the space saving solution this towel rack offered us in our bathroom.",
      "rating": 5.0,
      "verified": true,
      "author": "T. Thomas",
      "helpful_votes": 0,
      "publication_date": 20200702
    },
    {
      "title": "Nice towel bar, but one little flaw that ruins it.",
      "text": "I bought this towel bar to install horizontally in my laundry area to hang things that should air dry. It is a nice product, is sturdy, and works well, even horizontally. Then when I went to install it, one little flaw ruined the whole look. One of the screw caps would not fit because the bar is too close on that side. If I tried to force it, I may have damaged something, so I had to leave it off. Fortunately, that is not the side most seen. But still aggravating to have a bare screw on one side because of a small tolerance that didn't work.",
      "rating": 4.0,
      "verified": true,
      "author": "King",
      "helpful_votes": 0,
      "publication_date": 20190623
    },
    {
      "title": "Attractive & Functional",
      "text": "We learned about these towel rod/hanging system while staying at an Air BnB during a trip to the Netherlands and were excited to try it out at home in our small/cramped bathroom shared by 4 people. The fixture is really pretty (brushed nickel finish) and strong. Holds 4 damp-to-wet bath towels without a problem. This system will not air dry your towels as thoroughly as a large towel bar, given that most bath-size towels will hang off the edge, but it is useful if you are tight on space or cannot fully hang more than 2 towels on a conventional rack. Very glad we purchased it.",
      "rating": 5.0,
      "verified": true,
      "author": "TM",
      "helpful_votes": 2,
      "publication_date": 20181208
    },
    {
      "title": "Finally! What we needed.",
      "text": "We have a ridiculous house that the builder was on drugs or something when it was built. So we have had issues being able to put up a towel rod due to the studs not being where they need to be or are supposed to be, so the rod ends up stripping out and falling off. This was PERFECT solution. Only needed one stud and can hold far more towels than a typical towel bar. Very easy to install and looks very modern and sleek in our updated guest bathroom.",
      "rating": 5.0,
      "verified": true,
      "author": "M Daniel",
      "helpful_votes": 2,
      "publication_date": 20181024
    },
    {
      "title": "This item works great. You only need to locate a single vertical ...",
      "text": "What do you do for a small bathroom with no place to mount a broad towel bar? This item works great. You only need to locate a single vertical stud to mount this. Sure you can mount towel bars just into the dry wall without a stud, but then you risk an eventual hole in your wall if someone keeps jerking the towels off. This simple-to-mount fixture looks nice and holds 4 towels. Seems fairly well made and installation was quick and easy. It is just the perfect solution for our bathroom.",
      "rating": 5.0,
      "verified": true,
      "author": "canonwren",
      "helpful_votes": 2,
      "publication_date": 20180415
    },
    {
      "title": "Not made for large bath towels",
      "text": "Not large enough for our bath towels and the spaces between the poles are not wide enough for thick towels. Will be sending it back.",
      "rating": 1.0,
      "verified": true,
      "author": "Linda B",
      "helpful_votes": 9,
      "publication_date": 20170428
    },
    {
      "title": "Perfect solution to musty towels",
      "text": "This towel bar solved a huge issue in our bathroom with our towels. We were experiencing musty smeling towels that weren't drying properly on the back of our bathroom door. We had a over the door hook rack before and our towels were constantly stinking after one or two uses. This towel bar separates them away from the door and you can swing the arms out so your towels can dry better. Love that the arms can adjust to drying too. Haven't had one musty towel since! Problem solved! So happy with this!",
      "rating": 5.0,
      "verified": true,
      "author": "kcee74",
      "helpful_votes": 2,
      "publication_date": 20180308
    },
    {
      "title": "Used as drying rack!",
      "text": "I wanted to use this as a small drying rack on the wall next to my washing machine in my apartment as space is limited and I wanted something handy. Holds the weight of wet clothes. I like the matte black color.",
      "rating": 5.0,
      "verified": true,
      "author": "morgan johnson",
      "helpful_votes": 2,
      "publication_date": 20200105
    },
    {
      "title": "Great for a small wall space",
      "text": "We just remodeled and because the new shower enclosure is larger we have a space too short for a towel bar. This is working out great in the now narrower space behind the bathroom door. It's new and shiny, looks nice, It might not be a good choice for a home with children who might jerk down on a towel or attempt to swing on it. Same true for a home where someone might grab for a towel when falling. I think one of the horizontal rods could break off or get bent down. It reminds me of the wooden \"dish towel\" rack that used to be in a lot of older farmhouse kitchens.",
      "rating": 4.0,
      "verified": true,
      "author": "Mrs. O.",
      "helpful_votes": 0,
      "publication_date": 20191223
    },
    {
      "title": "Dries bath towels well",
      "text": "I originally bought this for our RV, but when a double bar towel rack pulled out from the wall, my husband installed this on the back of the bathroom door. It works perfectly to dry two large bath towels each day, as you can spread out the rods for maximum air flow.",
      "rating": 5.0,
      "verified": true,
      "author": "Sue Leskiw",
      "helpful_votes": 0,
      "publication_date": 20200627
    },
    {
      "title": "Great for hanging lifejackets!!!",
      "text": "I have been looking for a way to hang our lifejackets on our porch forever and this completely solved the problem. I can hang 4 lifejackets now where they are easy to grab, hang well to dry and the arms can be pushed out of the way when we're not using them so no one bangs their head as they walk by! I took the advice of others and bought heavy duty wood screws to hang the rack and they have held up well to lots of grabbing and re-hanging by kids and adults and bear the weight of 4 wet lifejackets at a time.",
      "rating": 5.0,
      "verified": true,
      "author": "Greenie",
      "helpful_votes": 0,
      "publication_date": 20190808
    },
    {
      "title": "exactly what I wanted.",
      "text": "I got this specifically to put into what I think may be the only stud in my bathroom. It’s also a space saver. The bars aren’t long, which was a little disappointing, but they’re long enough to drape a damp towel over to dry out. Plus you can fan the bars out to dry things a bit faster. Good investment if you’re trying to get something that won’t fall out of sheet rock or horsehair plaster- this is made to drill into a stud.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrea",
      "helpful_votes": 0,
      "publication_date": 20200222
    },
    {
      "title": "Lasted 4 years before breaking",
      "text": "Last ordered 7-13-2016. Was perfect up till today, when an arm broke off. (See pic.) Glad to see it’s still available. I joked with my son If he did a pull up on it. So not sure why broke, but just fell off while he was hanging his towel. But it sure is great to use, to keep towels fresh, compared to hanging on back of door.",
      "rating": 5.0,
      "verified": true,
      "author": "TomT",
      "helpful_votes": 0,
      "publication_date": 20200813
    },
    {
      "title": "Unique concept, minimalist design with 4 towel capabilities.",
      "text": "Awesome product at a decent price, good weight and solid screw mounts to hold the towel weight. I choose this design because of the unique design to hold up to 4 towels and maintain a simple low profile.",
      "rating": 5.0,
      "verified": true,
      "author": "Neil",
      "helpful_votes": 12,
      "publication_date": 20161024
    },
    {
      "title": "Owned for years and LOVE IT! Stylish and holds 4 towls in a small space.",
      "text": "Our bathroom is not small and has a 2 shower panel shower. So one towel rack just will not due. Two towel racks would take up lots of wall space that was not available so this was our choice solution and it is AWESOME! Unit is tuff and has held up to kid use as well as nice adults. Buy with confidence.",
      "rating": 5.0,
      "verified": true,
      "author": "Doitallbetter",
      "helpful_votes": 0,
      "publication_date": 20201007
    },
    {
      "title": "Holds large, thick towels with ease, strong!",
      "text": "This is a very sturdy product. I put it in my main bathroom for towels near the shower. It is perfect for keeping them within reach and very sturdy. My teen son is a little rough and he has not pulled it out of the wall yet nor broken it. It is a very sturdy product. My towels are large, thick and heavy.",
      "rating": 5.0,
      "verified": true,
      "author": "INC",
      "helpful_votes": 6,
      "publication_date": 20170320
    },
    {
      "title": "I love this thing",
      "text": "I love this thing. I ordered one for my last apartment but didn't have time to take it down, so I got another at my new place. Super handy, fits in tight places, and heavy duty. This thing holds large bath towels without a single complaint. And having the weight on the wall is better than wearing down door hinges.",
      "rating": 5.0,
      "verified": true,
      "author": "Kari",
      "helpful_votes": 2,
      "publication_date": 20180611
    },
    {
      "title": "Neat space saving towel drying system",
      "text": "I love this thing. It helps me dry multiple towels at once in my tiny bathroom space. When I’m in the bathroom, I keep them against the wall. When I leave I pull them out so the towels dry quicker with the vent on. Each bar holds one normal bath towel folded in half (longways). Very neat and great space saver.",
      "rating": 5.0,
      "verified": true,
      "author": "Caroline P.",
      "helpful_votes": 0,
      "publication_date": 20200622
    },
    {
      "title": "Money well spent",
      "text": "We have four kids and very little space in our bathrooms to hang towel racks. This fit the space perfectly! It holds four towels far enough apart that they all can dry evenly and folds flat against the wall when not in use. Love it! And we're going to buy one for our main bathroom when we move.",
      "rating": 5.0,
      "verified": true,
      "author": "Arena Tuvian",
      "helpful_votes": 0,
      "publication_date": 20200812
    },
    {
      "title": "A little uneven, but gets the job done",
      "text": "I am using this rack in my bathroom. The swinging arms are excellent for hanging multiple towels, wash cloths, etc. apart for faster drying. My only criticism is that the bars are not perfectly parallel; a few are slightly diagonal. It is hard to tell if this is based on how the bars were welded, or how they were stacked together. That said, the value for the price is acceptable.",
      "rating": 4.0,
      "verified": true,
      "author": "C",
      "helpful_votes": 0,
      "publication_date": 20201021
    },
    {
      "title": "Good towel rack, needs better wall anchors.",
      "text": "Product is exactly what it looks like. It keeps the towels out of the way without taking up too much space. The only issue is the anchors that come with it are not strong enough to keep the bracket up if any amount of downward pressure is applied. If you can’t screw it into a stud, I would suggest buying stronger anchors to secure this rack properly.",
      "rating": 4.0,
      "verified": true,
      "author": "Kelan",
      "helpful_votes": 0,
      "publication_date": 20190306
    },
    {
      "title": "Arms are too short to drape a large wet towel on",
      "text": "The arms on this were too short for how we wanted to use it. We wanted a rack like this so we could drape wet towels on it, but the arms are too short to drape a full sized towel. We returned this and bought one with longer arms which works great at drying our towels.",
      "rating": 2.0,
      "verified": true,
      "author": "Kevlau",
      "helpful_votes": 0,
      "publication_date": 20200919
    },
    {
      "title": "Excellent towel rack!",
      "text": "Heavy duty item, limbs don't bend with weight... looks good on wall! Package was missing a corner from somewhere in transit from China, and the hardware insert was missing... I messaged the company who responded promptly and promised to ship replacement parts immediately from China. It would have taken 7-10 days so I told them thanks but no thanks I found some other screws and attached the unit to the Bathroom wall... All is well! Very pleased with towel rack and company customer service in China... shipping box could be made more sturdy! My only complaint...",
      "rating": 4.0,
      "verified": true,
      "author": "Alan W. Wilkerson",
      "helpful_votes": 0,
      "publication_date": 20171003
    },
    {
      "title": "Beautiful and very sturdy",
      "text": "Just received this fantastic towel holder and after finding the stud it took about 30 seconds to install. I’m thrilled with the quality, it feels very sturdy and I’m sure there will be no issues holding 4 bath towels.",
      "rating": 5.0,
      "verified": true,
      "author": "F",
      "helpful_votes": 0,
      "publication_date": 20190915
    },
    {
      "title": "Is this a hand towel towel rack?",
      "text": "Much much tinier than the picture shows, big enough for hand towels maybe. This product does seem like it's made of good material but very deceiving ... returning",
      "rating": 1.0,
      "verified": true,
      "author": "Tressie",
      "helpful_votes": 5,
      "publication_date": 20170912
    },
    {
      "title": "looks great but pretty much useless",
      "text": "so I purchased this to use in the kids bathroom thinking that the design would make it easier for them to hand towels. Its a cool design but way to small (short arms) to be used for anything other than face or hand towels. will not work for bath towels - very disappointing",
      "rating": 2.0,
      "verified": true,
      "author": "FMF",
      "helpful_votes": 0,
      "publication_date": 20200509
    },
    {
      "title": "Great sleek option for small spaces.",
      "text": "This worked great in our bathroom where we didn’t have clearance to do a traditional bar towel rack. Sleek looking and easy to install! Only issue I had was putting the covers over the screws, one seemed to not want to fit and became a little out of shape but seems to be on now.",
      "rating": 5.0,
      "verified": true,
      "author": "Crazicaitie",
      "helpful_votes": 0,
      "publication_date": 20200415
    },
    {
      "title": "Perfect gadget",
      "text": "I had dog towels laying on the floor just inside my RV door, always in the way and looking cluttered. Not sure hanging them by doorway much better buuuut...🤷🏼‍♀️ Does at least look much neater. They're strong and work perfect for what I was looking for, hanging damp dog towels .👍",
      "rating": 5.0,
      "verified": true,
      "author": "CC Gunn",
      "helpful_votes": 0,
      "publication_date": 20200203
    },
    {
      "title": "Finally a great solution for organizing 4 towels in a small space",
      "text": "excellent organizer. With 3 people using the same bathroom, towels that are the same color, it's hard to tell who's towel is who's. This takes up way less space and no more wondering who's towel belongs to who. Bar # 1 is Papa Bear, Bar# 2 is Mama Bear, Bar#3 is Baby Bear, and bar# 4 is guest towel, when in use. Our towels are very plush so don't expect to load this up and have it all lie flat, but fanning out the towel bars is very attractive and keeps towels fresh. This is a very heavy duty product and the bars showed full support for our towels without sagging.",
      "rating": 5.0,
      "verified": true,
      "author": "Christine E. Thomason",
      "helpful_votes": 0,
      "publication_date": 20160627
    },
    {
      "title": "Pretty but not very functional",
      "text": "I have moved this 3 times and just can't seem to make it work for towels. If the towels have any thickness to them it takes 180* space. Not how I imagined it working. I wanted a neat \"stacked\" look, doesn't work that way. You might as well have a \"bigger and less expensive\" towel hanger. I ended up using it in my laundry room for hanging clothes out of the dryer.",
      "rating": 2.0,
      "verified": true,
      "author": "Angela Franks",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "Absolutely love!!",
      "text": "Absolutely love this!! We don’t have much room to hang towels in our bathroom and I was tired of the basic hooks because they weren’t drying my towels all the way. This has worked out perfect!!! Definitely recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Maddie",
      "helpful_votes": 0,
      "publication_date": 20200930
    },
    {
      "title": "Broken suddenly",
      "text": "Every things was good, but it was broken so suddenly.",
      "rating": 1.0,
      "verified": true,
      "author": "Danny N",
      "helpful_votes": 4,
      "publication_date": 20180707
    },
    {
      "title": "Totally happy with this",
      "text": "We purchased this while renovating a very small bathroom. I hated that the old Towel bar was partially behind the door when opened. This is the perfect solution. We use it to hang two towels and two hand towels and there have been no problems, even when wet.",
      "rating": 5.0,
      "verified": true,
      "author": "sarah w.",
      "helpful_votes": 0,
      "publication_date": 20200322
    },
    {
      "title": "Great Product!",
      "text": "This is a great towel rack. I have it in my laundry room to hang items I want to dry, or put o hangers right out of the dryer. It is very sturdy, and screwed into a stud, so I have no worries about weight. Also, it looks nice, and folds flat when not in use. I will definitely order this again , perhaps for guest bathrooms.",
      "rating": 5.0,
      "verified": true,
      "author": "L. Harris",
      "helpful_votes": 4,
      "publication_date": 20170521
    },
    {
      "title": "Love it",
      "text": "The swivel tower was easy to install, is substantial in design and does exactly what the product claims. It looks attractive in our bathroom and saves space. The kids have no trouble replacing towels after they are used. (which is amazing). I recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Ann Ryan",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "Almost perfect.",
      "text": "This towel bar is well made and is certainly functional. I took off 1 star for design. They really should have had the main vertical bar be set away form the mounting plate. Your towel sits directly on your wall surface with no gap to let it air dry. A half inch offset would make sense. I used a pice of wood trim to hold it off the wall a little to achieve this gap.",
      "rating": 4.0,
      "verified": true,
      "author": "Puck",
      "helpful_votes": 2,
      "publication_date": 20170202
    },
    {
      "title": "Elegant And Practical",
      "text": "I rarely give five stars to something, but this $22 rack is solidly built, easy to install, elegant and perfect for the right spot. In a tight spot it gives you more than twice the hanging space of a traditional 24\" towel bar. The bars are around 13 inches so you will need to fold a large towel. However because you can temporarily angle damp ones away from the wall they dry well.",
      "rating": 5.0,
      "verified": true,
      "author": "guitarman008",
      "helpful_votes": 0,
      "publication_date": 20180630
    },
    {
      "title": "Sturdy. Looks great. Modern, clean lines.",
      "text": "A statement piece of hardware. This towel bars are much sturdier than I expected. They look great and make an impression since they’re something s but different. I hung them in the guest bath so visitors could enjoy something they’re not used to at home. Function and form!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "Hard to hang towels to dry properly and uses too much area when the arms are \"spread out\"...",
      "text": "Well, I purchased this with the intention of using in a bathroom but aside from my wife hating how tacky it looks in real time, it takes up WAY to much area and its difficult to hang BATH towels on to have them dry properly (even with the long \"arms\" this is better suited for a HAND towel. Rather than return the item, I put it in the garage to hold my \"car wash towels\", which is better than hanging them on the exercise bike ;-)...",
      "rating": 3.0,
      "verified": true,
      "author": "JC",
      "helpful_votes": 0,
      "publication_date": 20170725
    },
    {
      "title": "High quality towel bar",
      "text": "This is a very well made towel bar. The satin finish blends well with existing brushed nickel pieces in our bathroom. The swing out mechanism is smooth, likely because the bar uses heavy nylon bushings between the bars. Mounting was a simple. Just put the anchors in the wall, screw the unit down and add the decorative caps. Overall we are very happy with the KES towel bar.",
      "rating": 5.0,
      "verified": true,
      "author": "Rusticator",
      "helpful_votes": 0,
      "publication_date": 20170306
    },
    {
      "title": "Quick setup and totally functional",
      "text": "Really great for our tiny bathroom. We had those little hooks that look like an angry octopus but they didn’t allow the towels to fully dry and they got a mildewy smell. This is a space saver that really works and we’re big fans.",
      "rating": 5.0,
      "verified": true,
      "author": "Heather L",
      "helpful_votes": 0,
      "publication_date": 20190922
    },
    {
      "title": "Perfect, even a tiny clothesline!",
      "text": "Perfect....saves room and clutter, easy install right on a stud, holds a ton of stuff.....use it as a tiny clothesline! Thanks, Ed Mahler",
      "rating": 5.0,
      "verified": true,
      "author": "E.R.M.",
      "helpful_votes": 0,
      "publication_date": 20201005
    },
    {
      "title": "Fantastic quality and design!!!",
      "text": "This such a neat concept. We had a 14 inch wall so stacked two on one side, works like a dream. One is higher to allow the towel to dry and we can separate the towels allowing for a good dry towel the next day. At first I was unhappy but that was because we hung them in a awkward position, once we moved them we were delighted!",
      "rating": 5.0,
      "verified": true,
      "author": "patricia clark",
      "helpful_votes": 0,
      "publication_date": 20170707
    },
    {
      "title": "WOW! Amazing, practical design",
      "text": "Well designed, sturdy high quality materials. Holds four large bath towels. Being vertical, makes attacking to stud a dream, no need to one stud, one drywall plug. Ability to place all against the wall Even with four large bath towels, and only take the space of a double folded towel (about 8 inches total) Absolutely divine in small bath with limited wall space.",
      "rating": 5.0,
      "verified": true,
      "author": "PatiIowa",
      "helpful_votes": 0,
      "publication_date": 20170129
    },
    {
      "title": "poles need to be longer",
      "text": "You can't put a damp/wet towel on this drying rack and expect it to dry. It is more for displaying your towels. The towels only fit on the bars if the bath towels are folded in half length wise.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Can be used for more than towels",
      "text": "We decided to use this to store workout headbands. It's durable and does not take up alot of space. If you have an appartment this works well for hanging things and not taking up the whole wall.",
      "rating": 5.0,
      "verified": true,
      "author": "Anisa Johnson",
      "helpful_votes": 0,
      "publication_date": 20200304
    },
    {
      "title": "It's ok right now.",
      "text": "It's seems like the arms swivel easily so far. I've only had it for 2mths with little use. I like the size bc my bathroom is very small. I do like hanging more towels in one place.",
      "rating": 4.0,
      "verified": true,
      "author": "TM",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "Better than a well known store.",
      "text": "This is a much better product than one I bought from a well known store. Much sturdier and has held up well. One thing is the screw caps. They are difficult to get on due to screw hole location. I was able to get the top ones on but not the bottom ones. They hit the swing bars. That is my only complaint.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190703
    },
    {
      "title": "Don’t know how I lived without this",
      "text": "Seriously... I have no idea how I lived without this. I placed it right next to my shower on a shorter wall where a standard towel rack wouldn’t fit. I place my clothes and my towel on it and it’s so convenient. I also put our pool towels and wet swim suits on there to dry. I’m pretty sure I need another",
      "rating": 5.0,
      "verified": true,
      "author": "ScarlettMinx",
      "helpful_votes": 0,
      "publication_date": 20180811
    },
    {
      "title": "Nice sleek design",
      "text": "I love this! It’s holding my towels for easy access into and out of the shower! Looks modern. It was easy to install as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephie_p",
      "helpful_votes": 0,
      "publication_date": 20200908
    },
    {
      "title": "Good, but could be better",
      "text": "This is a nice sturdy towel bar. Only gave it 4 stars because it really needs to sit off of the wall by an inch so that the rods don't have to stick out when a towel is on them.",
      "rating": 4.0,
      "verified": true,
      "author": "T.E. Champion",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "Very versatile",
      "text": "Put this in my travel trailer bathroom under the exhaust fan. I drape the towels over two arms to dry faster and then one arm once dry. The arms easily move aside if I temporarily need more room, very sturdy too.",
      "rating": 5.0,
      "verified": true,
      "author": "MD Gidding",
      "helpful_votes": 0,
      "publication_date": 20190802
    },
    {
      "title": "Space saving",
      "text": "This is great for saving space. Can hang stuff on it & push it flat so it allows use of the wall it hangs on. Attached it to a cabinet on the side, works awesome.",
      "rating": 5.0,
      "verified": true,
      "author": "KMBSRS",
      "helpful_votes": 0,
      "publication_date": 20200210
    },
    {
      "title": "Way too small to hang dry towels...",
      "text": "I'm returning mine because it is only useful to hold folded dry towels \"Pre-shower\", I am looking for something to hang towels on wet to dry and leave for next shower. I did give it four stars because out of the box it feels real sturdy, looks good, and looks straightforward to install. So if your looking for something to hang dry towels on that looks good... go for it.",
      "rating": 4.0,
      "verified": true,
      "author": "Eric P",
      "helpful_votes": 0,
      "publication_date": 20190508
    },
    {
      "title": "Cheap stuff",
      "text": "It came bent up and when I tried to straiten the bars it broke in my hands. Terrible quality will not buy ever again!! I would have sent it back but I thought the bent rods would straiten. Since I broke it (I'm not very strong), I just had to throw it away.",
      "rating": 1.0,
      "verified": true,
      "author": "Eric zhang",
      "helpful_votes": 0,
      "publication_date": 20180909
    },
    {
      "title": "Best bathroom towel hanger ever",
      "text": "This was one of the best things I ever bought for the bathroom and I regret not bringing it with me when I moved. This is INCREDIBLY sturdy! Don't worry, it will hold your large towels. Excellent space saver, and the towels typically dry out if you leave the slats open a little. I need to order one for my current bathroom.",
      "rating": 5.0,
      "verified": true,
      "author": "Kari",
      "helpful_votes": 0,
      "publication_date": 20180116
    },
    {
      "title": "Beautiful!",
      "text": "It's definitely a REAL piece - sturdy and the color is great! the gold/bronze is perfect - It's a practical piece that acts as decor to the bathroom",
      "rating": 5.0,
      "verified": true,
      "author": "FJ",
      "helpful_votes": 0,
      "publication_date": 20200226
    },
    {
      "title": "Not just for bathrooms",
      "text": "Love the towel bar! I'm actually using it in my home office to hang rings of the non-slip headbands I make. It's sturdy & metal, not plastic like some others I had looked at. I'll definitely buy another for more of my Georgia Dragonfly inventory.",
      "rating": 5.0,
      "verified": true,
      "author": "Diana Rollins",
      "helpful_votes": 61,
      "publication_date": 20151102
    },
    {
      "title": "This is an attractive towel rack that is compact, ...",
      "text": "This is an attractive towel rack that is compact, allowing installation in a tight spot, but providing a hanging place for four towels.",
      "rating": 5.0,
      "verified": true,
      "author": "hande64",
      "helpful_votes": 2,
      "publication_date": 20180326
    },
    {
      "title": "Easy and simple",
      "text": "Exactly what I was looking for instead of a traditional towel bar that holds one or two towels at the time. Easy to install and works great!",
      "rating": 5.0,
      "verified": true,
      "author": "E. Davydenko",
      "helpful_votes": 0,
      "publication_date": 20200204
    },
    {
      "title": "Very satisfied.",
      "text": "We got Stainless Steel Swing Out Towel Bar 4-Bar Folding Arm Swivel Hanger for the RV bathroom. We really like the swing out towel bar of the 4 hanger. Very satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "Adnil",
      "helpful_votes": 2,
      "publication_date": 20171121
    },
    {
      "title": "Excellent Quality",
      "text": "Love this towel rack. Perfect size for our small bathroom. Very good quality and a great price.",
      "rating": 5.0,
      "verified": true,
      "author": "Ann",
      "helpful_votes": 0,
      "publication_date": 20200711
    },
    {
      "title": "Wonderful travel trailer solution",
      "text": "Main reason for purchase: for a compact travel trailer bathroom. Installation was very easy, but required planning ahead for wall mounting in our camper's bathroom - height and location. All basic mounting hardware for a wall stud is included. Each towel arm swings with proper amount of tension so they stay where moved. The stainless steel finish is brushed, with no sharp edges. While we have not actually used it while camping, no issues are expected.",
      "rating": 4.0,
      "verified": true,
      "author": "Mr Bill",
      "helpful_votes": 0,
      "publication_date": 20160412
    },
    {
      "title": "Good product",
      "text": "Great time for small bathroom and for extra place to hand towels. Easy to install, simple design that goes with every bathroom. Very happy I go it. If i don't have anything to hang on it, i just push it to the wall.",
      "rating": 5.0,
      "verified": true,
      "author": "LeahV",
      "helpful_votes": 0,
      "publication_date": 20190122
    },
    {
      "title": "Highest quality in both form and function",
      "text": "This is a truly beautiful, high-quality, functional swing arm towel bar/s. We previously bought a KES stainless steel hook for our kitchen. It was beautiful, functional and very well made. Because of this good experience, we bought the KES towel bar. We installed this towel bar in our laundry room to hold wet towels and washcloths. We love the look and quality of KES products, and will buy this brand again in the future.",
      "rating": 5.0,
      "verified": true,
      "author": "Laurel",
      "helpful_votes": 3,
      "publication_date": 20150916
    },
    {
      "title": "Perfect for small spaces. Great quality.",
      "text": "Installed this behide swing shower door. Perfect clearance and I have to bath sheet size towels hanging on it.",
      "rating": 5.0,
      "verified": true,
      "author": "Ginger Smart",
      "helpful_votes": 0,
      "publication_date": 20200321
    },
    {
      "title": "Great because both fasteners are anchored into a stud.",
      "text": "This towel bar just makes sense. As long as it is anchored to a stud you are set. Traditional towel bars are poorly designed as they do not come in lengths of 16 or 32\":. So at best 1 end is anchored to a stud. Soon the other end is pulling out of the sheetrock. This vertical design makes sense and eliminates that problem. Looks great. Works well.",
      "rating": 5.0,
      "verified": true,
      "author": "B T Neal",
      "helpful_votes": 0,
      "publication_date": 20170512
    },
    {
      "title": "Would buy again",
      "text": "Love this because you can hook it straight up to a stud without worry of drywall screws. Very sturdy. Heavy feel to the rack itself. Smooth motion for pivot points. With too much weight the rods could bend, but a regular towel (wet) is no problem. Very modern look. Solid buy!",
      "rating": 5.0,
      "verified": true,
      "author": "Jon",
      "helpful_votes": 0,
      "publication_date": 20200905
    },
    {
      "title": "No more pool towels strung across patio chairs",
      "text": "I wish they were longer. I needed to read the description better. However I love it, would be happier I'd the arms were longer to fit oversized beach towels. But it works and I'm happy",
      "rating": 4.0,
      "verified": true,
      "author": "Christine",
      "helpful_votes": 0,
      "publication_date": 20190801
    },
    {
      "title": "Just hanging out",
      "text": "Works well. Not much space in a small bathroom. Used longer stainless screws in stud instead of anchors that were supplied.",
      "rating": 5.0,
      "verified": true,
      "author": "citi",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "Great quality",
      "text": "I have very small bathroom and it is perfect for small space",
      "rating": 5.0,
      "verified": true,
      "author": "Ksenia",
      "helpful_votes": 0,
      "publication_date": 20200814
    },
    {
      "title": "great product",
      "text": "I have been fighting with the std towel racks for years not having enough room for more than one towel without taking up my whole wall in my small bathroom this towel rack is just what I needed thank you I will purchase this item agin",
      "rating": 5.0,
      "verified": true,
      "author": "James  ",
      "helpful_votes": 0,
      "publication_date": 20190912
    },
    {
      "title": "Excellent solution to a cramped bathroom.",
      "text": "Perfect for a cramped space and a nice finish. The only problem was that the cover caps were a little difficult to fit on but that was OK and eventually went on. I bought two and use one to dry small items as clotheslines don't seem to be popular here. They are nicely made and look way more expensive than they actually were.",
      "rating": 4.0,
      "verified": true,
      "author": "W. Rawady",
      "helpful_votes": 2,
      "publication_date": 20150925
    },
    {
      "title": "Look for something else.",
      "text": "I bought this item because it is very damp where I live and the walls mold easily. I figured this would be a good way to keep wet bath towels away from the wall so I was very excited when I received it in the mail. However, eventually every bar fell off. Not all at once but the last on just fell off this week. The bars are soldered on and are not solid. Very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "TinaD",
      "helpful_votes": 4,
      "publication_date": 20160802
    },
    {
      "title": "Sturdy Product! Sub-Par Shipping",
      "text": "Wonderful! Our bathroom is full of awkward angles, so we needed something that could hang a towel around the corner so it can be reached from the tub. This one is small, sturdy, and does the trick just fine! I only gave 3 stars simply for the fact that it did not come shipped with any sort of bubble wrap or protective wrapping. The box wasn't even taped closed, and we were very lucky the small bag containing the hardware did not slip out in transit.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180401
    },
    {
      "title": "Very solid!",
      "text": "This little item was a great solution for a tiny bathroom with no place to hang towels! Absolutly love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Reader=Leader",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "Love it",
      "text": "Wow this looks so good, and it is so functional. Really happy",
      "rating": 5.0,
      "verified": true,
      "author": "M. Bright",
      "helpful_votes": 0,
      "publication_date": 20200716
    },
    {
      "title": "Awesome fit",
      "text": "Fits in our tight area where a normal bar would not work. So happy with this",
      "rating": 5.0,
      "verified": true,
      "author": "SnowRat",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "Nice product!",
      "text": "Negative part, it lists an option as brown... there is no brown. Positive parts, It feels sturdy and after a week & a half of kids using them, still stands! They find it neat, so towels are off the floor...success!",
      "rating": 4.0,
      "verified": true,
      "author": "Drroof",
      "helpful_votes": 0,
      "publication_date": 20180906
    },
    {
      "title": "Perfect for smaller bathrooms",
      "text": "These are high style, and high functionality. They will hold several big towels but don't intrude into the room if not in use. This is the second time I have bought these. I used them in a remodel project for my daughter, and liked them so well that I'ordered them again to use in a new project as well. I found them to be sturdy, easy to install, and sharp looking.",
      "rating": 5.0,
      "verified": true,
      "author": "J. A. Whitesel",
      "helpful_votes": 0,
      "publication_date": 20170402
    },
    {
      "title": "Better than described.",
      "text": "Very high quality product and a great value for the price. Mounting hardware, including screw caps, is included.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Lippert",
      "helpful_votes": 0,
      "publication_date": 20191129
    },
    {
      "title": "Loved it! Space saver and small footprint",
      "text": "We just love it. Now our towels are not lying somewhere in bathroom instead properly sitting on the bars and dry well.",
      "rating": 5.0,
      "verified": true,
      "author": "pvr chivi",
      "helpful_votes": 3,
      "publication_date": 20170607
    },
    {
      "title": "Good product",
      "text": "Works well. I have a cramped space for laundry and my husband put this up for me to hang our shirts on hangers out of the dryer or to air dry.",
      "rating": 5.0,
      "verified": true,
      "author": "Katham",
      "helpful_votes": 0,
      "publication_date": 20190706
    },
    {
      "title": "A neat place for all those towels",
      "text": "Bought it as an Amazon Warehouse deal and saved a lot. Item was like new. Only thing missing was the hardware. Since I normally use my own screws anyway, this wasn't a problem at all. It replaced a standard single towel bar, and finally I don't have to complain anymore about all those towels hanging over the shower door.",
      "rating": 5.0,
      "verified": true,
      "author": "BW",
      "helpful_votes": 0,
      "publication_date": 20161222
    },
    {
      "title": "Great product",
      "text": "These towel racks are awesome and super easy to install.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike Lopez",
      "helpful_votes": 0,
      "publication_date": 20200608
    },
    {
      "title": "Feels incredibly durable and works very well",
      "text": "Amazing product, especially for the price! Because of our bathroom layout, I really needed a towel bar that didn't overlap towels like our last getup did, often causing them to mildew. This mounts vertical and fits perfectly in our bathroom. It feels very sturdy, even the hinges. You can't go wrong with this product!",
      "rating": 5.0,
      "verified": true,
      "author": "Sai361",
      "helpful_votes": 0,
      "publication_date": 20161108
    },
    {
      "title": "Excellent clothes hanger",
      "text": "Exactly what I needed! We live in a small apartment and I wanted to be able to dry delicates and clothes without being in the way. Sturdy, convenient, modern design",
      "rating": 5.0,
      "verified": true,
      "author": "Souljehr",
      "helpful_votes": 18,
      "publication_date": 20151231
    },
    {
      "title": "Easy to put up",
      "text": "We have a very small area leading into a large walk in shower. The swing arm rack works as claimed. Easy to put up. Only issue I have is that it still takes up room when the arms are swung out and need to do that to allow towels to dry after showering. Product is well make, solid.",
      "rating": 4.0,
      "verified": true,
      "author": "S. Ferguson",
      "helpful_votes": 3,
      "publication_date": 20150607
    },
    {
      "title": "New towel rack",
      "text": "We have a small kitchen and this really worked out great, easy to install.",
      "rating": 5.0,
      "verified": true,
      "author": "F. Shreve",
      "helpful_votes": 0,
      "publication_date": 20200227
    },
    {
      "title": "short bars and weak screws",
      "text": "Shorter from expected with very weak installation screws. They stripped easily and had to be extracted and replaced with different and quality screws.",
      "rating": 2.0,
      "verified": true,
      "author": "JCJ",
      "helpful_votes": 0,
      "publication_date": 20190325
    },
    {
      "title": "Sturdy and efficient",
      "text": "I really like and encourage this product. I love how when there's no towels on it it's so sleek on the wall. Yet it holds a bunch of towels if you need it to. It is definitely more sturdy than the old school towel racks.",
      "rating": 5.0,
      "verified": true,
      "author": "AmWall",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "Attractive, usefull towel rack.",
      "text": "Well made, good looking rack. The bars move smoothly and are nicely finished. Practical and attractive.",
      "rating": 5.0,
      "verified": true,
      "author": "Red Top",
      "helpful_votes": 0,
      "publication_date": 20190923
    },
    {
      "title": "worth the money!",
      "text": "very great towel rack! Great for small places but also sturdy!",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley Ellis",
      "helpful_votes": 0,
      "publication_date": 20200705
    }
  ],
  "product_meta": {
    "title": "KES Towel Holder Swing Out Towel Bar SUS 304 Stainless Steel Bathroom Hand Towel Rack 4-Bar Folding Arm Swivel Hanger Wall Mount Polished Finish, A2102S4",
    "rating": 4.5,
    "feature_bullets": [
      "THE PERFECT TOWEL BAR FOR ANY BATHROOM: The towel bar features four swivel arms that move independently to keep your towels drying and neatly organized, which is perfect for organizing your face towels, bath towels and clothes in order in your bathroom or kitchen. This space-saver towel racks are definitely a must for any small bathroom as instead of taking up space, it gives you more! MAX. Load: 15KG",
      "UNPARALLELED QUALITY: The heavy duty kes towel bar is made from the most durable stainless steel materials ensuring that it will never rust, corrode or lose its shine! This bathroom towel storage hanger is definitely made to last for years, while its rust-resistant design ensures that your towels will stay clean and hygienic!",
      "AMAZING DESIGN: This amazing towel rack features 4 swing arms that can rotate 180 degrees, allowing you to hang your wet and dry towels simultaneously, without them touching one another; In addition, it can be conveniently swung out for easy access and retrieval of items and pushed against the wall when not in use for space-saving storage.",
      "POLISHED FINISH: Hand polished stainless steel finish, build to resist daily scratches, corrosions and tarnishing.",
      "-EASY INSTALLATION: ONE piece, NO assembly required, Accessories pack included."
    ],
    "specifications": {
      "Manufacturer": "KES HOME",
      "Part Number": "A2102C",
      "Item Weight": "1.7 pounds",
      "Product Dimensions": "14.37 x 9.65 x 0.79 inches",
      "Item model number": "A2102C",
      "Is Discontinued By Manufacturer": "No",
      "Size": "4-Arm",
      "Color": "Polished",
      "Style": "Contemporary",
      "Finish": "Stainless",
      "Material": "Stainless Steel",
      "Installation Method": "Wall-Mounted",
      "Item Package Quantity": "1",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "ASIN": "B00N5TAHG0",
      "Customer Reviews": "4.5 out of 5 stars262 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#116,918 in Tools & Home Improvement",
      "Date First Available": "August 30, 2014"
    },
    "categories": [
      "Tools & Home Improvement",
      "Hardware",
      "Towel Bars",
      "Bathroom Hardware"
    ],
    "price": 29.5
  }
}