{
  "website_summaries": [
    {
      "verdict": "It’s hard to top the classic peanut butter and banana combo, and dogs will appreciate its chunky size and squishy texture.",
      "pros": [
        "Peanut butter is the first ingredient",
        "Super soft cinnamon roll shaped treat",
        "No artificial flavors or preservatives",
        "Made with real bananas, peas, and potatoes"
      ],
      "cons": [
        "Treat may harden if bag isn’t properly resealed"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "mmmmmm science diet",
      "text": "i was expecting these to be soft, cause you know, the title.....nope. theyre crunchy and hard. that aside, my dog loves them.....but she also eats poop. you just cant go wrong with science diet. its a good brand with tons of protein and good fats. my vet sells this! just for a million dollars more. i trust my vet but looked in to the nutritional info of these treats and they stacked up. (feed your dog at least 25% protein and 10% fat in their food. fats are the most expensive ingredient so if its high in fat, its probably a good food.) do not use this as a supplement for your dogs food.",
      "rating": 4.0,
      "verified": true,
      "author": "PurriousClowder",
      "helpful_votes": 49,
      "publication_date": 20180120
    },
    {
      "title": "Found rubber object in this treat",
      "text": "We have our mini schnauzer puppy her treats this morning and found this rubber grommet inside her treat. We have to break yup her treats because she is so tiny and I am glad we did . Please pass this onto science diet",
      "rating": 1.0,
      "verified": true,
      "author": "Parker Davis",
      "helpful_votes": 24,
      "publication_date": 20181224
    },
    {
      "title": "ROCK HARD but here's a way to fix them",
      "text": "Giving 3 stars because these arrived rock hard from Amazon and they're supposed to be soft. My dogs wouldn't touch them and they usually love them. I got an idea to put a tablespoon of water in the bag, reseal it, and put in microwave for one minute (careful, they come out hot). They steam in the bag and soften up quite a bit. All my dogs will now eat them.",
      "rating": 3.0,
      "verified": true,
      "author": "The Magician",
      "helpful_votes": 39,
      "publication_date": 20161118
    },
    {
      "title": "My dog HATES these! (Chicken and Yogurt flavor)",
      "text": "A) these are NOT soft chews; they are round little bricks! B) my dog eats damn near anything... he ate these willingly the first day; the second day he sort of walked away and nibbled; third day he just dropped it out of his mouth and walked away, like \"Bleh! Mom! Yukky...\" I do NOT recommend this variety of treats at all! I didn't even read any reviews when I ordered, I mean, it is SCIENCE DIET brand, so I expected more from them. Nope, they are garbage!! Didn't even use a third of the tiny package. Ish.",
      "rating": 1.0,
      "verified": true,
      "author": "Cheryl3D",
      "helpful_votes": 11,
      "publication_date": 20190520
    },
    {
      "title": "My dog has loved Peanut butter and banana treats in the past so ...",
      "text": "The first time I gave these to my dog, he threw up shortly after....I didn't put two and two together at first. But noticed the second time he was given these treats he threw up again. Not only that, these treat are not soft. My dog has loved Peanut butter and banana treats in the past so I'm not sure why this was happening! So disappointing.",
      "rating": 1.0,
      "verified": true,
      "author": "mysweetlittle4",
      "helpful_votes": 21,
      "publication_date": 20170320
    },
    {
      "title": "Hard as a brick",
      "text": "These treats while advertising that they are soft are hard as a brick. My Yorkie can not even eat them. I tried cutting them they are so dry and hard they just break into little bits. These are positively horrible! Do not buy these if your dog has any trouble chewing or dental issues or is older! Worst treats EVER!",
      "rating": 1.0,
      "verified": true,
      "author": "Betsy Smith",
      "helpful_votes": 10,
      "publication_date": 20170724
    },
    {
      "title": "NOT SOFT & WAAAY TOO BIG",
      "text": "DO NOT BUY IF YOU'RE LOOKING FOR A SOFT TREAT OR FOR A TREAT THAT IS SUITABLE SMALL TO MEDIUM DOG. You would think the name \"soft savories\" saifmd it all but NOPE... These things arrived as hard as a rock. So much so I tried to put them in a plastic bag and crush them with a hammer, yes hammer and they would not break up. Soaked them in chicken broth for a minute or so and nothing. Soaking them and putting them in the microwave help a TINY bit but still almost impossible to break up these overly huge rock hard treats for my 20 pound Pug.",
      "rating": 1.0,
      "verified": true,
      "author": "Pncsjenw",
      "helpful_votes": 3,
      "publication_date": 20190729
    },
    {
      "title": "Hard as a bag of ROCKS",
      "text": "Just to get these soft enough to chew, I have to layer a glass pyrex storage with wet paper toweling, put it in a microwave for 30 seconds, add more layers of dry toweling to keep the treats from sogginess, toss them on and close it for an hour or so. Open it, take out toweling, make sure glass is dry, or transfer to glass jar and close tightly. Seems like an awful lot to go through, but I just want to get rid of them. I suppose I could place a few drops of broth on them, and refrigerate. Just don't want to have wasted $$$ totally.",
      "rating": 1.0,
      "verified": true,
      "author": "annacolleen",
      "helpful_votes": 2,
      "publication_date": 20191109
    },
    {
      "title": "Not SOFT at all!",
      "text": "These are not soft at all. They are hard biscuits. The name says soft savories, so I expected soft. Totally misleading. I'm really teed off about this. I would return them, but it's not worth the hassle. The dog will still eat them, but it is not what is advertised. So, if you are looking for a soft treat, THESE ARE NOT SOFT, THEY ARE HARDER THAN A MILKBONE BISCUIT!",
      "rating": 1.0,
      "verified": true,
      "author": "Dawn N.",
      "helpful_votes": 6,
      "publication_date": 20171127
    },
    {
      "title": "Chihuahua LOVES these!",
      "text": "We have a teeny little 4 lb chihuahua who acted like a 120-lb ravenous Rottweiler when we first brought these to her. The bites are large for her, so I get about 4 treats out of one. These must taste great. I'll take her word for it!",
      "rating": 5.0,
      "verified": true,
      "author": "Laurie T",
      "helpful_votes": 4,
      "publication_date": 20181209
    },
    {
      "title": "Unique flavor",
      "text": "I have 4 small dogs and only one would try it and the others just walked away. I have never introduced this flavor to them before and this may be the reason they are not interested. Also, they are not as soft as I was expecting but they are not hard either. I could break them in half fairly easy but they are not chewy. Actually, they remind me of a dog biscuit. They do not smell bad but I don't get a scent of peanut butter or bananas. My dogs are very picky with treats so just because they wouldn't eat them doesn't mean they taste bad because usually they won't eat any type of a crunchier treat.",
      "rating": 4.0,
      "verified": true,
      "author": "Jamie Craig",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "They are not soft!",
      "text": "This are definitely not soft! I should have read the reviews before purchasing but was in a hurry and just seen the word soft and bought them. I got them for my mom's 12 year old dog that only has 4 front teeth in his mouth. They are more like tiny little bricks and not soft in any way. My oldest dog loves them but he still has all of his teeth and no problem chewing. They should not be advertised as being soft.",
      "rating": 2.0,
      "verified": true,
      "author": "Cassondra P.",
      "helpful_votes": 0,
      "publication_date": 20191005
    },
    {
      "title": "Turned to stone, but still tasty?",
      "text": "I'm not sure if this is just how they are or if I got an old bag, but the \"Soft\" Savories I got were hard as a rock. My dog still seemed to like the the flavor, despite the obvious effort I see her put into trying to eat them. I have to cut them into smaller bites so she doesn't attempt to eat one whole and choke. I'll have to find another fresher bag to see if this batch was just expired or what.",
      "rating": 3.0,
      "verified": true,
      "author": "Holly McGrath",
      "helpful_votes": 4,
      "publication_date": 20171119
    },
    {
      "title": "Not so soft...",
      "text": "I didn't love these treats as much as others. Bought them for a 5 month old golden retriever puppy who was losing some baby teeth. They were not as soft and way too big. Nearly the diameter of a quarter and then a 1/2 in thick. I had to struggle to break them apart and was disappointed by this because my pup is a big fan of the Hill's Puppy food. We ended up finishing the bag, but for a treat advertised as \"soft\" it didn't quite live up to expectations.",
      "rating": 2.0,
      "verified": true,
      "author": "Jaspers2010",
      "helpful_votes": 3,
      "publication_date": 20180211
    },
    {
      "title": "What happened",
      "text": "I have loved these for years. Years. But it is June 2020 and I have had to finally change brands. I got an order a few months back and the 'soft' treats were hard as a rock. I have two very small dogs and I usually break them in two pieces. I wasn't able to they were so hard. I tried another treat that the pups did not care for and then tried another shipment and it was the same. Different run numbers, different flavors. I am disappointed to lose them as a 'go to' brand.",
      "rating": 2.0,
      "verified": true,
      "author": "Jamie T.",
      "helpful_votes": 0,
      "publication_date": 20200624
    },
    {
      "title": "Decent but not great. Our Dogs do like them.",
      "text": "Our pups do like these. We've ordered them twice. 1st time they were delivered 'fresh' meaning they were kinda 'soft'. 2nd order was rock hard - like a Milk Bone. There were 29 treats in the 1st order and 28 treats in the 2nd order. We realize these are sold by weight so that's not a complaint, just letting you know because we originally questioned how many were in the pouch. Considering they aren't really soft and arrive in varying states of freshness, 9 cents each isn't terrible but not great. All things considered we probably will not order again.",
      "rating": 4.0,
      "verified": true,
      "author": "William R.",
      "helpful_votes": 0,
      "publication_date": 20190808
    },
    {
      "title": "Appealing to dogs, but NOT \"soft\"",
      "text": "My two small dogs seem to like the flavor. But these treats are not very soft. You can easily break one apart and my senior dogs (who don't have many teeth) are able to get them chewed up. But I sure wouldn't call these 'soft' treats.",
      "rating": 4.0,
      "verified": true,
      "author": "Gail",
      "helpful_votes": 5,
      "publication_date": 20180125
    },
    {
      "title": "Harder than a rock But my dog loves them",
      "text": "Super hard and I’m not able to break them into small pieces like my dog needs. Put them in the microwave for 25 seconds and they are fine. Whenever I bought this product from anywhere, chewy, the pet store, it’s always the same. They are harder than a rock. Just nuke and you’ll be fine. My dog absolutely loves them and they are a good price.",
      "rating": 5.0,
      "verified": true,
      "author": "dude",
      "helpful_votes": 0,
      "publication_date": 20200401
    },
    {
      "title": "Description of products needs to be honest and accurate!",
      "text": "These \"soft\" savories are as \"hard\" as little rocks! I bought them for the softness factor because my two elderly chihuahuas need soft treats. The advertising is very misleading. Really becomes a pain when you expect the perfect product and then have to go through the trouble of returning the package to them. Reason I order from Amazon is so I don't have to travel to shop or go to the post office. ..especially this time of year. The lines for mailing Christmas packages are unreal! I am elderly and on disability and this really makes it difficult for me.",
      "rating": 1.0,
      "verified": true,
      "author": "CHLOE",
      "helpful_votes": 0,
      "publication_date": 20191214
    },
    {
      "title": "Great treats for a nice price",
      "text": "Our 2 smaller dogs are kind of picky and they like these chicken yogurt treats. I've tried many varieties and usually our yellow lab ends up eating them all (she is non- discriminate - she has consumed many odd things, including whole pie pumpkins, a bag of steel cut oats and alfalfa hay). The Hill's treats even smell pretty good surprisingly. I have to break them in half for our 10lb chihuahua as they are a bit big for him but they are soft so not a problem. I just ordered more as they are a great price from Amazon as well. Really glad to find something all our fur-children agree on.",
      "rating": 5.0,
      "verified": true,
      "author": "Lulu's Mom",
      "helpful_votes": 0,
      "publication_date": 20190603
    },
    {
      "title": "I have 4 fur babies",
      "text": "They tend to be picky on what they like. After all they are pomchi's. I started with buying the Hill jerky and they went bonkers over that so I tried beef and cheddar off the soft and savories treats. They love them such a hit the treats are really not the big and as far as I know they are not as hard as rocks but also not squishy when you squeeze it. I figure its more for my dogs not me they know what they want, they eat it not me.",
      "rating": 5.0,
      "verified": true,
      "author": "Momma",
      "helpful_votes": 0,
      "publication_date": 20200412
    },
    {
      "title": "Tampered with open package",
      "text": "Seriously ? !!!!! I just received this package today, and couldn’t figure out what it was bc there seemed to be stuff at the bottom of the package. When I opened the mailer up all of the treats fell all over the place. As you can see, there are some at the bottom of the mailer. Super annoyed. I CANT give these to my dog bc the package is cut open. It appears to have been tampered with. Very dangerous !",
      "rating": 1.0,
      "verified": true,
      "author": "heather stachel",
      "helpful_votes": 0,
      "publication_date": 20190730
    },
    {
      "title": "Super Hard",
      "text": "We have bought these a ton of times for our senior yorkie. She love them! However, for some reason this past purchase, we received a bag of very hard treats. Hard enough that I can barely break them in half. Not sure what happened with this specific order but we were not very happy. That said, we have ordered before and received very fresh treats. Just not happy with the consistency between orders.",
      "rating": 2.0,
      "verified": true,
      "author": "krissyx13",
      "helpful_votes": 0,
      "publication_date": 20200908
    },
    {
      "title": "MY DOG LOOOVES THIS!!!",
      "text": "I bought this for my small Yorkie he loves them they are a little big so I cut them up in 4's to make it easier for him to eat.. their size is perfect for a large breed but other than having to cut them my Yorkie loves them. They also last fresh for weeks, you do not have to leave them in the bag for them to stay fresh I always have them in a cookie jar and they stay fresh , really good product",
      "rating": 5.0,
      "verified": true,
      "author": "felix",
      "helpful_votes": 0,
      "publication_date": 20200610
    },
    {
      "title": "These do the trick!",
      "text": "I bought five bags of these to use with a K-9 trainer (positive and negative markers - obedience). We only used two bags in an hour and a half, and my dogs behavior was remarkably changed for the better. I’ve used them to reinforce the training my dog had, and hired a second trainer come (Leash manners) and I still have one bag left. I don’t need the treats anymore, but I still have them for the last session (stranger aggression).",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Bates",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Not Soft, Chewy treats",
      "text": "I bought these treats for my senior dog because it was advertised as \"Soft Savories.\" She is a rescue dog and came to me with severe dental disease. The vet had to pull most of her teeth, so naturally, she has trouble chewing hard treats. I was hoping she could eat these. The treats are not soft at all. They are hard biscuits. I plan to keep them because my other two dogs can eat them; however, I wanted to write this review to advise anyone else thinking these might be soft, chewy treats - they are not.",
      "rating": 2.0,
      "verified": true,
      "author": "md_okc",
      "helpful_votes": 0,
      "publication_date": 20191204
    },
    {
      "title": "NOT SOFT",
      "text": "The packaging is not metalized to prevent drying out of the contents. Plastic packaging without a metal layer is NOT capable of stopping water vapor movement. They are hard. I needed soft treats for a dog that just had some teeth removed. I open the package and add about 1/4 cup of water. Close and shake. In a few hours they will be soft.",
      "rating": 1.0,
      "verified": true,
      "author": "VirginiaGuy",
      "helpful_votes": 0,
      "publication_date": 20200729
    },
    {
      "title": "Excellent product, now if Amazon Logistics Delivery could deliver without blocking door...",
      "text": "The dogs love these things, their Hills Science Diet products and they are a good value. Buy them! Now if Amazon Delivery could only be a bit more like Fedex and UPS! So far they get here on the right day and lately have rang the door bell when leaving a delivery, just like the Pros do. Way to go! NOW, If they would just NOT place them in front of the outward swinging front door so that to exit my home or bring in the delivery I have to scrape the door across the items just delivered! The problem will be serious when the paint on the door has to be re-done, bring your own brush!",
      "rating": 5.0,
      "verified": true,
      "author": "Vagabond Steve",
      "helpful_votes": 0,
      "publication_date": 20180808
    },
    {
      "title": "Very Hard",
      "text": "I ordered this due to having an older dog who needs soft treats. These treats came and they are extremely hard. I have three dogs in my house and I thought ok I will not let them go to waste but my other two younger dogs would not eat them. They do not offer returns on this item. So overall not soft and 3 dogs did not like them.",
      "rating": 1.0,
      "verified": true,
      "author": "DanielleT76",
      "helpful_votes": 0,
      "publication_date": 20200911
    },
    {
      "title": "Great dog treats, worth the buy!",
      "text": "My dogs love these treats. They are a great price considering the brand. You get a decent amount. I will say they say soft and chewy and they are but my senior dog with missing teeth does struggle biting them and I often break them up but that’s honestly just a normal struggle with a senior dog. Other wise very please and placed on subscribe and save!",
      "rating": 5.0,
      "verified": true,
      "author": "M.Cline",
      "helpful_votes": 0,
      "publication_date": 20200921
    },
    {
      "title": "Happy Dogs",
      "text": "My doggies are getting old and I've noticed my Beagle doesn't really care for treats that are hard so I went looking for soft treats and these fit the bill for her and she really enjoys getting them instead of the hard cracker treats I've been getting them in the past. I was looking for something more on the healthy side. I'm sure I can find more healthy treats and will continue to look but for now Hill's Science Diet is taking care of my big lab as well as my 13\" beagle. They love them.",
      "rating": 5.0,
      "verified": true,
      "author": "Happy",
      "helpful_votes": 2,
      "publication_date": 20170620
    },
    {
      "title": "Not so soft",
      "text": "I got these for my rescued yorky because all her teeth were pulled except for her canines, so her treats have to be soft. I don't know if these came the way they did or they lost shelf life. Either way, my dog needed something softer. These may be medium, but definitely not soft. I had to break up so she could at least swallow the smaller pieces. Won't buy again, but they may work for your dog.",
      "rating": 3.0,
      "verified": true,
      "author": "LaineyBell",
      "helpful_votes": 0,
      "publication_date": 20200121
    },
    {
      "title": "Hard, dry treats",
      "text": "I’m very disappointed in these. My dog is 16 and does not have teeth so I try and find soft treats for her. These were advertised as soft but they are anything but soft. I tried to cut them with a knife but they broke into hard gritty pieces which she can’t eat. They were certainly of no value for the money. Please don’t advertise these as soft when they clearly are not.",
      "rating": 1.0,
      "verified": true,
      "author": "avid reader",
      "helpful_votes": 0,
      "publication_date": 20200402
    },
    {
      "title": "NOT SOFT!!! THEY'RE HARD & I DON'T THINK THEY ARE EVEN FRESH!",
      "text": "I haven't opened the bags yet but from feeling them from the outside they don't seem soft at all... HARD!!! I don't think they are fresh. I'll have to remember to see if there's an expiration date on them. If they are made in China or expired, or still yet since they aren't soft as advertised, I am seriously thinking about returning them!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Greg & Tanya",
      "helpful_votes": 0,
      "publication_date": 20200522
    },
    {
      "title": "My Dogs Initially Loved This Treat",
      "text": "My dogs have fallen in love with the Hill's Science Diet Soft Dog Treats so much so that I've been ordering 3 - 5 bags of the Beef & Cheddar, the Peanut Butter & Banana, and the Chicken & Yogurt treats. But, dogs can be fickle. Initially, my dogs loved the Beef & Cheddar treats, but, by the third go round of cycling the various treats, I noticed that they preferred Peanut Butter & Banana or the Chicken & Yogurt over the Beef & Cheddar treats. I will hold off giving them the Beef & Cheddar for a while and re-introduce it to them.",
      "rating": 4.0,
      "verified": true,
      "author": "bevin",
      "helpful_votes": 0,
      "publication_date": 20180831
    },
    {
      "title": "The Best Treats ever.",
      "text": "I have two shitzu boys that absolutely can not get enough of this treat. My youngest boy Bennie is 10 months old and he talks to me every morning as I am making my coffee. He just can not wait to get this treat in hit tummy... You will absolutely love this treat for your furry family members. My boys just love them and they are made of good quality ingredients...",
      "rating": 5.0,
      "verified": true,
      "author": "Superman",
      "helpful_votes": 0,
      "publication_date": 20181220
    },
    {
      "title": "My dog loved these",
      "text": "My dog is picky about everything and she loves these. I feel good because they're not full of junk and they have good ingredients. They smell horrible I won't lie but most dog food and treats do smell horrible. The worst they smell the more my dog loves them. It's been 2 weeks and I've been giving them out 2 or 3 at a time and she sees the bag and comes running. I guess that's an A+",
      "rating": 5.0,
      "verified": true,
      "author": "Bama Girl",
      "helpful_votes": 0,
      "publication_date": 20191121
    },
    {
      "title": "No longer a treat",
      "text": "My dog has fallen out of love of these. The last few containers we’ve bought the “freshness seal” hasn’t been fastened correctly. Plus my sister just pointed out to me they’re made in China so we won’t be ordering these any longer. Have found a better chicken strip that are soft and are Made with real chicken not processed with antibiotics etc.",
      "rating": 4.0,
      "verified": true,
      "author": "Yoyo’s mom",
      "helpful_votes": 0,
      "publication_date": 20200223
    },
    {
      "title": "My Dogs Love This Treat too",
      "text": "Great product! My dogs have really taken to the Hill's Science Diet Soft Savories Chicken & Yogurt Dog Treats. I alternate between the Chicken & Yogurt and the Peanut Butter & Banana treats. I received a bag of the Chicken & Yogurt treats from my Vet. My dogs loved it so much that I went back to my Vet to purchase some, but, they were out of the treats. I hunted on Amazon and not only found the Chicken & Yogurt treats, but, I also found the Peanut Butter & Banana treats and the Beef & Cheese treats.",
      "rating": 5.0,
      "verified": true,
      "author": "bevin",
      "helpful_votes": 0,
      "publication_date": 20180831
    },
    {
      "title": "not soft",
      "text": "The Hills treats do not stay soft even when careful to zip lock bag tight. They smell more beefy than banana peanut butter. The texture is like fiber board. They are larger than we needed, about the size of a half-dollar and 1/4th inch thick. My dog, and I , were not happy with this product. I bought these instead of our usual BilJac Gooberlicious and PBnanas Treats. I will go back to BilJac products, they remain soft and smooth texture.",
      "rating": 1.0,
      "verified": true,
      "author": "Susan K",
      "helpful_votes": 0,
      "publication_date": 20200713
    },
    {
      "title": "Definitely not soft treats, they are medium to hard!",
      "text": "Our 1 dog likes them, but they are not soft, as the name of the treat implies! We have 2 dogs, and 1 has no upper teeth. I purchased this product thinking both dogs could eat these, but they are too hard for any dog with missing teeth.",
      "rating": 4.0,
      "verified": true,
      "author": "Wendy",
      "helpful_votes": 0,
      "publication_date": 20191001
    },
    {
      "title": "My dog loves them",
      "text": "At first I bought these because of the low price. But upon recieving these treats and opening them I could see that they had amazing quality. The treats are not as SOFT as they say, it's more like a cookie. Crumbly around the edges with a slightly softened middle interior. The surprise is the chunks of banana you find every once in a while. My dog, Cookie goes absolutely crazy over these and I plan on adding these to my monthly purchases for pet supplies.",
      "rating": 5.0,
      "verified": true,
      "author": "Meritza",
      "helpful_votes": 0,
      "publication_date": 20200325
    },
    {
      "title": "Well my dog is it happy because they weren't soft but my daughter's dog is happy",
      "text": "I bought this because the package said it was soft however they were not soft at all when I got them and I have a very picky dog who will not eat treats that are not soft. Needless to say I had to send this package also to my daughter whose dog will eat hard treats which she said her dog loves them but if you're looking for a soft treat these are not hard hard but then not anywhere near soft either",
      "rating": 3.0,
      "verified": true,
      "author": "betallen",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "Not soft at all",
      "text": "So these say soft and savory they may be savory the dog likes them they are definitely not soft I was expecting a soft chew for my dog but they are hard like so hard you can hardly break them in half so yeah they may wanna rename these. That said the dog seems to like them. They do have a Very strong smell...",
      "rating": 2.0,
      "verified": true,
      "author": "Angie",
      "helpful_votes": 0,
      "publication_date": 20200419
    },
    {
      "title": "Not soft treats",
      "text": "Deceptive description on bag. I bought these because my dogs are all seniors that have difficulty chewing. I could feel how hard these were through the bag. 'Soft Savories' is not a truthful description. Also, there is a no return policy on pet food even if not opened.",
      "rating": 1.0,
      "verified": true,
      "author": "MoCo Sci",
      "helpful_votes": 2,
      "publication_date": 20190522
    },
    {
      "title": "Only for dogs who have all their teeth. You'll need them to get through this treat!",
      "text": "Probably my least favorite treat to give my dogs. They seemed pretty hard and only got harder as time went by. Would not purchase again and my dog thought they were okay. Could not give to my senior dogs as it seemed like a choking hazard.",
      "rating": 1.0,
      "verified": true,
      "author": "Matt & ElaTop Contributor: Pets",
      "helpful_votes": 2,
      "publication_date": 20181027
    },
    {
      "title": "Dry, hard and moldy",
      "text": "I have ordered these twice, my dogs love the flavor. Like other reviews mentioned, they were dried out both times. The first time I dampened a paper towel and put it in the bag. Two days later they were fine. The second bag, i could tell they were hard b4 I even opened the bag. I opened the bag to do the paper towel trick, not only were they rock hard, they were covered in dried out mold! Won't be ordering again",
      "rating": 1.0,
      "verified": true,
      "author": "Rebecca Badger ",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "They're Not Soft",
      "text": "If you have a senior dog or a dog with soft mouth or teeth issues, these aren't for them. They're tough and crumbly. I had to grind them up in a Ninja (it was almost like chopping almonds) and just use it as a sprinkle over his food. But not as a soft treat.",
      "rating": 1.0,
      "verified": true,
      "author": "Laura ",
      "helpful_votes": 0,
      "publication_date": 20200918
    },
    {
      "title": "Soft Dog Treats",
      "text": "I bought this for a very small dog that's a picky eater. The treats aren't too big but I still had to break one for her to eat it. The photo shows what appears to be 'icing' on the treat & I knew that would appeal to her. However, there's no 'icing' & the flavor hasn't enticed her enough for her to eat another one of these treats!",
      "rating": 4.0,
      "verified": true,
      "author": "Schefstad",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "HIGHLY RECOMMEND!",
      "text": "They must be wonderful because my 12 year old Lhasa apso and my 1 year old Shih Zu run when they see the bag! Both are on Hills and Science Diet diets, at the recommendation of their awesome vet so they must be somewhat healthy. I don’t feel as guilty giving them 1/2 treat every now and then! Definitely recommend these for your fur babies!! Great price when offered as an “Add on” by Amazon also!",
      "rating": 5.0,
      "verified": true,
      "author": "Bebe",
      "helpful_votes": 0,
      "publication_date": 20190611
    },
    {
      "title": "one dog loves them, the other one could care less",
      "text": "These are working for one of my dogs. The only thing I don't like is that they are about an inch almost in diameter and I wish they were about 1/3 or 1/4 of the size because I use them for training. If you're not using them for training and you simply want to give your dog a treat, they're the perfect size.",
      "rating": 4.0,
      "verified": true,
      "author": "Gigi",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "Great Dog Treats!!!!!!",
      "text": "My dog loves these treats!!!! I have been buying this brand for a while now! They have what seems like the yummiest treats around. These are semi-soft and my dog loves them. I would say they come chewy but if left exposed to air, they harden up to become VERY hard. My dog doesn't mind a good treat to chew, though! But I could see how these could be choking hazards when they harden. They smell yummy! Price on here comparable to pet stores. Great shirt, good quality!!!! Love the image on it",
      "rating": 5.0,
      "verified": true,
      "author": "cburkhardt5414",
      "helpful_votes": 2,
      "publication_date": 20160714
    },
    {
      "title": "Dog still gnawed on them but they were NOT soft.",
      "text": "They were as hard as stiff, stale jerkey. Honestly I don't think it's Hills, but I'm just not going to buy soft foods from Amazon anymore. The last time I ordered some gummy candy they also arrived stiff and stale. I'm thinking stock isn't being rotated and some things just sit until sold, OR they're not kept in a proper temperature setting.",
      "rating": 1.0,
      "verified": true,
      "author": "Seras Graves",
      "helpful_votes": 0,
      "publication_date": 20200616
    },
    {
      "title": "Soft bites for small dogs",
      "text": "Best treats for small dogs! I got these cuz it said SOFT and PEANUT BUTTER. My Pomeranians are spoiled and they don't do crunchy treats and generally anything that advertises peanut butter is a winner. This is the 2nd time I've ordered them. I think they may be on subscribe & save but I'm not sure. If they are NOT they should be!",
      "rating": 4.0,
      "verified": true,
      "author": "CLT",
      "helpful_votes": 0,
      "publication_date": 20191004
    },
    {
      "title": "The best treats I can afford.",
      "text": "I believe Hills Science Diet is a worthy company which makes healthy treats for my dog. I like to always have several varieties on hand because I like to treat her several times a day. I try to provide as healthy a Diet as I can afford for my faithful companion. She's obsessed with the treats and I enjoy seeing her excitement whenever I open a new bag.",
      "rating": 5.0,
      "verified": true,
      "author": "Madaline Furst",
      "helpful_votes": 0,
      "publication_date": 20190726
    },
    {
      "title": "Not so soft",
      "text": "My old girl has bad teeth so I wanted to get her some soft chewy treats. These are called soft savory’s so I was expecting a soft treat. They are not so soft. I have to break them up into small pieces for her to chew so I won’t be getting these again. I gave these three stars because she does seem to enjoy the taste.",
      "rating": 3.0,
      "verified": true,
      "author": "Autumn Fulk",
      "helpful_votes": 0,
      "publication_date": 20191113
    },
    {
      "title": "Not reccomend for a dog with sensitive tummy",
      "text": "These made my dog throw up but he has a sensitive tummy. The freshness seemed good. The flavor must have been good because he liked them. My other 2 dogs did just fine with them, no problems! I wouldn't get them for a dog with a sensitive tummy.",
      "rating": 3.0,
      "verified": true,
      "author": "Lori Perez",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "Not soft",
      "text": "My dogs definitely prefer side treats, as do I - much less mess than crunchy ones leaving crumbs around. I was disappointed when I received a bag of hard treats. Fortunately they don't crumble like typical hard treats, but still, disappointed. Dogs still gobble them up, but if I offer them a choice between these and other treats, they don't choose these.",
      "rating": 3.0,
      "verified": true,
      "author": "🌟 Emma Elizabeth 🌟",
      "helpful_votes": 0,
      "publication_date": 20190609
    },
    {
      "title": "Always fresh & soft Great price too. Especially for older dogs",
      "text": "This review asks me (a human/not eating dog treats) how the FLAVOR is. Lmbo!! Seriously? How would I know? But my 3 furbabies really like them. Especially for my oldest little girl, who's nearly blind and totally deaf with bad teeth. This is one of rhw few treats she can still chew and enjoy. Which makes me even happier than her.",
      "rating": 5.0,
      "verified": true,
      "author": "Momma_Bear",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Not really that soft",
      "text": "These really aren’t that soft. They aren’t hard like a milkbone but they don’t bend either. I picked these because my rescue had a bunch of teeth pulled and these were clearly not comfortable in his mouth. I’m going to get pupperonis instead, which are very soft.",
      "rating": 3.0,
      "verified": true,
      "author": "K. Lee",
      "helpful_votes": 0,
      "publication_date": 20200428
    },
    {
      "title": "Not Soft at all",
      "text": "Another product totally misrepresented. These things were hard as a rock. I bought these for my mom's small dogs and they can't chew them at all. One day I put 4 of them in a bowl of warm water and the only thing that softened up was the outer edges. Total rip off.",
      "rating": 1.0,
      "verified": true,
      "author": "Vicki Lea Lawrence",
      "helpful_votes": 0,
      "publication_date": 20200419
    },
    {
      "title": "Not really soft",
      "text": "I was expecting these to be soft... as in chewy. To me they’re relatively hard like a biscuit. They are round and a little bigger than the size of a quarter and about the thickness of four or five stacked quarters.",
      "rating": 3.0,
      "verified": true,
      "author": "TP",
      "helpful_votes": 0,
      "publication_date": 20201022
    },
    {
      "title": "Don't bother",
      "text": "This product has \"Soft\" right in the name, so I was expecting my elderly dogs to be able to enjoy them. One of my dogs only has a few teeth, and the other has very sensitive teeth. There is nothing soft about these treats. While they are not hard like a crunchy biscuit, they are dry and hard to break by hand. Rather than throw them away, I break them into tiny pieces by hand so my girls can pretty much swallow the pieces whole. They do seem to love the taste, though. To Hill's: please make these treats soft, and the product will be a winner.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "My dog loves these!",
      "text": "I’m actually not a huge fan of Science Diet, their dog food is generally not worth it for the price in my opinion. But I bought these treats on sale to see if my dog would enjoy them. I’m always looking for quality treats that don’t cost 10-12 bucks a bag. These were very reasonably priced even when not on sale and my dog adores them. When allowed to pick his own treat he always goes straight for this bag. Great buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Kate Estevez",
      "helpful_votes": 0,
      "publication_date": 20180824
    },
    {
      "title": "Not soft like I thought",
      "text": "My dog has mouth cancer and needs SOFT chews which is in the title of these. They can be soft if soaked in water and then they are soggy. Hills Diet is a fabulous product and I'm sure this is great for dogs without mouth problems.",
      "rating": 5.0,
      "verified": true,
      "author": "Charlie",
      "helpful_votes": 0,
      "publication_date": 20200704
    },
    {
      "title": "Hard as a rock!  READ this now .....",
      "text": "These are called “Soft Savories” but they are hard as a rock. I couldn’t cut them in half with my meat cleaver. They are either counterfeit or very old & stale. They are going back. I needed them for my little & old mini dachshund with few teeth. I wouldn’t feed them to my young large dog! Terrible product!",
      "rating": 1.0,
      "verified": true,
      "author": "McSusie",
      "helpful_votes": 0,
      "publication_date": 20190830
    },
    {
      "title": "NOT SOFT!!!!!",
      "text": "I wish I would have taken the time to read the reviews before I bought these! They are NOT soft at all. I just got them because they are supposed to be soft and they are a quality brand. Never again! My small dog can barley even eat them.",
      "rating": 1.0,
      "verified": true,
      "author": "Teacher Jill",
      "helpful_votes": 0,
      "publication_date": 20200908
    },
    {
      "title": "Crumbly.",
      "text": "The come in the bag with most of them crumbly and not the whole treat as shown on the front of the package. Having 2 Jack Russell Terriers, and with this an approved treat for their condition I expected better from Amazon. Highly disappointed. I was unable to feed 60% of the bag, as it is impossible to measure crumbs into a treat with the correct nutrients.",
      "rating": 2.0,
      "verified": true,
      "author": "Kimberly J. Crook",
      "helpful_votes": 0,
      "publication_date": 20190317
    },
    {
      "title": "NOT soft, as advertised",
      "text": "The title and packaging says ‘soft dog treats’ but that is not true. First, they are very large, much too large for my small dogs. However, were they soft I planned to just get them into smaller pieces. There was no way for me to do that—these things are solid. If I can’t return them I’ll give them to my son’s large dog.",
      "rating": 1.0,
      "verified": true,
      "author": "KristineV",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "Dogs love them, soft and chewy",
      "text": "I wasn't sure about ordering these aftering seeing a lot of comments say that the treats were rock hard. However, when mine arrived they were soft and chewy. My two dogs seem to really enjoy them. I don't have any complaints, and will be buying more.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190621
    },
    {
      "title": "SHE ABSOLUTELY LOVES THESE TREATS",
      "text": "We have not tried these before BUT, I have to tell you she Absolutely Loves Them. Who doesn’t love Peanut Butter & Bananas? I’ve not seen them before. I will definitely be buying these again. (My husband wishes they made these for Humans!!!!!☺️.)",
      "rating": 5.0,
      "verified": true,
      "author": "Love-A-GoodBargain",
      "helpful_votes": 0,
      "publication_date": 20200304
    },
    {
      "title": "Horrible Product",
      "text": "I ordered these SOFT DOG TREATS that were highly recommended for dogs without teeth (my dog). I ordered them through AMAZON and when they arrived the \"soft treats\" are as HARD AS A ROCK. I can't even break them up with my hands. NEVER AGAIN! Bad quality! and EXPENSIVE!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190702
    },
    {
      "title": "Are they trying to kill dogs here or what??",
      "text": "How in the world can this company call these soft dog treats? I took a sharp knife to them with no success! My chihuahua is young, and has a mouthful of strong teeth, however, I couldn't risk her choking on these big things, since I couldn't even cut them down. Verry disappointed I am.",
      "rating": 1.0,
      "verified": true,
      "author": "wiseshopper61",
      "helpful_votes": 0,
      "publication_date": 20190917
    },
    {
      "title": "Recommended for our dog",
      "text": "These were recommended by our dogs cardiologist because of our dogs heart condition. She seems to love them, which was was worried about. She doesn't care for the other flavors but loves this one.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200829
    },
    {
      "title": "Definitely not \"soft\"",
      "text": "The word \"soft\" does not apply to these treats at all! They feel more like traditional hard-baked, crunchy-type dog snacks and are too hard to cut in half with a knife. I suppose it's an okay product, but I would not recommend these treats if your dog has dental issues or trouble chewing.",
      "rating": 2.0,
      "verified": true,
      "author": "S13",
      "helpful_votes": 0,
      "publication_date": 20181001
    },
    {
      "title": "Great value",
      "text": "My boy loves these treats! I feed him science diet dry and wet food as well. The treats are reasonably priced and overall a good value. These treats are soft and you receive a decent amount in the bag. These go on sale quite frequently and the price cannot be beat.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Ross",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Dogs love it but its pungent.",
      "text": "My dogs definitely LOVE this. It was quite the winner treat. My main draw back though is that it really stinks. It smells worse than any packaged dog treat I've had the chance to smell. It also lingers on my dogs breathe for a little bit. In short, dogs love it but it comes at a cost.",
      "rating": 4.0,
      "verified": true,
      "author": "Berrett",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "My dogs new favorite",
      "text": "usually my guys love Blue Buffalo Health bars but since I started giving them this new treat they seem to want this more. I had my Shih Tzu actually turn up his nose to the other treat until he got this one. ( the brat). I guess I will have to stock up.",
      "rating": 5.0,
      "verified": true,
      "author": "MJ VanHecker",
      "helpful_votes": 0,
      "publication_date": 20191219
    },
    {
      "title": "My 1st Negative in 15+ years on Amazon",
      "text": "1st and LAST purchase of these so I don't know if it was the product, itself, or perhaps the pack I received was stale. In any case, the name of these dog treat is FALSE NAME. The treats were as hard as a rock. My poor little toothless rescue Chihuahua couldn't begin to eat one of these. I kept them because I also have a Yorkshire Terrorist who can bite through a steel fence. I bought Greenies Pill Pockets after seeing my vet peel off pieces for my Chi.",
      "rating": 1.0,
      "verified": true,
      "author": "jamcodp",
      "helpful_votes": 0,
      "publication_date": 20180517
    },
    {
      "title": "another dog treat disappointment",
      "text": "So these treats turned out to be hard as rocks, and my dog hated them.. I should stick to buying at Petco where you can return and get a refund if your pet won't eat them. But at least the treats were relatively inexpensive, as pet treats go.",
      "rating": 1.0,
      "verified": true,
      "author": "J. Witmer",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "Smell good, easy for the senior dogs to chew, but dry",
      "text": "These are rolled, round pieces....sort of like a classic cinnamon roll. Each one is a little soft and easy for the old dogs to chew. All of my dogs seem to like these and none have had any negative reactions. My issue is that the treats are a little on the dry side. This is good in one way because they don't leave any residue on my hands or in my pockets. But..... my dogs always get a drink immediately after eating one.",
      "rating": 4.0,
      "verified": true,
      "author": "Dogs & Horses ",
      "helpful_votes": 0,
      "publication_date": 20170130
    },
    {
      "title": "Not totally soft, but still tasty",
      "text": "I wouldn't necessarily call these \"soft\" treats, but my dogs like them. They're not as pliable as truly soft treats, but they're not crunchy like standard dry dog treats either. They're great for my dogs, but if you're looking for a soft treat for a dog with dental problems, these probably aren't for you.",
      "rating": 4.0,
      "verified": true,
      "author": "Kara",
      "helpful_votes": 0,
      "publication_date": 20190415
    },
    {
      "title": "Not soft, as name implies",
      "text": "Our dog liked these treats, but if you are buying these because the name says SOFT, don't. They are not soft, but closer to medium- hard. One of our dogs has missing teath, so we ordered these for him. But these were too hard. Our dog with teeth loved them.",
      "rating": 3.0,
      "verified": true,
      "author": "Wendy",
      "helpful_votes": 0,
      "publication_date": 20191001
    },
    {
      "title": "Soft these are NOT!",
      "text": "Soft these are NOT! I bought these for my older dog that already has missing teeth. Everywhere it says that these are soft treats. My poor dog wants to eat one but ends up just carrying it around as he can’t chew them. False advertising to say that they are soft. Honestly, I can’t even push my thumbnail down into one, they are that hard. What a disappointment.",
      "rating": 2.0,
      "verified": true,
      "author": "Melissa Leppert",
      "helpful_votes": 0,
      "publication_date": 20190707
    },
    {
      "title": "Wonderful treats!",
      "text": "My dog absolutely loves these treats!! They are a good size, not real hard, and made from real peanut butter! Not very expensive either so I bought more than one package. They can be broken and great for training and they smell like peanut butter!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "penny bowers",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "False description",
      "text": "I bought the treats because they had the description soft treats they are not, I can with some difficulty break them up and my senior terrier gobbles them up. She likes them but again they are not soft",
      "rating": 3.0,
      "verified": true,
      "author": "robert pregony",
      "helpful_votes": 0,
      "publication_date": 20200624
    },
    {
      "title": "Clean ingredients but messy",
      "text": "My dog loves anything peanut butter and jerky types. So I decided to try this product. This is a great snack when your dog earns “good job” job. But since it’s not the lightest snack you could only give a few. Pros: clean ingredients Cons: gets messy, heavier calories",
      "rating": 4.0,
      "verified": true,
      "author": "TJ & Olivia",
      "helpful_votes": 0,
      "publication_date": 20190614
    },
    {
      "title": "Definitely NOT soft treats!!!",
      "text": "These are NOT SOFT AT ALL! I bought these for my little guy who's old and doesnt have much teeth left, so I wanted to get him some soft treats. But when I received these, I could barely break these with my hands!! I had to take a knife to them!!",
      "rating": 2.0,
      "verified": true,
      "author": "Christina Lingley ",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "Not As Soft As Expected",
      "text": "We ordered these for our 12 year old chihuahua who has lost most of her teeth. She was unable to eat the treats without us breaking them up because they were hard. She did however like the flavor of the treats.",
      "rating": 3.0,
      "verified": true,
      "author": "Moon-Leo",
      "helpful_votes": 0,
      "publication_date": 20200323
    },
    {
      "title": "I almost want to them myself",
      "text": "My dog has a sensitive stomach and he’s elderly now so we have to be careful what we feed him. It’s often difficult to find things that are good for him and that he’ll eat because he’s fairly picky. These smell like peanut butter and he thinks we’re giving him human food. Can’t get any better than that.",
      "rating": 5.0,
      "verified": true,
      "author": "Indigoapple",
      "helpful_votes": 0,
      "publication_date": 20190410
    },
    {
      "title": "Dogs loves treats",
      "text": "The dogs love this treat So I guess it's a woof I didn't see diet on there they're not overweight dogs wanted to try something different besides everything chicken",
      "rating": 5.0,
      "verified": true,
      "author": "Lor",
      "helpful_votes": 0,
      "publication_date": 20200811
    },
    {
      "title": "They smell &look good, but, there not soft enough for teacup.",
      "text": "They were too hard for my Teacup, so I gave some to my other two dogs, the Chihuahuas would not even take one, but she is very, very picky, My Doberman ate 5 & didn't want anymore. That's not like her. I might have gotten a bad bag or something.",
      "rating": 3.0,
      "verified": true,
      "author": "Teresa Gail Walker",
      "helpful_votes": 0,
      "publication_date": 20191002
    },
    {
      "title": "Dog Loves!",
      "text": "I never ordered treats online. My dog needed something better for her that was not just corn meal or bones marrow ground up. I saw these and decided to give them a try and she loves them. I wish they were smaller for small dogs. But she just gets one a day. Will buy other flavors!!",
      "rating": 5.0,
      "verified": true,
      "author": "Christy Young",
      "helpful_votes": 0,
      "publication_date": 20190430
    },
    {
      "title": "My Dog Loves Them!",
      "text": "My senior dog got these for Christmas and he loves them. He has a sensitive stomach and had a very strict diet. I break these in half morning and night with his meds and he hasn't gotten an upset stomach or diarrhea. What's more, he comes running when he hears the bag!",
      "rating": 5.0,
      "verified": true,
      "author": "BIG",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "The use of the word SOFT",
      "text": "I'm not sure that the word SOFT should be used. these were not anything close to being soft. I'm glad that i have friends with healthy dogs or I would just have to toss them out. Lesson learned though I will go to a store and find SOFT treats.",
      "rating": 1.0,
      "verified": true,
      "author": "Patrick",
      "helpful_votes": 0,
      "publication_date": 20191104
    },
    {
      "title": "EXCELLENT DOG TREAT",
      "text": "I have purchased this item several times from Amazon, because they had the LOWEST price. I buy them for 2 of my local animals shelters, and they tell me the dogs LOVE them. I would highly recommend this product to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Darbe",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "Would not recommend if you are in such of a \"soft\" treat",
      "text": "Item arrived on time and well packaged. Only complaint is they were very \"hard\" My small dog couldn't chew them. Amazon did refund my money but I did throw product away.",
      "rating": 1.0,
      "verified": true,
      "author": "Whitney Stumf",
      "helpful_votes": 0,
      "publication_date": 20200805
    },
    {
      "title": "Small dog treats",
      "text": "i did a search for small dog treats and this is what i got, my dog is 4lb this is for a big dog. need to state how big the treat is , like a picture would be great",
      "rating": 3.0,
      "verified": true,
      "author": "Tammy Talbott",
      "helpful_votes": 0,
      "publication_date": 20201016
    },
    {
      "title": "This order was not up to standard.",
      "text": "I have been using these as treats for our bearded collie for sometime. This last order of 4 I bought are dry and hard. Not the soft treats like they are usually. I think these I received are old!",
      "rating": 2.0,
      "verified": true,
      "author": "smuellersd",
      "helpful_votes": 0,
      "publication_date": 20200323
    },
    {
      "title": "For $3 worth it",
      "text": "Worth the price as discounted. For the flavor rating I put a 5 since my dogs seem to love them. Soft and pliable, my German Shepard took his time with this! My Dalmatian gobbled it up! Wish more came in the bag! Would recommend would buy again.",
      "rating": 4.0,
      "verified": true,
      "author": "Honest Review",
      "helpful_votes": 0,
      "publication_date": 20190903
    }
  ],
  "product_meta": {
    "title": "HILL'S Science Diet Soft Savories Treat",
    "description": "Flavor Name:Peanut Butter & BananaHILL'S Soft savories peanut butter & banana dog treats are delicious, natural and made from only the best ingredients. The soft and tender texture paired with a medley of fun Rich flavors will make a dog happy. No corn, artificial colors, flavors or preservatives. Hill’s 100 percent Satisfaction guarantee: We're confident your pet will enjoy HILL'S foods. We're so confident that we offer a 100 percent money back guarantee. If you are unsatisfied for any reason, return the unused portion to Amazon for a full refund or replacement. For more information on returning an Amazon purchased product, visit the Amazon returns center.",
    "rating": 4.3,
    "feature_bullets": [
      "Made with real peanut butter",
      "Not artificially preserved or flavored",
      "Fun, rich flavors for a happy dog",
      "100 percent satisfaction guaranteed or your money back"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "11.75 x 9.88 x 8.5 inches; 0.96 Ounces",
      "Item model number": "3360",
      "Date First Available": "September 16, 2014",
      "Manufacturer": "Hill's Science Diet Dog",
      "ASIN": "B00NMMSRJE",
      "Domestic Shipping": "Currently, item can be shipped only within the U.S. and to APO/FPO addresses. For APO/FPO shipments, please check with the manufacturer regarding warranty and support issues.",
      "International Shipping": "This item is not eligible for international shipping.",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Treats",
      "Dogs",
      "Pet Supplies",
      "Cookies, Biscuits & Snacks"
    ],
    "price": 5.15
  }
}