{
  "website_summaries": [
    {
      "verdict": "McAllen is comfortable for workers who stand and walk all day. But because it's a slip-on, it's not good for jobs where pivoting and quick reactions are necessary.",
      "pros": [
        "Slip-on style",
        "Sporty, lightweight, and flexible",
        "Good for wide feet",
        "Feel like non-skid slippers",
        "Electrical hazard safe design",
        "Slip-resistant",
        "Synthetic/textile upper with gore side panels.Soft fabric lining.Cushioned comfort insole.FlexSole shock absorbing flexible lightweight midsole.OSHA-compliant slip resistant nitrile rubber traction outsole",
        "Comes in men's sizes"
      ],
      "cons": [
        "Can be too warm on the feet",
        "Does not protect feet from heavy things falling on them",
        "Loosens quickly",
        "Heel box is easily damaged"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "So far so good",
      "text": "Very comfortable, slip resistant, and fit snug without sliding off when walking. Day one in the books, no foot pain after 10 hours on my feet. I will update about durability in a few months. Update October 29th 2017 still going strong. The only downside is I work with flour and flour absorbs into the material. Worth it for how comfortable they are and how long they are lasting.",
      "rating": 5.0,
      "verified": true,
      "author": "Noah B",
      "helpful_votes": 140,
      "publication_date": 20170710
    },
    {
      "title": "Fatal Flaw",
      "text": "I've bought 2 pair of these shoes. The back of the shoe collapses in incredibly easy. Once it does, there's a piece of cushioning pressuring the back of your heal. I figured the first pair of shoes may have been an anomaly, but it's happening to the second pair already as well, despite my being more careful putting the shoes on. This is not the quality I would expect per the price of this shoe. Once the material is folded down, it is difficult to get it righted. This is a fatal flaw which makes any other positive aspect of the shoe mute.",
      "rating": 1.0,
      "verified": true,
      "author": "Greg",
      "helpful_votes": 81,
      "publication_date": 20180208
    },
    {
      "title": "DOWNGRADED Review",
      "text": "ORIGINALLY GAVE 5 STARS - Exactly what I wanted - comfortable easy-on, easy-off footwear heavier than a slipper but lighter than a shoe. You can easily wear these outdoors, but I wear them around the house. I have a wide foot and the wide size fits perfectly. UPDATE - They SMELL! Other reviewers have noted the same problem. After a few months of light use - they stink and I can't get the smell out. I have lois of shoes and slippers and this has never happened to me before. Very disappointed because I did find them comfortable.",
      "rating": 1.0,
      "verified": true,
      "author": "Donny B.",
      "helpful_votes": 36,
      "publication_date": 20180911
    },
    {
      "title": "Very Comfortable",
      "text": "I bought these for my husband, who is a chef. He has always worn Crocs. After trying these on and wearing them at work, he absolutely raved about their comfort and breathability. He has neuropathy in his lower legs and these have helped him greatly.",
      "rating": 5.0,
      "verified": true,
      "author": "eirehead",
      "helpful_votes": 52,
      "publication_date": 20170514
    },
    {
      "title": "Tread coming apart after three days!",
      "text": "Wore them to work for three days. I work as a sous chef in a busy kitchen and on the fourth day (today) 8/1/16 the outsole is already coming apart. Are they comfortable? Yes. Are they durable? No.",
      "rating": 3.0,
      "verified": true,
      "author": "Ryan M.",
      "helpful_votes": 95,
      "publication_date": 20160801
    },
    {
      "title": "Nice memory foam ; Nice slip on feature",
      "text": "I read a lot of reviews on this shoe before purchasing. I work on concrete in a factory for 8 hours a day. These are comfortable shoes. All though it doesn't take much time or effort to tie shoes, I love getting to skip it and slip these pups on and off. On about day 4 my right foot was slightly sore but some of that is to be expected with any new shoe as they're broke in. Time will tell their quality but for now they're just fine. The memory foam insoles are nice and I expect them to flatten out over time but you can always put a new one in there or perhaps double it up.",
      "rating": 5.0,
      "verified": true,
      "author": "sc616",
      "helpful_votes": 18,
      "publication_date": 20180825
    },
    {
      "title": "Great! EXCEPT. . .",
      "text": "As others have written, these are VERY comfortable shoes. The problem is, the sole started separating before they were a year old. Unfortunately, this appears to be a consistent problem. I wish it weren't. Otherwise, I love these shoes. Can you find a stronger adhesive? As others have also said, I can't defend buying a new pair after only 6 or nine months of wear.",
      "rating": 3.0,
      "verified": true,
      "author": "Clyde",
      "helpful_votes": 27,
      "publication_date": 20180715
    },
    {
      "title": "Worth the buy",
      "text": "Server at a fast-pace restaurant. Shoes fit as expected, so buy the same size you normally wear. They're very comfortable and for those who care, look stylish as well (no bold branding with just a low profile \"S\" on the the lower side of the heel). Comes with a memory foam sole which is an amazing thing. Spend the extra few dollars and get this pair.",
      "rating": 5.0,
      "verified": true,
      "author": "John S.",
      "helpful_votes": 16,
      "publication_date": 20161014
    },
    {
      "title": "Initially good until they started destroying my feet",
      "text": "I thought these were going to be it but I was wrong. These initially felt great from their memory foam insole but I knew it would give out. (Size 12 at 200lbs) if you look through some of the reviews and the asked question. You could see that many people complained about how little the heel cushioning is and it really did hurt. Now my whole feet hurt and some days I wake up with back pain also. The shoe is also pretty ugly. I really did liked the shoe the first couple of days but now it’s just unbearable to wear. I’ve even tried insoles but still nothing.",
      "rating": 1.0,
      "verified": true,
      "author": "Jimmy",
      "helpful_votes": 4,
      "publication_date": 20190330
    },
    {
      "title": "Make sure not to step into them.",
      "text": "Wear these daily, on my feet for 9-10 hours. Comfortable overall and fit as I expected them to. They're kinda boaty and big, but that's not an issue. The problem is the material that's in the heel of the shoe at the top of the foot opening is not attached inside, and has decided to bunch up and be uncomfortable the more I put them on. They're slip ons, so they should have put a couple more stitches in that area to prevent this. If you buy them, I'd make sure to grab that material every time you put them on instead of just stepping into them",
      "rating": 3.0,
      "verified": true,
      "author": "FuzzyBuddy'sDad",
      "helpful_votes": 2,
      "publication_date": 20191015
    },
    {
      "title": "Ugly shoes but they work",
      "text": "The shoes look better in the picture. In reality they are very ugly, but for some reason so are every single pair of non-slip shoes. I’ve worked over 1000 hours in these shoes. I wear insoles, so I can’t speak about the inside of the shoe much. Where the big toe sits in the shoe is deteriorated. The outside has holes in the fabric and the glue is starting to separate a little. Overall I would recommend, but I won’t purchase again. They are so ugly.",
      "rating": 4.0,
      "verified": true,
      "author": "Austin & Elle",
      "helpful_votes": 3,
      "publication_date": 20190120
    },
    {
      "title": "Comfort",
      "text": "Bought these shoes to replace a pair of sketchers loafers I had purchased as work shoes a year ago and are now worn out. This pair I bought using my regular shoe size 9.5 and the fit was fine. My previous pair I had to buy a half size larger. As expected the comfort was great for a sketchers shoe. Non slip bottom seems to work well but not the primary reason I bought them. Bought this style at the price point I was willing to pay and everything seems fine. If they last a year again I will be happy as I wear them everyday for work.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve",
      "helpful_votes": 3,
      "publication_date": 20190104
    },
    {
      "title": "... week at a restaurant and this shoes is very comfortable, have green superfeets in them",
      "text": "Working 5 days a week at a restaurant and this shoes is very comfortable, have green superfeets in them, and my ingrown toenail and upward sloped nails doesn't get compressed like other work shoes. Ever since I have used these shoes, I have not have ingrown toenails that hurt. However, if durability and longevity was something you are looking for in a work shoe, this shoe is not for you. It does not last 2 years. I've had 3 pairs now, one them lasted only one year. But if comfort is something your are looking for, I recommend these.",
      "rating": 4.0,
      "verified": true,
      "author": "DIY IT manager",
      "helpful_votes": 2,
      "publication_date": 20180106
    },
    {
      "title": "2d Pair of Same Shoe",
      "text": "This purchase is the 2d of the same pair. The first pair I purchased at a discount shoe store on a whim and, to be honest, I cannot remember a more comfortable shoe than these. I have worn this pair of shoes almost daily for the last year and a half and was starting to need a new pair of shoes so I decided to try and find the exact pair (which I found on Amazon). These shoes are just as comfortable as the original purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Olesarge",
      "helpful_votes": 2,
      "publication_date": 20190226
    },
    {
      "title": "Wonderfully comfortable",
      "text": "These are by far the most comfortable work shoes I've ever worn. I spend a lot of time on my feet every day, and until now I've had a hard (and painful) time finding shoes that give me a good combination of support and comfort, but these shoes are just what I've been looking for. Plenty of padding keeps my feet comfortable all day - it's like walking on a cloud! These shoes are not steel toed or have any other protection on top, making them inappropriate for some needs, but for those who can do without, it's an excellent pair of shoes to wear.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric Norton",
      "helpful_votes": 0,
      "publication_date": 20190318
    },
    {
      "title": "Great job thank you again may God bless you all",
      "text": "First of all I like to say thank you to all the staff members do all your sacrifice e doing the situation that we are dealing with right now in the meantime I also would like to say thank you from the bottom of my heart did the delivery man who happened to put his life in the line to deliver the most important things I needed that shoes is actuality manage to support my foot in my lower back that I have been suffering throughout my entire life I think you are the staff members that you are doing a great job and as well the delivery man thank you so much for all Yas sacrifice",
      "rating": 5.0,
      "verified": true,
      "author": "Ralph    E. Saturne",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "Happy with my purchase thus far",
      "text": "I had acquired a bad habit of wearing nicer leather shoes while doing yard work just because they're slip ons, and after wife received gift of inexpensive slip ons similar to these I thought I'd try them just for knocking around in the yard. So far I'm happy with them. Pretty comfy. I'm so used to everything fitting smaller than expected that I probably ordered larger than I should have but honestly only by about 1/2 size. They are still comfy so I am not exchanging them. Did not care whether they are water resistant so didn't answer.",
      "rating": 5.0,
      "verified": true,
      "author": "Guitar Johnny",
      "helpful_votes": 0,
      "publication_date": 20200812
    },
    {
      "title": "Great while they last.",
      "text": "The shoes are comfy, fit well, and while they stay together they are my favorite shoes. Once the insides start breaking down after a couple months they get uncomfortable and teh memory foam actually starts coming out. I have had this happen on the last 2 pair I have bought. Price per month of use is not the worst, but could be much better if they used better glue.",
      "rating": 1.0,
      "verified": true,
      "author": "Dan",
      "helpful_votes": 0,
      "publication_date": 20200712
    },
    {
      "title": "Not only are these the most comfortable Skechers shoes I've ever worn",
      "text": "I usually wear about an eight and a half to maybe a 9 in men's shoes, and I find these eight and a half perfectly fitting. Not only are these the most comfortable Skechers shoes I've ever worn, they're one of the most shoes ever worn period. I also own and I've worn pairs of the Skechers Go Walk 3 and 4, favoring the comfort of the three over the four, and these work shoes put the GOwalk 3 to shame, it's just a shame they only come in black as I would love to get a pair of charcoal or navy to wear on a more regular basis and not just for work",
      "rating": 5.0,
      "verified": true,
      "author": "Spocko1701a",
      "helpful_votes": 2,
      "publication_date": 20180809
    },
    {
      "title": "Comfortable kitchen shoes at a reasonable price better than the others.",
      "text": "Bought for the hubby who works in the kitchen. His feet were killing him wearing \"actual\" chef shoes. After two 12 hour days of these shoes, his feet were only tired. They are comfortable and provided support. Waterproof and have great tread for a slippy kitchen floor. He was thrilled to have these instead of his expensive chef shoes. After several months, wearing socks with them, no smell like other reviews have mentioned. We will be buying a few more pairs and storing them since every time we find something good, it gets discontinued..",
      "rating": 5.0,
      "verified": true,
      "author": "Yvette",
      "helpful_votes": 0,
      "publication_date": 20200905
    },
    {
      "title": "Great at first, falling apart 2mo later.",
      "text": "***UPDATE*** I originally got these on Mar 1, 2019. After working on the line 4 nights a week + doing port work two mornings a week, they are starting to fall apart. See attached images. This is really disappointing. Yes, the cost was low compared to standard non slips, but it's May 13th and they now hurt to stand in. [Original review] I love these. They're a perfect fit and handle abuse in a small kitchen with 3 other people slinging food with classic Ministry blaring on kitchen speakers. It will take a few weeks to see how they hold up, but so far so good!",
      "rating": 2.0,
      "verified": true,
      "author": "Gabriel Perry",
      "helpful_votes": 0,
      "publication_date": 20190304
    },
    {
      "title": "Not true size but very nice shoes",
      "text": "4 stars only because the size wasn’t true size, I had to go to a sketchers store and switch them which eliminated the point of ordering online to avoid going to the store, I’m just glad I was able to do so, we ordered size 11 for my son who wears 11 on every shoe but this shoe was more like a 12-13. Other than that, they look nice, don’t hurt, and works wonders to work in a restaurant.",
      "rating": 4.0,
      "verified": true,
      "author": "The Williams family",
      "helpful_votes": 0,
      "publication_date": 20190621
    },
    {
      "title": "Big Feet find comfort",
      "text": "Having a size 14 shoe it's always hard for me to find shoes that fit, doubly so for work shoes. These shoes fit perfectly, not tight at all, my feet are not sore after work, nor do they start to hurt during the day. I still have some extra room in the shoe which allows me to walk without feeling sharp pain coursing through my toes and legs. If you got big feet then get these shoes.",
      "rating": 4.0,
      "verified": true,
      "author": "Joey Doughnuts",
      "helpful_votes": 0,
      "publication_date": 20190216
    },
    {
      "title": "STINKY FEET/FEET CANT BREATH",
      "text": "im curious if anyone else has the same problem with this shoes. My feet never stink! I wear these shoes and the first day i wear them i can feel my feel very sweaty/ moist. the top fabric of the shoes have a plasticy film inside the fabric which i think prevents my feet from breathing properly. The memory foam works like a sponge absorbing all the moisture and odor (which is not good!). i was afraid to take my shoes off in front of my family when i get home because my feet stunk do bad after a couple weeks of using them. if you have sweaty feet to begin with, i would not recommend this shoes.",
      "rating": 2.0,
      "verified": true,
      "author": "C. serna",
      "helpful_votes": 2,
      "publication_date": 20190306
    },
    {
      "title": "Great shoes well built, sturdy, good traction, and warm",
      "text": "Great fit solidly built, and very comfortable. I wear a men's 9.5/10 M and ordered a 10.5 as a size bigger for easy slip on as a personal preference and plan to wear them around the house as slippers. For me I have about 3/4 inch room in the toe box. I imagine the sizes are very true so order your normal size. I am pleased with these shoes and always look for work, commercial, or industrial duty anything because they are usually better built, heavy duty, and last longer compared to the big box store civilian choices.",
      "rating": 5.0,
      "verified": true,
      "author": "Chuck",
      "helpful_votes": 0,
      "publication_date": 20191214
    },
    {
      "title": "Recommend",
      "text": "Arrived on time. Fits as I expected. Extremely comfortable, so much so that I'm going to take them on our upcoming motorhome trip as my driving shoes. Seem to be of good quality. We'll see how they last over time. 12/14 Update. Six months later. Still comfortable as all get out. No issues with quality as they are holding up very well, showing no signs of wear and tear. Have become my primary daily shoes. Probably will order another pair to keep in the motorhome Upgrading to 5 stars. Recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Moon Man",
      "helpful_votes": 3,
      "publication_date": 20170718
    },
    {
      "title": "Very Comfortable Shoes",
      "text": "These shoes are very comfortable especially when you have to stand for 4 to 8 hours a day. Purchased them for my son too since he stands at his job too.",
      "rating": 5.0,
      "verified": true,
      "author": "Lenci",
      "helpful_votes": 3,
      "publication_date": 20190216
    },
    {
      "title": "These shoes destroyed my feet.  I am still limping badly after two weeks.",
      "text": "Poorly constructed. Comfortable at first. The heels collapsed, and the lack of adequate foot support has badly injured my right foot. These shoes are a serious hazard to foot health, ad you may find yourself laying a serious physical price with feet health that you may be unable to remedy. In my opinion, these shoes are a way for the company to quickly turn around a buck, for relatively short term customer gratification, but big regrets later.",
      "rating": 1.0,
      "verified": true,
      "author": "Pythagorus",
      "helpful_votes": 0,
      "publication_date": 20201004
    },
    {
      "title": "terribly uncomfortable",
      "text": "I really hate these shoes, but I'm past the return window. They are insanely stiff, heavy, make your feet hot, and just uncomfortable in my opinion. Also, one of the padding in the heels seems to have \"folded\" so the heel feels terrible against the back of my foot. I've tried to fix the padding, but can't.",
      "rating": 1.0,
      "verified": true,
      "author": "Matthew",
      "helpful_votes": 0,
      "publication_date": 20190826
    },
    {
      "title": "Soles not properly installed",
      "text": "At first I like these shoes. Then I wore them for a full night at work and discovered that the interior soles were not properly glued in. This resulted in my large toes rubbing in a gap between where the sole and sidewalk should meet seamlessly. Since the soles are glued in, there’s no removing them to install a better fitting one (you’d have to put in an insert, which would negate the whole reason of having temper-pedicure soles in he first place). Would not recommend.",
      "rating": 2.0,
      "verified": true,
      "author": "ddog",
      "helpful_votes": 0,
      "publication_date": 20190709
    },
    {
      "title": "Best shoe for kitchen work",
      "text": "I have put these shoes through a lot. 12-13hr shifts. Doesn't slip on water or light oil. It will slip on ice cubes, but anything would. The soles will clog up and I would pound them against a rock or the curb to get the gunk out and they have help up. The sole hasn't cracked the stitching has remain strong. The fabric is great for letting your feet vent. I have brought other brands such as treadsafe, which only last a couple of months. These have lasted for almost a year and are still are in good shape. Extremely comfortable!!! Well worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Pablo Valenzuela",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "Surprisingly comfortable!!",
      "text": "I wear these shoes in a kitchen every day, and they're surprisingly comfortable!! Definitely the most comfy work shoes I have ever owned. I had returned my first pair because they were ever-so-slightly larger than I expected, but this was only a minor setback for the price and value. Overall, I'm very satisfied. After a month of consistent use, they are still quite comfy. I suspect they are relatively cheap, and they might start falling apart after 6-8 months of daily use. For comparison, my generic Townforst non-slip pair didn't make it past 7 months, but I'm more optimistic about these Sketchers!",
      "rating": 5.0,
      "verified": true,
      "author": "Addison Williams",
      "helpful_votes": 2,
      "publication_date": 20180713
    },
    {
      "title": "Most comfortable shoe you will ever own",
      "text": "I originally ordered these in the size that I topically wear, but that ended up being too large. I returned them and ordered a pair that’s a half size smaller than what I topically wear. It’s worth noting that the shoes I topically wear could also be too big and I just don’t notice because I tie them tightly. These are the most comfortable shoes I have ever owned. Not just restaurant shoes, but I’m general. I highly recommend these. Being that they were my first pair of slip on shoes I have owned, it took me a few hours to get used to them, but I love them. They are comfortable and offer superior traction.",
      "rating": 5.0,
      "verified": true,
      "author": "Oliver Von Pelser",
      "helpful_votes": 0,
      "publication_date": 20190119
    },
    {
      "title": "Comfortable but not durable",
      "text": "Bought these for my husband who works on his feet for many hours a day, and although they were as comfortable as shown in the reviews, it's been less than a year (8 months) and they are completely falling apart at the seams. He loves them for the comfort and the fit but overall, we are a bit disappointed by the lack of durability.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20180804
    },
    {
      "title": "Second Time I've Bought These Shoes!",
      "text": "This is the second time I've gotten these particular Sketchers. They are comfortable, fit perfectly and they last forever! I like this shoe as it works as both a business and casual shoe to wear out. I teach a lot and so this shoe is great for being on your feet a majority of the day! I like them A LOT!",
      "rating": 5.0,
      "verified": true,
      "author": "Jim J  in MD",
      "helpful_votes": 2,
      "publication_date": 20190224
    },
    {
      "title": "Extremely comfortable",
      "text": "Awesome shoes. I work in a restaurant, up to 40-50 hours per week. These are the most comfortable pair of shoes I have ever owned, like walking on a cloud. The only downfall is they have only lasted me 7 months before falling apart, but they are still solid shoes and will be buying a second pair. UPDATE: I have purchased 3 pairs. I recently moved to a restaurant with less grease and they have been outstanding. Haven’t worn up, just buying another pair for the sake of them being cleaner. Water resistant, long hours don’t bother my feet with these. Buy!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Kyle Bolyard",
      "helpful_votes": 0,
      "publication_date": 20171217
    },
    {
      "title": "great shoes",
      "text": "It took about three days of wearing this shoe before it was really comfortable. Now I wear the shoes at work, hard tile floor, for 8 hrs and can say my feet are very pleased. The shoes are easy to put on, truly non-slip on wet floors, and after 4 weeks I see no wear at all on the soles. The shoes also are easy to make look like new by simply wiping them with a damp cloth. Great shoes.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael D",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "They do exactly what they're supposed to.",
      "text": "Very good slip protection. If you're searching for these then you know what you need. These will do the job. - Solid slip resistance. In my experience they work for me on water, water + soap, and water + oil surfaces. Your mileage may vary, of course. - Comfort is decent. The padding feels slightly thin but not terribly so, they're still conformable. - Heat can be a slight issue. It's not bad, but it does get noticeable after a while. - Fit is perfect. Plenty of space, but not too much. - Pictures are accurate. Probably not a top priority but still a nice to have.",
      "rating": 5.0,
      "verified": true,
      "author": "JL",
      "helpful_votes": 0,
      "publication_date": 20200905
    },
    {
      "title": "Durable, metal-free, light, worth the $$",
      "text": "Comfortable. Have held up to almost three years of office work. Go through metal detectors with no problems. Feet never feel hot, shoes seem to breath. They do squeak/squish on polished office floors. Definitely not for cold weather. With almost three years of 40 hours a week, they are just now beginning to separate at the front... and I'm buying another pair! THEY ARE NOT STEEL TOE, not sure why it says that.",
      "rating": 4.0,
      "verified": true,
      "author": "Randy",
      "helpful_votes": 2,
      "publication_date": 20170804
    },
    {
      "title": "Very comfortable, particularly for problem feet",
      "text": "The hubby has problem feet due to chronic stress fractures and a past broken ankle that left his foot somewhat 'lopsided' He tends to by shoes a size too large to accommodate for the shape of his feet. He also always needs lots of cushioning. These fit him perfectly -- did not 'rub him the wrong way' around the sides or toes, and offered good comfort and support. Good quality but lightweight enough for him to walk around all day.",
      "rating": 5.0,
      "verified": true,
      "author": "Vicki",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "Converted Son",
      "text": "My 30 year old son asked for these. He is on his feet all day in a kitchen for work. He was not too thrilled at the idea of Sketchers thinking they are just for “old” people, but once he put them on he loves them! He’s always been a Nike guy and still loves them when going out, but he says these are the most comfortable shoes he’s ever had. He didn’t need to convince me, I have worn out several pairs over the years and always have several pairs in the closet.",
      "rating": 5.0,
      "verified": true,
      "author": "Gigi 42",
      "helpful_votes": 0,
      "publication_date": 20180407
    },
    {
      "title": "These were great at first",
      "text": "These were great at first, boyfriend said they were very comfortable. Unfortunately, the soles have started to come apart which is a serious issue.",
      "rating": 2.0,
      "verified": true,
      "author": "Catherine A. Gregory",
      "helpful_votes": 6,
      "publication_date": 20170524
    },
    {
      "title": "Perfect if you're in a warehouse environment",
      "text": "If you're in a warehouse environment that doesn't require steel tipped safety shoes, these are great. Slip resistant, comfortable all day. They cushion your feet and make sure your feet aren't killing you at the end of the day. I will suggest that since they are synthetic material you invest in a good pair of order absorbing inserts. Your significant other will be very happy when you take your shoes off at the end of the day and they're not running for the nearest window.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Soep",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "Comfortable shoes, by believe other reviews about durability.",
      "text": "I was hesitant to buy these after reading all the reviews saying how they split and the soles weren't good. However I bought these back in January and they have been great, however in May I noticed one of the soles began to show signs of splitting. I'll be honest, these shoes are still great however they only lasted 4 months before beginning to fall apart like other reviewers have stated. I'm giving it 3 stars because I genuinely do enjoy these shoes, they are comfortable and make getting ready in the morning easy but the fact that they only lasted 4 months before showing signs of wear and tear is the only downside that cost them 2 stars.",
      "rating": 3.0,
      "verified": true,
      "author": "William Z",
      "helpful_votes": 0,
      "publication_date": 20190519
    },
    {
      "title": "most comfortable shoes i have ever worn HOWEVER the soles gave ...",
      "text": "most comfortable shoes i have ever worn HOWEVER the soles gave out after 3 weeks of wearing. However, I work about 10 hrs a day and stand for about 9 hours straight six days a week. i just switched out the soles with some custom comfort soles from amazon",
      "rating": 3.0,
      "verified": true,
      "author": "Ryan DeMesa",
      "helpful_votes": 7,
      "publication_date": 20151228
    },
    {
      "title": "Most Comfortable Slip On Shoes",
      "text": "Very very comfortable slip on shoes with memory foam. Using as slippers for around the yard and running to grocery store. I only wear Sketchers with memory foam sneakers and now I will be alternating with these slip on. FYI great for people with lower back problems and is the reason I started to wear Sketchers. Great product!",
      "rating": 5.0,
      "verified": true,
      "author": "steven p tippett",
      "helpful_votes": 0,
      "publication_date": 20190406
    },
    {
      "title": "GREAT FOR PRICE WILL BUY AGAIN",
      "text": "Comfy, durable, easy to clean, and breathable. I work as the head cook and I am on my feet 10 hour a day 6 days a week. I am three months in and these shoes are just now starting to show some age. With as much movement as I put them through I am extremely happy with the product. I will be purchasing more when the busy season picks back up.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Brown",
      "helpful_votes": 3,
      "publication_date": 20170830
    },
    {
      "title": "resistant to splashes of water in the kitchen, easy to put on and take off",
      "text": "I own a small bed-and-breakfast, using them for work is one of my purposes, so far so good They work pretty good I basically use them indoors, I may say I thought they were going to be a lot more softer, but being a new shoe we will have to wait a bit until it fits my toes Other than that, I will say it was a pretty good purchase Will recommend them for somebody that’s working on a kitchen or a place where they need to have comfort especially if you have to be standing up for long periods of time",
      "rating": 4.0,
      "verified": true,
      "author": "Juan S",
      "helpful_votes": 0,
      "publication_date": 20200825
    },
    {
      "title": "Very comfortable",
      "text": "These fit me a bit large so I would not try running in them, but they are so comfortable and have helped with nerve pain that I had been suffering from for months leading up to my buying new shows (these). I don't recommend these if you'll be walking on waxed hard surfaces all day because they squeak really loudly (I'm no longer called a ninja at work). Squeaking is probably a product of the non-slip design which does work--I also don't slip on those floors during rainy days or when there is a dust all over a surface.",
      "rating": 5.0,
      "verified": true,
      "author": "The Drake",
      "helpful_votes": 0,
      "publication_date": 20181126
    },
    {
      "title": "Size !!!Super large - thick socks won't help",
      "text": "When I opened the box . Fist thing that came to me. Did they send the wrong size. I check the box , it said size 9. I check the size tag on the shoes, it said size 9. But It look like size 10 1/2 My son normally wear size 9 to 9 1/2. And when My son try them on ... OMG he had so much room. He can insert 3 fingers in there. They are comfortable but get 1 1/2 size down. If you wear size 10 you need to get to get size 8 1/2",
      "rating": 3.0,
      "verified": true,
      "author": "Sammi",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "Shoe Back Folds Inward-Yikes!",
      "text": "I've purchased several Skechers products and all have been excellent with one exception, the Flex Advantage slip on. I'll get right to the point; they are comfortable and the style is fine. The problem is the shoe back folds inward when I put them on. Other Skechers have a sturdier back that doesn't collapse into the shoe. Now to be fair, it is possible I purchased them a half size too small, but I don't think so because once on, they are comfortable. They now sit in the back of my closet, rarely used. When I do wear them, I need to use a shoehorn. My feeling is this is a design flaw.",
      "rating": 2.0,
      "verified": true,
      "author": "Diane B.",
      "helpful_votes": 0,
      "publication_date": 20180330
    },
    {
      "title": "PRODUCT JUST NOT GOOD",
      "text": "My return has lapsed so not able to return for a new pair. I have had these shoes less than six months and the back of the shoe around the top has come lose therefore not able to wear them. SAD you pay this much for a pair of shoes and they last less than six months. Would not recommend them. YOU would think the manufacture would want to do something?",
      "rating": 3.0,
      "verified": true,
      "author": "Ray Baker",
      "helpful_votes": 0,
      "publication_date": 20200507
    },
    {
      "title": "very comfortable and works",
      "text": "this is my honest review.... i dont speak for everyones experience, just my own. These pair of shoes are honestly great. I ordered them a bit too big, but they still fit great, and because they are slip ons, it makes them easier to take on and off. Ive only had them for a couple of days, but theyve been great so far. i recommend 10/10 (if something happens with my shoes, ill come back to edit this review)",
      "rating": 5.0,
      "verified": true,
      "author": "Joseph Cho",
      "helpful_votes": 0,
      "publication_date": 20190829
    },
    {
      "title": "Slip resistant not good enough",
      "text": "Not as good as shoes for crews wear in the slip resistant department. Just not the same level of grip, when your going around the restaurant serving people. Dry floor it's fine, but too wet you gotta be careful, especially the kitchen and sharp turns. The insole is a nice feature but does not last long, as it's already getting flat in a couple of months wear. The fit and style is nice though, and the price is reasonable during discounts.",
      "rating": 3.0,
      "verified": true,
      "author": "Leon_Cloud",
      "helpful_votes": 0,
      "publication_date": 20180819
    },
    {
      "title": "Too Big",
      "text": "I have ordered these many times nd have not had a problem until now. Ordered the same size as usual \"10 Relaxed\". These were way too relaxed, probably .5 inches wider than the pair s I have bought before. Wore them for about two weeks and had to throw them out, they were so bad.",
      "rating": 1.0,
      "verified": true,
      "author": "Directorschair",
      "helpful_votes": 0,
      "publication_date": 20190831
    },
    {
      "title": "Comfortable but doesn't last",
      "text": "The shoe was comfortable and great for when working on your feet a long time but the shoe does not last to wear and tear. Haven't had them for a year and the bottoms are coming apart. Bits of it are coming off. Not something I expected to be honest in an office environment within a year. So if you're alright trying to patch the shoe up to last longer, it's a good buy, otherwise may want to keep shopping for something that will keep up to being on your feet.",
      "rating": 4.0,
      "verified": true,
      "author": "Kris G",
      "helpful_votes": 0,
      "publication_date": 20190528
    },
    {
      "title": "Inconsistent Sizing 👎🏽 for Larger Feet (MEN & WOMEN Sizing)",
      "text": "Skechers is really a hit or miss when they are not using cheaply made faux rubber soles. These shoes had odd sizing and I ordered multiple sizing in both men and women, which seem like its all the same fit. I'm not sure if Skechers is doing unisex sizing but these are not the same quality of shoes I'm used to receiving from Skechers. Disappointed :(",
      "rating": 1.0,
      "verified": true,
      "author": "UnikTop Contributor: Makeup",
      "helpful_votes": 0,
      "publication_date": 20200308
    },
    {
      "title": "Comfortable and Light",
      "text": "I bought these shoes for my son who works in a restaurant. He's on his feet all night and we were looking for a comfortable slip resistent shoe that he can wear for long periods and not come home with aching feet. He loves these shoes and thanked me over and over for buying them. They are light, comfortable and they slip on nice and easy. He has very wide feet and is often hard to fit. But these are perfect!! Will definitely buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa Bradley",
      "helpful_votes": 0,
      "publication_date": 20200811
    },
    {
      "title": "For $30 on sale those are great shoes",
      "text": "I would recommend to wait for periodically sale, for 60$ those are just too much for a brand that is selling them on outlet for half of the price (2nd 50% off) and was selling them for 45$ for many years. Also I like that the brand of sketchers is black and barely notice. ( I don't like branding on shoes) over all great shoes for the right price is a great deal",
      "rating": 4.0,
      "verified": true,
      "author": "TheAmazonReviewer",
      "helpful_votes": 0,
      "publication_date": 20190223
    },
    {
      "title": "Great work shoes for kitchen",
      "text": "I am a chef and I love these shoes! Comfortable easy to keep clean. Handle we in water and reasonable amount of oil spills on floor. I would highly recommend this this shoe!!!",
      "rating": 5.0,
      "verified": true,
      "author": "David Epperson",
      "helpful_votes": 0,
      "publication_date": 20200610
    },
    {
      "title": "Very good for it's price",
      "text": "I am a chef and this is exactly what im looking for. Very comfortable ,black , durable shoes and most importantly non slip. One minor problem is it doesn't have a waterproof top so if spilled hot oil or water it will deep through but not a problem for me. 5 stars",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin",
      "helpful_votes": 0,
      "publication_date": 20190402
    },
    {
      "title": "Very long lasting shoe.",
      "text": "I just realized that I have had these shoes for almost 2 years. I’m on my feet all day at work(Monday through Friday) and they are holding up very nicely. I usually get 10,000 to 13,000 steps a day at work. I’m very impressed with the quality of this shoe. It’s still very comfortable and I don’t have any of my sciatica pains since I’ve been wearing them.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe Parker",
      "helpful_votes": 0,
      "publication_date": 20191118
    },
    {
      "title": "Very comfortable shoe and fits like a... shoe",
      "text": "This was recommended by a co-worker, we are both technical trainers and on our feet a lot. He says it's the most comfortable shoe that he's ever worn so I bought a pair and I agree with him. They slip on and off really easy and it doesn't feel like you're wearing shoes. I also bought some inserts and even with those in the shoes it's a perfect fit. I highly recommend these for those who are on their feet all day long.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin J Langmann",
      "helpful_votes": 0,
      "publication_date": 20190820
    },
    {
      "title": "Good set of slip-on shoes",
      "text": "These shoes are very nice. That should mean a lot because I carry flooring all day long up and down stairs. The shoes stay on well, but slip off easily when I need them to. Don't expect protection from water, but they breath and dry well. I've already been hard on them and they still look good. The soles have good traction and are holding up nicely, without picking up many rocks.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike V",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "Runs large",
      "text": "I should have taken the advice from the reviews because these shoes do run large. I wear an 11 in all shoes but these are too big. I tried them on and they slightly loose and by the end of the day the shoes were slipping back-and-forth. Unfortunately I wore them once so I cannot return them. Take heed of the reviews because again, these shoes do run large...",
      "rating": 4.0,
      "verified": true,
      "author": "Eric R.",
      "helpful_votes": 0,
      "publication_date": 20190414
    },
    {
      "title": "I still slipped!",
      "text": "I wouldn't recommended buying these if you are going to be on your feet all day as it has made my heels hurt very badly to wear them. I also wouldn't trust the slip resistant sole, as I slipped and fell while wearing these. I did send them back and got my refund but I wouldn't ever buy them again.",
      "rating": 2.0,
      "verified": true,
      "author": "Laura",
      "helpful_votes": 0,
      "publication_date": 20200519
    },
    {
      "title": "Comfortable and non-slip on epoxy coated concrete",
      "text": "I haven't had the that long, but they've been comfortable on my feet all day in my shop. Not my choice when I need protection, but are holding up fine to general mechanical and fabrication work. The epoxy floor is like a skating rink if it gets wet at all. These have kept me from slipping and sliding.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 0,
      "publication_date": 20201018
    },
    {
      "title": "The best shoes ever",
      "text": "This is my 3rd pair. I change the insoles to a plantar fasciitis insert. I wear them everyday to work and they typically last about 8 months. The best thing I like is that they are so quiet when I want, nobody can hear me coming. Plus they are the most comfortable shoe I have ever worn. I’m 64 and slightly over weight.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Dale",
      "helpful_votes": 0,
      "publication_date": 20191128
    },
    {
      "title": "2nd time's the charm and SO comfortable",
      "text": "My first pair was a 14D, they run a bit narrow. 2nd pair was 14E and they're perfect. Well made, great non-slip sole and the memory foam inserts are A W E S O M E ! Great summer office shoes, very cool and super light weight.",
      "rating": 5.0,
      "verified": true,
      "author": "wxman58",
      "helpful_votes": 0,
      "publication_date": 20190531
    },
    {
      "title": "Goodbye plantar fasciitis!",
      "text": "The comfort is unreal. I've been In the restaurant industry for more than 5 years and I've had my issues with plantar fasciitis due to having flat feet, and these shoes are the best in comfort I've ever worn. I add arch support too and even though I feel good in them, I do occasionally slip.. which I have read does occur in previous reviews, I risked it. I'm giving 4 stars because they're almost perfect.",
      "rating": 4.0,
      "verified": true,
      "author": "Anai",
      "helpful_votes": 0,
      "publication_date": 20181017
    },
    {
      "title": "This is not a 9.5 shoe, too big",
      "text": "I have many pairs of these shoes. What is a relaxed fit shoe? That is not how it is advertised. Relaxed for shoe means its a half size too big so they don't fit. I reordered the exact same item as last time and I get a different shoe. Obviously they are at the bottom of the barrel and just sending out terrible shoes.",
      "rating": 1.0,
      "verified": true,
      "author": "Marty",
      "helpful_votes": 0,
      "publication_date": 20200909
    },
    {
      "title": "2nd Purchase",
      "text": "These are great work shoes that don't cost to much. They lasted about 7 or 8 months before starting to come apart, then came apart pretty quickly once they started. But that is honestly longer that most shoes for crews have lasted and I hate the \"croc\" style. I work in a kitchen for 50-60 hours a week.",
      "rating": 5.0,
      "verified": true,
      "author": "Rex McArtor",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "Walking on sunshine",
      "text": "Sketchers are the best shoes I've ever purchased. I've gone the cheap route with ordinary shoes on many occasions with not so good of results. Then, I purchased a pair of Sketchers regular shoes. Angels sing, clouds part, Heaven speaks! I'm not kidding. I've had those for 2 years now and going strong. These work shoes I've only had for a week or so, but my feet at work already feel loads better. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Spectabulous",
      "helpful_votes": 0,
      "publication_date": 20190111
    },
    {
      "title": "elastic on the tongue a little tight for me",
      "text": "I had to cut one side of the elastic on the tongue for comfort. My foot is a little high in the arch. Otherwise the shoes are great. I would buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200616
    },
    {
      "title": "Probably the best shoe in the world",
      "text": "This is the only shoe I wear, and the only shoe I've ever worn in the last 5 years. I just replace them whenever they get worn out. But by far the most comfortable shoe I've ever had. I hope Sketchers never stops producing these and I hope they don't change a single thing about these shoes.",
      "rating": 5.0,
      "verified": true,
      "author": "Reviewer",
      "helpful_votes": 0,
      "publication_date": 20201016
    },
    {
      "title": "Didn't last long",
      "text": "They looked good, fit well, and were comfortable, however... I've had them for less than 1 year and the insole has developed a big hole near the ball of my foot. Little pieces of insole are constantly breaking lose now. Also they don't have good insulation and my feeties get cold.",
      "rating": 2.0,
      "verified": true,
      "author": "Cale G.",
      "helpful_votes": 0,
      "publication_date": 20200421
    },
    {
      "title": "feels great, great for travel",
      "text": "I think these are going to be great for traveling shoes, lite, very comfortable, non slip, they appear to breath well, and I have been starting to get plantar Fascitis, and I plan on doing a lot of walking on my vacation, good insoles, but I will bring some extra heel support if needed. I think they are also classy enough to wear with some up graded clothes, good work!",
      "rating": 5.0,
      "verified": true,
      "author": "Harry M",
      "helpful_votes": 0,
      "publication_date": 20190704
    },
    {
      "title": "Comfy Slip-on Shoe",
      "text": "I bought this product because I was having a hip replacement and needed a slip on shoe. Not only was the fit perfect, I got all kinds of compliments about a great looking and comfortable shoe - especially from the staff. Is that a Sketcher? Where did you get it? Must be a popular shoe at the hospital.",
      "rating": 5.0,
      "verified": true,
      "author": "Jupiter Reader",
      "helpful_votes": 0,
      "publication_date": 20191120
    },
    {
      "title": "This is a wonderful shoe",
      "text": "I have been looking for this shoe for years. It is light weight. It is very comfortable. It is slip resistant. It is water resistant. It looks very good, not like a heavy workshop. Thank you for having this shoe and if you had it in brown I would get it immediately. The black is fantastic.",
      "rating": 5.0,
      "verified": true,
      "author": "Beynongirl",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "Best shoe for comfort and concrete floors.",
      "text": "I had searched for work shoes for a good year and landed on these, I work at a warehouse on concrete floors for 8 hours a day and definitely need shoes that support me so I don’t destroy my body after work. I tried numerous brands, but these have been the most comfy and supporting with any shoe of course you will need to replace the inserts down the line with a high quality one, but the memory foam in the Skechers last a good 3-4 months before you need to replace them which is great quality. I’d recommend them if you need comfort and support on hard surfaces.",
      "rating": 4.0,
      "verified": true,
      "author": "Taylor Alexander",
      "helpful_votes": 0,
      "publication_date": 20200928
    },
    {
      "title": "Had to go a half size smaller",
      "text": "We first ordered 11.5 (as that's my grandson's size in other shoes), but they were too loose, so we returned the 11.5 with ease (thank you Amazon!) and purchased the 11. Great fit! Weight is so much less than other working/non-slip shoes that my grandson has tried!",
      "rating": 5.0,
      "verified": true,
      "author": "Kim Baake",
      "helpful_votes": 0,
      "publication_date": 20200910
    },
    {
      "title": "Excellent. Quality, comfort, durability. 2 year life span.",
      "text": "I'm at 2 years with these guys as a daily wear. They held up great, but I'm finally starting to feel the ground through the gel. 2 years is great, and the waterproof held up the entire time. Thoroughly pleased with the durability, quality, and comfort. The only reason I'm not buying another pair is because I'm shifting to an office and away from the kitchen. If I'm ever back on the floor I'll definitely get another pair though.",
      "rating": 5.0,
      "verified": true,
      "author": "Z. Bagley",
      "helpful_votes": 0,
      "publication_date": 20180513
    },
    {
      "title": "Awesome",
      "text": "As a restaurant manager, I have been struggling for years to find the right pair of shoes for the amount of walking I do in a day.I have wide feet, so almost every shoe I have been wearing has caused pain on my pinky toe. I found these and they are the best. I don’t know how long they will last, but it doesn’t matter to me because I am now in comfort every day",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "I was looking for a comfortable, lightweight pair of slip on type shoes and ...",
      "text": "I was looking for a comfortable, lightweight pair of slip on type shoes and after reading reviews, purchased these. So far I have not been disappointed. They are comfortable and if I did wear them all day long, I know from what my brief experience has been with them that they would be comfortable. Very light and the mesh does a good job of keeping your feet cool and dry. Satisfied customer, would buy again. Good product.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180317
    },
    {
      "title": "A formidable replacement for Go Walks.",
      "text": "After months of struggling with the loss of my precious Go Walks because the new ones are too narrow in the front to fit my feet properly, I am really glad I finally found these. The front is just right and my toes fit comfortably. These are a great replacement for the Go Walks which I can no longer wear. As long as they keep making these and they maintain the same fit, I will keep buying them for years to come.",
      "rating": 5.0,
      "verified": true,
      "author": "FleckStar",
      "helpful_votes": 0,
      "publication_date": 20170810
    },
    {
      "title": "nice fitting shoes",
      "text": "very nice shoes...only thing was i thought i ordered black...but ended up with charcoal with black...no problem..so watch when your order...the color choice is confusing....other wise great looking shoes...going to use them to work around the house and yard in.....work shoes!",
      "rating": 5.0,
      "verified": true,
      "author": "mary",
      "helpful_votes": 0,
      "publication_date": 20200629
    },
    {
      "title": "Great shoes",
      "text": "Love the shoes I'm glad they had extra wide size because they are hard to find. the shoes are flexible durable and comfortable which is saying a lot coming from me because most of the shoes I buy suck because of the size of my feet 13 extra wide. No complaints about these shoes",
      "rating": 5.0,
      "verified": true,
      "author": "kjvman",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "Perfection",
      "text": "With really wide feet Ive always struggled with shoes. Im a mechanic and even my wide steel toe boots would leave my feet callused badly on the sides and tops of my toes from being squished. I decided to go with something comfortable and with better slip resistance than boots. These fit the bill and luckily they fit true to size and they have an EXTRA wide option. My feet have never felt better in a pair of shoes. Id wear these almost anywhere to be honest.",
      "rating": 5.0,
      "verified": true,
      "author": "John Hess",
      "helpful_votes": 0,
      "publication_date": 20180306
    },
    {
      "title": "My husband reports these are the most comfortable shoes he has ever worn",
      "text": "My husband reports these are the most comfortable shoes he has ever worn. He delivers chips as a route driver so he is up and down in a big truck every day. He loves the insoles and memory foam. He is used to having his shoes fit his feet good however he bought the correct size and his food just slide around in them. (He figure because he wasn't used to having shoes without laces) -he doesn't have a very fat foot.",
      "rating": 5.0,
      "verified": true,
      "author": "chrissy",
      "helpful_votes": 2,
      "publication_date": 20170314
    },
    {
      "title": "Too small this time",
      "text": "This was my third pair of these shoes. Becuz I normally love them. I order the same size the same style every time and this time it was too small for my foot. although I'm still wearing the same pair of the same size that I got so something changed and it's not good",
      "rating": 1.0,
      "verified": true,
      "author": "gary asbell",
      "helpful_votes": 0,
      "publication_date": 20200217
    },
    {
      "title": "Good for people always on their feet!",
      "text": "I love these shoes! I was able to get 2 for the price of one ensuring I have shoes for the next year. They hold up well when you are rough on shoes like me. I will buy these for as long as I can. Best slip on sketchers for people on their feet alot!",
      "rating": 5.0,
      "verified": true,
      "author": "Steven Nasrallah",
      "helpful_votes": 0,
      "publication_date": 20200514
    },
    {
      "title": "Husband loves them",
      "text": "My husband is diabetic and very careful with foot care. He had been wearing a pair of Merrills for years and they were just worn out. I had purchased a couple pair of Sketchers for myself and love them. I talked him into trying the men's Sketchers, he liked them so much had to order another similar pair.",
      "rating": 5.0,
      "verified": true,
      "author": "Montana Mom",
      "helpful_votes": 0,
      "publication_date": 20191008
    },
    {
      "title": "I'm sold",
      "text": "So comfortable, I almost forget I have them on! I've never been able to find a pair of shoes that works with my feet (wide, flat, disgusting duck feet. Lol). The memory foam gives in all the right ways while still providing plenty of support. I'm on my feet anywhere between 12-16hours a day and with these, my feet and back feel fine at the end of the day.",
      "rating": 5.0,
      "verified": true,
      "author": "Bret Redfern",
      "helpful_votes": 0,
      "publication_date": 20190223
    },
    {
      "title": "Most comfortable shoes I've ever worn hands down !!!",
      "text": "I love these shoes ! My feet were bothering me so bad in my old work boots that I had custom orthopedic insoles made. After installing these my feet still bothered me! I ditched the work boots, put the $ expensive insoles away and bought these. The past 3 weeks have been pure heaven!!! I can't speak to the wear or longevity of these shoes but I can tell you that they're as comfortable as any shoe I've ever worn!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Bob D",
      "helpful_votes": 0,
      "publication_date": 20180924
    },
    {
      "title": "Great shoes for those on their feet long hours.",
      "text": "I like them because they are pretty comfortable as I’m on my feet for 10 hours a day. It was also a plus factor they had wide sizes available. They only thing I wish is that the insole had a little more cushion. But I’d probably buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Budgrower420",
      "helpful_votes": 0,
      "publication_date": 20200609
    },
    {
      "title": "4th pair",
      "text": "I am on my 4th pair of these. The Good: *They are extremely comfortable even when I'm on my feet all day *They breathe pretty well so my feet aren't retched at the end of the day *They are very non- slip The Bad: *They are worn out in about 7 months of every day wear *Once they are worn out it is like a night and day difference",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191021
    },
    {
      "title": "Skechers changed something in the shoe",
      "text": "first pair of these i bought a year ago and they were the most comfortable shoe even after 10 hours on my feet. this time something changed in the manufacturing now my ankles and knees hurt after couple hour on my feet.",
      "rating": 1.0,
      "verified": true,
      "author": "Bruce",
      "helpful_votes": 0,
      "publication_date": 20191207
    },
    {
      "title": "Excellent Construction Work Shoes",
      "text": "My husband used to buy those ridiculously expensive steel toe work boots since he does carpentry and construction and at one point we couldn't get them for him so he bought a pair of these shoes just as a stop gap. They provide decent protection, and last far longer than the steel toe boots. He can get 3 pair of these for the price of those work boots too! Very nice.",
      "rating": 5.0,
      "verified": true,
      "author": "Anne",
      "helpful_votes": 0,
      "publication_date": 20200514
    },
    {
      "title": "Works for my son's brace",
      "text": "My son has an injury that keeps him in a wheelchair. He will soon have a new brace to keep his ankle from turning in. His left shoe will be used to anchor the brace and he will still have a good looking pair of shoes on his feet. Thank you.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "Good work shoe",
      "text": "Got these for my son who works in a kitchen. Says they are very comfortable. They shipped very quickly & the seller was very helpful when I had to return a pair for a different size. Buy with confidence.",
      "rating": 5.0,
      "verified": true,
      "author": "Nanci",
      "helpful_votes": 0,
      "publication_date": 20190216
    }
  ],
  "product_meta": {
    "title": "Skechers for Work Men's Flex Advantage Mcallen Food Service Shoe",
    "description": "Slip on work shoe\n\nSkechers is an award-winning global leader in the lifestyle footwear industry that designs, develops, and markets lifestyle footwear that appeals to trend-savvy men, women and children. The company's success stems from it's high quality, diversified, and affordable product line that meets consumers' various lifestyle needs. Since it's inception in 1992, the Skechers diverse product offering has grown from utility style boots to include seven Skechers brands and five uniquely branded fashion lines for men and women.",
    "rating": 4.5,
    "feature_bullets": [
      "Synthetic",
      "Imported",
      "Synthetic sole",
      "Slip-on shoe work shoe featuring mesh fabric upper and slip-resistant traction outsole",
      "Elastic side gores at opening",
      "Padded collar and reinforced stitched seams. Memory foam insole for cushioning",
      "For medium fit it maintains medium width in the heel with a roomier toe box. For medium fit it is a bit more open interior offers a looser fit around the entire foot",
      "Soft fabric shoe lining. 1 1/4 inch built in heel"
    ],
    "categories": [
      "Men",
      "Shoes",
      "Health Care & Food Service",
      "Clothing, Shoes & Jewelry",
      "Uniforms, Work & Safety"
    ],
    "price": 44.95,
    "specifications": {}
  }
}