{
  "website_summaries": [
    {
      "verdict": "From long winter weekends to extended backcountry treks, this men's backpack is very customizable and includes a free daypack and rain cover.",
      "pros": [
        "Construction includes a 630D high-density nylon base and 200D polyester lining",
        "Customization options include a removable LumbarTune insert and harness, and hipbelt",
        "Multiple sizes",
        "Top-loading",
        "Weighs 5.5 pounds",
        "Several colors available, including onyx black and spark red",
        "Comes with a free daypack and rain cover"
      ],
      "cons": [
        "Weatherguard pocket is too small for cell phones",
        "Backpack is on the heavy side",
        "Does not come with trekking pole holders"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Holy smokes this is a spectacular pack",
      "text": "I carried a double load for my gf who had a difficult time with her pack (REI). As experienced and conditioned I am, I don’t think I would’ve been able to make the whole backpacking trip with any other pack (perhaps the osprey atmos ag would be the only other pack). It held up, but not only that- it was fantastically comfortable even with 60lbs of load I ended up carrying for the whole trip. It hugs and keeps the weight close to body, the adjustable suspension works flawlessly and it’s just a damn good lookin pack.",
      "rating": 5.0,
      "verified": true,
      "author": "Sean L.",
      "helpful_votes": 11,
      "publication_date": 20180920
    },
    {
      "title": "Very good pack",
      "text": "I've hiked 200+ miles with this pack, including three weeks on the JMT. My loads varied from 30 pounds up to 60 pounds on some flat-land training hikes. The Baltoro always handled the load comfortably. Very happy with the design, packing and access to stowed gear. The water bottle pocket is very well designed for easy access and stowing when hiking. The three pockets on the brain is smart. Zippers, straps and material all held up great. One suggestion: make the pockets on the belt strap slightly larger.",
      "rating": 5.0,
      "verified": true,
      "author": "Thermalsurf",
      "helpful_votes": 15,
      "publication_date": 20160928
    },
    {
      "title": "Workhorse of a Pack!",
      "text": "Took this pack on a pretty hard hike for the first time last week. I had bought a medium because of my spine length but had to buy an additional waist harness because I am a 38\" waist (large). It took a lot of adjusting on the trail to get everything prefect, but after finding the \"sweet spots\" I was very glad I bought this pack. Tons of adjustment options on this thing. I received a lot of compliments from the veteran hikers I was with. Seems like a workhorse of a pack. A++",
      "rating": 4.0,
      "verified": true,
      "author": "Eugene",
      "helpful_votes": 4,
      "publication_date": 20180203
    },
    {
      "title": "Great Pack!",
      "text": "This pack can hold some weight! I purchased the small (I'm 5'4\" (round 157)) Balatoro and I way overpacked, seriously with 2 liter camelback I was pushing close to 60 pounds. (Recommended around 40's Thankfully campsite was less than a hundred yards in) It was HEAVY but it was comfortable, pack fit perfect with little adjustments. Lotsa space and pockets here and there, separate zipper and compartment for sleeping bag is pretty neat. There are even two little easy access pockets on the waist belts. For the super organized the Sea to Summit Medium size sacks fit perfectly. Zero complaints!!",
      "rating": 5.0,
      "verified": true,
      "author": "MarcT",
      "helpful_votes": 3,
      "publication_date": 20180917
    },
    {
      "title": "Great Backpack",
      "text": "Bought this backpack for a 8 day backpacking trip I had planned. Was very pleased to see it included a backpack raincover, and a very light weight day pack. The pack fit as advertised, and had just the right amount of pockets and side straps. I started our trip with a 48 lb pack. I would say this was at the top end of the weight this pack should carry, due to the lightweight waist and shoulder strap design.",
      "rating": 5.0,
      "verified": true,
      "author": "wakeboyx5",
      "helpful_votes": 0,
      "publication_date": 20190901
    },
    {
      "title": "Amazing backpack!",
      "text": "Awesome backpack and very comfortable. I ordered a Gregory and a Osprey and felt the gregory haf better support and more cushion. Also the Gregory comes with a free day hike backpack and rain cover. There is a also a huge price diferrence this one being more 150 dollars less expensive. Strongly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessy K. Vasquez",
      "helpful_votes": 4,
      "publication_date": 20180311
    },
    {
      "title": "Great pack with multiple uses",
      "text": "Incredible pack. Design and fit are perfect. Bag in un zips open like a gym bag. Great feature for ropes, large items, or adjusting inventory Fitsbnd wears very well. Weight distribution is equal. Dual use rock climbing and backpacking. Best Multi use pack I've owned. H20 reservoir area is perfect. Detachable day bag is not bad but very lightweight. Clean and very accessible pack.",
      "rating": 5.0,
      "verified": true,
      "author": "S.H.",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "Amazing Quality",
      "text": "I purchased an Osprey Atoms 65 on sale at REI and absolutely loved it. I bought it a size too large though and had to return it. I'm so happy that I did because i found this backpack and it is better in my opinion. It has plenty of great features such as the removable day bag and several pockets for organization, which to me was a must. I have only used it on a few 2-4 night trips so far but this pack can definitely hold enough gear for a much longer trip. It's durability and quality is very evident already and I know this pack will last many years.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180915
    },
    {
      "title": "Great options for everything.",
      "text": "This is the most comfortable pack I have ever used. All of the weight is on the hips and the pack moves with you not against you. If you are looking for a pack to use on a day hike two day hike or a week this Pack is a hauler for you.",
      "rating": 5.0,
      "verified": true,
      "author": "Alpha",
      "helpful_votes": 3,
      "publication_date": 20180924
    },
    {
      "title": "Very comfortable",
      "text": "I’ve only had time to load this and take it on one short hike (too short for a pack this size really) but I can confidently say it’s the most comfortable pack I’ve every put on. I’m looking forward to using it for longer trips",
      "rating": 5.0,
      "verified": true,
      "author": "Wm B",
      "helpful_votes": 0,
      "publication_date": 20200316
    },
    {
      "title": "Great Pack.",
      "text": "Excellent day pack good quality. The only reason that I did not give it a 5 star ratingis because the water bottle carrier is too hard to reach. The bottle carrier needs to be on the side of the belt for easy reach. I did modify the belt to accomodate a bottle a water bottle carrier.",
      "rating": 4.0,
      "verified": true,
      "author": "BLDG Images",
      "helpful_votes": 2,
      "publication_date": 20170721
    },
    {
      "title": "excellent pack Bought same at r",
      "text": "excellent pack Bought same at r.e.i they charged over 100$ more for exact same pack returned and got this one from amazon tons of room for gear for longer camping trips. Very comfortable support system however the pack is big and bulky probably wouldn't ttake it on shorter camping trips",
      "rating": 4.0,
      "verified": true,
      "author": "cory",
      "helpful_votes": 0,
      "publication_date": 20160914
    },
    {
      "title": "Comfortable",
      "text": "I tried the Osprey but just couldn’t get it to fit and feel right. This pack was a better fit and more comfortable.",
      "rating": 4.0,
      "verified": true,
      "author": "gavannb1",
      "helpful_votes": 0,
      "publication_date": 20181016
    },
    {
      "title": "its super comfortable on him",
      "text": "Bought this for my boyfriend as a christmas present. We have since been on about 11 hikes between 5-10 miles, and he loves this bag! You can fit so much in it, its super comfortable on him, and is an over all awesome pack.",
      "rating": 5.0,
      "verified": true,
      "author": "Jamie",
      "helpful_votes": 0,
      "publication_date": 20180427
    },
    {
      "title": "Best pack I’ve ever had",
      "text": "I’m usually not the type to leave a review unless the product has a major flaw. This is the exception. Taken this to the boundary waters and a few smaller trips and it’s held up amazingly. The features make this pack super comfortable, and the day pack inside is just a bonus. Would HIGHLY recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Tanner",
      "helpful_votes": 0,
      "publication_date": 20181018
    },
    {
      "title": "Best Pack I have ever used",
      "text": "The best pack I have ever worn. Hugs my body perfectly. I didn’t feel it at all when hiking up ridgline’s here in Montana at all. Honestly feels amazing.",
      "rating": 5.0,
      "verified": true,
      "author": "Dave B.",
      "helpful_votes": 0,
      "publication_date": 20180805
    },
    {
      "title": "Great pack",
      "text": "Great pack! Got it loaded with about 45lbs.it carries like 25/30.very comfortably I love it. It no longer has the side pockets that I've seen in all the videos. Holds all i need anyway.",
      "rating": 5.0,
      "verified": true,
      "author": "Bret",
      "helpful_votes": 0,
      "publication_date": 20161108
    },
    {
      "title": "Fantastic",
      "text": "This is a fantastic backpack for backpacking. Tons of space, super adjustable, very comfortable, and really durable. Great all-round bag.",
      "rating": 5.0,
      "verified": true,
      "author": "Ben Fisher",
      "helpful_votes": 0,
      "publication_date": 20200716
    },
    {
      "title": "It’s nice and strong with a very well designed suspension system ...",
      "text": "It’s nice and strong with a very well designed suspension system and lumbar support. It’s a little bit heavy, however in my opinion the only downside is that the pockets on the lumbar strap is too small for phone.",
      "rating": 4.0,
      "verified": true,
      "author": "Alireza",
      "helpful_votes": 2,
      "publication_date": 20180123
    },
    {
      "title": "Good pack",
      "text": "Great pack but mine had a slight design flaw where one of the shoulder strap pivots stuck past the hip belt and pointed mutt back. Stuffed small piece of foam around it and alleviated issue",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200224
    },
    {
      "title": "Great pack!",
      "text": "I used this pack for a 3-night trip in the Catskills. No complaints at all. Great pack!",
      "rating": 4.0,
      "verified": true,
      "author": "michael",
      "helpful_votes": 0,
      "publication_date": 20200927
    },
    {
      "title": "Best pack I ever had.",
      "text": "Love this to pieces. I have walked over 100 miles in it and just can't say enough good about it.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Schmidt",
      "helpful_votes": 2,
      "publication_date": 20170904
    },
    {
      "title": "Five Stars",
      "text": "Worked great. Much better than the external frame older backpack my husband had been using. Much lighter.",
      "rating": 5.0,
      "verified": true,
      "author": "MamaWingReads",
      "helpful_votes": 0,
      "publication_date": 20170505
    },
    {
      "title": "Good bag for an extreme good price",
      "text": "I took this bag on through hikes plenty a room that’s everything you need and if you adjust it right it’s very comfortable",
      "rating": 5.0,
      "verified": true,
      "author": "Matt",
      "helpful_votes": 0,
      "publication_date": 20200219
    },
    {
      "title": "I enjoy it",
      "text": "Great deal. For a great bag. Comfy.. loaded 60 lbs easily and didn't feel it even after hours and miles of use.",
      "rating": 5.0,
      "verified": true,
      "author": "Bernie Martinez",
      "helpful_votes": 0,
      "publication_date": 20180605
    },
    {
      "title": "Excellent backpack. I really do not see myself every ...",
      "text": "Excellent backpack. I really do not see myself every having to get another pack. Went Gregory over Osprey as this pack handles heavier loads better.",
      "rating": 5.0,
      "verified": true,
      "author": "Porch Song",
      "helpful_votes": 0,
      "publication_date": 20171120
    },
    {
      "title": "just a great comfy backpack.",
      "text": "All expectations met,its Gregory quality all over. The full lenght u shaped zipper allows you to access your stuff just like if it were a travel suitcase,brilliant!.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20161010
    },
    {
      "title": "and I LOVE it can not be more satisfied with it",
      "text": "My very 1st. pack, and I LOVE it can not be more satisfied with it. This thing will fit a little over 65 pounds no doubt. Plus it feels great on your back when you have it at its max, very comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160817
    },
    {
      "title": "Five Stars",
      "text": "Great bad a little heavy but made from good materials",
      "rating": 5.0,
      "verified": true,
      "author": "Sagi",
      "helpful_votes": 0,
      "publication_date": 20180131
    },
    {
      "title": "Love this pack.",
      "text": "Amazing pack. So comfortable it feels like you're hardly wearing a pack. Plenty of storage and easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "David Grubbs",
      "helpful_votes": 0,
      "publication_date": 20170102
    },
    {
      "title": "Excellent quality of building materials",
      "text": "Excellent quality of building materials. Good support in the back and very good subjection in the waist. Just as observation the handles of the waist are a little bulky, prevent good movement.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170305
    },
    {
      "title": "Great backpack!",
      "text": "It's just what my grandson wanted for Christmas ! He loves it!",
      "rating": 5.0,
      "verified": true,
      "author": "Jan V",
      "helpful_votes": 0,
      "publication_date": 20170210
    },
    {
      "title": "But just because it can make 40-50 lbs feel like 20-30 lbs doesn't mean you should load it up ...",
      "text": "This pack is a beast. All the comfort and features you could ever want from a backpack. But just because it can make 40-50 lbs feel like 20-30 lbs doesn't mean you should load it up with that much weight. Love this sack !",
      "rating": 5.0,
      "verified": true,
      "author": "JBinNV",
      "helpful_votes": 0,
      "publication_date": 20170906
    },
    {
      "title": "Make great packs",
      "text": "Bought as a Christmas gift. Going by life history with Gregory packs..",
      "rating": 5.0,
      "verified": true,
      "author": "John C Lambert",
      "helpful_votes": 0,
      "publication_date": 20191101
    }
  ],
  "product_meta": {
    "title": "Gregory Baltoro 65L Pack - Men's",
    "description": "FEATURES of the Gregory Men's Baltoro 65L Pack Weathershield pocket Raincover integration Sidewinder bottle holster Shock locks removable shock cord ice axe/trekking pole retainers U-zip access top-loading design with a front U-zip panel that opens from top to bottom for rapid access to main body contents Sleeping bag compartment external access with removable internal divider Double Barrel dual-sided lid compartments with internal divider for increased on-trail organization Stretch Mesh water bottle/trail stash pocket Multi Straps removable via girth-hitch, adjustable straps",
    "rating": 4.8,
    "feature_bullets": [
      "630D High-Density Nylon (Base) 200D Polyester (Lining)",
      "Polyester and Nylon lining",
      "Drawstring and Buckle closure",
      "16\" shoulder drop",
      "VENTED, FORMED BACK PANEL & LUMBARTUNE REMOVABLE INSERT: Vented, formed back panel features LifeSpan foam & silicone lumbar grip zone. LumbarTune removable 10mm insert offers user-customizable contouring for a precise backpanel fit.",
      "PRE-CURVED FOAM COMPONENTS & FREE DAYPACK INCLUDED: QuickSwap 3D interchangeable pre-curved LifeSpan EVA foam harness & hipbelt in multiple sizes to precisely fit each body. SideKick ultra-light, removable daypack doubles as hanging reservoir sleeve.",
      "FREE RAINCOVER & TOP-LOADING DESIGN: Included removable raincover stowes in its own zippered pocket. Top-loading design with front U-zip panel access.",
      "AMPLE STORAGE TO ORGANIZE YOUR TRIP: Double Barrel lid design with dual zippered pockets on top and security pocket underneath. SideWinder stowable ergonomic bottle holster.",
      "IDEAL USES: Backpacking, Camping, Hiking, International Travel, Adventure Travel, Trekking, Through Hiking - WEIGHT: 5.5 lbs - DIMENSIONS: 25.2\" x 15.0\" x 9.5\""
    ],
    "categories": [
      "Outdoor Recreation",
      "Internal Frame Backpacks",
      "Sports & Outdoors",
      "Backpacking Packs",
      "Backpacks, Bags & Accessories",
      "Camping & Hiking"
    ],
    "price": 194.95,
    "specifications": {}
  }
}