{
  "website_summaries": [
    {
      "verdict": "A reliable glucometer with all the necessary components. The top deal on the market.",
      "pros": [
        "Fast, fairly accurate readings, vivid screen, compact design",
        "Value price",
        "A comprehensive starter kit that includes all you need to get started, including 100 strips and lancets"
      ],
      "cons": [
        "A few inaccuracies have been reported",
        "Slightly more confusing than some other models to use"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Not accurate",
      "text": "This monitor does not accurately measure blood sugar. Every reading comes back higher. Took to my doctors office and it read higher by 50.",
      "rating": 1.0,
      "verified": true,
      "author": "amy fletcher",
      "helpful_votes": 71,
      "publication_date": 20180225
    },
    {
      "title": "like this one better than the smaller one they sent ...",
      "text": "I bought this meter until my insurance sent me the one they would pay for. I, actually, like this one better than the smaller one they sent that requires less blood. I, still, have to prick my finger, and, still, get the same amount of blood, so that is not a factor, for me. I like this meter better, because it is just a bit bigger, therefore, easier to handle. The smaller meter has very thin test strips, which makes it harder to get them out of the bottle. At least, for me. The carrying pouch for both is the same size.",
      "rating": 5.0,
      "verified": true,
      "author": "Marylou M.",
      "helpful_votes": 52,
      "publication_date": 20180201
    },
    {
      "title": "Did Not Work",
      "text": "I have used 4 or 5 meters. I know how this works. The meter worked when the strip was inserted. The strip used was from the box and was inserted correctly. However, I tried 4 times using four strips and poking four times and the meter went blank every time. It did not work. Returning",
      "rating": 1.0,
      "verified": true,
      "author": "Barbara E",
      "helpful_votes": 41,
      "publication_date": 20181028
    },
    {
      "title": "No “Bayer” branding.",
      "text": "I received this kit, and there’s not one “Bayer” branding on it. I’m doubtful about it.",
      "rating": 1.0,
      "verified": true,
      "author": "Hatem Eldoronki",
      "helpful_votes": 48,
      "publication_date": 20180305
    },
    {
      "title": "What a disappointment",
      "text": "Just received the meter. Cons: 1) you have to take a test strip out of the container and insert it. High probability of contamination if the sensor is touched. 2) the control test tests higher than the acceptable range - brand new! 3) blood test was 9 points higher than my other meter. Overall It just feels like a piece of garbage - cheap - and with it unable to calibrate, it is useless for tracking blood glucose. I'll be returning it.",
      "rating": 1.0,
      "verified": true,
      "author": "Dave Butler",
      "helpful_votes": 32,
      "publication_date": 20181211
    },
    {
      "title": "Higher quality than the other three brands I've used over the past few years.",
      "text": "Came with plenty of test strips. I'm not diabetic, but am taking prednisone for an auto-immune disease and like to keep track of my blood sugar every morning before I eat. Having had several brands of glucose monitors over the past four years, this kit seems to be of better quality. It even comes with 'calibration' test liquid to check that the strips and meter are accurate (that the strips haven't 'gone over' due to age or heat). Very simple to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Frank R. Nichols",
      "helpful_votes": 52,
      "publication_date": 20170216
    },
    {
      "title": "Good But Over Priced",
      "text": "I brought this for parents who have high diabetes and need to see blood glucose every day three times. We are using this from last 2 month and this guy doing the job nicely. But, after my purchase, I saw there is much more nice product below the price. Pricewise this is unaffordable for every family. Please watch out other product for less price. My 4 star for product quality. It is easy to use and read. My parents they are over 65 and hight pressure patent but they used this product themselves without any help. Quality-wise good, pricewise not good.",
      "rating": 4.0,
      "verified": true,
      "author": "Shiva Hari",
      "helpful_votes": 12,
      "publication_date": 20190831
    },
    {
      "title": "Very dangerous and i would not recommend this product to anyone",
      "text": "I must have received a faulty meter. This reads 20-30 points higher than 3 other meters i have tested. Very dangerous and i would not recommend this product to anyone.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 24,
      "publication_date": 20180510
    },
    {
      "title": "Won’t Calibrate - Persistent E3 Error",
      "text": "Tried to calibrate but kept getting E3 message. After about 15 strips, gave up on this meter and bought another one at local Walgreens.",
      "rating": 1.0,
      "verified": true,
      "author": "Jawwad Lateef",
      "helpful_votes": 19,
      "publication_date": 20180717
    },
    {
      "title": "Product stopped working after 3 times usages.",
      "text": "This product worked 3 times. Then it gave me error code: E3 the next 5 times I tried it. I even took the batteries out and reinstalled but this did not make a difference. it’s too late to return it. I am going to call the manufacturer tomorrow and i’ll Let you all know what happens.",
      "rating": 1.0,
      "verified": true,
      "author": "M. Harmon",
      "helpful_votes": 15,
      "publication_date": 20180916
    },
    {
      "title": "Wrong sized lancets and dead batteries",
      "text": "Wrong size lancets. The needles are way too small for the device they are meant to be used with. I had read this in another review before ordering, you would think that this would have been corrected by now. Also arrived with dead batteries. I like the meter. The jury is still out on the accuracy. Probably would not buy again. I resent that I had read these same issues from other reviews and that no action has been taken to correct them.",
      "rating": 2.0,
      "verified": true,
      "author": "beau",
      "helpful_votes": 20,
      "publication_date": 20170312
    },
    {
      "title": "Not accurate and not authentic ? No bayer symbol",
      "text": "As you can see from the pictures are two vastly different glucose readings. I’ve either been getting error readings(after multiply pricks) or very high/low readings..... the glucose monitor without the bayer logo I received from the OTC seller and the one with the bayer logo was from another amazon seller which look different from each other even though it’s the same model, I’m questioning if one of the monitors is fake",
      "rating": 1.0,
      "verified": true,
      "author": "jennifer",
      "helpful_votes": 12,
      "publication_date": 20190420
    },
    {
      "title": "Contour NEXT EZ Diabetes Testing Kit, full kit.",
      "text": "I ordered this kit because it contains everything you need to get started. If you are unfamiliar with the mechanics of blood glucose testing, this kit contains everything you need and full instructions. It was more expensive than going to the pharmacy for a meter BUT way less expensive than buying lancets, a meter, strips, and most important: calibration solution to check the accuracy of your meter reading. NOTE: Wash your hands before you wipe with an alcohol wipe and after you obtain a blood sample.",
      "rating": 5.0,
      "verified": true,
      "author": "Alpacamade",
      "helpful_votes": 5,
      "publication_date": 20200419
    },
    {
      "title": "Great Meter, Lousy Lancets",
      "text": "Pleased with accuracy of the meter. We were using the Bayer's Contour Blood Glucose Monitoring System and found it wasn't accurate at all. That being said, these lancets are HORRIBLE! (The reason for the 4 stars instead of the 5.) The needle isn't lined up and seems to be \"short\". These are MUCH better:",
      "rating": 4.0,
      "verified": true,
      "author": "CRG",
      "helpful_votes": 17,
      "publication_date": 20160815
    },
    {
      "title": "More accurate than my TRUEtrack",
      "text": "I've been using a TRUEtrack meter for years. This last lab test the TRUEtrack showed 86, the lab test 105. I tested the TRUEtrack with the test fluid and it returned a normal range result. I read the reviews on Amazon and CR and decided to purchase the Contour NEXT. The difference in readings between the TRUEtrack and Contour were 20 points, the Contour being 20 points higher. I will continue to double-test and report the results here. Simply said, the TRUE track gave me a false sense of security whereas the Contour has forced me to reevaluate my diet and exercise habits.",
      "rating": 5.0,
      "verified": true,
      "author": "Sunshine",
      "helpful_votes": 5,
      "publication_date": 20181016
    },
    {
      "title": "Possibly more accurate!",
      "text": "This meter kit provides a standard solution to check that your meter is working correctly. The test strips have a standard 2 level between 111-138 mg/dl, a difference of 27 mg/dl. Another popular brand, which doesn't provide a testing solution has test strips that measure between (level 2): 206-279, a difference of 73 mg/dl. If you are trying to keep track of insulin resistance then this meter may be the better choice. You need a standard testing solution to make sure your meter is reading correctly! Would like blue tooth connectivity.",
      "rating": 4.0,
      "verified": true,
      "author": "PHOTOMAN225",
      "helpful_votes": 3,
      "publication_date": 20190426
    },
    {
      "title": "Easy and Accurate",
      "text": "I used it to verify if I had pre-diabetes and I'm so happy to say I'm normal. I bought one for my brother and gave mine to my sister in law. I cannot think of an easier way to test blood sugars but I'm an armature so I think that means its easy. I would do it right when I woke up, took a few minutes and I wrote it in the book. I would recommend it to anyone and everyone",
      "rating": 5.0,
      "verified": true,
      "author": "nickmarine",
      "helpful_votes": 9,
      "publication_date": 20170414
    },
    {
      "title": "Terrible design of the Lancets and Lancing Device",
      "text": "Terrible design of the Lancets and Lancing Device. I used the deepest level but nearly got any blood after each try.",
      "rating": 1.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 18,
      "publication_date": 20170226
    },
    {
      "title": "poorly constructed",
      "text": "This kit is very hard to use. The lancets do not provide a blood drop, the test strips are fragile and the lancing device is difficult to use. I used 6 lancets and test strips but was unable to get a blood sample.",
      "rating": 1.0,
      "verified": true,
      "author": "cindy",
      "helpful_votes": 7,
      "publication_date": 20181008
    },
    {
      "title": "Accurate, Complete, Easy, Economical",
      "text": "I love this device. It comes with everything you need and it's economical with Amazon Prime. I know it's accurate because my home testing matches very closely to what the tests at the doctor say.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert STLTop Contributor: Pets",
      "helpful_votes": 8,
      "publication_date": 20170330
    },
    {
      "title": "Ouch!",
      "text": "Watch out for this little freaky torture device! It’ll prick your finger and make you bleed",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 7,
      "publication_date": 20181108
    },
    {
      "title": "Not accurate.",
      "text": "Does not give accurate results. This unit reads about 20 points higher than my previous unit.",
      "rating": 1.0,
      "verified": true,
      "author": "F.R.",
      "helpful_votes": 6,
      "publication_date": 20181012
    },
    {
      "title": "Great meter, very accurate",
      "text": "Great meter, very accurate. I wear a Dexcom system. Every 12 hrs you need to do a blood check and this meter is within 5 or less less numbers of the reading on the Dexcom. Strips are cheap, easy to get and have sent to your home. Register it and you'll receive a new (and much better) case for the system.",
      "rating": 5.0,
      "verified": true,
      "author": "Larry E. Tisdale",
      "helpful_votes": 3,
      "publication_date": 20180329
    },
    {
      "title": "Great meter, terrible computer software for Mac's",
      "text": "Easy to use, seems accurate. However, if you want to use the available Glucofacts software to download your stored results on a Mac, don't bother. I spent an additional $18 for a USB cable directly from Bayer, and never got it to work. The cable drivers are only for Windows. So I love the meter, but would have probably bought one that interfaces easier with my Mac had I known it wouldn't work.",
      "rating": 4.0,
      "verified": true,
      "author": "tmc",
      "helpful_votes": 7,
      "publication_date": 20170430
    },
    {
      "title": "FSA Purchase",
      "text": "I love the lancet the way it ejects the needle. I can't tell how many times I have pricked myself. I wanted an extra set for the office. I had a crash and wasn't prepared. I 7just discover I can use my fsa card.on Amazon. I was disappointed that there are items that qualify on sites designated to fsa, but you can't use your card on certain Amazon vender carrying the same items for better price. You end up paying more for the same thing.",
      "rating": 5.0,
      "verified": true,
      "author": "PW",
      "helpful_votes": 0,
      "publication_date": 20200309
    },
    {
      "title": "Good product",
      "text": "Works well. I like that it comes with a coding solution to make sure that the reading is accurate. I tested twice one morning, got 102 then 107. Compared with the one from CVS it read 102. The one from walgreen's read 130. Since I've got all three, I line them up and use them all to compare. So far, the one from CVS has been very close to the Bayer tester.",
      "rating": 4.0,
      "verified": true,
      "author": "her",
      "helpful_votes": 5,
      "publication_date": 20170805
    },
    {
      "title": "It's almost TOO easy to use!",
      "text": "Easy to use and dead-on accurate. It takes such a tiny drop of blood to do the test that I hardly have to prick my skin. A week of testing 3+ times a day and I can't even tell you where I've poked myself.",
      "rating": 5.0,
      "verified": true,
      "author": "Autumn Hills",
      "helpful_votes": 5,
      "publication_date": 20170213
    },
    {
      "title": "Works perfectly. It is consistently high compared to the ...",
      "text": "Works perfectly. It is consistently high compared to the fasting reading taken later at the dr. office. Manufacturer's recommendation was to buy the test strips from the pharmacy instead, because those are kept in a controlled environment.",
      "rating": 5.0,
      "verified": true,
      "author": "W. R. Rhodes",
      "helpful_votes": 4,
      "publication_date": 20170904
    },
    {
      "title": "Consistant readings",
      "text": "Other meters I have tried proved inconsistent. This meter however always test within 2-3 points if I retest immediately. Refill strips are less expensive than other brands at this time.",
      "rating": 5.0,
      "verified": true,
      "author": "EMP",
      "helpful_votes": 5,
      "publication_date": 20170915
    },
    {
      "title": "BUYER'S BEWARE LANCING DEVICE",
      "text": "The LANCING DEVICE shown in the pictures & video isn't the one you will receive. The machine is great but lacing device is big disappointment..flimsy..cheap.",
      "rating": 3.0,
      "verified": true,
      "author": "Tammy Ricmond",
      "helpful_votes": 3,
      "publication_date": 20190914
    },
    {
      "title": "Hard to change things on the screen and not much of a case.",
      "text": "I bought this because of all the good reviews but I found it to be less than I expected. First, the case isn't much of a case. Larger than it needed to be because you have to stuff everything into two pockets on each side and only one with a zipper - no elastic bands to hold the meter, the test strips or the lancet. I tried to set the date and time and the buttons were really hard to use. I had to push repeatedly - harder each time to get them to make changes to the screen. I gave up and tossed it all back in the box to be returned.",
      "rating": 2.0,
      "verified": true,
      "author": "MaryB",
      "helpful_votes": 3,
      "publication_date": 20161011
    },
    {
      "title": "Purchased due to accuracy rating",
      "text": "The carrying case isn't as nice as my two former kits (different brands), but my main reason for purchase was the very high accuracy rating. Just received and started using recently but so far so good! The directions are very detailed and everything is easy to use.",
      "rating": 4.0,
      "verified": true,
      "author": "SandyG",
      "helpful_votes": 2,
      "publication_date": 20180806
    },
    {
      "title": "So far so good",
      "text": "Its quite accurate. 2 days ago i used it while i was waiting for cbc results and marked 95 before eating. An some time passed and the nurse came with the results and said my BG was at 98. A backlight wouldn't be bad, but then again... you shouldn't be using needles and such in the dark.",
      "rating": 5.0,
      "verified": true,
      "author": "Christian Martinez",
      "helpful_votes": 3,
      "publication_date": 20180518
    },
    {
      "title": "Easy to use and accurate.",
      "text": "I'm very happy I went with the Contour meter and Bayer test strips. It is very easy to use and I've found it to be dependable readings. If you are newly diagnosed with Type 2 Diabetes as I was, I highly recommend this meter and strips.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Ring",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "An inspiration to cut down on sugar",
      "text": "Once you read the instructions, it's actually very easy to take your blood glucose measurement. I don't have diabetes but my doctor said I might be pre-diabetic so I thought it would be useful to take some readings of my fasting and post-prandial (after meal) sugar levels. So far they seem to be a little higher, but not in diabetic range. In a way, this tool is acting as an inspiration to cut down on sugar to keep my levels in line and reduce the chances of diabetes later. Comes with everything you need to do like 100 tests.",
      "rating": 5.0,
      "verified": true,
      "author": "Steven Gorman",
      "helpful_votes": 13,
      "publication_date": 20160321
    },
    {
      "title": "Relatively simple to use, accurate and easy to tote",
      "text": "It’s relatively easy to use, and once you have the process down, the pinpricks are barely painful and the finger feels completely normal 10 minutes later. We purchased this to do fasting blood sugar levels on occasion, to help monitor possibly prediabetic health.",
      "rating": 5.0,
      "verified": true,
      "author": "TiffanyTop Contributor: Makeup",
      "helpful_votes": 0,
      "publication_date": 20190819
    },
    {
      "title": "Just the perfect tester for my hubby.:)",
      "text": "I am so happy with this tester. My husband uses this everyday & works perfectly. Seller shipped right away & we just cannot say enough about this tester.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary A. Mount",
      "helpful_votes": 2,
      "publication_date": 20171205
    },
    {
      "title": "Dropping rating (for now)",
      "text": "Initially I gave this kit a great rating..but now after just 7 days of use, i notice a crack in the lancet device (pic attached) The unit still works (for now) but I need a replacement. Please advice",
      "rating": 3.0,
      "verified": true,
      "author": "J. Stewart",
      "helpful_votes": 2,
      "publication_date": 20190414
    },
    {
      "title": "test meter",
      "text": "worked as designed. I grew concerned with the results from another product and lost confidence in the validity of the numbers. Also learned a lesson about test strip expiration in the process .",
      "rating": 4.0,
      "verified": true,
      "author": "JoeAverage-User",
      "helpful_votes": 0,
      "publication_date": 20200528
    },
    {
      "title": "Great Testing Starter Kit",
      "text": "This diabetic testing starter kit is very easy to use. I first read the instructions and start using it right away. The device is very light. The more I used it, I got better at getting the blood drop onto the testing strip. Overall, I am happy with this device.",
      "rating": 5.0,
      "verified": true,
      "author": "Henry Adam",
      "helpful_votes": 2,
      "publication_date": 20171001
    },
    {
      "title": "Five Stars",
      "text": "I use this to test my sugar in the morning. I say it's accurate within +/- 10 points.",
      "rating": 5.0,
      "verified": true,
      "author": "stcruz",
      "helpful_votes": 3,
      "publication_date": 20171127
    },
    {
      "title": "Ok, so who is kidding who????",
      "text": "Now you will get the real reading on the spot. I bought it because I just learned I have Diabetes and wanted to stay on top of it. You can't lie to this thing..... It's fast and easy to use and if you are in doubt you can recalibrate it in seconds.",
      "rating": 5.0,
      "verified": true,
      "author": "Casinobill",
      "helpful_votes": 0,
      "publication_date": 20190821
    },
    {
      "title": "Great! Just one minor detail.",
      "text": "I love this meter except for a minor detail. Where you adjust the meter to the dept of puncture the 'drop' symbols are vertically invisible. I had to paint a line line on the lancing unit to define where I wanted the puncture depth. Other than that, I found it easy to figure out and user friendly.",
      "rating": 4.0,
      "verified": true,
      "author": "Laura ",
      "helpful_votes": 2,
      "publication_date": 20170803
    },
    {
      "title": "Don't bother with this one",
      "text": "After poking my finger 5 times and after using 5 test strips only to get the same error message, I gave up. This thing is truly a POS.",
      "rating": 1.0,
      "verified": true,
      "author": "Jon E. Jenkins",
      "helpful_votes": 2,
      "publication_date": 20200310
    },
    {
      "title": "The meter and test strips are quite easy to use",
      "text": "As another or others have noted, this package includes lancets and a lancet spring device. A nurse specializing in diabetes care showed me how to insert the lancets in the spring device. In fact, it works very well when one knows how to insert the lancets.The meter and test strips are quite easy to use.",
      "rating": 4.0,
      "verified": true,
      "author": "Herr Dr. Professor",
      "helpful_votes": 3,
      "publication_date": 20170616
    },
    {
      "title": "Great for us Diabetic Folks",
      "text": "Bayer makes a good Diabetic Testing Kit. Good value for the money spent and easy to use. Recommended and fast shipping from Seller.",
      "rating": 5.0,
      "verified": true,
      "author": "keith e.",
      "helpful_votes": 0,
      "publication_date": 20190725
    },
    {
      "title": "Everything is there.  Just like it says.",
      "text": "Everything is great. It says 100 lancets and test strips, that's what you get. *** NOTE*** The box of lancets has a \"30\" on it. That's the gage of the needle. On the box in smaller type it says \"100 lancets\". So you will get 100 Device works. The lancet depth adjustment isn't perfect but works fine. It does adjust easily. I'll keep using this for as long as I need. No reason to look elsewhere or pay more.",
      "rating": 5.0,
      "verified": true,
      "author": "J Macks",
      "helpful_votes": 0,
      "publication_date": 20170225
    },
    {
      "title": "Accuracy was excellent and easy to use and strips are half price of old ones.",
      "text": "Old meter seemed to high to match glucose readings from lab so I ordered the Contour, easy to use and got very close readings to those of lab.",
      "rating": 5.0,
      "verified": true,
      "author": "L. Davis",
      "helpful_votes": 0,
      "publication_date": 20190831
    },
    {
      "title": "Well worth the money!",
      "text": "I was really happy to receive the Contour Next EZ kit. The price was great with everything that was included. The only thing I would change is the travel case. It is TERRIBLE! The meter and lancet can fall right out when the case is unzipped. I put the lancets and strips in the zippered inside pocket, but everything just does not fit well. No real protection. Thanks so much!",
      "rating": 4.0,
      "verified": true,
      "author": "Ruth Ann House",
      "helpful_votes": 0,
      "publication_date": 20190224
    },
    {
      "title": "Contour Next",
      "text": "the accuracy is not perfect, the control solution gives wrong numbers",
      "rating": 4.0,
      "verified": true,
      "author": "Mario Galotti",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Good Value",
      "text": "I bought this device because Diabetes runs in my family and I want to keep an eye on my blood sugar for the sake of safety. It's a great option for someone like me. Pros: Good value Ease of use Everything you need to get started Minimal pain with included lancing device (mine came with a Bayer rather than what's pictured, it works fine) Cons: From what I've read the Bayer Contour isn't the most accurate reader on the market. It seems to be doing an OK job for me so far though. Plus at this price point you can't really complain.",
      "rating": 5.0,
      "verified": true,
      "author": "Richy C",
      "helpful_votes": 0,
      "publication_date": 20150312
    },
    {
      "title": "All included to start monitoring",
      "text": "Has everything a beginner needs. Easy to follow instructions. Lancet device is much less painful than lancets healthcare providers use. No finger soreness afterward. Negative: The batteries arrived low. Manufacturer should have put a tab on them so they'd arrive fully charged.",
      "rating": 5.0,
      "verified": true,
      "author": "Happy Traveler ",
      "helpful_votes": 0,
      "publication_date": 20171008
    },
    {
      "title": "Good and innexpensive",
      "text": "I only need an occasional test to calibrate my CGM and this does the job nicely. I’d give it five stars if the case provided with it were better thought out. With a vial I’d test strips, a lancer, lancets, alchohol wipes etc the case becomes quite bulky because things overlap. Otherwise it’s a good meter.",
      "rating": 4.0,
      "verified": true,
      "author": "Robert J. Armijo",
      "helpful_votes": 0,
      "publication_date": 20190327
    },
    {
      "title": "Great meter",
      "text": "After reading online about which is the best meter to use, this unit was at the top of the list. This unit is great, no need for coding and accurate measurements.",
      "rating": 5.0,
      "verified": true,
      "author": "R Hilgers",
      "helpful_votes": 0,
      "publication_date": 20190211
    },
    {
      "title": "Just what I wanted",
      "text": "This testing kit was everything and more. It was easy to use and I didn't feel intimidated at all. It makes it so easy to test my husband's blood sugar. I'm glad I ordered it and will return for more testing supplies when needed.",
      "rating": 5.0,
      "verified": true,
      "author": "Wanda Miller",
      "helpful_votes": 0,
      "publication_date": 20190517
    },
    {
      "title": "inaccurate compared to labwork",
      "text": "it was 20 points higher than my actual lab work. what use is it to me then? returning it.",
      "rating": 1.0,
      "verified": true,
      "author": "Yvonne",
      "helpful_votes": 0,
      "publication_date": 20200221
    },
    {
      "title": "Disappointed",
      "text": "Very disappointed. Highly inaccurate as calibrated against my other machines and lab results.",
      "rating": 1.0,
      "verified": true,
      "author": "M S SIDDIQUI CFA",
      "helpful_votes": 0,
      "publication_date": 20191114
    },
    {
      "title": "Better than an apple a day",
      "text": "In the not-too-distant past, this device would have cost several hundred dollars, but now it's priced so low (I got mine for $36) that it's affordable even for preventive purposes (Is my blood sugar getting too high?). The instructions are clear and operation is simplicity itself. It was shipped promptly, came with 100 lancets and test strips plus a zipper carrying case, and its readings agree with my most recent blood panel. I'm delighted with it and wish I had bought it sooner.",
      "rating": 5.0,
      "verified": true,
      "author": "Van W. Wolverton",
      "helpful_votes": 0,
      "publication_date": 20160604
    },
    {
      "title": "I think this is a good deal....and it works perfectly for what I wanted.",
      "text": "Great price for what is included. It's accurate enough for my needs and has a lot of settings that will track and keep data so I can run and analyse numbers, compare with what I am eating and drinking, and see what helps me and what doesn't. I am not diabetic but I am pre-diabetic, so I am keen to make sure I manage my diet well. I do for the most part, but lately have had some headaches and grogginess that I am not sure what is causing. Wanting to make sure it is not a blood sugar issue, I can rule that out by using this gadget.",
      "rating": 4.0,
      "verified": true,
      "author": "Damien",
      "helpful_votes": 0,
      "publication_date": 20151010
    },
    {
      "title": "Nice meter. Accurate",
      "text": "I am very satisfied with this meter. It is my second one and it was easy to read. Not sure why they removed the light from the screen. My first one had a light",
      "rating": 5.0,
      "verified": true,
      "author": "Warren Cbon",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "Easy to use and read",
      "text": "Easy to use and read. Comes with all the necessasry supplies for initial use. Very good directions. Offers many choices for keeping track of readings and a memory for the history of readings. Comes with batteries installed and an offer for free replacement batteries.",
      "rating": 5.0,
      "verified": true,
      "author": "Steelman",
      "helpful_votes": 0,
      "publication_date": 20170927
    },
    {
      "title": "I doubt this product",
      "text": "I purchased the product about a year ago and each time it gives me different readings within 5 minutes span. I take a sample and after two minutes take another and after 3-4 minutes take another, all three are widely different.",
      "rating": 2.0,
      "verified": true,
      "author": "ahmed Elsayed",
      "helpful_votes": 0,
      "publication_date": 20200410
    },
    {
      "title": "High quality product in a neat small package",
      "text": "A great kit at a good price. Everything you need in a neat small package. Everything works great right out of the box. Control solution worked great. Very clear instructions included for everything. I highly recommend this product. The only minor negative is the batteries are a bit low right out of the box but the replacement batteries are less than $1 each.",
      "rating": 5.0,
      "verified": true,
      "author": "Prime member",
      "helpful_votes": 2,
      "publication_date": 20180302
    },
    {
      "title": "Big Fan",
      "text": "This thing is so much cheaper than OneTouch and the test strips are actually affordable! Easy to use and I like the lancets so much more than the one that came with my OneTouch. Much more comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "HamerTime",
      "helpful_votes": 0,
      "publication_date": 20190724
    },
    {
      "title": "Is helping me, but feels bad knowing that someone is making a profit with my taxes...",
      "text": "So far, very good... but I don't like knowing that this product was adquired and intended for Medicare users... not for selling it in internet!!",
      "rating": 4.0,
      "verified": true,
      "author": "MP",
      "helpful_votes": 0,
      "publication_date": 20190121
    },
    {
      "title": "Awesome Item but missing control solution in the box.",
      "text": "This is a great product but when I opened it there was no control solution as indicated. Was the manifest updated and not the description? Will update review to a 5 when and if this is rectified.",
      "rating": 1.0,
      "verified": true,
      "author": "Nathan",
      "helpful_votes": 2,
      "publication_date": 20190116
    },
    {
      "title": "My Anxiety Disappeared",
      "text": "This is a really fine product with well written and illustrated instructions that as a newbie I appreciated for sure. The finger prick to the side of my finger where there are few nerve endings was barely noticeable. A great choice!",
      "rating": 5.0,
      "verified": true,
      "author": "Rodney G. Baker",
      "helpful_votes": 0,
      "publication_date": 20180930
    },
    {
      "title": "This unit is so easy to use",
      "text": "This unit is so easy to use! Inexpensive too. The last monitor I used needed so much blood to test. I can't believe that the test strips take such a small amount of blood. I read about which was the best diabetic monitor to use. This was one monitor that was highly suggested. Now it's up to me to remember which end of the test strip goes into the monitor.",
      "rating": 5.0,
      "verified": true,
      "author": "Ricia",
      "helpful_votes": 2,
      "publication_date": 20151203
    },
    {
      "title": "It has been a month now it is working great and he is making a note of his test ...",
      "text": "I sent this to my dad in India. It has been a month now it is working great and he is making a note of his test results everyday and visited doctor and checked almost 5times and results are very accurate and device is helping a lot to check regular his blood sugar levels regularly. Thank you very much",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20170124
    },
    {
      "title": "very accurate in informal test",
      "text": "An initial test was done comparing this against the One Touch strips. In all cases the results were within +/-5 and at values over 150, they were +/- 1. Although this was not against a lab test, I would say this is very good at about 1/3 the price. A side benefit is that the strips do not stick to each other as the One Touch strips sometimes do. This makes it easier to get one out of the container.",
      "rating": 5.0,
      "verified": true,
      "author": "mhubel",
      "helpful_votes": 2,
      "publication_date": 20150223
    },
    {
      "title": "Bayer has a very good client service",
      "text": "The first one I got was not accurate (revealed by the tests with the control solution) and Bayer replaced it but I have to check the new one at the doctor because I am not sure the results are accurate. Bayer has a very good client service.",
      "rating": 3.0,
      "verified": true,
      "author": "Lucky6302",
      "helpful_votes": 2,
      "publication_date": 20161117
    },
    {
      "title": "Bayer is just quality",
      "text": "The results seem accurate. The lance has several settings. The dated test strips had one year left. Same with the glucose. Additional supplies available on Amazon and in stores. The cost for additional strips seems reasonable. Easy to use. Very pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "artmine",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "Feeling better",
      "text": "Arrived as scheduled, great product, allowed me to trend my glucose levels and with diet and exercise had back to normal levels in two weeks. Data is crucial here in that I learned when to eat, when to snack, and what is happening as a response.",
      "rating": 5.0,
      "verified": true,
      "author": "UI Vandal '92",
      "helpful_votes": 2,
      "publication_date": 20161013
    },
    {
      "title": "Works well, but...",
      "text": "This is an easy kit to use and requires very small blood sample. Only complaint is that it does not come with a case that houses the unit in a firm position inside the case as so many other manufacturers provide for their meters.",
      "rating": 4.0,
      "verified": true,
      "author": "Lyle C. Cavin, Jr.",
      "helpful_votes": 0,
      "publication_date": 20180301
    },
    {
      "title": "Works perfectly",
      "text": "My husband always had trouble with his prior test kit (Walmart’s store brand.) This one gives him accurate readings on one try.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen Bock-Losee",
      "helpful_votes": 0,
      "publication_date": 20200510
    },
    {
      "title": "Not Sure - It's Probably Just Me",
      "text": "So I'm new to this poking a hole in my own finger stuff. So maybe it was my own fault that I had to do it 5 times on 5 different fingers before getting it to bleed enough for the tester.",
      "rating": 4.0,
      "verified": true,
      "author": "DJS",
      "helpful_votes": 0,
      "publication_date": 20180522
    },
    {
      "title": "Great little testing set up",
      "text": "Easy to use, everything all in one place. Great little monitor. This set works MUCH better than my Walmart special. The lancets are 30s which gives you a little pinch not a big OW. The monitor is happy enough with less than half the sacrificial offering my last monitor demanded. I'm happy, my docs happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 2,
      "publication_date": 20151213
    },
    {
      "title": "Disappointed",
      "text": "No Bayer brand. I don’t think it’s good to measure blood sugar. It’s showing 20 to 40 difference in just seconds",
      "rating": 1.0,
      "verified": true,
      "author": "shivkumar",
      "helpful_votes": 0,
      "publication_date": 20200411
    },
    {
      "title": "Five Stars",
      "text": "Use's even less blood than my old True Test meter!!",
      "rating": 5.0,
      "verified": true,
      "author": "Bruce Jones",
      "helpful_votes": 3,
      "publication_date": 20170319
    },
    {
      "title": "Overall Good",
      "text": "Love this kit as it is easy to use and very much portable. Its more accurate than many other kits out there. But not that accurate because when I take the 2 readings at the same time they differ by 10 to 15. I am not sure which one to consider.",
      "rating": 4.0,
      "verified": true,
      "author": "Julia Jasper Singh",
      "helpful_votes": 0,
      "publication_date": 20181102
    },
    {
      "title": "Very accurate and easy to use",
      "text": "I'm kind of a health nerd, so, despite having a normal A1C, determining which foods spiked my blood sugar was fascinating to me. The pin prick is painless and the readings are quick and very accurate. My glucose reading from this meter very closely matched the one at my doctor's office. I'm very happy with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "ILoveCake",
      "helpful_votes": 0,
      "publication_date": 20200626
    },
    {
      "title": "Reliable and accurate",
      "text": "I bought this kit based on the high ratings of the Contour Next EZ. I have found it to be consistent and accurate. I recently had my fasting blood sugar taken at the lab and then right after took 3 different readings with my meter. Each reading was within 2 points of the lab result. The only way this kit could be better is if it had a little better quality case.",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth",
      "helpful_votes": 0,
      "publication_date": 20181109
    },
    {
      "title": "Easy to use......",
      "text": "This kit contains everything that one needs to test and evaluate glucose levels. Easy to use and accurate.",
      "rating": 5.0,
      "verified": true,
      "author": "LADYDI",
      "helpful_votes": 0,
      "publication_date": 20190602
    },
    {
      "title": "Love it gives me my average numbers",
      "text": "Great meter the best thing I like is it gives me my weekly averages highly recommended thx for offering...",
      "rating": 5.0,
      "verified": true,
      "author": "Tom The bomb ",
      "helpful_votes": 0,
      "publication_date": 20190309
    },
    {
      "title": "Will do in a pinch",
      "text": "It's a great starter kit but the lancet device is kind of shoddy. Also, when I got my endocrinologist to call in strip refills, this particular device wasn't covered by my insurance so I ended up having to get a new device anyways, which I liked better.",
      "rating": 3.0,
      "verified": true,
      "author": "M. B. Anderson",
      "helpful_votes": 2,
      "publication_date": 20161030
    },
    {
      "title": "Accurate and amazing orice",
      "text": "Easy to use and can’t find anything like it in stores. Amazing value and has saved me money! Accurate.",
      "rating": 5.0,
      "verified": true,
      "author": "Hiroshi Miyazawa",
      "helpful_votes": 0,
      "publication_date": 20191018
    },
    {
      "title": "Reasonable price for meter and test strips.",
      "text": "I bought the Bayer Contour next EZ and test strips plus lancets. Very reasonable price for all and very easy to use. Put strip in, meter turns on and blood drop and get the reading quick. My insurance didn't want to pay for Accu-Chek compact plus refill cartridges. The Bayer meter is fast and easy. I have Amazon Prime and all set!!!",
      "rating": 5.0,
      "verified": true,
      "author": "John J. Johnsen",
      "helpful_votes": 0,
      "publication_date": 20150909
    },
    {
      "title": "The meter is easy to use and the instructions were clear",
      "text": "The kit came complete with everything I need. The meter is easy to use and the instructions were clear. The only criticism I have is with the travel case that you put it all together in ...it is rather chintzy and you have to be careful when you open it that your stuff doesn't fly out.",
      "rating": 4.0,
      "verified": true,
      "author": "Terry Kovarik",
      "helpful_votes": 0,
      "publication_date": 20161107
    },
    {
      "title": "No solution",
      "text": "The meter was totally off and the instructions say to calibrate it, but it does not come with any calibration solution. I bought other calibration solution, which didn't work because it wasn't their brand. Of course, their brand is not available. I'm throwing it away and bought another brand, which should arrive today. Waste of time & money",
      "rating": 1.0,
      "verified": true,
      "author": "Tim Aller",
      "helpful_votes": 0,
      "publication_date": 20200521
    },
    {
      "title": "Five Stars",
      "text": "Easy to use and accurate numbers. The little booklet is the perfect size to fit into the case.",
      "rating": 5.0,
      "verified": true,
      "author": "Jacy",
      "helpful_votes": 2,
      "publication_date": 20171022
    },
    {
      "title": "Everything you need",
      "text": "My first experience with glucose monitoring. This kit contains everything needed to measure my glucose, plus periodically check meter/strip accuracy. Very easy to set up and use. Accurate, repeatable fasting glucose readings (so far), right in line with doctor's office readings.",
      "rating": 5.0,
      "verified": true,
      "author": "mark_149",
      "helpful_votes": 0,
      "publication_date": 20190209
    },
    {
      "title": "Great tool to monitor blood sugar",
      "text": "Great tool to monitor blood sugar. Easy to use, convenient and accurate in so far as I can tell.",
      "rating": 5.0,
      "verified": true,
      "author": "PhilRoe",
      "helpful_votes": 0,
      "publication_date": 20170909
    },
    {
      "title": "Contour Next has sub-standard carrying case",
      "text": "The tester works great, however the carrying case is sub-standard and does have a place that holds your kit parts in place - 1 side has a zipper but only holds so much and everything just falls out of your kit when you unzip it - I won’t buy it again",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190303
    },
    {
      "title": "Easy to use, and seems accurate.",
      "text": "I was recently diagnosed with type 2 diabetes and ordered this based on a friends recommendation. Supper easy to use and values seem pretty close to the results from bloodwork.",
      "rating": 5.0,
      "verified": true,
      "author": "Rah",
      "helpful_votes": 0,
      "publication_date": 20190112
    },
    {
      "title": "Quality product",
      "text": "Fast and secured shipping. Great product! Accurate. This will help me keep track of my blood sugar levels anytime I want.",
      "rating": 5.0,
      "verified": true,
      "author": "hawaii81",
      "helpful_votes": 0,
      "publication_date": 20190111
    },
    {
      "title": "Works well",
      "text": "So far so good. It is better than the other one I got. I’m happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Sandra from Arizona",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "Great 👍🏻",
      "text": "Nice fast and easy to use and requires less blood than the one I had!",
      "rating": 5.0,
      "verified": true,
      "author": "G. Valdez",
      "helpful_votes": 0,
      "publication_date": 20180417
    },
    {
      "title": "Great product and price",
      "text": "I have used many testing supplies before and I have found this one to be nor only a great price, much less then my co-pay if I co through my health insurance but also more supplies. The meter requires a lot less blood and I have not had to waste strips on errors. I love it and would recommend it highly. Great deal. I actually purchased more test strips and lancets because of the low price and super quick delivery.",
      "rating": 5.0,
      "verified": true,
      "author": "Frank P.",
      "helpful_votes": 0,
      "publication_date": 20150602
    },
    {
      "title": "Inaccurate readings",
      "text": "Reads consistently high by 20-25 points. I've compared my results to the accuchecks we use in the hospital and this devise is consistently high.",
      "rating": 2.0,
      "verified": true,
      "author": "John OBrien",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Good deal for glucose testing kit",
      "text": "Had kit for about 2 weeks now and it comes with everything i need. Would buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "teikiri",
      "helpful_votes": 0,
      "publication_date": 20180507
    }
  ],
  "product_meta": {
    "price": "",
    "specifications": {}
  }
}