{
  "website_summaries": [
    {
      "verdict": "Though not as innovative as it should be, the Linksys AC2400 Dual Band Wi-Fi Router E8350 is still a very good router thanks to its fast 5Ghz Wi-Fi performance and comparatively friendly pricing.",
      "pros": [
        "The Linksys AC2400 Dual Band Wi-Fi Router has the highest Wi-Fi specs and deliver very fast performance on the 5Ghz frequency band",
        "The router is less expensive than competing devices"
      ],
      "cons": [
        "The new router reuses the interface of old Linksys routers, supports guest-networking only on the 2.4Ghz band, and no in-depth settings results in slow 2.4Ghz Wi-Fi performance",
        "The Wi-Fi range is not the best on the market and the router doesn't have any status lights"
      ],
      "aspects": {
        "Setup": 6.0,
        "Features": 7.0,
        "Performance": 8.0,
        "Support": 7.0
      },
      "publication_date": 20141015,
      "rating": 7.0,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "A Lot of Money for a Headache",
      "text": "Only one dead spot in a three story house, and the unit itself is sitting inside a closet. Not too shabby. +++ Update. After a storied hassle, I had the pleasure of resetting to factory a couple months ago. And yesterday I had to do it again, but the second time the hardware got stuck in some sort of loop and never came back online. Support (foreseeable nightmare) repeatedly told me to update the firmware. Via the direct web page. Which was not online. Because. Y'know. The router was not online. See another loop here?",
      "rating": 1.0,
      "verified": true,
      "author": "eyetrieditathome",
      "helpful_votes": 0,
      "publication_date": 20150418
    },
    {
      "title": "Hugely disappointing",
      "text": "2 iPads and 2 iPhones is all it was required to service and it failed. A lot. Lots of being dropped off my wi-fi by the various devices. Returning it. Oh, the tech support number on the enclosed CD-R is scam number offering you endless awards and promotions and you'll need that support because it wasn't simple to set up. Great quality control Linksys.",
      "rating": 2.0,
      "verified": true,
      "author": "William Penname",
      "helpful_votes": 2,
      "publication_date": 20160527
    },
    {
      "title": "Garbage.",
      "text": "Garbage router. Constant dropped connections. Updated firmware, no change. Perform a factory reset, it helps for a bit, and then goes back to being garbage. Even the replacement they sent me was garbage.",
      "rating": 1.0,
      "verified": true,
      "author": "R. Tornio",
      "helpful_votes": 5,
      "publication_date": 20160207
    },
    {
      "title": "Better than average home router",
      "text": "To me, it's like most consumer grade wireless routers. It has quirks. The 5GHz channel shuts frequently and the router has to be restarted. Can not find firmware update. The speed is good.",
      "rating": 3.0,
      "verified": true,
      "author": "JLP",
      "helpful_votes": 0,
      "publication_date": 20180321
    },
    {
      "title": "Setup was very difficult. Called the support number listed ...",
      "text": "Setup was very difficult. Called the support number listed on documentation with product - it is WRONG. Support person wanted to netop into my laptop to 'change some settings to peak performance', I agreed. They came in and went to my wireless driver, showed me where I could update driver, and that was IT. GUEST NETWORK... you cannot change the name, it is your network name-guest. IT IS LIMITED TO 10 GUEST USERS! Of the 3 routers I have had in the past month, this is the ONLY one that had that limitation. Will be returning this one in exchange for a Netgear.",
      "rating": 1.0,
      "verified": true,
      "author": "Katherine Elster",
      "helpful_votes": 2,
      "publication_date": 20150514
    },
    {
      "title": "Good at first but 9 months later no good!!",
      "text": "At first it was a good router 9 months later its a pile of poop. Have to reboot it daily, wireless just drops to all devices, and when they are connected it is very slow. The wired devices are fine its just the wireless ones are the problem. Has the latest version of firmware from 10/27/15.... the last time they cared about it i guess. Do not recommend this device to anyone.",
      "rating": 1.0,
      "verified": true,
      "author": "Tman77",
      "helpful_votes": 0,
      "publication_date": 20161222
    },
    {
      "title": "Inconsistent",
      "text": "like many others beware. It is great when it works, but has many connectivity issues , some devices will have a signal when others are struggling, sometimes nothing works. I admit I had it for many years but managed to tweak it when it had it's moments. Now my daughter homework needs a reliable internet and router. I'm retiring it. Will buy a TP link series c 2300 based on professional reviews and good amazon ratings.",
      "rating": 3.0,
      "verified": true,
      "author": "amrsam",
      "helpful_votes": 0,
      "publication_date": 20181010
    },
    {
      "title": "May have to call Support Do Not Call Using 877 Dial 800 and the numbers that follow",
      "text": "Had to call Support to get it up and working, They have new software you can use to install I'm guessing the CD has flaws. Ended up setting it up manually with Support now it's working so far so good. FYI the PHONE NUMBER ON THE BACK OF THE INSTALL CD DO NOT USE THE 877 use 800+ the numbers after it those are correct The 877# all you get is a bunch of advertising BS one after the other Other wise I'd give it 4 Stars",
      "rating": 3.0,
      "verified": true,
      "author": "Mike D",
      "helpful_votes": 0,
      "publication_date": 20160202
    },
    {
      "title": "Very disappointed.",
      "text": "Router was lightning fast, when it worked. Had to reset it about once an hour to use it. Would drop connection. or the internet would stop working, until a reset was performed. Tried to updating firmware as per what support told me to do, with no success. Will be switching to a new company I guess after many years of being loyal to link sys, it seems their products may have gone down hill in the last few years. Very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Blake",
      "helpful_votes": 0,
      "publication_date": 20150420
    },
    {
      "title": "Linksys wireless router",
      "text": "Had to replace my wireless router after a power surge took it out. Bought this Linksys as it was highly rated on the website I checked. It is very simple to install and gives the administrator great control over naming features and access. Works as advertised and I am very pleased with the flexibility and performance.",
      "rating": 5.0,
      "verified": true,
      "author": "Ygnacio T. Toulon",
      "helpful_votes": 2,
      "publication_date": 20150529
    },
    {
      "title": "Great router for basic setup",
      "text": "Great router for basic setup. Horrible for advanced settings. Not able to set QoS to limit bandwith to devices only low normal and high priority. USB won't notice 3.0 drives or disconnects. Wireless don't ever hit above 70Mbps from LAN-WAN. No updates to fix any known issues. DD-WRT or Tomatoe not available for this router.",
      "rating": 1.0,
      "verified": true,
      "author": "AmazonTerry",
      "helpful_votes": 2,
      "publication_date": 20151024
    },
    {
      "title": "Occasionally drops us from network",
      "text": "Works great when it works. It drops us from network occasionally and stops working occasionally needing a power reset",
      "rating": 2.0,
      "verified": true,
      "author": "Doug F.",
      "helpful_votes": 0,
      "publication_date": 20180929
    },
    {
      "title": "Don't buy this router read my and others reviews on linksys and amazon",
      "text": "Worked ok after firmware upgrade but still had to reboot to keep connections going. Now keeps disconnecting clients and i have to reboot etc. to get my tivo / neflex to work it takes numerous restarts reboot tivo and can not share wirelessly from on tivo to another trying to return to Linksys or Amazon",
      "rating": 1.0,
      "verified": true,
      "author": "Smart guy",
      "helpful_votes": 0,
      "publication_date": 20150925
    },
    {
      "title": "Disappointed",
      "text": "I've had this router for about a month and a half now. It's been frustrating as every 3-4 fans I have to restart my computer or devices to get back on line. I hesitated buying it as I've always used Apple routers and never had a problem. I won't make that mistake again as I don't have the time or patience to deal with this nonsense. You can say what you will but Apple stuff just works and they may be more expensive but truth is I'd pay twice as much to save me the pain and aggravation.",
      "rating": 1.0,
      "verified": true,
      "author": "SDL",
      "helpful_votes": 0,
      "publication_date": 20150613
    },
    {
      "title": "Inconsistent, drops out, changes bands",
      "text": "A little bit hard to set up compared to other routers, but once it was up and running it was stable for a couple of months. It has much greater range than our prior (2 generation older) Linksys router, however it routinely drops in an out -- very frustrating, cannot stream video, even just basic email can be slow because its so inconsistent.",
      "rating": 2.0,
      "verified": true,
      "author": "ES",
      "helpful_votes": 0,
      "publication_date": 20141212
    },
    {
      "title": "Not reliable. Difficult to manage.",
      "text": "I decided to give a chance to Linksys 2400 even with a lot of bad reviews, because of good price to a powerful router. But the bad reviews were correct. Even updating the software, 2400 delivers wide range wifi at a very good speed, but it is extremely unstable. Frequently became unreachable and many devices simply cannot detect it on the first connection. Also, it is not from Smart wifi range from Linksys. So, give up on the 2400. Linksysvhas better and more reliable options.",
      "rating": 2.0,
      "verified": true,
      "author": "Plinio Freitas",
      "helpful_votes": 0,
      "publication_date": 20150704
    },
    {
      "title": "Had Small Issues Then.....",
      "text": "The router malfunctioned after 5 months. I contacted support this whole week and they kept saying it was the modem and to contact my ISP (Internet Service Provider). Went and got a new modem, then I got the ISP to rewire internet connections twice. When connected to the ethernet port on my PC the internet worked fine. But when connected to the router, after a few minutes it would not have a proper link to the modem. Had better hopes for this product now just waiting on a replacement. I think I'll sell it...",
      "rating": 2.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20150801
    },
    {
      "title": "Falsly advertised speeds. NO instructions anywhere to tell you how to acheive advertised speed.",
      "text": "Falsely advertised as 600Mbps/1733Mbps. Neither figure can be reached. So far the highest speed I've been able to achieve is 433Mbps. That's with a direct line of sight 5 feet from the antennas, no other interference from competing transmissions. N600 simply can not be gotten from this Linksys transceiver even under ideal conditions.",
      "rating": 2.0,
      "verified": true,
      "author": "Notany More",
      "helpful_votes": 0,
      "publication_date": 20150504
    },
    {
      "title": "Sold a broken router",
      "text": "Bought this router because my current one was getting old. Finally it went out, no problem plugged this one up in and keep on going. Nope! It doesn't work I've tried everything. It was sold to me broken!",
      "rating": 1.0,
      "verified": true,
      "author": "lester washington",
      "helpful_votes": 0,
      "publication_date": 20180830
    },
    {
      "title": "Worked Great...for about 30 minutes.",
      "text": "Easy to setup, worked great...for about 30 minutes. Locked up, would not reset. Back to Amazon. Great for the customer service and 2nd to none return policy.",
      "rating": 2.0,
      "verified": true,
      "author": "OKC Chief",
      "helpful_votes": 0,
      "publication_date": 20150526
    },
    {
      "title": "Great investment :)",
      "text": "It's a great router. Works well and easy to install. All my devices wireless connection have improved when I installed this router. I don't know why there were so many people with negative comments. If you have problems installing this router maybe you should invest in something more easy to install and setup. But if you want great speed and a stable connection this is the router you want.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Negron",
      "helpful_votes": 0,
      "publication_date": 20150113
    },
    {
      "title": "Needs a firmware update.",
      "text": "Awesome when it works. Sucks beyond anything when it goes into endless reboot cycles. Based on some google searches this seems to happen to about 30% of this router. I'd say closer to 60% based on several friends who had the same issue.",
      "rating": 3.0,
      "verified": true,
      "author": "FaithPast",
      "helpful_votes": 0,
      "publication_date": 20141228
    },
    {
      "title": "A High Priced Disappointment!",
      "text": "I have always recommended Linksys as a brand. However, this is a LEMON - I purchased this Linksys Router 6 months ago. Very disappointed! The router constantly drops connections requiring the router to be rebooted to allow the device(s) to reconnect. This is an overpriced, poor quality router!",
      "rating": 2.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20150516
    },
    {
      "title": "This router was easy to set up",
      "text": "This router was easy to set up. I did need to download an updated firmware but had no problems doing it. From reading other reviews on this router, I would say the update is a must. I have not had any of the problems sited in earlier reviews. My covered area is much larger and much faster.",
      "rating": 5.0,
      "verified": true,
      "author": "BC",
      "helpful_votes": 0,
      "publication_date": 20150322
    },
    {
      "title": "Don't buy it.",
      "text": "This router stinks, like other reviewers I can't get stable 2.4 Ghz connections, I get constant drops. My cheapo E1500 does just as good a job with 2.4 Ghz devices as this expensive router does. And yes I am running the latest firmware. I am very disappointed as I spent $250 thinking I would get better range and stability for streaming from my tablet and/or phone. What a joke this thing is. I would give it 0 stars if I could.",
      "rating": 1.0,
      "verified": true,
      "author": "Chad M.",
      "helpful_votes": 0,
      "publication_date": 20150117
    },
    {
      "title": "best",
      "text": "went from 30MB to 90MB on this and I got the ARRIS surfboard SB6141. now Comcast is not that evil.",
      "rating": 5.0,
      "verified": true,
      "author": "Heidi",
      "helpful_votes": 0,
      "publication_date": 20151023
    },
    {
      "title": "Great router, with awesome perforance and the bells and whistles I was looking for!",
      "text": "Awesome router! Great performance, and easy to configure to your liking. The signal is powerfull throughout the house, and overall I am really happy with that router!",
      "rating": 5.0,
      "verified": true,
      "author": "Arnaud De Brux",
      "helpful_votes": 0,
      "publication_date": 20150923
    },
    {
      "title": "big home and i work good with 2",
      "text": "working will but the coverage less than with i need , big home and i work good with 2.4GHZ << i received update when i was set up the router as they say in the note \"improved stability of 2.4GHz network\"",
      "rating": 4.0,
      "verified": true,
      "author": "Abdulaziz ibrahim",
      "helpful_votes": 0,
      "publication_date": 20150413
    },
    {
      "title": "After dinner and checking again everything worked fine. Not Linksys' issue",
      "text": "Took about an hour to set up only because Win 7 kept changing the name of the network. Once I established that, I was done. Range is phenomenal in a larger hours. Other side of the house from the device through 4 walls and still downloading at 26Mbs on a 50Mbs network. Only issue I had was it took my Apple TV's a few hours to finally pick it up. Unsure why, but even after deleting the network and then putting my info in again it could \"see\" the network although I couldn't do anything. After dinner and checking again everything worked fine. Not Linksys' issue.",
      "rating": 5.0,
      "verified": true,
      "author": "klatoo",
      "helpful_votes": 2,
      "publication_date": 20150408
    },
    {
      "title": "Nice product.",
      "text": "Is all we expected. Works great. Lot more range than the Comcast/Xfinity one. Easy-to-use and setup.",
      "rating": 5.0,
      "verified": true,
      "author": "Gary R.",
      "helpful_votes": 0,
      "publication_date": 20160218
    },
    {
      "title": "Speed increase was amazing. Didn't think a router could make that much ...",
      "text": "Saw a definite increase in overall coverage area with some dead spots. Speed increase was amazing. Didn't think a router could make that much difference, but the upgrade to the new standard was really worth it.",
      "rating": 4.0,
      "verified": true,
      "author": "Patrick Meeks",
      "helpful_votes": 0,
      "publication_date": 20150525
    },
    {
      "title": "but isnt as configurable as you think it should be compared to things like DD-WRT. This is a very casual consumer product",
      "text": "Works as advertised, but isnt as configurable as you think it should be compared to things like DD-WRT. This is a very casual consumer product.",
      "rating": 4.0,
      "verified": true,
      "author": "Bryant Quan",
      "helpful_votes": 0,
      "publication_date": 20141122
    },
    {
      "title": "Makes a huge difference! We upgraded for the first ...",
      "text": "Makes a huge difference! We upgraded for the first time in 3 years! I could tell immediately and we could have more then one device on the wifi!",
      "rating": 5.0,
      "verified": true,
      "author": "Samantha Chisley",
      "helpful_votes": 0,
      "publication_date": 20160107
    },
    {
      "title": "One star",
      "text": "this router did work good for some time them stop working for good, i would not recommend it",
      "rating": 1.0,
      "verified": true,
      "author": "Jose",
      "helpful_votes": 0,
      "publication_date": 20150325
    },
    {
      "title": "Five Stars",
      "text": "great router, setup was straight forward and realitively simple through put is excellent great for gaming a videos",
      "rating": 5.0,
      "verified": true,
      "author": "Richard Davis III",
      "helpful_votes": 0,
      "publication_date": 20141230
    },
    {
      "title": "Easy setup. Provides wifi range that you could pickup ...",
      "text": "Gigabit Ethernet ports, not 100mbit. Easy setup. Provides wifi range that you could pickup from low earth orbit.",
      "rating": 5.0,
      "verified": true,
      "author": "Dana",
      "helpful_votes": 0,
      "publication_date": 20151111
    },
    {
      "title": "Well I image this router would have been great had it worked properly out of the box",
      "text": "Well I imagine this router would have been great had it worked properly out of the box. Could not get 5ghz band to function at all most likely a defective radio. Returning it and looking into something else perhaps",
      "rating": 2.0,
      "verified": true,
      "author": "Josh",
      "helpful_votes": 0,
      "publication_date": 20150713
    },
    {
      "title": "One Star",
      "text": "This product has given me nothing but trouble for the last two years.",
      "rating": 1.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 0,
      "publication_date": 20160920
    },
    {
      "title": "two smart phones, and a TIVO",
      "text": "Running two laptops, two smart phones, and a TIVO. Easy to set up. Handles the workload well. Still crashes a little too often and needs to be reset.",
      "rating": 3.0,
      "verified": true,
      "author": "zeff8159",
      "helpful_votes": 0,
      "publication_date": 20150724
    },
    {
      "title": "Four Stars",
      "text": "Easy setup and has all of the new bells and whistles.",
      "rating": 4.0,
      "verified": true,
      "author": "Micah",
      "helpful_votes": 0,
      "publication_date": 20150715
    },
    {
      "title": "Almost Worked",
      "text": "Product was unable to negotiate the internet connection with the ARRIS WBM780 cable modem using the auto configuration setting. Worked with Linksys support for 3.5 hours. They were patient, professional, and thorough. We were able to negotiate the internet connection using Static IP but the connection was lost after ~2 hours. Unfortunately, I really need a router that supports the ARRIS modem using the auto configuration settings. Thankfully, my other trusty Linksys EA4500 router still works and it is working just fine. Going to give the Linksys EA9200 a try next.",
      "rating": 2.0,
      "verified": true,
      "author": "mike gorgolinski",
      "helpful_votes": 0,
      "publication_date": 20141121
    },
    {
      "title": "Internet keeps dropping out!!!!!! UGH!!!",
      "text": "I have to return this router. We upgraded to this unit from an older Linksys model hoping for faster Netflix streaming. Well, it is faster, but the internet service connections keeps dropping out. It was getting very frustrating working and losing the internet connection in the middle of my work. I contacted my service provider multiple times to make sure that it is not the service provider. It was definitely the wireless component of the router because we had no problem with the internet when connecting to the device through a ethernet line. Sorry, need to try another one!",
      "rating": 1.0,
      "verified": true,
      "author": "J. TSUANG",
      "helpful_votes": 3,
      "publication_date": 20150623
    },
    {
      "title": "I bought it to improve the signal in my house ...",
      "text": "I bought it to improve the signal in my house and I ended up with the same signal gaps, It stated it had \"ultimate range\". I'll have to purchase a range extender and hopefully that will improve it.",
      "rating": 3.0,
      "verified": true,
      "author": "Ruben",
      "helpful_votes": 0,
      "publication_date": 20150103
    },
    {
      "title": "cannot expand w/out purchasing ddns account!",
      "text": "I did not really need a new router but this Lynksys seemed like a good price and the one I had.was a single band. I received and installed it fine with no issues, and really woke great but when I start to install may security cameras so that I could monitor them remotely from my smart phone or computer, I was not able to use my existing DDNS site. I was told I would have purchase a ddns through dindyn of another company at 70 dollars year. Sent it back an will use the one I have.",
      "rating": 1.0,
      "verified": true,
      "author": "Adrian A.",
      "helpful_votes": 4,
      "publication_date": 20150701
    },
    {
      "title": "Don't waste your money.",
      "text": "Worst router I have ever owned. The signal is inconsistent and needed to be reset ever few ours and new devices assigned. Don't waste your money.",
      "rating": 1.0,
      "verified": true,
      "author": "Annie Law",
      "helpful_votes": 0,
      "publication_date": 20150404
    },
    {
      "title": "Five Stars",
      "text": "I replaced a Linksys router that wasn't up to video streaming.I haven't had a buffer problem yet.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20150222
    },
    {
      "title": "I love the blazing speed",
      "text": "I love the blazing speed, but sadly this device does not include the Linksys smart software. Also, I found that several devices have difficulty maintaining a secure connection, specifically my TV and DVR.",
      "rating": 3.0,
      "verified": true,
      "author": "Bert A. Liverance",
      "helpful_votes": 0,
      "publication_date": 20150109
    },
    {
      "title": "... this on a mutual friends recommendation as he had great luck with it",
      "text": "Myself and a friend bought this on a mutual friends recommendation as he had great luck with it. Mine arrived DOA and his had to be returned because it kept randomly rebooting about every hour. As the friend who originally recommended this said \" just get another brand with similar specs. I had good luck with it but there is nothing particularly special about this over another brand.\"",
      "rating": 1.0,
      "verified": true,
      "author": "sirpeternincompoop",
      "helpful_votes": 0,
      "publication_date": 20141210
    },
    {
      "title": "The reviews were promising but...",
      "text": "The router that arrived was a restock (parts loose in the box, reset button had ink on it). Set up required several tries and resetting the router twice. After finally getting the set up to work the router repeatedly dropped the signal and battled with our Roku box. Finally gave up and will return it. I later learned from the Roku website that this type of router is not compatible.",
      "rating": 1.0,
      "verified": true,
      "author": "Jane Creswell, MCC",
      "helpful_votes": 0,
      "publication_date": 20141225
    },
    {
      "title": "Not Lag free.",
      "text": "Junk for a wireless router limited connection, dropped connections, Killed my download speed for both the wired and wireless even after I disabled the firewall. \"Lag free\" Caused latency issues that cold not be resolved from any host. Had to use a hard wired host to be able to change the config. every time I tried to same a change via wireless it would time out. Netfix constantly buffered, IPad would drop connection. I installed on a Thursday night it lasted 2 days. Do not buy.",
      "rating": 1.0,
      "verified": true,
      "author": "K. E",
      "helpful_votes": 2,
      "publication_date": 20150301
    },
    {
      "title": "Amazing !",
      "text": "Amazing fast and connection in the whole 2700 square feet house and even in the back yard !!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Allan Davis",
      "helpful_votes": 0,
      "publication_date": 20150517
    },
    {
      "title": "First one bricked itself, replacement unstable.  Dont waste your time!!!!!!",
      "text": "The first one I received bricked itself while trying to use the included setup CD. I spent an hour on the phone with tech support in India to confirm it was an issue with their program. Had amazon send me a replacement since the auto configure software appeared to be the problem. Configured it manually just like any other wireless router and it appeared to work fine. After about an hour it started dropping connections with my thermostat, Cameras and other devices. Android devices could find it but would not maintain a connection; iPhones never even found it. Don't buy it!",
      "rating": 1.0,
      "verified": true,
      "author": "JR",
      "helpful_votes": 0,
      "publication_date": 20150110
    },
    {
      "title": "Save your time...go with ASUS!",
      "text": "I read the reviews about this product but thought that with it being a Linksys it would work fine. I was wrong. I set it up and it seemed every hour or so I would lose connectivity and have to turn it off. I cannot believe Linksys would sell a product that does not work. They really need to relook this product. I went with ASUS and am really happy with my new router.",
      "rating": 1.0,
      "verified": true,
      "author": "Keif",
      "helpful_votes": 0,
      "publication_date": 20141224
    },
    {
      "title": "Easy basic set-up, advanced not so much",
      "text": "Tried two separate units, unable to update the firmware despite help from tech support, basic setup worked fine but was unable to get the web portal to work regardless of the browser we tried, IE, Chrome or Firefox. Needed to change the broadcast channels which can only be done via the web portal and advanced settings, due to lots of 2.4g routers in range crowding the signal.",
      "rating": 2.0,
      "verified": true,
      "author": "Louie B.",
      "helpful_votes": 0,
      "publication_date": 20141130
    },
    {
      "title": "Not the best I have used as far as range and signal ...",
      "text": "Solid router. Not the best I have used as far as range and signal quality, but a definite upgrade over the router it replaced.",
      "rating": 4.0,
      "verified": true,
      "author": "TS",
      "helpful_votes": 0,
      "publication_date": 20150729
    },
    {
      "title": "Five Stars",
      "text": "Super fast router, videos load immediately and play continuously, very happy with the product. Super easy to install.",
      "rating": 5.0,
      "verified": true,
      "author": "peggy bergstrom",
      "helpful_votes": 0,
      "publication_date": 20150131
    },
    {
      "title": "Worst router. I bought three of these",
      "text": "Worst router. I bought three of these, one for personal use, two for my business. I was able to return one without a problem. The connection dropped for all of these. The range is limited. Configuration was pretty simple, yet the router is just not good.",
      "rating": 1.0,
      "verified": true,
      "author": "Mr. Sir",
      "helpful_votes": 0,
      "publication_date": 20151116
    },
    {
      "title": "Love my new router.",
      "text": "This replaced a 5 year old Linksys/Cisco router. The old router was still working. However, this new router is much faster, and the signal is stronger. One of the laptops used to lose the signal on occasion, but not since I installed this new one.",
      "rating": 5.0,
      "verified": true,
      "author": "MagicBob",
      "helpful_votes": 0,
      "publication_date": 20160304
    },
    {
      "title": "Garbage",
      "text": "Horrible router. Shuts itself off intermittently. Would not recommend, will not buy Linksys again.",
      "rating": 1.0,
      "verified": true,
      "author": "Robert D. Akins",
      "helpful_votes": 2,
      "publication_date": 20150818
    },
    {
      "title": "Five Stars",
      "text": "Easy to set up, works great.JPG picture of my network.",
      "rating": 5.0,
      "verified": true,
      "author": "Luis B Lemos",
      "helpful_votes": 3,
      "publication_date": 20141210
    },
    {
      "title": "Don't waste your money.",
      "text": "After configuration changes over the past year; I'm throwing in the towel. The constant dropping of signal, random stoppages and packet losses have reached their limit. To the trash it goes and I don't even have a replacement yet.",
      "rating": 1.0,
      "verified": true,
      "author": "Rob Peterson",
      "helpful_votes": 0,
      "publication_date": 20160323
    },
    {
      "title": "DID NOT WORK AS DESIGNED",
      "text": "Item returned, failed to meet expectations. Constantly dropped both the 2.4 and 5.0 connections.",
      "rating": 1.0,
      "verified": true,
      "author": "D. Comer",
      "helpful_votes": 0,
      "publication_date": 20141231
    },
    {
      "title": "Three Stars",
      "text": "The most powerful and at the same time the weirdest of all in terms of behaviour",
      "rating": 3.0,
      "verified": true,
      "author": "ArthurTheElf",
      "helpful_votes": 0,
      "publication_date": 20150207
    },
    {
      "title": "Garbage in pure and simple words",
      "text": "Garbage in pure and simple words, the software is lame, the beam is weak and not worth the money you will be investing in it. I have multiple tablets connected and the routers goes off and on causing a lot of headaches for users. Who needs that? Thanks God for Amazon, it gives me the peace of mind that if crap like this does not work, I can return it and get a better router. I am thing that Asus Ac2400 is much better.",
      "rating": 1.0,
      "verified": true,
      "author": "Hanson Webb",
      "helpful_votes": 2,
      "publication_date": 20141201
    },
    {
      "title": "Extremely slow I'm very disappointed in linksys",
      "text": "Extremely slow I'm very disappointed in linksys, I have a AC1900 at my other house and though this was an upgrade not at all I'm returning it...",
      "rating": 1.0,
      "verified": true,
      "author": "Victor Machado",
      "helpful_votes": 2,
      "publication_date": 20141205
    },
    {
      "title": "100% garbage for a premium price",
      "text": "I paid $175.00 for this garbage. My wife bought a Belkin wireless router for $35. And i thought why waste your money like that. You get what you pay for, right? Wrong. You'll be sorry you bought this fn pos. No streaming/gaming ability at all. 100% garbage for a premium price.",
      "rating": 1.0,
      "verified": true,
      "author": "eric g",
      "helpful_votes": 0,
      "publication_date": 20150325
    },
    {
      "title": "Disappointed",
      "text": "Can't believe that everything this will do it doesn't work on the smart wifi app",
      "rating": 3.0,
      "verified": true,
      "author": "FFDAN",
      "helpful_votes": 0,
      "publication_date": 20151004
    },
    {
      "title": "One Star",
      "text": "Worked for 1 month with regular rebooting required. Unable to return since 1 day past allowable time.",
      "rating": 1.0,
      "verified": true,
      "author": "JGR",
      "helpful_votes": 2,
      "publication_date": 20141128
    },
    {
      "title": "I was very disappointed it did neither",
      "text": "I got this to increase my speed and distance. I was very disappointed it did neither. In fact my four year old n router is far superior and cost $120. I'm sending this back!!!!",
      "rating": 2.0,
      "verified": true,
      "author": "Gladys",
      "helpful_votes": 0,
      "publication_date": 20150120
    },
    {
      "title": "Can't hold a connection - terrible.",
      "text": "This will be a short review because the router can't hold a connection long enough to write a longer review. Just ordered a WD router to replace this router. After 10 days of trying to get it to hold a connection I've given up.",
      "rating": 1.0,
      "verified": true,
      "author": "Blaine Sundwall",
      "helpful_votes": 6,
      "publication_date": 20141125
    },
    {
      "title": "I would highly recommend for anyone looking for a great streaming router for ...",
      "text": "I would highly recommend for anyone looking for a great streaming router for movies and gaming is the best love it. !!",
      "rating": 5.0,
      "verified": true,
      "author": "michael",
      "helpful_votes": 0,
      "publication_date": 20150317
    },
    {
      "title": "this router sucks i'm not happy at all with this worst router ...",
      "text": "this router sucks i'm not happy at all with this worst router i had so far the AC band is not good disconnection on devices link speed delays on lap tops loose antennas connecters piece of garbage",
      "rating": 1.0,
      "verified": true,
      "author": "danieldulanto",
      "helpful_votes": 0,
      "publication_date": 20141231
    }
  ],
  "product_meta": {
    "title": "Linksys AC2400 4X4 Dual-Band Gigabit Wi-Fi Router, Optimal for HD Video Streaming and Lag-Free Gaming (E8350)",
    "description": "The Linksys AC2400 Dual Band Gigabit Wi-Fi Router offers the fastest Wi-Fi technology for a seamless entertainment experience. This 4x4 router is the latest in Wireless-AC, delivering four simultaneous, independent data streams to all your devices for speeds of up to 1733 Mbps. The AC2400 features a 1.4 GHz CPU, four Gigabit ports, and an eSATA port with data transfer speeds of up to 3 Gbps. It also has beamforming and is MU-MIMO ready for simultaneous streaming and gaming on multiple devices. Eliminate lag and buffering over a wider Wi-Fi range with the AC2400 and take your gaming and streaming to the next level.\n\nAMAZON.COM",
    "rating": 3.2,
    "feature_bullets": [
      "4x4 AC: 4 streams of data for stronger, faster performance. Optimal for HD video streaming and lag-free gaming",
      "MU-MIMO Ready: Latest Wireless-AC technology for simultaneous streaming and gaming to multiple devices without speed degradation",
      "Dual-Band (2.4 + 5 GHz): Double the network bandwidth for maximum speeds to gaming and streaming devices. Speeds up to N600 + AC 1733 Mbps",
      "Central Processing Unit (CPU): Supercharged 1.4GHz Dual-Core Processor for heavy-bandwidth gaming, file transfers and downloads",
      "4 Adjustable Antennas: Position antennas for a clear wireless signal in each room",
      "USB 3.0 Port: Connect external storage devices or printers and share across your network at speeds 10x faster than USB 2.0",
      "4 Gigabit Ports: 10x faster than Fast Ethernet for exceptional wired connections",
      "Advanced Security: WPA/WPA2 encryption and SPI firewall keep your network safely connected"
    ],
    "specifications": {
      "Wireless Type": "5.8 GHz Radio Frequency, 802.11a/b/g/n",
      "Number of USB 2.0 Ports": "1",
      "Brand": "Linksys",
      "Item model number": "E8350",
      "Operating System": "Windows, Mac OS",
      "Item Weight": "1.41 pounds",
      "Product Dimensions": "7.22 x 10.09 x 2.21 inches",
      "Item Dimensions  LxWxH": "7.22 x 10.09 x 2.21 inches",
      "Manufacturer": "Linksys",
      "ASIN": "B00NQ19M72",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "October 1, 2014",
      "Customer Reviews": "3.2 out of 5 stars204 ratings3.2 out of 5 stars",
      "Best Sellers Rank": "#111,410 in Electronics"
    },
    "categories": [
      "Computers & Accessories",
      "Electronics"
    ],
    "price": ""
  }
}