{
  "website_summaries": [
    {
      "verdict": "A great-looking and durable canopy tent, but you're going to need at least an extra pair of hands to set it up.",
      "pros": [
        "Comes in a variety of colors, from purple to yellow",
        "Durable and long-lasting",
        "Moderately easy to set up",
        "Sturdy and good-looking"
      ],
      "cons": [
        "Does not come with a storage bag",
        "Some buyers report quality problems with the stitching",
        "This option is on the heavy side and will definitely take a couple of people to set it up"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "WHo let this deal out! Awesome!",
      "text": "Do not let the price fool you! This is an amazing deal! Product quality is good! the frame folds up nice and is pretty simple to set up. You could do it yourself but much easier with two people. We bought this to use at the beach. The fabirc top held up well and we never had problems with it blowing away. We buried the tents feet in the sand and tied a few sand bags to each corner. It gave us a nice shaded area for the family to enjoy. For the money its hard to beat!",
      "rating": 5.0,
      "verified": true,
      "author": "bambooligan",
      "helpful_votes": 13,
      "publication_date": 20160725
    },
    {
      "title": "Possible the worst quality cover I've ever seen in an easy up.",
      "text": "Honestly, I have no problem with upping this review but I've had this easy-up up for two days, no wind, and the top of the frame is now poking through the canopy where the seam came apart and they're are two other places where there is no other contact where the seam is unraveling as well.",
      "rating": 1.0,
      "verified": true,
      "author": "John Petroschek",
      "helpful_votes": 0,
      "publication_date": 20200426
    },
    {
      "title": "Great Quality Canopy, Frame and Super Fast Service",
      "text": "I ordered this on the second and it is here on the fifth. Great service and a great Canopy. We have used EZ Up style canopies every year and needed one larger than the standard 10x10. We put it up as soon as it arrived and I very pleased with the quality. With metal fittings and screws it's much better than the discount ones that are all aluminum and plastic, The cover is heavy duty as well. I can't wait for summertime in the shade with this Baby!",
      "rating": 5.0,
      "verified": true,
      "author": "Camp Grandma",
      "helpful_votes": 0,
      "publication_date": 20160205
    },
    {
      "title": "This is a very well constructed canopy. We have ...",
      "text": "This is a very well constructed canopy. We have used it for a neighborhood picnic one time. The winds were around 12 mph and we had no problems with it. We did have weights around the four corners. It takes four people to set it up. There are NO assembly instructions, but it is fairly intuitive. It took four people about 15 minutes to set it up. The canvas top does not remain attached to the frame and must be placed each time it is erected. The canvas top is made of sound material.",
      "rating": 4.0,
      "verified": true,
      "author": "Teder",
      "helpful_votes": 0,
      "publication_date": 20150616
    },
    {
      "title": "Need 2 or more people to set up",
      "text": "The canopy was great the first time we used it sturdy strong the canopy itself on top was very thick. Second time we set it up we heard snap and it broke in 4 different places does not seem to be very strong at the bolts. The side extension poles that keep the leg in place broke right at the bolts on 2 legs.",
      "rating": 3.0,
      "verified": true,
      "author": "Jacob",
      "helpful_votes": 0,
      "publication_date": 20190825
    },
    {
      "title": "This seller does not reply",
      "text": "I recovered this and found pieces broken before I even set it up. I reached out to the seller nothing. Very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Paul",
      "helpful_votes": 0,
      "publication_date": 20200610
    },
    {
      "title": "Great canopy!",
      "text": "If you are looking for a canopy that is durable and made with quality materials, this is it! I've had my canopy for almost four years now and it still looks as good as it did the day I purchased it. I use it on a weekly basis, and it can be setup in less than five minutes with two people.",
      "rating": 4.0,
      "verified": true,
      "author": "AButler",
      "helpful_votes": 0,
      "publication_date": 20170828
    },
    {
      "title": "It snaps easy",
      "text": "Sorta a flimsy piece of crap for one time use",
      "rating": 1.0,
      "verified": true,
      "author": "Jackson",
      "helpful_votes": 0,
      "publication_date": 20190301
    },
    {
      "title": "Cloth on top is super cheap and tears super easy",
      "text": "The metal outlasts the cheap material of the cover. I tried to find someone to come out to professionally make the material but it wasn't cost effective. The cover is not canvas as you would expect and the sun thins it out so that it tears with little effort. The poles in the center actually poked through the covering to the point of creating a large tear.",
      "rating": 3.0,
      "verified": true,
      "author": "Dana T.",
      "helpful_votes": 0,
      "publication_date": 20150319
    },
    {
      "title": "EG Teck",
      "text": "It is OK mine came in damaged. Not the Nicest I have seen but for the money its not bad. It does not have a vent in the top so the chances of this thing becoming a kite in a big wind gust is likely. The stakes they send are literally nails. so do not have you expectations set too high.",
      "rating": 3.0,
      "verified": true,
      "author": "cdale27",
      "helpful_votes": 2,
      "publication_date": 20140623
    },
    {
      "title": "Great canopy. Unfortunately two pillars broke on me but ...",
      "text": "Great canopy. Unfortunately two pillars broke on me but I contacted the vendor and they sent me replacement in two days. For the money it is great, used it out in glamis and it worked like a charm. The canvas is good quality unlike other ones I have bought. You do need at least 2 people to open but 4 makes it much easier. Only downfall is that no storage case but should be able to find a bit at the container store.",
      "rating": 4.0,
      "verified": true,
      "author": "zared ibarra",
      "helpful_votes": 3,
      "publication_date": 20141220
    },
    {
      "title": "What are you waiting for",
      "text": "What can you say about this product nothing butt AWESOME !!!!!! everything that was described it could actually do it did. Going to buy a second tent great job",
      "rating": 4.0,
      "verified": true,
      "author": "Robert c Rivers",
      "helpful_votes": 0,
      "publication_date": 20170610
    },
    {
      "title": "This tent isn't worth the money!!",
      "text": "When we put the tent together. 2 of the cross pieces broke..I been using pop up tent for 15 yrs..this year sucks!!..its not worth the money..",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190615
    },
    {
      "title": "Perfect for Tailgates",
      "text": "The tent arrived quickly and set up beautifully. It was the perfect tailgate tent and had a real presence and looked great. It takes 4-5 adults to set this up, and there is no travel bag, but the quality, performance, and overall value of this tent overcomes any minor challenge for set-up or carrying. Highly recommend, and received many inquiries where to get this tent.",
      "rating": 5.0,
      "verified": true,
      "author": "Larry G.",
      "helpful_votes": 0,
      "publication_date": 20151005
    },
    {
      "title": "highly recommended",
      "text": "Super awesome, lasted through a hurricane. Yes I camped through Patricia. No leaks. Canopy attaches only with Velcro but it worked fine. Can be put up by one person but it's difficult, 2+ is better.",
      "rating": 4.0,
      "verified": true,
      "author": "Mary B",
      "helpful_votes": 0,
      "publication_date": 20151112
    },
    {
      "title": "Pleased customer",
      "text": "I am soo happy we got these for our youth football organizations they are heavy duty and have lasted 2 + seasons so far . Very durable and sturdy. Highly recommend for any event or function big or small. I'm getting one just for our back yard parties. We have people asking where we got them and they are amazed when we tell them Amazon",
      "rating": 5.0,
      "verified": true,
      "author": "Tracy Rampage",
      "helpful_votes": 0,
      "publication_date": 20171214
    },
    {
      "title": "Five Stars",
      "text": "Works great. Set up was difficult the first time but is very easy once you understand how.",
      "rating": 5.0,
      "verified": true,
      "author": "willie",
      "helpful_votes": 0,
      "publication_date": 20170108
    },
    {
      "title": "easy to set up",
      "text": "Used it camping, easy to set up. Held up really well. We love it so far, good looking tent.",
      "rating": 5.0,
      "verified": true,
      "author": "jhj",
      "helpful_votes": 0,
      "publication_date": 20161027
    },
    {
      "title": "Five Stars",
      "text": "It's easy to put up with a minimum of 3 people.The height is good and coverage is excellent.",
      "rating": 5.0,
      "verified": true,
      "author": "joseph cumberbatch",
      "helpful_votes": 0,
      "publication_date": 20151019
    },
    {
      "title": "Used for the 4th of July worked out well it ...",
      "text": "Used for the 4th of July worked out well it does take at least 4 people to put up and take down because of the size",
      "rating": 4.0,
      "verified": true,
      "author": "armentha edwards",
      "helpful_votes": 0,
      "publication_date": 20141023
    },
    {
      "title": "Not happy with that",
      "text": "The canopy had a broken weld on a corner on arrival. Not happy with that.",
      "rating": 1.0,
      "verified": true,
      "author": "Kevin M Kitchen",
      "helpful_votes": 0,
      "publication_date": 20150714
    },
    {
      "title": "Definate quality canopy. You will need to figure out ...",
      "text": "Definate quality canopy. You will need to figure out a way to carry it as it has no bag. Also will need stakes. I used the cheap ones that bend all the time and they worked perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "charles",
      "helpful_votes": 0,
      "publication_date": 20150608
    },
    {
      "title": "Keep looking...",
      "text": "We did not have a pleasant experience with this tent. Upon first use a beam broke. We were careful with it since we received no instructions for it, yet it still broke. The second time we used it, two more beams broke and I knew this was a lost cause. We have a tailgate group and we have been using tents of all sizes for years, this was by far the worst tent we have had to use. I threw it after the second use since it didn't even want to close. The material for the canopy was not durable to begin with. The price was great, now I know why. You get what you pay for.",
      "rating": 1.0,
      "verified": true,
      "author": "Ana",
      "helpful_votes": 3,
      "publication_date": 20151012
    },
    {
      "title": "Doesn't come with carry case :(",
      "text": "Its a good tent but it doesent come with any kind of carrying case or a way to store it .",
      "rating": 3.0,
      "verified": true,
      "author": "Nichole Douglas",
      "helpful_votes": 0,
      "publication_date": 20140601
    },
    {
      "title": "The framework and the fit were good, so we were very pleased with the canopy ...",
      "text": "The framework and the fit were good, so we were very pleased with the canopy for the first week. However, we had about two weeks of windy days that caused the covering to wear through on the sharp parts and eventually collapsed the canopy onto the frame. If wind isn't a factor, this canopy is an excellent solution for shade. However, it needs reenforcement at the peaks to keep the canopy from wearing through with friction.",
      "rating": 3.0,
      "verified": true,
      "author": "Arielpariel",
      "helpful_votes": 0,
      "publication_date": 20140717
    },
    {
      "title": "Not great in weather.",
      "text": "Pros: Easy to setup. Works as expected Cons: Edit* Three stars off because the way the top is secured to the frame is a bit shoddy. They just stick to Velcro flat instead of wrapping around the frame. After owning this for 3 months in normal conditions. The cover has split. The overall l durability of this canopy is not very good. This was under moderate rain in a 24 hour period. Disappointed. No Storage case. No Stakes included.",
      "rating": 3.0,
      "verified": true,
      "author": "Noah A.",
      "helpful_votes": 0,
      "publication_date": 20150712
    },
    {
      "title": "two extensions on the canopy leags were broken,",
      "text": "two extensions on the canopy leags were broken,when I got it I had to weld them back together myself it is a poorly design way that the canopy itself is attached to the framework its down by dist a few strips of velcro in each corner it doesn't take a real strong breeze actually blow the canopy cover off but for the price I guess you get what you get",
      "rating": 1.0,
      "verified": true,
      "author": "spanky",
      "helpful_votes": 2,
      "publication_date": 20150609
    },
    {
      "title": "I have had the tent up for less than a ...",
      "text": "I have had the tent up for less than a week and already there is a rip in the fabric lining the underside of the canopy. I have not yet acted on this regarding an exchange or return, so I cannot comment on that aspect of the transaction at this time.",
      "rating": 2.0,
      "verified": true,
      "author": "Candace Raymond/HTBT",
      "helpful_votes": 0,
      "publication_date": 20140707
    },
    {
      "title": "Five Stars",
      "text": "Great EG-Tech canopy tent 10x20. The pop up tent goes up quick very sturdy and strong.",
      "rating": 5.0,
      "verified": true,
      "author": "Raymond Koye",
      "helpful_votes": 0,
      "publication_date": 20140714
    },
    {
      "title": "BEST CANOPY TENT I HAVE BOUGHT",
      "text": "EG-Tech Canopy Tent 10x20 foot Blue Party Tent Gazebo Canopy Commercial BEST CANOPY TENT I HAVE BOUGHT. FOR THIS PRICE I HIGHLY WOULD RECOMMEND THIS TENT.",
      "rating": 5.0,
      "verified": true,
      "author": "DANIEL BURNS",
      "helpful_votes": 0,
      "publication_date": 20140525
    },
    {
      "title": "Ordered for our track team so far so good. Would be better if it had a rolling ...",
      "text": "Ordered for our track team so far so good. Would be better if it had a rolling bag for transporting it.",
      "rating": 3.0,
      "verified": true,
      "author": "Eric von Arx",
      "helpful_votes": 0,
      "publication_date": 20150514
    },
    {
      "title": "Tent Strength",
      "text": "The tent appears to be very sturdy (pic of man hanging from it). So is it this particular model? Is there any info on the strength?",
      "rating": 4.0,
      "verified": false,
      "author": "Lahn Bain",
      "helpful_votes": 0,
      "publication_date": 20140512
    }
  ],
  "product_meta": {
    "title": "AMERICAN PHOENIX 10x20 Canopy Tent Pop Up Portable Instant Commercial Tent Heavy Duty Outdoor Market Shelter (10'x20' (Black Frame), Blue)",
    "rating": 3.6,
    "specifications": {
      "ASIN": "B00NVPD6BQ",
      "Item model number": "3x6 Blue",
      "Customer Reviews": "3.6 out of 5 stars49 ratings3.6 out of 5 stars",
      "Best Sellers Rank": "#257,962 in Patio, Lawn & Garden",
      "Is Discontinued By Manufacturer": "No"
    },
    "categories": [
      "Patio, Lawn & Garden",
      "Canopies, Gazebos & Pergolas",
      "Garden & Outdoor",
      "Patio Furniture & Accessories",
      "Gazebos"
    ],
    "price": ""
  }
}