{
  "website_summaries": [
    {
      "verdict": "A sound choice for cooks who want a model with a 2-sided capacity, especially since the company has worked to correct known leakage issues.",
      "pros": [
        "The divided cooking unit is ideal for Asian dishes like Shabu Shabu",
        "Great for soups, broths, and meats",
        "Keeps dishes warm throughout mealtime"
      ],
      "cons": [
        "Not as versatile as other models",
        "Leakage has been reported, but this issue has been addressed by the manufacturer"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Liquid on Each Side Stays Separate",
      "text": "My engineer husband wants to use this pot for Shabu Shabu, but our daughter is vegetarian. Husband brought the water to a boil (16 minutes) and then dropped red food coloring in one side to see if it drifted to the other side. Nope. The red stayed on the right side, meaning we can have vegetable broth on one side and cook meat on the other.",
      "rating": 5.0,
      "verified": true,
      "author": "Julie",
      "helpful_votes": 191,
      "publication_date": 20171117
    },
    {
      "title": "It sounded almost like something was rattling",
      "text": "Had to return it. It makes a tremendous amount of noise when working, i could hear it loudly clear across the house when i tried it for the first time with water. It sounded almost like something was rattling. I hoped it would go away but it kept going for 20 minutes. I tried it 2 more times just in case, but to no avail. Maybe it was a defective one?",
      "rating": 1.0,
      "verified": true,
      "author": "Nick T.",
      "helpful_votes": 78,
      "publication_date": 20180331
    },
    {
      "title": "Best Hot Pot on Amazon",
      "text": "Best way to enjoy a meal with friends and family, interactively! This pot heats up fast and is self-contained. I usually fill one side with Little Sheep brand HOT (which really isn’t too hot) and the other side with Sukiyaki for a sweet alternative.",
      "rating": 5.0,
      "verified": true,
      "author": "Dina Mitchell",
      "helpful_votes": 33,
      "publication_date": 20181109
    },
    {
      "title": "Major Leakage through divider",
      "text": "I just got the pot today. I immediately tested it with water. It has major leaks through one side to the other. The divider couldn't separate water completely. Update7/28: The customer service has done a great job for processing and sending a replacement within a week. I will see how the new one works. Hopefully it won't leak this time. Update8/2: Just received the replacement pot, test it with water. It has no leak this time. The pot get heated up pretty quick. Looking forward to having hotpot now. Will recommend this item",
      "rating": 4.0,
      "verified": true,
      "author": "Funfun",
      "helpful_votes": 40,
      "publication_date": 20170726
    },
    {
      "title": "Works Great! Love it!",
      "text": "Works great ! We Love our Hotpot Plenty of room , heats up fast . Highly recommend it !",
      "rating": 5.0,
      "verified": true,
      "author": "JakeSS",
      "helpful_votes": 23,
      "publication_date": 20180717
    },
    {
      "title": "Leaks",
      "text": "I was excited to have a hot pot dinner at home with the family. I was initially concerned about liquid in one side of the pot leaking into the other side but was assured by the manufacturer's comments that it had corrected the leakage problem. It arrived and to my disappointment it leaked. Returning. Bummed. -Ann",
      "rating": 1.0,
      "verified": true,
      "author": "Son Tran",
      "helpful_votes": 19,
      "publication_date": 20180122
    },
    {
      "title": "Loved it",
      "text": "Just used it for the first time tonight - work great ! Checked for leakage between the two sides before using - the divider works perfect we did one spicy side one regular. Short cord make sure you have an extension cord. Easy to use and heat up quickly.",
      "rating": 5.0,
      "verified": true,
      "author": "Angel S.",
      "helpful_votes": 13,
      "publication_date": 20181127
    },
    {
      "title": "Great hot pot",
      "text": "Used first time today. Very impressed. Very powerful, boiling all the time. I used spicy on one side and non spicy on the other, and I did not see any seepage. Big volume, feeding five adults easily. For few complaining about performance, the trick is to start with hot broth. I highly recommend this hot pot to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "VTMOM",
      "helpful_votes": 10,
      "publication_date": 20180101
    },
    {
      "title": "Defected",
      "text": "Was so excited to get this, we turned it on and sounded like a loud rattle noise. Waited 10-15 minutes and our pot started leaking all over the table. The hot pot bowl has multiple holes in it and leaked out all of the sauce onto the burner and started smoking. So disappointed, and it is not as big as the picture shows. There is also no turn off switch. You have medium high option. Not worth the purchase.",
      "rating": 1.0,
      "verified": true,
      "author": "Christopher ",
      "helpful_votes": 4,
      "publication_date": 20200210
    },
    {
      "title": "Broke 10 minutes into first use",
      "text": "Broke 10 minutes into first use. For those 10 minutes it was working pretty good. Maybe I just got a defective one but somehow I think it’s a more common problem. Looks decent, feels a bit flimsy, for the price I expected a few months worth of use. Now I have $200 worth of meat, tofu, potatoes, and lotus root sitting in my table with no way to cook it.",
      "rating": 1.0,
      "verified": true,
      "author": "Looney",
      "helpful_votes": 3,
      "publication_date": 20200411
    },
    {
      "title": "Great product!",
      "text": "We’ve had this for little over a year. This thing hot pot cooker is great. It heats the water quickly and recovers quickly when adding more water or when a good amount of food is being cooked. We like it so much we’re going to buy a second one for when we have our friends over for hot pot!",
      "rating": 5.0,
      "verified": true,
      "author": "Deborah K. Kaschik",
      "helpful_votes": 4,
      "publication_date": 20190303
    },
    {
      "title": "works like a dream",
      "text": "With hotpot restaurants closed due to the virus, my boyfriend and I were left craving. This is a wonderful electric pot to use at home to make our own hot pot nights and will probably be our future friday night dinners from now on! The size of the pot is perfect for two people and the separation works really well! Our first night we did miso soup on one side and just water on the other and none of the miso seeped over. It is a little loud while heating up, so it was worrying at first, but it all worked out fine so I assume that's what it's supposed to sound like.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200713
    },
    {
      "title": "Great hotpot",
      "text": "They must have read their reviews, because the one I got has welding so excessively well-done that to somebody with a manufacturing background it's clear they were trying to make up for previous mistakes. I've used the thing a bunch, and it's fantastic. Also, this does have the electro magnetic locking ability. I wasn't sure when I bought it, but it does.",
      "rating": 5.0,
      "verified": true,
      "author": "Jefferson",
      "helpful_votes": 2,
      "publication_date": 20191105
    },
    {
      "title": "Seems sturdy but leaks",
      "text": "Super sad about this, I was looking for a good hot pot to have at home. This one looks super sturdy, very nice done, but sadly it leaked. It leaked SO bad that when I realize it (thank God it wasn’t plugged yet) it was too late for my wood table which now has a big “bump” from all the water that got absorbed. I send it back, I wish I could send my my table too 🙃",
      "rating": 1.0,
      "verified": true,
      "author": "Bianca",
      "helpful_votes": 2,
      "publication_date": 20200212
    },
    {
      "title": "good hot pot but be careful the water pressure at two sides",
      "text": "it is generally good. However, you need to make sure water level at two sides should be similar to each other, or soup may leak to the other side. Just make sure you add water to both sides.",
      "rating": 4.0,
      "verified": true,
      "author": "Nin",
      "helpful_votes": 3,
      "publication_date": 20200129
    },
    {
      "title": "Hotpot",
      "text": "Works great. The only issue is one side will heat more than the other side, maybe it’s due to the flavor consistency but this works great and easy to use. One change I would recommend is make a off switch because you have to unplug to turn off.",
      "rating": 4.0,
      "verified": true,
      "author": "maddox4",
      "helpful_votes": 2,
      "publication_date": 20190124
    },
    {
      "title": "It works good thus far (heat up quickly) but not sure how ...",
      "text": "It works good thus far (heat up quickly) but not sure how long it will last because bottom pot is thin. You actually can see the dotted lines of the divider outer side of the pot. The power cord is short so if you get the extension cord make sure it's a 3-prong cord.",
      "rating": 4.0,
      "verified": true,
      "author": "Last_Avenger",
      "helpful_votes": 6,
      "publication_date": 20170713
    },
    {
      "title": "Good size and solid build quality",
      "text": "We were worried about the partition in the middle as some review mentioned that it leaks, but I think the manufacturer must has fixed this as it seems to be solidly welded now. The unit itself was louder than we thought (similar to a kettle getting to boiling point), but after the initial warm up it's fairly quite and maintains a good temperature. Overall, a solid hot pot unit.",
      "rating": 4.0,
      "verified": true,
      "author": "howard ej packham",
      "helpful_votes": 0,
      "publication_date": 20200207
    },
    {
      "title": "Disappointed",
      "text": "Not recommended to buy, the only qualified is the heating speed is very fast But the rest are a lot of bad places: loud voice Not easy to clean, the bottom of the pot is very difficult to clean Material quality is very general The short wire makes people feel ridiculous",
      "rating": 1.0,
      "verified": true,
      "author": "cynthiaxinxin",
      "helpful_votes": 2,
      "publication_date": 20190226
    },
    {
      "title": "Great Hot Pot",
      "text": "1+ Year review: This thing still works so good! We used this throughout the winters while hosting small dinners. No leakages. No damage to the dining table. No burn marks. I am so pleased with this purchase to this day! What a great buy! We have used this at least a handful of times. My boyfriend cannot eat spicy, so we have one side that’s nonspicy for him. The divider does not leak. Very happy with this purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Lanakin",
      "helpful_votes": 0,
      "publication_date": 20190612
    },
    {
      "title": "For easy group meals on cold days!",
      "text": "This item is a lot of fun for those group meals. Because it's electric and the heat is adjustable you have more control than a briquet heated fire pot. Also not having to use briquets you don't have smoke at the table or the smoky smell.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180308
    },
    {
      "title": "Did not heat evenly.",
      "text": "Pot would not heat evenly regardless of positioning. Not sure if it was defective or a poor design/quality. I believe it was due to poor design/quality. If you don't need a split pot stick to the Zojirishu Gourmet Skillet.",
      "rating": 1.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "Hot pot is great!!",
      "text": "I love hot pot first of all, and when I saw this I just had to have it! Unfortunately my first one got lost in the mail, but I contacted the seller and they were beyond helpful in getting me a replacement! Super nice people. I can’t wait to try this bad boy!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 0,
      "publication_date": 20200216
    },
    {
      "title": "But other than that great for a hotpot",
      "text": "I do not believe this stainless steel, because when I washed it had darker spots- and all the stainless steel products I buy never turn darker. But other than that great for a hotpot!",
      "rating": 4.0,
      "verified": true,
      "author": "Lindsay",
      "helpful_votes": 2,
      "publication_date": 20171107
    },
    {
      "title": "Great hot pot",
      "text": "Been missing shabu shabu so I decided to get a hot pot for home. I looked at local Japanese markets and they only sold shabu pots for about $30-40 depending on quality desired. There was no electric base at the market so this is a great deal all around if you don’t have an electric or gas powered base. Easy to assemble and use. The divider in the pot does have a little leakage between the two sides but no big deal. Other than that, great find on Amazon!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200502
    },
    {
      "title": "I use it everyday",
      "text": "I hot pot in my home almost everyday. It’s well made so that the liquids stay in their respective sides. It’s so easy to use, you can adjust the heat however you want. The electric burner is a little noisy when heating up, but it doesn’t bother me now. The price is a great value, I seem to have gotten my monies worth with how much I use it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191205
    },
    {
      "title": "Not cost-effective",
      "text": "The sales of merchants are more expensive than supermarkets, and the products they received are defective, there is no problem using them, I am too lazy to return the products!",
      "rating": 1.0,
      "verified": true,
      "author": "quanshengwu",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "Split pot for different tastes",
      "text": "This is great for those that want on side spicy and another side non-spicy. I had my doubts purchasing a hot pot on here instead of an asian store, but I was relieved to find it worked just as well. Until now, it has not failed me!",
      "rating": 5.0,
      "verified": true,
      "author": "Joan",
      "helpful_votes": 0,
      "publication_date": 20200423
    },
    {
      "title": "Expensive simple hot pot.",
      "text": "I bought it to replace an old similar hot pot I bought from BBB for $25 several years ago. The heating element of the old one got burned after many years' use. This one fits and looks almost the same as the old one, but it costs three times as much. The heating element also fits my old one so I guess that they are produced by the same company but just with different model names. I do not quite like the equal division of the pot as compared to the old one which has a centered small pot so it's easily accessible from all positions around the table.",
      "rating": 3.0,
      "verified": true,
      "author": "Bluerain",
      "helpful_votes": 17,
      "publication_date": 20150311
    },
    {
      "title": "Very much requires the lid to function correctly",
      "text": "The mini heat it produces vs the surface area; this hot pot 100% requires the lid to keep the broth acceptably hot. Otherwise this seems like a decent enough pot if you are not using this monthly or weekly for 10 years.",
      "rating": 2.0,
      "verified": true,
      "author": "Siri",
      "helpful_votes": 0,
      "publication_date": 20200217
    },
    {
      "title": "No good",
      "text": "No good because you want to cook you meat an veggies and veggie over cook because meat takes longer to cook",
      "rating": 3.0,
      "verified": true,
      "author": "luzmaria contreras",
      "helpful_votes": 0,
      "publication_date": 20190713
    },
    {
      "title": "It is ok",
      "text": "One side boils faster than the other. Burns on the bottom even with lots broth in, but it is not too bad. I guess you just need to stir stir stir. It has not leak through the divider yet.",
      "rating": 3.0,
      "verified": true,
      "author": "Likegreen",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "Pretty decent",
      "text": "Great product however there have been a couple of times where the pot seemed to be stuck to the burner. We were able to get it off but it's stressful to put it on with the thought of it potentially getting stuck.",
      "rating": 4.0,
      "verified": true,
      "author": "Naomi torres",
      "helpful_votes": 0,
      "publication_date": 20200621
    },
    {
      "title": "Great hotpot!",
      "text": "So we love hotpot. So I picked this up for wifey. She loves it. We do it at home now and it's relaxing. I'm a live streamer and now we do this on stream and I'm pretty sure I've gotten another 6 people or so to buy one cause of how great it is. It heats the water pretty fast, it keep it boiling so the thin slices of beef cook fast like they are supposed to, very easy to clean, the seperator keeps it seperated as it's a part of the pot. We are super happy!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200202
    },
    {
      "title": "Good shabu shabu pot",
      "text": "Not a bad shabu shabu pot. Takes a little long to heat up and broth does leak a little from one side to the other thus the negative star. Easy to clean and still does it’s job. Overall a solid 4 star.",
      "rating": 4.0,
      "verified": true,
      "author": "Paul",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "Lovely way to eat",
      "text": "So common in the Far East and so rare here in the USA. Its so nice to gather the family around the \"hot pot\" and extend a lesiurely meal as long as you want to. This product is simple, well made and completely fulfills its function.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Taggart",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "Pot has leaks",
      "text": "Bought it with one-day shipping but the pot has leaks :( Had to return the product and realized there is a major design flaw, so not recommend. I eventually found a similar and better product at H-Mart (the korean supermaket) if you have one near your neighborhood.",
      "rating": 1.0,
      "verified": true,
      "author": "S.W.",
      "helpful_votes": 16,
      "publication_date": 20160718
    },
    {
      "title": "Good for hotpots!",
      "text": "Noted small leak in the divider, nonetheless still works perfectly fine!",
      "rating": 5.0,
      "verified": true,
      "author": "Sienna",
      "helpful_votes": 0,
      "publication_date": 20200618
    },
    {
      "title": "You’ll love this pot!",
      "text": "Love this product! I’ve been using it about twice a week since buying it with no issues. Just add your water/broth while you prepare your hot pot plates and it’s boiling by the time you’re ready. One thing to note, don’t turn on the electric heater without the pot on top. I did once, and since the metal expanded a bit with heat, the pan didn’t get a good deal on top and couldn’t boil properly.",
      "rating": 5.0,
      "verified": true,
      "author": "Kierra Howell",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "Temperature control is too sensitive",
      "text": "The temperature control is not very sensitive and it makes loud noise when it’s heating up. I wish the cable could be a bit longer. It does what it advertises. Quality is OK.",
      "rating": 3.0,
      "verified": true,
      "author": "Privia",
      "helpful_votes": 0,
      "publication_date": 20200525
    },
    {
      "title": "some spots can be a pain to clean",
      "text": "the plate that separates the broth and the bottom where it contacts with hot surface is a pain to clean if you don't stir regularly",
      "rating": 5.0,
      "verified": true,
      "author": "Foodzilla",
      "helpful_votes": 0,
      "publication_date": 20191121
    },
    {
      "title": "Great buy! Works as advertised",
      "text": "I am really happy with this purchase. Great quality and works as advertised. Easy to use and clean. Already bought a second one for a family member as a gift and they are very happy with it as well!",
      "rating": 5.0,
      "verified": true,
      "author": "victor soriano",
      "helpful_votes": 0,
      "publication_date": 20190403
    },
    {
      "title": "Five Stars",
      "text": "Love it so much, we bought it twice for bigger dinner parties.",
      "rating": 5.0,
      "verified": true,
      "author": "D.D.",
      "helpful_votes": 0,
      "publication_date": 20180724
    },
    {
      "title": "Shabu Shabu have Diff styles for your Needs of Cooking...",
      "text": "I took a whole week before I used my Hot Pot...But OMGoodness...the Product you will not regret...It works faster getting hot than a stove for a Quick Meal....It also Cooks Large Meal...I use it everday...I told my Friends about this Product an they were buying it before I was...Love Love Love it :) ...Cooking to Meals at the same time..WOW",
      "rating": 5.0,
      "verified": true,
      "author": "sheryl fredericks",
      "helpful_votes": 0,
      "publication_date": 20191008
    },
    {
      "title": "Replacement was sent quickly",
      "text": "The first pot we received had a small leak. We returned the item to Amazon and the replacement unit came quickly. The replacement still leaked slightly in one spot, but we decided to keep the pot. It works well to have two different flavors, but you can't adjust the temperature. It's only on or off. Overall, we are happy with the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "HIC55",
      "helpful_votes": 0,
      "publication_date": 20200305
    },
    {
      "title": "Absolutely Amazing!",
      "text": "Very large and very well built, seems to be a bargain for the money. The food it can makes is amazing!",
      "rating": 5.0,
      "verified": true,
      "author": "Dave",
      "helpful_votes": 0,
      "publication_date": 20180806
    },
    {
      "title": "Awesome Hot Pot",
      "text": "Heats up quickly and great temperature control. We are using it regularly and it cleans easily.",
      "rating": 5.0,
      "verified": true,
      "author": "HealthGuru",
      "helpful_votes": 0,
      "publication_date": 20200210
    },
    {
      "title": "No leaks",
      "text": "Very thin and cheaply made, but perfectly functional. No leaks. The utensils it came with are so flimsy that you can crumple them into a ball.",
      "rating": 3.0,
      "verified": true,
      "author": "Rachael",
      "helpful_votes": 0,
      "publication_date": 20200219
    },
    {
      "title": "Works great!",
      "text": "Works great and is exactly what we were looking for. We typically have a spicy broth and a non spicy brother so having the separation is perfect. we have not had any issues with leakage between the two sections.",
      "rating": 5.0,
      "verified": true,
      "author": "Lena",
      "helpful_votes": 0,
      "publication_date": 20190325
    },
    {
      "title": "Good product, a bit loud, 2 different broths, quite large",
      "text": "This is a good product, my fiancee and I we love to hot pot, the only thing I would mention is it is a bit louder than expected. Other than that its a great product, the 2 dividers is amazing and we each have our own broth we like. Its quite large so this thing can probably feed 4 people.",
      "rating": 4.0,
      "verified": true,
      "author": "Ben",
      "helpful_votes": 0,
      "publication_date": 20200203
    },
    {
      "title": "Gift",
      "text": "I bought this as a gift for someone so I have no ideas how it cleans or works",
      "rating": 4.0,
      "verified": true,
      "author": "brenda",
      "helpful_votes": 2,
      "publication_date": 20191204
    },
    {
      "title": "Shabu at home answer",
      "text": "Love this pot!! Little spendy fir what it is but worth it to me for my shabu craving",
      "rating": 5.0,
      "verified": true,
      "author": "TW",
      "helpful_votes": 0,
      "publication_date": 20201014
    },
    {
      "title": "Great pot",
      "text": "It’s a pretty good pot. The pot can be detached from the base and it’s dishwashable. Heat up the water quickly! No noticeable noise during cooking.",
      "rating": 5.0,
      "verified": true,
      "author": "TT",
      "helpful_votes": 0,
      "publication_date": 20190316
    },
    {
      "title": "Does everything I wanted it to.",
      "text": "This was my first attempt at hotpot home cooking, and introducing my family to it, after a number of trips to Asia. Rather than creamy and brothy, I prepared sweet/sour on one side and spicy on the other side. My family was dubious at first but by the end of the meal pronounced it delicious. We're very happy with the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Grandpa",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "Great product for an authentic hot pot experience!",
      "text": "Delivery was fast and easy. Product exactly as described. I miss China and all the wonderful cuisine, and after a hot pot night in NYC I just knew I had to make this purchase. Perfect for a night in sharing laughs and good food with family and friends! It's easy to clean, the soup doesn't leak to the opposite side, and the strainer scoops are handy and convenient. Will be using this product frequently because I love it so much!",
      "rating": 5.0,
      "verified": true,
      "author": "JaQuess Wynn",
      "helpful_votes": 0,
      "publication_date": 20180811
    },
    {
      "title": "No leaks. Works perfectly",
      "text": "I love this hot pot. No complaints here. Worked as it should. When I got it I made sure to test it. I poured water into one side to see if there were any leaks. No leaks here and I already used it 3 times in one week. Great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Yang",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "Everything good",
      "text": "It’s work very well. I just got it today it’s make me excited to use. I hope the pot keep work good for a long time.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Coffey",
      "helpful_votes": 0,
      "publication_date": 20200512
    },
    {
      "title": "Efficient",
      "text": "There are very few Yuanyang style hot pot available on Amazon. The one I chose definitely does what it supposed to do. I am happy again now",
      "rating": 5.0,
      "verified": true,
      "author": "MH",
      "helpful_votes": 0,
      "publication_date": 20200527
    },
    {
      "title": "Love it, ordered another one!",
      "text": "I used this wok for the first time tonight, wow! I don’t need to go to restaurants for hotpot any more! This wok is big enough for 2-4 people, easy to use and easy to clean. I am so happy with this purchase that I just ordered another one for my son.",
      "rating": 5.0,
      "verified": true,
      "author": "J LIU",
      "helpful_votes": 0,
      "publication_date": 20201003
    },
    {
      "title": "Say yes to Hot Pot",
      "text": "It works. It's easy to use and clean. You can have Hot Pot at home with 2 options for soup. We had 2 dinners so far with 6-7 people, and this was more than up to the task. If I had one minor issue, it's that the power cord is a little short. We put this on our dining table, and I had to get an extension cord.",
      "rating": 5.0,
      "verified": true,
      "author": "timothy rogers",
      "helpful_votes": 0,
      "publication_date": 20200123
    },
    {
      "title": "we love hot pot",
      "text": "I bought the item about few months,I am Chinese ,we love hot pot,it’s good quality,I like,thank you",
      "rating": 5.0,
      "verified": true,
      "author": "Huazhu xue",
      "helpful_votes": 0,
      "publication_date": 20180522
    },
    {
      "title": "Great for the price",
      "text": "I really enjoyed our hot pot.The temperature setting is great.Only issue is there is no on and off switch",
      "rating": 5.0,
      "verified": true,
      "author": "Yameka M Robinson",
      "helpful_votes": 0,
      "publication_date": 20200324
    },
    {
      "title": "Best hot pot",
      "text": "Love it made my first hot pot and the food was delicious. FYI I filled up one side to see if the water would seep to the other side and it held the water to one side.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "I'm I'm love with it!!!",
      "text": "Perfectly heated up the food easy to clean and it's worth ever cent ♡ I loved it and it was definitely a fun night for my family!",
      "rating": 5.0,
      "verified": true,
      "author": "Janette Clayton",
      "helpful_votes": 0,
      "publication_date": 20190523
    },
    {
      "title": "No good",
      "text": "I want to know why the lid has no head and wants to burn me.",
      "rating": 1.0,
      "verified": true,
      "author": "helen",
      "helpful_votes": 0,
      "publication_date": 20190807
    },
    {
      "title": "Excellent Product",
      "text": "My guest very impressed with product. I used for Pho party and it gets a thumbs up. Heated quickly, cleaning was a snap and quality of product was excellent! I would definitely buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "CAROLYN M. GRACIA",
      "helpful_votes": 0,
      "publication_date": 20200201
    },
    {
      "title": "Just what we hoped for",
      "text": "Easy set up, easy to use, easy to clean. The two sides are completely separated. Study design. Works just as expected.",
      "rating": 5.0,
      "verified": true,
      "author": "Samson",
      "helpful_votes": 0,
      "publication_date": 20200924
    },
    {
      "title": "Good purchase",
      "text": "Looks good and good enough for 6-8 people. We have not used it yet- fair price.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazonshoper",
      "helpful_votes": 0,
      "publication_date": 20200203
    },
    {
      "title": "I use it frequently",
      "text": "Such a handy pot. Everything about it is good so far. I had been using it frequently since I got it. It makes cooking much easier.",
      "rating": 5.0,
      "verified": true,
      "author": "Yiting",
      "helpful_votes": 0,
      "publication_date": 20201008
    },
    {
      "title": "Large and easy to use",
      "text": "Large enough for 6-8 people. We’ve had multiple hot pot parties since we got this pot, and it works amazingly. Temperature goes up very quickly. Super easy to clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Min",
      "helpful_votes": 0,
      "publication_date": 20200220
    },
    {
      "title": "No leaks so far, easy to use, easy to clean",
      "text": "I boil water using a hot plate made for tea before pouring into the hot pot to speed up the heating process. Otherwise it takes about 15 minutes to heat using the hot pot directly. Use an extension cord as the cord that comes with the hot pot is not long. I have used the hot pot about 6 times so far with no issues.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "Gotta Love It",
      "text": "Fantastic hot pot. I love that I can have two different broths - I’m all about options & variety! I also adore the fact that the pot locks onto the bottom once it starts getting warm. Only thing is... it’s hard to control exactly what temperature I’d like it to be.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristine",
      "helpful_votes": 0,
      "publication_date": 20200216
    },
    {
      "title": "Just get this, you’ll bring plenty of joy to your home",
      "text": "Simply put: exceeded our expectations, did all it was supposed to do and brought us a lot of joy and a new weekly ritual. Thanks!",
      "rating": 5.0,
      "verified": true,
      "author": "Yehuda Ari Borochov",
      "helpful_votes": 0,
      "publication_date": 20190120
    },
    {
      "title": "Good size for 2......",
      "text": "Smaller than expected. But still functional. It is good for just 2people or maybe 3. Too small if for a gathering.",
      "rating": 3.0,
      "verified": true,
      "author": "Jie",
      "helpful_votes": 0,
      "publication_date": 20200916
    },
    {
      "title": "Easy use, great for at home.",
      "text": "The top pops off and can be placed in the dishwasher. Easy plug in and transfer of liquids. Great deal for at home hot pot.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary ",
      "helpful_votes": 0,
      "publication_date": 20181028
    },
    {
      "title": "Worked well for hot pot experience",
      "text": "Enjoyed the hot pot. Feels safer than a loose pot on an induction or butane stove. Good temperature control, good size pot for 4 people and divider worked well. Not the highest quality but gets the job done. Don’t think it’s stainless steel.",
      "rating": 5.0,
      "verified": true,
      "author": "Amy Leung",
      "helpful_votes": 0,
      "publication_date": 20191224
    },
    {
      "title": "After only two use, it stopped working! It ...",
      "text": "After only two use, it stopped working! It doesn't heat up anymore. I want to give it a zero star if I could. From the very beginning, it gave a burning rubber smell whenever the heat was on. Should've know then that it won't last",
      "rating": 1.0,
      "verified": true,
      "author": "Yan A.",
      "helpful_votes": 4,
      "publication_date": 20170220
    },
    {
      "title": "Must buy",
      "text": "Great for family night! Holds a lot of food and easy to clean!",
      "rating": 5.0,
      "verified": true,
      "author": "Megan",
      "helpful_votes": 0,
      "publication_date": 20180412
    },
    {
      "title": "Couldn’t even use huge gash on bottom of pot!!!",
      "text": "Took the pot out of box, filled with water and it was leaking all over the place! Flipped it over and noticed a huge gash on the bottom. Returned the product and wound up finding something similar locally that worked fine. Definitely looked like a manufacturer issue.",
      "rating": 1.0,
      "verified": true,
      "author": "Josh & Camille",
      "helpful_votes": 0,
      "publication_date": 20190530
    },
    {
      "title": "not recommended",
      "text": "It leaks after few times use within 3 months , not recommended",
      "rating": 1.0,
      "verified": true,
      "author": "Johnson ",
      "helpful_votes": 3,
      "publication_date": 20180303
    },
    {
      "title": "Very nice product",
      "text": "Good product my only complaint is the stainless steel pot is leaking. The metal divider is protruding on the side of the pot.",
      "rating": 3.0,
      "verified": true,
      "author": "Reynaldo P Ducay",
      "helpful_votes": 0,
      "publication_date": 20200522
    },
    {
      "title": "Keeps the broth hot",
      "text": "This pot keeps my broth boiling like crazy at medium temperature. It was able to quickly cook shrimp, fish, beef, squid and veggies. It could easy keep up with my hungry family of four.",
      "rating": 5.0,
      "verified": true,
      "author": "Calvin",
      "helpful_votes": 0,
      "publication_date": 20191223
    },
    {
      "title": "worked as designed",
      "text": "They did a great job and there was NO leakage or spillage.",
      "rating": 5.0,
      "verified": true,
      "author": "Lia Carvan",
      "helpful_votes": 0,
      "publication_date": 20190926
    },
    {
      "title": "Hot Pot at Home!",
      "text": "Having an electric hot pot is so much easier than trying to do something on the stove top and then keep warm while attempting to cook things. This pot allows everything to be right there in front of you - at your table. Very pleased with this little pot!",
      "rating": 5.0,
      "verified": true,
      "author": "susieswan",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "Great price",
      "text": "Deffinitly worth the price. We use it all the time and its easy to clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Elijah",
      "helpful_votes": 0,
      "publication_date": 20191106
    },
    {
      "title": "rattling sound on the first try, success on the second",
      "text": "bought this hot pot a couple of weeks ago. like one of the reviews, it started rattling pretty loudly when using it for the first time. was going to get ready to return it, but i tried it out again just in case. and it worked!! really happy, great deal.",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle Blanyar",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Great hotpot, it gets nice and hot pretty fast",
      "text": "Great hotpot, it gets nice and hot pretty fast. have yet to have any issues with it, and we use it at least 1-2x a week. it has quickly become out go to lazy meal maker each week.",
      "rating": 5.0,
      "verified": true,
      "author": "kirsty s garbe",
      "helpful_votes": 0,
      "publication_date": 20160925
    },
    {
      "title": "Heats fast and good size",
      "text": "Heats up pretty quickly. Very good for family use, the pot size is similar to what the restaurants use.",
      "rating": 5.0,
      "verified": true,
      "author": "Allen",
      "helpful_votes": 0,
      "publication_date": 20180613
    },
    {
      "title": "Leaked and heated unevenly",
      "text": "Bought it regardless of numerous reviews about leakage. Got it on Thursday; used it on Saturday and returned it on Monday. The explaination of must fill liquid of both sides to prevent leaks make no sense to me. It still leaked! It heated up so unevenly. One side would boil so rapidly and the other side would barely simmering.",
      "rating": 1.0,
      "verified": true,
      "author": "GG",
      "helpful_votes": 0,
      "publication_date": 20181029
    },
    {
      "title": "Great hotpot at home",
      "text": "Love how the hot pot has a dual feature so my soup base was split to mild and hot . Very simple set up and easy to clean. Warms up very quick so be careful to not burn yourself.",
      "rating": 5.0,
      "verified": true,
      "author": "Nithi Sridis",
      "helpful_votes": 0,
      "publication_date": 20200724
    },
    {
      "title": "Slow heating",
      "text": "The heating is kind of slow. Don't think worth the money.",
      "rating": 3.0,
      "verified": true,
      "author": "Yin Yu",
      "helpful_votes": 0,
      "publication_date": 20191022
    },
    {
      "title": "Great for many types of foods",
      "text": "Love it just the first time was a little hot and needs to be lined up middle of the controlled with the decider used four time rite out the gate and was so fun and cool brought back so many memories great product",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191210
    },
    {
      "title": "Wanted to love but it leaks between sides :(",
      "text": "Updating from 1 star to 3 stars. Contacted seller, they were willing to send another one but I elected to just return it. Pot itself was flawed but the sellers are fast to respond and offer alternatives. Original review: I love hot pot and was so excited to get this. First thing I did was a water test by filling up one side to see what happened. And it leaked from the joins on both sides :( I’ve contacted seller. I hope I can get a new pot that doesn’t leak. But if not, guess this is going to have to go back ;(",
      "rating": 3.0,
      "verified": true,
      "author": "MDG",
      "helpful_votes": 4,
      "publication_date": 20180106
    },
    {
      "title": "Great hotpot!",
      "text": "Works perfectly so far. Tried it about 4 times now and still works great. No leakage from the two sides.",
      "rating": 5.0,
      "verified": true,
      "author": "Diana",
      "helpful_votes": 0,
      "publication_date": 20190605
    },
    {
      "title": "A+ So far",
      "text": "Only used it once, so my review may change over time, but it worked quite well on its first use. Would recommend based on that!",
      "rating": 5.0,
      "verified": true,
      "author": "Sean Willoughby",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "Best ever!",
      "text": "Great!! I like authentic cooking and this will really help! It’s like a fondue crockpot!!",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole Kallmeyer",
      "helpful_votes": 0,
      "publication_date": 20190712
    },
    {
      "title": "... make Shabu Shabu or Chinese Hot pot this is perfect!",
      "text": "If you want to make Shabu Shabu or Chinese Hot pot this is perfect!",
      "rating": 5.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20161109
    },
    {
      "title": "Handy",
      "text": "Love that I can have either 2 sauces going or on side for the meat lovers and the other for the chicken peeps",
      "rating": 5.0,
      "verified": true,
      "author": "Colette Hirata",
      "helpful_votes": 0,
      "publication_date": 20170417
    },
    {
      "title": "We had hotpot soon and we received this and it worked great. Others have complained about leakage",
      "text": "My Chinese wife loves this. We had hotpot soon and we received this and it worked great. Others have complained about leakage. If we had any it was minimal and we could not detect any spice in the non-spicy side.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171102
    },
    {
      "title": "nice for hotpot",
      "text": "I use it for hotpot and it never disappoints me. Used it for over a month and still perfectly functioning",
      "rating": 5.0,
      "verified": true,
      "author": "zhe hong",
      "helpful_votes": 0,
      "publication_date": 20190523
    }
  ],
  "product_meta": {
    "title": "Sonya Shabu Shabu Hot Pot Electric Mongolian Hot Pot W/DIVIDER",
    "rating": 4.6,
    "feature_bullets": [
      "Faster heating with larger power: 1500W,5.3 Quart/5 L capacity to satisfy family needs in most formats",
      "Removable cooking pots for convenient use",
      "Anti-skid feet to keep the pot sits evenly / ETL Listed for safety",
      "First-class welding finished internal divider to provide you the benefit to enjoy hotpot with two different flavors"
    ],
    "specifications": {
      "Product Dimensions": "14.4 x 8.8 x 14.7 inches",
      "Item Weight": "8.2 pounds",
      "Manufacturer": "SONYA",
      "ASIN": "B00NGY5PCU",
      "Item model number": "SYHS-30",
      "Customer Reviews": "4.6 out of 5 stars668 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#7,004 in Kitchen & Dining",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "September 16, 2014"
    },
    "categories": [
      "Home & Kitchen",
      "Small Appliances",
      "Kitchen & Dining",
      "Hot Pots"
    ],
    "price": 59.99
  }
}