{
  "website_summaries": [
    {
      "verdict": "The Misfit Flash is a versatile, easy-to-use and extremely affordable fitness tracker that can be worn swimming, too, and it even kind of works as a watch.",
      "pros": [
        "The Misfit Flash is waterproof, lasts six months on a single battery, comes with a wristband and clip-on accessory, works with iOS and Android, and tracks steps and sleep"
      ],
      "cons": [
        "Lacks a heart rate monitor",
        "plastic design feels a little cheap",
        "LED readout shows daily progress and blinks hours and minutes, but doesn't show step count"
      ],
      "aspects": {
        "Style": 7.0,
        "Features": 7.0,
        "Ease of use": 9.0
      },
      "publication_date": 20141106,
      "rating": 7.6,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Quite literally: you get what you pay for",
      "text": "Arrived DOA - Replaced the battery to fix that. Arrived paired to someone else - took some googling and a few different apps to figure out how to undo that. Brand new battery and it said it was down to 20% remaining after 2 weeks of normal walking - far cry from the 6months it states on the product details. Tends to be a bit off with regard to tracking actual steps. Sometimes just refuses to sync for whatever reason - then sometimes it just does. Stopped using it after a month. Cant complain too much as the only reason I bought it was for a work \"Step challenge\" so for 20 bucks it did its job (I guess).",
      "rating": 2.0,
      "verified": true,
      "author": "Jason Krol",
      "helpful_votes": 3,
      "publication_date": 20161128
    },
    {
      "title": "Terrible!!  ZERO stars",
      "text": "This is my 4th Misfit device.....this one didn't work at all, so got a \"credit\" not a refund to use on some watch site. Misfit is a great idea - discreet device that isn't some ugly rubber band on your wrist to track sleep/activity. But the quality is terrible and the clip to secure it is even worse. 3 others have fallen off due to poor quality of clip. I will never buy a Misfit again!! Found a Fitbit that can be worn on a clip so will try that",
      "rating": 1.0,
      "verified": true,
      "author": "Penny D.",
      "helpful_votes": 0,
      "publication_date": 20190730
    },
    {
      "title": "Lost two, not getting a third",
      "text": "After wearing my first Misfit for a few weeks, I noticed that the accuracy was better when wearing it on my wrist, so I started using the wristband exclusively. Sometime during the day, it fell out of the wristband and was never found. Same thing happened with the second one I purchased. If Misfit could do something about the wristband to securely hold the activity tracker, I would maybe consider buying it in the future. For now, I've wasted enough of my money on two of these.",
      "rating": 3.0,
      "verified": true,
      "author": "B. Meyers",
      "helpful_votes": 0,
      "publication_date": 20161127
    },
    {
      "title": "An impressive fitness tracker",
      "text": "I'd originally purchased a Misfit Shine and ordered this as a gift, but when my Shine started acting up I switched to the Flash and find it to be a big step up even though it's a cheaper Misfit. One of my favorite upgrades is that if you raise it up to look at it as you would a watch, it will tell you the time. This device pairs with a ton of fitness programs (I use it with myfitnesspal) and is a great tracker if you don't want to pay for a fancy FitBit or something more expensive. It will still tell you what your sleep cycles are like and even somehow knows when you eat. Love it!!",
      "rating": 5.0,
      "verified": true,
      "author": "C. Baz",
      "helpful_votes": 0,
      "publication_date": 20160902
    },
    {
      "title": "Not for me..",
      "text": "Meh...It's OK. It's built really cheap and feels disposable. I used it for a few weeks and then tossed it in a drawer where it now resides. The app is nice but after using it for a few weeks the sleep mode is complete BS it says my sleep time is almost identical every night and that's 100% not true. You set it for your bed and wake times and it goes off of what you tell it. It does sync easily with your phone. The black disk that is the unit snaps into the bracelet but it comes lose and I had to keep snapping it back in. I get this minimalist concept but it's just not for me.",
      "rating": 3.0,
      "verified": true,
      "author": "Monorail Reviews",
      "helpful_votes": 0,
      "publication_date": 20170428
    },
    {
      "title": "Inexpensive. But You Get What You Pay For.",
      "text": "I got this because I wanted something basic and inexpensive, but it's useless. The plastic clip doesn't hold and it kept falling off, no matter where I clipped it. Moreover, it kept popping out of it holder, no matter whether it was on the band or the clip. Eventually it fell off, and I have no idea where I put it. I bought a FitBit zip instead. It's more expensive, but still nice and basic. The soft silicone case clips smoothly and tightly wherever you wear it. I've been wearing it 3 days, and it stays put, even when I'm active. Spend a little more and buy that instead.",
      "rating": 1.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20170302
    },
    {
      "title": "Great when it works. NOT WATERPROOF even though it says so on the box!",
      "text": "I must have gotten an old model or something because it says right on the box (and in the app) that you can swim with it, but apparently its only water resistant and not waterproof. It quit working and Misfit's customer service informed me that it was water damaged since I wore it in the shower... When the device works its great but Misfit's customer service is kind of terrible in the way that its email only and slow on the response time. They are trying to make it right but until I have a new one in hand I am not going to say that they have met my expectations.",
      "rating": 3.0,
      "verified": true,
      "author": "Ellie L. Barker",
      "helpful_votes": 3,
      "publication_date": 20160517
    },
    {
      "title": "Cheaper than others, but that shows sometimes",
      "text": "Pros: No external charger (which was my major concern, not to carry another charger around) Cheaper than others. Good sleep tracking. Band is pretty comfortable. Cons: 1) Cannot sync with phone without an active data connection (data or wifi), which is ridiculous as without data (which probably is every trekking trip) there is almost no way to track your progress but the LEDs on the tracker. 2) The target that shows up as progress on tracker is actually some \"POINTS\" that MISFIT has devised via some metrics, they are not the actual steps. Actual steps shows up in the app. 3) Also goal setting is with respect to those \"POINTS\" and not actual steps.",
      "rating": 3.0,
      "verified": true,
      "author": "Rahul Dubal",
      "helpful_votes": 0,
      "publication_date": 20150806
    },
    {
      "title": "Perfect minimalist fitness tracker",
      "text": "This is excellent design. The Flash takes the fundamentals of fitness tracking and puts them in a minimalist package. The face tells you the time and how close you are to the goal set on your smartphone app using the red LEDs around the perimeter of the dial. The face can be worn in the included watch strap or a belt clip/key fob holder. What I like about this tracker versus the others is the lack of intrusiveness. It doesn't beep or vibrate, it doesn't show me texts or facebook posts, it just monitors my activity and helps me keep score, which I find very motivational.",
      "rating": 5.0,
      "verified": true,
      "author": "Erick Legue",
      "helpful_votes": 0,
      "publication_date": 20150121
    },
    {
      "title": "I like it, find it sturdy",
      "text": "I like it, find it sturdy, not flimsy as some say. But I don't feel that it accurately measures my steps. I suspected it was off. And today, a friend and I measured our steps together, he with his Fitbit and me with my Misfit. His always read several hundred steps more than mine. Hmmm. He told me that on a positive note, it would give me motivation to do even more exercise. Funny. I'll keep working with it. Perhaps I'm missing something in the settings.",
      "rating": 3.0,
      "verified": true,
      "author": "Sharon Dunham",
      "helpful_votes": 0,
      "publication_date": 20151214
    },
    {
      "title": "Not terribly accurate",
      "text": "I love the look of this fitness tracker. The original band would not hold the tracker unit in place when you pressed it hard enough to get a reading, but I expected this and bought a better band along with the unit. It is not terribly accurate - it thinks I'm walking when I'm knitting (a problem I did not have with my Up Move - which fell off my wrist somewhere). Sleep tracking is a problem because I get up in the night. Sometimes the sleep tracking resets at that point. I feel I got more accurate results from the Up Move. However, I LOVE having the watch function and it looks cool, so I keep wearing it.",
      "rating": 4.0,
      "verified": true,
      "author": "Victoria E. Davis",
      "helpful_votes": 0,
      "publication_date": 20160528
    },
    {
      "title": "Fun, functional tracker",
      "text": "This is a great product. I love how different it is to other watches and fitness trackers. I like the misfit app, its really easy to use and to customize. You can customize the button to do several things, even have your phone ringtone sound so you can escape from a situation. the led's are strong and visible in the daylight. the led's light up when you bring your hand up automatically. It also syncs with your phone automatically, and its nice to see how active you where throughout the month. I used it for a month, and got bored with it. Its a fun little toy, not a watch replacement.",
      "rating": 3.0,
      "verified": true,
      "author": "Saul",
      "helpful_votes": 0,
      "publication_date": 20160304
    },
    {
      "title": "These devices don't last!!",
      "text": "These just don't last beyond a couple of months! I've purchased two of these same devices in less than 6 months and the second one just stopped working completely - same as the first one. Replaced the batteries both times and the thing is just completely dead. I know there are inexpensive but I would expect it to last more than 2 1/2 months! Not sure what I will buy but wishing I would have saved the money I've spent on these two devices plus the batteries I bought for them as this was a complete waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "Laura",
      "helpful_votes": 0,
      "publication_date": 20160511
    },
    {
      "title": "Love the FLASH, hate the wristband & clip",
      "text": "I love the tracker and its functionality. I think the band and the clip that come with it are both garbage. I've lost 2 of these in 1 week. C'mon Misfit - offer a super secure BUCKLE style wristband (not the plastic hospital band that comes off oh-so easily) and charge a little more for that. After using the Flash for less tha a week, I'm kind of hooked on it, but i can't kee buying new ones because the attaching accessories are such crap BTW - I also bought a 3rd party wrist-band for it. The device stayed in it very securely, butt it unfastened itself and fell off my wrist just as easily as the original Misfit band.",
      "rating": 4.0,
      "verified": true,
      "author": "tyler",
      "helpful_votes": 0,
      "publication_date": 20151020
    },
    {
      "title": "Waste :-(",
      "text": "worked fine for the first 3 months. Then worked intermittently on some days off other days etc for a few weeks. Then just quit on me. Stopped working. I was so happy when I received this that I ordered a 2nd piece (for my wife) within a week. Now I regret that decision - as BOTH are NOT working now. If the one i got for me was the only one defective, I could have quietly forgotten about it - but now, this has become a major issue :-( Guess the life of this product is under 100 days. :-(",
      "rating": 3.0,
      "verified": true,
      "author": "Raghavan Murali",
      "helpful_votes": 0,
      "publication_date": 20160603
    },
    {
      "title": "Makes me get up and walk! Perfect",
      "text": "Love this thing. So inexpensive, but works great for what I wanted - an activity tracker that would remind me to get off my butt and move around more, and synch with my phone. Bonus is that it's nice and comfortable (I do not like to wear jewelry of any kind) and waterproof. I'm giving it 4 stars instead of 5 because it's hard to get it into the band exactly straight and tight. Also, the push mechanism is a little too hard to activate. I like the sleep tracking feature but I have no idea how accurate it is.",
      "rating": 4.0,
      "verified": true,
      "author": "Corinne Brzeski",
      "helpful_votes": 0,
      "publication_date": 20160713
    },
    {
      "title": "DO NOT BUY IT!",
      "text": "terrible device, DO NOT waste your time and money. My wife got one from friend last year, then my daughter wanted her own also. They used a few times, then stopped using it because of connection issues to their health app. I started to use my wife's misfit flash last month, broke in 1 week. Then began to use my daughter's device which died after 3-day of usage.",
      "rating": 1.0,
      "verified": true,
      "author": "C. Liu",
      "helpful_votes": 0,
      "publication_date": 20170712
    },
    {
      "title": "It was relatively inexpensive and comes in fun colors. I didn't mind the look and my ...",
      "text": "The Misfit was a mistake. I bought it a year ago, but gave up on it after 3 months or so. It was relatively inexpensive and comes in fun colors. I didn't mind the look and my band and clip are in the same condition as when I bought it. While it works with my Samsung Galaxy phone getting it to sync is nightmarish. Ultimately my cheap pedometer was a lot more reliable, less frustrating, and more accurate. The extra features of the Misfit over the pedometer were not worth the extra cost since I could not count on the Misfit working. I replaced it with a Jawbone Up.",
      "rating": 2.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20160111
    },
    {
      "title": "Very solid basic fitness tracker!",
      "text": "Very stable product, and does exactly what you would expect from a basic fitness tracker with a few added bonuses! Pros: No issues over several months re: connectivity or tracking. Comfortable to wear and not too bulky. Band and tracker are resistant to smudges and marks. AMAZING battery life (still have 1/4 battery after several months constant use) The ability to control music from my wrist and several other programable functions. Cons: No vibration, therefore no alarm/smart alarm (knew this when purchasing, though) Watch display is a little confusing so you really do need to wear an additional watch to tell the time easily.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160725
    },
    {
      "title": "Best economy tracker out there.",
      "text": "Totally love this. The sleep monitor is pretty darn accurate. As many have stated the band is cheap and mine broke after 2 weeks of constant wear. I went and bought a different band that envelopes the misfit and I have been loving ever since. I hear a lot of fitbit users complain that the sleep monitor doesn't work properly and I can say no problems here. I love the goal setting and tracking on the device itself versus just looking at the steps. You can do that from the app. Instead by watching the lights increase throughout the day is more fun and challenges yourself to get another light lit up. I highly recommend this.",
      "rating": 5.0,
      "verified": true,
      "author": "onlyliza",
      "helpful_votes": 0,
      "publication_date": 20150514
    },
    {
      "title": "Great tracker, awful band/clip.",
      "text": "This tracker did everything I needed it to, but the band and clip both broke within the first month. When the clip broke, I lost the tracker and will be replacing it with something else I think. It's a shame: this tracker is pretty great and the price is right. Good app, water resistant, tells time, etc. too bad the cheap lousy band/clip ruins a great product. Cannot recommend until Misfit redesigns the fastening methods. Until then, buy something else, folks.",
      "rating": 1.0,
      "verified": true,
      "author": "Philly McCracken",
      "helpful_votes": 2,
      "publication_date": 20150419
    },
    {
      "title": "Easy, inexpensive, tracks activity & sleep",
      "text": "Have been wearing every day for a week, so far I like it. Easy to set up. If you think you might like to try a fitness tracker but don't want to spend much money, this would definitely get you started. It tracks activity and sleep, shows the time, and syncs to other apps like MyFitnessPal. It has both a wristband and a clip. I think the wristband is comfortable. One day I forgot to put it on until afternoon and there is no way to manually add steps or activity to the app that I could find. I'm happy with my purchase so far.",
      "rating": 4.0,
      "verified": true,
      "author": "Spark",
      "helpful_votes": 0,
      "publication_date": 20160526
    },
    {
      "title": "Great Product when it's working - Order Extra Wristband",
      "text": "I really liked my Misfit Flash. The wristband had me worried because it seemed to be made of cheaper material. After 5 days of wearing the round part of the band that holds the disk broke. I also had to have the whole thing replaced after several weeks of use. It all of a sudden just stopped working, would not come on at all. And now I'm updating my review after my second one stopped working just like the one before. Just out of the blue stopped. I'm not doing anything different and I'm very careful with it. I do not understand why this continues to happen. I do recommend the Misfit! I loved mine when it worked.",
      "rating": 4.0,
      "verified": true,
      "author": "Tosha",
      "helpful_votes": 0,
      "publication_date": 20150120
    },
    {
      "title": "Don't waste your money",
      "text": "I should have listened to the other negative reviews instead of hoping the price point was worth the risk. This thing was TERRIBLE. The watch face is a little diode, and the intent is that you can put it in either the wrist band or a little hip clip. Instead of this making the device versatile, it just makes it fit poorly into both fasteners, to the extent that it's constantly falling out and not measuring things properly. The sleep function, which I was super excited to try out, isn't accurate even if the diode is in place...the first night I tried it, it thought I had slept FIFTEEN HOURS for some reason. Returned.",
      "rating": 2.0,
      "verified": true,
      "author": "elledee",
      "helpful_votes": 0,
      "publication_date": 20150328
    },
    {
      "title": "Best app",
      "text": "Aside from the fact that I keep losing them, I like these pretty well. I have had the flash and the shine, as well as a fossil hybrid watch and a fitbit. I like the misfit app the best. And I do not wear it as a watch, generally, but on a clip. It looks like a watch, but it is impossible to use for telling time.",
      "rating": 4.0,
      "verified": true,
      "author": "kanndo",
      "helpful_votes": 0,
      "publication_date": 20170820
    },
    {
      "title": "They feel great on and are very comfortable",
      "text": "I bought three of these for myself and my two elementary school children. They feel great on and are very comfortable. However, if you push too hard to check the progress the disc sometimes pops out! Also, after a week of wear two of the three didn't consistsntly light up! The information synced to the app ok but not all the lights worked on the display. Amazon replaced them quickly but one of those two replacements stopped working after a week as well. I love the concept of these, but it seems not every watch is made to be very durable.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160218
    },
    {
      "title": "Quality Not a Problem - Love the device so far!",
      "text": "I was tentative to buy based on the reviews about product quality. There have been a few close calls with snagging my band on something and worrying it might break, but so far the device is awesome! For $15.99, the APP itself is worth the money. I've been tracking my sleep and fitness for 10 days straight now and I love this thing. Could be better if it came with a couple back-up bands, but it's definitely keeping me motivated by showing me the average fitness level of other people wearing the same device and whether or not I beat the level daily.",
      "rating": 3.0,
      "verified": true,
      "author": "JB_From_MD",
      "helpful_votes": 0,
      "publication_date": 20160118
    },
    {
      "title": "Simple to use",
      "text": "Does what it's meant to do, not quite as detailed as other trackers or monitors. This small device is comfortable to wear even though it looks like a cheap plastic toy. What's important is the lack of charging and simple operation. I wanted to track my steps and distance throughout my work week and this was just the thing! I did not receive any discount,nor promotional incentive to provide this review.",
      "rating": 5.0,
      "verified": true,
      "author": "Dan Perez",
      "helpful_votes": 0,
      "publication_date": 20160402
    },
    {
      "title": "Pretty cool device",
      "text": "Pretty cool device. Works with my iPhone pretty well. Only complaint is placing the device in the watchband and clip. Plastic is hard and not bendable so extremely difficult to fit the device in it. Struggled with it until I it fit.. I chose the clip because I could clip it on my shoes when walking. Since it was so difficult to place it in the clip, I don't plan on taking it out, so choose wisely which housing unit you want to use. It is pretty accurate though does not have as many exercise options as the Fitbit. I had to choose running to display walking? For the cost it will do.",
      "rating": 4.0,
      "verified": true,
      "author": "W. Wiedman",
      "helpful_votes": 0,
      "publication_date": 20150122
    },
    {
      "title": "Super price for a super monitor!",
      "text": "Super price for a super fitness and sleep monitor. I was considering upgrading to a Fitbit or Garmin tracker, but after researching some more, I decided to stick with the Flash. It does everything I want it to. I find the sleep monitor super useful and the fitness tracking super motivating.",
      "rating": 5.0,
      "verified": true,
      "author": "P. Clark",
      "helpful_votes": 0,
      "publication_date": 20160824
    },
    {
      "title": "This is not the Shine and does not work",
      "text": "I purchased this as an alternative to the Shine. The Shine I owned got scratched and couldn't be used properly after that. The Flash's feature of depressing the face unlike the Shine's tap (which was touchy with me). Anyway, I purchased this item and within 30 days returned it because it deleted all my information of activities for the day. Got a new one through replacements and exactly 30 days later the second Flash did the same thing and suddenly would not sync / connect to my phone. Needless to say, I am unhappy with this product and have once again returned it, with no plans for a replacement.",
      "rating": 2.0,
      "verified": true,
      "author": "Margo L",
      "helpful_votes": 0,
      "publication_date": 20151104
    },
    {
      "title": "Great Basic Device",
      "text": "I like everything about it - so lightweight I forget it is there, waterproof enough that I wear it in the shower, battery rather than charger - but it is very basic. It seems geared toward walking. It knows I took a walk but it doesn't know that I worked out for an hour. It knows some energy was expended but not how much or what to with it. I'm not convinced the sleep tracker is accurate. If you are looking for basic this is nearly perfect. If you want more this probably isn't for you. I have read that consumer groups think none of them are too accurate beyond walking so maybe it doesn't matter.",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20150316
    },
    {
      "title": "Pass this tracker up!",
      "text": "I loved this tracker! Loved! But the first one died a month after I got it, would drain a new battery in 2 days so I requested a new one and it arrived fast but it was the same problem draining a brand new battery in a couple days of me not even wearing it!! I loved the app and still use it for the slew sounds but I have converted to the fit bit. My suggestion is go ahead and spend the extra money on a different tracker of your choice. You get what you pay for & this is especially true!",
      "rating": 1.0,
      "verified": true,
      "author": "Devlebaba",
      "helpful_votes": 0,
      "publication_date": 20160229
    },
    {
      "title": "Very cheap",
      "text": "I have a Misfit Shine and my husband wanted the cheaper option so we got him the Flash. This is a seriously cheap option. The band is a rather uncomfortable plastic (compared to the rubber of the Shine) and it is not secure at all. My husband was always so nervous about it falling out of the band that we ended up taping it in. I would say that the only thing it has on the shine is the physical button rather than the unreliable tap required by the Shine.",
      "rating": 2.0,
      "verified": true,
      "author": "chewy",
      "helpful_votes": 0,
      "publication_date": 20150706
    },
    {
      "title": "Cheap materials",
      "text": "I had a Shine, but left it in a hotel while traveling. I found this as a replacement and didn't even think to check the clips it came with. I LOVED the magnet of the Shine, but the Flash has no magnet clip. It has a cheap plastic clip, which lies loosely even on medium-thick materials (a padded bra, for example). Beyond that, the Flash doesn't snap in overly tightly, which makes it a miracle that I haven't lost it in the 6 hours that I've worn it so far.",
      "rating": 1.0,
      "verified": true,
      "author": "Jennifer A. Hesse",
      "helpful_votes": 0,
      "publication_date": 20180829
    },
    {
      "title": "Love my flash",
      "text": "Love my flash! I wanted something inexpensive to start with because I wasn't sure how much I would use it. Tracks steps very accurately and estimates calories burned and distance gone. It will also track your sleep although I have not used it for that yet. Lightweight and small, easy to keep on my waist or hooked to my bra. Seems pretty durable, I have dropped it in water and stepped on it a few times, still works great.",
      "rating": 5.0,
      "verified": true,
      "author": "Jayme",
      "helpful_votes": 0,
      "publication_date": 20151122
    },
    {
      "title": "Stupid and useless.",
      "text": "Totally crap. I would walk like 5 miles (driven and confirmed), slept seven hours. This showed nothing. I watched the video and \"synked\" it several times. It didn't do crap. Looking to buy a fitbit. I bought it specifically to clip to my Bra. Programmed it for my upper chest. It only worked one day. I gave it two weeks. If it weren't so cheap (low cost), I'd ask for my money back. Let them keep their money, they'll just by fatty foods with it and die early because they don't care about their health. If they did, they would make a better product. I only gave it two stars because it was small and concealable.",
      "rating": 2.0,
      "verified": true,
      "author": "oribhabor",
      "helpful_votes": 0,
      "publication_date": 20150705
    },
    {
      "title": "It's a great tracker, but there are some drawbacks...",
      "text": "Like the tracker. The band sucks. Broke in less than a week. If you need to keep replacing the bands - might as well invest in a jawbone or fitbit. The app is pretty nifty. Very easy to use. I'd have been spot on top star happy, but - seriously, the band? And it's not exactly easy to replace. The shine has tons of options, but the Flash is not as equipped with accessories. It makes me feel like they want to phase it out. Shame. So much potential lost.",
      "rating": 3.0,
      "verified": true,
      "author": "AtlantaBex",
      "helpful_votes": 0,
      "publication_date": 20150429
    },
    {
      "title": "Don't even THINK about it!",
      "text": "Bought this from a Canadian seller - it refused to link with my Android device, and the Canadian seller (look for my feedback on him) pretty much told me it was an issue with Amazon (?!?!?!?!?). Anyway, this was \"dead in the water\" as far as my experience goes, and it looks like I'll be out $40+ for being optimistic! p.s. AFTER I posted this review I got an email from Misfit, saying due to a \"glitch\" they had lost ALL the email requests for support they had received. Judging by my experience, that was a LOT of emails!",
      "rating": 1.0,
      "verified": true,
      "author": "Broomist",
      "helpful_votes": 0,
      "publication_date": 20150708
    },
    {
      "title": "Great product for the price.",
      "text": "Good item for the price. The sleep tracking doesn't seem very accurate. There have been a few times when I've woken up, but when I look at the sleep tracker, it shows that I was in a light sleep. Other than that, it does everything that it promises. I've read alot of the reviews about the band, but I've worn it on my wrist for most of the time & occasionally move it to my ankle for biking, but have never had a problem with it. I've worn it running, doing yoga, zumba, weight lifting - never an issue.",
      "rating": 4.0,
      "verified": true,
      "author": "Catherine L. Goldshot",
      "helpful_votes": 0,
      "publication_date": 20151117
    },
    {
      "title": "I like dit for months",
      "text": "I had gotten one as a gift. I like dit for months, but then the sweat eventually made the band weak and it broke. The clip also broke. Im a brute, so if you need something more durable like me then this isn't your thing. It would be good for someone who is more delicate and doesn't run into s*** all day long, I also have a very active job and move all over the place. Im going to look for one that's more for people like me :)",
      "rating": 3.0,
      "verified": true,
      "author": "anna davis",
      "helpful_votes": 0,
      "publication_date": 20151228
    },
    {
      "title": "Wish it would have lasted longer",
      "text": "I got this as a gift from my son. I absolutely wore it all the time. The app that went with it was great. When the battery began to run out after 6 months I changed it and the item never worked again. I bought a second battery and the lights briefly flashed but still did not work. Did not buy a replacement even though I really liked it due to it's durability.",
      "rating": 3.0,
      "verified": true,
      "author": "Angela Ellsberry",
      "helpful_votes": 0,
      "publication_date": 20181025
    },
    {
      "title": "Disappointed. Easy to use but the quality just doesn't stand up.",
      "text": "We liked how easy it was to sync and use with iPhone. We liked it so much we bought 3. We've had to replace 2 of them (within the warranty), both because the band broke. One of them broke after just a week. When the band breaks the disc no longer stays in. We tried to be extra careful after getting them replaced. Looked down at mine the other day and noticed my disc had fallen out. Can't find it and so basically this purchase was just a waste. Very disappointing. You'd think they'd find a way to secure the disc into a sturdier band. I see I am not alone in my complaint.",
      "rating": 2.0,
      "verified": true,
      "author": "Kelly Vaughn",
      "helpful_votes": 0,
      "publication_date": 20150211
    },
    {
      "title": "Good product",
      "text": "After a few months with my misfit which I loved my band snapped and I ended up loosing my misfit making me a very unhappy camper. It worked amazing. I would of rebought it but I went with a Fitbit since I was able to challenge my friends and family to help me stay more active and the fact that I could read my text messages help like crazy when at work.",
      "rating": 5.0,
      "verified": true,
      "author": "goldy02",
      "helpful_votes": 0,
      "publication_date": 20170702
    },
    {
      "title": "Good buy at $15, but expect yourself to lose it due to the band design.",
      "text": "At $15, this is a solid good buy. As most people say, the watch band is junk. I've not lost mine yet, but I can see how it will happen. I honestly can't see how such a product was made with such a lack of insight put into the band. The button doesn't click or snap into the band or anything. It just rests in the band and can fall out. It's a great buy for what it is. Much more stylish than competitors and very functional. Wish they could fix the #1 complaint about all Misfit products. Seems likke this company just hasn't learned.",
      "rating": 3.0,
      "verified": true,
      "author": "anonymouse",
      "helpful_votes": 0,
      "publication_date": 20160102
    },
    {
      "title": "Dissatisfied customer from 3rd party vendor",
      "text": "Not good. I have been using the Misfit shine for past 6 years. Awesome product! It finally wore out and bought a new misfit flash. It lasted 4 months and died. No warranty from manufacturer. 30 day warranty from amazon. Never buy again! I just wanted service repair. No replacement or repair because discontinued!!! Very sad.",
      "rating": 1.0,
      "verified": true,
      "author": "David J Northrop",
      "helpful_votes": 0,
      "publication_date": 20191214
    },
    {
      "title": "Fell apart.",
      "text": "I like the misfit. Had one before. The round working part fell off the band while i was out. Went to check steps after returning home, it's gone! Be very careful it's securely in place. I don't think this was a new one. Box looked damaged before opening. I'll be buying a different brand.",
      "rating": 2.0,
      "verified": true,
      "author": "Jessme$$",
      "helpful_votes": 0,
      "publication_date": 20180720
    },
    {
      "title": "Back Fell Off Within 4 Hours",
      "text": "I wanted to love this product, despite other negative reviews. However, the thing fell apart on me in less than four hours. I was so excited after I synched the app that I decided to engage in a light, short cardio workout and then make dinner. Immediately after dinner was on the table, as I was excitedly explaining the supposed virtues of this tracker to my spouse, the back unceremoniously fell off in my hand, leaving the battery exposed. There's no hope for reattachment. I'll sadly be sending this back.",
      "rating": 1.0,
      "verified": true,
      "author": "Vero Rose Smith",
      "helpful_votes": 0,
      "publication_date": 20160321
    },
    {
      "title": "I really wanted to like this. The color and style is exactly what ...",
      "text": "I really wanted to like this. The color and style is exactly what I was looking for but it just would not work. It never would sync with my compatible device. I tried changing the battery too (in case it needed a fully charged battery for the initial paring) but that did not help any. I have not had any problem with the bluetooth in the compatible device recognizing any other item. I am still hopeful that it'll work with someone else's phone but that seems unlikely.",
      "rating": 2.0,
      "verified": true,
      "author": "JC",
      "helpful_votes": 0,
      "publication_date": 20160918
    },
    {
      "title": "Reasonably priced Fitness Tracker that interfaces with Weight Watchers Online!",
      "text": "Nice fitness tracker for a very reasonable price that interfaces with Weight Watchers! It was accurate and I loved the software but couldn't get it to fit in the band they sent it with. The band was a fairly cheap plastic band and didn't look to be too durable so I decided to wear it on my waist. Unfortunately between lugging chairs to baseball and soccer fields, I lost it within two week so I decided to go with one that is worn around the wrist.",
      "rating": 4.0,
      "verified": true,
      "author": "dreamer68",
      "helpful_votes": 0,
      "publication_date": 20150522
    },
    {
      "title": "Crap on a band",
      "text": "This is advertised as both waterproof and water resistant. I had one for about 3 months that worked great, others I had less than a week before they just flashed all the time and stopped working. When one of these works, it does a good job. Wear it in high humidity or get a drop of water on it and it just fizzles out. Save your money, buy something else.",
      "rating": 2.0,
      "verified": true,
      "author": "Closet Wench",
      "helpful_votes": 0,
      "publication_date": 20160730
    },
    {
      "title": "This is the tracker you get to decide if you ...",
      "text": "This is the tracker you get to decide if you want a tracker, it will work for about a week or so, and then the straps will break, the battery will not seat, and after replacing the holders and battery, you will throw it away. Since this one was only $14.00 it was OK to throw it away, there more expensive models would be in question. I would imagine they are the same junk construction.",
      "rating": 1.0,
      "verified": true,
      "author": "kim waltz",
      "helpful_votes": 0,
      "publication_date": 20170422
    },
    {
      "title": "While I love how this looks and feels on my arm",
      "text": "While I love how this looks and feels on my arm, it's not quite there yet in accuracy. I can spend 40 min on my treadmill and see what I've done on there, but after syncing my Flash, it doesn't match up. One of the reasons I purchased this was the ability for the company to do software updates and not have to buy a new unit. I'm hopeful that they will correct the accuracy issues. The sleep monitor is spot on and I'm quite pleased with that.",
      "rating": 4.0,
      "verified": true,
      "author": "B. Mitchell",
      "helpful_votes": 0,
      "publication_date": 20150114
    },
    {
      "title": "Worth $35 for a beginner",
      "text": "Pretty basic fitness tracker. Insert doesn't seat in band the best, but it is functional. Compared step count with iPhone & other pedometer. Others were more accurate. Misfit counts about 70-80 of others. iPhone was within 5 steps of 400 counted. Sleep function works but isn't really accurate. Clearly shows when I woke up and walked in the middle of the night, but didn't count it as awake time. I'd recommend buying this if you are buying this as a first fitness tracker or replacement and don't want to spend the cash again.",
      "rating": 3.0,
      "verified": true,
      "author": "CORY VARNER",
      "helpful_votes": 0,
      "publication_date": 20150518
    },
    {
      "title": "The clip broke on the second day. I tried ...",
      "text": "The clip broke on the second day. I tried to figure out how to contact Amazon to ask for a replacement but could not find how to do so. The tracker itself is alright, doesn't provide much information and what is this point system? I don't know why it tells you you have so many points, which mean nothing, and have the steps in a smaller, less prominent part of the screen. Anyways, it wasn't very expensive.",
      "rating": 3.0,
      "verified": true,
      "author": "Catherine",
      "helpful_votes": 0,
      "publication_date": 20160511
    },
    {
      "title": "Life Span of 4 days Total",
      "text": "So I was excited to get this after having terrible luck (short life spans...) w/ two other very popular fitness tracking bracelets. This one has worked for a whole 4 days and then stopped working completely. I even changed out the battery (which said FULL) but it does not work still. I contacted support and keep getting the same directives but no matter how many times I follow their directions, it is dead as dead can be. Buyer beware.",
      "rating": 1.0,
      "verified": true,
      "author": "Hardluckwoman",
      "helpful_votes": 0,
      "publication_date": 20160119
    },
    {
      "title": "Good but not awesome",
      "text": "I was look for something to help me maintain my current weight , but I didn't want to pay the Fitbit price. I found it to be inaccurate because in ththe car ride to work it said I took 80 steps , which I was sitting driving. I found it to be accurate in the sleeping , have a toddler that sometimes wakes in the night and it tracked my waking accurately. It works ok give a estimate but not 100% in steps. It gets the job done at cheaper price",
      "rating": 3.0,
      "verified": true,
      "author": "LMT",
      "helpful_votes": 0,
      "publication_date": 20160323
    },
    {
      "title": "I first received the item and loved it. Then after 2 weeks of wearing it ...",
      "text": "I first received the item and loved it. Then after 2 weeks of wearing it it quit. Changing the battery didn't work. Amazon was awesome and sent me a replacement. That one lasted about 10 days and it did the same thing. I am bummed that this item quit on me.",
      "rating": 1.0,
      "verified": true,
      "author": "sweetums",
      "helpful_votes": 0,
      "publication_date": 20160423
    },
    {
      "title": "Tremendous value; App is solid too",
      "text": "Purchased for my10 year old as a test that he wouldn't lose or break it as the rest of the family has fit-bits and he was feeling left out. Turns out this tracker is great and the app is perfect for him. Only wish they could find a way to have him join the Fit Bit competitions we have. Battery seemingly lasts forever. Would recommend buying a 5 pack of the 3 volt batteries to have when you need to swap it out. Tremendous value in this little gadget - particularly for kids who you want to get moving.",
      "rating": 4.0,
      "verified": true,
      "author": "mairob",
      "helpful_votes": 0,
      "publication_date": 20160404
    },
    {
      "title": "It worked great while I had it",
      "text": "I wore this for months before the watchband broke. Then I wore it for months on the keychain ring. That finally broke too, and I've lost my misfit. It worked great while I had it. I lost a significant amount of weight while I had it, so it definitely helps keep track of activity and keeps you motivated.",
      "rating": 4.0,
      "verified": true,
      "author": "Erin",
      "helpful_votes": 0,
      "publication_date": 20150714
    },
    {
      "title": "Read the fine print.  You'll need an app on a smart phone to make it work.  I'm returning it.",
      "text": "I should have read the details more carefully. I bought this as a party gift at Christmas and my step-dad ended up with it. He does not have a smart phone. You need an app on an i-phone or smart phone in order to use it. He tried to read the instructions included in the box during the party and they were not in English. He had to google Misfit in order to discover that it will not work for him. I'm going to return this one.",
      "rating": 3.0,
      "verified": true,
      "author": "nursecarter",
      "helpful_votes": 0,
      "publication_date": 20160119
    },
    {
      "title": "It does work fine with her Ipad3 but would be more convenient to ...",
      "text": "Bought this for my wife since she was wanting a fitness tracker but didn't want to spend to much as she wasn't sure she would use it. Would have given it more stars if it was more backwards compatible with Android devices. If you are using an Android device it has to be at least 4.3 or later. My wife's phone is 4.1 and isn't upgrade able to 4.3. It does work fine with her Ipad3 but would be more convenient to sync with her phone.",
      "rating": 3.0,
      "verified": true,
      "author": "Luther Ward II",
      "helpful_votes": 0,
      "publication_date": 20150329
    },
    {
      "title": "I didn't really understand how to work, this, ...",
      "text": "I didn't really understand how to work, this, it didn't really explain and I was frustrated that this didn't serve as a watch as well. You couldn't charge it so the battery would have to be replaced and the information was only available on your phone because of the less than helpful 'watchface'. I didn't keep this long before switching to an Apple Watch",
      "rating": 2.0,
      "verified": true,
      "author": "AlliDone",
      "helpful_votes": 0,
      "publication_date": 20160523
    },
    {
      "title": "The fact that I can wear this in the pool ...",
      "text": "The fact that I can wear this in the pool and not have to take it off and eventually never put it back on was the biggest selling point. a month later, I'm still wearing mine. I did buy a different strap so that I could put it on my belt loop in the grocery store when I needed to push the cart.",
      "rating": 5.0,
      "verified": true,
      "author": "Meghan M.",
      "helpful_votes": 0,
      "publication_date": 20161029
    },
    {
      "title": "Great value",
      "text": "Love this. Do wish I had one of the other colors I got for friends. I like it because you can put it on your shoe for cycling. It has also been interesting seeing what my sleep patterns are. As I mentioned, I got it for two other people because I especially liked it for the price. It is helping me to walk more. Wore it on the wrist at first. Now I just clip it to the waist of my pants or when cycling put it on my shoe.",
      "rating": 5.0,
      "verified": true,
      "author": "Egam",
      "helpful_votes": 0,
      "publication_date": 20150211
    },
    {
      "title": "Good thing it only cost me $30",
      "text": "Had for about a week and stopped working. That was surprising considering my previous misfit worked for almost two years until I lost it. Immediately bought a more digital device and couldn't be happier.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190825
    },
    {
      "title": "Entry Level",
      "text": "I love the price and the app. The wristband is super cheap and uncomfortable. The watch body falls out too easily. Had to use some loctite to keep it installed.",
      "rating": 4.0,
      "verified": true,
      "author": "B. Helton",
      "helpful_votes": 2,
      "publication_date": 20170213
    },
    {
      "title": "Broken",
      "text": "Great when it worked and when band was not broken. Unfortunately I didn't return it in the window of time I had with amazon. Reset it, and went a few days more and it has broken again. I will either try the xiaomi which has heart rate or just save for the fit bit charge hr. I hate it when people say this, but don't waste your money. My wife also bought one, it broke, exchanged, and that misfit broke too. Avoid them.",
      "rating": 1.0,
      "verified": true,
      "author": "Okie Actor",
      "helpful_votes": 0,
      "publication_date": 20160311
    },
    {
      "title": "App is decent and I'm pleased with the exercise tracking",
      "text": "Cons: Band broke after only two weeks, with normal use. The \"clock\" function will not sync to the proper time. The sleep tracker doesn't recognize if you get up briefly in the night and then go back to bed. It thinks you had an incredibly short night of sleep. Pros: App is decent and I'm pleased with the exercise tracking. For the price, it's not a bad tracker.",
      "rating": 3.0,
      "verified": true,
      "author": "Shayna",
      "helpful_votes": 0,
      "publication_date": 20160314
    },
    {
      "title": "Would definitely recommend and great price!",
      "text": "Would have gotten 5 stars bit I did have problems syncing it when I first got it but it works great now I think it got a software update, I haven't had any problems since tracks my activity pretty well but the sleep tracker is a little off sometimes if I am in bed watching TV it thinks I am sleeping when I am just laying down. But overall I would recommend this product especially for the price other products charge so much more for the same thing.",
      "rating": 4.0,
      "verified": true,
      "author": "Trisha",
      "helpful_votes": 0,
      "publication_date": 20150530
    },
    {
      "title": "Very disappointing",
      "text": "If I could I would give this product a zero. No stars. I finally had a chance to use this product in a pool. The first time it wouldn't sync and the clock and activity progress notification failed to work for about half a day. Finally it started to work again. I went back in the pool two days later and it stopped working completely. I was very disappointed. Also, the flash frequently says it is disconnected in the app and you have to really be patient going through numerous steps to reconnect the flash to the flash app. I would not recommend this product and wish I could return it for a refund.",
      "rating": 1.0,
      "verified": true,
      "author": "L R Steele",
      "helpful_votes": 0,
      "publication_date": 20151012
    },
    {
      "title": "breaks easily and easily gets lost",
      "text": "breaks easily and easily gets lost. I bought 5 of these to give to my sisters, aunt, friend and for myself and I found that it's not as waterproof as they say it is. It's okay for showers but not for the pool or the beach. My aunt lost hers the first day she got it because the clip wasn't secure enough. My sister's and mine broke after wearing it while swimming. My other sister's flash just stopped working. plus points to misfit for excellent customer service as they sent me a replacement to the Philippines after I reported mine broke. I would buy again if construction is improved and product is proven waterproof.",
      "rating": 3.0,
      "verified": true,
      "author": "Sharky",
      "helpful_votes": 0,
      "publication_date": 20150615
    },
    {
      "title": "I really like this fitness tracker",
      "text": "I really like this fitness tracker; I was looking for a inexpensive option and this fits the bill. Be careful if using the clip vice the watch it can fall off quote easily if not tucked into pocket or tightly secured. Sleep monitoring is ok - often inaccurate by an hour or two. App works pretty well; I think it would be greatly improved if you could track more activities. Currently, they can logged but not tracked.",
      "rating": 4.0,
      "verified": true,
      "author": "Karen",
      "helpful_votes": 0,
      "publication_date": 20150112
    },
    {
      "title": "Not waterproof",
      "text": "I really love his product. Great for the price because it tracks sleep and fitness and everyone who I show the watch feature to thinks it's this crazy futuristic thing lol. However, it's not waterproof. After having it for a month, I wore it in the shower and it completely broke. What a shame :(",
      "rating": 3.0,
      "verified": true,
      "author": "Turwiathiel",
      "helpful_votes": 0,
      "publication_date": 20160505
    },
    {
      "title": "Customer service was fine from Misfit",
      "text": "The first one died after a week. Customer service was fine from Misfit, they sent me another one and \"deactivated\" the one that died. The second one fell out of the band after about a month. I put it in the previous band and that band also broke. I gave up. I liked the idea of a simple fitness tracker that doesn't need charged on a regular basis, but this one just didn't work.",
      "rating": 1.0,
      "verified": true,
      "author": "Frank R. Mineo",
      "helpful_votes": 0,
      "publication_date": 20171214
    },
    {
      "title": "NOT WATER RESISTANT!!",
      "text": "While the flash was a GREAT tracker for the first two weeks of use, the first time I swam in a pool with this supposedly \"water resistant\" device, water got inside the case and now it is a useless piece of crap on my nightstand. It would have worked out great had the Misfit not been specifically marketed as WATER RESISTANT UP TO 30 m and for use for swimmers!! Get this, but DONT wear it in the shower or pool!",
      "rating": 2.0,
      "verified": true,
      "author": "Mary Patton Kyser",
      "helpful_votes": 0,
      "publication_date": 20160803
    },
    {
      "title": "Disappointed",
      "text": "It's hard to find a tracker these days that you can clip or wear in the pocket. This was appealing because it had those options for those of us who don't want to wear a watch. It was a great solution -- for about six weeks. It was time to change the battery, which was a success. Then it stopped about 12 hours later. The display wouldn't light up, and the device wouldn't connect via bluetooth. I reached out to customer service and never heard back, which was frustrating. The search continues for a quality clip/pocket tracker.",
      "rating": 2.0,
      "verified": true,
      "author": "Randy Ford",
      "helpful_votes": 0,
      "publication_date": 20180711
    },
    {
      "title": "stopped working after 20 days",
      "text": "I've gone through many jawbones, and have been holding out for the iWatch. I saw a colleague with the MisFit and decided to buy it as a holdover, but I like it so much I think I'll use it long term. It's so easy, you never have to do anything. You open the app, and it automatically syncs and tells you how much sleep you got. I ended up buying for my wife and two teenagers, and they all love their misfit because it's so easy. 3-17-15: update - after buying 4 misfits for family, 2 have stopped working, and two bands have broken where it holds the fitness monitor. All within 30 days of purchase. Rubbish product. Don't buy.",
      "rating": 1.0,
      "verified": true,
      "author": "Jenifer Hansen",
      "helpful_votes": 0,
      "publication_date": 20150228
    },
    {
      "title": "STOP, BEWARE, AND KEEP LOOKING ELSEWHERE",
      "text": "Don't do it!!!!!!!!! Pass on it and find something else. It may seem inciting after reading some reviews and Youtube videos, but it is not a product worth your cash. I buy from Amazon all the time and this is the only review I've ever written because this product was used and It was somehow synced to other devices which made it impossible to link to our (my wife and I bought one) HD6 Kindle or ZTE Andriod phone before we opened it. The App is s***ty and does not work the same or properly on our devices. This product willbe do difficult to put up with.",
      "rating": 1.0,
      "verified": true,
      "author": "Bryce Cooper",
      "helpful_votes": 2,
      "publication_date": 20151126
    },
    {
      "title": "Is not worth its money",
      "text": "After 2 months of usage: 1. Is too fragile. Only 5 lights are still working. The main part always falls out from the bracelet. 2. I changed battery 3 times during 2 months - additional cost of 15$. My wife bought the same, she replaced battery 2 times in 1,5 months. We had to stop using it. 3. Is hardly splash proof. After washing hands with the tracker on me it stopped working. I had to dry it and wait for 1 day to be working again. The same happened after getting into rain. The only good thing in comparison to google fit and apple health on the phone is sleep tracking - it is quite accurate.",
      "rating": 1.0,
      "verified": true,
      "author": "Yuriy",
      "helpful_votes": 0,
      "publication_date": 20171011
    },
    {
      "title": "Great device: so far so good, fingers crossed!",
      "text": "I love my Flash so far. I honestly didn't expect much from it due to the low rating, but I personally haven't had any of the issues other reviewers are mentioning (band is still intact, no water damage, software has been decent). I think the weakest issue with the Flash is that it feels cheap, especially compared to the Shine...and me being an original Shine user, I do feel the quality difference. It is half of the price of the Shine, so I guess that's acceptable... Overall I'm giving it 5-stars since I haven't had issues yet, I will be updating my review as I use it more!",
      "rating": 5.0,
      "verified": true,
      "author": "Angela",
      "helpful_votes": 0,
      "publication_date": 20150928
    },
    {
      "title": "Returned item due to look, feel, anf functionality",
      "text": "Sent mine back. Too cheap looking and feeling in person (and I understand this is a very reasonably priced band). I just didn't like the look or feel of it and was worried that it could break at any second. Like lots of other commenters mentioned, it doesn't seem to fit in the hole of the band properly and unless you jam it in sideways so it is uneven on top, it's liable to fall out at any moment.",
      "rating": 2.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20161101
    },
    {
      "title": "I love the device",
      "text": "I love the device, I have had 3 other brands and really like how this is waterproof and can handle cycling, swimming or other activities. It is missing tracking stairs which I'm not concerned with. Problem is the stock band sucks, only lasted me 2 weeks. Accessories for it are lacking, the Shine has so many cool gagits, I would like to upgrade band. Otherwise lost 4 lbs in 2 weeks, it works.",
      "rating": 4.0,
      "verified": true,
      "author": "Karl Schimmel",
      "helpful_votes": 0,
      "publication_date": 20150223
    },
    {
      "title": "You get what you pay for.",
      "text": "My family and I ordered a total of six of these during and just after the holidays. Two of them stopped working properly with the first 2 weeks. These were replaced at no cost and the new ones received within a few days. This is a good product while it lasts but as of today's date 3/1/2016, only 2 of the 8 total are still functioning properly. Its true what they say, you get what you pay for. And now, its too late to return or replace as its been just over 60 days. This product is garbage, unless you only want to keep track of your steps and sleep for about 2 months.",
      "rating": 2.0,
      "verified": true,
      "author": "Daniel A. Cobreiro",
      "helpful_votes": 0,
      "publication_date": 20160301
    },
    {
      "title": "Easy to use, but not waterproof",
      "text": "Pros: great app interface, very easy to use for tracking exercise and sleep. Amazing price. Cons: We have two of these, and both have had trouble with water. Neither time were we at depth. Possibly it is something with warm water vs cool or cold, and with one recovery was possible after drying but not the other. Solution - don't use in bath or in water at all if possible. Band is also easily snapped where it holds the flash in place.",
      "rating": 3.0,
      "verified": true,
      "author": "Pid",
      "helpful_votes": 0,
      "publication_date": 20150607
    },
    {
      "title": "Great idea, poor execution",
      "text": "Overall I like the tracking and the sleep tracking but the plastic circle that holds the flash broke and I haven't even had it a month. I can't wear the clip at night and it doesn't stay on very well during the day either. So, great idea, poor execution. I have written them about the broken wristband, I will update when I hear from them. I requested a new band, we shall see. Though I do need to remember this is the cheapest one out there. Might have gotten what I paid for :(",
      "rating": 3.0,
      "verified": true,
      "author": "Sls",
      "helpful_votes": 0,
      "publication_date": 20150211
    },
    {
      "title": "and the band is very fragile and broke easily. However",
      "text": "I had a lot of problems with this device, to the point where Misfit replaced it three times before upgrading me to the Shine (Which I have had no problems with!). The Flash is definitely NOT meant to be worn in the water, the battery corroded every time I got it went in the shower, and the band is very fragile and broke easily. However, the app is amazing and the idea is good. Bottom line- spend a little more and get the Shine, save yourself the trouble I went through.",
      "rating": 2.0,
      "verified": true,
      "author": "Connie",
      "helpful_votes": 0,
      "publication_date": 20151023
    },
    {
      "title": "Just OK. should have splurged on the high end brand.",
      "text": "I liked this fitness wearable for the first week. It is now broke. The bracelet to hold the device cracked open while I was wearing it. It came with a little clip on holder for the device. It doesn't track properly. Other than this, the device is great at keeping me on track and updating, when it works. I liked the look of this fitness wearable over some of the others but I wished I would have got a different brand now.",
      "rating": 3.0,
      "verified": true,
      "author": "Natasha M. Duncan",
      "helpful_votes": 0,
      "publication_date": 20150108
    },
    {
      "title": "USELESS USED PRODUCT",
      "text": "I am so annoyed. I bought this but cannot use it because it is already linked to another account (which means I am receiving a used product and they didn't even take the time to unlink it from the previous account). So I cannot link it to my iPhone. So disappointing and so lame. Such a waste of time and money.",
      "rating": 1.0,
      "verified": true,
      "author": "MichelleG",
      "helpful_votes": 0,
      "publication_date": 20160427
    },
    {
      "title": "Item sent active on another account",
      "text": "Not sure how the Flash works. Was not able to use it; when trying to link it to my phone/app, app stated \"this device is linked to another account.\" I'm guessing I was sent a device that was returned. Well, you may get the same device; I already requested a return label.",
      "rating": 1.0,
      "verified": true,
      "author": "Carlos E. Recinos",
      "helpful_votes": 0,
      "publication_date": 20160919
    },
    {
      "title": "Pleased",
      "text": "Its a nice tracker for the money and i like that i can put it in the clip, or wear it as a watch. Overall i am very pleased to find a fitness tracker that will work with my windows phone.",
      "rating": 4.0,
      "verified": true,
      "author": "Laura W.",
      "helpful_votes": 0,
      "publication_date": 20170910
    },
    {
      "title": "It's okay - just not for me",
      "text": "It is a good device and pretty accurate with the step count. I didn't like the band, so I tried one of the leather ones, but that wasn't my cup of tea either; the band was too narrow and I felt like the whole thing looked too feminine on my wrist. I traded in my Fitbit Charge to try it out and found that I preferred the Fitbit. So when I saw that they had a good price on the Fitbit Charge HR, I bought that to replace the Flash.",
      "rating": 3.0,
      "verified": true,
      "author": "Chris Barton",
      "helpful_votes": 0,
      "publication_date": 20150126
    },
    {
      "title": "good product for the price",
      "text": "love it. can swim and get wet was the main reason for purchase and it excelent. band it came with broke the first day. thank goodness i read the reviews and bought another brand of band to go with it on my original purchase. i would definitely recommend for a tracker. have been comparing the step count with both my jawbone up and my samsung health and count was only 50 steps off for the day which is good",
      "rating": 5.0,
      "verified": true,
      "author": "hballparks",
      "helpful_votes": 0,
      "publication_date": 20151215
    },
    {
      "title": "very dissatisfied zero stars",
      "text": "This product is very difficult to use would never recommend to anyone. States on packaging and description of all the things it does and I can't find any of them ...don't need it to find my phone or send \"yo's\" to my friends....only wanted it to track steps and sleep. Can't step or sleep just trying to get it to work at all let alone properly",
      "rating": 1.0,
      "verified": true,
      "author": "Kate",
      "helpful_votes": 0,
      "publication_date": 20160710
    },
    {
      "title": "Clip is useless",
      "text": "I used clip. Broke within week. Bought more clips that broke. Finally lost the whole thing while clip broke when I was golfing. When it did work. I liked the app.",
      "rating": 1.0,
      "verified": true,
      "author": "E",
      "helpful_votes": 0,
      "publication_date": 20170716
    },
    {
      "title": "I like it",
      "text": "I very much like this purchase. I can track how far away I am to my daily goal and the time can check the time. The misfit support staff helps me greatly to understand how it works. And very important to me, the wrist band does not irritate my skin. Most silicone bands bother me. I would recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Double Zero",
      "helpful_votes": 0,
      "publication_date": 20170108
    },
    {
      "title": "it had a good price/quality point when bought",
      "text": "It keeps track of your fitness activity plus tells time. it had a good price/quality point when bought. Requires a battery replacement every 5 months or so.",
      "rating": 4.0,
      "verified": true,
      "author": "Alfred J.",
      "helpful_votes": 0,
      "publication_date": 20180311
    },
    {
      "title": "You get what you pay for",
      "text": "When I purchased the product, it looked much more premium, however this all changed when I opened the box. Inside was a mess of plastic, both the product itself and the actual packaging holding it. The band felt cheaper than a watch at 5 below, and the belt loop was a piece of plastic that would break in the first week. The device itself was smaller then it appears, and also felt extremely cheap. Overall I would not reccomend this product, even if the price is appealing.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20151212
    },
    {
      "title": "Simple yet profound.",
      "text": "If you are looking for an affordable fitness tracker, this is the way to go. It may not have all the bells and whistles of other trackers, but this one does all you need it to do. It is simple yet extremely functional. I really like that I don't have to charge this all the time. Just replace the battery every few months. You can't go wrong with this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Zachary Howard Hicks",
      "helpful_votes": 0,
      "publication_date": 20150904
    },
    {
      "title": "Band was of poor quality and very flimsy",
      "text": "Band was of poor quality and very flimsy. It broke within a few days of purchase. Fortunately I had an old band that would work with the new Flash.",
      "rating": 2.0,
      "verified": true,
      "author": "Betty Gregurek",
      "helpful_votes": 0,
      "publication_date": 20170709
    }
  ],
  "product_meta": {
    "title": "Misfit Wearables Flash - Fitness and Sleep Monitor (Black)",
    "description": "Color:BlackFrequently Asked Questions \nWhat mobile devices are supported?\nMisfit Flash is compatible with iPhone 4S/5/5C/5S/6/6 Plus, iPod Touch 5th Gen and above, iPad 3/4/Air/Mini (all running iOS 6.13 and above), Samsung Galaxy S4/Note 3, Google Nexus 4/5 (Or other BLE ready Android devices running software 4.3 and above) and BLE ready Windows Phone running software 8.1 and above.\n\nWhat do you mean by no charging ever?\nThe Misfit Flash is powered by a replaceable battery, found in quartz watches. Misfit recommends replacing it with a Panasonic CR2032 3V Lithium Coin Battery; other coin batteries may not be compatible. For battery installation, refer to the User Manual and view the battery installation video.\n\nHow do I sync my Misfit Flash?\nTo sync the Misfit Flash, download and open our Misfit app in the App Store on iOS, Google Play on Android and turn on Bluetooth. If the sync fails, you can reset the Shine by removing and reinserting the battery or turn off and back on the Bluetooth under your device settings or simply restarting your mobile device.\n\nWhy should I buy my Misfit Flash from Amazon?\nMisfit products are sold through an exclusive network of authorized dealers selected by Misfit, including sold by Amazon.com. Misfit’s warranty policy covers only products purchased through authorized dealers. To ensure that your Misfit product is authentic and protected by our warranty, please purchase from an authorized dealer, such as Amazon.com. Misfit products sold through third-party marketplace sellers may not be authentic and are not covered by Misfit’s warranty policy.\n\n\nFROM THE MANUFACTURER\nGet fit with Misfit Flash, a sleek, sporty fitness tracker that measures your activity and sleep, syncs with your smartphone, and comes in a variety of colors. Press Flash to see a halo of lights that shows your progress toward your daily activity goal and tells time. Flash never requires charging and is made of rugged, yet ultra-comfortable soft touch materials.",
    "rating": 3,
    "feature_bullets": [
      "Splashproof disc with red LED progress and time display",
      "Smart button enabled to control connected household devices",
      "Automatically tracks steps, distance, calories, and light and heavy sleep",
      "Flash Cyclist is water resistant up to 30m and suitable for everyday use. This means splash/rain resistant, NOT suitable for showering, bathing, swimming, snorkeling, and similar water work.",
      "Wirelessly syncs with paired smartphone to upload data and Non-charging, replaceable battery lasts up to 6 months"
    ],
    "specifications": {
      "Product Dimensions": "3.35 x 1.17 x 3.54 inches",
      "Item Weight": "1.92 ounces",
      "ASIN": "B00NIU9YG0",
      "Item model number": "S90F00AZ",
      "Batteries": "1 Lithium Metal batteries required.",
      "Customer Reviews": "3.0 out of 5 stars3,762 ratings3.0 out of 5 stars",
      "Best Sellers Rank": "#184,403 in Sports & Outdoors",
      "Is Discontinued By Manufacturer": "No",
      "OS": "_Windows, _Amazon_Fire, Apple_iOS, Apple_iOS, Android, Windows, Android",
      "Additional Features": "Fitness_tracker, Sleep_monitor, Pedometer, Calories, Distance",
      "Other display features": "Wireless",
      "Colour": "Black",
      "Department": "Unisex-child",
      "Manufacturer": "Misfit wearables",
      "Date First Available": "November 5, 2014"
    },
    "categories": [
      "Exercise & Fitness",
      "Sports & Outdoors",
      "Sports & Fitness",
      "Fitness Technology",
      "Activity & Fitness Trackers",
      "All Departments"
    ],
    "price": ""
  }
}