{
  "website_summaries": [
    {
      "verdict": "GNC’s hip and joint support supplement is packed with a number of ingredients proven to keep your cat’s joints pliable, and 120 chews will keep you covered for a long time.",
      "pros": [
        "Features chondroitin sulfate, MSM, and DHA for joint and hip health",
        "Yummy chicken liver flavor",
        "Soft and chewy treat-like supplement",
        "120 chews per bag"
      ],
      "cons": [
        "While the mixture of high-quality ingredients is fantastic for joint and hip health, this is an expensive supplement"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Have to trick him into eating them",
      "text": "My cat is adopted/foster from my best friend whose family moved and couldn't take him to the apartment with them. Supposedly, he used to eat this brand/flavor and, despite doing everything they did with these treats, i always have to trick him into eating them, and he's too smart and often ends up eating around most of the parts i break it into. We ended up buying him a different brand.",
      "rating": 3.0,
      "verified": true,
      "author": "Jared TWG",
      "helpful_votes": 3,
      "publication_date": 20200529
    },
    {
      "title": "Godsend for our older cat with joint pain.",
      "text": "We have a very finicky elder cat with severe joint discomfort and these treats make her 10 years younger again. It’s amazing how quickly they help, and equally how quickly it’s evident how much they are needed if we ever lapse in giving them to her. She is VERY picky about flavors and loves these things. Highly recommended for anyone with a cat with joint issues. Well worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Justin",
      "helpful_votes": 0,
      "publication_date": 20200813
    },
    {
      "title": "Vastly improved the mobility of our 12 yr old Russian Blue",
      "text": "These supplements have vastly improved the mobility of our 14lb, 12 yr old Russian Blue. He is an indoor/outdoor cat and loves to hunt anything that moves. Before the supplements he would sit with his left foot facing far away from his body. They have definitely improved his hips. He has no problem eating these as a treat. We feed him 2 in the am and 2 in the pm.",
      "rating": 5.0,
      "verified": true,
      "author": "kat29",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "Cat loves taste BUT SIX of 10 EXPIRED 3/20 from a June purchase",
      "text": "My 17 year old cat has had stiff joints for about a year. My vet recommends Cosequin chews but my cat won't eat. She LOVES the taste of these Hip & Joint chews. So I mix 2 of each broken up so she'll eat her Cosequin. Unfortunately GNC recently discontinued the H & J chews. I bought TEN packages from Amazon to keep my cat happy. Sadly only four of the ten are not expired.",
      "rating": 3.0,
      "verified": true,
      "author": "DaleAnn",
      "helpful_votes": 0,
      "publication_date": 20200622
    },
    {
      "title": "love product no longer making",
      "text": "my 15 yr old cat loves these. Now they are no longer making them at all. I can tell a huge difference now than before she started taking it. Hopefully i can find a replacement!",
      "rating": 5.0,
      "verified": true,
      "author": "jodi young",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "4 out of 4 cats say no.",
      "text": "We tried to get the cats to eat these. (three Bengals and a Maine Coon) We tried to give them one when they were eating other treats and mixed them in with regular treats, we cut them up into small pieces and put in their food, hid them in their favorite treat dispensing toy, etc. All four cats hated these. They would actually turn their nose up at their wet food if so much as a small bit of this was mixed in. The formula looks fine, but It's worthless if they won't eat it.",
      "rating": 1.0,
      "verified": true,
      "author": "M. Clark",
      "helpful_votes": 7,
      "publication_date": 20200526
    },
    {
      "title": "Try crumbling it over the crunchies!",
      "text": "Like a good number of folks have reviewed, my cat quick grew to dislike these when he realized that they weren't actually treats. It took a while, but I finally figured out how to slip him one - I crumble one vitamin up over his crunchies (with three cat treats and few freeze dried pellets) and give it to him that way. It may be easier to feed it to your cat in the morning when they are most hungry and to try giving one vitamin at a time. I only use this as a supplement so I don't give him two vitamins, just one.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Grey",
      "helpful_votes": 2,
      "publication_date": 20200618
    },
    {
      "title": "Way overpriced and ill represented. Do NOT waste your money.",
      "text": "Got them in the mail today, and was enraged when I saw how small the package was and how little we got. This is NOT worth your money. I will not be buying this again. The pictures on here make it look so much bigger but the package was smaller than the size of my hand, and the all the treats could fit within the palm of my hand. So disappointed. Next time I plan to look around more. Perhaps I can find something from Blue Buffalo. I love Blue Buffalo’s products.",
      "rating": 1.0,
      "verified": true,
      "author": "Elizabeth Marie Lewis",
      "helpful_votes": 4,
      "publication_date": 20200604
    },
    {
      "title": "Kitty Cat Fur Magic",
      "text": "My short haired cat has a very thick undercoat and sheds like mad. His fur has always had a greasy texture to it and I've been on a mad search to find something to give him a soft and clean coat. Adding these to his regular dry baths has been nearly magical. His coat is so soft and does not feel greasy. He loves the flavor which surprised me since he's a picky eater. I do have to break them apart because he has trouble chewing them whole. Overall 10/10",
      "rating": 5.0,
      "verified": true,
      "author": "Jaz",
      "helpful_votes": 0,
      "publication_date": 20200712
    },
    {
      "title": "Finicky cat likes it",
      "text": "I was concerned about my 14 year old cat's urinary health. Urine was smelling a bit like ammonia. I was familiar with the benefit of cranberry in treating human UTI's so I figured this product couldn't hurt my cat. I am able to add a little of the GNC Urinary Tract Support gel with her food. She is usually pretty finicky by likes it. It has been less than a week but her litter box smell has improved.",
      "rating": 4.0,
      "verified": true,
      "author": "Donald Gray",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "I do not recommend this product,it smell horrible!!",
      "text": "The smell about killed me and my cat hates this stuff.we will stay with greenies for hair ball,skin& fur care,she loves greenies!!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Marie",
      "helpful_votes": 2,
      "publication_date": 20200614
    },
    {
      "title": "Interesting response",
      "text": "My cat literally gags and throws up a little bit as he smells these vitamin chews. But then he goes ahead and eats them anyway? So I guess they are okay? Not even sure what to think. I'm even laughing a little as I write this...",
      "rating": 4.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 2,
      "publication_date": 20200724
    },
    {
      "title": "Cat Approved",
      "text": "Definitely CAT approved! My cat likes to flavor and give some the essential vitamins that he needs. He is he is very finicky and seems to take this supplement as a snack.. no complaints from me. I've already reordered additional packets.",
      "rating": 5.0,
      "verified": true,
      "author": "Jazzy",
      "helpful_votes": 0,
      "publication_date": 20200617
    },
    {
      "title": "Don't buy",
      "text": "My cat won't touch them He LOVES treats, but these? Won't go near them. Never had that issue",
      "rating": 1.0,
      "verified": true,
      "author": "CarolynJ",
      "helpful_votes": 2,
      "publication_date": 20200510
    },
    {
      "title": "Been using the product for years.",
      "text": "Our cat was having a problem with hair loss, couldn't figure out why. Started giving her two of these each morning, and the problems went away quickly. Use this every day.",
      "rating": 5.0,
      "verified": true,
      "author": "PapaRon",
      "helpful_votes": 0,
      "publication_date": 20201005
    },
    {
      "title": "Recommend it!",
      "text": "I’ve been purchasing this for a long time and it has always been great! Even though it’s not my cat’s favorite compared to her other snacks, she still is willing to eat it and there is a noticeable improvement in her coat. I think it’s worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Yukun Yu",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "Only one",
      "text": "Surprisingly our cats would eat only these multivitamins. And other brands are being rejected by them. And they are really picky.",
      "rating": 5.0,
      "verified": true,
      "author": "Vrozzi",
      "helpful_votes": 0,
      "publication_date": 20200828
    },
    {
      "title": "Pricey but tasty",
      "text": "My cat likes these treats/multivitamin supplement the best. Other, cheaper ones, she just won’t eat. I give her 2 pieces a day. Her coat is very lovely, in part, I believe, due to these.",
      "rating": 5.0,
      "verified": true,
      "author": "MSteinrich",
      "helpful_votes": 0,
      "publication_date": 20200716
    },
    {
      "title": "Good product",
      "text": "This seems to be good for all adult cats, young and old. Will definitely buy this again.",
      "rating": 4.0,
      "verified": true,
      "author": "L. C.",
      "helpful_votes": 0,
      "publication_date": 20200617
    },
    {
      "title": "She loves the taste",
      "text": "My kitty... Jezebel... Is getting older and I want to prolong her life as long as possible so my veterinarian advised me to buy this product for her joints and overall health... She really does like this flavor",
      "rating": 5.0,
      "verified": true,
      "author": "Kim Powell",
      "helpful_votes": 0,
      "publication_date": 20200520
    },
    {
      "title": "All my cats will eat these",
      "text": "All of my cats will eat these as opposed to other ones.i reordered",
      "rating": 5.0,
      "verified": true,
      "author": "marti klinger",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "Our kitty loves these.",
      "text": "Our kitty loves these and are the only vitamins he'll eat. GNC is very incompetent in keeping these in stock. Very poor service from GNC.",
      "rating": 5.0,
      "verified": true,
      "author": "Petenick",
      "helpful_votes": 0,
      "publication_date": 20200927
    },
    {
      "title": "This helps my cat",
      "text": "This product does a great job at keeping our cat's coat soft and helps eliminate some of the matting she is prone to as she has gotten older. I recommend giving it a try.",
      "rating": 5.0,
      "verified": true,
      "author": "Evin J. Willman",
      "helpful_votes": 0,
      "publication_date": 20190318
    },
    {
      "title": "Yuck",
      "text": "They won't eat it. Gross. Bad slimy gravy in a tube. Why did they stop making the treats but keep this yuck.",
      "rating": 2.0,
      "verified": true,
      "author": "Prof MacCreedy",
      "helpful_votes": 0,
      "publication_date": 20201110
    },
    {
      "title": "Cat loves these",
      "text": "I am honestly so surprised at how much my 8 month kitty cat loves these! I was expecting him to not be interested but instead he sits by the snack door waiting for his next serving",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 0,
      "publication_date": 20200813
    },
    {
      "title": "Nasty smell, cat won't eat it",
      "text": "My cat hated this. It smells horrible. He wouldn't eat it.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201112
    },
    {
      "title": "Would definitely recommend",
      "text": "Came quickly and exactly as pictured. My cat loves these! She thinks they're treats and will beg me for them. Her fur is shiny, and her dandruff problem seems to be getting better as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazing Customer",
      "helpful_votes": 2,
      "publication_date": 20170522
    },
    {
      "title": "Love love love this product",
      "text": "Love love love this product! I use this for my dog as well. Both animals have dry skin or hot spots and within two weeks I could see the itching stop. Packed with awesome nutrients for animals and their coats look amazing!",
      "rating": 5.0,
      "verified": true,
      "author": "Jenn Levine",
      "helpful_votes": 3,
      "publication_date": 20160110
    },
    {
      "title": "I don’t think cats like this",
      "text": "My cats refuse to eat this... none of them even want to try it.",
      "rating": 2.0,
      "verified": true,
      "author": "Kay L.",
      "helpful_votes": 0,
      "publication_date": 20200707
    },
    {
      "title": "Don’t be fooled by the description",
      "text": "The description said 45 count so I ordered them on cyber Monday for $10. But it is actually only one tiny bottle. I have 4 cats",
      "rating": 1.0,
      "verified": true,
      "author": "Meredith Nobles",
      "helpful_votes": 0,
      "publication_date": 20201201
    },
    {
      "title": "Great product",
      "text": "All 3 of my cats love them, very rare that happens!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200610
    },
    {
      "title": "Cats won't eat them",
      "text": "Not sure how they worked because both of my cats refuse to eat these.",
      "rating": 1.0,
      "verified": true,
      "author": "Rene Madsen",
      "helpful_votes": 0,
      "publication_date": 20200826
    },
    {
      "title": "Good product",
      "text": "Great product! Cat won't touch the food since I've put it on, but came fast and easy and was packaged well!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161128
    },
    {
      "title": "helped her joints feel better",
      "text": "My elderly cat loves these, she thinks they are a treat. But the best benefit is that she stopped limping and got her bounce back in her step a few weeks after starting to take them. We ran out and she has been a month without them now, she is starting to limp again and I can't wait to receive our next shipment so she can start to feel better again.",
      "rating": 5.0,
      "verified": false,
      "author": "Nacole Angela Jackson",
      "helpful_votes": 0,
      "publication_date": 20200530
    },
    {
      "title": "My cat loves these!",
      "text": "My cat is about 13 years old and loves these vitamins. I have tried other brands because Petsmart no longer carries the GNC brand and he did not like them at all so now I just order them online.",
      "rating": 5.0,
      "verified": false,
      "author": "Elena B. Marquez",
      "helpful_votes": 0,
      "publication_date": 20200602
    },
    {
      "title": "CAUTION -- May trigger Asthma",
      "text": "One of my cats is prone to asthma but hasn't had it in YEARS. After just a couple days of using this product, she started breathing funny, as if it was the start of an attack. Luckily it didn't get that far but I threw this away as soon as it started happening since it was the only real change I had done to her diet. So PLEASE be aware of this before using. If asthma isn't a problem with your cat, this product may be fine otherwise, just didn't get a chance to use it that long.",
      "rating": 2.0,
      "verified": false,
      "author": "J. Petrosky",
      "helpful_votes": 0,
      "publication_date": 20150410
    },
    {
      "title": "Cats wont touch it.",
      "text": "Purchased this from Petsmart. My cats refused to touch their food when i put this oil on it. They are little oinkers normally. The dose is too much, 1 Tablespoon a day!",
      "rating": 1.0,
      "verified": false,
      "author": "Catie Blazek",
      "helpful_votes": 0,
      "publication_date": 20150418
    }
  ],
  "product_meta": {
    "title": "GNC Pets Ultra Mega Supplements for Cats, Cat Supplements for Hip and Joint, Skin and Coat, and More",
    "description": "Style:Hip & Joint - Chicken - 45 CountGNC Pets gives dogs and cats the same care and attention to health as it does to their owners. Bred from the same company that paved the way in health and wellness, GNC now brings you an exclusive line of pet vitamins and supplements. Catered specifically to your pets needs, our products support your cats and canines' health from their whiskers to where they wag. Made with the same premium ingredients, quality, and care as the products for their pet parents, GNC Pets Vitamins & Supplements help both you and your pet live well. GNC Pets Ultra Mega Hip & Joint Health Premium Formula Soft Chews in Chicken is just what your cat needs to have an easier time getting around. Soft chews make it easier than ever for your kitty to get the necessary nutrients it needs for optimal joint and hip health. The savory chicken flavor of these chews will make your cat look forward to better health. Ideal for joint health, this cat supplement has a premium formula including glucosamine, chondroitin, and MSM. It also includes added omega-3 fatty acids for overall wellness. Intended for adult cats of all sizes, this cat joint supplement will get your cat on a clear path to better living. Warning— For animal use only. Keep out of reach of children and animals. In case of accidental overdose, contact a health professional immediately.YOUR SATISFACTION IS OUR PRIORITY- If you have any questions or feedback, please reach out to us directly at info@fetch4pets.com",
    "rating": 4.2,
    "feature_bullets": [
      "SUPPORTS JOINT HEALTH AND MOBILITY — Hip & Joint health chews contain omega-3 fatty acids, glucosamine, chondroitin, and MSM to promote healthy joint function",
      "EASY TO CHEW AND SWALLOW — Delicious soft chews are an easy alternative for cats with an aversion to pills. These chews have a natural chicken flavor, making it yummier than ever for your kitty to get the care it needs for its hips and joints",
      "BOOSTS MOBILITY — With high-quality ingredients that support connective tissue, this cat joint supplement helps your furry friend maintain normal, heathy joint function and mobility",
      "MADE IN THE USA — GNC Pets is proudly made in the US, providing you and your pet with safe, secure, and high quality products. GNC Pets ensures accurate labeling and manufacturing for consumer safety",
      "GNC PETS HEALTHY SOLUTIONS — GNC Pets supports happy, healthy pets. Taste tested and approved by cats and canines alike, our pet vitamins and supplements offer healthy solutions for your furry friends from head to tail"
    ],
    "specifications": {
      "Product Dimensions": "1.1 x 2.5 x 6.1 inches; 2.4 Ounces",
      "Item model number": "FF14396",
      "Date First Available": "September 10, 2017",
      "Manufacturer": "Fetch for Pets",
      "ASIN": "B00N7BOHDU",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Health Supplies",
      "Hip & Joint Care",
      "Pet Supplies",
      "Cats"
    ],
    "price": ""
  }
}