{
  "website_summaries": [
    {
      "verdict": "With a premium facelift and an eye-popping 5.7-inch Quad HD display, the Galaxy Note 4 continues Samsung's reign of phablet dominance.",
      "pros": [
        "Incredible Quad HD display",
        "New premium look and feel",
        "Flexible multitasking",
        "Improved stylus features",
        "Outstanding battery life"
      ],
      "cons": [
        "Trades comfort for style",
        "Requires some work to get the most out of the experience"
      ],
      "aspects": {},
      "publication_date": 20160229,
      "rating": 9.0,
      "source": "pcmag"
    }
  ],
  "customer_reviews": [
    {
      "title": "I LOVE my new Note 4",
      "text": "This Samsung Galaxy Note 4 has met all my expectations. The only draw back is that the description did not state the sim card size. I was lucky to find that ATT was able to cut my standard sized one down to the next sixe down at no charge. Phone worked immediately upon inserting the sim card. Once the shipping delay had been fixed, my phone arrived within 3 days. Love my new phone. Samsung is the best!",
      "rating": 5.0,
      "verified": true,
      "author": "Letty Sue Rosendale",
      "helpful_votes": 2,
      "publication_date": 20151009
    },
    {
      "title": "Overall a great phone. But I installed the available lollipop version ...",
      "text": "Overall a great phone. But I installed the available lollipop version of android and it has started creating a few problems here and there (mostly with gaming). The bluetooth seems to be disconnecting on regular intervals with my photive btw water resistant speakers, but this might just be coz of the confines of the shower room. For t-mobile I get 4G LTE (one of the reasons I researched and got this particular model). Battery life is awesome. The photo note is great for quick notes from articles and other imagery. I haven't yet seen the note charging faster as advertised. It still takes quite some time to charge to 50% (more than an hour unlike the advertised 30 min).",
      "rating": 4.0,
      "verified": true,
      "author": "Hari Chirra",
      "helpful_votes": 0,
      "publication_date": 20150515
    },
    {
      "title": "Great phone but.......",
      "text": "Great phone! Love the size and battery life. However the phone constantly freezes up. I just returned one for the same reason thinking it was that particular phone. However once I got this one I realized it is the 4 series. I will be going with Apple for my next phone now that they come in larger sizes.",
      "rating": 3.0,
      "verified": true,
      "author": "sean",
      "helpful_votes": 0,
      "publication_date": 20150930
    },
    {
      "title": "I got a chance to experience both phones and I must say the Note 4 was far better than the iPhone 6",
      "text": "Initially I was confused between iPhone 6 plus and the Note 4. I got a chance to experience both phones and I must say the Note 4 was far better than the iPhone 6. I did lots of research and found out that this was exactly the phone I wanted. Since its unlocked I can use it anywhere in the world. I recommended the phone to few of my other friends an they bought it too. They absolutely love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Binoj",
      "helpful_votes": 0,
      "publication_date": 20150214
    },
    {
      "title": "Three Stars",
      "text": "It good but it not work properly it frozen sometime.",
      "rating": 3.0,
      "verified": true,
      "author": "sokhorn bun",
      "helpful_votes": 0,
      "publication_date": 20160517
    },
    {
      "title": "It is not international unblocked, I'm still trying to ...",
      "text": "It is NOT international unlocked, I'm still trying to unlock it for a Southamerican country, besides, it only brings one type of plug and it's European I'm not able to give any opinion until it is unlocked. Dissapointed IF IT IS EUROPEAN DONT BUY (ITALY) FOR AN AMERICAN COUNTRY OTHERWISE YOU HAVE TO UNLOCK IT (Sorry but in Spanish we use the word \"unblock\" instead of >Unlock<)",
      "rating": 1.0,
      "verified": true,
      "author": "MEG",
      "helpful_votes": 4,
      "publication_date": 20150619
    },
    {
      "title": "After using the phone for about three days of normal ...",
      "text": "After using the phone for about three days of normal usage i would charge the phone overnight and use it in the day. the phone would go dead at 50% charge. This is not what i expected.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170430
    },
    {
      "title": "... of these as gifts for my parents and they love it. Picture quality is amazing too",
      "text": "Ordered two of these as gifts for my parents and they love it. Picture quality is amazing too.",
      "rating": 5.0,
      "verified": true,
      "author": "Aba Eshun",
      "helpful_votes": 0,
      "publication_date": 20150920
    },
    {
      "title": "Power Packed Phone",
      "text": "Solid Build..Vivid Colour..Excellent camera sensor and processing..Multiple options with S pen..Powerful Processor...Large enough space...Fast charging...What else you want??!!",
      "rating": 5.0,
      "verified": true,
      "author": "Selvakumar",
      "helpful_votes": 0,
      "publication_date": 20150128
    },
    {
      "title": "I'm absolutely in love with this phone",
      "text": "I'm absolutely in love with this phone, it got here on time exactly as advertised and it's not a knockoff. Works well on tmobile",
      "rating": 5.0,
      "verified": true,
      "author": "Seleste",
      "helpful_votes": 0,
      "publication_date": 20150627
    },
    {
      "title": "Best Device ever",
      "text": "The Snapdragon is amazing .. i think thats enough 😊 Just Be careful with the display. . It scratches easily.",
      "rating": 5.0,
      "verified": true,
      "author": "Omer",
      "helpful_votes": 0,
      "publication_date": 20150404
    },
    {
      "title": "... been opened but as for my mobil came in good condition all",
      "text": "I gave it 4 stars because the box had been opened but as for my mobil came in good condition all perfect",
      "rating": 4.0,
      "verified": true,
      "author": "Emilian",
      "helpful_votes": 0,
      "publication_date": 20150725
    },
    {
      "title": "So sad that i order it and i can't use it ...",
      "text": "So sad that i order it and i can't use it here in US due to my inability to activate because melt to be activated in the European zone before it can be use anywhere in world As a result i have to return. So sad that i return it because after having the refund i spend the money on something else and up till today i couldn't buy the phone again so sad.",
      "rating": 1.0,
      "verified": true,
      "author": "Diesel",
      "helpful_votes": 4,
      "publication_date": 20150430
    },
    {
      "title": "I lost my cell phone and want to lock it ...",
      "text": "I lost my cell phone and want to lock it but do not have the IMEI code. In case do not find , you can give me",
      "rating": 5.0,
      "verified": true,
      "author": "David Espín",
      "helpful_votes": 0,
      "publication_date": 20150514
    },
    {
      "title": "Nice product",
      "text": "Everything with the phone is up to my expectations but just that it was not delivered on the said time.",
      "rating": 5.0,
      "verified": true,
      "author": "DANIEL ANSAH OWUSU",
      "helpful_votes": 0,
      "publication_date": 20150611
    },
    {
      "title": "Happy with my phone",
      "text": "I love my phone. Just as describtion says. Would recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "egipitian",
      "helpful_votes": 0,
      "publication_date": 20150413
    },
    {
      "title": "This phone is excellent This device is loaded with many features",
      "text": "This phone is excellent This device is loaded with many features, what I like about this phone the most is, it battery last very long",
      "rating": 5.0,
      "verified": true,
      "author": "Amadu T. bah",
      "helpful_votes": 0,
      "publication_date": 20150729
    },
    {
      "title": "Five Stars",
      "text": "Amazing phone. My dad is very happy with his purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniela",
      "helpful_votes": 0,
      "publication_date": 20150714
    },
    {
      "title": "Love the phone",
      "text": "Love the phone. Only one thing is LTE won't work on AT&T or T-Mobile network, so your gonna be stuck with 4G or HSP+.",
      "rating": 5.0,
      "verified": true,
      "author": "Mani",
      "helpful_votes": 0,
      "publication_date": 20150116
    },
    {
      "title": "Love this phone",
      "text": "Good Battery life, great large screen, like the fingerprint and the s-pen. Love this phone",
      "rating": 5.0,
      "verified": true,
      "author": "Ahmed Morsy",
      "helpful_votes": 0,
      "publication_date": 20150421
    },
    {
      "title": "Buyer Beware, Cellphone is dead!",
      "text": "Buyer Beware, Samsung's Policy and TechnoMaster Costumer Service. My cellphone is complete DEAD and useless! Samsung's Policy My cellphone is complete DEAD! The cellphone that TechnoMaster selled me was a UK version of the phone. As Samsung Policy clearly says, the WARRANTY SHOULD BE COVERED IN THE COUNTRY IT WAS SELLED. So they suggested taking a flight to UK and personally solving my problem. It is the stupidest thing I have ever heard. Companies should have International Warranty to their products. So in case you receive a defect item you should considered buying a 2000 ticket and solve your problem yourself. They do not accept sending it through Carrier.",
      "rating": 1.0,
      "verified": true,
      "author": "Carlos",
      "helpful_votes": 4,
      "publication_date": 20150723
    },
    {
      "title": "Worth it",
      "text": "Awesome specs great phone recommend it to anyone wanting a larger phone. Also great that my seller shipped free and I got it just as fast as amazon prime",
      "rating": 5.0,
      "verified": true,
      "author": "Davidxito",
      "helpful_votes": 0,
      "publication_date": 20160213
    },
    {
      "title": "Good stuff. but battery is used to fast then ...",
      "text": "Good stuff. but battery is used to fast then my Note 2. I can't used this phone whole day like Note 2 did.",
      "rating": 3.0,
      "verified": true,
      "author": "alexren1968",
      "helpful_votes": 0,
      "publication_date": 20150531
    },
    {
      "title": "IS A BAD FAKE CLONE OF SAMSUNG S4",
      "text": "IS A BAD FAKE CLONE OF SAMSUNG S4.. ROOTED?? NOT WORK WITH A MOVISTAR GSM IN MEXICO.. DONT WORK WITH FIND MY MOBILE IN SAMSUNG ACCOUNT.. FAKE FAKE FAKE",
      "rating": 1.0,
      "verified": true,
      "author": "Victor R.",
      "helpful_votes": 4,
      "publication_date": 20150402
    },
    {
      "title": "Carefull",
      "text": "Fantastic phone worked well for a few weeks, came with a lose charging port and a big scratch on the screen, dose not turn on what so ever and asked them to replace it and they said no, they told me to sell it and buy a new one SELL A BROKEN PHONE?!?!?!?",
      "rating": 2.0,
      "verified": true,
      "author": "Christopher J N",
      "helpful_votes": 14,
      "publication_date": 20180410
    },
    {
      "title": "Having had a bad experienced from another seller when I had to return ...",
      "text": "Having had a bad experienced from another seller when I had to return the defective phone it was with trepidation that I made this order. However, the phone was as described and, after five days use, does all that it should and is a great improvement on a Note2",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20180325
    },
    {
      "title": "Wrong version sent",
      "text": "Advertised SM-N910FZKEDBT but sent an N910T (which is US model). Pretty useless and phone could not get signal. Attempting return.",
      "rating": 1.0,
      "verified": true,
      "author": "Shay",
      "helpful_votes": 5,
      "publication_date": 20190405
    },
    {
      "title": "Faulty phone",
      "text": "Faulty phone. They expect you to pay to return faulty item. They then ask you to pay again to return the phone back to you when fixed or replaced. Cost me £18 on top of the price to replace a faulty phone Please read terms before purchasing",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20191017
    },
    {
      "title": "Phone said unlocked but says China telecom when first switch ...",
      "text": "Phone said unlocked but says China telecom when first switch phone on. Headsocket to listen to music didn't work either",
      "rating": 1.0,
      "verified": true,
      "author": "Kelly clay",
      "helpful_votes": 10,
      "publication_date": 20170206
    },
    {
      "title": "Brand-new with security seals intact",
      "text": "Perfect in every way, the box security seals were intact and the phone is perfect in every way. There's not much more I can say really.",
      "rating": 5.0,
      "verified": true,
      "author": "Tech Doctor",
      "helpful_votes": 4,
      "publication_date": 20160301
    },
    {
      "title": "Poor quality phone for price",
      "text": "Phone was overheating dramatically,and was slow ( laggy ) when playing games using the spen,also think it was a german handset as that was the country which was shown first when phone was powered on,and finally the actual phone box looked like it was worse than 2nd hand,the IMEI label had been ripped off,so seemed a bit dodgy",
      "rating": 1.0,
      "verified": true,
      "author": "Eric Henderson",
      "helpful_votes": 0,
      "publication_date": 20200521
    },
    {
      "title": "Fast and exactly as described",
      "text": "Exactly as desribed and works great still after a while. The cables supplied were not great but easily replaced and I have tonnes of them about.",
      "rating": 5.0,
      "verified": true,
      "author": "Miss fhj Wise",
      "helpful_votes": 0,
      "publication_date": 20181113
    },
    {
      "title": "Very satisfied with the phone.",
      "text": "The condition of the phone was better than described, and it arrived the very next day. It was completely wiped of data, and setting it up was just as for a new phone. I am very pleased with this item, and judging from my experience here can warmly recommend the seller.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20190220
    },
    {
      "title": "Good working condition",
      "text": "Was in good condition, only thing that doesn't work is the finger print but my daughter is still very happy, Thank you",
      "rating": 5.0,
      "verified": true,
      "author": "Sharon",
      "helpful_votes": 0,
      "publication_date": 20181017
    },
    {
      "title": "Galaxy Note 4",
      "text": "This mobile is great, all you can ask for. Big screen, quick, very good looking. Very good fast delivery, I would definitely definitely use this seller again.",
      "rating": 5.0,
      "verified": true,
      "author": "michael strange",
      "helpful_votes": 0,
      "publication_date": 20190304
    },
    {
      "title": "Make sure they are always checked",
      "text": "Received the note just dead didn't work at all charged battery still nothing put different battery which was 2 days still no lifextra so either someone was trying to rip me off or it wasn't checked",
      "rating": 1.0,
      "verified": true,
      "author": "Tony white ",
      "helpful_votes": 0,
      "publication_date": 20180725
    },
    {
      "title": "Good phone at a great price",
      "text": "I've had my Note 4 for six months now and it's proved a great little phone which as had no problems. Very happy with my purchase and would recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Thoreau",
      "helpful_votes": 0,
      "publication_date": 20181209
    },
    {
      "title": "I'm glad to have found it here",
      "text": "I have wanted this item for a long time. I'm glad to have found it here. It arrived as described. I hoped for a complete original box, with box cover, handbook, in-ear headphones and extra spen tips, but that was not on the item's description, so no complaints.",
      "rating": 5.0,
      "verified": true,
      "author": "FS",
      "helpful_votes": 0,
      "publication_date": 20170518
    },
    {
      "title": "Do Not Buy",
      "text": "Bought this refurbished phone and was immediately disappointed I think I got scammed. The phone stopped working within 2 weeks. Wasted so much money",
      "rating": 1.0,
      "verified": true,
      "author": "Ebi-Freihrer Oroso",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "arrived on time. I wish the notification light was ...",
      "text": "arrived on time. I wish the notification light was bigger that a tiny little dot. and it is only one colour notification light .",
      "rating": 4.0,
      "verified": true,
      "author": "yasser rustom",
      "helpful_votes": 0,
      "publication_date": 20171214
    },
    {
      "title": "Five Stars",
      "text": "perfect. I've had it for nearly a year still love it. Worth 6 stars",
      "rating": 5.0,
      "verified": true,
      "author": "RS Gallagher",
      "helpful_votes": 0,
      "publication_date": 20160205
    },
    {
      "title": "Five Stars",
      "text": "like this phone a lot performs better than my s5",
      "rating": 5.0,
      "verified": true,
      "author": "lisa p",
      "helpful_votes": 0,
      "publication_date": 20160914
    },
    {
      "title": "Great product at a great price",
      "text": "Delivery much faster than advertised. Great product at a great price.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160805
    },
    {
      "title": "Received in good time as promised",
      "text": "All items were intact. Received in good time as promised.",
      "rating": 4.0,
      "verified": true,
      "author": "Phina Kamanyire",
      "helpful_votes": 0,
      "publication_date": 20171010
    },
    {
      "title": "Absolutely great! If you want something really good",
      "text": "Absolutely great ! If you want something really good , buy one .",
      "rating": 5.0,
      "verified": true,
      "author": "FlorinP",
      "helpful_votes": 0,
      "publication_date": 20160217
    },
    {
      "title": "Five Stars",
      "text": "Good price. Good product. And not quite as big as you'd think.",
      "rating": 5.0,
      "verified": true,
      "author": "Randy Banks",
      "helpful_votes": 3,
      "publication_date": 20150730
    },
    {
      "title": "Seller email said \"its new\" ...ITS NOT!",
      "text": "A lot of money for an unsealed box with a phone that has so many flaws when compared with my mum's genuine note 4. Screw loose, camera off centre etc...Appalling!",
      "rating": 1.0,
      "verified": true,
      "author": "Tiffany",
      "helpful_votes": 6,
      "publication_date": 20170429
    },
    {
      "title": "Great phone I just got unlucky",
      "text": "Phone is a great piece of equipment, cant fault Samsung on this one. Unfortunately I bought a refurbished version and my charging port is knackered due to water damage, forking out for a replacement wasn't something I thought I'd have to do.",
      "rating": 3.0,
      "verified": true,
      "author": "Kieran",
      "helpful_votes": 3,
      "publication_date": 20160815
    },
    {
      "title": "the phone is out of warranty in Greece does not ...",
      "text": "the phone is out of warranty in Greece does not support upgrades. At the time of purchase there was no complete information.",
      "rating": 1.0,
      "verified": true,
      "author": "Charalampos Parisis",
      "helpful_votes": 0,
      "publication_date": 20170907
    },
    {
      "title": "Item exactly as described",
      "text": "Item arrived exactly as described. Postage was very quick and phone working perfectly. thanks.",
      "rating": 5.0,
      "verified": true,
      "author": "ADRIAN BCL",
      "helpful_votes": 0,
      "publication_date": 20180717
    },
    {
      "title": "Faulty Product",
      "text": "Appalling quality product. The phone worked for a month then died. Attempts to reach out to the company for a repair were met with silence. Will be warning all my collegues, customers and friends not to use this vendor.",
      "rating": 1.0,
      "verified": true,
      "author": "E. P.",
      "helpful_votes": 0,
      "publication_date": 20180625
    },
    {
      "title": "Simply the best phone on the market",
      "text": "This phone is superb. Better than anything put there. Camera = Decent, big enough screen for movies and game, yet fits in any normal sized pocket (don't wear skinny jeans though) Great for retro emulation and perfect as a gameboy. I know people that buy this phone purely for drawing and games. They don't even use a sim card in it, because the phone is just so good it doesn't even need to be a phone. Sell your apple / iphones, this is the business.",
      "rating": 5.0,
      "verified": true,
      "author": "Ukdesign",
      "helpful_votes": 0,
      "publication_date": 20160526
    },
    {
      "title": "Great transaction",
      "text": "Very quick dispatch, it's only been a few days and all is going well with note 4. Battery life is good, but saying that, I think it's a brand new one anyway, but overall, just as I expected. Many thanks",
      "rating": 5.0,
      "verified": true,
      "author": "shirleymc",
      "helpful_votes": 0,
      "publication_date": 20170106
    },
    {
      "title": "honest reveiw",
      "text": "Was sent a faulty phone first. Seller was happy to replace. Second was in a nicer condition as an added bonus. The phone itself is very powerful and worth the money. If you don't mind the size I would definitely recommend it.",
      "rating": 4.0,
      "verified": true,
      "author": "Dee",
      "helpful_votes": 9,
      "publication_date": 20160419
    },
    {
      "title": "Its a great phone but.....",
      "text": "Came packed very well and the phone worked for a month or so just fine but after that the phone will no longer restart or charge while off and if It dies I have to take the battery out for 10 mins to get it to turn back on or it will go to a \" downloading do not turn off target\" and the battery has to come out to get off of that sceen but other that that phone works fine",
      "rating": 3.0,
      "verified": true,
      "author": "Josh",
      "helpful_votes": 0,
      "publication_date": 20180428
    },
    {
      "title": "Best phablet/phone ever",
      "text": "This phone came with marshmallow installed, brand new just box opened for pics... This is exactly what they described and it is the case, extremely pleased. Note 4 works better than any phone I have had or tried, get one don't hesitate you'll love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Russ",
      "helpful_votes": 2,
      "publication_date": 20171004
    },
    {
      "title": "Dangerous",
      "text": "Wouldn't even give this seller 1 star. Heated up to the point of exploding. Had to remove battery with a cloth it was that hot. Cheap battery inside as well. Samsung are good phones. Just be careful who you buy from. Better buying from Amazon direct and not marketplace",
      "rating": 1.0,
      "verified": true,
      "author": "Stephen & Rena Hurst",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "The origin of the phone was unknown, extremely hot while charging. Not new!",
      "text": "I had to resend it as the phone's origin was unknown - the original sticker with all Samsung serial numbers under the battery was removed - it wasn't a new phone! The back of the phone wasn't original. The box wasn't original too, but nicely packed... The phone was getting extremely hot while charging. There was one plus - I got full refund. So don't buy it!!!",
      "rating": 1.0,
      "verified": true,
      "author": "E.",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "Samsung Galaxy Note 4",
      "text": "Great value at the price I paid £235, and you can replace the battery, unlike the later Samsung Note models. Does everything I need it to do.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul  A  Blakey",
      "helpful_votes": 2,
      "publication_date": 20161229
    },
    {
      "title": "Galaxy Note 4 amazing",
      "text": "This phone if indeed is ideal for my needs...easy to use and navigate...the apps are plentiful although I use only a few...",
      "rating": 5.0,
      "verified": true,
      "author": "Martin Swift",
      "helpful_votes": 0,
      "publication_date": 20200228
    },
    {
      "title": "simple and good.",
      "text": "so lucky to find a great deal, its a great phone, get an extra battery, it destroys battery power. Still for something so old it has great features. very happy.",
      "rating": 5.0,
      "verified": true,
      "author": "O. Y. T. Winzenburg",
      "helpful_votes": 0,
      "publication_date": 20181204
    },
    {
      "title": "Great condition large screen",
      "text": "Great condition and keenly priced the note 4 is still a very powerful large screen mobile phone. I have since put my tablet away so no need to carry 2 devices - this one does it all",
      "rating": 5.0,
      "verified": true,
      "author": "Colin Weston",
      "helpful_votes": 0,
      "publication_date": 20180608
    },
    {
      "title": "Works ok so far",
      "text": "Apart from having to purchase a new battery this phone is working well. I bought it to replace the same make and model who's led display became faulty.",
      "rating": 4.0,
      "verified": true,
      "author": "Creamkate",
      "helpful_votes": 0,
      "publication_date": 20181104
    },
    {
      "title": "Five Stars",
      "text": "Awesome phone. Simple easy to use handset. Second one and will keep getting until it no longer is viable",
      "rating": 5.0,
      "verified": true,
      "author": "Giftedwolf1",
      "helpful_votes": 0,
      "publication_date": 20170410
    },
    {
      "title": "Easy to setup and use",
      "text": "So far is great and that's why four stars ,just to find case and I a happy bunny. I like the fact that you covered for 12 month's so may have to call again next year .",
      "rating": 4.0,
      "verified": true,
      "author": "ladyjane",
      "helpful_votes": 0,
      "publication_date": 20181031
    },
    {
      "title": "The phone worked ok but the battery runs down very ...",
      "text": "The phone worked ok but the battery runs down very very quickly. 4g was very slow not sure why.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170328
    },
    {
      "title": "Great second hand phone",
      "text": "The phone is as described. Arrived on time. I would buy again",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 2,
      "publication_date": 20161030
    },
    {
      "title": "Excellent but too many captive apps.",
      "text": "Good as Galaxy 3 not a lot of difference! Too many apps attached!",
      "rating": 5.0,
      "verified": true,
      "author": "GREYHOUND",
      "helpful_votes": 0,
      "publication_date": 20160903
    },
    {
      "title": "I need a working phone because of a lot of appointments",
      "text": "The samsung note4 that i bought on here well it has scraches on the screen and the on paint work and battery dose not hold its charge the screen has the last pages burnt into the screen and it keeps resetting turning off and back on when your in the middle of something the paint work is scratch had to buy new battery. ty paul",
      "rating": 1.0,
      "verified": true,
      "author": "Paul sutton",
      "helpful_votes": 5,
      "publication_date": 20180730
    },
    {
      "title": "Great phone",
      "text": "Reliable seller! Great phone. Still in early stages but you wouldn't be disappointed in this phone. Top specs and also good looking phone. Stylus adds the whole tablet feel to it. One big thing that stands out is the screen and colours.",
      "rating": 5.0,
      "verified": true,
      "author": "Deandray",
      "helpful_votes": 0,
      "publication_date": 20160602
    },
    {
      "title": "A very good phone for the price if there was no manufacturing defect.",
      "text": "The phone was amazing. But the speaker wasn't working. I had to return it 😒☹",
      "rating": 3.0,
      "verified": true,
      "author": "Shantala",
      "helpful_votes": 2,
      "publication_date": 20170512
    },
    {
      "title": "Note 4 still the best phone - can change battery, SD card, run latest Android, use stylus",
      "text": "The Note 4 is still the best phone out there. Unlike the later sealed phones that run out of storage and cannot have the battery replaced, the Note 4 runs the latest Android, has the awesome power of the stylus, can have storage upgraded by adding the right sized SD card (SD storage is getting bigger all the time, so you can keep up with your storage needs) and of course you can carry spare batteries and never run out of charge. It's the best option by far until someone brings out an upgrade to it that still keeps these benefits.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. B. M. Kieser",
      "helpful_votes": 4,
      "publication_date": 20161220
    },
    {
      "title": "Dodgy Galaxy Note 4 !!!",
      "text": "This was a nightmare, seems to be a fake or dodgy item. First Google Play Service would not work at all, digging deeper it seems the firmware is Chinese instead of UK/European. Charging plug is 2 pin foreign plus lead did not fit correctly and would not allow connection to PC. Returned immediately for full refund. Total waste of time and energy plus I had to drive 20 mile round trip to drop off at collect+ store. I also purchased accessories to go with it which have all had to be returned as surpus now. Will never purchase anything like this again from Amazon!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Scion",
      "helpful_votes": 2,
      "publication_date": 20161218
    },
    {
      "title": "bit disappointed",
      "text": "I love the phone but am disappointed that the screen has one bad scratch and a few small scratches, indicating the previous owner did not use a screen saver. I feel for the price it should have been in better condition.",
      "rating": 4.0,
      "verified": true,
      "author": "Eileen",
      "helpful_votes": 3,
      "publication_date": 20160619
    },
    {
      "title": "This is the N910a AT&T model which you cannot root ...",
      "text": "This is the N910a AT&T model which you cannot root. If you're looking for a rootable Note4 do NOT buy this one. Also did not come with a UK plug adapter contrary to the representation made by the seller.",
      "rating": 2.0,
      "verified": true,
      "author": "Rach",
      "helpful_votes": 3,
      "publication_date": 20170429
    },
    {
      "title": "will surely recommend to friends",
      "text": "item as described! fast delivery! will surely recommend to friends!",
      "rating": 5.0,
      "verified": true,
      "author": "ALDEN T PUZON",
      "helpful_votes": 2,
      "publication_date": 20150424
    },
    {
      "title": "You will love it if you like to watch movies or videos on your phone!",
      "text": "Beautiful phone, great display! I live far away from my work, so I usually watch videos or movies on my smartphone, I decided to upgrade to the Note 4 because of the display, the colors are beautiful and HD videos look great, this a great option if you like to watch videos all the time on your phone but you dont want a tablet. The camera is really good, I really like the quality of the pictures and its really easy to navigate on the internet using the pen, specially if you need to copy text or cut of pieces of a website, the pen is smart and useful. Awesome phone, I'm glad I bought it.",
      "rating": 5.0,
      "verified": false,
      "author": "Albin",
      "helpful_votes": 0,
      "publication_date": 20150402
    }
  ],
  "product_meta": {
    "title": "Samsung Galaxy Note 4 SM-N910F Factory Unlocked Cellphone, International Version, Black",
    "description": "Samsung SM-N910F, Galaxy. Taille de l'écran: 14,48 cm (5.7'), Résolution de l'écran: 2560 x 1440 pixels, Type d'écran: SAMOLED. Fréquence du processeur: 1,9 GHz, Fréquence du coprocesseur: 2,7 GHz. RAM interne: 3072 Mo, Capacité de stockage interne: 32 Go, Cartes mémoire compatibles: MicroSD (TransFlash). Résolution de la caméra principale (numerique): 16 MP, Modes d'enregistrement vidéo: 1080p, 720p, Cadence maximale: 60 pieds par seconde. Capacité de la carte SIM: SIM unique, Type de carte SIM: MicroSIM, Normes 2G: EDGE, GPRS, GSM Écran exceptionnel (Une qualité visuelle exceptionnelle) Bénéficiez d'une qualité d'image exceptionnelle, qui dépasse les limites de l'il humain. Avec des couleurs plus riches et un contraste plus élevé de l'écran Quad HD Super AMOLED 5.7', vous profiterez de couleurs fluides et éclatantes, comme si vous les regardiez à l'il nu. Profitez d'une expérience visuelle époustouflante grâce à la haute résolution de l'écran. Il est véritablement optimisé pour la navigation sur le Web et la lecture de livres électroniques. Images nettes et éclatantes grâce à un appareil photo amélioré L'obscurité n'est plus un problème, capturez en toute simplicité les meilleurs instants de votre vie. Grâce à l'appareil photo et à la caméra frontale, capturez des images plus nettes et plus lumineuses que jamais. L'objectif frontal F1.9 de 3.7 mégapixels et l'appareil photo de 16 mégapixels, doté d'un OIS intelligent, vous permettent d'obtenir une image de qualité incomparable à tout moment de votre vie, même dans des environnements peu éclairés. Smart Select Sélectionnez, copiez et collez du contenu. Grâce au stylet S Pen, sélectionnez en toute simplicité le contenu de n'importe quel texte, écran ou application. Rassemblez, partagez et enregistrez en même temps les c",
    "rating": 3.6,
    "feature_bullets": [
      "GSM (2G) GSM 850 MHz, GSM 900 MHz, DCS 1.800 MHz, PCS 1.900 MHz",
      "UMTS (3G) B1 (2100), B2 (1900), B5 (850), B8 (900)",
      "4G FDD LTE B1(2100), B2(1900), B3(1800), B4(AWS), B5(850), B7(2600), B8(900), B17(700), B20(800)",
      "Unlocked cell phones are compatible with GSM carriers such as AT&T and T-Mobile, but are not compatible with CDMA carriers such as Verizon and Sprint.",
      "This cell phone may not include a US warranty as some manufacturers do not honor warranties for international version phones. Please contact the seller for specific warranty information."
    ],
    "specifications": {
      "Product Dimensions": "6.04 x 3.09 x 0.33 inches",
      "Item Weight": "6.2 ounces",
      "ASIN": "B00NB1DVQA",
      "Item model number": "SM-N910FZKEDBT",
      "Batteries": "1 A batteries required.",
      "Customer Reviews": "3.6 out of 5 stars589 ratings3.6 out of 5 stars",
      "Best Sellers Rank": "#128,126 in Cell Phones & Accessories",
      "Is Discontinued By Manufacturer": "No",
      "OS": "Android 4.4.4",
      "RAM": "3072 MB",
      "Wireless communication technologies": "Cellular",
      "Additional Features": "Touchscreen, Dual-camera, Lte, Smartphone, Expandable-memory",
      "Display technology": "Super AMOLED",
      "Other display features": "Wireless",
      "Device interface - primary": "Touchscreen, Microphone",
      "Scanner Resolution": "1920 x 1080",
      "Form Factor": "Smartphone",
      "Colour": "Black",
      "Manufacturer": "Samsung",
      "Date First Available": "October 12, 2014"
    },
    "categories": [
      "Cell Phones & Accessories",
      "Cell Phones",
      "Unlocked Cell Phones",
      "All Departments"
    ],
    "price": ""
  }
}