{
  "website_summaries": [
    {
      "verdict": "Although not as rich as some formulas, this shampoo is a good choice for anyone who wants a gentle, nice smelling shampoo without sulfates or artificial ingredients.",
      "pros": [
        "Formulated with all-natural, organic ingredients, and organic plant-based botanicals that help remove build-up",
        "Sulfate-free",
        "Contains no artificial ingredients or harsh chemicals",
        "Has a pleasant scent",
        "No animal testing",
        "Gentle for sensitive skin and youngsters"
      ],
      "cons": [
        "Consistency is thin",
        "Doesn't tend to produce much in the way of foamy lather",
        "Some users gripe about having to use a lot for it to be effective"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Brown Nasty Gel - Not Babo",
      "text": "The bottle was totally sealed but once opened we found this nasty brown gel. It smells like chemicals. This is NOT the Babo that I have been buying for over a year!",
      "rating": 1.0,
      "verified": true,
      "author": "Katherine Guercio",
      "helpful_votes": 28,
      "publication_date": 20190210
    },
    {
      "title": "Works well for people who swim a lot",
      "text": "This is a great item. I'm an avid swimmer and do about 3-4 miles per week currently in the pool. I also used this when I was training for an ironman and was swimming much more frequently and longer distances. It removes chlorine smell and buildup. I have darker blond hair and other products leave a weird build up in my hair but this doesn't. Smells great and works amazing. Highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "EM",
      "helpful_votes": 49,
      "publication_date": 20150419
    },
    {
      "title": "New formulation is AWFUL!  DO NOT PURCHASE!",
      "text": "This product USED to be amazing! They obviously got bought out and my guess is the new owners switched it out for cheap, ineffective product! I would LOVE to see the old green product brought back...but this new orange colored product is horrible! PLEASE, PLEASE bring back the old forumalation! Update: ...I brought this at a store thinking it was an Amazon problem. This company is really disappointing. The old amazing green formulation was on top...and 3/4 of the bottle was the nasty new formulation. I can't believe this company is so corrupt! DO NOT PURCHASE! This orange formulation is NASTY!",
      "rating": 1.0,
      "verified": true,
      "author": "jed",
      "helpful_votes": 12,
      "publication_date": 20190826
    },
    {
      "title": "I can see how other's may like this product, but I can't include myself in that group.",
      "text": "It did leave my hair and skin soft, however no matter the temp of the water or how thoroughly I rinsed it would not rinse cleanly, and so I feel the softness was more do to residuals left behind rather than chlorine removal and re-conditioning. Also, I am not a fan of strong fragrances, and although I didn't find the scent as offensive as others it is rather strong form my taste. It has sort of a citrus/bubble gum scent. If a anyone has any suggestions for a low fragrance shampoo that removes chlorine, I'd like to hear them. Thanks.",
      "rating": 2.0,
      "verified": true,
      "author": "Zack",
      "helpful_votes": 10,
      "publication_date": 20171003
    },
    {
      "title": "Soothes chlorine-irritated skin",
      "text": "I've been having lots of problems after being in the pool a lot this summer; I don't know if it's the chlorine or just my aging skin. This bodywash seems to keep the flare-ups under control. I used it for a few weeks and my skin was fine. Then I tried another product, and it flared up again. So, I'm back to using this for the rest of pool season.",
      "rating": 4.0,
      "verified": true,
      "author": "jthoo",
      "helpful_votes": 8,
      "publication_date": 20170726
    },
    {
      "title": "It took out the green",
      "text": "My daughter had florescent green hair. After a few washes it faded a lot. There is still some green on the tips that I can't get rid of 100% but she is in the pool 2-3 times a week and is blonde. I don't mind the smell, it's fresh and fruity. I feel like you have to use a little extra of the shampoo because of the lathering. But Ill keep using and have recommended. It's important for me to use earth friendly products where I can and especially on my child.",
      "rating": 4.0,
      "verified": true,
      "author": "sunshine",
      "helpful_votes": 20,
      "publication_date": 20140716
    },
    {
      "title": "Product change",
      "text": "I have bought this product several times in the past and it was always a pleasing light green color. I ordered a new bottle and it's a disgusting brown color. Either they changed the product, or the product I received was counterfeit.",
      "rating": 1.0,
      "verified": true,
      "author": "Michele D B",
      "helpful_votes": 4,
      "publication_date": 20191120
    },
    {
      "title": "Fake soap!!  Not the real babo!!!  Beware!",
      "text": "Do not buy this soap!!! It’s completely fake and something I have never experienced from Babo! It’s supposed to be a white creamy soap instead I received a thick brown sticky soap. Disgusting! Buyer beware!",
      "rating": 1.0,
      "verified": true,
      "author": "Jill Cain",
      "helpful_votes": 6,
      "publication_date": 20190706
    },
    {
      "title": "Nice shampoo",
      "text": "The only thing I don't care for is that it really makes my hair feel like all the oils are gone, but that's probably a feature and not a bug. I would highly recommend the conditioner to go with it. The conditioner brings moisture back, and they're a perfect size for the gym. Here's a link to the conditioner.",
      "rating": 4.0,
      "verified": true,
      "author": "rainy",
      "helpful_votes": 2,
      "publication_date": 20181104
    },
    {
      "title": "Surprisingly also helps with acne",
      "text": "My daughter is 17 and on the HS swim team, and my son (age 13) swims year 'round in summer league and YMCA league, and both have swim suits to clean daily, and they've complained about not being able to get \"clean\" after a shower prior to this product. I looked at quite a bit before landing on this item, and my daughter reported after 2 weeks of use that she \"loves it,\" and \"hey mom, I think its helping with my acne too.\" So that's an added plus! Long term, not sure yet, as its only been 2 weeks, but both my kids are telling me they like it. Will order more!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20181129
    },
    {
      "title": "Good shampoo and body wash for kids",
      "text": "We started using this on the kids after swimming classes, but now it is the daily shampoo and body wash. I use it too if I run out of shampoo or soap. It feels great, not oily or creamy. Rinses out easily. Kids have not had any allergy problem with it, but they are not allergic to stuff. The scent is very subtle. You have to smell their hair right after coming out of the shower to actually pick anything, otherwise there is nothing (which is good).",
      "rating": 5.0,
      "verified": true,
      "author": "A guy living in WA",
      "helpful_votes": 0,
      "publication_date": 20190821
    },
    {
      "title": "Off scent",
      "text": "The scent was not as described and the soap was really clumpy. Did not do as described on Amazon..",
      "rating": 1.0,
      "verified": true,
      "author": "Natures Retreat",
      "helpful_votes": 2,
      "publication_date": 20200922
    },
    {
      "title": "not a swim shampoo, but a nice one otherwise",
      "text": "My son, the swimmer, doesn't like the shampoo at all. I have to agree with him on some aspects: it doesn't remove the chlorine smell completely and his hair is still coarse and dry and needs some conditioner as all the other regular shampoos. I like the shampoo smell, but my son doesn't. I am not inclined to recommended it as a swim shampoo, but it is nice to use more natural products for kids.",
      "rating": 3.0,
      "verified": true,
      "author": "Cora",
      "helpful_votes": 7,
      "publication_date": 20150724
    },
    {
      "title": "I like that it is natural and not full of harmful ...",
      "text": "I like that it is natural and not full of harmful chemicals. However, the product does not foam up very well so it's hard to use. I have found I needed to use A LOT of it per shampoo on my kids to feel like it actually got good coverage/washing. I expect this since we're used to using natural shampoos w/o SLS, etc, but this practically is foamless. So it won't last as long as I was hoping it would for the price.",
      "rating": 3.0,
      "verified": true,
      "author": "jinglebells",
      "helpful_votes": 4,
      "publication_date": 20160211
    },
    {
      "title": "Our favorite!",
      "text": "We were looking for a gentle shampoo for our baby/preschooler that wasn’t “baby shampoo”. I like this because it’s free of parabens, etc and leaves their long hair soft. It has a surprisingly nice smell compared to other natural shampoos. I also have had to use it a few times and works just as well on adults!",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie Siegle",
      "helpful_votes": 0,
      "publication_date": 20190917
    },
    {
      "title": "Saved their hair!",
      "text": "Great shampoo for after swimming. Kept my girls hair in wonderful shape throughout the summer and I was able to trim much less off for the coming school year. We used at least twice weekly for 10 weeks and I would say about and 80% improvement in hair condition verses using regular shampoo last summer.",
      "rating": 4.0,
      "verified": true,
      "author": "NikiB.",
      "helpful_votes": 0,
      "publication_date": 20190827
    },
    {
      "title": "Love it",
      "text": "Smells wonderful. Other gym members comment on how good it smells. Very nice for chlorine build up. My hair feels well conditioned after swimming. I use the excess suds from my hair as a body wash. A little goes a long way. I will purchase again.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191014
    },
    {
      "title": "Amazing for HARD WATER!!!",
      "text": "I love this for our hard water!!! However, something seems off, I used to order it and get a thick yellowish shampoo every time. The last time I got a thinner and clear one, so, I assumed Babo reformulated it. But I just ordered another bottle this week and I got the thick yellowish shampoo again. I will still order it if the pricy stays the same. I use it for my entire family. But I do prefer the thicker one.",
      "rating": 5.0,
      "verified": true,
      "author": "Alencar, W.",
      "helpful_votes": 0,
      "publication_date": 20190407
    },
    {
      "title": "Great after pool shampoo.",
      "text": "I had a hard time not smelling like the pool even after a shower. This stuff is great. It helps to moisturize my scalp and skin, it has a very light scent, and I don’t reek like chlorine. Added plus: no disodium EDTA. Thank you, thank you, thank you Babo Botanicals!",
      "rating": 5.0,
      "verified": true,
      "author": "Carolyn J Syhre-Bracchi",
      "helpful_votes": 0,
      "publication_date": 20190426
    },
    {
      "title": "Didn’t seem to help condition of the hair, but never turned green!",
      "text": "Still Felt like my daughters hair felt like straw. Didn’t seem To work any better than hand soap would Have on her hair. BUT her light blonde hair after being in the pool 1-2 times a week, didn’t ever turn green.... so there’s that!",
      "rating": 4.0,
      "verified": true,
      "author": "mustang456",
      "helpful_votes": 0,
      "publication_date": 20190817
    },
    {
      "title": "Gentle but effective chlorine-removal",
      "text": "I use these with my kids after swim lessons. For my son, it works great and washes well. I can't smell the chlorine after the shower. My daughter has thick and long hair so in her case, we do two washes to make sure we're thorough. It smells fantastic! I now use it for myself too.",
      "rating": 4.0,
      "verified": true,
      "author": "worklifekids",
      "helpful_votes": 0,
      "publication_date": 20190402
    },
    {
      "title": "Disappointing",
      "text": "Seems watered down. No suds and have to use ten squirts to get any type of lather. Like the green apple smell though. I felt ripped off.",
      "rating": 1.0,
      "verified": true,
      "author": "Madness",
      "helpful_votes": 4,
      "publication_date": 20170826
    },
    {
      "title": "Good for swimmers",
      "text": "I bought the shampoo/body wash for my kids who swim at least twice a week. The product smelled sweet and fruity and it did get rid of the smell of chloride. It didn't leave dryness to the skin or hair. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Wesley Leussen",
      "helpful_votes": 0,
      "publication_date": 20191205
    },
    {
      "title": "Great for detangling curls",
      "text": "This detangler works great on my son's super curly hair. We chose this formulation from this bran because he's in swim lessons and he's blond and I was worried his hair would turn green from the chlorine and it wasn't easy to find a baby-safe swim shampoo.",
      "rating": 5.0,
      "verified": true,
      "author": "Emily K.",
      "helpful_votes": 0,
      "publication_date": 20171115
    },
    {
      "title": "heavy scent good product.",
      "text": "the scent is a little strong and when it gets in my kids eyes she seems to get upset but Im sure its not stinging. I like the product overall. it works well cleans her and its all natural.",
      "rating": 4.0,
      "verified": true,
      "author": "Liz",
      "helpful_votes": 0,
      "publication_date": 20180628
    },
    {
      "title": "LOVE the smell",
      "text": "Recently purchased this product, I believe other reviews said it didn't lather, but it absolutely does lather. LOVE the smell, leaves the skin feeling supple and moisturized. My boys are young but very active and will be swimming in pools at least 3x a week. Very happy with this product. Just make sure to watch the eyes on littles ones.",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa V.",
      "helpful_votes": 0,
      "publication_date": 20180704
    },
    {
      "title": "Change formula ?",
      "text": "I received the product a few months ago, it was sealed, when I open it, I found that it’s not the same as the one I used to use, not green colour ( it’s brown), not the same smell, I wonder if babo change the formula or I got the fraud product",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190712
    },
    {
      "title": "Worth the cost",
      "text": "We have been using this shampoo for over 2 years for swim season. We have a 4 year old who has thick blonde hair and 2 year old who has fine brown hair. This does an amazing job of cleaning their hair and keeping it from turning green. It is great for tangles on long hair even without using the conditioner, but definitely worth buying the conditioner and using, because it leaves hair even easier to brush, so there will be less tantrums and tears after washing their hair. Worth the cost!",
      "rating": 5.0,
      "verified": true,
      "author": "lmac",
      "helpful_votes": 0,
      "publication_date": 20180717
    },
    {
      "title": "Great!",
      "text": "Gets the chlorine smell out and is awesome! My teen swims competitively 5 days a week. We were using a different brand but our family started using \"cleaner\" products so I gave this a shot and he is so happy about it!",
      "rating": 5.0,
      "verified": true,
      "author": "Monica",
      "helpful_votes": 0,
      "publication_date": 20191022
    },
    {
      "title": "Smells great and soft for the hair.",
      "text": "My boys swim 4 days a week and I had a hard time getting the chlorine smell out of their hairs using regular shampoo. After using this product, their hairs are a lot smoother and no more chlorine smell. They like the botanical smell too.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin Chong",
      "helpful_votes": 0,
      "publication_date": 20200301
    },
    {
      "title": "Perfect for active kids",
      "text": "My five year old son uses this daily and it’s perfect for the days he goes to swim class.",
      "rating": 5.0,
      "verified": true,
      "author": "Allison W.",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "FOR AVID SWIMMERS!!",
      "text": "My son is in the swimming team and is in a pool 2 hrs a day. Needless to say, his hair and skin suffered the consequences. I have tried other products but I like this; one for the smell and the convenience (you have shampoo and body wash in one) and anything to save time, right parents? Two, my son stopped complaining about his itchy skin and his hair began to feel like actual hair and not hay.",
      "rating": 5.0,
      "verified": true,
      "author": "Ulises Hernandez",
      "helpful_votes": 0,
      "publication_date": 20170819
    },
    {
      "title": "Just ok",
      "text": "This is just ok. I love the smell but it doesn’t make my hair soft like other brand. However, it did help with getting chlorine out of my hair though.",
      "rating": 3.0,
      "verified": true,
      "author": "Cyndi",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "Two stars",
      "text": "At first I liked it because of the scent. However it doesn't lather at all. And my daughter cannot use the shampoo on her own. Even with my help it's a bit tedious.",
      "rating": 2.0,
      "verified": true,
      "author": "In the middle. ",
      "helpful_votes": 2,
      "publication_date": 20170629
    },
    {
      "title": "This is a nice cleansing shampoo",
      "text": "This is a nice cleansing shampoo, the only thing that I would say is not the best, it is very thin-liquidy so it seems to take a couple of handfuls to do the job on my daughters shoulder length hair. Otherwise I really love it.",
      "rating": 4.0,
      "verified": true,
      "author": "RuthB",
      "helpful_votes": 0,
      "publication_date": 20170818
    },
    {
      "title": "My hair and skin still smell like chlorine. My hair also gets very sticky/tangled that ...",
      "text": "Doesn't really work. My hair and skin still smell like chlorine. My hair also gets very sticky/tangled that I feel like even my regular shampoo does a better job.",
      "rating": 2.0,
      "verified": true,
      "author": "Anonymous",
      "helpful_votes": 0,
      "publication_date": 20180317
    },
    {
      "title": "Worst shampoo I’ve ever used",
      "text": "I have dark brown hair and after using this for a month, I was blonde. My hair has never been so damaged as when I used this shampoo. There are much better options out there that are much cheaper.",
      "rating": 1.0,
      "verified": true,
      "author": "A. Sparkman",
      "helpful_votes": 0,
      "publication_date": 20190629
    },
    {
      "title": "Absolutely love this schampoo- my friend recommended it for my children ...",
      "text": "Absolutely love this schampoo- my friend recommended it for my children that go in chlorine water twice a day (blond hair turning green...) and I can already see an improvement in their hair! It leaves hair very soft and smooth!",
      "rating": 5.0,
      "verified": true,
      "author": "Karin",
      "helpful_votes": 3,
      "publication_date": 20160707
    },
    {
      "title": "What a difference a good shampoo/body wash can make",
      "text": "What a difference a good shampoo/body wash can make! Even my lil one noticed if she uses this wash, her body is not itchy after swim lessons. Also has a nice fragrance.",
      "rating": 5.0,
      "verified": true,
      "author": "JT",
      "helpful_votes": 3,
      "publication_date": 20170202
    },
    {
      "title": "Not a fan",
      "text": "While the botanical/natural ingredients is a plus, I question whether it actually removes the chlorine from hair. It leaves my kids' hair really dry and coarse feeling. We definitely have to use a good conditioner, and typically don't for my son. Although is says tear free, it stung my kids' eyes.",
      "rating": 2.0,
      "verified": true,
      "author": "Joyce S.",
      "helpful_votes": 0,
      "publication_date": 20160716
    },
    {
      "title": "So far, great.",
      "text": "We have only used this once so far. My little one was getting a rash from the chlorine at swim lessons. This seemed to get all of the chlorine off of him and no rash.",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda G.",
      "helpful_votes": 0,
      "publication_date": 20190325
    },
    {
      "title": "great for sensitive skin",
      "text": "I bought this product in hopes it would help my daughters excema. It did. Only took a few days and everything is all cleared up. Plus, it smells good too!",
      "rating": 5.0,
      "verified": true,
      "author": "Tracy Barnicle",
      "helpful_votes": 0,
      "publication_date": 20190324
    },
    {
      "title": "Great purchase",
      "text": "Great product and smells awesome! I have a head full of hair so I need a good quality shampoo to get the chlorine out, glad I purchased this!",
      "rating": 4.0,
      "verified": true,
      "author": "MrsLaws",
      "helpful_votes": 0,
      "publication_date": 20190606
    },
    {
      "title": "Gets the chlorine off. You won't leave the gym smelling like the pool.",
      "text": "Gets the chlorine off. It's kind of a funky color, but works really well. I would recommend a using a conditioner with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Pamala ",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "Just okay - didn't love it",
      "text": "I didn't care for the smell and it doesn't lather wonderfully so it is now in the guest bath. It seemed to work okay, but not my favorite.",
      "rating": 2.0,
      "verified": true,
      "author": "Laura A. Mcghghy",
      "helpful_votes": 0,
      "publication_date": 20190820
    },
    {
      "title": "Ok",
      "text": "My kids love the scent! My issue is it seems to take a ton of product to wash my daughter’s hair.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190805
    },
    {
      "title": "... been using this a few weeks now and I love how well it works -- it rinses well and ...",
      "text": "I've been using this a few weeks now and I love how well it works -- it rinses well and my daughters hair is super manageable despite the chlorine. I also use the matching condition but it all smell so yummy!",
      "rating": 5.0,
      "verified": true,
      "author": "Annie",
      "helpful_votes": 2,
      "publication_date": 20160613
    },
    {
      "title": "Great for beach and pool hair!",
      "text": "I love this shampooand conditioner both for me and my kids. I bought it for a trip to the beach and it worked amazing to get the sea water,salt and sand out of our hair. It also took the chlorine out of my daughters blonde hair and the green tint. I ordered Fairytales in the past and was disappointed. This is much much better!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Pamela F.",
      "helpful_votes": 0,
      "publication_date": 20180718
    },
    {
      "title": "Best for allergies",
      "text": "Best baby/ toddler bath washing. Great for kids with allergies! Smell is similar to banana/aloe. Love this product!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Traci Dulemba",
      "helpful_votes": 0,
      "publication_date": 20200607
    },
    {
      "title": "Smells great!",
      "text": "My six month old swims multiple times a week so I decided to get her shampoo/body wash specifically for swimming. I am glad I did because I really like this product. It smells really good and is gentle on my daughter's skin.",
      "rating": 5.0,
      "verified": true,
      "author": "Brittany B.Top Contributor: Baby",
      "helpful_votes": 0,
      "publication_date": 20170301
    },
    {
      "title": "Removes  chlorine smell",
      "text": "Our favorite post-swim shampoo and it contains no harmful ingredients! Great smell, works well to remove that chlorine!",
      "rating": 5.0,
      "verified": true,
      "author": "MegG",
      "helpful_votes": 0,
      "publication_date": 20190203
    },
    {
      "title": "No itch!",
      "text": "Love, love, love this product! I've struggled with itchy skin and scalp after exercise and decided to try this since I also have very sensitive skin. After first use, i noticed a difference--NO itch! This product must remove effectively and safely residues left from the environment as well as sweat. I will use this from here on out.",
      "rating": 5.0,
      "verified": true,
      "author": "Isabella Hill",
      "helpful_votes": 2,
      "publication_date": 20160801
    },
    {
      "title": "Brown goo",
      "text": "Brown goo that has a sickly sweet smell like the cheapest shampoo. Is this a fake product? It does not have any resemblance to cucumber.",
      "rating": 1.0,
      "verified": true,
      "author": "Martin Chapman",
      "helpful_votes": 0,
      "publication_date": 20190829
    },
    {
      "title": "Not so much help",
      "text": "It left my hair dry and I didn’t like the smell",
      "rating": 1.0,
      "verified": true,
      "author": "Dara A Zambrano ",
      "helpful_votes": 0,
      "publication_date": 20181202
    },
    {
      "title": "Five Stars",
      "text": "Great shampoo to use after the pool so your hair doesnt turn green from the water",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180721
    },
    {
      "title": "Great shampoo, light scent, great lather",
      "text": "Really like this shampoo, lathers really well. I've been trying to make the switch to safer products but sometimes the shampoos in that category don't help with removing the oil in my hair or don't really get a great lather - this is the solution, I use it every few days. Has a nice light scent that doesn't linger at all. Definitely not over bearing.",
      "rating": 5.0,
      "verified": true,
      "author": "Aab1042",
      "helpful_votes": 0,
      "publication_date": 20140917
    },
    {
      "title": "Nice shampoo",
      "text": "I have use this item for a while. It does what it mentions but the smell has little strong which not attract my children to use it. We will try to put more water to see if that will reduce little.",
      "rating": 5.0,
      "verified": true,
      "author": "yellowkid94",
      "helpful_votes": 0,
      "publication_date": 20170712
    },
    {
      "title": "Dries out your hair",
      "text": "Dried out my daughters hair. Is fine for once in. While... smells good and clean.",
      "rating": 3.0,
      "verified": true,
      "author": "BH",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "Plain shampoo",
      "text": "Not impressed. Seems just like regular shampoo to me. save your hard earned money.",
      "rating": 1.0,
      "verified": true,
      "author": "Wael",
      "helpful_votes": 0,
      "publication_date": 20170729
    },
    {
      "title": "Bottle leaked everywhere.",
      "text": "I love this product and it would have a5 star rating if it had not leaked all over the package when delivered.",
      "rating": 3.0,
      "verified": true,
      "author": "shannon",
      "helpful_votes": 0,
      "publication_date": 20180518
    },
    {
      "title": "Love it",
      "text": "Love the smell, works great. I use with the conditioner too on my 2 y/o",
      "rating": 5.0,
      "verified": true,
      "author": "Gina L",
      "helpful_votes": 0,
      "publication_date": 20180814
    },
    {
      "title": "Five Stars",
      "text": "Takes a bit to get a lather. Use particularly after being in the pool.",
      "rating": 5.0,
      "verified": true,
      "author": "DH",
      "helpful_votes": 0,
      "publication_date": 20180807
    },
    {
      "title": "I spend a lot of time in the pool which can make blonde hair frizzy straw however this shampoo combined with other conditioners really seems to be keeping my hair healthy looking and manageable and it has a wonderful soft scent",
      "text": "This seems to work very well on my light blonde hair. I spend a lot of time in the pool which can make blonde hair frizzy straw however this shampoo combined with other conditioners really seems to be keeping my hair healthy looking and manageable and it has a wonderful soft scent. I recommend this product",
      "rating": 5.0,
      "verified": true,
      "author": "Cindy",
      "helpful_votes": 0,
      "publication_date": 20180401
    },
    {
      "title": "This shampoo is probably as good as regular shampoos on normal hair",
      "text": "This shampoo is probably as good as regular shampoos on normal hair. However, I was hoping it's claim to rid the hair of chlorine build-up had been true, but it just isn't. Pretty pricey to begin with, and not worth the money if you're hoping for postive results.",
      "rating": 3.0,
      "verified": true,
      "author": "Heado",
      "helpful_votes": 3,
      "publication_date": 20150822
    },
    {
      "title": "Chlorine? Hard Water? Try for softer hair in hard conditions",
      "text": "Our water is extremely hard and this shampoo works great in it without drying my hair out completely like most shampoos in hard water.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20180414
    },
    {
      "title": "I don't want to smell like fruit snacks all day after a swim",
      "text": "Appears to work but the smell is fairly strong and it persists. I don't want to smell like fruit snacks all day after a swim.",
      "rating": 2.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 0,
      "publication_date": 20161201
    },
    {
      "title": "A must for a swimmer",
      "text": "I participate in water aerobics three times a week and the chlorine can really damage your hair. This shampoo and conditioner is great on my hair. It smells good too",
      "rating": 5.0,
      "verified": true,
      "author": "S. Ward",
      "helpful_votes": 0,
      "publication_date": 20170107
    },
    {
      "title": "Good product, but has bubble gum smell",
      "text": "It works--no chlorine smell after showering with Baboo. However, the product has a bubble gum smell. Not very appealing.",
      "rating": 2.0,
      "verified": true,
      "author": "Margaret S. Johns",
      "helpful_votes": 0,
      "publication_date": 20160916
    },
    {
      "title": "the 16 oz packaging leaks!",
      "text": "it came wrapped in plastic, unopened, and already leaking into the plastic covering. whenever its on its side, it leaks. i take this with me to the pool so that's why its ever on its side :( overall I like the actual product and the packaging is cute (good marketing)",
      "rating": 2.0,
      "verified": true,
      "author": "helen cheng",
      "helpful_votes": 0,
      "publication_date": 20180909
    },
    {
      "title": "While the product itself is wonderful..",
      "text": "I opened this package tonight and used it immediately. While the product itself is wonderful....cleans with no greasy feeling and smells great, I could only give this 3 stars. When I opened the package the pump had come lose and there was about a quarter of the bottle that had leaked out. And the pump doesn't even work, seems to be broken. Great product. Very poor packing and care.",
      "rating": 3.0,
      "verified": true,
      "author": "Kelly B.",
      "helpful_votes": 0,
      "publication_date": 20170828
    },
    {
      "title": "Smells bad",
      "text": "Really dislike the smell. Doesn’t seem to work any better than my normal shampoo. I’ll use it until it’s gone, but won’t repurchase.",
      "rating": 3.0,
      "verified": true,
      "author": "jogs",
      "helpful_votes": 0,
      "publication_date": 20180805
    },
    {
      "title": "Excellent shampoo after pool and ocean",
      "text": "Item arrived intact. Excellent product. It doesn't lather like other shampoos because it doesn't have the detergents (e.g, sulfates) that cause suds' proliferation. It does a good job of removing both sea salt and chlorine without strong fragrances or skin irritation.",
      "rating": 5.0,
      "verified": true,
      "author": "Prime member",
      "helpful_votes": 3,
      "publication_date": 20121027
    },
    {
      "title": "My hair does not feel clean after use so I ...",
      "text": "My hair does not feel clean after use so I am mixing half of the product and half Castile soap to compensate. Also I do not prefer the smell so I am adding essential oils. And the product is runny.",
      "rating": 2.0,
      "verified": true,
      "author": "Caleb Horn",
      "helpful_votes": 0,
      "publication_date": 20160208
    },
    {
      "title": "Five Stars",
      "text": "Great for washing my hair after swim class and it’s not drying on my 4C hair",
      "rating": 5.0,
      "verified": true,
      "author": "Jan",
      "helpful_votes": 0,
      "publication_date": 20171202
    },
    {
      "title": "Love if",
      "text": "We just love that it takes the chlorine out of our hair and it leaves my skin very soft.",
      "rating": 5.0,
      "verified": true,
      "author": "CRS",
      "helpful_votes": 2,
      "publication_date": 20160105
    },
    {
      "title": "Works great and smells great too.",
      "text": "This product does a great job of getting rid of chlorine and mineral build up. Our hair feels soft and full of body after shampooing. Great for summer and all year if you have well water!",
      "rating": 5.0,
      "verified": true,
      "author": "HM",
      "helpful_votes": 0,
      "publication_date": 20180829
    },
    {
      "title": "Poor shampoo, good body wash",
      "text": "Really gets lorine off skin, but made my hair feel sticky.will not buy to use as shampoo",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170801
    },
    {
      "title": "Awesome !!",
      "text": "love this and smells beautiful. I swim a few times a week and my hair takes a hit from the chemicals, this is a great product. They don't test on animals and its all vegan :)",
      "rating": 5.0,
      "verified": true,
      "author": "Laura M",
      "helpful_votes": 0,
      "publication_date": 20170717
    },
    {
      "title": "This smells amazing! My girls (5 & 7) even comment on ...",
      "text": "This smells amazing! My girls (5 & 7) even comment on it. Gets the chlorine out that makes their hair so dry & straw like, and leaves it so soft, smooth, and manageable. And did I mention the smell is amazing!?",
      "rating": 5.0,
      "verified": true,
      "author": "Andi",
      "helpful_votes": 0,
      "publication_date": 20171022
    },
    {
      "title": "love this product",
      "text": "love this product. my 4yrs old child asks every time what smells so good. hair feels soft and clean after use.",
      "rating": 5.0,
      "verified": true,
      "author": "Victoria Taylor",
      "helpful_votes": 0,
      "publication_date": 20181017
    },
    {
      "title": "Five Stars",
      "text": "Best Swim Shampoo Ever!!! Gets all the natural sunscreen on my boys skin.",
      "rating": 5.0,
      "verified": true,
      "author": "ProudMama",
      "helpful_votes": 0,
      "publication_date": 20170720
    },
    {
      "title": "Great mild wash for kids and scent sensitive adults.",
      "text": "We love this wash for our kids. Gentle, light, pleasantly scented.",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs. C",
      "helpful_votes": 0,
      "publication_date": 20180805
    },
    {
      "title": "Great lather and smell",
      "text": "I have purchased this product twice now, I like that it is a healthy product and paraben free etc but still has great lather and a wonderful smell. Works great as bubble bath and I will continue to purchase it for bathing my kids.",
      "rating": 5.0,
      "verified": true,
      "author": "K. O'Brien",
      "helpful_votes": 0,
      "publication_date": 20140126
    },
    {
      "title": "Worth the price",
      "text": "My daughter is on swim team and loves this shampoo. She uses this after every practice and meet.",
      "rating": 5.0,
      "verified": true,
      "author": "lavamom",
      "helpful_votes": 0,
      "publication_date": 20171128
    },
    {
      "title": "Excellent shampoo that leaves hair feeling clean and soft",
      "text": "Leaves me hair feeling very clean and moisturized. Detangles well and does not strip my hair. Leaves my hair clean and soft.",
      "rating": 5.0,
      "verified": true,
      "author": "J",
      "helpful_votes": 0,
      "publication_date": 20191105
    },
    {
      "title": "Kind of like cucumber and sugar",
      "text": "It works, but I don't care for the fragrance. Kind of like cucumber and sugar.",
      "rating": 3.0,
      "verified": true,
      "author": "DM",
      "helpful_votes": 0,
      "publication_date": 20170403
    },
    {
      "title": "Fake",
      "text": "The product we received was obviously fake. So bad I could not pour it down the drain to recycle the container.",
      "rating": 1.0,
      "verified": true,
      "author": "Disappointed ",
      "helpful_votes": 0,
      "publication_date": 20201003
    },
    {
      "title": "One Star",
      "text": "Does not get rid of the smell of chlorine from skin or hair.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171025
    },
    {
      "title": "My swimmer specifically asked for this again this season.",
      "text": "My son swims for his high school. He says this is the stuff he likes to get the chlorine off him so he won't itch after he dries off. He asked for this specific brand for the second season in a row. He really likes it.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer S Maw",
      "helpful_votes": 0,
      "publication_date": 20140111
    },
    {
      "title": "Five Stars",
      "text": "great product, originally purchased for my young grandson. I have sensitive skin and it works for me too!!!",
      "rating": 5.0,
      "verified": true,
      "author": "chiLady",
      "helpful_votes": 0,
      "publication_date": 20160927
    },
    {
      "title": "I felt like after my swim in the pool that is really ...",
      "text": "This worked well for me....I felt like after my swim in the pool that is really cleaned my hair very well... I have crochet braids...and it did the job.",
      "rating": 4.0,
      "verified": true,
      "author": "Beeba",
      "helpful_votes": 0,
      "publication_date": 20150924
    },
    {
      "title": "Smells great, but seems to be on the expensive side",
      "text": "Seems to get the chlorine out, but doesn't lather as much as expected. Smells great, but seems to be on the expensive side.",
      "rating": 3.0,
      "verified": true,
      "author": "Nikola Edison",
      "helpful_votes": 0,
      "publication_date": 20150630
    },
    {
      "title": "Good shampoo.",
      "text": "Seems to be working well, getting the chlorine out of my hair.",
      "rating": 5.0,
      "verified": true,
      "author": "pgatesw",
      "helpful_votes": 0,
      "publication_date": 20170903
    },
    {
      "title": "Leaves too much buildup!!",
      "text": "This product left serious buildup in my kids’ hair. They liked the smell and doesn’t sting in their eyes, so that is good but as for removing chlorine and leaving hair clean — I would choose another product!",
      "rating": 2.0,
      "verified": true,
      "author": "sjp19",
      "helpful_votes": 0,
      "publication_date": 20190620
    },
    {
      "title": "Pricey but worth it for hair with buildup",
      "text": "My daughter struggled with scalp buildup and this shampoo solved it",
      "rating": 4.0,
      "verified": true,
      "author": "Angela Stelle",
      "helpful_votes": 0,
      "publication_date": 20160508
    },
    {
      "title": "kind of like eating the inside of a banana peel",
      "text": "Can't really be sure if it does what it's supposed to. Strange feeling to lather, kind of like eating the inside of a banana peel. Oddly, the shampoo even smells a little like banana cotton candy.",
      "rating": 2.0,
      "verified": true,
      "author": "Ximena Mora Ayon",
      "helpful_votes": 0,
      "publication_date": 20180626
    },
    {
      "title": "This is the best \"after swim\" soap I've found.",
      "text": "This is the best \"after swim\" soap I've found. Gentle/mild and yet very effective at washing away chlorine. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Don Jolio",
      "helpful_votes": 0,
      "publication_date": 20150817
    },
    {
      "title": "Very skin friendly.",
      "text": "This product is amazing. We use it to wash done our kids to remove sun screen after pool and beach days.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Anthony Bartmess",
      "helpful_votes": 0,
      "publication_date": 20200524
    },
    {
      "title": "Works great for swim lesson hair",
      "text": "Daughters very fine hair was getting to be the texture of straw from weekly swim lessons. This works great to keep it under control and remove chlorine buildup",
      "rating": 5.0,
      "verified": true,
      "author": "Sheri",
      "helpful_votes": 0,
      "publication_date": 20171024
    },
    {
      "title": "Smells great, works great for chlorine",
      "text": "Smells great, works great for chlorine. Surprisingly doesn't work that well for day-to-day use (kills chlorine but doesn't really kill dirts and oils).",
      "rating": 4.0,
      "verified": true,
      "author": "Allana Olson",
      "helpful_votes": 0,
      "publication_date": 20151117
    }
  ],
  "product_meta": {
    "title": "Babo Botanicals Purifying Swim & Sport 2-in-1 Shampoo & Wash with Natural Cucumber and Aloe Vera, Vegan, for Babies, Kids or Sensitive Skin - 16 oz.",
    "description": "Size:16 Fl Oz (Pack of 1)Babo Botanicals Swim & Sport Shampoo & Wash is a multi-purpose formula designed to cleanse and purify your baby or kid’s hair, scalp and skin. Specifically formulated with a corn-derived chelator to remove chlorine and dirt after play time at the pool, playground or beach. Our 2-in-1 hydrating cleanser is gentle enough for babies, but effective enough for all ages. This shampoo and body wash is developed with plant-based ingredients including moisturizing Shea and Cocoa Butter to replenish and hydrate your hair, leaving it smooth and shiny. Natural aloe vera and cucumber provide additional nourishment of the skin and scalp as well as a refreshing, invigorating scent. Enriched with Babo's exclusive, organic Nutri-Soothe Complex. This formula is sulfate-free and meets EWG VERIFIED criteria, making it safe for everyday use. Tear-free. Made in the USA and B Corp Certified. To use, wash hair and body thoroughly after pool, beach or active play. Follow with Swim & Sport Conditioner and/or Detangling Spray for complete hydration.",
    "rating": 4.3,
    "feature_bullets": [
      "100% GOOD FOR YOU & YOUR FAMILY: This purifying shampoo and body wash replenishes, hydrates and purifies the hair, scalp and skin after the pool or beach. Perfect for babies, kids and adults. Lightly fragranced.",
      "FORMULATED TO CLARIFY THE HAIR AND SKIN: This 2-in-1 shampoo and body wash is specifically developed with Natural aloe vera and cucumber to nourish and refresh. Enriched with Babo's organic Nutri-Soothe Complex. Reef friendly.",
      "NO HARSH CHEMICALS OR IRRITANTS: Hypoallergenic to reduce the risk of allergic reactions. Clinically tested and safe for all ages. Gluten, soy, dairy, peanut, almond and walnut free. Made in USA and B Corp Certified. Vegan friendly.",
      "GENTLE ENOUGH FOR DAILY USE: Wash hair and body thoroughly after swimming at the beach or pool, or active play, to help moisturize and comfort the hair, scalp and skin. Rinses away easily. Follow with Swim & Sport Conditioner.",
      "PLANT-BASED & HYPOALLERGENIC FORMULA: Specially formulated with a corn-derived purifier to help restore soft, smooth and shiny hair. Removes chlorine, salt, pollution and grime. Shea and cocoa butter provide additional hydration."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "4.25 x 1.5 x 7 inches; 0.8 Ounces",
      "Item model number": "BTL-033",
      "Date First Available": "October 13, 2014",
      "Manufacturer": "Babo Botanicals, LLC",
      "ASIN": "B00OFXJVW6",
      "Domestic Shipping": "Currently, item can be shipped only within the U.S. and to APO/FPO addresses. For APO/FPO shipments, please check with the manufacturer regarding warranty and support issues.",
      "International Shipping": "This item is not eligible for international shipping.",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Shampoos",
      "Hair Care",
      "Shampoo & Conditioner",
      "Beauty & Personal Care",
      "Health, Household & Baby Care"
    ],
    "price": 17.03
  }
}