{
  "website_summaries": [
    {
      "verdict": "Feature-rich and easy to use. A clear, no-compromise choice.",
      "pros": [
        "Attractive stainless steel and chrome design",
        "Auxillary vacuum device can even help marinate food"
      ],
      "cons": [
        "On the more expensive end of the spectrum, but you are paying for a high-quality machine"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "FoodSaver's top model. You get 2 sealers for the price of 1 and automatic action. Though it costs more, it's worth the investment.",
      "pros": [
        "A powerful 2-in-1 model",
        "Includes retractable handheld sealer for numerous applications",
        "Features a helpful starter kit and patented drip tray"
      ],
      "cons": [
        "Although pricey, it provides a lot of convenient features and an impressive warranty for the cost"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Stuck with a hunk of junk",
      "text": "My Foodsaver is not working at all, less than 6 months after I bought it. Now my return window is closed. I literally waited 1 1/2 years for the price to go down, finally got my item & now I am stuck with this broken appliance. WTH am I supposed to do now?",
      "rating": 1.0,
      "verified": true,
      "author": "Family ",
      "helpful_votes": 100,
      "publication_date": 20171012
    },
    {
      "title": "Junk",
      "text": "Worked for about 2 months of light use, then stopped sealing. This was my second Foodsaver unit. the previous one died after about a year of light use. Unfortunately I need a vacuum sealer. I have yet to find a reliable solution. This isn't it.",
      "rating": 1.0,
      "verified": true,
      "author": "B. Macleod",
      "helpful_votes": 52,
      "publication_date": 20180308
    },
    {
      "title": "Junk",
      "text": "I couldn't be more disappointed in this machine. I have only had it for a few weeks, using it for mass production for my raw dog food business and it kept \"jamming\". The mechanism seemed to get hung up inside and it wouldn't seal, wouldn't cut the bag, and wouldn't vacuum. I would have to turn it on and off 30-40 times to get it to work and that worked only occationaly. The little retractable vacuum sealer thingy would have been cool if IT WORKED. Totally unreliable and junky piece of equipment. Will never, ever, ever, ever buy a FoodSaver again. Returning said hunk today. What a pain... But I still love you Amazon!",
      "rating": 1.0,
      "verified": true,
      "author": "Portland Customer",
      "helpful_votes": 43,
      "publication_date": 20180529
    },
    {
      "title": "Should come with a free full replacement plan.",
      "text": "After 8 months of occasional use, my vacuum sealer stopped working. To be accurate, the dispense function works once every 20 tries, and the same with the vacuum and seal function. I have not been able to figure out what makes it work. Considering that almost 15% of the reviews are reporting this product as defective, it should come with a free full replacement plan.",
      "rating": 1.0,
      "verified": true,
      "author": "Goku",
      "helpful_votes": 38,
      "publication_date": 20171029
    },
    {
      "title": "I am returning the second one of these. Both ...",
      "text": "I am returning the second one of these. Both had the same problem - when turned on, an orange light blinks and then it turns off. It worked the first couple of days, and then stopped. I'm wondering if this is factory second, given the non-consumer packaging.",
      "rating": 1.0,
      "verified": true,
      "author": "SBA homeowner",
      "helpful_votes": 18,
      "publication_date": 20170915
    },
    {
      "title": "I’ve had this vacuum sealer since dec 4 th 2017 ...",
      "text": "I’ve had this vacuum sealer since dec 4 th 2017, used it very little so far. Today I went to use it and it shuts off ! Will not work at all !",
      "rating": 1.0,
      "verified": true,
      "author": "Turbo",
      "helpful_votes": 11,
      "publication_date": 20180326
    },
    {
      "title": "fails to remove air after a few uses even though its clean in new condition.",
      "text": "worked great for the first few times, I'm only here 6 weeks out of the year so not much use, but now it fails to take the air out before sealing. Had a cheap model before that still works better than this and is 20 years old.",
      "rating": 1.0,
      "verified": true,
      "author": "s Toth",
      "helpful_votes": 10,
      "publication_date": 20180321
    },
    {
      "title": "I used this machine 2 times right after purchasing it ...",
      "text": "I used this machine 2 times right after purchasing it. Then a few months later I pulled it out to use it again and nothing. I will attempt to return it, we’ll see....",
      "rating": 1.0,
      "verified": true,
      "author": "Evan Jones",
      "helpful_votes": 13,
      "publication_date": 20180106
    },
    {
      "title": "Best Foodsaver unit ever!",
      "text": "This is my third Foodsaver vacuum sealer, over many years. I gave my previous one (still working) to a friend. This unit is awesome. I LOVE the zip bags that you can wash and re-seal. For cheeses, those are great, veggies too. The dispense/seal feature is great. I found with previous units that the vacuum would start to weaken with many bags to vacuum seal, after shopping. This one? No problem. I have used the marinator unit and the marinate feature - it vacuums, releases, vacuums, releases - for about 10 minutes, opening the pores of the meat for the marinate to set in. This is one sweet kitchen appliance. And no, I don't work for Foodsaver!",
      "rating": 5.0,
      "verified": true,
      "author": "R. Briggs",
      "helpful_votes": 3,
      "publication_date": 20180120
    },
    {
      "title": "Dead after a few weeks",
      "text": "Dead after a few weeks. Used it a few times and then now when I power it on, it makes a little noise and then turns itself off after 10 seconds. Won't stay on long enough to seal/cut or vacuum anything. Amazon is sending a replacement, but I'm worried the replacement will die and then I'll be outside my return window. Also, from reading other reviews left recently, I'm seeing that I'm not the only one with the same issue.",
      "rating": 1.0,
      "verified": true,
      "author": "Lostalien",
      "helpful_votes": 5,
      "publication_date": 20180409
    },
    {
      "title": "Lasted a little less than 3 yr",
      "text": "I purchased this device on 13 November 2016. It gave it up on 24 September 2019. The sliding cutter, which makes the new bag failed to cut completely across the bag material. It had binded up several months ago, but a tap on the inside released the cutter. There were also failures to completely evacuate the bag after several operations. Not worth the cost and NOT Recommended",
      "rating": 2.0,
      "verified": true,
      "author": "miker",
      "helpful_votes": 2,
      "publication_date": 20190924
    },
    {
      "title": "Drawer wouldn't open.  Wastes rolls.  Loved autofeed.  Loved internal roll and dispenser.",
      "text": "The machine is beautiful to behold. The bottom drawer must be closed or it won't operate. It seemed flimsy and felt fragile, difficult to open, and difficult to shut. I had to turn it upside down to get to the cord (and sometimes to get the drawer closed) and as a result the top of case was scratched. The cord didn't exit the base flat enough and made it a tiny bit unstable. Cord too short. I did not like needing 4 entire inches of bag required to auto-feed into the mechanism just so I could seal a 2 inch product. I did not try the accessory or reusable zip bags. Still, overall, I loved having that auto-feed!",
      "rating": 3.0,
      "verified": true,
      "author": "DEE A CAMPBELL",
      "helpful_votes": 0,
      "publication_date": 20200508
    },
    {
      "title": "Very very disappointed.",
      "text": "Very mixed emotions about this product. Has not performed reliably at all. Very very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "moflatley",
      "helpful_votes": 7,
      "publication_date": 20180224
    },
    {
      "title": "I love my food saver",
      "text": "I have had several food savers over the years and each one works as good or better than the one before. I use the food saver for everything I freeze, ground beef, sausage and left overs.. Great item.",
      "rating": 5.0,
      "verified": true,
      "author": "jdewesee",
      "helpful_votes": 2,
      "publication_date": 20200429
    },
    {
      "title": "Always wanted one of these",
      "text": "We decided to preserve and freeze a bunch of food to get through the pandemic and decided to try one of these. It worked perfectly and I love the results. I made a big batch of beans and sealed up three bags of them and froze them. We ended up with a bunch of fresh jalapeno peppers and I sealed and froze them. This is perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Lance K. Mertz",
      "helpful_votes": 0,
      "publication_date": 20200901
    },
    {
      "title": "Find something else",
      "text": "Do not buy this. You can get better air removal by putting your bag in water to push the air out. This machine is garbage. We’ve had it for six weeks and it has stopped working both directly into the machine and with the attachment. Customer service has been mediocre, at best. I had to prompt them for a response and the seal can’t be replaced like other machines. If the seal goes bad the machine goes bad. Not a great design. I attached two pics from tonight’s chicken cacciatore. Seal was super disappointing.",
      "rating": 1.0,
      "verified": true,
      "author": "michael",
      "helpful_votes": 2,
      "publication_date": 20191115
    },
    {
      "title": "Like it very much",
      "text": "Not only do I like sealing things for the freezer, but I can buy in bulk.It has all sizes of bags to fit every need. I can marinade steaks and stuff in a very short time. When i open the bags and use what is in them, I then use to to put food trash in and seal and keeps the trash smelling nice. We use for things in the fridge not just the freezer.",
      "rating": 5.0,
      "verified": true,
      "author": "Anita Sue",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "Overall, I like it and use it",
      "text": "I like being able to pack my food air tight and it does an OK job of that. It does suck up moisture from the food causing it not to seal as well. This was the most common drawback of all the sealers in the reviews I read. This sealer had the most favorable comments pertaining to moist food sealing. Overall, I like it and use it but this is the only one I've tried so I don't know firsthand how it compares with other units.",
      "rating": 4.0,
      "verified": true,
      "author": "Amw",
      "helpful_votes": 0,
      "publication_date": 20191012
    },
    {
      "title": "I like it the more I use it",
      "text": "I like it the more I use it. Decided to break down and buy the Foodsaver bags. They do quite a bit better than the generic. The resealable zip lock bags have provided options I hadn't considered, such as slicing onions in half and leaving them sealed in the fridge crisper. I use what is needed and vac the bag. Same thing with buying nuts in quantity. Glad I picked this model.",
      "rating": 5.0,
      "verified": true,
      "author": "Kart",
      "helpful_votes": 3,
      "publication_date": 20161224
    },
    {
      "title": "love this thing",
      "text": "really impressed , 1rst time I have ever used the re-seal able vacuum bags , and they are great , open and re-seal swiss cheese , and it is as fresh as when you 1rst open it , auto seal when bag when pushed in eliminates negotiating bag to close lid ( makes it so easy) , and puts a very good vacuum on what ever you are bagging , dispensing is as easy as video shows, cutting is a bit loud , I would definitely recommend this",
      "rating": 5.0,
      "verified": true,
      "author": "robert",
      "helpful_votes": 0,
      "publication_date": 20171212
    },
    {
      "title": "food saver",
      "text": "what I'm writing about here is that after only two months with limited time using this item it quit working, I had to send it back to food saver and my shipping cost was $45.00, that is quite a bit for a item you had less than two months. that's like adding another $50.00 to that item. which I'm not very happy about. tom ford",
      "rating": 3.0,
      "verified": true,
      "author": "tsford",
      "helpful_votes": 4,
      "publication_date": 20171201
    },
    {
      "title": "Amazing little machine! You’ll vacuum seal everything & save $ on your food!",
      "text": "Just go ahead & jump in. This machine is awesome, you can marinate food in 10 min. not 24 hrs! it makes your bread last longer, chips, crackers, any left overs in your frig., any food you freeze! We vacuum seal EVERYTHING! It’s already paid for it’s self just simply making bread & chips stay fresh longer at my house! Not counting leftovers! UTube has great videos 2 help you discover all the ways you can use this cool machine!",
      "rating": 5.0,
      "verified": true,
      "author": "katiegirl",
      "helpful_votes": 0,
      "publication_date": 20180303
    },
    {
      "title": "Terrible quality",
      "text": "About a month after buying it the red light indicating the tray was open stayed on constantly. I’ve cleaned it a hundred times and nothing keeps it closed. The unit is virtually unusable. Frustrating as my wife and I are both foodies who need a quality and reliable vacuum sealer. Ugh!!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Kirk A. Darfler",
      "helpful_votes": 2,
      "publication_date": 20180505
    },
    {
      "title": "Bought one, it worked for a short time and ...",
      "text": "Bought one, it worked for a short time and stopped working. Had it returned and they shipped another replacement one... worked the first time... never worked again.",
      "rating": 1.0,
      "verified": true,
      "author": "KJF",
      "helpful_votes": 3,
      "publication_date": 20171126
    },
    {
      "title": "Food saver deficit second time.",
      "text": "I perches the food saver several months ago and it only worked properly for a week and all of a sudden it stopped so reached out the Company and they immediately replaced it with another one. Now I'm having the same issue with the second machine as I did with the first one, order for it to work u need to hit it several time for the vacuum to work it's so frustrating especially for my wife. Hope someone will reach out to take care of the problem. i think that particular model has a deficit as I read the test of the reviews.",
      "rating": 1.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20180814
    },
    {
      "title": "New unit spoiled me!",
      "text": "I've only used my new Food Saver for 2 weeks now but I have to admit that I am now spoiled as it is so easy to use. Works great and a lot less waste of plastic bag material. Best unit yet from Food Saver!",
      "rating": 5.0,
      "verified": true,
      "author": "JOEL & Sandy S",
      "helpful_votes": 3,
      "publication_date": 20170327
    },
    {
      "title": "FoodSaver Premium machine.",
      "text": "I works just like advertised. We just tried the Vacuum zip lock bags. They work very good for those items that will be for short time usages. The bag maker is really a wonderful addition to this unit.",
      "rating": 5.0,
      "verified": true,
      "author": "Donald E. FunderburgTop Contributor: Photography",
      "helpful_votes": 3,
      "publication_date": 20170406
    },
    {
      "title": "Don’t buy this one",
      "text": "This is the second foodsaver I have purchased. The first one lasted like20 years, this one I purchased in march of 2019 and it hasn’t been a year and it has quit working it will not seal all the way. My first one I never had any issues with.I sure wouldn’t recommend this piece of crap. I spent almost 400.00 on it the first one I think we only paid like 35.00 what a difference. Now my return window and support window is gone with a broken machine. The company should make a better product and have a better support system.",
      "rating": 1.0,
      "verified": true,
      "author": "Djuna",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "Not so noisy when using it.",
      "text": "Love it..... it is a little bet quieter then the previous ones I owned before.",
      "rating": 5.0,
      "verified": true,
      "author": "margie Ostash",
      "helpful_votes": 0,
      "publication_date": 20200313
    },
    {
      "title": "Worked until it didn't",
      "text": "The unit worked for less than 1 year. Now, the attachment on the left that seals bags and jars no longer produces suction and fails to seal. Loved it while it worked though.",
      "rating": 2.0,
      "verified": true,
      "author": "Dean Hallman",
      "helpful_votes": 3,
      "publication_date": 20170829
    },
    {
      "title": "Stopped working with in a year",
      "text": "Like many other reviews, this FoodSaver stopped working after like 6 months. I only got to use it a few times until then. Very disappointing.",
      "rating": 1.0,
      "verified": true,
      "author": "NM",
      "helpful_votes": 3,
      "publication_date": 20180111
    },
    {
      "title": "DO NOT BUY THIS",
      "text": "Worked a grand total of one singular time. This \"top of the line\" vacuum sealer is anything but. Got it for a Christmas present, and the return window closed quite quickly, long before it was opened. This is the worst purchase I've made on Amazon. Don't buy this. Get a higher quality brand. I read ALL instructions and followed them to a fault. It just sits there and clicks, all the bags I bought are now useless, but not as useless as this door stop of a product. You've been warned!!",
      "rating": 1.0,
      "verified": true,
      "author": "Jessica H.",
      "helpful_votes": 7,
      "publication_date": 20180131
    },
    {
      "title": "Beware of Canister Sealer",
      "text": "I've had this product for less than a month and already the plastic canister sealer has broken. The design sucks! You have to pull the canister sealer out of a bag sealer (in the old models these were separate pieces). Now the ring around the sealer itself is broken. NOT WORTH THE MONEY for this reason.",
      "rating": 3.0,
      "verified": true,
      "author": "Linda Locke",
      "helpful_votes": 0,
      "publication_date": 20201019
    },
    {
      "title": "Easy to use, light weight, no problems so far",
      "text": "Super easy to use, has already saved me some money.",
      "rating": 5.0,
      "verified": true,
      "author": "Edwards",
      "helpful_votes": 0,
      "publication_date": 20200427
    },
    {
      "title": "and were so glad we did",
      "text": "We finally jumped in and replaced our 30 plus year old foodsaver....and were so glad we did! What an upgrade to an already wonderful product! Love the auto roll out, the built in vacuum hose for bags, jars and containers. A Perfect fit for our household at a very reasonable price, including a few supplies.",
      "rating": 5.0,
      "verified": true,
      "author": "bp",
      "helpful_votes": 3,
      "publication_date": 20160515
    },
    {
      "title": "Not worth buying",
      "text": "My use was to seal 5 to 10 bags at a time once a week and the machine broke down after 4 months of use. At most I sealed 150 bags in the 4 months I've had it. By my calculations, it cost me $2.67 to seal each bag! It is a badly made product with no quality control in manufacturing. Buyer beware!",
      "rating": 1.0,
      "verified": true,
      "author": "Vick Jacobson",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "MACHINE DOES NOT WORK",
      "text": "1 out of 10 items suctioned. Complete waste of money! The just seal feature does not work either I push the button and nothing happens, completely unclear on why. DO NOT WASTE YOUR MONEY. I would give less than 1 star if that was an option. Blew 300 bucks to try and save money in the long run.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200926
    },
    {
      "title": "Best FoodSaver!",
      "text": "I have owned several FoodSavers throughout the years and this is the best one ever. Love the automatic feed and bag-making and the hand held sealer is a very handy attachment. I use it to seal lunch meats and cheeses in zipper bags which makes them last a couple of days longer.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20170727
    },
    {
      "title": "Stopped working after 5 uses",
      "text": "I received this item on August 29th and I don't use it frequently. On the fifth time of trying to use it, it will either dispense the bag then shut off or do absolutely nothing and shut off. I have only used FoodSaver bags, tried unplugging it and plugging it back in, etc. and it still will not work! It is now past the point of being returned and I'm frustrated since it cost so much.",
      "rating": 1.0,
      "verified": true,
      "author": "Letitia M. Davis",
      "helpful_votes": 0,
      "publication_date": 20181205
    },
    {
      "title": "I got this for myself as an upgrade to my ...",
      "text": "I got this for myself as an upgrade to my older model. I then gave that older model to my daughter. FoodSaver works so well that I even bought a smaller model for my aunt.",
      "rating": 5.0,
      "verified": true,
      "author": "Chi Town Peach",
      "helpful_votes": 0,
      "publication_date": 20170307
    },
    {
      "title": "Don’t buy it it’s junk",
      "text": "I agree with some of the other people I had it about six months now it doesn’t work at all and all I get are non-English-speaking people they keep telling me oh there’s moisture in it I have to turn it up on its side. They told me that every single time I called nobody gives me any information that actually helps so now it’s just a piece of junk that I’m going to throw in the garbage so don’t anybody buy this",
      "rating": 1.0,
      "verified": true,
      "author": "Kathy Andrews",
      "helpful_votes": 0,
      "publication_date": 20191028
    },
    {
      "title": "Happy.",
      "text": "I had one of the first FoodSavers handed down to me by a friend many years ago. (I think she bought a newer model.) Since the one I received was plastic and two pieces, I stored it in a cabinet. This one I leave on display and love the way it functions. I haven't used the hand-held feature yet, so I can't really comment on that.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161110
    },
    {
      "title": "Very Easy to use!",
      "text": "I really like this machine. I had one before but you have to buy the bags and it was a pain. This is super easy to use and does a nice job. I love how it dispenses the bag for you!",
      "rating": 5.0,
      "verified": true,
      "author": "Evan",
      "helpful_votes": 0,
      "publication_date": 20200516
    },
    {
      "title": "Not happy.",
      "text": "The bag sealer hose does not retract easily. The second time I used it the bag sealer hose would not retract at all. I have never even pulled it all the way out. Now it is just hanging on my counter. The instruction book stinks too. Watch thè videos. Easy to use machine and the instruction book makes it sound far more complicated. Otherwise works fine.",
      "rating": 3.0,
      "verified": true,
      "author": "Em",
      "helpful_votes": 0,
      "publication_date": 20180821
    },
    {
      "title": "Good product however it does not work well with any ...",
      "text": "Good product however it does not work well with any other vacuum seal bags other than the food saver bags. These are more expensive and do not com in large economical rolls.",
      "rating": 5.0,
      "verified": true,
      "author": "Mitchell Farbman",
      "helpful_votes": 0,
      "publication_date": 20171106
    },
    {
      "title": "Food Saver broke after  approx 8 months light use",
      "text": "Just like Cherrio (Oct 2017) I purchased my model F5860 in October 31, 2016 Used it until March 2017 when we packed to move. Left it packed. Just tried to use tonight.. It does not work. Power does not stay on, does not cut or seal bags etc I see a comment that there is a 5 year warranty.. I will be on the phone to Food Saver tomorrow AM!!",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara N. Passman",
      "helpful_votes": 0,
      "publication_date": 20170106
    },
    {
      "title": "Easy to use and serves its purpose to slow down ...",
      "text": "The 5860 is way more hands free than its predecessors. Easy to use and serves its purpose to slow down the process of perishable foods. If you like to cook, stock meat, and have a deep freezer I recommend the new FoodSaver 5860.",
      "rating": 5.0,
      "verified": true,
      "author": "O",
      "helpful_votes": 34,
      "publication_date": 20141204
    },
    {
      "title": "Vacuum stopped working with second time of use",
      "text": "I am very disappointed in this product. The first time I used it, it worked as expected. I created bags and I put a half dozen steaks into the freezer, vacuum packed. The next time I went to use it, the vacuum stopped working half way through the first bag. I had purchased not only bags but accessories in anticipation of this making my life easier. Worst mistake ever - never buy ahead.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "Great when it works.",
      "text": "Machine works very good when it works but after using for a few minutes it tends to stop working. I have to let it cool down for several minutes before I can use it again.",
      "rating": 3.0,
      "verified": true,
      "author": "Gil",
      "helpful_votes": 0,
      "publication_date": 20180130
    },
    {
      "title": "Very Convenient",
      "text": "We have started using a Sous Vide and this has made storing and cooking a great deal earier.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200211
    },
    {
      "title": "When it worked it was great",
      "text": "If you do a lot of vacuum sealing it's great, but 6 months after purchasing it doesn't want to work. I have a big family so I seal everything. Now as time has gone on now it works when it wants to. I would have given, and continued to give it a 5 star rating if it still works.",
      "rating": 2.0,
      "verified": true,
      "author": "jwillmott",
      "helpful_votes": 0,
      "publication_date": 20190418
    },
    {
      "title": "Just Wouldn't Suck !",
      "text": "We love FoodSaver , but the new one we received , this up right model would not vacuum . Amazon happily funded our money back. Bought another model and it worked fine.",
      "rating": 1.0,
      "verified": true,
      "author": "Hot Tights",
      "helpful_votes": 10,
      "publication_date": 20170111
    },
    {
      "title": "Broken... used 2 times",
      "text": "We have had the food saver for a year and have only used it twice. We tried using it today and it won’t even stay powered on. We press the power button, it gives a little red flashing dot under progress and shuts itself off. What a waste of money and a horrible product! If you are thinking about buying this, keep looking for a better option.",
      "rating": 1.0,
      "verified": true,
      "author": "Drew h.",
      "helpful_votes": 0,
      "publication_date": 20181220
    },
    {
      "title": "The vacuum never worked",
      "text": "The first one that I bought came to me with a factory defect that prevents the vacuum system to vacuum the bags, Amazon changed the machine for a new one and the new one started with the same trouble at the second week of use. Terrible quality. The machine is noisy but it is easy to use.",
      "rating": 1.0,
      "verified": true,
      "author": "Alejandro",
      "helpful_votes": 0,
      "publication_date": 20190311
    },
    {
      "title": "Waste of money",
      "text": "I am on my second one already. I bought this and after a short time and few uses stopped working. Won't cut and seal, turns off randomly. I replaced the first one only to experience the same problems again. Waste of money",
      "rating": 1.0,
      "verified": true,
      "author": "Edwin T",
      "helpful_votes": 0,
      "publication_date": 20180517
    },
    {
      "title": "Acquired in January...",
      "text": "died in December...cannot find anyway on Amazon to return or complain.",
      "rating": 1.0,
      "verified": true,
      "author": "reid nichols",
      "helpful_votes": 0,
      "publication_date": 20181217
    },
    {
      "title": "Third one I've had is the BEST one.",
      "text": "This is my 3rd \"FOOD SAVER\" sealer - and it is the best. This new design/model makes sealing a breeze. I highly recommend this .",
      "rating": 5.0,
      "verified": true,
      "author": "E. T. Curtis",
      "helpful_votes": 0,
      "publication_date": 20170805
    },
    {
      "title": "Not perfect.",
      "text": "The main sealer does a good job but the built-In retractable handheld sealer stopped working after the second use.",
      "rating": 3.0,
      "verified": true,
      "author": "Kevin",
      "helpful_votes": 5,
      "publication_date": 20160801
    },
    {
      "title": "Expensive but ineffective product and company",
      "text": "Broke after 1 use. Requesting a replacement. Called haven’t gotten an answer yet.",
      "rating": 1.0,
      "verified": true,
      "author": "J",
      "helpful_votes": 2,
      "publication_date": 20180325
    },
    {
      "title": "I like it.",
      "text": "This is one of those products you buy and then wonder why you waited so long. Preserving your food to last longer will make you feel like you are getting ahead of the game money wise. If my needs replaced I will not hesitate to get another one. Same brand and model.",
      "rating": 5.0,
      "verified": true,
      "author": "Larry C.",
      "helpful_votes": 0,
      "publication_date": 20170509
    },
    {
      "title": "Great product for preserving and marinating",
      "text": "The machine works very well, although I had to replace it after two years. I bought another one and purchase a smaller one to use with premade bags. Hopefully this one will last longer than the first one.",
      "rating": 5.0,
      "verified": true,
      "author": "Hugo Garcia",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "This is a POS",
      "text": "This product broke less than 90 days after I bought it and the company has had over 10 days to respond and they are as silent as Crickets. Don't buy this product, its crap!",
      "rating": 1.0,
      "verified": true,
      "author": "Graham S.",
      "helpful_votes": 0,
      "publication_date": 20190630
    },
    {
      "title": "Would buy again!",
      "text": "Great purchase. Easy to use, easy to clean, and sturdy. Non slip feet keep it in place. Uses a bit more bag than I'd like. You have to leave a considerable amount of bag empty for it to register and initiate the sealing process. Otherwise, an excellent purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Joseph",
      "helpful_votes": 0,
      "publication_date": 20191003
    },
    {
      "title": "Suction Seems Erratic",
      "text": "I was extremely impressed with the FoodSaver the 1st time I used it, but the second time, it didn't seem to remove as much air as the first. The third time was OK. I will continue to see if this is a problem, and follow up with an update.",
      "rating": 3.0,
      "verified": true,
      "author": "Dominic G.",
      "helpful_votes": 0,
      "publication_date": 20200721
    },
    {
      "title": "Love it.",
      "text": "I bought this as a replacement for one of the original models. This one has worked flawlessly. I have not had any if the problems that I read about in the reviews. This is truly a great appliance. I just hope it lasts as long as the original.",
      "rating": 5.0,
      "verified": true,
      "author": "Doug Holmes",
      "helpful_votes": 0,
      "publication_date": 20180804
    },
    {
      "title": "A little pricey, yet functional..",
      "text": "Not bad, however not sure it is worth the extra cost over some of the lower end models. Time well tell..",
      "rating": 4.0,
      "verified": true,
      "author": "Craig",
      "helpful_votes": 0,
      "publication_date": 20190227
    },
    {
      "title": "Which a little easier to do breads, muffins",
      "text": "Excellent recommended to everyone, love the vacuum seal for the containers, great for storing sugar, flour and marinating, also great for preparing meals weeks ahead!",
      "rating": 5.0,
      "verified": true,
      "author": "Francine",
      "helpful_votes": 0,
      "publication_date": 20180410
    },
    {
      "title": "looks",
      "text": "This Food Saver replaced our original 20+ year old model. The new one has all the bells and whistles...it matches all our other kitchen appliances...we now have it on our counter full time and it is so handy to use. My wife loves it!",
      "rating": 5.0,
      "verified": true,
      "author": "Frank C.",
      "helpful_votes": 0,
      "publication_date": 20190124
    },
    {
      "title": "Junk",
      "text": "Bought this unit and only used it a handful of times before it quit working.",
      "rating": 1.0,
      "verified": true,
      "author": "Chris M.",
      "helpful_votes": 0,
      "publication_date": 20190317
    },
    {
      "title": "This is my 3rd FoodSaver",
      "text": "I LOVE FoodSaver (I've owned older models). This one is the Cadillac of of my previous versions, love the auto feed and seal. I would definitely recommend this.",
      "rating": 5.0,
      "verified": true,
      "author": "Nysta",
      "helpful_votes": 0,
      "publication_date": 20171222
    },
    {
      "title": "Compact",
      "text": "As described and the Bag despensor is a plus making it easy to custom fit to any item with less bag waste.",
      "rating": 5.0,
      "verified": true,
      "author": "jerry mackey",
      "helpful_votes": 0,
      "publication_date": 20200615
    },
    {
      "title": "It is awesome! I love the ability to autocut my bags",
      "text": "Purchased this to upgrade an older unit. It is awesome! I love the ability to autocut my bags. I also really like the marinate feature! Would highly recommend and would buy again!",
      "rating": 5.0,
      "verified": true,
      "author": "Moser",
      "helpful_votes": 0,
      "publication_date": 20160402
    },
    {
      "title": "JUNK",
      "text": "I thought I was purchasing a quality item by spending $300.00 so it must be good -- NOT. Used maybe 12 times in 9 months then it stopped sealing. THINK I,LL STICK WITH PRESS & SEAL",
      "rating": 1.0,
      "verified": true,
      "author": "LAB LOVER",
      "helpful_votes": 0,
      "publication_date": 20190710
    },
    {
      "title": "Love it. This was an upgrade from my older ...",
      "text": "Love it. This was an upgrade from my older model. The auto functions are a time saver. I'd recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "gears",
      "helpful_votes": 0,
      "publication_date": 20180510
    },
    {
      "title": "One Star",
      "text": "Used it twice and now it won’t come on and work.",
      "rating": 1.0,
      "verified": true,
      "author": "jennifer",
      "helpful_votes": 2,
      "publication_date": 20171208
    },
    {
      "title": "Sealing",
      "text": "This machine is super easy to use however I have not owned it for one year yet and it will not seal bags. Very disappointed now I have to see if I can a new one sent",
      "rating": 2.0,
      "verified": true,
      "author": "angelique Laurent",
      "helpful_votes": 0,
      "publication_date": 20180917
    },
    {
      "title": "Works great and use this product all the time.",
      "text": "Mostly used for cooking in Side Vide and resealing any uneaten leftovers for refrigeration.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180703
    },
    {
      "title": "Don’t buy. Bad quality. Used once and it failed",
      "text": "Bought in Feb 2019. Used once in April 2019. Just tried using in Jan 2020 and it has broken down. The machine turns on but it rapidly switches off. Doesn’t perform the dispensing of the roll nor the suction Horrible quality",
      "rating": 1.0,
      "verified": true,
      "author": "TY",
      "helpful_votes": 0,
      "publication_date": 20200125
    },
    {
      "title": "Very nice upgrade to an older model",
      "text": "Takes all the guess work out. Feeds the bag size you want and automatically seals one end. Then you put in your food, enter the open end and it vacuums and seals. Very easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Fortune",
      "helpful_votes": 0,
      "publication_date": 20180315
    },
    {
      "title": "Poor ceiling and cutting",
      "text": "Not a very good vacuum sealer. The seal and cut function will overheat and not cut the bag due to it being too warm (jams up). Also will not seal bag when there is food that has juices in it. Would not recommend this product.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200509
    },
    {
      "title": "Questionable ...",
      "text": "When it worked, it worked well. The problem was that this year - 2 years after buying it - it stopped working! For the price I would have expected better quality.",
      "rating": 2.0,
      "verified": true,
      "author": "Charles E. Wegrzyn",
      "helpful_votes": 2,
      "publication_date": 20151030
    },
    {
      "title": "Terrible product, never worked",
      "text": "This food sealer never worked well, only used it a couple of times per year, and had difficulty, to the point of having to pound on it with my fist, to get the motor to start. Don’t buy it.",
      "rating": 1.0,
      "verified": true,
      "author": "Mark Schmidt",
      "helpful_votes": 0,
      "publication_date": 20190111
    },
    {
      "title": "Barely worked to begin with and now in less than 2 years will not turn on.  Do not buy",
      "text": "The headline says it all. I have struggled with this machine since the first day I received it. I assumed I wasn't doing something right, but now it won't even turn on after less than two years and 6 uses. Save yourself the hassle.",
      "rating": 1.0,
      "verified": true,
      "author": "Jennifer",
      "helpful_votes": 0,
      "publication_date": 20190128
    },
    {
      "title": "Looks good",
      "text": "I love this it is what I needed for our home",
      "rating": 5.0,
      "verified": true,
      "author": "Pat Hoffman",
      "helpful_votes": 0,
      "publication_date": 20190205
    },
    {
      "title": "Disappointed with Quality of this Product",
      "text": "This is the third and final FoodSaver Vacuum Sealer I will purchase. Each one I have purchased ended up failing less than a year after purchasing.",
      "rating": 1.0,
      "verified": true,
      "author": "Christopher Shultz",
      "helpful_votes": 0,
      "publication_date": 20190803
    },
    {
      "title": "Must buy elevate your life",
      "text": "Makes life way more convenient and saves money. Great buy for the price, and super easy to use",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel A.",
      "helpful_votes": 0,
      "publication_date": 20181115
    },
    {
      "title": "Good product",
      "text": "Does the job very well, and contrary to earlier views, really makes no more noise than our older version and does a better job.",
      "rating": 5.0,
      "verified": true,
      "author": "V. Albarez",
      "helpful_votes": 0,
      "publication_date": 20180418
    },
    {
      "title": "Randomly stopped working after light use",
      "text": "Stopped working after sealing perhaps a grand total of 50 items over a couple of months, like many others here. Won't turn on, or if it does will neither seal/cut a bag or vacuum anything. Stay away.",
      "rating": 1.0,
      "verified": true,
      "author": "CasperK",
      "helpful_votes": 0,
      "publication_date": 20181117
    },
    {
      "title": "Love it!",
      "text": "Exceptionally pleased so far. I haven't had it long enough to comment on durability, but it is super-simple to operate and seals really well. I was worried that I wouldn't use it enough to justify the expense. But now I'm convinced it will be used on a regular basis. I'm glad I spent the extra money for the fully-automatic model.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe Average",
      "helpful_votes": 37,
      "publication_date": 20141214
    },
    {
      "title": "From Optional to Essential",
      "text": "Can't say enough how much my wife and like this FoodSaver. It is easy to use, very well built and does an excellent job vacuum sealing, allowing for you to make the exact bag size you need and cutting the material. It is getting a lot of use and especially the hand-held vacuum sealer. I wish we would have purchased a FoodSaver sooner. Now that we are in our mid-sixties and very active, we eat less and with this machine, we also waste less!",
      "rating": 5.0,
      "verified": true,
      "author": "Jungle Larry",
      "helpful_votes": 4,
      "publication_date": 20170108
    },
    {
      "title": "All in all it works well",
      "text": "It waste more of material to trigger the auto vac/seal Tha I think necessary.",
      "rating": 5.0,
      "verified": true,
      "author": "Emuntz",
      "helpful_votes": 0,
      "publication_date": 20200307
    },
    {
      "title": "Very easy to use.",
      "text": "So far so good. This foodsaver works like a champion and is very easy to use and set up. I have only just it once, but it helped pack almost 200 pounds of meat without failing.",
      "rating": 5.0,
      "verified": true,
      "author": "James Gonzales",
      "helpful_votes": 0,
      "publication_date": 20190103
    },
    {
      "title": "Great product",
      "text": "Had to replace the old one, this one has more features and quieter. Works great.",
      "rating": 5.0,
      "verified": true,
      "author": "Charles",
      "helpful_votes": 0,
      "publication_date": 20190105
    },
    {
      "title": "Nice to hv food perfect from freezer",
      "text": "We replaced our old food saver and this is so easy to use! We save tons by sealing leftovers.",
      "rating": 5.0,
      "verified": true,
      "author": "Tlw",
      "helpful_votes": 0,
      "publication_date": 20181012
    },
    {
      "title": "Very easy to operate",
      "text": "Very easy to operate. Works just as described. I've been using it for about a month now. If anything changes, I'll be sure to update.",
      "rating": 5.0,
      "verified": true,
      "author": "JTS",
      "helpful_votes": 0,
      "publication_date": 20161211
    },
    {
      "title": "Replacement",
      "text": "Upgrade from my old one much easier to use great unit",
      "rating": 5.0,
      "verified": true,
      "author": "Bob M.",
      "helpful_votes": 0,
      "publication_date": 20181005
    },
    {
      "title": "Ease of use",
      "text": "Works right out of the box. No hassle. Virtually hands free.",
      "rating": 5.0,
      "verified": true,
      "author": "Gerald H. Schiff",
      "helpful_votes": 0,
      "publication_date": 20200208
    },
    {
      "title": "Great for anyone wishing to keep food fresh",
      "text": "Love my new toy. Keeps food fresh - no freezer burn. This unit is easy to operate and with rolls, you can make your own bag size. For those in a hurry or doing lots, I suggest buying bags",
      "rating": 5.0,
      "verified": true,
      "author": "Janice wilson",
      "helpful_votes": 0,
      "publication_date": 20180125
    },
    {
      "title": "You will not get what you order",
      "text": "I think this unit has been returned before as it did not have any vacuum seal bags or marinate container and had a dent. The replacement had bags and container.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190129
    },
    {
      "title": "Five Stars",
      "text": "Food stays fresh much longer and are easier to stack in the fridge and freezer.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel",
      "helpful_votes": 0,
      "publication_date": 20170418
    }
  ],
  "product_meta": {
    "title": "FoodSaver FM5860 Vacuum Sealer Machine with Express Bag Maker & Auto Bag Dispense and Rewind | UL Safety Certified | Silver",
    "description": "The innovative 5800 Series 2-IN-1 Vacuum Sealing System with Automatic Bag, Dispense, Rewind, Cut & Seal. The 5800 Series combines both heat-seal and handheld vacuuming capabilities in one unit, giving you more ways to seal and more ways to save. Cord length: 30 inches. Do not use appliance on wet surfaces or outdoors.",
    "rating": 4.2,
    "feature_bullets": [
      "SAVE MORE, WASTE LESS: Food preserved with the FoodSaver System in the freezer can last up to 3 years and still taste fresh, flavorful, and freezer-burn free. Prep-ahead meals, leftovers, and produce stored in the fridge will stay fresh up to weeks later instead of spoiling in days",
      "MORE CONVENIENT FEATURES: Easy-to-use control panel lets you dispense and rewind bag material, notifies you when the drip tray is full, displays vacuum seal progress, and offers LED indicator lights for at-a-glance troubleshooting",
      "AUTOMATIC BAG MAKER & SEALER: Quickly make a bag from your favorite FoodSaver roll by dispensing enough material to fit your item, then pressing the 'Seal & Cut' button; once your item is placed in the bag, the system automatically vacuums and seals",
      "EXTRA-WIDE SEALING STRIP WITH NONSTICK COATING: Guaranteed to reach an optimal vacuum level and airtight seal. The FM5860 is durable, high quality, and backed by a 5-year limited warranty",
      "MARINATE IN MINUTES: Get optimum flavor infusion in the least amount of time! Simply connect the handheld accessory to the Quick Marinator and press the \"Marinate\" button",
      "RETRACTABLE HANDHELD SEALER: Use the handheld sealer to start preserving food in the refrigerator and pantry with FoodSaver Zipper Bags and Fresh Containers (sold separately)",
      "NRTL TESTED & CERTIFIED PRODUCT: All FoodSaver appliances are ETL or UL certified by Nationally recognized test laboratories (nrtls) for compliance with applicable product safety test standards. Safety is our #1 priority. Rapid Marinate mode marinates in minutes instead of hours",
      "COMPATIBILITY: Works with FoodSaver 8\" and 11\" Vacuum Seal Rolls, All Pre-Made Bag Sizes, FreshSaver Zipper Bags, Fresh Containers, and Quick Marinator",
      "INCLUDES: (1) 11\" x 10' Vacuum seal roll; (1) 8\" x 10' Vacuum seal roll; (3) 1-Quart vacuum seal bags; (2) 1-Gallon vacuum seal bags; (3) 1-Quart vacuum zipper bags; (2) 1-Gallon vacuum zipper bags; (1) Marinator",
      "Automatic bag dispense & rewind, automatic bag cut & seal - just place the bag in and the machine does the rest",
      "One-Touch marinate and vacuum modes",
      "Built-In retractable handheld sealer seals zipper bags, canisters, containers and marinates food in minutes",
      "Air tight heat seal",
      "5-Year warranty",
      "FoodSaver Vacuum Sealing Systems are engineered to work best with FoodSaver bags and rolls"
    ],
    "specifications": {
      "Product Dimensions": "19 x 6.25 x 8 inches",
      "Item Weight": "14.92 pounds",
      "Manufacturer": "Jarden Consumer Solutions",
      "ASIN": "B00O0UMUEA",
      "Item model number": "FSFSSL5860-DTC",
      "Customer Reviews": "4.2 out of 5 stars512 ratings4.2 out of 5 stars",
      "Best Sellers Rank": "#64,799 in Kitchen & Dining",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "September 23, 2014"
    },
    "categories": [
      "Small Appliances",
      "Home & Kitchen",
      "Specialty Appliances",
      "Vacuum Sealers",
      "Kitchen & Dining"
    ],
    "price": 369.99
  }
}