{
  "website_summaries": [
    {
      "verdict": "Built with a 2-way laser that makes 3D printing fun and easy for beginners.",
      "pros": [
        "We love that this printer not only creates 3D scans, but can also print in 3D as well",
        "Great for classrooms where learning curves are expected",
        "Comes with quick and simple settings"
      ],
      "cons": [
        "May not have the technology to accurately capture objects with soft edges"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Had some great prints. It quit working about 2 month into ...",
      "text": "Had this printer 2 months. Had some great prints. It quit working about 2 month into its use and their tech support was no help. Local technology repair shop helped to try to fix it with the company. It took 3 months to get the parts back and it still does not work. Not satisfied with their customer support what so ever.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 17,
      "publication_date": 20160304
    },
    {
      "title": "I' had this thing over a year and haven't been ...",
      "text": "I' had this thing over a year and haven't been able to print ANYTHING on it from my computer. I am very upset and a very disgruntled customer! I personally would not buy it again! I can't get any help from anyone that speaks English. In my opinion it is a piece of junk! The only reason I gave it one star is that is the only way I could give my review!",
      "rating": 1.0,
      "verified": true,
      "author": "Mike S",
      "helpful_votes": 6,
      "publication_date": 20170106
    },
    {
      "title": "Buyers Beware",
      "text": "Scanner is too faulty so we cant scan anything that has multiple colors or barely shinny even a Styrofoam cup it misses a lot of area. When we contacted within a few days of purchase we were told to contact support before sending it back and if it didnt have issues they would charge us a 30% fee.... When we called they basically said it was working they way it should even though we cant scan anything to the point of a printable use. Also before buying we didn't know that we could only use their filament. NOT going to be buying from XYZprinting again.",
      "rating": 1.0,
      "verified": true,
      "author": "Danyl",
      "helpful_votes": 13,
      "publication_date": 20160413
    },
    {
      "title": "Not Happy",
      "text": "Machine broke down 2 weeks after getting it. They play a game asking complicated questions and now 3 month's latter \"Silence\". Machine is in parts waiting for parts but they haven't showed up.... Not Happy",
      "rating": 1.0,
      "verified": true,
      "author": "DPI",
      "helpful_votes": 25,
      "publication_date": 20150510
    },
    {
      "title": "VERY BAD SOFTWARE, good printer",
      "text": "The software accompanying the printer is poor, poor, POOR and any help you seek from XYZPrinting assumes you have the intellect of a monkey. I asked, \"How do you tell the printer that the object to be printed is hollow?\" The answer I got was word for word from the Software instructions for calibrating the Scanner. I asked again and now they wanted a picture and other documentation of the object. I STILL don't know how to tell the printer that the object is hollow. The printer does an acceptable job of printing. Overall, I DO NOT RECOMMEND this printer.",
      "rating": 2.0,
      "verified": true,
      "author": "James A. Billings",
      "helpful_votes": 4,
      "publication_date": 20150423
    },
    {
      "title": "great printer for the money",
      "text": "great printer for the money. Has the scanning tray that I haven't used a lot so I could have done without paying extra for that but it is still nice to have none the less. You can download the software offline but I wish it was a little more complex but then again you can just use other software. Very user friendly and easy to operate, it provides great prints. Great for beginners or recreational hobbiest. Only downside is the filament is tagged so you must use their filament instead of any brand, but that's a small price to pay. Especially since the printer to so cheap. Good buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Kyle",
      "helpful_votes": 0,
      "publication_date": 20170116
    },
    {
      "title": "very impressed",
      "text": "very nice printer for the money. I spent much more other printers that I can to assemble myself. This Da vinci AiO work out of the box. no calibration needed. Packaging was A+. But im sure I will need to calibrate sooner or later. There's plenty of youtube vids to watch and learn. Sure the software needs improvement, but its ok for beginners. I haven't tried the scanner yet. I will update this review as I get more experience with this model. Im selling my old iPrusa 3 if anyone wants it... lol",
      "rating": 5.0,
      "verified": true,
      "author": "valarok",
      "helpful_votes": 0,
      "publication_date": 20151002
    },
    {
      "title": "AVOID BUYING THIS MODEL, YOU'LL BE SORRY!",
      "text": "This unit is GARBAGE! Cant scan worth a damn, prints poorly compared to my other DaVinci printers, and you need a rocket scientist to calibrate it. I have no problem calibrating my other DaVinci products. DO NOT BUY THIS MODEL, YOU WILL BE SORRY, but the 1.0 PRO instead, it's cheaper and works great.",
      "rating": 1.0,
      "verified": true,
      "author": "B Yellen",
      "helpful_votes": 0,
      "publication_date": 20180503
    },
    {
      "title": "One Star",
      "text": "Worked great for a month, Turned out to break down alot. Customer service is awful. Do not buy!",
      "rating": 1.0,
      "verified": true,
      "author": "Christopher P. Johnson",
      "helpful_votes": 4,
      "publication_date": 20161228
    },
    {
      "title": "Basicly the 3 level springs was bad springs. I removed them and \"made them longer\" ...",
      "text": "OK. When i received the machine it sux. Took me a week to put it to work and problem was probably they didnt made a last test on factory or something. 1) Extruder connector was umplugged on the mainboard, so no temp on extruder. took me a day to figure (take courage to open it). 2) The Bed lost level very fast, so i was able to end a print with much luck. Basicly the 3 level springs was bad springs. I removed them and \"made them longer\" and the problem got fixed. After this \"bad quality controls on factory\" got fixed, the machine IS GREAT. Print very smooth, made 4 prints already without leveling and is amazing.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170525
    },
    {
      "title": "The first one I purchased printed flawlessly but started having ...",
      "text": "The first one I purchased printed flawlessly but started having problems and I promptly received a replacement. Two corners of the box were damaged along with the Styrofoam inside and this unit constantly 'bird nests' every project I've tried, usually 8 - 10 hours into the job. I had an earlier model without the scanner and it did the same thing so it's apparently hit-or-miss with them.",
      "rating": 2.0,
      "verified": true,
      "author": "Kev Romine",
      "helpful_votes": 0,
      "publication_date": 20170503
    },
    {
      "title": "A 3D printer for the people.",
      "text": "This is a very good printer for the price point. Like any 3D printer if you are new to the process I suggest you do some research before getting started. Spending a few hours reading up on best practices and settings will pay off quickly. That being said, I was turning out good quality prints shortly after unboxing this unit. The best advice I can give you for getting started with this unit is to clean the extruder after each print. This doesn't take a lot of time to do and it really helps insure a good consistent print. I definitely recommend this printer to anyone who wants to get started with 3D printing.",
      "rating": 4.0,
      "verified": true,
      "author": "Christopher K.",
      "helpful_votes": 3,
      "publication_date": 20150119
    },
    {
      "title": "XYZ has horrible customer support",
      "text": "XYZ has horrible customer support!! Had an issue for 5 months now and no reply. Printer worked great before this issue tho. Scanner is 2/5 stars.",
      "rating": 1.0,
      "verified": true,
      "author": "Shawn",
      "helpful_votes": 5,
      "publication_date": 20160315
    },
    {
      "title": "So far......... So good !!!",
      "text": "Took some time !! But so far, so good !! I think I had a windows 10 problem, but after updating the software and firmware it finally worked. I figured, if I learn 3D printing on what's available now, when high quality printers come available at lower costs, I will really know what I'm doing. This printer works great and I am glad I finally purchased one. I DO like the cartridge filament system. Watch some you tube videos, download some sh*t and print !!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Mister J.",
      "helpful_votes": 0,
      "publication_date": 20150819
    },
    {
      "title": "Great machine! Great customer service !",
      "text": "Five stars even as first out of box machine had a bad usb. Tech support was good helpful but expect to email your way to tech support before a call back. first print of a prototype completed the rod in the bore slid through with tight tolerance as shown. Amazingly accurate !!!! Easy set up interface is easy to understand. Follow up review for scanner to come.",
      "rating": 5.0,
      "verified": true,
      "author": "Problems Solved",
      "helpful_votes": 0,
      "publication_date": 20151014
    },
    {
      "title": "Product worked fine for about 3 weeks",
      "text": "Product worked fine for about 3 weeks, then one of the drive belts broke. I have tried to contact support 3 times and have yet to receive a response. Their website is not very good. Little or no information is provided about how to obtain warranty service or replacement parts. Too bad since the product works fairly well for the price!",
      "rating": 2.0,
      "verified": true,
      "author": "Tom",
      "helpful_votes": 2,
      "publication_date": 20150802
    },
    {
      "title": "The scanner isn't that great but the printer is",
      "text": "This is one of the coolest things I have purchased. The scanner isn't that great but the printer is. I use autodesk inventor for my designs but the scale never seems correct. I hope to try one of the other printers soon to have something to compare with but overall this printer pretty good quality once you learn how to use it.",
      "rating": 4.0,
      "verified": true,
      "author": "JC1972",
      "helpful_votes": 0,
      "publication_date": 20160605
    },
    {
      "title": "Software CD useless, had todownload from xyz website Tech support next ...",
      "text": "Error 31 out of box, repaired myself with web research. Software CD useless,had todownload from xyz website Tech support next to useless. Multiple calls over several days went to voicemail with no reply when I did reach tech ,very hard to understand , very long call with.ittle help. Don't expect it to work out of box or much help. Seems to work okay now at least",
      "rating": 3.0,
      "verified": true,
      "author": "Punde",
      "helpful_votes": 0,
      "publication_date": 20170119
    },
    {
      "title": "... on the laptop then it worked over all a nice",
      "text": "Timely delivery prints well scans well after calibration wish I had known about only being able to use xyz filament ordered the refill with the new chip the software didn't recognize it at first had to uninstall and reinstall the software on the laptop then it worked over all a nice printer",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20150416
    },
    {
      "title": "Decent product, Yet many design and software flaws has me looking at other options",
      "text": "At first it seems like a good value, Yet it's still a very flawed product with lots of bugs to work, especially the software. The sheer amount of filament I've wasted is outrageous.",
      "rating": 2.0,
      "verified": true,
      "author": "Robbie Jinson",
      "helpful_votes": 0,
      "publication_date": 20161205
    },
    {
      "title": "good buy for me",
      "text": "Wow just started 3-d printing for te casino parties and it is a best tool for a home business I have. Little knowledge about 3-d printing needed with this . You shod watch a video and read how to scan that is a bit tricky",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20150921
    },
    {
      "title": "Can a printer this inexpensive be useful to make \"real\" parts? It can already printed a replacement handle and it worked great",
      "text": "Great little 3D printer, haven't used the scanner yet but if it work as well as the printer (and I assume it will) this is a great combo buy.",
      "rating": 5.0,
      "verified": true,
      "author": "TechGuy",
      "helpful_votes": 11,
      "publication_date": 20150302
    },
    {
      "title": "... and how new 3d printing still is it's a great printer. There are a lot of bad reviews",
      "text": "Considering the price and how new 3d printing still is it's a great printer. There are a lot of bad reviews, but take time to work with it. It's good to start with and good for learning maintenance involved with it. Get the Davinci Calibrator app off amazon if you plan to buy it. Its only a 1.50 and honestly most of the fustration from this machine can be solved with calibration and stickier glue.",
      "rating": 5.0,
      "verified": true,
      "author": "Brandon",
      "helpful_votes": 0,
      "publication_date": 20160228
    },
    {
      "title": "Totally fun, totally frivolous",
      "text": "Totally fun, totally frivolous, really cool, occasionally frustrating - not 100% reliable about 1 in 5 or 6 prints gum up and just don't work. Monitor it for the first 10 minutes",
      "rating": 4.0,
      "verified": true,
      "author": "Frederick M Greatorex",
      "helpful_votes": 0,
      "publication_date": 20170106
    },
    {
      "title": "da Vinci 3D printer",
      "text": "Pro: Easy to use Con: Cannot use other brands of filament. The scanner sucks.",
      "rating": 3.0,
      "verified": true,
      "author": "Pensacola",
      "helpful_votes": 0,
      "publication_date": 20190805
    },
    {
      "title": "Some damage during ship ment but it's printing good know",
      "text": "Mine was somewhat damaged during shipment the x axes screw was loose and I saw the peace that was broken off and my machine is restarting it self for no reason when ever I print something there's a 50% chance that it will restart its very annoying but know it's printing fine and I have 9 of there cartridges and 2 of theme are a leagle cartridge which was annoying I don't mine buying there filiment thow. But know it's printing fine so I couldn't be happier!!",
      "rating": 3.0,
      "verified": true,
      "author": "Patricia Hogan O’Donnell",
      "helpful_votes": 0,
      "publication_date": 20150906
    },
    {
      "title": "I do not recommend this product or anythis else that they would make ...",
      "text": "I have had this for awhile now. 200 an something hours on it.I already had to replace the heater bed. Tryed to contact xyz printing never heard any thing from them. It should of been under warranty still. I do not recommend this product or anythis else that they would make tell they get there customer service to take care of problems with products",
      "rating": 3.0,
      "verified": true,
      "author": "Logan",
      "helpful_votes": 0,
      "publication_date": 20150921
    },
    {
      "title": "The software sucks",
      "text": "Not really the best 3d printer out there. Mainly because of the software",
      "rating": 2.0,
      "verified": true,
      "author": "jesus",
      "helpful_votes": 0,
      "publication_date": 20150614
    },
    {
      "title": "If has some serious setbacks.",
      "text": "I noticed the people that give 5 stars haven't scanned a thing. Don't rate this machine until you know this machine people. Printing a keychain from a internal test file does not count. If you are buying this because of the built in scanner or if that even swayed your decision, I wouldn't buy this machine. The scanner is next to useless. Doesn't do a quality job at all. I've seen cheap stand alone units do much better. The print quality is ok but slow. I was not impressed with this unit. If you want to return it, pack a lunch. Pack about 15 lunches. Still waiting for a refund.",
      "rating": 2.0,
      "verified": true,
      "author": "Hello My Name Is Major Paynin Theass",
      "helpful_votes": 2,
      "publication_date": 20151213
    },
    {
      "title": "the software got so annoying, I updated",
      "text": "###### VERY IMPORTANT WARNING ######## I have owned this for 1 year. I have only bought certified filament cartidges. I avoided software updates. But, the software got so annoying, I updated. The XYZ Ware software update now requires you to create and log into your account to use the product. If you think you own this product, think again.",
      "rating": 1.0,
      "verified": true,
      "author": "Chris Ngo",
      "helpful_votes": 6,
      "publication_date": 20161213
    },
    {
      "title": "Bad idea all the way around, utter trash",
      "text": "The worst possible way to get into 3D printing and software is trash. Also they are way bigger than necessary. The extruded had to be pushed into place. It made a loud noise at first, and good luck leveling the heat bed if you need to. I could rant on but the main point is that this is trash. Yeah they can work but it's on hopes and wishes, it's not reliable. I sunk hours if not days wasted just not being able to print for a myriad of reasons. So please save yourself the hassle. Don't buy",
      "rating": 1.0,
      "verified": true,
      "author": "J C",
      "helpful_votes": 7,
      "publication_date": 20150814
    },
    {
      "title": "This machine is a good platform to learn about 3D printing",
      "text": "This was a gift for my grandson. This machine is a good platform to learn about 3D printing. While there may be machines available that may be better suited for a particular purpose, this machine does everything pretty well.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephen R Hastings",
      "helpful_votes": 0,
      "publication_date": 20170109
    },
    {
      "title": "It was a great printer at first",
      "text": "It was a great printer at first, now it has calibration problems. Not to mention that the scanner does not work. Avoid this printer .",
      "rating": 2.0,
      "verified": true,
      "author": "Omar Cuevas",
      "helpful_votes": 0,
      "publication_date": 20161207
    },
    {
      "title": "One Star",
      "text": "useless. the software is very unstable and print scan quality is horrible.",
      "rating": 1.0,
      "verified": true,
      "author": "Jeff",
      "helpful_votes": 2,
      "publication_date": 20141220
    },
    {
      "title": "DON'T BUY THIS PRODUCT",
      "text": "Worked for 2 months. Contacted XYZ for assistance, don't bother. There is one person there, she doesn't speak English well enough to help you. When it worked, it was printing consistent product, but it's not for beginners. Newest software updates fixed some glitches, but it blocked the printer. Plus now Amazon won't return it. To many headaches, I guess I was expecting plug and play. If you are a programmer, and have endless hours and days to modify the firmware and find slicing software, and check g-code then you might enjoy this printer.",
      "rating": 2.0,
      "verified": true,
      "author": "InstaPot Owner",
      "helpful_votes": 2,
      "publication_date": 20150819
    },
    {
      "title": "Ok printing, really bad scanner",
      "text": "Ok printing, really bad scanner. I bought this because of the scanner, but it is really but.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20150330
    },
    {
      "title": "Great 3D printer but quality control on the assembly line ...",
      "text": "Great 3D printer but quality control on the assembly line needs some improvement because tie wraps were so tight that I had a failing sensor wiring harness in 45 days of use. After a quick check on the Web I found out I am not the only one.",
      "rating": 4.0,
      "verified": true,
      "author": "McGyver",
      "helpful_votes": 0,
      "publication_date": 20150508
    },
    {
      "title": "Laser scanning was adervisted as scanning down to 100 microns ...",
      "text": "Laser scanning was adervisted as scanning down to 100 microns ( .25mm). Does not even get close to that detail. Their tech support said they knew it doesn't and they are working on firmware to fix the issue. The extruder jams up every other print. The filament feed gears get clogged up all the time. Their customer service is a joke. They tell you to do the same steps over and over and over again. Not to mention the length of time it takes them to get back to you about an issue.",
      "rating": 1.0,
      "verified": true,
      "author": "matthew caudill",
      "helpful_votes": 5,
      "publication_date": 20160517
    },
    {
      "title": "THIS PRINTER IS GARBAGE!!!!!!",
      "text": "ABSOLUTE GARBAGE! Do not buy this! It'll maybe print one thing then need at least an hour to calibrate. The instructions that come with it say it's been \"professionaly calibrated\" but that's a lie, I checked to see if it was actually calibrated and all the axis points were horribly off what they're supposed to be. Buying this garbage will just waste your time and money! Spend the extra couple dollars and buy something that will actually work.",
      "rating": 1.0,
      "verified": true,
      "author": "SymbiteSpider 26",
      "helpful_votes": 2,
      "publication_date": 20161013
    },
    {
      "title": "This is a great printer. Definitely the best printer you can get ...",
      "text": "This is a great printer. Definitely the best printer you can get for the money, but the scanner is almost worthless. The scanner is very finicky and delivers a lackluster version of the image scanned if it can see it at all.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160408
    },
    {
      "title": "The scan software kept crashing, either have to terminate ...",
      "text": "The scan software kept crashing, either have to terminate and re-run, or after a (rare) success scan, it simply failed to save the scanned file. Tried to call the 800 number for help, but could not even leave a message to call back. It simply hanged up on me. Can anyone help?",
      "rating": 1.0,
      "verified": true,
      "author": "NYS",
      "helpful_votes": 3,
      "publication_date": 20150711
    },
    {
      "title": "Three Stars",
      "text": "Nice printer when it works. It keeps coming out of calibration and is very difficult to recalibrate.",
      "rating": 3.0,
      "verified": true,
      "author": "Gary James",
      "helpful_votes": 0,
      "publication_date": 20150107
    },
    {
      "title": "Anything but \"all in one\"",
      "text": "I had high hopes for this \"all in one\" device given its decent reviews. Unfortunately, the calibration process is convoluted and the entire software is anything but intuitive. The instruction manual was cheaply produced and tossed together in a hodgepodge manner. I spent 6 hours trying to get a usable scan and had zero success. The printer was slightly better but still produced a mess of a print. Makes me think it's better to buy a scanner separately. I'm definitely returning this device.",
      "rating": 1.0,
      "verified": true,
      "author": "TM",
      "helpful_votes": 3,
      "publication_date": 20150708
    },
    {
      "title": "I moved the switch forward just a bit and bingo the axis home out just fine and no more 0031 alarm",
      "text": "I received the printer at the time they said I would,when I got it out of the box and got it plugged in right away it gave me a 0031 alarm which was the Y axis motor that it wouldn't home out due to the switch been in the wrong position.I moved the switch forward just a bit and bingo the axis home out just fine and no more 0031 alarm,been printing since I fix the problem and its been working fine \" I love this thing\" is awesome,is exactly what I expected to be.",
      "rating": 4.0,
      "verified": true,
      "author": "Brian Sanchez",
      "helpful_votes": 0,
      "publication_date": 20150208
    },
    {
      "title": "scanner doesn't work, and the print quality sucks, REAL BAD",
      "text": "The printer sucks, and the scanner hasn't worked since I took it out of the box, as a result I will be returning this printer, they sold me on the idea that I can get a printer and scanner in one, but if the printer sucks, and the scanner doesn't work, then it's just a waste of money",
      "rating": 1.0,
      "verified": true,
      "author": "Jesse David",
      "helpful_votes": 0,
      "publication_date": 20150914
    },
    {
      "title": "Product not quite ready for prime time. The product ...",
      "text": "Product not quite ready for prime time. The product was delivered without needed firmware. The firmware was not available on the website or downloadable via the xyz software. After spending 40+ hours disabling all security settings and trying to get a hold of the support help desk we gave up and returned the da Vinci printer.",
      "rating": 1.0,
      "verified": true,
      "author": "Ron Butler",
      "helpful_votes": 2,
      "publication_date": 20150328
    },
    {
      "title": "ya know a lot has been said about this printer ...",
      "text": "ya know a lot has been said about this printer, but you just got to know how to use it. i've made prototypes that i haven't patented yet that could result in crazy amounts of revenue. scanning i'm still working on but not the most enthusiastic about, it's still baby stages, but research how to print and what you want your printer to do... you can youtube the rest.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian",
      "helpful_votes": 0,
      "publication_date": 20151118
    },
    {
      "title": "Terrible, crap product.",
      "text": "Pretty terrible product. The 3D scanning is a joke. The bed heats up so hot that it warps the printed item. No option to turn it off. The extruded heater just stopped working today. Going to fix it myself. Looks like it's a cheap, crappy circuit design. I don't recommend this product to anyone.",
      "rating": 1.0,
      "verified": true,
      "author": "Dom",
      "helpful_votes": 0,
      "publication_date": 20170717
    },
    {
      "title": "Reviews are accurate. Here are the basics.",
      "text": "Nothing I can say that others have not. 1. Its big. 2. USE THE GLUE STICK 3. Watch the videos. 4. Not a beginners machine!",
      "rating": 5.0,
      "verified": true,
      "author": "Pete J.",
      "helpful_votes": 0,
      "publication_date": 20160810
    },
    {
      "title": "So nice, I had to buy a second one",
      "text": "Got 1 for my husband for christmas, .it works so well that I bought my son 1 also.",
      "rating": 5.0,
      "verified": true,
      "author": "Two Rivers Trading",
      "helpful_votes": 0,
      "publication_date": 20150311
    },
    {
      "title": "Poor product don't buy",
      "text": "This printer is simply horrible. After 3 weeks of trying to get it working, I still have not gotten it to work. All this effort for a system that requires proprietary filliment cartridges is not worth it.",
      "rating": 1.0,
      "verified": true,
      "author": "KEVIN",
      "helpful_votes": 0,
      "publication_date": 20150501
    },
    {
      "title": "Avoid this toy",
      "text": "The printer part is tolerable, but the scanner is pathetic. It can't scan simple objects. Total waste of money.",
      "rating": 2.0,
      "verified": true,
      "author": "Teri B.",
      "helpful_votes": 0,
      "publication_date": 20160530
    },
    {
      "title": "... printer for a few days but it is very easy to use and the software seems pretty solid",
      "text": "I have only had the printer for a few days but it is very easy to use and the software seems pretty solid. I have experimented with and without adding structural supports on a model I downloaded and it works great. I did have a few little loops on an overhang but I expected that and light sandpaper will fix that quickly. I have now downloaded a full 3D creation package and will try creating a model from scratch in the next few weeks to see how it works. The software is slightly limited and I would like to see the software open-sourced so I tinker with it and maybe add features.",
      "rating": 4.0,
      "verified": true,
      "author": "David B. Doucey",
      "helpful_votes": 3,
      "publication_date": 20141208
    },
    {
      "title": "... a broken left lid pivot although the packaging appeared perfect and well designed",
      "text": "Item arrived with a broken left lid pivot although the packaging appeared perfect and well designed. Could not perform a scan \"out of the box\" as the advertising led me to believe. One of the scan displays did not show anything. Also could not print one of the built in \"samples\" out of the box as it should have, it seemed to try to print above the platform. Great concept, but not a reality with the one I received. To be fair, their customer service replied rapidly but I had invested enough time already.",
      "rating": 1.0,
      "verified": true,
      "author": "Me",
      "helpful_votes": 0,
      "publication_date": 20150330
    },
    {
      "title": "the product does not work and warranty claims with the ...",
      "text": "the product does not work and warranty claims with the manufacturer is a huge problem .. dreadful purchase and service",
      "rating": 1.0,
      "verified": true,
      "author": "Edgar Santamaria",
      "helpful_votes": 0,
      "publication_date": 20150914
    },
    {
      "title": "Five Stars",
      "text": "I HAVE 3 DA VINCI PRINTERS AND THEY PRINT GOOD",
      "rating": 5.0,
      "verified": true,
      "author": "tim reetz",
      "helpful_votes": 0,
      "publication_date": 20160526
    },
    {
      "title": "It is good quality after I tested SCAN and Printed 3D model",
      "text": "The first time, when I turned-on my new 3D Printer. Then It has error show ISSUE 0031. I turned-off and turned-on again,it still show the same code. After that I opened ticket to support.xyzprinting.com And Then the Customer Care Team have provided Link of video to us. It works well, after I followed the instruction this video. It is good quality after I tested SCAN and Printed 3D model. I want to give 4 stars for Da Vinci 1.0 AiO. apichaij",
      "rating": 4.0,
      "verified": true,
      "author": "Apichai Jantarmas",
      "helpful_votes": 9,
      "publication_date": 20141206
    },
    {
      "title": "Possibly good for a small manufacturer",
      "text": "I tried it with provided samples, had some problem with filament wrapping around the outlet, so decided to return it It was also to bulky for home use. Possibly good for a small manufacturer",
      "rating": 2.0,
      "verified": true,
      "author": "ski",
      "helpful_votes": 2,
      "publication_date": 20141231
    },
    {
      "title": "Product is bad, do not buy at all!",
      "text": "Printer is crap... Low quality, software provided is useless and you can't use any 3-rd party software either. Not compatible with new version of OSX.. Waste of money do not buy !!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Alvaro Ojeda",
      "helpful_votes": 3,
      "publication_date": 20151010
    },
    {
      "title": "Xyz printer",
      "text": "Prints great. Have not used scanner enough to rate it",
      "rating": 5.0,
      "verified": true,
      "author": "Radopsred",
      "helpful_votes": 0,
      "publication_date": 20161017
    },
    {
      "title": "Two Stars",
      "text": "Too unreliable. Frequently clogging of the nozzle and software/firmware glitches",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160419
    },
    {
      "title": "Read reviews, had mixed thoughts but wanted to give ...",
      "text": "Read reviews, had mixed thoughts but wanted to give it a shot. Arrived DOA, 0033 Service Code. The end, never will buy their products again.",
      "rating": 1.0,
      "verified": true,
      "author": "Bob",
      "helpful_votes": 4,
      "publication_date": 20150318
    },
    {
      "title": "I wanted this printer to work, I read a ...",
      "text": "I wanted this printer to work, I read a lot about it prior to ordering. I was prepared for spotty documentation, but what I received was a defective unit that wouldn't work. I had 3 IT people here working on it for way too long. We could never get the machine to print anything. In the end, we sent it back. My review is this machine is not ready for prime time.",
      "rating": 1.0,
      "verified": true,
      "author": "Brad Hall",
      "helpful_votes": 4,
      "publication_date": 20150120
    },
    {
      "title": "One Star",
      "text": "Came to me damaged. It is quite large and heavy. I returned it with no hassles.",
      "rating": 1.0,
      "verified": true,
      "author": "ray camp",
      "helpful_votes": 2,
      "publication_date": 20150225
    },
    {
      "title": "This is a product that should not be on the market.",
      "text": "This is a product that should not be on the market, nothing seems to work.(scanner, printer, software).",
      "rating": 1.0,
      "verified": true,
      "author": "James  C",
      "helpful_votes": 7,
      "publication_date": 20141204
    },
    {
      "title": "Great Printer",
      "text": "Ive had this printer a couple years now and done a lot of printing. to me it was worth the money. There support team is fast to respond if any questions when you submit a ticket.",
      "rating": 5.0,
      "verified": true,
      "author": "jason bagley",
      "helpful_votes": 0,
      "publication_date": 20171010
    }
  ],
  "product_meta": {
    "title": "XYZprinting da Vinci 1.0 AiO All-in-One 3D Printer (Scan/Edit/Print)",
    "description": "The new da Vinci 1.0 AiO is the world’s No.1 all-in-one 3D printer thatallows users to scan and print 3D objects from one machine withoutprior experience or/and 3D modeling knowledge.",
    "rating": 3.3,
    "feature_bullets": [
      "No. 1 All-in-One 3D printer with a built-in scanner - Tom’s Guide Best of Computex 2014 Award Winner",
      "3D Printing has never been as EASY as 1-2-3 Scan-Edit-Print and Asymmetric 2-way Laser Scan Technology to promise the best scanning result",
      "Speedy Scan Algorithm (less than 5 min), largest 456 cubic inch build volume 7.8 x 7.8 x 7.5 inch",
      "Free XYZ 3D Resources: XYZmaker 3D Design Software, XYZ 3D Gallery, XYZprinting STEAM 3D Printing Education Curriculum, XYZware 3D Printing Software.",
      "UL listed “for the purpose of classification or evaluation with respect to one or more of the following: (1) specific risks only, e.g., casualty, fire or shock, (2) performance under specified conditions, (3) regulatory codes, (4) other standards, including international standards, or (5) such other conditions as UL may consider desirable."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "27 x 23.2 x 22 inches; 59.97 Pounds",
      "Item model number": "3S10AXUS00C",
      "Date First Available": "October 28, 2014",
      "Manufacturer": "XYZprinting",
      "ASIN": "B00OCG91IK",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}",
      "GTIN": "840710101037"
    },
    "categories": [
      "Industrial & Scientific",
      "3D Printers",
      "Additive Manufacturing Products"
    ],
    "price": ""
  }
}