{
  "website_summaries": [
    {
      "verdict": "This well-constructed, yet highly affordable bar cabinet offers great value for money.",
      "pros": [
        "Built from a highly durable hardwood and engineered wood composite",
        "We like how the removable wine rack gives you a range of configuration options",
        "Espresso finish is deep and warm"
      ],
      "cons": [
        "Some users report receiving warped materials and found it hard to assemble"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Did not live up to my expectations...",
      "text": "This wine cabinet is part of a 3-piece module. I ordered it a few months after purchasing the coordinating X-Panel Bordeaux wine cabinet. Not only was this one much more difficult to assemble (alone), it came with soooo many imperfections. Thankfully, many of them are hidden once the cabinet was assembled. One of the imperfections that is not hidden, is that the door is clearly a different color from the rest of the cabinet. This item is suppose to be “expresso” in color. Everything is expresso except the door.",
      "rating": 2.0,
      "verified": true,
      "author": "T. Thom",
      "helpful_votes": 0,
      "publication_date": 20200616
    },
    {
      "title": "Not what you hope it will be.",
      "text": "The back and drawer bottom are very thin material. Holes for the screws don't line up. There are threaded sockets for the assembly screws but some spin while installing the screws so it actually becomes impossible to assemble. One board cracked while installing screws. Finish is okay and the overall appearance is what we wanted but the quality is not what we hoped it would be. We are returning to Amazon for full credit after wasting over an hour trying to make it work. Lesson learned the hard way.",
      "rating": 1.0,
      "verified": true,
      "author": "Longtime Customer",
      "helpful_votes": 0,
      "publication_date": 20191207
    },
    {
      "title": "Great Purchase for the price!",
      "text": "I was both excited and weary about this product at first. I spent a lot of time reading the comments and was worried that the packaging wouldn't be enough to protect the cabinet. The packaging itself was fairly well done. It wasn't extraordinarily packed but it was protected well enough. As for the actual cabinet itself, it only had a couple of very minor chips, nothing a sharpie couldn't take care of. Otherwise it was a good shape and assembly was fairly easy too.",
      "rating": 5.0,
      "verified": true,
      "author": "Micah Peterson",
      "helpful_votes": 4,
      "publication_date": 20161207
    },
    {
      "title": "Wouldn't buy again",
      "text": "Directions suck. Half holes don't line up. Had to make new holes and use different hardware. Kinda nice when together but not worth money ornhastle",
      "rating": 1.0,
      "verified": true,
      "author": "shaun bailey",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "Serves its purpose...",
      "text": "The assembly was little confusing but after carefully following the direction I was able to assemble it. I like the design and the functionality it provides but it lacks sturdiness. Overall, I think it is worth the money.",
      "rating": 4.0,
      "verified": true,
      "author": "pet_kharab",
      "helpful_votes": 0,
      "publication_date": 20190506
    },
    {
      "title": "Glass not great.",
      "text": "Glass door cheaply assembled. Glass rattles when opening. Needs plastic gaskets or biscuits to keep glass in place",
      "rating": 3.0,
      "verified": true,
      "author": "Ali Harley",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "Great service, not all bad.",
      "text": "Worth the $115, as per other reviews all are true, it is heavy was delivered with the back plank broken as it is the thinest piece. And all parts mostly fit with some finagling. However most forget to mention the excellent customer service. They did send me replacement parts and i have a beautiful finished product. Very happy with this purchase!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Jonathan Mootz",
      "helpful_votes": 0,
      "publication_date": 20200122
    },
    {
      "title": "I love this wine cabinet a lot more in person",
      "text": "I love this wine cabinet a lot more in person. It has plenary of room to store my wine and glasses. The drawer is also nice for my bottle openers and fancy bottle stoppers and stem decorations so when I have friends over we can identify which glass is ours. Love the dark espresso color. My 2 gripes which is why I try only has four stars is that the drawer shuts hard, and the second is that I didn't realize the glasses were just meant to be on the shelf. I was under the impression that they hung- not too big of a deal, probably missed it in the specs.",
      "rating": 4.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 0,
      "publication_date": 20161211
    },
    {
      "title": "Not worth it",
      "text": "This is the first time I purchased something like this on Amazon and was completely disappointed. The product arrived chipped with pieces broken, there was a hole where there should have been a place to anchor a rod and the wood quality was horrible. Plus it was amazingly difficult to assemble. Would not recommend it.",
      "rating": 1.0,
      "verified": true,
      "author": "Michael Riemer",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "Very Nice!",
      "text": "Bought for my daughter for Christmas, she was happy with it!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190129
    },
    {
      "title": "Not fine furniture but relatively easy to assemble and attractive",
      "text": "Not fine furniture but relatively easy to assemble and attractive. The door seems a little flimsy but otherwise a good purchase",
      "rating": 4.0,
      "verified": true,
      "author": "srtakay",
      "helpful_votes": 0,
      "publication_date": 20171012
    },
    {
      "title": "Sharp-looking wine cabinet",
      "text": "Looks sharp and is very practical! Just be wary of the top part being scratch-prone if you have any animals that like to jump up there (ahem...cats).",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley C.",
      "helpful_votes": 0,
      "publication_date": 20170627
    },
    {
      "title": "Did not fit properly once put together",
      "text": "It didn't come together correctly when we put it together now we have to remove the door that won't close and have it open. Maybe I'll see if I can return.",
      "rating": 1.0,
      "verified": true,
      "author": "Jackie",
      "helpful_votes": 0,
      "publication_date": 20181119
    },
    {
      "title": "had to send 2 back due to damage both times ...",
      "text": "had to send 2 back due to damage both times. The second one i did not even sign for as the box was so damanged and you could see the cabinet thru the ripped box.",
      "rating": 2.0,
      "verified": true,
      "author": "KW",
      "helpful_votes": 0,
      "publication_date": 20160606
    },
    {
      "title": "Not what I expected",
      "text": "The top shelf is about a quarter inch too wide and the wood looks a bit on the cheap side, but it did come in and with a bit of elbow grease it can be fixed right up.",
      "rating": 2.0,
      "verified": true,
      "author": "Komo",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "came with quite a few broken pcs... ...",
      "text": "came with quite a few broken pcs ... i was able to fix ok .... buying furniture online has its drawbacks",
      "rating": 1.0,
      "verified": true,
      "author": "Dukenukum",
      "helpful_votes": 0,
      "publication_date": 20170204
    },
    {
      "title": "We love this cabinet",
      "text": "We love this cabinet. It is a great addition to our living room. It looks just like the picture and is very sturdy. We had no issues with putting it together.",
      "rating": 5.0,
      "verified": true,
      "author": "W Culverhouse",
      "helpful_votes": 0,
      "publication_date": 20171101
    },
    {
      "title": "I really like the product",
      "text": "I really like the product, had to reorder some parts they didn't fit the cabinet type I ordered. I receive the correct parts 3 weeks later and everything work fine.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170612
    },
    {
      "title": "Absolutely beautiful! Was easy to put together",
      "text": "Absolutely beautiful! Was easy to put together, holds a ton of wine and all of my holiday wine glasses - love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Cathy",
      "helpful_votes": 0,
      "publication_date": 20160512
    },
    {
      "title": "Four Stars",
      "text": "Looks great! The packaging wasn't the best but looks nice. Much bigger than I thought it would be",
      "rating": 4.0,
      "verified": true,
      "author": "taylor",
      "helpful_votes": 0,
      "publication_date": 20170913
    },
    {
      "title": "Perfect!",
      "text": "It doesn't take long to assemble. It's the perfect wine cabinet for my collection. The drawer is perfect for storing bottle openers. People cannot believe I ordered this on Amazon.",
      "rating": 5.0,
      "verified": true,
      "author": "Grayson M",
      "helpful_votes": 0,
      "publication_date": 20160818
    },
    {
      "title": "Poor Quality/ Scratches From Factory",
      "text": "The quality of this is terrible. The packaging was decent, but the parts were scratched right out of the package, so it was obvious it was packaged and sent from the manufacturer this way. I wasn’t expecting a high end piece, obviously at this price point, but I was definitely expecting the parts to come unscratched.",
      "rating": 2.0,
      "verified": true,
      "author": "DoniG",
      "helpful_votes": 0,
      "publication_date": 20201029
    },
    {
      "title": "Super disappointing!",
      "text": "I bought this set from Wayfair less than a year ago and LOVED it, so I bought it again, different manufacture, on Amazon and I'm super disappointed. The stain doesn't match between the 3 units, the stain is thin in several places and there's wood grain on 2 units, although they don't match, and no wood grain on the third unit. Sending it back after spending a couple of hours putting it together. The pictures show how mismatched the stain is, especially in the sun.",
      "rating": 1.0,
      "verified": true,
      "author": "Beth H.",
      "helpful_votes": 0,
      "publication_date": 20201112
    },
    {
      "title": "Nice design. Looks great",
      "text": "Well packaged,the glass was well protected. Clear instructions.It took me 1 hr. Nice design. Looks great!. Awesome buy ,totally worth the money.",
      "rating": 5.0,
      "verified": false,
      "author": "Harsha",
      "helpful_votes": 0,
      "publication_date": 20170707
    },
    {
      "title": "Nice cabinet for the price",
      "text": "We added wine glass holders and color changing lights to ours. It's a good buy but the instructions could be better and spelled out in English rather than just pictures to follow. We had a hard time figuring out how to put the door hinges on. Worth it in the end.",
      "rating": 4.0,
      "verified": false,
      "author": "Boss Man \"J.T.\"",
      "helpful_votes": 0,
      "publication_date": 20171113
    },
    {
      "title": "Scratches on wood",
      "text": "Bought for a gift. Large scratches. Luckily on the back, but seriously?",
      "rating": 3.0,
      "verified": false,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161226
    }
  ],
  "product_meta": {
    "title": "Winsome Wood 25-Bottle Slot Modular Bordeaux Wine Cabinet",
    "description": "Bordeaux Modular Wine Cabinet 25-Bottle Slot is a great addition to your home. The simple design has straight lines and a dark finish. Perfect storage piece for the wine enthusiast. The cabinet provides spacious single drawer for your accessories, storage shelf and 25 slots for your wine bottles. Create a wine storage system with additional units and sit side by side. Opens glass door to an open shelf for your glasses or sprits. 25 Individual slots for your wine bottles. Clear Glass Door with dark wood frame. Overall assembled size is 22\"W x 16\"D x 40\"H. Cabinet is made with combination of solid and composite wood in espresso finish. Assembly Required.",
    "rating": 3.7,
    "feature_bullets": [
      "Can hold up to 25 wine bottles",
      "Has a beautiful glass door to showcase your wine bottle collection",
      "Includes a drawer for extra storage",
      "Cabinet is made with combination of solid and composite wood in espresso finish",
      "Assembly Required"
    ],
    "specifications": {
      "Item Weight": "54 pounds",
      "Product Dimensions": "22 x 40 x 16 inches",
      "Item model number": "92455",
      "Is Discontinued By Manufacturer": "No",
      "Assembled Height": "40 inches",
      "Assembled Width": "16 inches",
      "Assembled Length": "22 inches",
      "Weight": "80 Pounds",
      "ASIN": "B00OCCE8MS",
      "Customer Reviews": "3.7 out of 5 stars52 ratings3.7 out of 5 stars",
      "Best Sellers Rank": "#734,498 in Home & Kitchen",
      "Date First Available": "October 9, 2014"
    },
    "categories": [
      "Bars & Wine Cabinets",
      "Home Bar Furniture",
      "Furniture",
      "Home & Kitchen",
      "Game & Recreation Room Furniture",
      "Wine Cabinets"
    ],
    "price": 143.38
  }
}