{
  "website_summaries": [
    {
      "verdict": "Best option for college students or others who are on tight budgets and little space.",
      "pros": [
        "Upright that turns into a handheld",
        "Also includes crevice tools and mini brush",
        "Many reviewers were shocked by the suction power, especially  at this price point",
        "Doesn't tip over"
      ],
      "cons": [
        "Doesn't work great on carpets or rugs, especially thick ones"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Powerful little guy",
      "text": "I can't believe how good the suction is on this little vacuum. I was expecting much less, but am so happy I bought this. It is very lightweight, great for buyers who have any physical handicaps. It is easy to store and empty. Would recommend this and plan on buying one for several family members. *Update-be sure to remove the filter liner that has the blue velcro tab on it. Underneathe it you will find more dust to empty out. If you don't do this, you will lose suction on your vacuum and it will not pick up as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen",
      "helpful_votes": 165,
      "publication_date": 20170725
    },
    {
      "title": "Don't buy, overheats instantly.",
      "text": "I saw so many positive reviews so didn't hesitate buying this product. If only I had read the one negative review... Vacuum overheats after 3 minutes making it useless. Return to sender!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 81,
      "publication_date": 20161106
    },
    {
      "title": "Don't bother",
      "text": "This is practically worthless. I spilled some laundry detergent on the kitchen floor, and it didn't pick it up. Ditto with small paper and plastic bits. What is it good for? I bought this:  and, believe it or not, it works much better, does not uses electricity or batteries, and is half the price! Laundry detergent came up with two passes!",
      "rating": 1.0,
      "verified": true,
      "author": "Heldensop",
      "helpful_votes": 21,
      "publication_date": 20180608
    },
    {
      "title": "Does NOT pick up pet hair",
      "text": "One would think that since it is not battery powered, it would have more suction, but I can guarantee it doesn't. It barely picks up sand - pebbles and pet hair are just moved around the carpet into clumps. Sometimes you really need to pay attention to the negative reviews, because in this case they are right!",
      "rating": 1.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 10,
      "publication_date": 20180819
    },
    {
      "title": "Miserable on rugs and carpets",
      "text": "This vacuum cleaner picked absolutely nothing up when used on our rugs and carpets. Worked decently on tile floors. If you have any rugs or carpets, this is not for you. I would recommend it only for someone with a tiny apartment that has tile floors.",
      "rating": 1.0,
      "verified": true,
      "author": "Susan F",
      "helpful_votes": 26,
      "publication_date": 20170330
    },
    {
      "title": "calling this vacuum junk is an insult to junk!",
      "text": "First chance and the handle to wrap cable broke. Is ok work of vacuum. Now after the 5 months after purchasing this Vacuum I can confirm, calling this vacuum junk is an insult to junk! Seriously! Everything is falling apart in this thing. I am in a very small space at this moment as they are building our home. And this is use not much, maybe once a week, very light and already had the handle crack and broke, the rest of the handle came off and the suction is horrible. At the end save your money and head ache, and purchase something else.",
      "rating": 1.0,
      "verified": true,
      "author": "ana",
      "helpful_votes": 4,
      "publication_date": 20181124
    },
    {
      "title": "and she is so happy with it",
      "text": "I bought this for my 80 year old Mother, and she is so happy with it. It is light enough for her to easily use it when I'm not there to help her. I bought extra filters, but so far the original is holding up well. Mom is thrilled! She would be horrified if she knew I put her picture on here, but I'll risk Mom's wrath lol.",
      "rating": 5.0,
      "verified": true,
      "author": "EmilySunshine",
      "helpful_votes": 17,
      "publication_date": 20170311
    },
    {
      "title": "Strong motor SUPER WEAK body",
      "text": "The weakest body/build ever. The motor is Strong and powerful. But it's built in a way that not only falls forward but also cracks SUPER easily. The first one lasted a bit longer, the other 3 ones, just 6 months. Yes, I said 3 ones. The third one I actually got it free from the company. But what's the point if it's gonna last only 6 months. I'm gonna stick with the dirt devil since I don't want to spend hundreds on a really good one.",
      "rating": 2.0,
      "verified": true,
      "author": "KF",
      "helpful_votes": 0,
      "publication_date": 20191130
    },
    {
      "title": "toddler / pre-k fun",
      "text": "If you're looking for an actual vacuum cleaner, then keep on searching! This product didn't include dimensions on the description when I bought it. The size is appropriate for a toddler to preschooler. It's like a dustbuster on a stick, but lightweight. Suction power is minimal. It might pick up short hair, but long hair eludes it. I gave it to a young child who likes imitating mommy. She has fun with it.",
      "rating": 1.0,
      "verified": true,
      "author": "potential customer",
      "helpful_votes": 0,
      "publication_date": 20191206
    },
    {
      "title": "A ABSOLUTE MUST HAVE",
      "text": "This product is amazing! I have majority hardwood floors so I was looking for something easy to handle. I had low expectations at first. But OMG this thing is the most powerful vacuum I’ve ever owned. I’ve had it for 4 months I use it multiple times a day (I have a very large golden retriever that sheds all the time) it still works like it did fresh out the box. I think what impresses me the most is it picks up everything even glitter. It doesn’t spray it around like other vacuums. I love this vacuum! It also works like a dream over carpet. It even picks up wet food from my toddler trying to feed herself!",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa Williams",
      "helpful_votes": 0,
      "publication_date": 20181219
    },
    {
      "title": "Initially loved this vacuum",
      "text": "Initially loved this vacuum. Unfortunately the latch that holds the cannister on broke, which upset me quite a bit since it was brand new. It was user-error, though, my daughter was trying to get it open to dump out and couldnt figure out the button (it isnt difficult, she is just a child though). The suction is SO STRONG though that it actually holds the cannister on without it being latched! So as long as I'm careful I can still use it. I will probably buy again once this one is worn out. I would only recommend that purchasers be careful with the latch, it is a very small piece of plastic and was broken pretty easily.",
      "rating": 4.0,
      "verified": true,
      "author": "Danielle",
      "helpful_votes": 4,
      "publication_date": 20161020
    },
    {
      "title": "Dustbuster On Wheels!",
      "text": "NOT FOR CARPET LIGHTWEIGHT & SHORT (good for people around 5’2 without bending over, but taller people can use) NOT great for vacuuming large spills (like dog food) GREAT to vacuum: around a toilet, hardwood/tile floors and stairs, and floor rugs/mats. GREAT brush attachment for the stove. GREAT sucking up pine needles and pet hair. This little machine only sucks, there are no rollers. IF you are buying this as a carpet vacuum - DON’T. IF it scratches your hardwood, you dragged something else on the wheel. I’ve had a few months now and no problems. If it breaks tomorrow, I still would think it was a good bang for my buck. Enjoy!",
      "rating": 5.0,
      "verified": true,
      "author": "Sara",
      "helpful_votes": 0,
      "publication_date": 20190119
    },
    {
      "title": "Suddenly stopped working after about 10 uses",
      "text": "Really Disappointed in this product :-{ While it worked, it worked really well. However, I used it less than 10 times and it just up and quit. Wish I could send it back, but the window of opportunity for return is long gone. I suppose I will try to follow up with the manufacturer. With that said, it is light weight, good suction power, but the collection cup is small and I did have to empty it frequently as I use it mainly to pick up hair, both my long and my pets in my bathroom and bedroom area. will be looking for a new stick vac as my long hair really makes using a brush roller vacuum pointless.",
      "rating": 2.0,
      "verified": true,
      "author": "Saturna",
      "helpful_votes": 0,
      "publication_date": 20190627
    },
    {
      "title": "For the price it’s a good value and works well.",
      "text": "I have polished cement floors in our townhouse and I ordered this for my kitchen floors. It works great for a quick clean up. I have also used it to clean my car and was pleasantly surprised how well it did. I have also did quick cleans on our area rugs, it does fine, obviously it’s not a deep clean for carpeted rooms or large area rugs but is a great quick clean up and easy to use. Arrived fast, fairly easy to put together. Easy to dump dirt collection container. Does pretty good on the sofa too for pet hair. Overall happy with purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "MommaMia13",
      "helpful_votes": 0,
      "publication_date": 20191008
    },
    {
      "title": "Garbage!",
      "text": "I never leave detailed reviews but I am Very disappointed. Bin fills up very quickly (it is very small). On first use it didn't spit anything back onto wood floors. Had to pass like 20 times on the same spot to clean up crumbs on a small area rug (that is cleaned daily). Went to vacuum my kitchen floor within 5 minutes it was overheated and now won't turn back on. I bought for all of the attachments. The crevice tool popped of as soon as i touched the floor with it... Not worth time time and especially not worth the headache or money.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191026
    },
    {
      "title": "Works better than I would expect for the size and price.",
      "text": "I was amazed by the suction power. I vacuum everyday when our shepherd mix was alive. He passed away 3 months ago. I tested this vacuum by using my regular vacuum and followed up with this one. It pulled dog hair up that should have already been gone. I’m not going to lie, it made me sad to see his hair again. 😢. It actually will lift the carpet up just a little if you pull it back just right. My husband is not happy that I used it in the house as we bought it for our camper. 😉",
      "rating": 5.0,
      "verified": true,
      "author": "BigMark007",
      "helpful_votes": 0,
      "publication_date": 20191221
    },
    {
      "title": "I'd give it 6 stars if I could!",
      "text": "I LOVE THIS VACUUM!! I have 3 indoor dogs (German Shepherd, Siberian Husky, and Lab), fur tumbleweeds are common in the house. This vacuum picks EVERYTHING up without a problem, and I don't have to stop every 20 seconds to empty the canister. This is my second vacuum from this company and I will never own anything else. I have hardwood, tile, and linoleum floors, it cleans corners, cracks, under furniture without a problem. And the attachments are outstanding for couches and cars alike. I can't say enough good things about this.",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda W.",
      "helpful_votes": 0,
      "publication_date": 20180702
    },
    {
      "title": "Great light weight vacuum",
      "text": "Von Haus 2 in 1 Corded Lightweight Stick Vacuum Cleaners and Handheld Vacuum Bagless with HEPA Filtration are great light-weight vacuums. They easily convert into smaller handhelds. My spouse and I own our own home and I am delighted we perform the maintenance on our very own furnace. We both use our Von Haus stick vac to vacuum the inside of our furnace, each taking turns (one of us holds a flashlight to better see where any dust is located while the other vacuums,) to make the task easier. We are able to get into the tight areas around the wires with the stick vac in its smaller position with the small brush and hose attachment.",
      "rating": 4.0,
      "verified": true,
      "author": "Julie Sands",
      "helpful_votes": 0,
      "publication_date": 20181022
    },
    {
      "title": "Makes Vacuuming Fun!",
      "text": "The VonHaus 600W 2-in-1 Upright Stick vacuum is the best domestic appliance in my home!! After always having hand-me-down vacuums that were heavy and clunky and didn't work very well, this lightweight, compact and powerful vacuum makes cleaning enjoyable and easy. The attachments work great to do detailed cleaning. It also works very well on my jute and woven rugs. I love the option to turn it into a handheld vacuum for quick clean ups. It's only slightly larger than a broom and can be tucked away anywhere for storage. I highly recommend this vacuum!",
      "rating": 5.0,
      "verified": true,
      "author": "Lauren",
      "helpful_votes": 466,
      "publication_date": 20150124
    },
    {
      "title": "At first it was vacuuming fine but then a few weeks later it just stopped ...",
      "text": "Piece of junk. First of all, the handle is constantly slipping off. The metal part of the stem would fall out of the handle and scratch my leg. At first it was vacuuming fine but then a few weeks later it just stopped vacuuming all together. I tried everything I could but it was no good. I ended up throwing it in the trash bin.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20171212
    },
    {
      "title": "Poorly construsted",
      "text": "I really liked this product at first. It was exactly what I needed. I meant to order a cordless vacuum so I was disappointed at first. But ordering the wrong thing was my fault, so Obviously I can't hold this against the product. Like I said, I was happy with the product at first BUT over time the bottom part started coming off the canister while I was vacuuming. It would happen every time and I NEVER switched out the attachments out. I've only had the product for 5 months. I eventually got so pissed off at it, in the middle of vacuuming, that I LITERALLY threw it in my garage in hopes to break it more.",
      "rating": 2.0,
      "verified": true,
      "author": "TBrown",
      "helpful_votes": 0,
      "publication_date": 20171016
    },
    {
      "title": "Works as good as a full size vacuum for less money!",
      "text": "This little vacuum is perfect for our home. I was contemplating purchasing a larger vacuum due to the simple fact that the larger ones are more effective. However, since this vacuum was so affordable I thought why not give it a try. It is easy to assemble, very light, and powerful! It seems to work just as good as past vaccumes I’ve owned that were much larger. We don’t have carpeted floors, but we do have numerous large area rugs, hardwood and tile floors and this vacuum works amazing on all.",
      "rating": 5.0,
      "verified": true,
      "author": "Banana 907",
      "helpful_votes": 0,
      "publication_date": 20180610
    },
    {
      "title": "Less than 2 Years of Life",
      "text": "I have 3 area rugs, so it's not as if this thing was worked to death, yet today it broke, after purchasing it March 2017 from Amazon. After about a year, the connection where you'd put the head attachments loosened up so the heads would constantly fall out. Today, after sliding from leaning against the wall, down to the floor, the part that houses the extendable handle broke. It's now going in the trash. Extremely disappointing, because if it had been made of better materials it could've been a wonderful little vac for years to come.",
      "rating": 3.0,
      "verified": true,
      "author": "Sue",
      "helpful_votes": 0,
      "publication_date": 20190202
    },
    {
      "title": "Perfect small vacuum with lots of power",
      "text": "Wow. Dont underestimate the power of this little vacuum. I needed a vacuum for my home office only that has berber type carpet. I wanted something without a brush roller on the bottom to not damage my carpet. I also needed something small and compact that I could keep in my home office since this is where I work daily and would be using often. This was perfect for my situation. It has a fantastic vacuum, more powerful that what I was expecting. It is lightweight so great for regular use. It is small so can be tucked away in a small closet. I am very pleased with my order.",
      "rating": 5.0,
      "verified": true,
      "author": "ALC",
      "helpful_votes": 0,
      "publication_date": 20170910
    },
    {
      "title": "This stuff is amazing!",
      "text": "I have never owned a vac with this kind of power and it's so light that I can move it anywhere. I'm in a wheelchair and trying to use a vac was almost impossible for me but it had to be done and with this little thing I can just zip all over the place with it in my chair. I started not to buy it because of the price, you know you get what you pay for.........not so in this case I got WAY more than I payed for! YEP YEP!",
      "rating": 5.0,
      "verified": true,
      "author": "carol vaneaton",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Pay for what you get",
      "text": "At first I enjoyed this vacuum but after a couple uses I was not a fan. The vacuum does not suck everything in after 1 or 2 strokes and that’s fine given the price. Durability is an issue the plastic tip of my broke off after the vacuum had fallen over",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20200609
    },
    {
      "title": "Great vac",
      "text": "This is a great little vacuum! I have hardwood floors and it picks up everything, which is awesome since I have 2 young kids and a dog! I love the suction power and the price of it was great! The only thing is that it's pretty short, so not sure how taller people would like it....but I'm 5 foot nothing so it works well for me! lol",
      "rating": 5.0,
      "verified": true,
      "author": "Diana Brown",
      "helpful_votes": 0,
      "publication_date": 20200902
    },
    {
      "title": "Love this Little Vacuum",
      "text": "I have bought 4 of these - 2 for children in college and 2 for the store where I work - after using it with one of my home health clients who had allergies and lived in an assisted living home. I love the suction, the ease of cleaning it, the fact that it has a hepa filter and the cost. I will be getting two more soon. One for myself and another for my daughter going to college.",
      "rating": 5.0,
      "verified": true,
      "author": "Wills A.",
      "helpful_votes": 0,
      "publication_date": 20200929
    },
    {
      "title": "Pros and Cons",
      "text": "Okay so there are pros and cons to this vacuum PROS: Super lightweight, small enough to fit everywhere (under counters, behind everything), lots of suctions, amazing on tile and hardwood, long cord, comes apart easily to use other functions, bagless CONS: No brush/suction combination for the carpets (this is a BRUSHLESS vacuum) so I'm not sure how clean my area rugs are actually getting, no brushes make sucking up strings and things difficult, no apparatus on the vacuum to hold the attachments (stored separately on a shelf) this is particularly annoying",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170714
    },
    {
      "title": "Very good",
      "text": "Very good. It gets most things up. Doesn't beat the carpet in a way that leaves those neat looking vacuum cleaner marks that make your living room look like you want to dance around in it. I would've liked that.. doesn't get those short pieces of random yarn and lint tread on top of the carpet. Looks like it gets a lot up, though, no doubt, it's strong. Like I said I really wanted those clean looking vacuum marks that make me feel like it truly did its job. Kind of cool, though, I can feel comfortable letting my 6year old son vacuum sometimes, just shorten the stick. Very nice child labor. Very exciting for him.",
      "rating": 4.0,
      "verified": true,
      "author": "Brianna",
      "helpful_votes": 3,
      "publication_date": 20161229
    },
    {
      "title": "Excellent for pet hair!!!",
      "text": "This is one of the few exceptions to the too good to be true saying. I have a golden retriever who sheds badly. This little thing picks up hair with no problem !!! Over and over!!!. I cant believe how cheap it is compared to other ones I've tried and those expensive ones always break on me. You won't regret this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Addie",
      "helpful_votes": 0,
      "publication_date": 20200626
    },
    {
      "title": "Top handle DOESN’T fit right, comes off in use, vacuum falls to floor",
      "text": "After my first VanHaus stick vacuum went out after several years, I decided to buy another of that exact one because I was so happy with the quality of the first one. Well, although the new one looked identical to my first one, I soon noticed that some of the parts were made differently. The biggest problem was the gray handle at the top of it didn’t fit properly. As I used it, pushing it back and forth, the handle would fly off, leaving the vacuum crashing to the floor. It was so frustrating. It only took me a couple times of using it before I boxed it up and sent it back in for a refund.",
      "rating": 3.0,
      "verified": true,
      "author": "Ashley",
      "helpful_votes": 0,
      "publication_date": 20200925
    },
    {
      "title": "The vacuum worked great for the first month",
      "text": "The vacuum worked great for the first month. It just tipped over and a piece snapped off and the part the connects the bagness container to the stick handle - leaving it useless. Super disappointed and frustrated as we are selling our house and i need to vacuum a few times a week. I was hoping for a better quality and something that can withstand one tip over.",
      "rating": 1.0,
      "verified": true,
      "author": "Cheryl Wolf",
      "helpful_votes": 2,
      "publication_date": 20180207
    },
    {
      "title": "I bought this because of the great reviews, small design",
      "text": "I bought this because of the great reviews, small design, and low price. It works great on wood floors. I have a dog that sheds like crazy!!! I have to vacuum pretty much every 2 to 3 days. I am not impressed with this vacuum on my rugs. I have very short haired rugs. This vacuum does not pick up as well on carpet. We had carried our Christmas tree up stairs which left pine needles everywhere!. This vacuum picked everything up fine on the wood floor, but not on our carpeted steps, I had to remover the attachment on the bottom and vacuum with the hose. Which is just inconvenient, takes forever, and hurts my back.",
      "rating": 3.0,
      "verified": true,
      "author": "NCleidomastoid",
      "helpful_votes": 0,
      "publication_date": 20161218
    },
    {
      "title": "Sent it back - not good for our purposes.",
      "text": "This will work very well for some. It DOES have great suction. It's the only thing that will get the dirt out of the crevices of my welcome mat. However, it does not work well on carpet. I used it to vacuum my daughter's room, then went over it with a different bagless vac and picked up tons of dust. I returned it, though, because the one we received had a high-pitched, loud motor. I couldn't stand it - but I'm sensitive to sound. Also, our man vac is a Miele which is very quiet. Perhaps I'm spoiled. But my hoover cordless doesn't make such a squeal.",
      "rating": 2.0,
      "verified": true,
      "author": "Okie Jokie",
      "helpful_votes": 0,
      "publication_date": 20170211
    },
    {
      "title": "Edited review: vacuum seems to be malfunctioning.",
      "text": "EDIT: Today I tried to use the vacuum for only the 4th time. As I said before, I don’t use it often because I have a baby and it’s ridiculously loud. As soon as I turned it on, the vacuum was making ear-piercing squealing sounds and it smelled like something was burning. My “return period” was over at the end of February, so I guess I’m stuck with a $40 piece of junk? Original review: Vacuum picks up well on hardwood, and alright on a flat rug. My biggest beef is that it is SO LOUD, so I can't use it often with a 6-month old. Otherwise it's okay.",
      "rating": 2.0,
      "verified": true,
      "author": "AshleyReviews",
      "helpful_votes": 0,
      "publication_date": 20180305
    },
    {
      "title": "Great space saver Does it's Job",
      "text": "OMG this is the cutest little still vac I have the orange color its definitely light weight seems fragile it didn't pull much from my shag area rug the 1st few times I had to go over it more than I felt necessary but when used on a flatter surfaced area rug it did it's thing I was surprised at the amount dirt it did suction out I went over my bare floor to see how it would work it did work fine but I personally have no intention on using it on my hardwood floor's It came on time.... well package... assembled it easily Great space saver!",
      "rating": 4.0,
      "verified": true,
      "author": "BeYOUtiful",
      "helpful_votes": 0,
      "publication_date": 20180328
    },
    {
      "title": "An affordable (cheap) vacuum that works good on stairs.",
      "text": "Purchased to use on carpeted stairs because I was tired of lugging around our full size upright. Assembly took less than 5 minutes, worked great on cleaning stairs and landing. Used it on hardwood once but it couldn't pick up kibbles left scattered by our cat unless you placed it directly over the kibble and waited to hear it get sucked up. Small enough to fit in a cupboard or hang on a hook in a closet. This will never replace a full size vacuum for a house or large apartment but it's a good addition for a portable option.",
      "rating": 5.0,
      "verified": true,
      "author": "LISA",
      "helpful_votes": 0,
      "publication_date": 20190312
    },
    {
      "title": "This is the ugliest orange",
      "text": "This is more burnt orange, and it is ugly color, but if you want to spend $10 more dollars for the same thing , go for it, I never have and cleaning products on display, so I will deal with it, it works, has great suction, and light weight , 4 stars because it is the ugliest color I have ever seen",
      "rating": 4.0,
      "verified": true,
      "author": "Armymom",
      "helpful_votes": 0,
      "publication_date": 20200716
    },
    {
      "title": "Surprisingly impressed",
      "text": "I was unsure how this would compare to a previous purchase of mine, the Eureka stick vac. I'm very surprised how strong this is. Works perfect for hardwood floors and getting the dirt up before cleaning. The Eureka vac had a spinning brush which I was happy to say goodbye to since we have new hardwoods and also multiple women with long hair...ladies you know what I'm talking about. The hairy brushroll is never fun. This is HEPA too and the Eureka wasn't so it is quite the bargain. Works great on high pile carpet also and makes those nice lines to show everyone you were actually paying attention. 5 stars for sure!",
      "rating": 5.0,
      "verified": true,
      "author": "thekingdom",
      "helpful_votes": 0,
      "publication_date": 20170730
    },
    {
      "title": "Disappointed...poorly made.",
      "text": "Arrived today. For 5 minutes worked great. Lots of suction, easy to assemble. After 5 minutes, I ended up with the handle in my hand, and when I tried to insert, it just wouldn't click back in. I noticed a little metal part inside that looked like it was missing a piece. No idea what fell off, broke off...I'm so disappointed! I'm going have to return this and get a bigger vacuum though I only had 2 rugs to vacuum and the rest is wood. I only gave 3 stars because it has great suction for such a small machine, but it's no use to me as a handheld vacuum.",
      "rating": 3.0,
      "verified": true,
      "author": "Bebe",
      "helpful_votes": 0,
      "publication_date": 20180312
    },
    {
      "title": "This thing is hilarious.",
      "text": "So, for a tiny vacuum, this thing actually packs power for what it is. Some weird/dumb cosmetic things might just pop off or break. It's not a big deal when my job is to get things cleaned up. You should really try the shoulder strap for laughs. My husband is 6'3 and it looked like he was using baby's first vacuum. \"What is this!? A school for ants!?!?\" Aaaaannnyyywaaayyy.. on a more serious note.. I use to work in cleanrooms and the hepa filters and replacements sold me. We didn't need anything crazy, just a quick pick me up. We already own too many things to battle this house with 7 cats.",
      "rating": 4.0,
      "verified": true,
      "author": "Andrea West",
      "helpful_votes": 0,
      "publication_date": 20190121
    },
    {
      "title": "No good on carpet",
      "text": "Been meaning to write a review for a while. Got this because I only have carpet in one room so didn’t want to spend a lot of money. It’s much smaller and lighter than I expected and is only good for hard floors. If I vacuume the carpet it takes 20 passes on the same spot to do any good and I usually still have to bend down to pick up anything that has any sticking/grabbing power (hair or fabric strings for example). It has held up for nearly a year but I hardly use it. I have very basic carpet.",
      "rating": 2.0,
      "verified": true,
      "author": "Tami Taylor",
      "helpful_votes": 0,
      "publication_date": 20180807
    },
    {
      "title": "excellent power. 600 watts",
      "text": "Wow, small unit, excellent power. 600 watts, translates to about 5 amp motor. Just under 1 horsepower. Which is 750 watts. Suction is concentrated with the small tools for quick dusting daily maintenance. Easy to assemble, quick to clean the canister. I had a dirt devil which proved to be a peice of junk. This stick vacuum, well worth every penny. Floor attachment gets into tighter places. I purchased this vacuum as daily maintainer and for stairs. Very balanced, also, a shop vac extension happens to fit it. I have one raised hallway ceiling 12 feet high, I need to make an extension to reach from a landing. Cobb Web haven.",
      "rating": 5.0,
      "verified": true,
      "author": "YES TRUMP!!!",
      "helpful_votes": 0,
      "publication_date": 20160727
    },
    {
      "title": "Good for my needs",
      "text": "This little vaccume is powerful. I picks up everything I need it to including kitty fur. I also like the size because I can fit it safely around and under my furniture and area rugs. I bought the roller brush attachment for the carpet and have the other attachments for my area rugs. It's so much easier to use than a heavy bigger vaccume. I am going to invest in a carpet cleaner to use twice a year and use this everyday. I always have bad luck with expensive large vaccumes. They always break!",
      "rating": 5.0,
      "verified": true,
      "author": "K.Peterson",
      "helpful_votes": 0,
      "publication_date": 20170906
    },
    {
      "title": "Wow! Great little vac!!",
      "text": "Wow! Great little vac! Compact, lightweight, effective, easy to use, easy to store, versatile, great suction. Worked amazingly well on our oriental rug as well. It's a great vac for small spaces (we have a studio apartment) or quick clean-ups. The dust bin is easy to clean; just rinse the filter under running water and it's as good as new! One bit of info regarding the filter...a micro filter is attached by Velcro around the filter. Remove that and rinse separately from the \"waffle\" filter. The directions weren't clear.",
      "rating": 5.0,
      "verified": true,
      "author": "Pepper Hill",
      "helpful_votes": 0,
      "publication_date": 20180408
    },
    {
      "title": "Very impressive!",
      "text": "I've only had it for a day and used it once but I'm very impressed. This thing is loud but that's because it has power! I'm using on tile and wood floors and mainly for dog hair but so far it's doing better than my $400 Dyson. It's pulling dog hair in from a solid 8-10 inches away! It's not going to work on carpet due to the fact there's no brush but that just means I don't have to cut my wife's hair out of it anymore. The brush attachment is perfect for getting the dog hair out of my rugs so aside from the carpeted bedrooms this thing conquers all!",
      "rating": 5.0,
      "verified": true,
      "author": "Prime1",
      "helpful_votes": 0,
      "publication_date": 20170114
    },
    {
      "title": "It is perfect for quick pick ups between using my big vacuum",
      "text": "Wow! For a small vacuum this is so powerful. It is perfect for quick pick ups between using my big vacuum. I have a cat and it is amazing the amount of cat hair it picks up off of hard surfaces as well as carpet. On hard surfaces you can actually see the dust being attracted from across the floor it has so much suction power. Great on stairs and the crevice tool really gets all the dust from edge of the carpet. It is also very easy to empty and clean the filter. I can't believe such a small inexpensive tool is such a great item. Well worth the money and then some.",
      "rating": 5.0,
      "verified": true,
      "author": "GoldRushGal",
      "helpful_votes": 0,
      "publication_date": 20161216
    },
    {
      "title": "Get this vacuum, it works great on hard surfaces",
      "text": "This is the best stick vacuum that I have ever owned. Actually it is the best vacuum I have ever owned. The suction is amazing and it picks up so much. It has not damaged my floors as others claim in their reviews (in the one review they say they have bamboo flooring and the vacuum ruined their floor, scratching it up. As a person who is a sales associate working in a flooring store, bamboo is a horrible choice for flooring!! It's a softer wood and soaks up any and all moisture and spills) anyway I would recommend to anyone wanting something for bare floors, but hey it also works great on carpet to if needed.",
      "rating": 5.0,
      "verified": true,
      "author": "DarciJoy84",
      "helpful_votes": 0,
      "publication_date": 20161223
    },
    {
      "title": "More Pros than Cons",
      "text": "I gave this sweeper a 5=star rating because cause for me it has more pros than cons. Pro: telescopic handle (I have a bad back and most sweeper brooms don't come up high enough so I don't have an awkward bend in my back; good suction; easy to empty filter; lots of easy to use attachments and nice corner ones; turns into a hand held unit very easily; no brush to scar hardwood floors); stores nicely in a small space Con: Will turn off for 30 minutes if you don't empty the filter when full; no whirlly brush (would work on throw rugs better)",
      "rating": 5.0,
      "verified": true,
      "author": "D. BrownTop Contributor: Gardening",
      "helpful_votes": 0,
      "publication_date": 20161231
    },
    {
      "title": "Great product!",
      "text": "This stick vacuum was just what I needed! I have a short haired dog and needed something for weekly cleaning. This vacuum is powerful and picks up the smallest bits of dust, hair, and debris from the couch, the fooor, the carpet.. you name it! I love the hose brush attachment so I can really get every corner of my couch. The only con I can think of is that I gets very hot but does not overheat. It's great for small apartments I would not recommend it for anything bigger than a 2 bedroom. This thing is tiny and lightweight, but packs some serious power!",
      "rating": 5.0,
      "verified": true,
      "author": "Timothy Tong",
      "helpful_votes": 0,
      "publication_date": 20170907
    },
    {
      "title": "Best suction EVER on a small vacuum!",
      "text": "This is one of the smallest, lightest weight vacs I have ever had....but also one of the most powerful in suction. It is so easy to maneuver around corners and even sucks up things along the edges and out of crevices that my bigger vacuum never got! It's so easy to clean and also very easy to disconnect to use as a handheld vac for the stairs. I mainly use it on ceramic tile, flat floor rugs and laminate, and it is a gem. I HIGHLY recommend this vacuum!!! Believe it or not, I even look forward to vacuuming now because I know it is not going to leave all kinds of debris behind when I'm done!",
      "rating": 5.0,
      "verified": true,
      "author": "R. Rankin",
      "helpful_votes": 0,
      "publication_date": 20160907
    },
    {
      "title": "Great value, convenient, great for small jobs or apartments",
      "text": "I paid $42 for this vacuum in late 2016. It was highly rated on Amazon with a high number of reviews, then. It's even cheaper now it seems. The plastic collar holding the metal handle finally cracked (it's been over a year and half). For its size and price, it's fairly powerful, it's light, it fairly easy to clean out, it's great for kids to use (as they learn to do their part), easy to store, great for smaller areas, or quick cleaning. Did I mention it's really inexpensive?",
      "rating": 4.0,
      "verified": true,
      "author": "Topdog-182",
      "helpful_votes": 0,
      "publication_date": 20180727
    },
    {
      "title": "I purchased this 5 months ago and loved it--So great for my little apartment",
      "text": "I purchased this 5 months ago and loved it--So great for my little apartment. Not the most powerful vacuum but it's light, easy to move and fits well in the little storage space I have (& more importantly, did the job I needed it to). I emptied it frequently, took good care of it... and then suddenly it completely stopped working. I don't vacuum a lot and have only had this product for 5 months!! How very disappointing that it couldn't even last half a year. I never write negative reviews on Amazon but I went from loving this little thing to being SO disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20170920
    },
    {
      "title": "tiny",
      "text": "Light pick vacuuming jobs. I want a stick vac for occasional light jobs, like the bathroom floor or gym floor when I don't want to drag out the full-sized vacuum. I unpacked it and should have followed my gut to repackage it and send it back. But I plugged it on and started it, the suction was good although it is so small. I used it 3 times and today I went to the landfill. It really is garbage.",
      "rating": 1.0,
      "verified": true,
      "author": "Mike B.",
      "helpful_votes": 3,
      "publication_date": 20181022
    },
    {
      "title": "Good for the price.",
      "text": "This review was ask for just after I received the stick vac. Therefore have used it only a couple times on my black porcelain tile floors (not hardwood). It's a good plus so far. The suction is good plus. You get use to it not being silent. It's easy to clean. A tad messy on the disposal but it may just be getting use to pulling out the \"dust plus\" container. It's lightweight and may tip if you walk away from it while holding only the cord but not a bad trade-off for the price and the suction. No regrets.",
      "rating": 3.0,
      "verified": true,
      "author": "EJ",
      "helpful_votes": 0,
      "publication_date": 20190507
    },
    {
      "title": "Best $30 I've ever spent",
      "text": "Listen, I previously wrote an amazing review with video of the first time I turned this vacuum on and it was flagged for profanity. I think it was because of joy. I was expressing my undying love for this vacuum. This is seriosuly the best vacuum for the price. My boyfriend has one for 3 years and I just got my own because I love it so much. It has a really good suction. Lifts my carpet right up compared to my other larger $100 vacuum. Itis light weight and easy to use and put away which I really enjoy.Great gift for older adults - not chunky or heavy. I can't recommend this vaccuum enough.",
      "rating": 5.0,
      "verified": true,
      "author": "Handsforhandsonhands",
      "helpful_votes": 0,
      "publication_date": 20200913
    },
    {
      "title": "Stopped working after 5 minutes",
      "text": "I bought this vacuum because of the reviews and i was sadly mistaken! I used this vacuum once and after 5 minutes it stopped sucking in any dirt. I removed the filter and cleaned out all the dirt that was in the vacuum thinking maybe something may haven gotten stuck in there. When i cleaned it and powered it back up again it still was not sucking in any dirt. I am such a big amazon user and have been happy with almost ever purchase i have received and this is the first time i am returning back a product i bought from amazon. poor poor quality would never recommend to anyone.",
      "rating": 1.0,
      "verified": true,
      "author": "Rose",
      "helpful_votes": 0,
      "publication_date": 20190111
    },
    {
      "title": "Handy",
      "text": "I just bought my second unit after two years. I love it because the corded vac still got more power than the cordless ones and this handles hair especially well. Joining at the vac and the head failed on my old one and the new one got some issue at the handle (so we swapped with the old one) but at the price and convenience I still consider it a good buy. We also got some replacement filters for it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190221
    },
    {
      "title": "Love this!!!",
      "text": "I don’t have pets but I do shed and I love this vacuum! Sometimes is doesn’t get the big dust bunnies that have a ton of hair with it but that’s ok- if it’s big enough for me to pick up I just throw it out and continue to vacuum. Super light weight though and easy to use by hand and use all the parts. Love this thing!!",
      "rating": 5.0,
      "verified": true,
      "author": "MBC",
      "helpful_votes": 0,
      "publication_date": 20191210
    },
    {
      "title": "Just what I needed for new hardwoods with a dog and kids!",
      "text": "Super surprised at this little vac and it's abilities! I needed something for hardwoods and that would pick up Cheerios from the little one tossing them constantly on the floor. This fits the bill fit my needs. I can do a quick daily vac of the kitchen at least and usually just do the whole house minus bedrooms. We have a husky mix with lots of shedding and it also sucks that up! I just empty and clean the canister and filter after each use. So far it's the perfect little picker upper.",
      "rating": 5.0,
      "verified": true,
      "author": "Lauren B",
      "helpful_votes": 0,
      "publication_date": 20180422
    },
    {
      "title": "Good Suction But Broke Emptying the Dirt Chamber",
      "text": "I bought this vacuum to keep in my upstairs closet since I don't have to do as much vacuuming up there. It does have the suction power that it claims; however, it broke the first time I opened it to empty the dirt collection chamber. I now have duct tape around the edge so it doesn't come off while I'm vacuuming, but that's a pain because I have to take it off every time I empty the chamber and then put a new piece on afterward. They just make things with such cheap plastic these days that nothing lasts.",
      "rating": 3.0,
      "verified": true,
      "author": "Lee",
      "helpful_votes": 0,
      "publication_date": 20180307
    },
    {
      "title": "Great little vacuum!",
      "text": "I love this little vacuum. Sure it is made of cheaper material, it’s only $36, but it works great. It has great suction! I use it everyday on my hardwood floors. We have a lab and she sheds a lot and this picks it up easily and quickly. It doesn’t work well on bigger stuff like dog food but it is excellent for a quick vacuum and hair pick up. I would like to purchasing a second one just to have on hand. Great product for the price!!",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle",
      "helpful_votes": 0,
      "publication_date": 20180922
    },
    {
      "title": "Unit attachment area is week",
      "text": "Vacuum is light weight and great for hardwood or tile floor. Suction Is very good but, with all the great details it has design flaws. The nozzle for interchanging cleaning pieces cracked on 3rd use and I’ve only had it in the original box also only used it as a handheld. The pieces are to heavy for the unit. I bought it because of the good reviews but the few bad reviews are the same as this one. Will be returning or replaced",
      "rating": 3.0,
      "verified": true,
      "author": "DRIPPY3AM",
      "helpful_votes": 0,
      "publication_date": 20200924
    },
    {
      "title": "Powerful and very good for the low price!",
      "text": "I was disappointed when I saw how small the vacuum head was, thought it wouldn’t be able to quickly/efficiently clean the house. But It took half the time as my old vacuum because the suction is so good. It is so light which is nice but also causes the vacuum to tip over so you CANT let it stand, it has to be propped against something like a wall. Otherwise it could crack when it tips over. Otherwise I love it",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica D.",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "Amazing!",
      "text": "This is the best floor vacuum I have ever used! I have a shepherd and a yorkie, 3 three year old kids, and a six year old. Fast forward a few years, and now we have a German wired haired pointer (working K-9). I swept every day and their hair would just fly around the broom. Trying to get it into the dust pan was almost impossible. Now I just turn on my upright and 100% of the hair goes right in and off my floors. I feel like I've gone from the stone ages, directly to 2017! I will be buying a second one for our motorhome. It doesn't take up much space, but packs some serious power.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie",
      "helpful_votes": 0,
      "publication_date": 20170216
    },
    {
      "title": "Great little pick up vacuum",
      "text": "I have had a chance to use this a bit now and am extremely pleased with it. It is quite powerful enough for quick pick ups and with the flexible home and accessory tools it is far better than the battery operated machine that I had previously used. On that one the battery has been taking very long to charge and doesn't hold a charge well so despite the convenience of cordless use this is one I won't have that problem with. The cord is long enough that it can reach across a somewhat large room and it is very easy to use. I hadn't heard of this brand but I can highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Jacqui Marlin",
      "helpful_votes": 0,
      "publication_date": 20170228
    },
    {
      "title": "Perfect Tiny Vacuum ever",
      "text": "This little vacuum was exactly what I wanted. I have a house with all wood floors and I just needed a vacuum that was able to pick up dust, pet hair and other little things. I have two very large dogs that shed alot and this vacuum was strong enough to pick it all up in one go (I didn't have to go over the spot multiple times). I love the detachable hand vacuum too. It is perfect for all my furniture and getting the dog hair out of my sofa. I even used the detachable piece to clean out my car. Worked way better than my shop Vac since it is light and easily movable.",
      "rating": 5.0,
      "verified": true,
      "author": "Devin",
      "helpful_votes": 0,
      "publication_date": 20170324
    },
    {
      "title": "NOT well made.",
      "text": "The first vacuum head's wheel broke off. I got the replacement that looked heavier-duty with a spinning brush. But hair gets it clogged up instantly -- so has to be cleaned out after every vacuum or it won't be able to suck in big or small particles. One of the attachments got a crack where it attaches - so I have to use more force to keep it on or just hold it on with one hand. I'm donating it to a charity and going to replace it. Very disappointing.",
      "rating": 1.0,
      "verified": true,
      "author": "AJH",
      "helpful_votes": 2,
      "publication_date": 20171003
    },
    {
      "title": "Not the best for easily scuffed floors.",
      "text": "So far, so good. The suction is strong. I watched it start to pull the kitty litter on the floor from a couple inches away. This makes is great with corners. I'm not sure about other people complaining that the on/off switch is in a bad place. I haven't had that be a problem. The roller attachment has ZERO floor protection. It is all hard plastic. I can see this being a problem for anyone with nice, new, easily scuffed or damaged floors. That is the point deduction for me. It's not too bad for me because my floors are in desperate need of rehabilitation, but for others, the scuffs could be a deal breaker.",
      "rating": 4.0,
      "verified": true,
      "author": "Kim H.",
      "helpful_votes": 0,
      "publication_date": 20170122
    },
    {
      "title": "FABULOUS!",
      "text": "I really didn't know what to expect from this little gem. I have 3 cats with tracking issues, the vac TOTALLY sucked it all up. Super suction! Stand up or hand vac, it does a great job! The motor of the vac is super strong, it's well worth the money. The attachments; brush, crevices and filter. The only down side is the cleaning of the filter, but not a big hassle since it's little. Final assessment? If you are a cat lover or have a small room, it's a great find!",
      "rating": 5.0,
      "verified": true,
      "author": "Dolly",
      "helpful_votes": 0,
      "publication_date": 20200702
    },
    {
      "title": "Design is the problem. Once put together, the ...",
      "text": "Design is the problem. Once put together, the piece that was inserted got stuck. I was not able to get it out. I could return it, but not exchange it, due to the fact it was from a 3rd part seller. The price had gone up, and I was not able to get a replacement at the same price. It is light weight and it is a cute color and design. Just needs some changes to insure the ability to put together and to be able to take it apart (and hopefully w/out things breaking or stop functioning).",
      "rating": 2.0,
      "verified": true,
      "author": "yocheved",
      "helpful_votes": 0,
      "publication_date": 20170110
    },
    {
      "title": "Small and strong",
      "text": "I bought this to keep the area around my cats' litter boxes tidy between full house cleanings. The loose litter on the tile around the box sucks up completely. I now use this further and clean the area rugs nearby. This little vac does a good job cleaning carpets. It's got very strong suction. Only drawback to using this little vac for more cleaning is the small head; it would take a long time to clean a full carpet, but I know it has the power to do so.",
      "rating": 4.0,
      "verified": true,
      "author": "HobbesEsq",
      "helpful_votes": 0,
      "publication_date": 20180430
    },
    {
      "title": "Vacuum made it to three years before it died...so great, we're buying another one!",
      "text": "We used this vacuum for everything... our carpet, our floors, our car, and it worked really great. A year into our vacuuming relationship, the bottom portion responsible for sucking started coming apart while vacuuming. That was a little annoying, but we dealt with it. Two years after that, the handle literally broke. That was two days ago. It's a bummer because it's really such a great vacuum when it comes to cleaning. And it's easy to clean which is also a huge plus. Anyway, we're getting ready to buy another one. Hopefully we get more life out of this next one. You get what you pay for right? But this is more bang for the buck, all-in-all.",
      "rating": 3.0,
      "verified": true,
      "author": "M.R.M",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "Really Nice Stick Broom",
      "text": "So far I do like this stick broom. It's very light weight, and has great suction power for an inexpensive stick broom. I like that the handle wand, when extended to the full length, allows me to vacuum comfortably without having to bend over the same as with another style hand vac. I was also surprised that it picked up little pieces of grass and cookie particles that the dog left on our area rug very nicely. The container is easy to empty and clean out as well. I haven't used the hand vac alone yet, but plan to. For the price, this can't be beat.",
      "rating": 4.0,
      "verified": true,
      "author": "embrlady",
      "helpful_votes": 0,
      "publication_date": 20170505
    },
    {
      "title": "Best apartment vacuum I've ever owned!",
      "text": "I have had this vac for about 2 years now and I'm still very happy with it. Very good price and comparable to the much more expensive Dyson. Very easy to clean! Great little machine that has crevice tools and can be put on your shoulder. Cleans up bad messes very easily and a snap to empty. It still works great after 2 or more years of solid use. I'm thinking about getting this for the office too.",
      "rating": 5.0,
      "verified": true,
      "author": "Brenda Rosengren",
      "helpful_votes": 0,
      "publication_date": 20190102
    },
    {
      "title": "It's been a year and a half and it's still going.",
      "text": "I use it like 2-3x a month in my little one bedroom now, but last year I had a roommate too. Good amount of use and it hasn't broken or anything, still just as powerful. The only thing is, if you have a lot of hair to vacuum or lint or something, you'll have to empty it a little more frequently. Easy though.",
      "rating": 5.0,
      "verified": true,
      "author": "Brianna S",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "Can't stand on it's own",
      "text": "We've had this vacuum for a while now, I specifically bought it to vacuum up the cat litter in the bathroom and it's all right for something so little but I'm not impressed with it. It's not very powerful, espicially compared to our dyson. I store it in a closet but it can't stand up on its own, it has to lean against a wall and that's pretty annoying when I stand it up it just falls over.",
      "rating": 2.0,
      "verified": true,
      "author": "Amelia Thomas",
      "helpful_votes": 0,
      "publication_date": 20181128
    },
    {
      "title": "Two powerful vacuum cleaners.",
      "text": "I really like this corded vacuum, I have owen a couple of cordless and they were useful for a little while but then did not have suction or loss power very soon. This little stick is very powerful, I clean under the table or small areas in a minute, and the slick design allows it tolive right where I use it most. I also like the fact that it comes appart and I then have a small appliance fro cleaning upholsrety or table hight surfaces, since they attachment is also differen it is like having two vacuum cleaners. So convenient that I gave a friend one as a gift when she moved to her new apartment!",
      "rating": 5.0,
      "verified": true,
      "author": "Cecilia Villabona",
      "helpful_votes": 0,
      "publication_date": 20161015
    },
    {
      "title": "Amazing vacuum, lightweight and strong suction",
      "text": "This is a REALLY GOOD VACUUM. For $40 I don't think that you can do better. I usually use Dyson, and I have the Dyson $500 stick vacuum. I think this one better. Yes, it has a cord, but because it doesn't rely on a battery like the Dyson stick vacuum, the suction is much stronger. It's so light and easy to maneuver that it might as well be cordless. Perfect for a small house or condo with mostly hardwood floors and a few area rugs. My dyson seems to push a lot of dirt around with the rotating brush and scatter larger debris instead of picking it up. This vacuum actually picks things up first try.",
      "rating": 5.0,
      "verified": true,
      "author": "Momo P.",
      "helpful_votes": 0,
      "publication_date": 20161021
    },
    {
      "title": "Great Quality for the price",
      "text": "I turned the vacuum on and it went flying across the room. I didn't expect the suction, or the ability to clean based the on the price. I bought this as a back up to my high quality vacuum, but it has been very impressive. The versatility is my favorite part. It has the ability to be a floor vacuum, fits in small spaces, has attachments for very small spaces, and can do pretty much everything. Impressed!",
      "rating": 5.0,
      "verified": true,
      "author": "Helen ",
      "helpful_votes": 0,
      "publication_date": 20180813
    },
    {
      "title": "Pleased",
      "text": "Arrived on time and was packaged nicely. I really like the vacuum its really helped with the dust and pet hair on our hardwood floors (7 cats and 1 dog).... Its very cute and doesn't take up much room at all. The noise level is a little quieter than a normal vacuum but i have sensitive ears so the noise still kind of bothers me but that's my own personal problem it might not bother others. Overall i really like this vacuum and it was very cheap. Ill probably buy another one from this company when this one gets old/breaks.",
      "rating": 4.0,
      "verified": true,
      "author": "Jasmine Emede",
      "helpful_votes": 0,
      "publication_date": 20171122
    },
    {
      "title": "This vacuum SUCKS...but in a good way!",
      "text": "Could probably suck the chrome off the bumper of a '57 Chevy! This runs circles around my other vacuums which all ended up in the trash - Bissell, Shark, Hoover, Black & Decker...I practically had to turn them upside down and FEED the dirt into them. The only thing I would add to this item is that I wish there was an additional head attachment that was wider for larger, open spaces. Other than that, it's lightweight, handy and works great.",
      "rating": 5.0,
      "verified": true,
      "author": "SB-9",
      "helpful_votes": 0,
      "publication_date": 20180215
    },
    {
      "title": "Dissapointed",
      "text": "Update: this vacuum is already broken and I’ve had it less than a year. Cracked around the handle. Cheap plastic. Really disappointed because I did like this vacuum, but not worth the money for the short time it lasted. Original post: Haven't had this long but I am happy with the power and lightness. I also like that the body detached easy and that it is easy to empty. My only complaint is that it fills up or plugs up quickly or easily so if you have a lot of cleaning you will be emptying it out a lot. But I like there is no bag to have to throw away.",
      "rating": 2.0,
      "verified": true,
      "author": "Heather Simmons",
      "helpful_votes": 0,
      "publication_date": 20170726
    },
    {
      "title": "Unbelievable suction, for such a small vacuum cleaner!",
      "text": "This is a great vacuum cleaner. Its small, compact design does not limit this vacuum's suction power. Very easy to use. I use this vacuum for quick pick-up messes, dog hair, and glass fragments. I do stained glass as a hobby. This vacuum and all of its' convenient tools cleans very well. And the dust cup empties into the trash pail. All I do is remove by hand any dust that accumulates on the washable filter. I also bought the replacement filter 3-pack so when I wash the filter, I have a fresh new one, whilst the old filter completely dries. I highly recommend this powerful vacuum.",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony Gobrecht",
      "helpful_votes": 0,
      "publication_date": 20161122
    },
    {
      "title": "BEST VACUUM EVER",
      "text": "HAD FOR 4 YEARS NOW - I have 2 dogs, have lived in an apartment with a gravel driveway in Michigan, and also airbnb my home. With airbnb, I CLEAN ALOT. This is my go-to vaccuum, hands down. I pick this one over the heavy duty bissell 95% of the time. It works like a dream on hardward floors, tile, and low-pile rugs. I am also not the most careful person, and it has held up well the amount of abuse I have put on it! Just empty & clean the filter and the suction will continue to work. BUY IT!",
      "rating": 5.0,
      "verified": true,
      "author": "mrs undecisive",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Solid small vacuum",
      "text": "Surprisingly good suction on bare floors and even on short pile rugs. I’ve only had this a month, but pretty happy with this vacuum. It’s light and easy to use. I’d definitely recommend this vacuum for quick floor cleaning.",
      "rating": 4.0,
      "verified": true,
      "author": "Sandy",
      "helpful_votes": 0,
      "publication_date": 20200721
    },
    {
      "title": "What an amazing product for $40!",
      "text": "I have just opened this and tried it out. Its amazing. Im shocked at how well it works. Its very lightweight and has great suction for its size. I love the extending handle and the flexibility that it can be a portable canister. I have not used the attachments yet and like I said, this is the first time I have used it but it surpasses my expectations for $40! I highly recommend this for a secondary /lightweight vacuum. I use it solely on hard flooring ((epoxy cement). My only slight issue/complaint is that I wish the cord were longer. But considering the weight and size I don't know that a longer cord would serve it well. Would highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "triker",
      "helpful_votes": 0,
      "publication_date": 20161201
    },
    {
      "title": "This little vacuum is the best! I use it to clean a studio and ...",
      "text": "This little vacuum is the best! I use it to clean a studio and it's soo light and easy to move around. I love that the handle is telescoping, it makes for easy storage in limited space. I would suggest this vacuum for those living in tiny houses, it has good suction power and the dumping cup is great as well. I mean it has everything, you can even hold it while going up the stairs, or use the little belt they provide to sling it across your back when doing curtains. Has accessories for the car, it's great, buy it :) It's better than any of those weak battery powered wireless things.",
      "rating": 5.0,
      "verified": true,
      "author": "Chinadoll",
      "helpful_votes": 0,
      "publication_date": 20161019
    },
    {
      "title": "This vacuum cleaner is perfect for floors",
      "text": "I purchased this vacuum because it has a small head (9\") and no beater/roller bar. Why? Because my other vacuums aren't functional in small places, for example, next to toilets. We also have 3 girls in the house with lots of hair. I got tired of having to cut out all the clogged hair from my cordless Hoover vacuum every few days. This vacuum cleaner is perfect for floors, so-so for rugs. It really is a great product for small spaces. I use my cordless Hoover or central vac for large rooms, and save this little miracle for the rest. Great suction, too.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Davis",
      "helpful_votes": 0,
      "publication_date": 20161121
    },
    {
      "title": "Inexpensive, but mediocre construction",
      "text": "Decent vacuum with good suction, but it has many pieces that don’t always fit together very well. In particular, the “floor roller” piece constantly falls off the clear dustbin when picking the vacuum up to carry it to another room. That clear dustbin is also not very durable... I’m literally shopping for this vacuum’s replacement right now, as the clear bin cracked and broke after the vacuum fell over onto a tile floor. (Vacuums don’t suction very well when there are cracks and holes along the way... :-( )",
      "rating": 3.0,
      "verified": true,
      "author": "TB2009",
      "helpful_votes": 0,
      "publication_date": 20180512
    },
    {
      "title": "Small fast and good powers. Cleans well and quickly",
      "text": "Super quick to vacuum with. Easy to put away. Easy to clean and store. Works well for vacuuming small areas. Can be used as a handheld cuz the handle detaches. The handle is adjustable to height but not if your too tall.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris B",
      "helpful_votes": 0,
      "publication_date": 20200524
    },
    {
      "title": "Nice light-weight vacuum for camper",
      "text": "I just received the vacuum last week and have used it once. It will primarily be used in an RV which has limited floor space (half carpet/half linoleum). It is very light-weight and easily converts into a hand vacuum. It has two attachments which are easy to use. The suction is very good for a small vacuum. There is no carpet brush in the head (which I hadn't noticed when I made the decision to purchase.) It seems to pick up some of the dirt on the carpet but it won't do a deep clean. I think it will be sufficient for the purpose for which I purchased.",
      "rating": 4.0,
      "verified": true,
      "author": "Judith J. Berkley",
      "helpful_votes": 0,
      "publication_date": 20170710
    },
    {
      "title": "I love this little vacuum!,,",
      "text": "I love this vacuum. I had a more expensive electric broom, that didn't pick up much of the dust and dirt, so I had to sweep after I used it! I have three dogs who don't shed, but they still leave dirt around. now with this vacuum, I get Everything at once. It picks up everything! It is light and sooo easy to use. Cleaning the filter is a breeze. I don't mind cleaning now with this. The fact that it is corded, adds a little more work, as I have to plug it in and then uno If to move around, but I never liked using batteries and it is a small price to pay for an excellent cleaner-upper!",
      "rating": 5.0,
      "verified": true,
      "author": "Retire in 1 year",
      "helpful_votes": 0,
      "publication_date": 20150809
    },
    {
      "title": "Well made and easy to take apart to clean",
      "text": "This little Stick vac is very well designed. I have rheumatoid arthritis with carpal tunnel in both hands so I usually have difficulty taking vacs apart to clean. Not with this very well designed cleaner! Just a press of the button and the cup is realeased and easily cleaned. It is also lightweight with great suction and a HEPA filter . Add an extra long adjustable handle and this is an ideal tool for someone disabled! Thank you VonHaus.",
      "rating": 5.0,
      "verified": true,
      "author": "Carmel Giordano",
      "helpful_votes": 0,
      "publication_date": 20181104
    },
    {
      "title": "It pretty much showed me everything the VonHaus was not picking ...",
      "text": "It's ok if you have a small guest room with carpet that you don't really use much. But as far as a living room or bedroom that gets a lot of traction, invest in a real vacuum. I had been using it for several months and realized it wasn't really picking up certain little things here and there, so I finally decided to get a real vacuum and holy shiitake, the amount of stuff that the real vacuum picked up was just overwhelming. I had to empty the full bin 3 times for two rooms. It pretty much showed me everything the VonHaus was not picking up thats for sure.",
      "rating": 2.0,
      "verified": true,
      "author": "Chrystal",
      "helpful_votes": 0,
      "publication_date": 20170504
    },
    {
      "title": "It doens’t Hold much so it good for a handheld more than the upright floor",
      "text": "I’ve had it awhile now, so far i haven’t destroyed it which I do with most vacuums. It doens’t Hold much so it good for a handheld more than the upright floor. Works great for the hardwood stairs, but unless you use the one with the brushes will tend to scratch the wood. The floor attachment doesn’t get the corners real great, but it works for quick pickups. If it’s totally empty, it will pick up small amounts of cat liter from the floor.",
      "rating": 5.0,
      "verified": true,
      "author": "Rummy3",
      "helpful_votes": 0,
      "publication_date": 20180114
    },
    {
      "title": "I love this little vacuum.",
      "text": "Only used it a couple of times but so far I love this little vacuum. I am tall so the adjustable handle is great.Gets into small spaces that my Shark can't. Decent suction even with the floor attachment it cleans corners and edges. Used the crevice tool to vacuum cabinets and stove top in my RV. Got this for the RV because of its compact size and removable handle but am ordering another one for my house.",
      "rating": 5.0,
      "verified": true,
      "author": "flash29",
      "helpful_votes": 0,
      "publication_date": 20180604
    },
    {
      "title": "it slides easily and is hard to steer",
      "text": "If you are looking for a compact, lightweight stick sweeper, then this is it. However, it is very difficult to maneuver on hardwood or ceramic surfaces, it slides easily and is hard to steer. Also, it doesn't have a bristle bar; basically it works using suction, and I found that it will not pick up dirt or pet hair from low pile area rugs, such as the small rugs people put in front of their kitchen sinks or door entries. So if you're looking for a stick sweeper that you'll use only hardwood or ceramic surfaces only, this works pretty good other than the fact that is slips and slides.",
      "rating": 2.0,
      "verified": true,
      "author": "Terri",
      "helpful_votes": 0,
      "publication_date": 20160617
    },
    {
      "title": "Good product",
      "text": "Good product for the price point. Easy to assemble. Easy and neat storage. Great suction. The only complaint is that the head of the vacuum is tiny, so makes vacuuming bigger spaces much slower. Also, the design of the vacuum makes it so it does not fit under the bed (due to the handle).",
      "rating": 4.0,
      "verified": true,
      "author": "Michael A",
      "helpful_votes": 0,
      "publication_date": 20190925
    }
  ],
  "product_meta": {
    "title": "VonHaus 2 in 1 Stick & Handheld Vacuum Cleaner - 600W Corded Upright Vac with Lightweight Design, HEPA Filtration, Extendable Handle, Crevice Tool and Brush Accessories - Ideal for Hardwood Floors",
    "rating": 4,
    "feature_bullets": [
      "UPRIGHT & HANDHELD - Stick Vacuum Cleaner with 130 Air Watts of Suction Power. Can be used at full length or without the extension tube for handheld cleaning",
      "BAGLESS VACUUM - 1.3L tank, easy to remove dust container: simply detach and empty the contents straight into the bin",
      "FILTRATION - the filtration system can lock in small particles, so that they don't re-circulate back into the air of your home",
      "EXTENDABLE HANDLE - easily glides over surfaces. 19.5 Foot Quick Release Power Cord, crevice tools and extension tube",
      "ATTACHMENTS - includes crevice tool, small brush attachment for handheld, hose adaptor, shoulder strap"
    ],
    "specifications": {
      "Product Dimensions": "12 x 6 x 6 inches",
      "Item Weight": "5.6 pounds",
      "Manufacturer": "DOMU Brands",
      "ASIN": "B00OHTKVM2",
      "Item model number": "EPT2",
      "Customer Reviews": "4.0 out of 5 stars5,469 ratings4.0 out of 5 stars",
      "Best Sellers Rank": "#22,898 in Home & Kitchen",
      "Is Discontinued By Manufacturer": "No",
      "Specific Uses For Product": "Carpet;Hardwood Floor;Stairs;Rugs;Furniture",
      "Specification met": "Certified frustration-free",
      "Batteries Required": "No"
    },
    "categories": [
      "Home & Kitchen",
      "Vacuums",
      "Vacuums & Floor Care",
      "Stick Vacuums & Electric Brooms"
    ],
    "price": 32.99
  }
}