{
  "website_summaries": [
    {
      "verdict": "A premium compact refrigerator that offers expert craftsmanship, lots of storage space and other great features.",
      "pros": [
        "Provides 4.4 cubic feet of storage and cooling space",
        "Includes 2 full-width and 1 half-width adjustable glass shelves for versatile storage",
        "Boasts an automatic defrost system for added convenience",
        "Comes with an efficient CanStor beverage dispenser and reliable interior light"
      ],
      "cons": [
        "May be noisy at times",
        "Sometimes starts and stops running on its own"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "This popular Energy Star-rated compact refrigerator offers supreme quality and durability.",
      "pros": [
        "Larger design with a 4.4-cubic-foot capacity",
        "3 adjustable shelves",
        "Brushed steel door interior lined with organizational compartments",
        "Reversible door hinge",
        "18-month warranty"
      ],
      "cons": [
        "A few issues with product arriving damaged"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Won't keep cold food cold",
      "text": "The refrigerator cannot maintain a temperature below 45-50 degrees. That is not cold enough for safety in food. I called the company and they told me to reboot but that did not work. I would like to return but it would cost me as much as I paid to ship back. I cannot do it myself and would have to hire somebody to pack and ship. I think I will go to the Big Box store and have them haul this away when they deliver a new box. It was too cheap to be true. I just never learn.",
      "rating": 1.0,
      "verified": true,
      "author": "Beancounter",
      "helpful_votes": 9,
      "publication_date": 20171228
    },
    {
      "title": "Major damage!!",
      "text": "I was so excited about this fridge. I ordered it before my builder was ready for it so I did not open it when it arrived. The box was not damaged so I didn’t think anything about storing it until he was ready for it. Once it was finally installed, the interior of the fridge was so badly damaged and the fluids had leaked all inside and burned the shelves. We had an appliance repairman try to fix it and the damage is beyond repair. This was a huge waste of our money. I know I should’ve opened it and checked it when it arrived but because the box was not damaged, it didn’t even cross my mind.",
      "rating": 1.0,
      "verified": true,
      "author": "Traci Sawyer",
      "helpful_votes": 0,
      "publication_date": 20190419
    },
    {
      "title": "I needed to put thermostat on coldest setting to make drinks the temp that I like. Still not quite as cold as I'd prefer",
      "text": "For the price, you can't beat it. Would be 5 stars, but I needed to put thermostat on coldest setting to make drinks the temp that I like. Still not quite as cold as I'd prefer, but pretty close. So keep that in mind. Not sure what reviews are saying about noisy, because I can barely hear mine run at all. VERY QUIET. I moved it into place and let it sit for a day before plugging in. Maybe that helped. Overall a nice little fridge with lots of room. Well worth the purchase. Kind of a no brainier here.....",
      "rating": 4.0,
      "verified": true,
      "author": "Kentucky",
      "helpful_votes": 7,
      "publication_date": 20160522
    },
    {
      "title": "awesome!",
      "text": "Compact refrigerators are seldom awesome, but 4 years ago I bought a SUMMIT compact fridge for $867 that only lasted 4 years, after which no one, and I mean NO ONE wold work on it to repair it. This Danby is a very good price, colder than the Summit that was 4X more money, and is equally quiet. The handle is a bit counter-intuitive but you get used to it, I have only owned it a few months now but so far i would highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "b gray",
      "helpful_votes": 0,
      "publication_date": 20190725
    },
    {
      "title": "Beware to totally avoid this defectively designed fridge!",
      "text": "Cannot set cooling level below 40F without the defroster drain trench and hole in the rear of box totally icing over, which then results in a total back up of all further water created by the defrost cycle such that the bottom floods and runs out under the door seal, so much so and in such volume that it can totally ruin your hardwood floors or mold your carpet. Not only that, it constantly runs almost non-stop, and all the time at an annoyingly high sound level. We're totally disappointed in with this product.",
      "rating": 1.0,
      "verified": true,
      "author": "Neo_Mac",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "Well designed, frost-free",
      "text": "I love the design of this little fridge. It is elegant and clean-looking and the interior is spacious for a mini fridge. The best feature is the freezer-less design. Typical mini fridge designs include a useless freezer (big enough for 2 or 3 Popsicles) that does little more than require you to defrost the thing on an extremely regular basis. This Danby model not only eliminates the extra work, but offers useful additional space often wasted to the freezer component. I love it.",
      "rating": 5.0,
      "verified": true,
      "author": "valangell",
      "helpful_votes": 5,
      "publication_date": 20160903
    },
    {
      "title": "Not cold!",
      "text": "Replaced an old Avanti 5.3' outdoor fridge having Stat issues. This fridge is a good replacement, I had the Avanti full, and everything fits in this Danby. After 2 days with a thermometer on the 1st shelf, setting at max, turns on at 41, off at 45. Will be looking at ways to get it colder! I like that it does not have freezer section, more room for Bud. It's built-in outdoors but well sheltered on covered patio, just hope it lasts. But at $98 can buy 1 a year for the cost of some of the \"real\" outdoor fridges.",
      "rating": 2.0,
      "verified": true,
      "author": "Tcat",
      "helpful_votes": 3,
      "publication_date": 20160927
    },
    {
      "title": "Packaging was excellent, shipping fast",
      "text": "Packaging was excellent, shipping fast, and works well. Keeps steady temps close to 36 degrees. I'm so pleased I was not deterred from buying because of the negative reviews. Nice little refig unit. Edit July 2017 -- Ordered a second unit - Have one in the horse barn and a second one in a remolded 1896 Granary. Both function perfectly. Very pleased with my purchase. Both arrived in perfect condition surrounded in custom white poly fitted packaging. And the keep things nice and cold -- five stars",
      "rating": 5.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 5,
      "publication_date": 20151127
    },
    {
      "title": "Very disappointed",
      "text": "Although purchased 3 years ago, it is only used 7 months/year at our winter home. Went out late last season. It was only operational for 13 months. Very disappointed and dissatisfied with Danby. No more of their products for me. Even during it's limited use, low temperature maintenance was poor.",
      "rating": 1.0,
      "verified": true,
      "author": "Ken Peters",
      "helpful_votes": 0,
      "publication_date": 20201004
    },
    {
      "title": "Quality build",
      "text": "arrived safely no issues with damage. It was double boxed and insulated. The fridge works perfectly keeping all areas a constant temp. It was a perfect fit for our RV giving additional frig space. just remember to let it sit for at least 12 hours before plugging it in, never know how many times it was on its side and upside down before it arrives at your door. It's a great fridge.",
      "rating": 5.0,
      "verified": true,
      "author": "Era53",
      "helpful_votes": 0,
      "publication_date": 20190920
    },
    {
      "title": "Seems to be hit or miss if you get a good one.",
      "text": "I've had this refrigerator for just under a month, and it was working ok until we turned down the cold to just past the half way mark. The moisture behind the metal plate in the back of the fridge froze and bulged the backing outwards. Now the top shelf doesn't sit in the brackets properly. I'll be contacting the customer service to see about a replacement.",
      "rating": 2.0,
      "verified": true,
      "author": "Michael U. Ortiz",
      "helpful_votes": 5,
      "publication_date": 20160719
    },
    {
      "title": "Several of us love to cook",
      "text": "I rent a house with several other guys. Several of us love to cook, but our refrigerator space is limited. After researching mini-fridges and compact refrigerators, I decided to purchase the Danby, as I did not need extra freezer space. The Danby has a lot of usable interior space, with tempered glass/clear plastic shelves. It easily fits a week's worth of my cooked lunches and dinners, with room to spare. The temperature is somewhat adjustable. The one drawback-- though not enough to warrant any form of rating demerit-- is the door column for chilling cans. I do not purchase many cans, and the inability to reconfigure that space means it will not be substantially used.",
      "rating": 5.0,
      "verified": true,
      "author": "Jonathon Hauenschild",
      "helpful_votes": 2,
      "publication_date": 20170326
    },
    {
      "title": "Good looking Fridge that works well so far",
      "text": "Good looking fridge that seems to work well so far. I'm giving it 4 stars not because anything is wrong with it or that I am disapponter in it in any way. Simply because time will be the only real test for how well this works for me. I'll update my review to either add it deduct stars over time",
      "rating": 4.0,
      "verified": true,
      "author": "J. Flynn",
      "helpful_votes": 5,
      "publication_date": 20170326
    },
    {
      "title": "Great small stand alone refrigerator",
      "text": "Needed a refrigerator for a remodel project and also to help bridge the gap getting a replacement for main refrigerator. This model has great storage room and is really quiet. When more items are added, it seems to affect the cooling but the adjustment is easy to make. Froze the lettuce when I forgot to reduce the cold indicator. Shelving and on door storage is great. The bottom container is helpful even though it doesn’t attach to any brackets.",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara boldrin",
      "helpful_votes": 0,
      "publication_date": 20190824
    },
    {
      "title": "Danby Compact Refrigerator",
      "text": "I am enjoying my refrigerator! It is spacious and I do not have to worry about defrosting it - because it does not have a freezer. This product is amazing. I have nothing but great things to say about it. I love the individual slots on the side door to hold cans or small bottles of soda, along with several side shelves. It boasts an adequate crisper bin that holds my fruits and veggies nicely. The actual shelves offer ample storage space! Oh, did I say that I absolutely love this refrigerator?! :-)",
      "rating": 5.0,
      "verified": true,
      "author": "Glennie",
      "helpful_votes": 3,
      "publication_date": 20160218
    },
    {
      "title": "NOT Happy",
      "text": "First the dimensions are not quite right, little wider than stated, Item missing parts, leveling legs, seen elsewhere considerably less money, Plus it is non returnable, Been a prime member for 10 years, First Time totally disappointed!!!!",
      "rating": 2.0,
      "verified": true,
      "author": "Electrician",
      "helpful_votes": 0,
      "publication_date": 20190706
    },
    {
      "title": "Door dents easily but makes a great kegerator!",
      "text": "I used the fridge to make a kegerator. I was a very easy conversion but a tight fit. I was extremely careful cutting away the interior of the door, but still managed to put a dent in the door. The stainless steel is very thin and very soft. If I were to do this again, I would probably go to a slightly larger fridge as two cornelius kegs and a carbonation rig are very tight This fridge is commonly used as a kegerator because it has no refrigeration lines or hidden electrical lines across the top.",
      "rating": 4.0,
      "verified": true,
      "author": "MMIII",
      "helpful_votes": 0,
      "publication_date": 20180203
    },
    {
      "title": "Top Of The Line!",
      "text": "This is my favorite refrigerator now almost 2 years later. It's stored outside so I waxed it from head to toe with Klauss wax and it still looks and works like it did one the very first day. The glass shelves in this unit take away the \"Jenga\" game of trying to get soda cans on wired shelves to stay straight. If I bought another fridge this size it would be this exact model, so I hope they don't stop making it anytime soon!",
      "rating": 5.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 3,
      "publication_date": 20160629
    },
    {
      "title": "Works fine for outdoor use",
      "text": "I have mine installed outside (even though it's not rated for outdoor use) - first one died after 6 seasons (possibly because I forgot to turn it off in the winter, and it may have frozen/burst the refrigerant piping), and I feel that at $200, I got my money's worth out of it, so I bought another one. I expect to buy another one in another few seasons - I don't hear anything better about the $2,000 refrigerators that are actually rated to be outside.",
      "rating": 5.0,
      "verified": true,
      "author": "SRichard",
      "helpful_votes": 0,
      "publication_date": 20170728
    },
    {
      "title": "Perfect In Every Way!",
      "text": "A 4.4 cubic foot mini fridge might be a bit large for some, however, if you have the space you can't beat it. Mine isn't just used for libations, I prep my daily lunch and store it, deserts, soda's fruit, you name it. And best of all, no freezer. Those freezers always require thawing out a few times a year. Good price for a great product.",
      "rating": 5.0,
      "verified": true,
      "author": "roderick may",
      "helpful_votes": 0,
      "publication_date": 20190619
    },
    {
      "title": "Horrible at keeping a solid temperature",
      "text": "Horrible at keeping a solid temperature. Drinks are not cold enough to be considered refreshing to me. Storing food is not even possible as the temperature never gets below 40 degrees. Open the door and it shoots past 42 degrees which is not a good environment for food. Disappointing in this purchase, and dreading taking this to the post office and shipping it out, then having to pay upfront shipping.",
      "rating": 2.0,
      "verified": true,
      "author": "Good Day..",
      "helpful_votes": 6,
      "publication_date": 20160120
    },
    {
      "title": "This fridge is great and I like that it does not have a ...",
      "text": "This fridge is great and I like that it does not have a freezer section. Not having a freezer section gives you a lot more room. Perfect for my office. The only complaint I have about this fridge is that even on a level floor I can't get the fridge to stop rocking back in forth. The leveling options on the bottom of the fridge simply are not that effective. The fridges looks great and will do the job. Just be prepared to shim or otherwise support one or more of the feet to achieve a balanced fridge.",
      "rating": 4.0,
      "verified": true,
      "author": "EricD",
      "helpful_votes": 3,
      "publication_date": 20150908
    },
    {
      "title": "A very functional compact refrigerator that I would highly recommend",
      "text": "This is well packed with a lot of care and attention to detail. The directions are clear. The inside is clean. The unit cools quickly, and keeps food at temperature. It is not at all noisy, and has a functional layout that works well. The adjustable shelving is appreciated. Would buy again in a heartbeat!",
      "rating": 5.0,
      "verified": true,
      "author": "love2read",
      "helpful_votes": 0,
      "publication_date": 20190911
    },
    {
      "title": "A nice little refrigerator.",
      "text": "It is a nice looking little refrigerator. So far it is working very well. I bought this one without the little freezer section and I like the way it lays out. Every other brand of small refrigerators I have bought were packaged poorly and had several dents. This one is packaged very well which shows they care about their product-not a scratch.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve Jansen",
      "helpful_votes": 4,
      "publication_date": 20160606
    },
    {
      "title": "GREAT price!",
      "text": "I would recommend this compact refrigerator to my family and friends. Cool evenly, has great space for our needs. We have it in our basement using it for extra canned sodas and bottled water. I like to entertain and need extra refrig. for my food and drinks, perfect! The exterior front does not smug either! Price right !!",
      "rating": 5.0,
      "verified": true,
      "author": "TCFlatt",
      "helpful_votes": 2,
      "publication_date": 20170508
    },
    {
      "title": "Perfect!",
      "text": "Love this fridge! Arrived quickly, NO DENTS! (which I was worried about since many reviews mentioned denting during shipping). The fridge was in its own box and was packaged in another box for shipping. It keeps things perfectly cold and fits a lot of food. Its in the spare room next to the bedroom and is super quiet too. Great price for this size of fridge! 100% happy about this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Jolielle",
      "helpful_votes": 0,
      "publication_date": 20180904
    },
    {
      "title": "I love these refrigerators",
      "text": "I love these refrigerators, and this one is a replacement for one that I've had for 7 years. However, they come with the hinge on the right side but are prepped to change the hinge to the left side, which I did. However, the mounting holes were off about 1/4 inch, and that left a quarter inch crack from top to bottom; the door would not seal. I can't use it with the door opening from the left, so Danby is sending me a new fridge.",
      "rating": 3.0,
      "verified": true,
      "author": "Terry L. Clevinger",
      "helpful_votes": 0,
      "publication_date": 20171130
    },
    {
      "title": "This Is Haunted!",
      "text": "This refrigerator stops and starts on its own, for no reason, all the time since I bought it. No one can figure it out and the company won't replace it.. I use mine for beer and wine so this is annoying but I can never use it for food which spoil.",
      "rating": 1.0,
      "verified": true,
      "author": "Gar Reyem",
      "helpful_votes": 4,
      "publication_date": 20161125
    },
    {
      "title": "Light comes on when door opens",
      "text": "This is the second Danby I have owned, the previous one lasted 12 years. The features that I like: Light comes on when door opens, and no freezer. I did not want to have to defrost a freezer, and also I wanted the extra refrigerator space. The vertical drink organizer accommodates regular sized cans and small ones. Love the vegetable crisper cuz it holds carrots for my horse.",
      "rating": 5.0,
      "verified": true,
      "author": "AnneD",
      "helpful_votes": 0,
      "publication_date": 20170803
    },
    {
      "title": "perfect for drinks",
      "text": "We have this in our garage to chill sodas and beer. I love the fact that it doesn't have a freezer since that would be a waste for what we use it for. The storage is perfect for drinks love the door area. It took a little longer to chill the first time and made me think it was broke but next morning everything was cold.",
      "rating": 4.0,
      "verified": true,
      "author": "amazon slave",
      "helpful_votes": 3,
      "publication_date": 20160919
    },
    {
      "title": "I really like the way the drinks stack in the door",
      "text": "I use this in my outdoor BBQ. I really like the way the drinks stack in the door. It keeps the drinks cold even when the temp gets up there ( I live in Socal w/110+ temps). One of the brackets that hold the shelf in place was broken upon arrival. Since it's more of a beer fridge, I couldn't use the shelf anyways, but it's worth noting and why it gets a star deducted.",
      "rating": 4.0,
      "verified": true,
      "author": "KMar",
      "helpful_votes": 2,
      "publication_date": 20160923
    },
    {
      "title": "Customer Support very bad, so if you purchase a Danby, beware!!",
      "text": "Purchased Mini Fridge on 6-2-19. Packaging missing a leveling leg. Smallest part on the fridge. Written 4 email to customer support and received a case # and a ticket #, but no leveling leg. Just wrote my 4th email still trying to get the leg. No response. Tried to call customer support had to wait on line the last time for 1 hr 18 min. Finally had to leave for work. Stated the wait time is 15 to 45 minutes. Mini fridge still has several stacked flat paint sticks to keep it level so I can use it. Fridge works fine, customer support is horrible. This review was my next task.",
      "rating": 1.0,
      "verified": true,
      "author": "Suzie ",
      "helpful_votes": 0,
      "publication_date": 20190807
    },
    {
      "title": "Missing leg support",
      "text": "Another refrigerator today I was expecting a quality product right out of the box it's missing the one base support ( the knob to adjust the feet) I have stuck my daughter is playing sets a wood block on the refrigerator so it stays balanced also the refrigerator is pretty loud. I certainly did not get a good first impression I will look at my rating one year from now and increase my rating if this refrigerator get quiter less and works OK for atleast 2 more years",
      "rating": 2.0,
      "verified": true,
      "author": "Ed",
      "helpful_votes": 2,
      "publication_date": 20150901
    },
    {
      "title": "Awful.",
      "text": "Awful! Arrived dented and missing screws. We ripped the box to get it out so we went ahead and plugged it in since I figured we cannot return it without the packaging. It's uneven and missing one of the adjustable leg pieces. How does that even happen?!? Plugged it in and it gets cool but not cold. I'm so disappointed that we paid so much for an awful product. I guess I should have read more reviews before ordering.",
      "rating": 1.0,
      "verified": true,
      "author": "AHenry",
      "helpful_votes": 16,
      "publication_date": 20150722
    },
    {
      "title": "It doesn't work.",
      "text": "I had previously bought this fridge and modified it for my home bar, and it worked great! I was quite pleased. When it was time to expand our bar, I purchased the same exact fridge. Unfortunately, THIS ONE DOESN'T WORK. I'm very displeased.",
      "rating": 1.0,
      "verified": true,
      "author": "CreepingJennie",
      "helpful_votes": 0,
      "publication_date": 20180531
    },
    {
      "title": "Good capacity just loud",
      "text": "The frig looks nice and love the fact it does not have a freezer since we only store drinks in it. The main problem is the noise it constantly makes. Definitely louder than other mini frigs I have owned.",
      "rating": 3.0,
      "verified": true,
      "author": "Andrew B",
      "helpful_votes": 0,
      "publication_date": 20180826
    },
    {
      "title": "Keeps water cold with wide temperture variances",
      "text": "Have had unit for 2 weeks and monitor the temperature with a professional grade thermometer and notice a 10 degree temp swing that seems to be leveling out. Unit makes a sound like running water when cycling so will up date but so far need more impressive performance. Not keeping any food items in it yet just water and drinks.",
      "rating": 3.0,
      "verified": true,
      "author": "Majormike",
      "helpful_votes": 3,
      "publication_date": 20151230
    },
    {
      "title": "Am not pleased with thermostat control",
      "text": "Looks very nice-is very quiet.No freezer on this exact model.not want one regardless.Am not pleased with thermostat control,any slight adjustment seems much too drastic---warmer or colder.Plan to research and install a more reliable thermostat control.Simple-yet not expected.Life is what I believe,nothing to complain about when I wake up/Live through precious life.-each day as it arrives.",
      "rating": 3.0,
      "verified": true,
      "author": "YaBetcha",
      "helpful_votes": 0,
      "publication_date": 20160609
    },
    {
      "title": "Was not handled well in delivery.",
      "text": "I will admit I expected a little bumps and bruises on a fridge ordered online, but this was clearly dropped hard on the corner so bad the metal warped. So now not only is there a cosmetic bubbling of the sheet metal but it also wobbles on a level floor. It does still work, but for $200 I don't really want it to wobble. I'm disappointed to say the least.",
      "rating": 2.0,
      "verified": true,
      "author": "Andy",
      "helpful_votes": 0,
      "publication_date": 20190703
    },
    {
      "title": "Damaged inside box",
      "text": "Packing greatly inadequate for shipping. The inside contents shifted and banged around inside damaging many of the inside components. The box outside looked fine but inside is another story. It also doesn't sit level even with the adjustable foot there's no way to level it out. Pretty disappointing considering the price but needed a temp fridge while waiting for kitchen rehab. I'll give it 2 stars since it does appear to be cooling still.",
      "rating": 2.0,
      "verified": true,
      "author": "Chris H",
      "helpful_votes": 0,
      "publication_date": 20180927
    },
    {
      "title": "i've bought 2 refrigerators, one is still working properly ...",
      "text": "I've bought 2 refrigerators , one is still working properly, but the other one is no longer cooling. 20 min on the phone and representative offer me a full refund. I actually think its not so bad for the customer service... But of course its still require extra time which in my case is very valuable for me to spent on refrigerator replacement. But overall its ok.",
      "rating": 3.0,
      "verified": true,
      "author": "Marvel",
      "helpful_votes": 2,
      "publication_date": 20150918
    },
    {
      "title": "Disappointed",
      "text": "Defective. I wish this could have been an easy usual Amazon fix. But in order to get a refund or replacement (unclear on which) I have to cut the cord and remove the serial number , then dispose of the piece which will be an extra expense. All this being done remote from our vacation home remodel which means everything is finished except this appliance not in place. Disappointing.",
      "rating": 1.0,
      "verified": true,
      "author": "LeeAnn",
      "helpful_votes": 0,
      "publication_date": 20200521
    },
    {
      "title": "Nice fridge",
      "text": "Had previous one in my outdoor kitchen here in Houston which is a harsh environment for about 9 years and it’s not recommended for outside use. Did so well bought exact replacement.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark Mc",
      "helpful_votes": 0,
      "publication_date": 20180801
    },
    {
      "title": "Stopped working right at 4 years.",
      "text": "I don’t like that this refrigerator stopped working completely right at the four year anniversary. There is also no way to repair as all the serviceable parts are impossible to get to. Update- we were able to repair this unit by replacing the relay switch.",
      "rating": 1.0,
      "verified": true,
      "author": "Amanda L. Dinsmore",
      "helpful_votes": 0,
      "publication_date": 20190616
    },
    {
      "title": "Works great!",
      "text": "This unit has been installed for 5 months in our outdoor grill area. Keeps contents super cold even in 100 degree weather. Highly recommend it!",
      "rating": 5.0,
      "verified": true,
      "author": "bobkattkg",
      "helpful_votes": 0,
      "publication_date": 20190905
    },
    {
      "title": "Second time is the charm.",
      "text": "So far is a great replacement to the one I had for years. Recommend it. You will see a photo of a red refrigerator. It’s why my history says I bought two. Fist one came in wrong. Different model. I liked it well enough to put it in another location. Then on the second attempt it came in right.",
      "rating": 5.0,
      "verified": true,
      "author": "James P. Taft",
      "helpful_votes": 0,
      "publication_date": 20190908
    },
    {
      "title": "Not recommended",
      "text": "This fridge worked great for 3 years. And then it just stopped. The light goes on, but no cooling. We tried everything, but it just doesn't work anymore. Now we have to buy a new one, but I hope we can find a different company because I no longer trust Danby.",
      "rating": 1.0,
      "verified": true,
      "author": "ML",
      "helpful_votes": 0,
      "publication_date": 20200925
    },
    {
      "title": "I Rate This A Best Buy",
      "text": "This is a beautifully engineered high quality mini-fridge. It maintains temperatures at ( + or - ) 2 degrees F. That's better than any full sized (and full priced) fridge I've ever owned. This is not the flimsy mini-fridge found in national stores. Congrats to Danby for a well built machine at a very reasonably price.",
      "rating": 5.0,
      "verified": true,
      "author": "LPW",
      "helpful_votes": 2,
      "publication_date": 20170416
    },
    {
      "title": "but works just fine as a beer fridge along with some condiments and ...",
      "text": "It is the exact size and dimensions I was looking for, it fit right into the spot I wanted. It is a little smaller internal storage than I expected, but works just fine as a beer fridge along with some condiments and some food stored in the drawer. Works for what I needed.",
      "rating": 4.0,
      "verified": true,
      "author": "PatBB",
      "helpful_votes": 0,
      "publication_date": 20180314
    },
    {
      "title": "Worked while it lasted but....",
      "text": "Lasted two years almost to the day. Runs but not cold anymore. Used for the basement den, so not opened a lot. Customer service was no help, just repeated what's in the manual for trouble shooting. Seemed very pleased that it was out of warranty.",
      "rating": 3.0,
      "verified": true,
      "author": "Station18",
      "helpful_votes": 3,
      "publication_date": 20170601
    },
    {
      "title": "Noisy...",
      "text": "I purchased this for our studio Airbnb space and because the bed is in the same room I am keenly aware of the constant gurgling noise that has been an issue from the start. I read many reviews before purchasing and some people indicated that noise is a problem. I hoped that we would get a quiet one. We Did Not...... Actually, I have another larger Danby with a freezer and it seems that the manufacturer just can't produce a quiet motor. Nice frig; However, if you are sensitive to noise...look for another model.",
      "rating": 3.0,
      "verified": true,
      "author": "Dawn O'Neil",
      "helpful_votes": 0,
      "publication_date": 20180215
    },
    {
      "title": "Full of beer",
      "text": "Excellent still working outside by the pool and full of beer",
      "rating": 5.0,
      "verified": true,
      "author": "Barry Richard Sacks",
      "helpful_votes": 0,
      "publication_date": 20200830
    },
    {
      "title": "Perfect fridge.",
      "text": "Finally bit the bullet and bought a back up fridge to handle overflow on holiday weekends. We like to entertain and there's never enough room in the main fridge for everything. Great fridge. Holds a ton of beverages and has a modern sleek design.. Arrived in perfect condition and on time.",
      "rating": 5.0,
      "verified": true,
      "author": "Marnie Rapaport",
      "helpful_votes": 7,
      "publication_date": 20160707
    },
    {
      "title": "Runs all of the time, ices up, then defrosts.",
      "text": "It runs nearly all of the time, even on a very low setting - we only use it for vegetables. Every few days, it ices up on the metal wall on the back of the inside, then stops running and defrosts, so that water pools on the bottom and comes out the door when you open it. Bought the same model several years ago and use it in our kitchen for vegetables, never have had a problem with it.",
      "rating": 2.0,
      "verified": true,
      "author": "Karen Wyant",
      "helpful_votes": 0,
      "publication_date": 20190813
    },
    {
      "title": "I do not think it is Danby's fault because the packing is very good..",
      "text": "well, I have not have a chance to use it since it came damage twice. I do not think it is Danby's fault because the packing is very good...double packing but from my house video camera. Looked like UPS just toss this box around and it came with big ding/dent and I had to return it both time.",
      "rating": 3.0,
      "verified": true,
      "author": "Dung Le",
      "helpful_votes": 0,
      "publication_date": 20170928
    },
    {
      "title": "Lasted less than 3 years",
      "text": "Worked OK for nearly 3 years. Purchased June 2016. Will not replace with the same model. A fridge should last longer than this one did.",
      "rating": 2.0,
      "verified": true,
      "author": "Darwin Wilson",
      "helpful_votes": 0,
      "publication_date": 20190504
    },
    {
      "title": "... had this for about a month now and I love it. It doesn't have the freezer compartment since ...",
      "text": "I've had this for about a month now and I love it. It doesn't have the freezer compartment since that compartment doesn't fit anything anyway. Purchased this as a little add-on since we recently have a new housemate. This does not make a sound, and my fruits stays cold, without freezing spots. Keep it in the garage for drinks and I'm glad we bought it.",
      "rating": 5.0,
      "verified": true,
      "author": "Lonnie408",
      "helpful_votes": 0,
      "publication_date": 20170925
    },
    {
      "title": "Broken After 2 Months! - DO NOT BUY",
      "text": "We bought this mini fridge on 8/17 and now just barely 2 months later it's dead! What a waste of money! When it worked it was great but now we have to shell out more money for a replacement... Ridiculous!",
      "rating": 1.0,
      "verified": true,
      "author": "Shopping Mama",
      "helpful_votes": 0,
      "publication_date": 20181027
    },
    {
      "title": "Great little fridge, love it so far",
      "text": "Really nice, love the all refrigerator, no freezer. Quiet, cannot hear it run and it cools a full load to a nice cold temperature. VERY WELL packaged, no shipment damage. I recommend this unit.",
      "rating": 4.0,
      "verified": true,
      "author": "Fred A. Bronnert",
      "helpful_votes": 0,
      "publication_date": 20180723
    },
    {
      "title": "A little noisy, but great temp control.",
      "text": "I like it. Great for keeping a few things cool away from the kitchen.",
      "rating": 5.0,
      "verified": true,
      "author": "bigal",
      "helpful_votes": 0,
      "publication_date": 20191223
    },
    {
      "title": "Actually love this fridge",
      "text": "Actually love this fridge, it doesn't have a freezer which allows for more space and less mess. I have it right next to my chest freezer so I can keep the two separated. The door was dented when it got here but , eh I can live with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Ben",
      "helpful_votes": 2,
      "publication_date": 20160426
    },
    {
      "title": "3 years and gone",
      "text": "If you want to buy something that will last longer than 3 years, I suggest you look at something else. Mine died, without warning, almost 3 years to the day from my purchase. Was great to that point.",
      "rating": 2.0,
      "verified": true,
      "author": "mav",
      "helpful_votes": 0,
      "publication_date": 20190613
    },
    {
      "title": "Love it",
      "text": "Love this. But turn the temp down when not opening for more than a week. The defrost hole in the back will freeze up other wise",
      "rating": 5.0,
      "verified": true,
      "author": "Tyr",
      "helpful_votes": 0,
      "publication_date": 20190325
    },
    {
      "title": "Honestly",
      "text": "It seems like a really good fridge but id buy a fridge in person. It did not srvive shipping at all.",
      "rating": 4.0,
      "verified": true,
      "author": "coolgold157",
      "helpful_votes": 0,
      "publication_date": 20190723
    },
    {
      "title": "Really great",
      "text": "Just got this as a replacement and I love it. The inside really holds allot of stuff. There is no freezer which I prefer as I find they never work on these smaller fridges anyway.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe joe",
      "helpful_votes": 3,
      "publication_date": 20160312
    },
    {
      "title": "So far so good",
      "text": "Great frig but a little lower. I plan on using it in a bar out side but haven't finished building it yet. Seemed to hold up to some seariouse hot waves in cali (110 and we don't have air conditioning.",
      "rating": 4.0,
      "verified": true,
      "author": "Laura/ Lorissa",
      "helpful_votes": 0,
      "publication_date": 20180904
    },
    {
      "title": "Great frig",
      "text": "Love this frig with no freezer. Holds a lot and is pretty quiet. So far so good",
      "rating": 4.0,
      "verified": true,
      "author": "AC",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "Attractive unit",
      "text": "We bought this to replace an old refrigerator that we use to store supplies of extra beverages. It is a great size, well-organized, and quiet.",
      "rating": 5.0,
      "verified": true,
      "author": "Sharon D.",
      "helpful_votes": 0,
      "publication_date": 20181019
    },
    {
      "title": "great product at a very reasonable price",
      "text": "pleasantly surprised with how good a product i received. the item is quiet, and keeps things evenly cold. have yet to find cold or warm spots inside the refrigerator.",
      "rating": 5.0,
      "verified": true,
      "author": "DCC",
      "helpful_votes": 0,
      "publication_date": 20180614
    },
    {
      "title": "Fantastic!",
      "text": "This was a birthday present for my husband! It came on time and in great condition no dings nothing! It was everything I wanted for him and his \"beer\" fridge.",
      "rating": 5.0,
      "verified": true,
      "author": "Leah Penn",
      "helpful_votes": 0,
      "publication_date": 20181008
    },
    {
      "title": "Received with damaged top",
      "text": "The lid on top of this Danby Compact All Refrigerator gets screwed down from underneath when you open the door. All three of the attachment points were broken and none of the screws were in the box. The refrigerator was purchased to fit underneath a cabinet but if we ever want to move the refrigerator to a different location having a loose top is an issue. We are very disappointed with the purchase of this brand and most likely will never purchase this brand again.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170620
    },
    {
      "title": "Solid small performance fridge!",
      "text": "Solid small performer! Using it 2nd month, perfect addition to our main kinchen fridge. Perfectly sits under countertop. Virtually silent.",
      "rating": 5.0,
      "verified": true,
      "author": "Anvar Khodzhaev",
      "helpful_votes": 0,
      "publication_date": 20180624
    },
    {
      "title": "Great little refrigerator",
      "text": "Like it except it does need a temperature reading on the outside door. Need an indicator to assure you that everything is working properly. It is not used frequently therefore we would not know if it was malfunctioning. Otherwise great little fridge",
      "rating": 4.0,
      "verified": true,
      "author": "PatK",
      "helpful_votes": 0,
      "publication_date": 20160905
    },
    {
      "title": "Bad Product",
      "text": "I bought the frig new and it disnt work. Set cool on mac and frig compressor would only run for 15 seconds. Manufacturer would not replace or take old one back. Amazon though gave me a full refund to purchase a new brand. Thank you Romi at Amazon for being amazing.",
      "rating": 1.0,
      "verified": true,
      "author": "Laurie Taylor",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "Disappointing",
      "text": "Wanted to like this fridge. After all, it's all fridge, no freezer, and that is the purpose we intended it for. However, because the door doesn't seal tightly at all (hardly any suction/magnetic pull on it), it forms ice in the back....much like the issues of a regular mini fridge/freezer...if you keep it colder than halfway. Because of this, our drinks are barely cool. Very frustrated, and wishing I had gone with my gut and not ordered such an item online. Live and learn, unfortunately.",
      "rating": 2.0,
      "verified": true,
      "author": "Scott Bush",
      "helpful_votes": 0,
      "publication_date": 20171005
    },
    {
      "title": "Good",
      "text": "So far so good. Makes a little more noise than I like upon starting the compressor but has been working fine. Hopefully no problems for a long time.",
      "rating": 4.0,
      "verified": true,
      "author": "Renee ",
      "helpful_votes": 0,
      "publication_date": 20170319
    },
    {
      "title": "This is a great fridge. I was searching for the largest fridge ...",
      "text": "This is a great fridge. I was searching for the largest fridge with no freezer compartment and this fit the bill really nicely. The door layout is pretty good too.",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan Mitchell",
      "helpful_votes": 0,
      "publication_date": 20171014
    },
    {
      "title": "Nice fridge. The range of temperatures is less than ...",
      "text": "Nice fridge. The range of temperatures is less than ideal (fridge thermometer says between 25-40F). So far, no frozen beers :) All the packaging issues that they've had in the past are resolved it seems. Outside shipping box, styrofoam, retail box, styrofoam, plus some extra cardboard. No dents in mine!",
      "rating": 5.0,
      "verified": true,
      "author": "P. Hoch",
      "helpful_votes": 2,
      "publication_date": 20150623
    },
    {
      "title": "Debbie",
      "text": "Bought it for my sons supplies. I have had it over two years, so far no problems and has come in handy during the holidays and special occasions. I like the stainless steel front, It goes with the rest of my appliances.",
      "rating": 5.0,
      "verified": true,
      "author": "dshm",
      "helpful_votes": 0,
      "publication_date": 20190516
    },
    {
      "title": "Highly recommend",
      "text": "I wanted a fridge without the freezer and the layout of this one is perfect. It looks beautiful, has an inside light, drawer, and plenty of room on the door. Highly recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Michele",
      "helpful_votes": 0,
      "publication_date": 20180710
    },
    {
      "title": "It leaks water",
      "text": "I store normal groceries in it but it builds ice and leeaks water from i slowly melting idk but it sucks",
      "rating": 2.0,
      "verified": true,
      "author": "Markus Casto",
      "helpful_votes": 0,
      "publication_date": 20190708
    },
    {
      "title": "Stained \"new\" product",
      "text": "Product arrives in working condition but with a very large, yellow stain on the bottom on the inside. Very disappointed to not receive a new product. Would not purchase again.",
      "rating": 2.0,
      "verified": true,
      "author": "EBJ",
      "helpful_votes": 0,
      "publication_date": 20171029
    },
    {
      "title": "great fridge",
      "text": "awesome little fridge, keeps all my beer very cold, this thing is great at great price, love it cause it don't have crappy freezer",
      "rating": 5.0,
      "verified": true,
      "author": "sabbster",
      "helpful_votes": 2,
      "publication_date": 20160623
    },
    {
      "title": "Nice looking unit",
      "text": "Nice looking unit. However, the initial refrigerator would not cool at all. Worked through Danby warranty service and they had us cut the cord and sent a new unit within a few days. The second one seems to be working fine.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170219
    },
    {
      "title": "Five Stars",
      "text": "Nice and quiet but not as cold as I would prefer.",
      "rating": 5.0,
      "verified": true,
      "author": "ABDIV62",
      "helpful_votes": 0,
      "publication_date": 20180518
    },
    {
      "title": "Kinda disappointed with longivity",
      "text": "Purchased in 2015 and lasted three years only. Kinda disappointed with longivity. Obviously outside of the warranty period of 18 mo. Would think it would have lasted longer. Used it for my backyard BBQ deck area. Only stored drinks. Did keep the drinks cold when it was working.",
      "rating": 2.0,
      "verified": true,
      "author": "Sddonnie",
      "helpful_votes": 0,
      "publication_date": 20171125
    },
    {
      "title": "Excellent fridge",
      "text": "Very Happy with this unit. We plugged it in right away. It reached an ideal temperature. The fridge is well designed and just what we needed: no freezer. Our old one, now recycled, froze everything. The is perfect for us.",
      "rating": 5.0,
      "verified": true,
      "author": "calclerkret79",
      "helpful_votes": 0,
      "publication_date": 20160218
    },
    {
      "title": "Perfect for my wet bar/kegerator",
      "text": "Perfect for my wet bar/kegerator! Works great and fits nicely under the countertop. Beer tube was easily plumbed through the top. Fits a 6th barrel and co2 tank perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike D",
      "helpful_votes": 8,
      "publication_date": 20170729
    },
    {
      "title": "Works fine but storage isn't ideal for bottles which I assume ...",
      "text": "Works fine but storage isn't ideal for bottles which I assume is the primary reason most people would buy it. The shelfs are badly spaced for bottles and there is only so much modification you can to to accommodate them. Runs quite and keeps everything cold.",
      "rating": 4.0,
      "verified": true,
      "author": "SMcL",
      "helpful_votes": 0,
      "publication_date": 20150920
    },
    {
      "title": "Wonderful price!",
      "text": "Great mini refrigerator for our bar area! We love that it is all refrigerator with NO FREEZER-they are hard to find.",
      "rating": 5.0,
      "verified": true,
      "author": "Marilyn Pentel",
      "helpful_votes": 0,
      "publication_date": 20160801
    },
    {
      "title": "the packaging was great, it arrived with out a scratch or dent ...",
      "text": "the packaging was great, it arrived with out a scratch or dent and works perfect... the only drawback I see is that it will cool no lower than 39 degrees. I was hoping for at least 36 degrees... but plenty of room for beer and wine...",
      "rating": 5.0,
      "verified": true,
      "author": "jimga",
      "helpful_votes": 0,
      "publication_date": 20150810
    },
    {
      "title": "Really nice clean looking fridge",
      "text": "Really nice clean looking fridge. I love that there isn't a freezer, much more space efficient. We use it in our office for snacks, drinks and lunches. Lots of shelving options for different size drinks, etc.",
      "rating": 5.0,
      "verified": true,
      "author": "AngieFlavored",
      "helpful_votes": 0,
      "publication_date": 20160413
    },
    {
      "title": "Meets my needs",
      "text": "It is compact , keeps things cold and is very good for storing beer juices wine and candles . I have it outdoors and it looks like it will stand up to the weather .",
      "rating": 5.0,
      "verified": true,
      "author": "Alice R. Clement",
      "helpful_votes": 0,
      "publication_date": 20170812
    },
    {
      "title": "lots of storage space and look good. No more manual defrosting like you have to ...",
      "text": "I own several of these. Quiet, lots of storage space and look good. No more manual defrosting like you have to do with most mini-fridges come with a shoebox sized freezer that ices up and is generally useless.",
      "rating": 5.0,
      "verified": true,
      "author": "none",
      "helpful_votes": 0,
      "publication_date": 20151020
    },
    {
      "title": "Good Fridge, Bad Handling",
      "text": "The finish is not metal on the front but a laminated front. It arrived dented and scratched but it wasn't worth the cost to return it. The fridge itself works well however. I like the size and storage space.",
      "rating": 4.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20151012
    },
    {
      "title": "Keeps items cold -- quality built. Looks great.",
      "text": "Bought for my son. He absolutely loves it. Says it keeps everything nice and cold.",
      "rating": 5.0,
      "verified": true,
      "author": "Earl",
      "helpful_votes": 0,
      "publication_date": 20180126
    },
    {
      "title": "Man Cave Gotta Have!",
      "text": "Arrived in perfect condition and is running strong! Holds a ton of drinks!! The perfect extra all refrigerator for my Man's Cave and with attractive features such as stainless door and glass shelves.",
      "rating": 5.0,
      "verified": true,
      "author": "Shopper D",
      "helpful_votes": 0,
      "publication_date": 20160920
    },
    {
      "title": "Perfect no-freezer fridge to use as a 2nd fridge.",
      "text": "This fridge perfectly fit the space that we had available. We were looking for a refrigerator with no freezer space, to maximize it's use as a second fridge for our house. It is quiet and spacious and meets all of my needs.",
      "rating": 5.0,
      "verified": true,
      "author": "Flying Squirrel",
      "helpful_votes": 0,
      "publication_date": 20180606
    },
    {
      "title": "Great fit and good value",
      "text": "Could not be happier. Installed in a large under roof outdoor kitchen. Absolutely perfect!",
      "rating": 5.0,
      "verified": true,
      "author": "Trey B.",
      "helpful_votes": 0,
      "publication_date": 20190823
    },
    {
      "title": "So far so awesome. Was in perfect condition out of the box ...",
      "text": "So far so awesome. Was in perfect condition out of the box Chilled within 2 hours (I have it in an outdoor kitchen in S Fla) and is silent, not quiet, but silent in its operation",
      "rating": 5.0,
      "verified": true,
      "author": "The Law",
      "helpful_votes": 0,
      "publication_date": 20150306
    }
  ],
  "product_meta": {
    "title": "Danby Designer 4.4 Cubic Feet Compact Refrigerator (DCR044A2BDD) Black",
    "description": "Size:4.4 cu.ft.| Color:BlackWhen you’re in need of a counter-high refrigerator that offers a large storage area in a compact space there’s no need to look any further than Danby’s DCR044A2BDD model. This high-tech unit offers 4.4 cubic feet (126 L) of refrigeration capacity and is ideal for workshops, dens, rec-rooms and lunchrooms etc. It’s outfitted with a convenient CanStor beverage dispenser for your favourite drinks and has more than enough room for tall bottles. The 2.5-shelf design offers maximum storage versatility and the appliance is controlled by an accurate mechanical thermostat and simple semi-automatic defrosting system. If you need to freeze certain types of foods or are simply looking for a place to make and store ice cubes this appliance meets the requirements as it also features a full- width independent freezer section. Since this attractive model is also Energy Star rated it won’t raise your power bills. This classy compact fridge can be found in white, black and smudge-free spotless steel finishes, making it suitable for any style of existing décor. In addition, it comes with an integrated door handle with a convenient reversible door hinge for both left and right-handed opening.\n\nFROM THE MANUFACTURER\nWhen you’re in need of a counter-high refrigerator that offers a large storage area in a compact space there’s no need to look any further than Danby’s DCR044A2BDD model. This high-tech unit offers 4.4 cubic feet of refrigeration capacity and is ideal for workshops, dens, rec-rooms and lunchrooms etc. It’s outfitted with a convenient CanStor beverage dispenser for your favorite drinks and has more than enough room for tall bottles. The 2.5 glass shelf design offers maximum storage versatility and the appliance is controlled by an accurate mechanical thermostat and simple push-button defrosting system. If you need to freeze certain types of foods or are simply looking for a place to make and store ice cubes this appliance meets the requirements as it also features a full- width independent freezer section. Since this attractive model is also Energy Star rated it won’t raise your power bills. It also uses Eco-friendly, natural R600a refrigerant to help our environment. This classy compact fridge comes in an appealing black finish, making it suitable for any style of existing décor. It also comes with an integrated door handle with a convenient reversible door hinge for both left and right-handed opening. The smooth back design enables the fridge to be placed flush against a wall and it comes with a generous 18-month warranty on parts and labor with in-home service.",
    "rating": 4.1,
    "feature_bullets": [
      "4.4 cu. ft. (126 L) capacity compact fridge",
      "Energy Star compliant. Environmentally friendly R600a refrigerant.",
      "Semi-automatic defrost. Full-width freezer section.",
      "2 full width and 1 - 1/2 width adjustable glass shelves. Integrated door shelving with tall bottle storage. CanStor beverage dispensing system.",
      "Mechanical thermostat.",
      "Integrated door handle. Reversible door hinge."
    ],
    "specifications": {
      "Brand Name": "Danby",
      "Model Info": "DCR044A2BDD-3",
      "Item Weight": "64.3 pounds",
      "Product Dimensions": "20.87 x 20.71 x 32.72 inches",
      "Item model number": "DCR044A2BDD-3",
      "Is Discontinued By Manufacturer": "No",
      "Capacity": "4.4 Cubic Feet",
      "Installation Type": "Free Standing",
      "Part Number": "DCR044A2BDD-3",
      "Form Factor": "Stand Alone",
      "Color": "Black",
      "Voltage": "120 Volts",
      "Door Hinges": "Reversible",
      "Door Material Type": "Steel",
      "Shelf Type": "Glass",
      "Material Type": "Steel",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "ASIN": "B00MO6V9CQ",
      "Customer Reviews": "4.1 out of 5 stars1,840 ratings4.1 out of 5 stars",
      "Best Sellers Rank": "#18,202 in Kitchen & Dining",
      "Date First Available": "August 13, 2014"
    },
    "categories": [
      "Small Appliances",
      "Home & Kitchen",
      "Appliances",
      "Compact Refrigerators",
      "Kitchen & Dining"
    ],
    "price": 289.14
  }
}