{
  "website_summaries": [
    {
      "verdict": "Nice looking design with curved legs and rails. This crib is convertible to a day bed frame when the child grows up.",
      "pros": [
        "Pretty easy to set up and put together",
        "All-wood construction",
        "Interesting design with curved support legs and side rails",
        "Meets all of the ASTM safety standards",
        "3 adjustable mattress positions",
        "Great crib size to place in any room where it's needed"
      ],
      "cons": [
        "Must purchase a mattress separately",
        "Some problems with consistent stain color in the wood"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Cosleeper perfect",
      "text": "The answer to my cosleeping needs. Used straps to attach it to the bed frame. I have a tall mattress so I had to figure out how to raise it to be level. I just happened to have a bench part go my bedroom set that when I sat the crib on top (3” mattress) made it perfectly level with the top of my mattress.",
      "rating": 5.0,
      "verified": true,
      "author": "lavero",
      "helpful_votes": 40,
      "publication_date": 20181021
    },
    {
      "title": "Amazon/seller should note warning",
      "text": "After unpacking the crib and reading the directions, I was hit with a bold warning: No mattress over 2\" thick is to be used in this crib. No explanation as to why. This is upsetting because Amazon didn't note the warning, nor did any previous reviewers. I'm perplexed and without a mattress. My granddaughter will have to sleep on the thin pad that comes with the crib.",
      "rating": 4.0,
      "verified": true,
      "author": "Babz23",
      "helpful_votes": 68,
      "publication_date": 20161016
    },
    {
      "title": "Baby X loves it!!!",
      "text": "I like this lil crib its really cute. Bought for my daughters first baby! It doesnt take up much room at all. Measurements were accurate. Mattress fit well. I thought the price point was a little high being in a mini crib, but after further search I realize it was about average. I would definitely recommend this crib if you haven't got a lot of space. I purchased this crib with my own coins it's not sponsored",
      "rating": 5.0,
      "verified": true,
      "author": "Kandy",
      "helpful_votes": 12,
      "publication_date": 20180705
    },
    {
      "title": "I love this crib",
      "text": "I love this crib, mine came in perfect condition without any damage or missing parts. I am not giving it 5 stars because it came with the wrong instructions but the makers of the crib have the instructions on their website so if you have this issue go to the Dream on me website and you can download the instructions to any of their cribs. It really is a beautiful piece of furniture. It did take my husband 2 hours to put it together.",
      "rating": 4.0,
      "verified": true,
      "author": "DressLadyYessy",
      "helpful_votes": 14,
      "publication_date": 20180112
    },
    {
      "title": "Perfect!",
      "text": "Such a cute crib for a really good price! I was going between buying a mini crib or a bassinet so the baby could sleep in our room and landed on the mini crib. The price is pretty equal to a decent bassinet when you add the mattress but I feel the crib will be a lot more secure and most bassinets only last until baby is around 6 months or able to pull themselves up where this will last until about 1 1/2 years in crib form then can switch into a toddler bed. I'll be able to get so much more use out of this.",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley",
      "helpful_votes": 24,
      "publication_date": 20170511
    },
    {
      "title": "We love the mini crib",
      "text": "This is made with cheap, not real wood, but at this price point it’s understandable. We love the mini crib! We have one rail off and slide it up to our bed and use it as a cosleeper. And when baby is done using it our we will use the day bed for our dogs",
      "rating": 4.0,
      "verified": true,
      "author": "Vanilly",
      "helpful_votes": 8,
      "publication_date": 20180422
    },
    {
      "title": "I love it!",
      "text": "I fell in love with this mini crib, this is my third baby and I needed a crib that fit the only little space I have in my room, and this is exactly what I needed! Very good quality also! ❤",
      "rating": 5.0,
      "verified": true,
      "author": "Alba A",
      "helpful_votes": 7,
      "publication_date": 20180705
    },
    {
      "title": "... fits what used to be my walk-in closet just fine, I'm just not sure if it's gonna be ...",
      "text": "Cute and fits what used to be my walk-in closet just fine, I'm just not sure if it's gonna be enough for our little one or we're gonna need a bigger crib soon. My LO is 4 months old and he pretty much fills the whole crib, his head and toes hit the shorter sides of the crib when I put him in that position so I am kind of skeptical about whether or not it's gonna be comfortable him when he gets older",
      "rating": 4.0,
      "verified": true,
      "author": "Ragda",
      "helpful_votes": 6,
      "publication_date": 20180119
    },
    {
      "title": "Great option for a Small Space",
      "text": "Bought this because the standard size crib was just too big for my city bedroom. It's a great size, and is quite sturdy - it survived a transatlantic move without much more than a scratch or two from packing/unpacking. So far my two year old is fine in it, though if she has a growth spurt soon I might finally have to give up and buy a bigger bed. Easy to put together and it's got an interesting shape and style without being too ornate.",
      "rating": 5.0,
      "verified": true,
      "author": "Shanti Sethi",
      "helpful_votes": 3,
      "publication_date": 20180905
    },
    {
      "title": "Do not waste your money",
      "text": "We bought this due to us having twins we thought the mini crib would be good for the space since we had to put two cribs and other things in the room not worth the money you can buy a bigger size crib for the same price finding a mattress and crib sheets is very hard for it and my child is already 9 months old and is outgrowing the crib. We ended up buying one full-sized crib we are selling this one to buy another full size crib my nine-month-old is a mess as big as a day and crib not worth the money at all",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20180828
    },
    {
      "title": "Perfect for those with limited space",
      "text": "This is the perfect size for small spaces. My son out grew his bassinet and this is the same size as a play pen. It all goes together with an allen wrench and is great... definitely requires a separate purchase of mattress the pad it comes with is like a sleeping bag thickness...",
      "rating": 5.0,
      "verified": true,
      "author": "Kara chico",
      "helpful_votes": 4,
      "publication_date": 20180920
    },
    {
      "title": "Love this crib! Looks great and is sturdy.",
      "text": "Absolutely LOVE this crib! It’s so cute and looks so nice, and best of all, my grand baby sleeps well in it. Note- you need to buy a mattress for mini cribs as this comes with a little pad. We got a dream on me for $27 on Amazon and put the pad right over it and we have a firm mattress with a nice cushion. All around great purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "T Payne",
      "helpful_votes": 2,
      "publication_date": 20191206
    },
    {
      "title": "Spacious and comfortable for the little one .",
      "text": "If you are looking to save space in your room I highly recommend this product. It was better than I had anticipated it to be. I was absolutely satisfied with this purchase and it was perfect for my 8 month old and spacious. However, you will need to buy two additional Dream on Me mattress to make it work and more comfortable for the baby. The one that came with the crib is too slim and does not provide enough cushion. Overall, my money was well spent and invested.",
      "rating": 5.0,
      "verified": true,
      "author": "Sivilay Chansy Hap",
      "helpful_votes": 6,
      "publication_date": 20170313
    },
    {
      "title": "It's perfect",
      "text": "Love this mini crib! It's built great and came without any damage and really easy to build! My daughter loves it and so do I! It's perfect for the space we needed it for! Would definitely recommend this mini crib if you need a beautiful well built crib for small spaces!",
      "rating": 5.0,
      "verified": true,
      "author": "Danielle Riley",
      "helpful_votes": 23,
      "publication_date": 20160321
    },
    {
      "title": "Easy for 1 to assemble, BEAUTIFUL, super durable, easy to change into \"big girl\" bed too!!",
      "text": "Had the crib for almost 4 years, used as a toddler bed (No front rail) for about 1.5 years now. Put it together 8 moths preggo, by myself-who needs to wait for help?!? lol I maybe should have. BUT, it wasn't as hard (at all) as other cribs I've put together! Love the design, the finish has held up really well, even through the \"imma naw my way outta this prison\" phase. Changing to the toddler bed seriously took like 10 mins. And that was just cuz i needed to read the directions again. ha! VERY easy. Perfect size too, just what we needed. Buy this crib. Seriously. If they made \"adult sized\" beds, I'd 99.9% get one.",
      "rating": 5.0,
      "verified": true,
      "author": "Sara A.",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "My Baby Loves It!",
      "text": "The instructions were kind of annoying and the mattress came with it was definitely too thin. I'm happy that I got a different one from reading the reviews before I bought this. The crib is very sturdy my 10mo. old loves it. It's a great buy, I should of just bought mini cribs from the beginning instead of pack and plays because those mattress pad things wore down so quick. If you thinking about getting this crib, buy it 🥰🙂 Oh and we went with the \"Dream On Me\" extra firm mattress, it's OK for a newborn but I might get something softer but it will do for now.",
      "rating": 5.0,
      "verified": true,
      "author": "Angel",
      "helpful_votes": 0,
      "publication_date": 20200304
    },
    {
      "title": "Excellent buy!!",
      "text": "Such a beautiful bed and good quality too. Bought this bed for my grandbaby. I would reccomend buying a separate mattress as the one that comes with it is useless. I bought a 3\" memory foam mattress- sized for mini-cribs. Love this crib and definitely recommend!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190610
    },
    {
      "title": "Recommend!",
      "text": "I love this mini crib. We had major issues putting it together because we got confused with the screws haha. The mattress it comes with us sooooo thin, definitely buy one. It also states the mattress dimensions needed- I posted a photo of for anyone looking.",
      "rating": 5.0,
      "verified": true,
      "author": "Capricorn*Aries*Virgo",
      "helpful_votes": 0,
      "publication_date": 20200510
    },
    {
      "title": "Invest in the thicker mattress",
      "text": "Bought this smaller crib because I wasn’t ready to put my baby in her own room. Fits great in my room and makes it easier when you have to get up at night. Sturdy and roomy. Did purchase the additional thicker mattress though. The pad that comes with it is trash.",
      "rating": 5.0,
      "verified": true,
      "author": "Kerrianne ",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "I love these minicribs",
      "text": "This is the second Dream On Me minicrib I've purchased. The first is still being used by my 2 y/o grandson so we bought another for his new sister.",
      "rating": 5.0,
      "verified": true,
      "author": "ADM",
      "helpful_votes": 4,
      "publication_date": 20180905
    },
    {
      "title": "Heavy burden",
      "text": "This is a nice crib. I have triplett grandbabies on the way so ordered three of them in espresso. Imagine my dissapointment when one of them is black. It is clearly maked on the box that it is black. Now i have to lug it to return it and get the right one. The purpose of online ordering is convenient delivery. This is no longer convenient",
      "rating": 5.0,
      "verified": true,
      "author": "Robin Talbot",
      "helpful_votes": 2,
      "publication_date": 20191004
    },
    {
      "title": "Nice mini crib!",
      "text": "Beautiful gift from my sister. Very easy to assemble. Great quality so far and the dimensions are perfect for our room. Also recognized the 2 in limitation on the mattress, but were able to figure that out thanks to previous reviews. Otherwise I think that would have been a major hindrance to getting this product.",
      "rating": 5.0,
      "verified": true,
      "author": "priteshkumar b mistry",
      "helpful_votes": 3,
      "publication_date": 20170912
    },
    {
      "title": "Came with a lot of damage and it wasn't done during shipping i can tell",
      "text": "Horrible experience with this shouldnt have nor did it need to ne this difficult...it came damages with marks on a few parts well quite a few marks on the entire crib I really don't appreciate that it's not like I spend $20 on this thing and it shouldn't be damaged in at least five places that I've spotted",
      "rating": 1.0,
      "verified": true,
      "author": "Lanna Hea",
      "helpful_votes": 0,
      "publication_date": 20200305
    },
    {
      "title": "Great crib!",
      "text": "Great mini-crib! Very sturdy and nice to look at! Don’t get the 5” spring mattress for it though, it will balloon up and create an unsafe sleep environment for your baby. I had to return the mattress and get the 3” one and it fits perfectly! Very happy and super affordable",
      "rating": 5.0,
      "verified": true,
      "author": "jess",
      "helpful_votes": 3,
      "publication_date": 20180523
    },
    {
      "title": "Perfect for compact nursery’s or Co sleeping spaces",
      "text": "I love this mini crib so much. I needed a crib to go into my baby girls small sized nursery and this crib was the perfect fit. It was so easy to put together and is extremely sturdy if assembled properly. I love the design and the color, it was everything I wanted. It came with a thin mattress so I purchased the Dream On Me mini mattress for extra comfort and my daughter sleeps like an angel.",
      "rating": 5.0,
      "verified": true,
      "author": "EVOLVE2EXIST",
      "helpful_votes": 0,
      "publication_date": 20200229
    },
    {
      "title": "Stylish, easy to assemble and fits small spaces.",
      "text": "I love it. We have a smaller bedroom and a toddler in a larger bed so this is similar in style and color to our bedroom set and it fits very well. The height is adjustable and our 4 month old sleeps well in here. I would recommend a bumper but it takes some back and forth as they are made for standard cribs and have to be snugly woven and tied for safety.",
      "rating": 5.0,
      "verified": true,
      "author": "caveman442",
      "helpful_votes": 2,
      "publication_date": 20190307
    },
    {
      "title": "Absolute garbage!",
      "text": "My wife and I purchased 2 dream on me mini cribs, the first one was a DOM addison and had to return it because it was missing pieces. Once returned and the refund was refunded to my account we ordered the DOM violet crib and the wooden platform where the mattress rests on was split in half!! I do NOT reccomend DREAM ON ME products at all!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Alec yanish",
      "helpful_votes": 2,
      "publication_date": 20190520
    },
    {
      "title": "Great lil crib",
      "text": "Our baby hated sleeping in the pack and play so we got this to try instead and she sleeps much better in it! It’s a great size for our bedroom. We purchased a mattress to go inside this cause the one it comes with is so this!!",
      "rating": 4.0,
      "verified": true,
      "author": "tawnya",
      "helpful_votes": 2,
      "publication_date": 20190214
    },
    {
      "title": "LOVE this crib!!!",
      "text": "We’ve been using this crib for about 5 months now and I love it so much! It’s super cute and also sturdy. We needed a mini crib because our bedroom is small and this fits perfectly next to our bed. It was easy to put together and it doesn’t wobble at all. It’s perfect!",
      "rating": 5.0,
      "verified": true,
      "author": "SM",
      "helpful_votes": 0,
      "publication_date": 20191218
    },
    {
      "title": "Compact",
      "text": "Small but still should be enough room (my 18 month fits in it) fits perfectly in the small space I have. Light weight, easy to put together (I'm pregnant and was able to get it done and moved by myself). Only thing I had a problem with was I had the wrong item shipped to me the 1st time but got the correct one the 2nd time and not all the parts were labelled.",
      "rating": 4.0,
      "verified": true,
      "author": "Kera",
      "helpful_votes": 0,
      "publication_date": 20190402
    },
    {
      "title": "Worth it",
      "text": "Beautiful look and feel. I wish the gray was the same cost as the others but for me it’s still worth it. It’d be even greater if it were as cheap as the other colors. It’s sturdy and the wood and materials used are safe",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201004
    },
    {
      "title": "I have a daycare and have two of these and love them!",
      "text": "This is about the size of a pack n play but looks so much nicer. I have a daycare and have two of these and love them!",
      "rating": 5.0,
      "verified": true,
      "author": "Rebecca Fuller",
      "helpful_votes": 6,
      "publication_date": 20170513
    },
    {
      "title": "They dont understand the difference between open box, and used.",
      "text": "Disappointed. The description of this stated open/damaged box, condition very good. So based off that I assumed it wasn't used. Unfortunately not only was it not just an open box it was also used, the end pieces were put on backwards , damaging the outside finish, and left indents in the wood. It was also missing a Burrell nut. Might be returning.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180301
    },
    {
      "title": "Baby to Toddler Crib",
      "text": "Beautiful color and very sturdy after it's finalized in construction. It's a good price, due to the fact that it grows with your child from baby to toddler. I didn't care for the mattress and purchased another.",
      "rating": 5.0,
      "verified": true,
      "author": "Lady T.",
      "helpful_votes": 0,
      "publication_date": 20201018
    },
    {
      "title": "Good solid product",
      "text": "Little time to put together, exactly as described and perfect for the small space we had to cram this into!",
      "rating": 5.0,
      "verified": true,
      "author": "James H.",
      "helpful_votes": 2,
      "publication_date": 20190807
    },
    {
      "title": "Perfect for us!",
      "text": "Limited space, decided to go with a mini crib . This is amazing. I love it. It was easy for me to assemble. And at 1year old now. He still fits perfectly. But, he is a short lil guy. :)",
      "rating": 5.0,
      "verified": true,
      "author": "Sammie .B",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "Missing piece.",
      "text": "Missing an entire side of it. How does that even happen?! Obviously cannot put it together without an entire side panel. Put in a return and it's telling me it'll be here Friday. It's Saturday. Should be a lot sooner considering it's their mistake.",
      "rating": 1.0,
      "verified": true,
      "author": "KellyP.",
      "helpful_votes": 2,
      "publication_date": 20170923
    },
    {
      "title": "Cute",
      "text": "Super cute and good quality for the price. Perfect for the in between stage for our baby - between bassinet and a crib in her own room.",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 2,
      "publication_date": 20181211
    },
    {
      "title": "Cute little crib",
      "text": "Perfect size for our needs and relatively quick to put together, though not easy to do with just one person. Only complaint is that one leg arrived with some scratches/cosmetic damage. But nothing too major.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "Receive it with scratches and crack",
      "text": "I'm so disappointed. When I opened the box, I found many scratches in addition to a crack on one of the sides....",
      "rating": 2.0,
      "verified": true,
      "author": "Naoufal Lakhssassi",
      "helpful_votes": 0,
      "publication_date": 20191220
    },
    {
      "title": "Best space saving crib!",
      "text": "Absolutely beautiful sturdy crib and fit in our small place nicely. I did order another mattress for the crib because the one that came with it was pretty thin. I had it put together by myself in a little over 1hr. Everything was marked with letters on it so there was no second guessing on what piece went where. I would buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Boy mom",
      "helpful_votes": 0,
      "publication_date": 20200201
    },
    {
      "title": "One Star",
      "text": "Showed up without screws and other hardware. Waiting on shipment of screws and hardware.",
      "rating": 1.0,
      "verified": true,
      "author": "redman76",
      "helpful_votes": 3,
      "publication_date": 20180303
    },
    {
      "title": "Mini Crib",
      "text": "The crib is awesome. It’s looks great in person. Took about an hour to put it together. Very sturdy and well made. Perfect size for the space I needed it in.",
      "rating": 5.0,
      "verified": true,
      "author": "Kap430 ",
      "helpful_votes": 0,
      "publication_date": 20190714
    },
    {
      "title": "3 stars",
      "text": "There was an instruction book, but no letter or number stickers on anything to label which piece is what. The base board that the mattress lays on is cracked on two of the corners also.",
      "rating": 3.0,
      "verified": true,
      "author": "Samantha Humphries",
      "helpful_votes": 0,
      "publication_date": 20200814
    },
    {
      "title": "Best Mini Crib Choice!!!!",
      "text": "This mini crib is PERFECT! It is easy to assemble and comes with all the instructions and tools to do so. It comes with a 1” inch mattress pad.",
      "rating": 5.0,
      "verified": true,
      "author": "TOBY ",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "Small fit and neat!",
      "text": "I love the quality and the size. I have small bedroom and it fits perfect.",
      "rating": 4.0,
      "verified": true,
      "author": "Faheema",
      "helpful_votes": 0,
      "publication_date": 20190530
    },
    {
      "title": "Five Stars",
      "text": "Easy to put together. Looks nice. Daughter seems to enjoy sleeping in it.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason W.",
      "helpful_votes": 3,
      "publication_date": 20180407
    },
    {
      "title": "Missing part",
      "text": "Missing a side. I returned the product. Called manufacturer and they told me it would take three days to see if they can locate a spare part. I was shocked they wanted me to wait days to find out if they had the part.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "I Really Like This Crib!",
      "text": "This crib is light in weight but sturdy. It was also easy to assemble, my fiance didn't even take 30 full minutes to put it together. Also it does not take up a lot of space, which was a plus for me!",
      "rating": 5.0,
      "verified": true,
      "author": "Cupcake",
      "helpful_votes": 0,
      "publication_date": 20200503
    },
    {
      "title": "Dream On Me customer service was not helpful at all.",
      "text": "Was disappointed in this crib as mattress that was recommended did not fit. When I called Dream On Me company for assistance, they were of No help!",
      "rating": 1.0,
      "verified": true,
      "author": "GiGi",
      "helpful_votes": 0,
      "publication_date": 20190605
    },
    {
      "title": "Very small: for a mini mattress",
      "text": "This is for a mini mattress. We had to return. There’s no way our mattress would fit. It doesn’t say that anywhere on the listing. Make sure you measure everything before you order.",
      "rating": 1.0,
      "verified": true,
      "author": "Erin Woodruff",
      "helpful_votes": 0,
      "publication_date": 20181201
    },
    {
      "title": "Check the screws bag to if you have the right screws",
      "text": "I still gave it five stars because I do like it but some of the screws sizes was wrong to set up one size of the crib I thought it was my mistake so I took it apart to check all of the screws but it wasn’t my mistake",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Scales",
      "helpful_votes": 0,
      "publication_date": 20191022
    },
    {
      "title": "Beautiful but Puzzling Assembly",
      "text": "It's beautiful but some parts are missing and some of the holes are missing.",
      "rating": 5.0,
      "verified": true,
      "author": "G. Agerbeek",
      "helpful_votes": 0,
      "publication_date": 20190204
    },
    {
      "title": "Cute and affordable.",
      "text": "I read a ton of review's and we ended up with thia crib. It was a good value for the price and fits easily in our smaller room next to the bed. Cute design and wasn't that hard to put together. Just make sure you know the difference between all the screws before assemble. Haha.",
      "rating": 5.0,
      "verified": true,
      "author": "david bonilla irizarry",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "Good product",
      "text": "I like that it was very easy to assemble. It is sturdy and good",
      "rating": 5.0,
      "verified": true,
      "author": "alfred j",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "Cute and modern",
      "text": "Perfect for the newborn as a starter crib! My grand baby likes it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amy Taylor",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "Five Stars",
      "text": "Highly recommended for small apartment the crib looks really nice I like it !",
      "rating": 5.0,
      "verified": true,
      "author": "hila",
      "helpful_votes": 0,
      "publication_date": 20180119
    },
    {
      "title": "We love this crib",
      "text": "We love this crib. Perfect size fits in our closet. No sense in getting a huge crib that they don't even need that large.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Venable",
      "helpful_votes": 2,
      "publication_date": 20171218
    },
    {
      "title": "Big waste of money",
      "text": "This crib was bought as a baby gift.but when opened it was the biggest scratched up cheap mess with pieces missing..l Put it out to the trash...would not purchase this again.",
      "rating": 1.0,
      "verified": true,
      "author": "Phyllis Wright",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "Very cute",
      "text": "Never had a mini crib before but I really like this. It's very cute and looks nice. Much preferred to the bigger bulkier cribs.",
      "rating": 5.0,
      "verified": true,
      "author": "FrickandMab",
      "helpful_votes": 0,
      "publication_date": 20181102
    },
    {
      "title": "Perfect!",
      "text": "It’s perfect and cute! The only reason I have it 4 stars was due to it being a little difficult to assemble.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180617
    },
    {
      "title": "Perfect in Every Way",
      "text": "This crib is the perfect size. It is sturdy and easy to assemble. I bought it for my newborn, but he is still in the bassinet. My almost two year old took to it. I may need to buy another one! You will need to invest in a separate mattress. I chose the 3 inch. This is well worth the price!",
      "rating": 5.0,
      "verified": true,
      "author": "Allison Daugherty",
      "helpful_votes": 0,
      "publication_date": 20190925
    },
    {
      "title": "difficult assembly",
      "text": "most of the crib went together great, the side rails on each side would not screw into one of the ends so i ended up superglueing the pieces to the legs but even that didnt completely fix it.",
      "rating": 3.0,
      "verified": true,
      "author": "Elizabeth",
      "helpful_votes": 0,
      "publication_date": 20200201
    },
    {
      "title": "Perfect",
      "text": "I don't have much room at my place. My daughter and I are currently sharing a small bedroom until her room is ready. Perfect fit, stylish, affordable, happy mama, happy baby.",
      "rating": 5.0,
      "verified": true,
      "author": "Brit",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "Cute crib!!",
      "text": "This is a great little crib! Very easy to put together and sturdy! I would definitely recommend this crib to anyone!! However I do suggest to buy a better mattress.",
      "rating": 5.0,
      "verified": true,
      "author": "Tabitha Dunlop",
      "helpful_votes": 8,
      "publication_date": 20160405
    },
    {
      "title": "Bottom 4 bolts are too short",
      "text": "Bolts at the bottom on each side are too short sucks I need this ASAP for my baby and have to wai",
      "rating": 5.0,
      "verified": true,
      "author": "Marie",
      "helpful_votes": 0,
      "publication_date": 20191106
    },
    {
      "title": "Great Quality",
      "text": "I love this crib. It's the perfect size for smaller spaces.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181124
    },
    {
      "title": "Great purchase so far will update when baby come to 5 stars if still awesome",
      "text": "Love my crib! Came earlier then expected which was awesome. I was little nervous due to some of the reviews regarding the crib missing pieces and no instructions. My crib came with no damage, all the pieces including the screws. My boyfriend set up with no problem🤔. Of course I’ll be purchasing a different mattress. But overall very happy 🙃",
      "rating": 4.0,
      "verified": true,
      "author": "Lexy",
      "helpful_votes": 0,
      "publication_date": 20180520
    },
    {
      "title": "Five Stars",
      "text": "So easy to put together and well worth the Money!",
      "rating": 5.0,
      "verified": true,
      "author": "Katy woods",
      "helpful_votes": 0,
      "publication_date": 20180910
    },
    {
      "title": "Pleased",
      "text": "Instructions not clear had to reassemble several time. Two person job. .Not much room fo older larger infants. Looks good when finished.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "Very sturdy, safe, and durable.",
      "text": "I bought this for my grand daughter. It was very easy to set up. It is very durable, and sturdy and it can be adjusted as they grow. The only thing I really don't like about it is the side cannot be lowered so it is not as easy to get the baby out. It is light weight and easy to move.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190118
    },
    {
      "title": "Poor customer service form the factory",
      "text": "I call the factory asked about the Extension bar with no answer",
      "rating": 1.0,
      "verified": true,
      "author": "Raid",
      "helpful_votes": 0,
      "publication_date": 20181223
    },
    {
      "title": "Affordable and looks amazing",
      "text": "This was a great choice for my little one!! I was weary at first, but after looking at the reviews we decided to try it. We are very satisfied and I am glad the product lived up to all its good reviews!",
      "rating": 5.0,
      "verified": true,
      "author": "Peter gutierrez",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Wrong color",
      "text": "I thought it was brown. Does not match anything in the room.",
      "rating": 1.0,
      "verified": true,
      "author": "Lisa Widner",
      "helpful_votes": 0,
      "publication_date": 20180926
    },
    {
      "title": "Space saver",
      "text": "Bedroom not very huge so this was definitely a great purchase. Very sturdy, fit room perfectly, all items to assemble were labeled clearly.",
      "rating": 5.0,
      "verified": true,
      "author": "Jose Ann Auguiste",
      "helpful_votes": 0,
      "publication_date": 20200125
    },
    {
      "title": "Mini crib",
      "text": "I love this little crip it is perfect for my granddaughter",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190925
    },
    {
      "title": "Great purchase",
      "text": "Great little crib fit perfectly in my tiny space. I bought another mattress cause the one it brings is not a mattress it's like a pad and highly uncomfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Arcenia hidalgo ",
      "helpful_votes": 0,
      "publication_date": 20191224
    },
    {
      "title": "Awesome crib",
      "text": "I never write reviews but I had to write one about this crib. I love it! It's the perfect size and it was really easy to put together. The only thing I need to get now is a bumper that fits this crib because I don't think a regular size one would fit. I would definitely recommend this crib!",
      "rating": 5.0,
      "verified": true,
      "author": "Kathryn Bravar",
      "helpful_votes": 0,
      "publication_date": 20190314
    },
    {
      "title": "No wheels so you have to lift it up.",
      "text": "Our bedroom is small but the crib is beautiful and my 3 months old likes it. I'm glad I ordered it.",
      "rating": 5.0,
      "verified": true,
      "author": "Marie Duvert Jonas",
      "helpful_votes": 0,
      "publication_date": 20190303
    },
    {
      "title": "Best purchase I’ve made, don’t regret one bit.",
      "text": "I wasn’t to sure about buying a crib in amazon but reading a few of the other reviews and now actually setting up the crib and using it it’s actually really good easy to assemble and very sturdy best purchase I’ve made.",
      "rating": 5.0,
      "verified": true,
      "author": "Karina",
      "helpful_votes": 0,
      "publication_date": 20190507
    },
    {
      "title": "Five Stars",
      "text": "Easy to assemble, just make sure you don't get it wrong with the screws!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20160331
    },
    {
      "title": "Great value for the money! Worth every penny!",
      "text": "It took my husband about 2 hours, but the insteuctions were clear and precise! It looks great and fit perfectly in our tiny room. I’m so excited to see my princess in it!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181118
    },
    {
      "title": "Cute and affordable",
      "text": "So one of the wood pieces came with a split but we just glued it up and all is well. Very sturdy and a few height options, so happy for my back",
      "rating": 5.0,
      "verified": true,
      "author": "cassy l cox",
      "helpful_votes": 0,
      "publication_date": 20181128
    },
    {
      "title": "Perfect Little Crib",
      "text": "Great little mini crib. Exactly what I wanted. Easy to assemble and fit perfectly in our small bedroom. No scratches or any issues.",
      "rating": 5.0,
      "verified": true,
      "author": "Jose Teran",
      "helpful_votes": 0,
      "publication_date": 20190309
    },
    {
      "title": "I loved this bed",
      "text": "I loved this bed and came to me in perfect condition without any damage or missing parts and easy to use",
      "rating": 5.0,
      "verified": true,
      "author": "adlan bashir",
      "helpful_votes": 0,
      "publication_date": 20190530
    },
    {
      "title": "Perfect mini-crib!",
      "text": "Perfect for a growing baby that’s not yet ready for their bigger crib.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristina Rienzi",
      "helpful_votes": 0,
      "publication_date": 20200228
    },
    {
      "title": "Beautiful crib, unbeatable price",
      "text": "The crib is absolutely beautiful! Works perfectly in the space!",
      "rating": 5.0,
      "verified": true,
      "author": "Ashleigh",
      "helpful_votes": 0,
      "publication_date": 20200205
    },
    {
      "title": "Good for value",
      "text": "Easy to assemble, does dent/scratch very easily. Had to purchase a different mattress as the one it came with was really thin.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190428
    },
    {
      "title": "Good quality",
      "text": "Looks great and is very sturdy. Only problem is that the pieces don’t line up correctly on the ends",
      "rating": 4.0,
      "verified": true,
      "author": "Kyla McNeill",
      "helpful_votes": 0,
      "publication_date": 20201020
    },
    {
      "title": "I love this crib",
      "text": "This crib is so cute and better quality them I thought it was going to be for the price... it was easy to put together and the directions were simple",
      "rating": 5.0,
      "verified": true,
      "author": "Ashlee Chambers",
      "helpful_votes": 0,
      "publication_date": 20191120
    },
    {
      "title": "We love this crib",
      "text": "We love this crib, perfect mini size, not sure how much longer my son will fit in it since he is 98 percentile long, but will definitely fine till 1st year mark .",
      "rating": 5.0,
      "verified": true,
      "author": "nesar",
      "helpful_votes": 0,
      "publication_date": 20180323
    },
    {
      "title": "Definitely a MUST!",
      "text": "This crib is so cute and little! The perfect size for an add on to mom and dads room. Very sturdy! Definitely worth every penny. We love it! Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Samantha Lee",
      "helpful_votes": 0,
      "publication_date": 20200303
    },
    {
      "title": "Absolutely perfect for small spaces!",
      "text": "I love the size of this crib. Perfect for my room",
      "rating": 5.0,
      "verified": true,
      "author": "Deb",
      "helpful_votes": 0,
      "publication_date": 20200214
    },
    {
      "title": "Five Stars",
      "text": "It’s the perfect crib for a small space. Absolutely gorgeous and easy to assemble",
      "rating": 5.0,
      "verified": true,
      "author": "heather",
      "helpful_votes": 0,
      "publication_date": 20180314
    },
    {
      "title": "This is a MINIATURE CRIB.",
      "text": "Beautiful crib...but TINY. Somehow I missed the word MINI in the product name. Returning.",
      "rating": 3.0,
      "verified": true,
      "author": "Jessica Taylor",
      "helpful_votes": 0,
      "publication_date": 20180529
    },
    {
      "title": "Its excellent, for small rooms",
      "text": "I use this product when my daughter bring my grandson to my house",
      "rating": 5.0,
      "verified": true,
      "author": "Maritza",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "Good material and cute",
      "text": "Perfect size for small spaces and so beautiful crib 👌🏻♥️",
      "rating": 5.0,
      "verified": true,
      "author": "Laura",
      "helpful_votes": 0,
      "publication_date": 20201019
    },
    {
      "title": "I love it !",
      "text": "It’s beautiful I love it !!! But, was missing a screw",
      "rating": 5.0,
      "verified": true,
      "author": "Amber2100",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "Sucked",
      "text": "Was not happy with it waste of time waste of money was too small",
      "rating": 1.0,
      "verified": true,
      "author": "Angel valdez",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "Too small",
      "text": "Didn't know that the mattress wasn't the same size as a normal crib. I thought it was longer than that. My son is 3 months and already almost to big for the crib.",
      "rating": 4.0,
      "verified": true,
      "author": "Samantha Cooper",
      "helpful_votes": 0,
      "publication_date": 20170624
    }
  ],
  "product_meta": {
    "title": "Dream On Me, Violet Mini Crib, Cherry",
    "description": "Color:CherryThe Violet/Piper 4-in-1 Convertible Mini Crib is the perfect nursery solution for small spaces and to keep pace with the changing needs of your growing child. Starting as a mini crib, you can convert it into a mini daybed and twin-size bed (bed rails sold separately).Built of solid pinewood, the Violet/Piper attracts with a flowing and curvy design. Minimalist with a small footprint, it is ideal to make the most of small spaces or when you are co-sharing with your baby. You can choose from six pleasant finishes and create a stylish space for your child.The Violet/Piper has a 3-position adjustable mattress height setting that you can adjust as your child grows. It comes with the regulatory 1” mattress pad. Choose a Dream On Me non-toxic, Greenguard Gold certified mini or portable crib mattress for a perfect fit.At Dream On Me we prioritize safety. All our cribs are JPMA certified and are tested for lead and other toxic elements to meet/exceed government and ASTM safety standards. Product dimensions are 42Lx25Wx36H inches. Maximum weight limit is 50 lbs. All tools/assembly instructions included.",
    "rating": 4.6,
    "feature_bullets": [
      "CONVERTIBILITY OPTIONS: The Violet/Piper 4-in-1 Convertible Mini Crib keeps pace with your growing child. Starting as a mini crib, you can convert it into a mini daybed and twin-size bed (bed rails sold separately)",
      "COMPACT DESIGN: Built of solid pinewood, it boasts a minimalist, flowing design. It occupies a small footprint, making it ideal for compact spaces or when you are co-sharing with your child. Choose from 6 pleasant finishes and design a chic space",
      "MATTRESS MATTERS: The Violet/Piper has a 3-position adjustable mattress height setting for adaptability. It comes with the regulatory 1” mattress pad. Choose a DOM non-toxic, Greenguard Gold certified mini or portable crib mattress for a perfect fit",
      "PRIORITIZING SAFETY: All our cribs are JPMA certified and are tested for lead and other toxic elements to meet or exceed applicable CPSC and ASTM safety standards",
      "PRODUCT SPECS: Product dimensions are 42Lx25Wx36H inches. The maximum weight limit is 50 lbs. All tools/assembly instructions included"
    ],
    "specifications": {
      "Product Dimensions": "42 x 25 x 36 inches",
      "Item model number": "631-C",
      "Is Discontinued By Manufacturer": "No",
      "Target gender": "Unisex",
      "Maximum weight recommendation": "35 Pounds",
      "Material Type": "Cherry",
      "Additional product features": "Convertible, Mini, Covertible",
      "Number Of Items": "1",
      "Style": "Crib",
      "Finish": "Cherry",
      "Batteries required": "No",
      "Dishwasher safe": "No",
      "Is portable": "No",
      "Item Weight": "30 pounds",
      "ASIN": "B00O64RCQ6",
      "Customer Reviews": "4.6 out of 5 stars440 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#10,157 in Baby"
    },
    "categories": [
      "Nursery",
      "Furniture",
      "Infant & Toddler Beds",
      "Baby Products",
      "Cribs",
      "Baby"
    ],
    "price": 149.99
  }
}