{
  "website_summaries": [
    {
      "verdict": "These bulbs make the appealing world of Philips Hue lighting more accessible than ever before. At $30 each, they're definitely worth considering.",
      "pros": [
        "The Philips Hue Lux LEDs don't change color, but they do offer an affordable smart lighting entry point",
        "Direct integration with IFTTT and a well-polished app make for a more feature-rich experience than you'll get with other kits"
      ],
      "cons": [
        "The Hue Lux LEDs aren't \"color tunable\" like some recent competitors, meaning that you're locked in at a yellowy 2,700 K"
      ],
      "aspects": {
        "Features": 8.0,
        "Usability": 9.0,
        "Design": 8.0,
        "Performance": 8.0
      },
      "publication_date": 20140821,
      "rating": 8.3,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Love The Features You Get For The Price Of A Normal LED Bulb",
      "text": "These Hue Lux lights are great, they are at the same price point as normal LEDs but you are able to control these from your phone and on top of that you can control the brightness. You do need to have the HUB in order to be able to control these lights though. If installing in any ceiling fans you do need to leave the switch on in order to be able to turn these on or off from your cell phone. These seem great for any kind of lamps that you can just leave plugged in.",
      "rating": 5.0,
      "verified": true,
      "author": "Aaron U.",
      "helpful_votes": 0,
      "publication_date": 20151110
    },
    {
      "title": "Amazing wireless bulbs",
      "text": "This is one of my great investments. Needed to install the bulbs where the ceiling fan is. Much much easier than getting up and turning the side lamp as they see pretty bright. You can install it for the side lamps too but they are better off for ceiling. The install and set up didn't take that long either. I bought an extra bulb since iI have 3 ceiling fan bulbs to replace. Even though iI was hoping them to be white lights as iI consider that more over yellow, iI was really glad with this. The bridge (connecting device it comes with) can be configured to add 50 bulbs. That's pretty good",
      "rating": 5.0,
      "verified": true,
      "author": "Mateen Rehman",
      "helpful_votes": 0,
      "publication_date": 20150908
    },
    {
      "title": "Best wireless bulbs currently on the market",
      "text": "Quantity in Use: 8 Time in Use: 3 months Connection: 100% Reliable Color: Excellent (2700K) Visible Flashing: None I have a number of other bulbs at two locations, but now that I have tried these I can't see myself buying anything else. Some bother my eyes and give me headaches from the rapid flashing. Others emit a green or pink hue. Still others struggle to connect to any my hubs randomly (Hue, Wink, SmartThings). These just work well in every way, every single time. Keep up the good work, Philips!",
      "rating": 5.0,
      "verified": true,
      "author": "Paul",
      "helpful_votes": 0,
      "publication_date": 20151217
    },
    {
      "title": "I absolutely love the hub and these bulbs",
      "text": "I absolutely love the hub and these bulbs. Never had trouble with setup from the starter kit to each individual bulb. It is super easy and fast. I have replaced over 10 bulbs in my home with these bulbs. Three lamps were on old Sentry darkness sensor boxes because I do not like having my house dark if I happen to be gone at night. I can control these bulbs from my smartphone through the Hue app and even downloaded the iConnectHue app (charge for this one) that gives me even greater control. Highly recommend. They are too cool!",
      "rating": 5.0,
      "verified": true,
      "author": "bmbutler",
      "helpful_votes": 0,
      "publication_date": 20150722
    },
    {
      "title": "Great Product- Will Hook you on Hue",
      "text": "Excellent product- easy to install and works perfectly. You must have a Philips bridge already in order to use this product, but at ~$20/bulb this is a steal when you are looking for affordable smart lighting. I specifically got several of these to use outside as patio lights when I was installing new fixtures. By using Hue Lux bulbs, I didn't have to run extra wires for switching all the bulbs together, but instead have combined them in a single group on the app and on my Hue Tap. My wife has been spoiled by these bulbs now, and we are slowly replacing other dumb LED or CFLs with them.",
      "rating": 5.0,
      "verified": true,
      "author": "GWilliams",
      "helpful_votes": 0,
      "publication_date": 20150929
    },
    {
      "title": "Great addition to the starter kit if you need more than the two that came with it!",
      "text": "I bought the Philips Hue starter kit that came with the base and two bulbs, but the fixture above my counter has 3 bulbs! D'oh! Well, I Prime'd another bulb to the house, stuck it in the socket, fired up the app and added this to my \"scenes\" and I was in business! Now I had 3 Hue lights to control and it was a snap! I've just got some simple timers/scenes setup, but the first two have been running flawlessly since March, so I'm looking forward to these lasting a long time!",
      "rating": 5.0,
      "verified": true,
      "author": "Kaizoku!",
      "helpful_votes": 0,
      "publication_date": 20151016
    },
    {
      "title": "Great Affordable Solution for Stepping into the Smart Home Game",
      "text": "I own (7) of these. They are absolutely wonderful. We had paired them with our Amazon Echo and now most of the lights in the main areas of the house are voice controlled. The only issue is that if you have them installed on lights that are also controlled by light switch, it is actually an inconvenience to use them because you have to make sure the switch is turn to the \"on\" position before being able to control these via phone or Echo.",
      "rating": 5.0,
      "verified": true,
      "author": "Max AMillion",
      "helpful_votes": 0,
      "publication_date": 20160127
    },
    {
      "title": "Great balance of features and affordability for wireless controlled LED bulb.",
      "text": "So interesting that a light bulb has somehow made my life better. I have this paired with Samsung's SmartThings Home monitoring and a door sensor in both our pantry and closet. When the doors open, the light turns on. Sounds silly and lazy, but once you get used to it, it's a lot of fun and highly practical. No more blindly reaching for the pull cord while your hands are full.",
      "rating": 5.0,
      "verified": true,
      "author": "Lee C. Howley",
      "helpful_votes": 0,
      "publication_date": 20160420
    },
    {
      "title": "Works great with Amazon Echo",
      "text": "I have two ceiling fans, each with 3 lights, in my living room. One of them the remote light switch went out so I got 3 Hue Lux lights to fix that problem. We then got an Amazon Echo and 3 more of these lights for the other half of the room. Now we can say \"Alexa, living room lights on/off\" and they all turn on or off. It really is neat.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew Madden",
      "helpful_votes": 0,
      "publication_date": 20151013
    },
    {
      "title": "Dim On Command",
      "text": "Although I have had one of these lights arrive broken, they work well with the Amazon Echo. You can name different groups of lights to control specific groupings, and the Amazon Echo will recognize the custom names for the light groupings. The lights are able to be dimmed to a specific brightness by saying a percentage to the Amazon Echo. The lights are incredibly simple to set up, but these lights do not work without the starter set.",
      "rating": 5.0,
      "verified": true,
      "author": "Pierce Lilholt",
      "helpful_votes": 0,
      "publication_date": 20151014
    },
    {
      "title": "Great for low traffic areas like in the Garage",
      "text": "Great for places you don't really need color bulbs at like garage and light traffic areas. I have been using this bulb for awhile and haven't had any complaints I love Philips Hue bulbs this one is nice due to the price. I have had one outside in a lamp post for over several months in the heat and cold no issues. Philips Hue doesn't recommend this for outdoor use but so far no issues",
      "rating": 4.0,
      "verified": true,
      "author": "CrazyShopper918",
      "helpful_votes": 0,
      "publication_date": 20151003
    },
    {
      "title": "\"Regular\" Bulb Compatible with HUE System",
      "text": "I purchased this bulb to add to my existing HUE light system in an outside post light. The bulb works well in a post light and is compatible with HUE's geofencing options. These bulbs are a less expensive alternative to standard HUE color changing lights for applications where you do not need/want to change the light color.",
      "rating": 4.0,
      "verified": true,
      "author": "Jamsmith",
      "helpful_votes": 0,
      "publication_date": 20160202
    },
    {
      "title": "Great bulbs for those who do not crave colour",
      "text": "If you're not into colour then these offer a considerably cheaper alternative for operating your lights remotely. However, if you also spell \"colour\" the way I do, then I recommend that you do not buy as they will last approximately one hour before going pop. Should have read the description a little more closely - 110V only. Duh.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark Read",
      "helpful_votes": 0,
      "publication_date": 20151122
    },
    {
      "title": "Wonderful Smart LED Bulbs",
      "text": "Setup is effortless and the color temperature of the light is spot on, adding a comfortable warmth to any room. The dimming (through the app) is smooth and the bulbs have a nice solid, tough build to them so they feel like they won't break easily if knocked against a light fixture during installation. I highly recommend the Hue series (both color and Lux variants).",
      "rating": 5.0,
      "verified": true,
      "author": "M. Thomas",
      "helpful_votes": 0,
      "publication_date": 20151105
    },
    {
      "title": "... aware of what you are getting these are an excellent product. I can see how it might not ...",
      "text": "If you are aware of what you are getting these are an excellent product. I can see how it might not meet some expectations though as the temperature of the light and the number of lums produced is not quite the same as a standard 60 watt bulb. however when integrated into a smart home solution you will soon forget about it and you light switches.",
      "rating": 5.0,
      "verified": true,
      "author": "Monty",
      "helpful_votes": 0,
      "publication_date": 20160315
    },
    {
      "title": "it has worked great. I love that I can set it with ...",
      "text": "Works perfectly with Amazon Echo. It did took me a while to figure out how to get Alexa to turn on all four bulbs in my room at once because neither Philips Hue or Amazon Echo believe in installation guides. (In case anyone is wondering, go to the Alexa app, settings, and you can create groups so that they turn on/off at once). Once I did figure everything out, it has worked great. I love that I can set it with my alarm so that my lights turn on after my usual 10 minute snooze. (Now I don't get to continue to hit the snooze button).",
      "rating": 5.0,
      "verified": true,
      "author": "Maggie Lu",
      "helpful_votes": 0,
      "publication_date": 20150913
    },
    {
      "title": "Amazon packaging could be better.",
      "text": "I love the lights, but Amazon needs improvement on packaging and shipping. I ordered a few lights, and one of the lights was broken in the box. You can hear the shards rattling in the box. I bet they left the distribution center that way. The other lights seemed to be fine and do light up. As far as the lights themselves they are great.",
      "rating": 5.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 0,
      "publication_date": 20151124
    },
    {
      "title": "This used to be a great product, but",
      "text": "This used to be a great product, but, in an attempt to increase profits, a recent update by Philips has (intentionally) caused it to no longer work with many lightbulbs that it was advertised to work with. I recommend not buying any Philips Hue systems until they reverse this stance.",
      "rating": 1.0,
      "verified": true,
      "author": "River",
      "helpful_votes": 12,
      "publication_date": 20151214
    },
    {
      "title": "Works pretty good, but isn't perfect.",
      "text": "Works great with my Echo most of the time. I'm only giving 4 stars because I bought four of them and one of them sometimes doesn't come on when I instruct Alexa to turn it on. I have to unscrew the bulb and screw it back in for it to work. They're too expensive to be so flaky.",
      "rating": 4.0,
      "verified": true,
      "author": "Wendy Loo Hoo",
      "helpful_votes": 0,
      "publication_date": 20160314
    },
    {
      "title": "Bulbs that emit a pleasant and warm white light.",
      "text": "Bulbs emit a pleasant and warm white light. I use them in my family room and master bedroom. They are hooked up to my Amazon Echo and perform flawlessly over my wifi. I also use them via the Hue remote app on my IPhone without any issues. I appreciate that they are dimmable, especially in the bedroom.",
      "rating": 5.0,
      "verified": true,
      "author": "MMonty",
      "helpful_votes": 0,
      "publication_date": 20151016
    },
    {
      "title": "Easy setup, no problems!",
      "text": "Setup for these lights was really easy, just screw them in, turn them on, and press the big button on the hub. My Echo found them easily and I was able to control them by voice, too... everything took about 30 seconds. The longest part was putting the lamps I installed the bulbs in where I wanted them!",
      "rating": 4.0,
      "verified": true,
      "author": "Jeffrey Dore",
      "helpful_votes": 0,
      "publication_date": 20150918
    },
    {
      "title": "Good lights. Connect easily and controllable via the Hue ...",
      "text": "Good lights. Connect easily and controllable via the Hue app. Unfortunately these lights do not have an adjustable light temperature. They are stuck at 2700k, which is a bit more yellow than I would like. It would be much more pleasing if the temperature was adjustable.",
      "rating": 3.0,
      "verified": true,
      "author": "Gil B.",
      "helpful_votes": 0,
      "publication_date": 20151211
    },
    {
      "title": "Discontinued and Overpriced. Do Not Buy!",
      "text": "This is a discontinued bulb, 250% more expensive than the brighter replacement the \"Hue White Bulb\" and more expensive than the \"Hue White Ambiance\" which features adjustable color temperature.",
      "rating": 1.0,
      "verified": true,
      "author": "Ryan",
      "helpful_votes": 0,
      "publication_date": 20160825
    },
    {
      "title": "Pretty cool. Love th a team I can use ...",
      "text": "Pretty cool. Love th a team I can use my echo to control them. Either I don't know how or you can't but I wish I could connect to them from outside my house. If I could control from anywhere then it would be a 5 star.",
      "rating": 4.0,
      "verified": true,
      "author": "Ron Johnson",
      "helpful_votes": 0,
      "publication_date": 20151107
    },
    {
      "title": "Hue no longer Zigbee compatible",
      "text": "Up until yesterday the Hue system was great. However they've pushed an update that now blocks any lights that aren't from Philips or their \"Friends of Hue\" approved list. This includes the great and cheap GE Link lights. They're essentially breaking the promise that they are a Zigbee compatible bridge. If you want to use other Zigbee devices, you can no longer use Hue's Hub to control them. So Even though I just bought this, I now have to shell out more money for a Wink or Smartthings hub because Philips got greedy. I will no longer be purchasing Philips Hue products as they have now shown they are willing to remove currently working features from devices you already own.",
      "rating": 1.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 14,
      "publication_date": 20151212
    },
    {
      "title": "Poorly implemented.",
      "text": "Does dim, but HUE app rarely works despite numerous attempt to fix it. Stay away from HUE.",
      "rating": 2.0,
      "verified": true,
      "author": "DBrown",
      "helpful_votes": 0,
      "publication_date": 20180618
    },
    {
      "title": "Awesome light bulb",
      "text": "Absolutely love these lights. They are priced great if you don't want the color changing ones. I actually got 2 bulbs and 1 was broken (shattered) and they sent new one out that day. Great service as well!",
      "rating": 5.0,
      "verified": true,
      "author": "Ted C Lisby",
      "helpful_votes": 0,
      "publication_date": 20150728
    },
    {
      "title": "Love this with my amazon echo",
      "text": "Love these! I have them set up and connected with my amazon echo controlling my living room, kitchen, bedroom and hallway! Awesome system and easy to set up. Had the whole system running in less than five minutes. I Highley recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Scott in OK",
      "helpful_votes": 0,
      "publication_date": 20150925
    },
    {
      "title": "Works great with alexa",
      "text": "Works great with alexa. I love the ability to dim my lights with my voice. Set up really easily and quickly with Hue Bridge and Alexa Note: does not work with a traditional dimmer switch, the light will flicker when dimmer is not at full power.",
      "rating": 5.0,
      "verified": true,
      "author": "camerin hahn",
      "helpful_votes": 0,
      "publication_date": 20151105
    },
    {
      "title": "I really like it.",
      "text": "I know I'm being spoilt, but it's so nice to turn a light on or off using wifi & not having to be right in the same room. It's particularly handy at night when you're avoiding turning on hall lights & waking everyone up.",
      "rating": 5.0,
      "verified": true,
      "author": "Sherry Kefauver",
      "helpful_votes": 0,
      "publication_date": 20150812
    },
    {
      "title": "Buy this light bulb",
      "text": "I like having the ability to dim the lights because I have several friends who are, shall we say, fugly in normal lighting. This handy item helps minimize unsightly blemishes and faces. You should buy it!",
      "rating": 5.0,
      "verified": true,
      "author": "John M Kasher",
      "helpful_votes": 0,
      "publication_date": 20151204
    },
    {
      "title": "I put these to the lights that I turn on ...",
      "text": "I put these to the lights that I turn on at night while sleeping. It has ambient colors that help my little girls to the sleep. I am planning on putting some of these to my enclosed outdoor lights so that I can change colors for the seasonal holidays.",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony H.",
      "helpful_votes": 0,
      "publication_date": 20151017
    },
    {
      "title": "great product and works great",
      "text": "great product and works great ...pnly reason for not giving 5 stars is the fact that i can't program all the lights together if i have more than 2 in the app - i have to manually turn them on",
      "rating": 4.0,
      "verified": true,
      "author": "Mc",
      "helpful_votes": 0,
      "publication_date": 20151118
    },
    {
      "title": "Simple smart lighting",
      "text": "Product arrived on time and in excellent condition. This light is very easy to set up and connect through the Phillips hub. Works with my iPhone and Amazon Echo.",
      "rating": 5.0,
      "verified": true,
      "author": "epivicar",
      "helpful_votes": 0,
      "publication_date": 20160406
    },
    {
      "title": "I love the Hue products",
      "text": "I love the Hue products. I have them set up thru my hub and have added lights as necessary. Also like that I can control the Hue lights thru Amazon Echo.",
      "rating": 5.0,
      "verified": true,
      "author": "Team T",
      "helpful_votes": 0,
      "publication_date": 20150831
    },
    {
      "title": "A+++ Product.. adding more all the time",
      "text": "These are not the full color range, and that's fine for bathroom, laundry room lighting.. they're more affordable if you just want the convenience of remote control, and bright light.",
      "rating": 5.0,
      "verified": true,
      "author": "The Judge",
      "helpful_votes": 0,
      "publication_date": 20160120
    },
    {
      "title": "Perfect for a kid's room!",
      "text": "We put these in our daughter's room. She loves the colors and making the room look totally different. It's a really fun play thing for the room and we have it set as an alarm to start waking her up in the mornings.",
      "rating": 5.0,
      "verified": true,
      "author": "John A. Cashman",
      "helpful_votes": 0,
      "publication_date": 20151022
    },
    {
      "title": "Great bulbs, not so great app",
      "text": "These bulbs are great. I have a bunch of them. The app kind of sucks a little though. I mainly use the SmartThings controler, rather than the hue app which tends to crash.",
      "rating": 5.0,
      "verified": true,
      "author": "Justin H",
      "helpful_votes": 0,
      "publication_date": 20160427
    },
    {
      "title": "Works fine in a mixed environment with Hue color bulbs and ...",
      "text": "I use these in fixtures that don't have dimmers, and you can dial-in exactly the light level you require with the app. Works fine in a mixed environment with Hue color bulbs and Friends of Hue strips.",
      "rating": 4.0,
      "verified": true,
      "author": "Tim J. Thomas",
      "helpful_votes": 0,
      "publication_date": 20150915
    },
    {
      "title": "It does what is says it does!",
      "text": "What WeMo should of been! This stuff really works! The geo-fencing is great. Can't say enough good about this. Spent the money on WeMo only to be disappointed, so went ahead and got this and it really, really, works!",
      "rating": 5.0,
      "verified": true,
      "author": "Joe H3",
      "helpful_votes": 0,
      "publication_date": 20150803
    },
    {
      "title": "Near effortless home lighting automation",
      "text": "Excellent products. App is decent BUT I somehow got locked out of it. Even on my home wifi it's telling me I'm not on home wifi and can't access the alarms and timers. So has to use a different device to recalibrate. I reset bridge and deleted app and still same issue. Other than that it has eased my worries!",
      "rating": 4.0,
      "verified": true,
      "author": "Kieran",
      "helpful_votes": 0,
      "publication_date": 20150921
    },
    {
      "title": "Bright Idea",
      "text": "The price is the sweet spot. I'm using these in the bathrooms with onein the fixture so I can set a mood (turn off or dim the lux bulbs) but not break the bank in a small room.",
      "rating": 5.0,
      "verified": true,
      "author": "JPR",
      "helpful_votes": 0,
      "publication_date": 20151024
    },
    {
      "title": "Great price for a Hue bulb!",
      "text": "Great price on these wonderful bulbs. These are just the regular white bulbs and won't do any of the fancy scene settings but I find myself not using the scene that much anyways.",
      "rating": 5.0,
      "verified": true,
      "author": "Ron T  Brown",
      "helpful_votes": 0,
      "publication_date": 20150705
    },
    {
      "title": "Five Stars",
      "text": "Great cheaper alternative to the normal Hue bulbs if you're not interested in your kitchen ever being oppressively purple.",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony Grimes",
      "helpful_votes": 0,
      "publication_date": 20150919
    },
    {
      "title": "If you don't want color for the rest of the ...",
      "text": "If you don't want color for the rest of the home get it. Quick set up (I got the starter color pack first).",
      "rating": 5.0,
      "verified": true,
      "author": "SoundStream6",
      "helpful_votes": 0,
      "publication_date": 20151113
    },
    {
      "title": "Great non color option for the more boring of light automation needs! :)",
      "text": "If you want to have some automation fun with your lighting but don't need color and don't want to swap out switches (we are renting) this is a great option.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20150926
    },
    {
      "title": "Like this product with my Amazon Echo.",
      "text": "I have this bulb and the Amazon Echo, it is great. \"Alexa turn on the living room lights\" Ha Ha",
      "rating": 5.0,
      "verified": true,
      "author": "Richard S. Jackson",
      "helpful_votes": 0,
      "publication_date": 20151124
    },
    {
      "title": "Not Bad",
      "text": "These are cool. I( have 2, both in my living room that I control with both my Harmony Hub and with Amazon Echo. My only disappointments were having to buy an additional Hue Hub and I also thought they came in color which these ones do not.",
      "rating": 3.0,
      "verified": true,
      "author": "Kenneth B.",
      "helpful_votes": 0,
      "publication_date": 20151029
    },
    {
      "title": "I love these things",
      "text": "These bulbs, and my Echo have changed my life. I love these things!",
      "rating": 5.0,
      "verified": true,
      "author": "Lancifer",
      "helpful_votes": 0,
      "publication_date": 20160822
    },
    {
      "title": "great smart bulbs",
      "text": "great smart bulbs, responds much quicker than the competition. Can't wait for the new versions, will be retrofitting all my a19's with them.",
      "rating": 5.0,
      "verified": true,
      "author": "Tom Lin",
      "helpful_votes": 0,
      "publication_date": 20151106
    },
    {
      "title": "Has a nice warm white color",
      "text": "Has a nice warm white color, but my first bulb didn't even last a year. Blinked out after 9 months. I expect better quality for such a high price.",
      "rating": 3.0,
      "verified": true,
      "author": "Tanner Henderson",
      "helpful_votes": 0,
      "publication_date": 20160330
    },
    {
      "title": "Five Stars",
      "text": "I LOVE THESE with the new Amazon Echo! They work GREAT! Highly recommended with ALEXA!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Joel K.",
      "helpful_votes": 0,
      "publication_date": 20150709
    },
    {
      "title": "Five Stars",
      "text": "I have several of these and all have preformed perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark Harris",
      "helpful_votes": 0,
      "publication_date": 20151203
    },
    {
      "title": "Works with Amazon Echo",
      "text": "Using these all over the house now, works great with Amazon echo to turn on and off lights with voice commands!",
      "rating": 5.0,
      "verified": true,
      "author": "Ekbruster",
      "helpful_votes": 0,
      "publication_date": 20150701
    },
    {
      "title": "Good Lights",
      "text": "I like the Hue lights. Alexa seems to have a good relationship with them, so I love them. The light is a nice color.",
      "rating": 5.0,
      "verified": true,
      "author": "Lance",
      "helpful_votes": 0,
      "publication_date": 20150829
    },
    {
      "title": "Five Stars",
      "text": "Use the Hue colored lights a lot. This works very well for utility lighting when no colors are needed.",
      "rating": 5.0,
      "verified": true,
      "author": "billy on bass",
      "helpful_votes": 0,
      "publication_date": 20150912
    },
    {
      "title": "Nice!",
      "text": "These lights work so well with the HUE App. Really enjoy the control of the lights from a distance.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20150812
    },
    {
      "title": "Great Product!",
      "text": "Love this light bulb. Just wish it didn't cost so much. Combine this with Amazon Echo and it's a great product.",
      "rating": 4.0,
      "verified": true,
      "author": "Thomas",
      "helpful_votes": 0,
      "publication_date": 20150927
    },
    {
      "title": "awsome!",
      "text": "Works great with echo! Doesn't change color but is brighter than the color changing bulbs!",
      "rating": 5.0,
      "verified": true,
      "author": "Nick",
      "helpful_votes": 0,
      "publication_date": 20151106
    },
    {
      "title": "It's fine with SmartThings",
      "text": "I think this bulb is very good on my SmartThings system and I got them for a specific purpose. I am using them in standup floor lamps that you can easy see the bulb exposed because of the multilevel home I am in. I used GE Links but visually they are not as aesthetically appealing with the light on because of the clear glass exposing the LED's. I don't plan on getting any more of this bulb because of the relatively higher price compared to mywhich were only $11 on sale. But for an application where it is exposed to the naked eye it looks much better. So I had to take off one star for the price.",
      "rating": 4.0,
      "verified": true,
      "author": "DaleC",
      "helpful_votes": 0,
      "publication_date": 20160215
    },
    {
      "title": "Regretting Hue Purchase",
      "text": "As with the starter pack interface mess, adding lights gets even more complicated.",
      "rating": 3.0,
      "verified": true,
      "author": "Jimmy L.",
      "helpful_votes": 0,
      "publication_date": 20150913
    },
    {
      "title": "The future is here..",
      "text": "So nice to just tell \"Alexa\" to turn light on or off.",
      "rating": 5.0,
      "verified": true,
      "author": "qwert",
      "helpful_votes": 0,
      "publication_date": 20151123
    },
    {
      "title": "Great bulb, responsive to Amazon Echo and hue apps",
      "text": "Great bulb, responsive to Amazon Echo and hue apps. Also much brighter than I expected. I had 2 flourescent bulbs in the kitchen which were 1-2 years old. But this one bulb was brighter than those two.",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan A Mull",
      "helpful_votes": 0,
      "publication_date": 20150703
    },
    {
      "title": "Excellent product",
      "text": "Works great with the Echo, I kust wish they came in a 75 watt version.",
      "rating": 4.0,
      "verified": true,
      "author": "Peter",
      "helpful_votes": 0,
      "publication_date": 20151106
    },
    {
      "title": "Perfect complement for not 'color-ish' places if you have a color hue system...",
      "text": "If you have the HUE system this bulb is perfect to complement in those places where color is not needed.",
      "rating": 5.0,
      "verified": true,
      "author": "SIMON",
      "helpful_votes": 0,
      "publication_date": 20150926
    },
    {
      "title": "Quality bulb - expensive but that is because of LUX IOT connection",
      "text": "Works as advertised. I still think the LUX software could be made easier to work with (IFTT).",
      "rating": 4.0,
      "verified": true,
      "author": "Coru",
      "helpful_votes": 0,
      "publication_date": 20151111
    },
    {
      "title": "Five Stars",
      "text": "such a great value, bulb and a remote. Easily added both to my philips hue hub.",
      "rating": 5.0,
      "verified": true,
      "author": "Jonathan I",
      "helpful_votes": 0,
      "publication_date": 20160118
    },
    {
      "title": "Five Stars",
      "text": "Easy to set up , easy to use and once again LOVE IT WITH MY ECHO.....",
      "rating": 5.0,
      "verified": true,
      "author": "Troy J. Wells",
      "helpful_votes": 0,
      "publication_date": 20151126
    },
    {
      "title": "Worked for a while then stopped",
      "text": "Seemed to work for about two months, then it stopped working. It just turns off right after you power it up. Philips support didn't return my email and Amazon say item is not eligible for return",
      "rating": 2.0,
      "verified": true,
      "author": "Stan Hudecek",
      "helpful_votes": 0,
      "publication_date": 20160626
    },
    {
      "title": "Five Stars",
      "text": "Very strong and the nice color of LED bulb very useful",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160630
    },
    {
      "title": "Nice soft white color, simple to pair with hub",
      "text": "Great natural soft light color. Works with SmartThings hub. Super easy to set up compared to other products.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Mcniel",
      "helpful_votes": 0,
      "publication_date": 20160324
    },
    {
      "title": "Five Stars",
      "text": "I bought this for my mother. She hasn't has any complaints yet",
      "rating": 5.0,
      "verified": true,
      "author": "Jared",
      "helpful_votes": 0,
      "publication_date": 20160310
    },
    {
      "title": "Warm Color",
      "text": "Instant on and off, warm color unlike fluorescents. Quality construction.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric",
      "helpful_votes": 0,
      "publication_date": 20151013
    },
    {
      "title": "Lighting your house remotely",
      "text": "We now have 3 lights throughout the house. Wonderful way to remotely control your lights.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160327
    },
    {
      "title": "Good product. I have 26 of them",
      "text": "Good product. I have 26 of them. They are $$$$ but work well.",
      "rating": 4.0,
      "verified": true,
      "author": "GA Mnt Guy",
      "helpful_votes": 0,
      "publication_date": 20160406
    },
    {
      "title": "Five Stars",
      "text": "Love them! And they are 100ft from the Hue bridge!!",
      "rating": 5.0,
      "verified": true,
      "author": "Christi Hanley",
      "helpful_votes": 0,
      "publication_date": 20160823
    },
    {
      "title": "Get one. you will like it.",
      "text": "Works great, looks great. Only objection: wish it were cheaper.",
      "rating": 5.0,
      "verified": true,
      "author": "Bibli Ophile",
      "helpful_votes": 0,
      "publication_date": 20150720
    },
    {
      "title": "Phillips Hue Is Worth Investment",
      "text": "These are great bulbs. So many options and settings with your smart phone. You do need a bridge from Phillips first. It's a great set to invest in.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 0,
      "publication_date": 20151213
    },
    {
      "title": "Five Stars",
      "text": "Excellent bulb. I use these everywhere I don't want to use the higher priced color bulbs.",
      "rating": 5.0,
      "verified": true,
      "author": "Lance Kragenbrink",
      "helpful_votes": 0,
      "publication_date": 20170517
    },
    {
      "title": "Shame of you Philips",
      "text": "Do not buy this hub and stay away from Philips Hue. In their recent update, they decided to block all third party bulbs, destroying countless of setups and bulbs! Do not buy!",
      "rating": 1.0,
      "verified": true,
      "author": "Daniel M",
      "helpful_votes": 7,
      "publication_date": 20151215
    },
    {
      "title": "Lost connection and couldn't reset",
      "text": "I lost connection with the lamp after 2 days and couldn't connect again",
      "rating": 1.0,
      "verified": true,
      "author": "Ayman",
      "helpful_votes": 0,
      "publication_date": 20160704
    },
    {
      "title": "Five Stars",
      "text": "Awesome light bulb & looked very nice in any room of the house.",
      "rating": 5.0,
      "verified": true,
      "author": "Bernard D.",
      "helpful_votes": 0,
      "publication_date": 20150721
    },
    {
      "title": "Good product, works well with Echo.",
      "text": "Running these with my Amazon Echo. Works great! Some issues getting them to initially connect, but not too much trouble at all.",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan Turner",
      "helpful_votes": 0,
      "publication_date": 20150919
    },
    {
      "title": "If you just put this bulb into your socket, ...",
      "text": "If you just put this bulb into your socket, it will work. Connecting to your wink, not so much. You need additional purchases for this to work that way. Riding the way of profits by non-standards. Until you're committed to spend 200$ and just go with Philips from now on, stay away",
      "rating": 1.0,
      "verified": true,
      "author": "Erik",
      "helpful_votes": 0,
      "publication_date": 20151114
    },
    {
      "title": "Good buy!",
      "text": "First thing... if you are deciding between Philips Hue and Wemo Bulbs, it isn't even a fair match. I am a long time Wemo user and take it from me, their bulbs are horrendous in terms connectivity. Just go with Philips to get seamless setup & performance rather than months of disappointment & headache. Beyond that, Philips has essentially been a set it and forget it situation. The only thing I miss is the ability to set sunrise & sunset times.",
      "rating": 5.0,
      "verified": true,
      "author": "bszen27",
      "helpful_votes": 7,
      "publication_date": 20150709
    },
    {
      "title": "Works well with Amazon Echo",
      "text": "Works well with the Amazon Echo. The Echo found several of these bulbs easily and they can now be controlled by voice from the Echo.",
      "rating": 5.0,
      "verified": true,
      "author": "Sting J",
      "helpful_votes": 2,
      "publication_date": 20150711
    },
    {
      "title": "Five Stars",
      "text": "Saves on our electric bill some 30.00 a month. We have 3 Philips LUX White LED's.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160430
    },
    {
      "title": "No color - be careful",
      "text": "Be careful - I ordered 4 of these and was expecting them to be just like the Hue Blooms - these are ONLY white light; no spectrum of color. It's basically a smart, regular bulb that you can tie into your existing Hue bridge. Nothing wrong with them - just a tad bit expensive. Update: I'm not sure what the range should be - but I'm unable to control this bulb from a room that is roughly 35 feet from the bridge.",
      "rating": 3.0,
      "verified": true,
      "author": "vjnnc",
      "helpful_votes": 0,
      "publication_date": 20150916
    },
    {
      "title": "They work well and have a nice warm color",
      "text": "They work well and have a nice warm color. Glad they priced these properly and made them somewhat affordable to place throughout the home.",
      "rating": 5.0,
      "verified": true,
      "author": "David A. Wortz",
      "helpful_votes": 0,
      "publication_date": 20150809
    },
    {
      "title": "good lights bad controllers...",
      "text": "i got the lights to work with echo but i found the process connecting them to echo to be difficult it took about 30 times of searching before they were recognized. Often they loose connectivity with exho and the phollips bridge. Hopefully there will be a software update out soon to resolve this issue. rhe lifhts themselves are great.",
      "rating": 3.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20150605
    },
    {
      "title": "Nice while it lasted, too bad the quality is so crappy",
      "text": "The light bulb started flashing after 3 weeks of use. I waited a few too many days to return it so now I cant and I'm stuck with a super expensive and useless bulb.",
      "rating": 1.0,
      "verified": true,
      "author": "Angel Lugo",
      "helpful_votes": 0,
      "publication_date": 20150705
    },
    {
      "title": "This order is not what I thought it would be ...",
      "text": "This order is not what I thought it would be and I think you need to buy it with a main system, so it's misleading. I haven't been able to use the bulb",
      "rating": 1.0,
      "verified": true,
      "author": "ARI ",
      "helpful_votes": 0,
      "publication_date": 20160304
    },
    {
      "title": "One Star",
      "text": "I don't like it I have to have the hub to make it work with my phone",
      "rating": 1.0,
      "verified": true,
      "author": "tay29",
      "helpful_votes": 2,
      "publication_date": 20150925
    },
    {
      "title": "Do not use the US version in Europe! Amazon doesn't alert about it!",
      "text": "A friend from US wanted to bring me Philips Hue LUX as a present. I live in Europe. Despite the voltage is specified, in any moment it alerts about the risk of use it in Europe, and you can even buy this product in US and receive it in Europe (just tried). As result, lights worked for 30 minutes, then start flashing and finally dead. Very dissapointed as it was a very nice present for a geek but completely useless because miss of information in the site.",
      "rating": 1.0,
      "verified": true,
      "author": "Javier Campos",
      "helpful_votes": 0,
      "publication_date": 20150623
    }
  ],
  "product_meta": {
    "title": "Philips Hue 433714 4PKAMBNCECLR KIT LUX LED Smart Light Bulb, Dimmable, Works with Amazon Alexa",
    "description": "Automate your lights for peace of mind. Add a Philips Hue white bulb to your system and enhance your home with soft white lighting that you can dim and control remotely. Automate your lights to make it seem like you’re home when you’re not or set timers.",
    "rating": 4.1,
    "feature_bullets": [
      "Works with Alexa for voice control (hub required, Alexa device and hub sold separately).",
      "Automate your lighting experience with Philips Hue and control your lights from home or away. Create light schedules from the Philips Hue App and never come home to a dark house.",
      "Requiring the Philips Hue Bridge (sold separately) for the full Hue experience, this bulb fits standard-size table lamps.",
      "Install the LED light as you would install ordinary bulbs and pair it with the Hue Bridge, which allows you to control smart-bulb-equipped lamps and overhead lights via the Philips Hue App.",
      "Easily expand your lighting system with accessories (sold separately), such as a Hue Dimmer Switch, Hue Tap, or Hue Motion Sensor. Pair it for automation with your existing Nest or SmartThings system."
    ],
    "specifications": {
      "Manufacturer": "CQMTO",
      "Part Number": "433714",
      "Item Weight": "2.11 ounces",
      "Product Dimensions": "2.3 x 2.3 x 4.2 inches",
      "Item model number": "433714",
      "Is Discontinued By Manufacturer": "No",
      "Color": "4.2",
      "Style": "Lux Single Bulb",
      "Material": "Cermet",
      "Shape": "A19",
      "Voltage": "120 Volts",
      "Wattage": "9",
      "Item Package Quantity": "1",
      "Number Of Pieces": "1",
      "Type of Bulb": "LED",
      "Luminous Flux": "750",
      "Certification": "Certified frustration-free",
      "Usage": "Indoor use only",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "Warranty Description": "2 year warranty, see package for details.",
      "ASIN": "B00O0EZ94O",
      "Customer Reviews": "4.1 out of 5 stars152 ratings4.1 out of 5 stars",
      "Best Sellers Rank": "#315,678 in Health & Household",
      "Date First Available": "September 29, 2014"
    },
    "categories": [
      "Tools & Home Improvement",
      "LED Bulbs",
      "Light Bulbs"
    ],
    "price": ""
  }
}