{
  "website_summaries": [
    {
      "verdict": "This leather-like case is sleek and professional-looking.  Offers superior shock resistance while resembling a fancy portfolio",
      "pros": [
        "Ruggedly handsome",
        "Top and bottom are padded for added layers of shock absorption and durability",
        "Small built-in stand along the bottom allows for a more comfortable and ergonomic position during use"
      ],
      "cons": [
        "Some owners have complained that the magnetic closure snap is too close to the touch pad"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Quality A+",
      "text": "I've had this for almost a full year now and Im still using it! They quality is excellent and the price is fantastic! You cannot go wrong. It fits perfectly and has never come off or started to fray, peel, etc. It looks brand new still. The color doesn't fade and the feel is very soft and comfortable. I like to tuck in the little snap flap when my computer is in use and it tucks away nicely underneath the mousepad area.",
      "rating": 5.0,
      "verified": true,
      "author": "katherine gaddy",
      "helpful_votes": 0,
      "publication_date": 20200812
    },
    {
      "title": "Does not fit MacBook Air 13in 2020",
      "text": "It does not fit my 2020 MacBook Air. I have to have the screen leaning towards me in order for the bungee straps to hold, however, by leaning it the screen is in a weird position for me to use. The fit is completely off. Material is cheap. The cover is the rose quartz thought it would be Matte but it’s shiny making it look even more cheap. Overall, disappointing. Not worth the price.",
      "rating": 1.0,
      "verified": true,
      "author": "Claudia Villalobos",
      "helpful_votes": 0,
      "publication_date": 20200923
    },
    {
      "title": "Convenient to use, comfortable, protective",
      "text": "Personal purchase (not free for review). This is the second one of these that I have purchased. I had the first one for two years. It was structurally sound but the 'leather' around the edges had peeled so it was looking a little unhappy. I tried a plastic two-piece protect and it was awful. Made the computer heavy, made it cumbersome to open, one or both pieces kept popping off when I opened my computer, and showed fingerprints all over it. I lasted all of a week with that one before going back to this one.",
      "rating": 5.0,
      "verified": true,
      "author": "Joie K.",
      "helpful_votes": 0,
      "publication_date": 20200318
    },
    {
      "title": "Beautiful, Professional and Smart",
      "text": "Wooo what can I say, I recently purchased a Macbook Air (a1466) I wanted a cover that looks professional, would protect somewhat and doesnt stand out.. Mosiso delivered with this cover, while I only just received it and can't yet vouch for quality it does appear to be a quality piece. All ports are accessible and easily opens and closes. Some stated the magnetic tag for keeping closed was a slight nuisance.. just tuck it under.. I would buy this product again..",
      "rating": 5.0,
      "verified": true,
      "author": "Dadincharge Oftheremote",
      "helpful_votes": 0,
      "publication_date": 20181220
    },
    {
      "title": "True to Color, fits well and protects my old macbook air!",
      "text": "I bought this because I didn't want another plastic case that will eventually break or get a sleeve that I'd have to take the laptop in and out of constantly. The case is nice and durable. It looks like a professional folio, so it looks pretty impressive when you take it out of your bag at first. It doesn't add much more weight into my bag. My laptop is protected from scratches and if I wanted to show off my stickers, I can easily take it out of the case.",
      "rating": 5.0,
      "verified": true,
      "author": "Ia Faye",
      "helpful_votes": 0,
      "publication_date": 20200203
    },
    {
      "title": "Good But Not Perfect",
      "text": "The Case fits well over the laptop and looks great. Though the lower section of the case has three main issues. First the tab that functions to hold the case closed can get a little annoying at times. Second the bottom of the laptop will slide up a ways if you fully open your computer. Third the whole of the section around the mousepad can easily warp. Overall this is not a bad product and I will continue to use it, though that doesn't make it perfect.",
      "rating": 3.0,
      "verified": true,
      "author": "Tony Facinelli",
      "helpful_votes": 2,
      "publication_date": 20171115
    },
    {
      "title": "Love it!",
      "text": "This is my 4th MacBook Air cover (3 of them were plastic) and with work travel and taking it in and out of my bag they would always chip or crack so I decided to try a different material. I absolutely love this case. I also feel like it add more protection to the air as it's a thin laptop. I've recommended it to several co-workers too. At the price, you can't beat it. The only complaint is the snap leaves a ring around the the closure and the color I got (orange brown) is definitely more orange than brown but it's a nice color.",
      "rating": 5.0,
      "verified": true,
      "author": "Alleen",
      "helpful_votes": 0,
      "publication_date": 20190408
    },
    {
      "title": "Totally worth it",
      "text": "I absolutely am loving this and it seems to be holding up pretty well for as much as I put it in/take it out of my backpack. I also really like the fact that it has covers the bottom portion of the laptop to the edge, leaving only the trackpad available. I am not sure about anyone else but sometimes the edge of my MBA annoys my wrists when I'm typing for long periods of time and this completely alleviates that! The color is exactly what I was looking for. I am very, very happy with this product.",
      "rating": 5.0,
      "verified": true,
      "author": "T. V. Henson",
      "helpful_votes": 0,
      "publication_date": 20190427
    },
    {
      "title": "Excellent Professional Case",
      "text": "Great case that quickly dresses up a MacBook Air. It does make the lid not close quit entirely, obviously, but between the integrated magnets of the computer and the latch on the case I haven't had any issues. Highly recommend for professionals looking to disguise and protect their MacBook. It also is really easy to take on and off, which is an added bonus for a device that frequently goes between home and the office.",
      "rating": 5.0,
      "verified": true,
      "author": "J. McLaughlin",
      "helpful_votes": 5,
      "publication_date": 20160625
    },
    {
      "title": "Useless great quality product",
      "text": "One of the most useless things I have bought. The look and feel are great, but the fit is terrible. The top cover is so loose, that as soon as you open/close the laptop or even try to do that, the top/screen slips out of the straps holding it. Not sure what this cover is for, considering it can not be used while using the laptop. For just storage purposes I would rather use a normal laptop bag.",
      "rating": 1.0,
      "verified": true,
      "author": "Nargiz_d10",
      "helpful_votes": 0,
      "publication_date": 20200305
    },
    {
      "title": "I feel like I got a used case",
      "text": "I was looking forward to getting this case since i read the good reviews. However, maybe I got a used case or one that has been returned as the case I got seems stretched out. The top of my macbook air seems to keep sagging down as the black bands don't seem to be able to keep the laptop from sliding out of the bands when I am typing. It is nice to get some padding on the case to help if it fell off the desk. But I feel like this problem with the sagging laptop may be annoying so I'm not sure I will keep it.",
      "rating": 1.0,
      "verified": true,
      "author": "jen",
      "helpful_votes": 0,
      "publication_date": 20190221
    },
    {
      "title": "Great value and it looks professional",
      "text": "Looks great. I've gotten lots of compliments. What would I change? 1.) The snap to close it is RIGHT IN FRONT of the touchpad and, in fact, hangs over the pad, so it's in the way. Kind of stupid planning. 2.) The case itself is a little slippery -- part of the reason I bought a case in the first case; because Mac feels making products with slippery surfaces is smart. Otherwise, it's right nice and I've gotten several compliments on it.",
      "rating": 4.0,
      "verified": true,
      "author": "R. G. Robb",
      "helpful_votes": 0,
      "publication_date": 20180228
    },
    {
      "title": "Great Quality, Wrong Color",
      "text": "I was so excited to get this new cover for my Macbook Air! It fits perfect and works great. The only disappointment is the color. I ordered the deep teal and it is actually a hunter green which isn't even a color option. I would recommend for the quality, but beware you may not get the color you ordered.",
      "rating": 4.0,
      "verified": true,
      "author": "Amy Halter- The Obsessive Book Whore",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "Raises the bar",
      "text": "I bought this case after a friend had it. It looks very professional - better than just a lap top cover. I get compliments on it all the time, and the price is awesome. I also like the feel of the \"leather\" as it gives me that extra grip on my lap top. My only regret is they don't make them for the model of my work laptop. I'd like to have that one look as good as my personal laptop!",
      "rating": 5.0,
      "verified": true,
      "author": "Murph",
      "helpful_votes": 0,
      "publication_date": 20190806
    },
    {
      "title": "I'm so happy with this purchase!",
      "text": "I desperately needed another case for my 2017 Macbook Air. (It surely beat accidentally dropping and it needing another computer!) This case is phenomenal and wonderful for my needs. I love the light pink color I ordered it in, and I'm so glad I can travel with my computer now without stressing about if I will kill my primary work accessory. Amazing purchase, and a great price for what you get. Yes, I know it's not real leather, I'm sure, but I'm great with that. I love this case!",
      "rating": 5.0,
      "verified": true,
      "author": "Ellie M. ",
      "helpful_votes": 0,
      "publication_date": 20201006
    },
    {
      "title": "Perfectly fit to my new Star Lab 13.3 - Updated Dec 26, 2019",
      "text": "Fit perfectly to my new Star Laptop 13'3 inch. The computer looks so manly so, using this cover will give a bit of feminine touch. (Updated on Dec 26, 2019) As much as I love the design and color - it makes my laptop super HEAt, which to me, creates a problem. I even tweak my fan to increase but I cannot afford to waste an expensive laptop just for the design trade-off.",
      "rating": 5.0,
      "verified": true,
      "author": "Al Ways Write",
      "helpful_votes": 0,
      "publication_date": 20190926
    },
    {
      "title": "Great MacBook Air Protective cover",
      "text": "I needed something to protect my MacBook Air during travel and in and out of school. The color is so stylish and I feel safe carrying my MacBook around now. It feels very sturdy and protective! I can still access my charging port and USBs with no problem. Love this case and found it less bulky and expensive than others I seen.",
      "rating": 5.0,
      "verified": true,
      "author": "Koala",
      "helpful_votes": 0,
      "publication_date": 20200322
    },
    {
      "title": "My favorite Mac accessory",
      "text": "Okay so I love my MacBook, but I dislike the cold surface when I’m using the keyboard. So I was browsing amazon and scrolled into this perfect case. I absolutely love it. Didn’t even know this item existed. I’ll probably order more colors. Fits great...protective...and has a little built in kickstand. Great item. Highly recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Taylor",
      "helpful_votes": 0,
      "publication_date": 20200427
    },
    {
      "title": "Just what I wanted",
      "text": "Bought this to replace a plastic case that had cracked and had \"feet\" falling off. I like the slight padded feel of the case and how easy it is to slip on and off (not that I take it off often). It's easy to grip; I never feel like it's ready to slip out of my hands when I'm carrying it. Very attractive and gets compliments when people notice it. If and when it wears out, there's a good chance I'll replace it with the same thing.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen Koonce",
      "helpful_votes": 0,
      "publication_date": 20200926
    },
    {
      "title": "WONDERFUL AND INEXPENSIVE!",
      "text": "I must say, this inexpensive case is wonderful. It fits my Macbook Air perfectly on top and bottom. Keyboard and mouse pad are fully exposed so no problems there. Closes up nicely and snaps closed with a magnetic snap. The material is really nice! Smooth, good looking. Doesn't scratch easily. Looks sharp. I like this one!",
      "rating": 5.0,
      "verified": true,
      "author": "Rob Jordan",
      "helpful_votes": 0,
      "publication_date": 20191122
    },
    {
      "title": "2nd time ordering this case",
      "text": "This is the second time I have ordered this case. I am a teacher and I take my laptop home every night. I had tried other cases that snap on and eventually the tabs always snap off. I had this exact same case I. Another color for 2 years and the only reason I am replacing it is because I am tired of the color. It has held up great and protected my computer through drops, bangs, and overall daily use. I love the soft texture and the colors are exactly like the picture. It is hands down the best laptop case I have ever used.",
      "rating": 5.0,
      "verified": true,
      "author": "Denise",
      "helpful_votes": 0,
      "publication_date": 20180819
    },
    {
      "title": "Cardboard?",
      "text": "I think its cardboard behind the cover. It's flimsy, fits almost right. Almost because the left side of the trackpad's edge (MacBook Air) is exposed, right side a bit covered. I do like how it looks on the MacBook, and the color is quite nice (orange). I'll keep it, but I do wish it could last longer than I expect it to.",
      "rating": 3.0,
      "verified": true,
      "author": "D. Colucciello",
      "helpful_votes": 0,
      "publication_date": 20191023
    },
    {
      "title": "Sturdy, and beautiful too!",
      "text": "I bought my first cover for my Mac Air at the Apple Store and was very disappointed. It was very flimsy and cracked after just a year. This cover is so well made and sturdy and looks beautiful too. I’m certain that I will enjoy it for many years",
      "rating": 5.0,
      "verified": true,
      "author": "L.C",
      "helpful_votes": 0,
      "publication_date": 20200909
    },
    {
      "title": "Emphasis on Orange!",
      "text": "I absolutely LOVE this case for my Macbook! The orange brown is definitely more orange than brown...which is why I picked it. I added pictures of thencase against my wood floors and wood desk at work to show the contrast. Hopefully this will help folks with color selection. The only thing that is a (very) minor nuisance that that the black straps that hold the screen to the case, slightly covers the screen. So I find I sometimes have to move it to close out of my applications if they are on the sides. I say minor, because I am buying another case (in cream).",
      "rating": 5.0,
      "verified": true,
      "author": "MittenzRB",
      "helpful_votes": 0,
      "publication_date": 20200221
    },
    {
      "title": "Very good product and value for money",
      "text": "This case looks really professional and unique. When I carry my laptop with this case, I can observe people's attention goes towards my laptop. Recently, I saw our CEO kept staring at this case. The case itself is sturdy and I have been using it for over a year now.",
      "rating": 5.0,
      "verified": true,
      "author": "Chandru",
      "helpful_votes": 0,
      "publication_date": 20201010
    },
    {
      "title": "Does not fit my MacBook Air",
      "text": "The case appears durable. The color is as described and the feel of the material is nice. I would have loved to keep it but unfortunately as you can see from the photo the corner straps do not hold my MacBook Air in place. Returning!",
      "rating": 4.0,
      "verified": true,
      "author": "Bobbi",
      "helpful_votes": 0,
      "publication_date": 20201010
    },
    {
      "title": "Best case ever!!",
      "text": "Perfect fit to my MacBook Air 13”! I love the sky blue, it looks just as pictured. This case is sturdy and I like straps and the clasp for extra protection. This is overall my favorite case I’ve had for my laptop and I definitely recommend this product!",
      "rating": 5.0,
      "verified": true,
      "author": "Manivee",
      "helpful_votes": 0,
      "publication_date": 20200504
    },
    {
      "title": "Class little cover",
      "text": "The material is really nice, and especially for the price. I am in meeting after meeting, constantly taking my computer everywhere. I hate taking a bag with me to carry this individually, so I carry it. This makes it look like a fancy portfolio. The only worry I had was that the little strap to close it would be constantly folded into my way as I use the mousepad, but that has not once been an issue. This is a very good cover!",
      "rating": 5.0,
      "verified": true,
      "author": "KeepOnReading",
      "helpful_votes": 0,
      "publication_date": 20180627
    },
    {
      "title": "Great cover!",
      "text": "I bought this to protect my laptop that I bring to school with me everyday. It's definitely durable, sturdy, and the color is amazing! Edit— my dog keeps scratching at it: absolutely no damage! Amazingly sturdy!",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "Great Purchase",
      "text": "I already have this in brown so I decided to buy another in the light pink. Mind you the pink is more of a shimmer/metallic in color. Which I did not realize until it arrived but it doesn’t bother me. Shipped fast and arrived on time. Fits my MacBook perfectly. I paired mine with one of their black Mosiso keyboard covers and it looks great. Plus, my laptop stays clean and protected.",
      "rating": 4.0,
      "verified": true,
      "author": "Alexandra ",
      "helpful_votes": 0,
      "publication_date": 20181014
    },
    {
      "title": "Looks great!",
      "text": "Great case. I have gotten many compliments from this case in college. I have been using this case for about a year and there are no signs of stitching coming loose or leather peeling. Only down side is edge protection. I dropped it on its edge and it didn't protect it. However, this case isn't meant to save your laptop from directly dropping it on its corner or edge! Looks and feels great! Overall great buy",
      "rating": 5.0,
      "verified": true,
      "author": "Eric Ventures",
      "helpful_votes": 0,
      "publication_date": 20170713
    },
    {
      "title": "Almost perfect",
      "text": "I love this case. My five stars are really 4.9 stars! There is only one fault... the snap latch gets in the way of using the touch pad. If it were able to swivel backwards, it would be perfect. As it is, I have to bend the latch back. Over time, this will break the latch. But I love the color (baby blue) and the protection it affords my Mac Air.",
      "rating": 5.0,
      "verified": true,
      "author": "Westie Mom",
      "helpful_votes": 0,
      "publication_date": 20190102
    },
    {
      "title": "Beautiful",
      "text": "This is a beautiful cover. It has a little added cushion that I really like. Fit perfectly and when closed looks like a slim elegant piece. Soft and light. Really recommend! I’m actually getting addition colors.",
      "rating": 5.0,
      "verified": true,
      "author": "B. Matthews",
      "helpful_votes": 0,
      "publication_date": 20200509
    },
    {
      "title": "Does not fit MacBook Air 2018 or later",
      "text": "This was super sleek, and I loved how it looked and felt. Unfortunately, I didn't read closely enough to know that it wouldn't fit my 2018 MacBook Air- it was too big. I sent it back for a full refund. I wish the same one came in \"my size.\"",
      "rating": 5.0,
      "verified": true,
      "author": "Katron",
      "helpful_votes": 0,
      "publication_date": 20200117
    },
    {
      "title": "Doesn’t fit a 13” Mac Air",
      "text": "The case doesn’t fit whatsoever. I had to double check that I ordered for the right type of laptop. The top portion is too tall for the elastic bands to touch the screen, so it falls off instantly. There’s no way to close the laptop because the leather blocks the magnetic closure. The keyboard protector floats about an inch above the track pad. Not a good product.",
      "rating": 1.0,
      "verified": true,
      "author": "AZgirl",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "Rich and professional",
      "text": "The case came today, and I am more than pleased. The color is a rich brown and it looks like a professional portfolio, not a plastic case. It appears to be a quality item that will 1) protect my MacBook and 2) wear well. The case fits like a glove. A number of reviewers complained about the fit, but I assume they failed to check their model numbers. Finally, all of the above came a great price.",
      "rating": 5.0,
      "verified": true,
      "author": "MJK",
      "helpful_votes": 0,
      "publication_date": 20180418
    },
    {
      "title": "A useful MacBook accessory.",
      "text": "A well fitting, smooth and soft case which fits my Apple MacBook Air perfectly. Since it is soft I do not fear accidentally dropping the laptop. The texture of the fabric also allows for a more solid grip. The stand underneath has proven useful since I took this device to a meeting and was able to place my laptop at a very comfortable angle. The wrist pads which surround the track pad are also a very useful feature which allows me to keyboard without having to press my wrists against the metal case. A very useful accessory for the Apple Macbook Air.",
      "rating": 5.0,
      "verified": true,
      "author": "Chuck L.",
      "helpful_votes": 0,
      "publication_date": 20160723
    },
    {
      "title": "Great product, inaccurate color",
      "text": "This product is an awesome price and great quality. I absolutely recommend it! My only complaint is that the \"orange brown\" is definitely just orange. I added a photo to show the difference in online color vs actual color. I still like it and it surely stands out at airport security. But, other than that... all is great. It stays on, the closure works, the padding makes me feel better about walking around with it, etc. As long as you're a little flexible on the color you expect, you're good.",
      "rating": 4.0,
      "verified": true,
      "author": "Lauren t",
      "helpful_votes": 0,
      "publication_date": 20180724
    },
    {
      "title": "Looks Nice and Does Its Job",
      "text": "Great cover. Looks really professional. Does a decent job of protecting the computer. Fits my MacBook Air perfectly, even with my old rubberized plastic snap-on cover still attached to the lid. The only really annoying thing about it is the strap with the magnet. It kind of gets in the way of the track pad when I'm using the computer. I might just cut it off since it doesn't do much to keep the case closed when not in use.",
      "rating": 4.0,
      "verified": true,
      "author": "K. S.",
      "helpful_votes": 0,
      "publication_date": 20170623
    },
    {
      "title": "Slightly damaged, and overall just OK",
      "text": "I like the case, for the most part, unfortunately, it came with the leather peeling on one side (as shown in the pictures). The other issue I found is that the attachment that holds the cover together when the laptop is closed randomly sticks out when not in use. It kind of gets in the way. Also, it doesn't really close all the way because of the leather laying under the keyboard--that doesn't bother me but it might bother some people. Other than that, it works for the purpose I bought it for (which was buying a case that won't break), and I think I will continue to use it! I am pretty bummed about the imperfection though!!",
      "rating": 3.0,
      "verified": true,
      "author": "Kyla Clark",
      "helpful_votes": 0,
      "publication_date": 20180709
    },
    {
      "title": "Great Case: Beautiful and Functional",
      "text": "This has been a wonderful case (I bought it a few months ago). It is well made, fits perfectly, and provides a little cushion for my computer. It also have a great look to it. As a grad student, I have noticed everyone seems to have the same computer with the same plastic case- it's nice to be able to tell my computer from all the others lying around. When I ordered the case, I was concerned that the snap would get in the way of my typing and scrolling, however, that has not been the case. I have had no functionality issues whatsoever. Great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Goose",
      "helpful_votes": 0,
      "publication_date": 20150725
    },
    {
      "title": "PERFECT",
      "text": "I love this cover. It's smart looking, it protects area below the keyboard, and is simple to maneuver when 'dressing' my Mac Air. No complaints about heating up w/o the vent flap open. For someone who uses their laptop on their lap alot and needs/wants the underside vent to be flipped open, this may not be the cover for you as it would be difficult to use the vent on your lap.",
      "rating": 5.0,
      "verified": true,
      "author": "Maldy",
      "helpful_votes": 0,
      "publication_date": 20170530
    },
    {
      "title": "Very Good Quality",
      "text": "I purchased this to protect my Mac while carrying it on my purse! Is very cushioned so it protects the computer on every side. The material is very high quality and it doesn't break or peel off easily.",
      "rating": 5.0,
      "verified": true,
      "author": "Maria Gabriela",
      "helpful_votes": 0,
      "publication_date": 20200324
    },
    {
      "title": "Very nice value for the price",
      "text": "Great fit with good protection for my laptop. I wish the \"kickstand\"felt more secure when supporting the keyboard in a more ergonomic position but it has worked so far. Love the blue color I ordered and the feel of the case is very \"leathery\". In all, it is a lightweight case but offering good protection for the device. I'm happyQ",
      "rating": 5.0,
      "verified": true,
      "author": "debbiereader",
      "helpful_votes": 0,
      "publication_date": 20180712
    },
    {
      "title": "MOSISO MacBook, Premium PU Leather Case Book Folio Protective Stand Cover Sleeve in brown",
      "text": "Love this case. I have bought several other brands and types and this one is by far my favorite. It fits perfectly, looks great, and the quality is great! If you are looking for a nice, durable, and highly functional case then I recommend this one.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen Waite",
      "helpful_votes": 0,
      "publication_date": 20200823
    },
    {
      "title": "Last long",
      "text": "I have only used these for my laptops - ive had a lot. These cases last soooo long its ridiculous. The only problem is that the hang rests (next to track bar) rub off the quickest.",
      "rating": 5.0,
      "verified": true,
      "author": "Diane M.",
      "helpful_votes": 0,
      "publication_date": 20200426
    },
    {
      "title": "Pleather",
      "text": "I wish I hadn’t purchased it. I don’t like the feel of pleather and the way my MacBookAir fits inside. It is reasonably priced and does the job for most - it’s not for me.",
      "rating": 1.0,
      "verified": true,
      "author": "Shawn W.",
      "helpful_votes": 0,
      "publication_date": 20200920
    },
    {
      "title": "Great Price, Great Case. Definitely Recommend.",
      "text": "I kept dropping my MacBook Air and I really was worried getting it out of commission. This is a nice sturdy but at the same time classy cover case. It does make it look like a portfolio. It is not leather, but it does look and feel like one. The price cannot be beat. Honestly, they could sell it 4 times the price and it would still have a market.",
      "rating": 5.0,
      "verified": true,
      "author": "SD Reviewer",
      "helpful_votes": 0,
      "publication_date": 20170614
    },
    {
      "title": "ONE MINOR FLAW",
      "text": "Great quality for the price! Could be a bit better, specifically by adding some kind of protection to the side ports. They're completely exposed, which worries me for any spill liquids or small particles that could sneak into and damage the ports, but overall I enjoy this product for the price. Would buy again! Not too durable, but looks very classy.",
      "rating": 4.0,
      "verified": true,
      "author": "Peter",
      "helpful_votes": 0,
      "publication_date": 20170514
    },
    {
      "title": "Too big for a 13-inch macbook air",
      "text": "It’s too big for my 13-inch macbook air 2020... too much hassle to return. It has a nice design and softness but real big.. more for a 14-15 inch laptop.",
      "rating": 2.0,
      "verified": true,
      "author": "Montillo Dante",
      "helpful_votes": 0,
      "publication_date": 20200918
    },
    {
      "title": "Sleek and Protective",
      "text": "I purchased this item after realizing my plastic MacBook Air case was scratching my laptop. I'm pretty happy with the case! I've had it for 3 months now and it still looks good. The design is great and protects my laptop! I did notice a couple defects (very minimal) on the stitching but for me this was not an issue. Its a great value overall! *be careful opening this package with scissors, I cut the package open too fast and ended up cutting into the case (covered it with a sticker)",
      "rating": 5.0,
      "verified": true,
      "author": "Joanna ",
      "helpful_votes": 0,
      "publication_date": 20200317
    },
    {
      "title": "Smart and sleek on a cost friendly budget!",
      "text": "Smart, sleek and protective! I dropped my iPad Pro within the first week of purchase leaving small ding on the corner. Purchasing a case was inevitable. After a lot of research I thought the sleek style and consistent market reviews would make this a good purchase for me. An added bonus is the flippable lift for the keyboard that makes typing so much easier. Now I'm thinking of purchasing the matching keyboard cover. I'm very happy with this product!",
      "rating": 5.0,
      "verified": true,
      "author": "Amy StJohn",
      "helpful_votes": 2,
      "publication_date": 20160824
    },
    {
      "title": "Very pretty",
      "text": "Looks good. I got it about 8 months ago, and it just started to peel. I don't take super good care of it so I'm surprised by how long it lasted. The metal clasp comes undone very easily, but it's super easy to put on your laptop.",
      "rating": 4.0,
      "verified": true,
      "author": "Maria",
      "helpful_votes": 0,
      "publication_date": 20190801
    },
    {
      "title": "Model and year of macbooks it supposed to fit.",
      "text": "This is such a beautiful case but it didnt fit my macbook. Its for the new macbook that thins out at the front. My macbook is still squared so it didnt fit all the way in so it didnt close right or all the way...but still want find one that will fit right.",
      "rating": 3.0,
      "verified": true,
      "author": "Matt & Pao ",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "Classy look, Good Price, would buy again.  Don't drop on corners...",
      "text": "Nice Leather protector for 13\" MB Air. Not a cure all if you chuck it around, but if you treat the computer like you would actually like it to stay around and be useful for a bit, this case is great. Classy look, all ports available. If you are a corner dropper, this won't help you, and for mercy's sake, get yourself into therapy.",
      "rating": 5.0,
      "verified": true,
      "author": "BearTop Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20170528
    },
    {
      "title": "Definitely Go Ahead And Purchase It",
      "text": "This laptop case is everything I was expecting. It is stylish and the color is perfect (professional and feminine). It is also functional and protects my laptop. You will not be disappointed if you purchase this product. I’ve been getting so many compliments and inquiries for purchasing options for laptops that are not MacBook Air.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa Divers",
      "helpful_votes": 0,
      "publication_date": 20180717
    },
    {
      "title": "\"This is a thumbs up for me\"",
      "text": "Very pretty cover. I bought one for myself in 2016 and it was the exact same brand but another color. I purchased this one for my girlfriend and she loved it. It is durable and looks nice.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200129
    },
    {
      "title": "Perfect Case to keep my Mac Book Air free from daily wear & tear!",
      "text": "I purchased this case about a week after buying my new Mac Book Air. I removed the cover the other day and found that my computer looks brand new. The case doesn't get in the way of using my computer and I feel comfortable knowing that my Mac Book won't get scratched or dinged as I use it from day to day!",
      "rating": 5.0,
      "verified": true,
      "author": "Sara",
      "helpful_votes": 0,
      "publication_date": 20170801
    },
    {
      "title": "Absolutely beautiful!",
      "text": "I just received the case and I'm thrilled. It's high-quality, professional, and very functional. I have had numerous plastic cases for my MacBook air, but like many other people, I found that they would always crack and break due to everyday use. This case fits snugly and I couldn't be happier with the design. The stand also elevates my computer at a really nice angle. At first, I was concerned about the magnetic tab being cumbersome, but I found a way to tuck it in a bit, as shown in the picture. I will update this review after a few weeks of use, but for now I am a very satisfied customer.",
      "rating": 5.0,
      "verified": true,
      "author": "Misha H.",
      "helpful_votes": 0,
      "publication_date": 20170602
    },
    {
      "title": "Sharp looking in blue",
      "text": "Great looking and inexpensive. You might not like the elastic bands that holds the case top to the monitor. However, it is secure since the rest sits in a sleeve that works on the wrist pad area around the trackpad.",
      "rating": 5.0,
      "verified": true,
      "author": "Gerald Jones",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "Easy to place on",
      "text": "So easy to slip on or in depending on how you look at it fits perfectly on MacBook Air 13.. I like the color .. rose gold very shining finish",
      "rating": 4.0,
      "verified": true,
      "author": "Renae",
      "helpful_votes": 0,
      "publication_date": 20200813
    },
    {
      "title": "If you have a MacBook you NEED this case!",
      "text": "Words cannot describe how happy I am with this case. I received it as a gift and it is the perfect replacement to a much pricier case I’d been using that broke on multiple occasions. I love how this case feels and am impressed by the level of coverage provided.",
      "rating": 5.0,
      "verified": true,
      "author": "Elyse",
      "helpful_votes": 0,
      "publication_date": 20181225
    },
    {
      "title": "Protects my Computer",
      "text": "I bought this to protect my MacBook Air especially during travel. I can report that it has worked really well, looks good, and has protected my computer well especially when I have to take it out of my briefcase to go through TSA checks.",
      "rating": 5.0,
      "verified": true,
      "author": "Laker",
      "helpful_votes": 0,
      "publication_date": 20190327
    },
    {
      "title": "Flimsy, but works",
      "text": "I got the wrong size LOL but it was a bit flimsy...went with a different provider because I wanted a more high end feel. Otherwise, it looks just like the picture.",
      "rating": 4.0,
      "verified": true,
      "author": "ramonie_balonie",
      "helpful_votes": 0,
      "publication_date": 20200920
    },
    {
      "title": "Horrible smell",
      "text": "The beige color is really orange , and it smell so bad Im concerned this has tons of toxic chemicals . Not what I expected from looking at the pics .",
      "rating": 1.0,
      "verified": true,
      "author": "Purposeful",
      "helpful_votes": 0,
      "publication_date": 20181204
    },
    {
      "title": "Excellent quality but was not the color on the picture.",
      "text": "This is the second time I write a review for this and hopefully Amazon doesn't disapprove it again just because I am trying to warn customers. I love this case. Just not in love with the color... I ordered the brown one and it looks great on the picture but received an orange case instead... Far from being the color that is on the picture, not sure why.",
      "rating": 3.0,
      "verified": true,
      "author": "Ellie",
      "helpful_votes": 0,
      "publication_date": 20180502
    },
    {
      "title": "Best case ever!",
      "text": "I am so pleased and amazed with the quality of this case. I didn't want another hard case and thought I'd try a case similar to my leather Kindle case. It's perfect. Made well, fits perfectly and looks great.",
      "rating": 5.0,
      "verified": true,
      "author": "jean c.",
      "helpful_votes": 0,
      "publication_date": 20190504
    },
    {
      "title": "Wow this thing is great.",
      "text": "Really great quality for the price. Slightly padded so it will add thickness to your Mac Air but not too much. I bought the black one and it looks classy as hell. Mine did not have any odd odor as someone had mentioned. Would definitely recommend.",
      "rating": 4.0,
      "verified": true,
      "author": "Sleep13",
      "helpful_votes": 0,
      "publication_date": 20181109
    },
    {
      "title": "Does not fit",
      "text": "Does not fit laptop. The cover on the keyboard does not stay down. This is absolutely to big for my Mac Book! I’m returning ASAP",
      "rating": 1.0,
      "verified": true,
      "author": "Sabina Taylor",
      "helpful_votes": 0,
      "publication_date": 20201018
    },
    {
      "title": "Second one",
      "text": "I love this cover. I bought one several years and it saved my computer from the dog chewing it. I bought another one.",
      "rating": 5.0,
      "verified": true,
      "author": "Katie",
      "helpful_votes": 0,
      "publication_date": 20200507
    },
    {
      "title": "Durable, a bit heavy",
      "text": "I bought this last September and am only just now having to replace it because I spilled a smoothie all over it (which got inside and stained the soft leather). It's a great case and very durable. My only critiques would be that it weighs down the screen significantly, so when you are typing with your laptop on your lap, the screen tends to move backwards. A bit annoying. Other than that, great case!",
      "rating": 4.0,
      "verified": true,
      "author": "Kim Reynolds",
      "helpful_votes": 0,
      "publication_date": 20161106
    },
    {
      "title": "Durable",
      "text": "I just received my 2nd one. I had the first one for 4 years. It was still holding up, but it was simply my personal vanity that led me to get another one and replace it in a different color.",
      "rating": 5.0,
      "verified": true,
      "author": "Crystal Y. Melchor",
      "helpful_votes": 0,
      "publication_date": 20200627
    },
    {
      "title": "Dits great",
      "text": "It fits great! I love the flip up on the bottom to make my computer higher. I carry my computer everyday in my bag and I think it protects it well. However, when I am using the stand it falls down and I feel like my computer is going to crash to the floor. I have always caught it before that can happen but it is a little nueve racking when anyone walks by my computer too quickly.",
      "rating": 5.0,
      "verified": true,
      "author": "Yolanda",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "Attractive and protective",
      "text": "Soft leather feel that also protects my MacBook Air in transit. I've been using it a month and so far I really like it. Not sure how the elastic is going to hold up on the top over time, but it's strong now.",
      "rating": 4.0,
      "verified": true,
      "author": "Experienced as...",
      "helpful_votes": 0,
      "publication_date": 20190130
    },
    {
      "title": "Best laptop case every",
      "text": "Best laptop case ever Love how the leather give the laptop another look",
      "rating": 5.0,
      "verified": true,
      "author": "Algenis Vicente",
      "helpful_votes": 0,
      "publication_date": 20200912
    },
    {
      "title": "Great Product for Low Price !",
      "text": "Great product for such a cheap price. I needed a case that didn't look like I was carrying a Mac that way I don't have anybody try and steal it. So I found this one and the leather is great and looks like I'm carrying a notebook or small carrying case for papers ! I really enjoy this product and can now take my Mac everywhere with me ! Another plus is the price being so cheap, if you try and purchase a case similar to this at any store, it'll be way more !",
      "rating": 5.0,
      "verified": true,
      "author": "Paz",
      "helpful_votes": 0,
      "publication_date": 20150904
    },
    {
      "title": "Great!!!",
      "text": "This product is great for the money. It came no longer than 2-3 days. The design is perfect nd the color is exactly as i expected. I’m giving it a 5 star because I’ve tried several different cases before and they have overheated the laptop or extremely annoying. This is a great product and would recommend to anyone with a MacBook",
      "rating": 5.0,
      "verified": true,
      "author": "Germima",
      "helpful_votes": 0,
      "publication_date": 20180509
    },
    {
      "title": "Nicest Case, soft and beautiful",
      "text": "Fist like a glove, just plain perfect. I have the lt brown but I'm sure it looks classy in any color. I want to know why they don't make these for anything but Mac odd number sizes. I need one in 14\"???? Looked everywhere for one like this one. Don't exist. Chrisoftheriver",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "This is great.",
      "text": "This is great. Just what I wanted to smooth out the sharp edges. Looks so much better than the plastic one I had.",
      "rating": 5.0,
      "verified": true,
      "author": "Naples Golfer",
      "helpful_votes": 0,
      "publication_date": 20200208
    },
    {
      "title": "Looks professional",
      "text": "Had a lot of compliments over this case. It looks highly professional, and it has a lot of cushion. Really not bad",
      "rating": 5.0,
      "verified": true,
      "author": "Ariana",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "I Wanted to Love this Based on the Reviews!",
      "text": "Unfortunately this does not fit my Macbook 13\" air. As you can see in the picture, in order for the top part to stay up and under the two \"bungies\", it has to be pushed up way farther than the mousepad. This creates an awkward space and when I try to move the laptop down, the \"bungies\" come off the top. Disappointed :(",
      "rating": 1.0,
      "verified": true,
      "author": "Catt",
      "helpful_votes": 0,
      "publication_date": 20190813
    },
    {
      "title": "VERY NICE!",
      "text": "I love the quality of this laptop cover. I have received compliments of how nice it looks. I love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Ms. Tanya",
      "helpful_votes": 0,
      "publication_date": 20200903
    },
    {
      "title": "Great look, feel and price.",
      "text": "This is a beautiful cover, provides the protection I want, and has a hidden \"stand\" that adds even more value. The new MacBooks are so thin they almost feel flimsy. This adds enough coverage that I don't feel it'll break.",
      "rating": 5.0,
      "verified": true,
      "author": "Laurie Gold",
      "helpful_votes": 0,
      "publication_date": 20170909
    },
    {
      "title": "13 inch red case",
      "text": "Looked through A LOT of cases. Liked the sleek look and little kick stand.",
      "rating": 5.0,
      "verified": true,
      "author": "bears",
      "helpful_votes": 0,
      "publication_date": 20200903
    },
    {
      "title": "Durable and classy!",
      "text": "This case feels well made and doesn’t feel cheap. I love the durability and the “classy” look. Fits my MacBook Air 13” perfectly. It looks great, too! I have the rose gold one and it is beautiful! Happy I bought it!",
      "rating": 5.0,
      "verified": true,
      "author": "Erin",
      "helpful_votes": 0,
      "publication_date": 20200826
    },
    {
      "title": "Great cover/case",
      "text": "This laptop case is exactly what I wanted. It has a professional look to it that I was hoping for. The leather isn't the highest quality, but at the price I am happy with it. It gets a little scuffed in my bag, but that is expected. I would definitely buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "samcrowESQ",
      "helpful_votes": 0,
      "publication_date": 20180222
    },
    {
      "title": "Very nice",
      "text": "This is very beautiful and so far seem to be working its purpose",
      "rating": 5.0,
      "verified": true,
      "author": "Karen S. Kelly",
      "helpful_votes": 0,
      "publication_date": 20200923
    },
    {
      "title": "This product looks very nice and really protects my Mac Air",
      "text": "This product looks very nice and really protects my Mac Air. The product was delivered as expected and fits the Mac Air like a glove. I highly recommend this product not only to protect your laptop but also to make it look good.",
      "rating": 4.0,
      "verified": true,
      "author": "MRay",
      "helpful_votes": 0,
      "publication_date": 20180222
    },
    {
      "title": "Cheap, too big and not user friendly",
      "text": "Returned this product within 3 hours of receiving it. It's obviously cheaply made, which wouldn't matter as much to me except the actually construction is sooo bad. The little clasp that holds in together is in the way when you're trying to use the computer. The case is much too large for the Macbook Air. Just overall not a good buy.",
      "rating": 1.0,
      "verified": true,
      "author": "Christine T.",
      "helpful_votes": 0,
      "publication_date": 20180412
    },
    {
      "title": "It is handsome and protects my computer nicely. My only negative comment is that the upper ...",
      "text": "I've gotten compliments on this computer case. It is handsome and protects my computer nicely. My only negative comment is that the upper portion of the case doesn't fit my computer completely, it's a bit too big for my 13\" Macbook Air (The upper corners do not stay in the slits when I have it up. Otherwise, I am very pleased with my purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171117
    },
    {
      "title": "Stylish and different",
      "text": "I love this case. It's very stylish and fits perfectly. I love that you don't need to snap anything on the laptop, it just slides right in. Definitely recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200414
    },
    {
      "title": "Impressive",
      "text": "This product is Impressive yet inexpensive. Purchased 2 of these laptop covers several years ago. My wife\"s case still looks new, mine on the hand needed replacement so I bought another for my laptop. Great price, works and looks awesome. Very happy with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20190704
    },
    {
      "title": "This case is great for my laptop",
      "text": "This case is great for my laptop. Doesn't make my macbook air more bulky and still fits nicely in my work tote. Took a star off because the stand that eleavates the case does not stay up so the second I put pressure on my keys when typing, it flattens making that feature unusable. If you just need something to protect your laptop that is sleek and a bit more fancy than a plastic case, I'd recommend.",
      "rating": 4.0,
      "verified": true,
      "author": "Monique N. Jessica",
      "helpful_votes": 0,
      "publication_date": 20170912
    },
    {
      "title": "Great fit! Covers everything.",
      "text": "I love the color, (rose gold), fit (mentioned in other reviews) and that it is more protective than I anticipated. I worried about elastic bands at the corners that hold the screen, but it turns out they fit, hold well, and stay in place closing and opening my MacAir. Typically, I do not submit reviews. In this case I am so pleased and want those that question the fit not to worry.",
      "rating": 5.0,
      "verified": true,
      "author": "Corrine A",
      "helpful_votes": 0,
      "publication_date": 20190929
    },
    {
      "title": "I love this case",
      "text": "I love this case. It is very pretty and padded so it is soft. There is some stitching and trim that is off but you can only notice it if you are examining the case close. The snap is magnetic and has a strong hold. Well worth the cost.",
      "rating": 4.0,
      "verified": true,
      "author": "Paul J. Schilling",
      "helpful_votes": 0,
      "publication_date": 20180518
    },
    {
      "title": "Great Purchase",
      "text": "I had a Caselogic before and when I retired it I replaced it with this one. The quality is just as good. I travel with it so it goes in and out of a backpack and has held up well.",
      "rating": 5.0,
      "verified": true,
      "author": "Ms. Meowgi",
      "helpful_votes": 0,
      "publication_date": 20190114
    },
    {
      "title": "Would buy again, but wish they'd get rid of the elastic corner straps",
      "text": "Stays on well and looks sleek and nice. Decent-quality leather. Doesn't feel too cheap. Only thing I'm not a fan of is the elastic straps that hold the top part onto the corners of the screen. Those just don't look nice. I'm sure there's another solution to this (like full-leather corners) that would look a bit more high-end.",
      "rating": 5.0,
      "verified": true,
      "author": "jes",
      "helpful_votes": 0,
      "publication_date": 20170122
    },
    {
      "title": "Favorite Case ever",
      "text": "Simple and classy. This is my favorite and I love that it has a snap. The blue is my favorite. It's like holding a book.",
      "rating": 5.0,
      "verified": true,
      "author": "annabelle morehouse",
      "helpful_votes": 0,
      "publication_date": 20190916
    },
    {
      "title": "Would Buy Again",
      "text": "This is truly classic leather case with the cutouts that allow you to use your computer and plug ins without having to remove it. Looks very professional and and protects my computer. LOVE IT!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "MeMe LaMer",
      "helpful_votes": 0,
      "publication_date": 20181117
    },
    {
      "title": "Godsend for HP Spectre Laptops",
      "text": "I love this case, mostly because it's like the only case that can fit the HP Spectre x360. Spectre owners must know that it's damn near impossible to find a cover case for their laptops, and this case is a godsend for this laptop. It is a little loose in fitting, but It pretty much does the job for you. Sometimes the bands that cling to the laptop screen slips out of the laptop, but that could be because the case is not specifically made for the dimensions of my laptop.",
      "rating": 5.0,
      "verified": true,
      "author": "Katie Kimpau",
      "helpful_votes": 0,
      "publication_date": 20180609
    }
  ],
  "product_meta": {
    "title": "MOSISO MacBook Air 13 inch Case, Premium PU Leather Case Book Folio Protective Stand Cover Sleeve Compatible with MacBook Air 13 inch A1466 / A1369 (Older Version Release 2010-2017), Brown",
    "description": "Color:BrownMOSISO Premium PU Leather Book Cover Folio Case with Stand Function compatible with MacBook Air 13 Inch (older version, 2010-2017 release) \n\nPremium PU leather folio cover with stand function offers a fashionable design and superior protection. \nEasy snap-on installation. No tools and fuss to put on and remove. \n\nCase Cover Compatible with \n\nMacBook Air 13 Inch \n\nModel: A1466 / A1369 --- MQD32LL/A, MQD42LL/A, MMGF2LL/A, MMGG2LL/A, MJVE2LL/A, MJVG2LL/A, MD760LL/B, MD760LL/A, MD761LL/A, MD231LL/A, MD232LL/A, MC503LL/A, MC504LL/A, MC965LL/A, MC966LL/A) 2017/2016/2015/2014/2013/2012/2011/2010 release.",
    "rating": 4.5,
    "feature_bullets": [
      "The dimension of case is 13 x 9.1 x 0.7 inch. It is ONLY compatible with MacBook Air 13 Inch (A1369 / A1466 --- MQD32LL/A, MQD42LL/A, MMGF2LL/A, MMGG2LL/A, MJVE2LL/A, MJVG2LL/A, MD760LL/B, MD760LL/A, MD761LL/A, MD231LL/A, MD232LL/A, MC503LL/A, MC504LL/A, MC965LL/A, MC966LL/A, 2017/2016/2015/2014/2013/2012/2011/2010 release).",
      "Please kindly check the model number \"A1xxx\" on the back of the MacBook BEFORE your purchase. Make sure it matches the model number in the title \"A1369\" or \"A1466\". WARNING: This case is NOT compatible with other MacBook models.",
      "Superior durability case cover with shock-absorbing features. All device features are accessible through cut-outs and openings.",
      "Magnetic closure design make sure your MacBook Air securely in place.",
      "Unique protective design allows operating your MacBook Air freely without removing the case. MOSISO 1 year warranty on every case."
    ],
    "specifications": {
      "Product Dimensions": "12.7 x 9.5 x 0.9 inches",
      "Item Weight": "11.2 ounces",
      "ASIN": "B00P5GHZAC",
      "Item model number": "A13-PU-Brown",
      "Customer Reviews": "4.5 out of 5 stars1,864 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#556 in Laptop Hard Shell Cases",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "November 2, 2014",
      "Manufacturer": "Mosiso"
    },
    "categories": [
      "Computers & Accessories",
      "Hard Shell Cases",
      "Bags, Cases & Sleeves",
      "Electronics",
      "Laptop Accessories"
    ],
    "price": 17.99
  }
}