{
  "website_summaries": [
    {
      "verdict": "If you're looking for a shovel with a square head, this is an acceptable buy. Heavy-duty and built to last, though smaller users may find it awkward due to its weight.",
      "pros": [
        "The traditional square-head design is ideal for scooping and removing a wide range of materials",
        "Solid build"
      ],
      "cons": [
        "It's on the heavy side, and the handle's finish doesn't prevent splinters"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Good - but could have been a 5-star product",
      "text": "I love/hate this shovel. I would have given it 5 stars if the handle was not so poorly finished. The handle had many splinters and gouges ready to rip the skin off your hands. No reason at all to let this out of the factory. Poor quality control. I sanded the wooden handle and put many coats of polyurethane on it. Now it's OK but I had to put extra time and money into it. As far as function goes, it works exactly as I expected.",
      "rating": 3.0,
      "verified": true,
      "author": "cyberfelix",
      "helpful_votes": 16,
      "publication_date": 20151220
    },
    {
      "title": "Great for Poop in the Coop",
      "text": "This rake is great for sifting chicken poop out of the sand coop. I would have given it 5 stars but the handle is not \"finished\", I managed to get a large splinter taking it out of the box. I'm sure I can fix it, but I shouldn't have to. Still, works great for my purpose.",
      "rating": 4.0,
      "verified": true,
      "author": "JP",
      "helpful_votes": 11,
      "publication_date": 20160402
    },
    {
      "title": "Chicken coop secret weapon!",
      "text": "Quite possibly, THE greatest thing to clean a chicken coop with!! This “hole-y” shovel scoops the poop and debris that the chickens leave in the coop. It’s like a giant cat litter scoop for farmers!! Durable and works like a regular shovel, except far more amazing!!",
      "rating": 5.0,
      "verified": true,
      "author": "Regis",
      "helpful_votes": 4,
      "publication_date": 20180507
    },
    {
      "title": "Perfect for my Chicken Run!",
      "text": "The Midwest Rake is working perfectly in my chicken coop run which is filled with sand. I can now sift collect the droppings and sift the sand out without killing my back. Before I was bending over with my small cat pooper scooper to clean the run daily! I would recommend this to all chicken owners who are using sand in the coop runs. The product is very well made. Good buy and very quick shipping.",
      "rating": 5.0,
      "verified": true,
      "author": "Teresa A Malan",
      "helpful_votes": 11,
      "publication_date": 20160717
    },
    {
      "title": "This shovel is awesome! I have sand in my large chicken coop ...",
      "text": "This shovel is awesome! I have sand in my large chicken coop and this makes clean-up a snap. Sturdy and durable. Wood handle was finished just fine--no worries of splinters as some reviews indicated. My only complaint/comment is I wish this had a shorter/lighter handle for MY use but I do understand this was mainly for contractor use..not in chicken coops!. I think we can modify it with a short replacement handle.",
      "rating": 5.0,
      "verified": true,
      "author": "blacklily",
      "helpful_votes": 3,
      "publication_date": 20170411
    },
    {
      "title": "Shovel works great",
      "text": "This shovel works great for clean up my goat barn and goat pens. I can pick up the goat pepples and the sand goes right through the holes.",
      "rating": 5.0,
      "verified": true,
      "author": "Margarita ",
      "helpful_votes": 6,
      "publication_date": 20170727
    },
    {
      "title": "Perfect for the chicken coop",
      "text": "I love this for my chicken coop! Makes clean up so much easier and still gives me the sharp edge of a flat head shovel to scrape the concrete on the bottom of the run. Would buy again!",
      "rating": 5.0,
      "verified": true,
      "author": "Chicken Lover",
      "helpful_votes": 12,
      "publication_date": 20150827
    },
    {
      "title": "Very satisfied",
      "text": "I used this shovel to sift dirt out of my river rock in my yard. I still had to shake the rocks through a screening basket I made, but half the dirt was already gone because of the shovel. Plus, this shovel is more light weight, which made a big difference when shoveling rocks. It was more than sturdy enough for this task. Also, it works great on just plain old dirt.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike Bieker",
      "helpful_votes": 0,
      "publication_date": 20190824
    },
    {
      "title": "Ideal Solution",
      "text": "This tool is perfect for cleaning my chicken coop and run that is filled with sand. I can sift out the waste in a matter of a few minutes. This is a full-sized shovel so it will hold up for many years. It arrived on time and in great condition. 100% satisfied with the product and the transaction.",
      "rating": 5.0,
      "verified": true,
      "author": "PAndel",
      "helpful_votes": 4,
      "publication_date": 20160704
    },
    {
      "title": "Great Product !",
      "text": "I needed a shovel that I could remove snow off my house eves up as far as I can reach to avoid ice dams from the snow. This tool is so much lighter the over the shoulder height I need to work makes the job easier ,a regular flat blade shovel is heavy. The finish on the shovel is great no sharp edges and a paint that looks great. Thank you, Toolite.",
      "rating": 5.0,
      "verified": true,
      "author": "Stanley.w.richardson",
      "helpful_votes": 0,
      "publication_date": 20171121
    },
    {
      "title": "Best tool ever",
      "text": "This tool is perfect for cleaning out my chicken coop. Sand in the bottom and you can scoop the poop like a giant litter box. Good quality sturdy handle. Couldn’t ask for better. Worth the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Audrey",
      "helpful_votes": 0,
      "publication_date": 20190704
    },
    {
      "title": "Great for peacock poo!",
      "text": "Love this shovel. I use it for cleaning out the peacock coop. The sand filters through and leaves the poo. It's like a long-handled kitty litter scoop. This tool is very sturdy and will last me for many years. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Francine from Texas",
      "helpful_votes": 2,
      "publication_date": 20170425
    },
    {
      "title": "Perfect",
      "text": "This is working great for what I bought it for. I have a licensed home daycare and my outdoor play equipment sits in sand. I also have cats and a huge Maple tree. This shovel does a great job helping me to keep the sand clean and free of debris.",
      "rating": 5.0,
      "verified": true,
      "author": "Gayla Marshall",
      "helpful_votes": 0,
      "publication_date": 20191103
    },
    {
      "title": "Toolite #49492 Square Point Shovel.",
      "text": "My Toolite 49492 #2 Square Point Shovel, is solidly built. This will be great for turning soil that has some rock in it. Just scoop, shake, toss out rocks. Much easier than using a hand sifter, when working in small raised beds.",
      "rating": 5.0,
      "verified": true,
      "author": "Greg Smith",
      "helpful_votes": 0,
      "publication_date": 20170509
    },
    {
      "title": "Great shovel",
      "text": "Kind of heavy (I’m only 96 lbs so might not be for others lol) but works great, it makes cleaning my chicken run a lot easier and faster. I use sand in my coop and run.",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa",
      "helpful_votes": 0,
      "publication_date": 20181018
    },
    {
      "title": "I hate rocks and weeds...",
      "text": "I purchased the tool to pick up rocks and sift dirt/weeds. It's still a lot of work however this tool does the trick.",
      "rating": 5.0,
      "verified": true,
      "author": "BRANDI",
      "helpful_votes": 0,
      "publication_date": 20191025
    },
    {
      "title": "Have cats, must have.",
      "text": "I have eight cats, perfect tool for the cat pan, no more stooping or bending",
      "rating": 5.0,
      "verified": true,
      "author": "James Prulhiere",
      "helpful_votes": 0,
      "publication_date": 20180912
    },
    {
      "title": "Chicken Run Duty",
      "text": "Works really well to sift thru the sand in my chicken run. The handle is smooth and seems to have a light lacquer finish - no longer a splinter hazard as I read in previous reviews.",
      "rating": 5.0,
      "verified": true,
      "author": "Skalabs",
      "helpful_votes": 2,
      "publication_date": 20161102
    },
    {
      "title": "Quality",
      "text": "Great shovel... Used for clearing rock out of sand.. Holes are about 1/8 drilled.. Shipping took a few weeks",
      "rating": 5.0,
      "verified": true,
      "author": "action",
      "helpful_votes": 0,
      "publication_date": 20200905
    },
    {
      "title": "Good tool",
      "text": "Packaged nicely and l received it quickly. It's a little too, heavy for me to lift. I should have ordered one with a plastic handle.",
      "rating": 3.0,
      "verified": true,
      "author": "L. Ellen Duncan",
      "helpful_votes": 0,
      "publication_date": 20181213
    },
    {
      "title": "Great value.",
      "text": "Good quality shovel, great price! I live in Phoenix Arizona and I use it for spot sifting the gravel in the yard when it gets compacted with dirt. Great for a quick refresh.",
      "rating": 5.0,
      "verified": true,
      "author": "Raoul Sada",
      "helpful_votes": 0,
      "publication_date": 20190929
    },
    {
      "title": "I am very happy with the product as it is everything that was ...",
      "text": "The quality of the product is of utmost high durability, as it will last for many years. I am very happy with the product as it is everything that was in the product description. and This Next Day MRO company is really on the ball, is Most professional. I ordered the product on Friday, and it was delivered the following Monday Morning. It doesn't get any better than that!! I am most impressed with them, to buy from them, whenever possible! Thank you Next Day MRO! Steve Hansen",
      "rating": 5.0,
      "verified": true,
      "author": "Steven Hansen",
      "helpful_votes": 0,
      "publication_date": 20151001
    },
    {
      "title": "Best value for shovels that filters sand",
      "text": "Best value for shovels that filters sand. Thicker steel then normal shovel so don't think about buying a cheap shovel and just drilling holes in it.",
      "rating": 5.0,
      "verified": true,
      "author": "Bum L.",
      "helpful_votes": 4,
      "publication_date": 20150510
    },
    {
      "title": "Good quality, but the holes were too big for ...",
      "text": "Good quality, but the holes were too big for scooping chicken poop from the sand in the coop. We wrapped it in hardware cloth which did the trick, but it might have been better to use a pitchfork style wrapped in hardware cloth.",
      "rating": 4.0,
      "verified": true,
      "author": "TMcKay",
      "helpful_votes": 0,
      "publication_date": 20161206
    },
    {
      "title": "Nice & sturdy, works good",
      "text": "Got it in a timely manner. It's built nice & sturdy, should last a long time. It works good for sifting through the sand in my chicken coop, much like a big litter box scoop.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Beth Maschner",
      "helpful_votes": 0,
      "publication_date": 20160306
    },
    {
      "title": "Muck and Mud Shovel - Making a Tough Job Easier",
      "text": "I purchased this shovel specifically to remove high organic content muck from the bottom of a small drainage stream alongside my property. It works exactly as I had hoped. A truly clever design.",
      "rating": 5.0,
      "verified": true,
      "author": "Quality Maven",
      "helpful_votes": 0,
      "publication_date": 20161114
    },
    {
      "title": "This purchase was brilliant. I've been looking for a tool like this ...",
      "text": "This purchase was brilliant. I've been looking for a tool like this for 2 years. Makes cleaning the coop crazy fast.",
      "rating": 5.0,
      "verified": true,
      "author": "NANCY BLOMQUIST",
      "helpful_votes": 0,
      "publication_date": 20160818
    },
    {
      "title": "Good for my chicken coop!",
      "text": "I use this guy to scoop my chicken coop daily because i use sand. Works perfectly and allows me to pick up the waste without taking the sand too.",
      "rating": 5.0,
      "verified": true,
      "author": "Mimi",
      "helpful_votes": 0,
      "publication_date": 20160120
    },
    {
      "title": "Well built and very helpful",
      "text": "This works wonders for cleaning out our sand floor in the chicken coop. It makes quick work of it like a giant kitty litter scoop!",
      "rating": 5.0,
      "verified": true,
      "author": "Alecia RR",
      "helpful_votes": 0,
      "publication_date": 20161216
    },
    {
      "title": "Best litter box scooper ever",
      "text": "Best litter box scooper ever. The holes are the same size as the hand held litter box scoops. And since you are not so close to the litter with your face or hands, much more sanitary.",
      "rating": 5.0,
      "verified": true,
      "author": "greggers",
      "helpful_votes": 0,
      "publication_date": 20161104
    },
    {
      "title": "Sifting Sand",
      "text": "Bought it to clean the chicken coop; works good to sift the sand",
      "rating": 5.0,
      "verified": true,
      "author": "Neil K.",
      "helpful_votes": 2,
      "publication_date": 20160627
    },
    {
      "title": "Shovel, does the job",
      "text": "Perfect shovel for cleaning my flower beds that feral cats use for their kitty box.",
      "rating": 5.0,
      "verified": true,
      "author": "Bostonian",
      "helpful_votes": 0,
      "publication_date": 20170923
    },
    {
      "title": "Used it for an inaugural clean of my chicken coop ...",
      "text": "Used it for an inaugural clean of my chicken coop tonight, and it perfectly sifted the poop from the sand. Made quick work of it.",
      "rating": 5.0,
      "verified": true,
      "author": "Tm",
      "helpful_votes": 2,
      "publication_date": 20160607
    },
    {
      "title": "shipped quickly and we are very satisfied with the purchase",
      "text": "Just what we were looking for, seems very durable - have not heavily used it yet, but it's just as advertised, shipped quickly and we are very satisfied with the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "mo",
      "helpful_votes": 0,
      "publication_date": 20151022
    },
    {
      "title": "This is the best shovel invention ever",
      "text": "This is the best shovel invention ever! Excellent construction, very durable and does exactly what its made to do! Very happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda Lepine",
      "helpful_votes": 2,
      "publication_date": 20150728
    },
    {
      "title": "Made well",
      "text": "Works perfectly to sift chicken poo out of sand, sturdy, good construction. My husband who is Mr. Critical of tools is a big fan.",
      "rating": 5.0,
      "verified": true,
      "author": "amiller",
      "helpful_votes": 0,
      "publication_date": 20151115
    },
    {
      "title": "I bought this for my custom-built litter box the litter ...",
      "text": "I bought this for my custom-built litter box the litter box is 3 ft long, 2 ft tall and 2 ft wide. the letter depth is about a 1.5 ft. this shovel makes quick work for cleaning.",
      "rating": 5.0,
      "verified": true,
      "author": "Johnathon",
      "helpful_votes": 0,
      "publication_date": 20171016
    },
    {
      "title": "Great For Dog & Chicken Poop",
      "text": "This is great for cleaning up dog poop and chicken poop. The holes allow the sand to drain off, but keeps the poop on the shovel.",
      "rating": 5.0,
      "verified": true,
      "author": "Nvhunter",
      "helpful_votes": 0,
      "publication_date": 20170113
    },
    {
      "title": "Very happy !",
      "text": "The rake came in a timely manner and it was very nice. Good quality and we were very pleased. Thank you",
      "rating": 5.0,
      "verified": true,
      "author": "M. Davis",
      "helpful_votes": 0,
      "publication_date": 20161202
    },
    {
      "title": "Three Stars",
      "text": "works ok, could have raised edges to hold more product.",
      "rating": 3.0,
      "verified": true,
      "author": "Chris Foglesong",
      "helpful_votes": 0,
      "publication_date": 20160706
    },
    {
      "title": "Great Mud Shovel",
      "text": "We use this to clean out our stock tanks. It works great at getting out the stuff that is on the bottom of the tanks.",
      "rating": 5.0,
      "verified": true,
      "author": "Clara Mull",
      "helpful_votes": 3,
      "publication_date": 20141127
    },
    {
      "title": "A shovel with holes?",
      "text": "Excellent, I use it to get duckweed out of our stream. Weeds stay in water drains out!",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Anderson",
      "helpful_votes": 0,
      "publication_date": 20160930
    },
    {
      "title": "Five Stars",
      "text": "Great for the chicken coop that I use sand as the litter.",
      "rating": 5.0,
      "verified": true,
      "author": "J.D.",
      "helpful_votes": 2,
      "publication_date": 20161013
    },
    {
      "title": "Love it!",
      "text": "Great tool! I use sand in my chicken coop and run, and I clean it every day. This tool has cut my cleaning time by at least half. I hesitated about spending the money for it, but it is worth every penny! Much better than my homemade one. Thanks for a great product!",
      "rating": 5.0,
      "verified": true,
      "author": "Sandy M.",
      "helpful_votes": 2,
      "publication_date": 20160714
    },
    {
      "title": "This is a very well made tool",
      "text": "I could not be any happier with it. It does exactly what I purchased it for.",
      "rating": 5.0,
      "verified": true,
      "author": "Cheryl Oslin",
      "helpful_votes": 0,
      "publication_date": 20191012
    },
    {
      "title": "Five Stars",
      "text": "Perfect for scooping the poop in my sand litter chicken coop.",
      "rating": 5.0,
      "verified": true,
      "author": "Heather",
      "helpful_votes": 0,
      "publication_date": 20170209
    },
    {
      "title": "Five Stars",
      "text": "Wish the holes were a bit smaller but overall quality piece.",
      "rating": 5.0,
      "verified": true,
      "author": "Nunya",
      "helpful_votes": 0,
      "publication_date": 20160315
    },
    {
      "title": "Great craftsmanship",
      "text": "Sifting shovel used to clean out our chicken coop. Works great, craftsman ship very nice.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Buyer",
      "helpful_votes": 2,
      "publication_date": 20160415
    },
    {
      "title": "Chicken Coop Winner!",
      "text": "It's a tad heavy for me, and the handle is a tad too long for me, but I use it to clean out my chicken coop and it does that PERFECTLY!!",
      "rating": 4.0,
      "verified": true,
      "author": "Debi JS",
      "helpful_votes": 2,
      "publication_date": 20160403
    },
    {
      "title": "Five Stars",
      "text": "Very sturdy shovel, yet light weight enough to be easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "CoastalNana",
      "helpful_votes": 0,
      "publication_date": 20150917
    },
    {
      "title": "It works",
      "text": "Use this in my chicken coop,it works great for sifting the poop out of the sand",
      "rating": 5.0,
      "verified": true,
      "author": "kkr",
      "helpful_votes": 0,
      "publication_date": 20180406
    },
    {
      "title": "Green Acres is the place to be...",
      "text": "Exactly as advertised, a chicken litter scoop for the country gentleman.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric Shuman",
      "helpful_votes": 0,
      "publication_date": 20160303
    },
    {
      "title": "Square point shovel",
      "text": "Very well made. We got the shovel to clean our chicken koop. The holes in the shovel make the job very easy.",
      "rating": 5.0,
      "verified": true,
      "author": "176Pat",
      "helpful_votes": 0,
      "publication_date": 20170417
    },
    {
      "title": "Five Stars",
      "text": "Good construction. Heavy steel shovel, good solid handle. Works great.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin",
      "helpful_votes": 0,
      "publication_date": 20170217
    },
    {
      "title": "Love this! Has made chicken coop cleanup so much ...",
      "text": "Love this! Has made chicken coop cleanup so much easier!",
      "rating": 5.0,
      "verified": true,
      "author": "Nick",
      "helpful_votes": 0,
      "publication_date": 20170829
    },
    {
      "title": "Five Stars",
      "text": "I love the rake. I had seen a similar one on The Gardner Guy a few years ago.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20151024
    },
    {
      "title": "Three Stars",
      "text": "It's a beautiful tool but a bit heavy for my use case.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160716
    },
    {
      "title": "Awesome",
      "text": "Works awesome I just it for picking up dog poop it it works amazing",
      "rating": 5.0,
      "verified": true,
      "author": "Kurtis roeber",
      "helpful_votes": 0,
      "publication_date": 20160605
    },
    {
      "title": "Five Stars",
      "text": "works great for cleaning the chicken coop when you have sand as a substrate.",
      "rating": 5.0,
      "verified": true,
      "author": "katy",
      "helpful_votes": 0,
      "publication_date": 20151116
    },
    {
      "title": "This is the best shovel I've ever had",
      "text": "With this shovel you don't have to shovel mounds of dirt into a truck or pile just to get rid of debris. You can sift through it. Get rid of trash instead of dirt.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard Y.",
      "helpful_votes": 3,
      "publication_date": 20140701
    },
    {
      "title": "It is great! Sturdy and very useful",
      "text": "I use this to sift chicken poop out of the coop and run. It is great! Sturdy and very useful.",
      "rating": 5.0,
      "verified": true,
      "author": "Sara W",
      "helpful_votes": 0,
      "publication_date": 20160722
    },
    {
      "title": "Five Stars",
      "text": "Perfect item to take care of our sand based chicken coop!",
      "rating": 5.0,
      "verified": true,
      "author": "Jonathan Parks",
      "helpful_votes": 0,
      "publication_date": 20161207
    },
    {
      "title": "Five Stars",
      "text": "the rake is just what I was looking for. tks very much",
      "rating": 5.0,
      "verified": true,
      "author": "paul l.",
      "helpful_votes": 0,
      "publication_date": 20161122
    },
    {
      "title": "Thanks bro.",
      "text": "My brother liked mine so much I had to buy one for him.",
      "rating": 5.0,
      "verified": true,
      "author": "Rhedd_Phredd",
      "helpful_votes": 0,
      "publication_date": 20160929
    },
    {
      "title": "Works as advertised. Wish I would have found this ...",
      "text": "Works as advertised. Wish I would have found this product sooner.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20151012
    },
    {
      "title": "... the sand in my chicken koop and it works great. Also some earlier reviews complained about the shovel ...",
      "text": "I bought this shovel to remove chicken poop from the sand in my chicken koop and it works great. Also some earlier reviews complained about the shovel handle I don't know if they were listening or what but mine came with a perfect handle. I would definitely buy it again.",
      "rating": 5.0,
      "verified": true,
      "author": "K.M.Larson",
      "helpful_votes": 4,
      "publication_date": 20160414
    },
    {
      "title": "Awesome shovel. We got it to clean out the ...",
      "text": "Awesome shovel. We got it to clean out the chicken coop and it is fantastic for that particular chore! Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Nana",
      "helpful_votes": 0,
      "publication_date": 20170819
    },
    {
      "title": "One Star",
      "text": "did not realize it was so big and heavy so I sent it back.",
      "rating": 1.0,
      "verified": true,
      "author": "Leslie D. Terjesen",
      "helpful_votes": 0,
      "publication_date": 20170206
    },
    {
      "title": "Item was labeled correctly, but the actual item inside ...",
      "text": "Item was labeled correctly, but the actual item inside was pointed (heart shaped) shovel. Item returned and will shop elsewhere.",
      "rating": 1.0,
      "verified": true,
      "author": "Rebecca ",
      "helpful_votes": 0,
      "publication_date": 20170928
    }
  ],
  "product_meta": {
    "title": "Toolite 49492#2 Square Point Shovel, 48\" Wood Handle",
    "description": "Size:48\" Precision Lathe Turned Hardwood handleSeymour Toolite square point shovel with 48\" hardwood handle and 14 gauge #2 riveted head. Toolite scoop is perfect tools for sifting and removing debris when top-dressing athletic fields, courses, and diamonds. They sift debris from sand on beaches and in golf course bunkers and all types of soil. Great for screening and sifting rocks and unwanted material during pre-seeding and pre-sodding of lawns and landscapes. 9.5 inch x 11.5 inch,Forward Turned Step Perforated, Solid Steel Rivet,48 inch Precision Lathe Turned Hardwood,Weight: 3.6 Pounds,Height: 5 inch, Width: 9 inch,Length: 58 inch,Blade Gauge:14 Gauge,Handle Type:Long Handle,Handle Material :Hardwood .",
    "rating": 4.7,
    "feature_bullets": [
      "Mud and muck releasing blades",
      "14 gauge tempered steel heads with 3/8\" holes",
      "Reinforcing cores are polymer jacketed fiberglass",
      "Lightweight, ergonomic, and will cause less fatigue",
      "Thick walled wood handles"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "48 x 3 x 0.6 inches; 3.6 Pounds",
      "Item model number": "49492",
      "Date First Available": "October 13, 2008",
      "Manufacturer": "Seymour Midwest LLC",
      "ASIN": "B00PM8866U",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}",
      "GTIN": "046385494928"
    },
    "categories": [
      "Patio, Lawn & Garden",
      "Hand Tools",
      "Spades, Shovels & Trowels",
      "Shovels",
      "Gardening & Lawn Care",
      "Industrial & Scientific"
    ],
    "price": 78.89
  }
}