{
  "website_summaries": [
    {
      "verdict": "A decent quality kit that works well for minor repairs, but you may want to consider another option if you're looking to repair larger watches.",
      "pros": [
        "147 pieces that include a case opening knife, a variety of screwdrivers, and a spring bar removal tool",
        "Well made tools for the price",
        "Comes with a zippered case for storage",
        "Works well for changing watch batteries and other minor repairs"
      ],
      "cons": [
        "The lack of instructions here make this kit a little difficult to use",
        "Screwdriver tips chip/break easily",
        "Not made for larger watches"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Value for money",
      "text": "Quality is good, read few reviews about poor quality product but doesn't seems like it, works good. They case should have been a bit bigger to keep tools organized.",
      "rating": 5.0,
      "verified": true,
      "author": "Ruturaj Bhalerao",
      "helpful_votes": 215,
      "publication_date": 20190104
    },
    {
      "title": "Perfect kit for adding/removing watch band links",
      "text": "the Ohuhu Professional 147 PCS Watch repair tool kit is a fantastic bargain for great quality pieces. I got it so i could try to remove a few links from my wifes new Fossel Smart Watch and it worked great. The link pins in her band were VERY difficult to remove without the specialty tool provided in this kit, with that tool it was painless. Worked so well i adjusted bands on both of my daughters watches as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Shutter",
      "helpful_votes": 158,
      "publication_date": 20181203
    },
    {
      "title": "Love it.",
      "text": "This has paid for itself. I used to pay 8 dollars per watch at a local store to change the battery. I only own one expensive watch which goes to the authorized Tag dealer, the rest are inexpensive ones. The batteries are probably the cheap ones from China and they never lasted. This time around I ordered batteries from Amazon and was able to fix four watches in about 30 minutes (also resized a metal band). Love it.",
      "rating": 5.0,
      "verified": true,
      "author": "RT",
      "helpful_votes": 180,
      "publication_date": 20171208
    },
    {
      "title": "Best purchase ever",
      "text": "So I purchased this a while ago to be able to change the batteries on my Swiss timepieces. Now to traditionally go and have your battery changed at the places I go is usually around $50 to $100 per watch. So having about 4 watches can be quite pricey. Now that I have this I can actually save myself a little bit of money here and there and change my own batteries whenever I need 2 and Beauty do so without hurting my watch at all. And it was so good that I've actually suggested to my brother who also has a couple Swiss timepieces to invest his money into this as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Inkd n Fit",
      "helpful_votes": 157,
      "publication_date": 20171229
    },
    {
      "title": "Tools are flimsy and made out of tizzy foil like material so your tool will strip before the watch ...",
      "text": "Please save your money and DO NOT BUY THIS. This is cheapest quality Chinese knock off product. First job on the first day screws stripped out of the handle and no longer held in the handle. Also non of the parts here are necessary to do anything legit. Tools are flimsy and made out of tizzy foil like material so your tool will strip before the watch will. I have never wrote review in Amazon before and I truly feel that no one should waste their money on this. Save your money and the time. Hope this helped.",
      "rating": 1.0,
      "verified": true,
      "author": "chopacabura",
      "helpful_votes": 167,
      "publication_date": 20180403
    },
    {
      "title": "it's crap, but it will do the trick for many ...",
      "text": "Overall, the product is sufficient at this price point. I personally don't believe it is worthy of the positive reviews received, however, and it is no different from any of the other, low-end cheap watch repair kits out there. I have used this only two times. The watch case opener left shreds of metal everywhere. One of the screwdrivers chipped with first use. It's cheap, it's crap, but it will do the trick for many purposes. Nevertheless, I regret this purchase. Would have been better off spending the money on the specific tool I needed, getting better quality, instead of a poor-quality kit.",
      "rating": 2.0,
      "verified": true,
      "author": "Suzy Katz",
      "helpful_votes": 55,
      "publication_date": 20171221
    },
    {
      "title": "Extremely Disappointed----------",
      "text": "Being new at wanting to change my own watch batteries in some of my old watches I could not believe there were NO instructions or any idea what you are suppose to do with 99% of items included. I spent several days Googling ANY help in what to do with the \"tools\" included in this \"repair tool kit case\" and have gotten nothing more than frustration. I have had better luck with buying a eyeglass repair kit & items I already had in order to replace watch batteries. There should have been some sort of information on how to utilize what came in this kit.",
      "rating": 1.0,
      "verified": true,
      "author": "Nana",
      "helpful_votes": 39,
      "publication_date": 20180331
    },
    {
      "title": "Worthless",
      "text": "I agree with others that there are no directions.The diagram of the list of contents is not labeled properly. When I finally found a good video on how to remove the screw-on watch back and carefully followed those directions, I could not remove the watch back on two different watches. The removing wrench components wiggle around, and after a few tries the pins wear so that they will no longer stay in the slots. Customer service was excellent. I received a full refund.",
      "rating": 2.0,
      "verified": true,
      "author": "Art Fensterwals",
      "helpful_votes": 29,
      "publication_date": 20180826
    },
    {
      "title": "Cheap, but it does the trick",
      "text": "If I were a professional watch maker I definitely would want better tools, but for the few times I need to adjust a watch band or change a battery this works just fine. The tools are all cheaply made and a bit on the flimsy side, but at less than $20 it pays for itself fairly quickly. In addition to the nice case, it also includes in instruction sheet, which is a bit of a joke. It's basically a photo copy of an instruction sheet in very small print. You're better off looking for instructions online or on YouTube.",
      "rating": 4.0,
      "verified": true,
      "author": "Windy City Guy",
      "helpful_votes": 15,
      "publication_date": 20181011
    },
    {
      "title": "Not Usefull for me",
      "text": "If the back of your watch isn't already a bit loose and easy to remove, this device won't get it done either. I was useless, the only thing in the kit that might be useful was all the pins for different size watches, and I didn't need that, I needed something to remove the battery. Took my watch to a watch repair shope and let htem to it for $15.00. If you manage to get a older watch back off, this may be useful.",
      "rating": 1.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 21,
      "publication_date": 20180419
    },
    {
      "title": "Not impressed.",
      "text": "1. They show 14 tools numbered in the instructions, but only tell you the name of 10 of them. They are also mislabeled?! 2. They repeatedly reference the watch band holder, but it isn't included in the kit. Maybe this kit works for people who are very familiar with watch repair, but for someone who has never tried to fix a watch or change a watch battery, I could have used a little more direction or just basic information on the names of the tools, so I could have Googled how to use them.",
      "rating": 2.0,
      "verified": true,
      "author": "Mackenzie Steffee",
      "helpful_votes": 14,
      "publication_date": 20190112
    },
    {
      "title": "Tools are usefull",
      "text": "I like the tools and the set seems to include all I really need. However the reason I purchased the set was mostly for the tool to open the back of my invicta warches. So I order a bigger size for that part of it and the large one was too big. So I ordered the one that looks like a rectangle with the adjustable 2 pin slots. Maybe if you all took out the 3 prong opener and replaced it with the 2? It would have then been perfect. Love the case that it all goes in to keep it all self contained.",
      "rating": 4.0,
      "verified": true,
      "author": "Richie Goodwin",
      "helpful_votes": 15,
      "publication_date": 20170720
    },
    {
      "title": "Buyer BEWARE!",
      "text": "While a nice selection of tools, it's not \"professional\". The handle on the adjustable case wrench was bent so badly that I had to bend it straighter to be able to open the wrench; bending metal shafts usually causes them to break and if they don't break they are seriously weakened. I hope mine won't break the first time I actually use it. The watch holder has the non-adjustable stop askew ... but should work for intended purpose. About the best thing I can say about this tool collection is that it comes in a nice zippered case.",
      "rating": 2.0,
      "verified": true,
      "author": "Arnie",
      "helpful_votes": 11,
      "publication_date": 20180510
    },
    {
      "title": "Product packaging was good. The product itself was of poor quality",
      "text": "Product packaging was good. The product itself was of poor quality. No sure why this was amazon's Choice Screw driver tips were bent or chiseled. Corrosion on some parts.",
      "rating": 1.0,
      "verified": true,
      "author": "Jerry",
      "helpful_votes": 22,
      "publication_date": 20171220
    },
    {
      "title": "Ohuhu watch repair tool kit",
      "text": "Its a good tool for replacing watch batteries. Previously i go to the mall and have them replace my watches and my wife watches batteries but they are overcharging us - $20.00 for a watch and the battery they are putting probably old stock that they only last for 8 months to a year. Now i replace them using this tool and using better quality batteries. Overall pretty happy with this tool.",
      "rating": 5.0,
      "verified": true,
      "author": "Sparky",
      "helpful_votes": 16,
      "publication_date": 20170111
    },
    {
      "title": "Ohuhu Terrible Products",
      "text": "I am returning the watch press. When we used the tool to twist off the watch back, the tool we discovered was broken. We made it work, but after purchasing two Ohuhu items in 2 weeks and they both broke, I won't be buying their products ever again.",
      "rating": 1.0,
      "verified": true,
      "author": "W. T. - Golden",
      "helpful_votes": 11,
      "publication_date": 20180306
    },
    {
      "title": "Only works on small & ladies watches",
      "text": "Tried it on four watches, two Timex, two NaviForce. The case knife for opening the pry off backs on the Timex simply cannot be made to remove them. The Adjustable wrench for the screw off backs on the Naviforce watches simply will not open far enough to engage the slots, nearly 1/4\" to small at widest opening. Back it goes for a refund.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 7,
      "publication_date": 20181014
    },
    {
      "title": "Very very good but not perfect",
      "text": "This kit is very capable. It is not surgical quality but for the money, it is a very good buy. Lot's of extras that I doubt I'll need but to save $35 changing out an Energizer $4 battery, One time it's paid for itself. I would buy again and the little tools make band removal easier and the big tweezers are very useful. It would rate 5 stars but it is long on \"appearance\" and a tad short of \"precision\". But a very good tool. Changed 4 batteries since I received it Saturday. I might give these as gifts the Xmas.",
      "rating": 4.0,
      "verified": true,
      "author": "Bham Man",
      "helpful_votes": 8,
      "publication_date": 20170731
    },
    {
      "title": "Tool does not fit larger brands of watches.",
      "text": "Overall, great for changing batteries and links on your watch. Downfall, if you have a larger watch, invicta, or diesel watch, these tools won't fit to change it. Wish it would of acknowledge this on their product description as it's false advertisement. Customer service reached out to me, but seems that they're not very intelligent with assisting customers. I would recommend a different brand for a few dollars more. The pieces that are to attach to the remover, get stuck and don't come out. Poorly made.",
      "rating": 1.0,
      "verified": true,
      "author": "Scott",
      "helpful_votes": 6,
      "publication_date": 20181115
    },
    {
      "title": "Lowest quality item I have purchased from Amazon",
      "text": "First time I attempted to take apart a watch band, the pins on the remover bent (2x) and broke (1x). Then tried to push through the clip with the gold colored tool - bent the pin off. Tried to remove the back - impossible with the back remover which would not hold the three pins in place stable enough to unscrew the Seiko watch back. Finally used another screwdriver (not from this kit) to push the the small clip through - it wasn't that difficult. It's going back tomorrow",
      "rating": 1.0,
      "verified": true,
      "author": "SB",
      "helpful_votes": 4,
      "publication_date": 20190310
    },
    {
      "title": "The opened is Garbage but the rest of the kit is decent",
      "text": "the Opened is cheaply made I can’t get to work, also if you have a big watch it won’t reach the opening points, this is made for small watches A bit disappointed I bought this to open my Bulova and the opener won’t reach the opening points plus the opener inserts are cheap they wear fast and I just get to open one watch",
      "rating": 1.0,
      "verified": true,
      "author": "Dreek00",
      "helpful_votes": 7,
      "publication_date": 20171226
    },
    {
      "title": "Good tools cheap quality",
      "text": "The tools were a good assembly. Good for watch maintenance. I have a tonne of watches and every now and then I have to keep changing straps and batteries so these set of tools come handy. But the quality wasn’t so great. The blue plastic strap remover thing was so cheap it cracked while I was using it. I had to use the hammer instead. Would’ve been useful if it came with those square - silicone - strap holding thing that other models have. It shows in the pictures and I thought it’s included. Overall average to below average product.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20190123
    },
    {
      "title": "You get what you pay for.",
      "text": "I liked that there were so many tools, most made from metal, and that all had a purpose, more or less. I did not like how the instructions that came with it were completely incorrect. I had to re-write the numbers myself by deducing which tool had which name and had which purpose. I liked how it was cheap (I realized why, after purchase) because I really only needed it for adjusting watch links.",
      "rating": 3.0,
      "verified": true,
      "author": "JOlivo94",
      "helpful_votes": 3,
      "publication_date": 20190122
    },
    {
      "title": "Not for larger watches",
      "text": "The kit overall seems to be good quality. Unfortunately the kit doesn't work for larger mens watches. I could not insert the fittings into the 3 prong back remover. Only one snapped in the other two would not fit. I was able to remove the back watch cover using two prongs with one not fully inserted. Once the back was removed I was unable to remove the small screw for the battery holder. None of the screwdrivers provided in the kit would fit the screw. All screwdrivers were too big.",
      "rating": 2.0,
      "verified": true,
      "author": "Jay",
      "helpful_votes": 3,
      "publication_date": 20190211
    },
    {
      "title": "Now I can change my own watch batteries",
      "text": "Worth every penny because now I can maintain my own watches instead of paying a jeweler. I also think that watch manufacturers should include a service manual with their watches instead of locking people into an expensive cycle of relying on a \"specialist\" to do something people can do for themselves. I marked this item down one star because they don't provide details on what each tool is used for. I had to watch YouTube videos to understand what's in this kit. It's a great purchase and I wish I had bought one of these a long time ago.",
      "rating": 4.0,
      "verified": true,
      "author": "Cedrick",
      "helpful_votes": 4,
      "publication_date": 20170606
    },
    {
      "title": "Pass on this one - Wouldn't buy again",
      "text": "Purchased to work on a few new watches (band resizing). The pin pusher is plastic and junk. Others tools are meh / lower quality. Spend a little more and get something that will actually work again and again. Me, I'm off to the local jeweler to have the bands done, while my Ohuhu collects dust.",
      "rating": 2.0,
      "verified": true,
      "author": "JT",
      "helpful_votes": 3,
      "publication_date": 20181212
    },
    {
      "title": "Spanner wrench and interchangeable bits are very poor quality. The shape of the small square bits ...",
      "text": "Spanner wrench and interchangeable bits are very poor quality. The shape of the small square bits were not square, the round tipped bits and large flat bits were okay. Spanner wrench would not open far enough to fit older Casio G-Shock watch back. It just barely adjusted large enough to fit a Bulova Marine Star. I returned it. Overall poor quality.",
      "rating": 2.0,
      "verified": true,
      "author": "Speedy",
      "helpful_votes": 4,
      "publication_date": 20180415
    },
    {
      "title": "This kit could use some instructions.",
      "text": "I was able to resize 4 watchbands using the punches and the hammer so I guess this kit has probably paid for itself. The 5th watch, a new Seiko, does not use the usual pin setup so I was unable to resize that one. No instruction book so you have to rely on u-tube videos. However I have not been able to open the case backs to change the batteries. But another tool, a back press, is required to install the press fit backs. I guess a trip to the jewelers will be required for battery changes.",
      "rating": 2.0,
      "verified": true,
      "author": "burt",
      "helpful_votes": 4,
      "publication_date": 20180227
    },
    {
      "title": "Buy a better Kit",
      "text": "This Kit had very poor instructions and showed a fixture that I needed that actually did not come with this Kit. The pins for the watch strap were many but the size I needed was not included with the 108 pins in the pack. For a few more bucks I would buy the larger Kit. I was adding a new strap to a Guess Watch, and did not have the pins to do it.",
      "rating": 2.0,
      "verified": true,
      "author": "Jack Duncan",
      "helpful_votes": 3,
      "publication_date": 20190128
    },
    {
      "title": "Must know what you're doing. No instructions with kit.",
      "text": "Has a lot of pieces, except no item description with kit. Had to look up kit and make a copy off the site. Blue link remover is real cheap plastic, broke 3 needles trying to remove 1 link from band. Did not have watch back replacement tool. Should state on buying site, must purchase separately.",
      "rating": 3.0,
      "verified": true,
      "author": "Rima Phillips",
      "helpful_votes": 3,
      "publication_date": 20190127
    },
    {
      "title": "Quality is just not there.",
      "text": "This is exactly what it is, a watch repair kit. But not a good one. The quality of the tools included are absolutely poor. A lot of the tools have metal burs, sharp parts, or are just plain crooked. If you’re fixing a watch a year with it, it might last, but I can tell with the quality that it won’t last very long. I would not recommend working on nice expensive watches with this kit. I’d recommend something a little more quality oriented for those watches. I can say it did get the job done, but it’s hard to trust such flimsy tools.",
      "rating": 2.0,
      "verified": true,
      "author": "iRambes",
      "helpful_votes": 0,
      "publication_date": 20190501
    },
    {
      "title": "Clunky plastics and bent pins.  Over hyped reviews.",
      "text": "The kit is clunky with cheap plastic and it feels like it would shatter if dropped. The braclet pin remover came with bent pins making the most useful thing in the kit useless. Secondly, the spring bar remover is very fat making it difficult to remove the bar without damaging the leather strap.",
      "rating": 2.0,
      "verified": true,
      "author": "Akai",
      "helpful_votes": 3,
      "publication_date": 20180503
    },
    {
      "title": "It's ok, a little cheap feeling",
      "text": "The tools got the job done, but there were 2 things I was disappointed in. 1) The tool that's used to poke the pins out of the links bent on literally the first attempt with not all that much pressure. 2) The instructions that are included are great, but they show different versions of the products that aren't included. For example, the box of pins is just one big mess rather than organized by length and labeled. Similarly, the springbar tool is shown in the booklet with a measure rule on the side but the one in the kit is just a solid color and no ruler.",
      "rating": 4.0,
      "verified": true,
      "author": "Ryan",
      "helpful_votes": 0,
      "publication_date": 20200604
    },
    {
      "title": "the machining is crap. It got the job done but barely",
      "text": "You get what you pay for. I had to force the inserts into the main tool, the machining is crap. It got the job done but barely.",
      "rating": 2.0,
      "verified": true,
      "author": "moto4sho",
      "helpful_votes": 4,
      "publication_date": 20180702
    },
    {
      "title": "A good buy",
      "text": "Its a decent watch repair kit. Used it to replace 5 watch batteries already, replacing a battery from a jeweler costs anywhere between 10-25$ per watch so this kit has already paid for itself! I would consider the tools of \"ok\" quality, the they are priced very cheap! My only gripe is the adjustable case opener only fits small watches 40mm and under. Its not that big of a deal tho, if you can manage to get to of pins into the notches on the back of your watch you should be able to screw it off. Overall a good buy, I would recommend it to any novice who just needs to replace watch bands or batteries at home.",
      "rating": 4.0,
      "verified": true,
      "author": "Ismail",
      "helpful_votes": 2,
      "publication_date": 20171129
    },
    {
      "title": "Perfect watch kit",
      "text": "Changing the batteries of the watch is so expensive so I ordered this kit and boy I love this one. It has saved me so many buck. it easy and i like it comes with a bag so everything stays put.",
      "rating": 5.0,
      "verified": true,
      "author": "Anki",
      "helpful_votes": 3,
      "publication_date": 20190811
    },
    {
      "title": "Perfect for Home Watch Repair",
      "text": "This is a great little set of watch repair tools for home use. I was able to easily separate the links of my watch band to gain unrestricted access to the watch back. Then, the included tools made it easy to securely hold the watch while I screwed off the back. Once the back was off, the included tweezers were perfect for resetting the \"perpetual\" date function in the watch once I had replaced the battery. Closing the watch back up was a snap and reassembling the band was easy too. Using this set of tools, I was able to save big bucks by not having to send my watch in for repair.",
      "rating": 5.0,
      "verified": true,
      "author": "Jack L.",
      "helpful_votes": 0,
      "publication_date": 20190223
    },
    {
      "title": "Waste of money",
      "text": "We bought this because idiot Walmart killed off the jewelry counter where he got his watch batteries replaced. For us it was a waste of money. You really have to know what you are doing with this thing. If you are a pro and need tools then great. If not, find a pro. Your good watches are worth taking to a jeweler. This did help me get the back off the watches but getting the back on again took more hand strength than I have and nothing in this kit helped. Ended up taking them to a jeweler anyway...",
      "rating": 2.0,
      "verified": true,
      "author": "Sehja",
      "helpful_votes": 0,
      "publication_date": 20200517
    },
    {
      "title": "Poor Investment",
      "text": "I ordered the kit in order to use one piece - the tool to remove the back on a watch in order to add a new battery. There were no instructions on what item was what and how to use each item. With147 pieces in ‘‘tis case, I have no idea what to use or how to use it. Totally a waste of money for me!",
      "rating": 1.0,
      "verified": true,
      "author": "Judy O.",
      "helpful_votes": 4,
      "publication_date": 20180215
    },
    {
      "title": "I didn't like it. I wish I paid more for a ...",
      "text": "I didn't like it. I wish I paid more for a better quality product. one of the screwdrivers was broken before I even get the chance to use it and it was the size which I actually needed and I was so annoyed to see it like this right out the box. and the pins for adjustable case opener don't get a tight fit in, and are so floppy and move around which makes it hard to work with. also the watch band link pin remover is a cheap plastic which didn't impress.",
      "rating": 2.0,
      "verified": true,
      "author": "Mohammad",
      "helpful_votes": 4,
      "publication_date": 20180708
    },
    {
      "title": "You get what you pay for.",
      "text": "For a 100+ all in one kid this is a great value. The whole kit costs the price of 1 battery replacement at a store. This is a great kit if your changing a battery here and there. But if you have multiple watches and watch back types, I would invest in a 3 point case wrench and a sturdier case opening knife. The two prong wrench gets the job done but can slip off if casing is too tight. Ditto the case opener knife doesn’t feel super sturdy vs. watch backs that are on very tight.",
      "rating": 4.0,
      "verified": true,
      "author": "L’escargot",
      "helpful_votes": 0,
      "publication_date": 20191006
    },
    {
      "title": "Nice kit",
      "text": "I liked the kit came with a lot of stuff extra pins for watch bands, tips for the tools Etc. however I did not get to use it much as the watch wrench to open backing of watch broke as soon as I used it, Metal pins in plastic case the plastic gave and the pin moves not strong enough to open my watch. I am investing in an all metal wrench now, looking forward to using the rest of the kit when I replace the wrench.",
      "rating": 3.0,
      "verified": true,
      "author": "Jason nishikawa",
      "helpful_votes": 0,
      "publication_date": 20200124
    },
    {
      "title": "More then enough.",
      "text": "I give it a four stare because it has more tool then I need. For the price plus I didn’t really know what particular piece I need it to take the back cover off so I bought it. Due to the pandemic I need my batteries changed before they started to leak sine I couldn’t go to the mall I order this tool set. Which will probably set in the drawer until I need to change the 10 yr battery I just bought again.",
      "rating": 4.0,
      "verified": true,
      "author": "Agent 87",
      "helpful_votes": 0,
      "publication_date": 20200621
    },
    {
      "title": "Good for smaller watches but not men’s watches.",
      "text": "I bought this kit mainly for the adjustable watch case remover but it is too small for 4 out of the 6 watches I own, even an average sized Fossil watch (pictured) is too big for the tool to span far enough to get a bite on the indentations of the watch. This kit is probably good for women’s and children’s watches but not for men. The case remover has a loose, almost sloppy feel when you try to adjust it to precisely fit the watch case as well.",
      "rating": 3.0,
      "verified": true,
      "author": "Rider",
      "helpful_votes": 0,
      "publication_date": 20201005
    },
    {
      "title": "It works for band removal and replacement",
      "text": "Pretty neat set of tools. I was able to remove a watch band and replace it without heading to the jewelers. Got to admit it took me a few attempts and a bit of time to do so but mission accomplished. The tool for spring removal is essential and I am sure works effectively in the hands of a professional. No matter, I was able to brace the watch effectively and replace the band. Basically a winner for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Lynn J.",
      "helpful_votes": 0,
      "publication_date": 20191116
    },
    {
      "title": "Good cheap watch repair kit to remove links and to replace batteries.",
      "text": "I was looking for a cheap watch repair kit that had both a link removal tool and the tool to untwist the back of a watch to replace batteries. This is a pretty cheap kit, not very sturdy and instructions are little hard to interpret. BUT it did THE JOB. No regrets on purchase. Did not spend a lot of time searching, but I am satisfied. Many items will never be used.",
      "rating": 3.0,
      "verified": true,
      "author": "cwglindn",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "Great little purchase...handy to have!",
      "text": "This kit is amazing! I spent some time comparing different kits on Amazon and this had everything I needed for a great price. Since I got it, I've taken out links on several watches I bought and switched out the band on another. I really need to change the battery in one, but it hasn't gone out yet. That will probably be next. This kit makes everything so easy and is totally worth the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200608
    },
    {
      "title": "Does the Trick",
      "text": "I bought this to avoid going to a jeweler to remove a link in my watchband. It may not have saved me any money this time, but it's nice to know that when I need it again I can do it myself so that over time I'll have saved some money. It was also nice to get a bunch of other tools that I might need to take care of my watch collection. The quality may be a bit lacking, but it's an alright value for the money spent. I've also since used the little pins that came with it to replace some original one, so once again it has come in handy.",
      "rating": 5.0,
      "verified": true,
      "author": "SwissAmerican",
      "helpful_votes": 0,
      "publication_date": 20190310
    },
    {
      "title": "Nice kit &case for the money",
      "text": "I liked that the kit was self contained in a nice case-- my husband replaces batteries in most all our many watches and I thought it would be a great kit but he felt it had alot of tools there wasn't the things he needed-- so I returned it.",
      "rating": 3.0,
      "verified": true,
      "author": "Kay Schultz",
      "helpful_votes": 2,
      "publication_date": 20180604
    },
    {
      "title": "Perfect kit for what I needed",
      "text": "I have a few cheaper end \"expensive\" watches. I afford them as I try to cut cost elsewhere. Some watch stores wouldn't touch my watch to just change out the battery. This kit works great, even on my larger Invicta watches. Maybe has more tools than needed for what I need. I've replaced watches and wrist bands with this kit. I would buy again if needed to replace.",
      "rating": 5.0,
      "verified": true,
      "author": "Matt Hammerbacher",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "Tools for most watches",
      "text": "The pin punches and pin pushers are tapered, so they can only push a pin about a quarter inch. My watch has pins that must be pushed half an inch. I pushed the first quarter inch using the tools in the kit, but then used heavy plyers to yank the pins out from the other side. Other than that, it's find and the stuff is solid enough to do precise watch work. For most watches this is going to meet the needs and good to have around all the replacement pins and doodles. Great customer service.",
      "rating": 5.0,
      "verified": true,
      "author": "Emre Yucel",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "Stop wasting time and money at the jewelry!",
      "text": "One day I decided I was fed up of wasting my time and money going to the jewelry shop to adjust my watches or replacing batteries so I bought this one. This is an excellent investment. I have worked on many brands and models of watches for my wife’s watches and so far this kit have had all the tools required to get the job done. I had zero experience but if you search in the web, you will find plenty of videos with instructions for DIY. Highly recommended!",
      "rating": 4.0,
      "verified": true,
      "author": "JARELLANO",
      "helpful_votes": 0,
      "publication_date": 20191109
    },
    {
      "title": "Lots of bits",
      "text": "Watch back removal tool has a plastic case instead of metal as it really needs too. A little too flimsy to use on some watches. Lots of other nice bits and pieces. If you need a heavy weight watch back removal tool then you might want to look at other more expensive tools. Update - the seller stands by their product wonderfully. I was contacted and dealt with very well.",
      "rating": 3.0,
      "verified": true,
      "author": "WW2 Reader",
      "helpful_votes": 0,
      "publication_date": 20200504
    },
    {
      "title": "sorta disappointed with the watch case remover tool",
      "text": "has most basic stuff.. sorta disappointed with the watch case remover tool, terribly made and can't unscrew the back of a watch with it.",
      "rating": 3.0,
      "verified": true,
      "author": "Daniel",
      "helpful_votes": 3,
      "publication_date": 20180725
    },
    {
      "title": "Very useful, great price",
      "text": "Great assortment of tools for the price. I was able to change the battery on 14 watches, change the wrist band on several and reduce the links on several wrist bands. It even came with extra wrist band springs. However, I discovered that I needed to buy an additional tool to snap the backs of the watches in place. Turns out inhuman pressure is needed to snap those in place without cracking the crystals. I bought a cheap on here in Amazon and now I'm all set. I'll use these tools forever. Good bye mall watch battery kiosk charging $30 per watch to change battery!",
      "rating": 4.0,
      "verified": true,
      "author": "Frontier Mom",
      "helpful_votes": 0,
      "publication_date": 20190129
    },
    {
      "title": "NOT TOP QUALITY",
      "text": "This kit was fine for one or two watch jobs but the items really are of moderate quality at best as are apparently all the kits in this price range. If all you're interested in is changing watch batteries once in a blue moon, this will be fine. If you tend to be a collector (or wannabe) it's not a bad place to start and then replace the items you use most with pricier choices.",
      "rating": 3.0,
      "verified": true,
      "author": "C. S. Campbell",
      "helpful_votes": 0,
      "publication_date": 20190424
    },
    {
      "title": "Screw driver broke right when I started using it",
      "text": "One of the screw drivers broke you get what you pay for but I still use everything else in the set",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20180812
    },
    {
      "title": "Great product! Great value!",
      "text": "Not a watchmaker, but I have changed lots of batteries and fixed watchbands. I had acquired several watches over the years, but there are very few places that will change a battery anymore. Wal-Mart will let you use their tools, but they are really really and don't work well at all! I had most all of my watches repaired and working in no time with this toolset.",
      "rating": 5.0,
      "verified": true,
      "author": "emiee55",
      "helpful_votes": 0,
      "publication_date": 20190529
    },
    {
      "title": "Great set for DIY watch maintenance",
      "text": "I used to work for a store that did battery replacements, band adjustements and small repairs and I wanted a set of tools so I could do my only battery replacements and link adjustments because I know how expensive it can be. After I replaced one battery using the screw back tool the set has paid for itself. Currently looking at all of my watches with dead batteries to see what kind of batteries I need to order. I would definitely recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Lucy S.",
      "helpful_votes": 0,
      "publication_date": 20180924
    },
    {
      "title": "Decent starter kit",
      "text": "I was expecting a bit more options for screwdrivers. At least 1 or 2 tiny phillips head drivers would be a great addition to this kit. For the most part, it's a useful kit, and it will get you started. I should have spent more money and got a more advanced kit.",
      "rating": 3.0,
      "verified": true,
      "author": "Ron",
      "helpful_votes": 0,
      "publication_date": 20190215
    },
    {
      "title": "This box is so great.",
      "text": "I never knew much about changing my own battery but we have so many watches in this family and the cost of taking them in to the jewelers was adding up fast. This paid for itself after the 1st battery was changed. Some watches are still too hard for me to take the backs off but most of them we have done our selves now.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "Great for most watch sizes",
      "text": "Bought this since I had about 9 dead watches sitting, collecting dust for a couple of years. All of them were brought back to life except a couple of invicta watches, which are pretty large. But a separate larger tool for those. Also adjusted some watches' bands by removing links. Overall, great value. Buy this and watch YouTube instead of spending money on a watch repair service.",
      "rating": 4.0,
      "verified": true,
      "author": "elephntindaroom",
      "helpful_votes": 0,
      "publication_date": 20190213
    },
    {
      "title": "Wrong tool for the job",
      "text": "The simple answer for this job is to replace the batteries. No instructions was provided with the can. I had to deal with Customer Support and then get the batteries from Amazon or another source . The \"kit\" recommended was never needed to get the cane working again. However, let me add that Ohuhu customer support was very helpful once you got to them. ohuhusupport@gmail.com (not sure of exact email)",
      "rating": 1.0,
      "verified": true,
      "author": "sjrgnm",
      "helpful_votes": 0,
      "publication_date": 20200121
    },
    {
      "title": "Good kit! Affordable.",
      "text": "I only needed a couple of tools from this kit to hold a band and to remove/replace pins to shorten the band, but I bought the whole kit anyway as I couldn't find the parts separately. However, I wasn't concerned as this is a nicely made and affordable set of tools that will likely last many generations.",
      "rating": 5.0,
      "verified": true,
      "author": "dpb",
      "helpful_votes": 0,
      "publication_date": 20200515
    },
    {
      "title": "Good quality tools, nice case",
      "text": "For something I am going to use one in a blue moon, it is perfect. I was able to remove the pins in my new Citizen watch and cut the rubber band to fit me. I also used it to replace a couple dead batteries, so with just these couple things done, the kit paid for itself....Very happy with this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Jgpapillon",
      "helpful_votes": 0,
      "publication_date": 20200921
    },
    {
      "title": "Do it yourselfers all in one",
      "text": "Do it yourself instead of paying someone to change that battery or size that watch of yours. This mini kit has it all to tackle anything watch related. The price makes it an excellent value that will pay for itself after 1-2 repairs at home. Comes in a easy peasy zipper cass that keeps it safe. I am a fan",
      "rating": 4.0,
      "verified": true,
      "author": "Cangel",
      "helpful_votes": 0,
      "publication_date": 20200504
    },
    {
      "title": "Great watch tool kit",
      "text": "It helped me change batteries on 2 fossil watches I hadn’t worn in years. It was pretty easy to use and there are a ton of tools in it. I’m not sure that they are professional quality, but for the random person like me who wants to remove a link or change a battery occasionally, it works great.",
      "rating": 5.0,
      "verified": true,
      "author": "GraysonT",
      "helpful_votes": 0,
      "publication_date": 20191123
    },
    {
      "title": "Perfectly good for ocasional use.",
      "text": "After reading some negative reviews I was a bit skeptical about quality, but I used it once to replace battery and I have to admit it is perfectly fine. There is no manual so I guess some of those disappointing users was not exactly sure what they were doing. Thought I am sure it is not for professionals nor for every day use, but for occasional battery replacement and adjustments I won't ever need another one.",
      "rating": 5.0,
      "verified": true,
      "author": "Edward Vakhler",
      "helpful_votes": 4,
      "publication_date": 20151014
    },
    {
      "title": "Remove any watch locking cap",
      "text": "I have some old seiko quarts watches with the square notches on the side. Once you put the right adaptors and hold the watch properly it was easy to remove . You might struggle the first time until you get the handle but after 3rd try it was smooth for there on. Will definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Clo",
      "helpful_votes": 0,
      "publication_date": 20201016
    },
    {
      "title": "The rest of the kit was like a bonus for me for future adjustments for my ...",
      "text": "Got this kit specifically for the small screwdrivers, so I could change the bands on a weird Skagen watch (the band is hold by screws rather than springbars). The rest of the kit was like a bonus for me for future adjustments for my watches However, the screwdrivers' tips got so marred after the job that I don't believe they can be used anymore. Besides, the small hammer came loose from the handle, so it is also useless Next time I will buy some specific tools for the job.",
      "rating": 2.0,
      "verified": true,
      "author": "Antonio Rios-Manrique",
      "helpful_votes": 3,
      "publication_date": 20160710
    },
    {
      "title": "One Star",
      "text": "No instructions and I, who can usually figure out this kind of thing, couldn’t. Sending it back.",
      "rating": 1.0,
      "verified": true,
      "author": "Astute Consumer",
      "helpful_votes": 3,
      "publication_date": 20180326
    },
    {
      "title": "Neat stuff for the ordinary person",
      "text": "I bought on a whim since I've had a bunch of old watches in a box which need new batteries. And if you like to tinker why not have more neat little tools too? All self contained in a decent pouch so hopefully it'll keep me from losing pieces of the kit over the coming years. Probably overkill for my immediate needs but more tools are always better, especially when there's no significant cost savings to get fewer tools. I've since opened about a dozen watches to change batteries and make minor adjustments. No issues with the quality of the tools so far.",
      "rating": 4.0,
      "verified": true,
      "author": "SixtyFourTop Contributor: Smart Home",
      "helpful_votes": 0,
      "publication_date": 20170601
    },
    {
      "title": "Great watch repair kit!!",
      "text": "Fixed six watches in about 15-20 minutes. Replacing batteries and watch bands was so easy! All those old watches that have been sitting in drawers for years are now working again. So very satisfying in this era of “just throw it away and buy another” to actually repair a perfectly good watch.",
      "rating": 5.0,
      "verified": true,
      "author": "Hillary S",
      "helpful_votes": 0,
      "publication_date": 20200218
    },
    {
      "title": "Not Good",
      "text": "Was hoping to save some money and change my own watch batteries, but nothing in this kit works no matter what watch I tried it on. A total waste of my money.",
      "rating": 1.0,
      "verified": true,
      "author": "ChrisGem",
      "helpful_votes": 2,
      "publication_date": 20180921
    },
    {
      "title": "Great kit for the beginner!",
      "text": "Great kit for the beginner! There is somewhat of a learning curve because there are so many tools included. It took reading the instructions included then going to the Amazon sales page and watching the vids, it only took about 20 min. This cleared up the many uses of this very comprehensive tool kit.",
      "rating": 4.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20200909
    },
    {
      "title": "Easy to changes our batteries",
      "text": "I just purchased this kit. I like to wear many different watches and getting batteries fo a lot of watches can be expensive. This will help me take care of them for a more reasonable cost. The kit was easy to use and made it fast to change out batteries. I don’t know why I didn’t get one before.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Gordon",
      "helpful_votes": 0,
      "publication_date": 20190719
    },
    {
      "title": "Poor quality items. Returned after 3 hours",
      "text": "I didn't want to believe the comments, but yeah. Sadly it is true SOME items are very cheaply made. Right out the bag this item broke. The handle is plastic and from the photo you can see that it's chipped, if I were to apply even a small amount of pressure this thing would snap right off. Don't buy if you are planning on using the watch case remover",
      "rating": 1.0,
      "verified": true,
      "author": "Charlotte",
      "helpful_votes": 0,
      "publication_date": 20191218
    },
    {
      "title": "Filthy/Fixed",
      "text": "I believe I received a used set of tools. The box the tools were packed in was filthy, and the case was crusted with dirt. And some of the tools show wear. UPDATE: The company has graciously made this right. I will be changing my review to 5 stars. Thank You.",
      "rating": 5.0,
      "verified": true,
      "author": "Cremekat",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "Fantastic",
      "text": "This item LITERALLY paid for itself within the first 2 hours of delivery!! I set to work on my fave 3 timepieces and got them up and running in no time without paying an expensive repair bill. I’m also pleased with the early delivery (a whole week earlier than expected)!",
      "rating": 5.0,
      "verified": true,
      "author": "cBj",
      "helpful_votes": 0,
      "publication_date": 20200712
    },
    {
      "title": "Great Quality Tool Set!",
      "text": "Ok so I was definitely skeptical about the quality when I purchased this set but I must say, AWESOME! Highly recommend this company. Fast delivery, quality tools and great customer satisfaction offering for those not happy with it. Honestly can’t imagine anyone being unhappy with it however to each their own.",
      "rating": 5.0,
      "verified": true,
      "author": "Billie A.",
      "helpful_votes": 0,
      "publication_date": 20200614
    },
    {
      "title": "Great for battery replacement and link removal",
      "text": "Liked the package. Helped me replace batteries on 3 of my watches and some of my girlfriends watches as well. Not all watches had the same back but this had every tool I needed. Only thing that would of been nice to have is a watch press to press in backs that do not want to cooperate. All in all I like the product and recommend for anyone who doesn’t like to go have someone else do it for them",
      "rating": 4.0,
      "verified": true,
      "author": "Moses Arias",
      "helpful_votes": 0,
      "publication_date": 20190606
    },
    {
      "title": "great tool",
      "text": "Great value for money. I used it to change batteries and change the size of the wrist bands. It can open snap back covers and mechanical covers. The only thing missing is the watch press needed by some snap covers. I used one customer review to close it with pliers and a cloth. Would totally recommend it. It comes with a list with all that's included (a little different from the catalog that comes along). Not enough instructions, but youtube videos will get you covered.",
      "rating": 5.0,
      "verified": true,
      "author": "Mohamed",
      "helpful_votes": 0,
      "publication_date": 20190818
    },
    {
      "title": "Useful tool kit",
      "text": "So item came quickly and it does have a lot of useful tools for making adjustments to watches and brackets and the like. The diagram of what the devices are is useless as it is mislabeled and you cannot read all the identifying numbers. The directions are a joke at least the copy that came with mine. You can figure out what most of the tools are for.",
      "rating": 4.0,
      "verified": true,
      "author": "John DW",
      "helpful_votes": 0,
      "publication_date": 20181009
    },
    {
      "title": "Customer service is top notch",
      "text": "Ive received the kit in a timely manner. The tools are all in working condition. Not the best quality pieces of course for this price but they all worked as intended. I realized that i didnt receive the spare tips for the spring bar removal tool and contacted customer service and within a day they sent me a whole kit as a replacement and let me keep the old kit too.",
      "rating": 5.0,
      "verified": true,
      "author": "jhuang",
      "helpful_votes": 0,
      "publication_date": 20190505
    },
    {
      "title": "Two prong wrench is complete garbage - UPDATE",
      "text": "The two prong wrench broke on first use. Super cheap - made with soft plastic. Stay away! UPDATED - I was sent a replacement.",
      "rating": 3.0,
      "verified": true,
      "author": "RM",
      "helpful_votes": 56,
      "publication_date": 20200111
    },
    {
      "title": "Do not buy!",
      "text": "Garbage and poor quality. Did not work at all. The bits for the wrench were in such bad shape it scraped my watch.",
      "rating": 1.0,
      "verified": true,
      "author": "Cej",
      "helpful_votes": 2,
      "publication_date": 20181007
    },
    {
      "title": "Well worth the money and excellent customer service by seller",
      "text": "I love the product. It already saved me some money on my watch battery replacements. The customer service by the seller is out of this world. I highly recommend this product to anyone who wants to save a lot of money through the years as long as they own a battery-operated wrist watch.",
      "rating": 5.0,
      "verified": true,
      "author": "scorpiojazz",
      "helpful_votes": 0,
      "publication_date": 20190401
    },
    {
      "title": "Another Quality Product",
      "text": "With these tools I was able to adjust my watch band to fit well. Two concerns though, the band support did not hold the band firmly, and the band pin extractor is very loose and difficult to align. It also seems that it will not last long as the pin bent on the first use.",
      "rating": 4.0,
      "verified": true,
      "author": "C. M. Guzowsky",
      "helpful_votes": 0,
      "publication_date": 20190803
    },
    {
      "title": "An Ok Kit for Occasional Watch Maintenance",
      "text": "Pretty low grade metals but should be fine for us amateurs who want to change their own batteries and remove bracelet links. If you plan on fixing your friend's watches maybe spend more and get higher grade tools that won't deform after a few uses.",
      "rating": 4.0,
      "verified": true,
      "author": "HMG",
      "helpful_votes": 0,
      "publication_date": 20200729
    },
    {
      "title": "It works.",
      "text": "The tool kit has a lot of plastic parts which I don't think will last long. However, the tools I used are working. I used the tools to open my watch back plates (both screwed in and snapped in) and replaced batteries. The tools also made watch band removal/install a very easy task.",
      "rating": 4.0,
      "verified": true,
      "author": "Horseman",
      "helpful_votes": 0,
      "publication_date": 20190505
    },
    {
      "title": "Not as described",
      "text": "Kit arrived with a watch back removal tool handle bent and the small vice not as pictured/described. Try to contact as suggested at support@ohuhu.com and email returned 2x as recipient not found. That's an alert. Handling through Amazon and will advise when replacement arrives.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20181212
    },
    {
      "title": "An excellent value kit",
      "text": "I've had this product two days and in that time, fixed as many watches. They were all easy fixes with the right tools, but would've been frustratingly difficult without. You may end up wanting a better version of 1 or more of the told included in this kit eventually, but every tool works & the value cannot be beaten.",
      "rating": 5.0,
      "verified": true,
      "author": "Peter A Rossi",
      "helpful_votes": 0,
      "publication_date": 20200628
    },
    {
      "title": "Handy for the watch collector",
      "text": "I collect watches and got this kit so I could change batteries and remove links myself. It's a decent starter kit, but the back removal tool does not work near as easily as I had hoped it would. It is easier to just use a razor blade. The tools for removing links work well, and it comes with an assortment of pins for replacements. The tools are of a decently good and sturdy quality, and the storage case is a nice compact size.",
      "rating": 4.0,
      "verified": true,
      "author": "Hyzenthlay",
      "helpful_votes": 0,
      "publication_date": 20190910
    },
    {
      "title": "Does The Job",
      "text": "Quality is ok but good value - what can you expect from such a low price point. A couple tools got bent, but I was able to adjust my Casio World Time metal bracelet and change the battery in my quartz Nixon. Going to a jeweler would've cost $20-30 for both of those. So I'd say worth.",
      "rating": 4.0,
      "verified": true,
      "author": "smke",
      "helpful_votes": 0,
      "publication_date": 20200206
    },
    {
      "title": "This kit will save you time and money by allowing you to do your own repairs",
      "text": "This a great kit with anything you could possibly need. It is well worth the cost when it will save money by not needing to take it to a jewelry store to get our battery changed. I only wish that there were more directions and explanations about what everything is and how to do some of the repairs. Otherwise I am extremely happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Crystal",
      "helpful_votes": 0,
      "publication_date": 20181112
    },
    {
      "title": "Not happy with it nothing telling what each tool is used ...",
      "text": "Not happy with it nothing telling what each tool is used for or how to use them, no directions at all",
      "rating": 1.0,
      "verified": true,
      "author": "Charles J.",
      "helpful_votes": 3,
      "publication_date": 20180412
    },
    {
      "title": "Gress as t variety great price.",
      "text": "Have bought several of these for personal use and gifts. Works fine for the occasional battery change or band adjustment. Not the quality professionals would use but great for my needs at a small fraction of the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Kenneth F.",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Really cheap quality",
      "text": "Very disappointed in the tool set, while it looks like it has variety, I found the quality to be very poor. Please look at the pictures and see how the flat side of the spring bar broke and two of the pushers were bent. All of that on changing the band on one watch. Also there is a design flaw in the case, where if you have the hammer inside of it, it won't zip shut and the hammer falls off. I used the tools for the first time after 30 days and now can't return it. Waste of money, avoid at all costs.",
      "rating": 1.0,
      "verified": true,
      "author": "H. Bushra",
      "helpful_votes": 2,
      "publication_date": 20180907
    },
    {
      "title": "Very useful",
      "text": "I had a pile of dead watches and this little kit has everything I needed to work on all of them. Its a great starter if you want to change batteries or repair bands. I don't mess with the insides past the battery so I don't know if more would be required for actual repairs. I bought a press and pack of generic batteries to go with this, both were very useful.",
      "rating": 5.0,
      "verified": true,
      "author": "Tom",
      "helpful_votes": 0,
      "publication_date": 20180517
    },
    {
      "title": "Wrench doesn't fit a 42mm diameter, despite the description.",
      "text": "The hour hand got stuck beneath the seconds hand on my mechanical automatic, so I needed a three prong wrench to open it pluck the hand up. Unfortunately the three prong wrench wouldn't adjust to fit 42mm, despite the claim that it adjusts to fit up to 45mm. Sad, but very cool and very legal.",
      "rating": 1.0,
      "verified": true,
      "author": "Sodapop Murphy",
      "helpful_votes": 0,
      "publication_date": 20190318
    }
  ],
  "product_meta": {
    "title": "Ohuhu 174 PCS Watch Repair Tool Kit, Case Opener Spring Bar Watch Band Link Tool Set With Carrying Bag, Replace Watch Battery Helper Multifunctional Tools With User Manual For Beginner",
    "rating": 4.4,
    "feature_bullets": [
      "MULTIFUNCTIONAL: Perfect for opening watch backs, watchband adjustment, changing watch batteries, gaskets, adjusting bands etc",
      "SELF RELIANCE: Small, clean and functional, this watch repair tool kit helps you get your watch problem done at home instead of going for watch repair shops",
      "STURDY and DURABLE: 174 pcs watch repair tool kits are all made of high quality material, more professional for watch repair requirements, suit for both professional and general use",
      "ALL ESSENTIAL IN: all essential watch repair tool in a black nylon carrying zipper case, convenient storage, easy to take care of them and get the job done by anywhere",
      "AFTER-SALES SERVICE: Providing 18-month warranty and friendly customer service, you may contact us if you have any question"
    ],
    "specifications": {
      "Manufacturer": "Ohuhu",
      "Part Number": "WRT-01",
      "Item Weight": "1.22 pounds",
      "Product Dimensions": "8.3 x 2 x 4 inches",
      "Item model number": "Y14-80100-04",
      "Is Discontinued By Manufacturer": "No",
      "Size": "174 PCS",
      "Color": "174 pcs watch repair kit",
      "Item Package Quantity": "1",
      "Special Features": "Universal",
      "Included Components": "1 x Adjustable Case Opener18 x Adjustable Case Opener Pins,1 x Watch Case Opener Knife,1 x Stainless Steel Tweezer,1 x Spring Bar Tool,2 x Spring Bar Tool Spare Tips,108 x Watch Strap Spring pins,1 x Hammer,1 x Link Remover,3 x Link Remover Spare Pins,2 x Link Remover Spare Pins",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "Warranty Description": "Seller warrany",
      "ASIN": "B00PVN1DC0",
      "Customer Reviews": "4.4 out of 5 stars3,779 ratings4.4 out of 5 stars",
      "Best Sellers Rank": "#23,327 in Clothing, Shoes & Jewelry",
      "Date First Available": "November 20, 2014"
    },
    "categories": [
      "Shoe, Jewelry & Watch Accessories",
      "Clothing, Shoes & Jewelry",
      "Repair Tools & Kits",
      "Tools & Home Improvement",
      "Watch Accessories"
    ],
    "price": 16.99
  }
}