{
  "website_summaries": [
    {
      "verdict": "These kids' walkie-talkies are simple to use and built to last.",
      "pros": [
        "Each walkie-talkie can be used as external microphone and earpiece",
        "Include 2.5 mm charge jack",
        "Flashlight and backlit LED display for use in the dark",
        "22 channels",
        "Built-in clip for carrying"
      ],
      "cons": [
        "Batteries wear down quickly",
        "Low volume even at the highest volume setting"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "They have survived a group of 8 & 10 year olds",
      "text": "These were a birthday present and have suffered untold abuse perpetrated by an active group of kids. I have no doubts they’ve been dropped during the course of their great adventures and banged off God knows what. Despite all that, they have very minimal battle scarring and still work just as they did out of the box. My stock pile of batteries is still healthy and the kids are still happy. Parenting win!",
      "rating": 5.0,
      "verified": true,
      "author": "Bree",
      "helpful_votes": 5,
      "publication_date": 20181105
    },
    {
      "title": "Good little radios, but with very loud chirps",
      "text": "These are solid little two-way radios. They seem robust and durable, and look great. The controls aren't very intuitive or especially easy to use, even after following the enclosed instructions. And some of the extra features don't seem to work as expected. Also, the chirp alerts from these things are LOUD! And I've never been able to figure out how to turn them down (the instructions to do this didn't work). But the sound quality is good, and they have plenty of channels so there's not much problem with interference. Overall they are decent.",
      "rating": 4.0,
      "verified": true,
      "author": "Just Some Guy",
      "helpful_votes": 0,
      "publication_date": 20200828
    },
    {
      "title": "Don't text, talk!!!",
      "text": "Bought this for my son for his b-day and we have had a blast with them. Played with them for a bit before it got cold but they have worked great. I can send him across the street behind neighbors houses and have no problems hearing him. Also went on our local bike/walking trail and he was well ahead of me and was working flawlessly. Been dropped a few times but still keep on going. Very rugged and great reception!!!",
      "rating": 5.0,
      "verified": true,
      "author": "D. Garcia",
      "helpful_votes": 5,
      "publication_date": 20170228
    },
    {
      "title": "Good but definitely NOT for kids",
      "text": "As walkie talkies, these are a great value. I'm not sure why they are marketed as \"for kids\". The insanely cryptic and complex menu system coupled with several front facing buttons to manipulate the menu, means my kids changed the functions every time they touch it. Slight changes in the menu make them not functional as walkie talkies. These require adult level users imo. Other than that, they are great.",
      "rating": 4.0,
      "verified": true,
      "author": "photographer",
      "helpful_votes": 9,
      "publication_date": 20160111
    },
    {
      "title": "Won’t turn on",
      "text": "One of these won’t turn off after just over the return date. Not happy.",
      "rating": 1.0,
      "verified": true,
      "author": "Barbie",
      "helpful_votes": 6,
      "publication_date": 20181027
    },
    {
      "title": "Nice quality, well made. Good reception.",
      "text": "My grandsons are young. Almost 4, not yet 3, It’s not perfect for them ( a little advanced) but easy enough to use that they can and do use them. They love being in different parts of the house talking to each other, especially when they are in their tent or on an adventure. The quality is good enough that our daughter and son in law use them themselves also. Great price. Nicely made. I’m curious about how long batteries will last when the boys leave them on. -time will tell. I’m tempted to buy a set for my husband when he’s working with his partner.",
      "rating": 5.0,
      "verified": true,
      "author": "Jd digi",
      "helpful_votes": 0,
      "publication_date": 20190616
    },
    {
      "title": "Wish I found these a while ago!",
      "text": "Love these, kids love these, Mommy and Daddy love these! We have one of those neighborhoods with tons of kids. Even though our pre-teen kids want a phone, ain’t no dice. Problem is, when you want them to come home, it’s a guessing game to find out which kids house they landed at. Problem solved! They have very good range. Our kids could be at a neighbor's house a half mile up the road and we can get them. There is a beep function that they can hear if you are trying to get them. This has allowed me to get them home without knocking on 5 doors! Awesome!",
      "rating": 5.0,
      "verified": true,
      "author": "Robert M",
      "helpful_votes": 0,
      "publication_date": 20181222
    },
    {
      "title": "Great product",
      "text": "These were cool with no static. They were a bit complicated for my toddlers but for an adult they would work great. 1. Multiple channels 2. Great range on them 3. Long lasting batteries and you can buy a charger for them.",
      "rating": 5.0,
      "verified": true,
      "author": "Sav",
      "helpful_votes": 2,
      "publication_date": 20180717
    },
    {
      "title": "Good for kids",
      "text": "Good for kids. My son and my nephew used these after Christmas for a week straight. They even work from different houses which was awesome. After a few weeks, the channel got changed on accident and the screen was no longer working. This meant I had to play with it for a long time to try to make the match again. Maybe I should’ve contacted the seller, but since it was Christmas we didn’t have the box anymore",
      "rating": 4.0,
      "verified": true,
      "author": "homeschool mom of four",
      "helpful_votes": 0,
      "publication_date": 20190219
    },
    {
      "title": "Amazing reach and clarity",
      "text": "Got these for my 9 and 7 year old for Christmas and what a hit! They love them and so does my boyfriend. They have a really far reach. We walked about a half a mile away from the house and still had great reception. These would be great for camping or hiking even. Great quality!",
      "rating": 5.0,
      "verified": true,
      "author": "Crystal",
      "helpful_votes": 0,
      "publication_date": 20200124
    },
    {
      "title": "Good",
      "text": "They are loud, more of an outdoor thing, hard to set up But once you get them going they are nice and handy, can even be used as a toy for kids",
      "rating": 4.0,
      "verified": true,
      "author": "That one user",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "These aren't really good for kids",
      "text": "The controls on these are hard to figure out. Kids are really confused and can't figure out what channel they are on and how to change the channel. Really poor engineering and not user friendly. They also eat batteries pretty quickly.",
      "rating": 2.0,
      "verified": true,
      "author": "T. Port",
      "helpful_votes": 0,
      "publication_date": 20181214
    },
    {
      "title": "Be careful if you have children!",
      "text": "I got this toy for my 5 year old for her birthday and she loves playing with them with her sister but it seems we can hear other people from other walkie talkies down the street. Keep an eye on your little ones while using it!",
      "rating": 3.0,
      "verified": true,
      "author": "Krista",
      "helpful_votes": 0,
      "publication_date": 20201020
    },
    {
      "title": "Breaker 19...",
      "text": "Bought for my Granddaughter, she loves them. She can work these at 6 years old, so they must be easy to figure out. Price is good, build quality look good too. I would recommend these for a child, teenager or adult.",
      "rating": 4.0,
      "verified": true,
      "author": "Ernest",
      "helpful_votes": 0,
      "publication_date": 20200524
    },
    {
      "title": "Good Buy",
      "text": "Got these for the kids. The childish ones with characters always seemed to break or were otherwise cheap and would fall out of range. These are sturdy and durable. Two things that are just what my rough boys need. The range is excellent, 200 feet outdoors plus. Great reception throughout the house too.",
      "rating": 5.0,
      "verified": true,
      "author": "Dan",
      "helpful_votes": 0,
      "publication_date": 20170728
    },
    {
      "title": "Great Little Radios!",
      "text": "We plan to use them in a theme park when my wife walks off with one of the kids and I have the other. But also because I like to go on some of the more frightening rides while my wife watches the kids. A cell phone is easy enough but this saves battery life for the cell phone and the kids get a kick out of using them.",
      "rating": 5.0,
      "verified": true,
      "author": "AmazonMan",
      "helpful_votes": 2,
      "publication_date": 20160827
    },
    {
      "title": "Good walkie talkies",
      "text": "My children love these. They work for some distance and are very clear. The only negative I can say is that the channels are a little difficult to program.",
      "rating": 5.0,
      "verified": true,
      "author": "Bec",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "Great for the kids",
      "text": "My son uses these with his friends and they love them. They have a good distance. I also took them on vacation in FL to use when the kids went to our condo but with all the concrete walls they didn't work that great.",
      "rating": 5.0,
      "verified": true,
      "author": "KikiD26",
      "helpful_votes": 3,
      "publication_date": 20161006
    },
    {
      "title": "Simply good.",
      "text": "This is a basic multi channel two way walkie talkie. It is simple to use, clear, and has pretty good range. 75 yards, with several interfering structures, is as far as we've tried, but it was still clear. If you're looking for a basic walkie talkie set, I highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Keely",
      "helpful_votes": 0,
      "publication_date": 20180613
    },
    {
      "title": "Worth it",
      "text": "These were a gift for my 4 yr old. They work well, are simple for kids, are extremely well made and have a great range so far. We are extremely happy with our purchase and would buy these again!",
      "rating": 5.0,
      "verified": true,
      "author": "Brynn",
      "helpful_votes": 0,
      "publication_date": 20180510
    },
    {
      "title": "Work great!",
      "text": "Order these for my 4 year old daughter for her birthday! They work great and she loves them! For her age they may be a little advanced because when she hits the buttons on the front she changes the channels and I have to help her get them back on the same ones again.",
      "rating": 5.0,
      "verified": true,
      "author": "Private",
      "helpful_votes": 0,
      "publication_date": 20190422
    },
    {
      "title": "Good sound quality!",
      "text": "Been having them for a couple of weeks.Love the quality of sound, I have previously bought some walkie talkie from Walmart(the paw patrol ones)and they were horrible and more expensive than these. Battery lasts for a good amount of time, still haven’t changed them. My kids are playing with them like 30’ on average/day. Totally recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Elisabeth",
      "helpful_votes": 0,
      "publication_date": 20200328
    },
    {
      "title": "They really enjoy them. Easy to use",
      "text": "Got these two to join two others we already had so I can keep tabs on my kids. We take them hiking, around the house and to the store. I can send them to collect items in the grocery knowing i can get in contact. They really enjoy them. Easy to use, compact and sturdy.",
      "rating": 5.0,
      "verified": true,
      "author": "maddash",
      "helpful_votes": 0,
      "publication_date": 20180512
    },
    {
      "title": "It was a gift",
      "text": "I finally got a package with two of them in one. I believe that they work just fine and I appreciate the vendor sending me another one.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "Vastly entertaining",
      "text": "Our recipient and father used it to play \"hide-and-seek\" in their house. Wonderful fun.",
      "rating": 5.0,
      "verified": true,
      "author": "Rare book lover",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "My 4yo nephew really liked these. Good size for his hands",
      "text": "My 4yo nephew really liked these. Good size for his hands. He's still getting the hang of holding down the button while he talks then letting go to listen but he'll be able to use them for a long time.",
      "rating": 4.0,
      "verified": true,
      "author": "Jaclyn T.",
      "helpful_votes": 3,
      "publication_date": 20160703
    },
    {
      "title": "Great and user friendly for 6 year old",
      "text": "Awesome product for money. My grandkids like bed these. Even the 3 year old can operate. Better than a toy",
      "rating": 5.0,
      "verified": true,
      "author": "angie2499",
      "helpful_votes": 0,
      "publication_date": 20180708
    },
    {
      "title": "Do the job",
      "text": "Just got these to use for backing out our travel trailer work as expected didn't want anything expensive they work just fine",
      "rating": 5.0,
      "verified": true,
      "author": "Jana",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "Average quality",
      "text": "Confusing buttons for kids and adults alike. We finally found the lock button so my kids would stop changing channels. They're just ok. Sometimes you can't hear the other person very well.",
      "rating": 3.0,
      "verified": true,
      "author": "Jenna",
      "helpful_votes": 2,
      "publication_date": 20170103
    },
    {
      "title": "Great product especially for the price!",
      "text": "Bought these walkie talkies for my son. He loves them but not as much as my husband does! The quality is great. You can hear everything very clear.",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs.S",
      "helpful_votes": 0,
      "publication_date": 20180105
    },
    {
      "title": "Walkie",
      "text": "First pair defective which was tough at Christmas. When second set arrived January 7th kids were very happy.",
      "rating": 5.0,
      "verified": true,
      "author": "VB",
      "helpful_votes": 0,
      "publication_date": 20200117
    },
    {
      "title": "These are perfect for kids",
      "text": "These are perfect for kids! Great size! Easy to press buttons and easy to set up. The correct color was delivered, the box wasn’t damaged or broken! Don’t forget they do require 3 AAbatteries apiece.",
      "rating": 5.0,
      "verified": true,
      "author": "Millars",
      "helpful_votes": 3,
      "publication_date": 20171220
    },
    {
      "title": "Would recommend. So much better than trying to communicate by ...",
      "text": "They work well up to about 3/4 - 1 mile. Past that they do not work. Worked well with no battery issues from Chicago to Kentucky twice. Would recommend. So much better than trying to communicate by cell phone while on the road when driving in tandem.",
      "rating": 4.0,
      "verified": true,
      "author": "MT",
      "helpful_votes": 0,
      "publication_date": 20170801
    },
    {
      "title": "Have none.",
      "text": "I didn't end up using them. They work great. They'll make a fun Christmas gift.",
      "rating": 5.0,
      "verified": true,
      "author": "Colleen M. Wilson",
      "helpful_votes": 0,
      "publication_date": 20190909
    },
    {
      "title": "Works well at a distance",
      "text": "We don’t use them as much as I thought we would because the channel is hard to change. My son changed the channel and we were picking up someone else’s conversation.",
      "rating": 5.0,
      "verified": true,
      "author": "Caitlyn",
      "helpful_votes": 0,
      "publication_date": 20190806
    },
    {
      "title": "It is Great",
      "text": "I liked the set a lot! It was simple and easy to use and set up.👍🤜🏼🤛🏻",
      "rating": 4.0,
      "verified": true,
      "author": "Kristin A. Wallace",
      "helpful_votes": 0,
      "publication_date": 20200321
    },
    {
      "title": "Great product",
      "text": "These walkie talkies were originally not delivered as planned. Someone from the company contacted me and made things right immediately. Once things were sorted out they arrived the next day. My son and daughter love these. So clear and easy to use. Great product!",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa P.",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "Five Stars",
      "text": "LOVED it, but the battery seems to wear down a bit quickly. Still it was a hit for Christmas!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon addicted",
      "helpful_votes": 0,
      "publication_date": 20180216
    },
    {
      "title": "High Quality",
      "text": "Thes make for a awesome gift I bought them for my 8 year old son and when he goes to his friends house 3 blocks away I make him take it with him so I can keep in contact and let him know when it is time to come home!",
      "rating": 5.0,
      "verified": true,
      "author": "CHELSEA",
      "helpful_votes": 0,
      "publication_date": 20171104
    },
    {
      "title": "Nice size for kids they seem to enjoy seem to ...",
      "text": "Nice size for kids they seem to enjoy seem to be working well just have to be sure they stay on the same channel",
      "rating": 4.0,
      "verified": true,
      "author": "mia",
      "helpful_votes": 0,
      "publication_date": 20171114
    },
    {
      "title": "Great for the price",
      "text": "These work great! They are functional over a long distance -- we tested them at over 200 feet outdoors.",
      "rating": 5.0,
      "verified": true,
      "author": "Geomom89",
      "helpful_votes": 0,
      "publication_date": 20180212
    },
    {
      "title": "Great find",
      "text": "This product is surprisingly incredible, the range for a kids walki talky is superb.",
      "rating": 5.0,
      "verified": true,
      "author": "Amber Matthews",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Could be better.",
      "text": "Only used them three times and one of the walkies always stays on.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190502
    },
    {
      "title": "Be careful replacing the batteries if you buy this",
      "text": "The battery connector broke when replacing the battery the 1st time. It was very tight",
      "rating": 3.0,
      "verified": true,
      "author": "Snigdha",
      "helpful_votes": 0,
      "publication_date": 20190904
    },
    {
      "title": "Great REAL walkie talkies",
      "text": "I love these real walkie talkies! Easy to program and way better than the cheap character ones any where else. Volume is great and they're durable, so glad I got these and at a great price too",
      "rating": 5.0,
      "verified": true,
      "author": "Rose",
      "helpful_votes": 0,
      "publication_date": 20190924
    },
    {
      "title": "It is good",
      "text": "Not as I expected, it is battery consumed and range is not that far.",
      "rating": 3.0,
      "verified": true,
      "author": "Medhat Ishak ",
      "helpful_votes": 0,
      "publication_date": 20190714
    },
    {
      "title": "Five Stars",
      "text": "Work great, make sure not to leave them on or else they pick up random truck/car drivers talking.",
      "rating": 5.0,
      "verified": true,
      "author": "Svetlana P.",
      "helpful_votes": 2,
      "publication_date": 20170222
    },
    {
      "title": "easy enough to program",
      "text": "So far, holding up to use by a 5 and 8 year old! Works well, easy enough to program, and my sons love talking to each other across the house :)",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel",
      "helpful_votes": 0,
      "publication_date": 20180615
    },
    {
      "title": "Excellent purchase",
      "text": "My son loves it and we use it when I’m out back and can’t see him. Great for kids and adults!",
      "rating": 5.0,
      "verified": true,
      "author": "KELLY OLEARY",
      "helpful_votes": 0,
      "publication_date": 20181106
    },
    {
      "title": "Great as a toy for my grandsons!",
      "text": "I bought this for my grandsons to use at our home/yard. The boys are 7. They kept them busy for hours!",
      "rating": 5.0,
      "verified": true,
      "author": "Paula ",
      "helpful_votes": 0,
      "publication_date": 20200916
    },
    {
      "title": "Great walkie talkies",
      "text": "They work great and there is a lock button so 3 years olds can use without having to press the button.",
      "rating": 5.0,
      "verified": true,
      "author": "Kate Cook",
      "helpful_votes": 2,
      "publication_date": 20170629
    },
    {
      "title": "Never worked",
      "text": "This walker talkie never did work for my grandsons. They are ages 6 & 4 and this product was way to complicated. Just never worked.",
      "rating": 1.0,
      "verified": true,
      "author": "Rhonda A.",
      "helpful_votes": 0,
      "publication_date": 20190423
    },
    {
      "title": "Four Stars",
      "text": "Work good. Not too crisp and clear but I can understand what I'm hearing in talkie.",
      "rating": 4.0,
      "verified": true,
      "author": "Guivee G.",
      "helpful_votes": 0,
      "publication_date": 20171114
    },
    {
      "title": "Great walkie for the price",
      "text": "My 3 year old loves these walkie talkies! We play with them all throughout the house and in the backyard. No problems with static or interference. It's also easy for him to use. I wasn't sure if it would be too difficult for him to press down on the talk button since his hands were small.",
      "rating": 5.0,
      "verified": true,
      "author": "Proud mom of a preschooler",
      "helpful_votes": 0,
      "publication_date": 20170812
    },
    {
      "title": "Four Stars",
      "text": "Our 8 and 5 year old boys love to play with these.",
      "rating": 4.0,
      "verified": true,
      "author": "ALG1022",
      "helpful_votes": 0,
      "publication_date": 20180301
    },
    {
      "title": "Faulty?",
      "text": "This could be a great product but unfortunately 1 of the walkie talkies died soon after receiving them. This is super frustrating because we were really enjoying using them. Hopefully Retevis can replace this device so we can keep going.",
      "rating": 1.0,
      "verified": true,
      "author": "Nick Smith",
      "helpful_votes": 0,
      "publication_date": 20200730
    },
    {
      "title": "Girls like toys too",
      "text": "Bought this for my 7 and 5 year old niece. They liked it and my sister said they work from a good distance.",
      "rating": 5.0,
      "verified": true,
      "author": "Bob",
      "helpful_votes": 0,
      "publication_date": 20170816
    },
    {
      "title": "These work very well. We take them to the ...",
      "text": "These work very well. We take them to the beach and on other vacations. kids run all around the neighborhood with them.",
      "rating": 5.0,
      "verified": true,
      "author": "kenneth r smith iii",
      "helpful_votes": 0,
      "publication_date": 20171226
    },
    {
      "title": "They work great and easy for kids",
      "text": "My son loves them. They work great and easy for kids.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171228
    },
    {
      "title": "Good product!",
      "text": "Works well! Pleased with my purchase. I love that there is a lock option so that the buttons can't be pressed by my 3 year old when he plays with them.",
      "rating": 5.0,
      "verified": true,
      "author": "Robin ",
      "helpful_votes": 0,
      "publication_date": 20180721
    },
    {
      "title": "These were great for my nephews 5th birthday",
      "text": "These were great for my nephews 5th birthday! He loves being able to be connected to mom and dad all the time! Good range.",
      "rating": 5.0,
      "verified": true,
      "author": "Jamie",
      "helpful_votes": 0,
      "publication_date": 20170607
    },
    {
      "title": "Five Stars",
      "text": "Returned them because the kids were not interested in playing with them",
      "rating": 5.0,
      "verified": true,
      "author": "Michael & Julie DaSilva",
      "helpful_votes": 0,
      "publication_date": 20171212
    },
    {
      "title": "Luca's Talkies!",
      "text": "My 4yr old grandson has been asking for walkie talkies, i was hesitant to purchase these given his age. Im glad i gave in! Very easy to use, almost no static and grt range. He has hours of fun! This is one of the best purchases ive ever made.",
      "rating": 5.0,
      "verified": true,
      "author": "GrandmaD",
      "helpful_votes": 19,
      "publication_date": 20150912
    },
    {
      "title": "Buying for kids??",
      "text": "hard to use for kids. this more of a professional walkie talkie vs one easy for kids usage. Not going to say the product is bad, it is just not good for young kids.",
      "rating": 2.0,
      "verified": true,
      "author": "shaun graham",
      "helpful_votes": 0,
      "publication_date": 20200509
    },
    {
      "title": "There are creepers everywhere",
      "text": "Playing on them with my oldest grandkids all of a sudden I hear. Mans voice taking to us. Turned them off real fast and haven’t used them since!",
      "rating": 1.0,
      "verified": true,
      "author": "DMater",
      "helpful_votes": 0,
      "publication_date": 20200214
    },
    {
      "title": "Good product, fast shipping",
      "text": "Bought it for my nieces so they can play. Seems really good even for a real use.",
      "rating": 5.0,
      "verified": true,
      "author": "Antonio",
      "helpful_votes": 0,
      "publication_date": 20181212
    },
    {
      "title": "outstanding voice clarity, but I wish they had an auto shutoff.",
      "text": "Arrived early and the quality is excellent. Voice clarity is outstanding. I would rate them 5 stars if they had an automatic shutoff.",
      "rating": 4.0,
      "verified": true,
      "author": "anonymous",
      "helpful_votes": 3,
      "publication_date": 20160521
    },
    {
      "title": "Useful, even as more than just toys.",
      "text": "Great kids product, has been very useful on family outings!",
      "rating": 5.0,
      "verified": true,
      "author": "Arno Hachaduryan",
      "helpful_votes": 0,
      "publication_date": 20171220
    },
    {
      "title": "Like them, but would have bought something else",
      "text": "My kids really like them! The buttons are a bit confusing for a 7,5, and 4 year old though. Wish I would have gotten something with less ability to change the channels and such. Also reflecting on it, should have bought something with a docking station for charging them instead of batteries. Ooops!",
      "rating": 4.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 0,
      "publication_date": 20151230
    },
    {
      "title": "Five Stars",
      "text": "These are awesome and work great both indoors and outdoors",
      "rating": 5.0,
      "verified": true,
      "author": "Jacquelyn ",
      "helpful_votes": 2,
      "publication_date": 20171007
    },
    {
      "title": "The Boys LOVED them",
      "text": "This was THE toy on Christmas Eve for our 9 yr old grandsons. We had just as fun watching them play.",
      "rating": 5.0,
      "verified": true,
      "author": "maryt",
      "helpful_votes": 0,
      "publication_date": 20161231
    },
    {
      "title": "Great Walkie Talkies!",
      "text": "Got these for my grandson, expecting he will love them. They worked well when we tested them out.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Krier",
      "helpful_votes": 0,
      "publication_date": 20171105
    },
    {
      "title": "Cool😎",
      "text": "Preteen boys are hard to shop for but they seemed to really like it and definitely saves money on a combo gift",
      "rating": 4.0,
      "verified": true,
      "author": "brittany",
      "helpful_votes": 0,
      "publication_date": 20190620
    },
    {
      "title": "Fun and easy",
      "text": "These worked very well with little to no instruction to the kids playing with it, ages 4, 6 and 10.",
      "rating": 5.0,
      "verified": true,
      "author": "FormerJones",
      "helpful_votes": 0,
      "publication_date": 20170108
    },
    {
      "title": "RT628 Walkie Talkies",
      "text": "Impressive range. Tried with my daughter in the mountains. Clear reception in the valley without line of sight. Easy to use and light weight. Ideal for occasional communication during hiking.",
      "rating": 5.0,
      "verified": true,
      "author": "Jiava",
      "helpful_votes": 2,
      "publication_date": 20170529
    },
    {
      "title": "Best walkies I’ve bought for my 10-year old",
      "text": "Best walkie talkies I’ve bought for my kids. Super easy to use. Sturdy. Not a lot of static - way more clear than most.",
      "rating": 5.0,
      "verified": true,
      "author": "Leslieb",
      "helpful_votes": 0,
      "publication_date": 20180619
    },
    {
      "title": "Four Stars",
      "text": "Work well. Have to press talk button just in the right spot for smaller kids hands.",
      "rating": 4.0,
      "verified": true,
      "author": "jclife",
      "helpful_votes": 0,
      "publication_date": 20161231
    },
    {
      "title": "... RT131 radios so they won't get lost quite as easily. They are fine as toys for short range ...",
      "text": "These radios are a little larger than the RT131 radios so they won't get lost quite as easily. They are fine as toys for short range communication.",
      "rating": 5.0,
      "verified": true,
      "author": "W. W. Embry",
      "helpful_votes": 0,
      "publication_date": 20160129
    },
    {
      "title": "Exceeded expectations!",
      "text": "My 11-year old daughter bought these with birthday money, and they are great! I was surprised at how well they work and how clear they are. Range is great also.",
      "rating": 5.0,
      "verified": true,
      "author": "Mama L",
      "helpful_votes": 0,
      "publication_date": 20160921
    },
    {
      "title": "They are a great buy! They are having so much fun with ...",
      "text": "My grandsons were thrilled with the walkie talkies! They are a great buy! They are having so much fun with them!",
      "rating": 5.0,
      "verified": true,
      "author": "Lachelle",
      "helpful_votes": 0,
      "publication_date": 20170104
    },
    {
      "title": "Great merchandise for the money",
      "text": "I didn’t think these would be as good as they are. The sound the quality are great.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200513
    },
    {
      "title": "Fun walkie talkies",
      "text": "My boys love these - the range is great and reception is clear. Great buy!",
      "rating": 5.0,
      "verified": true,
      "author": "T.O.",
      "helpful_votes": 0,
      "publication_date": 20190108
    },
    {
      "title": "Great for kids and work too!",
      "text": "Bought these for my kids. Work well and so much fun.",
      "rating": 5.0,
      "verified": true,
      "author": "Chicago mom/lawyer",
      "helpful_votes": 2,
      "publication_date": 20170126
    },
    {
      "title": "This was the perfect gift for our grand daughter",
      "text": "This was the perfect gift for our grand daughter. After her party they played with these walkie talkies late into the evening. A great hit and perfect gift. Her younger brothers now want some. Will be purchasing another pair for the boys birthdays.",
      "rating": 5.0,
      "verified": true,
      "author": "Rosebud60",
      "helpful_votes": 2,
      "publication_date": 20160323
    },
    {
      "title": "Get these",
      "text": "great range and easy for the 6 and 3 yr olds to use. glad I bought them",
      "rating": 5.0,
      "verified": true,
      "author": "George R. Letts",
      "helpful_votes": 0,
      "publication_date": 20161229
    },
    {
      "title": "The kid likes it.",
      "text": "I have no clue. I got them for a very intelligent 5 year old and he loves them. His friends wish he had more to share. That’s what his mother said.",
      "rating": 5.0,
      "verified": true,
      "author": "Shunxing",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "The voice sound quality is very good!",
      "text": "Bought two sets for my two grandsons, who are brothers. They Are having a great time communicating with the walk—talkies!",
      "rating": 5.0,
      "verified": true,
      "author": "NC GiGi",
      "helpful_votes": 0,
      "publication_date": 20190116
    },
    {
      "title": "Broke quickly",
      "text": "We used these once and they stopped working. Not a battery issue. Missed the return window by 6 days. Darn. :(",
      "rating": 1.0,
      "verified": true,
      "author": "Dawn Furfaro-Strode",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "Best Gift Ever!",
      "text": "I got these for my 7 yo boy. Best thing ever! I was kind of leery abkut these but perfect present!",
      "rating": 5.0,
      "verified": true,
      "author": "DOROTHY V.",
      "helpful_votes": 0,
      "publication_date": 20200614
    },
    {
      "title": "Five Stars",
      "text": "These work great! More settings and options than expected. Great reception.",
      "rating": 5.0,
      "verified": true,
      "author": "Karine C.",
      "helpful_votes": 0,
      "publication_date": 20170618
    },
    {
      "title": "Works",
      "text": "Got this is a gift works great and reaches quite far",
      "rating": 5.0,
      "verified": true,
      "author": "Tracy Guillet",
      "helpful_votes": 0,
      "publication_date": 20190520
    },
    {
      "title": "Great!",
      "text": "Kids love them... Easy to use!... Bought a second pair for other family members!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Judy",
      "helpful_votes": 0,
      "publication_date": 20200130
    },
    {
      "title": "Cheap!",
      "text": "Both walkie talkies stopped working after two months. One has screen issues and turns off and on constantly. The other randomly acts like you're pressing the mic. and doesn't stop.",
      "rating": 1.0,
      "verified": true,
      "author": "Katherine S.",
      "helpful_votes": 0,
      "publication_date": 20190919
    },
    {
      "title": "Five Stars",
      "text": "As far as I know the item works fine. I gave it as a gift.",
      "rating": 5.0,
      "verified": true,
      "author": "CC",
      "helpful_votes": 0,
      "publication_date": 20170420
    },
    {
      "title": "This product look and work nicely. I am just starting to use that and ...",
      "text": "This product look and work nicely. I am just starting to use that and I hope it will work properly during long time.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen Avetisyan",
      "helpful_votes": 2,
      "publication_date": 20151210
    },
    {
      "title": "He and his cousin had so much fun playing with these",
      "text": "Gave this as a birthday present to a six year old boy. He and his cousin had so much fun playing with these. They were the hit of the party.",
      "rating": 5.0,
      "verified": true,
      "author": "DON BYRNE",
      "helpful_votes": 0,
      "publication_date": 20180730
    },
    {
      "title": "nice,but needs to work out battery issues",
      "text": "nice product,but still have problem with batteries not lasting long enough-will consider ever to buy the brand ever again-my wife is partially deaf and it helps so we don't have to yell up and down the stairs in our house",
      "rating": 4.0,
      "verified": true,
      "author": "sylvia decarlo",
      "helpful_votes": 0,
      "publication_date": 20160123
    },
    {
      "title": "my 5 year old love is",
      "text": "got these for my 5 year old for his bday and they work great. very clear with no static. great buy",
      "rating": 5.0,
      "verified": true,
      "author": "Brittany",
      "helpful_votes": 2,
      "publication_date": 20160603
    },
    {
      "title": "Great quality",
      "text": "These are great quality and a nice gift for kids.",
      "rating": 5.0,
      "verified": true,
      "author": "Candace Wafford",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "They are solid, work as well as an expensive ...",
      "text": "They are solid, work as well as an expensive pair of radios, and my grandson was elated when he opened them as a gift for his birthday!",
      "rating": 5.0,
      "verified": true,
      "author": "Carline K. Bruns",
      "helpful_votes": 3,
      "publication_date": 20160611
    }
  ],
  "product_meta": {
    "title": "Retevis RT628 Kids Walkie Talkies,22 Channels Long Range Walkie Talkies for Kids Toy with Belt Clip,Two Way Radio Gift for Boys and Girls to Outdoor Adventure Game,Vacation Travel(Silvery,2 Pack)",
    "rating": 4.4,
    "feature_bullets": [
      "Easy to operate for kids;fashionable design and great toy for kids to enjoy with neighbors",
      "This walkie talkie can use optional external microphone and earpiece",
      "LCD backlit display makes things easier in dark environment",
      "2.5mm charge jack for external charger but charger and battery are not included",
      "Many Retevis RT628 walkie talkies will work as long as the walkie talkies are on the same channel and secure call"
    ],
    "specifications": {
      "Product Dimensions": "8.7 x 2.99 x 3.9 inches",
      "Item Weight": "7.1 ounces",
      "ASIN": "B00P20LJ9Y",
      "Item model number": "CAA1026G",
      "Manufacturer recommended age": "4 years and up",
      "Batteries": "3 AA batteries required.",
      "Best Sellers Rank": "#427 in Toys & Games",
      "Customer Reviews": "4.4 out of 5 stars623 ratings4.4 out of 5 stars",
      "Is Discontinued By Manufacturer": "No",
      "Mfg Recommended age": "4 year and up",
      "Manufacturer": "Retevis"
    },
    "categories": [
      "Kids' Electronics",
      "Toys & Games",
      "Walkie Talkies"
    ],
    "price": 20.99
  }
}