{
  "website_summaries": [
    {
      "verdict": "The Kicker Tabor headphones deliver clear Bluetooth audio with a focus on mids, but many will find them lacking in bass.",
      "pros": [
        "Quality, balanced audio performance with no distortion",
        "Quite comfortable",
        "Easy-to-use design",
        "Can be used in wired, passive mode"
      ],
      "cons": [
        "Modest bass response",
        "Wireless stream occasionally stutters",
        "Doesn't automatically power off when not in use"
      ],
      "aspects": {},
      "publication_date": 20150826,
      "rating": 6.0,
      "source": "pcmag"
    }
  ],
  "customer_reviews": [
    {
      "title": "They will make you deaf",
      "text": "the sound quality is amazing you almost won't believe it's blutooth and not with a wire (it does include it but I don't use it). Way better than Beats and cheaper too. Also durable I've dropped them a couple times already and no issues with them.",
      "rating": 5.0,
      "verified": true,
      "author": "Mayhem",
      "helpful_votes": 5,
      "publication_date": 20160704
    },
    {
      "title": "if stationary or sitting nice sound just like my kickers with",
      "text": "music cuts in and out with movement. if stationary or sitting nice sound just like my kickers with jack",
      "rating": 3.0,
      "verified": true,
      "author": "HellCat💜",
      "helpful_votes": 3,
      "publication_date": 20180311
    },
    {
      "title": "Received defective, had to order another pair.",
      "text": "Updated 12/31/16 Below: I want to love these headphones but this order came defective. I fully charged headphones but they would not turn on. Contacted Amazon and am returning these. I had to purchase another pair. I will review those once I receive them and test them out. 12/31/16 Headphones sound amazing. I love Kicker products.",
      "rating": 4.0,
      "verified": true,
      "author": "Alex E.",
      "helpful_votes": 5,
      "publication_date": 20161222
    },
    {
      "title": "Great Headphones",
      "text": "Purchased for my son for Christmas. This pair replaced an earlier pair he had for a few years. Thanks to Amazon I got these for 9.99 due to the Amazon credit card offer that gave us a $100 gift card for applying. Winner winner...",
      "rating": 5.0,
      "verified": true,
      "author": "Laura Keener",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Excellent quality",
      "text": "These are absolutely awesome! My friends who owned beats where stunned by the sound quality and bass. Not to mention the comfort and build quality! Highly recommend these headphones as they have aged well and battery holds charge even after a year of heavy use. I've not experienced any Bluetooth issue like other reviewers. I pair it to a fire hd8 , one plus 3t, and oneplus 5t with out any issues.",
      "rating": 5.0,
      "verified": true,
      "author": "tcald",
      "helpful_votes": 0,
      "publication_date": 20180807
    },
    {
      "title": "Unreal",
      "text": "Kickers motto is or was, from what I remember , \" livin' it loud\" and these headphones can prove that. enough bass to make your brain shake and loud enough to make your ears bleed (not literally) the case is nice and great for storage. the sound is great, glad i purchased. these are better than all the beats and sennheisers out there available today.",
      "rating": 5.0,
      "verified": true,
      "author": "jamin",
      "helpful_votes": 0,
      "publication_date": 20190814
    },
    {
      "title": "Great Headphones",
      "text": "I purchased them back in May and they work perfectly fine. Definitely worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Samantha",
      "helpful_votes": 3,
      "publication_date": 20161018
    },
    {
      "title": "Only lasted me 29 days!!!",
      "text": "By the title you should know why its two stars, it would have been 1 star but despite the bluetooth not powering on anymore these headphones has great sound quality and i still can use them via auxilery cord but i used them for work now im back to using cord until i can do some research on some top tier bluetooth headphones.",
      "rating": 2.0,
      "verified": true,
      "author": "Dante",
      "helpful_votes": 0,
      "publication_date": 20170616
    },
    {
      "title": "Love them!!!!",
      "text": "I use these headphones everyday they last bout 10 hours, they are very durable, and loud, the sound is awesome and I work around barking dogs and even though they aren't advertised as noise cancelling, they sure do drown out everything around you, this is the 3rd pair I have purchased for the family they all love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Mindy Green",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "Great birthday gift!!!",
      "text": "I bought these for my father for his birthday and he loved them!!!! Said they work better than his beats. 10/10 recomendó",
      "rating": 5.0,
      "verified": true,
      "author": "Taylor Ochoa",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "LOVE THESE",
      "text": "My husband bought a pair about 2 years ago on a different site and paid double. We bought these ones for my son and he loves them too. You get more that what you pay for. GREAT PRODUCT AND SELLER",
      "rating": 5.0,
      "verified": true,
      "author": "Leca Logan",
      "helpful_votes": 0,
      "publication_date": 20180906
    },
    {
      "title": "I bought these to wear when flying. They connect ...",
      "text": "I bought these to wear when flying. They connect to bluetooth with ease. Wish I had paid the extra to get noise canceling. . .",
      "rating": 5.0,
      "verified": true,
      "author": "Kay D",
      "helpful_votes": 0,
      "publication_date": 20180521
    },
    {
      "title": "What a great product, I love them",
      "text": "What a great product, I love them. Battery last a very long time and the product comes securely packaged. Arrived quickly to my home and I will shop through this seller in the future.",
      "rating": 5.0,
      "verified": true,
      "author": "Joshua",
      "helpful_votes": 2,
      "publication_date": 20150523
    },
    {
      "title": "Do not drop these!!!!!!!",
      "text": "Loved everything about them. Have broken them but purchase another pair soon.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff Prince",
      "helpful_votes": 0,
      "publication_date": 20190712
    },
    {
      "title": "Worth every dime.",
      "text": "I wouldn't trade these for any other. Just excellent in every way. Very balanced, Bass is SOLID, just buy it.",
      "rating": 5.0,
      "verified": true,
      "author": "IceKold",
      "helpful_votes": 0,
      "publication_date": 20160604
    },
    {
      "title": "Five Stars",
      "text": "My son LOVES these for playing games at the computer.",
      "rating": 5.0,
      "verified": true,
      "author": "Npedraza",
      "helpful_votes": 0,
      "publication_date": 20171105
    },
    {
      "title": "Five Stars",
      "text": "They are really great. Good imaging and comfortable. Great buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Allen L. Boogaard",
      "helpful_votes": 0,
      "publication_date": 20170120
    },
    {
      "title": "Five Stars",
      "text": "Excellent. Very comfortable. I like that adjustable channel and volume control on the ear piece.",
      "rating": 5.0,
      "verified": true,
      "author": "Dph",
      "helpful_votes": 0,
      "publication_date": 20160609
    },
    {
      "title": "Five Stars",
      "text": "Awsome sound .....And Kicker too oh ya these head phones rock",
      "rating": 5.0,
      "verified": true,
      "author": "JasonWyle",
      "helpful_votes": 2,
      "publication_date": 20150512
    },
    {
      "title": "love the bass",
      "text": "love the bass. the clarity of of the music was great. never heard of kicker having headphones, till i found these. love them.",
      "rating": 5.0,
      "verified": true,
      "author": "tyler",
      "helpful_votes": 0,
      "publication_date": 20170724
    },
    {
      "title": "Where is the bass?",
      "text": "Pros: - Extremely comfortable - Light - Loud Cons: - Lacking in the bass department",
      "rating": 3.0,
      "verified": true,
      "author": "L. Bird",
      "helpful_votes": 0,
      "publication_date": 20150328
    },
    {
      "title": "Decent but not without faults",
      "text": "Sound quality is great however the Bluetooth range and connection is questionable, I personally thought it would be better",
      "rating": 3.0,
      "verified": true,
      "author": "Kevin pearce",
      "helpful_votes": 0,
      "publication_date": 20150502
    },
    {
      "title": "Great Buy!",
      "text": "Bought these because have had previous experience with Kicker audio in my car. Recieved them and immediately tried them on. Sounded great. Although, the more I listened to them, the better they sounded. I suggest playing them for an hour or so continously to break them in. No complaints. Battery life is great. Charges up quickly. Comes with a nice carrying pouch to keep protected against scratches. Best value for you price.",
      "rating": 5.0,
      "verified": true,
      "author": "Shiv Patel",
      "helpful_votes": 0,
      "publication_date": 20160727
    },
    {
      "title": "These are by far the best headphones I have ever had the bass on bass ...",
      "text": "These are by far the best headphones I have ever had the bass on bass boosted songs on YouTube when you put these on full blast the bass makes them vibrate on your ears and when your more relaxed the clarity of the songs is 100% these headphones are amazing definitely worth the money and they are so much better than beats or JBL I love them :)",
      "rating": 5.0,
      "verified": true,
      "author": "M. J. Hilty",
      "helpful_votes": 0,
      "publication_date": 20171010
    },
    {
      "title": "Very comfortable, good audio with plenty of bass",
      "text": "Very comfortable, good audio with plenty of bass. The bluetooth connection was very weak and would occasionaly cut out while listening to music, so I returned them. They worked perfectly when plugged into the headphone jack. I suppose it could be that I just got a bad unit, but I can't say as I haven't bought another one.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170108
    },
    {
      "title": "Another great kicker product",
      "text": "Best bang for your buck. Why pay 350 and up to beats audio. I have a pair of studios and I actually prefer these kickers over them. Definitely recommend them to any one looking for over the ear Bluetooth headphones",
      "rating": 5.0,
      "verified": true,
      "author": "ROY ROBERTS",
      "helpful_votes": 0,
      "publication_date": 20160917
    },
    {
      "title": "The headphones work great when you can get them to pair to a ...",
      "text": "The headphones work great when you can get them to pair to a blue tooth source. When the item first arrived I inspected the item charged up the headphone set until it reached a full charge. At first the headphones would pair with out any problems but now can not even get them to pair to a simple blue tooth transmitter. For as much money the charge for these headphones this really should not be a issue. I would recommend that you steer clear of these headphones. When they work they are good but when they do not work, well...",
      "rating": 1.0,
      "verified": true,
      "author": "kerrie carter",
      "helpful_votes": 0,
      "publication_date": 20160806
    },
    {
      "title": "I like my music loud when I workout got so frustrated ...",
      "text": "Bluetooth cuts in and out .I like my music loud when I workout got so frustrated with them sent them back so so bummed",
      "rating": 3.0,
      "verified": true,
      "author": "Lisa Baker",
      "helpful_votes": 0,
      "publication_date": 20160727
    },
    {
      "title": "Good headphones hobbled by Bluetooth",
      "text": "Sounded good, but unfortunately did not work well in my circumstances where Bluetooth audio is always iffy. I don't necessarily blame the headphones, because I've tried other bluetooth audio devices that also didn't work well in my office. So I've concluded that 1. my environment may be challenging and 2. Bluetooth is generally flaky and disappointing.",
      "rating": 3.0,
      "verified": true,
      "author": "Fyodor Sukhov",
      "helpful_votes": 0,
      "publication_date": 20150926
    },
    {
      "title": "I loved the headphones",
      "text": "I loved the headphones, but the charging system is very flawed. The one sent to me didnt hold a charge for very long and eventually stopped being able to charge within a few months. Overall, Im very dissapointed with my transaction on this high ticket item.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20160720
    },
    {
      "title": "NO GOOD!!",
      "text": "NO GOOD!!! They are extremely fussy trying to pair with the Bluetooth in my PC or a TaoTronics wireless stereo transmitter (both are A2DP). They will pair after you mess around with them for QUITE A WHILE if you have the time..frustrating Really not worth the money!",
      "rating": 1.0,
      "verified": true,
      "author": "Robert C. Corbett",
      "helpful_votes": 0,
      "publication_date": 20160508
    },
    {
      "title": "He can hear me now!",
      "text": "We got these for our college student and he loves them. He also has no excuse for not hearing me now! Ha ha ha!! They have good range away from his computer or phone.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan Davis",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "Awesome product",
      "text": "This is my second pair of kickers! I love them so much I will never buy other brands!!",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa Monaghan",
      "helpful_votes": 0,
      "publication_date": 20201217
    },
    {
      "title": "Kicker Battery problems",
      "text": "My first purchase of these headphones at Costco lasted 13 months, it would not charge at all, contacted Kicker and they were nice enough to send me a new pair. Well guess what, after 13 months unable to charge, contacted Kicker and they said sorry bad battery, total change of attitude, maybe they thought I was going to rip them off or something. Thanks to the great return policy at Costco my purchase was refunded in full. I would never never never recommend Kicker Bluetooth headphones, unless you only want to use them for 12 or 13 months then toss them.",
      "rating": 1.0,
      "verified": false,
      "author": "Gondolfo",
      "helpful_votes": 2,
      "publication_date": 20170315
    },
    {
      "title": "These sound great if you have a good sound",
      "text": "If you want good sound then this is it, you have to have a good sound card and they will rock.",
      "rating": 5.0,
      "verified": false,
      "author": "don w",
      "helpful_votes": 0,
      "publication_date": 20180903
    },
    {
      "title": "There highly recommend",
      "text": "I highly recommend these headphones bc I listened to them for a whole hour and the sound is amazing they have very good bass and the cushions that's on them it's very comfortable I fell in love with these headphones they sound real amazing",
      "rating": 5.0,
      "verified": false,
      "author": "Nathaniel",
      "helpful_votes": 0,
      "publication_date": 20180911
    },
    {
      "title": "Dont buy",
      "text": "bought earphones year ago and battery life is very disappointing would not recommend these to anyone bad skipping on bluetooth and phone is right next to them",
      "rating": 1.0,
      "verified": false,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "... fully charged it and it still not working sound good but the Bluetooth does not work properly",
      "text": "These headphones Lasted me only one day the Bluetooth started going on and off i fully charged it and it still not working sound good but the Bluetooth does not work properly",
      "rating": 2.0,
      "verified": false,
      "author": "Martin Lofton",
      "helpful_votes": 0,
      "publication_date": 20170329
    },
    {
      "title": "They do sound good when working",
      "text": "I purchased these headphones and they worked for a month and a half. The micro usb slot where you plug in the charger broke and they no longer charge. They do sound good when working, but unfortunately they are built so cheaply. I do not recommend these to anyone.",
      "rating": 1.0,
      "verified": false,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160118
    }
  ],
  "product_meta": {
    "title": "Kicker HP402BTB Tabor Bluetooth Wireless Headphones",
    "description": "aptX Lossless Bluetooth audio coding; 3-button mic/remote on optional cable; black w/ yellow accents",
    "rating": 4.1,
    "feature_bullets": [
      "aptX Lossless audio codec for best Bluetooth sound",
      "Rechargeable battery rated at 10 hours and charged with USB micro source",
      "Flat cable included for a direct-connect option when wireless isn't available. Cable includes 1-button, in-line remote and mic for audio control and hands-free calling. Connectivity Technology: Bluetooth and wired"
    ],
    "specifications": {
      "Product Dimensions": "7.3 x 2.25 x 8.1 inches",
      "Item Weight": "10.4 ounces",
      "Manufacturer": "Stillwater Designs US",
      "ASIN": "B00PKDY28I",
      "Item model number": "HP402BTB",
      "Batteries": "1 Lithium Polymer batteries required.",
      "Customer Reviews": "4.1 out of 5 stars73 ratings4.1 out of 5 stars",
      "Best Sellers Rank": "#5,314 in Over-Ear Headphones",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "November 13, 2014"
    },
    "categories": [
      "Over-Ear Headphones",
      "Electronics",
      "Headphones"
    ],
    "price": 96.49
  }
}