{
  "website_summaries": [
    {
      "verdict": "A well-built and reliable small solar panel hampered by a temperamental charge controller.",
      "pros": [
        "Charges batteries to run small devices, outdoor fountains or LED lights well",
        "Panel’s frame is very sturdy and protects panel"
      ],
      "cons": [
        "Some users had difficulty connecting panel wiring to charge controller",
        "20W power output is too small for some projects",
        "Charge controller has few power indicators and isn’t reliable",
        "Wiring connectors seem flimsy and tend to rust easily"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "GARBAGE",
      "text": "Zero stars. Item delivered January 7th. Worked when installed. Installed on my camper to keep the battery charged through the winter. I checked the battery voltage today, 11.9. Full sun. No glowing green light on the charge controller and no output voltage. It's dead within 6 weeks. If the seller is reading, know that my return window closed on February 6th, so I can't even submit a return.",
      "rating": 1.0,
      "verified": true,
      "author": "steve s",
      "helpful_votes": 20,
      "publication_date": 20190215
    },
    {
      "title": "It works great",
      "text": "This panel works from dusk to dawn. It generates a solid 17 volt under direct sunlight and 12-17 volt with cloudy sky or 7 AM before the sun even brighten. I used it in conjunction with \"USMEI Dual USB Charger Socket Waterproof Power Outlet 4.8A with 12V/24V Voltmeter LED Digital Display for Car Boat Marine Motorcycle ATV RV Campers Tractors\" with no 12V battery to charge my phone when I am working outside",
      "rating": 5.0,
      "verified": true,
      "author": "Rodney",
      "helpful_votes": 9,
      "publication_date": 20190105
    },
    {
      "title": "Good power generation",
      "text": "This creates good power. I'm using this on a chicken pen project - create/store power from the sun to run an automatic door opener. Everything I did works perfectly - this panel adequately charges a deep cell battery. I would next time not use the small controller they send, it doesn't tell you enough information.",
      "rating": 5.0,
      "verified": true,
      "author": "E. Solch",
      "helpful_votes": 22,
      "publication_date": 20160421
    },
    {
      "title": "Used item for my RV/camper to keep my battery's charged ...",
      "text": "Used item for my RV/camper to keep my battery's charged for 5 days between use to keep the fridge running. I run two battery's and make sure the only thing on when i leave is the fridge...and it works well.",
      "rating": 5.0,
      "verified": true,
      "author": "Captain Mike",
      "helpful_votes": 12,
      "publication_date": 20170712
    },
    {
      "title": "Ok panel, dead solar controller",
      "text": "The headline sums it up, panel seems to function ok, build quality is ok, solar controller (not as pictured in the ad), feels cheaply built, and did not function on arrival, LED's did not light, and there was little to no output voltage when tested with a multi-meter. This product is obviously a build it yourself kit made up of a small solar panel, a junk solar controller, and a decent looking set of battery clips. Note assembly requires wire stripping and a precision flat head screw driver. The only reason I am giving 2 stars is that the panel does function",
      "rating": 2.0,
      "verified": true,
      "author": "Penguin Life",
      "helpful_votes": 2,
      "publication_date": 20191004
    },
    {
      "title": "Good quality, Good value.",
      "text": "I bought this for a minimal off-grid system to be used for camping to charge phones and run some LED lights. The quality of the panel and wires is very good. The charge controller is a little cheap looking but very adequate. I paired it with a 18Ah lead acid battery. I haven't had a chance to use it camping but in home testing it can keep the battery topped off with very minimal direct sun during the day. I have been charging 2 phones daily and running 2 4.5W light strips for 2 hours/night. Not a huge task but the panel is in 90% indirect sun.",
      "rating": 5.0,
      "verified": true,
      "author": "BE from ME",
      "helpful_votes": 0,
      "publication_date": 20200812
    },
    {
      "title": "Panel well built",
      "text": "Like most things from China there is little in the way of instructions. The controller is semi self explanatory. I wonder if it is waterproof. The panel seems well made sans any indication of mounting holes or suggestions. I placed it in full sun and connected it to the battery. Battery voltage was 12.61v when I began. A couple of hours later it was 12.83v. Panel was laying flat horizontal to the ground, nowhere near where it should be pointed. It is doing the job of trickle charging the battery. I would purchase again and recommend if your looking for a battery tender.",
      "rating": 4.0,
      "verified": true,
      "author": "Smalls",
      "helpful_votes": 2,
      "publication_date": 20190330
    },
    {
      "title": "Worked great! Edited to add - except...",
      "text": "Purchased this last November to try and keep my lawn tractor's battery charged during the winter. Mounted the solar panel on the South facing wall of my shed, the controller inside. Just started the tractor up, (4/5/20), and it is like a brand new battery. I had previously tried one from Harbor Freight, but it was not effective at all. Fast forward to 2020, I ordered a second unit for my brother-in-law. Opened the box well past the 30 day return window and the unit was DOA. T-shooting indicated zero output from the solar unit. I found a cold solder joint at the connection, re-flowed the solder and now it works fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Techmike",
      "helpful_votes": 0,
      "publication_date": 20200406
    },
    {
      "title": "controller junk",
      "text": "Its a nice panel and so far good out put from it, sturdy well built, battery clamps are descent and wiring seems right size and good quality, -- but when i hooked it to my bike batt. I noticed voltage going down, so no lights lit on controller Hmmm. Tested output 6.5 volts, tested panel 17.2. Tried another battery same result. Hooked panel to another controller worked great. Tried controller with a different panel 6.5 output, soooo- Im saying controller junk. Another roll of the dice on CE",
      "rating": 4.0,
      "verified": true,
      "author": "pickerguy",
      "helpful_votes": 0,
      "publication_date": 20191108
    },
    {
      "title": "Charge controller didn't work",
      "text": "Bought this to power a CPU style fan in my solar space heater. Out of the box the charge controller didn't work so I've wired the fan directly to the CPU fan. Since the fan is variable speed and the panel can't exceed the power consumption of the fan it's a non issue that the charge controller doesn't work. However if you were buying it and needed the controller I would look for something else.",
      "rating": 3.0,
      "verified": true,
      "author": "J. Young",
      "helpful_votes": 0,
      "publication_date": 20200129
    },
    {
      "title": "not happy",
      "text": "this product never worked for me , got in contact with provider but no resolve",
      "rating": 1.0,
      "verified": true,
      "author": "Jesse H.",
      "helpful_votes": 5,
      "publication_date": 20190329
    },
    {
      "title": "Voltage Controller/Regulator is junk",
      "text": "My automatic gate solar panel died after almost 15 years. I thought this panel would be a good replacement and adds a voltage regulator as well. I can't fully express my dissatisfaction with the design and quality of the controller/regulator. I attempted to connect this but the screw down terminals won't hold the wires in place. The tabs on the side of the plastic case are so fragile that you can't expect it to last very long. This makes the brand 'Eco-Worthy' destined for the recycle bin and not a working system.",
      "rating": 1.0,
      "verified": true,
      "author": "Renda Overbo",
      "helpful_votes": 3,
      "publication_date": 20191123
    },
    {
      "title": "Panel and replacement regulator work great!",
      "text": "The voltage regulator does not work. Input voltage 16.8v, but battery output at source was 0.6v and the load output port was 0v. See images for proof. I even took video. The only reason why this was a “good deal” was because it came packaged with a voltage regulator. Unfortunately the regulator does not work, making this a not wise buy. UPDATE: I received a replacement two days after notifying Amazon and it works perfectly. Very rapid response and the product is perfect",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica & Richard",
      "helpful_votes": 0,
      "publication_date": 20190918
    },
    {
      "title": "Fantastic little panel",
      "text": "This is a nice little solar panel that I use for charging two 12 volt batteries. I use the batteries to run a water pump attached to my rainwater collection system.",
      "rating": 5.0,
      "verified": true,
      "author": "CylonGolfer",
      "helpful_votes": 8,
      "publication_date": 20170304
    },
    {
      "title": "Excellent product, Easy to setup!",
      "text": "Let me start by saying this solar panel is the best I’ve ever purchased! It was an absolute breeze to set up, because for once the instructions were perfectly clear as to how to set it up! It took me all of 5 minutes to have everything up and running. So easy that you could keep this in your vehicle for emergencies if need be.",
      "rating": 5.0,
      "verified": true,
      "author": "Desert Snow",
      "helpful_votes": 0,
      "publication_date": 20200909
    },
    {
      "title": "Good Value for the Money",
      "text": "So far I'm very pleased. The instructions were clear and the product easy to install. I did locate the controller in a weather proof box based on another review showing rust on it's connectors. The output voltage from the controller is what I would expect for a 12v battery when it's getting full sun.",
      "rating": 5.0,
      "verified": true,
      "author": "Dean C.",
      "helpful_votes": 0,
      "publication_date": 20190725
    },
    {
      "title": "Cheap controller. Burned up after 2 months use.",
      "text": "Headline pretty much says it. Used it for about 2 months in a water proof scenario and one day after flowing a few amps through it for about 20 minutes solid versus the intermittent use it was getting... a strong burning electrical smell came from it for when I used it for the next couple of times and then it just quit. The solar panel has been pretty solid and the 2 together kept my 12vmower battery charged the whole time running an rv water pump once a night for about 3 minutes.",
      "rating": 2.0,
      "verified": true,
      "author": "bev01470",
      "helpful_votes": 0,
      "publication_date": 20190929
    },
    {
      "title": "Not charging at 20 watts, but it is good for my purposes.",
      "text": "It is producing 13.5 Watts for me. Even with sun overhead. I did replace the wires with heavier guage wire based on another review before installing. Perhaps it is my cable. I will try new cable next year and see what happens. I use this on my sailboat to add charge to the battery. Since the motor is hardly run, it doesn't get recharged enough after starting motor and using it for instruments and lights.",
      "rating": 4.0,
      "verified": true,
      "author": "Beachdog3",
      "helpful_votes": 0,
      "publication_date": 20180726
    },
    {
      "title": "Not worth buying",
      "text": "In short, not worth buying, after a month the best I can get out of it is 5.4 volts on the brightest of days pointing it directly at the sun, it actually drains my small 32ah battery rather than charging it",
      "rating": 2.0,
      "verified": true,
      "author": "jesse g.",
      "helpful_votes": 3,
      "publication_date": 20180728
    },
    {
      "title": "This was a great deal!",
      "text": "Compact solar charging for my Mighty Mule automatic gate opener battery. So far (Since October, 2108) this solar panel and charge controller has kept my battery fully charged. Going in to winter months now so I will update this review in a few months. The quality seems to be very good (I have Renogy Solar Panels for other applications) and when comparing with other panels I have purchased, this Eco-Worthy panel is comparable in quality and workmanship.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard",
      "helpful_votes": 0,
      "publication_date": 20181122
    },
    {
      "title": "but there are items at HD that work just fine. Also note that the terminal block on the ...",
      "text": "Works very well. Keep in mind that no attachment brackets are supplied, but there are items at HD that work just fine. Also note that the terminal block on the back of the panel is not flush with the panel frame. It extends about 1/4\" out of the frame. The panel mounting will have to account for that.",
      "rating": 4.0,
      "verified": true,
      "author": "Ron A.",
      "helpful_votes": 2,
      "publication_date": 20180507
    },
    {
      "title": "Free energy",
      "text": "I like this solar collector. It helps to keep my rv batteries charged. However, I wish I had gotten the larger one. This one maintains, but will not quite charge. If you just want to maintain and not add additional charge, this is the product for you.",
      "rating": 5.0,
      "verified": true,
      "author": "garhar42",
      "helpful_votes": 0,
      "publication_date": 20200811
    },
    {
      "title": "Watch /check the short harnesses for correct polarity first",
      "text": "Product seems ok , but wiring was crossed on the short harnesses going to the battery ( reversed polarity) and burned out the solar charge controller , so no more control box & putting 20 volts into truck battery .Guess quality control isn't like it used to be .",
      "rating": 3.0,
      "verified": true,
      "author": "George",
      "helpful_votes": 0,
      "publication_date": 20200701
    },
    {
      "title": "Charge it up!",
      "text": "Well built solar panel and controller that is easy to install. The only issue I had with it is written wiring instructions were not helpful! They talked about amps, mounting and such but nothing else.",
      "rating": 5.0,
      "verified": true,
      "author": "Lawman102",
      "helpful_votes": 0,
      "publication_date": 20191013
    },
    {
      "title": "Controller may be bad",
      "text": "I installed this several months ago and it seemed to work fine. Now the \"load\" led light stays on all the time even after removing all wires from the battery except for the clips to the controller. I've asked support for help but have recvd no contact from anyone. I'll try to submit an update if I hear from them.",
      "rating": 2.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20201001
    },
    {
      "title": "Super easy to plug in & produce 12V.",
      "text": "So, I haven't actually screwed or glued this to my RV yet but it took less than 5 minutes to read the installation instructions and start making power. Looking forward to years of off-the-grid camping.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew Leighton",
      "helpful_votes": 0,
      "publication_date": 20201024
    },
    {
      "title": "Didn't last",
      "text": "I purchased the system In April 2016 and was used for an electric fence charger. Panel used to charge the battery. Considering the price compared to other units, I thought a somewhat upscale unit would be worth the money. It currently is only putting out 4 1/2 volts. I did E-mail the company, but only 1 year warranty, so out of luck on a replacement.",
      "rating": 2.0,
      "verified": true,
      "author": "geezer11",
      "helpful_votes": 2,
      "publication_date": 20170612
    },
    {
      "title": "Very good product",
      "text": "I used this to put 12v lights in my shed that has no power .. It was very simple to connect.. Just follow the directions for order of connections to the controller .. I used a small motorcycle battery and it powers 3 12v lights very easily .. The controller makes sure the battery stays charged .. I recommend for this kind of use.",
      "rating": 5.0,
      "verified": true,
      "author": "MikeS",
      "helpful_votes": 0,
      "publication_date": 20201010
    },
    {
      "title": "I'm not so sure it's actually worth the money.",
      "text": "if your battery that you're trying to charge doesn't have at least 12 volts it's not going to work very well for charging it. I had to charge my battery before I could use this to charge it.",
      "rating": 1.0,
      "verified": true,
      "author": "Cheyenne D.",
      "helpful_votes": 2,
      "publication_date": 20200103
    },
    {
      "title": "No deciperable mounting instructions...",
      "text": "Interestingly enough, your instructions under the section 5.0 Mountings, \" The ECO PV modules is contingent upon modules being mounted in accordance with the requirements described in this section (please turn over the page) \" . Upon turning over the page, the text is all in German... how helpful!",
      "rating": 3.0,
      "verified": true,
      "author": "J McDonald",
      "helpful_votes": 0,
      "publication_date": 20190804
    },
    {
      "title": "WHAT?",
      "text": "Check the rating system for this SOLAR panel... Rate the warmth? rate the thickness? rate the sheerness? like just about ALL amazon stuff, POORLY PACKAGED.",
      "rating": 3.0,
      "verified": true,
      "author": "Bob Hemp",
      "helpful_votes": 0,
      "publication_date": 20200907
    },
    {
      "title": "this kit is actually a 12volt kit",
      "text": "I purchased this set with the intention to charge my 24 volt military generator batteries but apparently I have to purchase another solar module to connect it in series with the one that comes with this kit. Bummer! I thought I was purchasing a 12 or 24 volt solar charger but the solar module only puts out 17.9 volts, so, It cannot charge my 24 volt batteries (28 volt while charging)",
      "rating": 2.0,
      "verified": true,
      "author": "Lombardo Fierro",
      "helpful_votes": 3,
      "publication_date": 20180524
    },
    {
      "title": "Good little panel",
      "text": "I bought this hoping it would keep/charge a battery in a truck that I don't drive often and it not only keeps the battery topped off but did fully charge the battery from almost dead. The only down side it the lack of instructions for the solar charger. But it would not too hard to figure out.",
      "rating": 5.0,
      "verified": true,
      "author": "adams",
      "helpful_votes": 0,
      "publication_date": 20180205
    },
    {
      "title": "Provides no voltage",
      "text": "I did not have a chance to open the package until 6/20 and installed on my plane. Did not work at all. I realize it's after the \"return\" time envelop but I'd appreciate a waiver on the time. I'd need a few days to get out to the airport and uninstall panel.",
      "rating": 1.0,
      "verified": true,
      "author": "Richard  Weinberg",
      "helpful_votes": 0,
      "publication_date": 20200625
    },
    {
      "title": "Keeps the fencemgoing",
      "text": "Works great so far. Using on 12v electric fence to recharge the battery, works really well so far. Bought a second panel for another pasture.",
      "rating": 5.0,
      "verified": true,
      "author": "Alan Brend",
      "helpful_votes": 0,
      "publication_date": 20200829
    },
    {
      "title": "Not worth it",
      "text": "The manual says it comes with a small u bracket..... not in package. Inquired of seller who said it doesn't come with bracket. Returned it. Buying something else",
      "rating": 2.0,
      "verified": true,
      "author": "Teri",
      "helpful_votes": 0,
      "publication_date": 20200531
    },
    {
      "title": "It's a solar panel ,1 each.",
      "text": "Delivery was very timely. Unit looks to be of quality construction. Installed on he boat and it is charging the 100AH battery. So far, it's good buy.",
      "rating": 4.0,
      "verified": true,
      "author": "Dennis Hannick",
      "helpful_votes": 0,
      "publication_date": 20200606
    },
    {
      "title": "good tricle charger",
      "text": "have this keeping the battery charged on a large farm tractor that is mostly retired and has no access to power. So far it works great",
      "rating": 5.0,
      "verified": true,
      "author": "N. Sorenson",
      "helpful_votes": 0,
      "publication_date": 20201010
    },
    {
      "title": "Not working for me.",
      "text": "I have it hooked to two new deep cell batteries and I am trying to run 1 USB plug for a motion camera. It won't charge enough to run it. We have had nothing but sunshine and I have new batteries.",
      "rating": 2.0,
      "verified": true,
      "author": "Ronnie",
      "helpful_votes": 0,
      "publication_date": 20191008
    },
    {
      "title": "Great product missing the controller",
      "text": "I think it's a great unit however didn't come with the control Box and there's no way to contact the seller? Anyone know how to",
      "rating": 4.0,
      "verified": true,
      "author": "harvey s. meshel",
      "helpful_votes": 0,
      "publication_date": 20190504
    },
    {
      "title": "Isn’t able to charge a car battery",
      "text": "The main reason we wanted this was to back up a car battery that loses charge. If that’s your reason, I wouldn’t purchase this.",
      "rating": 2.0,
      "verified": true,
      "author": "Adrienne",
      "helpful_votes": 0,
      "publication_date": 20200921
    },
    {
      "title": "Very happy with this",
      "text": "Bought this to keep a charge on my automatic gate. The construction feels good and sturdy. I have happy with it. The I am getting 10w out of it so that's good. It comes with a short wire connected to the panel that is soldered on the small terminals under a black cover. I do wish these were screwed on instead so I could attach longer wires without having to crimp connectors on them. It does come with a longer set that connects to a voltage regulator.",
      "rating": 4.0,
      "verified": true,
      "author": "Daniel",
      "helpful_votes": 4,
      "publication_date": 20160321
    },
    {
      "title": "Can put out about 1.1 amps in full sunlight",
      "text": "Bought this for burning man to charge a 12 v battery. Sturdy panel. The voltage regulator is a toy though. Don't trust it at all to last a long time. On a full sun day with the angle optimized I could get 1.1 amps output on the output of the regulator.",
      "rating": 4.0,
      "verified": true,
      "author": "r570sv",
      "helpful_votes": 0,
      "publication_date": 20181021
    },
    {
      "title": "Good charger good price",
      "text": "I like that it works so very well. I use it to keep the cranking battery on my sailboat charged. Even on a cloudy day, it stays above 12 VDC. I didn’t like that I needed to go out and buy a tiny flat head screwdriver to add the wires to the charge controller. But it is a really great solar charger. I will be buying another one.",
      "rating": 5.0,
      "verified": true,
      "author": "Brandon L. Serna",
      "helpful_votes": 0,
      "publication_date": 20191117
    },
    {
      "title": "Great value!",
      "text": "Liked the first panel so much I bought a 2nd. Keeps the starting battery on my Mhome at full charge. 2nd panel is for the boat battery. Just remember that polarity matters when hooking up 12 volt systems.",
      "rating": 5.0,
      "verified": true,
      "author": "Grandpa B",
      "helpful_votes": 0,
      "publication_date": 20190506
    },
    {
      "title": "Good for the proce",
      "text": "Nice small panel. I use it in my shed to run a sound machine to keep rodents away",
      "rating": 5.0,
      "verified": true,
      "author": "Benjamin",
      "helpful_votes": 0,
      "publication_date": 20200916
    },
    {
      "title": "caught fire",
      "text": "Controller caught fire when I hooked it all up. Not worth the risk of trying again!",
      "rating": 1.0,
      "verified": true,
      "author": "Mouse",
      "helpful_votes": 0,
      "publication_date": 20200907
    },
    {
      "title": "Great piece of equiptment.",
      "text": "i hooked this solar unit to my boat power controller. I have 2 12v motorcycle batteries wired in parallel to operate bilge pump, nav lights and sound system. This panel and controller keep it at top charge. Great product. Thumbs up.",
      "rating": 5.0,
      "verified": true,
      "author": "Failsafe",
      "helpful_votes": 0,
      "publication_date": 20200816
    },
    {
      "title": "Nice one",
      "text": "I use this for my 5th wheel batters and truck. It has been doing a great job of keeping them charged.",
      "rating": 5.0,
      "verified": true,
      "author": "Kiwi Yarborough",
      "helpful_votes": 0,
      "publication_date": 20200605
    },
    {
      "title": "Excellent.",
      "text": "Works fine. A piece came defective and the supplier sent a new one at no cost just after checking that I connected it properly. Excelent customer service.",
      "rating": 5.0,
      "verified": true,
      "author": "Eduardo Campuzano",
      "helpful_votes": 0,
      "publication_date": 20200223
    },
    {
      "title": "Worked well it did what it said",
      "text": "Bought this for the battery of the Troll Motor on the boat, my husband left his keys in the truck ignition and kill the battery when we were camping and it charged up in 20 minutes, we were also able to keep our phones charged, about an hour to fully charge phones",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190920
    },
    {
      "title": "Works great on my gate opener",
      "text": "Works great on my gate opener. Has kept the battery charged for a full year with no problems yet.",
      "rating": 5.0,
      "verified": true,
      "author": "Dennis",
      "helpful_votes": 2,
      "publication_date": 20180428
    },
    {
      "title": "Very nice trickle charger.",
      "text": "I've got a car that sits most of the time. The battery would die all the time since it hardly got driven. Hooked this up and tossed it on the roof rack and voltage never drops now. Car is parked outdoors where it gets sunlight, doubt it would work in a garage.",
      "rating": 5.0,
      "verified": true,
      "author": "Stanley Ho",
      "helpful_votes": 0,
      "publication_date": 20181202
    },
    {
      "title": "Easy charging solution",
      "text": "This was a great choice for keeping a Marine battery charged in the summer,it will be used in the winter as well to charge smaller batteries. It was easy to install and hook up too! Good find/buy",
      "rating": 5.0,
      "verified": true,
      "author": "Master",
      "helpful_votes": 0,
      "publication_date": 20190830
    },
    {
      "title": "Still in use after a year",
      "text": "Perfect for charging my batteries for my garden water system. Even when overcast it still gives power as long as I wipe it off every month to keep it clean",
      "rating": 5.0,
      "verified": true,
      "author": "MasterVernon",
      "helpful_votes": 0,
      "publication_date": 20190704
    },
    {
      "title": "It was working great for first several months but gradually failed to keep ...",
      "text": "I bought this item 6 months ago and it is now non functional! It was working great for first several months but gradually failed to keep my battery charged.",
      "rating": 1.0,
      "verified": true,
      "author": "Packard36",
      "helpful_votes": 3,
      "publication_date": 20180106
    },
    {
      "title": "Needed new solar panel to power a circulating pump in a solar hot water system",
      "text": "needed a new solar panel to power a pump on a solar hot water system and this one worked much better then the original...",
      "rating": 5.0,
      "verified": true,
      "author": "Loxahatchee Joe",
      "helpful_votes": 3,
      "publication_date": 20170425
    },
    {
      "title": "Great battery charger",
      "text": "Perfect for a boat, RV, or any 12v battery systems you have. I use it to keep the batteries in my fishing boat topped off and ready to go.",
      "rating": 5.0,
      "verified": true,
      "author": "ed",
      "helpful_votes": 0,
      "publication_date": 20190611
    },
    {
      "title": "Great solar panel for small batteries and to start with.",
      "text": "Great solar panel for small batteries and to start with. Pair this with a 12 volt sealed lead acid battery (for replacement in computer UPS systems, etc.) and you will have a great backup power system. It is great way to power a amateur radio transceiver.",
      "rating": 5.0,
      "verified": true,
      "author": "Peter Morrison",
      "helpful_votes": 0,
      "publication_date": 20191110
    },
    {
      "title": "Good product I believe for the price but time will tell",
      "text": "It functions but the charge controller is not the one as pictured or described",
      "rating": 4.0,
      "verified": true,
      "author": "William Tuck",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "It's OK",
      "text": "For a 20W panel it does the job. The controller is low end so not as efficient as it could be but it works. I use this to keep my boat batteries charged and it seems to do the job. For the price it's a good deal.",
      "rating": 4.0,
      "verified": true,
      "author": "kenneth h graham",
      "helpful_votes": 0,
      "publication_date": 20181016
    },
    {
      "title": "Still going strong for 2 years!!!!",
      "text": "Replaced solar panel charger for gate. It has been well worth it. Coming up on 2 years, no problems. I upgraded the device between it and the battery as recommended in othe post. Glad I did because the one that comes with it seemed cheaply made. Had to alter the mounting bracket slightly so it would fit. Would recommend!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Brett D Zeigler",
      "helpful_votes": 0,
      "publication_date": 20180830
    },
    {
      "title": "Easy.  Simple.  Works!",
      "text": "I really like it!!! Could have used a disposable tool for the wires; or a mount for stuff ( like \"velcro\") or longer wires but nothing a little tape can't fix. CAN'T BEAT IT $$",
      "rating": 5.0,
      "verified": true,
      "author": "marc",
      "helpful_votes": 0,
      "publication_date": 20180828
    },
    {
      "title": "Great little panel for the money",
      "text": "Great little panel for the money. The controller is bonus. Just keep in mind the power rating of the controller. May not be big enough for your project. I ended up purchasing a larger controller afterwards, which wasn't all that much money so no big deal. Worth mentioning.",
      "rating": 5.0,
      "verified": true,
      "author": "Gary Lowell Jr",
      "helpful_votes": 11,
      "publication_date": 20161021
    },
    {
      "title": "Broken Glass",
      "text": "When I opened the box, the glass was shattered. The delivery person handed it to me, so it wasn't dropped and I didn't drop it. The package was just thin cardboard secured with thick tape that seemed to be nylon.",
      "rating": 1.0,
      "verified": true,
      "author": "kwg",
      "helpful_votes": 2,
      "publication_date": 20181014
    },
    {
      "title": "Takes a couple of days to charge a 12 volt ...",
      "text": "Takes a couple of days to charge a 12 volt battery, but it does work, and a slow charge lasts longer.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert T. Wilosn",
      "helpful_votes": 2,
      "publication_date": 20171219
    },
    {
      "title": "room to improve",
      "text": "panel works well , however brackets for mounting should be included, charge controller junk, worked for 1 day",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190713
    },
    {
      "title": "Awesome",
      "text": "Awesome for charging anything 12. I use it to keep a car battery connected to my gate opener. Even with several days of rain, the battery and charger keep working",
      "rating": 5.0,
      "verified": true,
      "author": "Sam",
      "helpful_votes": 0,
      "publication_date": 20181021
    },
    {
      "title": "Works great",
      "text": "It’s a little big for a car battery but even on cloudy days 12V lol",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181026
    },
    {
      "title": "I very much like the panel",
      "text": "I very much like the panel, not so much the charge controller as it seems flimsy and fragile. I don't expect it to last too long. As for the panel, it's been attached to my fence charging 12v batteries with no issues whatsoever.",
      "rating": 3.0,
      "verified": true,
      "author": "Crystal Aubry",
      "helpful_votes": 2,
      "publication_date": 20160614
    },
    {
      "title": "Keeps my battery charged",
      "text": "I bought this solar rig to keep my riding mower battery charged in my storage shed. After 10 days of use, it's working very well. I even hooked up a 12V light and switch to the \"load\" output, which is very handy. I only give it 4 stars because it doesn't come with a mounting bracket.",
      "rating": 4.0,
      "verified": true,
      "author": "Rimshot",
      "helpful_votes": 0,
      "publication_date": 20190829
    },
    {
      "title": "Panel great - controller not so much",
      "text": "The panel is great. I use it for keeping the battery on my garden lawn mower full. However, the controller it comes with is useless. Even though I tried to protect it from the rain, the leads into the controller continued to rust out. It is difficult to get the rusted parts of the wire out of the little hole to be able to insert the re-cut wire.",
      "rating": 3.0,
      "verified": true,
      "author": "Lisa",
      "helpful_votes": 2,
      "publication_date": 20170714
    },
    {
      "title": "A Nice little unit. Worth its Price definitely! !",
      "text": "ECO-WORTHY 20W 12V Solar Panel Kit: 20 Watt Polycrystalline Solar Panel & Battery Clips & 3A Charge Controller...I was worried it might be totally junk. When I opened it I was impressed by the quality of the panel. However, The parts they used to connect the wiring are a bit cheap, the wire soldering is not the best but it works!! But overall it's not a bad unit. I ordered this to try and maintain my battery while out trolling in my pontoon boat. Once I test it out I will edit this review..Buy this with confidence that your getting a decent quality Item for your money..",
      "rating": 4.0,
      "verified": true,
      "author": "Kurt Brown of Heber",
      "helpful_votes": 5,
      "publication_date": 20170424
    },
    {
      "title": "Excellent battery charger for my lawn tractor",
      "text": "Excellent battery charger for my lawn tractor. No more dragging the power cords and charger out every couple months. I just leave this on for a week and I am good to go.",
      "rating": 5.0,
      "verified": true,
      "author": "rc hobbiest",
      "helpful_votes": 0,
      "publication_date": 20180704
    },
    {
      "title": "Charge controller died",
      "text": "The charge controller died after a few days of charging a small 10ah battery",
      "rating": 2.0,
      "verified": true,
      "author": "KS",
      "helpful_votes": 0,
      "publication_date": 20190904
    },
    {
      "title": "Panel ok charger junk",
      "text": "Charge controller quite working.gree light on but doesn't have power to the battery. Can't use the door opener.",
      "rating": 2.0,
      "verified": true,
      "author": "Gregory j logsdon",
      "helpful_votes": 0,
      "publication_date": 20190811
    },
    {
      "title": "Easy, great power output, robust.",
      "text": "I love this solar panel as it keeps my 12v battery charged all throughout the day. The included solar controller is essential. Very easy to install.",
      "rating": 5.0,
      "verified": true,
      "author": "Couch Mango",
      "helpful_votes": 0,
      "publication_date": 20191110
    },
    {
      "title": "Very pleased with this panel",
      "text": "Very pleased with this panel. I am using it to help charge a battery for an electric fence. So far everything is working well. My only problem was trying to mount it. I have attached some pictures which I hope are helpful. Basically I purchased 4 utility poles at tractor supply. Then I purchased these brackets that mounted on the poles at an angle. Then lastly some 1/4inch bolts, washers, and nuts to attached the brackets to the panel. Total for the poles, brackets, and hardware was about $14.",
      "rating": 5.0,
      "verified": true,
      "author": "TNPHINFAN",
      "helpful_votes": 6,
      "publication_date": 20161220
    },
    {
      "title": "Quit working in 2 weeks!",
      "text": "My panel / controller quit working after a couple weeks. The Green light o. The controller blinks but it won't charge any battery!!! Really disappointed and no way to contact the seller!!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Kevin",
      "helpful_votes": 5,
      "publication_date": 20170716
    },
    {
      "title": "The wires are easily disconnected. Recommend taping them as they will pull ...",
      "text": "Appears to be working as described. The wires are easily disconnected. Recommend taping them as they will pull free with little force.",
      "rating": 4.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 2,
      "publication_date": 20161122
    },
    {
      "title": "25 W for $50!",
      "text": "I have tested it to 21 Watts and I am confident it will reach its max potential at 25 W.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20200413
    },
    {
      "title": "No easy way to mount",
      "text": "This is not an easy thing for someone to install in a DIY as there is no place to put a mounting bracket.",
      "rating": 3.0,
      "verified": true,
      "author": "Karina L. De Jesus",
      "helpful_votes": 0,
      "publication_date": 20181109
    },
    {
      "title": "Decent.",
      "text": "Panel works great the controller not so much. Need to find a better controller now.",
      "rating": 2.0,
      "verified": true,
      "author": "Miguel B.",
      "helpful_votes": 0,
      "publication_date": 20190217
    },
    {
      "title": "Controller does not work.",
      "text": "Controller did not work out of the box. Panel output normal. Controller did not convert to 12 volts. Third try was a charm, worked. Now happy.",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20180523
    },
    {
      "title": "Great for RVs",
      "text": "Works great to trickle charge my RV batteries while in storage.",
      "rating": 5.0,
      "verified": true,
      "author": "April Fraley",
      "helpful_votes": 2,
      "publication_date": 20180723
    },
    {
      "title": "LOW COST AND WORKS",
      "text": "I have had this in the snow, wind and rain for two years, still works great no issues.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190218
    },
    {
      "title": "Works as advertised",
      "text": "I bought this to charge my boat and RV batteries, so far so good. The charge controller seems small and flimsy but has worked just fine to this point",
      "rating": 4.0,
      "verified": true,
      "author": "frank mcdaniel",
      "helpful_votes": 0,
      "publication_date": 20190619
    },
    {
      "title": "Well-made solar panel",
      "text": "Excellent solar panel at a very good price. The package originally arrived without the controller, but the vendor was very responsive in sending one out after I contacted them with the problem. I'm using this to keep my boat battery charge topped off, since a lead-acid battery's worst enemy is sitting unused. The Panel works great for that purpose.",
      "rating": 5.0,
      "verified": true,
      "author": "AndySki",
      "helpful_votes": 9,
      "publication_date": 20160315
    },
    {
      "title": "great tool for charging battery",
      "text": "work well, charges 12v cycle battery fully on sunny day, then can run solar light for 18 hrs. from it",
      "rating": 5.0,
      "verified": true,
      "author": "Geraldine Bennett",
      "helpful_votes": 0,
      "publication_date": 20180905
    },
    {
      "title": "Controller",
      "text": "Controller doesn't seem to be doing anything and I see no one to contact about, guess it will have to go back?",
      "rating": 1.0,
      "verified": true,
      "author": "Jer",
      "helpful_votes": 0,
      "publication_date": 20180718
    },
    {
      "title": "Best bang for your buck!",
      "text": "Shipped quickly, easy set up! It generates the power I need for my off grid cabin!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190706
    },
    {
      "title": "Great solar panel",
      "text": "Works at keeping the battery charged for our chicken coop",
      "rating": 5.0,
      "verified": true,
      "author": "Charles",
      "helpful_votes": 0,
      "publication_date": 20190303
    },
    {
      "title": "Poor Product/Poor Customer Service",
      "text": "Didn’t work right out of the box. Messaged the company and they had me doing multiple test and sending them pictures to prove it didn’t work. After all the run around, the company did nothing to stand behind their product. Poor product/Poor customer service!",
      "rating": 1.0,
      "verified": true,
      "author": "Lea Quam",
      "helpful_votes": 0,
      "publication_date": 20191126
    },
    {
      "title": "good little solar cell",
      "text": "I have it charging my camper batteries, and it is working flawlessly.",
      "rating": 5.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20181020
    },
    {
      "title": "Five Stars",
      "text": "Is working well on my electric fencer - it charges a large Interstate deep cycle battery.",
      "rating": 5.0,
      "verified": true,
      "author": "Skip",
      "helpful_votes": 0,
      "publication_date": 20180620
    },
    {
      "title": "Works as designed",
      "text": "I replaced the prewired wires to heavier wire (less current loss) and wired to my boat trolling motor to recharge it through the day. Seems to work great. I will probably buy another one for other applications",
      "rating": 5.0,
      "verified": true,
      "author": "Dana Garard",
      "helpful_votes": 0,
      "publication_date": 20180629
    },
    {
      "title": "Great value and product, and keep my pontoon batteries topped off.",
      "text": "Great value and product, and keep my pontoon batteries topped off.",
      "rating": 5.0,
      "verified": true,
      "author": "mfriend93",
      "helpful_votes": 0,
      "publication_date": 20180904
    },
    {
      "title": "works for solar barn lights",
      "text": "I used this with two 5W LED bulbs and a battery for a solar-powered automatic night light in my barn.",
      "rating": 5.0,
      "verified": true,
      "author": "Seneca reader",
      "helpful_votes": 0,
      "publication_date": 20180223
    },
    {
      "title": "A bit over priced for the over all quality!",
      "text": "Almost 2 months of usage: The panel works well with no observed problems but the charge controller is clearly defective. The battery clips are relatively useful, however I believe the product may have been a bit over priced for the quality. I would suggest to purchase the panel by itself and along with it a good charge controller.",
      "rating": 3.0,
      "verified": true,
      "author": "Paul Grant",
      "helpful_votes": 0,
      "publication_date": 20180730
    },
    {
      "title": "Happy",
      "text": "Great for trailer not parked near electric but needs to be charged",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180812
    }
  ],
  "product_meta": {
    "title": "ECO-Worthy [Upgraded] 25 Watts 12V Off Grid Solar Panel SAE Connector Kit: Waterproof 25W Solar Panel + SAE Connection Cable +USB Controller for Light",
    "rating": 4.3,
    "feature_bullets": [
      "[Plug & Play] SAE connectors cable is easy to install and virtual free maintenance",
      "[Widely Used] Ideal solar power kit for variety of off grid applications including chicken coop, gate opener, water pump, shed, cabin etc where 12V deep cycle battery is used as well as charge and maintain Cars, RVs, Boats, Trailer battery",
      "[Durable Panel] Waterproof 25 Watt solar panel with 9.84ft SAE connector cable, SAE connectors easy to connect and disconnect with controller, plug and play",
      "[Full Protections] USB charge controller prevents battery from over charge, dischage and short circuit, reversed polarity protection. Two indicators for checking status of charging and discharging",
      "[Free Maintenance] 1 year warranty and 24/ 7 technical support team, call ECO-WORTHY hotline whatever any question or concern you have"
    ],
    "specifications": {
      "Package Dimensions": "17.1 x 13.8 x 0.9 inches",
      "Item Weight": "4.39 pounds",
      "Manufacturer": "ECO-WORTHY",
      "ASIN": "B00PFGP0EA",
      "Item model number": "AM-P20X-CB-1",
      "Customer Reviews": "4.3 out of 5 stars381 ratings4.3 out of 5 stars",
      "Best Sellers Rank": "#8,895 in Patio, Lawn & Garden",
      "Is Discontinued By Manufacturer": "No"
    },
    "categories": [
      "Solar Panels",
      "Solar & Wind Power",
      "Patio, Lawn & Garden",
      "Generators & Portable Power",
      "Electronics"
    ],
    "price": 53.99
  }
}