{
  "website_summaries": [
    {
      "verdict": "This is one of the smallest and easiest magnetic phone holders out there. Snaps easily into the car’s vent with one hand. Universal design holds almost any mobile device or GPS unit.",
      "pros": [
        "Easy, basic design allows portrait or landscape usage",
        "360-degree rotation",
        "Strong magnetic pull holds phone in place even over bumps",
        "Great customer service"
      ],
      "cons": [
        "Some models may not clip firmly to vent pieces and may slide back and forth",
        "Magnet on back of phone may interfere with the phone’s GPS and mapping capabilities"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Works well with Galaxy S8, not quite as well with Note 8.",
      "text": "I have two phones - a Galaxy S8 used for work and a Note 8 for personal use. This mount holds the smaller and lighter S8 well, but the Note does not feel as secure and I am afraid of it falling off (though it hasn't yet). This might be because of the slightly thicker case and I will be trying a different case to see if that helps. I do love the low profile and it attaches very securely to the air vent; it's just the connection between magnet and metal plate that is weaker than I'd prefer.",
      "rating": 4.0,
      "verified": true,
      "author": "Deb Shinder",
      "helpful_votes": 3,
      "publication_date": 20180613
    },
    {
      "title": "Gumbo potholes",
      "text": "I was skeptical of the ability to support my iphone8 in my truck . Thinking it was going back i placed the metal tab inside the phone case using scotch tape instead of adhesive. After driving through the Garden District of New Orleans i am convinced . Conviced that if it can handle the absurd potholes of New Orleans in a P/Up truck Damn I'm impressed . would recommend to any looking for a use of the strange horizontal slot in the middle of their dashboard.",
      "rating": 5.0,
      "verified": true,
      "author": "edxs",
      "helpful_votes": 3,
      "publication_date": 20171210
    },
    {
      "title": "Holds iPhone with Magic Magnets!",
      "text": "I like the ability for my phone to sit there like magic thanks to the magnet plate on the back of my case. This indeed fit in my car's cd slot. It holds an iPhone 6 up - no problem! The swivel arm allows me to move the phone to match my field of view - helpful for GPS navigation. However, it is easy to knock the phone off. Sometimes I hit the charging cable and it comes off. Not the problem of the item itself but the function could be better. It is personal preference whether you get this or the iOttie Mount with clamps that fits in the CD slot as well.",
      "rating": 5.0,
      "verified": true,
      "author": "BenK",
      "helpful_votes": 4,
      "publication_date": 20180115
    },
    {
      "title": "This is the best car mount I have ever had",
      "text": "This is the best car mount I have ever had, held my Samsung S8 and now my Note 8 with no issues. The phone stays where I place it, no leaning, sliding, or falling off. I suggest putting the metal plate in the case first and trying a few places before sticking it permanently. I found that I needed the metal plate a little lower to use the NFC features of my phone. I will recommend this to anyone looking for a good dash mount that is stable and not a real big eyesore. Only thing I would do it add the new wireless charging to this, will need to by the new models out that support wireless charging now.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric",
      "helpful_votes": 0,
      "publication_date": 20180216
    },
    {
      "title": "After only a month or so of use, the ...",
      "text": "After only a month or so of use, the tension on the vent mechanism loosened to the point that every time you grab your phone to remove from the mount, the mount came with it. I tried re positioning in several other places on multiple vents and same issue. I stopped using this and am looking for another solution. UPDATE: After seeing the review I gave to this item, iOttie reached out to me and sent me a new vent mount. This one seems to be working better than the first one for sure. Hopefully it will stay firmly mounted to my vent!",
      "rating": 4.0,
      "verified": true,
      "author": "quattro2",
      "helpful_votes": 2,
      "publication_date": 20170626
    },
    {
      "title": "Great Mount",
      "text": "I use it for iPhone and GPS. iPhone is heavy as it has battery case, but this mount holds it securely to the dash. I like that I can rest the base of the device on the dash while the back is up against the mount. Device is therefore more stable--does not shake or vibrate due to road conditions. Mount is small -- not bulky or prominent like ither types of mounts--for a much cleaner looking result.",
      "rating": 5.0,
      "verified": true,
      "author": "SD00001",
      "helpful_votes": 3,
      "publication_date": 20170328
    },
    {
      "title": "Disappointed [fixed]",
      "text": "With such good reviews I thought this was going to be as good as my previous iottie mounts (One I had 3 years without incident) but right out the box the mount doesn't stick to my dash. I guess I was sent an old product whos adhesive dried out. Update: the company sent me a CD mount free of charge to fix the situation. Works perfectly. So just 1 star reduction for the inconvenience of the original order not working at all.",
      "rating": 4.0,
      "verified": true,
      "author": "Mari3",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Unable to stick on patterned dash, use window",
      "text": "Would not stick to my Prius dash even after a through wipe down. Got it working by using the small window between windshield and driver side door window. Also stuck the circular metal plate on a popsocket. Works well and it is pretty stable. I use it only in landscape and rests on the dash. Popsocket is at the top of the iPhone X next to the camera. I have it there mainly to hang it on my wireless Qi charger at home but works well for the iottie's limitation too.",
      "rating": 4.0,
      "verified": true,
      "author": "James Valero",
      "helpful_votes": 2,
      "publication_date": 20181017
    },
    {
      "title": "Crap",
      "text": "Does not work good with cases at all!!! It fits in the cd player pretty well but the magnet and the adhesive are garbage!!! It always drops while I'm driving!! I tried giving it a chance to see if I could deal with it but I wish I just returned it right away because not I am stuck with it and it was a waste of money it does not work for me at all.. they should give you like a 60 trial or something for this product so you have more time to get your money back. I would not recommend this product to anyone especially if you have a case.",
      "rating": 2.0,
      "verified": true,
      "author": "michael",
      "helpful_votes": 0,
      "publication_date": 20190906
    },
    {
      "title": "My Favorite Phone Holder",
      "text": "This is my favorite phone holder! It has two big advantages: 1)The phone is easier to remove and attach than it is on any other holder I know of. 2)Another big advantage is that, because you're looking at against the background of your dash rather than the background of sun shining through your windshield, the screen is easier to read when using Waze, etc. Worked flawlessly for me for a full year, until I switched to a phone that has a curved back, which means that the metal outside plate cannot sit flat against the case and therefore won't hold. Too bad! Unless your phone has the same design, this is a great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Reviewer in NY",
      "helpful_votes": 0,
      "publication_date": 20160408
    },
    {
      "title": "Otter box defender iPhone 6s",
      "text": "Have an otter box defender on my iPhone 6s and was unsure if it would be strong enough to hold the weight of it. I put the magnet on the plastic case under the rubber and it has a strong enough hold. I’ve had it for over 3 months and it doesn’t fall off. Definitely recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Casey B.",
      "helpful_votes": 0,
      "publication_date": 20181110
    },
    {
      "title": "The worst is when I am using the navigator and make ...",
      "text": "I have been using iOttie iTap for the last 10 months. I place it in the vent of my car. I have an Incipio phone case on my cell phones to protect it from breaking. The iOttie cannot hold the phone. The worst is when I am using the navigator and make a turn and the phone flies off. I have used my phones with the Incipio cases on the InfiniApps holder and never had a problem. Sorry, but I am not happy with this product and do not recommend it to anyone.",
      "rating": 1.0,
      "verified": true,
      "author": "Haya",
      "helpful_votes": 6,
      "publication_date": 20160422
    },
    {
      "title": "Nice!",
      "text": "I really like this product and using the CD slot is the way to go since the slot is the highest point on my dash. You need to consider if your phone is going to block important dials and views of your installed radio, GPS, etc. I need the little wedge that came with it to hold it better in the slot. Worked great. by the directions are small and it is a little tricky to figure out how to put it in. Worth the price!",
      "rating": 5.0,
      "verified": true,
      "author": "Al E.",
      "helpful_votes": 0,
      "publication_date": 20190725
    },
    {
      "title": "Convenient way to mount phone temporarily without obstructing window.",
      "text": "Bought this to mount my iphone on my car vent without permanently affixing something to the dashboard of window. It works great most of the time but sometimes, the phone falls off its magnetic mount if I hit a bump which means I need to scramble to pick it up while driving if I'm using my phone for its gps. If the phone didn't occasionally fall off its mount, I would have given it 5 stars.",
      "rating": 4.0,
      "verified": true,
      "author": "emptynester",
      "helpful_votes": 0,
      "publication_date": 20180214
    },
    {
      "title": "the contact point is flat (compared to a slight curve with other mounts) which allows more contact and a better grip. The magnet",
      "text": "I tried other magnetic car mounts but the magnetic contact felt week. My phone would slide or fall off after bumps in the road. With this mount the magnet is strong. the contact point is flat (compared to a slight curve with other mounts) which allows more contact and a better grip. The magnet is also rubberized to provided even better grip. My phone has yet to fall off with this mount. The area that mounts to the vent is different from other mounts as well. Instead of pushing the mount into the vent, you clip it on. Makes it more versatile for different type of vents. Best magnetic mount I've tried.",
      "rating": 5.0,
      "verified": true,
      "author": "freshkicks",
      "helpful_votes": 0,
      "publication_date": 20160427
    },
    {
      "title": "Good product; great service",
      "text": "Product works exactly as advertised. Customer service was outstanding. An adhesive on the phone mount was defective and they immediately shipped a replacement mount when I called. Replacement works fine. I also requested a second phone mount to attached to the back of my iPod and they shipped that right along with the replacement item. Could not be happier with product or customer service.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr Micawber",
      "helpful_votes": 3,
      "publication_date": 20170212
    },
    {
      "title": "Magnetic vent holder for phones",
      "text": "I wanted to like this magnetic vent holder for my iPhone, but between the 6s Plus and now the XR, its just not durable enough for the weight of the phones. The magnet part worked great, but the clip holding to the vent just couldn’t handle the weight and the phone would sag or the unit would fall out of the vent. It just wasn’t good for my phones.",
      "rating": 4.0,
      "verified": true,
      "author": "Linda Lou",
      "helpful_votes": 0,
      "publication_date": 20190125
    },
    {
      "title": "I have tried Gorrilla Glue (that didn't stay) and then Super Glue (that lasted even less then the Gorilla Glue)",
      "text": "I have tried two different versions of this product. Both times the round metal piece would NOT remain stuck to the phone. In addition to the adhesive that it comes with, I have tried Gorrilla Glue (that didn't stay) and then Super Glue (that lasted even less then the Gorilla Glue). I feel that while the magnet part is sturdy and powerful, there is just too much pressure put on the metal piece. I feel there is no real way to have it remain attached to the the phone/case. As much as I like the ease of use on this project, I will not be purchasing this item again.",
      "rating": 2.0,
      "verified": true,
      "author": "Veronica Swarens",
      "helpful_votes": 0,
      "publication_date": 20170718
    },
    {
      "title": "Simply does not work.",
      "text": "Does not hold the weight of my phone. The magnet appears to be strong enough, but the metal strip that adheres to the phone is very weak. I have an iPhone XR and a standard case (not at all a heavy or bulky case) and it could not hold the phone. The slightest bump and my phone falls off. I tried it without the case and it still would not hold the weight of my phone. The metal strip needs to be much more substantial to accomplish what they promise in the advertisement.",
      "rating": 1.0,
      "verified": true,
      "author": "Jesse",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "Strong magnetic mount to phone",
      "text": "Fits into CD player, note it depends on the location of the CD player as to what the phone will block while mounted. Worked great on my newer Silverado 2500HD, not so great on my daughters Lexus NX200T. The mount works great with phones not in a case.",
      "rating": 4.0,
      "verified": true,
      "author": "Shane T.",
      "helpful_votes": 0,
      "publication_date": 20200407
    },
    {
      "title": "Magnet not strong enough to hold.",
      "text": "Even with the 2 magnets and the claim it will hold your phone cover with your phone, nonsense. When I hit bumps, railroad tracks or cracks on the streets my phone goes flying OFFF.. and lands way on the other side of the passenger floor board I have to pull over to grab it and start again. My husband also used his phone without his cell cover & it flew off the ac vent as well.",
      "rating": 1.0,
      "verified": true,
      "author": "Angie G Miranda",
      "helpful_votes": 0,
      "publication_date": 20191120
    },
    {
      "title": "Magnet not strong enough if your phone is in a case.",
      "text": "I bought this several months ago, but wound up not needing it until now. Put it in my vent, attached my phone and headed out to run errands. Second turn I made my phone went flying off. The magnet is not strong enough to hold a phone through a phone case. 😔",
      "rating": 1.0,
      "verified": true,
      "author": "Phyllis M-Racz",
      "helpful_votes": 0,
      "publication_date": 20200903
    },
    {
      "title": "Does not work...",
      "text": "This product was great for the first day or two. My first issue was the phone (iPhone x) sliding off when I would make sharp turns (Side note: I drive a large SUV so I do not make sharp turns at high speeds). After a couple of weeks, the vent part became \"stretched\" for lack of a better description. the vent portion would not stay on the vent. as soon as I attempted to put my phone on the vent magnet, the entire thing would fall out of the vent.... Great concept-AWFUL design/engineering..... I am returning...",
      "rating": 1.0,
      "verified": true,
      "author": "KCWhit",
      "helpful_votes": 0,
      "publication_date": 20190811
    },
    {
      "title": "Total RIP off",
      "text": "Recived the product today as I placing the Itap towards to my car vent, spring on the Itap loose popping side ways, pretty disappointed, dropping new Note 9,not cool at all, poor quality control , also metal plate seems thicker, wish thry had thinner metal plates,notified even manufacture just ignore customer response, very disappointing.",
      "rating": 1.0,
      "verified": true,
      "author": "JJ",
      "helpful_votes": 0,
      "publication_date": 20180902
    },
    {
      "title": "Case w/ Liner Warning...",
      "text": "First Impressions: Please be careful when using this product with a case & liner. I have the Incipio case and it seems to put too much distance between the plate and magnetic mount. I can shake the phone off the mount easily. So imagine if I used it in the car as it is designed. I found a much better connection of the magnet directly on the plate (of course). My suggestion, if you use a case, is to use this product with a case that does not require a case liner. (My Case:  I'll update when I get it in my car.",
      "rating": 3.0,
      "verified": true,
      "author": "Jeanene C",
      "helpful_votes": 0,
      "publication_date": 20150418
    },
    {
      "title": "It's the best!",
      "text": "Very effective, easy to install, after one month of use, it hasn't budged! Perfect for slick (glass) AND patterned surfaces. Very powerful magnet, yet the metal inside the phone cover is so thin you don't know it's even there!",
      "rating": 5.0,
      "verified": true,
      "author": "Mainer",
      "helpful_votes": 0,
      "publication_date": 20191026
    },
    {
      "title": "Worked great for a year then broke",
      "text": "It was not easy finding a reliable phone holder made of quality that would work in my car, a small Audi. Because things are so tight in these cars and i did not want dashboard mounted, placement was not easy. However this product worked well, till the ball bearing holding the magnet that attaches to the phone wore out and now the weight of the phone causes the phone to droop, I cant see the phone for maps and directions, and it falls of constantly. Would have given a better review if it lasted longer. I have not requested a replacement from the company.",
      "rating": 3.0,
      "verified": true,
      "author": "Tara M.",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "Otherwise this thing is great. Strong magnet holds the phone really well",
      "text": "Could be sturdier and I really wish they would have included some extra adhesives for the metal plate. People often change their phones once a year or faster, put some more double-sided tape in there so we can swap phones. Otherwise this thing is great. Strong magnet holds the phone really well, even through a case. Using it with the iPhone 7 and real leather case from Apple.",
      "rating": 5.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 0,
      "publication_date": 20170120
    },
    {
      "title": "Really works",
      "text": "This product really works, was concerned about the magnetic piece for the phone but it fits perfect, even in the belt clip. Once the cd clip was attached it is very strong and holds the phone at easy to read angle. Great item.",
      "rating": 5.0,
      "verified": true,
      "author": "Izza",
      "helpful_votes": 0,
      "publication_date": 20190823
    },
    {
      "title": "Work ok with a phone case",
      "text": "These mounts work ok with a Spiegen case. We put the metal plate between the phone and case, the mount holds. The problem is that the phone will start tilting or sliding down while mounted in the car. I would guess that without a case, the mount would hold a lot better.",
      "rating": 3.0,
      "verified": true,
      "author": "Robert",
      "helpful_votes": 0,
      "publication_date": 20190104
    },
    {
      "title": "Steady grip",
      "text": "I have purchased many different mount holder for my cellphone before, but was never satisfied with anyone of them until I found this one. This one will clip on the air vent blade which it made the mount more steady while driving around.",
      "rating": 5.0,
      "verified": true,
      "author": "Mll1021",
      "helpful_votes": 0,
      "publication_date": 20190801
    },
    {
      "title": "Just what I needed",
      "text": "Exactly what I was looking for. I've used iOttie dashboard mounts for years, but I had trouble finding one that worked for my new car and phone. This one is perfect; it's very low-profile, so it doesn't block my view, and the magnet means I don't have to worry about the size of my phone (a OnePlus 3T). Oh, and I use Google Nav pretty much all the time. Despite what some reviewers have said, the magnet hasn't interfered with it at all.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170127
    },
    {
      "title": "Works OK for flat back phones, Quality Control could be better",
      "text": "Worked great initially on my Xperia Z3 and wife's iPhone with a case, but due to the design of my new Nexus 6 and its curved back, I can't use it any more. The weight of the Nexus 6 and a case is also too much for the magnet to hold. I wish there was some sort of option since the metal plates won't fully adhere to my phone. The clamps on the vent mount have weakened and don't hold well anymore. I contacted customer service and they came through with a replacement. Their customer service is the best in the business and I will continue to shop with them in the future.",
      "rating": 5.0,
      "verified": true,
      "author": "Nate Kiner",
      "helpful_votes": 0,
      "publication_date": 20150623
    },
    {
      "title": "This is a great product. It holds the phone very securely",
      "text": "This is a great product. It holds the phone very securely. In my car the air vent is in the perfect location to be able to glance at my phone for Waze, Google Maps, etc. The phone comes off the mount very easily when you want to take it down. There seems to be no risk of damage to your car as with some sticky or suction-based mounts. It is very compact so it would be easy to travel with if you are so inclined. The ergonomics are excellent and the construction is solid. I strongly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Barkley's Owner",
      "helpful_votes": 0,
      "publication_date": 20150807
    },
    {
      "title": "Works well for S4 mini, with my particular case",
      "text": "I have a Samsung Galaxy S4 mini, and I was initially very disappointed when this arrived, because I hadn't read all the reviews, and thought I might have to install magnet on the phone case (I have a Puregear case). However, one of the magnets is strong enough that I put it on the inside of the phone case, so it's between the phone and the case, that alone is strong enough so I can attach it to the iottie with no problem. Therefore, the magnet isn't visible, but I know it's there and I can use it with the iottie. So it works well for me, with the case I have.",
      "rating": 4.0,
      "verified": true,
      "author": "Deacon 85",
      "helpful_votes": 0,
      "publication_date": 20150813
    },
    {
      "title": "Works well for me!",
      "text": "I use the iOttie iTap Magnetic CD Slot Holder in my 2012 Toyota Camry. Keeps my iPhone 6 within reach without blocking the view and is close enough to the USB port so that it can be charged while mounted. Really well designed. Installation was easy.",
      "rating": 5.0,
      "verified": true,
      "author": "JMH POV",
      "helpful_votes": 4,
      "publication_date": 20170108
    },
    {
      "title": "Works amazingly well",
      "text": "I have horizontal vent baffles and did a lot of reading on phones mounts similar to this one. I've had this for almost a week and I love it. I don't have a good place to have my phone in my car and this product solved that! It doesn't the cool air that much and it keeps my battery cool while charging WIN WIN I simply taped the rectangular metal piece inside case and it stays put. I have a Samsung S4 with an extended (large) battery. The phone doesn't move and has not fallen off. Also, the vent mount not come off when removing the phone. I highly recommend this product",
      "rating": 5.0,
      "verified": true,
      "author": "Mary",
      "helpful_votes": 0,
      "publication_date": 20150801
    },
    {
      "title": "Definitely Yes!",
      "text": "iottie! This works very good, never had a problem. I'm a Taxi driver and I use this for driving a Cab and my personal car. I strongly recommend this especially during summer in daytime which cools your phone from the airconditier, instead of the sun shining directly on your phone.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200606
    },
    {
      "title": "Meah.",
      "text": "This holder has strong magets that holds your phone securley to the holder but the arms that goes into the vent are not long enough. It causes the phone and holder to sometimes fall out. Especially if you have a large phone like a note or xs max. Or if you are driving on some bumpy dirt roads.",
      "rating": 2.0,
      "verified": true,
      "author": "💯Review Foo",
      "helpful_votes": 0,
      "publication_date": 20190403
    },
    {
      "title": "Magnetic connection is weak. Phone will fall off!",
      "text": "I purchased this product about 2 months ago but started using it a month ago. I have an iPhone XS Max and worked fine the first week. After that my phone kept sliding off and on the floor. As of now the magnet will only hold my phone for 2 minutes before it falls off. Beware and be careful if your purchase this product.",
      "rating": 1.0,
      "verified": true,
      "author": "Ella Smith",
      "helpful_votes": 0,
      "publication_date": 20190807
    },
    {
      "title": "Adhesive is weak, product is good otherwise.",
      "text": "Magnet works great. Only problem is the metal plate adhesive part does not stick to the phone, plate stays on the magnet. Phone fell off several times. I did place the clear plastic and cleaned before attaching the smaller recommended metal plate to the phone. And I did not use a case on the phone. Ended up using a metal plate from a different magnet mount and it works great with this iottie magnet. The vent mount with magnet part itself is awesome. Only reason for 1 star is the adhesive did not hold my iPhone 6 plus. And my phone fell and got dented.",
      "rating": 1.0,
      "verified": true,
      "author": ":/",
      "helpful_votes": 3,
      "publication_date": 20150608
    },
    {
      "title": "First impressions. It stuck to the textured dashboard of an Audi Q5 and held the phone well during its initial ride. We shall se",
      "text": "First impressions. It stuck to the textured dashboard of an Audi Q5 and held an iPhone 7 with the Apple battery case (heavy) well during the initial ride (at night). We shall see how it performs in the days, weeks, months ahead, and on a hot South Florida days.",
      "rating": 5.0,
      "verified": true,
      "author": "FLmiami",
      "helpful_votes": 0,
      "publication_date": 20170907
    },
    {
      "title": "Good, but relying on AC grills for stability makes it not great",
      "text": "I've used mine for months in 3-4 different cars. I think expect about a year of useful life before the jaws no longer hold.It works OK on my Prius. It clamps at nearly steering wheel hand level, and stays there. My IPhone 6+ flops slightly, and I would like a little more resistance. AC grills don't stay put, and its already tough hitting the GPS Icon with road vibration. I like how small it is and that it will fit most cars, so it is a 5 star for travel.",
      "rating": 4.0,
      "verified": true,
      "author": "OZ",
      "helpful_votes": 0,
      "publication_date": 20150528
    },
    {
      "title": "Not a viable solution for mounting my S6 Edge in the car.",
      "text": "Seems pretty well made, but the flaws outweigh the benefits of this mount. I have a Samsung Galaxy S6 Edge with Samsung wallet/folding case. 1. Magnet is not strong enough to hold the phone securely (while in its case). 2. Had to place the metal plate toward the bottom of the phone (between phone and case) to prevent plate from blocking wireless charging. 3. Weight of phone+case pulls down the vent louvers (I may try to rig something to overcome this issue, as the problem is not with the mount).",
      "rating": 3.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20150501
    },
    {
      "title": "Fantastic magnetic phone mount!",
      "text": "Received two days late but better late than never. I am very happy with my purchase. Fits perfectly in CD slot and holds tight to phone. Free's up dash space as well as allows a clear view through windshield! Love it so far!",
      "rating": 5.0,
      "verified": true,
      "author": "R.L.",
      "helpful_votes": 0,
      "publication_date": 20181105
    },
    {
      "title": "Very pleased with product performance and looks",
      "text": "Very nice product. This was my first time purchasing and using a product like this. I like the way it clips on to the a/c vent rather than inserting inside and spreading apart like some versions do. The magnet is strong, and holds my IPhone just fine. I liked it so much I bought two of them so that I can use it in both of our cars",
      "rating": 5.0,
      "verified": true,
      "author": "Proud Parents",
      "helpful_votes": 0,
      "publication_date": 20170701
    },
    {
      "title": "Awesome Product.",
      "text": "Excellent product! I have used this in an Audi A4/S4, Ford Edge and Hyundai Sonata. The magnetic vent mount holds my iPhone 5s regardless of road conditions. Keep in mind the position of the phone/magnetic holder will be affected by the position of the car's vents. With the Hyundai, the vertical vents kept moving the phone left or right. And the position of the vents will also affect your view of the phone. The included film and metal discs make the setup incredibly easy. I highly recommend this product. * A big thank you to Brittany B. from their customer service for sending me an additional exterior plate.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard M.",
      "helpful_votes": 0,
      "publication_date": 20150811
    },
    {
      "title": "Works good for the first week",
      "text": "Weak magnet when in phone case, outside sticky magnet works too good and prefers to come off with the magnet and won’t stay on the phone, I don’t recommend the clip for air vents, phone weighs it down Angelina bent toward the ground unable to see screen",
      "rating": 2.0,
      "verified": true,
      "author": "Lindsey",
      "helpful_votes": 0,
      "publication_date": 20190825
    },
    {
      "title": "USED item which was actually UN-USABLE!",
      "text": "This item suggested Item will come in original packaging. Packaging will be damaged\" however package was perfect but the item had been used and both magnets (2 sizes to use) were both stacked on top of each other and was not able to pull apart. Inspector of return did not do their part, item was returned.",
      "rating": 1.0,
      "verified": true,
      "author": "Tesa Picart",
      "helpful_votes": 0,
      "publication_date": 20180624
    },
    {
      "title": "Without the case (added weight as well) it hold great. I am sure if I had a lighter ...",
      "text": "I use with a bamboo case and the magnet is strong enough to hold the phone well enough. Wish it was a touch stronger as when in the horizontal position it turns on it own. Without the case (added weight as well) it hold great. I am sure if I had a lighter case it would hold better as well.",
      "rating": 4.0,
      "verified": true,
      "author": "Robert Page",
      "helpful_votes": 2,
      "publication_date": 20160617
    },
    {
      "title": "Need more magnet strength - get Magneto!",
      "text": "It doesn’t work with my phone. Not enough magnetic strength. plus it Block one of the four front a/c vents. When you live in the high desert you need all four!! May I receive a refund, please. If you send me a slip I can send back the product in it’s box.",
      "rating": 1.0,
      "verified": true,
      "author": "Squito",
      "helpful_votes": 0,
      "publication_date": 20180914
    },
    {
      "title": "Nice way to mount phone with out a bunch of ...",
      "text": "Nice way to mount phone with out a bunch of hardware in your car. Very unobtrusive. I have used this with Samsung S4 Mini and my new Honor 5x. The magnet interfered with the screen on the Samsung and had to be reset to lower on the body. On the larger Honor I set it lower so the phone would be free of some controls in the car. In both cases the magnet is strong enough to hold it nice and snug. On hot days the pincers lose their grip just a little, but still very manageable.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael J Murray",
      "helpful_votes": 0,
      "publication_date": 20160629
    },
    {
      "title": "Sorry, there are better...",
      "text": "I purchased the iOttie because a friend spoke so highly of them. Sorry, but this mount shakes and moves compared to the Koomus Pro CD mount. I can't recommend this one for my Lexus ES300 since it moves so much.",
      "rating": 2.0,
      "verified": true,
      "author": "Da Bunkster",
      "helpful_votes": 0,
      "publication_date": 20181028
    },
    {
      "title": "Reliable, portable and convenient!",
      "text": "This is a great way to mount your smartphone. I like how it's portable, can take it with you if you travel and have a rental car. Comes with two types of plates. I did notice that the magnet is very strong and trying to remove the phone sometimes it pulls the base out of the vent, but once I got a thicker case to weaken the magnet strength it comes off much easily. So if that's an issue just pad the magnet a little so the contact is not as strong.",
      "rating": 5.0,
      "verified": true,
      "author": "DRK_TECH",
      "helpful_votes": 0,
      "publication_date": 20150625
    },
    {
      "title": "Strong magnet. Great product.",
      "text": "This is the first phone holder that actually worked. Strong magnet. Can use phone vertically or horizontally without the phone flopping around.",
      "rating": 5.0,
      "verified": true,
      "author": "Leslie C.",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "Perfect!",
      "text": "LOVE THIS CAR MOUNT! As an Uber driver I have tried a lot of mounts for my phone to be able to glance at navigation. This one hands down is the best. It grips good to the vent so it does not pull off with the phone. The magnet is strong enough to hold my Iphone 6, my phone has never fallen or even moved. Unlike other magnetic vent mounts you can swivel this one to be angled if you would like. I actually purchased a few of these as Christmas gifts.",
      "rating": 5.0,
      "verified": true,
      "author": "Meredyth Carlisle",
      "helpful_votes": 0,
      "publication_date": 20151228
    },
    {
      "title": "Unit could damage CD slot shorting radio, etc.",
      "text": "I was told by Ford technicians that this unit evidently damaged the CD slot, causing the CD player to short out the central junction box in the vehicle. (Ford Five Hundred) The fix was a rebuilt radio unit and a new main junction box to the tune of $1926.00! My best advice is to stay away from any device that uses the CD slot to hold anything. Better to break a vent unit than the cars brain.",
      "rating": 1.0,
      "verified": true,
      "author": "Marc B.",
      "helpful_votes": 0,
      "publication_date": 20171129
    },
    {
      "title": "Perfect. Takes seconds to install and seconds to use.",
      "text": "It leaves a little magnetic surface that you can just set your phone on when you get in your car. Mounts securely and doesn't move around, and the magnets hold your phone securely in place. Takes minimal effort to pick your phone up right off of the mount. I am very pleased with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Kinabrew",
      "helpful_votes": 0,
      "publication_date": 20180302
    },
    {
      "title": "Well designed and works great.  Highly recommend.",
      "text": "iOttie has designed another great product. We now own 3 of these. One for each of the family cars, plus 3 magnetic cases for each family member. They work great and make driving much safer.",
      "rating": 5.0,
      "verified": true,
      "author": "MP from NY",
      "helpful_votes": 2,
      "publication_date": 20170602
    },
    {
      "title": "Best magnetic vent mount",
      "text": "I have this mount. I previously tried using the cheaper ones that sells for a third of this and my advice is don't waste your time or money with come off cheaper units. The problem with the cheaper units that attach to the vent is that they do not grip he vent and have a tendency to come off usually at the worse time. The iTap is more expensive but really grips the vent and in the end it is well worth the difference in price. This is a quality product",
      "rating": 5.0,
      "verified": true,
      "author": "Bob N.",
      "helpful_votes": 0,
      "publication_date": 20150401
    },
    {
      "title": "Not the one",
      "text": "This didn’t work well for my iphoneX. My main complaint is that there is little versatility when it comes to mounting. Might work for most but just was not a good fit for my use and style.",
      "rating": 1.0,
      "verified": true,
      "author": "Jrox",
      "helpful_votes": 0,
      "publication_date": 20181225
    },
    {
      "title": "This is because if you dont slide and remove (pull and remove like I did once) the mount will come to the ...",
      "text": "Very sleek and versatile. I dont have to get a new mount for a new phone every time. Everyone who sees it in my car loves it. 2 friends already bought it. Just make sure you push the mount into the AC vent before you put a heavy phone on it. This is because if you dont slide and remove (pull and remove like I did once) the mount will come to the front and might fall if you stick a heavy phone on it. Mine did not fall but just warning others so they dont do the same mistake as I did :)",
      "rating": 5.0,
      "verified": true,
      "author": "DM",
      "helpful_votes": 0,
      "publication_date": 20150819
    },
    {
      "title": "I'm afraid to use a super glue as it may ruin my leather",
      "text": "Did not stick to the dashboard of my corvette for very long. I'm afraid to use a super glue as it may ruin my leather dashboard. The response from iOttie was fantastic looking forward to my new vent holder. Thank you Ottis. Charlie Merritt",
      "rating": 2.0,
      "verified": true,
      "author": "charles merritt",
      "helpful_votes": 4,
      "publication_date": 20170223
    },
    {
      "title": "NEVER AGAIN!",
      "text": "Absolutely terrible product. The magnet didn’t stick at all. Ok for ten minutes and then fell off causing the phone to hit my leg. I glued it with another glue which held for awhile until the holder fell off the vent. The case is lightweight so that wasn’t the issue. Just a terrible product.",
      "rating": 1.0,
      "verified": true,
      "author": "Lisa M. Lehman",
      "helpful_votes": 0,
      "publication_date": 20190522
    },
    {
      "title": "Used this mount for Ubering While it worked as intended ...",
      "text": "Used this mount for Ubering While it worked as intended and held my heavy Note 4 in place, EVERY time I detached the phone, the anchor mechanism came lose and had to be repositioned for proper grip, or the phone and the whole thing would fall of the air vent",
      "rating": 3.0,
      "verified": true,
      "author": "Pash",
      "helpful_votes": 0,
      "publication_date": 20180317
    },
    {
      "title": "Good",
      "text": "Fits in my Toyota in the CD player. Holds the phone perfect. I can see it perfect when I’m driving",
      "rating": 5.0,
      "verified": true,
      "author": "LG",
      "helpful_votes": 0,
      "publication_date": 20190818
    },
    {
      "title": "Great Mount - Works for both my Samsung Galaxy S3 and Apple iPhone 6 Plus",
      "text": "I love it because it's so compact. The ventilation fins on my car are vertical rather than horizontal but it still works fine. Only problem with vertical fins is that the weight of the phone causes the phone to move the fins during fast and tight cornering. Not a big deal, it doesn't move so much that it makes any difference to viewing the phone.",
      "rating": 5.0,
      "verified": true,
      "author": "Tom DiMartino",
      "helpful_votes": 0,
      "publication_date": 20160614
    },
    {
      "title": "Surprisingly awesome",
      "text": "I was very hesitant about this but finally opted to try it. I can see that some cd slots might have issues with it fitting in snug. I have a nexus 6p, a very heavy phone with a decent case. And the magnet holds thru it just fine. I wish it was Qi charging but since my phone isn't it really doesn't matter.. cheers!",
      "rating": 5.0,
      "verified": true,
      "author": "Tagban",
      "helpful_votes": 0,
      "publication_date": 20160928
    },
    {
      "title": "Great Device",
      "text": "Bought one of these for my son and one for my wife. Perfect phone holder for using Google maps when driving.",
      "rating": 5.0,
      "verified": true,
      "author": "Psdenno",
      "helpful_votes": 0,
      "publication_date": 20190221
    },
    {
      "title": "Very ncie and exceptionally convenient",
      "text": "Great idea... needs readjustment every time you remove the phone because it pulls it out of the air-vent just enough for the phone to start wobbling. Other then that, no problem... Oh yes... if you have wireless charging built into your phone... forget it and get another one with grips on the sides. I also bought retractable USB/micro USB cord so its length is just enough to charge the phone without being in the way.",
      "rating": 4.0,
      "verified": true,
      "author": "AR",
      "helpful_votes": 0,
      "publication_date": 20150724
    },
    {
      "title": "It broke",
      "text": "Off this as a present for my daughter and she said it broke",
      "rating": 1.0,
      "verified": true,
      "author": "prime member",
      "helpful_votes": 0,
      "publication_date": 20191206
    },
    {
      "title": "Still using it!",
      "text": "I think this mount has outlived three phones, still going strong and extremely easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Denny S Laines",
      "helpful_votes": 0,
      "publication_date": 20190327
    },
    {
      "title": "Secure car mount",
      "text": "Finally...a car mount that actually works!!! It is very stable and holds my phone at the proper angle for me to easily see the GPS.",
      "rating": 5.0,
      "verified": true,
      "author": "Connie",
      "helpful_votes": 0,
      "publication_date": 20181226
    },
    {
      "title": "Strong!",
      "text": "The magnet is strong! I have a wallet pocket on my phone with several credit cards and it still sticks well! It does not fall off like the other products. The clip also stays put and allows you to tilt and angle as needed.",
      "rating": 5.0,
      "verified": true,
      "author": "FunSize",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "Didn’t work as advertised",
      "text": "This did not work as advertised. The plastic sheet did not cling to my cell phone.",
      "rating": 2.0,
      "verified": true,
      "author": "robin benell",
      "helpful_votes": 0,
      "publication_date": 20190725
    },
    {
      "title": "The unit does fit in snug to the CD player and WOULD work fine but the magnet is too weak and the sticker ...",
      "text": "I bought this to use with my iPhone 7 that has a case. The unit does fit in snug to the CD player and WOULD work fine but the magnet is too weak and the sticker or film doesn't hold. I tried even taking my case off to make the magnet connection stronger, then the sticker falls off. Disappointed to say the least.",
      "rating": 1.0,
      "verified": true,
      "author": "Tania Quigley",
      "helpful_votes": 0,
      "publication_date": 20180605
    },
    {
      "title": "Not strong enough magnet.",
      "text": "Magnet not strong enough for just the phone itself without even having a case it falls to the floor on small bumps and sometimes even on flat roads.",
      "rating": 1.0,
      "verified": true,
      "author": "B.C.",
      "helpful_votes": 0,
      "publication_date": 20191018
    },
    {
      "title": "I Recommend, 100%!",
      "text": "I’ve dealt with so many different phone holders for cars and this is by far the best I’ve come across. It was super easy to install and very easy to use! I would recommend this product 100%!",
      "rating": 5.0,
      "verified": true,
      "author": "Rae",
      "helpful_votes": 0,
      "publication_date": 20181101
    },
    {
      "title": "It works best with car vents that are horizontal",
      "text": "I have gone through several car mounts for phones...some with sticky pads, some with suction cups, and some with adjustable grips that don't work very well. This is so clever. Your phone, no matter how big or small, snaps to it in a millisecond, and you're off! It works best with car vents that are horizontal. It does work on vertical vents, as I tried it in a rental car on a business trip, but the potential for it to slip is a bit greater. Overall, a great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Terry Sprague",
      "helpful_votes": 0,
      "publication_date": 20150420
    },
    {
      "title": "Easy to use and install",
      "text": "I really like this phone holder, I have tried a few and they did not work with my ford, they were all returned. It is not perfect but it works good.",
      "rating": 4.0,
      "verified": true,
      "author": "Lj",
      "helpful_votes": 0,
      "publication_date": 20190110
    },
    {
      "title": "By far the best mount I have used in my car with my ...",
      "text": "By far the best mount I have used in my car with my iPhone. I use the magnetic piece underneath my iPhone case and it stay firmly in place when placed on the mount. Love this product!! I have one in each of my vehicles.",
      "rating": 5.0,
      "verified": true,
      "author": "MelOG",
      "helpful_votes": 0,
      "publication_date": 20170622
    },
    {
      "title": "Nice feature set",
      "text": "My wife loves her iOttie so much, I got one. The magnet works great but the most impressive fro me in the ball-head. It moves easily yet holds the phone in place firmly.",
      "rating": 5.0,
      "verified": true,
      "author": "KiwiTexan",
      "helpful_votes": 0,
      "publication_date": 20180411
    },
    {
      "title": "great product",
      "text": "I've had this mount for about a year - love it. Super convenient and works great.",
      "rating": 5.0,
      "verified": true,
      "author": "Julie Evans",
      "helpful_votes": 0,
      "publication_date": 20190326
    },
    {
      "title": "Great for Traveling",
      "text": "I use this in my car and love it. I haven't noticed any slipping or falling off as I drive. I think this only happens if you happen to have a very thick case and at that point you wonder how the magnet will even hold it up with an otterbox-like case. I don't have any problems with it using regular cases and think it's perfect for traveling.",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa San Vicente",
      "helpful_votes": 0,
      "publication_date": 20160708
    },
    {
      "title": "Not all great. If you have a phone case it's not ...",
      "text": "Not all great. If you have a phone case it's not worth getting. It's better to get the car mount that expand.",
      "rating": 3.0,
      "verified": true,
      "author": "Wilson Jones",
      "helpful_votes": 0,
      "publication_date": 20181208
    },
    {
      "title": "The magnet won’t stick to my phone case. It ...",
      "text": "The magnet won’t stick to my phone case. It comes right off when I remove phone from the mount. I used the clear film, then stuck the magnet on that. The whole thing just pulls right off when I remove it from the mount.",
      "rating": 1.0,
      "verified": true,
      "author": "Runner",
      "helpful_votes": 0,
      "publication_date": 20180611
    },
    {
      "title": "Best I have Found",
      "text": "Great Product. I have tried several different types of car mounts and this is the best one I have found. I use an Apple leather case with my iPhone 6 and this works perfectly with the thin metal plate place in-between the iPhone and the case. I use the larger metal plate which creates a very slight budge in the back of the case. The iPhone is held securely by the magnets and the clip-on for the vent fins holds the whole setup securely to the car. The phone does not shake, like most of the other car mount systems, while driving.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim Morrow",
      "helpful_votes": 0,
      "publication_date": 20150716
    },
    {
      "title": "I love this product",
      "text": "Where have you been all my life! I love this product! I've purchased this for several family members too. It makes a great gift and it helps keep those I love safe when using GPS on your phone.",
      "rating": 5.0,
      "verified": true,
      "author": "b9sling",
      "helpful_votes": 0,
      "publication_date": 20180213
    },
    {
      "title": "Greatest Product",
      "text": "Product installs easily and stays secure even on bumpy roads! I am very happy with my new purchase!😁",
      "rating": 5.0,
      "verified": true,
      "author": "Gregory C.",
      "helpful_votes": 2,
      "publication_date": 20170208
    },
    {
      "title": "Great product",
      "text": "Pro: large base provides ample surface area for strong adhesion. Strong magnet for solid device attachment (iPhone 8 Plus) Con: none at time of review",
      "rating": 5.0,
      "verified": true,
      "author": "LTL BHR",
      "helpful_votes": 0,
      "publication_date": 20180713
    },
    {
      "title": "The magnetic strips worked fine but couldn't use it in the car which defeated ...",
      "text": "This product would not stick to my dashboard at all. The magnetic strips worked fine but couldn't use it in the car which defeated its purpose. Tried to call customer service and could never reach a human being.",
      "rating": 1.0,
      "verified": true,
      "author": "NOEL MILIAN",
      "helpful_votes": 3,
      "publication_date": 20170629
    },
    {
      "title": "easy to use and figure out",
      "text": "Have had it for a couple weeks now, easy to use and figure out. Great for traveling, just put the clamp part on my bag with car charger and fits great in a few different rental/personal cars I've had. Would recommend it over the cheaper ones, feels really well built.",
      "rating": 5.0,
      "verified": true,
      "author": "bvanvorst",
      "helpful_votes": 2,
      "publication_date": 20150217
    },
    {
      "title": "Best I've used",
      "text": "ive owned many car mounts and one other vent mount. This one is great. Only downside is that vents can be fickle. The more secure your vent positioning is the better experience you'll have. The magnet itself is top notch. I'll never use a non magnetic mount again.",
      "rating": 4.0,
      "verified": true,
      "author": "Justin",
      "helpful_votes": 0,
      "publication_date": 20150712
    },
    {
      "title": "Note Book 3",
      "text": "The iOttie works fairly well from the other devices I have bought to use with my Galaxy Note 3 .This phone is extremely heavy and would not stand up right with other devices when I was using a map application for directions. Sometime it does move when u hit a pothole but being from NYC you just manage , good buy.",
      "rating": 4.0,
      "verified": true,
      "author": "norberto",
      "helpful_votes": 0,
      "publication_date": 20151023
    },
    {
      "title": "In all my vehicles.",
      "text": "Love this!! Simple design, strong, sometimes falls off if I hit a big bump. I have them in all our vehicles.",
      "rating": 5.0,
      "verified": true,
      "author": "Jelene R Trewet",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "Like all there other products but this one won’t hold ...",
      "text": "Like all there other products but this one won’t hold the phone in landscape mode. Does the job otherwise",
      "rating": 3.0,
      "verified": true,
      "author": "Rockrunner",
      "helpful_votes": 0,
      "publication_date": 20180606
    },
    {
      "title": "Cool, but....",
      "text": "I like how easy this is to use but I did not like the air vent application. What I realized, after purchasing, is during the harsh winter months in the Maryland DC area having my heater on full blast would cause my phone to malfunction. And this was from heat from the adjacent vent that was not even pointed towards this phone. So great concept, just not for me.",
      "rating": 4.0,
      "verified": true,
      "author": "Jacquelin",
      "helpful_votes": 0,
      "publication_date": 20150930
    },
    {
      "title": "Iottie",
      "text": "I love that you can use your cd player to hold a gps, but I wish that it locked more securely. When I put my note 8 on and started driving it would move down and I had to keep lifting it up. If they could fix that problem it would be a great GPS mount",
      "rating": 1.0,
      "verified": true,
      "author": "Jose",
      "helpful_votes": 0,
      "publication_date": 20180726
    },
    {
      "title": "Excellent Phone Holder",
      "text": "Had to buy two - for both car vents. Works great with iPhone 7S and holds well. Keeps phone right in front of you without causing distractions.",
      "rating": 5.0,
      "verified": true,
      "author": "IWASME",
      "helpful_votes": 0,
      "publication_date": 20180209
    },
    {
      "title": "Magic",
      "text": "My wife can't figure out the magic of this device but she loves it and no longer does she dump her iPhone in the well of her car.",
      "rating": 5.0,
      "verified": true,
      "author": "KiwiTexan",
      "helpful_votes": 0,
      "publication_date": 20180411
    }
  ],
  "product_meta": {
    "title": "iOttie ITap Magnetic Air Vent Premium Mount Holder for Iphone XS Max R 8 Plus 7 Samsung Galaxy S10 E S9 S8 Plus Edge, Note 9 & Other Smartphone",
    "description": "Style:Air VentThe iOttie itap Magnetic vent mount is a new sophisticated yet fully functional mounting solution that provides a strong grip to smartphones using a Magnetic hold. Utilizing an aluminum bezel, the itap magnetic vent mount is not only built with great quality but also gives off a neat contemporary look to make it Stand out from the rest. It will now give users a new mounting option (instead of on the dashboard or windshield). unlike most vent mounts, the itap magnetic vent mount was designed to allow for full 360 degree rotation, thus Providing the user with a better viewing angle. It provides a unique one click lock and release feature with silicon placed on the connecting arms to provide a safe latch to the users vent to avoid scratching/damage while also minimizing vibrations to the device when in use. With 6 rare earth magnets included Providing a powerful grip from mount to smartphone, the user can feel the powerful grip once they place the magnet close to the mount. The itap Magnetic vent mount accommodates most smartphones as well as their cases by using the provided metal plate. It is more compact than most vent mounts in the market which provides for a cleaner, organized look. Simply attach the magnetic plate to your smartphone, mount with one hand and go. Please Note: the magnet should not cause interruption to your smartphone and or Internet quality when in use, however, it may cause some interference to select smartphones compass function. Please Note the compass will return back to normal after removing the smartphone from the mount",
    "rating": 4,
    "feature_bullets": [
      "A universal mounting solution that will hold most smartphones, as well as their cases, and GPS devices",
      "Provides a choice of an inner and outer metal plate; Each plate uses an adhesive tape to attach to select mounting location and is easily removable; 6 rare earth magnets provides a 6 pounds pull force to give users a strong grip",
      "Spring loaded one click lock and release feature to provide a strong clamped hold to users vent blade while also minimizing vibrations to your device",
      "The magnet should not cause interruption to your smartphone's internet, cellular, or navigation quality when in use; It may cause some temporary interference to select smartphones compass function depending on the location of mounting the magnet mount; The compass will return back to normal use after removal; The metal plate may cause interference to QI charging functions, once the metal plate is removed, qi charging will return back to normal",
      "Purchasing from Amazon will guarantee an authentic iottie product; Purchasing from a 3rd party seller may not guarantee authenticity of this product"
    ],
    "specifications": {
      "Product Dimensions": "1 x 0.5 x 1 inches",
      "Item Weight": "2.4 ounces",
      "ASIN": "B00Q3G8LPQ",
      "Item model number": "HLCRIO151RT",
      "Customer Reviews": "4.0 out of 5 stars1,825 ratings4.0 out of 5 stars",
      "Best Sellers Rank": "#13,633 in Cell Phones & Accessories",
      "Is Discontinued By Manufacturer": "No",
      "Other display features": "Wireless",
      "Colour": "Black",
      "Included Components": "ITap",
      "Department": "Magnet",
      "Manufacturer": "iOttie",
      "Date First Available": "November 24, 2014"
    },
    "categories": [
      "Cradles",
      "Accessories",
      "Cell Phones & Accessories",
      "Automobile Accessories",
      "All Departments"
    ],
    "price": 15.99
  }
}