{
  "website_summaries": [
    {
      "verdict": "A focus on fishing and fish-related games sets this water table apart from the rest.",
      "pros": [
        "Aside from just catching and counting fish, this unique water table offers a number of activities to entertain children and develop hand-eye coordination",
        "Easy tool-free assembly",
        "Positioned low to the ground, this option is solid and sturdy, offering easy-to-reach access"
      ],
      "cons": [
        "Drain plug requires a bit elbow grease to be correctly fitted"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "This little table has been great both inside and outside of the house",
      "text": "This little table has been great both inside and outside of the house. Outside, we use it as a water table. It doesn't leak and my son enjoys playing with all the toys and accessories. Inside, we put ball pit balls in it (100) and he launches them across the room with the catapult and generally digs around. It is a simple little table that has provided hours of entertainment in our house.",
      "rating": 5.0,
      "verified": true,
      "author": "Jaime",
      "helpful_votes": 23,
      "publication_date": 20161007
    },
    {
      "title": "Poor quality",
      "text": "The idea itself is fun but I’m disappointed in the quality, especially since this is a name brand toy line. The square Lilly pad base that goes in the center has grooves that are not aligned so it won’t click into place. I can see based on other reviews I’m not the only one with this issue. The Little tykes emblem is also upside down on the piece we got. It’s also really difficult to get the drain plug into place correctly.I don’t have time to package everything up and return it or set another new one up so I don’t think it’s worth it to return. Not sure if I will buy this brand again.",
      "rating": 2.0,
      "verified": true,
      "author": "Roxanne",
      "helpful_votes": 8,
      "publication_date": 20190207
    },
    {
      "title": "Plug doesn’t hold the water",
      "text": "The table itself is so cute. But the plug that is suppose to keep the water in the table leaks. After 10 minutes all the water has drained out. If the window for return hadn’t expired, I’d return it. I’m not sure if I just have a defective plug or all the tables were made this way. Unfortunately I have to put duck tape over it. It’s sad because my 15 month old loves splashing the water and playing with the toys. Table looks tacky with tape over it. If it weren’t for the plug issue, I’d give the table five stars!",
      "rating": 2.0,
      "verified": true,
      "author": "Kristine P",
      "helpful_votes": 8,
      "publication_date": 20180611
    },
    {
      "title": "Bad Design",
      "text": "The fish and splash model did not deliver. There is something wrong with the design because the lilypad featured in the middle doesnt spin and hardly adds anything to the table. Many other models have some sort of cascading water feature. I regret getting this table for my 16 month old, he is not too interested in the table itself and just opts for splashing water with a cup that did not even come with it.",
      "rating": 3.0,
      "verified": true,
      "author": "Jona",
      "helpful_votes": 2,
      "publication_date": 20200505
    },
    {
      "title": "Great toy for little fishermen!",
      "text": "Son loves this as his gramps is an avid fisherman and he enjoyed playing it with him. It was easy to assemble and everything works great. A little challenging for a younger child that may not have the patience to hook a fish but fun nonetheless there are plenty of activities on this to keep them occupied. The drain hole that people mentioned was there just not in the place it shows on the picture but I’ll say it’s pretty obvious to figure that out. Anyway the legs aren’t the sturdiest so be mindful with how much water you add and having bigger kids lean on it. But I’m happy with it. Would recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "jujumama",
      "helpful_votes": 0,
      "publication_date": 20200424
    },
    {
      "title": "Lightweight, easy to clean, great water play for little ones",
      "text": "So I bought this initially off of eBay and was so excited— then found out it was a fake account! I’m so happy this went back In stock on amazon and bought it the first day I saw it! This was extremely easy to assemble, and I am the worst at putting things together LOL. It is super lightweight and easy for me to carry around ( I am 18 weeks pregnant). My daughter absolutely love this. She is a year and a half old. I foresee her continuing to play with this over time. Great price too— especially with these being price gauged and mostly sold out due to high demand!",
      "rating": 5.0,
      "verified": true,
      "author": "Courtney Schweiger",
      "helpful_votes": 0,
      "publication_date": 20200613
    },
    {
      "title": "Total POS",
      "text": "I was looking for a water table for my 2 year old and this was the only one one stock .... well that is because it is a total POS. My little one loves water and he played with this about 2min and was bored... the slide is the only cute thing the lily pad doesn’t spin. My advice is to wait til another better version comes back in stock and get that one. I feel like Step 2 water tables are way better quality.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20200514
    },
    {
      "title": "Little boy loves playing with it.",
      "text": "This play table was delivered very shortly after I placed the order and was perfect because it was just in time for the 1st birthday party my friend had for her son. My friend said that her son loves to play with this water table and all the fishes that come with it. They have it set up in their back yard in the middle of a little kiddie pool.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Marsh",
      "helpful_votes": 4,
      "publication_date": 20160820
    },
    {
      "title": "Entertaining",
      "text": "Our granddaughter loves this!! I would give it a 5 but it was difficult to put together and we had to drill a hole because it was not done from the factory. Once we got it together she has been playing with it every chance she gets!! *** Update, I have now bought an additional 3 ore for my great nieces :)",
      "rating": 4.0,
      "verified": true,
      "author": "Jennifer Cothren",
      "helpful_votes": 5,
      "publication_date": 20180909
    },
    {
      "title": "Good product for the price",
      "text": "This product eventually became available. It kept showing being sold out for a while. This summer we can’t travel much but we still want our daughter to have fun with water. It’s also a great way to cool off. This table is affordable, simple yet has plenty of fun features. The only complaint Is that the middle green piece doesn’t spin with water coming down from the slide ( I suppose it should? ) But my daughter loves playing with it with or without water in it and keeps adding additional toys. Easy to install and overall pretty sturdy.",
      "rating": 5.0,
      "verified": true,
      "author": "jane",
      "helpful_votes": 0,
      "publication_date": 20200709
    },
    {
      "title": "a birthday gift defective",
      "text": "I purchased this item for a birthday gift for my nephew in April. His mom opened it for use when the weather was nice. Only to find out the water table is defective. Parts do not fit and no hole for water access. I will now purchase another water table but not this one. I am hoping for a refund. Floss Trinsey",
      "rating": 1.0,
      "verified": true,
      "author": "floss trinsey",
      "helpful_votes": 2,
      "publication_date": 20190607
    },
    {
      "title": "A water slingshot.....",
      "text": "I have a five year old and a one year old. Thought this would be great... little did I know, I was buying a water slingshot for my 5 year old to spray my 1 year old. And the spinny green thing doesn’t even attach...it sits there. The middle of is the perfect height for my older kid to spin water into my younger kids face....so I regret this purchase? A little. Do they still play with it? Yes...",
      "rating": 4.0,
      "verified": true,
      "author": "Brianna",
      "helpful_votes": 0,
      "publication_date": 20200426
    },
    {
      "title": "Toddler is obsessed with product",
      "text": "Keeps my 1 1/2 and 7 year old busy for about an hour they love it, my toddler wakes up and runs to the patio door and begs to play with this water table, she says “please please water water outside” can’t believe how cheep the price was for a very durable and sturdy product! Also all of the toys that are included and a super plus they love use the fishing rod especially",
      "rating": 5.0,
      "verified": true,
      "author": "Kelvin",
      "helpful_votes": 0,
      "publication_date": 20190807
    },
    {
      "title": "Great for summer fun in the heat!",
      "text": "So glad I got it. With Covid keeping us home for a while I decided to get our kids a water table. Best decision ever. Both suitable for my 4yr old and 2 yr old kids. They love it. Not really one negative thing to say about it. I definitely did my research for water tables with all the price gouging on popular items. Everything was easy to assemble. It has even withstanded a storm. So I am very pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "M.Nduku",
      "helpful_votes": 0,
      "publication_date": 20200529
    },
    {
      "title": "Leaks !!!!",
      "text": "I’ve always liked Little Tykes toys for their quality ..... however, this water table doesn’t hold the water - leaks from plug ...... lost all water in table in about a half hour - haven’t shown the grandkids yet - gonna try and see if we can come up with a solution ..... has anyone been able to get a replacement plug from manufacturers ????",
      "rating": 2.0,
      "verified": true,
      "author": "ANGELA LEROYER",
      "helpful_votes": 0,
      "publication_date": 20200624
    },
    {
      "title": "Missing pieces",
      "text": "This came with missing pieces. It was missing one of the legs so we couldn't even use it without one of the scoops. So frustrating when you tell the kids its coming and when it gets here they can't even play with it.",
      "rating": 1.0,
      "verified": true,
      "author": "Cathy Kirby",
      "helpful_votes": 0,
      "publication_date": 20190904
    },
    {
      "title": "The plug is really hard to put it, but it doesn't leak!",
      "text": "My 3yr old loves this toy! I read some of the review after I bought it and thought I made another bad choice! People kept complaining about the plug leaking. I will say this....if you don't have the plug in correctly the water will be coming out like a faucet. It's really hard to put in the plug, but once you have got in correctly it doesn.t leak at all!!",
      "rating": 5.0,
      "verified": true,
      "author": "Denise C",
      "helpful_votes": 0,
      "publication_date": 20180511
    },
    {
      "title": "1 Year Old",
      "text": "My 1 year old nephew loves water and this is great for him. He is tall enough to see it, you can fill it as high or low as you want. I did have trouble with the stopper but I found another one to replace it.",
      "rating": 5.0,
      "verified": true,
      "author": "Chy",
      "helpful_votes": 0,
      "publication_date": 20200601
    },
    {
      "title": "Beware of bugs!!! LYSOLLL",
      "text": "Product came as described. Very easy to assemble, took less than 5 minutes. Looks like a lot of fun, I know my babies will love it. Only flaw was that I found a dead bug in the water cup, but that's why you just gotta wipe everything down, spray some lysol, and you'll be okay. I didnt feel like that was worth knocking a star off BUT it was there so.",
      "rating": 5.0,
      "verified": true,
      "author": "Elvira",
      "helpful_votes": 0,
      "publication_date": 20200609
    },
    {
      "title": "Not what was advertised",
      "text": "Well it would have been nice if I got the right product. Didn't have the fishing poles is a different color just has a lily pad and is very boring. Sadly I can't return it because I ordered it for my daughter's birthday in the winter in Michigan. So I just now opened it months later and it's not what we wanted at all.",
      "rating": 1.0,
      "verified": true,
      "author": "Mlk",
      "helpful_votes": 3,
      "publication_date": 20180527
    },
    {
      "title": "Perfect for keeping toddlers busy",
      "text": "An absolute must for toddlers. Allows them to get wet and play without the full on swimming pool effort. My grandson has had for 2 months now and plays with it 2 or 3 times every single day. Can't say enough about how great this has been during work from home covid times! They use on the covered porch on rainy days too.",
      "rating": 5.0,
      "verified": true,
      "author": "DGK",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "Fun for everyone",
      "text": "Easy to put together and love that it came with fishing accessories! I have 2 kids - a 6 year old & 1 1/2 year old, both of them enjoy playing with this table so I’d definitely recommend it to those with multiple children! (I did buy the munchkin toy fishing pole as well so there would be less fights over who got which pole)",
      "rating": 5.0,
      "verified": true,
      "author": "SJ Han",
      "helpful_votes": 0,
      "publication_date": 20180408
    },
    {
      "title": "Leaking plug, missing hole for attachments",
      "text": "Very first time it was used the plug leaks! And there is no hole for an attachment that is supposed to spin. It comes with a paper saying to skip this step because there isn’t a hole for it. Disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "ETM",
      "helpful_votes": 3,
      "publication_date": 20190413
    },
    {
      "title": "Good size for toddlers",
      "text": "My 2 year old loves this. He was always wanting to play in the sink or tub so this has been a great toy to get us all outside more. I purchased this at $20 off, don’t think I would have payed full price for it when compared to the tables available in that price range.",
      "rating": 5.0,
      "verified": true,
      "author": "CLD",
      "helpful_votes": 0,
      "publication_date": 20190916
    },
    {
      "title": "Toddler loves it!!",
      "text": "My son loves this water table! I was able to put it together in about five minutes. It came with the perfect amount of accessories (enough to keep him amused but not too many to frustrate me when picking up at the end of the day). Looking forward to a summer of fun!",
      "rating": 5.0,
      "verified": true,
      "author": "Doreen Scudder",
      "helpful_votes": 0,
      "publication_date": 20200625
    },
    {
      "title": "A blast",
      "text": "We had a blast with this water table this summer. We bought this to keep at our children’s grandparents house and it was a hit. Hooking the fish provides a fun activity and the launcher was a blast (though it will really fling the fish, so be cautious your children don’t hit each other). All in all we loved this water table!",
      "rating": 5.0,
      "verified": true,
      "author": "Timothy Park Dinger",
      "helpful_votes": 0,
      "publication_date": 20171109
    },
    {
      "title": "Perfect for my water-loving baby",
      "text": "We’ve had this water table for a week now and my 16 month old really enjoys it. I don’t have an issue with leaking; the plug takes the most effort to install. There is an opening under the lily pad though and depending on the amount of splashing, water can get out through that opening.",
      "rating": 5.0,
      "verified": true,
      "author": "Oriana",
      "helpful_votes": 0,
      "publication_date": 20200520
    },
    {
      "title": "Water table...",
      "text": "Item was dirty (specks of dirt and hair on the blue drum) when the item was unboxed. All other pieces were clean and came sealed in plastic bags. My kids enjoy it. I like the price point, since we get a new one every couple of years.",
      "rating": 4.0,
      "verified": true,
      "author": "Christopher S Frederick",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "Disappointed",
      "text": "This was very hard to put together!! The plug is really poor quality, I will have to use silicone to keep it in place, falls right out.",
      "rating": 1.0,
      "verified": true,
      "author": "Nina",
      "helpful_votes": 0,
      "publication_date": 20190405
    },
    {
      "title": "Great toy but pieces don’t align.",
      "text": "This table is at such a great price I had to purchase it! However the center piece the lily pad and piece that goes into the center is nearly impossible to put tightened. The pieces don’t align. It was a pain to put together but for the price you really can’t complain. My daughters love playing with this!",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190904
    },
    {
      "title": "LOVE this activity table",
      "text": "LOVE this activity table. I have a 2 and 4yr old and thought only the 2yr old would enjoy, but both kiddos play along with it for hours on end in the backyard. Very easy to put together - my 8yr old did it on her own in under 10min. The table comes in its original packaging with directions.",
      "rating": 5.0,
      "verified": true,
      "author": "AC Nu",
      "helpful_votes": 0,
      "publication_date": 20180418
    },
    {
      "title": "Great even for babies!",
      "text": "This is such a fun table! My daughter is only 9 months and loves standing and splashing at the table! I'm sure she'll enjoy it more as she gets older and learns how to use it! The fishing pole, fish & other animals, and toy launcher all seem really fun!",
      "rating": 5.0,
      "verified": true,
      "author": "Aarika Shields",
      "helpful_votes": 2,
      "publication_date": 20170420
    },
    {
      "title": "Good",
      "text": "Wish the drain had been put in before it was shipped. Had a hard time getting in all the way in. But otherwise my daughter loves it.",
      "rating": 4.0,
      "verified": true,
      "author": "Ashley Conine",
      "helpful_votes": 0,
      "publication_date": 20190127
    },
    {
      "title": "If you’re on the fence- buy this table!",
      "text": "We love this water table! The fishing pole activity is a bit advanced for my kiddo (17m) but she loves playing with it all the same! During our Covid isolation it helps her keep her happy and busy outside so Mama can work!",
      "rating": 5.0,
      "verified": true,
      "author": "Annied03",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "Parts don’t all attach properly",
      "text": "It all works great besides the center piece. It leaks because the center part won’t attach properly and looks like it wants to break if we try pushing it in harder. Because it won’t go in all the way it falls over when our toddler tries to play with that part. The Center leaf also doesn’t work the way it’s supoosed to because of it. We wish we spent the money on a more expensive one because of this.",
      "rating": 3.0,
      "verified": true,
      "author": "Sarah Herrick",
      "helpful_votes": 0,
      "publication_date": 20190923
    },
    {
      "title": "Doesn’t hold up.",
      "text": "Maybe fine if you don’t have rough kids or you keep it out of any kind of less than stellar weather. Didn’t hold up for us at all. Lasted maybe half the summer. Legs got all bent out of shape, so then it wouldn’t sit level. Once it wouldn’t sit level the weight of the water just kept tilting it more and more until it wouldn’t even stand up at all. In our opinion, junk.",
      "rating": 2.0,
      "verified": true,
      "author": "Alyssa",
      "helpful_votes": 0,
      "publication_date": 20200405
    },
    {
      "title": "My 2yr old LOVES it! Great product, quick ship (given our world current state).",
      "text": "Arrived when it said it would. Arrived quicker than I figured, given the state of the world. Super easy assembly. My 2 year old absolutely loves it. Can’t wait for it to stay Sunny & Warm, so she can continue to play with it outside, instead of playing in our dogs water dish...lol I recommend this seller and product! Will order more in near future.",
      "rating": 5.0,
      "verified": true,
      "author": "Nichole",
      "helpful_votes": 0,
      "publication_date": 20200503
    },
    {
      "title": "Daughter's favorite outdoor toy!",
      "text": "My daughter just loves this! Its well made, and easy to clean and drain when needed. The only grip I have is the center spinner when water is poured down it. It doesn't seem to spin very well.",
      "rating": 5.0,
      "verified": true,
      "author": "LoveThatDirtyWater",
      "helpful_votes": 0,
      "publication_date": 20200625
    },
    {
      "title": "My son loves this!",
      "text": "We went to a baby birthday party where they had a water table and my 20 month old (who is adraid of water) loved it so we had to get one. He just LOVES this table. He loves splashing in the water, sending the little critter down the slide, and trying to catch the fish. I even have a lot of fun playing with him which is great because so many toddler toys are kind of boring.",
      "rating": 5.0,
      "verified": true,
      "author": "That's Bananas",
      "helpful_votes": 5,
      "publication_date": 20150804
    },
    {
      "title": "Fun for your little one",
      "text": "Not the most complex water table but my 16 month old loves it. Wish the lily pad spun when water came down on it from the slide but otherwise generally a good product for the price. Seems sturdy",
      "rating": 4.0,
      "verified": true,
      "author": "Jaclyn KSG",
      "helpful_votes": 0,
      "publication_date": 20200621
    },
    {
      "title": "A must buy!!",
      "text": "Omg my son loved this! It came with little set of fishes and turtles for play with a fishing rod and it was very entertaining to watch my son trying to get all the fish on the hook and throw the turtle from the small catapult. Awesome buy. Would def recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Ezequiel",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "Good Buy!",
      "text": "Made great. I just wish you could adjust the legs height. We bought it for our 4 year old, she loves to play in the water but she has to bend over quite a bit.",
      "rating": 5.0,
      "verified": true,
      "author": "Pen Name",
      "helpful_votes": 0,
      "publication_date": 20191003
    },
    {
      "title": "... loves this table and she can reach the toys easily. For the winter",
      "text": "My (shorter) toddler loves this table and she can reach the toys easily. For the winter, we brought the fishing set inside to play in the bathtub. She'll still love it next year at 3yo and my 1yo will play with it too.",
      "rating": 5.0,
      "verified": true,
      "author": "Laura Gauntt",
      "helpful_votes": 3,
      "publication_date": 20171024
    },
    {
      "title": "Great table for the kids",
      "text": "Great table for the kids, but mine came without notches for the square below the lilly pad to snap into. I can see where they are supposed to be but they were never cut. I am hoping we can cut some into it, but if not, I'll be sending this back.",
      "rating": 2.0,
      "verified": true,
      "author": "Jess",
      "helpful_votes": 8,
      "publication_date": 20150618
    },
    {
      "title": "Great investment- hours of fun!",
      "text": "My 2 and 3 year old love this water table!! They have so much fun with it- totally recommend it! It comes with lots of little tours and pieces to play in the water with.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200705
    },
    {
      "title": "very cheap and leaks water!",
      "text": "Very cheap. The plug for the water was too small and didn't even come close to plugging the hole, it fell right through the hole and even after we tried to make our own plug, it just leaks.. The water wheel in the center doesn't spin when you pour water down the slide, and all of the attachments come off very easily. If I could return it, I would. Again, super cheap product and not worth the money.",
      "rating": 1.0,
      "verified": true,
      "author": "AllyRose",
      "helpful_votes": 2,
      "publication_date": 20150715
    },
    {
      "title": "Adorable and entertaining",
      "text": "This playbtable is perfect for my toddler! It’s actually bigger than I expected! The fishing pole and little fish keep my toddler entertained and she loves launching the little fish off of the side! Adorable and well worth the money!",
      "rating": 5.0,
      "verified": true,
      "author": "bree",
      "helpful_votes": 0,
      "publication_date": 20190227
    },
    {
      "title": "Nice warm weather activity",
      "text": "My grandson plays for ages with this. He likes to play with his own toys in the water: deeps sea rescues, life saving “little people”, and it provides learning experiences too.",
      "rating": 5.0,
      "verified": true,
      "author": "Barbinbuffalo",
      "helpful_votes": 0,
      "publication_date": 20200528
    },
    {
      "title": "Cost effective and functional!",
      "text": "Wanted a water table for my son but didn’t want anything fancy or expensive and this one is perfect! Has a lot of cute additional toys and the fishing pole is adorable :)",
      "rating": 5.0,
      "verified": true,
      "author": "alison",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "Must have!",
      "text": "Bought this for a 1 year old on her birthday. As with any and all small children, NEVER leave them unsupervised with water filled toys. This is sturdy, she is pulling herself up and now walking. She will grow with this product. My children had one very much like this and enjoyed it for many years. This is a must have toy for children.",
      "rating": 5.0,
      "verified": true,
      "author": "Dottie",
      "helpful_votes": 0,
      "publication_date": 20170823
    },
    {
      "title": "Hours of fun!",
      "text": "I got this for my 1 year old granddaughter because my 2 year old granddaughter has one she got last year. I can't say enough good things about this water table!",
      "rating": 5.0,
      "verified": true,
      "author": "Sallie Alexander",
      "helpful_votes": 0,
      "publication_date": 20200617
    },
    {
      "title": "My 2 year old nephew loves it.",
      "text": "My little nephew is 2 years old and he LOVES to splash around. So I sent him this for his b-day. He loves it and he plays with his sister (4 y/o) who also loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "Jasen L. Dill",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "This is the one you want!",
      "text": "Bought this for my 1 yr old granddaughters. They love it!! And so do their siblings. And their mamas. Sturdy. Simple yet plenty to do. The fishing concept is adorable.",
      "rating": 5.0,
      "verified": true,
      "author": "Jill",
      "helpful_votes": 0,
      "publication_date": 20200815
    },
    {
      "title": "Granddaughter loves this",
      "text": "I purchased this for my 2 year old granddaughter and she had the best time with it. It’s the perfect height for her to stand and play in it.",
      "rating": 5.0,
      "verified": true,
      "author": "Sandy",
      "helpful_votes": 0,
      "publication_date": 20201021
    },
    {
      "title": "Great product",
      "text": "My kiddos loved it, it’s a great product and price! It was big enough for my three kids that range from 17 month to five year old to play with. It came with a cute fishing pool and other items for the kids to play with.",
      "rating": 5.0,
      "verified": true,
      "author": "Marilyn Miranda",
      "helpful_votes": 0,
      "publication_date": 20200528
    },
    {
      "title": "Very sturdy.  Worth every penny",
      "text": "Nothing to dislike. My granddaughter loves it and plays a long time with it. I got one for my older grandhh Co indrawn when they were little and they had a ball With it. Very safe and lots of fun.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "Entertainment for the toddler!",
      "text": "Bought for my 19month old. Great size for her, keeps her entertained and she loves it. It was easy to assemble, some had stated the plug leaks but mine does not, you just have to make sure to put it in right. Great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Aimee",
      "helpful_votes": 0,
      "publication_date": 20190501
    },
    {
      "title": "So fun for outdoor water play!",
      "text": "We didn’t receive all of the parts in the original order, but Little Tikes is amazing to work with and sent them, no questions asked, super fast. This water table is darling!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200312
    },
    {
      "title": "Sturdy",
      "text": "This table is so cute and my great grandson loves it. He’s 18 months old and has spent many days playing with it. Easy set up. Love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Peg H",
      "helpful_votes": 0,
      "publication_date": 20200719
    },
    {
      "title": "Best for small children",
      "text": "This is a very basic water table your toddler will love it. And your school age kids will play with it briefly, it is definitely a toddler toy.",
      "rating": 5.0,
      "verified": true,
      "author": "GirlNotInMexico",
      "helpful_votes": 0,
      "publication_date": 20200601
    },
    {
      "title": "Great buy!",
      "text": "My daughter is still a bit young to really utilize all the extras that come with this water table, however she still enjoys splashing around in it. We've used it several times and never had an issue with the plug leaking water. Great buy!",
      "rating": 4.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 2,
      "publication_date": 20160921
    },
    {
      "title": "Perfect",
      "text": "Perfect for this heat and my son is so happy to go outside EVERY DAY to play with his water table. Very easy to assemble. Just took a little long to get it but probably because it was in the middle of quarantine",
      "rating": 5.0,
      "verified": true,
      "author": "Kelsey G",
      "helpful_votes": 0,
      "publication_date": 20200707
    },
    {
      "title": "Great activity table",
      "text": "Perfect little water table and priced fairly. Daughter's favorite part is filling up the little bucket and watching it splash. Super easy to put together and take apart to store.",
      "rating": 5.0,
      "verified": true,
      "author": "Latoya J",
      "helpful_votes": 0,
      "publication_date": 20200726
    },
    {
      "title": "Awesome Water Table",
      "text": "Great water table with good amount of toys/accessories. The basin has a plug, which is nice. Great height-not too high for my 1yr old to reach but also not too low for 4 yr old to enjoy too.",
      "rating": 5.0,
      "verified": true,
      "author": "Natural Mama",
      "helpful_votes": 0,
      "publication_date": 20180415
    },
    {
      "title": "Doesn’t stay together",
      "text": "My kids love this but we spend the entire time putting the center piece back in. The clips that should push down and “lock” in place do not work. It’s very frustrating for us and my kids.",
      "rating": 3.0,
      "verified": true,
      "author": "Tiffany R.",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "What I don't like about this table is that it keeps leaking",
      "text": "What I don't like about this table is that it keeps leaking. I tried the plugs in different ways, but nothing helped. I finally put electrical tape around the plug and that helps some. Disappointed, but don't want to return the whole thing.",
      "rating": 3.0,
      "verified": true,
      "author": "veronica",
      "helpful_votes": 0,
      "publication_date": 20170625
    },
    {
      "title": "Older child enjoys it",
      "text": "I bought this for my 5 year old as we don't have room for a pool, but still wanted her to be able to play with water. She loves it! I was worried it would be too short for her, but it doesn't seem to be an issue. She loves the fishing aspect and the launcher. I asked her if she liked it and said said, \"I more than like it!!!\" That's good enough for this mom.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Martin",
      "helpful_votes": 0,
      "publication_date": 20160613
    },
    {
      "title": "toddler loves this and it entertains her. only complaint ...",
      "text": "toddler loves this and it entertains her. only complaint is that when we pour water into the fishbowl, water collects and drips from the middle under the lilly pad. not a deal breaker but just wanted to note it.",
      "rating": 4.0,
      "verified": true,
      "author": "JL",
      "helpful_votes": 0,
      "publication_date": 20180530
    },
    {
      "title": "Doesn’t hold water",
      "text": "Easy to put together however the drain plug doesn’t work properly and the table immediately begins losing water. Additionally the spout to pour water down the slide doesn’t actually line up with the slide and so doesn’t work. My daughter loves to play in/with water so we are super bummed!",
      "rating": 1.0,
      "verified": true,
      "author": "Kelli M. Patterson",
      "helpful_votes": 0,
      "publication_date": 20190310
    },
    {
      "title": "Can even be used in the shower!",
      "text": "Purchased for our grandson for their pool. Grandson loves it ... so much in fact, he plays with it in the shower.",
      "rating": 5.0,
      "verified": true,
      "author": "LAL",
      "helpful_votes": 0,
      "publication_date": 20200903
    },
    {
      "title": "So cute!",
      "text": "I can't wait to give this to my kids on Satueday. It is so cute and the perfect height for both of my kids to enjoy it.",
      "rating": 5.0,
      "verified": true,
      "author": "N. Chase",
      "helpful_votes": 0,
      "publication_date": 20190822
    },
    {
      "title": "We will buy a better table....",
      "text": "This table is terrible. It constantly leaks, so we have to refill more often than we should and the floor under it is constantly wet. The attachments don't stay in place, or line up correctly. Worst of all, if my 2 year old leans, just a bit, the legs will give away and the entire thing comes crashing down. The legs shouldn't bend, at all. We will be buying a better table.",
      "rating": 2.0,
      "verified": true,
      "author": "Maria0507",
      "helpful_votes": 7,
      "publication_date": 20160920
    },
    {
      "title": "First birthday gift",
      "text": "We purchased this product for a first birthday gift. After seeing the use our neighbors water table got with their 1 year old son we couldn’t pass up the opportunity. Perfect price for a fun, practical gift. It’s sure to keep our niece entertained for sunny days playing outside!",
      "rating": 5.0,
      "verified": true,
      "author": "Savannah",
      "helpful_votes": 0,
      "publication_date": 20201014
    },
    {
      "title": "Love it",
      "text": "Got this for my 2yo and he loves it. Assembly is simple and there aren't too many pieces so clean up after play time isn't a huge hassle. Only qualm is the fishing pole isn't functional & my son kept trying to use the reel to bring the fish up. Def would buy again.",
      "rating": 4.0,
      "verified": true,
      "author": "Taylor Willhite",
      "helpful_votes": 0,
      "publication_date": 20200422
    },
    {
      "title": "Ohhh Fish",
      "text": "My 1 year old little guy loves this table. It’s the perfect height and sturdy. We purchased this for his birthday party and all the kids enjoyed playing in it.",
      "rating": 5.0,
      "verified": true,
      "author": "Jenny Loves 2 Shop",
      "helpful_votes": 0,
      "publication_date": 20191029
    },
    {
      "title": "My baby loves it",
      "text": "My baby loves it. Taking one star for the price but otherwise a fun toy for hot summer days",
      "rating": 4.0,
      "verified": true,
      "author": "Just Ewa",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "Works great",
      "text": "You need to use pliers to pull the plug all the way thru. Bare hands won’t work because you’ll never get the grip you need. Plug works great. No leaks at all.",
      "rating": 4.0,
      "verified": true,
      "author": "Kaylyn C.",
      "helpful_votes": 0,
      "publication_date": 20190331
    },
    {
      "title": "Easy Assembly",
      "text": "This little splash pool table was for my grand daughter's 2nd birthday and she absolutely loves it and plays with it every day out in her yard. A really good buy and value for money.",
      "rating": 5.0,
      "verified": true,
      "author": "Valerie",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "Worth every penny",
      "text": "I live in sunny FL and we don't have a pool for my sun. I got this for him for Christmas and he loves it!!",
      "rating": 5.0,
      "verified": true,
      "author": "MundayS",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Product is okay",
      "text": "I was opening the box the day before Easter, to find a piece was missing that was a pretty important piece in order to make the bucket dump water. So now we don't even use that which is disappointing. I've tried to rig it but it doesnt really work because the holes are funky. Other then that, my daughter seems to like it.",
      "rating": 3.0,
      "verified": true,
      "author": "Felicia L Jones",
      "helpful_votes": 0,
      "publication_date": 20200607
    },
    {
      "title": "We love it",
      "text": "Purchased this for our child and we couldn't be happier. Easy to put together, and comes with great toys. The lily pad doesn't spin with the water from the stream, but manually spins with ease. Our table does not leak from the plug, though water does seem to leak when it sneaks under the lily pad (very minimal water). Super easy to clean. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie Sapone",
      "helpful_votes": 0,
      "publication_date": 20200729
    },
    {
      "title": "Lots of fun",
      "text": "I sent this to my nephew for his 1 year old birthday. It was a great gift for him. Easy to set up and the price is great.",
      "rating": 5.0,
      "verified": true,
      "author": "Hannah K. McChesney",
      "helpful_votes": 0,
      "publication_date": 20190719
    },
    {
      "title": "Grandkids Love This!",
      "text": "Have to dump it out every evening otherwise the kids run out to play with it first thing in the morning. Perfect Summer toy!",
      "rating": 5.0,
      "verified": true,
      "author": "Freda A. Simmons",
      "helpful_votes": 0,
      "publication_date": 20200729
    },
    {
      "title": "Toddler loves it",
      "text": "Little challenging to clean. The piece that is meant to pour water to make the middle spin does not work.",
      "rating": 5.0,
      "verified": true,
      "author": "Saydee James",
      "helpful_votes": 0,
      "publication_date": 20190611
    },
    {
      "title": "Love it!",
      "text": "My son LOVES this table! Perfect size and all the different activities keep him busy. Every day this summer it was played with. My dog also loves this and thinks it's her personal water dish. Haha",
      "rating": 5.0,
      "verified": true,
      "author": "Lexa D. Jones",
      "helpful_votes": 0,
      "publication_date": 20181028
    },
    {
      "title": "Perfect for young children",
      "text": "Love this for keeping the kids entertained, my 1-year-old in my 4-year-old love it together.",
      "rating": 5.0,
      "verified": true,
      "author": "Gina",
      "helpful_votes": 0,
      "publication_date": 20200517
    },
    {
      "title": "Kids will love it",
      "text": "Big time entertainment for toddlers. Mine literally can spend a cpl hours playing with it...",
      "rating": 5.0,
      "verified": true,
      "author": "smag",
      "helpful_votes": 0,
      "publication_date": 20200819
    },
    {
      "title": "love this water table and my 18mo loves it even ...",
      "text": "love this water table and my 18mo loves it even more!!! the fishing pole is super cute with it's real action sound when you crank the reel. And he LOVES the launcher that flings the toys into the pool!",
      "rating": 5.0,
      "verified": true,
      "author": "hlsvajdlenka",
      "helpful_votes": 0,
      "publication_date": 20170501
    },
    {
      "title": "I would suggest inspecting all items upon receipt and don’t ship as a gift!",
      "text": "We purchased this for our son as an Easter gift. I went to put the table together and two of the legs are missing leaving this item useless. Unfortunately, I waited until the day of Easter to unbox and discover this.",
      "rating": 1.0,
      "verified": true,
      "author": "Melanie",
      "helpful_votes": 0,
      "publication_date": 20190421
    },
    {
      "title": "Perfect for a toddler. I am sure as she gets older she will continue to enjoy it",
      "text": "This is perfect for my 16 month old granddaughter. Now that the warm weather is her she plays all the time with her water babies",
      "rating": 5.0,
      "verified": true,
      "author": "Sherry Lambert",
      "helpful_votes": 0,
      "publication_date": 20190528
    },
    {
      "title": "but will probably fill it with beans or rice for the winter for indoor fun during the cooler weather",
      "text": "Our granddaughter really enjoys playing with this. Goes together in minutes and has a plug for draining. It's a bit small, but will probably fill it with beans or rice for the winter for indoor fun during the cooler weather.",
      "rating": 5.0,
      "verified": true,
      "author": "DM",
      "helpful_votes": 0,
      "publication_date": 20170929
    },
    {
      "title": "Well worth it!",
      "text": "Purchased this for my two year old granddaughter. She LOVES it. Highly recommend. Remember to purchase a tarp for when not in use though!",
      "rating": 5.0,
      "verified": true,
      "author": "Staci Hedge",
      "helpful_votes": 0,
      "publication_date": 20200220
    },
    {
      "title": "Poorly made",
      "text": "The stopper isn’t snug so the water flows right out. The spinner doesn’t spin with the water. You have to do it by hand. It’s not worth the money. Highly disappointed",
      "rating": 2.0,
      "verified": true,
      "author": "Ally",
      "helpful_votes": 0,
      "publication_date": 20200607
    },
    {
      "title": "It doesn't do anything us states it does.",
      "text": "It's not bad..but the Lilly pad is suppose to spin, it doesn't. Really hard for a 2 year old. But we added more things to it. I waited a month to get this and I'm kinda upset about it. Wasn't expecting to have it badly do anything at all. But easy to assemble price was pretty high..steadiness is good and ya its easy to clean.",
      "rating": 3.0,
      "verified": true,
      "author": "Kelli",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "Great water table",
      "text": "My child loves this table. It is played with daily and is not showing wear. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Shopper14",
      "helpful_votes": 0,
      "publication_date": 20200730
    },
    {
      "title": "not bad",
      "text": "it’s a pain to clean but it’s manageable my God Daughter loves it alittle smaller than expected tho",
      "rating": 5.0,
      "verified": true,
      "author": "Christina",
      "helpful_votes": 0,
      "publication_date": 20200525
    },
    {
      "title": "Fun in the Sun splish splash",
      "text": "I bought this for my grandson he loved it especially because of the hot weather.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathryn F. O'Such",
      "helpful_votes": 0,
      "publication_date": 20200812
    },
    {
      "title": "Grandson loves this water tabke",
      "text": "Brought this table for our grandson when we came to visit. The only problem was the stopper was a little hard to put in but other than that it’s great and he just loves it",
      "rating": 5.0,
      "verified": true,
      "author": "emptynester",
      "helpful_votes": 0,
      "publication_date": 20190726
    },
    {
      "title": "Toddler approved",
      "text": "Bought this for our toddler son, he loves it and spends a good amount of time playing with it. Easy to set up and clean, we dump it out and spray it down every time he is done playing with it.",
      "rating": 5.0,
      "verified": true,
      "author": "BRL82",
      "helpful_votes": 0,
      "publication_date": 20160725
    },
    {
      "title": "Fun for everyone!",
      "text": "This is a nice simple water table and my toddler daughter just loves it. The fishing pole feature is lots of fun and it is even fun for us adults to play with her as well. Price was reasonable compared to some of the other tables out there.",
      "rating": 5.0,
      "verified": true,
      "author": "MelindaTop Contributor: Coloring",
      "helpful_votes": 3,
      "publication_date": 20160527
    }
  ],
  "product_meta": {
    "title": "Little Tikes Fish 'n Splash Water Table",
    "description": "With the Little Tikes Fish n Splash Water Table, little fisherman can catch and count colorful little pond swimmers right in their own backyard! Plus there's lots of fill, pour and splash extras to make water fun.so much fun! Fill the fish bowl with water and watch it come splashing down, or try to launch your critters across the pond and onto the lily pad. Includes 10 accessory pieces for water play! Features Catch, collect and count your fish before releasing them with a splash! Fill the fishbowl until it tips over and splashes down in a wave! Use the launcher to fling the critters onto the spinning lily pad in the center of the table! Includes fishing pole, 5 floating critters, water cup and fishing net Holds up to 50 lbs. of sand Ages: 2+ years.\n\nBRAND STORY\nBy Little Tikes",
    "rating": 4.7,
    "feature_bullets": [
      "Fun, durable water table with fishing game and counting play",
      "Catch, collect and count your fish before releasing them with a splash",
      "Fill the fishbowl until it tips over and splashes down in a wave",
      "Use the launcher to fling the critters onto the spinning lily pad in the center of the table",
      "Includes fishing pole, 5 floating critters, water cup and fishing net"
    ],
    "specifications": {
      "Product Dimensions": "31.5 x 29 x 29 inches",
      "Item Weight": "9.04 pounds",
      "Domestic Shipping": "Item can be shipped within U.S.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S. Learn More",
      "ASIN": "B00QGSMK8K",
      "Item model number": "637803M",
      "Manufacturer recommended age": "24 months - 5 years",
      "Best Sellers Rank": "#2,820 in Toys & Games",
      "Customer Reviews": "4.7 out of 5 stars1,677 ratings4.7 out of 5 stars",
      "Is Discontinued By Manufacturer": "No",
      "Release date": "January 30, 2015",
      "Mfg Recommended age": "24 months - 5 years",
      "Manufacturer": "Little Tikes"
    },
    "categories": [
      "Toys & Games",
      "Sports & Outdoor Play",
      "Sand & Water Tables"
    ],
    "price": 44.99
  }
}