{
  "website_summaries": [
    {
      "verdict": "If you're looking for a Hamilton Beach toaster oven that has more than just the basics but is still easy to use, this is the one for you.",
      "pros": [
        "Includes bake, broil, and toast functions",
        "Convection setting circulates air for faster cooking",
        "Fits six slices of toast or a 12-inch pizza",
        "Roll-top door gives easy access to food without taking up extra counter space"
      ],
      "cons": [
        "The convention fan can be a little noisy and the outside heats up a fair amount"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Glass exploded very dangerous. No response from Hamilton or seller",
      "text": "Bought product March 5th . Maybe used 4 times and today glass exploded very disappointed. Nobody returned calls from Hamilton Beach, nothing. On hold for 4 hrs, and was instructed to leave a message. Finally threw defective product out. Have photos of proof too. Never again",
      "rating": 1.0,
      "verified": true,
      "author": "julie52",
      "helpful_votes": 575,
      "publication_date": 20190417
    },
    {
      "title": "Exploding glass, beware!",
      "text": "While using the bake option for less than 15 minutes at 425, the glass door exploded. We're now outside the return window, as we've had it for about 6 weeks. Glass flew and a small bit cut my eyebrow. Very unhappy with this product.",
      "rating": 1.0,
      "verified": true,
      "author": "Mandee",
      "helpful_votes": 356,
      "publication_date": 20190705
    },
    {
      "title": "Convenient door idea",
      "text": "One good idea doesn't make a solution. This item is made very cheaply. The exterior overheats quickly and creates a fire safety hazard.",
      "rating": 1.0,
      "verified": true,
      "author": "Romuk69",
      "helpful_votes": 212,
      "publication_date": 20181210
    },
    {
      "title": "Quicker Toast Than Earlier Models",
      "text": "Oven showed up on Veterans Day, replacing an earlier HB model we'd used for several years. Ran a slice of toast immediately, just to make sure it was in working order. Am impressed with the speed of the toaster - a genuine speedster next to our earlier oven. Only odd thing is the instruction booklet, which says to unplug the oven after using. Huh? Unplug an A/C device? Bet that was written by lawyers, not engineers. :) Anyhow . . . looking forward to long use, and easier cleaning.",
      "rating": 5.0,
      "verified": true,
      "author": "Art H.",
      "helpful_votes": 74,
      "publication_date": 20181112
    },
    {
      "title": "Almost burned down my house!!",
      "text": "The exterior of this oven was very very hot, it actually burnt my hand and the cabinet wall next to the oven! How this item is actually being sold is beyond me. As mentioned in other reviews, it is clearly a fire hazard. Why can't I give negative stars?!!",
      "rating": 1.0,
      "verified": true,
      "author": "Larry Collins",
      "helpful_votes": 41,
      "publication_date": 20190326
    },
    {
      "title": "Love this toaster oven",
      "text": "Works great! Heats up fast, cools off fast. It's so nice not to have to wait for my big oven to preheat! I've made pizza, egg bake, meatballs, cookies and bagels in it so far. Everything turned out great! I like that it bows out in the back to fit a 12\" pizza. It came with a small baking sheet, but I wanted one a little bigger for baking cookies and found these on Amazon - \"12\" x 10 Big Size Rykey Stainless Steel Toaster Oven Pan Tray\". It just fits in the toaster oven without touching the sides. I also love that the door slides open over the top so that you can still use your counter space.",
      "rating": 5.0,
      "verified": true,
      "author": "tigger2lou",
      "helpful_votes": 37,
      "publication_date": 20190108
    },
    {
      "title": "Easy Reach But Poor Perfomance",
      "text": "It was time to replace our trusty Black & Decker toaster oven. It still works but it became so gunky inside, the door won't fully close. The Easy Reach seemed to be a good replacement for us based on all the positive reviews and it's ease of cleaning. I don't know, maybe we got a lemon. The convection fan was way too loud and it took way too long to warm up. When it did warm up, it struggled to maintain a constant temperature. We returned it and will look for something better.",
      "rating": 1.0,
      "verified": true,
      "author": "Kenneth Burritt",
      "helpful_votes": 93,
      "publication_date": 20170314
    },
    {
      "title": "Yes yes yes! It's a big boi!",
      "text": "I use this for baking my clay. My new monster toaster oven...heats evenly, you can get your whole arm in to retrieve pieces , slide up door. ! This thing is a beast!!! Theres a stupid normal toaster in the picture under the desk for reference. Buy it <3",
      "rating": 5.0,
      "verified": true,
      "author": "ashley",
      "helpful_votes": 31,
      "publication_date": 20190125
    },
    {
      "title": "EXTREMELY DANGEROUS",
      "text": "This toaster oven worked beautifully for the first three weeks, then while I was heating up a pizza THE GLASS EXPLODED. Do not buy this product it is a huge safety hazard.",
      "rating": 1.0,
      "verified": true,
      "author": "andrew p mcallister",
      "helpful_votes": 419,
      "publication_date": 20170209
    },
    {
      "title": "Terrible product",
      "text": "This is a huge disappointment. Oven does not get hot enough to toast bread or make french fries. Basically useless. Going to have to see what options are for warranty claim or boat anchor. Update 3-2019 - Warranty response from Hamilton Beach was quick and efficient and ended with them sending me a new oven which arrived in less than 2 weeks from my initial contact with them. New one seems to work much better, so it seems the first one was just defective in the thermostat. Overall now am satisfied and am raising from one star to 4.",
      "rating": 4.0,
      "verified": true,
      "author": "Paul Bamazon",
      "helpful_votes": 22,
      "publication_date": 20190226
    },
    {
      "title": "Door does not come off.",
      "text": "I've had this just a couple weeks and is taking a little time to adjust for the cooking time and temperature since I've never had a toaster oven before. So far I'm really liking it and enjoying how I don't have to wait so long for a full size oven to preheat. I took away one star because the description is misleading. It says that the roll top door comes off for cleaning and that's not true on this model, which was one of the features I counted on in making my decision. I contacted Hamilton Beach and they verified the door does not come off on this model.",
      "rating": 4.0,
      "verified": true,
      "author": "Barbara",
      "helpful_votes": 24,
      "publication_date": 20181122
    },
    {
      "title": "Loud",
      "text": "Something is wrong with the fan, it's super loud and I didn't notice it until it tried working. I just assumed the fan was on before until I heard the noise.",
      "rating": 1.0,
      "verified": true,
      "author": "B Ham",
      "helpful_votes": 33,
      "publication_date": 20170601
    },
    {
      "title": "Outside of Unit Too Hot!",
      "text": "The outside of unit gets very hot and is a burn and fire hazard. Also, the construction is a bit flimsy. Be careful when using. Keep away from other things on counter and make sure electrical cord isn't resting against the unit while in use, or it might become an electrical hazard too.",
      "rating": 1.0,
      "verified": true,
      "author": "G. Rice",
      "helpful_votes": 18,
      "publication_date": 20190708
    },
    {
      "title": "The sound is creepy.",
      "text": "I’ve used this toaster oven for two weeks. It was good. I used it for my breakfast and roasting salmon sometimes. It worked fine. But today, when I wanted to grill the steak and put it on convention mode. It suddenly had really loud noise. I didn’t feel safe when using it.",
      "rating": 1.0,
      "verified": true,
      "author": "Molly",
      "helpful_votes": 16,
      "publication_date": 20190620
    },
    {
      "title": "Just what i needed",
      "text": "Use toaster ovens every day from toast to baking & heating up meals. Bought a fancy $200 fancy air fryer one & it cooked horribly unevenly, barely toasted, etc. Returned it & bought this one at a fraction of the price. I've used all the settings for baking, roasting, broiling & toasting for 4 or 5 months now & everything has come out really well. Like to hear the timer ticking because i get easily distracted & it reminds me something is in there :-). Definitely recommend for basic every day use. Hopefully it'll last!",
      "rating": 4.0,
      "verified": true,
      "author": "P. Z.",
      "helpful_votes": 14,
      "publication_date": 20190402
    },
    {
      "title": "Don’t Buy!  It’s Absolute Garbage!!!",
      "text": "This has got to be the worst toaster oven you can buy. The exterior gets so hot it will burn anything near it including you! The timer is made so that if you go a little past off it stays on. Bad design, awful controls and a definite fire hazard. Don’t waste your money on this garbage!",
      "rating": 1.0,
      "verified": true,
      "author": "JC",
      "helpful_votes": 13,
      "publication_date": 20190117
    },
    {
      "title": "Extremely poor insulation and poor sealing of door",
      "text": "Heat pours off this thing. I can't imagine using it during the summertime. Just walking past it you get a blast of heat. The roll-top door is a nice idea, but it seals poorly, and that's part of why -- but that's not all of it, because heat radiates off the rest of it too, far more than my previous toaster oven. For me, that makes it unacceptable, and I sent it back.",
      "rating": 1.0,
      "verified": true,
      "author": "Hubby John",
      "helpful_votes": 8,
      "publication_date": 20200402
    },
    {
      "title": "Burns way hotter in the back",
      "text": "I looked for months for a toaster oven and finally settled on this one. More of I was getting sick of looking and needing one than having decided this one was perfect. Well, it's pretty good overall and I like the look of it. The front roll-up door is also great and it's a good size. My one complaint is that it burns the back of our food all the time and we have to remember to flip them around halfway through. Otherwise, your toast or food won't be toasted at the front and will be burnt in the back. If you can get used to this, it's otherwise a good product",
      "rating": 4.0,
      "verified": true,
      "author": "Tblood",
      "helpful_votes": 10,
      "publication_date": 20190319
    },
    {
      "title": "I haven't used my oven since getting this.",
      "text": "This is a great toaster oven. So far I have made toast, pizza, casseroles, fish in parchment, and loaf pan cakes along with reheating. I have never had one with the convection feature before and it it quite handy for cakes and pizzas and anything you want crispy. I am very pleased with this.",
      "rating": 5.0,
      "verified": true,
      "author": "susan",
      "helpful_votes": 12,
      "publication_date": 20170411
    },
    {
      "title": "Good purchase",
      "text": "So far so good. Excellent value for the price. I did a TON of research and was considering Breville toaster ovens, but I ended up on this one because the extra cost didn't seem justified for the Breville and other top models. So far I seem validated in my purchase. This thing cooks beautifully and fast if I use the convection setting. It makes bacon to perfection! (350f at about 15 mins on Bake setting.) Bacon grease does tend to splatter on window, and it isn't easy to clean, as others have said. But also not super difficult.",
      "rating": 5.0,
      "verified": true,
      "author": "an.honest.review",
      "helpful_votes": 9,
      "publication_date": 20170403
    },
    {
      "title": "Best small toaster/convection oven for the price.",
      "text": "I was looking for a new convection/toaster oven and saw a review of this in Bon Appetit rating it the best in the ones they tested. It is a great price, small and the convection oven feature cooked a baked potato in 30 minutes. Well worth the price for a single person or small family.",
      "rating": 5.0,
      "verified": true,
      "author": "Cathy J. Woolms",
      "helpful_votes": 67,
      "publication_date": 20160125
    },
    {
      "title": "Even cooking temperature",
      "text": "I love the size of this oven. I previously had a Black and Decker which didn’t toast evenly. It was difficult cleaning the inside as everything fell into the door frame. I love the way the door opens up on this oven. My toast and bagels come out perfect every time. Baking and broiling are great too. I don’t think the top gets any hotter than other ovens I’ve had. Living alone I use this more than my oven now. Great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Jane Stokes",
      "helpful_votes": 10,
      "publication_date": 20190208
    },
    {
      "title": "Died after 4 months of light use",
      "text": "We don't cook often and thought this toaster oven might inspire us to do a little more of that. As it happens, the only thing we ended up using it for was to toast bread about 2-3 times a week (1-2 pieces of toast at a time). While toasting a slice of bread recently (on \"light\" setting), the toaster burnt it. The toast was almost entirely black and our kitchen was filled with smoke (a horrible chemical kind of burnt smell). After letting the air clear a bit, I tried to toast another piece of bread but the toaster would not turn on. I unplugged it and tried again. Nada. The toaster oven was... well, toast.",
      "rating": 1.0,
      "verified": true,
      "author": "A Dog Owns My Heart 💜",
      "helpful_votes": 9,
      "publication_date": 20181222
    },
    {
      "title": "Compact with lifting lid!",
      "text": "Great little toaster oven! The lifting lid is a nice touch! It toasts bread perfectly and is easy to use! The only bad thing I can say is.. after the first time using it the pan turned brown and now has many marks and spots that SOS pad will not even remove.",
      "rating": 4.0,
      "verified": true,
      "author": "Jamie E.",
      "helpful_votes": 10,
      "publication_date": 20190310
    },
    {
      "title": "Curved Back",
      "text": "This is a great little oven. Bakes evenly and quickly using the convection setting. The only downside is that the back is curved outward to give more internal space but that results in needing more external space.",
      "rating": 4.0,
      "verified": true,
      "author": "Gail",
      "helpful_votes": 9,
      "publication_date": 20190310
    },
    {
      "title": "After 3 months of daily use the official verdict is that this toaster sucks",
      "text": "After 3 months of daily use the official verdict is that this toaster sucks. It never reaches the correct tempuature at all and there is a big difference in heating between the front and back of the toaster. I wish I didn't wait three months so I could have gotten my money back.",
      "rating": 1.0,
      "verified": true,
      "author": "B.",
      "helpful_votes": 7,
      "publication_date": 20190909
    },
    {
      "title": "Glad I got it; surprisingly useful",
      "text": "For years I've had nothing but dual-slot toasters, but it's hard to re-heat a biscuit in a toaster, so I gave in to gadget acquisition and bought this. It's a serviceable toaster, but where it really shines is in doing small jobs the toaster can't, such as reheating a biscuit or heating up my 9-inch diameter muffuletta bread and a dozen other things. We don't cook chicken or roasts in it, but you certainly could. It ain't small -- it takes up way more counter space than our old toaster. But life's a tradeoff, and this is a good one.",
      "rating": 5.0,
      "verified": true,
      "author": "Jake from DC",
      "helpful_votes": 4,
      "publication_date": 20200513
    },
    {
      "title": "gets too hot on the outside",
      "text": "I purchased this with the intention of cutting back on using the oven in my stove. After one use -- I decided it was NOT safe to use as it gets excessively hot on the exterior. I have only used it twice since I purchased it and plan on donating it to Goodwill. Really disappointed! I thought I had thoroughly researched it and compared it to other Toaster Ovens on Amazon's website, but this one issue makes it unsafe for me and mine.",
      "rating": 3.0,
      "verified": true,
      "author": "Carol Ann MacEva",
      "helpful_votes": 6,
      "publication_date": 20190723
    },
    {
      "title": "Best toaster oven we've had.",
      "text": "When our toaster oven finally gave out, I wasn't in a rush to buy another one. I was very particular. I researched for months and decided this would work the best for our needs. We love that it opens upward instead of downward. I have no problems cleaning the door when it's open. I was also able to get rid of our toaster because this does such a great job. Why have both taking up counter space. It cooks small meals very well. Our kids use it to heat up chicken nuggets. It fits a medium size pizza for the supermarket without a problem. I would definitely buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "L Silva",
      "helpful_votes": 4,
      "publication_date": 20180112
    },
    {
      "title": "Great for teaching younger children to cook.",
      "text": "I have a son with Tourette's syndrome. Part of his daily activities is learning to cook for himself. We had several burns when he wanted to use the oven. This was the perfect solution for us. The roll up door not only saves space but moves the hot door away from hands and forearms. It has made it possible for my son to cook practically everything he wants. It's impossible for me to keep frozen pizzas in the house now. The convection feature is wonderful! It's pretty much an air fryer, cooks things perfectly in a relatively short time. This gets used more than my microwave now. Highly recommend. It has been used constantly and is still going strong.",
      "rating": 5.0,
      "verified": true,
      "author": "LessThanJess",
      "helpful_votes": 3,
      "publication_date": 20191031
    },
    {
      "title": "Use it almost every day for over a year now.",
      "text": "The door opening up instead of out is a big plus in our little kitchen. Heats up quickly, works like a charm. LARGE interior. I cook in this almost every day and have almost completely stopped using the oven at all. Favorite toaster oven I've ever had. :-)",
      "rating": 5.0,
      "verified": true,
      "author": "L. T. Durham",
      "helpful_votes": 5,
      "publication_date": 20200825
    },
    {
      "title": "A great little oven.",
      "text": "This is the perfect size for 2 or three people. I hated to turn on the big oven just to cook a few pieces of food. This little oven allows me to get the baking qualities of a big oven with a smaller electrical foot print. I like the convection feature. So much better than microwaving items that really should be baked.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Johnstone",
      "helpful_votes": 13,
      "publication_date": 20170313
    },
    {
      "title": "Works well; drip pan stains easily",
      "text": "Nice oven, easy to use, works well. It \"cooks\" fairly evenly with convection or without. It is deep, and takes up some space, so map it out on your counter before purchase. That said, we would buy it again. The only drawback for us is the drip pan which stains easily and I have not found a method to remove the stains. We've used a variety of cleaners, soaps, and sponge-tools, and our drip pan remains stained. Had we known the potential, we would have covered it before with foil or a modified oven liner prior to use.",
      "rating": 4.0,
      "verified": true,
      "author": "Silent Witness",
      "helpful_votes": 8,
      "publication_date": 20170516
    },
    {
      "title": "nonetheless does a great job and it actually toasts both sides of the ...",
      "text": "This oven, a little smaller than I expected, nonetheless does a great job and it actually toasts both sides of the bread! That is rare in a toaster oven in my humble opinion. Bakes and broils perfectly too. Highly recommend this gem. Also love the way the door goes up even though it's a little harder to clean the inside of it but I've found that it really doesn't get that dirty.",
      "rating": 5.0,
      "verified": true,
      "author": "Wife of 1, Mom of 2",
      "helpful_votes": 9,
      "publication_date": 20170304
    },
    {
      "title": "Great choice",
      "text": "I researched toaster ovens for a couple of months before deciding on this one. I can say after only a couple of days of using it, it was a good choice. The thing I like best is it makes great toast! My B&D burned the bottom and barely toasted the top but this one toasts beautifully. I also like the design of the door, very convenient. I don't know that I'll be using my \"real\" oven much now.",
      "rating": 5.0,
      "verified": true,
      "author": "Pat",
      "helpful_votes": 8,
      "publication_date": 20170304
    },
    {
      "title": "Great toaster, broiler & baker",
      "text": "Haven't used a small electric oven in some time. It really would have received 5 stars except for 2 issues which I can live with, but must point out to others. The Convection feature is just not usable due to Noise. Great toaster, broiler & baker, with Automatic Shut Off a feature not always found on these units. Very disappointed with quality of 'bake pan' which became discolored and impossible to keep clean looking. Can't use it without first covering with aluminum foil.",
      "rating": 3.0,
      "verified": true,
      "author": "West Palm Beach Joe",
      "helpful_votes": 10,
      "publication_date": 20170914
    },
    {
      "title": "One Star",
      "text": "Turns itself on! No wonder the instructions say to keep it unplugged.",
      "rating": 1.0,
      "verified": true,
      "author": "Terence M. Oconnor Sr.",
      "helpful_votes": 9,
      "publication_date": 20180114
    },
    {
      "title": "Fantastic!!",
      "text": "I love this toaster oven!! So far I have used it for cookies, pizza, biscuits, and cinnamon rolls!! No problems at all. I especially love it since I am now able to bake biscuits in the middle of our Texas summer without making the house hot!! And since the oven door opens upwards, I will have one less thing to clean. Plus the removable spill tray on the bottom of the toaster oven is a snap to remove and wash! This toaster oven is the best one I have ever owned. It is worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "barb",
      "helpful_votes": 7,
      "publication_date": 20180705
    },
    {
      "title": "Well designed and a good size for two people.",
      "text": "The real test for a product like this is how it lasts, I guess, so this is a \"so far so good\" review. It is a good size, takes six slices of toast. We use it mostly for toast, but it does a good job as an oven for small items. The way the oven door opens makes it easier to items in and out. The only negative observation I would make is that the little oven tray that comes with it is made of such thin metal that it buckles with the heat of the oven.",
      "rating": 5.0,
      "verified": true,
      "author": "Philip T.",
      "helpful_votes": 3,
      "publication_date": 20180805
    },
    {
      "title": "Perfect for Daily Cooking",
      "text": "I love this little oven. I especially like the roll top door. It's so perfect and does a great job. I only cook for myself and heating up the big oven is ridiculous. So, I gave this little oven a try and I love it. I use it every single day. From toast to chicken to pork chops, it's become my go to appliance. I can cook just enough meat for a single meal and not have to waste electricity or heat up my kitchen with the big oven. It's just perfect. Easy to clean and does a great job. I've had it for about 4 months and it's just perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Solitary Dancer",
      "helpful_votes": 3,
      "publication_date": 20190708
    },
    {
      "title": "Pros but with a Con",
      "text": "Overall a nice oven except that it will not bake or convect over 350 degrees. It's not satisfactory for pizza if you need over 350F to cook, so pizza is basically out of the question unless you are re-warming. The only way it will reach 450F is in broil mode. Keep that in mind when you purchase and you wont be disappointed. As other reviewers said, the aluminum pan warps drastically when hot so do like I did and get a stainless pan at the same time.",
      "rating": 3.0,
      "verified": true,
      "author": "JSP",
      "helpful_votes": 3,
      "publication_date": 20191028
    },
    {
      "title": "Fan is loud after a few uses.  Others have commented about this.",
      "text": "Bought this for a Christmas present. Used it 4 or 5 times. Fan got very loud, others have comment about this. It is now March 5, 2018. Cannot return it to Amazon. This oven has a one year warranty; however, I am responsible for paying shipment back to the manufacturer. It worked wonderful, and was very pleased with it up until now.",
      "rating": 1.0,
      "verified": true,
      "author": "mikeeis",
      "helpful_votes": 5,
      "publication_date": 20180305
    },
    {
      "title": "Great value and product",
      "text": "I wasn't sure about this product with some of the reviews, but I have to say I am impressed. It has great quality as far as function and ease of cleaning. It cooks things perfectly, but doesn't have that nasty habit microwaves have of burning specific spots on food while leaving other spots raw. The convection setting is my favorite function. I'm hoping it lasts a good long while before I need a replacement.",
      "rating": 5.0,
      "verified": true,
      "author": "Lycantis",
      "helpful_votes": 2,
      "publication_date": 20200822
    },
    {
      "title": "Awesome toaster!! Highly recommend!!",
      "text": "So happy with this toaster! Heats quickly, and while it has a more compact profile it holds a lot! And absolutely love how the door opens up so that you never burn your wrist on it! Best design ever for a toaster. Really happy with it overall!!",
      "rating": 5.0,
      "verified": true,
      "author": "Ben",
      "helpful_votes": 3,
      "publication_date": 20200824
    },
    {
      "title": "I love this oven..",
      "text": "I bought this oven because I like to make pizzas both homemade and store bought. It is perfect with the expansion in the back to fit a round pizza in a rectangular oven. I also love that the oven door swings up and away instead of down. My cabinets are lower than most and it opens easily with plenty of room. Only complaint is that it is somewhat difficult to clean the inside of the glass door. If you open the door completely and wait for it to cool down you can fit your hand up inside . Not \"Mission Impossible\" but takes a bit of hand/wrist contortion to clean properly..All in all I love it..",
      "rating": 4.0,
      "verified": true,
      "author": "Sandy Chase",
      "helpful_votes": 2,
      "publication_date": 20181224
    },
    {
      "title": "Works Great",
      "text": "I haven’t used it personally yet, my wife uses it everyday. She says the outside does get hot to the touch, but cools down quickly, one just has to remember that in using it. She has used it for everything from pizza to taquitos, pot pies, turnovers, and her morning toast. She’s never had a problem with any of the controls, and the temperature settings are spot on. She loves the upswing door, and the unit size is perfect for the counter. For now, we use aluminum foil to keep the inside a bit cleaner, so time will tell on durability of the tray and inside finishes. So far, we are extremely happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Glenn",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "Does not toast evenly.",
      "text": "Does not toast evenly. Back of toaster toasts twice as fast. Wish I could return",
      "rating": 2.0,
      "verified": true,
      "author": "A. Bradley",
      "helpful_votes": 25,
      "publication_date": 20170727
    },
    {
      "title": "Great product fits in our RV perfect.",
      "text": "My husband and I recently moved from a house to an RV. I didn’t like having to light the pilot on the oven so purchased this toaster oven. Wow! Such a great oven! I really like the performance of this product. I really like the fact that I can line the pan with foil, cook my bacon and cleanup is so simple. I have baked several dishes and loved them all. Glad I purchased this oven.",
      "rating": 5.0,
      "verified": true,
      "author": "Harold Watkins",
      "helpful_votes": 4,
      "publication_date": 20190316
    },
    {
      "title": "Quality product with a good name name",
      "text": "This was a replacement for my old Hamilton I had for years. When it arrived and upon opening I found it to be packed quite well with everything included as advertised. After reading the manual I baked my first meal with it that night and was surprised how evenly it cooked the meat and no first time odd smells like the old ones. The next morning I toasted some bread and also was amazed at how evenly it toasted each side. Gotta give Hamilton credit for the quality products they produce.",
      "rating": 5.0,
      "verified": true,
      "author": "Finn",
      "helpful_votes": 3,
      "publication_date": 20190419
    },
    {
      "title": "Heating element broke after 4 months",
      "text": "This toaster oven worked great for 4 months, and then the heating element died. We had bought an extended warranty, but since we only had the oven 4 months, the manufacturer’s warranty applied, which meant we’d have to pay shipping charges to return the broken one and get a new one. That would equal almost as much as we paid for the toaster oven to begin with. That’s $60 bucks in the trash. I’m buying my next toaster oven in store so I don’t have to mess with shipping charges if it breaks again",
      "rating": 1.0,
      "verified": true,
      "author": "Joy in Alaska",
      "helpful_votes": 4,
      "publication_date": 20190825
    },
    {
      "title": "To be fair",
      "text": "Received my Toaster Oven in March, really liked it, but the last few times I went to bake it does not hold a temp beyond 350°. Talked with Hamilton Beach and they will replace it but I have to pay shipping, really, I've only had this for a month, not nice, and would not recommend buying Hamilton products, not fair.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20180424
    },
    {
      "title": "Love this to make lunches!",
      "text": "Love this! It’s been a life saver especially when I want to make something small and I don’t want to heat up the house. It’s super easy to use, and comes with a small cookie sheet. I absolutely recommend it!",
      "rating": 5.0,
      "verified": true,
      "author": "BeccaBills",
      "helpful_votes": 3,
      "publication_date": 20200424
    },
    {
      "title": "I use it to cook everything",
      "text": "This is the most used item in my kitchen. Cooks perfectly well. I make pizzas, chicken, bread, and much more. I love it that it opens up and saves a los of space in my opinion. The only thing I would love it to have is another rack. It comes with one big enough for pizza but it would have been nice to have an extra rack to warm more things at a time. Other than that I totally recommend this item",
      "rating": 5.0,
      "verified": true,
      "author": "YN",
      "helpful_votes": 2,
      "publication_date": 20200604
    },
    {
      "title": "Pass on this.",
      "text": "After having it for a few months, I regret buying. This thing is under powered. It takes 25 minutes just to start making tater tots crunchy. Don’t disrespect the tots. The convection function does little to nothing other than make noise. Now I wish the old Black and Decker didn’t up and die. :(",
      "rating": 2.0,
      "verified": true,
      "author": "JE",
      "helpful_votes": 4,
      "publication_date": 20180825
    },
    {
      "title": "What a wonderful little oven",
      "text": "What a wonderful little oven. I was using my regular oven frequently to make small things, and it seemed like such a waste of power. A single stuffed chicken breast, for example. It works great, saves energy, and I really like how the door slides up, it makes the food easier to get at and takes less space on the counter. Well made, nice looking. Sometimes the little pan that came with it pops and warps when it gets hot, but it pops back when it cools off. I will get a set of toasted oven pans for it, definitely. Very happy with purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "LadyPandi",
      "helpful_votes": 8,
      "publication_date": 20161204
    },
    {
      "title": "Poor quality product -",
      "text": "Nice design, poor product. Completely inaccurate and inconsistent temperature. No way to know what it will reach without using the oven thermometer and playing with the dial.",
      "rating": 1.0,
      "verified": true,
      "author": "readsalot",
      "helpful_votes": 23,
      "publication_date": 20170222
    },
    {
      "title": "Little by little getting rid of my natural gas usage.",
      "text": "What a great little unit. It seriously bakes and toasts better than my gas powered oven. I've had some difficulty getting things to bake properly in my gas oven especially frozen fish. Wow, very impressed with food I've cooked so far in this electric toaster oven. 5 stars!",
      "rating": 5.0,
      "verified": true,
      "author": "JR",
      "helpful_votes": 5,
      "publication_date": 20190218
    },
    {
      "title": "temperature not accurate",
      "text": "Temperature not accurate. Never got to 450. Only 30 minute timer.",
      "rating": 3.0,
      "verified": true,
      "author": "Annette Broyles",
      "helpful_votes": 8,
      "publication_date": 20190201
    },
    {
      "title": "Can't replace an oven for some things, but overall an excellent toaster",
      "text": "Works very well for toast and other simple things. I tried to cook one frozen dinner in it that I would normally cook in the oven, and for some reason the frozen dinner container almost melted and warped in this toaster oven. Maybe it's just too small for frozen dinners and causes the heating elements to get too close to the food. Works good for other things though, and fits a 12\" frozen pizza. I was undecided on the \"roll up\" door since I usually use the kind with a door that opens down, but I'm sold after using this for a couple of months.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20170219
    },
    {
      "title": "A Winner in a Moderately Priced, Multiply-Featured Toaster Oven",
      "text": "I've owned several toaster ovens. Most were a compromise. This Hamilton Beach is a total winner on all counts: Easy to load and program, 'perfect' temperatures confirmed by oven thermometer, easy to load, excellent capacity, and so far (after one month of regular use) no scorching of the glass or the racks. Even the mode of opening is exceptional, up and out-of-the-way, avoiding the sweeping of the countertop that occurs with other ovens. The only drawback is the limit of the timer )30 minutes), that requires manual timing for longer times, a minor problem if one is paying attention anyway. A very reasonably priced oven with excellent features, functions just as expected and hoped, and very low prior negative ratings.",
      "rating": 5.0,
      "verified": true,
      "author": "Topnife",
      "helpful_votes": 0,
      "publication_date": 20180314
    },
    {
      "title": "Strong Performer",
      "text": "I've had this toaster oven for about two months so far and am, overall, pleased with it. The easy reach door is much more convenient than I was anticipating, especially if you plan to have the toaster oven on a higher counter. It heats evenly for the most part (as much as any toaster can) and has been functioning without surprises. There is definitely a smell you have to burn off, but that was accomplished quickly. My primary complaint is that the convection fan has been getting loud intermittently. I'll update this review if it becomes a bigger issue.",
      "rating": 4.0,
      "verified": true,
      "author": "Taylor",
      "helpful_votes": 2,
      "publication_date": 20171112
    },
    {
      "title": "Works like a champ",
      "text": "We use this toaster oven daily. Toast, pizzas, fish sticks, chicken nuggets.. even small oven dishes like salmon. This thing works great. Just be careful when you turn the dial off that you don't go past the off and set it to permanently on. I did that once and noticed an hour later.",
      "rating": 4.0,
      "verified": true,
      "author": "jakebuck",
      "helpful_votes": 3,
      "publication_date": 20180707
    },
    {
      "title": "It wobbles!",
      "text": "We bought this toaster oven and loved it right out of the box. EXCEPT, it wobbled. We instituted a return and guess what, the replacement toaster over wobbled in EXACTLY the same way the first one wobbled. We used duck tape and paper towel to level the oven. We will be keeping it because we like the way it cooks, like the roll top, etc. but really???",
      "rating": 3.0,
      "verified": true,
      "author": "L. Caplan",
      "helpful_votes": 3,
      "publication_date": 20190511
    },
    {
      "title": "Very nice!",
      "text": "I am a frequent used item purchaser on Amazon and I got this lovely item very discounted since it had cosmetic issues (no idea where) and I really like it. The ovens convection function fan doesn't work anymore but works well. It does take a while to bake things but I still use it one year later!",
      "rating": 3.0,
      "verified": true,
      "author": "emilee",
      "helpful_votes": 3,
      "publication_date": 20190508
    },
    {
      "title": "Convenient and affordable toaster oven",
      "text": "Loving this easy to access and easy to clean toaster oven. Received it in 2 days and put it to work last night. Such a treat to be able to cook a12 inch pizza : fits easily and cooks well ( slightly more cooked on the edges but I enjoyed it). I’m so glad I purchased this convenient item. This weekend I intend to bake a lasagna in it and perhaps follow up with an apple pie❗️",
      "rating": 5.0,
      "verified": true,
      "author": "Sheena Hansen",
      "helpful_votes": 3,
      "publication_date": 20190301
    },
    {
      "title": "Roll top feature should be considered",
      "text": "The temperature is calibrated very well. I did set my unit on top of a large cutting board which probably may not be needed. The unit cools down pretty quickly.I like the “roll-top” feature, as it takes up less counterspace once cooking is complete and you need to access your food... but once the glass window is lifted, there is only a small clearance to access the inside of the window for cleaning the glass, especially after broiling. I have a small hand so I can handle it. Especially in the summer months, this is a great way to lessen the heat in the kitchen as opposed to your standard oven. I would recommend this unit to friends.",
      "rating": 5.0,
      "verified": true,
      "author": "Beessonnet",
      "helpful_votes": 0,
      "publication_date": 20200929
    },
    {
      "title": "Fantastic little oven",
      "text": "Love this toaster oven!! First one I’v owned but I can’t believe I went this long without one. I hardly even use my basic toaster anymore. This just stays up on my counter and doesn’t take up too much room so it is more convenient to use. So far used it for toaster pastries, fries, bagel, chicken nuggets, frozen pizza, garlic bread, corn dogs, corn bread, pigs in a blanket and reheating left overs. It heats up so quickly and evenly. It pretty much cooks to Perfection. Can’t wait to try the new toaster oven recipe book I got.",
      "rating": 5.0,
      "verified": true,
      "author": "Shanti m",
      "helpful_votes": 3,
      "publication_date": 20171209
    },
    {
      "title": "Doesn’t cook evenly",
      "text": "It is not a bad toaster oven but it is worse than the one I had previously (Oster brand, bought from Costco). It doesn’t cook items evenly despite the convection. It isn’t extra cooked on a single side for which you could adjust based on the level of the shelf, but some items are overcooked on top and some overcooked on the bottom.",
      "rating": 3.0,
      "verified": true,
      "author": "Linda",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "Best ever!",
      "text": "We bought this to replace our broken toaster/ convection oven that had the glass door jam and explode in my face! This one had a front door that rolls back, yay, someone got it right! So far, we've toasted, baked, broiled, warmed ffood and this little oven is a top performer! We never use our regular oven anymore and this oven doesn't heat up the kitchen or the condo! Priced just right, easy to clean and my new kitchen buddy!",
      "rating": 5.0,
      "verified": true,
      "author": "Jewel",
      "helpful_votes": 0,
      "publication_date": 20200228
    },
    {
      "title": "so so",
      "text": "THe oven cooks, bakes, toasts etc great. It gets pretty hot on the top and back and I have to pull it away from my backsplash and outlets! The tray that came with the rack does not clean well at all and stained right away. I put foil over it when I use it. Would be much nicer if it was coated with something else.",
      "rating": 3.0,
      "verified": true,
      "author": "katironrage",
      "helpful_votes": 2,
      "publication_date": 20191227
    },
    {
      "title": "This is the one I should have bought the LAST time I bought a T.O.",
      "text": "Unlike my last toaster oven from a different manufacturer, this one has controls that are easier to use. Even better, the inside is deceivingly large, and the shape allows you to retrieve the food with less hassle and risk of burns. The tray on the bottom that lifts out for cleaning is WAY better than holding the oven over the garbage and opening the \"trap door\" that my last toaster oven. Great!",
      "rating": 5.0,
      "verified": true,
      "author": "Joy Brown",
      "helpful_votes": 2,
      "publication_date": 20170831
    },
    {
      "title": "Needs more toast timer markings",
      "text": "It's hard to find the \"sweet spot\" for toast as there are not many markings in the toast range of the timer. It's nice to be able to toast 6 slices at once. Toast continues to darken even after the elements shut down, unlike my traditional toaster with the stay warm feature. It's not a problem exactly, just a difference to learn. I've liked using this, instead of my full size oven, for smaller meals. I really like the easy reach door. If I wasn't always over doing my toast I'd give this 5-stars.",
      "rating": 4.0,
      "verified": true,
      "author": "Jonathan Dagnillo",
      "helpful_votes": 0,
      "publication_date": 20190719
    },
    {
      "title": "Really nice appliance",
      "text": "My old toaster oven I really liked was a different brand, a Krups that I got at Marshall's a couple years ago. I went to use it last week and the spring in the door broke! So, I got this one on a Black Friday deal, and it was delivered by Sunday. So far I love it. I've used it for bagels, grilled bread and English muffins. Plus, saving a good bit of money on it was a win/win.",
      "rating": 5.0,
      "verified": true,
      "author": "TwoGhostMoons",
      "helpful_votes": 2,
      "publication_date": 20191203
    },
    {
      "title": "Loud buzzing noise on convection setting",
      "text": "Bought this on Jan 21st and it's March 5th and it's already making a really loud buzzing sound sometimes when on convection.I turn it to regular bake and then back to convection and it stops for a while. I pretty much always use convection. I don't think this will last as long as my Oster did (1 1/2 yrs.), but it does the job for everything from toast to steaks so that's the important part.",
      "rating": 3.0,
      "verified": true,
      "author": "World Traveler",
      "helpful_votes": 5,
      "publication_date": 20180305
    },
    {
      "title": "Convection works well!",
      "text": "This product is new for me so I might amend this review later. So far, I have used the convection-bake feature to bake oatcakes. The cakes were evenly browned on the top and bottom and evenly cooked from the front to the back of the oven. I thought that due to the tiny size (six slice toaster oven) that I would have to remove and turn the tray, but the oatcakes baked evenly and the convection fan was quiet. So far, so good!",
      "rating": 5.0,
      "verified": true,
      "author": "E in SF",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "It's a great oven for the price.",
      "text": "This thing is awesome! So glad we gave up the regular toaster. It toasts, but better yet it bakes 12\" pizzas, cookies, chicken tenders, pizza rolls, egg rolls and much more without heating up the house. Our old toaster and Pizzaz rotisserie pizza cooker are going to Good Will. My only wish is for an inside light, but even without it it's a winner. Finally, I really like the flip up door. I also bought one for work and my coworkers love it too.",
      "rating": 5.0,
      "verified": true,
      "author": "flyfisherman86",
      "helpful_votes": 2,
      "publication_date": 20170802
    },
    {
      "title": "Easy access.",
      "text": "Nice toaster oven. Lots of features, and I really love the easy access door. I am in a wheelchair, and I can't tell you how many times I burned myself on the standard opening door on my previous oven. This one is also much bigger than most....I had to do a large pork roast in it one night when my big wall ovens went on the blink...it worked great!!! Also, UNLIKE most toaster ovens, it even makes great toast!!! My only complaint is that it did not lie flat on my granite counter...it \"rocked\" a little and required me to remove one back \"leg\" and put a spacer in it...no big deal and an easy permanent fix.",
      "rating": 4.0,
      "verified": true,
      "author": "quadman",
      "helpful_votes": 0,
      "publication_date": 20190307
    },
    {
      "title": "Perfect for a bachelor!",
      "text": "Well... honestly... I don't cook. I have no interest in it and when I try, it is a disaster. This is perfect for a guy like me. I mainly use it to toast bagels and soft pretzels (see?) but last night I did pizza in it. The controls are so easy that even a kitchen-clod like me can figure it out. Thanks Hamilton Beach!",
      "rating": 5.0,
      "verified": true,
      "author": "David M. Gibson",
      "helpful_votes": 0,
      "publication_date": 20200306
    },
    {
      "title": "... area and this flip up door feature was a perfect solution. It looks well made",
      "text": "I needed a toaster oven to fit in a small area and this flip up door feature was a perfect solution. It looks well made, and I expect it to out-last my old toaster oven that I had for 5 years. A convention fan feature is new to me. In my opinion, the feature cooks a little faster than the conventional oven, but that is all. The broiler feature does just as well.",
      "rating": 4.0,
      "verified": true,
      "author": "bunny friend",
      "helpful_votes": 3,
      "publication_date": 20170524
    },
    {
      "title": "Great Oven",
      "text": "I really wanted the \"convection\" aspect of this oven and it works great. It heats up fast and the convection function evenly spreads the heat throughout. It's large enough to be versatile but small enough in form so that it doesn't take up a lot of room on the counter. My wife absolutely loves it and it is used a lot and has lasted with no issues. I recommend this.",
      "rating": 5.0,
      "verified": true,
      "author": "JL",
      "helpful_votes": 0,
      "publication_date": 20190114
    },
    {
      "title": "Great value toaster oven with nice features and very user friendly front access.",
      "text": "Great value toaster oven with excellent easy reach and convection features. The first one I received had to be returned due to very noisy convection fan. Amazon was fantastic about immediately shipping a replacement and this one is flawless so far. The exterior top portion of oven does get extremely hot, but it's an oven so user needs to take care not to touch bare handed. Would not recommend for young kids to use this without supervision due to that fact. It's lightweight and not bulky and oven features are great. I'm happy with it.",
      "rating": 4.0,
      "verified": true,
      "author": "Johnny D",
      "helpful_votes": 0,
      "publication_date": 20170528
    },
    {
      "title": "UNSAFE",
      "text": "I would NOT suggest ANYONE buy this oven. If it weren't such a PAIN I'd send it back. The pan bent the 1st time I used it, it cooks WAY to hot no matter what temp. I set it on and snaps and pops when turned on. Scares me so it is now sitting in the basement with other junk that will be hauled off as soon as the snow melts.",
      "rating": 1.0,
      "verified": true,
      "author": "Thelma",
      "helpful_votes": 4,
      "publication_date": 20180301
    },
    {
      "title": "LOVE the rolltop",
      "text": "Rolltop saves counterspace when opening; so much better than a toaster because it's placed under a cabinet and all that heat doesn't escape and hit the cabinet bottom (which must be bad over the long run). Small footprint but very big inside - really does fit a good sized frozen pizza. Crumb tray is super easy to pull out and replace.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20181126
    },
    {
      "title": "Great Product",
      "text": "I am not living in a house at the moment so I do not have a stove or an oven so this has been a life saver. I have baked cookies in it and they came out perfect. I've done fries, toast and bacon. I haven't found anything so far that hasn't worked well in it. I am very pleased with it and I highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "PennyB",
      "helpful_votes": 2,
      "publication_date": 20200515
    },
    {
      "title": "Does not work for long",
      "text": "Stay away, far, far away from this toaster oven. I purchased this in July, 2017, stopped working this morning after using for only making toast and heating small items.. Yes, electric connection fine. Owned one like it previously, lasted 14 months before it blew. I know, Stupid, why buy it again. Worked well when it worked. It is under warranty which means, according to Hamilton Beach, I send it to them, pay for it, they will send a replacement or repair it (their decision) which takes 10 days to 2 weeks. No thank you. Headed to the store to purchase a toaster oven, NOT Hamilton Beach.",
      "rating": 2.0,
      "verified": true,
      "author": "Frances H. Dozier",
      "helpful_votes": 2,
      "publication_date": 20180508
    },
    {
      "title": "Perfect solution to smaller jobs. #energysaver",
      "text": "I am so happy with my HB oven! No more burned toast, and waste of energy. I use this toaster daily to toast, broil food. I love the glass lid to watch my food at a glance, that rolls up out of the way, and the timer that prevents overlooking. Can't wait to use the oven to make cookies with grandkids, and convection option.",
      "rating": 5.0,
      "verified": true,
      "author": "Jayne Phillips",
      "helpful_votes": 3,
      "publication_date": 20170308
    },
    {
      "title": "RELIABLE AND SPACE SAVER",
      "text": "I bought this for my son a few years ago and he loves it and uses all the time for toast and baking. The cover sliding back is so important for saving counter space. Never has given him a moment's trouble. I see the reviews talking about things catching fire but that has not happened to his. I bought one for us Oct 2019 and has been great. I timed the toasting function compared to the old toaster we had that finally had given up the ghost as this one is somewhat bigger. In fact this was faster..I think about 4 1/2 min..if I remember correctly. It works well, bakes things well and I really love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Martha D'Ambrosio",
      "helpful_votes": 0,
      "publication_date": 20200203
    },
    {
      "title": "Love that roll-top door",
      "text": "The roll-top door is a real space saver. The toaster does a great job on either one or two slices. We've not tried more but more will fit. We have not yet tried the oven feature. Bottom crumb catcher tray does a good job when toasting. We have pre-heated it to 450 degrees and it heated quickly enough and did not seem like it was radiating enough heat to harm the surroundings.",
      "rating": 5.0,
      "verified": true,
      "author": "KyRoamer",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Didn't know what I'd been missing.",
      "text": "I was trying to decide what to get my wife for Christmas when a coworker said \"Get her a toaster oven.\" I tried to find a decent one and immediately after ordering, I asked myself what the heck was I thinking!? Anyway, the day came and she loved it. We both use it almost every day. Food tastes so good coming from this thing. Great quality, great price. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Timothy Lewis",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "1st unit defective - returned and replaced with same model",
      "text": "Unit arrived 2nd day boxed well with no apparent damage. Attempted to operate and fan blade was obviously obstructed by something. Horrible noise. We loved the size and style. Returned and replaced with same. Replacement unit worked 6.5 months light usage and tonight the fan blade made the same noise we heard with the first unit. We are 2 for 2 failures with this unit. Might be glad I purchased extended service plan on this depending on how Hamilton Beach treats us on this issue. I filed a warranty claim w/them this evening.....will attempt to follow-up to this review.",
      "rating": 1.0,
      "verified": true,
      "author": "Rob",
      "helpful_votes": 0,
      "publication_date": 20190319
    },
    {
      "title": "Speed and Accuracy!",
      "text": "LIGHTNING TOASTER! I have been with Black and Decker forever, but no more. This toaster is fast, accurate and easy to clean. compact and can still easily fit 6 slices. The setting adjustments are excellent, and the roll top is the cherry on top. BEWARE... it's hot all over. it's a toaster.",
      "rating": 5.0,
      "verified": true,
      "author": "Jess K. S.",
      "helpful_votes": 0,
      "publication_date": 20200721
    },
    {
      "title": "Easy to use, cooks well",
      "text": "Ive gotten a good amount of use out of this since I bought it, and it works extremely well. Heats up way faster than my actual oven and the convection works to cook things evenly. The roll top door to me feels safer than the swing down doors, keeps it out of the way of getting something set on it and broken, and mine hasn't broken despite being shipped across the country twice. Glad I purchased it!",
      "rating": 5.0,
      "verified": true,
      "author": "Anna Brown",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "Works perfectly.",
      "text": "My old toaster oven quit working properly and now I'm happy it did. This one is the perfect size and the versatility can't be beat. I make a pumpkin pie weekly for my elderly friend and he even commented on how much better it tasted. I'm pleased with the quality. Super easy to clean also. I can make 4 mini loves at the same time and today I plan to bake a pizza for the first time. Great oven.",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley Warren",
      "helpful_votes": 0,
      "publication_date": 20200523
    },
    {
      "title": "So far works really well",
      "text": "Purchased for my parents and they love the ease of it. They live in AZ so using this more than their oven. Time will tell on how long it lasts, but they like it so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Steven",
      "helpful_votes": 4,
      "publication_date": 20190123
    },
    {
      "title": "Nice toaster oven",
      "text": "Overall like the toaster oven, but the tray it came with doesn't do well with high temps. At one point, it was starting to bend in a strange fashion, so I took it out and use the toaster oven without it. The crumb tray seems to be okay, but I only tend to use the toaster oven for ~10 mins when needed.",
      "rating": 3.0,
      "verified": true,
      "author": "Shahnawaz Hossain",
      "helpful_votes": 0,
      "publication_date": 20200709
    },
    {
      "title": "Fast and Hot!",
      "text": "We are a family of 4 and we use this literally every day as a toaster and re-heater for everything! It is fast and hot and I love the lift up door, which is the whole reason I picked this one. The oven is nice and roomy, for the largest pizzas and makes a nice crisp crust, even on our gluten-free pizzas! I do not hear the convection fan very loudly, like another reviewer experienced. I hear it turn on, but it is a soft hum, quieter than the microwave for sure, and quieter than the exhaust hood fan on the range. No complaints at all.",
      "rating": 5.0,
      "verified": true,
      "author": "I am Pharaba",
      "helpful_votes": 0,
      "publication_date": 20171209
    },
    {
      "title": "Glass door shattered!",
      "text": "Was loving this toaster oven until the glass door shattered this morning after 6 months of use while on the toaster function. Small glass bits all over the floor and counter.",
      "rating": 1.0,
      "verified": true,
      "author": "Anjali Gupta",
      "helpful_votes": 7,
      "publication_date": 20180408
    },
    {
      "title": "A++ Product",
      "text": "I was ecstatic to find an oven that opened bottom-up so spills and crumbs didn't always land on the glass door! This is a great product, works perfectly; it bakes/toasts/broils/convections just like larger stand-alone appliances. I've made cakes, bread, pizza, enchiladas, casseroles, and more and it uses a fraction of the energy as a large oven, not to mention during hot months it doesn't heat up the interior of the house. Highly recommend this product - you can buy this with confidence.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul Morton",
      "helpful_votes": 0,
      "publication_date": 20171207
    },
    {
      "title": "A must have for small cooking jobs.",
      "text": "Am absolutely in love with this purchase. Regularly made smaller amounts of food and hated preheating the over for such small portions. This thing heats up quickly and is a breeze to operate. i love the curved inside that makes it perfect for frozen pizza. The roll top door is a wonderful space saving and doesn't appear to impede cooking in any way. Would buy again in a heartbeat.",
      "rating": 5.0,
      "verified": true,
      "author": "MikeinGB",
      "helpful_votes": 0,
      "publication_date": 20191011
    },
    {
      "title": "Space saving flip up door",
      "text": "This is my third toaster oven. After reading other reviews, it seems like I am lucky to have a quiet one. This toaster will fit a freezer pizza with no problem; I've had all of the popular brands inside with no trimming necessary. I like the design because it saves space, but there is a drawback. The drawback for me is cleaning the glass. The door flips up over the top, which makes the glass portion nearly unaccessable. I can barely get my hand between the top of the oven and the glass door when it is fully opened. Even with that one issue, I would recommend this to a friend.",
      "rating": 5.0,
      "verified": true,
      "author": "TFritz",
      "helpful_votes": 0,
      "publication_date": 20180922
    }
  ],
  "product_meta": {
    "title": "Hamilton Beach (31126) Toaster Oven, Convection Oven, Easy Reach,Silver",
    "description": "Style Name:Previous modelYou won’t find a design like the Hamilton Beach Easy Reach Toaster Oven with Roll-Top Door anywhere else. Its unique and large opening make food easy to reach. And since the door opens above the oven, it frees up your countertop space in front. Best of all, it’s easy to keep clean because food can’t spill on the door. With a 6 slice toast capacity and four cooking settings, you can enjoy everything from crispy toast, broiled fish and mouthwatering roasted vegetables. Easy dials make it simple to choose bake, broil and toast settings. This oven also has convection technology using a top and bottom heating element and a built-in fan to distribute heat evenly for a uniform temperature. It also features a 30 minute timer with auto shutoff, so you know when your food is ready. Or you can choose an optional stay-on setting for food requiring more time. The Easy Reach Toaster Oven comes with a bake pan, bake rack and removable crumb tray.",
    "rating": 4.4,
    "feature_bullets": [
      "Easy access to food and countertop, easy to clean food can’t spill on door",
      "Bake, broil & toast functions, convection circulates air for faster, even cooking, removable crumb tray",
      "30 minute timer with ready bell and optional stay-on setting",
      "Includes bake pan and bake rack with two rack positions",
      "Fits a 9 x 11 inches bake pan, 12 inches pizza, or 6 slices of toast, dimensions (H x W x D) 9.41 x 18.74 x 15.24 inches"
    ],
    "specifications": {
      "Product Dimensions": "16.75 x 10.76 x 19.76 inches",
      "Item Weight": "5.99 pounds",
      "Manufacturer": "Hamilton Beach",
      "ASIN": "B00QC2M7VA",
      "Item model number": "31126",
      "Customer Reviews": "4.4 out of 5 stars1,708 ratings4.4 out of 5 stars",
      "Best Sellers Rank": "#4,648 in Kitchen & Dining",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "March 9, 2015"
    },
    "categories": [
      "Small Appliances",
      "Home & Kitchen",
      "Toaster Ovens",
      "Ovens & Toasters",
      "Kitchen & Dining"
    ],
    "price": 73.96
  }
}