{
  "website_summaries": [
    {
      "verdict": "The Asics Gel 190 TR was able to earn many repeated buyers. They found it to be a reliable training companion and comfortable casual footwear. Most purchasers appreciated its supportive construction, as well as the availability of width options. However, many testers found the extra wide profile to be much tighter than expected. The cushioning system also felt stiff to a significant number of users. These inconsistencies held the product back from becoming the top pick.",
      "pros": [
        "Based on general user feedback, the Asics Gel 190 TR performed admirably during gym sessions, dance-based workouts, and all-day wear",
        "Most online purchasers stated that the shoe was comfortable for long periods of use",
        "The fit was as expected, according to several buyers",
        "The shoe helped in reducing the back pain of many consumers",
        "A handful of testers expressed contentment with the arch support",
        "Some athletes appreciated the balance of flexibility and sturdiness, which made the trainer suitable for a variety of activities",
        "It provided efficient support for lateral movements, a few wearers said",
        "People with larger foot dimensions were happy to find a nice-looking shoe that was available in an extra wide option"
      ],
      "cons": [
        "Many wearers observed that the upper felt stiff and hurt their feet",
        "apparently, a break-in period didn’t soothe the discomfort",
        "A large number of buyers complained that the 2E – Wide option wasn’t roomy enough",
        "it was mainly tight in the forefoot",
        "The shoe’s midsole felt stiff for some They also claimed that it lacked cushioning",
        "A few testers wished for better breathability in the upper unit"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": 8.4,
      "source": "runrepeat"
    }
  ],
  "customer_reviews": [
    {
      "title": "They give good arch support and support at the ankles and are ...",
      "text": "These sneakers are much more supportive than I expected from an inexpensive training shoe. They give good arch support and support at the ankles and are much better than running sneakers for aerobics classes such as Step, Boot Camp, and Zumba. I wear these as my primary sneakers for these exercise classes now and my feet are hurting much less. Finally, a training shoe with a good amount of cushioning and comfort!",
      "rating": 5.0,
      "verified": true,
      "author": "lorirm",
      "helpful_votes": 50,
      "publication_date": 20160130
    },
    {
      "title": "Wonderful Shoes",
      "text": "I go to Jazzercise -- dance aerobics -- most days and need a LOT of support and good padding because we jump and do all sorts of sideways moves. I bought these on a friend's recommendation, with a little trepidation because I usually prefer a higher top shoe with better ankle support. Let me tell you, these do the job. I've got plenty of support for side-to-side movement, and the under-ball of foot padding is wonderful. Fit is amazing. I like a big toe box and these fit the bill. I'm going to order these again. Recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "G. Brown",
      "helpful_votes": 14,
      "publication_date": 20170219
    },
    {
      "title": "Great price on a solid pair of shoes",
      "text": "The previous reviews on this shoe were a big help. It does run just a tad small so I ordered a 1/2 size up and it is perfect. I also have the same issue that another reviewer did with a crease across the top of the shoe. It doesn't bother me, but I am guessing that is why these are on Amazon and not at our local high-end running store. It does not impact the performance of the shoe at all.",
      "rating": 4.0,
      "verified": true,
      "author": "Nana",
      "helpful_votes": 10,
      "publication_date": 20161220
    },
    {
      "title": "Will give them a chance.",
      "text": "The first day I tried them in my gym class, my feet hurt so much. I chalked it up to just getting used to them. The next day they did better. Did not hurt as much. I wanted a training shoe for HITT classes, zumba, etc instead of wearing my running shoes all the time. They are very roomy in the toe box. Glad I did not get a Wide like usually get for running shoes. I thought the color was a bit lighter than this vibrant blue but I like them. Hopefully my feet will either get used to training in them or they will have to go to occasional use.",
      "rating": 3.0,
      "verified": true,
      "author": "Ninjagrl1",
      "helpful_votes": 7,
      "publication_date": 20170223
    },
    {
      "title": "Very disappointed",
      "text": "The shoes fit, yet are so uncomfortable! I am an Asics convert, so I had high expectations. These fall flat. I am so disappointed that I literally cried. Usually, I can wear Asics the first day, all day. This time I had to do the old breaking in: first day, one hour; second day, try for two -- but I've never been able to go longer. I live in a small town, so buying shoes is a hassle. I'm going to go to the hassle of shopping for and purchasing shoes I've tried on in the store and walked around in. I would NEVER have bought these had I walked around only around a store. Well, live and learn.",
      "rating": 2.0,
      "verified": true,
      "author": "Charlotte D. Stewart",
      "helpful_votes": 5,
      "publication_date": 20161022
    },
    {
      "title": "Okay",
      "text": "Not nearly as comfortable as all my other asics made of a mesh material. They also look a bit bulky and wide on my foot and feel a little wide in the fit. They are slightly short in length compared to other asics the same size - my toe rubs a little. The synthetic leather makes my feet sweat too. I needed a shoe like this that could be wiped clean, but I don't like it as much as the fabric versions.",
      "rating": 3.0,
      "verified": true,
      "author": "Actual Real Housewife",
      "helpful_votes": 23,
      "publication_date": 20160116
    },
    {
      "title": "Even fits my W I D E feet!",
      "text": "I have very wide feet so fitting shoes on the internet is challenging. I bought these because of the price and I know ASICS to be a good running shoe. I use these as a casual shoe for athletic events but not as a training shoe. They are great for the $$ I paid but the wide just barely give my toes room to wiggle. The toe box is wide but I have really wide feet. I may look for a XX wide next time I buy. All-in-all I'm very happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Christine Franz",
      "helpful_votes": 0,
      "publication_date": 20180911
    },
    {
      "title": "Great shoes for planterfascilitis feet",
      "text": "I had wore these shoes few years back and I could not find it anywhere for a long time. These shoes are great without custom orthotics. They feel like it has custom orthotics built inside the shoes. I heard these shoes are discontinued and I pray they will bring it back and in many other colors. Asics should make more of this particular model. There is support from the front of the feet to the middle and back of the heels.",
      "rating": 5.0,
      "verified": true,
      "author": "Gina",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "Ouch",
      "text": "I used to wear Asics years ago but switched to New Balance on the recommendation of my podiatrist. When New Balance discontinued my shoe, I started looking for a replacement. While researching, I came across the ASICS Gel 190 TR, which was highly recommended by a few podiatric websites & have mostly positive reviews on Amazon. After a month, I started having severe back & hip issues. My orthopedist believes it's from the shoes, which I didn't want to believe. However, when I wear my old New Balance, the pain is much less acute, almost non-existent. I guess I'll donate these & find a pair of New Balance that's comparable to my old shoe.",
      "rating": 1.0,
      "verified": true,
      "author": "Kris72663",
      "helpful_votes": 2,
      "publication_date": 20170522
    },
    {
      "title": "Excellent fit and not ugly",
      "text": "I use them for kickboxing and tabata workouts and they're very good. They allow me to balance on one foot as well as the best I have owned. They took a few days to stretch out and like all shoes, the left one gets loose too fast. Possibly, that is a problem just for me. We are in a extremely bad era for sneaker attractiveness and they are as nondescript as the come.",
      "rating": 5.0,
      "verified": true,
      "author": "Corgi",
      "helpful_votes": 0,
      "publication_date": 20161202
    },
    {
      "title": "I’m an Asics fan now.",
      "text": "I have insanely wide feet, duck feet really, and while these are a 2E I’d like them to be a bit wider. It’s also very hard to find any shoes in a 2E, more options would be nice ASICS. That being said, I love these, I had Achilles tendonitis because I was running with cheap shoes, my doctor yelled at me and so I bought these. I’m an Asics fan from here on out, they are sturdy and super cushy on my heels, I wore them to help things heal and now I use them to run.",
      "rating": 5.0,
      "verified": true,
      "author": "L. K. H. ",
      "helpful_votes": 0,
      "publication_date": 20171109
    },
    {
      "title": "Great for tennis matches.",
      "text": "I use these shoes for playing tennis on hard courts. I am a smaller person and most tennis shoes are either too stiff and bulky or else cause heel pain. These shoes are very comfortable for serious tennis, supportive and 'fast'. I am a serious runner and just do not like the feel of specific tennis court shoes. These work great for me. I know a lot of purists would scowl at using cross trainers for tennis, but these work for me.",
      "rating": 4.0,
      "verified": true,
      "author": "Gail",
      "helpful_votes": 0,
      "publication_date": 20160715
    },
    {
      "title": "I love ASICS sneakers",
      "text": "I love ASICS sneakers!! This is the only brand of sneaker I'll wear. I wear these when I workout and they are the most comfortable sneakers around. They look great and fit perfectly They arrived on time and were exactly as described, in fact, they look even nicer in person!! Great purchase, I am very pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "Lucia",
      "helpful_votes": 5,
      "publication_date": 20170306
    },
    {
      "title": "I can barely wear them but they're not as bad as many other brands.",
      "text": "I can wear these OK, thankfully. My observation is that they are almost too pointed for my round, wide foot, even though I picked a size 1/2 size larger than I usually wear and dubble extra wide (EE). ON hills, going down, those tall middle toes touch the shoe lightly and could possibly become sore on all day walking, so I'm not returning them but I won't buy another pair. My toes need lots of room even with my narrow heel, so the overall shape of the toe zone needs to be pretty rounded.",
      "rating": 3.0,
      "verified": true,
      "author": "Crys C",
      "helpful_votes": 0,
      "publication_date": 20171020
    },
    {
      "title": "I really like the look and comfort of volleyball shoes",
      "text": "I typically purchase ASICS women's footwear every 3 months. I really like the look and comfort of volleyball shoes. When I purchased the Gel 190 Training shoe, I wasn't expecting the good fit, the nice style and look of the shoe. When I wore them for the first time, it was like a form fit for my foot. I usually have problems with my arch and this shoe was perfect. The interior just felt like it molded itself to my foot and when I walk, I have a spring to my step. This shoe isn't bulky and is quite light. Redgirl1",
      "rating": 5.0,
      "verified": true,
      "author": "Red Girl 1",
      "helpful_votes": 4,
      "publication_date": 20160118
    },
    {
      "title": "Beware of buying shoes from Amazon",
      "text": "One shoe was larger than the other. I returned the shoes, having worn them only briefly and only on a carpet, and paid the considerable return postage. Sports Clearing House, through Amazon, would not give me a full refund, subtracting $10 from the price. I ended up paying nearly $30 for shoes I could not wear. Moral of story: do not buy shoes from Amazon, but if you do, make sure the policies for return postage and full refunds are clearly spelled out.",
      "rating": 1.0,
      "verified": true,
      "author": "N. Serotkin",
      "helpful_votes": 0,
      "publication_date": 20171109
    },
    {
      "title": "Okay for the price, not lightweight enough.",
      "text": "This is my first pair of Asics, I was having high hopes but these shoes turned out to be not good as expected although $30 is a great deal. I usually wear 6.5 in flats and 7 in heels and sneakers. I ordered 7 and it runs a bit large on me. The tongue is rather hard on my feet. And it is obviously not lightweight enough comparing to my Nike air max.",
      "rating": 3.0,
      "verified": true,
      "author": "666",
      "helpful_votes": 6,
      "publication_date": 20160405
    },
    {
      "title": "Ultra endurance athlete-my go to athletic shoes",
      "text": "My go to athletic shoe. I buy these 2 at a time usually and have been buying them for a few years now. Ultra endurance athlete and put hundreds of miles on them under weight every month. Use them for running, rucking, weight lifting and HIIT training and cross training. Love them. Wider forefoot which is nice and great lateral support for movement exercises",
      "rating": 5.0,
      "verified": true,
      "author": "Maggiesmom",
      "helpful_votes": 0,
      "publication_date": 20191208
    },
    {
      "title": "Little disappointing in the arch",
      "text": "I was really hoping the arch support in these would be better. But then, maybe my arches are abnormally high? Either way, I had to spend another $20 on separate arch supports to put in these so my feet didn't hurt. Other than that, they fit fine and are comfortable.",
      "rating": 4.0,
      "verified": true,
      "author": "jackiec",
      "helpful_votes": 0,
      "publication_date": 20190409
    },
    {
      "title": "Amazing support and completely worth every penny! My feet don't ache now.",
      "text": "These shoes are everything I was looking for in support for my feet. My feet pronate and are flat with no arch at all. When I wear dress flats for the day instead of these, my feet hurt so bad by bedtime. These really do make the difference. I just wish there were better designs for work. I chose black so that they would blend in with most outfits but I dress up for work and feel odd wearing them sometimes. I haven't found a more casual rather than athletic style shoe that would work better for business outfits with good support.",
      "rating": 5.0,
      "verified": true,
      "author": "Angela Dean",
      "helpful_votes": 0,
      "publication_date": 20160526
    },
    {
      "title": "Running Shoes that minimizes Shock.",
      "text": "This shoe is excellent walking and running it has a significant amount of cushioning while extremely lightweight. I don't feel any shock to my knees while running and this was my objective when purchasing this shoe.",
      "rating": 5.0,
      "verified": true,
      "author": "Dee",
      "helpful_votes": 2,
      "publication_date": 20161026
    },
    {
      "title": "Check to Make Sure the Box Contains What the Label Says!",
      "text": "I bought two pair in 8EE. Both boxes were marked as 8EE but the tags on the inside of the shoe told a different story. One was marked correctly S574L (2E) while the other was marked S573L without width designation. I wore the 573 around my house and it felt a bit more snug than the other pair but still wearable for me. I docked a star because what was in the box didn't match the description on the box.",
      "rating": 4.0,
      "verified": true,
      "author": "Mary Joanne Deal",
      "helpful_votes": 3,
      "publication_date": 20170322
    },
    {
      "title": "... and are no longer available at the local store-- excellent for high impact with the gel at the base ...",
      "text": "used these shoes for years and are no longer available at the local store-- excellent for high impact with the gel at the base of the heel. go through shoes every 6 months secondary to the degree of high impact workouts and excellent to protect the knees",
      "rating": 5.0,
      "verified": true,
      "author": "Nikhita Dhruv",
      "helpful_votes": 0,
      "publication_date": 20180221
    },
    {
      "title": "Excellent quality - Stable and flexible!",
      "text": "LOVE, LOVE LOVE!! Excellent stability and flexibility for cross-training! Very comfortable and fits perfectly, as expected. The blue, silver, and white colored shoe is so pretty! I am very pleased with both the product and service - thank you!! Highly recommend to others for any sort of gym/studio classes, etc. Also, may be a little stiff feeling at first, but once broken in they become even more flexible without loosing their stability.",
      "rating": 5.0,
      "verified": true,
      "author": "AmazonCustomer ",
      "helpful_votes": 2,
      "publication_date": 20170324
    },
    {
      "title": "SHOE WAY TO NARROW",
      "text": "I ORDERED SIZE 8 2E FOR THIS SHOE. WHEN I RECEIVED THIS SHOE I TRIED IT ON RIGHT AWAY. THERE IS NO WAY THIS SHOE IS A 2E WIDTH. IT WAS WAY TOO SMALL, IT FIT LIKE A REGULAR WIDTH SHOE. I SHOULD HAVE LISTENED TO THE OTHER REVIEWERS WHO SAID THE SAME THING. DON'T BUY THIS SHOE UNLESS YOU WEAR A REGULAR SIZE WIDTH.",
      "rating": 1.0,
      "verified": true,
      "author": "Pat O.",
      "helpful_votes": 2,
      "publication_date": 20161114
    },
    {
      "title": "not the same as previous models (?)",
      "text": "I've bought Asics for years and years. I always buy the same, Gel Nimbus for my running and the Gel 180 or 190 for everything else. This shoe came and felt tighter than previous shoes and they haven't lasted (comfort wise) as long. I may come back to this shoe, but I just bought a Ryka shoe to try instead (that says how much I was not satisfied with a shoe that I've used for longer than I can remember).",
      "rating": 3.0,
      "verified": true,
      "author": "AL2NY",
      "helpful_votes": 0,
      "publication_date": 20170802
    },
    {
      "title": "Love me some Asics!!",
      "text": "I can't get enough Asics!! I have severe plantar fasciitis in my right foot, and working retail doesn't help, but these shoes sure do. It's my 3rd pair of Asics with Gel, and I love all of them. My feet do a little happy dance every time I slip them in these guys. My feet are a tad bit wide and these fit just right. Squishy where I need it to be, supportive in all the right places.",
      "rating": 5.0,
      "verified": true,
      "author": "Island GirlTop Contributor: Eye Makeup",
      "helpful_votes": 5,
      "publication_date": 20160120
    },
    {
      "title": "Excellent shoe!",
      "text": "I needed white shoes for my laboratory courses. I first bought a pair of sketchers, but my feet were quickly feeling sore after standing for awhile. I normally wear Asics casually and I was very happy to find a pair in all white. They are very comfortable, great for long periods of moving around and standing. My legs and feet don't hurt anymore.",
      "rating": 5.0,
      "verified": true,
      "author": "PammyLZ",
      "helpful_votes": 3,
      "publication_date": 20170215
    },
    {
      "title": "Wonderful Shoes",
      "text": "These shoes are my go-to footwear for everyday use (i.e., brisk walking, shopping, etc.) I have major foot issues and these shoes combined with my custom-made orthotics provide sufficient comfort for walking many miles without pain. I have two pair and will order more when they wear out.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181123
    },
    {
      "title": "The Very Best for Help with Pronation",
      "text": "These fit like a dream from the moment I put them on. Highly recommend especially if your feet have a tendency to pronate. The Duomax section of the shoe that stabilizes the arch (seen as the grey colored section in the pictures on the inner side of the shoe) really helps keep my feet from pronating!",
      "rating": 5.0,
      "verified": true,
      "author": "Mom who cares",
      "helpful_votes": 0,
      "publication_date": 20170325
    },
    {
      "title": "but they still fit me comfortably. First night I wore them to work and ...",
      "text": "I expected a 2E width to have more space, but they still fit me comfortably. First night I wore them to work and they felt great all night, and I am on my feet a lot. No break in time needed. Got the wide width for a bunion and was pain free. They felt so good, I ordered a 2nd pair the next day. One for workouts and one pair to work in.",
      "rating": 5.0,
      "verified": true,
      "author": "JDDIMI",
      "helpful_votes": 0,
      "publication_date": 20160418
    },
    {
      "title": "Great shoes!",
      "text": "I have WIDE feet, and always have trouble finding the right shoes. I hadn’t bought new work out shoes in 7 years, but it was time. This was the 5th pair of shoes I ordered and I FINALLY found one that was wide enough (82E). Thanks ASICS! My last pair of shoes were ASICS as well, and they lasted several years before I needed to buy a new pair.",
      "rating": 5.0,
      "verified": true,
      "author": "sarahfeuerborn",
      "helpful_votes": 0,
      "publication_date": 20171013
    },
    {
      "title": "Not great.",
      "text": "I am not impressed with these shoes. I have purchased asics online previously and they have lasted me for a year. I am in the medical field and the first week tried to tolerate these and came home with such sore feet I didn't ever want to put these shoes back on but figured I'd try some orthotic inserts... they don't help much. The shoes are just not supportive and the quality is sub par for asics brand. But I bought them so I am going to try them for a little longer. Next time gonna just spend the extra money to get shoes that are comfortable for me.",
      "rating": 2.0,
      "verified": true,
      "author": "Audi",
      "helpful_votes": 0,
      "publication_date": 20170719
    },
    {
      "title": "Disappointing...",
      "text": "I got a size 12 2E because of my super wide feet. These are wayyyyy too tight to be 2Es. They are causing numbness & bunion formation. After just over a month they are falling apart to boot. The laces seem extra short which is odd as well. Whatever you do, steer clear! $44 down the drain.",
      "rating": 1.0,
      "verified": true,
      "author": "Lindsay",
      "helpful_votes": 0,
      "publication_date": 20171011
    },
    {
      "title": "Color, size, fit and comfort are just as expected",
      "text": "Like the color, like the support, the size is perfect for me, I like the weight. I do not like that they squeak when I walk in them. Any suggestions to get rid of the squeak?",
      "rating": 4.0,
      "verified": true,
      "author": "Jeanne",
      "helpful_votes": 0,
      "publication_date": 20190303
    },
    {
      "title": "Great Brand",
      "text": "I do love ASICS. The only thing is that I have to 'break' them in. Can only wear them for a very short time and will know if I can keep them or have to return them (wearing them around the house for now). I have NO arches so it can take me a little time to be sure they will be comfortable. They are a very good brand and my physical therapist even said they are good and they wear them.",
      "rating": 5.0,
      "verified": true,
      "author": "Just Jo",
      "helpful_votes": 2,
      "publication_date": 20160115
    },
    {
      "title": "The pair I ordered were too short - instead of size 7 should've gotten a 7 1/2",
      "text": "I currently have the same pair of ASICS size 7 and they are perfect....so I just ordered the same size. Unfortunately, I threw out the box before trying them on (stupid, I know). They are too short...my big toe is right at the edge of the shoe, and I had on thin socks. My current ASICS I wear 2 pairs of socks so needless to say I was very disappointed. The saving grace is there is a friend in my workout class that wears size 7 and had just ordered her pair from Amazon. So I am hopeful that she will buy them from me.",
      "rating": 2.0,
      "verified": true,
      "author": "Vicky C.",
      "helpful_votes": 0,
      "publication_date": 20170904
    },
    {
      "title": "Regular width is still roomy",
      "text": "As others have mentioned this shoe has a wide toe box. I ordered the regular width and I must say it is still roomy. I have quite wide feet, but it's better to not have it too snug as then you cut off circulation as you are moving. The stability and shock absorbing is great! the heel and across the arch fit snug so I think I'll be okay. My old shoes fit very well and were super light weight, but alas were not supporting me for very long. We'll see how these do over time.",
      "rating": 4.0,
      "verified": true,
      "author": "Cynthia",
      "helpful_votes": 0,
      "publication_date": 20180814
    },
    {
      "title": "Value and comfort- thumbs up!",
      "text": "I removed the generic insert and replaced with orthodic inserts for my plantar fasciitis. Walked very far and in the rain and my foot was not in pain. Worked out better than I thought it would.",
      "rating": 5.0,
      "verified": true,
      "author": "SY",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "Cute shoe",
      "text": "I am quite pleased with these shoes, but the arch support is simply not adequate for my feet. That's not a production issue, though; that's purely me and I can't give less than five stars for a product that is not responsible for the shape of my foot. In particular I like the look of these white on white shoes; so many shoes have really funky colors that can't be worn with many outfits. I also like that there is no mesh component to these shoes, which seem to be the place that my other tennis shoes collapse or tear first. The cushioning is excellent, as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Crafty Momster2112",
      "helpful_votes": 0,
      "publication_date": 20160718
    },
    {
      "title": "DEFINITELY NOT 2E!!!!!",
      "text": "Once again I find myself regretting not listening to reviewers. WAY....MUCH....more narrow than any other shoe I've purchased in the past. Very disappointing because I'm looking for a \"fun\" color workout shoe in a wide size. If you have wide feet, move along to your old brand.",
      "rating": 1.0,
      "verified": true,
      "author": "draper in Colorado",
      "helpful_votes": 2,
      "publication_date": 20161203
    },
    {
      "title": "Fantastic shoe for the price!",
      "text": "I LOVE ASICS and they are the only brand of athletic shoe that I wear. First time I wore these I had them on for 16 hours. No blisters, no sore feet and very comfortable. Just what I've come to expect from the ASICS brand.",
      "rating": 5.0,
      "verified": true,
      "author": "DeborahAnn",
      "helpful_votes": 0,
      "publication_date": 20160607
    },
    {
      "title": "Perfect! This shoe has great support",
      "text": "This shoe fits me perfectly. Normally I have troubles with shoes as I either wear a 5.5 in regular shoes or children's shoes but I followed the recommendations on other reviews and ordered a half size up. Perfect! This shoe has great support, comfortable gel cushioning and I feel really well balanced in them.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180504
    },
    {
      "title": "Basic black sneaker",
      "text": "This model seems to have normal sizing, as compared to other ASICS I've had. I've worn the Gel Nimbus 13 sneaker for the past five years and they seemed to run a bit small, so I always got a half size larger. (I am usually a 7, but with my previous ASICS I've fit comfortably in a 7.5.) But this model seems to have a normal sizing. Beyond that it's a pretty basic black sneaker, good for work uniforms. It doesn't seem as supportive as the Gel Nimbus line though.",
      "rating": 3.0,
      "verified": true,
      "author": "MissMauvelous",
      "helpful_votes": 0,
      "publication_date": 20160310
    },
    {
      "title": "Wish I knew about these years ago!",
      "text": "Bought these for my wife. As I rave over the 3 pairs that I have. I have to Workforce and one walking Gels wife said takes some getting used to. She is on her feet the whole work shift. Better then New Balance in my eye which I have work for many years also.To me it's like walking on air. Best sneakers I every worn. Wish I knew about these years ago!",
      "rating": 5.0,
      "verified": true,
      "author": "K. Olsen",
      "helpful_votes": 2,
      "publication_date": 20160124
    },
    {
      "title": "Great fit, good support, good cushion for fitness work-outs.",
      "text": "I assume I could wear these all day, but have not had occasion to do so. I followed some of the advice I read in other reviews and ordered up 1/2 size, which was exactly right. I purchased them for a Cardio-Drumming-Fitness class, which entails a bit of jumping around. So far, so good. They have good cushion and prevents the ankle and knee pain I normally get from jumping. These shoes meet my needs for fitness workouts.",
      "rating": 5.0,
      "verified": true,
      "author": "YB119",
      "helpful_votes": 0,
      "publication_date": 20160918
    },
    {
      "title": "Great support",
      "text": "These are a bit clunky looking, but the support is outstanding. Very good removable orthotic inside. A lot of athletic shoes have a mesh exterior. I find that a firmer, leather-like shoe is much more supportive. I ordered a half size larger than usual, based on an older Asics gel shoe that served me very well.",
      "rating": 5.0,
      "verified": true,
      "author": "Suzanne Hanes",
      "helpful_votes": 3,
      "publication_date": 20161107
    },
    {
      "title": "Satisfied.",
      "text": "Packaging fine. Delivery prompt. Product as described. I compared the new 190 9.5 extra wide to my beloved older 180 9.5 2E. Shoes are the same size so I will keep these.",
      "rating": 5.0,
      "verified": true,
      "author": "DM",
      "helpful_votes": 0,
      "publication_date": 20181029
    },
    {
      "title": "Disappointed",
      "text": "Bought shoes used them twice and they hurt super bad to narrow. Then I had an injury and couldn't work out for 3 months just tried shoes on and they hurt",
      "rating": 1.0,
      "verified": true,
      "author": "JEAN D.",
      "helpful_votes": 0,
      "publication_date": 20190109
    },
    {
      "title": "Very Uncomfortable!",
      "text": "Very tight, and uncomfortable. Lots of pressure points in the shoe. I've worn it twice...the second time was only because I forgot how uncomfortable it was the first time. I had to retire these babies after 2 wears. I spend 12 hour shifts on my feet and I have more important things to worry about at work than my feet!",
      "rating": 1.0,
      "verified": true,
      "author": "Reesy",
      "helpful_votes": 0,
      "publication_date": 20171001
    },
    {
      "title": "Great athletic shoes at a good price",
      "text": "I love these shoes so much that this is my third pair. I love not having to go all over town looking for something I like that fits and is comfortable (I wear orthotics, so not all shoes work well with them), so when these wear out, if they're still available, I'll order another pair!",
      "rating": 5.0,
      "verified": true,
      "author": "Oreo Kat",
      "helpful_votes": 0,
      "publication_date": 20170811
    },
    {
      "title": "Pros and Cons.",
      "text": "I got these because of a recommendation from a friend. I walk 2-4 miles about 4 days a week. They aren't the most comfortable shoes, but the pain in my feet AFTER my walks has gone down. I find it strange that after wearing them for 3 weeks, I then got a blister.",
      "rating": 4.0,
      "verified": true,
      "author": "Becky F",
      "helpful_votes": 0,
      "publication_date": 20170831
    },
    {
      "title": "Shoes that fit my needs!",
      "text": "This is my second pair of these shoes that I wear for Jazzercise. With arthritis in my feet these shoes provide the support I need! With the trend to go to less-structured shoes for aerobic exercise it is good to be able to find shoes that suit my needs.",
      "rating": 4.0,
      "verified": true,
      "author": "Adnil45",
      "helpful_votes": 0,
      "publication_date": 20170911
    },
    {
      "title": "Fantastic cross-trainers",
      "text": "Far and away the best supportive cross trainers I tried (tried Puma, Reebok, New Balance and Ryka). Very supportive (I have a high instep), great arch support, fantastic cushioning, amazingly lightweight considering all the cushioning. Ordered two pairs, a size 9 standard width and a size 9 width 2e because of mixed reviews. Former was too small (big toe touched end) but latter perfect fit. Finally found the perfect work out trainers - do some dance, kickboxing inspired with lots of jumping, circuit training, etc. Extremely pleased!",
      "rating": 5.0,
      "verified": true,
      "author": "beadyeye",
      "helpful_votes": 0,
      "publication_date": 20160715
    },
    {
      "title": "Happy feet!",
      "text": "Very comfortable. Did not have to 'break them in'. Work as a nurse an an on my feet for 12-14 hours a day and my feet do not hurt at the end of the day. I would definitely buy another pair.",
      "rating": 5.0,
      "verified": true,
      "author": "Lowie",
      "helpful_votes": 4,
      "publication_date": 20170605
    },
    {
      "title": "Really Comforatable",
      "text": "These are really nice looking and comfortable shoes. There was no break in time required on these. I put them on in the morning and they felt great. They have a good deal of cushion and spring in the soles so it feels like I am walking on air. I just started wearing them so I can't comment on how they hold up but so far I love them.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Ravetta",
      "helpful_votes": 0,
      "publication_date": 20170602
    },
    {
      "title": "These fit which is nice, but they were uncomfortable at first",
      "text": "Finding shoes in a double wide and a half size is a bitch and a half. These fit which is nice, but they were uncomfortable at first. The padding on the inside is odd, and feels like it ends under the balls of my feet, so my toes aren't comfortable. It's taking time to break them in, but I'm determined to do so.",
      "rating": 3.0,
      "verified": true,
      "author": "Hannah Longey",
      "helpful_votes": 0,
      "publication_date": 20170717
    },
    {
      "title": "Large and lug-soled like, sort of clunky",
      "text": "Shoe is OK. I kept them because didn't want the hassle at the time of returning. Stiff bottom and once I wore it to class a few times it seemed to soften a bit. Large and lug-soled like, sort of clunky. Not the most attractive shoe.",
      "rating": 3.0,
      "verified": true,
      "author": "Jennifer",
      "helpful_votes": 0,
      "publication_date": 20161209
    },
    {
      "title": "Wonderful workout shoe",
      "text": "When my chiropractor recommended ASICS as a good cross-training shoe, I bought a pair of the Gel 190-TRs in white-and-blue and was immediately pleased. I bought this second pair, in blue-and-white, to make sure I wouldn't have to search high and low for an equally suitable shoe if the style happened to be discontinued. The light weight, wide toe box, and broad forefoot give me all the balance and support I need when working out without feeling clunky or cumbersome. And they are very comfortable. Highly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "Ann Ramsey-Moor",
      "helpful_votes": 0,
      "publication_date": 20160804
    },
    {
      "title": "Nice shoe",
      "text": "I have super wide feet and I can wear these shoes without getting overly fatigued and sore. For me they are a little tight but for a more normal foot these would be just fine. I did buy the wide size and easily could have gone with a double width. I also have a high arch and there is some support but again, my feet fit best in the shoe box....",
      "rating": 5.0,
      "verified": true,
      "author": "Rebecca S. Atkinson",
      "helpful_votes": 0,
      "publication_date": 20160718
    },
    {
      "title": "My favorite",
      "text": "This is my second pair of the same kind of ASICS, my feet are not at all wide but I find them to be very comfortable for running , spinning and training in general",
      "rating": 5.0,
      "verified": true,
      "author": "May",
      "helpful_votes": 0,
      "publication_date": 20190430
    },
    {
      "title": "I love my shoes.  Love the color, love the fit!",
      "text": "I needed new shoes and these were exactly what I was looking for. I like the color and the fit. They are perfect!",
      "rating": 5.0,
      "verified": true,
      "author": "Kathy Baker",
      "helpful_votes": 0,
      "publication_date": 20190524
    },
    {
      "title": "Excellent training shoe",
      "text": "I needed new shoes for my P90X round. And these ASICS are just perfect. They have great support everywhere and the thick sole ensures stability and soft landings on each jump. The fit at first felt somewhat tight, but it's the good kind of tightness - due to the support on all sides. There is no pressure and definitely no discomfort.",
      "rating": 5.0,
      "verified": true,
      "author": "Kina",
      "helpful_votes": 0,
      "publication_date": 20170330
    },
    {
      "title": "love them. This sneaker was not comfortable at all",
      "text": "Got the size I always wear. This sneaker was extremely tight all around. I have another pair of Asics sneakers, same size, and they fit perfectly....love them. This sneaker was not comfortable at all. Really loved the coloring but was very disappointed with the fit.",
      "rating": 3.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20170331
    },
    {
      "title": "Good",
      "text": "Since I got white leather, it stains somewhat easily. Also, some wrinkles/cracks are present around the toe area after use. But very comfortable as with all Asics sneakers, and helps keep me properly supported, and reduces my chronic back pain.",
      "rating": 4.0,
      "verified": true,
      "author": "Veronica M",
      "helpful_votes": 0,
      "publication_date": 20170625
    },
    {
      "title": "Fits true to size",
      "text": "Shoe fits true to size but doesn’t have much arch support.",
      "rating": 4.0,
      "verified": true,
      "author": "MT White",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "Good for tennis",
      "text": "I use these for playing tennis. They provide good arch support and good side-to-side support. If you are a toe-dragger they may not work as well for you in tennis. Only complaint is how quickly they wear out - both soles and inserts. But as long as I get them cheap enough, I'll continue to buy them",
      "rating": 4.0,
      "verified": true,
      "author": "Suzanne Pierce",
      "helpful_votes": 0,
      "publication_date": 20190118
    },
    {
      "title": "Double EE",
      "text": "I wear an 8EE in most Name brand Training shoes. These were fine in overall length, but the width was a little narrower than most.",
      "rating": 5.0,
      "verified": true,
      "author": "PatZ",
      "helpful_votes": 0,
      "publication_date": 20160914
    },
    {
      "title": "It's unfortunate since they appear to be well made with good arch support",
      "text": "These ASICS are much too narrow for a 2E width shoe. It's unfortunate since they appear to be well made with good arch support, but that's no help if the shoe doesn't fit properly. If you can wear a C/D width, then these shoes may work for you.",
      "rating": 2.0,
      "verified": true,
      "author": "SouthernHome",
      "helpful_votes": 0,
      "publication_date": 20171220
    },
    {
      "title": "After seeing all the good reviews of Asics shoes",
      "text": "After seeing all the good reviews of Asics shoes, I decided to give them a try. I was looking for a good fitting and stable shoe for weight training classes. I feel like I hit the jackpot!!!! This is the best training shoe I have ever tried. The fit is perfect and so comfortable I could wear them all day. I highly recommend them to anyone looking for a good fitting shoe with all the support you would ever need!",
      "rating": 5.0,
      "verified": true,
      "author": "TB Cali",
      "helpful_votes": 0,
      "publication_date": 20170828
    },
    {
      "title": "Great gym shoe",
      "text": "Needed new gym shoes and these are perfect for my feet. I have problems getting toe space wide enough in most women's shoes but these work and are very comfortable for my gym activities. Wish I could wear them all day.",
      "rating": 5.0,
      "verified": true,
      "author": "GSMom",
      "helpful_votes": 0,
      "publication_date": 20161216
    },
    {
      "title": "Power shoes",
      "text": "Love these shoes, wear them for weight lifting class and they are very supportive and I keep my balance when we do other exercises I am glad I read the reviews because I was going to get a 7 1/2 but ordered the size 8 and they fit perfect. I told the Instructor I could lift more weight with these shoes and I did!",
      "rating": 5.0,
      "verified": true,
      "author": "Mary L. McCurdy",
      "helpful_votes": 0,
      "publication_date": 20160513
    },
    {
      "title": "highly recommend",
      "text": "Love these shoes. Really comfortable for long walks. I wear them playing Pickleball and my feet don't hurt afterwards like they always did in other shoes.",
      "rating": 5.0,
      "verified": true,
      "author": "Laurie",
      "helpful_votes": 0,
      "publication_date": 20170920
    },
    {
      "title": "good lateral movement support",
      "text": "Plenty of toe room in these, good lateral movement support. New shoes always feel to me like they have the best cushion, and that is probably true, but I will end up switching out the inserts with an aftermarket choice. I wear 7.5 regulars (D's) and they fit that way.",
      "rating": 5.0,
      "verified": true,
      "author": "Deb",
      "helpful_votes": 0,
      "publication_date": 20170819
    },
    {
      "title": "I usually buy Asics BUT...",
      "text": "These shoes were a huge disappointment. Terribly stiff and hurt my feet! I always get Asics, but these did not feel like Asics. I thought I could get them broken in, but even after a prolonged breaking in period, they KILL my feet! I should have gotten a refund for these.",
      "rating": 1.0,
      "verified": true,
      "author": "ETXpdn",
      "helpful_votes": 0,
      "publication_date": 20170508
    },
    {
      "title": "Only 2E remaining",
      "text": "Great sneakers. Be sure to check the size AND the width when you order.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisagail",
      "helpful_votes": 0,
      "publication_date": 20180706
    },
    {
      "title": "Nice Shoe - but too small",
      "text": "I like the shoe - but it's too small. I rarely have problems with shoes not fitting properly but this shoe ran too small. I normally wear a size 9 but it didn't fit. Haven't decided if I'm going to re-order a larger size. Nice shoe though.",
      "rating": 4.0,
      "verified": true,
      "author": "doggerfolk",
      "helpful_votes": 0,
      "publication_date": 20170109
    },
    {
      "title": "... a description let me know what size would be good for me to order",
      "text": "When I was looking at these Training Shoes a description let me know what size would be good for me to order. I have purchased other Asics before. I order a 9 W. They fit as expected. I have used twice and I am very satisfied with these shoes.",
      "rating": 4.0,
      "verified": true,
      "author": "Sharon",
      "helpful_votes": 0,
      "publication_date": 20160921
    },
    {
      "title": "How wide is the toearea.",
      "text": "The toe area was more narrower-I have never had to order wide shoes!",
      "rating": 3.0,
      "verified": true,
      "author": "Lorna J Walker",
      "helpful_votes": 0,
      "publication_date": 20200216
    },
    {
      "title": "Shoe Size Review",
      "text": "Like some posts mentioned, the shoe width comes narrow. I ordered a size 7 2E, which stands for x2 wide, (6.5 B (M) / 2E were sold out) and I wear a 6.5 medium width B(M). The wide shoe size does not actually feel wide at all and I am happy with the fit. 6 2E fit too small and I had no room for my toes to wiggle, but the width is not noticeable to be wide. I would have rated 5/5 stars if I could have tried out 6.5 B(M) / 2E to see how they compared to 7 2E.",
      "rating": 4.0,
      "verified": true,
      "author": "chava",
      "helpful_votes": 0,
      "publication_date": 20170112
    },
    {
      "title": "That is one thing I like to try on first but I am so glad ...",
      "text": "It took me a while to finally brave buying a shoe online. That is one thing I like to try on first but I am so glad I did. They are light weight, supportive and made well. Exactly what I need and I plan to buy another pair.",
      "rating": 5.0,
      "verified": true,
      "author": "Angela Endres",
      "helpful_votes": 0,
      "publication_date": 20161215
    },
    {
      "title": "I love these shoes",
      "text": "I love these shoes! I am on my feet all day. I use orthotics and have wide feet. Finding shoes that accommodate both without squeezing my feet is difficult. These are great for both!",
      "rating": 5.0,
      "verified": true,
      "author": "Spicenlife",
      "helpful_votes": 0,
      "publication_date": 20161212
    },
    {
      "title": "Runs small",
      "text": "I really like the look of the sneaker. Even better it came in a 2E. However this sneaker runs really small. In the past I have ordered this same size from a different manufacturer and they were somewhat large. So, if you just can't live without this sneaker, be advised to order 1/2 size up.",
      "rating": 3.0,
      "verified": true,
      "author": "Jay Mey",
      "helpful_votes": 0,
      "publication_date": 20160915
    },
    {
      "title": "Great shoe for flat feet",
      "text": "Better than previous version - more arch support. My only complaint is the color. The white gets dirty too quickly, and the blue is a very ugly blue. But, I do not buy them for the color I buy them for the fit.",
      "rating": 5.0,
      "verified": true,
      "author": "Blues Lover from NJ",
      "helpful_votes": 0,
      "publication_date": 20170623
    },
    {
      "title": "5 but had to exchange the first pair for a 7 which fit perfectly with great arch support - much needed for someone who suffers .",
      "text": "I have a somewhat narrow foot but need a bigger toebox. I normally wear a 6.5 but had to exchange the first pair for a 7 which fit perfectly with great arch support - much needed for someone who suffers with plantar fasciitis!",
      "rating": 5.0,
      "verified": true,
      "author": "JRF",
      "helpful_votes": 0,
      "publication_date": 20160728
    },
    {
      "title": "The sizing was good. Unfortunately",
      "text": "My shoes arrived today. The sizing was good . Unfortunately , the shoe has a satin . I would not mind if the shoe was a different color . But because it's white it's very noticeable . Definitely not happy at all . I usually get my asics from rack room . Decided to try out Amazon , but was not content at all .",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170712
    },
    {
      "title": "New shoes for Jazzercise",
      "text": "Needed new shoes for my Jazzercise class and these fit the bill nicely. They're sturdy enough for exercise and flexible enough for bending the foot when needed. Arch support is good. Since Jazzercise involves strength training as well as cardio workouts, I needed cross training shoes.",
      "rating": 5.0,
      "verified": true,
      "author": "Pianomom",
      "helpful_votes": 0,
      "publication_date": 20170810
    },
    {
      "title": "Great for walking",
      "text": "Great for walking! I've already worn these out and will be ordering a new pair. When I say \"worn them out\" it's from pounding the pavement. Darn good quality shoe. Didn't have a problem breaking them in. Very comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Dave and Jay Raber",
      "helpful_votes": 0,
      "publication_date": 20170719
    },
    {
      "title": "I have happy feet!",
      "text": "I'm a huge fan of ASICS sneakers. I was not disappointed. Once again, I received the perfect pair and they fit perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Emilie J. Howard ~ Author",
      "helpful_votes": 0,
      "publication_date": 20170722
    },
    {
      "title": "Terrible. Gave me blisters.",
      "text": "Super disappointed at this ASICS sneakers. Gave me blisters. I don’t want to throw it away bcos I paid good money for this. But I feel hesistant to donate it bcos I don’t want another poor soul to suffer like I did.",
      "rating": 1.0,
      "verified": true,
      "author": "Zoey",
      "helpful_votes": 0,
      "publication_date": 20171218
    },
    {
      "title": "This is an excellent shoe with great arch support and cushioning",
      "text": "Purchased for playing tennis. This is an excellent shoe with great arch support and cushioning. It provides excellent stability and ease of movement both on and off the court with no foot fatigue.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathleen Overman",
      "helpful_votes": 0,
      "publication_date": 20180802
    },
    {
      "title": "I'm an asics baby!!",
      "text": "I love my new asics workout shoes! They fit perfectly and are comfortable from day 1. I normally wear a 7, but always get the 7.5 as my feet swell as I run. I recommend them to any active person",
      "rating": 5.0,
      "verified": true,
      "author": "Roxanne D. Chiasson",
      "helpful_votes": 0,
      "publication_date": 20170718
    },
    {
      "title": "Too short, too narrow",
      "text": "Have worn 11W Asics trainers for years, but in these shoes 12 with 2E width is still too short and too narrow for comfort, so I conclude that these were made by and for women with tiny little feet. Superb design and good construction I expect from Asics, but the size issue needs to be addressed.",
      "rating": 2.0,
      "verified": true,
      "author": "Sharehouse3",
      "helpful_votes": 0,
      "publication_date": 20160601
    },
    {
      "title": "This walking shoe is much stiffer than athletic styles. ...",
      "text": "This walking shoe is much stiffer than athletic styles. Needed all white for nursing, but definitely prefer something with less arch. My feet do hurt after a few days of wearing these in a row.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180118
    },
    {
      "title": "This is my 4th pair of these!  And not my last.",
      "text": "I have wide feet and have trouble finding a shoe that supports my foot but that also gives enough room so I can forget about my feet and go about my day in comfort. I love these shoes. I'm so happy to work all day and come home with out pain.",
      "rating": 5.0,
      "verified": true,
      "author": "B Webb",
      "helpful_votes": 0,
      "publication_date": 20160522
    },
    {
      "title": "Second pair I’ve owed..love them!",
      "text": "This is the second pair I’ve had of these and I really like them. Great for walking and working out in. The colors are nice and the quality is superior. They fit true to size and are roomy (wide) through the toe area.",
      "rating": 5.0,
      "verified": true,
      "author": "Terry Zangari",
      "helpful_votes": 0,
      "publication_date": 20180823
    },
    {
      "title": "these held up nicely (wore these few times during crappy weather already)",
      "text": "- Got these off season when they were $35. - was looking for solid sues with out fabric for a rainy day, these held up nicely (wore these few times during crappy weather already). - got two pairs one for me and other for my sister, both arrived with some wrinkles on the top part that I was afraid would start peeling off, which it didn't but it is not aesthetically pleasing to me",
      "rating": 4.0,
      "verified": true,
      "author": "Smoothie",
      "helpful_votes": 22,
      "publication_date": 20160503
    },
    {
      "title": "Size runs just a shade small IMHO",
      "text": "Fit as expected, but I deliberately purchased 1/2 size up and 1E wider than usual. Otherwise I love'em so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Dell Rosa",
      "helpful_votes": 0,
      "publication_date": 20180508
    },
    {
      "title": "Great wide low-ish (but still well supported) base to do ...",
      "text": "This is my workout sneaker! Great wide low-ish (but still well supported) base to do all kinds of cross training. You can jump rope, burpees, stretch out, etc. Great sneaker for all of the above and more!",
      "rating": 5.0,
      "verified": true,
      "author": "TrishV",
      "helpful_votes": 0,
      "publication_date": 20170417
    },
    {
      "title": "Great Sneaker",
      "text": "This review was written by Jessica. I wear these sneakers to do Zumba in. They provide really good arch support for my feet. My toes don't hurt and neither do my shins, knees, or calves after my workout. They are a great buy for someone with narrow feet such as myself.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 0,
      "publication_date": 20161023
    }
  ],
  "product_meta": {
    "title": "ASICS Womens GEL-190 TR-W Gel-190 Tr White Size: 5",
    "rating": 5,
    "feature_bullets": [
      "DuoMax Support System: A dual density midsole system positioned to enhance support and stability, positioned sport specifically",
      "Rearfoot GEL Cushioning System: Attenuates shock during impact phase and allows for a smooth transition to midstance",
      "Sole: Gum Rubber",
      "Closure: Lace-Up",
      "Shoe Width: Medium",
      "SpEVA Midsole Material: Improves bounce back characteristics and decreases midsole breakdown.",
      "Trusstic System Technology: Reduces the weight of the sole unit while retaining the structural integrity of the shoe",
      "Width Specific: Designed and built on lasts and molds that are tooled specifically to designated widths."
    ],
    "specifications": {
      "Product Dimensions": "29.46 x 18.8 x 11.18 cm; 311.84 Grams",
      "Date First Available": "6 Jun. 2015",
      "Manufacturer": "ASICS",
      "ASIN": "B00Q2KWYAG",
      "Item model number": "GEL-190 TR-W",
      "Department": "Women's"
    },
    "categories": [
      "Fashion & Athletic Trainers",
      "Nordic Walking Shoes",
      "Shoes",
      "Sports & Outdoor Shoes",
      "Women's Shoes",
      "Shoes & Bags"
    ],
    "price": 137.0
  }
}