{
  "website_summaries": [
    {
      "verdict": "With its jump-start capability and flashlight, the PowerAll Element makes for an excellent addition to any car's emergency kit, and can also recharge phones and tablets.",
      "pros": [
        "With its 12,000mAh battery and two USB ports, the PowerAll Element will fully recharge any smartphone multiple times",
        "Its 400-amp port lets it jump-start a car"
      ],
      "cons": [
        "The jump-starter cable is short, limiting flexibility when hooking it up to a car battery",
        "Weighing in at 2 pounds and measuring 6 inches long, it's too bulky to always carry around in an coat pocket or bag"
      ],
      "aspects": {},
      "publication_date": 20150316,
      "rating": 7.0,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Good for one or two jumps",
      "text": "The add states so much for this, but fails on most ends, the clamps used on this were not very resistant to the heat thats generated when jump, i had to add washers to keep the teeth straight when starting a car, after no more than 20 uses, the reverse polarity module started smoking which made me highly distrust the device, the rubber armor that is on this item will eventually start peel back and stretch. The strongest suit that this charger has is it will charge an iphone 6s 3x's which is pretty good and the only reason im giving it more than 1 star. the light is not good, no better than the light on a iphone 6s",
      "rating": 2.0,
      "verified": true,
      "author": "Daniel S. Luna",
      "helpful_votes": 2,
      "publication_date": 20170324
    },
    {
      "title": "My husband wanted this for when we drive to the ...",
      "text": "My husband wanted this for when we drive to the beach so we can charge our phones and jump the car if the battery dies. He could jump his truck with it but just once. We used it to charge our phones while on vacation in Europe and it could only charge them once before we have to recharge the battery. We returned it because it doesn't seem to be worth $100.",
      "rating": 3.0,
      "verified": true,
      "author": "NCgirl",
      "helpful_votes": 0,
      "publication_date": 20160922
    },
    {
      "title": "Not as advertised!!",
      "text": "First one ordered would only jump off a single time and then drop to one light of charge.. returned for a new one used it to jump a stranded motorist and indicator dropped to two lights of charge.. going to keep it but nothing like the advertising, no way going to get 20 jumps off of this.. lucky to get two.",
      "rating": 2.0,
      "verified": true,
      "author": "Nathan",
      "helpful_votes": 3,
      "publication_date": 20160303
    },
    {
      "title": "It's not weather proof. The cover for the flashlight ...",
      "text": "It's not weather proof. The cover for the flashlight is missing, you can see the circuits, and the rubber is pulling out from the case.",
      "rating": 3.0,
      "verified": true,
      "author": "robert t griffin",
      "helpful_votes": 0,
      "publication_date": 20160118
    },
    {
      "title": "Gonna get one for my kid away at college",
      "text": "had some issues with it not working in the beginning. Discovered it was a grounding issues. Changed where I placed black clamp. Works flawless",
      "rating": 4.0,
      "verified": true,
      "author": "Jamiehe",
      "helpful_votes": 0,
      "publication_date": 20160620
    },
    {
      "title": "but i like the product",
      "text": "the power button is kind of tricky to figure out when you have relaly turned it off, but i like the product line",
      "rating": 4.0,
      "verified": true,
      "author": "D. A. Carey",
      "helpful_votes": 0,
      "publication_date": 20160729
    },
    {
      "title": "PowerFul portable power source",
      "text": "Great product! Very glad I bought it. Starts cars and generators with no problem. A traveler's must have item.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert A. Thorpe",
      "helpful_votes": 0,
      "publication_date": 20160501
    },
    {
      "title": "Five Stars",
      "text": "Got this for my son for Christmas and she loved it.",
      "rating": 5.0,
      "verified": true,
      "author": "Cathy",
      "helpful_votes": 0,
      "publication_date": 20170103
    },
    {
      "title": "complete waste of money",
      "text": "Charges as many times as a $10 charger does, complete waste of money. Emailed Zogo sports twice about a fault with the unit and received no reply. Zogo sports just as useless as the Powerall.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160714
    },
    {
      "title": "Given as a gift. A home run-",
      "text": "This was given as a gift to my son, so I cannot give a first-hand review on the product. But I WILL tell you that my son's tech friends and his father-in-law immediately linked to the site to purchase one for themselves.",
      "rating": 5.0,
      "verified": true,
      "author": "peeking",
      "helpful_votes": 0,
      "publication_date": 20150502
    },
    {
      "title": "I did charge a phone and it worked great.",
      "text": "Haven't had the need to use it yet to charge my battery, which is what I purchased it for. I did charge a phone and it worked great.",
      "rating": 4.0,
      "verified": true,
      "author": "Tammy L",
      "helpful_votes": 0,
      "publication_date": 20160628
    },
    {
      "title": "Not What It's Cracked Up To Be",
      "text": "Bought both this and an AntiGravity battery for different vehicles. Neither battery would start my Harley Ultra without the bike's battery in it... The instructions claim that you can start a car up to 20 times on one charge. Don't believe it...",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20151020
    },
    {
      "title": "Five Stars",
      "text": "This product is amazing and versatile. Will recommend to others.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew",
      "helpful_votes": 0,
      "publication_date": 20150708
    }
  ],
  "product_meta": {
    "title": "PowerAll PBJS12000AE Water Resistant Portable Lithium Jump Starter (IP65)",
    "description": "PowerAll Element Emergency Jump Starter Designed for the outdoor enthusiast with IP65 water, snow, shock, and dust proof rating Can jump start your vehicle twenty times on a full charge Also functions as a portable power bank with 2 5V/2.1A USB ports Integrated emergency LED flashlight with on, strobe, and SOS flash modes Battery Type: Lithium-ion Battery Capacity: 12,000 mAh Battery Life Cycles: 1,000 Peak Amps: 400A Jump Start Capacity: 5.7L engine Voltage feedback protection with MOSFETs Reverse polarity and spark-proof protection Overload protection Over-current protection Short circuit protection Over voltage protection Over charge protection Package Includes: PowerAll Element, AC adapter, DC adapter, USB adapter, jumper cables, hard plastic carrying case",
    "rating": 4.2,
    "feature_bullets": [
      "Rugged durability - ip65 water/dust resistant and shockproof",
      "Compact car jump starter that can jump start your car 20 times on a full charge",
      "Ultra-Bright led flash light, strobe light, and SOS signal light that lasts 120 hours",
      "Built-In protection features: over current protection; short circuit protection; overload protection; over-voltage protection; over-charge protection",
      "Portable compact design that will easily fit in your pocket, backpack, or glove box for convenience"
    ],
    "specifications": {
      "Manufacturer": "PowerAll",
      "Brand": "PowerAll",
      "Model": "PBJS12000AE",
      "Item Weight": "12.8 ounces",
      "Product Dimensions": "6 x 3 x 1.2 inches",
      "Item model number": "PBJS12000AE",
      "Batteries": "1 Product Specific batteries required.",
      "Is Discontinued By Manufacturer": "No",
      "Manufacturer Part Number": "PBJS12000AE",
      "Folding": "No",
      "Vehicle Service Type": "Boats, 12V cars",
      "ASIN": "B00QFX0PM4",
      "Customer Reviews": "4.2 out of 5 stars33 ratings4.2 out of 5 stars",
      "Best Sellers Rank": "#363,150 in Automotive",
      "Date First Available": "December 1, 2014"
    },
    "categories": [
      "Jump Starters",
      "Automotive Parts & Accessories",
      "Tools & Equipment",
      "Jump Starters, Battery Chargers & Portable Power",
      "Automotive"
    ],
    "price": 82.89
  }
}