{
  "website_summaries": [
    {
      "verdict": "If slipping is your main safety concern, look no further than these grooved-sole shower shoes.",
      "pros": [
        "Heavy duty grooved soles independently tested and proven to resist slipping",
        "Soft, comfortable nylon mesh uppers",
        "No inside front and back seams to create skin issues",
        "Expanded soft foot opening",
        "Higher back on uppers to minimize slippers coming off feet",
        "Available in a variety of sizes"
      ],
      "cons": [
        "Elastic may not hug feet securely at the smaller end of the range",
        "Consider sizing down"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Impossible to slip in these...",
      "text": "No more bath tub mats or sticky tape strips. These slippers are comfy and definitely more effective than anything else I've tried or even heard of. I put them on to get into the tub when taking a sit down bath. Take them off while washing my feet and slip them back on to get out. When I shower they are on the entire time except for a brief time as I remove one at a time to wash feet. Highly recommend for a safe bathing experience. Would also be good for any slick surface.",
      "rating": 5.0,
      "verified": true,
      "author": "Pam",
      "helpful_votes": 10,
      "publication_date": 20190529
    },
    {
      "title": "Super Grip Soles",
      "text": "I bought the shoes for my father who has fallen several times in the shower. The shoes have a great sole that is helping him move around more confidently in the shower. I ordered XL size, that said 10-12. My dad wears size 12 and these were too small. However, I cut the toe to give his toes more room and this is working. I think the size should only be listed to maybe an 11. I would recommend these for anyone having trouble with slipping in the shower.",
      "rating": 4.0,
      "verified": true,
      "author": "Kim",
      "helpful_votes": 11,
      "publication_date": 20180703
    },
    {
      "title": "They are everything they say they are and better",
      "text": "I love the shower shoe our landlord put in a new tub with texture bottom it seemed slippery i was afraid i would fall i have neuropathy. the shower shoes were a blessing i could finalky take a shower they are perfect and have give me confidence and kept me from slipping",
      "rating": 5.0,
      "verified": true,
      "author": "Dee",
      "helpful_votes": 12,
      "publication_date": 20180625
    },
    {
      "title": "great but with a gliche",
      "text": "great item, while in the shower I don't feel like I could ever fall, but, when getting out of bathtub and placing foot with wet shoe on bathroom carpet my foot slides inside the wet shoe taking me off balance and sliding forward, so a person has to come up with a way to take the shoe off at time of vacating shower, that's my dilemma. I am disabled and unable to function as a normal person in the bending over and taking shoes off inside a wet tub. if you don't have that problem then these are for you.",
      "rating": 5.0,
      "verified": true,
      "author": "catskinner",
      "helpful_votes": 36,
      "publication_date": 20150405
    },
    {
      "title": "It Helps",
      "text": "Got these for my Mother-in-law who recently had surgery and was having difficulty in the shower. These are a big help, even though we got her a shower chair she still needed to stand up to clean her self well. And these shoes helped to provide her the ability to stand with out falling.",
      "rating": 5.0,
      "verified": true,
      "author": "Craig",
      "helpful_votes": 8,
      "publication_date": 20190103
    },
    {
      "title": "The quality seems good and really happy with purchase",
      "text": "What a pleasant surprise this shower shoes have been. They have protected the bottoms of my feet in a hard tile shower and I feel they keep me from getting anything unhealthy that could be lurking in gym showers. The quality seems good and really happy with purchase! Update...I just repurchased a Medium again and they are smaller and thus don't fit my foot well...wondering if a different manufacturer is making now since the first ones I bought in Feb",
      "rating": 4.0,
      "verified": true,
      "author": "Sunshine",
      "helpful_votes": 17,
      "publication_date": 20150214
    },
    {
      "title": "Great little slip-resistant slippers for shower, hotel, or airport - or even around the house",
      "text": "I wanted something to wear on my feet in public places where I wouldn't normally wear shoes. I like these because they don't take up any room in my suitcase and keep me from walking on germy floors - plus, hopefully, keep me from slipping. I like them enough to wear around the house instead of slippers - they're sturdier. I ended up buying two pairs for myself and one for my mom. I must report that they run a little small. I wear a women's 10 and my big toe sticks out a bit. I probably should have ordered an XL.",
      "rating": 5.0,
      "verified": true,
      "author": "Christy K",
      "helpful_votes": 2,
      "publication_date": 20190622
    },
    {
      "title": "Good quality",
      "text": "Good quality shower shoe. It's a little big though so I would recommend ordering a size smaller than you normally wear.",
      "rating": 5.0,
      "verified": true,
      "author": "Xquizitestillettos",
      "helpful_votes": 17,
      "publication_date": 20150202
    },
    {
      "title": "Slip Resistant is no lie!",
      "text": "These shower shoes are wonderful. I am unable to bathe myself so I purchased a pair of these slip resistant shower shoes for not only myself but for the person who bathes me. The shower shoes make me much more confident in the tile shower and they allow me to stand with confidence. I would highly recommend them.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrea Adams-McKnight",
      "helpful_votes": 2,
      "publication_date": 20180625
    },
    {
      "title": "Nice Mesh Feet Protection for Boat, Pool, Shower, and Trail Bathing",
      "text": "I was looking for something light weight to use in rivers and streams when I hike and camp and this was exactly what I hoped they would be. They seem to be built well and have a grooved slip-resistant bottom that would reasonably protect the foot from most broken glass and the top mesh is fine enough to use as emergency strainer if needed. There appear to be others like this for less elsewhere but not in the larger size. If the product fails on the trail I will update the review.",
      "rating": 5.0,
      "verified": true,
      "author": "john b",
      "helpful_votes": 4,
      "publication_date": 20161020
    },
    {
      "title": "Not safe on slick surfaces",
      "text": "Slippery and unsafe worn in my clean tub-shower combo. Not a good product for slick surfaces. Not sure how it got such high ratings. I''m an athletic, yoga practitioner and would not recommend this to even the most agile people to use in a tub. Perhaps it's intended for rough tiled shower stalls? One star for good fit.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 7,
      "publication_date": 20160706
    },
    {
      "title": "These got sopping wet after I took a shower",
      "text": "These slippers are useless. They have good tread all right. But they got absolutely soaked after I took a shower. It would have taken days for them to dry out. I threw them out.",
      "rating": 1.0,
      "verified": true,
      "author": "Whimsicalwoman",
      "helpful_votes": 2,
      "publication_date": 20190706
    },
    {
      "title": "Great tread on the soles",
      "text": "I bought these for my 89 year mother. She has a shower with many safety handles, however as she would use the handles to rise from her shower seat, her feet would slide on the shower floor. These shoes have been the answer! The tread on the shoe bottoms give her the traction she needs to stand up safely in the shower.",
      "rating": 5.0,
      "verified": true,
      "author": "Kids Rock",
      "helpful_votes": 0,
      "publication_date": 20180929
    },
    {
      "title": "Not returnable...too bad that wasn't mentioned.",
      "text": "I purchased these for my spouse. When they came in, he looked at them and said he didn't want them, they are too narrow. So I tried to do a \"return\" No return is offered. Now, I am stuck with 2 pairs of these!",
      "rating": 1.0,
      "verified": true,
      "author": "P John",
      "helpful_votes": 0,
      "publication_date": 20200917
    },
    {
      "title": "They are good quality, they work perfect for my dad and ...",
      "text": "They are good quality, they work perfect for my dad and he is 84 years old. He only uses them when he takes a shower.",
      "rating": 5.0,
      "verified": true,
      "author": "Lourdes",
      "helpful_votes": 3,
      "publication_date": 20170318
    },
    {
      "title": "Maybe buy smaller size.",
      "text": "With a shoe size of 101⁄2 W, I followed guidelines and ordered the XL. They are way too big, there is no elastic to hold them on, and the sticky soles pulled them right off my feet. I might have exchanged for the next size down, but it was unavailable.",
      "rating": 2.0,
      "verified": true,
      "author": "italtrav",
      "helpful_votes": 4,
      "publication_date": 20160228
    },
    {
      "title": "SAFETY",
      "text": "This product is really a life protector and saver. I had slipped twice in the shower after moving to a new handicapped apartment and was really nervous about taking a shower by myself. I tried restrictive tape on the floor of the shower and it was no help. I tried an expensive bath matt and it was no help. I tried these shoes and amazingly they work like someone is with me holding me steady. Great product....",
      "rating": 5.0,
      "verified": true,
      "author": "Pat Cronin",
      "helpful_votes": 0,
      "publication_date": 20200909
    },
    {
      "title": "They did not get used",
      "text": "I purchased these for my husband, however he passed away before he could use them. I donated them to a local organization and am not able to provide an opinion on how well they served the individual who may have received them.",
      "rating": 3.0,
      "verified": true,
      "author": "Jo",
      "helpful_votes": 0,
      "publication_date": 20181226
    },
    {
      "title": "Tight for large feet",
      "text": "For a high instep, these needed a small cut in the fabric for the right fit. Great non-skid for showers, easy to put on and take off.",
      "rating": 3.0,
      "verified": true,
      "author": "johnnysausages",
      "helpful_votes": 0,
      "publication_date": 20200612
    },
    {
      "title": "Feel much more secure.  Best purchase.",
      "text": "I love these. I feel much more secure in the shower and getting in and out. The tread is great - no slipping at all. Bought another pair in case these ever wear out or are no longer available, and also bought a pair for my mother.",
      "rating": 5.0,
      "verified": true,
      "author": "CRSmith",
      "helpful_votes": 0,
      "publication_date": 20190420
    },
    {
      "title": "Very sturdy",
      "text": "My husband had a stroke and has balance problems. He is very afraid of falling. These shower shoes make him feel more confident in the shower. They are very sturdy. He wore one pair every day for almost a year before they felt like they had stretched out, so we got him a new pair. He wears either a 9 1/2 or a 10 shoe. I originally bought the large, but it was too big. The medium fits him just fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Penelope S. Haskins",
      "helpful_votes": 0,
      "publication_date": 20190608
    },
    {
      "title": "Too heavy",
      "text": "I bought these shower shoes for travel. They are well made, but too heavy for my purpose. I returned them.",
      "rating": 2.0,
      "verified": true,
      "author": "Dave in California",
      "helpful_votes": 0,
      "publication_date": 20170508
    },
    {
      "title": "Non-slip shower slippers",
      "text": "Works well to add stability when my husband transfers from his wheelchair to his shower chair.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeanette",
      "helpful_votes": 0,
      "publication_date": 20191010
    },
    {
      "title": "Not worth the $",
      "text": "Don't waste your money or buy better quality if you plan to use frequently. Used for camping and didn't hold up.",
      "rating": 2.0,
      "verified": true,
      "author": "Crystal Watkins",
      "helpful_votes": 0,
      "publication_date": 20191111
    },
    {
      "title": "great solid footing",
      "text": "these are great. provide stability and solid footing for shower floor, which is rough stone and very painful after many bone surgeries on both feet. I do not have tile, so don't know if they work on slippery tile, but they allow a great surface for sharp rocky shower floor.",
      "rating": 5.0,
      "verified": true,
      "author": "drg",
      "helpful_votes": 0,
      "publication_date": 20180214
    },
    {
      "title": "so helpful",
      "text": "These are for a senior in the shower. She says they work great! The aide helping was impressed & wanted to know where she got them! A hit that helps us feel she is safer!",
      "rating": 5.0,
      "verified": true,
      "author": "Cindy Reynolds",
      "helpful_votes": 0,
      "publication_date": 20200830
    },
    {
      "title": "Be careful of the size you choose.",
      "text": "Do yourself a favor and order a size smaller if you are on the lower end of the size listed. I wear a 9-10 women's, and therefore purchased the 9-11 size. They wouldn't stay on my feet well enough to be able to tell you if the shoes really are slip proof or not. I ended up giving them to a friend with larger feet.",
      "rating": 1.0,
      "verified": true,
      "author": "Cynthia Sachs-Bustos",
      "helpful_votes": 0,
      "publication_date": 20200330
    },
    {
      "title": "Remember to Use Them Outside the Shower Too!",
      "text": "great shoes! very useful for clumsy or old people with a hard time getting out of the shower because they might slip on the water on the floor.",
      "rating": 5.0,
      "verified": true,
      "author": "alliecat",
      "helpful_votes": 0,
      "publication_date": 20170715
    },
    {
      "title": "Safety in the shower and durability",
      "text": "We haven’t had these very long so we’re just now using them. They actually help me feel safer in our shower. Not sure on the durability because we haven’t used them long term.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190514
    },
    {
      "title": "Non-Returnable...2 left shoes!!!",
      "text": "This item is non-returnable and I bought for a trip to France. Once in France, I put them on to shower and they felt funny. I got to looking and I got 2 left shoes!!! So value for my money since I can't return and have company make it right...i would give a ZERO but a 1 will have to do. Sad when these are checked before shipping. Otherwise, they are good shower shoes for the money.",
      "rating": 3.0,
      "verified": true,
      "author": "Jennifer",
      "helpful_votes": 0,
      "publication_date": 20191219
    },
    {
      "title": "Great product!",
      "text": "My husband is handicapped and needed something to help him get in and out of the shower without his feet slipping. These work perfectly. Would highly recommend this product for safety in the shower.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 4,
      "publication_date": 20150608
    },
    {
      "title": "Not Good Quality",
      "text": "The product needs to be revamped to provide the ability to slip foot into the tongue of the shoe. It does not have any give to the band - suggestion have it made from elastic. If elderly this could not be done by themselves. A waste of $30 as I bought two different sizes and did not return within the 30 day policy!",
      "rating": 2.0,
      "verified": true,
      "author": "LC",
      "helpful_votes": 0,
      "publication_date": 20181228
    },
    {
      "title": "It’s useless !",
      "text": "This item is useless! It’s supposed to have an elastic so you can enter your foot. Maybe a child’s foot can go in but it would be too large once you put it on. What a waste of money! Not even worth half a star!",
      "rating": 1.0,
      "verified": true,
      "author": "ARMANDO ARABI",
      "helpful_votes": 0,
      "publication_date": 20181227
    },
    {
      "title": "Provide good traction on wet floors",
      "text": "Ordered these for use after ankle surgery to provide traction while showering. They work just fine. The size is just a little small for me.",
      "rating": 4.0,
      "verified": true,
      "author": "Frau Rau",
      "helpful_votes": 0,
      "publication_date": 20181209
    },
    {
      "title": "Heavy duty soles are great.",
      "text": "The soles have excellent non-slip construction. I feel confident they will help prevent slipping in the shower. They are well constructed. The sizing runs a little small. Otherwise I am very satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "Carla",
      "helpful_votes": 0,
      "publication_date": 20190623
    },
    {
      "title": "A nice shower slipper.",
      "text": "I use this in the shower to soften the effect on my foot. I have heel pain so this doesn't help me much. I use it.",
      "rating": 3.0,
      "verified": true,
      "author": "Barbi",
      "helpful_votes": 0,
      "publication_date": 20190814
    },
    {
      "title": "Durable",
      "text": "Good shoes but run small. I ordered Extra Large but they are still to small.",
      "rating": 3.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20190609
    },
    {
      "title": "I purchased these for our new bathfitters tub and shower ...",
      "text": "I purchased these for our new bathfitters tub and shower, as there was no bathtub mat, which left me feeling somewhat insecure. Using these shoes I no longer had any feelings of uncertainty.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170320
    },
    {
      "title": "Great for tender feet!",
      "text": "Got these for my boss, who has tender feet and found shower mats uncomfortable to walk on. She loves them!",
      "rating": 5.0,
      "verified": true,
      "author": "J. Madge",
      "helpful_votes": 0,
      "publication_date": 20180316
    },
    {
      "title": "Shower Safety",
      "text": "Purchased Slip Resistant Shower Shoes. Product received promptly, as advertised. Used safely by Senior Citizen in Home Shower environment. Completely satisfied with purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Archie M. Mustard",
      "helpful_votes": 0,
      "publication_date": 20190106
    },
    {
      "title": "Non slip shower shoes",
      "text": "These are excellent and eliminate my fear of falling. They also dry quickly!",
      "rating": 5.0,
      "verified": true,
      "author": "Deborah E. Michalak",
      "helpful_votes": 0,
      "publication_date": 20181219
    },
    {
      "title": "Super safe",
      "text": "I slipped in the shower and could have been badly hurt so i bought these. Now I can’t slip even if i wanted to. They are great",
      "rating": 5.0,
      "verified": true,
      "author": "Bob ",
      "helpful_votes": 0,
      "publication_date": 20190601
    },
    {
      "title": "Used shoes like this when we traveled",
      "text": "Used shoes like this when we traveled. Looked for replacement for a year and then these showed up on Amazon. Will always carry in my luggage.",
      "rating": 5.0,
      "verified": true,
      "author": "Josephine Blanchard",
      "helpful_votes": 0,
      "publication_date": 20170626
    },
    {
      "title": "Slippers",
      "text": "Worked as they should just not easy to get on and off",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181213
    },
    {
      "title": "These shower slippers are a great buy. I purchased a cheaper pair but couldn't ...",
      "text": "These shower slippers are a great buy. I purchased a cheaper pair but couldn't get them on, the elastic was so tight. These are just right.",
      "rating": 5.0,
      "verified": true,
      "author": "jonesy",
      "helpful_votes": 0,
      "publication_date": 20170709
    },
    {
      "title": "Good for elderly",
      "text": "Got for my 88 year old Mom... easy to slip on, good quality and I don’t have to worry about her slipping in the shower",
      "rating": 5.0,
      "verified": true,
      "author": "Kathleen",
      "helpful_votes": 0,
      "publication_date": 20180914
    },
    {
      "title": "but instead purchased it as my feet are very tender when in contact with a hard surface like tile. These shower shoes supplied t",
      "text": "Did not purchase this product for its slip resistance, although it certainly does do that, but instead purchased it as my feet are very tender when in contact with a hard surface like tile. These shower shoes supplied the foot comfort I needed in the shower. As to how long they will last, have yet to find out as I only recently purchased them.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda",
      "helpful_votes": 2,
      "publication_date": 20150509
    },
    {
      "title": "non slip sole",
      "text": "These shower shoes have a great non skid sole. Order a smaller size than your shoe size.",
      "rating": 5.0,
      "verified": true,
      "author": "John W. Kercher",
      "helpful_votes": 0,
      "publication_date": 20180322
    },
    {
      "title": "Loves these!",
      "text": "Purchased for my 80 year old father to use in shower. He loves them and even wears them while not in the shower for safety.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180918
    },
    {
      "title": "Advertized womens shoe size is wrong.",
      "text": "I wear a size 8 shoe. These shower shoes are much too large. I ordered size 6-8 womens. Item would be extremely dangerous on a wet surface.",
      "rating": 1.0,
      "verified": true,
      "author": "Carole Sue",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "These give me confidence stepping in the shower.",
      "text": "The shoes fit well. Easy to get on and off. I feel secure while in the bathtub but I'm just wondering how long they will hold up because I just started using them about a week ago.",
      "rating": 5.0,
      "verified": true,
      "author": "Sonya Clements",
      "helpful_votes": 0,
      "publication_date": 20190512
    },
    {
      "title": "They fit smaller",
      "text": "I bought there for my mother to use in the shower. She really likes them, so it’s 2 thumbs up from me.",
      "rating": 5.0,
      "verified": true,
      "author": "J.C.",
      "helpful_votes": 0,
      "publication_date": 20190730
    },
    {
      "title": "Not non-slip",
      "text": "Not non slip. I tried these in the shower. They were more slippy than going barefoot.",
      "rating": 1.0,
      "verified": true,
      "author": "E. ONeil",
      "helpful_votes": 8,
      "publication_date": 20150727
    },
    {
      "title": "Peace of Mind",
      "text": "Tthe best shower slippers on the market! I feel so much better knowing that my 88 year old mother wears them everytime she showers. Do your research as I did. It's worth paying a little more for quality!",
      "rating": 5.0,
      "verified": true,
      "author": "B. Seldin",
      "helpful_votes": 0,
      "publication_date": 20161212
    },
    {
      "title": "Good quality, works well for intended purpose",
      "text": "bought for wheelchair bound mom so she won't slip during transfers in her shower. Good quality, works well for intended purpose.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda S. Ahrens",
      "helpful_votes": 2,
      "publication_date": 20150410
    },
    {
      "title": "They are pretty nice for shower shoes but they are VERY heavy",
      "text": "They are pretty nice for shower shoes but they are VERY heavy. I put them in my travel kit and lighter weight would have been nice.",
      "rating": 4.0,
      "verified": true,
      "author": "Emma Lorene",
      "helpful_votes": 0,
      "publication_date": 20170103
    },
    {
      "title": "Not so safe for me",
      "text": "I have a movement disorder and purchased this because it was advertised as being safer than other products. In my case, they are less safe for two reasons. First, they don't stay on one's foot very well; the elastic mesh is too loose. Second, the soles are flat, heavy and somewhat to sticky on tile floors, creating a trip hazard.",
      "rating": 2.0,
      "verified": true,
      "author": "ress",
      "helpful_votes": 0,
      "publication_date": 20160229
    },
    {
      "title": "Okay, except....",
      "text": "Soap gets in through the mesh and stays. No way to rinse feet adequately.",
      "rating": 1.0,
      "verified": true,
      "author": "Mud Bug",
      "helpful_votes": 0,
      "publication_date": 20191213
    },
    {
      "title": "I loved them. It kept me from slipping in that ...",
      "text": "I bought these for my trip on a cruise. I loved them. It kept me from slipping in that shower. It held up the entire trip and actually fit my size 11 feet quite snug. I would buy these again. I just wish it was a bigger size for my boyfriend.",
      "rating": 5.0,
      "verified": true,
      "author": "Desiree",
      "helpful_votes": 0,
      "publication_date": 20150726
    },
    {
      "title": "The product is nice however they were too small",
      "text": "The product is nice however they were too small, I gave them away. The ones I ordered previously were too large, again they were nice just didn't fit. Wish they would have.",
      "rating": 4.0,
      "verified": true,
      "author": "Carolyn W Eaker",
      "helpful_votes": 0,
      "publication_date": 20180531
    },
    {
      "title": "Must be able to puck up your feet",
      "text": "I liked that it really keeps someone from slipping. Don't put it on someone who drags there feet though",
      "rating": 5.0,
      "verified": true,
      "author": "Carlotta B.",
      "helpful_votes": 0,
      "publication_date": 20181203
    },
    {
      "title": "Great product",
      "text": "The shower shoes are just like described and very comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191105
    },
    {
      "title": "Not falling",
      "text": "I really was amazed at how secure I felt. You can wash your hair and use shower gel with confidence that you won’t slip if any falls on the floor. Very, very happy with this product",
      "rating": 5.0,
      "verified": true,
      "author": "Doris M. King",
      "helpful_votes": 0,
      "publication_date": 20190623
    },
    {
      "title": "Feel Safe",
      "text": "They feel pretty safe. I had knee surgery when i am showering i have to sit on stool, but getting in and out of wet tub is scary part. With these on a feel a lot safer about not slipping.",
      "rating": 4.0,
      "verified": true,
      "author": "bo",
      "helpful_votes": 0,
      "publication_date": 20180921
    },
    {
      "title": "nope",
      "text": "I have tried the shower shoes and they are a disappointment. They are a size 10-12 and I wear a 10 to 10/12. There is lots of space behind the heal and as soon as they get wet they come off my feet. They are no where near worth the cost of $18.95. I would like to have my money back and I'll be glad to return the shoes to you.",
      "rating": 1.0,
      "verified": true,
      "author": "maurice hudson",
      "helpful_votes": 0,
      "publication_date": 20160818
    },
    {
      "title": "No return",
      "text": "Way too big even though they are supposed to be for my shoe size. And they can’t be returned. I just donated 15 dollars to amazon. Not happy",
      "rating": 1.0,
      "verified": true,
      "author": "Janice L Granata",
      "helpful_votes": 0,
      "publication_date": 20200608
    },
    {
      "title": "More info on size is needed",
      "text": "Shower shoes were much too small. I wear a women’s size 10 shoe and ordered large. Disappointed because they seem like a good product.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181218
    },
    {
      "title": "Very pleased with these.",
      "text": "These work well to prevent slipping in the shower. As for sizing, I wear a size 81/2 which falls in-between the 2 sizes available. I bought the smaller size and they fit perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "read2day",
      "helpful_votes": 5,
      "publication_date": 20150325
    },
    {
      "title": "Good product but not enough sizes!",
      "text": "I like these a lot but the sizing is inadequate; there should be more sizes. I wear a women's 9.5 so I got the large but they're much too large and I walk right out of them. However, the size mediums would be too small as apparently they only go up to size 8.",
      "rating": 3.0,
      "verified": true,
      "author": "Christine",
      "helpful_votes": 0,
      "publication_date": 20161117
    },
    {
      "title": "Four Stars",
      "text": "Good sturdy and mesh does not tear as in the cheaper ones",
      "rating": 4.0,
      "verified": true,
      "author": "WLW",
      "helpful_votes": 0,
      "publication_date": 20170821
    },
    {
      "title": "Are not slip proff",
      "text": "Terrible shoes. First time I stepped into a wet shower my foot slipped out from under me. Thank goodness for grab bars. Disappointed to see there was no return policy.",
      "rating": 1.0,
      "verified": true,
      "author": "Katherine Roudabush",
      "helpful_votes": 0,
      "publication_date": 20180117
    },
    {
      "title": "Five Stars",
      "text": "I bought these for my wife and she absolutely loves them.",
      "rating": 5.0,
      "verified": true,
      "author": "David Bartlett",
      "helpful_votes": 0,
      "publication_date": 20170123
    },
    {
      "title": "Poor fitting",
      "text": "Bought these several times and this is the first time they were made wrong",
      "rating": 1.0,
      "verified": true,
      "author": "Mary shenshew",
      "helpful_votes": 0,
      "publication_date": 20190122
    },
    {
      "title": "Really does stop slipping.",
      "text": "These made showering much safer for me. I have large feet (size 13) and still manage to get them to work.",
      "rating": 5.0,
      "verified": true,
      "author": "Kap U",
      "helpful_votes": 0,
      "publication_date": 20180803
    },
    {
      "title": "Shoes very slippery on wet tile floors—beware!",
      "text": "Previous pair=no slipping. This pair very slick on same floor—and no returns? These shoes do not meet safety minimums on wet shower tile floors—beware!",
      "rating": 1.0,
      "verified": true,
      "author": "a daily swimmer",
      "helpful_votes": 2,
      "publication_date": 20180221
    },
    {
      "title": "Very satisfied",
      "text": "Exactly as described, and I will be ordering a second pair.",
      "rating": 5.0,
      "verified": true,
      "author": "Sharon K. Miller",
      "helpful_votes": 0,
      "publication_date": 20190304
    },
    {
      "title": "Four Stars",
      "text": "flat and easy to pack but a little too bulky for a back pack.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170215
    },
    {
      "title": "Kindness for a Friend",
      "text": "Reorder this pair for a friend. The first pair I ordered were two big. I hope she likes them.",
      "rating": 5.0,
      "verified": true,
      "author": "Martha",
      "helpful_votes": 0,
      "publication_date": 20200916
    },
    {
      "title": "Not Slip Resistant",
      "text": "These shoes were not safe for my 86 yr old mother to use in shower. Unfortunately, they can't be returned.",
      "rating": 1.0,
      "verified": true,
      "author": "Cass R. Chandler",
      "helpful_votes": 0,
      "publication_date": 20190306
    },
    {
      "title": "Great help",
      "text": "These are wonderful for anyone having problems getting in or out of a bathtub. So glad you had them for me to find.Great",
      "rating": 5.0,
      "verified": true,
      "author": "Doris A. Stokes",
      "helpful_votes": 0,
      "publication_date": 20151205
    },
    {
      "title": "and they will feel like they will fall off",
      "text": "The bottom of the slippers don't slip. However, there is no elastic on the foot inserts, and sizing is too broad. If the slippers don't fit tight, then your feet will slip inside the slippers, and they will feel like they will fall off. Therefore, just three stars for this produce.",
      "rating": 3.0,
      "verified": true,
      "author": "KK",
      "helpful_votes": 0,
      "publication_date": 20160215
    },
    {
      "title": "Five Stars",
      "text": "These are great for my mom to use in the shower. She has more confidence getting in and out.",
      "rating": 5.0,
      "verified": true,
      "author": "Paula Hansen",
      "helpful_votes": 0,
      "publication_date": 20180523
    },
    {
      "title": "Wonderful!",
      "text": "Very sturdy shoes and made to last. My mom loves them. I would definitely recommend these to anyone :)",
      "rating": 5.0,
      "verified": true,
      "author": "L. Sprague",
      "helpful_votes": 0,
      "publication_date": 20151231
    },
    {
      "title": "Excellent slip resistance",
      "text": "Works as advertised - the shower shoes are very slip resistance.",
      "rating": 5.0,
      "verified": true,
      "author": "enyjoe",
      "helpful_votes": 0,
      "publication_date": 20181214
    },
    {
      "title": "They have worked well.",
      "text": "I'm in a nursing home right now and wear these to the shower. They have worked great!",
      "rating": 5.0,
      "verified": true,
      "author": "KAF",
      "helpful_votes": 0,
      "publication_date": 20151107
    },
    {
      "title": "These are not returnable and it does not say that anywhere when purchasing.",
      "text": "The sizing was way off. They were way too small for a size 8 foot.",
      "rating": 3.0,
      "verified": true,
      "author": "James E Tierney",
      "helpful_votes": 0,
      "publication_date": 20181118
    },
    {
      "title": "Great slip resistant shoes",
      "text": "bought them for my a family member and he said they fit great! works well in the shower. would buy again",
      "rating": 5.0,
      "verified": true,
      "author": "Fel",
      "helpful_votes": 0,
      "publication_date": 20150401
    },
    {
      "title": "These are very flimsy... the rubber bottom ...",
      "text": "These are very flimsy... the rubber bottom is very heavy. The top mesh very lightweight. I would have preferred a heavier more substantial mesh. Not sure how long these will last... I would rethink purchasing them again.",
      "rating": 3.0,
      "verified": true,
      "author": "ilovegifts",
      "helpful_votes": 0,
      "publication_date": 20151019
    },
    {
      "title": "Excellent product to help prevent falls in the shower",
      "text": "These booties are just what I need after I had a fall in the shower. They really grip the tile in the shower and give me a sense of security. Fit very well.",
      "rating": 5.0,
      "verified": true,
      "author": "Acs",
      "helpful_votes": 0,
      "publication_date": 20170401
    },
    {
      "title": "This is a very nice product, worn in shower to prevent pain when ...",
      "text": "This is a very nice product, worn in shower to prevent pain when standing on tile floor of shower. Also prevents slipping in shower.",
      "rating": 5.0,
      "verified": true,
      "author": "NLR",
      "helpful_votes": 0,
      "publication_date": 20170225
    },
    {
      "title": "Great product!",
      "text": "I feel perfectly safe wearing the slippers in the shower and walking on slippery tile. I tend to wear them as regular slippers. Great product!",
      "rating": 5.0,
      "verified": true,
      "author": "TyH",
      "helpful_votes": 0,
      "publication_date": 20160604
    },
    {
      "title": "Five Stars",
      "text": "bottoms are very skid resistant. works well in the shower.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Ferrarini",
      "helpful_votes": 0,
      "publication_date": 20170306
    },
    {
      "title": "Five Stars",
      "text": "Liked they do much I bought 2 pairs. Great for elderly people and their safety.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda Mouradian",
      "helpful_votes": 0,
      "publication_date": 20170228
    },
    {
      "title": "Works well",
      "text": "They have worked well for me, little pricey but they really are non slip.",
      "rating": 4.0,
      "verified": true,
      "author": "DW",
      "helpful_votes": 0,
      "publication_date": 20170129
    },
    {
      "title": "Two Stars",
      "text": "Runs small. Wear a size 6 1/2 and the med barely fit.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170609
    },
    {
      "title": "Shoes were slick",
      "text": "They fit but we're so slippery in the shower that I fell the second time I wore them. I won't wear them again. Very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Lee Minnix",
      "helpful_votes": 0,
      "publication_date": 20160921
    },
    {
      "title": "Three Stars",
      "text": "Size 12 is too small for me. I ordered another style in size 13 and it worksfine.",
      "rating": 3.0,
      "verified": true,
      "author": "Al G",
      "helpful_votes": 0,
      "publication_date": 20170228
    },
    {
      "title": "The quality is good, and I will pass them along to someone ...",
      "text": "The shower shoes arrived promptly. Unfortunately, I ordered the wrong size, but I decided to keep the shower shoes. The quality is good, and I will pass them along to someone who can use them.",
      "rating": 5.0,
      "verified": true,
      "author": "G. Schaefer",
      "helpful_votes": 0,
      "publication_date": 20151004
    },
    {
      "title": "The size range for an men's X-LARGE is 10-12. ...",
      "text": "The size range for an men's X-LARGE is 10-12. My husband wears a 10 1/2 shoe and these were so large they fell off his feet.",
      "rating": 2.0,
      "verified": true,
      "author": "Susan Sullivan",
      "helpful_votes": 0,
      "publication_date": 20150904
    },
    {
      "title": "Highly recommend",
      "text": "Best shower shoe I have ever used!! Durable so well worth the money . I use them at home and when I travel. They are very reliable!!",
      "rating": 5.0,
      "verified": true,
      "author": "Peggy Mckee",
      "helpful_votes": 0,
      "publication_date": 20151103
    }
  ],
  "product_meta": {
    "title": "Secure SRSS-1L Slip Resistant Shower Shoes with Non Skid Heavy Duty Grooved Sole for Fall Injury Prevention - Sized for Men & Women - Slippers for Home, Gym, Spa, Sauna (Large)",
    "description": "Size:Large (Women's size 9-11; Men's size 7-9)The only shower shoes independently tested & proven to be slip-resistant. Heavy duty grooved soles tested & proven to resist slipping on wet surfaces. Ideal for use in nursing homes, hospitals, at home, dorms, gym locker rooms & hotels. Soft, comfortable nylon mesh uppers. No inside back seam to create heel skin issues. No inside front toe seam to create toe skin issues. Expanded soft foot opening for comfort & user or staff member to easily place shower shoes on feet. Higher back on uppers to minimize slippers coming off feet when worn. Sized for men and women - MEDIUM: (Women's sizes 6-8, Men's sizes 5-7), LARGE: (Women's sizes 9-11, Men's sizes 7-9), X-LARGE: (Men's sizes 10-12)",
    "rating": 4.1,
    "feature_bullets": [
      "The Secure Slip-Resistant Shower Shoes are ideal for use in nursing homes, hospitals, at home, dorms, gym locker rooms & hotels",
      "Heavy duty grooved soles independently tested & proven to resist slipping on wet surfaces (Contact Personal Safety Corp. for slip-resistant test results)",
      "Soft, comfortable nylon mesh uppers - No inside back seam to create heel skin issues - No inside front toe seam to create toe skin issues",
      "Expanded soft foot opening for comfort & user or staff member to easily place shower shoes on feet - Higher back on uppers to minimize slippers coming off feet when worn",
      "Sized for men and women - MEDIUM: (Women's sizes 6-8, Men's sizes 5-7), LARGE: (Women's sizes 9-11, Men's sizes 7-9), X-LARGE: (Men's sizes 10-12)"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "10 x 4.6 x 1.4 inches; 7.2 Ounces",
      "Department": "Womens",
      "Date First Available": "November 25, 2014",
      "Manufacturer": "Personal Safety Corporation",
      "ASIN": "B00Q5OD2AK",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Women",
      "Shoes",
      "Clothing, Shoes & Jewelry",
      "Slippers",
      "Health, Household & Baby Care"
    ],
    "price": 14.99
  }
}