{
  "website_summaries": [
    {
      "verdict": "The Amazon Fire HD 6 is a well-built, reliable small-screen tablet for under $100, but it really suffers from a lack of storage.",
      "pros": [
        "Solid",
        "build quality",
        "Bright, sharp screen",
        "Good size for reading",
        "Tons of Amazon streaming content"
      ],
      "cons": [
        "Very little internal storage, with no memory card slot",
        "Sometimes laggy",
        "Mediocre battery life",
        "Lacks Mayday button for instant help"
      ],
      "aspects": {},
      "publication_date": 20141004,
      "rating": 7.0,
      "source": "pcmag"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great choice for a bookworm",
      "text": "I use it at least 3hours per day, everyday. On weekend I can read all day without hurting my eyes as the light is adjustable (I normally put it between 6 to 12 only). It’s a great product. Although my hand is quite small, I still feel comfortable to hold it. It can be fit in my coat pocket. Love it, absolutely love it x",
      "rating": 5.0,
      "verified": true,
      "author": "Kate",
      "helpful_votes": 48,
      "publication_date": 20180424
    },
    {
      "title": "Basic but obedient. Recommended.",
      "text": "This is my third Kindle. My first, much loved, keyboard model was becoming unreliable in its frail old age. I invested a large sum in an Oasis, then newly released, which proved to have a mind of its own, and took ever increasing liberties until I could no longer tolerate its bad habits ( inserting unwanted bookmarks, highlighting pages of text unasked, freezing its screen for no apparent reason, etc, etc) so I purchased the much more basic (and much cheaper) Paperwhite which has so far seemed reasonably docile and, while lacking some of the features of the Oasis, at least does what it does do when it is asked to do it.",
      "rating": 4.0,
      "verified": true,
      "author": "Robin",
      "helpful_votes": 31,
      "publication_date": 20180902
    },
    {
      "title": "Love these kindles",
      "text": "I couldn't be without my kindle and this one is no exception. The backlight makes it useable in most places, even sunshine. Love it.",
      "rating": 4.0,
      "verified": true,
      "author": "Mike Mac",
      "helpful_votes": 12,
      "publication_date": 20190319
    },
    {
      "title": "it's the future",
      "text": "i have 3 kindle already .fire8.9 hd, a basic kindle,and a paperwhite used by hubby.im ordering anotherr paperwhite as the others are a waste of time reading outdoors or on sunny /bright day! we have been fighting ownership of existing device so i bit bullet and shelled out a big chunk for another plus case. love ease of operation.touch screen control and extended battery life.its the future.........",
      "rating": 4.0,
      "verified": true,
      "author": "COLLECTABELLE",
      "helpful_votes": 13,
      "publication_date": 20170710
    },
    {
      "title": "Almost perfect",
      "text": "Having upgraded from an old Kindle, which I loved, I have been delighted with many of the new features. Although my children are now adults, I have been impressed with the family features. It is sad that I have been seriously irritated with the advertising that appears, uninvited, on the screen when I close down/open the Kindle. It has spoiled what could have been a perfect experience.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 30,
      "publication_date": 20151202
    },
    {
      "title": "Replacement for aged Kindle",
      "text": "My old Kindle was looking a bit weary, battery not lasting and a bit fell off after I dropped it. Despite some negative reviews I decided to bite the bullet and go for the Paperwhite with 3G, my old one had 3G and when on holiday it's really useful. I find it easy to use, I had no problems transferring my books and can't understand why some people have had problems understanding the workings - no tech product these days has instructions, they all work in a similar fashion. I also opted for the \"no special offers\", it's bad enough having to put up with adverts on TV and Internet. Currently no problems and I can recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Joannie",
      "helpful_votes": 7,
      "publication_date": 20170723
    },
    {
      "title": "Giving it 3 stars due to battery life",
      "text": "First let me say I love my kindle I would not be without it , I can not imagine going back to \"normal books\" This is my second kindle paperwhite as the first was a good few years old and the battery was rin down and needed to be charged on a daily basis, that said when it was new it kept its charge for a considerable length of time between charges. this new kindle has to be charged once every 7/10 days . nowhere near as efficient as my original kindle, and nowhere near what Amazon say it should do. but nevertheless I would not part with it.",
      "rating": 3.0,
      "verified": true,
      "author": "welshgirl",
      "helpful_votes": 4,
      "publication_date": 20180916
    },
    {
      "title": "Great upgrade from my original kindle",
      "text": "After over 10 years faithful service from my old kindle I decided to treat myself to a new kindle. I'm not disappointed! I love the fact that I can read without putting the light on and it's so much lighter than my old faithful. Don't hesitate - just get one!",
      "rating": 5.0,
      "verified": true,
      "author": "E J Lee",
      "helpful_votes": 10,
      "publication_date": 20170423
    },
    {
      "title": "Not exactly as expected.",
      "text": "Quite disappointed with this.I'd wanted one for ages and after looking at all the reviews i bought it. The battery life is no where near as long as it states.It runs down even when not in use and screen is off. It's constantly on charge.I cant make it as bright as i would like it. I also wish the book covers were in color like they are on the iPhone kindle reading app. Apart from these negatives it's very light to hold and of course you can have all your books in one place and they are so much cheaper than a paperback. Would i still buy if i'd tried first, probably not.",
      "rating": 3.0,
      "verified": true,
      "author": "S. fidler",
      "helpful_votes": 4,
      "publication_date": 20180613
    },
    {
      "title": "Brilliant, I have struggled for 3 years with an ...",
      "text": "Brilliant, I have struggled for 3 years with an old Kindle Fire, trying to read book on a sunny day, virtually impossible, Paperwhite is brilliant.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Millea",
      "helpful_votes": 10,
      "publication_date": 20170516
    },
    {
      "title": "Exceeded my expectations in every respect",
      "text": "I've tried reading kindle books on my phone and android tablet, but no good in sunlight and weirdly difficult to do for any time over a few minutes. My daughter has the cheapest version of Kindle and said I should try hers , which was OK, but not a perfect experience, so when the paper white came up on Prime day, I used my Father's day gift vouchers. Pa0erwhite easily worth the extra cost over Base model, and a relaxed easy on the hours read for hours, indeed, not got weary of reading in any light conditions... Excellent!",
      "rating": 5.0,
      "verified": true,
      "author": "ST Nicholls",
      "helpful_votes": 5,
      "publication_date": 20170721
    },
    {
      "title": "How wrong could one be ?",
      "text": "I can honestly say that \"I would never have had one if I had to buy it myself \" because \"I like REAL books \". HOW WRONG COULD ONE BE ? IT'S A MUST for any serious readers and really easy to use .",
      "rating": 5.0,
      "verified": true,
      "author": "Steve Wood",
      "helpful_votes": 26,
      "publication_date": 20160103
    },
    {
      "title": "Not disappointed!",
      "text": "I was a little sceptical about having a new e reader, especially since I had the original Kindle on first release years ago but I am thrilled with this. It is easier to use, lighter and pretty intuitive to use. It was a replacement for the original and I am really glad I went for this model as opposed to the more expensive ones available since it does exactly what it is puporting to.",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs. S. L. Moore",
      "helpful_votes": 8,
      "publication_date": 20170920
    },
    {
      "title": "Love it",
      "text": "Love my kindle and glad I chose the edition with the backlight as I can still read it in bed if my husband is trying to sleep. So easy to find and download books they are there in seconds. My only gripe with it is that sometimes it flicks the page backwards instead of forwards no matter which side of the screen you tap. Don’t know whether it’s an intermittent fault on mine alone but I’m keeping an eye on it and if it starts doing it regularly may have to report it as a fault. But other than that it’s brill.",
      "rating": 4.0,
      "verified": true,
      "author": "scoobylu",
      "helpful_votes": 3,
      "publication_date": 20180110
    },
    {
      "title": "From Kindle to Kindle Paperwhite.",
      "text": "This is an upgrade for me from an earlier Kindle that ceased to work. It was not even repairable unfortunately. The Paperwhite is excellent with longer battery life and the screen can be darkened or lightened depending on need. Turn the backlight off in sunshine and on to any level in darker conditions. Great, the memory is bigger too.",
      "rating": 5.0,
      "verified": true,
      "author": "Brosnik",
      "helpful_votes": 7,
      "publication_date": 20170508
    },
    {
      "title": "Great!",
      "text": "Love it! easy to use and keeps all my books in same device. Easy to connect with wi fii and amazon. Good idea to have it if you like to read in the evening - no light required. Does not hurt my eyes. I like then i can see my progress as well with books. It is quite light as well and it does not take lots of space in bag. Perfect for journies.",
      "rating": 5.0,
      "verified": true,
      "author": "LadyJu",
      "helpful_votes": 6,
      "publication_date": 20170614
    },
    {
      "title": "A great improvement on the old push-button controls",
      "text": "I'm very pleased with my Paperwhite, a great improvement on the original push-button kindle I was using. I did find the navigation from the home page to be a little confusing at first, especially when trying to add books to my \"read\" and \"not read\" collections. I also wish that the home page was not full of suggestions of books I might like to read, especially as I get emails almost every day from Amazon with suggestions and offers. I don't mind the adverts on the opening page or the banner along the lower edge of the home page, but I would prefer the rest of the page to be used for books I already have in my collection.",
      "rating": 4.0,
      "verified": true,
      "author": "geordiegirl",
      "helpful_votes": 3,
      "publication_date": 20170626
    },
    {
      "title": "no page turning side buttons",
      "text": "I find myself unable to use this, with no side buttons to turn the pages and rather week hands it is impossible. I should like to advise people with any disability of the hands to think carefully before purchasing this. As someone who loves to read and had so much pleasure from my old Kindle, this new one has been a tremendous disappointment. I shall now de register it and attempt a resale. The reader is doubtless perfect for the majority of people and arrived on time in perfect condition. Three stars for 'negative improvement' !!",
      "rating": 2.0,
      "verified": true,
      "author": "pulsatilla",
      "helpful_votes": 2,
      "publication_date": 20180404
    },
    {
      "title": "Great for restless nights",
      "text": "I own a basic Kindle reader and as I used it a lot I thought I'd buy a paperwhite. This is a vast improvement on the basic kindle with much clearer easy to read print, the big bonus is the ability to read in the dark as I'm a restless sleeper and can read through the early hours without turning the light on.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Hunter",
      "helpful_votes": 6,
      "publication_date": 20170718
    },
    {
      "title": "Superior quality bookreader I would never use anything but Kindle",
      "text": "Lighter than my older paperwhite and works as brilliantly as all the Kindle products do, l love it. The main features I love are it's clarity, adaptable screen light and changeable character fonts and sizes. My only complaint is that Kindle won't allow you to format your own screen so you're stuck with their menu arrangement which I personally don't like. But then I didn't buy it to look at the menu! Get one, if this is your first Kindle you'll never look back.",
      "rating": 5.0,
      "verified": true,
      "author": "Jo B",
      "helpful_votes": 4,
      "publication_date": 20170728
    },
    {
      "title": "Perfect Kindle Experience",
      "text": "I love my new Kindle, my hands are severely affected by Rheumatoid Arthritis, so a light and easy to use device is a bonus, the Paperwhite ticks all the boxes. My old 2nd generation Kindle is now in my husband’s hands and he is enjoying using it. I love the new, easy and uptodate technology on this Kindle and the ease of use the Paperwhite offers. I’m still getting to know my way around it, but so far, amazing! If it brings as much pleasure as my old Kindle, I’ll be one very happy reader.",
      "rating": 5.0,
      "verified": true,
      "author": "GrannyL",
      "helpful_votes": 2,
      "publication_date": 20180729
    },
    {
      "title": "Great thing. The back light is great",
      "text": "Great thing. The back light is great, and is bright enough for summer beach, and dim enough when needed to read next to a sleeping person in an otherwise dark bedroom. Small light and easy to use. What's not to like. Even works for reading A4 PDFs. If only they could sell an A4 size one, even in black and white, I'd never print again. After a year of use it is in perfect condition. Much better than the ones with buttons.",
      "rating": 5.0,
      "verified": true,
      "author": "Alistair",
      "helpful_votes": 2,
      "publication_date": 20171004
    },
    {
      "title": "only lasted 19 months then died",
      "text": "loved my ereader, read each night with it in bed. very light and comfortable to hold in bed, nice to have a backlight but just 19 months of this use and it has died- no accidents/drops, no long period without use, just froze and tried all routes to reboot but nothing. now deliberating at don't want to spend £120 for a replacement that might fail again just 6 months after the warranty runs out. very sad with books waiting to be read.",
      "rating": 1.0,
      "verified": true,
      "author": "Denise A.",
      "helpful_votes": 0,
      "publication_date": 20190807
    },
    {
      "title": "Refurbished Kindle ..",
      "text": "Had to send back as the screen kept flashing black everytime I touched it??😕 No problems at all sending back though 😊",
      "rating": 1.0,
      "verified": true,
      "author": "Poppy1102",
      "helpful_votes": 5,
      "publication_date": 20180815
    },
    {
      "title": "KINDLE PAPERWHITE",
      "text": "We waited to buy this as we already have a Kindle Fire and an ipad but the one thing that we want to do in the summer is read outside. We are so pleased that we decided to buy a Paperwhite. It is ideal for reading in the garden or on the beach. Also we are going to buy another one for our granddaughter as she is learning to read and likes the dictionary function where she can tap on a letter and the meaning is explained.",
      "rating": 5.0,
      "verified": true,
      "author": "Daisy",
      "helpful_votes": 4,
      "publication_date": 20170718
    },
    {
      "title": "I love it. I traded up from the Kindle Touch ...",
      "text": "I love it. I traded up from the Kindle Touch which annoyingly Amazon have stopped updating so I can't download books through WiFi. I like the backlight feature which allows me to read in the dark without keeping my partner awake. Light, solidly built. Great for outdoor reading.",
      "rating": 5.0,
      "verified": true,
      "author": "Farniboy",
      "helpful_votes": 6,
      "publication_date": 20170513
    },
    {
      "title": "Good but frustrating!!!",
      "text": "I am really pleased overall with my Kindle Paperwhite especially with the built-in light. It is not that easy to find your way around the menu, me being a tech phobic an all!!! It can be quite frustrating to find my recent purchased books too. Still finding my way round this new technology!!!!",
      "rating": 4.0,
      "verified": true,
      "author": "gloriabristol",
      "helpful_votes": 8,
      "publication_date": 20170604
    },
    {
      "title": "I am so glad that I did",
      "text": "Took me a while to give up my original kindle which I have had for several years. I am so glad that I did, my kindle paperwhite is so much better, smaller, easier to use and I can read it at night with the light off so I don't disturb hubby. It has already been on its first holiday with me and given me hours of reading enjoyment.",
      "rating": 5.0,
      "verified": true,
      "author": "tapdancer",
      "helpful_votes": 7,
      "publication_date": 20170604
    },
    {
      "title": "less than 2 years old and battery problems again. ...",
      "text": "less than 2 years old and battery problems again. this is the second one in 4 years!! they don't last very long!!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20180618
    },
    {
      "title": "The benchmark e reader",
      "text": "My second Kindle. These things are essential, finally put a stop to my flat being clogged with books. I much prefer reading from a Kindle to a tablet. I remember when the idea of an 'electronic' book first started circulating. I seems to have taken a very long time to have become a reality. As a real, working, electronic book the Kindle Paperwhite does not disappoint.",
      "rating": 5.0,
      "verified": true,
      "author": "Terry Relph-Knight",
      "helpful_votes": 4,
      "publication_date": 20170811
    },
    {
      "title": "My treat to me and I love it",
      "text": "I can't add much to all the other great reviews for this Kindle. I was hesitant to move from paper to Kindle, but I decided to treat myself with this. Great to use in the sunlight, with so many little bonuses like reading in low light. I love that I can speed read through books - it actually seems easier on the eyes. I now abandon average books that I've bought on the Kindle very quickly, something I felt reluctant to do with physical books. I do a lot of driving and linking Kindle to Audible on my phone has been a revelation - its a great way to discover old classics - like Animal Farm.",
      "rating": 5.0,
      "verified": true,
      "author": "A. AKANNI",
      "helpful_votes": 0,
      "publication_date": 20180912
    },
    {
      "title": "Perfect for my Holidays",
      "text": "I chose this Kindle to update the older one I was using. I love reading when I am on my holidays, but found the sun reflected on the Kindle screen, so I couldn't read it outdoors. But the new one has an anti-reflective screen, in addition to lots of other improvements. Very happy and can recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs. B. S. Bevis",
      "helpful_votes": 5,
      "publication_date": 20170508
    },
    {
      "title": "Quite happy with this version of the Kindle",
      "text": "The only beef I have is that the battery does not last as long as I was lead to believe after a full charge. Some people dislike the Amazon 'special offers'. They really are not intrusive when reading and I would not consider paying to get them removed. At some time I might even find them worth following up on. Overall quite happy.",
      "rating": 4.0,
      "verified": true,
      "author": "Christo",
      "helpful_votes": 4,
      "publication_date": 20170725
    },
    {
      "title": "amazoning",
      "text": "Thank you amazon for such a wonderful product. I am partially sighted it has opened up a world of reading to me again the light on the kindle is perfect and so many options for people with sight problems. Thank you once again, amazon.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan R.",
      "helpful_votes": 6,
      "publication_date": 20170304
    },
    {
      "title": "Big improvement on the none backlit screen version.",
      "text": "I have one of the earlier incarnations of the Kindle, one without a backlight, whilst I liked a lot of things about it having to have a light to see the screen on darker nights was not one of them. I read the Kindle mostly in bed so a light on meant my wife's sleep was disturbed, this version solves that altogether. Sometimes I awake early, too early to get up, so again I have a read, the one thing about these Kindles is that on a full charge they seem to last an age, even with a backlight, I'm glad that I bought this version.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve",
      "helpful_votes": 0,
      "publication_date": 20201013
    },
    {
      "title": "Better than a tablet. Better than a book.",
      "text": "The only problem with this item is that I need to find more time to sit down and read it. Yes, it doesn't replace a big colour book sat on the coffee table but it can go anywhere and work in every lighting condition. The best Kindle ever! Pros: Portable; battery efficient; it just 'works' as you want it to. Cons: It'll be a long time, if ever, before this or any electronic device replaces every type of book. It's far too easy to just want to buy (or actually buy) more Kindle books!",
      "rating": 5.0,
      "verified": true,
      "author": "Damian Griffiths",
      "helpful_votes": 0,
      "publication_date": 20181003
    },
    {
      "title": "A Great Upgrade",
      "text": "This is my second Kindle and what a difference it has made. I loved my first Kindle but I kept trying to do the same things with it that I do with my smartphone and became very frustrated when I couldn't just touch a page to alter something. So, now I have this new one, I love all the new features that we automatically take for granted on our smartphones. I'm still trying to get to grips with all the features but I'll get there. It is so much lighter and easier to slip into my handbag and the extended battery life is great.",
      "rating": 5.0,
      "verified": true,
      "author": "Cryspalitus",
      "helpful_votes": 0,
      "publication_date": 20180530
    },
    {
      "title": "Confused Senior",
      "text": "I loved my original Kindle Touch,but decided to buy the paperwhite - wish I hadnt! I find it so confusing, and was reading a book, but cannot find the one I was reading, or which page I was on. The pages are full of book cover pictures, and if I tap the top or bottom of the page It starts a new book.Maybe I am too old to follow new devices, perhaps I should purchase the Kindle Touch again. At least I knew exactly what I was doing with it! Such a shame, as I read all the time. I have bought the Help Manual, so maybe I will be able to understand the device better.",
      "rating": 2.0,
      "verified": true,
      "author": "SheilaX",
      "helpful_votes": 4,
      "publication_date": 20160628
    },
    {
      "title": "Excellent replacement",
      "text": "Bought this as a replacement for my ancient Kindle which had failed. The new one is a more convenient size and has a clearer screen. It is easier to read in low light conditions due to backlighting. Was not keen on the idea of a touchscreen but I find it does not show up finger marks as badly as my iPad. I would recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "P A Hobbs",
      "helpful_votes": 6,
      "publication_date": 20170624
    },
    {
      "title": "I do not like this reader and give only one out of ten.",
      "text": "I expected much more from this product, the screen although good for black and white is almost unreadable for any page with colour. It's also so slow you click on something and there is a delay of several seconds sometimes. The built-in browser is a good idea but I found it difficult to navigate because of the speed and the inability to read the screen. However I will not be sending it back as it is good for reading books it's only plus as far I am concerned.",
      "rating": 1.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20181016
    },
    {
      "title": "Very short battery life",
      "text": "I like most of the features of my new Kindle, but this battery doesn't even last for 1 week! I would appreciate it if it could be replaced with the same one with a decent battery life.",
      "rating": 2.0,
      "verified": true,
      "author": "Louisa Stirling",
      "helpful_votes": 6,
      "publication_date": 20171121
    },
    {
      "title": "Great product",
      "text": "I had to purchase a new kindle paperwhite after dropping my old one into the bath (it didn’t do it eny good) the new paperwhite is a good improvement and much clearer to read. There have been a few changes to the controller panel that makes it feel more like using a computer/ iPhone which I think is a good thing. The only thing that I would have liked to have been done is to waterproof it but perhaps I’m biased due to my above comments! I would recommend the paperwhite to everyone, it’s a great product.",
      "rating": 5.0,
      "verified": true,
      "author": "clifford moore",
      "helpful_votes": 0,
      "publication_date": 20180617
    },
    {
      "title": "I'm so glad I finally decided to buy the Kindle Paperwhite",
      "text": "I'm so glad I finally decided to buy the Kindle Paperwhite! No more screen freezing, no more having to restart the device to be able to carry on reading. I should say that before the Kindle Paperwhite, I had a Kobo Touch which I was fairly happy despite the lack of lighting option... That is until it started freezing every 10 mins! My only qualm about buying a Kindle was the lack of options for book format, but then I got Calibre and everything was easy. I have since found that ebooks are much cheaper on amazon and there's more choice, including foreign language books. A happy happy customer.",
      "rating": 5.0,
      "verified": true,
      "author": "angellara",
      "helpful_votes": 5,
      "publication_date": 20150814
    },
    {
      "title": "Yet another Kindle purchase.",
      "text": "This is my second e reader, I received one of the first ones as a present about 7 years ago and it is still working fine but I have been looking at the paperwhite for some time now and decided that I would buy it while it was on offer. It did not disappoint, I have already loaded books onto it ready for my holidays. So simple to set up, love the bright screen, my husband will be using my old one, this is actually my fifth kindle purchase, they are all very robust, well built and seem to be made to last forever.",
      "rating": 5.0,
      "verified": true,
      "author": "Trish",
      "helpful_votes": 0,
      "publication_date": 20180803
    },
    {
      "title": "It's not that great",
      "text": "This is the first Kindle I've actually bought rather than having hand me downs. I bought it because I was struggling to read my older Kindle on the train in low light levels and I thought the backlight would be good. Well I'm not very impressed. I don't think the screen quality is that great, the backlight is meh - and I certainly don't like reading with it in the dark. Also the touch screen is really annoying, I'd rather have the buttons. The navigation has gone from simple to needlessly complicated and I spend a lot of time looking for stuff. So I don't think it was worth the money for me.",
      "rating": 2.0,
      "verified": true,
      "author": "Lisa H",
      "helpful_votes": 0,
      "publication_date": 20190203
    },
    {
      "title": "Trouble Charging!",
      "text": "Really liked the look and feel of this kindle and at first everything was fine. However it started needing charged more often than it should so contacted Amazon...told it was the charging cable...got a new cable. Unfortunately that didn’t make any difference and things became worse, with it needing charged every day, (with only 20 mins. use), and the charging indicator light randomly changing colour. Returning for a refund and will buy another kindle.",
      "rating": 1.0,
      "verified": true,
      "author": "Galli",
      "helpful_votes": 0,
      "publication_date": 20181027
    },
    {
      "title": "Would benefit from some adjustments!!",
      "text": "Disappointed with this. Sometimes it sticks and needs shutting down to make it work again. Also doesn’t keep your place unless you add bookmark before shutting. It suddenly decided to do an update in the middle of a chapter and I had to wait ages before a restart and then my book was nowhere to be found. I had to go through my extensive list to find again. Not easy to use although print etc good. I bought it to use it in bright sunlight and on holiday. Prefer my tablet when at home or inside!!",
      "rating": 3.0,
      "verified": true,
      "author": "Teddy",
      "helpful_votes": 0,
      "publication_date": 20180701
    },
    {
      "title": "Kindle is a must for readers.",
      "text": "As a book lover I was cautious about embracing the kindle, but I'm so glad I did! I travel a lot so to be able carry so many books with me was a definite game changer. I use it for all my novels. The touchscreen is a bit sticky, getting to the menu and highlighting paragraphs is not especially easy given how quick mobile devices are. But still... the lighting feature is fantastic for reading at night and the device itself is comfortable to hold. Sleek design and lightweight. I really enjoy mine and wouldn't be without it now.",
      "rating": 5.0,
      "verified": true,
      "author": "Suziey",
      "helpful_votes": 0,
      "publication_date": 20191203
    },
    {
      "title": "CHARGING PROBLEM AFTER LESS THAN 18 MONTHS",
      "text": "I bought this in late 2016 and now under a year and a half later it has charging problems. Unless I wiggle the connector into the right position and weigh the cord down with books to hold it in position the yellow charging light goes out. This is a known Kindle problem and my work around is to use my ipad. But it is very disappointing and I would not recommend this product.",
      "rating": 2.0,
      "verified": true,
      "author": "Steve Rogers",
      "helpful_votes": 2,
      "publication_date": 20180221
    },
    {
      "title": "Enjoyed it so much would buy again.",
      "text": "Very pleased with this and with discount after previous Kindle failed. I chose the white which is more cream as I dislike black items and also got a magnetic protective cover. Item is lighter an brighter, dictionary is good but highlighting slightly awkward. I enjoy reading this (mostly old books - I would find searching and finding modern literature stressful) and I can ignore the ads which is apparantly the price we pay. I would actually buy another to take out if on journeys if the price was right wgich is not something I would normally say.",
      "rating": 5.0,
      "verified": true,
      "author": "Farlane",
      "helpful_votes": 0,
      "publication_date": 20180411
    },
    {
      "title": "A great reading experience",
      "text": "Have been using a Kindle Fire to download and read books but the battery is now not keeping a charge so I purchased this E-reader. It is a great improvement on the Kindle Fire as it gives me the opportunity to read it in all types of light from bright sunlight to dark rooms. Cannot fault plus it has a longer battery life.",
      "rating": 5.0,
      "verified": true,
      "author": "ship ahoy",
      "helpful_votes": 6,
      "publication_date": 20170415
    },
    {
      "title": "Wouldn’t be without a kindle........",
      "text": "These are awesome, had one before so knew what to expext but this time got the wi-fi too and so glad I did. Worth the extra cost, just so much easier to choose new books straight from the device rather than having to download from elsewhere. I have my kindle with me a lot of the time, even when out walking the dogs! Really missed it before the new one arrived. Screen so easy to see and light easily adjusted. Great choice of “free” books to read within my monthly membership fee.",
      "rating": 5.0,
      "verified": true,
      "author": "Vee",
      "helpful_votes": 0,
      "publication_date": 20171006
    },
    {
      "title": "The perfect way to read in the modern world.",
      "text": "There is nothing I dislike about this product. I love every aspect of it. The display produces an image that is a delight to read. The light is adaptive to all situations and means that I don't have to carry a torch around to read at night, in or outdoors. It is comfortable to hold and easy to use. I love it so much I bought one for my wife soon after purchasing mine. I am a massive fan.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. P. J. Sage",
      "helpful_votes": 2,
      "publication_date": 20180827
    },
    {
      "title": "Good model, shame about the advertising on the 'sleep' page.",
      "text": "This is a great way of getting my child to read more. He likes the technology and it is easy for him to use. I like the parental controls and that the general internet cannot be accessed from it. The advertising on the front sleep page is frustrating and unnecessary. I have an older model that alternates through a few lovely designs. If I have paid for something, you should not try to grab extra money from advertising at point of use.",
      "rating": 4.0,
      "verified": true,
      "author": "MsKD",
      "helpful_votes": 0,
      "publication_date": 20180110
    },
    {
      "title": "Love the lit screen which allows for reading in the ...",
      "text": "My second kindle. Love the lit screen which allows for reading in the dark and on planes. We have both this one and the Voyage now in the house. The latter is slick and with a lovely screen but in truth I can't say its worth the price difference. I also found the page turning buttons either side of the Voyage annoying for how I can sometimes hold the device. The Paperwhite is easy to use. The touchscreen is occasionally not as sensitive as I'd like. However, its light and fits into my rucksack for a daily commute or for travelling.",
      "rating": 5.0,
      "verified": true,
      "author": "kazman76",
      "helpful_votes": 0,
      "publication_date": 20170812
    },
    {
      "title": "Easy to use, but does not have the robustness of previous generations",
      "text": "My previous 4th gen Kindle lasted 7 years. After on 7 months this one has developed two small cracks in the screen. The touchscreen is good, the inbuilt light is good, but the cracks that have developed mean I have long shadows across the screen from the light. Quick zoom on the font size is excellent, but some UI features need improvement, like the size of the time and progress fonts, which may very difficult to read depending on your vision, and cannot be adjusted. The constant notifications about the WIfi being off when using other features are very irritating.",
      "rating": 3.0,
      "verified": true,
      "author": "Donal",
      "helpful_votes": 0,
      "publication_date": 20190816
    },
    {
      "title": "Two arrived faulty",
      "text": "I've had two of these from Amazon now, both arrived with a dead pixel on the screen that the backlight shines strongly through. My previous 3 kindles were all earlier models of the kindle and the e-ink screens on them all managed to develop faults within a short period of time. I do hope that one day Amazon manages to produce a kindle that arrives in working condition and doesn't break within the first year.",
      "rating": 2.0,
      "verified": true,
      "author": "Rachel",
      "helpful_votes": 3,
      "publication_date": 20170824
    },
    {
      "title": "Fit for purpose",
      "text": "I wanted the new Oasis kindle because the pages could be changed at the side. I really miss that feature from my keyboard kindle. However, I couldn’t justify the cost so went for the Paperwhite. I also found I chose the kindle with special features even though I thought I hadn’t. This was confusing and I think misleading, but rectified it after purchase, just annoying! The Paperwhite is fit for purpose, easy to set up with my library. It’s ok but why can’t you bring back turning the page on the side.",
      "rating": 3.0,
      "verified": true,
      "author": "Mr H.M. Jones",
      "helpful_votes": 0,
      "publication_date": 20180427
    },
    {
      "title": "Sunbathe AND read!",
      "text": "Absolutely love it! (Although, I have to say the flash of the black screen when turning pages/navigating the store was a little annoying at first) I’ve had a kindle fire for a few years now but i couldn’t read outside because of the glare on the screen and the battery life was abysmal. This paper white is great! No glare, so I can sunbathe AND read and the battery life is amazing! I’ve charged it once in the three weeks I’ve had it and it still had a quarter left when I put it on charge! Wish I’d changed over to a paperwhite long before now!",
      "rating": 5.0,
      "verified": true,
      "author": "MsDaniels22",
      "helpful_votes": 0,
      "publication_date": 20180630
    },
    {
      "title": "What an amazing difference to bedtime reading!!!",
      "text": "With arthritic hand joints holding a book can be difficult, this kindle is light weight, easy to hold and with the built in light you turn off the bedroom light and continue to read. If you fall asleep that's fine, after a few minutes so does the kindle and you can pick up exactly where you left off when you wake up. I have not found it easy to read from a screen over the past few years but this is really just like reading from a page. The script is easy to read, excellent in size but adjustable to suit you, the light is also easily adjustable to suit you. I would recommend this product to anyone and everyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Lesley",
      "helpful_votes": 0,
      "publication_date": 20180727
    },
    {
      "title": "Great for reading in low light",
      "text": "Bought to replace an original Kindle that had lost WiFi and the battery was dying. Easy to operate, great WiFi connection. This was a reconditioned unit but it looked brand new and in a new case. It was advertised as 3G and WiFi, but for the price I think this was a clerical error as it only has WiFi. So much more stuff on this that I really must go through the instruction manual sometime. The only downside seems to be that the touch screen is sensitive and you have to keep your finger away or it can skip pages before you know what happened.",
      "rating": 5.0,
      "verified": true,
      "author": "Andy",
      "helpful_votes": 0,
      "publication_date": 20190115
    },
    {
      "title": "The screen on my Paperwhite is great, working inside and ‘outside’ the house",
      "text": "I recently purchased this ‘Kindle Paperwhite’. This was purchased after using the Kindle apps for my Windows Phone, MacBook laptop and an aging Galaxy tablet. I now mostly alternate between the ‘Paperwhite and Windows Phone’, as the tablet is unreliable. At first my ‘Paperwhite’ would not sync the pages to my other devices. After following the prompt email instructions from a lady at ‘Customer Services.’ I deregistered my Paperwhite then reregistered as instructed, then it synced perfectly. The screen on my Paperwhite is great, working inside and ‘outside’ the house. I’m looking forward to using it on holidays by the pool.",
      "rating": 5.0,
      "verified": true,
      "author": "Old Geezer Paul.",
      "helpful_votes": 0,
      "publication_date": 20180618
    },
    {
      "title": "Good Product - Slightly Small Screen Though.",
      "text": "I purchased this product as I wanted to transfer over from paperback books to digital. The product itself works perfectly, the user interface could be slightly improved, to my preference it is a little fiddly at first as what you want to do is simply be able to pick up a book and read it, instead, you have to navigate through a marketplace to then find your book etc. In addition, for my preference, the screen is just far too small; its nearly half the size of a normal book, which leads the text to be askew.",
      "rating": 3.0,
      "verified": true,
      "author": "joe peters",
      "helpful_votes": 0,
      "publication_date": 20181217
    },
    {
      "title": "All the benefits of the old Kindle, and more. . .",
      "text": "I bought this in the recent Prime sale to replace my old keyboard Kindle (still working). It's a lovely thing, and much more compact because of the absence of the mechanical keyboard. The back-lit display is really handy too, as I had to make do with a Kindle case with an extendable LED light on the old version - which was a bit intrusive and not half as effective. The only annoying thing were the 'special offer ads', which I hadn't realised would be displayed instead of the usual off screen. However, Amazon waived the usual £10 fee to remove them, so can't complain.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Rouse",
      "helpful_votes": 0,
      "publication_date": 20180721
    }
  ],
  "product_meta": {
    "title": "Test Product - Do Not Use",
    "description": "Amazon",
    "specifications": {
      "Product Dimensions": "4.6 x 0.36 x 6.65 inches",
      "Item Weight": "7.2 ounces",
      "Manufacturer": "AMDSI",
      "ASIN": "B00QJDO0QC",
      "Item model number": "DP75SDI",
      "Batteries": "Lithium Metal batteries required.",
      "Date First Available": "November 16, 2015"
    },
    "categories": [
      "Electronics"
    ],
    "price": ""
  }
}