{
  "website_summaries": [
    {
      "verdict": "The Asics Gel Nimbus 17 is a neutral running shoe that gained positive feedback from users. It offers comfortable performance on the roads. This running shoe has the cushioning runners need to get through their running sessions with ease. The appealing look of the shoe makes it endearing to modern athletes.",
      "pros": [
        "The upper unit of the 17th version of the Asics Gel Nimbus is able to adapt to the foot of the wearer, giving a glove-like coverage",
        "An external heel counter keeps the heel locked down, preventing slippage and any accidental shoe removal",
        "The interior lining is made up of a soft material that is not irritating to the skin",
        "The cushioning systems of this shoe were appreciated by many because it was able to support their feet responsibly",
        "The rubber technologies in the outsole deliver sure protection and traction"
      ],
      "cons": [
        "A few of the testers observed that the outsole wore out after only a few months",
        "Some noted that their toes went numb because the forefoot area was a bit stiff and narrow for them"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": 9.4,
      "source": "runrepeat"
    }
  ],
  "customer_reviews": [
    {
      "title": "Not as good as previous models of gel nimbus (despite reviews)",
      "text": "My wife has been running in Gel nimbus for 7 years and she swears by them. These were recommended as a return to form for asics after a couple of lacklustre models. Unfortunately that hasn't been my wife's experience. For the first time, the nimbus 17 seems to fit small, it feels tight on her feet and her big toe had worn a hole through the netting of the upper after just 3 months.",
      "rating": 3.0,
      "verified": true,
      "author": "D. Jones",
      "helpful_votes": 4,
      "publication_date": 20170108
    },
    {
      "title": "Cheap and nasty Asics starting to cut corners with fabric",
      "text": "i have worn Asics Nimbus for over 13 years now and they never disappoint. This model look very different and feel very different. After a short 5 mile run, I had blisters on the tops of my toes from where the fabric bunched. After one another longer run, I developed the type of knee pain I usually get after my trainers are in need of replacement. Very upset and disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Matt",
      "helpful_votes": 6,
      "publication_date": 20160117
    },
    {
      "title": "Incredibly supportive cushioning in heel and forefoot",
      "text": "I know why they call these the Rolls Royce of running shoe now- they are quite possibly THE most bouncy and comfortable trainer I have ever tried. There is ample cushioning not just in the heel (which is very bouncy), but also in the forefoot which feels like a gel pillow. They hug your feet entirely, providing wonderful cushioning and support with a lightweight, stable outsole. They are expensive for a reason- I tried 2 other Asics pairs at 2 different, lower price points and they did not come anywhere near to the quality and feel of these ones. Nothing else compares. Fantastic.",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs H A Nicholas",
      "helpful_votes": 0,
      "publication_date": 20160224
    },
    {
      "title": "Good cushioning, good fit",
      "text": "I had already bought an Asics gel nimbus 17 in august last year. The 18 version was still too expensive for me so I simply repeated buying last year's version in august 2016. Good cushioning, good fit. Love the colour of bright blue with a few orange markings. Slightly concerned about the reputation of the 18 version but I shall worry about that next year. I am a 64 year old female runner who runs about 3 times a week, now only 3 to 6 miles each time. This old body's joints need that cushioning as do my feet.",
      "rating": 5.0,
      "verified": true,
      "author": "Bones",
      "helpful_votes": 0,
      "publication_date": 20160917
    },
    {
      "title": "Was delighted to get them at such a good price",
      "text": "This is my 4th pair of ASICS Gel Nimbus running shoes, they are just right for my feet and running gait, have stopped long ago looking at any other brands or designs. Was delighted to get them at such a good price, have to say colour would not have been my first choice but look much better than the picture on line. Such a bargain for their latest design.",
      "rating": 4.0,
      "verified": true,
      "author": "Lazy Shopper",
      "helpful_votes": 2,
      "publication_date": 20151008
    },
    {
      "title": "Disappointed with the fit",
      "text": "I bought these for the cushioning and they definitely deliver here. However I am finding them too tight across the toes. They don't rub but pinch my toes together so they go numb and tingly after wearing them for longer than half an hour. I didn't notice this until it was too late to send them back (due to only wearing them inside for short periods of time) so I am persevering and hoping they stretch a lot. My last ASICs Gel Nimbus 15 were a wonderful fit, hence buying the same type in the same size but they don't match up. I just wish I had bought the 15s again now.",
      "rating": 2.0,
      "verified": true,
      "author": "Tan",
      "helpful_votes": 0,
      "publication_date": 20161005
    },
    {
      "title": "they were a good £30 cheaper on Amazon than elsewhere",
      "text": "Asics are the only brand of trainer I'll buy for gym/ active things. So comfy, bouncy, supportive. And the colours are fab. (A true athlete isn't supposed to care about the colours... so I read... oh well! Neon pink!) PLus, they were a good £30 cheaper on Amazon than elsewhere.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Willis",
      "helpful_votes": 0,
      "publication_date": 20160213
    },
    {
      "title": "Super comfortable and supportive running shoes",
      "text": "My second pair of ASIC's Gel Nimbus 17's. Wonderfully comfortable from the first run. Longest run has been a half marathon in the last pair, and feet felt fine at the end of it. Would highly recommend these for walking and running. Nice stable sole - I have weaker ankles and this helps a lot. Second pair was bought as I had reached max mileage in the last pair, and will now keep the old ones for my muddier runs! To note, although probably not recommended by the manufacturer, they go through the washing machine and come out like new.",
      "rating": 5.0,
      "verified": true,
      "author": "Dog walker",
      "helpful_votes": 0,
      "publication_date": 20151103
    },
    {
      "title": "Excellent value",
      "text": "Great price for a quality product. I had tried the shoes on at my local sports shop and then checked on line and found them £20 cheaper at Amazon. It is worth trying them on before ordering as sizes can vary. I wear these for walking (I did the moonwalk in them) I do not find them particularly comfortable for exercise classes but then they are not designed for the gym.",
      "rating": 5.0,
      "verified": true,
      "author": "Nicola A.",
      "helpful_votes": 0,
      "publication_date": 20151031
    },
    {
      "title": "Very comfortable",
      "text": "Love these trainers, very comfortable. When choosing the size, recommend +1 than normal (for example, my number is 4 UK and bought a 5 UK). The seller is very helpful, responds to all the questions and problems you may have, for example, I had a defect in the shoes and he replaced them immediately. Totally recommend, both the product and buy from this seller.",
      "rating": 5.0,
      "verified": true,
      "author": "Mexicana",
      "helpful_votes": 0,
      "publication_date": 20161020
    },
    {
      "title": "Great for mid distance running",
      "text": "I always buy Asics gel and I’ve always been very pleased with them these are no exception I recently aquired plantar fasciitis but these are still comfortable to wear",
      "rating": 5.0,
      "verified": true,
      "author": "dawn robinson",
      "helpful_votes": 0,
      "publication_date": 20181221
    },
    {
      "title": "New improved features",
      "text": "I've used Asics Gel Nibus running shoes for a number of years now.i find the fit of the shoe perfect for long runs and the gel cushioning is second to none.in this updated version the shoe is even more streamlined and lighter,a closer more comfortable fit.ive been a runner for 26 years and I've tried many brands but find these shoes most comfortable",
      "rating": 5.0,
      "verified": true,
      "author": "Karen McAlinden",
      "helpful_votes": 0,
      "publication_date": 20151016
    },
    {
      "title": "Frustrated",
      "text": "I've been an Asics fan a long time and have just started training for a 10k- invested in 'better shoes' but they bit me! About 1.5miles into a training run and I have blisters on the toe end of my instep. Frustrated as I've never had blisters before and I've ran more than 1.5 miles in Asics shoes many times previously. I'll be off to the running shop soon then for a fitting.",
      "rating": 3.0,
      "verified": true,
      "author": "Jilly Griff",
      "helpful_votes": 0,
      "publication_date": 20160519
    },
    {
      "title": "I have given a four as they look good but i don't really feel the difference from these ...",
      "text": "I have given a four as they look good but i don't really feel the difference from these to say a pair if Nike or Adidas which would probably be cheaper option",
      "rating": 4.0,
      "verified": true,
      "author": "V Inman",
      "helpful_votes": 0,
      "publication_date": 20150729
    },
    {
      "title": "This model is better than 16 and more comfortable",
      "text": "Ordered the shoe for my wife as her previous Gel-Nimbus 16 had developed a hole in each shoe where the small toe rubbed inside lining of the shoe. This model is better than 16 and more comfortable. She is very pleased with the shoe.",
      "rating": 5.0,
      "verified": true,
      "author": "Ahad Miah",
      "helpful_votes": 0,
      "publication_date": 20150820
    },
    {
      "title": "Best ever running shoe",
      "text": "These are the second pair I have bought they're fantastic, wouldn't buy any other running shoes, comfortable and very supportive. I take 3.5 and ordered a 4 which fit perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "shellie",
      "helpful_votes": 0,
      "publication_date": 20160708
    },
    {
      "title": "Very comfy, my feet hurt a lot less when ...",
      "text": "Very comfy, my feet hurt a lot less when wearing these (I have plantar fasciitis). Supportive. Vibrant colours. As per the other reviews I ordered a half size up and they fit perfectly.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20151211
    },
    {
      "title": "Great shoe very comfortable I usually wear UK 7",
      "text": "Great shoe very comfortable I usually wear UK 7.5 but ordered an 8 as I wanted to wear thicker socks but I would say there is no difference, so a small fit, I don't think a 7.5 would have been big enough, other than that all great and very pleased",
      "rating": 4.0,
      "verified": true,
      "author": "Neetie",
      "helpful_votes": 0,
      "publication_date": 20151031
    },
    {
      "title": "All round perfection",
      "text": "A dream to run in these. High quality matches the comfort. Even the toughest run feels as if you're running on clouds. And no I don't get commission. Lol. Also just loved the quick hassle free delivery.",
      "rating": 5.0,
      "verified": true,
      "author": "julie",
      "helpful_votes": 0,
      "publication_date": 20150616
    },
    {
      "title": "Highly recommend",
      "text": "I have stuck with these runners for a while. I mainly do off road running, and these cope well with the mud. Great support, wear well, suit for thinner foot which can be a problem with some other brands.",
      "rating": 5.0,
      "verified": true,
      "author": "whitie",
      "helpful_votes": 0,
      "publication_date": 20151205
    },
    {
      "title": "Amazing shoes, love wearing them",
      "text": "Amazing shoes, love wearing them. As a very new runner who only just started, they were an excellent choice. They fit well, they feel great. Would definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Lourie",
      "helpful_votes": 0,
      "publication_date": 20160327
    },
    {
      "title": "Slightly bigger than other asics",
      "text": "I have found my usual Asics size a little large with this product. However Amazon customer service were excellent and sorted this out for me. I have given a good rating due to this and the fact that the shoe is it good quality and in the right size should be great.",
      "rating": 4.0,
      "verified": true,
      "author": "Mitch",
      "helpful_votes": 0,
      "publication_date": 20160227
    },
    {
      "title": "size doubts",
      "text": "Half a size bigger was ok. Maybe another half wouldn't have hurt. I bought 38.5 but my friend has 39.5. Hers are really comfortable but was worried my that there may be too much room for movement or friction.",
      "rating": 5.0,
      "verified": true,
      "author": "Lilly",
      "helpful_votes": 0,
      "publication_date": 20160303
    },
    {
      "title": "I really like these running shoes and this is my second pair",
      "text": "I really like these running shoes and this is my second pair. I ran 780km in the first pair. I am a size 4/37 in normal shoes. Went up half a size on the first pair, but after a while I had a hole in the toe (possibly due to my big toe being longer than other toes), so this time I ordered a 5/38 and these are perfect.",
      "rating": 4.0,
      "verified": true,
      "author": "MelBu",
      "helpful_votes": 0,
      "publication_date": 20161107
    },
    {
      "title": "Fit perfect.",
      "text": "I take a size 6-ish in the UK, but I take a size 7 in these. Always have. Fit perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Tracy M Christino",
      "helpful_votes": 2,
      "publication_date": 20160213
    },
    {
      "title": "they are a good true fit",
      "text": "Though somewhat bright, they are a good true fit, great cushioning and light weight, just as advertised.",
      "rating": 4.0,
      "verified": true,
      "author": "Sam gee",
      "helpful_votes": 0,
      "publication_date": 20161203
    },
    {
      "title": "Very disappointed as not cheap",
      "text": "Holes developed on heel area inside both shoes very quickly. Very disappointed as not cheap!",
      "rating": 2.0,
      "verified": true,
      "author": "Emma C.",
      "helpful_votes": 0,
      "publication_date": 20170801
    },
    {
      "title": "Five Stars",
      "text": "Once again asics have delivered a top class running shoe- extremely padded and supportive. Worth every penny!",
      "rating": 5.0,
      "verified": true,
      "author": "Maria Whelan",
      "helpful_votes": 0,
      "publication_date": 20160529
    },
    {
      "title": "Perfect",
      "text": "Perfection on a plate - so comfortable - did a fitness test on my second day of wearing them - no need to run them in.",
      "rating": 5.0,
      "verified": true,
      "author": "acha5137",
      "helpful_votes": 0,
      "publication_date": 20160229
    },
    {
      "title": "Lovely trainer, very comfy and bouncy, (like running ...",
      "text": "Lovely trainer, very comfy and bouncy, (like running on big pads of gel). Fit perfectly but that's because I always buy Asics trainers. Arrived on time.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20151226
    },
    {
      "title": "I love Asics gel nimbus and these were so reasonably priced ...",
      "text": "Fabulous new shoes. I love Asics gel nimbus and these were so reasonably priced I couldn't resist.",
      "rating": 5.0,
      "verified": true,
      "author": "magsie",
      "helpful_votes": 0,
      "publication_date": 20150823
    },
    {
      "title": "So far so good- very bouncy and great support. Still need to run them in a ...",
      "text": "So far so good- very bouncy and great support. Still need to run them in a bit on longer distances, but so far on 5-10 miles fine. Hopefully these will get me through the Paris Marathon!",
      "rating": 5.0,
      "verified": true,
      "author": "CB",
      "helpful_votes": 0,
      "publication_date": 20151202
    },
    {
      "title": "Asics do good shoes - nice springy bounce for indoor fitness",
      "text": "Asics do good shoes - nice springy bounce for indoor fitness, I wear them only in the gym for them to last longer.",
      "rating": 4.0,
      "verified": true,
      "author": "M. Malhi",
      "helpful_votes": 0,
      "publication_date": 20160127
    },
    {
      "title": "A step back.",
      "text": "Disappointing, uppers seemed to go baggy - gone back to Gel Nimbus 16, a better shoe.",
      "rating": 3.0,
      "verified": true,
      "author": "Mark Nugent",
      "helpful_votes": 0,
      "publication_date": 20160605
    },
    {
      "title": "feel like I'm running on clouds but with plenty of support ...",
      "text": "Had to order half a size up from my usual Asics size which is already a whole size bigger than my standard shoe size - bear in mind! Otherwise fab trainers, feel like I'm running on clouds but with plenty of support around the heel. Very pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "Ruth0987",
      "helpful_votes": 0,
      "publication_date": 20151005
    },
    {
      "title": "I absolutely love these. The fitting is a little on the ...",
      "text": "I absolutely love these. The fitting is a little on the small size, but feels like running in air",
      "rating": 5.0,
      "verified": true,
      "author": "reviewer",
      "helpful_votes": 2,
      "publication_date": 20150719
    },
    {
      "title": "Great cushioning",
      "text": "I love the cushioning. I was having some achiles pain as I was landing quite hard on my old shoes but these have made a big difference. Originally a bit horrified by the colour but actually quite like it now.",
      "rating": 5.0,
      "verified": true,
      "author": "A. S. A.",
      "helpful_votes": 0,
      "publication_date": 20151028
    },
    {
      "title": "Spring in my step",
      "text": "Love my trainers. Very happy and worth every penny. :)",
      "rating": 5.0,
      "verified": true,
      "author": "Elle sim",
      "helpful_votes": 0,
      "publication_date": 20150628
    },
    {
      "title": "Service was amazing.",
      "text": "Always worn nimbus and yet this really didn't agree with me. Foot burn plus knee problem, as well as Plantar issues resurfaced. Having to return as advised by Asics Customer Service. They were extremely helpful and sympathetic. Service was amazing.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160202
    },
    {
      "title": "... running in asics nimbus for years and I really love this update of them",
      "text": "I've been running in asics nimbus for years and I really love this update of them. But they do feel slightly wider than previous versions.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Anderson",
      "helpful_votes": 0,
      "publication_date": 20150824
    },
    {
      "title": "comfortable neutral trainer",
      "text": "Really comfortable cushioned neutral trainer, smart colour too. Regrettably they were not suitable with my orthotics so sent back.",
      "rating": 5.0,
      "verified": true,
      "author": "wing",
      "helpful_votes": 0,
      "publication_date": 20150731
    },
    {
      "title": "Five Stars",
      "text": "Very comfortable, my knees are much less unhappy when I run now.",
      "rating": 5.0,
      "verified": true,
      "author": "amjan",
      "helpful_votes": 0,
      "publication_date": 20151121
    },
    {
      "title": "Great!",
      "text": "I always go for ASICS. I do need a size 4 rather than my usual 3 though.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Tapley",
      "helpful_votes": 0,
      "publication_date": 20151031
    },
    {
      "title": "Five Stars",
      "text": "Excellent shoe fits perfectly, very comfortable, lots of support and bounce for running",
      "rating": 5.0,
      "verified": true,
      "author": "nicola",
      "helpful_votes": 0,
      "publication_date": 20170205
    },
    {
      "title": "and these ones haven't disappointed. Would",
      "text": "This is my second pair of Asics that I have purchased, and these ones haven't disappointed. Would recommend",
      "rating": 5.0,
      "verified": true,
      "author": "L. Heggie",
      "helpful_votes": 0,
      "publication_date": 20160120
    },
    {
      "title": "Great Running Trainers",
      "text": "Love these trainers for running in they give good cushioning & stability, I have tried others but Nimbus are the best",
      "rating": 5.0,
      "verified": true,
      "author": "Mini63",
      "helpful_votes": 0,
      "publication_date": 20151217
    },
    {
      "title": "The shoes arrived promptly and was very satisfied with the good and comfortable support the shoes provided",
      "text": "The shoes arrived promptly and was very satisfied with the good and comfortable support the shoes provided. The shoes look much better in real life than in the pictures",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20151107
    },
    {
      "title": "Highly recommended",
      "text": "The only model (gel-nimbus) I seem to be able to run in without injuring my knees. Great pair, worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "A.",
      "helpful_votes": 0,
      "publication_date": 20150815
    },
    {
      "title": "Comfortable and fits as expected",
      "text": "Top trainer for distance. Comfortable and fits as expected. I'm a 5 in shoes but always go for a 6 in trainers to allow foot room to expand.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170129
    },
    {
      "title": "Other than that they are brilliant and totally pleased with them",
      "text": "The Asics Gel Nimbus 17 do come up small - but I had read previous reviews and therefore ordered a larger size. Other than that they are brilliant and totally pleased with them.",
      "rating": 5.0,
      "verified": true,
      "author": "MRS J L DEBLING",
      "helpful_votes": 0,
      "publication_date": 20151202
    },
    {
      "title": "They are so comfortable and bouncy",
      "text": "Wow! They are so comfortable and bouncy. I don't really want to take them off my feet.",
      "rating": 5.0,
      "verified": true,
      "author": "LJ",
      "helpful_votes": 0,
      "publication_date": 20150919
    },
    {
      "title": "Five Stars",
      "text": "Like walking on cushions so light and springy, looking forward to my first proper run soon.",
      "rating": 5.0,
      "verified": true,
      "author": "min",
      "helpful_votes": 0,
      "publication_date": 20150421
    },
    {
      "title": "Great product, beautiful trainer",
      "text": "oh a totally beautiful looking and comfortable trainer, so much better in reality. I should have ordered two pairs. Packaging was excellent also",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160217
    },
    {
      "title": "Great running trainer",
      "text": "I wear size 4/37 shoes but always but size 5/38 trainers. Perfect for running.",
      "rating": 5.0,
      "verified": true,
      "author": "CHOPPERS",
      "helpful_votes": 0,
      "publication_date": 20170220
    },
    {
      "title": "Best running shoes ever!",
      "text": "Love these shoes! Delivery on time and comfort is 10 out of 10!",
      "rating": 5.0,
      "verified": true,
      "author": "Nicki",
      "helpful_votes": 0,
      "publication_date": 20150803
    },
    {
      "title": "Perfect fit",
      "text": "I have never bought shoes/clothing from Amazon before, and was somewhat apprehensive. However, the product arrived very soon (within 2 days of my order) and was exactly as I expected it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160211
    },
    {
      "title": "Brilliant",
      "text": "Fits perfectly. No need to break them in. Just put them on and go. Brilliant shoes",
      "rating": 5.0,
      "verified": true,
      "author": "sharon bowdidge",
      "helpful_votes": 0,
      "publication_date": 20151216
    },
    {
      "title": "Amazing support for plantar fasciitis sufferers!",
      "text": "Having previously suffering from plantar fasciitis these trainers give me the support I need to jog again.",
      "rating": 5.0,
      "verified": true,
      "author": "mrs A L Hoondert",
      "helpful_votes": 0,
      "publication_date": 20160612
    },
    {
      "title": "Five Stars",
      "text": "Great cushioned trainers, have used for high impact aerobics and running and my dodgy knees have been fine",
      "rating": 5.0,
      "verified": true,
      "author": "brandon",
      "helpful_votes": 0,
      "publication_date": 20150805
    },
    {
      "title": "Five Stars",
      "text": "Really great product and the best price around so thanks Amazon !!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Tina seddon",
      "helpful_votes": 0,
      "publication_date": 20150414
    },
    {
      "title": "Very comfortable to wear and love the gel insole",
      "text": "Having read the reviews I bought half a size bigger than my normal shoes and they fit perfectly. Very comfortable to wear and love the gel insole.",
      "rating": 5.0,
      "verified": true,
      "author": "josie smith",
      "helpful_votes": 0,
      "publication_date": 20151110
    },
    {
      "title": "Aside trainers.",
      "text": "Very quick delivery, trainers as picture shows unfortunately they only just fitted, so sent back for a pair slightly larger.",
      "rating": 5.0,
      "verified": true,
      "author": "Miss Lesley Rowland",
      "helpful_votes": 0,
      "publication_date": 20160108
    },
    {
      "title": "Very nice shoes to run in",
      "text": "Very nice shoes to run in .... I found that the are very narrow and appear to have a pointier nose on them which makes the shoe feel longer that it needs to be. As always a very comfortable shoe.",
      "rating": 4.0,
      "verified": true,
      "author": "Bunny (JS) Cummings",
      "helpful_votes": 0,
      "publication_date": 20150623
    },
    {
      "title": "asics running shoes",
      "text": "Very happy with this product, colour and fit ad expected good quality and worth the price seen these on other websites and they cost £110",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160601
    },
    {
      "title": "Great but on the small side",
      "text": "I love the heel and ankle support and the 'bounce' but the toe box is so small. I would say go for a full size bigger than normal shoe size",
      "rating": 3.0,
      "verified": true,
      "author": "JHR",
      "helpful_votes": 0,
      "publication_date": 20151003
    },
    {
      "title": "Bought new received used",
      "text": "Can't even give a star-bought as a present for my wife and left completely disappointed Christmas morning when she took them out of the bbox and there was mud and grass stains on the sole! An absolute disgrace.",
      "rating": 1.0,
      "verified": true,
      "author": "Neil Hudson",
      "helpful_votes": 0,
      "publication_date": 20161226
    },
    {
      "title": "I love it, nice color",
      "text": "The front is a bit narrow and my toes hurt the first day. But after that, it is match and suitable. I love it, nice color.",
      "rating": 5.0,
      "verified": true,
      "author": "Moon",
      "helpful_votes": 0,
      "publication_date": 20150728
    },
    {
      "title": "Perfect! I've had an old pair of Asics for ...",
      "text": "Perfect! I've had an old pair of Asics for several years and was looking for a replacement. These fit the bill and look great too.",
      "rating": 5.0,
      "verified": true,
      "author": "vardeep",
      "helpful_votes": 0,
      "publication_date": 20160918
    },
    {
      "title": "Five Stars",
      "text": "Really springy and cushioning. I clearly had been wearing my old Asics for far too long!",
      "rating": 5.0,
      "verified": true,
      "author": "TicTac",
      "helpful_votes": 0,
      "publication_date": 20150604
    },
    {
      "title": "Five Stars",
      "text": "Really nice shoe but glad I ordered half a size bigger.",
      "rating": 5.0,
      "verified": true,
      "author": "Miss S K Forge",
      "helpful_votes": 2,
      "publication_date": 20150607
    },
    {
      "title": "Good",
      "text": "Very comfy but did run the arch of my foot after about 4miles",
      "rating": 4.0,
      "verified": true,
      "author": "sophie robertson",
      "helpful_votes": 0,
      "publication_date": 20151023
    },
    {
      "title": "Tight shoes despite ordering usual size",
      "text": "I am on to what must be my 35th pair of asics away buying the same size however these are tight. Not s re what happened there but there goes £90...",
      "rating": 2.0,
      "verified": true,
      "author": "Paula Kerr-Jarrett",
      "helpful_votes": 0,
      "publication_date": 20151020
    },
    {
      "title": "asics nimbus 17s - Great running shoes",
      "text": "asics nimbus - great as always - fab fit - went straight into them and out the door",
      "rating": 5.0,
      "verified": true,
      "author": "Kaz Bell",
      "helpful_votes": 0,
      "publication_date": 20160818
    },
    {
      "title": "Best Cushioning",
      "text": "Very cushiony if you do high impact exercise. It feels like landing on a mattress.",
      "rating": 5.0,
      "verified": true,
      "author": "S Amin",
      "helpful_votes": 0,
      "publication_date": 20150817
    },
    {
      "title": "Fab shoe",
      "text": "I have used Asics for years and the gel nimbus doesn't disappoint.",
      "rating": 5.0,
      "verified": true,
      "author": "Dawn Bateman",
      "helpful_votes": 0,
      "publication_date": 20160325
    },
    {
      "title": "3 times was not a charm",
      "text": "For the third time I was sent the wrong size or colour. Love these shoes but Asics don't seem to want me to have them. Is it a Nike plot?",
      "rating": 1.0,
      "verified": true,
      "author": "Mr Timothy Kells",
      "helpful_votes": 2,
      "publication_date": 20150522
    },
    {
      "title": "Extremely pleased with my purchase",
      "text": "Extremely pleased with my purchase. I've only very recently started to run, but already I can feel the benefit of having the appropriate footwear",
      "rating": 5.0,
      "verified": true,
      "author": "Caroline Potts",
      "helpful_votes": 0,
      "publication_date": 20150904
    },
    {
      "title": "asics trainers",
      "text": "Really pleased I've had Asics before there the best running trainers I would buy these again",
      "rating": 5.0,
      "verified": true,
      "author": "Wendy",
      "helpful_votes": 0,
      "publication_date": 20150830
    },
    {
      "title": "Great running trainers",
      "text": "Love these trainers, great fit, comfortable and they look nice.",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs D A Spencer",
      "helpful_votes": 0,
      "publication_date": 20160510
    },
    {
      "title": "Re-ordered a size bigger and they are perfect. Love the shoes",
      "text": "I ordered my usual size and had to return them as too small. Re-ordered a size bigger and they are perfect. Love the shoes!",
      "rating": 5.0,
      "verified": true,
      "author": "Gillian Coles",
      "helpful_votes": 0,
      "publication_date": 20150615
    },
    {
      "title": "Three Stars",
      "text": "they came a bit larger than usually for this number.",
      "rating": 3.0,
      "verified": true,
      "author": "Estefania",
      "helpful_votes": 0,
      "publication_date": 20160217
    },
    {
      "title": "Five Stars",
      "text": "Must have running shoes. Tremendous difference in comfort compared to high end nikes.",
      "rating": 5.0,
      "verified": true,
      "author": "Julija",
      "helpful_votes": 0,
      "publication_date": 20160510
    },
    {
      "title": "Five Stars",
      "text": "Bought these as a present and they were perfect - and they arrived early.",
      "rating": 5.0,
      "verified": true,
      "author": "paul dennis",
      "helpful_votes": 0,
      "publication_date": 20150423
    },
    {
      "title": "Five Stars",
      "text": "As expected a lovely comfortable pair of running trainers thanks",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160114
    },
    {
      "title": "Love Gel-Nimbus",
      "text": "Great running shoe definately bigger than the 16 model, so great improvement.",
      "rating": 5.0,
      "verified": true,
      "author": "CAA",
      "helpful_votes": 0,
      "publication_date": 20150419
    },
    {
      "title": "Five Stars",
      "text": "I really love them! Best running shoes purchased to date!",
      "rating": 5.0,
      "verified": true,
      "author": "Kulvinder Madahar",
      "helpful_votes": 0,
      "publication_date": 20150913
    },
    {
      "title": "Five Stars",
      "text": "I love these trainers . Really good value for money",
      "rating": 5.0,
      "verified": true,
      "author": "Sharon skinner",
      "helpful_votes": 0,
      "publication_date": 20150506
    },
    {
      "title": "absolutely fantastic running shoes. worth every penny.",
      "text": "bought on my account for my gf.Excellent pair of running shoes and worth every penny. They look great (for a girl) feel great and have fantastic comfort and support.",
      "rating": 5.0,
      "verified": true,
      "author": "Optimist Prime",
      "helpful_votes": 0,
      "publication_date": 20150417
    },
    {
      "title": "ok for my foot pain but difficult to run in",
      "text": "I bought these trainers as I was getting pain in my foot when I ran. These trainers did help with the pain but they are very spongy and made my runs twice as hard on the backs of my legs! I now just use these trainers once a week for my slow run and ended up buying another pair for my normal runs! 0_0",
      "rating": 4.0,
      "verified": true,
      "author": "V Dyas",
      "helpful_votes": 0,
      "publication_date": 20150802
    },
    {
      "title": "I struggle to find good shoes but these are great for my damaged feet.",
      "text": "I absolutely love these trainers. I have to wear insulates for my arch is falling down and causes me a tremendes amount of pain. But with insulates in these shoes it feels like I am walking on clouds. I am standing most of the time at work but i have no pain in my feets. I love the coulor and have had a lot of compliments for my shoes mostly by guys. I had tryed them on in town but they costed 140 pounds so I looked on amazon and found these for a much better price. I am very happy with this purchase",
      "rating": 5.0,
      "verified": true,
      "author": "susanne",
      "helpful_votes": 0,
      "publication_date": 20160219
    },
    {
      "title": "OVER THE MOON!",
      "text": "Ecstatic with these shoes. Great snug fit with enough room for toes, more lightweight compared to previous gel-nimbus models and really (REALLY) comfortable, not to mention run-stylish. They name them after clouds for a reason folks, I never want to take them off!",
      "rating": 5.0,
      "verified": true,
      "author": "Holly",
      "helpful_votes": 0,
      "publication_date": 20150521
    },
    {
      "title": "Cushioning makes these trainers unwearable for running. Would be ok for walking in",
      "text": "Can't run in them. Make my feet hurt. Balls of the feet were burning (Similar feeling to wearing high heels for too long). Asics are going to replace them. Good service from them so far. No quibbles",
      "rating": 1.0,
      "verified": true,
      "author": "Tracey",
      "helpful_votes": 0,
      "publication_date": 20150702
    },
    {
      "title": "... got neon green poplaces for them and they look great too!",
      "text": "These are just lovely to run in - got neon green poplaces for them and they look great too!",
      "rating": 5.0,
      "verified": true,
      "author": "Fin",
      "helpful_votes": 0,
      "publication_date": 20151110
    },
    {
      "title": "Having had several pairs of these over recent years this ...",
      "text": "Having had several pairs of these over recent years this pair have so far lived up to my expectation. A weird sizing policy as my shoe size is 4.5/5 but I need 6.5 in this style. Received within promised timescale and well packaged.",
      "rating": 5.0,
      "verified": true,
      "author": "Jaki Diggle",
      "helpful_votes": 0,
      "publication_date": 20160228
    },
    {
      "title": "Four Stars",
      "text": "Great colour, good fit and does what I am looking for",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160120
    },
    {
      "title": "... years and I have to say 17 is a disappointment. Starting to cut corners on materials and quality",
      "text": "I've purchased a pair of Asics Nimbus every year for the last 10 years and I have to say 17 is a disappointment. Starting to cut corners on materials and quality. I hope this isn't a lasting trend.",
      "rating": 3.0,
      "verified": true,
      "author": "vanwa",
      "helpful_votes": 6,
      "publication_date": 20150624
    },
    {
      "title": "A must for over supinators!!",
      "text": "Always buy Asics Nimbus or 2000's as I am a severe supinator, and with all of the brands I've tried, Asics have come through year after year. The one thing I've noticed that differs is that the shoe is a bit more spacious at the ankle - so I now use all of the shoestring holes (used to not use the very top one). Also I am a heavier runner - and these shoes are durable. I usually replace them every 6 months / 500 miles - If you're new to running - only use your running shoes for running!! You will make them last longer :)",
      "rating": 4.0,
      "verified": true,
      "author": "Glamagirl",
      "helpful_votes": 3,
      "publication_date": 20160103
    },
    {
      "title": "Comfort Indeedy",
      "text": "I wish I'd had gait analysis as I am not sure these are perfect for my feet. My first couple of runs produce painful shins so I went back to my Nikes and New Balance and used my ASICS in the gym for aerobics. Began running with them again by first walking and running and then running - I appear to have run them in",
      "rating": 4.0,
      "verified": true,
      "author": "ivlyndy",
      "helpful_votes": 0,
      "publication_date": 20160224
    },
    {
      "title": "Can't recommend enough.",
      "text": "Superb road shoes. Training for my first half marathon and these are just excellent. Saw a podiatrist who said you cannot get a better pair of road shoes and my sports physiotherapist said the same today. The cushioning is fantastic, they're light & the fit is excellent. I'm usually a 6 and for 6.5 - spot on. Buy these - you won't regret it. They also looks awesome which helps 😉",
      "rating": 5.0,
      "verified": true,
      "author": "BeccaT",
      "helpful_votes": 0,
      "publication_date": 20150701
    },
    {
      "title": "Fab running shoes",
      "text": "I bought those for walking as part of my exercise weekly routine. The main criteria for choosing ASICS as a brand initially and these running shoes in particular are my knees. They click sometimes and I wanted to protect them as much as possible, hence proper trainers. I am not disappointed to say the least. I am actually looking forward to my walks because the shoes are so comfy and great to wear. I am UK 7, my foot is quite wide and I have ordered 7.5. Great fit for me! Plenty of space for the running socks!",
      "rating": 5.0,
      "verified": true,
      "author": "Svetlana",
      "helpful_votes": 9,
      "publication_date": 20150621
    }
  ],
  "product_meta": {
    "title": "ASICS Gel-Nimbus 17, Women's Running Shoes",
    "description": "The ASICS GEL-NIMBUS 17 features technologies such as Fluid Ride, a 2 layered midsole construction featuring a combination of both SpEVA and Solyte. Another key feature for the 17th edition is the latest evolution in ASICS midsole technology, FluidRideTM. Improving on it's previous generation it provides the ultimate combination of bounce back and cushioning properties with reduced weight and exceptional durability. The upper construction know as FluidFitTM combines multi-directional stretch mesh with stretch reinforcements that adapt to the athlete's foot, creating a truly customised glove-like fit for the wearer. A new addition to the many technologies featured is the Exoskeletal heel counter which provides improved support and creates an improved heel fitting environment. The customisation goes further with P. H. F. securely hugs the heel with memory foam in a durable execution. The Nimbus 17's come gender specified. A design built on lasts and moulds that are tooled specifically to designated widths. ASICS design philosophy employs linked componentry to enhance the foot's natural gait from heel strike to toe-of, accomplished through an impact guidance system aiming to leave a better overall feeling and comfort throughout. The outsole is produced from a Durasponge technology, a blown AHAR rubber compound that gives enhanced cushioning and durability in the forefoot. AHAR+ also features a strong material that's strategically placed in critical areas of the shoe to provide excellent grip without compromising the shoes durability, the + means the shoe is lighter that the previous generation technology but not taking away the overall efficiency or productivity. An improved wearers gait efficiency is given from the vertical flex grooves that decouples the tooling along the line of progression for enhanced gait efficiency.",
    "rating": 4.5,
    "feature_bullets": [
      "Durasponge Outsole - A blown AHAR rubber compound for enhanced cushioning and durability in the forefoot.",
      "APMA Seal of Acceptance - Designated shoes have the American Podiatric Medical Association (APMA) Seal of Acceptance",
      "Outer Material: Synthetic",
      "Inner Material: Textile",
      "Sole: Gum Rubber",
      "Closure: Lace-Up",
      "Heel Type: Flat",
      "Shoe Width: Normal",
      "FluidFit Upper Construction - ASICS upper technology combines multi-directional stretch mesh with stretch reinforcements that adapt to the athlete's foot, creating a truly customized glove-like fit.",
      "FluidRide Midsole - The latest evolution in ASICS midsole technology, FluidRide provides the ultimate combination of bounce back and cushioning properties with reduced weight and exceptional durability.",
      "Rearfoot and Forefoot GEL Cushioning Systems - Attenuates shock during impact and toe-off phases, and allows movement in multiple planes as the foot transitions through the gait cycle."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "Yes",
      "Package Dimensions": "1 x 1 x 1 cm; 500 Grams",
      "Date First Available": "2 Dec. 2014",
      "Manufacturer": "ASICS",
      "ASIN": "B00TXA3M80",
      "Item model number": "T557N",
      "Department": "Women's"
    },
    "categories": [
      "Fashion & Athletic Trainers",
      "Shoes",
      "Sports & Outdoor Shoes",
      "Women's Shoes",
      "Road Running Shoes",
      "Running Shoes",
      "Shoes & Bags"
    ],
    "price": ""
  }
}