{
  "website_summaries": [
    {
      "verdict": "The Monster SuperStar BackFloat's sound quality won't blow you away, but its travel-friendly design and unique ability to float on water makes it a fun accessory for your next pool party.",
      "pros": [
        "The Monster SuperStar BackFloat is a portable Bluetooth speaker with a tough outer shell that protects it from water, dirt and dust",
        "As the name implies, it can also float on its back with the speaker pointed up to add music to a pool party",
        "It also includes a well-padded play-through case and features speakerphone capabilities"
      ],
      "cons": [
        "It's more expensive than competing waterproof speakers, it can't handle deep bass well, and the sound distorts at higher volumes"
      ],
      "aspects": {
        "Design": 8.0,
        "Features": 8.0,
        "Sound": 6.0,
        "Value": 6.0
      },
      "publication_date": 20150820,
      "rating": 6.7,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Bluetooth goes out if it gets wet!",
      "text": "This was great for about 2-3 months but as soon as it got in the water to “FLOAT”, it went dead. The Bluetooth stopped working and now you have to use the plug to get it to work, there’s no way to fix the Bluetooth once it goes out. The warranty doesn’t cover it either.",
      "rating": 3.0,
      "verified": true,
      "author": "Belinda Reesing",
      "helpful_votes": 0,
      "publication_date": 20180408
    },
    {
      "title": "Sad",
      "text": "Loved this had it two weeks and the Bluetooth went out now I have a floating water proof speaker that doesn’t play music but I can still connect a cord but if cord is connected not water proof",
      "rating": 3.0,
      "verified": true,
      "author": "Jeritt W. King",
      "helpful_votes": 0,
      "publication_date": 20190824
    },
    {
      "title": "Perfect little speaker.",
      "text": "This little speaker rocks! Or hip hops or whatever else you want to bump through. It sounds very clear. Not too much bass but it's not for that. I took it on vacation with me and it was perfect. Floats right in the pool and sounds awesome. I also like the little storage case that comes with it",
      "rating": 5.0,
      "verified": true,
      "author": "chris",
      "helpful_votes": 0,
      "publication_date": 20151211
    },
    {
      "title": "LOVE IT LOVE IT!!!!",
      "text": "LOVE IT LOVE IT!!!! Cool that it floats in the pool and when hangin by the boat, or on the beach and it rocks!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Geno",
      "helpful_votes": 0,
      "publication_date": 20171114
    },
    {
      "title": "Like it blew or something",
      "text": "I purchased the superstar backfloat in Oct of 2015. Last night while listening at a low volume the speaker just went mute. Like it blew or something. Now I can barley hear it at full volume. My cheap knockoff I bought from target almost two years ago for $40 is still going strong however. Would not reccomend this product or company. Its sounded great when it worked.",
      "rating": 2.0,
      "verified": true,
      "author": "chip douglas",
      "helpful_votes": 0,
      "publication_date": 20160325
    },
    {
      "title": "Love it!",
      "text": "Had it a week and it's been in the pool every day. Love it!!",
      "rating": 5.0,
      "verified": true,
      "author": "Lance Fry",
      "helpful_votes": 0,
      "publication_date": 20170701
    },
    {
      "title": "I like to return it soon",
      "text": "It is not functioning the Bluetooth plug is not excepting my cord for charging I am waiting for a return pack or sticker to return it",
      "rating": 5.0,
      "verified": true,
      "author": "I have not received this product yet cancel it ",
      "helpful_votes": 0,
      "publication_date": 20190321
    },
    {
      "title": "Batterys suck",
      "text": "Good sound but the battery life sucks only 3 hours",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "Great sound for such a little speaker/",
      "text": "Great little speaker, great for the pool or the shower",
      "rating": 5.0,
      "verified": true,
      "author": "OHS",
      "helpful_votes": 0,
      "publication_date": 20160128
    },
    {
      "title": "Don't expect a lot",
      "text": "Sound is great at low volume but static starts at half volume. Hence not great for a loud pool/backyard area. Good bluetooth distance and nice that it floats (and completely waterproof).",
      "rating": 2.0,
      "verified": true,
      "author": "Jim T",
      "helpful_votes": 0,
      "publication_date": 20150823
    },
    {
      "title": "this sucks!!",
      "text": "Stopped working... Two months after i received this item and now I can't get a refund..this sucks!!",
      "rating": 1.0,
      "verified": true,
      "author": "alicia morton",
      "helpful_votes": 0,
      "publication_date": 20170122
    },
    {
      "title": "This speaker is ok at best.. not worth $150",
      "text": "This speaker is ok at best.. not worth $150... sound quality was not that good , a lot of interference even when phone was 2\" way from speaker... was not as loud as I thought it would be.. maybe I got a bad unit but I went back to JBL.. much better speaker. JBL is 5 star product.. only bought this Monster speaker because I saw it on a fishing tv show.. bad idea Good luck",
      "rating": 2.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20170620
    },
    {
      "title": "Monster Bluetooth speaker",
      "text": "The sound quality is excellent and it is compact enough to carry just about anywhere",
      "rating": 4.0,
      "verified": true,
      "author": "Jules",
      "helpful_votes": 0,
      "publication_date": 20160203
    },
    {
      "title": "Five Stars",
      "text": "I like the sound, not too bright. Haven't tried in the water.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20151109
    },
    {
      "title": "Very nice speaker with good sound",
      "text": "Very nice speaker with good sound. The bass is okay, but the speaker gets decently loud for its size. No worries if using outside! The construction of this product and its waterproofing should equate to great outdoor use. Its size makes it ultra portable and perfect as an everyday speaker to leave in a backpack.",
      "rating": 4.0,
      "verified": true,
      "author": "Jonathan",
      "helpful_votes": 0,
      "publication_date": 20160731
    },
    {
      "title": "do NOT float in water",
      "text": "Not water proof- just water resistant. do NOT float in water as shown on the picture",
      "rating": 3.0,
      "verified": true,
      "author": "Diane Hofer",
      "helpful_votes": 0,
      "publication_date": 20160206
    },
    {
      "title": "This speaker has great sound with just the right amount of bass and ...",
      "text": "This speaker has great sound with just the right amount of bass and it's compatible with all three of my phones. (Some are outdated). Also very fast shipping. A+++ seller!",
      "rating": 5.0,
      "verified": false,
      "author": "Angela Mccormick",
      "helpful_votes": 0,
      "publication_date": 20180226
    },
    {
      "title": "We've had it for about 3 years and it's awesome. Great sound",
      "text": "My whole family loves our BackFloat!! We've had it for about 3 years and it's awesome. Great sound, like a much larger speaker. We all fight over who gets to take it with them.",
      "rating": 5.0,
      "verified": false,
      "author": "DJM",
      "helpful_votes": 0,
      "publication_date": 20171202
    }
  ],
  "product_meta": {
    "title": "Monster Cable SuperStar 24K BackFloat High Definition Bluetooth Speaker (Black/Gold)",
    "description": "Color:Black on gold\n\nMonster Cable SuperStar 24K BackFloat High Definition Bluetooth Speaker in Black and Gold\n\nThere’s a party in your pool, and SuperStar BackFloat is throwing it. Sing along in the shower or tub or float this powerful speaker in the Jacuzzi. Bring it to the campsite or to the beach. BackFloat is engineered to keep pumping out high-performance Pure Monster Sound no matter how wet things get.100% Pure Monster Sound :Its waterproof.Floats in water.Great for use as Bluetooth shower speaker.Works in pool, Jacuzzi, tub, at beach, camping, and more.Getting powerful, precise sound outdoors is a challenge for most wireless outdoor speakers. BackFloat portable speakers are extremely potent, packing a punch at very high volume levels without distortion, even as they float around the pool or tub. That’s the legacy of Pure Monster Sound, 36 years in the making.Rugged Design for Active Lifestyles:The BackFloat rugged Bluetooth speaker has an incredibly tough silicon casing that not only seals water out, but is completely shockproof. An acoustically transparent carrying case lets you hang it, wear it, or simply protect it, while playing it. This little floating speaker is the perfect mate for all your adventures, and is ready for anything you throw at it.It’s Also a Speakerphone:A built-in mic with Monster’s exclusive voice technology means easy speakerphone calls that let you hear every word.Take handsfree calls from any Bluetooth phone, including Apple and Android.High-performance microphone for crystal-clear phone calls.\n\nFeatures :\n\n * Waterproof speaker featuring tough silicone case\n * Shockproof, rugged shell\n * Works great as a camping speaker\n * Connects to any music device using a 3.5mm Aux line\n * Charges via USB cable (included) attached to a USB power adapter",
    "rating": 4.4,
    "feature_bullets": [
      "Acoustically transparent protective carry pouch included",
      "Built in mic with advanced noise cancellation enables clear wireless hands-free calling",
      "Connects to any music device using a 3.5mm Aux line out",
      "Designed to float in the water, the Back Float will always rise to the top!",
      "For pool, party, tub, shower, and all-season outdoor use"
    ],
    "specifications": {
      "Product Dimensions": "9.8 x 2.7 x 5.5 inches",
      "Item Weight": "10.1 ounces",
      "ASIN": "B016F73120",
      "Item model number": "MSP SPSTR BKF BT BK 24K WW",
      "Batteries": "1 AA batteries required.",
      "Customer Reviews": "4.4 out of 5 stars59 ratings4.4 out of 5 stars",
      "Best Sellers Rank": "#14,515 in MP3 & MP4 Player Accessories",
      "Is Discontinued By Manufacturer": "No",
      "Wireless communication technologies": "Bluetooth",
      "Connectivity technologies": "Bluetooth, USB, Auxilliary",
      "Additional Features": "Ultra-portable, Built-in-microphone",
      "Other display features": "CE",
      "Colour": "Black on gold",
      "Manufacturer": "Monster Power, LLC",
      "Date First Available": "October 27, 2015"
    },
    "categories": [
      "Portable Audio & Video",
      "Electronics",
      "MP3 & MP4 Player Accessories"
    ],
    "price": 39.0
  }
}