{
  "website_summaries": [
    {
      "verdict": "A nice hardshell jacket for owmen that comes with a fleece layer you can zip in for added warmth or wear on its own.",
      "pros": [
        "Outer shell keeps you dry",
        "Fleece layer zips out and can be worn on its own",
        "Bright color and good fit",
        "Thanks to the fleece, this coat that can be worn in many types of weather without being too bulky"
      ],
      "cons": [
        "The hood is not removable",
        "Sleeves of fleece can sometimes bunch or grab clothing"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Good news is",
      "text": "I'm 5'10\", so I knew the chances of the sleeves of this jacket being long enough would be slim. It just fits, but definitely shortens and tightens up every time my arms are bent. I'd hoped to be able to wear this jacket if I got caught in the rain while cycling, but it's only big enough for casual wear during minimal activity. Good news is, the parts that are covered definitely keep me dry and the the jacket under the shell is nice enough that it can be worn without the outer part--again, as long as I'm ok with wearing the sleeves pushed up or I'm only walking and moving minimally.",
      "rating": 3.0,
      "verified": true,
      "author": "nlipford",
      "helpful_votes": 2,
      "publication_date": 20160317
    },
    {
      "title": "My mom loves it!",
      "text": "I bought this for my mom. She loves it. It's pretty cold now (she lives in Philly) and she's tiny but she keeps telling me how it's warmer than her much larger parka. The only issue she has is that sometimes it's hard to get her shirt past the inside shell's fabric because it's not slippery at all so it grabs at other non-slippery fabrics. But, if you hold it when you put your hand through the sleeve, it's not a problem. Small quibble for a jacket my mother really seems to like. Plus, I look like a great son!",
      "rating": 4.0,
      "verified": true,
      "author": "Charles Turner",
      "helpful_votes": 2,
      "publication_date": 20170207
    },
    {
      "title": "Great wind blocker  -  Not as warm as expected",
      "text": "This jacket is quite nice, but considering the two layers it is not as warm as I expected. The hardshell does block wind effectively, but the fleece liner isn't as warm as I had expected. The fleeces does secure at the sleeves, along the zipper and in the back of the neck to the hard shell, but I find that the sleeves move, stick out, or try to get bunched up. It's not a deal breaker, though it is annoying (and was not an issue in my previous jacket like this).",
      "rating": 3.0,
      "verified": true,
      "author": "chattyabbey",
      "helpful_votes": 2,
      "publication_date": 20151209
    },
    {
      "title": "Love the bright color",
      "text": "My second Zeroxposur jacket. Love the bright color, will use for next trip. Easy to see in the crowd. Pleasantly surprised with the attached jacket. Quality made. I'm small frame and ordered medium for anticipated layering- fits perfect. I'm 5'1\" and it comfortably covers my bumm. Same fabric as my other ZeroX jacket (it was perfect in the wind and rain). I will order a third style jacket for my granddaughter.",
      "rating": 5.0,
      "verified": true,
      "author": "Sandy",
      "helpful_votes": 2,
      "publication_date": 20170418
    },
    {
      "title": "Ok",
      "text": "Okay jacket the pink inside of the jacket is pretty much ruined cause of the lint balls that build up on it, luckily that park is removable but then it just the wind breaker part which is okay cause then I can wear something else long sleeve comfortably instead.",
      "rating": 2.0,
      "verified": true,
      "author": "Jen",
      "helpful_votes": 0,
      "publication_date": 20170417
    },
    {
      "title": "Nice jacket - perfect for my needs.",
      "text": "I like this jacket a lot. The liner is very nice, too. I like that the jacket can with worn with or without the liner, and that the liner can be worn separately, basically making it a 3-way jacket. It fits as expected and looks well made. I have not had a chance to actually wear it yet - just tried it on, but I expect there to be no problems with it.",
      "rating": 5.0,
      "verified": true,
      "author": "R. A. Collins",
      "helpful_votes": 0,
      "publication_date": 20170418
    },
    {
      "title": "Nice jacket. These tend to run a bit small ...",
      "text": "Nice jacket. These tend to run a bit small so I ordered a large and it fit me as expected. Love the color and price, too.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180207
    },
    {
      "title": "Some details but I'll  keep it.",
      "text": "A warm jacket. Size suits perfectly right. I thought the inside jacket was pink but it is a bright Orange color. I do not like it very much. The design of the White jacket is nice but the material is hard and noisy. I have not wear it on a rainy day yet. Double zip keeps warmth and is an excellent detail of the design. Summing up I will keep it.",
      "rating": 4.0,
      "verified": true,
      "author": "MARIA SILVERA",
      "helpful_votes": 0,
      "publication_date": 20151021
    },
    {
      "title": "i like the jacket but it's too big and the small ...",
      "text": "i like the jacket but it's too big and the small is too small- I returned it and got my money back",
      "rating": 3.0,
      "verified": true,
      "author": "mc39",
      "helpful_votes": 0,
      "publication_date": 20180319
    },
    {
      "title": "Great Gorgeous Deal!!",
      "text": "Gorgeous coat!! I'm going to get a lot of use of this baby!! Or the price and the quality, I would definitely buy it again!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20151016
    }
  ],
  "product_meta": {
    "title": "ZeroXposur Women's Maxine Hardshell Systems Jacket",
    "description": "Our 3-in1 systems jacket offers the versatility of converting your garment to suit your needs. Our water resistant shell adds protection to keep you dry and the powerflex fleece inner will help keep you warm. This combination will provide you great protection and comfort.",
    "rating": 3.7,
    "feature_bullets": [
      "100% Polyester",
      "Imported",
      "Machine Wash",
      "Water repellant and wind resistant hard shell",
      "Zip out inner liner that becomes a fleece sweater",
      "Outside pockets to hold your valuables"
    ],
    "categories": [
      "Women",
      "Active & Performance",
      "Insulated Shells",
      "Clothing, Shoes & Jewelry",
      "Clothing",
      "Coats, Jackets & Vests"
    ],
    "price": "",
    "specifications": {}
  }
}