{
  "website_summaries": [
    {
      "verdict": "These LED lights can rotate more than 190° to light up whatever's cooking.",
      "pros": [
        "10 bright LED lights rotate 190° to light your grill",
        "Made of durable, heat-resistant ABS plastic",
        "Withstands intense heat",
        "Touch-sensitive power button",
        "Fits most grill handles except kettle grills",
        "Easily mounts and dismounts",
        "Lights wide angles"
      ],
      "cons": [
        "Plastic may melt if installed too close to heat source"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Seems like it came with the grill",
      "text": "This has been a really good decision! It really does the job, lighting up the grill brightly and evenly. I've had it for about 3 months, and I'm totally satisfied. The light mounted very easily and quickly and adjusts just as easily, if needed, which is pretty much never. It turns on and off with a touch, but has never turned on or off when it wasn't supposed to. I don't know how it would stand up to direct weather, because I cover my grill, but winter and spring cold and rains and such haven't caused any problems. From my experience to this point, I would certainly recommend the Grill Kindle.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 3,
      "publication_date": 20180407
    },
    {
      "title": "Get a flash light!",
      "text": "How can you make a grill light that fastens to the handle and then needs to be taken off after each use. It is NOT WEATHER PROOF< how dumb is that. The product looks great until you read the instructions. A lot easier and cheaper to use a flash light.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 6,
      "publication_date": 20161016
    },
    {
      "title": "NOT WATER RESISTANT/PROOF!!",
      "text": "Cheaply made and not at all waterproof. They don't even make an attempt to keep the water out by using a seal or and silicone around the housing. Quit working mid season so I only took it out when using it which kind of defeats the purpose of an attached grill light. Recently, it started short out. The water had gotten inside and corroded the the connections. I tried to fix it but the little cheap wires inside broke. Don't get this one or ones like it if you want one that will last. This is direct to landfill unfortunately!",
      "rating": 1.0,
      "verified": true,
      "author": "Kimberly Lyngholm",
      "helpful_votes": 0,
      "publication_date": 20200510
    },
    {
      "title": "Take that Darkness!",
      "text": "This weatherproof LED light is super easy to install and works like a charm. Our grill is in a very dark corner and this little light of mine shines like you wouldn't believe. It lights up the entire grill surface area (we have a 5 burner grill) plus the area right around the grill. Works off of batteries and just tightens right to the handle. Durable construction and easy on/off button makes for a perfect product!",
      "rating": 5.0,
      "verified": true,
      "author": "BPotts",
      "helpful_votes": 0,
      "publication_date": 20190701
    },
    {
      "title": "lIGHT TURNS ON AND DRAINS BATTERIES",
      "text": "love the light. Hate the light switch. It turns on by just touching it. That means that it turns on when you put the cover on your grill or when the wind blows your cover against it and drains the batteries. Tired of the batteries always being drained when I go to use it. Have to use it as a shop light or something. I was just going to reverse a battery so it wouldn't turn on but you need a screw driver to get into the battery compartment.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191105
    },
    {
      "title": "4 months and threads stripped",
      "text": "update Jan 2017 After 4 months of use, the clamp of the light stripped. I hadn't noticed that the mounting just had plastic threads. With my normal use, the threads gradually wore out until the mount no longer worked. Bad design! Should have metal threads. original post: The grill light fits perfectly on my Weber grill. The light is certainly bright enough, even barbecuing in the rain. The quality of constructions seems good. Shipped via amazon Prime and arrived quickly and in good shape.",
      "rating": 2.0,
      "verified": true,
      "author": "Smalks",
      "helpful_votes": 2,
      "publication_date": 20160930
    },
    {
      "title": "Fits Chargriller Akorn Kamado perfectly!!",
      "text": "After several years of grilling in the dark with my phones flashlight, I have finally found a solution. The size of this light is very compact and easily folds out of the way to fit any size grill cover. I used this on my Chargriller akorn kamado and it fits perfectly. I love how the button to activate the light is touch sensitive. I thought this would be an issue with it being activated unintentionally but no issues so far. Highly recommend this product for all of you late night grillers!!",
      "rating": 5.0,
      "verified": true,
      "author": "Bryan",
      "helpful_votes": 4,
      "publication_date": 20170831
    },
    {
      "title": "Better than the previous light.",
      "text": "Much better quality then my last light. The instructions aren’t very good though like where the in off button is located which turned out to be tapping the device on the top. The clamp is also designed for a round or cylindrical handle but I made it work. Overall though I’m pleased so far.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "Can’t tilt well, hits grill when closed, not waterproof",
      "text": "It took ten minutes to see this light was unusable. On my Weber Genesis grill, if I position it to light the grilling surface, it hits the grill when I close the lid. If I move the light so it doesn’t hit the grill, it can only shine light into the air. The light can tilt & swivel, just not far enough or in the right directions. Plus you should remove it after every use due to weather? Sent it back 10 minutes after I got it.",
      "rating": 1.0,
      "verified": true,
      "author": "Bing",
      "helpful_votes": 0,
      "publication_date": 20190215
    },
    {
      "title": "Product broke after a few months",
      "text": "I don’t know how this product has received so many good reviews. Maybe folks haven’t updated them after having this light for some time. I purchased this light a few months ago, and it was okay while it lasted. However, the product is very cheap and the screws nearby the pivot point came out. Due to the design, it’s impossible to get it back in. I reached out to the company to see if I could get a replacement, but they refuse to stand behind their product. Overall, I can not recommend this product if you’re looking for a light that will last.",
      "rating": 1.0,
      "verified": true,
      "author": "Ryan",
      "helpful_votes": 0,
      "publication_date": 20190601
    },
    {
      "title": "Total piece of worthless junk",
      "text": "This barbecue grill light is a total piece of junk. The first second I put batteries in it would not light. About five minutes after installing the batteries and pushing the on button with no response the light would suddenly turn itself on. The on off switch does absolutely nothing and this light is a total piece of junk. Do not buy it",
      "rating": 1.0,
      "verified": true,
      "author": "Beth G",
      "helpful_votes": 0,
      "publication_date": 20200212
    },
    {
      "title": "Very bright very sturdy definitely weatherproof.",
      "text": "We bought this for my husband's grill for Christmas. It's an awesome product. Very bright it's already snowed on it twice and it works perfect. you can adjust the light to wherever you want it and it stays put. The brightness is all you need to check your food on the grill.",
      "rating": 5.0,
      "verified": true,
      "author": "cammya717",
      "helpful_votes": 0,
      "publication_date": 20200117
    },
    {
      "title": "Works well so far",
      "text": "Working well so far. It fits on the handle of my Weber grill OK (about what to expect with an aftermarket grill light). It sticks out some so when I cover the grill I need to be careful not to jar the light from the handle. I really liked Weber's OEM add-on light for my model, it was sleek, but it broke and Weber doesn't make them anymore. This aftermarket one offers plenty of light when operating...it does the job!",
      "rating": 4.0,
      "verified": true,
      "author": "And",
      "helpful_votes": 0,
      "publication_date": 20170504
    },
    {
      "title": "Reliability in a BBQ Light",
      "text": "I have been looking for a reliable, bright barbeque light for a few weeks. I have ordered and purchased, and reviewed several lights. Far above the rest is the Grill Kindle. I purchased one for us and one for our neighbor. We LOVE the Grill Kindle. It is reliable, the batteries don't fall out, as they do in other lights, and the light is bright enough to cook at midnight in the dark! Please continue to offer barbeque items, lights, etc. We always purchase double and share with our neighbors. Thank you for the light. It is the BEST!",
      "rating": 5.0,
      "verified": true,
      "author": "Doreen",
      "helpful_votes": 0,
      "publication_date": 20150508
    },
    {
      "title": "... it is hard to grill out when lighting is bad on deck at night",
      "text": "I work mid shift so it is hard to grill out when lighting is bad on deck at night. This is perfect light. I love the power switch swipe of the hand on/off. Great bulbs. My guy even took it off the grill and used as a work light for his car at night. Great little grill light. Thank you",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180805
    },
    {
      "title": "Lying is not cool!",
      "text": "Why would you sell a product that does not even \"match\" the packibg box, not to mention that batteries are not included! Be aware, its not the same that shown on pictures and discrimination. So not happy here....",
      "rating": 1.0,
      "verified": true,
      "author": "P. Chaploutskiy",
      "helpful_votes": 0,
      "publication_date": 20190128
    },
    {
      "title": "Great lamp with a little quirk.",
      "text": "This is a pretty great grill lamp. I've used a few times since I purchased it a few months ago and the batteries are still holding strong. It's well built with one exception. The power button, placed on the top of the unit can easily be turned on as it's highly sensitive. I found the lamp on after covering my grill. Perhaps, moving the button to the side or changing the power method might aid this. I understand that the design promotes a more weather tolerant build, but can also lead to a lot of waste. Nonetheless, I'd buy it again if something happens to it.",
      "rating": 4.0,
      "verified": true,
      "author": "Emmanuel",
      "helpful_votes": 0,
      "publication_date": 20160614
    },
    {
      "title": "Weather Resistant? Ha!",
      "text": "Horrible, not sure if these are paid reviews but this light was dim before I even had a chance to use it. Fresh out the box it was bright LED's, one night of using it on the grill it's dim. Tried replacing the batteries, nothing. I think it's due to the rain, it's definitely not weather resistant.",
      "rating": 1.0,
      "verified": true,
      "author": "S. Dudley",
      "helpful_votes": 0,
      "publication_date": 20180901
    },
    {
      "title": "Bright!",
      "text": "wonderful works great, a nice bright light for BBq at night",
      "rating": 5.0,
      "verified": true,
      "author": "nursemama4",
      "helpful_votes": 0,
      "publication_date": 20190118
    },
    {
      "title": "Highly recommend!",
      "text": "I bought the light as a gift for my boyfriend for xmas and he loved it! Our patio gets very dark and this produces so much light! He loved it and uses it all the time! He placed it in the middle of the grill, which is about 3.5 feet wide, and the light has no problem illuminating the whole still. The \"on\" button is sensitive, which makws it easy to turn off and on when your hands are full. Definitely a great gift with a good bang for your buck. Highly recommend the product!",
      "rating": 5.0,
      "verified": true,
      "author": "Justina Luna",
      "helpful_votes": 0,
      "publication_date": 20170710
    },
    {
      "title": "Good quality bright light makes for easy grilling at night",
      "text": "The light arrived quickly the first thing I noticed out of the box was the quality of the light. Light was easy to hook up to the grill handle and one song and provided plenty of light to grill outside at night very pleased with the product only con is I should’ve ordered sooner",
      "rating": 5.0,
      "verified": true,
      "author": "JG",
      "helpful_votes": 0,
      "publication_date": 20180320
    },
    {
      "title": "Making grilling vastly easier in the evening or at night",
      "text": "A remarkably simple and extremely helpful way to see exactly what's doing with what you have on the grill, especially when it's after dark. My two sons and I all have this and are very pleased with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Porter",
      "helpful_votes": 0,
      "publication_date": 20180405
    },
    {
      "title": "It Works",
      "text": "Great light however the battery cover plate doesn't stay closed. Had to use electrical tape to fix issue.",
      "rating": 1.0,
      "verified": true,
      "author": "Dante",
      "helpful_votes": 0,
      "publication_date": 20190122
    },
    {
      "title": "Grill Kindle Barbecue Grill Light with Super...",
      "text": "Ordered one of these for our new Weber grill and it has proven to be an awesome purchase. We grill a lot on the back deck,, sometimes at dusk or after dark, and this little light ensures that no food gets overcooked or burnt. It puts out a bright beam and attaches easily to the grill handle. Overall a great product that makes night time grilling an easy thing to do!",
      "rating": 5.0,
      "verified": true,
      "author": "G. Byrd",
      "helpful_votes": 0,
      "publication_date": 20170510
    },
    {
      "title": "Button too sensitive",
      "text": "Great light, shines bright, I can see the grill at night. However, the button to turn it on is way too sensitive. I throw it into my deck box and it is invariably dead when I want to use it next because it got jostled just so to turn on and run the battery out :/ Needs a real button instead of the \"touch\" button it currently has.",
      "rating": 3.0,
      "verified": true,
      "author": "Joseph Lee",
      "helpful_votes": 0,
      "publication_date": 20190211
    },
    {
      "title": "Terrific gadget- quality and function!",
      "text": "Received this as a gift and have been extremely pleased! Compact size doesn't get in the way, clamp is adaptable for various connections and allows for positioning the light many ways. Three brightness levels can be changed by a touch, so if fingers are messy it doesn't get on the light Also appreciate the pouch for storage- everything stays together neatly! Very useful for year-round, after dark (or early starts) grilling.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric Shaffer",
      "helpful_votes": 0,
      "publication_date": 20170302
    },
    {
      "title": "This is a useful light for grills.",
      "text": "It's very good and is bright. It is the first grill light that I have had that works for me. I installed it when I received it and it has been there since. I particularly like that it is easily adjustable and I don't have to be careful about knocking it over because it is attached securely. But, if I need to move it I am able to do that quickly and easily. I recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "J. A. Celli",
      "helpful_votes": 0,
      "publication_date": 20160622
    },
    {
      "title": "Definitely not recommended!!!!",
      "text": "This was a HUGE disappoint. The battery compartment has a tiny eyeglass screw, bad idea. There are spaces for three batteries, the positives sit one on top of the other, another bad idea as the second battery would not stay in place because the spring was faulty and the space was too high. I am sending this back. Definitely not recommended.",
      "rating": 1.0,
      "verified": true,
      "author": "JanieB",
      "helpful_votes": 0,
      "publication_date": 20160602
    },
    {
      "title": "Not Weatherproof",
      "text": "Not happy with the fact these really can’t handle much weather. It is plastic and long-term sun will surely cause fading. Not really weatherproof but it gets the job done for now. Easily attaches to the grill handle.",
      "rating": 4.0,
      "verified": true,
      "author": "Akasonny",
      "helpful_votes": 0,
      "publication_date": 20181202
    },
    {
      "title": "Comes with batteries. You’ll need a tiny screwdriver to open the battery compartment.",
      "text": "Just received today and can’t even use cause the hole is so deep and can barely fit a tiny little screw driver to open the battery compartment. Screw got stripped. Was nice the product came with batteries but the manufacturer should have added a compatible Phillips head.",
      "rating": 1.0,
      "verified": true,
      "author": "Caroline",
      "helpful_votes": 0,
      "publication_date": 20190923
    },
    {
      "title": "Cheaply made",
      "text": "The light is bright and the concept is great. But it’s useless if it won’t mount. The screw assembly to attach to the grill handle broke after three uses.",
      "rating": 1.0,
      "verified": true,
      "author": "Dan",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "Love the light but......",
      "text": "The on/off switch is very sensitive - goes on without depressing. Since we are traveling with it, we wanted to remove the batteries so it wouldn't go off in our suitcase. However, the screw to the battery compartment is so tiny and hard to get it, we can't get the cover off. It's going to be a problem when we need to change the battery.",
      "rating": 3.0,
      "verified": true,
      "author": "Anne B.",
      "helpful_votes": 0,
      "publication_date": 20181229
    },
    {
      "title": "Perfect Light - Very bright",
      "text": "This grill light was exactly what I needed. It easily clamped onto my grill handle (Char griller Akorn). We do not have any outdoor lighting and this is way brighter than I expected. Can easily see everything I need to in the middle of the night. I can't speak on durability yet, but even if it only lasts a season or two it is well worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170313
    },
    {
      "title": "Great handy light",
      "text": "Survived New England winter. Waterproof. Have grilled in the rain, have forgotten to cover the grill and rain has come down on the light, remained on my grill all winter long yet keeps on working.",
      "rating": 5.0,
      "verified": true,
      "author": "Mortimer",
      "helpful_votes": 0,
      "publication_date": 20190805
    },
    {
      "title": "Nice lightning",
      "text": "I believe the waterproof is fine and light is quite good. The touch button could improve but overall it works very well",
      "rating": 4.0,
      "verified": true,
      "author": "Alex B",
      "helpful_votes": 0,
      "publication_date": 20200217
    },
    {
      "title": "A Necessity in the Winter",
      "text": "Got this for a Christmas gift for my husband. He always complained when he barbecued in the dark...easy solution...look to Amazon to solve a problem. When I saw this I immediately ordered it. It gives plenty of light when attached to the grill handle, it's easy to use and the included batteries are a plus. Now, when he fires up the grill after 6:00 in January, no more complaints.",
      "rating": 5.0,
      "verified": true,
      "author": "MAM",
      "helpful_votes": 0,
      "publication_date": 20160204
    },
    {
      "title": "works great",
      "text": "lights up the grilling area perfectly arrived fast works and was as described",
      "rating": 5.0,
      "verified": true,
      "author": "carolyn",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "So badly wanted it to work.",
      "text": "This is the second one of these I ordered. Both times the clap mechanism is stripped. Great bright light but haven’t been able to use it because I can’t get it to tighten on the handle. Cheaply made. Wanted to send back the second one but I was 5 days past the return date. Weather has been to cold, rainy and wet to try it until now. Very unhappy.",
      "rating": 1.0,
      "verified": true,
      "author": "barbara jeck",
      "helpful_votes": 0,
      "publication_date": 20190327
    },
    {
      "title": "Grateful Happy Husband",
      "text": "I purchased this light for my husband, as he does the grilling. Winter grilling in the garage is more difficult because of shorter daylight hours. This light is wonderful addition to be able to see exactly what's happening on the grill. He is a grateful, happy husband with his additional light.",
      "rating": 5.0,
      "verified": true,
      "author": "Deborah L. Crowley",
      "helpful_votes": 0,
      "publication_date": 20170322
    },
    {
      "title": "Pass on this.",
      "text": "Doesn’t fit my Weber handle correctly. The nut/bolt tightening device stripped. Not well designed. Pass.",
      "rating": 2.0,
      "verified": true,
      "author": "James Mulvey",
      "helpful_votes": 0,
      "publication_date": 20200809
    },
    {
      "title": "we absolutely love the light",
      "text": "I use it as a light under my picnic table canopy, it screws directly on the frame and we use it as light to enable us to play games way into the night while we are camping, we absolutely love the light. It is lightweight, very bright, well made and batteries last a long time.",
      "rating": 5.0,
      "verified": true,
      "author": "danieol",
      "helpful_votes": 0,
      "publication_date": 20170824
    },
    {
      "title": "Awkward lighting position",
      "text": "This item is very clumsy to hook up and stay on your handle right light wrong hookup.",
      "rating": 2.0,
      "verified": true,
      "author": "tp",
      "helpful_votes": 0,
      "publication_date": 20200211
    },
    {
      "title": "Great grill light",
      "text": "Awesome light! 1 lights up the grill perfectly. Super easy to put on the grill. Great buy.",
      "rating": 5.0,
      "verified": true,
      "author": "C.J. Hodges II",
      "helpful_votes": 0,
      "publication_date": 20200215
    },
    {
      "title": "It quit working after the first Rain!!",
      "text": "Not at all water proof....FYI my grill lives outside, doesn't yours? Buy the Weber one...it is so much better!",
      "rating": 1.0,
      "verified": true,
      "author": "Always Cooking",
      "helpful_votes": 0,
      "publication_date": 20200427
    },
    {
      "title": "Great quality!",
      "text": "I have tried many barbecue lights, this is the sturdiest and brightest light for outdoor use, very easy with just a touch on the body of the light!",
      "rating": 5.0,
      "verified": true,
      "author": "kathy",
      "helpful_votes": 0,
      "publication_date": 20190820
    },
    {
      "title": "Maybe i just got a bad one. A shame because it worked well",
      "text": "Product stopped working after three weeks. I had used it about eight times or so. Admittedly, I left it in a misty environment for a few hours one night but it certainly wasnt any heavy precipitation. Maybe i just got a bad one. A shame because it worked well.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20161122
    },
    {
      "title": "So far so good!! We just got it and have used ...",
      "text": "So far so good!! We just got it and have used it once. My husband who is very picky said it worked perfect, lit up the whole grill. It rained the next day and we forgot to take it off and it was still working just fine. The button to turn it on is handy in case you don't have free hands, you just tap it and it goes on. Very happy with purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "HA",
      "helpful_votes": 0,
      "publication_date": 20150330
    },
    {
      "title": "He said that it was great. It hooked right to his grill and is ...",
      "text": "This was a Christmas present for my nephew. He loves to grill and grills all year. He uses this light often. He said that it was great. It hooked right to his grill and is very bright.",
      "rating": 5.0,
      "verified": true,
      "author": "galaxiefever",
      "helpful_votes": 0,
      "publication_date": 20170308
    },
    {
      "title": "Let there be light!",
      "text": "The light is easy to use and works great. Our barbecue is located on the right side of the patio, away from the patio light on the other side of the patio. The Grill Kindle Barbecue Grill Light attached to the barbecue handle and provides illumination to the whole area around the bbq.",
      "rating": 4.0,
      "verified": true,
      "author": "Darryl Henning",
      "helpful_votes": 0,
      "publication_date": 20161205
    },
    {
      "title": "night grilling",
      "text": "This fits on the handle of my grill and I have to move it when I open the grill so that it lights up what I am cooking.",
      "rating": 2.0,
      "verified": true,
      "author": "BERNARDINE BATTLE",
      "helpful_votes": 0,
      "publication_date": 20181215
    },
    {
      "title": "perfect with one issue",
      "text": "works perfectly, only issue is that if you have a flare up with lid open you will have to quickly take this off or it will burn up since it'll be positioned right over the flames",
      "rating": 5.0,
      "verified": true,
      "author": "Adam",
      "helpful_votes": 0,
      "publication_date": 20161230
    },
    {
      "title": "Junk",
      "text": "Completely dead after 3 mo. After changing batteries. Seller refuses to honor the “lifetime warranty”.",
      "rating": 1.0,
      "verified": true,
      "author": "Dave",
      "helpful_votes": 0,
      "publication_date": 20190413
    },
    {
      "title": "Great BBQ Light",
      "text": "Great BBQ Light. Our BBQ is on the side of our house and sometimes it's hard for my husband to see when the sun starts setting. This smaller Grill Kindle works wonders! It's a hard working light. Really bright and clear! Now my hubby can grill well into the evening. Don't let the size fool you. It's awesome!",
      "rating": 5.0,
      "verified": true,
      "author": "E. Stone",
      "helpful_votes": 0,
      "publication_date": 20160219
    },
    {
      "title": "Five Stars",
      "text": "Bright and touch sensitive button makes it easy to turn on when your hands are full. Clamp worked on a Weber Spirit e-310, though I found turning it upside down made it protrude less. This allows me to keep it installed while the grill cover is on.",
      "rating": 5.0,
      "verified": true,
      "author": "Adam F",
      "helpful_votes": 0,
      "publication_date": 20160906
    },
    {
      "title": "POOR QUALITY; NEVER FIT WELL AND BROKE AFTER FIVE USES",
      "text": "After five uses the twist clip that you are supposed to use to attach the light to the grill broke. Now it's no better than any other run-of-the-mill flashlight. Don't waste your money on this; there are better options out there.",
      "rating": 1.0,
      "verified": true,
      "author": "Michael S.",
      "helpful_votes": 0,
      "publication_date": 20180410
    },
    {
      "title": "Great purchase, great price",
      "text": "I bought this light for my husband for Christmas and he loves it!! He couldn’t see the food he while he cooking at night and with the grill kindle LED light, the meat is cooked perfectly! He also attaches and detaches the light each time so that it stays out of the rain. Great purchase, great price!",
      "rating": 5.0,
      "verified": true,
      "author": "Lori Stanton",
      "helpful_votes": 0,
      "publication_date": 20180316
    },
    {
      "title": "Very bright, quality grill light.",
      "text": "I bought this grill light for my husband, our patio area's overhead light wasn't sufficient. This little light does an amazing job. It's super bright, clamps easily to the grill handle and does it's job very nicely. Does take batteries and has a touch on/off button so you have to be careful not to turn it on if you're putting it away in a drawer. Recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "Sara W.",
      "helpful_votes": 0,
      "publication_date": 20170428
    },
    {
      "title": "Sensitive Power Touch",
      "text": "The light isn't terribly bright and the touch power section is very sensitive. I have turned it on accidentally many times just by sliding my grill cover back on.",
      "rating": 4.0,
      "verified": true,
      "author": "Lauren",
      "helpful_votes": 0,
      "publication_date": 20190815
    },
    {
      "title": "Husband loves it.",
      "text": "Attaches to the handle of my husbands Big Green Egg grill securely and gives off plenty of light for barbecuing in the dark. It' doesn't get in the way while he's barbecuing and he really likes it.",
      "rating": 5.0,
      "verified": true,
      "author": "Maria M.",
      "helpful_votes": 0,
      "publication_date": 20170105
    },
    {
      "title": "Great little grill light!",
      "text": "My husband had another grill light when I got him this one. He decided to use this one because of the LED lights and he could position it easier.",
      "rating": 5.0,
      "verified": true,
      "author": "Alaskagirl53",
      "helpful_votes": 0,
      "publication_date": 20180530
    },
    {
      "title": "Strong light and attaches to my Weber Grill easily.",
      "text": "Just installed it. Seems to be solid and gives a lot of light. One minor issue. In order to put a cover on the grill I would like the long screw to be on the inside of the handle. However when I do that the power switch is underneath the light. Other than that the light seems to do the job.",
      "rating": 4.0,
      "verified": true,
      "author": "Alan Levy",
      "helpful_votes": 0,
      "publication_date": 20170724
    },
    {
      "title": "Great Grill Light!",
      "text": "The Grill Kindle has come in handy for my husband as the lighting outside at night when grilling is really bad! The light is super bright, covers the whole surface area of the grates making grilling at night so much easier! The light fit perfectly around the grill handle of his Charbroil grill. The light is also nice as it can adjust back and forth if needed. I would highly recommend this light to my friends and family who want to see what they're doing while grilling!",
      "rating": 5.0,
      "verified": true,
      "author": "JolieNicolie",
      "helpful_votes": 0,
      "publication_date": 20160906
    },
    {
      "title": "Works Great! Very bright!",
      "text": "Got this item in a timely fashion. I bought it for my Dad for Father's Day & he LOVES it. Very bright light! He was excited to use it the first time. We grill all year in MN & in the winter, it's often dark when it's time to grill dinner. Thinking about purchasing one for myself too!",
      "rating": 5.0,
      "verified": true,
      "author": "M. Hoskins",
      "helpful_votes": 0,
      "publication_date": 20160920
    },
    {
      "title": "Best bbq light hands down!",
      "text": "This is a must! Especially for father's day coming up. Best BBQ light hands down! It is a clear light so you can see everything. Very easy to install and to use. You just push the button on and off which makes for easy clean up when your hands are covered in BBQ sauce ;) you will not be disappointed with this light. I love mine!",
      "rating": 5.0,
      "verified": true,
      "author": "T",
      "helpful_votes": 0,
      "publication_date": 20150612
    },
    {
      "title": "Handy, dandy grill light",
      "text": "I like this light and find it a really good buy. My only complaint is that you can turn it on accidentally and not know that you're doing it; but, I also have a tendency to put my iPhone in Airplane mode without realizing it.",
      "rating": 5.0,
      "verified": true,
      "author": "Rusty Trombone",
      "helpful_votes": 0,
      "publication_date": 20160705
    },
    {
      "title": "Great customer service; awesome product!",
      "text": "This was a Christmas present for my husband; he hasn't been able to use it yet, but I wanted to give feed-back because I was impressed by the personal email I received from the manufacturer (rep Wendy Thompson) in regards to the product; great message! Thus far, the light mounts great and works well off the grill. We are excited to use it more when the weather gets warmer!",
      "rating": 5.0,
      "verified": true,
      "author": "Alexandra Warren",
      "helpful_votes": 0,
      "publication_date": 20170126
    },
    {
      "title": "Grilling in the dark",
      "text": "I received the grill light as expected. The installation was great. I wish I had this on my earlier grills. The functionality works spot on. I have mine attached to a Weber portable grill and I have to be careful turning the light on accidentally. One thing I cannot speak to is the weather resistance. I do not keep the grill outside when not in use. It does however seem to be weather tight.The unit seems to be solid and should work well for years to come.",
      "rating": 5.0,
      "verified": true,
      "author": "BytorToSyrinx",
      "helpful_votes": 0,
      "publication_date": 20160718
    },
    {
      "title": "Great little light.",
      "text": "Eezey peezey to install and use. Fits Weber grills. Bright and mobile. A real piece of art.",
      "rating": 5.0,
      "verified": true,
      "author": "Standing Bear",
      "helpful_votes": 0,
      "publication_date": 20171029
    },
    {
      "title": "Don't grill at night without one!",
      "text": "GREAT PRODUCT! Originally purchased a grill light from the store where the grill was bought. It broke in 10 minutes & while it was operational, the lighting was poor. Lucky for us! The Grill Kindle far surpasses anything out there! Our neighbors were so impressed with the Grill Kindle, they went to Amazon and purchased one immediately . . . This is a must have for a grill accessory! Also kind on batteries since it's LED. Besides, it will make you smile every time you see it - Looks like the character from the Disney animated film \"WALL-E\"!",
      "rating": 5.0,
      "verified": true,
      "author": "Sandy Conder",
      "helpful_votes": 0,
      "publication_date": 20150515
    },
    {
      "title": "This is a great light. It is very bright and does the ...",
      "text": "This is a great light. It is very bright and does the job. I do bring it into the house after use, since I did see some reviews that said that the light stopped working when it got wet in the rain. I didn't want to take any chances.",
      "rating": 5.0,
      "verified": true,
      "author": "ann s.",
      "helpful_votes": 0,
      "publication_date": 20170227
    },
    {
      "title": "Great value",
      "text": "Was a little worried but the light worked perfectly. Very happy will probably order another. On my second light as they work awesome.",
      "rating": 5.0,
      "verified": true,
      "author": "Gene J. Marinacci",
      "helpful_votes": 0,
      "publication_date": 20171013
    },
    {
      "title": "Perfect nightlight for your grill",
      "text": "Bought this for my father, because it was always so dark when he was grilling, and he hated to cook when it was dark out. I saw the video, and thought this would be perfect. It indeed was! It is a bright intense light, that helps to take the guesswork out of if the meat is cooked or not. No more bringing it into the kitchen, only for it to go back out, or standing with the light on a smartphone. The power button is a bit sensitive, but overall, this is a wonderful product. Coming with the needed batteries is just the icing on the cake. Highly recommend if you're tired of cooking in the dark!",
      "rating": 5.0,
      "verified": true,
      "author": "Christine Morgan",
      "helpful_votes": 0,
      "publication_date": 20160302
    },
    {
      "title": "Great Grill Light - Very Satisfied",
      "text": "This grill light is exactly what I needed! It fits nicely on our grill and provides the light needed when grilling at night. I bought one for me and another as s Christnas gift. The gift receiptent also love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Debbie H",
      "helpful_votes": 0,
      "publication_date": 20170208
    },
    {
      "title": "Excellent grill light.",
      "text": "I have had the light for more than 5 months and have been very satisfied with its performance. It's mounts easily and illuminates the grill perfectly. It has held up to the weather in Louisiana very well. The touch button is very convenient to use.",
      "rating": 5.0,
      "verified": true,
      "author": "A. See",
      "helpful_votes": 0,
      "publication_date": 20161116
    },
    {
      "title": "Broke in 1st week!!",
      "text": "Broke in the first week of use. Piece of junk",
      "rating": 1.0,
      "verified": true,
      "author": "Kelly",
      "helpful_votes": 0,
      "publication_date": 20190216
    },
    {
      "title": "Powerful, compact little grill light!",
      "text": "We've purchased other grill lights in the past, but this one by far is the best. It's a powerful little light that really allows you to see everything, even on a large grill when it's super dark outside. It's also very compact, so when you're done grilling, you can just shut the light off, cover the grill (and light) and it's ready to go next time!",
      "rating": 5.0,
      "verified": true,
      "author": "Amy P.",
      "helpful_votes": 0,
      "publication_date": 20170306
    },
    {
      "title": "Great light",
      "text": "Works great, bright lights, covers entire three burner grill. Love the way it turns on and off just by sliding hand across flat surface!",
      "rating": 5.0,
      "verified": true,
      "author": "Edward Daniel",
      "helpful_votes": 0,
      "publication_date": 20190121
    },
    {
      "title": "Awesome light",
      "text": "Works great, bought it for my father who is a huge griller and he has nothing but great things to say about it. He has it hooked up to his XL Big Green Egg.",
      "rating": 5.0,
      "verified": true,
      "author": "Kaitlyn",
      "helpful_votes": 0,
      "publication_date": 20161004
    },
    {
      "title": "Missing battery components?!?!",
      "text": "Bought for Christmas, we just opened it and half of the connections in the battery compartment were missing, how is that possible? $20 gone, missed return window.",
      "rating": 1.0,
      "verified": true,
      "author": "Liza",
      "helpful_votes": 0,
      "publication_date": 20180211
    },
    {
      "title": "Great buy, bright and clear!",
      "text": "I love this, it’s a great light!! I couldnt grill without it. It’s very bright and easy to use. Great buy!",
      "rating": 5.0,
      "verified": true,
      "author": "SRL",
      "helpful_votes": 0,
      "publication_date": 20190206
    },
    {
      "title": "Great for 2 months, now it’s dead.",
      "text": "Loved this item when I got it. It solved every lighting problem I had. And then after two months, it’s now dead. Put new batteries in and nothing. It was great while it lasted.",
      "rating": 1.0,
      "verified": true,
      "author": "Patrick Collins",
      "helpful_votes": 0,
      "publication_date": 20190210
    },
    {
      "title": "Bright and sturdy",
      "text": "Works great and is very sturdy. A very heavy wind blew our grill over and it fell off our porch. The light was covered in mud and I assumed it wouldn't work anymore but after cleaning it up it was as good as new.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170502
    },
    {
      "title": "LOL He used the light and LOVED it, he was really impressed with how it ...",
      "text": "Purchased this for my husband for Christmas, its very cold here in Chicago but I still make my husband grill! LOL He used the light and LOVED it, he was really impressed with how it lights up the whole grilling area. It says that its weatherproof but because it gets so cold, he didn't want to chance leaving it outside plus its very easy to attach and remove so its not any trouble to do so.",
      "rating": 5.0,
      "verified": true,
      "author": "Holly A McDowell",
      "helpful_votes": 0,
      "publication_date": 20170104
    },
    {
      "title": "A Minor tweak in order but very bright & helpful otherwise",
      "text": "I really like this light. It's bright & battery efficient so far. I deducted 1 star because it's touch switch is too easy to turn the unit off accidentally, placed on either of the unit's sides might be better.",
      "rating": 4.0,
      "verified": true,
      "author": "KLO",
      "helpful_votes": 0,
      "publication_date": 20161031
    },
    {
      "title": "Good light-easy install.",
      "text": "I bought this light for my soon to be son in law, who loves to grill. He installed the light soon after Christmas and has been using it with much satisfaction. He tells me it provides a lot of light on the grilling surface. This is important because he was working long hours and would many times grill later in the afternoon or early evening. Here on Long Island it gets dark at 4:30 when the clocks go back. This light was a big help! Thank you for a great product.",
      "rating": 4.0,
      "verified": true,
      "author": "Hannah",
      "helpful_votes": 0,
      "publication_date": 20160325
    },
    {
      "title": "Good light as far as amount of light",
      "text": "Would have given 5* But the on off switch is extremely sensitive. Good light as far as amount of light.",
      "rating": 4.0,
      "verified": true,
      "author": "Joe",
      "helpful_votes": 0,
      "publication_date": 20180406
    },
    {
      "title": "No more grilling by feel",
      "text": "Bright light, sensitive touch switch, and construction seems decent - it does what it's supposed to. I paid for this myself, no discounts for my comments. If it doesn't last, I'll update my review.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Bowman",
      "helpful_votes": 0,
      "publication_date": 20161022
    },
    {
      "title": "Decent product great price",
      "text": "Good product. Fit well on my grill handle. Only complaint would be the touch sensor to turn on and off the light. It's very sensitive so any touch can trigger it... including my grill cover whrnnits blowing in the wind.",
      "rating": 4.0,
      "verified": true,
      "author": "Nicholas J.",
      "helpful_votes": 0,
      "publication_date": 20170517
    },
    {
      "title": "great grill light",
      "text": "Good light for the money. My only complaint is probably the over sensitivity of the on/off button which a bunch of other people also mentioned. It will turn on/off even if you barely touch the button. Aside from that no issues with it. Definitely recommend this product to others.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20170508
    },
    {
      "title": "Great little light",
      "text": "Great little light. Mounts easily and points perfectly onto what your cooking. My husband grills at night all the time and is so thankful he doesn't have to use a headlamp anymore. This light has taken a beating from the wind and rain...so far so good!",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa Lisa",
      "helpful_votes": 0,
      "publication_date": 20160317
    },
    {
      "title": "... as a gift as we already own one and love it.",
      "text": "This grill light was actually purchased as a gift as we already own one and love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen",
      "helpful_votes": 0,
      "publication_date": 20180315
    },
    {
      "title": "Much better light than the Weber OEM light.",
      "text": "Bright, easy to mount on the lid handle of my old Weber grille, much brighter than the Weber Grill Out handle light. Only thing is that the touch switch is a little sensitive, so be careful not to accidentally turn it on and run down the batteries . Otherwise a solid grille light.",
      "rating": 4.0,
      "verified": true,
      "author": "GadgetGuy",
      "helpful_votes": 0,
      "publication_date": 20150810
    },
    {
      "title": "Very bright and easy to turn off and on. Buy it",
      "text": "Very bright and easy to turn off and on. I have a quibble which is this, you attach the light to the grill handle and when you close the lid, the light unit is long enough to hit the burner valves in front, Have to move it up and out when closing the lid.",
      "rating": 4.0,
      "verified": true,
      "author": "Douglas J. Wolf",
      "helpful_votes": 0,
      "publication_date": 20150531
    },
    {
      "title": "but my friends love this for after dark grilling",
      "text": "Bought this as a gift, but my friends love this for after dark grilling. Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "Beth",
      "helpful_votes": 0,
      "publication_date": 20180328
    },
    {
      "title": "This grill light makes an excellent gift.",
      "text": "The Grill Kindle Barbecue Grill Light with Super Bright LED Lights was a gift to my husband. The quality is excellent. My husband really likes that he can now actually see what he is grilling in the dark. Since men are always a challenge to shop for, the grill light is an excellent holiday gift for those that do the grilling. We are very satisfied with the product.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan Sheridan",
      "helpful_votes": 0,
      "publication_date": 20161026
    },
    {
      "title": "Don’t bother",
      "text": "Broke after the first day using it. The touch button to turn on is really sensitive. It would not stay clamped on.",
      "rating": 1.0,
      "verified": true,
      "author": "Jason K.",
      "helpful_votes": 0,
      "publication_date": 20190410
    },
    {
      "title": "Garbage. Don't waste your money!",
      "text": "Broken in arrival. Got busy and missed my window to return. What a piece of junk. It should have at least lasted a year!",
      "rating": 1.0,
      "verified": true,
      "author": "Emily S",
      "helpful_votes": 0,
      "publication_date": 20170720
    },
    {
      "title": "GREAT IDEA BUT ...",
      "text": "Got for my husband at Christmas ... with the weather clearing, he opened to use but was not able to open the battery panel ... sadly, it's unusable",
      "rating": 1.0,
      "verified": true,
      "author": "V",
      "helpful_votes": 0,
      "publication_date": 20170517
    },
    {
      "title": "Great buy!",
      "text": "Got this as a gift for my mother, she grills a lot and its perfect, very bright, easy to put on and take off, maneuvers easily as well! Great buy!!",
      "rating": 5.0,
      "verified": true,
      "author": "Andrea Hunt",
      "helpful_votes": 0,
      "publication_date": 20170503
    },
    {
      "title": "Friend Loves It",
      "text": "I bought this for a friend after they grilled steaks at night with a flashlight in their mouth. The friend is VERY HAPPY with the light and can now nibble on goodies rather than the plastic handle of the flashlight",
      "rating": 5.0,
      "verified": true,
      "author": "Zandisu",
      "helpful_votes": 0,
      "publication_date": 20160402
    }
  ],
  "product_meta": {
    "title": "Grill KIndle Barbecue Grill Light with Super Bright LED Lights - Durable, Weather Resistant, Versatile LED BBQ Lights for Outdoor Grilling",
    "description": "BBQ GRILL LIGHT: PERFECT ILLUMINATION, PROFESSIONAL COOKING!\n\n \n\nRather than dangerously balancing a flashlight while cooking, would you like a dedicated grill light, with an adjustable angle, that won't crack, warp or bend under intense grill heat?\n\n \n\nIf so, the Grill Kindle is the perfect product for you!\n\n \n\nWhereas others on the market simply illuminate the grill, the Grill Kindle has been manufactured with 10 super high powered LED lights, offering a wide, high powered beam to completely illuminate your grill and the surrounding area.  \n\nUnlike others which are activated by a hard to find switch, the Quartermasters Grill Light contains an easily accessed, touch sensitive switch, allowing you to effortlessly activate the light in the darkest conditions.  \n\nThe Grill Kindle is constructed from a heat resistant ABS plastic, allowing the Light to withstand intense grill heat without warping, weakening or bending, unlike cheaper quality lights on the market.  \n\nThe Grill Kindle has a precision angled head, allowing you to secure the light to virtually any grill hood and position the beam throughout a 190 degree horizontal and vertical range.  \n\nThe Grill Light has a number of market leading features, including: \n\n 10 LED LIGHTS; high powered LED lights for super strong, wide illumination. \n\n 12 HOURS ILLUMINATION; 3 AA batteries provides up to 12 hours of bright illumination. \n\n TOUCH OPERATED; no fumbling for small switches in the dark. \n\n HEAT RESISTANT ABS CONSTRUCTION; won't warp or weaken under intense grill heat. \n\n ADJSUTABLE HEAD; angle through 190 degrees horizontally or vertically for the perfect position. \n\n \n\nIf you're looking for the market leading grill light that offers durability, ease of use and a super strong illumination, click \"Add to Cart\" now!",
    "rating": 4.1,
    "feature_bullets": [
      "★ 10 bright LED lights rotate 190 degrees for perfect task lighting on the grill area",
      "★ Constructed from durable, heat-resistant ABS plastic, can withstand intense heat under most grilling conditions.",
      "★ Touch Sensitive Power Button Means Less Fumbling for a Switch",
      "★ Adjustable Screw Clamp Fits Most Grill Handles up to 1.45",
      "★ Sturdy universal clamps attach to virtually any BBQ hood (except Kettle Grills)"
    ],
    "specifications": {
      "Product Dimensions": "3.5 x 2.4 x 5.6 inches",
      "Item Weight": "8 ounces",
      "Manufacturer": "Sunyan Electronic Co., Ltd",
      "ASIN": "B00RSD4ZOY",
      "Item model number": "BBQ-001",
      "Batteries": "3 AA batteries required.",
      "Customer Reviews": "4.1 out of 5 stars541 ratings4.1 out of 5 stars",
      "Best Sellers Rank": "#130,735 in Patio, Lawn & Garden",
      "Is Discontinued By Manufacturer": "No"
    },
    "categories": [
      "Grill Lighting",
      "Patio, Lawn & Garden",
      "Garden & Outdoor",
      "Outdoor Cooking Tools & Accessories",
      "Grills & Outdoor Cooking"
    ],
    "price": ""
  }
}