{
  "website_summaries": [
    {
      "verdict": "Although its ability to use GPS to track your run is handy, its poor screen, uninspiring design and lack of a heart-rate monitor means the SmartWatch 3 doesn't impress over its more luxurious Android Wear competitors.",
      "pros": [
        "The Sony SmartWatch 3 has built-in GPS to track your workout without needing your phone",
        "It's waterproof, has a built-in USB port for charging without a dock and runs Android Wear smoothly"
      ],
      "cons": [
        "Its screen is pretty awful, with poor colours and viewing angles",
        "Its plain, square design makes it much less stylish than the LG G Watch R and it doesn't have a heart-rate monitor built in"
      ],
      "aspects": {
        "Style": 5.0,
        "Features": 6.0,
        "Ease of use": 6.5
      },
      "publication_date": 20141218,
      "rating": 5.8,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "I keep getting the annoying \"oh, is that an apple",
      "text": "I have had no problems with this Smartwatch at all. I keep getting the annoying \"oh, is that an apple watch,\" so do prepare for that nonsense/ignorance. --Pros-- -Works great in the shower -Easy to clean -Responsive touch screen -Fabulous charge time (I am astounded how fast this watch charges.. A 5v-1amp charger can recharge 30% in literally about 10 minutes) --Cons-- -Bluetooth distance isn't the best... It can easily disconnect at ~10m -Annoying charge port",
      "rating": 5.0,
      "verified": true,
      "author": "Phay",
      "helpful_votes": 6,
      "publication_date": 20151024
    },
    {
      "title": "Great watch",
      "text": "After getting the update done, the watch is great. I love the feel of the band and the fact that the chargers I already have work with the watch. The screen is clear even in the sun and Google has worked smoothly so far. The only item I am frustrated with is the interchangeable bamds. All of the different bands are available in Europe but not in the states. If I could get different bands this would be five stars.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20150823
    },
    {
      "title": "Do not buy!!!",
      "text": "Never worked properly, always gave problems to connect to my phone and when it did, the watch was overheating so much I could not wear it. I purchased 2, one for my wife and the other for myself and to date it's just a piece of paperweight to us. Complete waste of money, do not buy.",
      "rating": 1.0,
      "verified": true,
      "author": "Christian S.",
      "helpful_votes": 0,
      "publication_date": 20170531
    },
    {
      "title": "Most useful wearable 2015",
      "text": "For the price this is the best smartwatch of 2015 and the only con would be that it doesn't have a heartrate monitor, which isn't a dealbreaker at all.",
      "rating": 5.0,
      "verified": true,
      "author": "James S Sotiroff",
      "helpful_votes": 2,
      "publication_date": 20160224
    },
    {
      "title": "Great Watch for its price will be amazing if compatible ...",
      "text": "Great Watch for its price will be amazing if compatible with iPhone 6 I luv it :)",
      "rating": 5.0,
      "verified": true,
      "author": "Saoud Ali",
      "helpful_votes": 0,
      "publication_date": 20150819
    },
    {
      "title": "the product was used and screen is washed out - ...",
      "text": "the product was used and screen is washed out - it was a gift for my daughter (to be given for her on her birthday). now its gone and i'm stuck with a faulty product.",
      "rating": 1.0,
      "verified": true,
      "author": "All2003",
      "helpful_votes": 0,
      "publication_date": 20151006
    },
    {
      "title": "Awesome awesome watch",
      "text": "Awesome awesome watch. Only downside is lack of accessories and replacement bands are expensive and hard to find so make sure you chose the color you really want",
      "rating": 5.0,
      "verified": true,
      "author": "leandro buttarazzi",
      "helpful_votes": 0,
      "publication_date": 20160227
    },
    {
      "title": "Good watch solid design works as expected",
      "text": "Good watch solid design works as expected. The only issue I have is not the inability to find additional bands as I bought the white band and would like to change for various occasions.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephen King",
      "helpful_votes": 0,
      "publication_date": 20170727
    },
    {
      "title": "Best smartphone accessory",
      "text": "Very happy with my first smart watch. Only wish I could find other bands for it.",
      "rating": 5.0,
      "verified": true,
      "author": "David McMahon",
      "helpful_votes": 2,
      "publication_date": 20151122
    },
    {
      "title": "sony SW3",
      "text": "Hello, the SW3 is a great smartwatch. I've so far noticed that with the screen off ambient. My battery life looks to around. 20% after 12 hrs. The sony has it's own wifi and GPS. This is crazy as not one smart watch has these abilities. The transflective display works perfectly in the bright Sun. Even on my motorcycle in the middle of the day it is very plain to see. I have only one complaint and that is the battery life so far. Sony claims around two days. I'm waiting to see if perhaps a update fixes this.",
      "rating": 5.0,
      "verified": true,
      "author": "Jacob Cook",
      "helpful_votes": 4,
      "publication_date": 20150715
    },
    {
      "title": "Great android wear watch!",
      "text": "Good Smart watch with GPS! Very under look / under rated in the age of smartwatches, but if you like android wear, this is a great watch!",
      "rating": 4.0,
      "verified": true,
      "author": "Matt K",
      "helpful_votes": 0,
      "publication_date": 20151013
    },
    {
      "title": "really good nicely packed original packing and very fast",
      "text": "Worthy Buying it.. really good nicely packed original packing and very fast shipping",
      "rating": 4.0,
      "verified": true,
      "author": "Trik",
      "helpful_votes": 0,
      "publication_date": 20150818
    },
    {
      "title": "Four Stars",
      "text": "Android Wear is nice, but still a bit buggy. I went back to my trusty Pebble Time.",
      "rating": 4.0,
      "verified": true,
      "author": "Konrad Kubica",
      "helpful_votes": 0,
      "publication_date": 20151013
    },
    {
      "title": "its ok graphics need to be more vivid",
      "text": "Its pretty nice. It does look washed out when looking at the graphics. Its not vivid enough. Could use some more apps for it. Its great for keeping track of your steps, but no heart rate monitor. Its really a sporty/causal watch. Not dressy or eye catching like some of the other brands. It does the job as far as gps, notifications from fb, emails, instagram, twitter and text messages and calls. Has the weather on it too. Can customize face with free download apps. Actually i give it 3 1/2 stars.",
      "rating": 3.0,
      "verified": true,
      "author": "catherine",
      "helpful_votes": 3,
      "publication_date": 20150713
    },
    {
      "title": "Nice Job Sony.",
      "text": "Fits well, the closing mechanism adds a touch of class. This smartwatch has the most sensors of any currently sold android wear watch and has a larger then normal battery. Sony did a great job, with android wear slowly getting more and more features from google, this watch will only increase in usefulness. Sensors: Ambient light sensors Accelerometer Compass Gyro GPS Battery: 420 mA",
      "rating": 5.0,
      "verified": true,
      "author": "Roboguy",
      "helpful_votes": 0,
      "publication_date": 20150610
    },
    {
      "title": "Dumb Watch 1!",
      "text": "I received this watch yesterday and was really looking forward to it. What a major disappointment. I have a Moto E and did everything by the book. No pairing, cant connect to internet messages, something went wrong messages etc etc. .. After 20 + reboots and about 4 hours of frustration I called Sony. They e-mailed a watch software repair link... Forget about this watch. It is just a hassle and it did not work for me at all.",
      "rating": 1.0,
      "verified": true,
      "author": "Bobbie",
      "helpful_votes": 2,
      "publication_date": 20151224
    },
    {
      "title": "Beautiful  but ....",
      "text": "I loved the look, but hated the fact that it didn't work and I had to return it.",
      "rating": 1.0,
      "verified": true,
      "author": "A.Batista",
      "helpful_votes": 0,
      "publication_date": 20160205
    },
    {
      "title": "I like the watch part of it",
      "text": "I like the watch part of it. Very intuitive. Cons: I wish there was an integrated sleep monitor. I wish I had bought the black one because the white one looks like a hospital armband and it makes you look like an escaped mental patient. Would be great if there was a way to replace the band/case.",
      "rating": 4.0,
      "verified": false,
      "author": "Primus",
      "helpful_votes": 2,
      "publication_date": 20151016
    },
    {
      "title": "No replacement band available",
      "text": "I love the watch. Had it for over 3 yrs. The silicone band broke and I cannot find a replacement band....not even from Sony. Very disappointed.",
      "rating": 5.0,
      "verified": false,
      "author": "Lisa Thomas",
      "helpful_votes": 0,
      "publication_date": 20191123
    },
    {
      "title": "Disappointed",
      "text": "The GPS hardly ever works, and trying to get the device to pair can be spotty. Sometimes it works well and I am happy with it.",
      "rating": 2.0,
      "verified": false,
      "author": "John K.",
      "helpful_votes": 0,
      "publication_date": 20160303
    },
    {
      "title": "Terrible product.",
      "text": "I have bought not 1 but 2 of these watches and neither one work. They will not even turn on. Please dont waste your time or money.",
      "rating": 1.0,
      "verified": false,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "Hard to find parts",
      "text": "Could not find a replacement strap. Very disappointing since I really like the watch",
      "rating": 4.0,
      "verified": false,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190123
    },
    {
      "title": "Awesome",
      "text": "This watch is very useful. The band is not textured as pictured in the item photos",
      "rating": 5.0,
      "verified": false,
      "author": "Benjamin Brown",
      "helpful_votes": 3,
      "publication_date": 20150815
    }
  ],
  "product_meta": {
    "title": "Sony Digital Dial 3 White Unisex Android Smartwatch SWR3",
    "description": "Waterproof. IP58 Rated.1 Year Sony Manufacturer's WarrantySensors: Ambiant light sensors, Accelerometer. Compass. Gyro. GPS.Notifications, Voice Commands, Lifelog, Impressive stand alone functions.Powered By Android Wear - Useful information when you need it. Apps for everything. A SmartWatch powered by Android Waer is forever expandable. As developers create new ways for you to customize and enjoy the Android Wear experience, your SmartWatch 3 SWR550 becomes increasingly personalized.",
    "rating": 3.6,
    "feature_bullets": [
      "Useful information when you need it. Apps for everything. A SmartWatch powered by Android Wear is forever expandable. As developers create new ways for you to customize and enjoy the Android Wear experience, your SmartWatch 3 SWR50 becomes increasingly personalized.",
      "Sensors: Ambient light sensors, Accelerometer. Compass. Gyro. GPS",
      "Notifications, Voice Commands, Lifelog, Impressive stand alone functions.",
      "Powered By Android Wear",
      "Waterproof. IP58 Rated."
    ],
    "specifications": {
      "Product Dimensions": "0.39 x 1.77 x 1.77 inches",
      "Item Weight": "1.62 ounces",
      "ASIN": "B00R5W5VKA",
      "Item model number": "1292-4180",
      "Batteries": "1 Lithium ion batteries required.",
      "Customer Reviews": "3.6 out of 5 stars185 ratings3.6 out of 5 stars",
      "Best Sellers Rank": "#187,698 in Electronics",
      "Is Discontinued By Manufacturer": "No",
      "OS": "Android",
      "RAM": "0.51 GB",
      "Connectivity technologies": "GPS",
      "GPS": "True",
      "Other display features": "Wireless",
      "Device interface - primary": "Dial",
      "Colour": "White",
      "Phone Talk Time": "48 Hours",
      "Manufacturer": "Sony",
      "Date First Available": "December 17, 2013"
    },
    "categories": [
      "Electronics",
      "Wearable Technology",
      "Smartwatches",
      "All Departments"
    ],
    "price": 349.99
  }
}