{
  "website_summaries": [
    {
      "verdict": "A low-cost motion sensor/alarm with some known defects, including false alarms.",
      "pros": [
        "An outdoor alarm",
        "Accurate detection even if an intruder is out of \"sight lines"
      ],
      "cons": [
        "Occasional false alarms caused by movements in nature"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "I used it as a mail chime and it's awesome!",
      "text": "I love it! My house has a long driveway and I cannot see the mailbox from any window. I was considering to get the mail chime but it is a bit expensive in terms of price so I thought I will give motion detector a try as it's cheaper. I had trouble using duct tape or Velcro tape because my mailbox is plastic and it just falls off. My husband used a nail to secure on the mailbox door and it worked like a charm! Just heard its chime 30 minutes ago then I went out and got my mail, it was amazing! No more walking out every hour to see if my mail is here.",
      "rating": 5.0,
      "verified": true,
      "author": "Rach",
      "helpful_votes": 189,
      "publication_date": 20170110
    },
    {
      "title": "Beat delivery person to door",
      "text": "I installed this Driveway Alarm so I would know when someone came up to the house. This is a very helpful system to have at a reasonable price. I don't miss package deliveries, I am at the door before the delivery person gets there.",
      "rating": 5.0,
      "verified": true,
      "author": "Athanickels",
      "helpful_votes": 24,
      "publication_date": 20170914
    },
    {
      "title": "Worse than useless",
      "text": "From whom are all these glowing reviews coming? I am no longer going to trust Amazon reviews. This unit is absolutely rubbish. The motion sensor eats alkaline batteries within a 48-hours, persists in giving false alarms when there is absolutely nothing moving does, not hold the link with the base unit, has no sensitivity adjustment ..although black electrical tape works pretty well and no on or off switch either. I have been messing with it for a month now. I've had my tech weenie friends over to try and get it to work to no avail. It's going in the trash",
      "rating": 1.0,
      "verified": true,
      "author": "M. Taylor",
      "helpful_votes": 18,
      "publication_date": 20171009
    },
    {
      "title": "Worked well for a while, but then.....",
      "text": "For the price, this alarm works surprisingly well. My only difficulty was in getting the battery compartments open! When I finally managed it, I dispensed with the ridiculously small screws with impossibly shallow slots and secured the covers with tape. The range of the sensor is a bit narrow, but it works well on the door casing of my garage. Six months later: The sensing unit failed, and when I attempted to set up the other one the unnecessary screws for the battery compartment seemed welded in place. Destroying the case appeared to be my only option for opening it. I'll buy something else.",
      "rating": 2.0,
      "verified": true,
      "author": "Robert H. Rogers",
      "helpful_votes": 11,
      "publication_date": 20170911
    },
    {
      "title": "My safety is the best ever with a onetime fee",
      "text": "The apartment homeowner association do not allow doorbells here.Since buying this product I can now open up doors & windows for fresh air. My safety is the best ever with a onetime fee. Best of all the price of all is this summer my electric bill will go down related to the high cost of central air. I can now enjoy fresh air. Believe me this Alarm Rings very LOUD YOU WILL WAKE UP. NOW I CAN SLEEP WITH PEACE>INCREASE THE PEACE. GAYLE",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 13,
      "publication_date": 20170517
    },
    {
      "title": "great deal",
      "text": "I have a long driveway and this gives me a heads up if someone is driving or walking to my house. A few false signals due to leaves in the wind and the random duck but all in all pretty awesome.",
      "rating": 5.0,
      "verified": true,
      "author": "jp machine",
      "helpful_votes": 17,
      "publication_date": 20171106
    },
    {
      "title": "Works well",
      "text": "Works very well , purchased for my elderly mom and set up at the end of her driveway about 300' away. Line of sight is direct from sensor to receiver and I'm sure that helps. Sensitive enough to pick up crows/birds feeding nearby so false or inaccurate alarms occasionally sound. I purchased this second unit for my work place gatehouse as a gift. Guards seem happy not to have to swivel their heads all day looking for arriving or exiting cars.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Coyne",
      "helpful_votes": 6,
      "publication_date": 20170414
    },
    {
      "title": "Easy to configure but with limitations",
      "text": "This is easy to install and use. There are a number of features that would have made this perfect. (1) There is only one choice of sound on low. I am monitoring 3 directions so I have now way to know which way a visitor is approaching. I would have liked the ability to choose a different sound for each directions. (2) the detectors do not work (or work well) when sun shines directly at the sensor screen and I keep getting false alerts. This would work better if it had a small protection against sun (think of tennis hat) for the lens. Lastly, this is not about security in my mind. This is more about awareness.",
      "rating": 4.0,
      "verified": true,
      "author": "M. Shahsavar",
      "helpful_votes": 3,
      "publication_date": 20170529
    },
    {
      "title": "Inconsistent. Unreliable.  :(  I wanted so much to like this because I need it so much.",
      "text": "Inconsistent. Unreliable. :( I wanted so much to like this because I need it so much. One sensor shows the blue light on occasion to show there is power, but it has never worked as a sensor. The other sensor either goes off relentlessly chiming (more than the usual four chimes) or doesn't sense any movement or heat at all. It will remain silent for several hours at the minimum and this today it chimed for the first time since Wednesday afternoon even though it's the only door we use regularly multiple times a day.",
      "rating": 1.0,
      "verified": true,
      "author": "BestDayofMyLife",
      "helpful_votes": 3,
      "publication_date": 20171020
    },
    {
      "title": "Very affordable",
      "text": "I am so happy with this purchase! We have a long driveway and we have a monitor down at the beginning of our driveway & the alarm in our kitchen window so we are notified when someone pulls in. I recommend not placing the monitor in front of any trees, bushes or tall grass that will set off the alarm when the wind blows. It is very easy to install and the weather has not bothered ours after 2 years of being outside and the batteries have not had to be changed. It is definitely worth the money and will purchase again if anything ever happens to the one I have now.",
      "rating": 5.0,
      "verified": true,
      "author": "Woody9311",
      "helpful_votes": 0,
      "publication_date": 20190808
    },
    {
      "title": "Inexpensive driveway alarm...lasted 9 days:(",
      "text": "9/29/18 Update Yesterday, i noticed the primary driveway unit quit communicating. Why? I have no idea... i attempted to resync the unit and nothing. Batteries were brand new and less than 2 weeks old, so thats not the issue... I would appreciate if Byone would contact me with a solution. I'll add to this review later. Ive dropped my review to 2 stars... Original Review after receipt: Have used these in the past and they always have worked well. This is the first time i've purchased a dual unit. It works well, but it would be better if the unit separated the two by an audible tone and/or Zone light on the receiver.",
      "rating": 2.0,
      "verified": true,
      "author": "Pmag63",
      "helpful_votes": 0,
      "publication_date": 20180920
    },
    {
      "title": "One and a half years and still working",
      "text": "Although it comes with two sensors, I am only using one and it is installed on my covered front porch. Reason being is you can't distinguish between the two sensors the one being triggered. So far it is still working (had a different brand that only lasted 3 months) after 2 summers and 2 winters outdoors in Dallas, TX. I believe I've changed the batteries twice since I got it. My front porch is always busy at it is where we enter and exit our home and I almost have daily package deliveries. It has served its purpose letting us know if somebody is at our front porch and would recommend it to others.",
      "rating": 4.0,
      "verified": true,
      "author": "Dad of Four",
      "helpful_votes": 0,
      "publication_date": 20181202
    },
    {
      "title": "Too many false alarms outdoors",
      "text": "I liked the different chime sounds that can be used, but not much else. According to instructions it can't be placed in direct sunlight, so I couldn't put near my door entry ways. It goes off at the least provocation and from that standpoint can't be used reliably outdoors. Indoors you might have better luck controlling what the sensor is facing. So if I wanted to put a sensor in my detached shop to detect someone who has already entered the building, it would work OK. Would not recommend for outdoor usage especially where you have bushes, trees, shade and sun movements that will constantly trigger this sensor. No way to adjust sensitivity.",
      "rating": 2.0,
      "verified": true,
      "author": "TechConsumer",
      "helpful_votes": 3,
      "publication_date": 20160418
    },
    {
      "title": "Work just as described",
      "text": "Does exactly as it says. Extremely simple and useful. Great range even through walls. I only wish the volume could be more finely adjusted. For my taste, even the quietest setting is way too loud for everyday use. Easily solved by inserting inside of a favorite stuffed toy. Now the dragon's eyes light up when someone is near. Who needs Sting?",
      "rating": 4.0,
      "verified": true,
      "author": "Dan or Adrienne",
      "helpful_votes": 5,
      "publication_date": 20170222
    },
    {
      "title": "1byone wireless security",
      "text": "Decent product for the price but randomly keeps forgetting the paired sensors so have to re-pair one or sometimes both of them with the receiver once every 2 weeks or so. Also the manual is rather lacking and still can't figure out how to make it chime more then once or whether I can make each sensor have different chime or not, thus taking a star off for reliability and not included optional!? power adapter, and another star for poor documentation of not easy to set-up product.",
      "rating": 3.0,
      "verified": true,
      "author": "JoeBlow",
      "helpful_votes": 4,
      "publication_date": 20170327
    },
    {
      "title": "Unpredictable and not helpful at all",
      "text": "the \"beam\" is too wide and makes it hard to catch just my driveway traffic without dinging every time somebody drives down the road. The one I put under my shelter to make sure nobody was sneaking in my yard to fiddle with my mower just goes off for no reason. And I was sure to put it high enough so that my backyard chickens didn't set it off. I bought this product and also a plug in doorbell from the same company and was not happy with the performance or quality of either. Try another brand and spend a little more money. Because this one was a waste.",
      "rating": 1.0,
      "verified": true,
      "author": "Bad Girl",
      "helpful_votes": 5,
      "publication_date": 20151110
    },
    {
      "title": "Works awesome! Sensitive.",
      "text": "So, I bought these for a non traditional use. I use them to protect my chickens. I set them up outside the coup when I saw coyotes bothering them. Not only do the alert me to big animals, they ring for rats or whatever approaching the cage. Still working months later, rain or shine. Awesome product!",
      "rating": 5.0,
      "verified": true,
      "author": "Lacalema",
      "helpful_votes": 6,
      "publication_date": 20170119
    },
    {
      "title": "It didn't last very long",
      "text": "It worked okay for about 9 months, with only an occasional false alarm. Now, the receiver unit continuously sounds an alarm. It continues to do this, even when I remove the batteries from the sensor/transmitter units, so there is no signal coming to the receiver unit. The receiver also continues to sound an alarm when it is powered by fresh batteries (1.60 volts each) or is being powered from 110 volts AC power using their DC voltage adapter. I recall reading some negative reviews when I bought this equipment, but I thought I'd take my chances with it.",
      "rating": 1.0,
      "verified": true,
      "author": "Laina",
      "helpful_votes": 5,
      "publication_date": 20160709
    },
    {
      "title": "Great product, great customer service!",
      "text": "Amazing customer service! I originally had trouble pairing my device and discovered one of my sensors was defective. The company was responsive and rectified the issue. The unit works better than I had anticipated. The alarm is very clear and I like having the options of loud, soft, and chime. I like that sensors can be added. I am also impressed with how far away I can have the sensors and they can still be picked up my the device. I recommend this product for both its quality and it's customer service; very impressive.",
      "rating": 5.0,
      "verified": true,
      "author": "siva aiken",
      "helpful_votes": 2,
      "publication_date": 20170327
    },
    {
      "title": "Good to upgrade your camera system to alert you to motion",
      "text": "Love these things got high definition cameras don't want to stare at the monitor all day so it alerts me to when I can look to see what's going on when there's activity they let me know when there's motion and the area of the camera covers it's a great way to upgrade your camera system to let you know when to watch and where to watch I bought several of them and label them Zone a b c and d one for each camera and you can sit them on different signals so that way you know what area is detected motion",
      "rating": 5.0,
      "verified": true,
      "author": "jeffwestbrook",
      "helpful_votes": 0,
      "publication_date": 20190623
    },
    {
      "title": "1byone Wireless Home Security Driveway Alarm stopped working.",
      "text": "At first I thought this was great, but after two months it stopped working. I thought maybe the batteries were dead so I bought a 6V DC adapter and it still does not work. Small blue light comes on when someone passes by the sensor but no chime/alarm on receiver. Lights and chime work when pairing devices but no chime/alarm when someone passes the sensors.",
      "rating": 1.0,
      "verified": true,
      "author": "debzdezigns",
      "helpful_votes": 3,
      "publication_date": 20171012
    },
    {
      "title": "Not very reliable, dry rots",
      "text": "Worked for about the first year and then some but the motions would be detected by animals and cause false alarm triggers. Also, the bases that detect motion, the screens dry rotted over time and I had to throw it away. They essentially busted open like tissue paper. Again good product if you dont have animals that will trigger the alarm.",
      "rating": 2.0,
      "verified": true,
      "author": "Kayla Millhone",
      "helpful_votes": 0,
      "publication_date": 20200709
    },
    {
      "title": "This unit is awesome for my application",
      "text": "This unit is awesome for my application. I have a son with autism that sometimes wanders at night. I set this in the hallway when we go to bed with the base unit near our bed. It gives a chime when he gets up so we can make sure he is safe. We also take it to hotels and our summer cabin. Could also work for someone with Alzheimer's or something similar.",
      "rating": 5.0,
      "verified": true,
      "author": "Idaho mom",
      "helpful_votes": 4,
      "publication_date": 20170719
    },
    {
      "title": "Not good on breezy days.",
      "text": "I installed this alarm @ the end of my drive, on the back side of my mail box post. No trees, shrubs or any objects, other than AIR around the sensor. It will constantly alarm on a windy day, so much I turn it off. I have read all instructions 10 times over & can't figure what I've done wrong. Nothing. It's puzzling to me that the alarm does NOT go off during hard rain or sleet or snow flurries. But you let a breeze blow by & you'd swear you had every friend you'd ever known showing up @ your door!",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171226
    },
    {
      "title": "Has never worked for me - super frustrated - really would enjoy this for protecting my home.",
      "text": "I am a tech savvy person and I have used other motion detectors in the past with success. Getting this one to work is insufferable. I read the poorly written manual many times, read amazon reviews and even searched for videos to explain how this would work all to no avail. SPARE YOURSELF YOUR SANITY AND BUY A DIFFERENT MODEL.",
      "rating": 1.0,
      "verified": true,
      "author": "Black Walnut",
      "helpful_votes": 0,
      "publication_date": 20200512
    },
    {
      "title": "ONE of the most important forms of protection",
      "text": "Excellent! We live in the sticks. While hubby was working on The Slope, someone ended up coming up to the house about 3AM. He was gone before the Troopers got here. If I had this then, I'd had been way more prepared before someone could have gotten to my door. We just bought another set. This set is to alert to intruders, the new set will be to alert us to bears (we see the prints, but have never seen them walking through) and with baby moose being born, well, you just can't see them enough, and this will let us know they're in our yard, and we won't miss them!",
      "rating": 5.0,
      "verified": true,
      "author": "Stacey Wright",
      "helpful_votes": 0,
      "publication_date": 20180603
    },
    {
      "title": "Even though I saw several bad reviews, I thought I would give it a ...",
      "text": "Neither motion detector would pair with the receiver. It would sound one time as if it paired, but nothing more. Even though I saw several bad reviews, I thought I would give it a try!! My mistake and I'm returning it.",
      "rating": 1.0,
      "verified": true,
      "author": "Moe",
      "helpful_votes": 4,
      "publication_date": 20171214
    },
    {
      "title": "I've had these for a few days now. I ...",
      "text": "I've had these for a few days now. I installed one in my garage, which leads into my house, and the 2nd one under my deck, which is another vulnerable point because there are bedroom windows underneath it. So far, no false alarms, and it picked me up flawlessly while i was trudging through the dark. They hadn't gone off until this morning, something triggered it several times.I went out onto my deck and shined a spot light, and then i heard some rustling in the bushes. So, there was some sort of critter setting it off, so at least it works.",
      "rating": 5.0,
      "verified": true,
      "author": "Will",
      "helpful_votes": 2,
      "publication_date": 20170205
    },
    {
      "title": "The sensors seem to be good with a detection range of up to around 35 ...",
      "text": "Everything works well. The sensors seem to be good with a detection range of up to around 35 feet and even much more for large objects like trucks. Few false alarms from wind, etc. The receiver unit picks up well with settings for loud, soft, and quiet with a flashing light. The chime rings four times and is so loud it can be annoying but it will catch your attention. Recommend also purchasing the AC adapter cord, since it is less expensive than the required C batteries in the receiver. All in all, a good value.",
      "rating": 4.0,
      "verified": true,
      "author": "rustyoldchevelle",
      "helpful_votes": 2,
      "publication_date": 20170203
    },
    {
      "title": "Warning System",
      "text": "Shipped fast. Everything is as expected. I'm happy. I'm building a cabin on 3 acres and am using it to warn people if they come onto my land. I have it hooked up to a shed.",
      "rating": 5.0,
      "verified": true,
      "author": "Jesse L.",
      "helpful_votes": 23,
      "publication_date": 20160502
    },
    {
      "title": "It’s a lemon!",
      "text": "This product worked great for... 41 days. Just long enough to get past the return window. Lights and beeps indicate that both the sensor and receiver are on (the sensor has fully charged batteries... I checked, the receiver is plugged in). The receiver does not receive when the sensor is tripped. I tried (by the book) to re-cinq the units, to no avail. The company’s website says it costs $6. I’d be less peaved if it hadn’t cost three times as much here.",
      "rating": 1.0,
      "verified": true,
      "author": "Todd Saint Pe'",
      "helpful_votes": 0,
      "publication_date": 20180709
    },
    {
      "title": "Works great! Almost too great... read notes. Now used as a security option.",
      "text": "I used it when my neighbor returned from work. I needed to get her dog back when she returned. It worked so well, I would wait a bit so she didn't get suspicious of how fast I got her dog back. The dog even knew she got to go home when it chimed. She gave me the dog so now I use it as a deterrent to thieves because the light blinks on the outside box, with motion, and I have a sign that states you are on camera, also bought from Amazon, I think. I leave the inside alarm off.",
      "rating": 5.0,
      "verified": true,
      "author": "Jillbert",
      "helpful_votes": 0,
      "publication_date": 20180805
    },
    {
      "title": "I use my alarms when traveling. I place one ...",
      "text": "I use my alarms when traveling. I place one sensor in my car and the other towards my room door. I always insist on 1st floor room (fires) facing park lot, park car close to room window then place alarms receiver on window ledge. A car break in will alert me and i will be shining my flashlight on thief while calling 911. Use it to stop teens from sneaking out.",
      "rating": 5.0,
      "verified": true,
      "author": "frank",
      "helpful_votes": 4,
      "publication_date": 20161111
    },
    {
      "title": "Decent for the price",
      "text": "Updating this because 1Byone helped me resolve issues I had. One of my sensors was not functioning well. Decent for the price. Correct positioning is a must. I turn this off on windy days or it will go off non-stop. Does alert me when someone is approaching my house, which is what I wanted it for. Now I know when UPS has dropped off a package, or someone comes to my house when not expecting. I think this is best for garage/indoor applications. If I was using it indoors, I'm sure I'd give it 5 stars. Be aware - no batteries (you'll need 3 AAA for each sensor and 3 C batteries for the reciever) and NO AC adapter included.",
      "rating": 3.0,
      "verified": true,
      "author": "Frazzle",
      "helpful_votes": 0,
      "publication_date": 20170124
    },
    {
      "title": "Very easy. I have a long drive way and like ...",
      "text": "These arrived the day after I ordered them! I put the batteries in and they synced up immediately. Mostly needed the directions (included) to help decide which chime, alarm, or flashing light combo I wanted. Very easy. I have a long drive way and like to be alerted to incoming visitors. The chime options worked well for us. Hopefully they will last longer than my old ones that fritz out after a few months due to the wet weather. The bonus is that there are two sensors, so when the one does fritz out eventually, I have a back up.",
      "rating": 5.0,
      "verified": true,
      "author": "L. D.",
      "helpful_votes": 0,
      "publication_date": 20180128
    },
    {
      "title": "This was a replacement for the one that broke & ..lasted over two years.",
      "text": "This was a replacement for the one that broke & it worked for a long time. This new model which has more switches than the old one---the new one also keeps going off even when nothing is in front of the sensors...Bummer. Especially at night !! @#$%>>>PRODUCT Up-Date.. 8/27/2016....The item was not functioning properly..Thanks to the seller a refund & replacement was provided. The emails back and forth with the seller were prompt commendable. The new wireless device a different model -- works just fine and my Koi pond was saved from the nightly Raccoons attack.. I would buy again and recommend this seller to my friends....JITNEY",
      "rating": 5.0,
      "verified": true,
      "author": "Jitney",
      "helpful_votes": 11,
      "publication_date": 20160821
    },
    {
      "title": "WARNING: Works Only Intermittently - Refunding",
      "text": "Returning for a refund. Only works intermittently. Pairing the sensors and receiver worked successfully but when someone passes in front of the sensors, it will only chime sometimes. You can stand there and wave your hand right in front of it and nothing. Stand there and keep waving and maybe 15 seconds later, it MIGHT chime, it might not. Very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "M.F. Luder",
      "helpful_votes": 2,
      "publication_date": 20171017
    },
    {
      "title": "Great feeling more secure",
      "text": "I set these up along my driveway & the entry zone to my backyard & my chicken pen. They work beautifully. It took me an hour to synchronize them but after watching 2 YouTube videos & rereading the instructions for the 20th time, I got them both synched together at the same time, finally. Squirrels have set them off, but since I have it set on the low chime it doesn't bother me & shows me they are working, even after a big rain storm. Peace of mind.",
      "rating": 5.0,
      "verified": true,
      "author": "PolarPro",
      "helpful_votes": 0,
      "publication_date": 20180904
    },
    {
      "title": "These are great!",
      "text": "Bought these for my yard so I could tell when my packages were being dropped off and they are awesome. I couldn't believe how sensitive they were. Literally, butterflies were setting it off. If you use loud settings it will be loud enough for anyone to hear. I am very glad I purchased these as they give me another level of security as well as just being more aware of things outside. I would buy these again. Also, I've had one of the sensors outside and through rain, wind and a lot of sun, they've held up very well.",
      "rating": 5.0,
      "verified": true,
      "author": "kratomlife",
      "helpful_votes": 2,
      "publication_date": 20160603
    },
    {
      "title": "confused",
      "text": "I can't get it to sync to both units. When I turn on the receiver one sensor unit works but only one time, after I trigger the sensor I have to turn the receiver off and back on. I can't get it to do anything the instructions say. The lights on the receiver stay on all the time, I can only get one kind of alarm. Overall I don't understand this thing. I catch on pretty quick to things so I am confused. Maybe I got a lemon. I'm sure if it worked correctly it would probably be worth the money but right now, mine isn't.",
      "rating": 2.0,
      "verified": true,
      "author": "Laura",
      "helpful_votes": 0,
      "publication_date": 20180926
    },
    {
      "title": "One in every 3 or 4 work...",
      "text": "When these alarms work, they work great, year after year. The problem is they don't always work out of the box and must be returned for a working one. I just ordered one which came on Saturday, opened it up and set things up with batteries and turning it on and choosing the alarm type. The motion sensors lite up when you passed by but no alarm... Ordered a second set that afternoon (Saturday) and it came in Mondays mail. Opened them up, added batteries and this time one sensor sounded the alarm and the other just lite up. So I just ordered a third, hopefully this set will work.",
      "rating": 1.0,
      "verified": true,
      "author": "Janet M. Colbert",
      "helpful_votes": 0,
      "publication_date": 20180910
    },
    {
      "title": "Great sensors!",
      "text": "Great sensors! In the beginning it was a little annoying trying to connect the two sensors with the main speaker. Since the noise is not very pleasant during setup but that's what there made for. Also I thought I purchased the one with the plug in wall charger but realized I chose the wrong one in the end. (make sure you choose the one you want or you'll have to go out and buy C batteries) lol and AAA batteries for the two sensors. I ended up finding a USB cord with the same adapter which worked out perfectly.",
      "rating": 4.0,
      "verified": true,
      "author": "T.K",
      "helpful_votes": 0,
      "publication_date": 20180426
    },
    {
      "title": "only bad thing is when you lose power you have to ...",
      "text": "Have 2 Receivers and 5 Transmitters, only bad thing is when you lose power you have to set them up again, these are not the battery operated ones these are the plug in to AC, have two in garage, one by front door and one at the back door.... The battery's in the transmitter seem to hold up pretty good , have not replaced any as of yet, dogs set off the back door maybe 60 times a day... Anyway I do like them....",
      "rating": 5.0,
      "verified": true,
      "author": "me4ku",
      "helpful_votes": 0,
      "publication_date": 20171021
    },
    {
      "title": "Works perfectly as described. Originally first receiver worked intermitently ...",
      "text": "Works perfectly as described. Originally first receiver worked intermitently. I was contacted by product/seller and notified them of my problem. They instantly sent me a free replacement that has been working since then. I'm using each motion sensor for the front door/patio and back area of my condo. Anytime someone comes close to my patio or doors it chimes and lets me know someone is approaching before they even ring the door bell or knock on the door.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Truong",
      "helpful_votes": 0,
      "publication_date": 20170413
    },
    {
      "title": "Works, Big League",
      "text": "Does exactly what it is supposed to do....only louder. I mean really loud. I put one sensor at the front door and one at the back so that I would know when the dog was ready to come back in. Took me about ten seconds to realize that the sound of this alarm was going to give me a heart attack and the dog would be stuck outside forever. I actually had to wrap the base in a towel and stuff it into a kitchen cabinet in order to make the alarm bearable. Of course it is called an \"alarm\" for a reason, so there are worse problems to have.",
      "rating": 5.0,
      "verified": true,
      "author": "Brad",
      "helpful_votes": 0,
      "publication_date": 20161215
    },
    {
      "title": "Works good",
      "text": "This alarm solved our problem. We get a lot of packages delivered here. Often we don't know they have come. I put one sensor halfway down the drive, about fifty feet separation, and the other by the door. The alarm is in another room, but can be heard thru the wall okay. Feel more secure as well. One problem was with initial set up. The letters on the switches are very hard to read. I was unable to get the alarm to recognize the sensors. With the magnifying glass I found I had the off and on confused, after which it worked fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Bissett",
      "helpful_votes": 2,
      "publication_date": 20160107
    },
    {
      "title": "These work great. They have a pretty wide \"eye\" so you ...",
      "text": "These work great. They have a pretty wide \"eye\" so you don't have to have it facing exactly in the right direction which gives you some leeway in placement. The chime is not too annoying and you can have two settings. We use it in an indoor setting for customers walking in and it works good for that too. The chime is a little long - longer than a doorbell - but serves it's purpose. I thought the price was reasonable for one receiver and two alarms.",
      "rating": 5.0,
      "verified": true,
      "author": "Sheila B.",
      "helpful_votes": 2,
      "publication_date": 20160805
    },
    {
      "title": "USE in PLASTIC mailbox.",
      "text": "I put one at the door and I get an alert whenever someone comes on the porch. Of course, bunnies and an occasional bird set it off. One issue I had was it not working when I put it in my metal mailbox. The metal must block it, even though it’s not that far from the receiver. My neighbor has one in his plastic mailbox and always knows when his mail is delivered. It’s great for that purpose, if your mailbox is plastic.",
      "rating": 5.0,
      "verified": true,
      "author": "sbee",
      "helpful_votes": 0,
      "publication_date": 20180731
    },
    {
      "title": "Great item for home security",
      "text": "We have used these for years and they are great! Wireless lets us mount these all over a farm generally less than 70 feet. Second we live in a city so both lost people wander through and a coyote will wander through. This item chimes when both come through. The con is wind moving things and rain often makes it chime as well. People have these inside garages for intruders and it chimes in a house.",
      "rating": 5.0,
      "verified": true,
      "author": "Marc W",
      "helpful_votes": 0,
      "publication_date": 20171202
    },
    {
      "title": "Great for hallway alarms too",
      "text": "We have used this as an alarm in my hallway so I can hear my kid coming out of bed. This product is very loud (I’m hard of hearing) and I can actually hear it go off. My only complaint is I wish I could change how long the alarm beeps for. It will chime 4xs when movement is detected. So by the time my son gets to the second sensor, it won’t pick him up because the first sensor is still beeping. That’s how I measured how far out of his room he is. Overall, I would absolutely recommend this.",
      "rating": 4.0,
      "verified": true,
      "author": "Inglish Short",
      "helpful_votes": 0,
      "publication_date": 20180927
    },
    {
      "title": "Works Great!",
      "text": "I installed the 1byone wireless home security driveway alarm a few weeks ago after my truck was vandalized. Now I will be able to hear if anyone gets near my truck. Including squirrels, birds and the neighbors cat. I didn't realize my yard was the gateway to wildlife. With that said, I could not ask for a better wireless alarm. Works exactly as described.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott R",
      "helpful_votes": 3,
      "publication_date": 20161209
    },
    {
      "title": "Did not work as advertised!",
      "text": "Tried 3 different transmitters on a driveway that has over 35 feet of OPEN space. All 3 transmitters produced false readings and a LOT of them. I watched the transmitters as they were giving the false alarms and there was nothing I could see that would cause this! The original Amazon package was damaged pretty bad, but the items themselves had no visible damage. This product is not usable as described and I have sent it back to Amazon for refund",
      "rating": 1.0,
      "verified": true,
      "author": "RKH",
      "helpful_votes": 3,
      "publication_date": 20160603
    },
    {
      "title": "Works great",
      "text": "I have a long drive way that swings around behind my house so I can never knew when someone drives up. I put one of the sensor on a tree 2/4 of the way up and now I know when someone comes up the driveway. I also put one on the front porch stairs so when delivery people come and leave something without ringing the bell, I'll know. My only complaints so far. Directions were a little hard to follow. I would have preferred if each sensor had a different sound so I could tell which one was activated. Very easy to install.",
      "rating": 4.0,
      "verified": true,
      "author": "C. L. Kehoe",
      "helpful_votes": 2,
      "publication_date": 20151025
    },
    {
      "title": "Our cats have pretty regular places to be so we put the sensors ...",
      "text": "Not just a visitor alarm, cat alarm also. Our driveway is not long but we spend most of our evenings towards the back of the house. Our cats have pretty regular places to be so we put the sensors in those places. One sensor is not far from the street, just turn it away from the street and avoid cars setting it off. It's nice to know when the cats are the back door wanting in. This works pretty darn good. Have not had to change any batteries yet but have only had for ~ 4 months.",
      "rating": 5.0,
      "verified": true,
      "author": "Doug",
      "helpful_votes": 0,
      "publication_date": 20180407
    },
    {
      "title": "Works great",
      "text": "Bought one last year this one was for a gift. I bought the adapter for my first one but haven’t used yet because the sensors and monitor are still working on the original batteries. It works very well picks up everything. Monitor beep is easy to hear on low and loud you can hear from very far away lol The only con -make sure sensor is not in direct sunlight",
      "rating": 5.0,
      "verified": true,
      "author": "Adel A England",
      "helpful_votes": 0,
      "publication_date": 20181226
    },
    {
      "title": "Bought it year 2017 and still working!",
      "text": "Got this 2017 and I think I might have changed the batteries once only but it seems that i did not yet. Still this sensor is worth the purchase for us. It has withstand the rainy season, summer, winter, and a lot of motions. It does alarm when sunlight hits the sensor I think but it doesn't matter to me.",
      "rating": 5.0,
      "verified": true,
      "author": "@amoshi",
      "helpful_votes": 0,
      "publication_date": 20190603
    },
    {
      "title": "Alert alert alert",
      "text": "I use this for my driveway. It's very sensitive if the wind and tree blow, paper fly, rain, sun comes out ECT the alarm goes off. It will drain batteries very fast. I get my batteries from Lowe's and they are not cheap. I have to change batteries every 3 weeks. I'm going to try to find another driveway alarm from a different company.",
      "rating": 3.0,
      "verified": true,
      "author": "Gloria Marshall",
      "helpful_votes": 0,
      "publication_date": 20190807
    },
    {
      "title": "Scare Off Wild Animals",
      "text": "I set these up to protect my campsite with a perimeter alarm to safe guard against potential loss of personal property and warn off wild animals that get too close. We had a group of coyotes wander into our campsite looking for food in the middle of the night and the alarm went off. I don't know if they will chase off bears but I will be using them this year in Yellowstone.",
      "rating": 5.0,
      "verified": true,
      "author": "Rick",
      "helpful_votes": 2,
      "publication_date": 20170117
    },
    {
      "title": "Bought to replace an existing identical product",
      "text": "I replaced the old with the new and everything works once again. I would recommend these for someone that wants a simple way to be alerted when something moves in front of the outdoor sensor. Ours is at least 100' away from the indoor receiver.",
      "rating": 5.0,
      "verified": true,
      "author": "Jay E. Johnson",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "best idea",
      "text": "I needed something to alert me when kids were out of bed, because getting up 100 times a night to check on them while I try to work just isn't an option. I am not a fan of cameras so this was the next best option. One in the doorway works well. They also gave up on trying to sneak out of their rooms after a few nights, learning quickly that when they see the blue flash from the sensor, I knew they weren't in their room",
      "rating": 5.0,
      "verified": true,
      "author": "JCC",
      "helpful_votes": 3,
      "publication_date": 20160114
    },
    {
      "title": "Great product !",
      "text": "LOUD....is putting it nicely. This thing will alert you 5 miles away if someone is coming and your across town! Even on low this is sometimes too much. It works well at our office as a welcome chime to customers entering the shop. No false alarms and the build quality is ok too. I did not rate this 5 stars as you cannot simply have 1 chime....its three L O N G and loud chimes....everytime. For those that can't set it up, look for the manufacturers youtube video on setting one up....it's easy if done correctly. If you screw it up just empty the batteries and let it sit for 2 minutes and retry.",
      "rating": 4.0,
      "verified": true,
      "author": "GamerTech",
      "helpful_votes": 0,
      "publication_date": 20160429
    },
    {
      "title": "It works pretty great.",
      "text": "Works as expected. I have the two units about 50 feet away outside and they connect fine and work everytime. Used to notify me when someone pulls in the drive way or walks up the steps. I had to turn it off since animals and the wind were setting it off at night and freaking me out. Will see if they hold up against winter, but not bad for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "JS",
      "helpful_votes": 0,
      "publication_date": 20171106
    },
    {
      "title": "Doesn't Work Properly",
      "text": "Got this for work to put by the driveway so we would know when someone pulled or walked up when we were in the back room. Have tried about a dozen places and positions and the unit either goes of constantly or not at all. Also tried to do the reset and re-sync and the unit would only Pair one sensor, which would still work. So after another dozen places and positions the unit still goes off constantly or not at all. Going to keep unit as an alarm for a different purpose.",
      "rating": 1.0,
      "verified": true,
      "author": "Casey",
      "helpful_votes": 0,
      "publication_date": 20170703
    },
    {
      "title": "Very sensentive.",
      "text": "Purchased to replace an older driveway monitor and was pleased with product until the wind started blowing. Don't understand exactly how but the winds caused the sensors to constantly react and the monitor to sound alert. So much so in fact, we had to turn them off and have since returned the product. I would suggest that you take caution if you place them in any kind of open area where the wind may affect them.",
      "rating": 2.0,
      "verified": true,
      "author": "Harlon Pickett",
      "helpful_votes": 0,
      "publication_date": 20180123
    },
    {
      "title": "Great product",
      "text": "Fine product but description bad. It speaks of a ac cord with package, none shipped. After digging in, found it listed none included. Wish it was listed better Update: customer service got in touch to help me fix my issue. They were very helpful. After such great help I am changing my review to four stars and would buy from them again.",
      "rating": 4.0,
      "verified": true,
      "author": "Marvel",
      "helpful_votes": 2,
      "publication_date": 20170116
    },
    {
      "title": "Sucks",
      "text": "The wind sets these things off. Who the heck even uses C batteries any more??? Pain in the butt to pair multiple motion sensors. Update: the motion sensor alarm died after less than a month. And it was not even on all the time. This entire product has been a huge regret for me",
      "rating": 1.0,
      "verified": true,
      "author": "Amber",
      "helpful_votes": 0,
      "publication_date": 20190430
    },
    {
      "title": "Wireless Home Security",
      "text": "These work good but the sensor did not reach as far as what I needed for some of the places I put them. I changed some of mine around so all places are covered. I use 5 wireless sensors but in a couple of places it is outside the range limit for these sensors. I live on acreage so my spaces are larger than most.",
      "rating": 5.0,
      "verified": true,
      "author": "Katy Nelson",
      "helpful_votes": 0,
      "publication_date": 20190118
    },
    {
      "title": "They are tough despite weather exposure and last! Great buy, great durability.",
      "text": "We purchased these 2 and a half years ago and they STILL work well. The batteries last about a year in the sensors and the receiver. I’ve replaced them twice. When you replace sensor batteries it’s best to replace them both. They must be reprogrammed which is easy. The receiver picks up their signal and does it. The first time you might need to check the instructions. It would be nice if the individual sensors had a different tone so you knew which was going off. We have an additional set to cover a different area which is helpful in knowing which area has movement.",
      "rating": 4.0,
      "verified": true,
      "author": "Melanie Dickinson",
      "helpful_votes": 0,
      "publication_date": 20180706
    },
    {
      "title": "Active light doesn't work",
      "text": "Overall, I would rate this item five star. Unfortunately, the on indicator light is malfunctioned and doesn't turn on. I don't know how many times both my wife and I have triggered the alarm not realizing it was on. I will contact the sender and see if they correct this and if so I will update my review to a five star.",
      "rating": 1.0,
      "verified": true,
      "author": "Clinton Hollow",
      "helpful_votes": 0,
      "publication_date": 20181119
    },
    {
      "title": "No ability to adjust sensitivity.  Returned them all.",
      "text": "Returned them because they kept going off at every thing. I have a road about 90 feet from my house, and they would go off at every car that goes by. Also, cats, mice and other animals would set them off. There is no way to adjust the sensitivity... and very hard to get two of them to program the same as advertised. I got one out of 5 sets to program... the others would only program one unit to one master. I was not happy with these units at all.",
      "rating": 2.0,
      "verified": true,
      "author": "Leslieallen",
      "helpful_votes": 0,
      "publication_date": 20160515
    },
    {
      "title": "Had to walk all the way out there 3 times trying to find a screw that would fit since it didnt come with any like it said it did",
      "text": "Doesnt even work. I set it up at the end of my long driveway. Had to walk all the way out there 3 times trying to find a screw that would fit since it didnt come with any like it said it did. I walked by it a couple times and it didnt work then the next time it did. My husband just drove by it on his way to work and it didnt work again. Do not trust this thing it does not work every time. 👎",
      "rating": 1.0,
      "verified": true,
      "author": "Traci",
      "helpful_votes": 0,
      "publication_date": 20180128
    },
    {
      "title": "Good security alarm",
      "text": "Purchased to alert whenever one of two garage doors are opened. One faces one door and one the other. They work well. If the garage door is open it will pick up cars passing by. This is not a problem as I just need it to alert so know someones coming in the garage. Had several months now. No problems so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Sheryldine Bates",
      "helpful_votes": 0,
      "publication_date": 20181212
    },
    {
      "title": "WASTE OF MONEY",
      "text": "After turning these on, they sounded off repeatedly for no reason and did not respond at all to movement. I sent them back. If I were you, I wouldn't waste my time or money on these. There are other brands just like these, that actually function well. I just tried to save a few bucks instead of purchasing the more expensive ones. You get what you pay for!",
      "rating": 1.0,
      "verified": true,
      "author": "Betty",
      "helpful_votes": 2,
      "publication_date": 20161010
    },
    {
      "title": "Keep looking.",
      "text": "This alarm is way too sensitive. I tried it in 5 different places and at several different angles and it still didn’t fit my needs. It chimed excessively and the volume adjustment is either church mouse or church bell, no in between. I ended up taking it down after a few days because it chimed all times of night and woke up the whole house. I do not recommend buying this.",
      "rating": 1.0,
      "verified": true,
      "author": "Brent J.",
      "helpful_votes": 0,
      "publication_date": 20180902
    },
    {
      "title": "Made in China?",
      "text": "This product comes with 2 'Motion Sensors' and 1 'Receiver'...... One 'Motion Sensor' make the 'Receiver' go \"DING DONG\"...... the other 'Motion Sensor' lights up, but DOES NOT cause the 'Receiver' to \"DING DONG\".....???????",
      "rating": 1.0,
      "verified": true,
      "author": "William Janney",
      "helpful_votes": 4,
      "publication_date": 20161001
    },
    {
      "title": "works well / does its job",
      "text": "I've been using this set ( 2 detectors, 1 receiver ) at work for over 4 months. I run my own business and have 1 detector at the front entrance doors and 1 at the back warehouse door. The set has worked / done its job as it should since day one... and even lets me know when one of the stray cats in our industrial area ventures into my warehouse.",
      "rating": 5.0,
      "verified": true,
      "author": "A.C.",
      "helpful_votes": 0,
      "publication_date": 20180709
    },
    {
      "title": "Easy to install, works perfectly",
      "text": "This device does exactly what I want. It’s easy to install & set up. I have it set to mute so it just quietly flashes a light to tell me when it detects a motion in the daytime. I turn it to alarm mode every night before I went to bed. I have only had the unit installed for a week and do not know it's reliability, but it seems to be made OK.",
      "rating": 5.0,
      "verified": true,
      "author": "Winnie Ku",
      "helpful_votes": 0,
      "publication_date": 20180805
    },
    {
      "title": "Place the sensors wherever you want to monitor motion of heat. Animal or human.",
      "text": "This set is great. I know electronics. I installed my own hard-wired alarm system. I bought these so I could detect raccoons tearing up my back yard. They work great. Sensivity is really good. They have made it by some rain storms and still function. I did modify my receiver by adding a volume control. I kept it in my bedroom and it was a little too loud. All in all I would recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Clink",
      "helpful_votes": 0,
      "publication_date": 20180216
    },
    {
      "title": "Looks like a good product depending on where you place it",
      "text": "Extremely sensitive even at distance. Wind blowing wooden fence, leaves and branches sets it off. On windy days it becomes a noisy nuisance. Will pick up a cat walking by. Looks like a good product depending on where you place it. Update 2020: I have used this now for years. Great supplement to home security system to cover weak points. Also very portable. good to let you know if a cat walks into your garage or a grackle bird lands on your clean car. Kind of fun to play around with and solve mysteries.",
      "rating": 4.0,
      "verified": true,
      "author": "Old Dude",
      "helpful_votes": 0,
      "publication_date": 20160307
    },
    {
      "title": "Great idea but not spotty connections",
      "text": "started strong but then after a month or two stops connecting with home base. You really need to be in line of site and batteries burn out quick. No false alarms which is good, but misses a lot when it should trip the sensor.",
      "rating": 2.0,
      "verified": true,
      "author": "Flapjack Reviewer",
      "helpful_votes": 2,
      "publication_date": 20171024
    },
    {
      "title": "Works great outside",
      "text": "Works too good. I had to build a birdhouse around it to blind the sides from picking up every little thing in the yard. It's been outside in the rain and snow for a year now and still works. Just wish the chime was 2 short chimes instead of 4. Seems Overkill/annoying sometimes",
      "rating": 4.0,
      "verified": true,
      "author": "Daniel",
      "helpful_votes": 0,
      "publication_date": 20190210
    },
    {
      "title": "It Works as Advertised",
      "text": "After several attempts to program bot PIR's I finally got them to be insinc.... READ THE INSTRUCTIONS Carefully and you should be fine. They even offered my money back when I gave them a lower rating. This product did go off for no reason 4 times in the middle of the night for no reason but that was also before I got them both insinc together. It works ! Mine are located at my front door gate and inside my garage door... Not intended for a mile long driveway!",
      "rating": 4.0,
      "verified": true,
      "author": "skulltattoos",
      "helpful_votes": 0,
      "publication_date": 20161015
    },
    {
      "title": "Like really OUTSTANDING",
      "text": "Outstanding customer service. Like really OUTSTANDING. Had a small issue with the receiver and customer service were fast and extremely helpful to solve the problem. As for the unit, it really should be priced more lol. Yep, I said it. It really should be more. Works great for my needs.",
      "rating": 5.0,
      "verified": true,
      "author": "Gee",
      "helpful_votes": 0,
      "publication_date": 20180105
    },
    {
      "title": "Great simple system for the price recomend to all.",
      "text": "5 Star if it had a different tone or rhythm for the two different sensors. Works great for the price at time a little to sensitive giving false alarms but can be minimized by shifting position and aim. But we have two driveways on our hill an upper & lower and of course both sensor give the same signal, so you don't know which one to look at. Recommend to all works great and the batteries seem to last a long time.",
      "rating": 4.0,
      "verified": true,
      "author": "Flying Dutchman",
      "helpful_votes": 0,
      "publication_date": 20160708
    },
    {
      "title": "You get what you pay for.",
      "text": "Works fine. Power cord for receiver not included though it has a connection built-in for it to run on AC power. On of the detectors is malfunctioning-despite having new batteries correctly installed, the low battery indicator flashes. As a result, the batter life is cut in half. Other detector works fine.",
      "rating": 2.0,
      "verified": true,
      "author": "Max L.",
      "helpful_votes": 0,
      "publication_date": 20181006
    },
    {
      "title": "worked about 18 months  otherwise ok",
      "text": "I bought a second set because I like them so much. 2 detectors on one side of the house set off both receivers and the other 2 detectors set off one receiver so I can tell driveway or garden. Minor adjustments can make a difference especially with height. On a sloop, I pointed one down a little. I mounted them on metal stakes to make adjustments.",
      "rating": 5.0,
      "verified": true,
      "author": "Consumer",
      "helpful_votes": 0,
      "publication_date": 20170527
    },
    {
      "title": "Worked well, but had many false alarms",
      "text": "Worked well, but had a lot of false alarms. Could have been birds or bunnies out there. I ended up returning these and getting a different version made by 1byone that had a volume control on it. The other set didnt even work 1/2 way down my driveway. Wish I had kept this one. May be repurchasing this one...",
      "rating": 4.0,
      "verified": true,
      "author": "Mr&Mrs Lawrence",
      "helpful_votes": 0,
      "publication_date": 20180731
    },
    {
      "title": "Get alerts",
      "text": "I keep one sensor on my dashboard at night as a deterrent to car prowlers and, worst case scenario, to alert me if they were to break in. I put the other on my porch when I'm home and expecting a package. Very helpful to allow me to be in the backyard and not miss a delivery or visitor. Easy to pair with sensor and with an older receiver.",
      "rating": 5.0,
      "verified": true,
      "author": "Christine G",
      "helpful_votes": 0,
      "publication_date": 20181004
    },
    {
      "title": "Solid motion sensing alarm",
      "text": "Does what it's supposed to and provides a good motion sensed alarm. The battery compartments are a bit tricky to get into (which isn't necessarily a bad thing) and the blue lights on the motion sensing units are pretty bright at night (also not a bad thing from a security perspective). Good working distance, good choice of alarm options. Not the clearest instructions in the world but a very usable mini alarm system.",
      "rating": 4.0,
      "verified": true,
      "author": "timsonic",
      "helpful_votes": 0,
      "publication_date": 20160418
    },
    {
      "title": "Got new set, this one works!",
      "text": "Put fresh batteries in it, doesn't work. Tried re-pairing sensor to receiver, still doesn't work. Update: by one support staff contacted me and is sending new set. Will see how it goes.Got new set. It works great so far.",
      "rating": 3.0,
      "verified": true,
      "author": "Mo",
      "helpful_votes": 2,
      "publication_date": 20171215
    },
    {
      "title": "It does that job",
      "text": "I use this when traveling to let me know IF someone enters my area. While it does exactly what I bought it for the only complaint is that it has two sound modes which it could have a few more. It would also be nice to just have a flashing strobe option.",
      "rating": 4.0,
      "verified": true,
      "author": "Stephen Ricket",
      "helpful_votes": 0,
      "publication_date": 20190211
    },
    {
      "title": "i bought these for my grandmother who has an issue ...",
      "text": "i bought these for my grandmother who has an issue with her fellow elderly neighbor who is senile and wanders onto her driveway and property- with a penchant for stealing her stuff, ripping out her flowers, and damaging her car . Now with these alarms, she can see immediately when he comes around, plus anyone else for that matter. The high volume of sound and flashing light on the alarm is helpful to her as she wont make no mistake as to what the sound is.",
      "rating": 5.0,
      "verified": true,
      "author": "G-Unit",
      "helpful_votes": 0,
      "publication_date": 20150827
    },
    {
      "title": "I use it for my senior dog. Great customer service.",
      "text": "Great customer service. I left a negative review because I couldn't get these to work. I got an email from the company. They gave me info on how to correctly sync items. And said that if it didn't work, they'd send me replacements for free. I was able to sync after reading the instructions. I use these for my old dog. He doesn't always come to tell me he needs to potty. He sometimes paces in the hallway instead. I put these out to wake me up when he starts pacing.",
      "rating": 5.0,
      "verified": true,
      "author": "latrenda",
      "helpful_votes": 0,
      "publication_date": 20160911
    },
    {
      "title": "Dependable",
      "text": "I have had these for a few years now & love’m. Recently came in very handy when I heard them go off at 2:30 am...looked outside to see 2 figures standing at my car..once my outdoor light went on the ‘hoodlums’took off. (These are a little sensitive to critters and wind but, over all no complaints!)",
      "rating": 5.0,
      "verified": true,
      "author": "DBosco",
      "helpful_votes": 0,
      "publication_date": 20180526
    },
    {
      "title": "Great price for some peace of mind",
      "text": "We purchased these because we have heard voices on our back carport very late at night. We set it up in 2 different directions. It has given us peace of mind to know that the alarm will go off to alert us if anyone comes near our carport. We also set the alarm close to interior of our back door to help deter if someone came up while we are not home- they could hear the alarm going off. We leave on all day everyday- and it works when we walk up or drive up and has not thrown any false alarms. Great price for some peace of mind.",
      "rating": 5.0,
      "verified": true,
      "author": "Commandress",
      "helpful_votes": 0,
      "publication_date": 20170814
    },
    {
      "title": "Worthless unit",
      "text": "After writing a bad review on this item , it would sound for no reason and when a vehicle came in my driveway it would not sound. The company read my review and sent me an IMPROVED unit which I received today. It is no better than the first piece of junk. Sounds off when it should not and when it should sound off it does not. Don't waste your money.",
      "rating": 1.0,
      "verified": true,
      "author": "Willie",
      "helpful_votes": 4,
      "publication_date": 20160813
    },
    {
      "title": "great motion detection",
      "text": "Arrive quick and pack nicely. It's the first alarm I bought for my home. It has been two months after I use it. this group of alarm have great motion detection. Every time people walk through or jump it will detect. I use it at night when I am sleeping and feel comfortable so far. The durability is ok for my home. I like it and still use it now. Will recommend to my friend after this.",
      "rating": 5.0,
      "verified": true,
      "author": "Ana liang",
      "helpful_votes": 0,
      "publication_date": 20180915
    },
    {
      "title": "Great deal, great price",
      "text": "Is a decent system for the money. The best range from sensor to reciever that I can get is around 150 feet and that is direct line of sight. Works great around the house. I have one on my driveway and one at my back door. Paid for itself one evening when a uninvited guest crossed into our back yard. Easy to mount, easy to move as needed. Receiver is very loud. It will wake you in the middle of the night on loud setting.",
      "rating": 3.0,
      "verified": true,
      "author": "Charles W.",
      "helpful_votes": 0,
      "publication_date": 20170902
    },
    {
      "title": "Works great. Way too loud on the \"siren\" alarm",
      "text": "Have them at the side of my house, and on my front porch. I'm using it as an intruder alarm, for anyone trying to get in the front door, or the front or basement windows. Works great. Way too loud on the \"siren\" alarm, but the lower alarm works perfect. It will wake you up, so be sure you place them at a height where animals won't set it off. My front porch alarm goes off if squirrels come on the porch. These are not expensive, but make effective intruder alarms. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "SevenMichael",
      "helpful_votes": 0,
      "publication_date": 20150711
    },
    {
      "title": "Sensitive",
      "text": "The unit is VERY sensitive. So sensitive there are more false alarms than actual arrivals. There is NO sensitivity settings or adjustments. The bright light on the sensor alerts the intruder that they have been detected.",
      "rating": 4.0,
      "verified": true,
      "author": "BraveTexan",
      "helpful_votes": 0,
      "publication_date": 20190422
    }
  ],
  "product_meta": {
    "title": "1byone Wireless Home Security Driveway Alarm, 1 Battery-operated Receiver and 2 PIR Motion Sensor Detector Weatherproof Patrol Infrared Alert System Kit",
    "description": "The 1byone driveway alarm provides a solution to alert you the moment someone enters your property. It's not only very convenient but also extremely affordable. \nWhen movement is detected, the Passive Infrared (PIR) sensor sends a wireless signal to the receiver from up to 100m/328ft away. Adjusting the receiver, you can choose to be alerted by a high or low chime or alarm tone, or instead, with just a silent LED flash. What's more, the receiver can pair with up to 50 sensors, effectively securing a large area. We offer many combinations of sensors and receivers, just choose what best fits your needs.\n\n\nTo avoid false alarms: \nDon't mount the PIR sensor in direct sunlight (as moving heat sources would trigger the PIR) or in a place affected by wind. When installing outside, it's best to mount it in a shady, protected place with minimal changing temperatures. Also, avoiding mounting on UPVC or metal doorframe surfaces which may reduce the transmission range.\n\n\nSpecifications:\nPower Supply (Receiver): DC 6 V or 1.5 V C Battery x 3 (not included) \nPower Supply (PIR Transmitter): DC 4.5 V (1.5 V AAA Battery x 3 )(not included) \nMotion detecting range: 5 - 8 m/16-26ft\nOperating range: 100m/328ft <br> Ring Volume: ≥100dB ( within 0.5 m/1.6ft)\n\n\nBox Contents:\n2 x PIR Transmitters \n1 x Receiver \n1 x Instruction Manual\n4 x Wall Plugs \n4 x Screws \nHere at 1byone, we stand by our products 100% with a 24-month warranty. A happy purchasing experience is our #1 priority and we will happily send a product replacement if any issues arise.",
    "rating": 3.9,
    "feature_bullets": [
      "Reliable Range - Communication range of up to 100m/328ft (the distance from the sensors to the receiver/alarm/chime) and detection range of the infrared sensor of approximately 5-8m/16-26ft to keep you informed and safe.",
      "User-Friendly - The alarm in the receiver has a ring volume up to 100dB, 3 mode choices (Sound/LED Flash/Sound and LED Flash) and 3 alert choices (High Volume Chime/Low Volume Chime/Alarm)",
      "Dependable Technology - Our sensor uses a state-of-the-art passive-infrared (PIR) to detect any movement within the detection zone. Perfect for long or hidden driveways to allow you just a little extra warning before guests (or intruders) arrive.",
      "Expandable - If you have more than one driveway or area you would like to monitor, you can expand this system with multiple sensors and receivers",
      "Power Supply - Both 3 x 1.5V type C batteries and the AC power adapter (not included) can be used for the receiver, but don't use them simultaneously in case the host would be burned"
    ],
    "specifications": {
      "Manufacturer": "1Byone Products Inc.",
      "Part Number": "0511-0514",
      "Item Weight": "13.4 ounces",
      "Product Dimensions": "4.72 x 4.13 x 5.51 inches",
      "Item model number": "O00QH-0514",
      "Batteries": "2 C batteries required.",
      "Is Discontinued By Manufacturer": "No",
      "Size": "1xreceiver 2x sensor",
      "Color": "2",
      "Style": "Style-1",
      "Power Source": "Battery",
      "Item Package Quantity": "1",
      "Included Components": "Wear",
      "Batteries Included?": "No",
      "Batteries Required?": "Yes",
      "Battery Cell Type": "Alkaline",
      "ASIN": "B00RCW8QS2",
      "Customer Reviews": "3.9 out of 5 stars2,133 ratings3.9 out of 5 stars",
      "Best Sellers Rank": "#697 in Home Security Systems",
      "Date First Available": "December 23, 2014"
    },
    "categories": [
      "Home Security Systems",
      "Security & Surveillance",
      "Tools & Home Improvement",
      "Electronics"
    ],
    "price": ""
  }
}