{
  "website_summaries": [
    {
      "verdict": "Space saver bags made by a trusted brand that offer a combination of useful features and a few quirks.",
      "pros": [
        "Made of thick material that holds up well over time",
        "Bags are available in different sizes and come in multi-packs",
        "Deflate with use of a vacuum to compact sizes that fit in tight spaces"
      ],
      "cons": [
        "Smaller bags may not work with all vacuums",
        "Bags tend to leak air"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Buy a different brand!",
      "text": "4/5 were defective. I’m incredibly disappointed. I bought several of these bags & the brand I had never heard of worked out fine. I needed all of the bags- so I’m annoyed that these didn’t work. They would just reinflate within an hour after I sealed & vacuum compressed them.",
      "rating": 1.0,
      "verified": true,
      "author": "Holl Pow",
      "helpful_votes": 20,
      "publication_date": 20190101
    },
    {
      "title": "THE BAGS DON'T ALL WORK!",
      "text": "VERY DISAPPOINTING BECAUSE MOST OF THE BAGS DID NOT WORK. THE ONES THAT DID WORK WERE WONDERFUL, BUT IT WAS TERRIBLE WITH THE ONES THAT DID NOT. I PACKED ALL OF THE BAGS ONLY TO FIND OUT THE NEXT DAY THAT MORE THAN HALF OF THE BAGS INFLATED AGAIN. I HAD TO REPACK EVERYTHING THAT WERE IN THE INFLATED BAGS. A NIGHTMARE AS I HAD MANY BAGS AND CLOTHES THAT I WAS WORKING WITH. I'M SURPRISED THAT ZIPLOCK DOES NOT MAKE A BETTER PRODUCT BEING THAT THEY HAVE SUCH A GOOD REPUTATION.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 11,
      "publication_date": 20181222
    },
    {
      "title": "Glorified trash bags",
      "text": "I just used these to move across the country. In a matter of four days in the car, every bag was reinflated. These didn’t stay compacted at all, so in my mind these are just large expensive bags. Don’t waste your money",
      "rating": 1.0,
      "verified": true,
      "author": "...",
      "helpful_votes": 9,
      "publication_date": 20190517
    },
    {
      "title": "Doesn't fit my vacuum",
      "text": "Update: I did hear back from them and they're sending me a refund for $8.99 which is only about half what I paid plus a bunch of coupons. I'm upping the rating to four stars mostly based on customer service, I still have no idea how the product actually functions. I bought these, got them all loaded up, then discovered that the hose on my vacuum is smaller than the bag will support. So they're basically useless. And my vacuum is a Hoover, it's not like I have some weird off brand vacuum cleaner. I sent them an email, if they make this right I'll adjust the rating but for now, zero stars.",
      "rating": 4.0,
      "verified": true,
      "author": "Audible Reader",
      "helpful_votes": 0,
      "publication_date": 20200522
    },
    {
      "title": "Love these!!",
      "text": "This is the smaller of the 2 bags. There's 30 lg and xlg t-shirts in this. Got a lot of things out of boxes and compacted, so I have some extra room. Took seconds to suck the air out and made with strong plastic.",
      "rating": 5.0,
      "verified": true,
      "author": "vl merchant",
      "helpful_votes": 4,
      "publication_date": 20191230
    },
    {
      "title": "Good enough",
      "text": "Doesn't vacuum down as much as I thought, but it does seem to be holding out the air. I was very careful opening it based on other reviewers saying it ripped at the ziplock. It seems thin and if you are packing hard stuff around it I could see it getting punctured easily. So far I have had it vacuumed for a week and it looks the same so no leaks.",
      "rating": 5.0,
      "verified": true,
      "author": "Brad Newman",
      "helpful_votes": 2,
      "publication_date": 20200321
    },
    {
      "title": "DO NOT BUY THESE!!  WILL NOT STAY SEALED.",
      "text": "Would NOT stay sealed!! Sealed perfectly at first but lost the seal just laying on my bed before they had been moved. It took about 10 minutes until all the seal was gone. I needed these for a move from Georgia to Florida and ended not being able to use them. I waited too long to start a return or I would have returned them--I was really busy with trying to get things settled and unpacked so it's my fault I can't return. Guess I'm stuck with junk!! I bought several boxes/sizes of these bags and had problems with bags from MORE than one box so I know that it wasn't just a problem with only one of the boxes.",
      "rating": 1.0,
      "verified": true,
      "author": "Robyn Still",
      "helpful_votes": 6,
      "publication_date": 20161010
    },
    {
      "title": "Do what they're supposed to do, and do it well",
      "text": "I got these to help me pack stuff for a semester abroad. They didn't really leak at all while in transit, they were easy to use, and it was incredible just how much more space I had once I took all the air out of everything. I definitely recommend these both for storage and travel. (Just remember to weigh your bags if you're going to be flying!)",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth R",
      "helpful_votes": 2,
      "publication_date": 20191114
    },
    {
      "title": "Wow wow wow!!",
      "text": "I’ve heard about these for years! Always wanted some but my mom always said they were a hoax. I watch a lot of youtube videos and came across one that had these in it. I was sold. Turns out, they are amazing! I am saving so much space now!! My linen closet was so full before. I literally had to force the door shut because of all the blankets and sheets in there. Now I have extra space so I can add more in there! Don’t know if that’s necessarily a good thing 😅😂",
      "rating": 5.0,
      "verified": true,
      "author": "Linsey Sousa",
      "helpful_votes": 0,
      "publication_date": 20200317
    },
    {
      "title": "but overall I'm pleased. Yes",
      "text": "In one bag I was able to get a large set of King size flannel sheets with 4 pillow cases as well as a queen size set of sheets with 4 pillow cases, and in the other bag I was able to get a queen size quilt and a queen size cotton blanket. I did have to try more than once with the arrangement of the items to get them to seal up in a shape that was conducive to fitting in the canvas bag, but overall I'm pleased. Yes, the canvas bag was a tight fit for all I had in these bags but I also had more in them than technically advertised. Would purchase again.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelsey",
      "helpful_votes": 2,
      "publication_date": 20180216
    },
    {
      "title": "THEY’RE AWESOME",
      "text": "These bags are great for traveling when you’re tight on space. The bags hold a lot and you might struggle a bit getting all your items in but all the bags seams and closure holds well. In this photo there’s 1 queen comforter, 2 decorative pillows, 2 throw blankets, 1 body pillow, and ALL my work pants.",
      "rating": 5.0,
      "verified": true,
      "author": "Kallie",
      "helpful_votes": 2,
      "publication_date": 20200514
    },
    {
      "title": "WARNING, slow leak!",
      "text": "WARNING, these bags have a slow leak! If you do choose to purchase, I suggest testing them as soon as they arrive and keeping an eye on them for a few weeks. After filling the bag as instructed and ensuring the seal was completely closed, I was able to easily remove the air and the contents compressed nicely. I packed it in the closet under a few other items. Within a few weeks, the closet was a mess due to this bag expanding with air. I'd return them but the return deadline has passed. I do like the square shape so gave it one star.",
      "rating": 1.0,
      "verified": true,
      "author": "🙅🏻 Me",
      "helpful_votes": 3,
      "publication_date": 20170210
    },
    {
      "title": "great space saver, really works",
      "text": "i live in florida, but i used to live in boston. as you can imagine i have a crap ton of winter wear i can't bear to part with but really, small closet space and they were just taking up space. these and the comforters that i keep for backups (i have 3 i cycle through) and these bags were a godsend. they store things perfectly and are now on the much abandoned top shelf of my closet i'm too short to reach without a stepladder. now i have room in my closet for all my clothes.",
      "rating": 5.0,
      "verified": true,
      "author": "Cyn's Workshop",
      "helpful_votes": 0,
      "publication_date": 20180414
    },
    {
      "title": "Good at price point, I had some issues though-",
      "text": "They are good given the price point. My issues were the following: (1) the vacuum seal valve may not properly fit your vacuum hose (it was too big for ours), (2) our box sent was not new (it had been opened), and (3) the fine print indicated that one of the six bags (the travel size) may be a vacuum space-saver valve or a roll-and-seal design, which was disappointing as I was expecting all six to have the vacuum space-saver valve.",
      "rating": 3.0,
      "verified": true,
      "author": "R K",
      "helpful_votes": 0,
      "publication_date": 20200830
    },
    {
      "title": "Holds more than advertised",
      "text": "Holds a greater amount that manufacturer claims! My GF ignored, no, didn't even follow the \"suggested\" capacity and these bags still held up great. The rollable suitcase ones were less than accommodating but it didn't matter since we got so much more in the standard ones. Surprised there was very little air loss since we overfilled too!",
      "rating": 5.0,
      "verified": true,
      "author": "Dan Phillips",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "Dont buy :( break easy",
      "text": "These suck!!!! Dont buy zipper part breaks instantly :( reallyyyyy disappointed :( wont buy again :( !!!",
      "rating": 5.0,
      "verified": true,
      "author": "LIL",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "Great!!!",
      "text": "I have tried other brands that come with more bags and they will work 1 time, you can't reuse them. I still have other Ziplocks back from years ago that still work as good, hopefully these last as long since the quality of the bag are very thin.",
      "rating": 5.0,
      "verified": true,
      "author": "ruth rios",
      "helpful_votes": 0,
      "publication_date": 20200721
    },
    {
      "title": "Awful Buy. Rip So Easily!!",
      "text": "SUPER DISAPPOINTED. These space bags tear so easily. Obviously, if there's a tear, they can't do the job they are intended to do. If you want to use these, make sure you don't have cats, dogs, boyfriends, girlfriends, pointy jewelry, pointy shoes, furniture, or anything else that could possibly harm them even in the same room as them! They were such a waste of money and this was not the only package that I purchased. I feel so ripped off.",
      "rating": 1.0,
      "verified": true,
      "author": "Danielle",
      "helpful_votes": 2,
      "publication_date": 20160905
    },
    {
      "title": "Satisfied",
      "text": "We purchased these to store winter coats and some pillows. Easy to use and work great.",
      "rating": 5.0,
      "verified": true,
      "author": "JKTourle",
      "helpful_votes": 0,
      "publication_date": 20200612
    },
    {
      "title": "Lock Didn't last long",
      "text": "They r good, I tried to pack comforters on the big ones while we were moving. But their zip doesn't seem to be sturdy enough to last after one use. When I opened them after moving, the lock came out.",
      "rating": 5.0,
      "verified": true,
      "author": "Nishi",
      "helpful_votes": 0,
      "publication_date": 20200909
    },
    {
      "title": "Wonderful",
      "text": "As a 90’s baby watching the commercials for Space Bags on repeat in the early 2000’s- sucking the air out of these brought me an ungodly amount of joy that they do in fact work just as good as I always thought they would.",
      "rating": 5.0,
      "verified": true,
      "author": "Tacobell Queen",
      "helpful_votes": 0,
      "publication_date": 20200425
    },
    {
      "title": "Great!",
      "text": "I was pleasantly surprised that Space Bags live up to what I've heard for YEARS about them. So much stuff can fit, and they get so small! I put a body pillow in for over a week to test it for moving and am still waiting to see how it does once I open the bag, but it's looking good.",
      "rating": 5.0,
      "verified": true,
      "author": "D.M.",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "Nice bags but there should be a better QC",
      "text": "I use these bags a lot and in general I like them, but in this package 2 bags out of the 6 were faulty and they re-inflated shortly after I had packed them. The company should have better quality control.",
      "rating": 2.0,
      "verified": true,
      "author": "VBM",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "Served purpose",
      "text": "We bought these to shrink stuffed animals down during a move. They were in use for one week; sitting in an empty bedroom, then loaded into a trailer on a soft blanket so they wouldn't be torn. When they arrived 2000 miles later, they were full of air and not shrink down. I'm not sure if elevation over a mountain pass caused a problem or what but we were unable to shrink them down again. We have other's we've used for months and they last a while (6 ish months before they started expanding) assuming they aren't moved and just sit.",
      "rating": 3.0,
      "verified": true,
      "author": "Kendall",
      "helpful_votes": 0,
      "publication_date": 20151120
    },
    {
      "title": "An RV staple",
      "text": "With space at a premium in an RV, space bags are an excellent way to store clothing, bedding, and blankets. I have always had luck with this brand and I am not disappointed with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "MNL",
      "helpful_votes": 0,
      "publication_date": 20200612
    },
    {
      "title": "Space bags are the best!",
      "text": "This size fits so much!!!! I fit a queen size down comforter in there with EXTRA room! and the storage tote is great!",
      "rating": 5.0,
      "verified": true,
      "author": "Maddie",
      "helpful_votes": 2,
      "publication_date": 20190103
    },
    {
      "title": "Great",
      "text": "These are awesome but not sure how likely I would be to use them for travel. They don't hold THAT much so be mindful of that. I will need to buy more for my larger blankets but other than that they're great and easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "I'm disappointed, won't buy again",
      "text": "Box states these are cubes but they are not, they are the regular shaped bags, The extra large doesn't hold the air. I'm disappointed, won't buy again. These kind of bags were fantastic when they first came out as Space Bags not sure what has happened over the years but they are hit and miss now all the time.",
      "rating": 2.0,
      "verified": true,
      "author": "K",
      "helpful_votes": 0,
      "publication_date": 20180114
    },
    {
      "title": "4 out of 5 space bags worked",
      "text": "I just bought the set of space bags and put them to use today. 4 out of 5 bags (not including the travel bag) worked as advertised. One of the medium-sized bags, however, can't seem to make a full seal. I heard the air flowing through the bag after making the seal and saw that it started to re-inflate even though the seal looked to be correct. Then I opened the bag and started over, only to have the same result. I am happy so far with the bags that worked, this one bag continues to re-inflate.",
      "rating": 4.0,
      "verified": true,
      "author": "leandra d",
      "helpful_votes": 0,
      "publication_date": 20200328
    },
    {
      "title": "Not a CUBE",
      "text": "I am confused how ziplock is able to be so drastically misleading when it comes to this ‘cube’ assuming the bag would be in the shape of six equal squares. When I opened the two cubes it appears there is a flat bottom to one of the other ziplock bags I purchased earlier. I was hoping a true cube would have fit my kids’ foam chair in the opening but these bags have the exact same opening as one of the vacuum bags. All in all, hopes were high, but item is certainly not a cube.",
      "rating": 1.0,
      "verified": true,
      "author": "Emily Dobbs",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "Value and durability with an airtight seal",
      "text": "Best bags i have bought for winter clothing storage. Used these when i had a clothes moth problem along with moth balls and they resolved the problem. No more moths. Also a very inexpensive price compared to in store prices for the same item. Great item at a great price and does the job its supposed to do!",
      "rating": 5.0,
      "verified": true,
      "author": "TranquilOne",
      "helpful_votes": 0,
      "publication_date": 20181216
    },
    {
      "title": "LOVE THESE",
      "text": "Great for storing summer winter clothing. Water proof and makes a big load so small!",
      "rating": 5.0,
      "verified": true,
      "author": "lisa",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "Get spacesaver brand",
      "text": "This is the second set (out of only 2) of ziplock space bags that hasn't worked for me. I have tried again and again to decrease the amount in the bag, seal repeatedly and vacuum out air but a day later the bag will be inflated again. Save your self the headache and go with spacesaver brand. It may be a few dollars more, but definitely worth it- especially with their warranty.",
      "rating": 1.0,
      "verified": true,
      "author": "Deep",
      "helpful_votes": 0,
      "publication_date": 20180206
    },
    {
      "title": "Try at your own risk",
      "text": "I really like these but one of mine had A tiny hole I had to patch it up With tape. A little disappointed but I didn’t want to go through the return process I will buy more but probably not from here",
      "rating": 4.0,
      "verified": true,
      "author": "p.marst",
      "helpful_votes": 0,
      "publication_date": 20200306
    },
    {
      "title": "One of the bags has no vacuum seal",
      "text": "What the product listing doesn't state is one of the bags has no vacuum seal at all. It's just a normal bag that you squeeze the air out of. Very misleading.",
      "rating": 2.0,
      "verified": true,
      "author": "Wheeler",
      "helpful_votes": 2,
      "publication_date": 20180621
    },
    {
      "title": "One leak",
      "text": "Are used a few of the bags one kept leaking I kept vacuuming it out but no go so The bags that worked there still OK just disappointed that one wasn’t.",
      "rating": 4.0,
      "verified": true,
      "author": "Falcon",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "The seal never holds",
      "text": "I follow all of the directions for this product including not overfilling the bag. But a week later I look in my closet and the seal is inevitably broken. The freshness gone from the clothing.",
      "rating": 2.0,
      "verified": true,
      "author": "Katherine E. Morrison",
      "helpful_votes": 0,
      "publication_date": 20200206
    },
    {
      "title": "X Large Ziploc Space Bags were the exact size needed ...",
      "text": "X Large Ziploc Space Bags were the exact size needed to fit a comforter and/or curtains. After a little bit of arranging, both bags fit into the tote which helps them stay tucked away and out of sight.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20170907
    },
    {
      "title": "I've used different brands of this before, and they ...",
      "text": "I've used different brands of this before, and they never stayed sealed - always ended up full size again. Used this for a giant down comforter to store for the summer, and I was able to fit it neatly under my bed...with room to spare! When I do my spring (or summer) cleaning, I'll be getting more to save room and keep things more organized - can't wait to order again!",
      "rating": 5.0,
      "verified": true,
      "author": "ShaunnaH",
      "helpful_votes": 4,
      "publication_date": 20170421
    },
    {
      "title": "Compact",
      "text": "These were very helpful for packing away winter clothes and blankets as well as for condensing what I put in my suitcase when I travel.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200729
    },
    {
      "title": "Great space-saving solution",
      "text": "Great space saving solution. Fit one full large laundry bag of men’s winter clothing in the x-large bag(sweatpants, sweatshirts, t-shirt’s, socks, underwear). In the large bag I was able to fit four pairs of size 12 men sneakers/shoes.",
      "rating": 5.0,
      "verified": true,
      "author": "Benjamin T Joyce",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "Good for what I bought it for.",
      "text": "It works, but becareful when you’re putting stuff in there.... you could easily poke a hole with your finger nail. :(",
      "rating": 5.0,
      "verified": true,
      "author": "Alex Z",
      "helpful_votes": 0,
      "publication_date": 20201016
    },
    {
      "title": "These are the only Spacebags I use. I've been ...",
      "text": "These are the only Spacebags I use. I've been buying them since they first came out, before they had a zip lock on them, probably 20 years ago. In my experience about 50% of them leak. I now have 6 of the totes and they have never leaked.",
      "rating": 5.0,
      "verified": true,
      "author": "GeminiReviewer",
      "helpful_votes": 7,
      "publication_date": 20150814
    },
    {
      "title": "Amazing for traveling!",
      "text": "When I have to travel lightly, I put the Ziploc bag in the suitcase, pack the bag and vacuum out the air. It confirms to the suitcase and makes it so much easier to fit the must haves for my trip.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "Wouldn't buy again",
      "text": "The travel bag is good for one use and thats all you get. Easily ripped and the zip mechanism doesn't stay well. The larger bags are just as delicate so be careful. Wouldn't recommend for frequent use or if you plan on having them for a while.... great if you use them once to move.",
      "rating": 3.0,
      "verified": true,
      "author": "C.W.",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "Great storage bags.",
      "text": "I liked the vacuum sealed bags but the one that you manually have to squeeze our the air isn't the greatest! I used them to pack my mother in law's luggage.",
      "rating": 5.0,
      "verified": true,
      "author": "Steven",
      "helpful_votes": 0,
      "publication_date": 20200120
    },
    {
      "title": "Worth every penny",
      "text": "They are pretty expensive but I needed it for travel and it served its purpose. Easy to use. It is long lasting so it’s worth it’s price. Kept all liquids from spilling out. Able to take large items in more compact manner.",
      "rating": 5.0,
      "verified": true,
      "author": "Susy",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "Ok vacuum seal bags",
      "text": "Ok product. You need a vacuum despite what the description may say. The travel bag that does not use a vacuum seal is a joke! However the other bags are decent",
      "rating": 3.0,
      "verified": true,
      "author": "Tiffany Richardson",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "Travel bag is, eh. Other bags are good.",
      "text": "The bags are overall very handy. The travel bag is odd because your clothes end up scrunched at the bottom after you roll the air out. I did have one bag get a whole in it after the 2nd time of vacuum sealing it. I assume the hole was from a zipper or button. I tried to tape it up but I couldn't get it to work correctly after. Though overall I'm satisfied with them",
      "rating": 4.0,
      "verified": true,
      "author": "SHELBY",
      "helpful_votes": 0,
      "publication_date": 20200221
    },
    {
      "title": "Good for moving and traveling.",
      "text": "I got all of my clothes and bedding packed . They are very good to use for traveling and moving.",
      "rating": 5.0,
      "verified": true,
      "author": "Dorothy Sullivan",
      "helpful_votes": 0,
      "publication_date": 20200910
    },
    {
      "title": "Pricey but great for a move",
      "text": "These space bags are a great idea. We are moving and I ordered a bunch of them. The cubes really hold a lot of items. Most of the bags hold the suction, but for every 10 that you buy 1-2 will not work properly. They are costly and the Ziploc brand works the best. Sure did save space for moving and protected many keepsakes in the move.",
      "rating": 4.0,
      "verified": true,
      "author": "Frosti",
      "helpful_votes": 2,
      "publication_date": 20160313
    },
    {
      "title": "Space lock Bags",
      "text": "These bags are great for storage I use them to for blankets and sheets to keep them smelling fresh ready to use. Also they are great space savers. No",
      "rating": 5.0,
      "verified": true,
      "author": "Terrie",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Took forever to arrive",
      "text": "It is a good product to use for storage especially if you have a lot of clothes or even home items such as blankets and etc. So yeah overall good product but took forever to arrive and I thought it was prime...",
      "rating": 3.0,
      "verified": true,
      "author": "Michl Ampo",
      "helpful_votes": 0,
      "publication_date": 20200711
    },
    {
      "title": "covered in something sticky",
      "text": "Gross box was smashed and covered in what I hope was dish soap it was sticky and smelled like soap",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200928
    },
    {
      "title": "Our Vacuum didn't fit",
      "text": "We packed a mattress pad heater to be left in storage in Florida. When the Vacuum didn't fit we squeezed the bag and it seemed to work. It's in a box in storage so I hope it doesn't leak.",
      "rating": 4.0,
      "verified": true,
      "author": "Bob Brown",
      "helpful_votes": 0,
      "publication_date": 20190429
    },
    {
      "title": "Arrived Open and Used 😐",
      "text": "The box of bags was totally open, and the bags inside are completely crumpled and even ripped in some places. They have clearly been either used, or they are counterfeit. Either way, not useable. Extremely disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200909
    },
    {
      "title": "One did not work straight from the box.",
      "text": "Packed these straight from the box, one of the medium sizes did not work immediately and started filling with air again after vacuuming. Moving soon and do not have time to send them all back and wait for a replacement, otherwise I would not be keeping them. I had some a few years ago that were much thicker material. These are thin and flimsy and feel like they could be easily torn with a fingernail.",
      "rating": 1.0,
      "verified": true,
      "author": "Michael Gilligan",
      "helpful_votes": 0,
      "publication_date": 20200510
    },
    {
      "title": "No humidity or moth can touch my belongings.",
      "text": "Intimidated at first as the bags looked huge. Great for feather & other blankets & pillows. Assured that mystuff will be safe from humidity & moths.",
      "rating": 5.0,
      "verified": true,
      "author": "nancy ",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "Very good",
      "text": "Very good! This is the second time I buy it. We have a lot of clothes. This bags makes us have more rooms for storage.",
      "rating": 5.0,
      "verified": true,
      "author": "Sally",
      "helpful_votes": 0,
      "publication_date": 20200614
    },
    {
      "title": "Great Idea- Great Product",
      "text": "I loaded up both the xl and the large with delicate quilts that I don't like to leave out all the time- by vacuum sealing it I feel much better than to just put in a tote. These bags keep everything nice and airtight and plus I was able to fit baby stuff for future children nice and safe too. It was relatively easy to load the bags myself and then vacuum them out- open them and realign the linens and the re-vacuum them to just the way I wanted them to squish tight. Very pleased with the product!!",
      "rating": 5.0,
      "verified": true,
      "author": "Marianne",
      "helpful_votes": 0,
      "publication_date": 20140308
    },
    {
      "title": "Do not stay sesled",
      "text": "These bags do not stay sealed at all, my things were not vacuum sealed when I arrived at my destination. Return window was closed so I did not return them but I WILL NOT buy from ziplock again that’s for sure.",
      "rating": 1.0,
      "verified": true,
      "author": "michelle  c",
      "helpful_votes": 0,
      "publication_date": 20200822
    },
    {
      "title": "Easy to use",
      "text": ".Must have a vacuum with good suction. Very convenient to buy on line as stores like Target do not have available.",
      "rating": 5.0,
      "verified": true,
      "author": "A 68 old Grammy",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "The concept is good, but they don't work as effective when you ...",
      "text": "The concept is good, but they don't work as effective when you try to reuse. I do prefer the cubes over the other vacuum bags. They lay flatter and store better. If you haven't tried them before, its worth a shot and it may work better for you. It's better than trying to store bulky items without a vacuum bag.",
      "rating": 3.0,
      "verified": true,
      "author": "BeMo",
      "helpful_votes": 0,
      "publication_date": 20161008
    },
    {
      "title": "Works fine.",
      "text": "Works fine, although one of the bags is slightly defective.",
      "rating": 4.0,
      "verified": true,
      "author": "CTY",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "Large bags doesn’t seal.",
      "text": "I’m pretty disappointed because I have come to find that my large bag doesn’t not keep air inside and I have had to reseal it twice while the smaller sizes are holding just find.",
      "rating": 2.0,
      "verified": true,
      "author": "Jade",
      "helpful_votes": 0,
      "publication_date": 20190310
    },
    {
      "title": "Amazing !",
      "text": "These are great for value ! As first time user it is pretty funny proof and you can fit a lot!",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle Marilyn",
      "helpful_votes": 0,
      "publication_date": 20200529
    },
    {
      "title": "Great Product",
      "text": "Great product- worth the $$ SKIP THE AMAZON BRANDED ONE. I tried the Amazon-branded one and regretted it.",
      "rating": 5.0,
      "verified": true,
      "author": "SLYNN",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "Great for seasonal wardrobe storage.",
      "text": "I have tried, Spacebags brand and these are much better.",
      "rating": 5.0,
      "verified": true,
      "author": "Rwhite",
      "helpful_votes": 0,
      "publication_date": 20200425
    },
    {
      "title": "RETURN",
      "text": "Doesn’t hold after suction, starts filling back up with air slowly but immediately. Not good quality, doesn’t do what the product promises. I do not recommend.",
      "rating": 1.0,
      "verified": true,
      "author": "Anissa P",
      "helpful_votes": 0,
      "publication_date": 20190804
    },
    {
      "title": "Space saving!",
      "text": "These bags really save me space! I use them for keeping all my fleece blankets clean and compact in my Airstream trailer.",
      "rating": 5.0,
      "verified": true,
      "author": "Jan Canfield",
      "helpful_votes": 0,
      "publication_date": 20190629
    },
    {
      "title": "You'll get your $'s worth!",
      "text": "You'll get your $'s worth using these year after year. Storage saver.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen H",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "Great for long-term and seasonal storage.",
      "text": "These are great!! Used for storing baby clothes, blankets and huge comforters. The XLarge even fit a King comforter!!",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel Lawton",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "Great product.",
      "text": "I had the original space bags, I found those hard to create an air tight seal. These are 10X better, easy to fill and holds a seal really well, also more durable...",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "works great once you get a good seal",
      "text": "We recently moved and used the space bags to fit more clothes and bedding type items into our suitcases. The space bags worked great on shrinking pillows, comforters, and stuffed animals. It was sometimes difficult to get a good seal. The white plastic zipper was only good for lining up the zipper. Then I would recommend running your fingers over the zip locks several times to ensure a seal. We would then vacuum the air out and wait a day to check to see if air leaked in. Once you get a good seal it works great.",
      "rating": 4.0,
      "verified": true,
      "author": "Robert Wutka",
      "helpful_votes": 2,
      "publication_date": 20140709
    },
    {
      "title": "Great buy!",
      "text": "Sister wanted one to store her wedding dress. Reduced air space (bulkyness) by alot! Would def buy again!",
      "rating": 5.0,
      "verified": true,
      "author": "Francis Frost",
      "helpful_votes": 2,
      "publication_date": 20170917
    },
    {
      "title": "Worked great, plan to buy more",
      "text": "Worked great, plan to buy more. The tote is the perfect size to fit under the bed. I used it for winter bedding storage, so a king down comforter went in one and the other held various duvet covers and table linens.",
      "rating": 5.0,
      "verified": true,
      "author": "Heather Marquez",
      "helpful_votes": 0,
      "publication_date": 20170625
    },
    {
      "title": "better than nothing",
      "text": "These bags hold a lot. You would be surprised how much clothing I fit into the large bag. But it loses its vacuum within a few days so I have had keep passing with my vacuum every few days to make sure it stays tight. On the upside it's better than nothing because the clothes are in a compact space and stored away. And yes the bag does have a cubed shape, just make sure to place the bag upright when filling with your items",
      "rating": 2.0,
      "verified": true,
      "author": "Shirelle",
      "helpful_votes": 0,
      "publication_date": 20150722
    },
    {
      "title": "Can't always close with tab",
      "text": "Zips sometimes come off allowing for suction to be lost a bit.",
      "rating": 4.0,
      "verified": true,
      "author": "Sara Adams",
      "helpful_votes": 0,
      "publication_date": 20191126
    },
    {
      "title": "Not cubed shaped at all",
      "text": "I wanted to use these for throw pillows. The pillows are square the bag is not. You can't put stuff flat on the bottom unless it's smaller than 9.5\" x 11\". The bag is a little bigger than that but the rest of the width is triangle shaped. Overall it's 9.5\" x 19\". The bag is 19\" tall so it's more like a narrow rectangle than a cube.",
      "rating": 1.0,
      "verified": true,
      "author": "Bee",
      "helpful_votes": 0,
      "publication_date": 20150605
    },
    {
      "title": "Don't waste your money",
      "text": "Would not suck down the item that was inside stayed partly full. Then while picking up to store away the bag top completely ripped off leaving it open with no top. Using now for recycling cans",
      "rating": 1.0,
      "verified": true,
      "author": "Di-Anna Wolcott",
      "helpful_votes": 0,
      "publication_date": 20191120
    },
    {
      "title": "Not new style did not hold at all",
      "text": "I thought they would be new style. Was old like way old even look old did not hold air not happy at all with product I bought same bags over 3 year ago at store and nothing like these very dissapointed",
      "rating": 3.0,
      "verified": true,
      "author": "melissa",
      "helpful_votes": 0,
      "publication_date": 20200416
    },
    {
      "title": "So useful!",
      "text": "These bags are great! I used them to pack my clothes and other linens during a massive house renovation where I had to move all my things and move out. They are easy to use and protect my stuff.",
      "rating": 5.0,
      "verified": true,
      "author": "Leigh Davis",
      "helpful_votes": 0,
      "publication_date": 20190824
    },
    {
      "title": "Super easy holds long time",
      "text": "I love vaccuum sealing stuff. Working great for storing in storage unit.",
      "rating": 5.0,
      "verified": true,
      "author": "Kenny J.",
      "helpful_votes": 0,
      "publication_date": 20190810
    },
    {
      "title": "Perfect for organizing",
      "text": "Bought to organize my closet and that was about 2 months ago. Still flat as when I put them in.",
      "rating": 5.0,
      "verified": true,
      "author": "Ariana",
      "helpful_votes": 0,
      "publication_date": 20190531
    },
    {
      "title": "not the best",
      "text": "after sealing it and vacuuming it closed noticed air escaping",
      "rating": 3.0,
      "verified": true,
      "author": "Raiderguy21",
      "helpful_votes": 0,
      "publication_date": 20200707
    },
    {
      "title": "Great to have!",
      "text": "I’ve been buying space bags for years! They’re great at holding my stuff!",
      "rating": 5.0,
      "verified": true,
      "author": "Emily R.",
      "helpful_votes": 0,
      "publication_date": 20200609
    },
    {
      "title": "Great for extra blankets",
      "text": "Work great for storing extra blankets or pillows. I store them under my bed with plenty of room to spare, since they shrink down so small.",
      "rating": 5.0,
      "verified": true,
      "author": "Alexis Askea",
      "helpful_votes": 0,
      "publication_date": 20201002
    },
    {
      "title": "The best",
      "text": "I love space bags, they are really easy to use and a great alternative to bulky plastic bins.",
      "rating": 5.0,
      "verified": true,
      "author": "Jess",
      "helpful_votes": 0,
      "publication_date": 20190423
    },
    {
      "title": "do not buy",
      "text": "the suction does not stay!! i have bought this before and they had been fine...but not this time",
      "rating": 1.0,
      "verified": true,
      "author": "Eva Canovas",
      "helpful_votes": 0,
      "publication_date": 20190820
    },
    {
      "title": "Could’ve been 5 stars",
      "text": "All of the bags are exceptional when air is suctioned out. One of the bags didn’t hold the seal.",
      "rating": 3.0,
      "verified": true,
      "author": "Scottie Carpenter",
      "helpful_votes": 0,
      "publication_date": 20191105
    },
    {
      "title": "Camping necessities",
      "text": "Excellent use for a long camping trip in a small space.",
      "rating": 5.0,
      "verified": true,
      "author": "Teresa",
      "helpful_votes": 0,
      "publication_date": 20190714
    },
    {
      "title": "Really reducing space in bags.",
      "text": "I used two of them on my last trip to Canada. 2 sweaters were reduced to minimum space in my bag. I have many of these in many sizes. Fully recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Camilo Guerra, Peru",
      "helpful_votes": 0,
      "publication_date": 20180319
    },
    {
      "title": "Great seal!",
      "text": "5 stars!! Works so well. I used the hefty brand before this and those never held a seal. 9 months later and these bags are still as air tight as when I first sealed them. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Alex Whisler",
      "helpful_votes": 0,
      "publication_date": 20201003
    },
    {
      "title": "The 5 actual vacuum bags work great. The 1 suitcase bag that you have to ...",
      "text": "The 5 actual vacuum bags work great. The 1 suitcase bag that you have to roll the air out of was quite useless as it ripped open as soon as rolling began. Try to find another package for sale where you only get the vacuum bags and none of the roll up bags.",
      "rating": 3.0,
      "verified": true,
      "author": "mjc0961",
      "helpful_votes": 0,
      "publication_date": 20160727
    },
    {
      "title": "The ones that worked were GREAT! But only about half of them worked",
      "text": "The ones that worked were GREAT! But only about half of them worked. I got them to use when moving, and so one I vacuum sealed the bags,and put them where I wanted them to go, it was fine it they inflated a bit since they were in a tight space and couldn't really move, but I do wish more of them would've worked better.",
      "rating": 2.0,
      "verified": true,
      "author": "Christi K",
      "helpful_votes": 0,
      "publication_date": 20140728
    },
    {
      "title": "Terrible product",
      "text": "This bag had a hole in itnthe very first time I tried to use it. I vacuum sealed it and less than a week later (due to a slow leak) the bag was completely inflated again, wasted that money completely",
      "rating": 1.0,
      "verified": true,
      "author": "Jess",
      "helpful_votes": 0,
      "publication_date": 20190619
    },
    {
      "title": "Awesome and easy!",
      "text": "Love this product! I managed to fit a lot into my suitcase. The bags held up throughout my trip and held air out. Well-priced!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190113
    },
    {
      "title": "Good value",
      "text": "The bags were not too thick, but it did not seem to take away from the quality of the bag itself. They stayed compact and the seal did not leak air in once closed like some of the other brands I have tried did.",
      "rating": 5.0,
      "verified": true,
      "author": "Jenna",
      "helpful_votes": 0,
      "publication_date": 20200815
    },
    {
      "title": "Fair value",
      "text": "Most of the bags worked just fine. They compressed clothing and blankets well. For some, it didn't seem to really seal. However, that could have been my fault.",
      "rating": 4.0,
      "verified": true,
      "author": "SaraEN",
      "helpful_votes": 0,
      "publication_date": 20200917
    },
    {
      "title": "Doesn't Stay Condensed",
      "text": "I ordered this set a little over a month ago. I just went to use one of the cubes, vacuumed the air out, and found it re-inflated less than a day later. Tried it again with the same result. I've used Space Bags in the past, without issue, but these were a letdown. And of course it's too late to return them now. I'm super disappointed.",
      "rating": 2.0,
      "verified": true,
      "author": "jaclynn",
      "helpful_votes": 0,
      "publication_date": 20170926
    }
  ],
  "product_meta": {
    "title": "Ziploc Flat Space Bags, For Travel, Organization and Storage, Reusable, Waterproof Bag, Pack of 6 (2 M, 2 L, 1 XL, 1 Suitcase)",
    "description": "Get more out of it! Ziploc Space Bag storage bags are the leading brand in vacuum storage. Triple your storage space with Ziploc Space Bag products, available in a variety of shapes and sizes. Airtight and waterproof, these creative storage solutions are perfect for your home or on the go.",
    "rating": 4.6,
    "feature_bullets": [
      "Ideal for storing clothing or bedding. The travel bag does not require a vacuum and is a perfect fit for luggage",
      "Volume can be reduced by up to 75% to triple your storage space, depending on the items placed in the bag. Filled comforters and jackets will compress more than blankets and sweaters",
      "Airtight, waterproof & reusable",
      "It protects items from moisture, mildew, insects, odors and allergens. Vacuum-sealing drastically reduces the effects of oxidation and retards growth of mildew specifically"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "3.5 x 5.88 x 10.5 inches; 1.1 Pounds",
      "Item model number": "31810704052",
      "Date First Available": "December 12, 2014",
      "Manufacturer": "Ziploc",
      "ASIN": "B00RCMUCGG",
      "Domestic Shipping": "Currently, item can be shipped only within the U.S. and to APO/FPO addresses. For APO/FPO shipments, please check with the manufacturer regarding warranty and support issues.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S.",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Food Storage Bags",
      "Disposable Food Storage",
      "Household Supplies",
      "Health & Household",
      "Health, Household & Baby Care",
      "Paper & Plastic"
    ],
    "price": 16.99
  }
}