{
  "website_summaries": [
    {
      "verdict": "If you loathe the thought of spending hours on assembly, odds are you’ll appreciate this option’s crystal clear instructions and fuss-free set up.",
      "pros": [
        "Wide base combined with a powder coated steel frame deliver excellent stability and durability",
        "Generous height adjustments are easier to navigate than most",
        "Built-in cable management",
        "Offers both a top and middle shelf for entertainment accessories",
        "Compatible with a wide variety of VESA patterns",
        "Hassle-free assembly"
      ],
      "cons": [
        "Wheel locks have sharp edges and should be handled with care",
        "Base might be a bit wide for especially tight spaces"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "I saw some bad reviews here and lots of good reviews",
      "text": "I saw some bad reviews here and lots of good reviews. Decided to give a shot. Arrived on time in good condition. Assembly was easy. Very sturdy and the fairly large wheels work great. My 70\" LED TV (light though) mounts perfectly (larger than that would not fit). Looks and feels high quality product. Definitely not flimsy and no missing parts as some reviewers experienced. The price was great. I can't think of a better deal than this. Very satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "P. Yu",
      "helpful_votes": 28,
      "publication_date": 20161028
    },
    {
      "title": "A must have for a large TV",
      "text": "I bought this for a bedroom TV. My wife has poor vision. We have an 8 foot projector in the family room and a 55 TV inch for the second bed room which my wife uses when the projector is not running. This is amazingly sturdy. We would have no trouble moving it from room to room if needed. There is no chance of this tipping over. It might not fit your decor for a livingroom if you are particular about style but if you are looking for something sturdy to hold a large TV, this is it. You wont end up on Funny Videos because your cat tipped it over.",
      "rating": 5.0,
      "verified": true,
      "author": "jorland",
      "helpful_votes": 23,
      "publication_date": 20160618
    },
    {
      "title": "Nice and Sturdy.",
      "text": "I bought this to hold my 55\" Sony Bravia TV. It goes together fairly quickly but mine was defective - the holes were not drilled straight so the pins wouldn't align and hold the television up properly. I contacted Kanto Customer Service and they quickly identified which parts I needed and shipped them to me. The replacement part worked perfectly. Not everything is made perfectly but a company is defined by how well it resolves problems - Kanto did an excellent job here.",
      "rating": 4.0,
      "verified": true,
      "author": "J. Lucas",
      "helpful_votes": 5,
      "publication_date": 20170105
    },
    {
      "title": "Highly Recommend! Easy to assemble.",
      "text": "I absolutely love this TV Stand. It was easy to assemble and I did it all by myself. I have a 55” inch Samsung TV. I put my blu-ray and Roku on the bottom stand and my flat antenna on the top shelf. I get all my channels. Living in a studio apartment this stand is great to move my TV from one corner to another when I’m in bed or when I have guests come over. Love it! Love it! Love it! Highly recommend this product to the point I am actually taking time to write a review.",
      "rating": 5.0,
      "verified": true,
      "author": "sam2groovy",
      "helpful_votes": 7,
      "publication_date": 20180103
    },
    {
      "title": "It lets you rearrange your space again and again",
      "text": "I was going to wall mount my first large screen tv but my so talked me into this instead. Glad he did as I was able to get just the right angle from my new bed. I wanted it above my antique dresser so we got the perfect height. Only drawback was the large feet didn't quite fit beneath the dresser so I had to put the legs on wooden risers. The plus to that was the bottom drawers are easier to get into now so I love it every night. When I get the rearrange the room feeling, no remounting and covering up old mounts, just push it where it's wanted.",
      "rating": 4.0,
      "verified": true,
      "author": "Jean Delafchell",
      "helpful_votes": 0,
      "publication_date": 20190226
    },
    {
      "title": "Portable TV Stands.",
      "text": "I really like the quality and how sturdy this stand is but, there is a missing bracket that holds the TV on stand. I did call the company a message taken....Then representative returned my call and was happy to send me the missing part. This is really a nice and well built stand. Very easy to move Tv around. Very well thought out product, couldn't believe low price. Suggest you give this product a try.",
      "rating": 5.0,
      "verified": true,
      "author": "Islander",
      "helpful_votes": 4,
      "publication_date": 20160428
    },
    {
      "title": "Good Mobile TV Stand/Mount -- No major complaints",
      "text": "Had quite a few choices for which mobile TV stand to buy. Ended up getting this one based on price, shelving, and reviews. Am quite happy with the purchase, with one issue: The cable management (which was a consideration for me when buying) will not work with an HDMI cable; the head on the cable is too large to fit through the metal tubes, so I needed to use a velcro cable management tie to keep it in place and out of the way. Other than that, it's a solid purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "The Tenneys",
      "helpful_votes": 3,
      "publication_date": 20171129
    },
    {
      "title": "Great solution to mounting a tv with no walls.",
      "text": "I was cautiously optimistic I would like this solution to not having a wall to mount my tv. I LOVE this product. It’s amazingly engineered. The directions are awesome. The nuts bolts and washers are organized on pouches that are clearly marked and referred to in the directions. The production of the metal parts are high quality. I would recommend this highly to anyone considering this option.",
      "rating": 5.0,
      "verified": true,
      "author": "Kerry Dikken",
      "helpful_votes": 2,
      "publication_date": 20190119
    },
    {
      "title": "We love it",
      "text": "We closed on our new lakehouse about a month ago and started furnishing it. We didn't want to fill it up with too many electronics and too much furniture so we decided to get one of these along with with a 55\" FireTV. This we can move it around the house from the bedroom, to the living room and out to the deck in Summer to view movies etc. It's perfect and even though the base is large, it's very easy to maneuver. The casters are smooth and they don't scratch the floors. It was super simple to put together and we absolutely love it! Great purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Ana",
      "helpful_votes": 0,
      "publication_date": 20200424
    },
    {
      "title": "Perfect in my living room",
      "text": "I got this for my house when I couldn't pick an entertainment center. I reposition my TV when I lie down to get the perfect view. I can also watch TV from the kitchen. When I want to use the living room floor for something I just roll my TV into my den. The base is heavy, it's very sturdy, and cable management is easy. The only upgrade to something like this that I can think of is a way to mount my surge protector on the base. I'm using zip ties.",
      "rating": 5.0,
      "verified": true,
      "author": "Humantis",
      "helpful_votes": 0,
      "publication_date": 20180906
    },
    {
      "title": "Mobile TV stand genius!!",
      "text": "Very durable. My TV is considerably smaller than the stand is capable of holding but I wanted to try it out. Cables run nice and clean through the poles that hold the TV. Wheels around easily from one room to another. I love not having to commit to mounting it on any one wall and I can put the TV away when I need to.",
      "rating": 5.0,
      "verified": true,
      "author": "Smartypants_Monica",
      "helpful_votes": 2,
      "publication_date": 20190126
    },
    {
      "title": "Read the pamphlet carefully and look at the pictures",
      "text": "I thought it was great they included a video and a pamphlet on how to build the thing. The downside is the pamphlet shows the cable management holes facing the narrow side of the base/wheels but when you put it altogether, the video and the pamphlet end up showing the cable management holes facing the wide end of the base/wheels. No way in the world was I going to undo everything to turn it around. So... read, read again and re-read the instructions as you build it. Other than that, I love this thing. It holds my 55\" Samsung Smart TV perfectly.",
      "rating": 4.0,
      "verified": true,
      "author": "Mark A. Nau",
      "helpful_votes": 0,
      "publication_date": 20180410
    },
    {
      "title": "Mine came damaged.... but the stand itself is quite good. Holds a lot and has cable management built in.",
      "text": "So I took off two stars due to the poor hole drilling. I had issues getting wheels on, nearly completely ruining one wheel. The bottom also was crushed when it came in without any damage to the box. Besides those issues, this is actually a really nice stand! Don't let my issues with the build quality and the dent dissuade you, this was actually really nice once setup and looks real nice. The little stand under the tv is pretty sturdy and can hold quite a lot of items.",
      "rating": 3.0,
      "verified": true,
      "author": "BobOki",
      "helpful_votes": 0,
      "publication_date": 20180107
    },
    {
      "title": "A proven great mobile tv stand.",
      "text": "This is the third one I have purchased for the children’s Sunday school classes. They are continually being moved and used in other rooms. There has been not one problem with the durability or functionality of these mobile tv stands. I have installed three different sized tv’s on these stands without any problems. As long as you follow the correct order of assembly, when putting the stand together, assembly is easy.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Davis",
      "helpful_votes": 0,
      "publication_date": 20191008
    },
    {
      "title": "Maneuverable and study, but lacks options for screws",
      "text": "Mount is very nimble to move around furniture and corners. I was going to use this mount for a 65\" Sony X900H, but Kanto does not provide you with the right type of screw. One screw size is the right thread size, but too short. The other screw size is long enough, but the thread size is too thick. You'd think with the price of this mount, Kanto could provide FOUR screws that fits properly. So now I have to go to a hardware store and buy the correct screws myself. An excellent mount nonetheless, but Kanto are a bunch of cheapskates that can't provide just a little bit more of range for proper screws.",
      "rating": 3.0,
      "verified": true,
      "author": "Rylan I.",
      "helpful_votes": 0,
      "publication_date": 20201009
    },
    {
      "title": "Great tv stand",
      "text": "It went together easily. I was impressed with the fact it did not fall over while putting the tv on it. The trick is the clips need to be put on exact. If you don't have them adjusted right it will not allow the tv to clip onto the stand. I recommend 2 people to put this tv on it. After you get the clips to sit correctly this tv will not budge. I am so happy I bought this stand. It does sit out about the same as a piece of furniture but I like it. I can roll this tv to any room in the house or even outside.",
      "rating": 5.0,
      "verified": true,
      "author": "ATLGA",
      "helpful_votes": 0,
      "publication_date": 20170803
    },
    {
      "title": "An excellent option for those who need flexibility in placement of their flatscreen TV",
      "text": "The MTM65PL is a solid, well designed mobile TV stand. Though assembly took some time, the process was quite straightforward. The instructions regarding which screws to use when securing the TV to the stand were somewhat confusing; nevertheless, the manufacturer supplies ample sizes of screws and and spacers to allow mounting of many different TV sizes/VESA configurations. All in all, this mobile stand is well worth the expense.",
      "rating": 5.0,
      "verified": true,
      "author": "David Edelman",
      "helpful_votes": 0,
      "publication_date": 20191113
    },
    {
      "title": "Decent stand, a few issues",
      "text": "Stand seems sturdy enough for my 60 inch Sony Bravia TV. The main issues that I have is that the last piece that goes on the top of the TV is too short to screw on with both of the screws in the back so decided against installing it as it would be unstable. Also, really difficult to adjust height after connecting everything. I am, however pleased with the current viewing height that this stand offers.",
      "rating": 3.0,
      "verified": true,
      "author": "Random Guy",
      "helpful_votes": 0,
      "publication_date": 20180525
    },
    {
      "title": "Incredibly sturdy and well built",
      "text": "Incredibly sturdy and well built. Solid feel, easy assembly. The only down side is that the \"tray\" is relatively cheap plastic with easy-to-snap connectors. The TV assembly should connect to most TVs though I had to \"modify\" the back of my TV since it had a built-in sound-bar on the bottom that bumped out on the back and interfered with the bottom centimeter of the connector.",
      "rating": 4.0,
      "verified": true,
      "author": "S. M. Boca",
      "helpful_votes": 0,
      "publication_date": 20180530
    },
    {
      "title": "Sturdy, high quality",
      "text": "First, the TV cannot tilt, ie. it always sits straightup. Not a big deal but would be a useful feature to have. Other than that it's very study, made of high quality metals and easy enough to push around, even on carpet. The whole setup cost me about 1.5h. The base/feet is bigger than I expected. So it occupies quite a large footprint.",
      "rating": 4.0,
      "verified": true,
      "author": "Khoa",
      "helpful_votes": 2,
      "publication_date": 20160720
    },
    {
      "title": "Great stand",
      "text": "This item came packaged very well, all parts intact in perfect condition. The stand is very well-built. The bottom portion is one welded piece. So the box it came in looked like a large screen television. The stand is well-designed all holes and parts lined up perfectly and provide a very secure way to mount the television. My only complaint is that the bottom is quite large and barely fits in the corner of a room. I use the stand to roll a 50 inch LCD television out onto my patio and It just fits through a standard household door. Overall I'm very satisfied with this stand.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160720
    },
    {
      "title": "Which is a shame because it is an amazing stand. Assembly was very easy because the hardware ...",
      "text": "Full disclosure, I had to return it because it wasn't suitable for my application. Which is a shame because it is an amazing stand. Assembly was very easy because the hardware kit was organized and the only tools needed are the enclosed allen wrench and a phillips screwdriver.",
      "rating": 5.0,
      "verified": true,
      "author": "Bart",
      "helpful_votes": 3,
      "publication_date": 20170104
    },
    {
      "title": "If i can put this together anyone can",
      "text": "Assembly was slightly complex but i got it. Hardest part was lifting TV up on the mount but after that I was golden. I'll probably get another shelf for my PS4 but other than that its sleek, hides the wires in the long tubes behind the TV and is very minimalist. LOVE",
      "rating": 5.0,
      "verified": true,
      "author": "Selena P",
      "helpful_votes": 0,
      "publication_date": 20190326
    },
    {
      "title": "Great Mobile Solution For HDTV Display",
      "text": "For our application, this stand was exactly what we needed. Very sturdy, clear assembley instructions, heavy duty base for support, and excellent wheeled movement when needed. Using in a branch office conference room with a 55\" HDTV to replace an old projector for meetings/presentations. When needed can wheel this to our counter area for promotional display of video loops. Much better than mounting to the wall, as we can use it in multiple ways. Highly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "Bassman",
      "helpful_votes": 0,
      "publication_date": 20170517
    },
    {
      "title": "Looks hideous",
      "text": "This thing is hideous. I was going to return it but after wasting so much time putting it together, I figured I might as well take the lost. It takes so much space in a house, doing the total opposite of what it was suppose to do. Its more for industrial use.",
      "rating": 3.0,
      "verified": true,
      "author": "Dakota",
      "helpful_votes": 0,
      "publication_date": 20191206
    },
    {
      "title": "Solid solution to hold 65 tv and lock in place.",
      "text": "Have a 65 inch tv mounted. Using as computer monitor. Right height for desk and got for a great deal from Amazon Warehouse. All parts were in and not damaged. Packaging was messed up but in overpack box. Great solution and solid.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200509
    },
    {
      "title": "An awesome addition",
      "text": "I looked around for a while in search of a decent tv stand. Painted the bedroom and didn't want to drill holes in the walls. This product is great from sturdiness to looks. It's holding a 65\" tv and I'm not worried about it tipping over. Nice",
      "rating": 5.0,
      "verified": true,
      "author": "D. Girl",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "This stand is perfect for the place I have the TV set up",
      "text": "This stand is perfect for the place I have the TV set up. Easy to assemble. Only complaint is once you have the TV on the mount, better check where your hookups go. My TV has the hookups in the back; therefore, I can't reach them with the TV on the mount. My other TV has the hookups on the bottom of the TV so no problem. I did the assembly and mounting all my myself and I am a 60 yr old woman. Once I have someone to hold the TV off the mount, I can plug in the hookups I need and then mount the TV.",
      "rating": 5.0,
      "verified": true,
      "author": "smiffysfc",
      "helpful_votes": 0,
      "publication_date": 20170703
    },
    {
      "title": "Use caution and read reviews before you buy",
      "text": "Read the reviews and was skeptical about getting it. When I received it and unboxed it there pieces missing and some screws didnt line up. Wouldve been great but it wasn't meant to be. Returned it",
      "rating": 2.0,
      "verified": true,
      "author": "Flyboy6257",
      "helpful_votes": 0,
      "publication_date": 20180410
    },
    {
      "title": "Safe secure sturdy and easy to move from room to room",
      "text": "This stand is very sturdy and very easy to put together! It has wheels so it’s so practical to move from room to room. Best of all no more dealing with mounting on walls or have the flat screen flimsy on a table! Highly recommended it! And Fast delivery!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180922
    },
    {
      "title": "Make sure you measure before you buy the TV so it’ll be The right size",
      "text": "The stand is great but you have to find someone who is patient enough to put it together it takes about two hours and then make sure you have the TV to go on it that was my mistake I still don’t have the TVs to go on it but it just sits in my living room and I look at it every day wondering when I’m going to get that TV LOL",
      "rating": 5.0,
      "verified": true,
      "author": "Joan",
      "helpful_votes": 0,
      "publication_date": 20190210
    },
    {
      "title": "Mounts are weird",
      "text": "I'm not a huge fan on how to attach the TV to the actual stand. It's like these hooks that wrap around the top and bottom bars. Also, it was a bitch and a half to find the spacer and screw size arrangement for my tv. My TV has screw holes with different depths so this made it difficult to find the arrangement that workes. Once I got it setup though it is great, super sturdy, and I love the trays you can attatch.",
      "rating": 4.0,
      "verified": true,
      "author": "Mike Marzetta",
      "helpful_votes": 0,
      "publication_date": 20200129
    },
    {
      "title": "Love the flexibility",
      "text": "I saw the Kanto TV display in Las Vegas at one of the casinos and thought what a nice addition this would be to my home! Since I've been wanting to install a TV in my backyard, I thought this was a much better solution because the TV would not have to be stationary; I love the flexibility to wheel it to wherever you want in the backyard. I use it inside my home as well as outside this has been a great purchase for the price. Easy to put together too. I would highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Clint Romero",
      "helpful_votes": 0,
      "publication_date": 20191018
    },
    {
      "title": "You Need This Stylish Stand!",
      "text": "Stylish TV stand. My friends like it. They've never seen anything like it. Nice clean lines. I have the little shelf setup under my set for the Center channel. Rolls easily. Wheels lock and unlock easily and securely. I have a Vizio P-65 61.40 lbs. I used the screws that came pre-screwed into the back of my set. Set up was easy as it can get. The instructions are IKEA style. Have a friend help.",
      "rating": 5.0,
      "verified": true,
      "author": "John R. Silverfox",
      "helpful_votes": 0,
      "publication_date": 20180725
    },
    {
      "title": "Needs a better support system on back.",
      "text": "I love this product. However, it needs a better support system on the back. My TV is only 50 lbs. I had to use a rope to tie the back and nail it to the wall. Not really what I wanted to have to do. If that were fixed it would be an awesome product.",
      "rating": 4.0,
      "verified": true,
      "author": "M. M.Z.",
      "helpful_votes": 0,
      "publication_date": 20190606
    },
    {
      "title": "Glad I purchased this TV stand",
      "text": "Good quality product, reasonably priced compared to other TV stands, fairly easy to assemble. The only negative for me is the weight -- really heavy if you're having to transport it, other than moving it around an office on its own tiny wheels. In a stationary situation, the extra weight is probably a positive attribute, as it would be damn near impossible to knock this thing over.",
      "rating": 4.0,
      "verified": true,
      "author": "Larry Elliott",
      "helpful_votes": 3,
      "publication_date": 20160130
    },
    {
      "title": "Love it!",
      "text": "Makes it so easy to move the TV around the office, in an out of conference rooms etc. this is a must have for an office in my opinion. I like the ability of the TV not having to stay on the wall and it adjust perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Erik James",
      "helpful_votes": 0,
      "publication_date": 20190324
    },
    {
      "title": "Easy to assemble high quality HDTV stand.",
      "text": "I assembled the stand using videos on youtube. It was an easy assembly for the most part. I use the stand to hang a 43 inch 4k TV. As the TV is used as computer monitor, I removed the top shelf and other shelf as well. The wheels allow easy moving of the stand. I did not run the wires through the back of the stand as suggested. Overall, very satisfied with the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Paritosh Pathak",
      "helpful_votes": 0,
      "publication_date": 20170511
    },
    {
      "title": "just want a wanted",
      "text": "This is exactly what I wanted. It was easy to put together, it moves easily on the floor, and the ability to hide ALL the additional cords is perfect. If needed, I would buy the same unit.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Margolis",
      "helpful_votes": 0,
      "publication_date": 20190723
    },
    {
      "title": "handy when you lived in old rented apartments",
      "text": "We rent an apartment and cannot just plug holes and mounting brakets on the walls, so this is is a good alternative that also allows for moving the TV around the room",
      "rating": 5.0,
      "verified": true,
      "author": "jrlopez",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "Mine looks like the picture-- even though we have 3 other systems ...",
      "text": "Forget hanging the tv on the wall or ceiling. If you do-your tv is stuck there. This is the epitome of tv stands/etc! Wires--all hide, tv height--is adjustable, location--wheel it anywhere then lock 'em. Small shelf above---medium shelf below the tv. Mine looks like the picture-- even though we have 3 other systems hooked up to it---it's clean.",
      "rating": 5.0,
      "verified": true,
      "author": "annazon",
      "helpful_votes": 3,
      "publication_date": 20151213
    },
    {
      "title": "Mom",
      "text": "Great for gaming -can move around-in front of bed or gaming chairs Especially in a smAll room-doesn’t take up a as much floor space as a typical tv stand",
      "rating": 5.0,
      "verified": true,
      "author": "Mom",
      "helpful_votes": 0,
      "publication_date": 20200503
    },
    {
      "title": "Work great and are strudy!",
      "text": "I was concern these stands would not support a large 50 to 55 inch HD TV, but they worked out great. Takes a bit to assemble, but fairly easy and straight forward, I bought two and they seem to work great for my needs. We use them at church in Sunday’s and through the week as needed.",
      "rating": 5.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20181128
    },
    {
      "title": "This is an attractive good quality easel style TV stand that presents the next ...",
      "text": "This is an attractive good quality easel style TV stand that presents the next best thing to being able to mount on the wall. It moves easily and hides the cords. The top and bottom shelves are functional with light weight devices. Mounting was not an option for me and I'm pleased with this product.",
      "rating": 5.0,
      "verified": true,
      "author": "William Brown",
      "helpful_votes": 0,
      "publication_date": 20171227
    },
    {
      "title": "Make sure you have all the pieces!!!!!!!!!!",
      "text": "I received this product without instructions. Obviously a repack, because half way thru I don't have the correct bolts. I will head to hardware store for the correct bolts, just sucks ass!!!!",
      "rating": 1.0,
      "verified": true,
      "author": "owleyes1984",
      "helpful_votes": 0,
      "publication_date": 20190117
    },
    {
      "title": "I was nervous purchasing this product online because it needed to be sturdy to hold and move my expensive TV investment",
      "text": "This is a real quality product. I was nervous purchasing this product online because it needed to be sturdy to hold and move my expensive TV investment. Very happy with the out come.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas B.",
      "helpful_votes": 2,
      "publication_date": 20170216
    },
    {
      "title": "Solid - Great Value!",
      "text": "We placed a pretty big Sony on this thing, and it is very nicely balanced. We tinkered with the various attachments provided to find the correct spacing to get the TV properly mounted. We didn't attach either the shelves below or above the TV, though they both appeared easy to mount. We typically move this stand between two conference rooms, and have round it is very sturdy, solid wheels, and the wheel lock/brakes do a great job!! Highly recommend this - great value and very sturdy!!",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas Costello",
      "helpful_votes": 0,
      "publication_date": 20160821
    },
    {
      "title": "Suprising value",
      "text": "It really is all metal construction. Came with plenty of hardware options for mounting brackets to the TV. Assembled in an easy 30 min. Only tool you'll need, other than the wrench provided, is a phillips screwdriver. Just ordered another one. The telescoping height adjustment is easy enough. I found that I need to lift off the TV when making height adjustments alone.",
      "rating": 5.0,
      "verified": true,
      "author": "RGB",
      "helpful_votes": 0,
      "publication_date": 20151222
    },
    {
      "title": "But I am glad that I listened to him",
      "text": "My husband loves it. I wasn’t sure of getting it at first. But I am glad that I listened to him. And it wasn’t hard to put together. Save yourself headache for damaging your wall by buying this instead...",
      "rating": 5.0,
      "verified": true,
      "author": "Ilka",
      "helpful_votes": 0,
      "publication_date": 20171202
    },
    {
      "title": "Works great, but doesn't look as good in my living room as I thought it would.",
      "text": "Works great, but doesn't look as good in my living room as I thought it would. In the pictures, it looked like what I thought I wanted. When I set it up and put it in my living room, it looked like a giant robot and out of place.",
      "rating": 2.0,
      "verified": true,
      "author": "Review",
      "helpful_votes": 0,
      "publication_date": 20200308
    },
    {
      "title": "This stand is fantastic. Very solid and sturdy and a nice simple ...",
      "text": "This stand is fantastic. Very solid and sturdy and a nice simple appearance. The bottom shelf easily accommodates my hefty center channel speaker, even when moving the stand around.",
      "rating": 5.0,
      "verified": true,
      "author": "F. d'Anconia",
      "helpful_votes": 0,
      "publication_date": 20170620
    },
    {
      "title": "Sleek Mount!",
      "text": "Sleek looking! Easy to put together. My only concern is that there isn't a locking feature that secures the TV to the stand. The hook brackets that you secure to the back of the television just hang on the stand/mount. I guess the weight of the TV is expected to be all that is required. Other mounts have a locking feature that can be rotated to engage/disengage. That's the only thing keeping me from giving this 5 stars.",
      "rating": 4.0,
      "verified": true,
      "author": "Andre Monroe",
      "helpful_votes": 0,
      "publication_date": 20171231
    },
    {
      "title": "This is a well made and extremely sturdy tv floor stand",
      "text": "This is a well made and extremely sturdy tv floor stand. Directions were easy, however a few steps were hard for one person. The base is a bit large but needed fir the bigger TVs. Recommend if you need a movable stand.",
      "rating": 4.0,
      "verified": true,
      "author": "W. R. Sayer",
      "helpful_votes": 0,
      "publication_date": 20171229
    },
    {
      "title": "This is fantastic, and I am enjoying it",
      "text": "This is fantastic, and I am enjoying it. I bought to easily move my extra tv out to our covered patio to watch sports. It moves very easy, and I can easily pick it up over the threshold of the door.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20171104
    },
    {
      "title": "Variety of mounting options. Excellent quality.",
      "text": "Excellent. Works amazingly with my Samsung 40\" smart tv. Very adjustable. Comes with many mounting options to fit a wide variety of tvs. There is enough space left in the back that even if the holes aren't in the right place, you can still have cords in the back. I bought this for my dorm due to the minimal amount of space that I have.",
      "rating": 5.0,
      "verified": true,
      "author": "stephanie j.",
      "helpful_votes": 0,
      "publication_date": 20170810
    },
    {
      "title": "Good unit",
      "text": "The biggest problem with assembly was actual mounting of tv. We ended up with 2 spacers in top screwholes in order to make tv be vertically level and not tilt. Otherwise, this is an extremely sturdy unit. Very easy to roll over carpet. Not using pipes to hide cords as bottom shelf is low. Didn’t put on camera shelf",
      "rating": 4.0,
      "verified": true,
      "author": "MarylandMOM",
      "helpful_votes": 0,
      "publication_date": 20200911
    },
    {
      "title": "but both of the stands I ordered arrived looking like they had obviously been used",
      "text": "The stands are very strong and heavy. I would have rated 4 stars, but both of the stands I ordered arrived looking like they had obviously been used. One had significant scratches from being built prior. I touched it up with paint and looks fine now, but should have received a new item as purchased. Please note the base is quite wide.",
      "rating": 3.0,
      "verified": true,
      "author": "Nick U.",
      "helpful_votes": 0,
      "publication_date": 20171101
    },
    {
      "title": "Excellent product at every level.",
      "text": "I'm very pleased. Purchase was to put a monitor in a conference room. Product went together perfectly and it stable with at 55\" TV. Rolls around the office smoothly and feels heavy duty. They even sent spacers to adapt to the different contours of various brands of television for mounting. Love the detail they thought of to make the product work.",
      "rating": 5.0,
      "verified": true,
      "author": "Angela Trouette",
      "helpful_votes": 0,
      "publication_date": 20171105
    },
    {
      "title": "Good stand.",
      "text": "Very good stand, easy to assemble. Accessory shelf is very flimsy, only very light objects will it support. Very difficult to raise and lower TV after set up, but it can be done.",
      "rating": 3.0,
      "verified": true,
      "author": "Ron Shecut",
      "helpful_votes": 2,
      "publication_date": 20170613
    },
    {
      "title": "very good buy",
      "text": "Very good for people who like to move the TV from one place to another or to clean the TV behind without much problem very easy to put together I recommend",
      "rating": 5.0,
      "verified": true,
      "author": "bruno perez",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "This stand is very sturdy and easy to move even on carpet",
      "text": "This stand is very sturdy and easy to move even on carpet. The shelf will accommodate a game system or DVD player. Cords are easily hidden in the tubing and can be plugged into an outlet strip. I would recommend this for anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "karla k speidel",
      "helpful_votes": 0,
      "publication_date": 20171219
    },
    {
      "title": "This stand does exactly what I wanted it to do.",
      "text": "I have a 55\" Visio TV mounted on mine. The wires for power and HDMI route through the center supports so they do not show. I have a DVR mounted on the shelf and a soundbar mounted under the TV. It all works well. Unplug power and cable and it is ready to move to another room or out of the way.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20170221
    },
    {
      "title": "Legs stick out too far",
      "text": "Works well for the space. Didn’t realize the legs would stick out in front of tv so much",
      "rating": 5.0,
      "verified": true,
      "author": "Donna M Day",
      "helpful_votes": 0,
      "publication_date": 20190706
    },
    {
      "title": "Great minimalist TV stand!",
      "text": "Be aware that the backing unit can be adjusted for width to accommodate larger televisions. This can be less obvious when you're upgrading your television down the road, if you've already had your current model up there awhile.",
      "rating": 5.0,
      "verified": true,
      "author": "Someone",
      "helpful_votes": 0,
      "publication_date": 20161202
    },
    {
      "title": "Easy installation and smooth look with sturdy matetial",
      "text": "Easy installation. Heavy duty metal material. Wheels work well and stand well balanced with 55\" on it. Middle shelf has light plastic make up but metal supports underneath hold my 20lb stereo receiver just fine. Design is smooth and streamlined.",
      "rating": 5.0,
      "verified": true,
      "author": "Dczek",
      "helpful_votes": 0,
      "publication_date": 20161201
    },
    {
      "title": "Great stand for a 55 inch tv",
      "text": "This stand is perfect for my needs. Holds a 55 inch tv and is easy to move around..",
      "rating": 5.0,
      "verified": true,
      "author": "James B.",
      "helpful_votes": 0,
      "publication_date": 20191008
    },
    {
      "title": "Works great for offfice and Bedroom to share tv.",
      "text": "Measure your doorways and factor in width of TV. Great unit. You can get additional shelf for $25.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim and dogMoxie",
      "helpful_votes": 0,
      "publication_date": 20200610
    },
    {
      "title": "Good sturdy TV stand.",
      "text": "We bought this to be able to roll around a 40\" TV in our house. Good quality and sturdy. TV has no inclination to tip. The small shelf is nice and I have my Xbox on it, but feel that it will break any day. I wish they would have put a bit more quality into the shelf part. Other than that, great buy.",
      "rating": 5.0,
      "verified": true,
      "author": "RC",
      "helpful_votes": 3,
      "publication_date": 20160806
    },
    {
      "title": "excellent product",
      "text": "this tv stand is awesome, you can move it when you need to, solidly built...",
      "rating": 5.0,
      "verified": true,
      "author": "Cheryl A. Turner",
      "helpful_votes": 0,
      "publication_date": 20190829
    },
    {
      "title": "Love it. I love the finish and workmanship I ...",
      "text": "Love it. I love the finish and workmanship I now can hide all the cords! Thinking of getting another",
      "rating": 5.0,
      "verified": true,
      "author": "J MO",
      "helpful_votes": 0,
      "publication_date": 20171005
    },
    {
      "title": "gives great height, works great",
      "text": "gives great height, works great, was put together pretty easily, doesn't take up a lot of ground space (positive for small college dorms), and still has a small shelf which is perfect for a dvd player, being a shelf in general, etc.",
      "rating": 5.0,
      "verified": true,
      "author": "Hannah C",
      "helpful_votes": 0,
      "publication_date": 20161117
    },
    {
      "title": "Surprised",
      "text": "Bought two, both are nice. Had trouble assembling one of the units due to having one of the holes in the bottom of one of the poles not machined right to receive the screw. I had to work at it a little while but was able to correct it. I was surprised at how sturdy it is, I would like to see an extra shelf on it but overall I am well pleased with both.",
      "rating": 4.0,
      "verified": true,
      "author": "Shane Watson",
      "helpful_votes": 0,
      "publication_date": 20170203
    },
    {
      "title": "Good sturdy stand. Would have liked option to have more than one shelf but will worry about that later.",
      "text": "Sturdy and all parts needed are included. Can't ask for much more other than the option to have more than one shelf. A bit hard to adjust up or down after T.V. is attached depending on size but as long as two people are involved it is just fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Eldonsdad",
      "helpful_votes": 0,
      "publication_date": 20160918
    },
    {
      "title": "Stable and Holds 43\"",
      "text": "Very stable, a lot more stable than I was expecting. I don't like how some steps in the assembly instructions were not clear and would rather have some words explaining the pictures. Other than that, it works great! Update: I had lost the mounting bars and contacted the company for some new ones. They provided for $30, which to me is about the cost. I appreciated that they still had it and I can still use this TV stand.",
      "rating": 4.0,
      "verified": true,
      "author": "B. Cole",
      "helpful_votes": 0,
      "publication_date": 20150730
    },
    {
      "title": "GREAT BUY.  Heavy duty, well made.",
      "text": "GREAT BUY. Heavy duty, well made. Easy to put together, and felt very sturdy with 42\" TV on it -- even while rolling it around on casters.",
      "rating": 5.0,
      "verified": true,
      "author": "Living The Dream",
      "helpful_votes": 0,
      "publication_date": 20180830
    },
    {
      "title": "OUTSTANDING TV STAND!",
      "text": "Very solid construction. Adequate assembly instructions. Assembly is easy with minimal mechanical ability required. Very fairly priced. Performs as advertised. Highly recommended this product.",
      "rating": 5.0,
      "verified": true,
      "author": "G. Bishop",
      "helpful_votes": 0,
      "publication_date": 20180508
    },
    {
      "title": "Sturdy stand...easy to install",
      "text": "Easy to install....the only tool you need is a philips screwdriver. An allen wrench is already provided. Installation was quite easy. The manual provided made it simple to follow along. If you have difficulty, visit the Kanto site and there is an installation video for this MTM65PL stand. The stand is very chic...it made the room look professional. Love it!!",
      "rating": 5.0,
      "verified": true,
      "author": "P. L.",
      "helpful_votes": 0,
      "publication_date": 20150408
    },
    {
      "title": "Perfect for our Bonus Room",
      "text": "We bought a TV for our bonus room for watching movies, and I wanted a way to put it out of the way so the kids would have space to play at other times. This stand is sturdy, rolls well, and doesn't take up much space. It was also relatively easy to put together.",
      "rating": 5.0,
      "verified": true,
      "author": "Laura S",
      "helpful_votes": 0,
      "publication_date": 20180131
    },
    {
      "title": "nice and simple",
      "text": "This worked very well for me since I roll it close to the couch and I don't have to wear glasses to watch TV! ;-) I didn't bother assembling the shelves that came with this unit which cut assembly time down to about 20 mins, and I prefer the look, nice and simple.",
      "rating": 5.0,
      "verified": true,
      "author": "michigan",
      "helpful_votes": 0,
      "publication_date": 20160219
    },
    {
      "title": "Solid, sturdy, easy to assemble, worth the price!",
      "text": "Much easier to assemble than other comparable brands. Sturdy, easy to mount tv and to adjust height. Much better than the Loctek version I bought to save a few bucks. You get what you pay for.",
      "rating": 5.0,
      "verified": true,
      "author": "James L. Curtis Jr",
      "helpful_votes": 0,
      "publication_date": 20200217
    },
    {
      "title": "I'd have paid $500 for this stand.",
      "text": "What an awesome stand. I watched the video and pulled the trigger, and is exactly what I needed for my home studio. It's rock solid, took 15 minutes to assemble, and exceeded my expectations with its cable management and ease of adjustment. Ignore the other offerings. This is it!",
      "rating": 5.0,
      "verified": true,
      "author": "William Wilson",
      "helpful_votes": 0,
      "publication_date": 20160428
    },
    {
      "title": "He loves it!",
      "text": "Bought this for my boyfriend. He loves it! One star off for having to download the assembly instructions yourself",
      "rating": 5.0,
      "verified": true,
      "author": "Paricia M. Lonergan",
      "helpful_votes": 0,
      "publication_date": 20190727
    },
    {
      "title": "It's just the bee's knee's",
      "text": "There is no reason to look any further. This is the portable tv stand to buy. We have a 70\" tv and an xbox attached to this stand and with the wheels on lock it's as sturdy as a rock. We needed it to take our 70\" with us on a cross country rv roadtrip and through it all our tv hasn't skipped a beat thanks to this glorious t.v. stand.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Kroh",
      "helpful_votes": 0,
      "publication_date": 20180921
    },
    {
      "title": "Super for spare TV",
      "text": "This is a very sturdy stand. Fits my older heavier 37 inch TV easily and I love that I can move it around as it is currently in a spare bedroom. The only drawback to the sturdyness is that the base is rather large.",
      "rating": 4.0,
      "verified": true,
      "author": "Hoon of the Moon",
      "helpful_votes": 3,
      "publication_date": 20170105
    },
    {
      "title": "Great stand",
      "text": "Very sturdy, easy to assemble. Rolls well even in carpet.",
      "rating": 4.0,
      "verified": true,
      "author": "Porkalorkamus",
      "helpful_votes": 0,
      "publication_date": 20201021
    },
    {
      "title": "Strong unit",
      "text": "The instructions could be a lclearer. Shelf attachment is difficult.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Borst",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "Very sturdy and good looking",
      "text": "Very sturdy and good looking. Directions could have given a few clues to make assembly easier. Had to redue two steps because the pictures did not highlight front from back. Great purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Ricksomer",
      "helpful_votes": 0,
      "publication_date": 20170102
    },
    {
      "title": "Perfect",
      "text": "Easy to assemble. No cheap. Able to hold my 60\" LG no problem. Smooth rolling. Cables are easy to route and hide in the back.",
      "rating": 5.0,
      "verified": true,
      "author": "Coach C",
      "helpful_votes": 2,
      "publication_date": 20180126
    },
    {
      "title": "We like it",
      "text": "I get a lot of compliments on my rolling tv. I can roll it outside when we need to. It is sturdy and well made.",
      "rating": 5.0,
      "verified": true,
      "author": "Alisha",
      "helpful_votes": 0,
      "publication_date": 20200405
    },
    {
      "title": "Excellent product, no complaints",
      "text": "Excellent product, no complaints. So much nicer than setting my television on a table, takes up far less space in the room. The fact that it is mobile doesn't hurt. Perfectly sturdy with my 55\" Vizio. Just make sure you read the instructions first. Takes about 30-60 minutes to assemble.",
      "rating": 5.0,
      "verified": true,
      "author": "Marvin O.",
      "helpful_votes": 0,
      "publication_date": 20160319
    },
    {
      "title": "Solid piece, easy to put together",
      "text": "I bought this unit to hold a 55\" TV for our conference room. The mobility of the unit was what attracted me to it, since we can wheel it to wherever we want to set up audiovisual equipment. The stand went together in about 20 minutes and feels very solid. A good value for the price and so far it's working great.",
      "rating": 5.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 0,
      "publication_date": 20181221
    },
    {
      "title": "great stand for a tv monitor",
      "text": "great stand for a tv monitor. i ended up not using the camera shelf or the laptop shelf as i really only required the monitor stand. solid and well built. took me about 90 minutes to put together, going really slow. i figured if i was in a hurry it would take me 45-60 min.",
      "rating": 5.0,
      "verified": true,
      "author": "product review",
      "helpful_votes": 0,
      "publication_date": 20151116
    },
    {
      "title": "Five Stars",
      "text": "Great product. Worked well with the tv size. Larger than expected that worked well because it is real sturdy",
      "rating": 5.0,
      "verified": true,
      "author": "Gee Gee",
      "helpful_votes": 0,
      "publication_date": 20171003
    },
    {
      "title": "Great",
      "text": "I got this for my bedroom looks great and I can move it every time I need it to have the tv in another room.",
      "rating": 5.0,
      "verified": true,
      "author": "Xoxo",
      "helpful_votes": 0,
      "publication_date": 20180822
    },
    {
      "title": "You could not go wrong on buying this TV stand it is very sturdy and easy to move around and I have no ...",
      "text": "Jack Pot! You could not go wrong on buying this TV stand it is very sturdy and easy to move around and I have no worries about a big dog or big or little people knocking it over with ease. lol, I have to give myself a pat on the back for being a smart shopper on this product.",
      "rating": 5.0,
      "verified": true,
      "author": "edna",
      "helpful_votes": 0,
      "publication_date": 20180613
    },
    {
      "title": "The instructions to put it together made it very easy. I previously mounted my TV's on the wall ...",
      "text": "Very well made stand. The instructions to put it together made it very easy. I previously mounted my TV's on the wall but this stand makes it a lot easier since it is mobile and nice to look at.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20180520
    },
    {
      "title": "A solid stand, it will be great for our trade fair.",
      "text": "I got this for an upcoming trade fair, put it together and it’s pretty study. One of the wheels gave me some issue with installing but I got it eventually.",
      "rating": 5.0,
      "verified": true,
      "author": "G. Boscamp",
      "helpful_votes": 0,
      "publication_date": 20180227
    },
    {
      "title": "Just what I was looking for!",
      "text": "Terrific Addition to our 2 bedrooms. Easy to put together but I did have to go to hardware store for one stand to get 1 1/2 inch screw. 1” and 2” included which worked great for the big TV. Really sturdy and moves easily. Looks better without the camcorder top shelf",
      "rating": 5.0,
      "verified": true,
      "author": "SCOTT BUDINICH",
      "helpful_votes": 0,
      "publication_date": 20200521
    },
    {
      "title": "Very easy to put together",
      "text": "I bought this for a Home and Garden show. Very easy to put together. Just 4 screws to take it apart for transport. Very stable.",
      "rating": 5.0,
      "verified": true,
      "author": "david5253",
      "helpful_votes": 0,
      "publication_date": 20180312
    },
    {
      "title": "Sturdy and super-strong",
      "text": "I love it. Went together easily and feels extremely sturdy. I have a 40\" TV on it but it feels sturdy enough for 60*. Just what I was looking for to watch TV in bed or roll away when not needed.",
      "rating": 5.0,
      "verified": true,
      "author": "RKemp",
      "helpful_votes": 0,
      "publication_date": 20191212
    }
  ],
  "product_meta": {
    "title": "Kanto MTM65PL Height Adjustable Mobile TV Stand with Adjustable Shelf for 37-inch to 65-inch TVs | Supports up to 80 lb Total | Integrated Cable Management |",
    "rating": 4.7,
    "feature_bullets": [
      "SECURED TV STAND. This mobile stand lets you move your flat-screen monitor around your home or office with ease. It features four quick-release wheel locks that roll smoothly for effortless mobility. Each 2-inch wheel has a locking mechanism that you release by stepping on a lever. This ensures that the stand remains stable once the television set is where you want it.",
      "HIGHLY ADJUSTABLE. The mounting brackets fit most television panels from 37 to 65 inches. The stand’s height can be adjusted with two buttons on the center columns, letting you position your television at any height from 40.5 to 60 inches, for optimal viewing. What’s more, it has an adjustable middle tray for your laptop, mobile device, or other gadgets. Product weight: 47.3 Pounds",
      "EXCELLENT DURABILITY. Kanto’s mobile TV stand is made of high-quality durable steel with a powder-coated finish. It can safely support televisions of up to 100 pounds. This is ideal for presentation rooms in schools, offices, and even your home. Supports VESA 75×75 – 600×400.Height Adjustment: Between 40 inches and 60 inches. Four wheel locks can be applied and released with your foot",
      "SLEEK DESIGN. With its minimalist design, this mobile TV stand will add a modern-classic façade to your entertainment set. It features an accessory tray and a top shelf where you can store accessories like the remote, audio-visual equipment, cables, and webcam. Its low-profile design lets it fit between doors and doesn’t take up too much floor space.",
      "CLUTTER-FREE SETUP. This versatile TV mount is easy to assemble thanks to the online step-by-step instruction video and installation manual. It comes with all the mounting bolts, spacers, and washers you need to fit any flat-panel TV up to 65 inches. It also features hollow vertical tubes for integrated cable management, keeping your equipment and accessories organized and neat."
    ],
    "specifications": {
      "Item Weight": "47.3 pounds",
      "Product Dimensions": "33.3 x 28.2 x 79.9 inches",
      "Item model number": "MTM65PL",
      "Is Discontinued By Manufacturer": "No",
      "Assembled Height": "66.5 inches",
      "Assembled Width": "33.7 inches",
      "Weight": "47.3 Pounds",
      "ASIN": "B00RPP3262",
      "Customer Reviews": "4.7 out of 5 stars597 ratings4.7 out of 5 stars",
      "Best Sellers Rank": "#266,084 in Home & Kitchen",
      "Date First Available": "January 2, 2015"
    },
    "categories": [
      "Television Stands & Entertainment Centers",
      "Furniture",
      "Home & Kitchen",
      "Living Room Furniture",
      "TV & Media Furniture",
      "Electronics"
    ],
    "price": ""
  }
}