{
  "website_summaries": [
    {
      "verdict": "A reliable choice that offers Miele's outstanding cleaning abilities and low-noise operation in an upright model.",
      "pros": [
        "Strong 1,200 watt motor, mini turbo brush, and sealed AirClean filtration system for optimal pet hair removal",
        "Its LED headlights and patented SwivelNeck technology add to its superior cleaning action"
      ],
      "cons": [
        "Hair sometimes gets tangled around the brush, but it's not difficult to remove",
        "It's also somewhat heavy and a bit costly"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Save your money",
      "text": "Save your money and buy another vacuum. This piece of crap clogs up constantly and the way it's designed it's almost impossible to remove most clogs. The majority of the vacuum tubes are inaccessible and impossible to disassemble to get at most clogs. I thought I was purchasing a top brand vacuum that would last me a number of years yet here I am one year later looking for another vacuum.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 70,
      "publication_date": 20180915
    },
    {
      "title": "Poor quality",
      "text": "Unfortunately poor quality. Works well as a vacuum, but apparently it's too heavy for it's own handle as it has just SNAPPED in half while trying to pick it up. EDIT: Dropping to 1 star because it was $100 to replace *just* the handle and customer service refused to cover this under warranty",
      "rating": 1.0,
      "verified": true,
      "author": "Will Gordon",
      "helpful_votes": 66,
      "publication_date": 20180710
    },
    {
      "title": "I OBVIOUSLY PURCHASED A LEMON",
      "text": "The very first time I used this vacuum, I felt this was the best vacuum cleaner I’ve ever owned!! I had only vacuumed one room. The second time I used it, it cut off within seconds, I read instructions manual to troubleshoot the problem. The vacuum cleaner should’ve been perfectly fine according to the manual. I attempted using it again and it wouldn’t come on at all!! I purchased this vacuum cleaner based on the recommendations in the Consumer Guide Report. So I obviously purchased a lemon!",
      "rating": 1.0,
      "verified": true,
      "author": "pamela c.",
      "helpful_votes": 44,
      "publication_date": 20181126
    },
    {
      "title": "This vacuum is my jam!",
      "text": "I FINALLY bought the Miele Cat and Dog. I have been eyeing it up for quite some time. I have two short-haired dogs that shed. Not only do they shed, but they shed a lot. I previously had a Dyson Animal. That thing was a piece of crap. I guess you could say it worked. Not well, but it worked. I replaced that with a Hoover. It sucked, but certainly not in a good way. That thing was a total waste of money. I couldn't be more pumped to have this vacuum. It works so well. My carpets look cleaner, feel cleaner and the dog hair on my clothes is significantly reduced. I can't recommend this vacuum enough.",
      "rating": 5.0,
      "verified": true,
      "author": "BOO3Top Contributor: Pets",
      "helpful_votes": 32,
      "publication_date": 20161127
    },
    {
      "title": "Worst ever",
      "text": "I have had a Miele before and it was great. This one started having roller problems right after the first year. I had it replaced and it’s doing the same thing. For spending so much money you think it would not need to be fixed after just one year. Terrible, I will never buy another or recommend this one.",
      "rating": 1.0,
      "verified": true,
      "author": "Mary Kopko",
      "helpful_votes": 13,
      "publication_date": 20190212
    },
    {
      "title": "this thing really sucks!",
      "text": "the best vacuum i have ever owned hands down. do some research comparing this to other vacuums. there is no comparison. im glad i got it, with 4 dogs i need a good vacuum!",
      "rating": 5.0,
      "verified": true,
      "author": "Cherie",
      "helpful_votes": 13,
      "publication_date": 20170525
    },
    {
      "title": "It picks up even large clumps of dog hair & easily gets things along edges",
      "text": "This was worth the money. It’s light weight & powerful. The light lets me see things I’d probably otherwise miss. It picks up even large clumps of dog hair & easily gets things along edges. What took me hours now takes under 30 minutes to clean the whole house. The attachments are convenient & work well too. This is my first Miele vacuum cleaner. I love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Allison H",
      "helpful_votes": 9,
      "publication_date": 20180122
    },
    {
      "title": "Very Quiet",
      "text": "Pros: Awesome suction power controlled by motor speed vs. suction valve like most other non Miele vacs. Fluffs up carpet well., and with high pile carpets does a great job. Moves well on carpets and bare floors. Cons: Vacuum is on the heavier side; It would be easier to carry, if the handle went the entire length of upper body vs, a plug in. The handle wiggles a bit, since it is not one long piece. Therefore, one has to be careful and only lift the vacuum by the special handle on the upper back of the unit. Overall, a great vacuum.",
      "rating": 5.0,
      "verified": true,
      "author": "Roman L. Smieszek",
      "helpful_votes": 3,
      "publication_date": 20191121
    },
    {
      "title": "Expensive Crap that Breaks Easy",
      "text": "Save your cash for a vacuum that works. Its air suction mechanism sucks literally. We had a Miele about 10 years ago and it worked well until the bag kept coming unattached and the vacuum spewed crap everywhere. It was caused by a small little crappy attachment the holds the bag from breaking off and the bag wouldn't stay attached. Several years later we bought this one thinking that the Germans would have certainly detected this design flaw and fixed it. Well, they didn't. This time around my wife pulled the full bag out to dispose it and the crappy attachment came off with it. She didn't realize it and threw it away. German quality my foot!",
      "rating": 1.0,
      "verified": true,
      "author": "Steve L.",
      "helpful_votes": 4,
      "publication_date": 20190426
    },
    {
      "title": "I got a LEMON",
      "text": "The very first time I used this vacuum, I felt this was the best vacuum cleaner I’ve ever owned!! I had only vacuumed one room. The second time I used it, it cut off within seconds, I read instructions manual to troubleshoot the problem. I even took it down to my local authorized dealer and he told me that they OVERHEAT. I attempted using it again and it wouldn’t come on at all; great!! I threw out my old one - a 25 year old Hoover... I wish I hadn't.",
      "rating": 1.0,
      "verified": true,
      "author": "Christina L. Walters",
      "helpful_votes": 6,
      "publication_date": 20181203
    },
    {
      "title": "Expensive but so worth it if you have dogs or cats that shed",
      "text": "Expensive but worth it. 3 dogs in the house but with this vacuum you'd never know it. Very easy to maneuver. Not the lightest vacuum, but not ridiculously heavy. Pulls dog hair off the couch better than anything else I've tried.",
      "rating": 5.0,
      "verified": true,
      "author": "Tricia H",
      "helpful_votes": 7,
      "publication_date": 20170503
    },
    {
      "title": "Good when works",
      "text": "I have two dogs, one being a great pyrenees. I bought this vacuum after doing research and it worked great for the first year after that. I find it spends more time at the shop or needing to go to the shop then actually cleaning. Right now, it's blowing dust everywhere from underneath so it's clogged as usual. I'm leaning how to unclog it so I can save some money, last time I still had to take it in, so frustrating and today I seen the price had increased then when I bought it 3 years ago, it needs to come in pairs so at least one always works at a time.",
      "rating": 2.0,
      "verified": true,
      "author": "Orrin",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "A vacuum worth  investing in!",
      "text": "I love my miele vacuum! It works so well, easy to use. Having been a commercial janitor for several years, and a housekeeper for a few months, I have used many expensive vacuums. The miele is heavier than most other vacuums I've used but for how well it works, I don't mind that part. I love that I can vacuum my carpets and tile areas with ease. Vacuum bags are a bit on the expensive side and a rewind cord would be nice. Overall I would recommend this vacuum that is willing to invest in a good vacuum that will last.",
      "rating": 5.0,
      "verified": true,
      "author": "Katie Matherly",
      "helpful_votes": 2,
      "publication_date": 20191223
    },
    {
      "title": "Outstanding Vacuum Cleaner",
      "text": "We are very happy with this vacuum. The suction power is the best we have encountered. And, adjustable to accommodate lower need situations. When you hold and use it, you get a confident feeling that it will last for many, many years. It is extremely quiet. Yes, it is expensive. But, unquestionably, you get an extremely well made vacuum. We highly recommend that you spend the extra money to own this vacuum.",
      "rating": 5.0,
      "verified": true,
      "author": "Larry B.",
      "helpful_votes": 0,
      "publication_date": 20201004
    },
    {
      "title": "nice looking machine",
      "text": "nice looking machine, assembled it out of the box, would not work, had to search all over the net for help, called Miele help line, since I bought it from Amazon, refused any help, said to send it back finally deduced that the cord was the problem maybe, then had to figure out a way, (U-tube) to release the handle and reinsert.Then it started up seems like a nice machine but I have never seen worse instructions, (well maybe from China) unreadable and unable to understand still cannot see where an automatic cord rewind is",
      "rating": 4.0,
      "verified": true,
      "author": "anonymouse",
      "helpful_votes": 4,
      "publication_date": 20170307
    },
    {
      "title": "Consumer Reports Rated #2 - Should Have been #1",
      "text": "Maybe the best vacuum I've owned. It has good suction, a separate motor and on/off switch for the brush. It is definitely the quietest vacuum I've owned. Relatively easy to maneuver with a swivel action. It lays flat to allow vacuuming under tables and other furniture. Great sweeper so far.",
      "rating": 4.0,
      "verified": true,
      "author": "Edward L. Reed",
      "helpful_votes": 5,
      "publication_date": 20170306
    },
    {
      "title": "Poorly engineered blocks up a lot.",
      "text": "Do not spend this kind of money for a very poorly designed vacuum that blocks up frequently and is very difficult to clear blockage. Over priced and unreliable.",
      "rating": 1.0,
      "verified": true,
      "author": "Karen",
      "helpful_votes": 0,
      "publication_date": 20200826
    },
    {
      "title": "Spotless",
      "text": "this is the Bentley of all vacuums. It lifts the pile and goes deep where no other vacuum has dared to reach. I am so happy that I spent the money it is well worth it. I know the Miele name and it is famous in Germany. There is nothing better!",
      "rating": 5.0,
      "verified": true,
      "author": "LINDA M.",
      "helpful_votes": 7,
      "publication_date": 20170423
    },
    {
      "title": "Missing extras that I paid for",
      "text": "I never received my performance pack with extra bags and filters. This was an added expense. I will change my rating when this issue is resolved. I like the vacuum so far. It. Is VERY hard to push through shag carpet and does not get very close to the walls. But, if it lasts for 7years, it will be worth the price!",
      "rating": 1.0,
      "verified": true,
      "author": "Jamie E.",
      "helpful_votes": 2,
      "publication_date": 20190926
    },
    {
      "title": "Super quiet. Great adjustments. Bit clumsy to use, but very good overall.",
      "text": "Super quiet. It is a great vacuum, and you have a lot of control over the suction power manually. I find that it cleans the floors better than my Dyson Animal did, but I got less dog smell out of the dyson despite all the filters in this.",
      "rating": 5.0,
      "verified": true,
      "author": "Curt S. Hayes",
      "helpful_votes": 9,
      "publication_date": 20150630
    },
    {
      "title": "Was hoping it would get better. But it didn't",
      "text": "Have had this since December. Was hoping it would get better. But it didn't. First use it left piles of dog hair. Was hoping it was just that my carpet was super dirty. It's only gotten worse. Now it doesn't even pick up the hair, it just clumps it up and leaves it there. And now the roller is making a clunking noise. Total waste of $550",
      "rating": 1.0,
      "verified": true,
      "author": "Lydia Futrell",
      "helpful_votes": 13,
      "publication_date": 20170627
    },
    {
      "title": "Love this vacuum!",
      "text": "I really was hesitant to shell out this much money for a vacuum. I have a dog that is an industrial strength shedder, and need a good vacuum! My Hoover, last Bissell, and last Kenmore all couldn’t cut it and died early deaths. So I finally decided to go for it! I don’t know why anyone would give this a bad review! Best vacuum I’ve ever bought! Wish I’d gotten one long before now! Light! Relatively quiet. And very powerful! After vacuuming once, my carpets looked like new! Love love love this vacuum!",
      "rating": 5.0,
      "verified": true,
      "author": "\"Rich\"",
      "helpful_votes": 0,
      "publication_date": 20191028
    },
    {
      "title": "Best Vac Ever!",
      "text": "Best vacuum I have ever owned. Powerful and so much quieter than my old Hoover. Great at getting dog hair out of carpet! Swivels/twists to allow you to get around things.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan Spencer",
      "helpful_votes": 3,
      "publication_date": 20170419
    },
    {
      "title": "Heavy and weak suction",
      "text": "This vacuum is terrible! The suction is extremely weak, so it pushes larger pieces dust and dirt around on the floor and can't suck them up. It is the heaviest vacuum cleaner I have ever encountered. It is huge so even lying flat it doesn't fit under most furniture. The bags are expensive and fill up very quickly. I really can't think of anything positive to say about this vacuum. So frustrating given how expensive it was. Avoid!",
      "rating": 1.0,
      "verified": true,
      "author": "Laura Hawkinson",
      "helpful_votes": 0,
      "publication_date": 20200331
    },
    {
      "title": "Did not work when product arrived",
      "text": "I set the product up according to Miele's instructions. It worked for about 5 minutes and just stopped. I let it set for 20 minutes, changed outlets...it would only work for a couple of seconds. I called Miele's customer service. Evelyn could not find a repair center within 90 miles of me. She asked for \"another city close by\". I said I guess I need to just return it if you can't help me. She agreed!!!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Tracy Alexander",
      "helpful_votes": 0,
      "publication_date": 20200805
    },
    {
      "title": "Great at what it does, just heavy.",
      "text": "It surely does the job, but it seems heavy, really heavy. The manual says 20-some pounds, but it feels MUCH heavier. Does take up dog hair and that is what I needed. Maybe I'll build up some muscle as an added benefit!",
      "rating": 4.0,
      "verified": true,
      "author": "Judith Scholz",
      "helpful_votes": 3,
      "publication_date": 20170527
    },
    {
      "title": "Just buy it",
      "text": "This is a great vacume! Its not like the plastic ones I've had in the past. I have 4 dogs and the suction is amazing for carpets or smooth surfaces! Great menuverability and tho it's not particularly light weight, its still capable if doing stairs or upholstery! I was nervous because its not cheap but after the last 2 months of use, I have no regrets spending the money on it. Truly impressed!!",
      "rating": 5.0,
      "verified": true,
      "author": "Sue Hill",
      "helpful_votes": 0,
      "publication_date": 20201017
    },
    {
      "title": "I'm very disappointed with this vacuum cleaner.",
      "text": "When I bought this one I thought it was the top brand $500 vacuum cleaner. However after I used it for less than 20 times, it is clogged. The customer service asked me to take it to repair. Even it has a one-year free repair warranty but they didn't include the fee for cleaning the clogged part. I have no idea why I bought it one year ago. You should really go to Dyson!",
      "rating": 2.0,
      "verified": true,
      "author": "Liu Yang",
      "helpful_votes": 0,
      "publication_date": 20190711
    },
    {
      "title": "Impossible",
      "text": "This vacuum is extremely heavy, impossible to maneuver and clogs constantly. I just replaced the filter and it's still spewing dust everywhere! Very disappointed, Miele",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "A peice of crap!",
      "text": "If you have pets, then forget this vacuum. After only 6 months of use it clogs after every use. I have two cats and a pug. Yes, I have lots of fur and have to vacuum at least twice a week. This vacuum doesn't cut it. I tried returning it but the return period has expired. Next I'm going to write to customer service at Miele Center, but looking at other reviews I'm not expecting much. DON'T WASTE YOUR MONEY!!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Mari Jo Maccallum",
      "helpful_votes": 15,
      "publication_date": 20170420
    },
    {
      "title": "Worth the money",
      "text": "If you have a pet or pets you can't go wrong with buying this vacuum. It's worth the money in my opinion. I always waiting for awhile before posting comments on a product to see how it performs.",
      "rating": 5.0,
      "verified": true,
      "author": "PemPines",
      "helpful_votes": 4,
      "publication_date": 20150912
    },
    {
      "title": "A lot of hype and no results",
      "text": "A real loser. Very heavy. Awkward to use. Back to Hoover",
      "rating": 1.0,
      "verified": true,
      "author": "jetseller",
      "helpful_votes": 0,
      "publication_date": 20200315
    },
    {
      "title": "Very powerful - high quality",
      "text": "Very Powerful, well made, supreme quality. The suction from that powerful motor is unmatched, but that powerful motor does add to the weight.",
      "rating": 5.0,
      "verified": true,
      "author": "JC_Dexter",
      "helpful_votes": 0,
      "publication_date": 20180224
    },
    {
      "title": "Great vacuum",
      "text": "Great vacuum but it’s heavy. Not a problem for us but consider this if your looking for a light weight one. Cleans better than any other commercial vac we have had.",
      "rating": 5.0,
      "verified": true,
      "author": "Ronald W. Spencer",
      "helpful_votes": 0,
      "publication_date": 20190925
    },
    {
      "title": "Awesome vacuum",
      "text": "Love, love this vacuum! I clean for a living so I have owned one of every kind of vacuum and this hits the top of the list for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa Nunnery",
      "helpful_votes": 0,
      "publication_date": 20200621
    },
    {
      "title": "Find a cheaper vacuum",
      "text": "Great vacuum, but 1 year in and the clip holding the bag in place broke resulting in dust getting into the engine, an engine that can’t be repaired, it has to be replaced at $200! Don’t waste your money.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200303
    },
    {
      "title": "Buy from another manufacturer.",
      "text": "It took me longer to unpack the vacuum than it worked. Completely shut off after less than 5 minutes and never turned back on. Now I have repack it to return for Miele to throw away. Waste of time and resources.",
      "rating": 1.0,
      "verified": true,
      "author": "Dan Streepy",
      "helpful_votes": 0,
      "publication_date": 20200729
    },
    {
      "title": "Broke before a year.",
      "text": "I love the brand, and have been a fan, but this vacuum was a big disappointment. It cleaned well and was very easy to use, but after a three months it appeared to have a clog that could never be cleared. Hard to take for a vacuum that expensive. Ended up tossing it.",
      "rating": 2.0,
      "verified": true,
      "author": "Bobbi E. Sutliff",
      "helpful_votes": 0,
      "publication_date": 20190309
    },
    {
      "title": "... Shepard Dog that sheds -- This vacum does a great job picking up his fur",
      "text": "We have a German Shepard Dog that sheds -- This vacum does a great job picking up his fur.",
      "rating": 5.0,
      "verified": true,
      "author": "martin walton",
      "helpful_votes": 3,
      "publication_date": 20160423
    },
    {
      "title": "Love My Miele",
      "text": "I LOVE my new vaccum, it is The BEST! I highly recommend this over any other vaccum out there, including the Dyson, Miele is Way far The Best!",
      "rating": 5.0,
      "verified": true,
      "author": "Laura Simonds",
      "helpful_votes": 0,
      "publication_date": 20170814
    },
    {
      "title": "Best vacuum for picking up dog and cat hair But ...",
      "text": "Best vacuum for picking up dog and cat hair But beware when you assemble it. You must push the handle down into the main apparatus securely or else it will turn on but when you move it the connection will be lost and it will shut off. Returned it because I thought it was broken. Amazon immediately sent me a new one, but had the same problem so called Miele customer service and the rep knew exactly what the problem was. Miele should write that in the instruction manual under trouble shooting.",
      "rating": 5.0,
      "verified": true,
      "author": "Cynthia L. Barna",
      "helpful_votes": 13,
      "publication_date": 20150506
    },
    {
      "title": "Geat machine",
      "text": "In the time I've had it has been the best vacuum I have ever owned. It does tend to clog near the bag but has been easy to remove.",
      "rating": 5.0,
      "verified": true,
      "author": "William C. Lynn",
      "helpful_votes": 0,
      "publication_date": 20190706
    },
    {
      "title": "Best vacuum cleaner!",
      "text": "I love this vacuum cleaner! The best I ever had. So much better then the Dyson animal.",
      "rating": 5.0,
      "verified": true,
      "author": "hamstersrule",
      "helpful_votes": 2,
      "publication_date": 20160220
    },
    {
      "title": "Five Stars",
      "text": "Great vacuum cleaner!!!! So powerful and gets all the dog hair off the carpet. Well worth the price!",
      "rating": 5.0,
      "verified": true,
      "author": "Darla K.",
      "helpful_votes": 0,
      "publication_date": 20170910
    },
    {
      "title": "The Ultimate Vacuum",
      "text": "Quite simply the best vacuum I've ever owned ... I'll never NOT compare any other one to this. I'm a big strong guy but my 110# spouse thinks its a bit heavy ... that may come as close to a criticism that I come up with. It easily tackles my shedding Newfoundland on my light carpet; need I say anymore?",
      "rating": 5.0,
      "verified": true,
      "author": "Glenn",
      "helpful_votes": 5,
      "publication_date": 20161211
    },
    {
      "title": "Excellent!",
      "text": "It does the job of getting cat hair out of my carpet very well. Is also easy to maneuver with the swivel feature. Wish I had known about this vacuum a long time ago!",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Patricia Walls",
      "helpful_votes": 0,
      "publication_date": 20180323
    },
    {
      "title": "Worked great!, for about three weeks",
      "text": "Worked great!, for about three weeks. Now it shuts off within two minutes of starting. Checked for blockages, clogged filters, etc. then called the company. Got a machine, left a message, no response. Still working to resolve the issue. Probably something small, but how frustrating!",
      "rating": 2.0,
      "verified": true,
      "author": "Dr. Eric L. Kean",
      "helpful_votes": 9,
      "publication_date": 20160420
    },
    {
      "title": "Great vacuum",
      "text": "Great vacuum. Unbelievable suction. I have deep pile carpeting . Noticeably cleaner. Easy to use. A bit heavy. My only disappointment, no cord retraction. This vacuum replaces a 3year old Dyson animal. No contest between Dyson and Miele. Miele a much better vacuum. I would recommend this vacuum.",
      "rating": 5.0,
      "verified": true,
      "author": "Maryann",
      "helpful_votes": 18,
      "publication_date": 20150413
    },
    {
      "title": "Best Vacuum",
      "text": "Best vacuum I’ve ever had. Just love it. Great suction and filter bags are awesome",
      "rating": 5.0,
      "verified": true,
      "author": "Richard Rosemont",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "Best ever!",
      "text": "I've had a couple of these over the years and they are by far the best!",
      "rating": 5.0,
      "verified": true,
      "author": "Ranchodelnorte",
      "helpful_votes": 0,
      "publication_date": 20191113
    },
    {
      "title": "Don’t know what to do",
      "text": "Stopped working after using it twice now it will not turn on, very disappointing",
      "rating": 1.0,
      "verified": true,
      "author": "Ginger Myers",
      "helpful_votes": 0,
      "publication_date": 20200525
    },
    {
      "title": "It sucks hard, and that's great!",
      "text": "This vacuum sucks harder than any vacuum ever. Works great! The turbo brush attachment seemed to work well at removing cat hair from upholstery. The brush fluffs our carpet well too. If you are already shopping for vacs in this price range, then definitely push the button...you won't regret it. I would by this over a Dyson hands down.",
      "rating": 5.0,
      "verified": true,
      "author": "OmegaMan2006",
      "helpful_votes": 4,
      "publication_date": 20160624
    },
    {
      "title": "I was told I am right much like when I converted her to Rowena irons long ago",
      "text": "My wife thought I was a complete idiot when I told her how much I was going to spend for this Vacuum vs. a Dyson refurb. I got tired of buying Dysons every couple of years. Bottom line she LOVES this thing. I was told I am right much like when I converted her to Rowena irons long ago. This is by far the best vacuum we have ever owned. Never will buy another brand going forward in our families.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff campbell",
      "helpful_votes": 6,
      "publication_date": 20160824
    },
    {
      "title": "Unit broke within first month of use. Would not buy again.",
      "text": "Unit broke within first month of use. Would not buy again.",
      "rating": 1.0,
      "verified": true,
      "author": "D. WYSOCKI",
      "helpful_votes": 8,
      "publication_date": 20170723
    },
    {
      "title": "It's not working properly it shots off every 3 to ...",
      "text": "It's not working properly it shots off every 3 to 5 minutes I have to reset it I'm still waiting for the return labels to send it back",
      "rating": 1.0,
      "verified": true,
      "author": "george osorio",
      "helpful_votes": 8,
      "publication_date": 20170429
    },
    {
      "title": "do not recommend",
      "text": "i would not buy again. i miss my dyson. all this vacuum has done is need maintenance and fixing above and beyond anything i ever did in the ten years i owned a dyson animal and had a dog back then. at first it sucked up great. the sensor light that is supposed to tell me when my bag is full has never worked right. it is not sucking anything up anymore and i have no idea why... and i am not someone who wont look for reasons either. may husband is now at it, like he has nothing better to do. i am pretty disappointed in this vacuum for all i paid.",
      "rating": 2.0,
      "verified": true,
      "author": "A. Tucker",
      "helpful_votes": 8,
      "publication_date": 20170131
    },
    {
      "title": "This is the best vacuum we've ever owned",
      "text": "This is the best vacuum we've ever owned. The maneuverability is great and easily switches from hardwood and tile floors to area rugs and deep pile wall-to-wall carpet. We used to have to use two different vacuums for the different areas and it was a pain. The Miele is quiet so it doesn't scare our dogs too much. The attachment works great on the furniture sucking up the dog hair. It was a bit pricey, but worth every penny.",
      "rating": 5.0,
      "verified": true,
      "author": "Kylie's dad",
      "helpful_votes": 5,
      "publication_date": 20150517
    },
    {
      "title": "Works better than any previous vacuum on all surfaces",
      "text": "Works better than any previous vacuum on all surfaces: carpet, hardwood, tile with very uneven surfaces, furniture, and window treatments. The bag holds a large volume of debris and the filtration is awesome and the dust stays in the bag. The length of the cord is excellent.",
      "rating": 5.0,
      "verified": true,
      "author": "K",
      "helpful_votes": 2,
      "publication_date": 20160420
    },
    {
      "title": "Great Vacuum for Pet Lovers",
      "text": "Best vacuum I've ever used for all my pets' hair. @ German Shepherds & 3 cats. I can't brag enough about this vacuum. It goes from carpet to bare floor with a flick of a button that is at your fingertips. There is no dirt kickback on the bare floors!",
      "rating": 5.0,
      "verified": true,
      "author": "Victoria",
      "helpful_votes": 2,
      "publication_date": 20160725
    },
    {
      "title": "The Maserati of Upright Vacuums!!!!",
      "text": "My wife and I love this vacuum! It has all the suction you could want, is really quiet and easy to maneuver. It's like driving a Maserati around the house from tile to wood to medium height plus carpet it flat-out performs. Gotta love the LED headlights too!",
      "rating": 5.0,
      "verified": true,
      "author": "Dr. Review",
      "helpful_votes": 2,
      "publication_date": 20160425
    },
    {
      "title": "Great vacuum, lots of power but light keeps turning off unexpectedly",
      "text": "I gave it 4 stars because we can't figure out why the LED light on the bottom turns off and on while we're vacuuming. The expectation is that the light stays on while we're vacuuming. We're considering returning it for a non-defective one.",
      "rating": 4.0,
      "verified": true,
      "author": "S. Thompson",
      "helpful_votes": 3,
      "publication_date": 20170601
    },
    {
      "title": "It works great and has refreshed the carpet in high traffic areas",
      "text": "I wish I had purchased this sooner. It works great and has refreshed the carpet in high traffic areas. It's quiet and easy to maneuver.",
      "rating": 5.0,
      "verified": true,
      "author": "L Lanham",
      "helpful_votes": 3,
      "publication_date": 20170119
    },
    {
      "title": "Works well",
      "text": "Bought this to keep up with my 2 year old lab mix. It works great except when vacuuming larger debris (marble size) that result from him destroying a foam filled toy. Those pieces clog the tubing between the roller and hose and cause it to stop working. Not a huge problem but my old vacuum never clogged with small pieces like that.",
      "rating": 4.0,
      "verified": true,
      "author": "Don W.",
      "helpful_votes": 0,
      "publication_date": 20170412
    },
    {
      "title": "it seemed like cheap plastic",
      "text": "When I first received it, it seemed like cheap plastic. It is a heavy sweeper. Have to be careful opening some of the doors. But when I used this it was great. Gets really close to the edge and has a strong vacumn. Suction hose is also nice. Would definitely buy again.",
      "rating": 4.0,
      "verified": true,
      "author": "Beverley",
      "helpful_votes": 0,
      "publication_date": 20160330
    },
    {
      "title": "Simply the Best!",
      "text": "This is a wonderful product, worth every penny! We have 2 labs that act like it's their job to shed lol if you want an item that gets deep down clean, this us it! Works great on all flooring type.",
      "rating": 5.0,
      "verified": true,
      "author": "Anton Torres",
      "helpful_votes": 3,
      "publication_date": 20160224
    },
    {
      "title": "Great vacuum disappointed with ill fitting vacuum bag.",
      "text": "Excellent vacuum, but the vacuum bag does not fit well. It is loose at the connection point and spits back out dust from the bottom. Because of my allergies this was very disappointing It is the bag that came with the vacuum.",
      "rating": 4.0,
      "verified": true,
      "author": "P. Bregger",
      "helpful_votes": 4,
      "publication_date": 20160107
    },
    {
      "title": "This vacuum is truly amazing and worth the price",
      "text": "This vacuum is truly amazing and worth the price. Gets the carpeting much cleaner of all dirt than my old pet hair removing vacuum. I have 2 hairy dogs and clean the floors almost everyday so this was a leap of faith but very glad I did it.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Friedrich",
      "helpful_votes": 2,
      "publication_date": 20170408
    },
    {
      "title": "but it's been a wonderful week! Extremely good for dog hair",
      "text": "Have only used it for a week, but it's been a wonderful week! Extremely good for dog hair. Looks like new carpet! Extraordinary difference from our previous vacuum!",
      "rating": 5.0,
      "verified": true,
      "author": "Vinita N. Johnson",
      "helpful_votes": 4,
      "publication_date": 20150331
    },
    {
      "title": "The BMW of vacuum cleaners",
      "text": "We wanted a well made and highly rated vacuum cleaner because we own a dog that sheds. Everything I ever read about owning pets and vacuums said to buy a vacuum cleaner with a bag. And we didn't want some gimmicky, overpriced bagless vacuum that is made somewhere in Asia and sold by some British guy telling you what a genius he is. This vacuum performs very, very well. It is made in Germany and is very well made. It does a great job cleaning everything. Some people might find it heavy, but to me that means its made well.",
      "rating": 5.0,
      "verified": true,
      "author": "Dennis B",
      "helpful_votes": 4,
      "publication_date": 20150705
    },
    {
      "title": "cleans excellently, rooms smell clean",
      "text": "Cleans carpets very well and floors. Rooms smell clean after this has gone through. They don't \"smell like vacuuming\" like all other vacuum cleaners I've ever used.",
      "rating": 5.0,
      "verified": true,
      "author": "James Thomas Moon",
      "helpful_votes": 0,
      "publication_date": 20170317
    },
    {
      "title": "Bought in July-Broken by December",
      "text": "My vacuum broke in under 5 months. I have never had that happen before. I'm so disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Siegt",
      "helpful_votes": 5,
      "publication_date": 20170419
    },
    {
      "title": "Five Stars",
      "text": "Best vacuum I've ever had. Highly recommended for anyone with animals.",
      "rating": 5.0,
      "verified": true,
      "author": "Melanie",
      "helpful_votes": 2,
      "publication_date": 20160608
    },
    {
      "title": "Great vacuum!",
      "text": "This vacuum is built like a tank and functions beautifully. I have two dogs and need something that will excel at cleaning carpet, hardwood and blinds. In every way, the suction power and capability have exceeded my expectations. The swivel makes it agile which is good, because it is not a lightweight. I've had some lighter bagless vacuums and now that I have this beast, I'm starting to think the weight is an asset. Ulimtately, its the best vacuum i have ever owned. I would buy it again, even at this price.",
      "rating": 5.0,
      "verified": true,
      "author": "Marty C",
      "helpful_votes": 4,
      "publication_date": 20150725
    },
    {
      "title": "Strike 2",
      "text": "I was concerned about customers whose vacuums stopped working early so we bought the 3 year extended warranty. The first machine worked 10 minutes and stopped cold. The replacement vacuum came three days later and same story--10 minutes working and then died. We will go back to Dyson.",
      "rating": 1.0,
      "verified": true,
      "author": "R. Wilcox",
      "helpful_votes": 7,
      "publication_date": 20170128
    },
    {
      "title": "Bad design",
      "text": "Bad design. Not good for pet hair as it claims. I have only had it 2 months and it clogs at the brush.",
      "rating": 2.0,
      "verified": true,
      "author": "Lamar N.",
      "helpful_votes": 2,
      "publication_date": 20170413
    },
    {
      "title": "The instruction manual is certainly thorough -- apparently it's not a good idea to vacuum up anything that is on fire",
      "text": "Our new Miele arrived today. It is aptly described as \"the BMW of vacuum cleaners\". The instruction manual is certainly thorough -- apparently it's not a good idea to vacuum up anything that is on fire. Who knew? I had really counted on being able to hoover up cigarette butts or other such smoldering debris from our carpets, but despite my disappointment I suppose we can stomp out the flames first, just as we've always done. I guess you have to purchase the Ferrari of vacuum cleaners to be able to suck up flaming objects. Other than that, the new vac seems fine.",
      "rating": 5.0,
      "verified": true,
      "author": "John A.",
      "helpful_votes": 10,
      "publication_date": 20160711
    },
    {
      "title": "... daughter and son in law for Christmas and they loved it!",
      "text": "Got this for my daughter and son in law for Christmas and they loved it!!",
      "rating": 5.0,
      "verified": true,
      "author": "CYNTHIA HORBACZEWSKI",
      "helpful_votes": 0,
      "publication_date": 20171228
    },
    {
      "title": "I thought this was the best Vacuum I had ever had until I vacuumed behide ...",
      "text": "I thought this was the best Vacuum I had ever had until I vacuumed behide the couch where my collie's hair had collected. I thought, give it a try, after all it is a Cat and Dog Vacuum. After a lot of noise it choked and shook and stopped picking up the dog hair. I tried to unclogged it, but it is not the same. I would not recommend this Vacuum if you have a collie. My Oreck never failed like this!!!! I'm sorry I every bought this!!!!! I'll pull my Oreck out of the closet!",
      "rating": 1.0,
      "verified": true,
      "author": "Dwayne George",
      "helpful_votes": 11,
      "publication_date": 20161210
    },
    {
      "title": "Nothing but regret and disappointment.",
      "text": "Purchased back in July and it’s been a challenge. It is big, powerful, and heavy. Yes, it does a good job, but I have had a consistent problem with the bags. They keep coming loose and filling the insides with dirt and dog hair. It makes quite a mess. I regret spending all this money for this thing. What a HUGE disappointment.",
      "rating": 1.0,
      "verified": true,
      "author": "Cynthia Sturtevant",
      "helpful_votes": 5,
      "publication_date": 20180406
    },
    {
      "title": "Reviews were good, but apparently Sheltie fur proves to be just ...",
      "text": "Not thrilled with this vacuum. Reviews were good, but apparently Sheltie fur proves to be just too much for this vacuum. My husband took the bottom plate off, and was able to unclog one area, but think I'm still going to have to take it in to have a pro take it apart. Never had to take my Kenmore in to be unclogged. Wish I wasn't past the return window:(",
      "rating": 2.0,
      "verified": true,
      "author": "Sparklinmomma",
      "helpful_votes": 3,
      "publication_date": 20170418
    },
    {
      "title": "Dirt flies out",
      "text": "Every time vacuum dirt flies out the front. Now maybe I am doing something wrong but I am blowing more dirt around than I am picking up.",
      "rating": 1.0,
      "verified": true,
      "author": "Dreaux",
      "helpful_votes": 7,
      "publication_date": 20161023
    },
    {
      "title": "This is the best vacuum that I have ever used",
      "text": "This is the best vacuum that I have ever used. It is more quite than a Dyson with far better suction.",
      "rating": 5.0,
      "verified": true,
      "author": "Rick Saucier",
      "helpful_votes": 3,
      "publication_date": 20150605
    },
    {
      "title": "Very disappointed. We have some thick plush carpets that this ...",
      "text": "This expensive vacuum was supposed to last several years and be a pleasure to use. After about 9 months of light use it began to act very strange, started pulling hard on to the left and making a clicking noise. I took it to a shop, did not see it for about a month, and although the repair was under warranty, the vacuum broke again upon its first use back in my house. Very disappointed. We have some thick plush carpets that this machine is useless on. The machine should be self adjusting, but just bogs down in the thick carpet.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 9,
      "publication_date": 20161107
    },
    {
      "title": "not good for going up stairs",
      "text": "Very heavy, not good for going up stairs. Very powerful. Good for area rugs and hardwood floors; but be careful you have it on the right level.",
      "rating": 3.0,
      "verified": true,
      "author": "Cindylou",
      "helpful_votes": 3,
      "publication_date": 20151003
    },
    {
      "title": "it won't suck anything up",
      "text": "It worked well for my apartment with a corgi and a long haired cat for two months. I ordered this in February, and it started to slow down over the past two weeks. I tried to clean out the bottom, change the bag. And still, it won't suck anything up. For something as expensive as this, I expected it to last much longer, and have a better lifespan than this. Will be returning.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20170426
    },
    {
      "title": "Nope, Not as reliable as advertised,",
      "text": "I've had this vacuum one month and one day, so I can't return it. It has a short in it somewhere so I need to take it to another city to get it repaired, Works great when it is working properly. I would not recommend this to a friend, only an enemy.",
      "rating": 1.0,
      "verified": true,
      "author": "Linda",
      "helpful_votes": 14,
      "publication_date": 20160419
    },
    {
      "title": "Five Stars",
      "text": "This vacuum is the best for pets. It's not lightweight, but works as advertised.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 2,
      "publication_date": 20160708
    },
    {
      "title": "I think my Kirby is better on the pet hair",
      "text": "I think my Kirby is better on the pet hair. Clogs eadily, flops over and not good side suction. Not worth the price.",
      "rating": 4.0,
      "verified": true,
      "author": "kk",
      "helpful_votes": 3,
      "publication_date": 20151128
    },
    {
      "title": "Like driving an uncontrollable truck",
      "text": "Well, if you need a vacuum that handles like a dream....don't buy this one...Disappointing. I know this is a late review, but needs to be said.",
      "rating": 2.0,
      "verified": true,
      "author": "Verified buyer",
      "helpful_votes": 3,
      "publication_date": 20161106
    },
    {
      "title": "You get what you pay for. This thing is ...",
      "text": "You get what you pay for. This thing is a beast. Animal hair problems is the thing of the past. Huge improvement over my flimsy dyson.",
      "rating": 5.0,
      "verified": true,
      "author": "Joshua Matthew Branam",
      "helpful_votes": 6,
      "publication_date": 20170131
    },
    {
      "title": "Never been so excited about a vacuum!",
      "text": "My parents got a chuckle out of how excited I was about my new vacuum, but this thing is awesome! I have two dogs and wage a constant war against pet hair. This picks it up beautifully, off of hard surfaces and rugs, and doesn't get the awful smell that some vacuums get when used in pet areas.",
      "rating": 5.0,
      "verified": true,
      "author": "Dee C.",
      "helpful_votes": 3,
      "publication_date": 20180515
    },
    {
      "title": "Cannot remove filter to get strip off so vaccum will not turn on",
      "text": "Currently cannot use this vaccum. The active air clean 30 will not come out. Watched u-tubes shows it just popping out. Mine will not move, The vaccum will not turn on.",
      "rating": 1.0,
      "verified": true,
      "author": "LL",
      "helpful_votes": 3,
      "publication_date": 20190128
    },
    {
      "title": "It is amazing! It is German-made and sleek and powerful",
      "text": "I bought this after reading the epic vacuum cleaner repairman thread on Reddit. (Seriously, google it if you are in the market for a vacuum cleaner) He said that Shark vacuums were awful and that the Dyson was over-rated. He kept recommending the Miele. After doing research I bought one. It is amazing! It is German-made and sleek and powerful. I have lots of pets and it does a stellar job of sucking up all of the hair. I have tried to vacuum my pets directly with it, but they aren't too crazy about that part.",
      "rating": 5.0,
      "verified": true,
      "author": "Linnea Swensson",
      "helpful_votes": 89,
      "publication_date": 20150924
    },
    {
      "title": "Worth every penny",
      "text": "This vacuum was in a much higher price point than any vacuum I’ve ever purchased. I chose it based on it’s reputation for cleaning carpets. In short, it’s terrific. One very heavily trafficked area in particular is cleaner and feels soft like after a shampooing. The vacuum also keeps our hardwoods shiny. It’s definitely worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Atlanta Kate",
      "helpful_votes": 0,
      "publication_date": 20200912
    },
    {
      "title": "Extension wand hose ripped within a month under moderate use",
      "text": "The extension wand hose ripped apart in a spiral tear near the handle after only 1 month. Not pleased. Works fine otherwise.",
      "rating": 1.0,
      "verified": true,
      "author": "Rosebud",
      "helpful_votes": 3,
      "publication_date": 20180806
    },
    {
      "title": "Happy customer so far!",
      "text": "I’m really loving the vacuum after a months use. I’ve had to change the bag once, we have 5 dogs and I vacuum daily. I like the power and brush controls on the handle, as well as the floor type selector switch is at the top of the upright bag area. No need to bend down and turn knobs on the brush compartment. I had an issue with a broken belt and the local dealer was able to fix it right away. Hopefully it lasts a long time!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180531
    },
    {
      "title": "Very Disappointing",
      "text": "It was great for about 4 months. One day the suction was gone. We have cleaned it , but nothing has worked. I am disappointed and will not buy another.",
      "rating": 1.0,
      "verified": true,
      "author": "Denise Gatewood",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "Makes my carpets look new!",
      "text": "It’s heavy bc it’s a real motor. No more gross dust cans to empty , the bagged vacuum is so much better for allergies. The suction is amazing. I did read it can be clogged easily so I’ve just been careful to pick up stuff bigger than a silver dollar. The attachment with the spinning brush is incredible on my furniture and car, it even gets the cat trees to look new.",
      "rating": 5.0,
      "verified": true,
      "author": "Maria-Anis",
      "helpful_votes": 0,
      "publication_date": 20190404
    },
    {
      "title": "Well built",
      "text": "So far this is the best we've ever owned. We used to own a Dyson, and it was cheap plastic that pieces broke off on an annual basis. The Miele is build like a tank, yet it's easy to use and steer.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe",
      "helpful_votes": 0,
      "publication_date": 20180224
    },
    {
      "title": "This is a great product I would buy it over a Kenmore which ...",
      "text": "This is a great product I would buy it over a Kenmore which I have had four and they are all in the landfill. it’s very well-made product I’m sure that the canister is also very well-made and all the products associated with the vacuum are also good products. Just be sure that what you order from a company if the proper filter and bag",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel Cruse",
      "helpful_votes": 0,
      "publication_date": 20180214
    }
  ],
  "product_meta": {
    "title": "New Miele Dynamic U1 Cat and Dog Upright Vacuum, Lotus White - Corded",
    "description": "Size:U1 Cat & DogMiele's dynamic u1 cat & dog vacuum features a unique electro brush that follows the contours of your floor, automatically adjusting for different carpet depths and surface coverings - providing even, consistent suction and gentle cleaning. The cat & dog features Miele's AirClean sealed system, comprised of an AirClean Filter Bag and active air clean filter that captures and retains 99. 9+% Of dirt, dust and allergens. The active air clean filter has active charcoal layers to neutralize and absorb unwanted pet odors. The Dynamic u1 cat & dog vacuum features a rotary dial control with four power settings that allows you to adjust the level of suction to the type of surface being cleaned. In addition to the standard included accessories - a dusting brush, upholstery tool and crevice nozzle - the cat & dog features a mini turbo brush that easily removes pet hair from furnishings. Other conveniences include an led headlight.",
    "rating": 3.6,
    "feature_bullets": [
      "FilterBag volume - 6 litres",
      "Telescopic suction wand:Aluminium telescopic tube"
    ],
    "specifications": {
      "Product Dimensions": "14.4 x 13.4 x 46.5 inches",
      "Item Weight": "21.4 pounds",
      "Manufacturer": "Miele",
      "ASIN": "B00S1AGLY0",
      "Item model number": "41HBE030USA",
      "Customer Reviews": "3.6 out of 5 stars310 ratings3.6 out of 5 stars",
      "Best Sellers Rank": "#149,370 in Home & Kitchen",
      "Is Discontinued By Manufacturer": "No",
      "Specific Uses For Product": "Carpet",
      "Is Assembly Required?": "Yes",
      "Warranty Description": "3 year limited warranty.",
      "Batteries Required": "No",
      "Import Designation": "Imported"
    },
    "categories": [
      "Home & Kitchen",
      "Upright Vacuums",
      "Vacuums",
      "Vacuums & Floor Care"
    ],
    "price": 699.0
  }
}