{
  "website_summaries": [
    {
      "verdict": "A good value on a set of 24 bungee cords that come in handy sizes for a lot of general household needs.",
      "pros": [
        "A nice assortment",
        "Comes in a container",
        "Sizes are coordinated by color",
        "Good stretch",
        "Decent quality for the price",
        "Works well with tarps",
        "Lots of uses",
        "Plastic coated hooks makes them less likely to nick or scratch"
      ],
      "cons": [
        "Plastic coated hooks on these bungees may not perform as well as bungee cords with metal hooks"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Cheap plastic hook ends just snap off - great for losing your gear, or an eye!",
      "text": "Don't bother. The elastic is ok, it's the hooks on the ends that fail. Stretched just 2x their length, the cheap plastic hooks just snap and break. After missing the return window, I threw them out, realizing most everything tied down is worth more than these poorly made tie-downs. And piety the poor person driving behind me as my water bottle or kit bag flies off the sissy bar. This product is a safety hazard.",
      "rating": 1.0,
      "verified": true,
      "author": "MWoody",
      "helpful_votes": 75,
      "publication_date": 20170120
    },
    {
      "title": "Cartman Bungee Cords Assortment Jar 24 Piece in Jar",
      "text": "Super assortment of bungee cords! No matter what I needed for it, there is one that will be perfect! I would definitely tell other buyers to get this - you'll be surprised! By the way, the ends of this these cords are thicker plastic hooks because a lot of them only had metal hooks & it would sometimes ruin the item from the metal hooks. I am very happy with this purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "GoodNeighbor",
      "helpful_votes": 70,
      "publication_date": 20200401
    },
    {
      "title": "Strap that down",
      "text": "I've been strapping things down for the last twenty years, ever since my bed flew out of my pick-up bed on the way to college. That time I didn't use straps and look what I got- a dirty old mattress and cursed out by the Minnesota Highway Patrol. Not cool. Once I learned how a bungee strap worked I began my journey down the current dusty trail of straps and tie downs and convenient and secure loads of mostly junk on my truck. Thanks mr . bungee man, this was the best of the ones I've had in the last few years. The colors are striking. The snap is for real. It's the real thing.",
      "rating": 5.0,
      "verified": true,
      "author": "dimension 4",
      "helpful_votes": 68,
      "publication_date": 20190607
    },
    {
      "title": "better than expected!",
      "text": "They are stronger than the other bungee cords that I have. These bungees don't stretch excessively like others do. I'm a bit afraid the plastic hook are gonna brake... but if they are metal inside I should have nothing to worry (altho I'm worry). :) The plastic cover is really nice for not scratching anything... only time will tell. So far really happy... if they break I'll update this post.",
      "rating": 5.0,
      "verified": true,
      "author": "Joseph",
      "helpful_votes": 67,
      "publication_date": 20190917
    },
    {
      "title": "Not for heavy-duty tasks.",
      "text": "I bought these to use to hold together exercise equipment. The first cord I tried broke on the first - yes, first - time that I used it. As you can see from the pictures, the elastic cord snapped near where it terminates at the hook. Also, as you can see in the pictures, the hooks are plastic, and not very sturdy plastic - multiple areas where it was scraped away after being hooked onto a metal surface for about 20 minutes. These would probably be fine if you are just going to use them to hold together sleeping bags that are just sitting in storage or something, but would not recommend for heavy-duty tasks.",
      "rating": 2.0,
      "verified": true,
      "author": "Sarah K.",
      "helpful_votes": 12,
      "publication_date": 20181125
    },
    {
      "title": "Great set of cords",
      "text": "I purchased this set to tie various items around the garage without knowing what exact lengths I needed. An assortment of lengths was exactly what I was looking for. PROS - Well-made material - Hooks are compact and strong - Cord is tucked in well into the hooks CONS - I need to purchase more! :-) I had purchased another set of cords from another manufacturer for the specific lengths I needed, but they aren't as well-made as the ones that came with this product. If I had to make another purchase, I'd seek out Cartman cords again. If you found this review helpful, please hit the \"Yes/Helpful\" button below to encourage me to write more. Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "Photographer | Tech Pro | Outdoor EnthusiastTop Contributor: Photography",
      "helpful_votes": 71,
      "publication_date": 20181127
    },
    {
      "title": "Great for a Farm!!!",
      "text": "We have livestock that do not understand the fence or gate is there to protect them. This product makes a great repair until we can get out and fix it right. Then while we fix it right the livestock have found a new way out! Then we reuse them. That is the best thing about these cords is that they last a long time. Once they do break or wear out, take off the black hook and tie a rope to it for gate locks. Great product!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 60,
      "publication_date": 20200408
    },
    {
      "title": "Great product!!",
      "text": "Took a weekend motorcycle trip with the girls. Needed something to strap my sleeping bag s back pack down and the net and straps worked perfectly. My items were nice and snug and did not move throughout the 10 hour ride. A lot comes in the kit so my friends were able to add additional security to there items on their bikes as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Lateefah Rabideau",
      "helpful_votes": 61,
      "publication_date": 20190829
    },
    {
      "title": "CHEMICAL SMELL",
      "text": "These bungee cords give off a chemical rubber/industrial smell that is EXTREMELY potent. I decided to give them a chance and have my PCA put them outside to offgas for awhile. A whole week went by and the emission wasn't any better. I have a chemical sensitivity (MCS) and can't be around products that are like this because they make me very sick. I would be nice to be warned of toxic emissions from the manufacturer. When these are not disclosed, it's hard to trust. I am returning them. They seemed durable and the design of the product line would have been perfect for me if it weren't for this particular \"deal\" killer.",
      "rating": 1.0,
      "verified": true,
      "author": "RSM",
      "helpful_votes": 0,
      "publication_date": 20200422
    },
    {
      "title": "A perfect set for most people",
      "text": "I bought these specifically to use on a beach trip with our EZ-Up tent. I used them to hold gallon jugs that I filled with sand to weigh down the tent. I also used them to keep our cooler and bags off the sand. They worked perfectly. The only reason for 4 stars is for the 6 smallest bungees. They don't seem to be the same quality and I struggle to think of ways to use them. Added: Many reviews mention the canopy/tarp ball ties being useless. I already had some and I use them mainly to keep extension cords and Christmas lights together once rolled up.",
      "rating": 4.0,
      "verified": true,
      "author": "JP",
      "helpful_votes": 3,
      "publication_date": 20180821
    },
    {
      "title": "keepin' it together",
      "text": "good bungees, nice assortment, especially the really small ones as they're unusual and great when you need them. The jar isn't the best keeper as you have to take them all out to get what you want, but easy solution - just put them in a shoe box and recycle the jar.",
      "rating": 4.0,
      "verified": true,
      "author": "Roberta De Tata",
      "helpful_votes": 16,
      "publication_date": 20160322
    },
    {
      "title": "Great Bungees = a household staple (and fast shipping through Amazon!)",
      "text": "Bungees fall into the category of household necessities like hammers, pliers, screwdrivers, scissors, duct tape— you get the picture. We recently found our household with only a few of the very small bungees left, but needed longer ones to secure some items being stowed for the winter. This Cartman assortment is perfect to have around for all kinds of uses, and they partner with Amazon, so my Prime membership got the jar shipped to us in a couple of days! Excellent bargain for the price, as well. We feel sure the ones that will be sitting outside during the upcoming Minnesota winter will still have tension in the spring ... take care, everyone.",
      "rating": 5.0,
      "verified": true,
      "author": "JL 'Jet' Fleming",
      "helpful_votes": 0,
      "publication_date": 20201003
    },
    {
      "title": "Nice set, but could use one improvement",
      "text": "If you want to keep storing the bungees in the container, you have a problem. You can't pull out one and be sure what length you are getting. So you pull out multiples, and cannot get the extras back into the container. What would help would be for the company to add the color of each length to the front panel. The lengths are listed, why not color?",
      "rating": 4.0,
      "verified": true,
      "author": "mburns",
      "helpful_votes": 3,
      "publication_date": 20190522
    },
    {
      "title": "I cut one open and the elastic isn't even large enough to make a face mask.",
      "text": "I cut one open and the elastic isn't even large enough to make a face mask. WHY DOES THIS MATTER? Well when you want to be rated on durability sturdiness and versatility. A few days after purchase, how can i give an honest review of this? So I cut one open and was going t o make face masks out of that one to see how good the bungee is. IT IS SO TINY, trash elastic that is probably 1/10 a milometer in diameter lol. I used these just to hold tarp over my mini skate ramp but if I wanted to rely on these through weather, they would break down in a year for my guess.",
      "rating": 3.0,
      "verified": true,
      "author": "Julie",
      "helpful_votes": 0,
      "publication_date": 20200415
    },
    {
      "title": "Good assortment of Bungee Cords for a very reasonable price",
      "text": "I bought these initially for use in my garage, for use hanging extension cords or hoses. But I also found them to be handy when we needed to put a \"grandmother\" clock on a hand truck to take out to my SUV for delivery to my brother-in-law. By having so many cords and some of them long it made it possible (with padding) to secure to the hand truck at multiple points. The only VERY slight negative is that you get so many cords once you take them out it's hard to get them back into the original container, but I just use a labelled plastic \"shoe box\" now instead.",
      "rating": 5.0,
      "verified": true,
      "author": "Larry N.",
      "helpful_votes": 0,
      "publication_date": 20200822
    },
    {
      "title": "What \"guy vehicle\" can have too many bungee cords?",
      "text": "Bungee cords have to be one of the all time best inventions. I've literally had several different sizes in the back of my pick-ups for 50 years. Perfect for holding \"stuff\" in place while in transit. Loaned my truck to a friend recently and it came back without my bungees. Crap! There are poor ones, fair ones and these. The perfect stretch/strength/size combo. Can't get a better selection than this.",
      "rating": 5.0,
      "verified": true,
      "author": "Ackfla47",
      "helpful_votes": 59,
      "publication_date": 20190603
    },
    {
      "title": "These Cords are great",
      "text": "Plastic ends are definitely great, especially when I use them around trees to hold up squirrel feeder. I use the short small ones with metal ends for water bowl. I put water bowl on top of the flower pot that is up side down. Use the small metal cord in three places. Hook one at the bottom of the pot to the top of the bowl and even squirrels won't make them move.",
      "rating": 5.0,
      "verified": true,
      "author": "barbd",
      "helpful_votes": 59,
      "publication_date": 20190813
    },
    {
      "title": "Very weak and short stretch.  Cheap elastic?",
      "text": "I have purchased bungee cords dozens of times from the hardware store and have never come across any this week. To be fair it is possible someone might actually want week bungie's but I am skeptical that these will be useful for any of several typical tasks I use bungee cords for. I bundled 3 of these brand new cords together before they were able to offer similar stretch resistance to one of the same length from my garage that's been used heavily for several years. The smaller bungees in this kit have less stretch resistance than my wife's hair bands despite being twice the diameter.",
      "rating": 2.0,
      "verified": true,
      "author": "Ryan",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "Net is very small and bungies break easily.",
      "text": "Bought these to hold down a tarp in my 6 ft bed of my truck. The \"net\" stretched to MAYBE 2 ft so it wasn't covering anything in the bed of the truck. I didn't make it a mile down the road and 4 of the bungies broke. The elastice just came loose right at the hook and fell apart. This trade out of braking bungies continued until I had maybe 4 out of the whole pack that didn't fall apart. I do not recommend.",
      "rating": 1.0,
      "verified": true,
      "author": "Danikow",
      "helpful_votes": 2,
      "publication_date": 20190314
    },
    {
      "title": "Bungee cord advantages",
      "text": "Very pleased with this wide assortment of well-made bungee cords. Living in Florida, there are those months where the threat of a hurricane is present from June to the end of November. In my younger years, I would clear my courtyard by moving everything into the garage. Gone are those days. The spirit is willing but the body is weak. So, now what I do, is this. I run bungee cords through the heavy pieces of furniture and it binds them all together. Yes. Its not 100%. But, if the roof goes, the outdoor furniture will just be a minor loss. Loving my bungee cords.",
      "rating": 5.0,
      "verified": true,
      "author": "barbara",
      "helpful_votes": 0,
      "publication_date": 20200725
    },
    {
      "title": "Plastic hooks, not metal. Expect breakage",
      "text": "Plastic hooks, not metal. Expect breakage. I was hoping for wire hooks so that I could bend one closed and use a carabiner on it, (Weird purpose) or be able to widen it to fit around something that is larger than these hooks are. Disappointed, but it looks like a useful set, with so many different sizes that I’ll just hang onto it. Price is right if I ever need some emergency straps, Such as a bug out prior to a foreclosure.",
      "rating": 4.0,
      "verified": true,
      "author": "Crystal ETop Contributor: Coloring",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "No Carrying case",
      "text": "Cords and cargo net are pretty standard quality you will find at any auto store. I bought this set, because the description states and image shows a carry pouch. The box they arrived in, also states to contain a carry case. There is no carrying case or pouch, or anything, just loose cords in a box. I bought this because of the carrying case to take in a saddle bag on a motorcycle, last thing I want is a bunch of loose hooks. Over all, fair quality, for a fair price, just not fully as advertised.",
      "rating": 3.0,
      "verified": true,
      "author": "Ryan Kobs",
      "helpful_votes": 0,
      "publication_date": 20190327
    },
    {
      "title": "Good for light duty",
      "text": "I only paid $12-ish for a can of 24 cords, which is approx $0.50 a piece... so I didn't expect these to be anything more than cheap light duty bungees. That is what I use them for and they are good for that purpose. I would not use these for any heavy workloads on my farm. Hover it is nice to have a can of these cheapies in the garage because they are always helpful when in a pinch doing misc work, or when someone else needs to \"borrow\" one when they are loading up their truck (why hand them an expensive good bungee... NOBODY ever returns them!)",
      "rating": 3.0,
      "verified": true,
      "author": "12 Books a Year",
      "helpful_votes": 0,
      "publication_date": 20180906
    },
    {
      "title": "Just what I was looking for!",
      "text": "This was the perfect variety of sizes to meet my needs. Arrived quickly, priced well and conveniently packaged in nice storage container that fit just right in the shallow cabinet of our camper. We purchased these to use while camping. bungees are a great invention...lol...we use them for a variety of things from holding cabinet doors secure while traveling to securing wind break tarps outdoors. This variety pack was a great purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Harry and Rhonda Willman",
      "helpful_votes": 0,
      "publication_date": 20201008
    },
    {
      "title": "Delightfully colored, sturdy bungees",
      "text": "I love this product. The bungee cords are colorful and sturdy. I used them (so far) to secure a tarp in place behind our heated outdoor cat house (like a little tent) for the 3 stray cats we feed, to keep the wind from whipping against and potentially through the little tent/house. Worked perfectly. I had to experiment to find the right bungee lengths to use in the various grommets, but that part was pretty fun and let me handle many bungees. Stuffing the ones I didn't use back in the container was easy too.",
      "rating": 5.0,
      "verified": true,
      "author": "Timothy B. Miller",
      "helpful_votes": 57,
      "publication_date": 20181115
    },
    {
      "title": "Can't beat the price for what you get!",
      "text": "These cords seem to be of decent quality and have some stretch to them. The container also works well. To everyone who says it's impossible to get all of the cords back into the container once you take them out -- it's not. It's actually pretty simple. As you can see in the image, I still have room remaining where I took two of them out. They would easily fit back in. I recommend this item!",
      "rating": 5.0,
      "verified": true,
      "author": "H Clark",
      "helpful_votes": 62,
      "publication_date": 20170409
    },
    {
      "title": "NOT HEAVY DUTY  AT ALL",
      "text": "I see some of these comments saying \"Heavy Duty\" or \"Industrial\"... all I can say is: \"I don't think that means what you think it means.\" These are great for very lightweight work. They are nowhere near as strong as basic rubber bungees. The hooks are plastic. They'll hold a trash can lid on, keep a sleeping bag rolled up, etc. but that's it. If you try to strap something to the roof of your car with these, you are going to be very disappointed. For $12, you get what you pay for.",
      "rating": 2.0,
      "verified": true,
      "author": "Robert Harrington",
      "helpful_votes": 0,
      "publication_date": 20191125
    },
    {
      "title": "but I regret that I didn't purchase a better quality one",
      "text": "Hooks are made of cheap plastic. The cords are not very elastic. I maybe need to use this once a year or two, but I regret that I didn't purchase a better quality one. You get less than what you pay. IMO.",
      "rating": 1.0,
      "verified": true,
      "author": "Sean's Amazon Account",
      "helpful_votes": 6,
      "publication_date": 20170818
    },
    {
      "title": "Great until they started to disappear!",
      "text": "These are great - stretchy, colorful, a nice assortment of sizes, and the price was good. I haven’t used them much yet, but I’m happy with the plastic hooks and feel like they’re not going to scratch everything. The only downside is: my kids love them, too. They’ve been used to pull things behind bikes and tricycles, they’ve been used as exercise bands, as a safety restraint in a wagon, and as part of a complicated barrier designed to keep their enemies out. They even cut one in half to see what the inside looked like. Good purchase. Would definitely buy again and probably will have to if I ever want to use them!",
      "rating": 5.0,
      "verified": true,
      "author": "Neil G. Christiansen",
      "helpful_votes": 57,
      "publication_date": 20180625
    },
    {
      "title": "Ice does not come out of tray unless you punch bottom of each ice cube abd forceit from plastic tray",
      "text": "1. I did not like this product. Ice cubes are hard to get out of tray. You flex ice cube tray and cubes do not come out. You have to punch bottom of each ice cube to remove ice from tray. 2. Plastic container is too flexible. You fill tray with water and tray sags and water drips on floor when making new ice.",
      "rating": 1.0,
      "verified": true,
      "author": "Maddiegirl",
      "helpful_votes": 0,
      "publication_date": 20200809
    },
    {
      "title": "Good strong straps I would recommend.",
      "text": "I love the bungee assortment. I have been needing something for strapping down items on our bikes for a while and this works really well and the netting goes great over my wife's cargo basket. They seem to be good and strong for a braided strap. All in all a good experience. I have no complaints. Also, it comes with a nice bag to keep them from being strone about.",
      "rating": 5.0,
      "verified": true,
      "author": "Retaking Humanity",
      "helpful_votes": 59,
      "publication_date": 20180602
    },
    {
      "title": "Great selection of inexpensive bungee cords",
      "text": "These are not real heavy duty bungee cords but there are a good selection and they are quite inexpensive. I have found all sorts of uses for the various lengths, and the storage container they come in is quite handy. They seem to be well made, but if they stay outside in the sun all the time they will eventually fade and deteriorate a bit. After a year or so I have had to replace a couple. The solution is simple. Since they are cheap, just buy more. It's a great value.",
      "rating": 5.0,
      "verified": true,
      "author": "Cedarvale Cat",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "Poor Quality",
      "text": "The first time I pulled one of these tight, it started pulling apart at the hook. So I tried another one. Did the same thing. I'm sure they're fine for very light duty, but don't pull too tight. Now I'm wishing I would have spent the money on quality bungees. Lesson learned.",
      "rating": 2.0,
      "verified": true,
      "author": "Paul Daniel",
      "helpful_votes": 0,
      "publication_date": 20190926
    },
    {
      "title": "A Great mix of Bungees",
      "text": "These can be so handy for a variety of needs! We recently purchased a used motor home and discovered a need within a few days (stairs that won't stay retracted while driving); a neighbor gave us one of his bungees for repair so I purchased these to assist with stairs and a whole lot more.",
      "rating": 5.0,
      "verified": true,
      "author": "lvschultz2",
      "helpful_votes": 0,
      "publication_date": 20201014
    },
    {
      "title": "Great Assortment of Bungee Cords",
      "text": "I needed an assortment of bungee cords and this container has proven to be useful in every project I've needed them for. I like having the ability to downsize when I need a smaller cord and/or upsize when needed.",
      "rating": 5.0,
      "verified": true,
      "author": "AndiO",
      "helpful_votes": 0,
      "publication_date": 20200226
    },
    {
      "title": "great but",
      "text": "This is a great buy.I hadpatio furniture to cover w/ tarps i used several to keep tarps secure, but 2 in my car,gace 2 to my daughter for her car (for emergencies ect) and I STILL have a bunch extra that will come in convenient someday I am sure I would definately recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Jen ",
      "helpful_votes": 0,
      "publication_date": 20201009
    },
    {
      "title": "Keeps the squirrels out of the garbage",
      "text": "The squirrels ate through my plastic garbage can. I bought a metal one and placed it inside the old can so I could still wheel it. The lid blew off, rolled down the street and became very bent out of shape so the squirrels just knock it off. I used one bungee cord to connect the lid handle to the can side handle and secured it with cable ties. Then I used two bungee cords criss cross over the lid. So far the squirrels have not figured out how to open them. There is a nice selection of sizes and they stretch and hold very well.",
      "rating": 5.0,
      "verified": true,
      "author": "RiRoTz",
      "helpful_votes": 0,
      "publication_date": 20180808
    },
    {
      "title": "Excellent assortment for the investment.",
      "text": "This is one of the best bungee cord assortments I found and the price is very reasonable. My boyfriend also ordered this same assortment in order to complete our hurricane preparedness totes. I was very happy with the quality of the bungee cords. I think they did a good job in identifying the most useful sizes and putting them together in the 24 piece set. The shipping carton was damaged by UPS and the handle had came off. I contacted Cartman and they responded quickly to take care of sending me new cords and handle.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennie Link",
      "helpful_votes": 57,
      "publication_date": 20180621
    },
    {
      "title": "great bungee cords",
      "text": "I have purchased this set in the past and like the mix of lengths and styles. As with all bungee cords the sun is the enemy and all of them will disintegrate out in the sun for real long periods but I do not like the rubber ones so I buy these and am happy with them. PS you can't have to many bungee cords",
      "rating": 4.0,
      "verified": true,
      "author": "gonefourwheelin",
      "helpful_votes": 0,
      "publication_date": 20200415
    },
    {
      "title": "Ready For the Boat!",
      "text": "Exactly what we needed! We have a boat and we’re having problems keeping the ladder from coming undone and keeping our rafts secure when driving. This allowed us to try as many as we needed to be able to keep everything hunkered down while driving the boat! The carrying container is great as well and nice and small to keep on the boat",
      "rating": 5.0,
      "verified": true,
      "author": "Sam Powell",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "ALL \"my guys\" said this was a great gift!",
      "text": "What do you give when you want to give a useful gift to several men--some you don't know very well??? When I bought these for 3 sons and the father-in-law and brothers-in-law of one of those sons, one of my thoughts was, \"Well, if they cannot use them, they can always regift it!\" I was very pleased when one of the young brothers-in-law said, \"This is a GREAT gift!\" The container was attractive, and the bungee cords looked substantial.",
      "rating": 5.0,
      "verified": true,
      "author": "Pat Woodman",
      "helpful_votes": 55,
      "publication_date": 20190107
    },
    {
      "title": "Junk!!",
      "text": "If I could give this a negative rate I would. These bunnies are pure junk! I used then once to hold some things in my boat and within an hour the hooks were breaking and bending. one actually flung off and hit me in the arm and left a welt. God help them if it had it me in the eye. I can't say any more than they are junk.!!",
      "rating": 1.0,
      "verified": true,
      "author": "William S.",
      "helpful_votes": 0,
      "publication_date": 20200701
    },
    {
      "title": "Holds very well on the back of a bike",
      "text": "I've only been using these for a week or so but I used a few times on my bike to hold groceries (with heavy beer bottles and cans) and my heavy bike u-lock and it worked great. Having all the sizes is probably a bit much for me now but I see myself using all of these over the long-term.",
      "rating": 5.0,
      "verified": true,
      "author": "Tyler Spitz",
      "helpful_votes": 0,
      "publication_date": 20200608
    },
    {
      "title": "Good but smells",
      "text": "Functionally these cords are good, but it has a chemical smell which makes it useless for me to keep in car. I tried to air it out for a couple of weeks but it did not help. If you don't plan to keep indoors or car, these are good.",
      "rating": 1.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20191201
    },
    {
      "title": "Not Your Parents' Bungee",
      "text": "Arrived quickly, well packaged and in a shattered cheap, thin plastic jar with fragmented lid. Not all bungee's present. Use another vendor if you can! We ordered two units, both damaged and missing cords.",
      "rating": 1.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20191004
    },
    {
      "title": "Good cords, but tossed the very little tiny ones.",
      "text": "Great set of bungie cords. I brought 2 sets to have lots of cords to secure a huge tarp to my patio pergola for the winter. I ended up using all the real bungie cords. The only thing I suggest is that they do not include the little tiny mini bungie cords. they were silly. I just tossed those. 6 little tiny ones and 4 elastic ones with ball on the end. have no idea what these are for. Probably just to make the over all count bigger for marketing. Says 24 but really you need to subtract these.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim in Sacramento",
      "helpful_votes": 0,
      "publication_date": 20180211
    },
    {
      "title": "No issues.",
      "text": "Lots of different kinds of bungees in here. I used them in conjunction with a tarp in order to keep my bike from rotting in the Arizona sun. They hold their elasticity well and aren't tearing at all. The colors fade a bit after some time in use but the functionality is still great. The container could have been designed a little better though, as there isn't much room to put them back in after you first take them out and it's really flimsy.",
      "rating": 4.0,
      "verified": true,
      "author": "Joshua Stewart",
      "helpful_votes": 0,
      "publication_date": 20170918
    },
    {
      "title": "Bungee cords",
      "text": "I needed something to keep the squirrels out of my bird feeder and the bands sure did it. The product is great and I am very happy !!! Now I just need to find ideas for all the cords I bought in the big tub lol Love my bungee cords.",
      "rating": 5.0,
      "verified": true,
      "author": "Gabriele",
      "helpful_votes": 0,
      "publication_date": 20200826
    },
    {
      "title": "These are Just Wonderful.",
      "text": "These are just wonderful. I've lived with them for six months now and they are perfect. I used them to attach a super long heating pad to two recliners and they have functioned perfectly. (one at the top and one at the bottom) I bagged the unused ones up this morning and found the canopy/tarp balls (4). I know they will come in very handy. I am so glad I got these. I gave my brother a set and plan to order another set for my son in law for Christmas.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan D. Delaney, MD, MS, author",
      "helpful_votes": 0,
      "publication_date": 20180331
    },
    {
      "title": "Do Not Put in Sunlight",
      "text": "I was excited when these bungee cords came in, and I used them to hang sun sails on my back patio. BIG MISTAKE! These things rotted within two months. Save your money and buy elsewhere. Like the old saying goes, \"You get what you pay for\".",
      "rating": 1.0,
      "verified": true,
      "author": "Mule Skinner",
      "helpful_votes": 0,
      "publication_date": 20200825
    },
    {
      "title": "Work as Expected",
      "text": "Great variety in the pack. I used a few of them and they worked great. They make my life so much easier when carrying boxes on my small cart, no worries about them falling down. I can already envision hundreds of uses for those and I have a whole pack. I don't know how I managed without them before :)",
      "rating": 5.0,
      "verified": true,
      "author": "Sasha",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "Cartman Cords Can Complete Casual Cart Constraints",
      "text": "Short, medium, extra medium, large, extra large. All have elasticity and all suitable for your special needs. Wear goggles until you get used to this technology. Amazon doesn't sell glass eyes and trust me, you don't want to lose a real eye. I'd order these for my mother.",
      "rating": 5.0,
      "verified": true,
      "author": "Randy Wall",
      "helpful_votes": 0,
      "publication_date": 20200220
    },
    {
      "title": "Everyone should have these in their toolbox.",
      "text": "Used in a cargo van temporarily converted to a camper. These were PERFECT for keeping things in place from larger items (multiple bungees) to even small incidentals. Used almost all of them for a month solid and none of them broke. 👍",
      "rating": 5.0,
      "verified": true,
      "author": "Mason",
      "helpful_votes": 0,
      "publication_date": 20200807
    },
    {
      "title": "Good set with a variety of lengths",
      "text": "Handy set to have on hand with various length options. Only complaint is durability - Holding down a tarp outdoors and they only lasted about one season between direct exposure to rain and sunlight before starting to fray and deteriorate and needing to be replaced. Keep them out of the elements and maybe they last longer?",
      "rating": 4.0,
      "verified": true,
      "author": "Eind German",
      "helpful_votes": 0,
      "publication_date": 20200907
    },
    {
      "title": "Do the job",
      "text": "I liked the way the product was packaged. I like what the item was made of. The material seemed to be of high quality . The only reason I gave a 4 on the durability is because I just received them and don’t know how long they will last. They appear to be made by quality craftsman and materials.",
      "rating": 5.0,
      "verified": true,
      "author": "Pt",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "What's to complain about",
      "text": "Great variety of bungees, though nothing heavy duty. Cargo net is also fairly small but hey all the measurements are in the description so I knew what I was getting. The bag they come in for storage is fairly heavy duty feeling. Not a thin flimsy bag at all. Well worth the money spent on this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Decker",
      "helpful_votes": 0,
      "publication_date": 20181029
    },
    {
      "title": "Durable Bungee Cords!",
      "text": "Purchased these to help hold large pizza boxes on my front bike basket while making deliveries and because you get a variety of sizes you're bound to have access to the one you need to hold anything. These work very well for me as a part time delivery boy, they're not too tight to the point where they bend the boxes, they're just right.",
      "rating": 5.0,
      "verified": true,
      "author": "Rocko",
      "helpful_votes": 0,
      "publication_date": 20190501
    },
    {
      "title": "Great variety of sizes—each in a different color!",
      "text": "I like the multiple cords for a good price and that the sizes are different colors. My only problem was with the packaging. The different sizes are listed on the label, but it would be helpful to add which color each length is on the label. Also, the jar could be a tad larger. Once you take them out to use them, it’s very tedious to get them back in the jar for storage. I haven’t had them long enough to know how durable they are.",
      "rating": 4.0,
      "verified": true,
      "author": "Laurie S.",
      "helpful_votes": 0,
      "publication_date": 20190511
    },
    {
      "title": "Strong oily smell",
      "text": "I love the variety of lengths of the cords, but the oily smell that came from them was overwhelming! I left a few cords outside to air out and they still have an oily smell after being outside for days!",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20201010
    },
    {
      "title": "Good value and variety.",
      "text": "I ordered two sets to help me tie things down inside a Moving Container (POD). I like that the bungee cords come in different lengths. They seem sturdy/strong. I will update my review once I open up the storage pod and see how things arrive. Otherwise so far so good.",
      "rating": 5.0,
      "verified": true,
      "author": "Francisco Rodriguez",
      "helpful_votes": 0,
      "publication_date": 20200501
    },
    {
      "title": "Handy assortment of quality bungee cords",
      "text": "Getting ready to move, my wife stole a bungee from my Miata's trunk. This pack is a very useful replacement. Thick, quality feeling bungees in a useful assortment of sizes, the perfect thing for keeping stuff in the trunk that has no business fitting in a Miata trunk in the first place. Haven't figured out a use for the canopy/tarp ball ties, but they look like they'll last long enough for me to figure them out, too.",
      "rating": 5.0,
      "verified": true,
      "author": "G. Garrett",
      "helpful_votes": 0,
      "publication_date": 20180605
    },
    {
      "title": "Nice!",
      "text": "Very nice bungees! Came WITH the carrying bag! The amount of bungees you get is awesome enough so to make up for the fact that 2 of the smaller bungees where broken on arrival..... I’m going a few motorcycle rides and will update the review !!!",
      "rating": 4.0,
      "verified": true,
      "author": "gregg",
      "helpful_votes": 0,
      "publication_date": 20200710
    },
    {
      "title": "A lot of Bungees for the money",
      "text": "Haven't used any of the cords yet but I examined them and they appear to be a of a fairly good quality, similar to what's available in stores, and the set comes with a good variety of sizes. Should work fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Ralph",
      "helpful_votes": 0,
      "publication_date": 20200814
    },
    {
      "title": "Perfect",
      "text": "I have bought these several times because I use them for all my tarps I put up outside for shade for my cats. Also have used them to cover my vehicles in the rain. None of these type of elastic bungee cords last forever no matter what brand or how much you pay. I have bought ones that were really expensive and they did not last any longer then these ones. Over time the sun and stretching wears them out.",
      "rating": 5.0,
      "verified": true,
      "author": "Morrie",
      "helpful_votes": 0,
      "publication_date": 20180721
    },
    {
      "title": "Versatility",
      "text": "We like your set of bungee cords. The different lengths made it easy to secure the various items we were taking on our trip. We have only had them for a few weeks and only used them a few times, so I can't comment on durability. I assume they shall last a long time.",
      "rating": 5.0,
      "verified": true,
      "author": "#1Cardinal Fan",
      "helpful_votes": 0,
      "publication_date": 20200619
    },
    {
      "title": "A great assortment of bungees that was just what I needed",
      "text": "I needed bungee cords to help secure a tarp over my balcony before a rain storm. I wish I had thought of using bungees earlier. I was using small ropes before and the tarp was never quite fully covering what it needed to. The assortment allowed me to secure the tarp to objects at various distances away to get it just in the perfect position.",
      "rating": 5.0,
      "verified": true,
      "author": "Shopoholic",
      "helpful_votes": 0,
      "publication_date": 20190212
    },
    {
      "title": "Overall would recommend",
      "text": "I've had these for several months now keeping it in my car for whenever a bungee situation comes up. I use two 24\" ones to help strap my bike to the rack. The color fades from prolonged exposure to the sun but they have remained sturdy and elastic but stiff enough to keep hold. Overall would recommend.",
      "rating": 4.0,
      "verified": true,
      "author": "SdR",
      "helpful_votes": 0,
      "publication_date": 20190714
    },
    {
      "title": "something I didn't know he needed.",
      "text": "Husband is always asking for things for his bike, these seemed like a good idea and not just a typical want so I purchased them as a gift. He loved them! Came packaged well and seem to be getting the job not only done but, the job done right.",
      "rating": 5.0,
      "verified": true,
      "author": "shan",
      "helpful_votes": 0,
      "publication_date": 20200215
    },
    {
      "title": "Not very stretchy...",
      "text": "I'm used to bungee cords that can stretch a lot. These ones do not. The longer ones stretch a few inches but the shorter ones are near useless unless your tie downs are just perfectly spaced. Not really what I expected but at least they were cheap?",
      "rating": 3.0,
      "verified": true,
      "author": "balconio",
      "helpful_votes": 0,
      "publication_date": 20200121
    },
    {
      "title": "Good variety, quality issues.",
      "text": "Overall I very much like this bungee set. Was somewhat disappointed though when one of the longest yellow bungees separated the elastic within the casing after only one use. Makes it so I cannot trust that bungee anymore. I like the variety that comes in this set, but now I am doubting the quality.",
      "rating": 3.0,
      "verified": true,
      "author": "4TheLoveOfHiking",
      "helpful_votes": 0,
      "publication_date": 20190709
    },
    {
      "title": "Once you have them, you'll find uses",
      "text": "I purchased these for one reason/job. Since having an array of bungee cords available, I've found all kinds of opportunities in which they are helpful/useful. Great resource for the home.",
      "rating": 5.0,
      "verified": true,
      "author": "B.A.2010",
      "helpful_votes": 0,
      "publication_date": 20190625
    },
    {
      "title": "Great for anchoring a box to a pull/push cart",
      "text": "Bought these bungee cords to anchor a large cardboard box to a pull/push cart which ended up working very well. The various sizes are helpful because sometimes you need to anchor things that are smaller/medium/larger sized.",
      "rating": 5.0,
      "verified": true,
      "author": "JoeandJeanne",
      "helpful_votes": 0,
      "publication_date": 20200417
    },
    {
      "title": "The perfect set of bungee cords",
      "text": "My husband loves this set. I ordered these as a replacement for his worn out ones that lasted years and are just now starting to wear. Look forward to 15 years or more within these new ones!",
      "rating": 5.0,
      "verified": true,
      "author": "Class Act",
      "helpful_votes": 0,
      "publication_date": 20200913
    },
    {
      "title": "priced well and accurate",
      "text": "Not the best in the west, but for the price this set is pretty decent. This is a replacement set, I used the originals for an outside hot tub to hold curtains in place. After about a year and a half they frayed and broke...not bad for 100% of the time outside.",
      "rating": 4.0,
      "verified": true,
      "author": "jesse coble",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "Multiple Uses",
      "text": "I bought the product hoping that one size in the jar of cords would enable me to fix a problem with a motorized leave mulcher by securing the leave-catching bag in place. It works perfectly. Now, I also have a supply of cords for other creative solutions...",
      "rating": 5.0,
      "verified": true,
      "author": "JGB",
      "helpful_votes": 0,
      "publication_date": 20191120
    },
    {
      "title": "Several failed ordered in June failed by Sept",
      "text": "We used the longest ones to secure an outdoor umbrella by a planter. We anchored the umbrella to a fence behind the umbrella. All 4 of the cords used have rotted and failed.",
      "rating": 3.0,
      "verified": true,
      "author": "Glenn  H",
      "helpful_votes": 0,
      "publication_date": 20201019
    },
    {
      "title": "These are good bungee cords for the value",
      "text": "These are good bungee cords for the value. None of the cords that I pulled out had any issues and they stretched and worked as expected. The jar as others mentioned here was not helpful and while keeping everything together for shipping compactly it was impossible to take cords out without removing all of the cords. I wonder if large zipper poly bags would be better for using the cords on a frequent basis.",
      "rating": 4.0,
      "verified": true,
      "author": "Q",
      "helpful_votes": 2,
      "publication_date": 20161019
    },
    {
      "title": "Everything you need",
      "text": "This set has everything you need for any bungie situation. I use them for camping, holding down my bag on my cargo rack, and even used them on my 4 wheeler with no issues. Would buy again!!",
      "rating": 5.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 0,
      "publication_date": 20200807
    },
    {
      "title": "Bungee cords",
      "text": "I needed These bungee cords to hold the tarp down on my shed roof. It’s been leaking during the rainy weather. With the different sizes I was able to make the tarp tight so that it didn’t leak or blow in the wind. I find that having all the different sizes makes it very easy to use and convenient. When one wasn’t long enough two together was perfect. They are very durable and they hold up very well",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200405
    },
    {
      "title": "You cannot easily just pull one out",
      "text": "They have worked well so far. I just wish the bucket was bigger or they came with a different storage container. Trying to get one out on the side of the road ended up in me having to pick up a bunch of them that fell on the floor. You cannot easily just pull one out. So I would suggest finding another way to carry them, that would make them easier to pull apart. But the actual tie downs have worked well.",
      "rating": 4.0,
      "verified": true,
      "author": "Starzx510",
      "helpful_votes": 0,
      "publication_date": 20180322
    },
    {
      "title": "Good quality as described",
      "text": "Moved my daughter across the states for her new job. She packed her stuff in a packing cube for a company to deliver it to the west coast, she stacked everything from floor to roof and used these to hold stacks of boxes and furniture - happy to report they held everything in place! Nothing broken, all still in place!! Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "JLH",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "A Nice Variety of Differing Lengths",
      "text": "I have no idea how durable these may be. However, I have used bungees for many things, and needed more to use in my garden and ordered these for the variety of lengths in this jar.",
      "rating": 5.0,
      "verified": true,
      "author": "gendot",
      "helpful_votes": 0,
      "publication_date": 20200905
    },
    {
      "title": "Container doesn’t have a lid",
      "text": "Great product. My container came without a lid. I’m actually only writing a review so that someone from this product will send me a lid. Amazon needs a contact seller button.",
      "rating": 4.0,
      "verified": true,
      "author": "Brandon Warren",
      "helpful_votes": 0,
      "publication_date": 20201014
    },
    {
      "title": "Lots of sizes but not very useful",
      "text": "These bungee cords come in a huge variety of lengths and you get a lot of them. Unfortunately they're pretty much useless outside of very light duty. The elastic is super weak and cannot hold anything. Do not use these to hold any cargo.",
      "rating": 2.0,
      "verified": true,
      "author": "Panda Brewmaster",
      "helpful_votes": 0,
      "publication_date": 20191224
    },
    {
      "title": "Sturdy",
      "text": "Purchased for multiple uses in my garden. Good assortment of sizes and sturdy. Worked well for tying down plant shading tarps and has held up under rain and high winds. Good purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200721
    },
    {
      "title": "Happy so far",
      "text": "These arrived on time and we are pleased with them. The hook appears to be plastic covered metal, which really like as we use them outside and we think we have little or no rust. The cords are taut, but no so much that you can't get them around what you need to secure. We would buy them again.",
      "rating": 5.0,
      "verified": true,
      "author": "rl",
      "helpful_votes": 0,
      "publication_date": 20200711
    },
    {
      "title": "Works Great!",
      "text": "I have only used the bungee cords a few times but so far they have held up. The quality of them seem to be on par with other bungee cords that I have bought in the past. Great stretch to them, and they pack comes with all sorts of sizes. You won't be able to get them back into the container that they came in though.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew Eden",
      "helpful_votes": 0,
      "publication_date": 20191204
    },
    {
      "title": "used for everything",
      "text": "Cords have held my lunch in canisters in the Canoe. They've helped to secure dirt bike parts. They also are my common day-to-day necessities. I drilled holes in a garbage can to use your bungee cords to lock the lids to the cans and to lock the garbages to the fence so it wont blow away. thank you.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Marks",
      "helpful_votes": 0,
      "publication_date": 20190501
    },
    {
      "title": "Great products, items get tangled in provided container",
      "text": "The products are all great and work well. The container sucks, as the cords get caught on each other. However, in looking at the picture, you kinda have to expect that. If I were to buy again, I would likely buy the nicely packaged version that has a zippered case. I'll probably repackage them in something that makes more sense, but I can't knock the product down for since it is the bargain version and the picture accurately depicts what I received.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Kuczynski",
      "helpful_votes": 0,
      "publication_date": 20170319
    },
    {
      "title": "Strong and good variety",
      "text": "These work great for me. They are definitely sturdy, i use them in automotive work to hang my brake calipers/rotors to the shocks and have never had any issues with them. I love that they come in all different lengths because I have a variety of uses for them, but anyway they're strong and work great. I will say that the container they came in was busted on top but that's probably because of USPS.",
      "rating": 5.0,
      "verified": true,
      "author": "Jon",
      "helpful_votes": 0,
      "publication_date": 20180309
    },
    {
      "title": "They worked like a charm and the board didn't move",
      "text": "The firs time I used them, I was securing a 12' paddleboard in my 6' truck bed. They worked like a charm and the board didn't move. The bungees did not stretch as much as I had anticipated, however, they did the job just fine. The small bungees are TINY. Not sure if I would ever use them. Overall, good product at a good price.",
      "rating": 4.0,
      "verified": true,
      "author": "Kevin",
      "helpful_votes": 0,
      "publication_date": 20180112
    },
    {
      "title": "Great deal for Bungee Cords!",
      "text": "I like the assortment of bungee cords. I'm an old, disabled man without a car. Twice a week I make the trek to a local food pantry. These cords help me secure what I pick up. I can envision many other uses for them.",
      "rating": 5.0,
      "verified": true,
      "author": "WhiteCrow49",
      "helpful_votes": 0,
      "publication_date": 20200520
    },
    {
      "title": "Good product great value!",
      "text": "Loved this item ! It is a good product and a great value. Didn’t need all of them but have been finding uses for most of the sizes ! Came in really handy for many uses,",
      "rating": 5.0,
      "verified": true,
      "author": "kmthome",
      "helpful_votes": 0,
      "publication_date": 20200913
    },
    {
      "title": "Nice assortment! Super handy to keep in the truck.",
      "text": "I like everything about this set. Even the tiny little bungees have come in handy. The tarp tie offs work great too. Had never tried them before and was pleasantly surprised. I’ll probabky end up getting another set of these because I’m using most of these currently to keep things tarped off. Would definitely recommend. Maybe even get two.",
      "rating": 5.0,
      "verified": true,
      "author": "DuckWhisperer99",
      "helpful_votes": 0,
      "publication_date": 20181019
    },
    {
      "title": "Great value!",
      "text": "I would definitely recommend this bungee cord value pack. It has many different sizes, and we have used all of the different sizes for various projects. It is now a staple in our tool box.",
      "rating": 5.0,
      "verified": true,
      "author": "Seamonkies007",
      "helpful_votes": 0,
      "publication_date": 20200915
    },
    {
      "title": "Great Bungees",
      "text": "Had to replace some old bungees we had. These worked great! Not too bulky on the hooks and color coding helps identify different tensions needed. Definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Kapsluck",
      "helpful_votes": 0,
      "publication_date": 20200827
    },
    {
      "title": "Bungees for different uses",
      "text": "I needed multiple sized bungees for different tasks and stumbled upon this listing. For $20, it was a bargain. Do not let the price put you off as they are very good quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Kiz",
      "helpful_votes": 0,
      "publication_date": 20200730
    },
    {
      "title": "Great cords, they bungee when they have to bungee",
      "text": "Great cords, tested them on 3 different lake trips and they worked as expected. If I ever had to I would buy again. But I'm hoping this product is good enough I would need to replace",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Kieper",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "Great Deal, Versatile",
      "text": "This package has several different items to make securing anything anywhere easy. I was surprised to get so many pieces for that price. I have not used them that long so I haven't been able to put a rating for the durability but they seem like quality products.",
      "rating": 5.0,
      "verified": true,
      "author": "Christopher Forestt",
      "helpful_votes": 0,
      "publication_date": 20190713
    },
    {
      "title": "Image in the Amazon page is not accurate.",
      "text": "The image on the web page showed cords with metal hooks. The ones I received had molded plastic hooks on all but the smallest cords. Unfortunately, the plastic hooks are larger and cannot be bent or otherwise adjusted which is a problem for me. Otherwise, the cords seem functional and nicely made.",
      "rating": 3.0,
      "verified": true,
      "author": "Mebis",
      "helpful_votes": 0,
      "publication_date": 20190206
    }
  ],
  "product_meta": {
    "title": "Cartman Bungee Cords Assortment Jar 24 Piece in Jar - Includes 10\", 18\", 24\", 32\", 40\" Bungee Cord and 8\" Canopy/Tarp Ball Ties",
    "rating": 4.7,
    "feature_bullets": [
      "Designed to secure objects to the vehicle",
      "Made from rubber cords for superior strength",
      "(6) 18”, (4) 24”, (2) 32”, (2) 40”, (6) 10\"mini cords and (4) canopy ties",
      "UV resistant cord jacket",
      "Color coded by length for convenient selection"
    ],
    "specifications": {
      "Manufacturer": "Cartman",
      "Part Number": "LO-3A3T-C6XV",
      "Item Weight": "10.6 ounces",
      "Product Dimensions": "7.87 x 3.54 x 3.54 inches",
      "Is Discontinued By Manufacturer": "No",
      "Size": "24pk",
      "Material": "Rubber",
      "Item Package Quantity": "1",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "ASIN": "B00S7HKJ1I",
      "Customer Reviews": "4.7 out of 5 stars4,588 ratings4.7 out of 5 stars",
      "Best Sellers Rank": "#399 in Tools & Home Improvement",
      "Date First Available": "January 14, 2015"
    },
    "categories": [
      "Tools & Home Improvement",
      "Hardware",
      "Bungee Cords",
      "Tarps & Tie-Downs"
    ],
    "price": 16.99
  }
}