{
  "website_summaries": [
    {
      "verdict": "An expertly constructed and lightweight massager that helps to quickly reduce or eliminate foot pain.",
      "pros": [
        "Designed for use both indoors and outdoors",
        "Weighs approximately 1.6 pounds",
        "Helps alleviate pain associated with plantar fasciitis and other foot problems",
        "Theaceae wood construction guarantees the massager is strong and sturdy"
      ],
      "cons": [
        "Sometimes emits a pungent odor",
        "Rollers tend to jam and won't roll freely at all times"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Foot Massager comforts whole body",
      "text": "I have had the product--Theraflow Foot Massager--for a few days and used it several times a day for up to 2 minutes each time. The product is absolutely fantastic! Comfortable, easy to use--just sit, relax and gently move your feet back and forth. Now, as for results--WOW! My feet feel so relaxed where before they always felt tight. Nerve endings are soothed. More than this, there have been all body reaching effects. For instance I carry stress in my shoulders and neck. After a session with the massager, that area feels relaxed. When I use it briefly after a meal, my digestion seems greatly improved. I experience overall relaxation throughout y body. Thank you for this great product!",
      "rating": 5.0,
      "verified": true,
      "author": "Caro",
      "helpful_votes": 241,
      "publication_date": 20180925
    },
    {
      "title": "This product is amazing! I started recently having stabbing pains in my ...",
      "text": "This product is amazing! I started recently having stabbing pains in my heel- I was told by a podiatrist I have bone spurs and plantar fasciitis- all he did was give me a cortisone shot (which only lasted a couple of weeks and which I later received a $300 bill for) and sell me on some $60 insoles. I'm so glad I came across this product! It feels SO GOOD on my feet and even though I've only had it a few days I'm already having less foot pains.",
      "rating": 5.0,
      "verified": true,
      "author": "Laura Christine Wickiser",
      "helpful_votes": 264,
      "publication_date": 20170302
    },
    {
      "title": "Excellent for tired feet!",
      "text": "Not only do I love it, but it doubles as a cat toy :)",
      "rating": 5.0,
      "verified": true,
      "author": "S.J. Smith",
      "helpful_votes": 104,
      "publication_date": 20190905
    },
    {
      "title": "Theraflow dual foot massager",
      "text": "Not originally for myself but admit I’ve used it a few times already. The knobby part feels the best imo and overall a good way to ease some foot pain. Has padding on the bottom to help keep it from sliding around or maybe scratching floors. I didn’t notice any odd smell the seller mentioned from the wood finishing process.",
      "rating": 5.0,
      "verified": true,
      "author": "Suzanne",
      "helpful_votes": 102,
      "publication_date": 20180927
    },
    {
      "title": "Great product! **Be sure to read seller’s message before first use**",
      "text": "When I received this product I had already been previously contacted by the seller informing me of how to properly use it upon its arrival. I thought that was very courteous and smart on their part. Had I not received their email I might’ve unknowingly misused the massager. I love this foot massager! I have used it every day so far and my feet feel wonderful afterward. I was recently diagnosed with plantar fasciitis and had been experiencing a lot of pain in my arches. This massager (which was approved for use by my doctor) has been helping a lot to ease that pain. I highly recommend this product!",
      "rating": 5.0,
      "verified": true,
      "author": "jsmiles33",
      "helpful_votes": 84,
      "publication_date": 20180414
    },
    {
      "title": "WOW, I can't believe it helped in less than a week",
      "text": "I can't believe it - 3 days of using this three times a day and my foot pain is much better. Each foot has different issues, and the most recent issue, pain in my right foot that felt like all the bones were out off place, is completely gone. I've had plantar fasciitis in the left foot for 2 years, which I treat per podiatrist's therapy. It is still there, but does feel better. I'll update about the plantar fasciitis after more use of the roller. Very sturdy, well-made item that doesn't slide on a rug. I am very happy with the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Darrell",
      "helpful_votes": 111,
      "publication_date": 20160905
    },
    {
      "title": "Easy to use and well made.",
      "text": "When I received my massager, I immediately opened it and tried it out. It was smaller than I expected but it is big enough for my feet (size10 US). The rollers are very good and the massager feels like it is well built suitable for anyone. It’s very easy to use and after a few minutes my feet felt good. I can’t wait to use it after a long day of standing. This is a big help. I’m pleased and look forward to using it after work.",
      "rating": 5.0,
      "verified": true,
      "author": "Roe1577",
      "helpful_votes": 49,
      "publication_date": 20180706
    },
    {
      "title": "I did not work for me..",
      "text": "Maybe I have a higher tolerance to pain?? I did not like this at all. I was so extremely disappointed because I really, really wanted to like this. I was excited when it arrived. I'm suffering from plantar fasciitis on my left foot and this didn't work. I have to apply so much pressure just to feel something. I asked my husband to use it because I was considering keeping it if it worked for him but he had the same reaction. He just felt a very light tickling sensation. Unfortunately, I am in the process of returning this.",
      "rating": 1.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 33,
      "publication_date": 20181025
    },
    {
      "title": "Blissful relief",
      "text": "Seemed kind of counterintuitive to put my poor tender feet on hard wood with ridges and knobs on it, but by starting gently and working up to more pressure, this gives marvelous relief to sore, tired feet. Usually, those first few steps in the morning are the most painful. This morning, I did the TheraFlow Roller for just a minute or so (gently) and those first steps were much less painful. Great product if you suffer foot pain. And I like the idea that it is treating my entire body at the same time through the reflexology points. I love win-win situations!",
      "rating": 5.0,
      "verified": true,
      "author": "Info Seeker",
      "helpful_votes": 33,
      "publication_date": 20181012
    },
    {
      "title": "Excellent self foot massage.",
      "text": "I decided I needed something easy to massage my entire foot--both feet at the same time. This really helps as opposed to a single that looks like a studded free hand weight. I was looking for something that would help as post-plantar fascitis treatment and keep things moving forward. It really works well and helps me a lot. If only it had something that could do the tops of one's feet at the same time....",
      "rating": 5.0,
      "verified": true,
      "author": "Sandra B. Myers",
      "helpful_votes": 31,
      "publication_date": 20180626
    },
    {
      "title": "Excellent Foot Massager",
      "text": "I started using the TheraFlow Foot Massager for ten(10) minutes twice daily, as per the very clear instructions that was supplied with Roller. I must attest that the supplier/manufacturer did an excellent job in fabricating the Roller as well as producing a very clear instruction accompanying it. The laminated sheet of instructions reveals a professional Supplier.",
      "rating": 5.0,
      "verified": true,
      "author": "Salih",
      "helpful_votes": 37,
      "publication_date": 20180320
    },
    {
      "title": "I am happy with this item",
      "text": "I am happy with this item. There are two different textures and after doing the treatment for several days, my symptoms improved. Plantar Fasciitis takes a long time to heal and I will likely continue using this for a very long time even after I heal. I also do some foot stretches. I didn't know how common my symptoms were until I got it from gardening on a hillside and went online to research what causes foot pain. I am happy I found this device. If you have plantar fasciitis or foot pain, especially in the morning - I think this device is definitely worth a try.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 21,
      "publication_date": 20180820
    },
    {
      "title": "Happy birthday, happy feet",
      "text": "This went right under my desk for my tired feet and they've been happier since... As described, it's sturdy and well made. One row has more \"intense\" (can't think of a better word right now) knobs, but the user guide addresses how to position it if it's too much for your feet. Of course, the best part is being able to control the speed and pressure of the input depending on the day/moment. This was a birthday present to myself and I'm sending myself a thank you card",
      "rating": 5.0,
      "verified": true,
      "author": "Julina",
      "helpful_votes": 30,
      "publication_date": 20180603
    },
    {
      "title": "Aaaaahhhh.  Relief!",
      "text": "I read about this foot roller in an article about items on Amazon that have a cult following. As I've been having some foot pain, lately- I decided to try it out. I've had it for less than a week... and I'm already a satisfied customer! For over a month, I've been waking up and limping around because of pain in my heel. Rolling my feet over this for 5-10 minutes a day has made them feel so much better. It feels good while I'm \"medicating\"- so it's kind of unbelievable to me that the relief lasts. I'm so glad I read that article and purchased this!",
      "rating": 5.0,
      "verified": true,
      "author": "Texan in Ohio",
      "helpful_votes": 41,
      "publication_date": 20180219
    },
    {
      "title": "Great Product - SRSLY",
      "text": "I bought this a while back, like six weeks or so. I got the large one because I have man-sized feet. Oh, wow. You want this. Diabetic? Circulation problems? You definitely want this. My daughter came over and tried it for less than a minute and said, \"I have got to get one of these.\" It came promptly, it's sturdily made, the price is great. Just ... just go ahead and buy it. I keep mine in the kneehole of my desk and rest my feet on it all day and all kinds of great things happened. Ooo! Christmas is coming. Best present ever.",
      "rating": 5.0,
      "verified": true,
      "author": "Julia Mae",
      "helpful_votes": 28,
      "publication_date": 20171103
    },
    {
      "title": "Extreme Quality and Effectiveness",
      "text": "Having Diabetic Neuropathy in my feet, I tried this to increase circulation. After just 4 daily uses (sitting in a chair before bed watching TV, use it for 5 to 10 minutes) , my feet have some sensation coming back, especially around my heels. Plus I tried it on my hands while sitting at the Computer, and the hands feel better. And for only $16. This has the quality of a $100 product. Solid made. I'm gonna buy 2 more just to stash away in case they get discontinued. One back-up, one for my brother.",
      "rating": 5.0,
      "verified": true,
      "author": "D. C.",
      "helpful_votes": 12,
      "publication_date": 20200721
    },
    {
      "title": "very good, not great",
      "text": "This item is quite good, but I thought the pressure points would be a bit better on the foot. If you like getting your foot rubbed often. This is a great product, but if you think it's going to feel like a person rubbing your foot. I think it lacks certain pressured areas. Thanks",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 22,
      "publication_date": 20191101
    },
    {
      "title": "BEST thing for foot pain.",
      "text": "My mother LOVED it! She even said a curse word when she first tried it since it felt amazing on her aching feet. Lol I was excited to watch my moms expressions of enjoyment as she tried it, that’s how I knew I had bought the PERFECT thing for her feet that she much needed. Will definitely recommend. My mother was using a tennis ball to do her feet excirsices recommended by her doctor but this has totally moved it to the next level and provided much more relieve. It does have a “unique” smell but it goes away and don’t be discourage by it. Plus it does not interfier with any of the functions.",
      "rating": 5.0,
      "verified": true,
      "author": "Val calixtro",
      "helpful_votes": 34,
      "publication_date": 20181124
    },
    {
      "title": "\"Heel\" your \"sole\"!",
      "text": "I love this massager. I work in a large facility and put on quite a few miles walking. I keep this tucked under my desk and use it every afternoon when my feet are sore. It provides pain relief and is invigorating too. It's a nice size and has solid construction.",
      "rating": 5.0,
      "verified": true,
      "author": "Denise",
      "helpful_votes": 20,
      "publication_date": 20190521
    },
    {
      "title": "This thing is Amazing!",
      "text": "So I was a little worried I would get a message that was broken or bent or something- but mine is more than fine - it’s actually pretty - smaller than expected; I can only imagine if I would have bought a smaller one. It is made of theaceae wood - very nice, it has a well polished smoothness and lacquer. I am happy with this purchase and would buy one again.",
      "rating": 5.0,
      "verified": true,
      "author": "Joey Gamboa",
      "helpful_votes": 24,
      "publication_date": 20180716
    },
    {
      "title": "Decent",
      "text": "Product is made well and easy to use. I personally didn't get the relief I was seeking. For me it just felt like I was rolling my feet on wood and I didn't really feel the spikes. I've had 3 foot surgeries so that might be a factor in my nerve damage.",
      "rating": 3.0,
      "verified": true,
      "author": "AO",
      "helpful_votes": 31,
      "publication_date": 20190626
    },
    {
      "title": "Nauseating odor from the rubber stuck to the massager.",
      "text": "This foot massager has some rubber stuck to it that has a strong chemical odor that made my entire family nauseated and sick. I had to keep it out before I could return.",
      "rating": 1.0,
      "verified": true,
      "author": "an",
      "helpful_votes": 24,
      "publication_date": 20180322
    },
    {
      "title": "This dual massager does NOT get deep enough.  It just massages the skin.  Get the single roller model instead.",
      "text": "Purchased the single roller massager and this dual roller. Love the single roller because the protrusions are more prominent and less of a pitch, so the single roller gives a much better and deeper massage. This Dual Massager seems to just rub the skin and brings no relief. Cannot massage deep in the arches. Not a good design. Will return this model and buy several more single rollers.",
      "rating": 1.0,
      "verified": true,
      "author": "Consumer",
      "helpful_votes": 36,
      "publication_date": 20170514
    },
    {
      "title": "Well made for a 200 pound male like me. I walk 5-10 miles a day in ...",
      "text": "This product arrived fast and well packaged. Some people said in their review it had an odor. Mine had none. This is a high quality product. Well made for a 200 pound male like me. I walk 5-10 miles a day in my job so when I come home I put this to work. When I work on the computer I just sit there and back and forth. WOW they feel great on this. When I watch TV also. This is an excellent made product that will last for years. My new friend after coming home from work.",
      "rating": 5.0,
      "verified": true,
      "author": "Don Dolenec",
      "helpful_votes": 27,
      "publication_date": 20170202
    },
    {
      "title": "Small but mighty",
      "text": "For Christmas, my husband bought me this big fancy shiatsu foot massager that has heat and compression, too. It does a great job, but my feet were still hurting every day. I will say that the biggest change for me has been insoles and just more supportive shoes in general, but before I made that discovery, I bought this little manual roller to take with me to work. I gotta tell ya.. it works a treat! Just a few minutes on this roller, and my feet feel SO much better. I hate to say it, but I think it does a better job than my fancy shiatsu massager. Glad I bought it.",
      "rating": 5.0,
      "verified": true,
      "author": "littlewren",
      "helpful_votes": 11,
      "publication_date": 20190128
    },
    {
      "title": "Good customer service",
      "text": "Product as described. When I received the roller, it did have quite an odor, but the company is really good. They had previously e-mailed me to advise me this might be the case. The odor is from the varnish they use and dissipates quickly. The company provides excellent customer service and contacts customers frequently to check if everything was received OK and is working properly. It's a pretty simple product and works as advertised. An update - a week later - I just ordered a second one for my sister. It is a great little product for improving circulation in your legs and feet. The company is also awesome at customer service. They want to assure everyone is well-satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "reader",
      "helpful_votes": 32,
      "publication_date": 20170516
    },
    {
      "title": "One Star",
      "text": "squeaks and the outside boards have become crooked and is quickly coming apart after a few uses",
      "rating": 1.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 17,
      "publication_date": 20180503
    },
    {
      "title": "Wonderful!",
      "text": "I purchased this product to help with some minor neuropathy my mother is experiencing, contributing to some balance issues . Her neuropathy subsided within a few days, as a bonus, my wife (who works on her feet all day) loves it, I love it, even our cat loves it, (seriously, he plays with it). Product arrived sooner than estimated, in great shape, good quality. An excellent buying experience!",
      "rating": 5.0,
      "verified": true,
      "author": "Brian Cosner",
      "helpful_votes": 33,
      "publication_date": 20171207
    },
    {
      "title": "swollen ankles and feet",
      "text": "Have had recent issues with fluid retention in my feet and ankles. Plus some definite pain in my toes and feet. Used this for 3 days and nights now I have regular ankles again! I don't have a before pic, but my legs were swollen enough that my ankles had no regular shape. Toes are still hurting. I have to put a heavy towel over the device when I use it. Working for me.",
      "rating": 4.0,
      "verified": true,
      "author": "steven",
      "helpful_votes": 9,
      "publication_date": 20190726
    },
    {
      "title": "Great product!",
      "text": "I bought this for my 92 year old mother who has plantar fasciitis and neuropathy and just all sorts of discomfort with her legs and feet. She’s tried various massagers, a stationary bicycle, medication, and a single wooden roller that she had to switch back-and-forth from foot to foot. She received this product today and I got a call from her, just elated and delighted at how good it felt to have both feet massage at the same time and commenting that the part that massages her heels is particularly nice. This is a very good product for a little bit of money. We highly recommend it. Thank",
      "rating": 5.0,
      "verified": true,
      "author": "Kathy Baker",
      "helpful_votes": 5,
      "publication_date": 20200502
    },
    {
      "title": "Great product",
      "text": "The theraflow foot massager is a very well made massager. I have only had it for 5 days, and already see a change. I really think it is helping my poor blood circulation in my feet. They do not feel as stiff as they did. I use it twice a day morning and evening ten minutes at a time. I hope this helps others with the same problem.",
      "rating": 5.0,
      "verified": true,
      "author": "Lucy",
      "helpful_votes": 17,
      "publication_date": 20170606
    },
    {
      "title": "WOW!",
      "text": "After not working for a few months I got back into work (at Starbucks where being on your feet and walking back and forth all day is a given) i started working 8 hr shifts which were super exhausting for me. I was in constant pain and even thought I had plantar fasciitis, I tried buying new insoles for my work shoes but that only mildly alleviated the pain. I searched for something to help ease the pain when I was finally able to come home and relax. I this thing is AMAZING! It’s helped so much with the pain in my heels.",
      "rating": 5.0,
      "verified": true,
      "author": "natalie a.",
      "helpful_votes": 22,
      "publication_date": 20180618
    },
    {
      "title": "5 months later and it's broken",
      "text": "After only five months of moderate use an entire row has broken completely off. I am sometimes able to stick it back into the holes but as soon as I use it the piece falls right off again. I never really noticed much pain relief but it did feel nice on my feet. Another thing that annoyed me was that it was very squeaky and annoying when I first got it. I had to go out and buy WD40 to be able to use it under my desk at work without annoying the people around me.",
      "rating": 1.0,
      "verified": true,
      "author": "Talal",
      "helpful_votes": 6,
      "publication_date": 20191212
    },
    {
      "title": "More like FOOT varnish odor...",
      "text": "This seemed like a smart purchase considering I am on my feet a lot, and need foot pain relief. However, when I received this, it literally REEKED of feet. They claimed it was a wood varnish odor that would dissipate if aired out for a few days. Nope. It still smells like feet. I am beyond grossed out, and refuse to use it now. I don’t know of any wood varnish that leaves a distinct foot smell. I had high hopes too. The foot chart was missing as well. Complete bummer.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 13,
      "publication_date": 20180311
    },
    {
      "title": "Well made and does it's job on reducing the swelling ...",
      "text": "Well made and does it's job on reducing the swelling on my 82yo mothers foot, and legs. It's been 3 weeks and I haven't hear any complaints from her. I'm at peace :-)!",
      "rating": 5.0,
      "verified": true,
      "author": "Robby A.",
      "helpful_votes": 29,
      "publication_date": 20170622
    },
    {
      "title": "Eliminated The Pain",
      "text": "I read reviews for this product and decided to try it because I had so much foot pain that I was willing to try anything. Two months later I feel like a new woman. I don't know how this product cured my foot pain but it did. It worked so well that I have already referred several friends to buy this and they feel better too. Granted there are days when my feet are sore. When I have any sore feet pain, I pull out my roller and the pain is gone when I wake up the next morning.",
      "rating": 5.0,
      "verified": true,
      "author": "Debra",
      "helpful_votes": 24,
      "publication_date": 20191117
    },
    {
      "title": "Meh...",
      "text": "Seems like a decent product, however the box it came in was a bit crushed despite the shipping box being fine. Plus my garage door was open and the delivery guy was going through it when I heard his phone go off. Then he peeled out of the driveway. Not sure if I dare order again...",
      "rating": 3.0,
      "verified": true,
      "author": "shannon roy",
      "helpful_votes": 22,
      "publication_date": 20181211
    },
    {
      "title": "Theraflow gives a great foot massage! Great product!",
      "text": "I bought the Theraflow foot massager because I have plantar fasciitis and other reviewers said it helped that condition. It really does! I use it gently because of my foot pain and it massages my feet and also loosens up tightness. I use it every time I've been sitting a while so that before I start walking my feet have already been stimulated and loosened up. It's lightweight, not bulky, and a great price.",
      "rating": 4.0,
      "verified": true,
      "author": "Cynthia C.",
      "helpful_votes": 5,
      "publication_date": 20190309
    },
    {
      "title": "Ticklish? Then nope!",
      "text": "It's hard for me to decide how many stars to give this, because I can't use the thing. I don't think that the product is flawed, but if you have ticklish feet, there is no way you will be able to use this product. I've tried it several times, and even with putting heavy pressure on it, it still tickles my feet so bad I can't stand it!",
      "rating": 3.0,
      "verified": true,
      "author": "Squeak",
      "helpful_votes": 29,
      "publication_date": 20180421
    },
    {
      "title": "Why is it the customers job to air out the toxic fumes??",
      "text": "This is a great for massager, but instead of writing in the material sent with the product that the BUYER needs to air out the foot massager before using n the manufacturer should air out the polyurethane coating smell BEFORE packaging! The smell is rancid and impossible to get out of your room or off your hands. It's been raining here, so I can't leave it outside to air out. Shame.",
      "rating": 3.0,
      "verified": true,
      "author": "DLB",
      "helpful_votes": 8,
      "publication_date": 20170831
    },
    {
      "title": "We love our TheraFlowDual Foot Massager",
      "text": "We love our TheraFlowDual Foot Massager! With the combination of diabetes and plantar fasciitis, my feet talk to me a lot. After studying the various aids for foot ache/discomfort relief, I decided to go with this product and model so both feet could benefit. Because I my feet are not too sensitive, I can use the massager barefooted with great results... seems like the tension in my feet disappears quickly. I highly recommend this product, especially to people with plantar fasciitis!",
      "rating": 5.0,
      "verified": true,
      "author": "K. Aanestad",
      "helpful_votes": 23,
      "publication_date": 20171007
    },
    {
      "title": "this is clumsy at best. If you want your whole foot flat on ...",
      "text": "If you're standing up, this is clumsy at best. If you want your whole foot flat on the massager, then do one foot at a time, otherwise, you're only hitting the right side of your left foot and the left side of your right foot. Silly design makes the other half obsolete. Maybe they have single foot units that you can separate so you get the proper angle for both feet at the same time. But it does massage well.",
      "rating": 3.0,
      "verified": true,
      "author": "Richard S. Lodato",
      "helpful_votes": 26,
      "publication_date": 20180504
    },
    {
      "title": "Must have for foot pain relief",
      "text": "Great pain relief, great option, and comes in two sizes (I bought the XL and recommend that size for home use, or the regular size if for some reason you’re a minimalist or your foot is small. I’m a 5’1”” female size 10 shoe, the XL model is great for “wiggle room” and turning your foot at slight angles. I used to see these as a kid as wondered why anyone needed this, now that I have osteoarthritis in both feet, high arches and a torn tendon, I can’t live without this product. Think of it as foot health.",
      "rating": 5.0,
      "verified": true,
      "author": "Tracey Wagner",
      "helpful_votes": 7,
      "publication_date": 20200202
    },
    {
      "title": "The product is good but for me it is just OK.",
      "text": "I have many foot massage tools and like to have more deeper stimulation, the reason I select this one is because there are two rows with protruding knobs. It is ok for me as I like more deeper knead, so I still prefer to using my golf balls and my Acupuncture Foot Massage Insoles. I am a ballet dancer, so we use the golf balls or tennis balls to stimulate our foot a lot. I might give this to my dad.",
      "rating": 3.0,
      "verified": true,
      "author": "Joyce",
      "helpful_votes": 11,
      "publication_date": 20171121
    },
    {
      "title": "Fantastic Foot Massager & Circulation Stimulator",
      "text": "I have Type 2 Diabetes and my feet often hurt and/or experiences severe neuropathy. I loved my first unit so much that I purchased one for each of my desks (4 ea) and left them at each location. When I work on any of the computers at the various locations, I can roll my feet over the massager and relieve any neuropathy or lack of circulation. I would highly recommend these to anyone suffering from foot neuropathy or poor circulation.",
      "rating": 5.0,
      "verified": true,
      "author": "Tim & Kathy Wells",
      "helpful_votes": 4,
      "publication_date": 20181113
    },
    {
      "title": "It Works!",
      "text": "I received my TheraFlow Dual Foot Massager today! What a difference I feel already since using it. My pain level has gone from 8 to 3 since using it today. I was recently diagnosed with plantar fasciitis which has been manageable for the most part. However, within the last two weeks the pain in my right foot has become almost intolerable to the point where it is hard to walk all the time. It feels like my heel bone is trying cut through my heel. I would definitely recommend this product as I am already experiencing relief.",
      "rating": 5.0,
      "verified": true,
      "author": "Natalie",
      "helpful_votes": 19,
      "publication_date": 20190925
    },
    {
      "title": "Keep It Simple Simon",
      "text": "Awesome. It hasn't \"cured\" my fasciitis, but my foot sure feels better after I use it. I take it to work with me and use it under my desk. It does have a \"varnish\" smell when you first receive it, but after a couple of days it airs out and goes away. With all the high tech electronic gadgets out there, this seems like such a basic little thing, but that is what makes it great. I pop it in my work bag, slip it under my desk. It is low key, quiet, and provides simple relief from the pain.",
      "rating": 5.0,
      "verified": true,
      "author": "V. Brown",
      "helpful_votes": 18,
      "publication_date": 20170409
    },
    {
      "title": "Pros and Cons",
      "text": "I'd give it a 4 because it has two sides and it's more effective than most rollers. It did have a strong varnish smell but it's better now. I do worry about if coating could be toxic. Not just to my feet but to pets if they happen to chew on the roller? Wish u would coat it with something else besides varnish or not coat it at all.",
      "rating": 3.0,
      "verified": true,
      "author": "Mickey N.",
      "helpful_votes": 9,
      "publication_date": 20190214
    },
    {
      "title": "I got this as a last minute gift idea and he's really happy with it- he says it feels good",
      "text": "My husband has had surgery on both feet for his plantar faschitis. I got this as a last minute gift idea and he's really happy with it- he says it feels good! This is coming from someone who works on their feet, has had the surgeries, and wears the surgical boot to stretch his foot nightly! I am glad I found something that brings him some comfort!",
      "rating": 5.0,
      "verified": true,
      "author": "K. Claiborne",
      "helpful_votes": 8,
      "publication_date": 20170620
    },
    {
      "title": "Helps my Sensory Processing Disorder Child",
      "text": "My feet are always in pain. So figured I would give this a try. Unfortunately I didn't really see the relief that other reviews have raved about. It feels good, but my acheing feet still hurt. Maybe I just need more time using it. Personally I would give it 2 stars, but my 3 year old who has Sensory Processing Disorder and Anxiety really loves this. He saw me using it and wanted to try it out. I rolled his feet back and forth while he sat in a chair and it calmed him down that he wasn't sensory seeking as much. So since it helped my son I bumped my two stars up to 4.",
      "rating": 3.0,
      "verified": true,
      "author": "L Clo",
      "helpful_votes": 20,
      "publication_date": 20200123
    },
    {
      "title": "Best Product-amazing results!!!",
      "text": "This product is nothing short of amazing!!!! My Dad has suffered from neuropathy due to diabetes,and it has been years since he has had feeling in his feet. I saw this product on Amazon and read the fantastic reviews. I purchased this for my Dad and he has had amazing results! He uses this foot massager every morning and night,and for the first time in many years, he now has feeling in his feet! I wish all Doctors would mention this product to their patients!",
      "rating": 5.0,
      "verified": true,
      "author": "Julie",
      "helpful_votes": 14,
      "publication_date": 20180112
    },
    {
      "title": "Feels amazing, Helps with my Plantars Fasciitis",
      "text": "Oh my gawd 😍 Fantastic. For awhile I was trying hard to ignore the pain in my feet, unwilling to admit the toll middle age had taken on me... Such a cliche... Well when I couldn't ignore barely being able to sleep, and waking up dreading the first few steps, I finally decided to try and fix it. This feels amazing. Between this massager, foot compression sleeves and rolling my feet over frozen bottles of water, Plantars Fasciitis is just a minor inconvenience not a major pain.",
      "rating": 5.0,
      "verified": true,
      "author": "Saul McClintock",
      "helpful_votes": 14,
      "publication_date": 20160908
    },
    {
      "title": "Too painful for my feet",
      "text": "I suffer from chronic plantar fasciitis for over three years now and I hoped this gadget would help me but made my feet hurt more. It tried a few times with the same result. The few times a tried I rolled my feet slowly and didn’t go very deep but it still hurt my feet. Sad, we ended giving this away to someone else.",
      "rating": 3.0,
      "verified": true,
      "author": "dudefacebusta",
      "helpful_votes": 25,
      "publication_date": 20181227
    },
    {
      "title": "This is better then the last I bought!",
      "text": "I bought a smaller version similar to this one years back and it worked well for a long time until the spindles starting coming off from wear. This version is much larger, if you use both feet on it at the same time they have plenty of room to roll. Well made, sturdy and different nubbies to make your feet feel pretty good. Don't think you will go wrong buying this one unless you have very sensitive feet maybe the nubs that stick up furthest would bother you. Well worth the money, try it!",
      "rating": 5.0,
      "verified": true,
      "author": "Cheryl",
      "helpful_votes": 7,
      "publication_date": 20190530
    },
    {
      "title": "I just roll my feet over the rollers every morning when I am at the computer and the good tingly feeling lasts all day",
      "text": "I am a natural-born skeptic so wasn't sure if this would make my feet feel more energized but it has exceeded any expectations. I just roll my feet over the rollers every morning when I am at the computer and the good tingly feeling lasts all day. It may be a coincidence but I feel like any foot and leg discomfort I had before is just about eliminated. Their Customer Service is excellent. You would have to try the Foot Massager to believe it. Highly recommend....:)",
      "rating": 5.0,
      "verified": true,
      "author": "Eileen Kimbell-Meaney",
      "helpful_votes": 13,
      "publication_date": 20180412
    },
    {
      "title": "poor design",
      "text": "poor design. middle rollers do absolutely nothing (but squeak), and to obtain any decent pressure on foot arch from the first row, I have to contort my foot at awkward angle..... and even then, it provides very little relief. I stand in amazement that 85% of reviews on this product are 5-star. really makes me question the entire amazon review system.",
      "rating": 2.0,
      "verified": true,
      "author": "J. Adams",
      "helpful_votes": 7,
      "publication_date": 20170712
    },
    {
      "title": "Almost 5 stars. Still highly recommended.",
      "text": "I'm only taking a star because one of the knobby studs popped off a roller. Seems like they are not glued in, and I am just waiting for others to pop out. That aside, this thing is great. My feet ache after standing for just short periods of time. That made boot camp especially hard. 20 years later, and it's the same. I guess it just have to do with my foot shape. Anyhow, rolling the feet on this just a few minutes totally relieves them. They feel totally refreshed. At least for another 20 minutes or so lol.",
      "rating": 4.0,
      "verified": true,
      "author": "JFK IITop Contributor: Photography",
      "helpful_votes": 7,
      "publication_date": 20190305
    },
    {
      "title": "Great for under the desk!",
      "text": "This foot massager is great! I bought it to help with stress and achey feet that I am experiencing because of the COVID lockdown. I placed the massager under my desk for easy access. Sometimes I use it intentionally to work out a kink in the foot, while other times I use it to keep me focused at work. The design is great—I love the natural wood look of the massager. It is small and portable, so you could easily move it wherever you want. I think it might even work for older kiddos who are learning at home because of the lockdown—it really is great for the jitters and to keep you focused!",
      "rating": 5.0,
      "verified": true,
      "author": "Danielle",
      "helpful_votes": 0,
      "publication_date": 20200412
    },
    {
      "title": "Great massager!",
      "text": "Sometimes after Kendo (martial arts) or a long day, my feet will feel hurt, I tried to put Bengay and so on. But need to fell a better way to comfort my feet. I decided to try on this and surprisingly this one works well! So easy to use (only for 5-10mins) when I watch movie. My feet soon feel comfortable and not hurt anymore after a day of two.",
      "rating": 5.0,
      "verified": true,
      "author": "Koizu",
      "helpful_votes": 19,
      "publication_date": 20190413
    },
    {
      "title": "Awesome massager.",
      "text": "I purchased this for my mom who would always have pain and discomfort in her legs and feet. So decided to buy this and its really helping her. Havent heard her complain about her legs or feet pain in months so I know this is really helping her. This massager does squeek alot but it doesn't bother me as long as its helping her. Definitely recommend for people who are having pain. It gets the blood circulating throughout her legs.",
      "rating": 5.0,
      "verified": true,
      "author": "E",
      "helpful_votes": 0,
      "publication_date": 20200709
    },
    {
      "title": "It makes my feet feel awesome!",
      "text": "I really like this device, it makes my feet feel awesome! One of the nubs did come out, but I just glued it back into place It has started to make rubbing noises as I massage my feet, not too disturbed as the cost of this massager is very inexpensive for the relief my poor feet get. Thanks for making a device that is cost effective!",
      "rating": 4.0,
      "verified": true,
      "author": "Son of the Most high",
      "helpful_votes": 4,
      "publication_date": 20180712
    },
    {
      "title": "The massage you get from this roller feels so good.",
      "text": "This roller makes your feet feel so good. You can get a deep or light massage depending on the pressure you use.The roller gives great relief to the pain in my feet.I personally like the big nubs on the roller I use the roller every night before bed to relax my feet before going to sleep. I bought my first roller a few months back and had my brother-in-law try it out. He has nerve pain in his feet. He liked the feel,so I gave it to him. I then ordered my second one.",
      "rating": 5.0,
      "verified": true,
      "author": "Janice L.",
      "helpful_votes": 4,
      "publication_date": 20180205
    },
    {
      "title": "Great",
      "text": "Omg. Im so happy i found these. I gave it as a gift to my brother, he has flat feet and has so much pain regularly. I hope this gonna help him. So far he liked the product!!",
      "rating": 5.0,
      "verified": true,
      "author": "Gigi",
      "helpful_votes": 18,
      "publication_date": 20171231
    },
    {
      "title": "It works!",
      "text": "This thing is amazing!! I would recommend ordering an Xtra Large. I am a size 11 womens but I think the regular size one would be too small overall regardless of your foot size. This thing feels very good on your feet. I was surprised because I was thinking the rollers might be too hard. But its just right. My feet feel very relaxed. Also you can turn it either way (protruding knobs vs smooth) depending on the amount of pressure you want on your heels. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa",
      "helpful_votes": 6,
      "publication_date": 20200520
    },
    {
      "title": "My feet are in love with this.",
      "text": "OMG. I'm a retail merchandiser and on my feet constantly for work. This foot massager is wonderful, my feet love it. I can sit on the couch, massage my feet by rolling them back and forth on this and it actually works! I've gotten so called foot massagers before but this one is the real deal. I also used to use a tennis ball and roll that around with my foot, while it felt kind of good, THIS blows that away. I recommend it to anyone with tired, aching feet or to anyone who works long hours in retail on their feet. You can thank me later. ;) This would make an awesome gift.",
      "rating": 5.0,
      "verified": true,
      "author": "Julie E. Bandeen",
      "helpful_votes": 0,
      "publication_date": 20200829
    },
    {
      "title": "not well made",
      "text": "At first I was somewhat pleased with this. It's a nice little roller and provided some relief after a long day of tired feet. But it didn't last long. The metal \"pegs\" are too short and constantly come out of the holes. The whole thing kept coming apart.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20200820
    },
    {
      "title": "Well Made!",
      "text": "This device is very sturdy and seems very well made.I have not had an issue with the squeaking as some users have reported.There was a slight chemical smell,but the smell was gone within a couple of hours after opening the package.I have plantar fasciitis and thought this would be a better option than my rolling pin! I have been using it for a couple of days now for about 5 minutes twice a day.It feels really good,at first the pointy rollers cause a little pain.That pain and tenderness does leave the longer you use it.I do believe it is helping with the foot problems!!",
      "rating": 5.0,
      "verified": true,
      "author": "NJS",
      "helpful_votes": 3,
      "publication_date": 20171231
    },
    {
      "title": "Not so good not so bad!!",
      "text": "I had a little more expectation from this, but the massager is very average in terms of pain relief. It feels nice on your foot for sometime, but then it starts to irritate the foot.",
      "rating": 3.0,
      "verified": true,
      "author": "Mayur",
      "helpful_votes": 13,
      "publication_date": 20200814
    },
    {
      "title": "My feet are happy",
      "text": "I really enjoy this massager. I have plantar fasciitis and after using this I get lasting relief. There are just two things keeping this from a 5 star rating. 1) The width. Normal comfortable sitting would be feet about shoulder width apart. To use this with both feet at the same time as suggested I need to squeeze my legs together uncomfortably. I'm plus size, but not much outside of average. So I do one foot at a time, takes longer, but worth the time. 2) Arches. I need to prop this at an angle to get meaningful contact with my arches. overall very happy though.",
      "rating": 4.0,
      "verified": true,
      "author": "TeresaG",
      "helpful_votes": 3,
      "publication_date": 20170823
    },
    {
      "title": "Not useful or helpful",
      "text": "This thing doesn't help do anything but tickle your feet. It doesn't help with plantar fascitis and it's difficult for plus-size people to use as directed.",
      "rating": 1.0,
      "verified": true,
      "author": "Ramble Trickery",
      "helpful_votes": 4,
      "publication_date": 20191112
    },
    {
      "title": "A well constructed device has provided Relief!",
      "text": "The product seems like it is extremely well made. It is a very sturdy construction with awesome rubber pads on the bottom for those people with wood or tile floors. I've tried this on the tile, wood and carpet and it works well on all surfaces. I suffer from Plantar Fasciitis and this has helped me. Now I have only had this 1 week but so far it seems to help relieve the pain. It feels great to just sit there and roll your feet over it. I will try to write an update in a couple of months.",
      "rating": 5.0,
      "verified": true,
      "author": "S. J. M.",
      "helpful_votes": 9,
      "publication_date": 20170408
    },
    {
      "title": "Best thing ever!",
      "text": "So I got this for myself and it's amazing. I have flat feet and walking a lot in flat shoes gives my arch pain. So I just thought I wanted to try this. Immediately after using this for a few minutes my feet felt better. At first it tickles but I got used to it, and now I can roll my aches away while I just simply watch tv. It's like a permanent fixture in the living room. Well then I had to get one for my daughter who works on her feet. And then, of course I gifted one to my bestie. Love this. Best purchase I've made in a long time.",
      "rating": 5.0,
      "verified": true,
      "author": "Rhonda C. Elsaesser",
      "helpful_votes": 6,
      "publication_date": 20200101
    },
    {
      "title": "Well made product ,but doesn't seem to do anything for my feet.",
      "text": "I gave it 3 stars, because it is well made,and I received it on time, but it does nothing for my feet. I guess I shouldn't complain because of the price, but if you are looking for something to massage your feet, this isn't it. I tried using it 3 different times, and it didn't help my feet.. Rubbing my feet on carpet, can do the job better.😐",
      "rating": 3.0,
      "verified": true,
      "author": "Bill. B",
      "helpful_votes": 28,
      "publication_date": 20170416
    },
    {
      "title": "Defective",
      "text": "Please please look in Detail at your product before using, as my husband foot got hurt with little woody thing inside his feet.....very painful for him I felt so sorry to make him use the product at first place....he later other day buffed the area....but still I was not comfortable using yhe product....hence returned. Also note the XL Size of the product is not huge that you can have both feets on one side....it just fits a normal person feet.",
      "rating": 1.0,
      "verified": true,
      "author": "Abhi",
      "helpful_votes": 0,
      "publication_date": 20200814
    },
    {
      "title": "My feet are in paradise",
      "text": "OK, so, it looks odd. In fact, it looks like it might cause a little pain. And it does, especially in the beginning. But the more you do it, and do it by following directions in the handy ebook and chart, you will find some great relief. I am so glad I saw it, and was going to spend money - much more - on something similar that I wouldn't use more than once. As a writer, I am at my desk alot. This is perfect - no more spilling water from a tub that I was soaking my feet in. Yes, i am that girl. Great product!! Try it.",
      "rating": 5.0,
      "verified": true,
      "author": "BBSROO",
      "helpful_votes": 5,
      "publication_date": 20200317
    },
    {
      "title": "Wonderful!",
      "text": "I debated between getting a high tech shiatsu massage machine and something low tech. I decided that getting this wood massager from a company that stands behind their product.T(They also have great follow up after you order.) There were so many pros vs cons to purchasing this product. No outlet needed, travels with me, no sliding or marring my floors, does what the expensive ones do without the expense. I'm glad I opted for this choice, this works great and my feet feel wonderful afterwards. And my 4 year old grandson wanted me to make sure you knew he loves it too.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 9,
      "publication_date": 20161030
    },
    {
      "title": "Has an overpowering smell of varnish",
      "text": "I really like this, but I had to leave it for a month in the garage to air out before I could use it. I'm chemical sensitive and the smell of varnish was overpowering and made me sick. It does not take just a couple of days for it to stop smelling so strong. It takes weeks!",
      "rating": 4.0,
      "verified": true,
      "author": "Seven Stars",
      "helpful_votes": 5,
      "publication_date": 20180502
    },
    {
      "title": "So nice, I'm buying a second one for my boyfriend!",
      "text": "I wasn't expecting much, but I am very pleasantly surprised! I had just bought it as a fidget toy for my feet, but it really gives a nice massage. I was so pleased that I had my boyfriend try it and he didn't want to give it back, so I'm buying him one also! Its wide enough for even his feet, and the action is smooth and very comforting. It is nicely made and I am really enjoying it. Very pleased with the purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "R. S. Home",
      "helpful_votes": 0,
      "publication_date": 20201019
    },
    {
      "title": "Simple set up",
      "text": "I have severe Arthritis. Which was the reason for purchase. I enjoy the feeling of rubbing my foot along the knobs... have I seem a different in pain? No, not really I had ankle surgery 5 months ago. So, hopefully the pain it will eventually subside. Not to mention I was looking for quality and pocket chain friendly budget. Lol if you catch my drift... (reasonable prices)",
      "rating": 4.0,
      "verified": true,
      "author": "Jáde",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Didn't work and missing pieces",
      "text": "I was really excited to get this product as I had used flat massage roller beads in the past. This did not work as well. It was also delivered with missing pieces as some of the massager slots were empty. It did not work as good as I hoped and I contacted Amazon for a return. I have dancers feet and it I need something that has more bend and use in my arch. This feels good but didn't help with pain relief.",
      "rating": 2.0,
      "verified": true,
      "author": "JoeSacramento",
      "helpful_votes": 0,
      "publication_date": 20200730
    },
    {
      "title": "OMG customer service",
      "text": "OMG.... Multi-million companies should learn customer service from TheraFlow. Long story short.... Purchased several 'TheraFlow Dual Foot Wooden Massage Roller' for me and my families during the last 3-4 years. A week ago, one of rollers broke. Sent an e-mail to 'TheraFlow' asking their warranty process. Without a question, I received a brand NEW product at home (within a week). Kudos to entire TheraFlow team...Way to go Thank you A super happy customer",
      "rating": 5.0,
      "verified": true,
      "author": "Arun",
      "helpful_votes": 0,
      "publication_date": 20200913
    },
    {
      "title": "very fine product for those of us who need to pay tender attention to their feet.",
      "text": "My feet have thousands of miles on them which means that the various problems that develop as a result of that kind of mileage are varied and can determine whether one runs or not. This product provides relief especially if used right before and after a run; the relief can be acute or not depending on what you wish to accomplish. I recommend this procedure and product for those who are committed runners (and/or walkers) and who wish to prevent serious injuries.",
      "rating": 5.0,
      "verified": true,
      "author": "achsa",
      "helpful_votes": 0,
      "publication_date": 20181201
    },
    {
      "title": "Good product, but should be able to handle more wear and tear",
      "text": "Personally, love this product... would have given this 5 stars actually, but, a couple of the spokes actually came off the roller after 6 months of use which was a bit disappointing.... could have been sturdier ... I did NOT handle this in a rough or irresponsible manner... was expecting it to last longer without the spokes falling out ... still a good product though",
      "rating": 3.0,
      "verified": true,
      "author": "SUPRIYA PADMANBHAN",
      "helpful_votes": 8,
      "publication_date": 20171127
    },
    {
      "title": "Effective",
      "text": "I am a runner and used regular rollers for my feet. Thing with that is, I need to remember and do it. Now with working from home, I put this roller right under my work desk and it easy to remember and do it. It is different than the regular rollers. This is completely made of wood.So initially it felt weird, but after some getting used to and continuous use, I can see the difference and recovery with it .",
      "rating": 5.0,
      "verified": true,
      "author": "Vinay Chowdhary",
      "helpful_votes": 0,
      "publication_date": 20200709
    },
    {
      "title": "Works Amazingly - Slightly Loud",
      "text": "This is a blessing for your feet! If your looking for foot pain relief option, or simply a tool for relaxation - you have found it. This TheraFlow works wonders, especially for those with plantar fasciitis! The only reason this doesn’t receive five stars is because it squeaks quite loudly as you’re rolling your feet. If you can look past the squeaking however this will truly help relieve any foot pain you’re experiencing.",
      "rating": 4.0,
      "verified": true,
      "author": "Avery",
      "helpful_votes": 0,
      "publication_date": 20200519
    },
    {
      "title": "Great for plantar fasciitis",
      "text": "My husband got this for his painful plantar fasciitis. After 2 days of using it, he was so impressed he ordered a second one for his office and keeps it under his desk. The rollers were sqeaky at first, but the company provides instructions on how to lubricate it, so not a problem. It comes with all sorts of useful information on reflexology and suggestions for use. It has dramatically improved his foot pain, much better than the golf ball he had been using. Highly recommend for foot pain.",
      "rating": 5.0,
      "verified": true,
      "author": "Chandelier",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "Fantastic",
      "text": "I got this because it came up as a product to help with foot pain and as an inexpensive foot massager. In my foot, I got inflammation from wearing new boots and this helped my foot immediately. It broke up all the sore muscle and helped my foot heal faster! I really like it and it feels good to use if you get regular foot pain. I love mine and recommend it to anyone that wants to treat their feet!",
      "rating": 5.0,
      "verified": true,
      "author": "kconn88",
      "helpful_votes": 0,
      "publication_date": 20200606
    },
    {
      "title": "Highly recommend for plantar fasciitis.",
      "text": "I got this to ease the pain from plantar fasciitis. This, in addition to replacing good walking shoes, & cutting back on some volunteer work at a therapeutic riding center (lots of walking in deep arena footing), has helped a lot. What I like most is how easy this is to use. I’m gently rolling my feet on it as I write this review. It is meant to be used while sitting. Easier to use than a ball or other type of roller.",
      "rating": 5.0,
      "verified": true,
      "author": "Dimwit",
      "helpful_votes": 0,
      "publication_date": 20200315
    },
    {
      "title": "Pleasantly surprised",
      "text": "Since I started working retail I've suffered from terrible foot pain. Most of the time barely able to make it around my home. The pain seemed worse after wakeing up. I've only been using the foot massager a few days now but I can see a huge difference. Honestly I wasn't expecting much but I'm pleasantly surprised. My feet truly do not hurt like they did just a few days ago. I don't have to attempt to walk on the sides of my feet or curl my toes just to get around the house. I highly recommend this for anyone who deals with foot pain.",
      "rating": 5.0,
      "verified": true,
      "author": "Jerilynn Stone",
      "helpful_votes": 2,
      "publication_date": 20170921
    },
    {
      "title": "Feels real good",
      "text": "I ordered this for my elder mother and she loves it. I too have tried it and it feels real good. However, I'm not sure if this mark on it is an error or it's supposed to look like that in the picture. Hope it holds up!",
      "rating": 4.0,
      "verified": true,
      "author": "NikkiP",
      "helpful_votes": 3,
      "publication_date": 20181127
    },
    {
      "title": "Instant relief",
      "text": "I was so excited to get this dual foot massager. Other foot massagers I've had , I could only do one foot at a time. This one you do both feet at the same time. I have planter fasciitis and this has helped it so much. My feet do not hurt the next day after using this, and I went a few days without using this and the results lasted. I then continued to use this massager regularly. I now keep it out so every night when I finally sit to relax I then use this. What a great find! I will be telling many people about this.",
      "rating": 5.0,
      "verified": true,
      "author": "Keris",
      "helpful_votes": 0,
      "publication_date": 20190528
    },
    {
      "title": "Works great if it was more sturdy",
      "text": "I like that it hits majority of the feet . The con is that it started breaking (the little nubs) after having used it for like six times and had it under two weeks.... they need to work on the sturdiness",
      "rating": 3.0,
      "verified": true,
      "author": "MissJinKnee88",
      "helpful_votes": 2,
      "publication_date": 20191018
    },
    {
      "title": "Convenient size & soothing foot therapy",
      "text": "My husband has plantar fasciitis & he uses a frozen water bottle each evening to help with stretching per MD orders. We thought this would be an added therapy. He likes the massage it gives his feet. It's very easy & convenient to use. It stores easily in his side table basket. He can also travel with it. Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191004
    },
    {
      "title": "Awesome gift, gives great relief!",
      "text": "I recently bought this as a gift for two different people both with plantar fascitis and arthritis. They are really enjoying their foot rollers. They especially like the prickly parts that some other rollers do not have. They love to soak their feet before or after using this roller for extra relief. The seller sends some additional info when you order, too, explaining how to use it and the different pressure points in the feet. I will probably buy one for myself as well!",
      "rating": 5.0,
      "verified": true,
      "author": "KittyKat",
      "helpful_votes": 5,
      "publication_date": 20190901
    },
    {
      "title": "Slides on floor — won’t stay put.",
      "text": "Received this product a few days ago and tried to use it a few times now. I’m not sure it really does anything at all. I don’t like how it slips & slides across the floor. I have wood floors and it really moves. Even with a rug (not carpet) underneath, it still slides. This makes it difficult to use. For this reason, I haven’t been able to get much of a foot massage at all.",
      "rating": 3.0,
      "verified": true,
      "author": "Freeflight Stained Glass",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "So far so good!",
      "text": "I bought this for my husband who has been having an issue with his foot, probably planters fasciitis but too stubborn to go to the dr about it. I thought this would be great something he could do while sitting and watching tv. It seems to be helping but he doesn’t do it as often as I’d like. A great inexpensive way to treat foot issues.",
      "rating": 5.0,
      "verified": true,
      "author": "hapamama",
      "helpful_votes": 2,
      "publication_date": 20180728
    },
    {
      "title": "a great massager",
      "text": "I love this foot massager. I own an excellent electric foot massager, but currently, nearly all the time I use the easy to use, wooden roller massager. It sits at the foot of my t.v. Chair where I can rest my feet and use the massager. I like it on my toes and heels. I recommend this product to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "jerry",
      "helpful_votes": 0,
      "publication_date": 20190901
    },
    {
      "title": "if you have plantar fasciitis...",
      "text": "GET THIS!!! this one is amazing! I have the smaller one, and then I saw that they made a LARGE one so I had to order it! This one is much better than the smaller one, because I can use them on both feet at the same time, the pain relief is amazing, this really helps my sore heels and I can actually hop out of bed and not feel that intense pain if I use this through out the day! I would highly recommend this product!",
      "rating": 5.0,
      "verified": true,
      "author": "Lizzy",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "Did not work for me",
      "text": "I have tried this for weeks with no pain relief. To me, I believe this being made of wood or whatever the tough material is doesn't help. It is too hard. Also, it does not reach the arch of my feet completely. It didn't matter how much effort and twist I made, the arch of my foot remained untouched. Therefore, I returned it.",
      "rating": 2.0,
      "verified": true,
      "author": "CasquinhaDeMel",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "More than pleasantly surprised",
      "text": "I had no expectation of relief. Was still experiencing foot pain post surgery -- plus plantar fasciitis flaring up from the lack of flexibility -- and was willing to try anything before going back to the doctor again in tears. Put this under my desk and rolled my foot on it a few minutes here and there (as directed; easy does it!), and started to improve almost immediately. Can't speak to the \"reflexology\" claims, but it's great for gently stretching the muscles and ligaments and stimulating circulation in the feet. SO much better now!",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200109
    }
  ],
  "product_meta": {
    "title": "TheraFlow Dual Foot Massager Roller (Large). Relieve Plantar Fasciitis, Stress, Heel, Arch Pain - The Original - Shiatsu Acupressure Relaxation. Full Instructions/Reflexology Chart. Christmas Gift",
    "rating": 4.6,
    "feature_bullets": [
      "✔MAXIMUM RELAXATION: Melt the aches & stresses away as you glide your feet on the TheraFlow. Feel the warmth of reflexology radiate from your feet to the rest of your body. Breathe. Relax.",
      "✔FEEL THE THERAFLOW DIFFERENCE! Enjoy an unrivaled foot massage experience with a device perfected through 1000s of customer feedback & actual testing. Every detail like the number of acupressure nubs, arch, elevation & spacing has been painstakingly configured to suit a range of feet types. Generic rollers just do not match up",
      "✔NO MORE FOOT PAIN: Find relief for conditions such as plantar fasciitis, heel spurs, neuropathy or simply tired & sore feet after a hard day's work. 10 independently-moving rollers surpass even expensive electric massagers in stimulating & soothing the feet",
      "✔FOR ANYONE, USE ANYWHERE: Perfect for feet of all sizes & weighing just 1.5lbs, our massager is portable enough to use while travelling, at work, or while watching TV. Take it wherever you go!",
      "✔NO HASSLE GUARANTEE & BONUS TIPS INCLUDED: If you’re unhappy with your Theraflow Foot Massager for any reason, we'll replace it or give you a refund, no questions asked! (*Note: Instructions & tips sheet on proper usage is included in the package & will also be emailed to you upon confirmation of delivery)"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "11.2 x 2.5 x 7.5 inches; 1.85 Pounds",
      "Item model number": "TF100",
      "Department": "Unisex",
      "Date First Available": "January 23, 2015",
      "Manufacturer": "TheraFlow",
      "ASIN": "B00SMJIYNG",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Foot Massagers",
      "Massage Tools",
      "Health & Household",
      "Massage Tools & Equipment",
      "Wellness & Relaxation",
      "Health, Household & Baby Care"
    ],
    "price": 16.49
  }
}