{
  "website_summaries": [
    {
      "verdict": "Because these rings are wood, they are less prone to slipping than plastic. Customers with smaller hands may prefer more slender rings, though.",
      "pros": [
        "Heavy-duty solid wood rings",
        "Extra wide for comfortable grip",
        "Straps and buckles included",
        "Weight capacity is 600 pounds",
        "Great grip",
        "Large diameter is comfortable on hands"
      ],
      "cons": [
        "Rings occasionally arrive with minor cosmetic imperfections or rough spots in wood",
        "This can be fixed with sandpaper"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "RISK RISK RISK",
      "text": "After buying these, they sat in the box for many months. I finally started using them a few weeks ago, and was enjoying them until I was doing a simple support hold and one of the buckles snapped off like a potato chip. I explained the situation to customer service and they told me they could not help me. They suggested I go to the hardware store to repair it myself, if you can believe it. So much for standing by your product... This obviously makes me think that the product is very unsafe. At best, by purchasing this product you may be risking your money. At worst ... your life.",
      "rating": 1.0,
      "verified": true,
      "author": "Tim C.",
      "helpful_votes": 21,
      "publication_date": 20190416
    },
    {
      "title": "Not Very Fit",
      "text": "In just 3 months these rings completely disintegrated. My outdoor gym is totally shaded and you can see the straps still look brand new with whatever \"elements\" they may have been exposed to here in FL, but the rings have completely fallen apart. I can see after years of being outdoors they may reach this condition, but if they can't last 3 months they should be labeled as \"indoor only\".",
      "rating": 1.0,
      "verified": true,
      "author": "TSteele",
      "helpful_votes": 17,
      "publication_date": 20180927
    },
    {
      "title": "These work great!",
      "text": "I have them hanging from a pull-up bar in my apartment closet. Do exactly what they appear to do. Functional and simple to use. Tons of variety and utility. Has taken my home gym to a whole level. The setup is easy - and if there are any questions youtube has 50+ videos so that they are secure and the correct height for the exercise intended. Not complicated - after learning once it's a done deal. Easy, lightweight and sturdy. Don't worry about going wood with the rings - it is finely sanded and not rough on the hands. Would recommend to anyone who is looking to build their own home gym.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 28,
      "publication_date": 20161123
    },
    {
      "title": "Great product for the price",
      "text": "I have another older pair of more expensive plastic rings. I split time between two locales and tired of a hauling the plastic pair in checked baggage. What pleasant surprise to find that these are every bit as good and actually much better on my hands. The larger diameter probably helps. I did not care for the straps and cam but that is an easy and inexpensive replacement. For those having trouble with minor imperfections in the natural material called wood I suggest visiting a hardware store and having them show you a thing called sandpaper. Can't beat rings for a body weight workout.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 6,
      "publication_date": 20180330
    },
    {
      "title": "I was born to do the rings! :D",
      "text": "The workout itself is a dream come true. I am 6ft and weigh 160LB and it's the perfect path in sculpting my physique and is tons of fun. I can easily picture myself purchasing another set of rings when these ones need replacing. As for the product itself I couldn't be more happy to have great quality ring along with the great buckles and straps that are the perfect length. My biggest tips to anyone who buy these rings is to be careful that the buckles are NOT making contact with the wooden rings when you are hanging from them. I've made this mistakes a few times and have put small dents in the rings. No big deal though.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 9,
      "publication_date": 20170519
    },
    {
      "title": "Great for dips",
      "text": "These are really strong. I weigh 161 pounds and I can do all sorts of things on this without feeling like it's going to drop me. I attached these to an adjustable squat rack I have in order to get the height necessary. These work very well and can give you a hell of a workout. Even if you don't intend to do any gymnastic-style stunts on these, they'll give you a better dip workout because your muscles will have to work harder to balance you than just having traditional dip bars.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Diaz",
      "helpful_votes": 3,
      "publication_date": 20171022
    },
    {
      "title": "Best rings on amazon",
      "text": "I tried several different brands on Amazon and these are the clear winner. The rings are thick and strong with an amazing feel to them. The straps and the buckles both feel very heavy duty and I had absolutely no problems with the straps sliding like some of the other reviews said and I weigh over 200lbs. Overall these are very good quality rings at a great price. A must have for anyone interested in fitness or gaining strength.",
      "rating": 5.0,
      "verified": true,
      "author": "Avid Consumer",
      "helpful_votes": 2,
      "publication_date": 20180919
    },
    {
      "title": "Excellent great deal",
      "text": "Others have reported a problem I had with the straps \"slipping\". The problem is you have to \"load\" or thread the straps into the buckle counter-intuitively, not the way you would expect it to work, sot of \"backwards\". Try a different method if the straps \"slip\" when weight is applied then, it will work then. Haven't had a failure in a year. Other than that can't keep the girls (bynast team) off the things.",
      "rating": 5.0,
      "verified": true,
      "author": "uncle",
      "helpful_votes": 6,
      "publication_date": 20161120
    },
    {
      "title": "Unbeatable quality and value",
      "text": "These are _excellent_. High quality, strong, durable, smooth. Great feel (heavy, solid feeling). The straps and buckles are also top quality. I've used a lot of rings at CrossFit gyms and these are as good as any I've ever used. If I were to complain about anything, I'd say they might be OVER-ENGINEERED. The straps are long and heavy and the rings are perhaps even a bit thicker than needed. Very impressive.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian Smith",
      "helpful_votes": 2,
      "publication_date": 20180407
    },
    {
      "title": "Do yourself a favor and look elsewhere. Snapped after a month.",
      "text": "The material of the rings themselves are fine. However, both of the metal clasps broke under tension of the strap. This is extremely disconcerting. The fact that the metal clasps snapped so easily makes me think it's only so long until they completely break and you land on your head. I will most certainly be spending more money on a product I can trust.",
      "rating": 2.0,
      "verified": true,
      "author": "Luis wander",
      "helpful_votes": 3,
      "publication_date": 20190310
    },
    {
      "title": "large and feel good in my hands",
      "text": "I am not a gymnast nor have I never seen gymnastic rings before. That being said, to me these rings and straps seem to be of high quality. These wooden rings are well milled, large and feel good in my hands. The straps are good quality and the buckles are large, sturdy and seem like they will last a long time. The only point I'd like to make is these wooden rings are unfinished. Meaning the rings are smooth sanded, unfinished, naked, bare wood. I'm not sure if that is the way Gymnast Rings are supposed to be, I was expecting them to be finished.",
      "rating": 4.0,
      "verified": true,
      "author": "JustAGuy",
      "helpful_votes": 2,
      "publication_date": 20171118
    },
    {
      "title": "Sturdy and reliable.",
      "text": "They work great. I have been using them in my garage nearly every day for months. I can hang upside-down above concrete and have no concerns about the straps failing. The rings are showing some minor wear, but it is to be expected from all the use I give them. The straps are very long, too long for my use, but it’s a nice option. I wish there was an easier way to wrap up the excess strap length, maybe i’ll just cut it.",
      "rating": 5.0,
      "verified": true,
      "author": "Corrigan",
      "helpful_votes": 0,
      "publication_date": 20190519
    },
    {
      "title": "Great deal at $35 price point!",
      "text": "I regularly used Rogue Fitness rings for a couple of years and decided to try out the Titan rings for comparison. The Titan rings themselves are good quality. The biggest difference between Rogue and Titan is the straps - and more specifically the metal spring clamp. Rogue's spring clamp is much easier to adjust than Titan's. However, a new set of Rogue straps is $25. The Titan rings are $35 plus Rogue's straps (35 + 25) = $55. Rogue rings cost over $70. It is more cost effective to buy Titan rings and Rogue straps than it is to buy a single set of Rogue rings - plus you'll have an extra set of straps..",
      "rating": 4.0,
      "verified": true,
      "author": "Squid Squeegie",
      "helpful_votes": 5,
      "publication_date": 20160922
    },
    {
      "title": "All around great product",
      "text": "I use these in my garage for basic ring movements and upper body workouts. My kids use these for intermediate level gymnastics and for swinging on. I used the cheapest idea I could think of to mount and I wish I would have invested a little more into that aspect. The rings arrived smooth and have only gotten smoother with use. The hardware is sturdy but more substantial hook and loop fasteners for the excess strap would be a welcome improvement.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190708
    },
    {
      "title": "Good quality , and fun for the whole fam.",
      "text": "Really pleased with these rings! Easy to setup, no slippage, and nice straps to keep the slack out of the way if you care a lot about that kind of thing. Some other folks have mentioned they aren't that smooth and can be rough on the hands. Now that I'm moving around on them a bit more I can kiiiinda feel what they're talking about, but I feel like you could just sand those parts out if needed. For the most part though, flawless for the cost. It was also a great way to get my kids into the basement gym!",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew Wagner",
      "helpful_votes": 0,
      "publication_date": 20180302
    },
    {
      "title": "Great piece of equipment",
      "text": "These are sturdy rings and straps. I'm a beginner with rings but now use them frequently since purchase and I'm seeing great results. Total body workout with one piece of equipment. I like the fact that they are thicker making them easy to grip. Great piece of work out equipment. YouTube fitnessfaqs for ideas. I have them suspended from the floor joices in my basement. 8 foot ceiling. Not ideal but I can do every thing I need to and want to. I also set up a bar outside to suspend them from, so they're easily transportable.",
      "rating": 5.0,
      "verified": true,
      "author": "amazon customer",
      "helpful_votes": 0,
      "publication_date": 20180910
    },
    {
      "title": "FUN!",
      "text": "I LOVE my rings! I attach these to my pull up bar in my doorway. They are super easy to attach. Sturdy, solid wood & straps. Now, all I want to do are ring exercises! I'm hooked! Pull ups, push ups, pistol squats, planks, rows, dips... The fun never ends! Plus, I can't help but feel like a bad a$$ gymnast when I'm using them!",
      "rating": 5.0,
      "verified": true,
      "author": "Kerri M.",
      "helpful_votes": 0,
      "publication_date": 20180619
    },
    {
      "title": "Works well",
      "text": "This product works exactly as intended. Someone in another review mentioned that the straps are low quality and slip when using them. I suspect they threaded the straps in the wrong direction, which will make them slip when force is applied to them -- that's just user error; it's the same with ANY straps like these and is not an indication of poor quality. There are arrows showing you what direction the straps need to be threaded. If you follow that, then you'll have no problems.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180816
    },
    {
      "title": "Great Set of Rings",
      "text": "Super long straps, smooth wooden rings are very comfortable. Strap buckle easy to use in order to change the ring height. I have these hanging from my pull up bar to do dips, rows and pushups. Also, trying to get strong enough to do the iron cross. Highly recommend these rings.",
      "rating": 5.0,
      "verified": true,
      "author": "Connie S",
      "helpful_votes": 0,
      "publication_date": 20200522
    },
    {
      "title": "the buckle broke after a year and a half?!",
      "text": "i loved these....until the buckle broke. i purchased in 2018....its 2020 now...so im assuming outta warranty...just shocked it broke. well...i think i could use a longer set anyway...but still was super shocked. makes me a little worried the buckle could break while upside down and smash my head on the ground",
      "rating": 3.0,
      "verified": true,
      "author": "secretraveler V",
      "helpful_votes": 0,
      "publication_date": 20200219
    },
    {
      "title": "Great rings, not sure if my hands can tell ...",
      "text": "Great rings, not sure if my hands can tell any difference between these and Rogue's. The strap adjustment mechanism is a little different than Rogue, and a little slower to adjust. That said, the straps are rock solid (no stretch or bounce) and quite long. I only have these mounted around 7', but I'm guessing the straps are good for another 7'.",
      "rating": 5.0,
      "verified": true,
      "author": "Gary Fye",
      "helpful_votes": 0,
      "publication_date": 20181205
    },
    {
      "title": "Perfect",
      "text": "DId a lot of research prior to choosing these, glad to say they are fantastic: sturdy, reliable, safe, easy to ensemble, easy to re-adjust. I thought I would miss the numbered straps, but no: the rings easily end up at the same height every time I set them. I've had them for over a month and have been upside down several times, had all my weight on just one ring, etc, and they have stayed firmly in place. My small nieces also love to play in them and do all sort of tricks.",
      "rating": 5.0,
      "verified": true,
      "author": "Dancing Shakti",
      "helpful_votes": 0,
      "publication_date": 20170131
    },
    {
      "title": "Great deal....",
      "text": "I ordered wood rings from another seller at over twice the price of these. Seller never shipped them. So I decided that I didn't need 70 dollar rings, and took a chance on these.....and glad I did as I can't see how anyone could have rings substantially better. Smooth all the way around, buckle works as it should, (mine didn't have any arrows showing direction of webbing....it goes underneath and through the back). I'm big at 235 pounds with large hands and very satisfied with the fit and strength of the rig.",
      "rating": 5.0,
      "verified": true,
      "author": "Mykllee",
      "helpful_votes": 0,
      "publication_date": 20160303
    },
    {
      "title": "These Are Awesome!",
      "text": "Back when I was doing CrossFit, I bought these and installed them onto my pull-up bar and they worked great! They helped me increase strength in my arms, chest, and back. I would definitely buy them again!",
      "rating": 5.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 0,
      "publication_date": 20200310
    },
    {
      "title": "Exactly what you're hoping for.",
      "text": "This is exactly what I was hoping it would be. Sturdy straps with plenty of length to customize for each workout. The wooden grips feel so smooth and sturdy in the hand. Already got my first workout with them in and man I feel sore, in a good way.",
      "rating": 5.0,
      "verified": true,
      "author": "DangerWillRobinson",
      "helpful_votes": 0,
      "publication_date": 20200412
    },
    {
      "title": "Love incorporating these into my exercise routine!",
      "text": "Pros: beautiful wooden rings. Thick straps with sturdy buckles that are easy to hang. Velcro wraps to tie up the excess strap to keep from getting in the way. Cons: minor, but it would be nice if the straps had measurement markings on them to quickly insure the rings are level. Love incorporating these into my exercise routine!",
      "rating": 5.0,
      "verified": true,
      "author": "Speed110",
      "helpful_votes": 4,
      "publication_date": 20160811
    },
    {
      "title": "An awesome set of rings",
      "text": "My rings arrived today and I was really happy with the quality. I am 190 lbs and the straps hold up my weight very well. I jerked my weight up and down on the rings as hard as possible trying loosen the cam mechanism of the buckle with no success. I have seen a few reviews stated the straps keep coming loose. It's possible the straps were not threaded correctly through the cam mechanism of the buckle. I've attached a picture of the threading instructions provided with the rings.",
      "rating": 5.0,
      "verified": true,
      "author": "Javier Escobar",
      "helpful_votes": 0,
      "publication_date": 20181106
    },
    {
      "title": "Titan = amazing fitness products, affordable prices and top notch customer service!",
      "text": "Have not used them yet, but they work and act just like the other set we use at our box. Quality looks to be comparable. Best thing is, fed ex and amazon stated they were delivered but they were not. I emailed amazon and Titan fitness, and titan immediately said that they would send out a brand new order at no charge! Great customer service! WIll update posting once i use them and can attest to performance.",
      "rating": 5.0,
      "verified": true,
      "author": "Le Re Lu Ru",
      "helpful_votes": 0,
      "publication_date": 20170808
    },
    {
      "title": "love these",
      "text": "I am not a gymnast, just a guy who bought these and mounted them (easily) in the rafters of my basement. I love the tacticle feel of the wood and the workout that I get each morning. Would buy again, but I don't see these every going bad.",
      "rating": 5.0,
      "verified": true,
      "author": "Joseph E. Curtis",
      "helpful_votes": 0,
      "publication_date": 20190223
    },
    {
      "title": "Extremely happy",
      "text": "I've had these things hanging outside my house from a tree for a few months (except when I took them on vacation with me and hung them from some exposed beams in the house I was staying at) and they're holding up like a dream through lots of weather and lots of abuse from all manner of kids. Construction is super solid.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20180918
    },
    {
      "title": "High Quality",
      "text": "I love these rings. Setting them up is easy and they are super sturdy. I do wish the straps had lines on them so that making sure they are even would be easier.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer",
      "helpful_votes": 0,
      "publication_date": 20191109
    },
    {
      "title": "Great rings!",
      "text": "These rings are awesome. I have not hung them up with the straps yet. Instead I use them for full body workouts by doing push-ups and planks on them. The extra thickness in the material really helps with gripping these things! When first opened there was a powdery substance on them but after wiping it off the rings were great! I have used the poly rings before and I have to say that the wood rings to me have a better grip and seem to be more solid when using them.",
      "rating": 5.0,
      "verified": true,
      "author": "Brandon Siebert",
      "helpful_votes": 0,
      "publication_date": 20161023
    },
    {
      "title": "Great rings, just be sure to use correctly.",
      "text": "Very good rings. I’ve used mine for more than a year and expect them to last indefinitely. I saw one review where the buckle broke - that would only happen if you feed the webbing through from the front. It should be fed through from the back/underside.",
      "rating": 5.0,
      "verified": true,
      "author": "Conor",
      "helpful_votes": 0,
      "publication_date": 20200521
    },
    {
      "title": "Poor Quality manufacturing",
      "text": "Metal clasp broke on my 1st inverted hang. Poor quality.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190506
    },
    {
      "title": "Qaulity, no frills",
      "text": "Rings that are \"quality\" last a long time, which means beefy construction of materials and care in producing/cutting the rings themselves.Cam buckles are higher gauge metal (thicker), straps are thick and woven well. Rings show no signs of imperfections at all - no points for splintering or early wear. Take care of these - don't leave them in direct sun for days on end and don't let them get rained/snowed on - and these things should outlast the rig you strapped them to!",
      "rating": 5.0,
      "verified": true,
      "author": "Nick",
      "helpful_votes": 0,
      "publication_date": 20190619
    },
    {
      "title": "Realible worthy",
      "text": "They look very cool on the chin-up bar I previously bought in amazon. I tried doing a few things and the rope holds steady without sliding a single bit. One rope is larger than the other but that doesn’t matter to me as I’m only using it at home and perhaps will take it to the park to hold it from other bars. Just as promised, it’s a wooden good simple steady and reliable product.",
      "rating": 5.0,
      "verified": true,
      "author": "JoAntonio Cruz",
      "helpful_votes": 0,
      "publication_date": 20180827
    },
    {
      "title": "Crossfitter husband loves them!",
      "text": "Got these as a gift for my husband's crossfit gym he has set up in the garage. He's a coach so he is on the rings pretty frequently. Prior to this he was using a heavy duty sort of plastic kind. He MUCH prefers these. Works much better with sweaty hands since you don't slip around as much. They're polished incredibly smooth, so no risk of splinters. I can't imagine paying more than twice the price for the well known name brand when these work perfectly!",
      "rating": 5.0,
      "verified": true,
      "author": "Aly828",
      "helpful_votes": 0,
      "publication_date": 20160526
    },
    {
      "title": ".",
      "text": "200 lbs here and it's holding up well. I have it attached to a Power Rack. Very challenging at first. I'm used to working on paralette and dip bars then switched to this. Didn't know I needed to use muscles that I never though I had just to keep myself stable. Took a while to get used to but definitely worth it. Great supplement for your compound lifts.",
      "rating": 5.0,
      "verified": true,
      "author": "jinha",
      "helpful_votes": 0,
      "publication_date": 20160428
    },
    {
      "title": "Just like the ones used in CrossFit gyms",
      "text": "These are great. I used rings at CrossFit gyms and that's what I was looking for with these. These are great and very smooth and just like those used at CrossFit gyms. I would recommend them.",
      "rating": 5.0,
      "verified": true,
      "author": "Christina",
      "helpful_votes": 0,
      "publication_date": 20200605
    },
    {
      "title": "Great Value",
      "text": "Quick Disclaimer, this is my first set of rings, though I have used others in the past. For the price point, I expected these to be solid, but nothing special. The wood of the rings themselves is great quality, as are the nylon straps. So far the texture of the wood has been fine for me, but it could be easily smoothed or textured with fine or coarse sand paper. I haven't had these long enough to tell how the wood will respond to sweat, but I anticipate that they will wear well. Really looking forward to putting in some hours on these great rings. Great value.",
      "rating": 5.0,
      "verified": true,
      "author": "Bryce Thompson",
      "helpful_votes": 0,
      "publication_date": 20181015
    },
    {
      "title": "Quality rings",
      "text": "I have used these a few times now and I absolutely love them. These are made of all high quality materials at a fraction of the price as some other brands. If you are looking for rings look no further you will not be disappointed. I use mine along with a pull up bar I installed in my backyard and I love them. I like that they have a small velcro strap on them so when your done you can roll them up and secure them from unraveling.",
      "rating": 5.0,
      "verified": true,
      "author": "JP",
      "helpful_votes": 0,
      "publication_date": 20160406
    },
    {
      "title": "Overall a great product considering the price",
      "text": "Overall a great product considering the price. This being my first pair of rings I wasn't sure what to expect considering that these rings are half the price of most high-end rings. The straps and buckle work great and feel very secure as well as being fairly easy to put up and down. While they aren't perfect, the rings have a few little chips in them but it isn't an issue, I can certainly deal with some minor flaws in order to save some money.",
      "rating": 5.0,
      "verified": true,
      "author": "Vogester",
      "helpful_votes": 0,
      "publication_date": 20170323
    },
    {
      "title": "Favorite purchase",
      "text": "Took these traveling with me and was able to set them up at a house for a month, getting a solid upper body workout without the gym. Very versatile / useful piece of gear.",
      "rating": 5.0,
      "verified": true,
      "author": "Brent",
      "helpful_votes": 0,
      "publication_date": 20190320
    },
    {
      "title": "Not long lasting",
      "text": "Kept indoors and after less than 2 years one ring totally rotted Very sad. Disappointing for my grandkids They loved the rings",
      "rating": 2.0,
      "verified": true,
      "author": "marcy klapper",
      "helpful_votes": 0,
      "publication_date": 20190413
    },
    {
      "title": "The rings are solid and the straps hold up well ...",
      "text": "The rings are solid and the straps hold up well. My only qualm is that the straps are a little on the shorter end. I have them mounted at 101 inches (basement ceiling height) and the straps are just about 1 foot too short of being able to lower the rings to the ground for pushups. So i keep them kinda high and support my feet from a chair instead.",
      "rating": 4.0,
      "verified": true,
      "author": "Michael Chan",
      "helpful_votes": 0,
      "publication_date": 20170220
    },
    {
      "title": "Simply Awesome!!!",
      "text": "I received my rings earlier than expected and had my first chance to use them today at the gym. These rings are everything you would expect and more. I love the quick disconnect buckles that allow for easy adjustments without interupting the workout. The velcro definitely comes in handy to keep the excess straps from interfering. I had a guy that ways over 280lbs attempting to do pull ups and they handled the weight with ease. I am so happy I made the choice to order these and anyone is looking for the real deal these are it.",
      "rating": 5.0,
      "verified": true,
      "author": "Garcia Simpson",
      "helpful_votes": 0,
      "publication_date": 20151026
    },
    {
      "title": "Excellent rings, but one of the straps is starting ...",
      "text": "Excellent rings, but one of the straps is starting to fray and I'm unsure if the latches will hold up (some of the serrations on the teeth aren't doing all that well). Questionable straps but ok rings",
      "rating": 3.0,
      "verified": true,
      "author": "LR",
      "helpful_votes": 0,
      "publication_date": 20181018
    },
    {
      "title": "Doing flips",
      "text": "Great rings! The straps are thick and the spring loaded buckles feel solid. The wooden rings are very smooth (unfinished) and also very thick.",
      "rating": 5.0,
      "verified": true,
      "author": "Dan S.",
      "helpful_votes": 0,
      "publication_date": 20190404
    },
    {
      "title": "Way better feel than plastic rings",
      "text": "This is a great product, I bought these to upgrade from my plastic rings for better feel and grip. Been working on my false grip and realized that the plastic ones just didn't give you enough grip, even with chalk. These rings have a thicker handle as well, which feels great when doing exercises. Definitely happy about this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Dan",
      "helpful_votes": 0,
      "publication_date": 20161201
    },
    {
      "title": "Great product for price",
      "text": "This product is stuffy the metal clasps and the strap are solid easily hold 200lbs haven’t tested more. Wood is soft and smooth no complaints .",
      "rating": 5.0,
      "verified": true,
      "author": "Tanner Zizzy-Mustatia",
      "helpful_votes": 0,
      "publication_date": 20190922
    },
    {
      "title": "No slipping",
      "text": "I really like these! I bought initially for my clients but I'm keeping them! No slipping, very sturdy. I attached to my pull up bar and i will be trying them out on a tree. I was wondering if I would like the wood feel vs plastic, the wood is very comfortable. I will be purchasing another set soon!",
      "rating": 5.0,
      "verified": true,
      "author": "Chelsea Renoe",
      "helpful_votes": 0,
      "publication_date": 20180304
    },
    {
      "title": "Nice rings",
      "text": "I have these hanging on a cap squat rack inside my sunroom. This set up and a ruck sack with some plate weights has given me enough challenge and variety for some time now.",
      "rating": 5.0,
      "verified": true,
      "author": "Tony",
      "helpful_votes": 0,
      "publication_date": 20181013
    },
    {
      "title": "Excellent quality, makes you feel like an Olympian in training",
      "text": "These rings are excellent. The straps are very long; I hang them from a doorway pullup bar and the straps' excess length drapes down to the ground and across the floor. The rings themselves are very smooth (no splinters) and solid (so you don't feel like they'll break while you're using them). I use these to do dips and I expect to continue using them for years to come.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20160724
    },
    {
      "title": "Pretty good, for a while.",
      "text": "Worked great for a few years, then the\"press\" paddle on both (!) Buckles snapped off on the same day!",
      "rating": 3.0,
      "verified": true,
      "author": "Stephen",
      "helpful_votes": 0,
      "publication_date": 20200420
    },
    {
      "title": "QC problems.",
      "text": "Strands were coming out of the straps and the wood on one ring looked like someone slid it 10 feet across some rough concrete. Shame because reviews looked great.",
      "rating": 1.0,
      "verified": true,
      "author": "Kendrick Nakamura",
      "helpful_votes": 0,
      "publication_date": 20171107
    },
    {
      "title": "Pay to play with these bad boys.",
      "text": "I am 41, losing weight, and getting back into fitness. I started out with 5 seconds on top hold posistion at a time. I am up to 20 seconds for 3 reps now. Onward and forward.",
      "rating": 5.0,
      "verified": true,
      "author": "Roman Weenie",
      "helpful_votes": 0,
      "publication_date": 20190712
    },
    {
      "title": "Amazing rings for the price",
      "text": "Amazing rings for the price. I use them on my pull bar in my garage. I purchased the pull up bar (CFF Wall/Ceiling Mounted Pull Up Bar with 300-Pound Capacity) on Amazon as well. I also have a review on that product on Amazon as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 19,
      "publication_date": 20160515
    },
    {
      "title": "Solid",
      "text": "These rings are solid. The straps are solid too, the directions for adjusting the strap length were very helpful as well. More than enough strap length. I would recommend them.",
      "rating": 5.0,
      "verified": true,
      "author": "Josh",
      "helpful_votes": 0,
      "publication_date": 20180829
    },
    {
      "title": "They work well",
      "text": "They lose a star because wood in some places have splintered off. The spots are small, but some have been sharp or left behind holes that snag my hands.",
      "rating": 4.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20181114
    },
    {
      "title": "Impressive quality",
      "text": "I cant believe the quality of the rings and straps for the price. I've seen diy PVC ones that cost about the same to make. My daughter practices her gymnastics with them and I use them basically as TRX straps",
      "rating": 5.0,
      "verified": true,
      "author": "Dylan Switzer",
      "helpful_votes": 0,
      "publication_date": 20190102
    },
    {
      "title": "Great product for great price.",
      "text": "I saw some reviews saying that the buckles were not holding or breaking. Mine have worked flawlessly. I'm 6'1 and 180 pounds. Seems to me like user error if your straps are sliding. Though Im sure there are cases with defective buckles. I'm very satisfied with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "TJ",
      "helpful_votes": 0,
      "publication_date": 20190410
    },
    {
      "title": "Excellent rings.",
      "text": "These are fantastic gym rings. Don't understand why anyone would pay more. Order plastic and returned them. The circumference of these rings fits my XL Hands better than the narrow 1.1\" rings. Excellent purchase. Straps are good width. Very robust. Came Packaged excellently.",
      "rating": 5.0,
      "verified": true,
      "author": "ESandov",
      "helpful_votes": 0,
      "publication_date": 20160904
    },
    {
      "title": "Easy to install and use",
      "text": "These rings are so easy to set up. I have been learning to workout on these rings instead of going to the gym because of Covid. Well made sturdy product that I have been using daily without any issues.",
      "rating": 5.0,
      "verified": true,
      "author": "Jitendra Agrawal",
      "helpful_votes": 0,
      "publication_date": 20200828
    },
    {
      "title": "GREAT",
      "text": "There is something about wooden rings versus the plastic ones. They have way better grip and I think they just feel A LOT better in your hand and seem to be easier to hold onto when doing exercises. The straps are a great quality and I think these will hold up for a really really long time.",
      "rating": 5.0,
      "verified": true,
      "author": "Megan",
      "helpful_votes": 0,
      "publication_date": 20161227
    },
    {
      "title": "Plywood rings unfinished? (at least very well sanded) may cause splinters in hands",
      "text": "First impression is great, I'm very satisfied with the rings overall. However, during my first use, I ended up with a very small (micro) splinter in hand (perhaps the norm for pros who use these??), thankfully easy to remove splinter, as is one star. I want my focus to be on training, not picking out tiny splinters from my hands.",
      "rating": 4.0,
      "verified": true,
      "author": "Another Reviewer",
      "helpful_votes": 0,
      "publication_date": 20190407
    },
    {
      "title": "Good Quality and Feel",
      "text": "Feels good in the hands, no issues with the straps like other users (perhaps they fed them through wrong?). Only thing that could have made them better would have been markers but I only use it for two heights and I marked them with tape.",
      "rating": 5.0,
      "verified": true,
      "author": "Kiyoshi",
      "helpful_votes": 0,
      "publication_date": 20171001
    },
    {
      "title": "Highly recommend- Great Quality and Value",
      "text": "Fast shipping. Rings are very high quality wooden rings that are big, smooth, and sturdy. Great price for such high quality rings and straps. I weigh close to 200lbs and hold me well in doing ring dips, negatives, and a variety of other crossfit WODs.",
      "rating": 5.0,
      "verified": true,
      "author": "Charles B.",
      "helpful_votes": 0,
      "publication_date": 20160930
    },
    {
      "title": "Great product and very happy.",
      "text": "The rings are great and were delivered when the schedule date was given. The Velcro strap that holds the access nylon is thin and wish it was a little thicker. Over all, I am very happy with the product and would tell others to purchase it.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160926
    },
    {
      "title": "Feels good in hand and adjusts easily.",
      "text": "I'm new to ring training, but so far these have been great. Feels good in hand and adjusts easily. Could have been sanded *just* a little bit better, but it's commensurate with the price.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170314
    },
    {
      "title": "Smooth surface on the wood",
      "text": "Some reviewers complained about the texture (grain) of the wood but mine are great after a couple of months of use",
      "rating": 5.0,
      "verified": true,
      "author": "Hap",
      "helpful_votes": 0,
      "publication_date": 20190202
    },
    {
      "title": "Super Cheap and Decent Quality",
      "text": "These work exactly as needed. I have been using them for two months and my only complaint is that the wood can splinter a bit easily. You get what you pay for.",
      "rating": 5.0,
      "verified": true,
      "author": "gemini",
      "helpful_votes": 0,
      "publication_date": 20200529
    },
    {
      "title": "... the hang of it it is one of the best workouts I’ve ever had you really get an upper ...",
      "text": "It was a little bit difficult for setting up the straps but when she get the hang of it it is one of the best workouts I’ve ever had you really get an upper body strength that you would never achieve with regular equipment at the gym great product and simplicity at its best of full body workout complete sheet with these rings if you know how to move your body and make full use of the rings",
      "rating": 5.0,
      "verified": true,
      "author": "John d. Alexander",
      "helpful_votes": 0,
      "publication_date": 20180427
    },
    {
      "title": "Awesome. Bought a pair about 6 months ago and ...",
      "text": "Awesome. Bought a pair about 6 months ago and liked them so much I'm getting a pair for my brother for Christmas. Nice and sturdy, smooth action through the clip, grip feels good on the hand, great price. Get these rings.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike G",
      "helpful_votes": 0,
      "publication_date": 20171216
    },
    {
      "title": "Don't hesitate",
      "text": "Very nice quality for the price. They have a bit of a \"rough\" texture to them, but nothing that would be uncomfortable. It's about perfect to provide grip without slipping if your palms sweat at all. I considered purchasing rings from other fitness websites but I'm glad I took a chance on these. Buckles and straps feel like they'll last a long time.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Williams",
      "helpful_votes": 0,
      "publication_date": 20160229
    },
    {
      "title": "Sturdy rings. Good value",
      "text": "Sturdy rings. Good value. Smooth and much better than the plastic rings. Wide straps and good hold on the tension. Not a gymnast but using them for muscle ups and other fitness goals. Bought two pairs and very happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Fives_my_limit",
      "helpful_votes": 0,
      "publication_date": 20171123
    },
    {
      "title": "Great Product for All Sizes",
      "text": "Despite complaints of splinters from others, I found a pair of smoothly sanded, well constructed rings when I opened my box. The straps and buckles support me and all of my 300 pounds. Looping the straps can be a bit of a trick without directions (Hint: There is an arrow on the side of he buckle.), but once engaged, they are solid. Very good product for the price I paid.",
      "rating": 5.0,
      "verified": true,
      "author": "Eddie Burke",
      "helpful_votes": 0,
      "publication_date": 20160105
    },
    {
      "title": "Fun + Challenging",
      "text": "The wooden rings feel great. I really like the cam buckle straps that allow me to take these anywhere. The buckles are solid and secure. I have full confidence when moving through a sequence and going inverted.",
      "rating": 4.0,
      "verified": true,
      "author": "Kaye83",
      "helpful_votes": 0,
      "publication_date": 20181112
    },
    {
      "title": "Awesome Rings, very satisfied",
      "text": "Outstanding Rings - This is a great product, the wood is very smooth and well sanded, the straps are strong and there is no slippage in the cam buckles. I considered another pair from one of the big CF brands, but these are just as good, if not better, for half the price. They are very versatile and an outstanding addition for my home gym.",
      "rating": 5.0,
      "verified": true,
      "author": "Jack R",
      "helpful_votes": 0,
      "publication_date": 20151016
    },
    {
      "title": "Rings are nice, came with nice long straps and good buckles",
      "text": "Rings are nice, came with nice long straps and good buckles. Love all the exercises you can accomplish with the rings. They are a bit thick, but I do have smaller hands.",
      "rating": 4.0,
      "verified": true,
      "author": "Matt S.",
      "helpful_votes": 0,
      "publication_date": 20180303
    },
    {
      "title": "STRONG",
      "text": "My husband and i are big people (he’s 300lbs) and these have not slipped once. Easy to adjust and use. He’s let his entire body weight lean on them with no problems. Here’s hoping they last.",
      "rating": 5.0,
      "verified": true,
      "author": "Shannon Barraza",
      "helpful_votes": 0,
      "publication_date": 20180403
    },
    {
      "title": "Great!",
      "text": "Kind of wish they were the ones with the numbered dashes for a quick adjustment to know when they're both at level height. Love to use them, but a standard gym has some challenges using it since there isn't always >=7' pull up bars available to put them on.",
      "rating": 5.0,
      "verified": true,
      "author": "Shawn",
      "helpful_votes": 0,
      "publication_date": 20170103
    },
    {
      "title": "These rings are amazing. I like the wood rings because your hands ...",
      "text": "These rings are amazing. I like the wood rings because your hands don't slip and these don't give you splinters or anything. They are amazing on your hands.",
      "rating": 5.0,
      "verified": true,
      "author": "heather",
      "helpful_votes": 0,
      "publication_date": 20180509
    },
    {
      "title": "Great product",
      "text": "Hung these from hooks I put in the ceiling of my garage. So far very sturdy and surprisingly comfortable to hold. I have no issue with grip without any tape on them. Very smooth to hold as well. Straps and clamp are easy to adjust. Overall extremely satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "Colsonagain",
      "helpful_votes": 0,
      "publication_date": 20200216
    },
    {
      "title": "So far so good. The mechanism that holds the straps in place ...",
      "text": "So far so good. The mechanism that holds the straps in place and tight is a little difficult to operate, but overall it's stable and effective. I haven't used them a ton yet, but they've been great. There is a reasonably strong glue smell which leads to some concern about longevity, but we will see.",
      "rating": 4.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20161008
    },
    {
      "title": "Good Quality Wood Rings",
      "text": "Have only used a few times now, but mostly impressed with the quality. The straps are wide and thick and the buckles are pretty heavy duty. The rings feel really good and are of high quality. Only minor complaint is there are maybe two or three spots on the rings that I can feel need a very light sanding. Nothing major though. For the price, I would definitely buy again over the more pricey wood rings.",
      "rating": 4.0,
      "verified": true,
      "author": "MatthewC",
      "helpful_votes": 0,
      "publication_date": 20160606
    },
    {
      "title": "Not expecting these to last.",
      "text": "The wood has noticeable areas that seem vulnerable to splintering right out of the box. They are in fact bare wood and don't have any protection, so I am wary about leaving these outside, which I would ideally like to do. That being said, they serve their purpose and hold my body weight.",
      "rating": 3.0,
      "verified": true,
      "author": "Stefan",
      "helpful_votes": 0,
      "publication_date": 20171009
    },
    {
      "title": "Good stuff!",
      "text": "Hung these from my power rack. Use them for dips, pull-ups, ring push-ups and suspended reverse crunches. I'm 210lbs and I feel completely safe hanging from them. Grip is good, my hands don't slip. I haven't had to add tape or use chalk.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170613
    },
    {
      "title": "Great rings. The tapes and buckles are really great ...",
      "text": "Great rings. The tapes and buckles are really great quality. No tying or readjustment necessary. Once you set them up, they'll stay that way.",
      "rating": 5.0,
      "verified": true,
      "author": "Simon",
      "helpful_votes": 0,
      "publication_date": 20180612
    },
    {
      "title": "Gym rings",
      "text": "Purchased these rings to learn how to do a muscle up on. Rings are well crafted. If kept outside like mine, make sure to bring them inside to keep rain off of them. Or what I did was bring them in the garage and used them inside and get a plastic set to keep outside.",
      "rating": 5.0,
      "verified": true,
      "author": "James Redmond",
      "helpful_votes": 0,
      "publication_date": 20181206
    },
    {
      "title": "Excellent quality, cheap price. Highly recommended.",
      "text": "The rings are thick (1.25in), sanded smooth, and have a strong and sturdy, refined feel. The straps are thick, heavy and strong. The buckles too. For the quality, I would expect the price to be twice what it was. Much sturdier and stronger than I expected for the price. I'm a supremely happy customer.",
      "rating": 5.0,
      "verified": true,
      "author": "Zed",
      "helpful_votes": 0,
      "publication_date": 20160730
    },
    {
      "title": "but they seem perfect for what I want",
      "text": "These shipped fast. They came a couple of days before I had expected them.i haven't used them much, but they seem perfect for what I want. The rings are nice and smooth and comfortable in my hands. The straps do not slip at all and stay locked in place. I have them hung from my squat rack and have been able to do pullups and dips from them. No complaints so far. Again, haven't used them much so I can't comment on longevity but they seem like they will uphold.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180117
    },
    {
      "title": "Durable and easy to place",
      "text": "I love the ease with which we can put it in almost any location. The excess strap is hard to keep in place with such an active gymnast.",
      "rating": 5.0,
      "verified": true,
      "author": "Bobby I",
      "helpful_votes": 0,
      "publication_date": 20190704
    },
    {
      "title": "Great rings, love the feel of wood",
      "text": "I wanted wood rings and these are a tremendous value. Very sturdy.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190428
    },
    {
      "title": "but it feels like 15 feet or more)",
      "text": "Rings are thick, smooth wood (no laquer or anything). The webbing is thick and there is PLENTY of it (I haven't measured, but it feels like 15 feet or more). The cam-locks work well and are beefy. Overall seems pretty well made.",
      "rating": 5.0,
      "verified": true,
      "author": "MW",
      "helpful_votes": 0,
      "publication_date": 20180129
    },
    {
      "title": "worth a try",
      "text": "I was a little skeptical to buy these rings after reading all the negative reviews. I went ahead and purchased these anyway and I am very glad I did. They don't come with instructions, however, there's an arrow on the actual buckle showing you what direction to feed the band through. I weigh close to 180 and they support my weight well. The wooden rings are great quality. It took me less than 10 minutes to set them up on my pull-up bar. I recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole",
      "helpful_votes": 0,
      "publication_date": 20160913
    },
    {
      "title": "Great Rings",
      "text": "I've had these for almost two years and they hold up great. The handles are solid wood construction and very sturdy. The straps are very durable and the adjustable clamps are heavy duty. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "R. K. J.",
      "helpful_votes": 0,
      "publication_date": 20170718
    },
    {
      "title": "Nice set of rings",
      "text": "This is the first set of rings I've ever used, but I really like them so far. The wood is very smooth and there was no splintering for me. The straps are long and feel very secure. My only problem was that they came with no instructions and at first I thread the straps through the buckle the wrong way and was surprised when they weren't secure. Once I got it the right was around it was fine.",
      "rating": 5.0,
      "verified": true,
      "author": "dappermuis",
      "helpful_votes": 0,
      "publication_date": 20150912
    },
    {
      "title": "Great product, a new appreciation for how much strength ...",
      "text": "Temporarily hooked it up to a preexisting chin-up bar that's bolted to the door frame and it works well enough for dips. I'll probably set it up on rafters for additional clearance. Great product, a new appreciation for how much strength gymnasts need for even basic ring work.",
      "rating": 5.0,
      "verified": true,
      "author": "Mackey Stingray",
      "helpful_votes": 0,
      "publication_date": 20160511
    },
    {
      "title": "Built Well",
      "text": "This product is a little larger than expected. Built very well. Smooth and strong. Compares to better known more expensive brands. We use with our Rogue Garage Gym Rig for CrossFit workouts.",
      "rating": 4.0,
      "verified": true,
      "author": "sastocky",
      "helpful_votes": 0,
      "publication_date": 20160811
    },
    {
      "title": "Great rings for bodyweight exercises",
      "text": "So far these rings have performed up to my expectations. I was worried that for this low price, they might be low quality but that hasn't been the case. I use them for all of my body weight exercises at the gym and I haven't had any issues since I made my purchase one month ago. The rings are easy to set up and take down so I can easily find places to work out with them when needed. I would recommend these to anyone interested.",
      "rating": 5.0,
      "verified": true,
      "author": "Ian",
      "helpful_votes": 2,
      "publication_date": 20151017
    }
  ],
  "product_meta": {
    "title": "TITAN Wooden Gymnastics Rings with Cam Buckle Straps, Home Gym Equipment, 8”",
    "rating": 4.6,
    "feature_bullets": [
      "IDEAL FOR GYMNASTICS TRAINING: Gymnastics is a serious sport that requires a lot of hard work and dedication. Those who are determined to be the best put in hours of training and effort to perfect their skills. Now you can train from home with these Titan Fitness Wooden Gymnastics Rings. You’ll get plenty of exercise and training with this gymnastics gear.",
      "USE FOR UPPER BODY EXERCISES: Looking to tone and tighten your upper body? These rings allow you to perform ring dips, pull-ups, muscle-ups, ring rows, and more. These exercises work a variety of muscles, including your deltoids, biceps, triceps, and abs. Before you know it, you’ll be ripped in no time!",
      "HEAVY-DUTY MATERIAL: At Titan Fitness, we don’t skimp when it comes to our products. Our fitness equipment is made from high-quality material that is sure to last for years. These gymnastics rings are no exception! They’re made from sturdy, solid wood that can support a weight capacity of up to 600 lbs. so you can rest assured that you’ll be safe as you swing from them.",
      "ADJUSTABLE STRAPS: With your purchase, you’ll also receive cam buckle straps. These straps are extra long, measuring 15’. You can just throw them over a tree branch, pull-up bar, or power rack to start performing your upper body strength training exercises. And they wrap up tight, so storing them won’t be a problem.",
      "DIMENSIONS: These rings have a total diameter of 9.25” with the inside diameter being 8”. The rings are 1.25” thick. They’re extra wide for a more comfortable grip, which helps prevent blisters and calluses. They weigh approximately 4 lbs. and can support a weight capacity of 600 lbs. The straps are 15’ long and have a width of 1.5”."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "9.25 x 1.25 x 9.25 inches; 3.55 Pounds",
      "Item model number": "FBA_WoodRings8",
      "Date First Available": "January 16, 2015",
      "Manufacturer": "TITAN",
      "ASIN": "B00SAEPY72",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Other Sports",
      "Rings",
      "Sports & Outdoors",
      "Sports & Fitness",
      "Gymnastics",
      "Gym & Competition Equipment"
    ],
    "price": ""
  }
}