{
  "website_summaries": [
    {
      "verdict": "A good choice for anyone who needs an affordable, soft-sided makeup bag with suitable space for most consumers.",
      "pros": [
        "This bag gets top marks for its durable nylon that's easy to clean when spills occur",
        "Has an attractive quilted exterior",
        "Spacious main interior  compartment with several pockets to keep small items organized"
      ],
      "cons": [
        "The sides of the bag lack structure",
        "A few owners note a strange smell upon arrival that tends to fade over time"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Love it! Holds my naked pallet",
      "text": "Love it! Holds my naked pallet, a ton of my brushes, and the rest of my makeup with room to spare. It feels really durable, and looks simple and classy. Overall I'm very happy with it!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 70,
      "publication_date": 20160110
    },
    {
      "title": "Not just a makeup bag",
      "text": "My order came very fast. A day & a half. Faster than I could ever find one at a store. I bought the bag to hold some medical equipment, not makeup. I already have one of those. My equipment was in a cardboard box and it seemed so cumbersome. I ordered this bag cause it was big enough for the equipment with a little room to spare for additional items in the future. The bag is nice quality and was a good choice. It is not a hard case, soft and pliable. It was described perfectly. It has great little pockets to put accessories of any kind. I would recommend this to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Handywmn",
      "helpful_votes": 11,
      "publication_date": 20180809
    },
    {
      "title": "Awesome Make Up Bag !!!!!",
      "text": "I love this makeup bag.I didnt know if it would be big enough but it is a great size bag. I would say for the average person who has a fair amount of makeup its great. I replaced it with one of those much more expensive hard sided makeup cases. I like this much better as it is lighter but very well made.This will be my go to make up bag from now on. Im very picky and I really dont think you will be disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "CYNTHIA",
      "helpful_votes": 21,
      "publication_date": 20161110
    },
    {
      "title": "Perfect bag!",
      "text": "This bag is great! I've been through countless makeup bags trying to find one that's big enough and has a certain degree of organization. This is perfect. I have everything I had in my old bag (which was so full it busted the zipper, hence a new bag) and I still have a TON of room! It's a large bag, it takes up much more room in the drawer I have it in, but still fits. Really happy with it!",
      "rating": 5.0,
      "verified": true,
      "author": "Brooklynn",
      "helpful_votes": 23,
      "publication_date": 20160602
    },
    {
      "title": "Spacious makeup bag for travel or every day",
      "text": "This bright red spacious zippered tall box-like bag holds pretty much allllll of my makeup. It has loops on the top to hold my many brushes, a small, not really useful mirror, and a large storage area for everything else. The quality of the bag is very nice, with a double zipper for convenience. It holds its shape well even when empty. My bag holds about 10 brushes of varying sizes/uses, moisturizer bottle, two types of powder, several types on concealer, blush, highlighter, brush cleanser bottle, a couple of large eyeshadow palettes, mascara... and more. I like it so much I bought a black one for my daughter. Works great!",
      "rating": 4.0,
      "verified": true,
      "author": "Ginger",
      "helpful_votes": 12,
      "publication_date": 20170113
    },
    {
      "title": "Perfect for storing your Facial Sheet Masks!",
      "text": "I purchased this to store my sheet masks in. I wanted something I could easily look at what I have, and not just dumped in a drawer or box. All of my (too many) sheet masks stand up straight, and with exception to the extremely tall & oversized one, none of these are cramped or crumpled over, The mirror is removable so you can have reference on the go, but even better, I can easily store my lip & under-eye masks behind it. All-in-all, for the purpose I bought this for, it is extremely well suited and I couldn’t have designed better! I highly recommend this case to anyone!",
      "rating": 5.0,
      "verified": true,
      "author": "scott pope",
      "helpful_votes": 23,
      "publication_date": 20181104
    },
    {
      "title": "It’s simple and it works great.",
      "text": "This is a straightforward make up bag for someone like me who uses about 11 items for my face. It holds small moisturizers creams fine. The slots are good for slender lipstick, not just brushes. There are pockets on 3 of the 4 side. Perfect for tweezers and such. So for me. It’s deep enough, wide enough, the mirror is nice. I may take it out, because I sit with it in my lap and it’s just alittle heavy and I use a better mirror, so thumbs up. I bought another one for my brushing supplies for my teeth. It’s nice enough to leave sitting out. Nice handle, too.",
      "rating": 5.0,
      "verified": true,
      "author": "Scarlett",
      "helpful_votes": 5,
      "publication_date": 20171024
    },
    {
      "title": "BEAUTIFUL & spacious makeup case!",
      "text": "I LOVE this travel case! I use it for my makeup when I travel & i’ve been looking for something big enough to hold my morphe pallets & this is PERFECT! I fit all my makeup that I always take with me and the brush holders have been amazing also, its saved me $$ from buying a separate brush case. The extra pockets inside are a huge plus, definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa Saucedo",
      "helpful_votes": 33,
      "publication_date": 20190203
    },
    {
      "title": "It's a really good size. You can fold it for storage",
      "text": "It's a really good size. You can fold it for storage. There are lots of little pockets and bands that you can slip bottles into so they're not rolling around in bag which will give you more space. There's even a mirror in the cover. Really glad I purchased this.",
      "rating": 5.0,
      "verified": true,
      "author": "Avid Reader",
      "helpful_votes": 9,
      "publication_date": 20160820
    },
    {
      "title": "Great Cosmetic Case",
      "text": "This bag was just what I was looking for - pockets and straps for cosmetics and big enough to hold all my cosmetics, but not too big. I use this bag at home, not for travel, although it could fit easily in a suitcase or tote. It's lightweight and hold it's shape once cosmetics are placed inside. The mirror that's included is of decent quality but would be better if it could stand up on its own. That point and the fact that I would have preferred a couple more pockets or straps for placing cosmetics are the only reasons I didn't give this bag 5 stars. Very happy that I bought it!",
      "rating": 4.0,
      "verified": true,
      "author": "Linda",
      "helpful_votes": 6,
      "publication_date": 20160605
    },
    {
      "title": "This cosmetic bag is big.",
      "text": "I wanted a large cosmetic bag that would accommodate my taller cosmetic items standing upright. This one fits the bill and I've looked at hundreds of them. This was the only one that works. But, if you are going to use it for travel, understand that it is large. I use it in one of the drawers in my bathroom for all my cosmetics and it is perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Huxley",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Love This!",
      "text": "I am VERY happy I got this bag. I know it says big, but I was not expecting it to be like this. The bag is well made and durable, and its a softer material. There is SO much room in this, I can fit all my makeup plus brushes. It comes with its own mirror attatched inside, and its velcro so you van remove. The train case handle is strong and can hold the weight. I am ecstatic with this case!",
      "rating": 5.0,
      "verified": true,
      "author": "Faith Bryner",
      "helpful_votes": 0,
      "publication_date": 20201006
    },
    {
      "title": "Very nice bag.",
      "text": "This bag is really well made and has a little bit of padding to protect contents. The material is thick and keeps items securely inside with a strong zipper. It's easy to wipe clean if necessary and great for packing up personal items for travel. The handle is very strong and the bag is designed to be fully packed!",
      "rating": 5.0,
      "verified": true,
      "author": "Mickey",
      "helpful_votes": 0,
      "publication_date": 20200928
    },
    {
      "title": "Nice and Large",
      "text": "I love this cosmetic case with the exception of the brush loops inside the lid. Nothing will stay put and each time I open it everything I have tried to secure in the holders falls out. If the straps were a little tighter elastic and sewn in differently it might work better. I do really like the case other than that. It is well made and nice and large. I would recommend it and I would buy again.",
      "rating": 4.0,
      "verified": true,
      "author": "phxmary",
      "helpful_votes": 3,
      "publication_date": 20171226
    },
    {
      "title": "Great cosmetic bag for a great price!",
      "text": "I bought this bag as a size upgrade from my Vera Bradley cosmetic bag. It's got a lot more room. I do wish it had a couple of zipper compartments just because I like to keep things really organized, but I have an Ipsy bag that is an almost perfect match (as you can see in the pics) so I am using that for my individual items like primer, eye shadows and a couple of samples I love. It feels very durable and zips easily! I def recommend this bag for someone needing more room and wants to stay organized as well!",
      "rating": 5.0,
      "verified": true,
      "author": "April W.Top Contributor: Photography",
      "helpful_votes": 22,
      "publication_date": 20180723
    },
    {
      "title": "Not just a makeup bag",
      "text": "It’s the perfect size for me. I am not using this as a makeup bag, but as a bag to carry my medicine in. Since I’m always on the run and need to keep a fairly large supply of pill bottles with me, it works great! It’s awesome because I don’t need to worry as much because most people think thee is just makeup in there and don’t bother it. I also am able to but random things I need in there. It’s the small/ medium things I don’t want to loose, so I put them in there and zip it up!",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole",
      "helpful_votes": 0,
      "publication_date": 20190327
    },
    {
      "title": "Great for holding lots",
      "text": "Fits all my makeup plus some including my contouring pallet and it's pretty big. Only complaint is the straps for the makeup brushes inside the lid don't hold very tight. I'd order another one even so.",
      "rating": 5.0,
      "verified": true,
      "author": "Leslie Rowland",
      "helpful_votes": 9,
      "publication_date": 20160308
    },
    {
      "title": "Perfect for my Makeup",
      "text": "I really like this bag. It fits my makeup perfectly, I have several containers of bare mineral powders, 4 eyeshadow palettes and my makeup brushes (in a book like zip up case) and it all fits. It is one big open space (so you have to just keep it organized yourself) with the exception of a few small openings that I keep the smaller containers, eyelash curler, etc. I am happy with the product for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Kaylaaa",
      "helpful_votes": 2,
      "publication_date": 20170425
    },
    {
      "title": "Nice bag, perfect for traveling with medications",
      "text": "Don't want your medications rattling around in your suitcase while traveling? Pack them in this bag! The side pouches hold eyedrops and a pill cutter, while the central area of the bag easily holds bottles of prescription medications as well as over the counter medications and vitamins with enough room left on top for socks, undies, or whatever else you might want.",
      "rating": 5.0,
      "verified": true,
      "author": "Just MeTop Contributor: Knitting",
      "helpful_votes": 0,
      "publication_date": 20190214
    },
    {
      "title": "Nice",
      "text": "This cosmetic bag looks exactly like the picture, I love the color and the size, all my makeup stuff fits really nice on this bag, even my brushes...",
      "rating": 5.0,
      "verified": true,
      "author": "YeseCastel.",
      "helpful_votes": 9,
      "publication_date": 20160823
    },
    {
      "title": "Foul smelling and disappointing",
      "text": "I’ve given up on trying to find a good makeup case on Amazon. This is the second one I’ve ordered and, like the first, it has a strong chemical odor that does not decrease. I ultimately wound up purchasing a different case at Target and would advise you not to purchase this or anything else EN’DA offers. Kudos to Amazon on the simple return process.",
      "rating": 1.0,
      "verified": true,
      "author": "Trini",
      "helpful_votes": 0,
      "publication_date": 20180430
    },
    {
      "title": "Great for storing sex toys!",
      "text": "This thing is awesome. It's big enough to hold all of my sex toys and has room for more! That's right, I use it for sex toys... Not makeup. It's sturdy, thick, and the mirror is attached by velcro so I was able to remove it because I have no use for it.",
      "rating": 5.0,
      "verified": true,
      "author": "Danielle Bray",
      "helpful_votes": 0,
      "publication_date": 20190124
    },
    {
      "title": "Well constructed, light weight and roomy!",
      "text": "I love this bag. It is just large enough to take everything personal I need and still fits in my suitcase or nice enough to carry with you. Well constructed. Zippers work perfectly with no snags. Handle is sewn on well. Light weight with plenty of room for the small flight approved bags to separate your items. I purchased the red on and I love the color! I would recommend this bag to anyone who needs a good toiletry bag!",
      "rating": 5.0,
      "verified": true,
      "author": "TLL",
      "helpful_votes": 0,
      "publication_date": 20180526
    },
    {
      "title": "seriously a good buy",
      "text": "I really like this bag, I have 2 so far but im thinking im gonna get a few more, its spacious and great! I use one for my nail polish stuff and another for my crafting! I'll probably get two more for my makeup!",
      "rating": 5.0,
      "verified": true,
      "author": "Stacey Morris",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "Good quality for price",
      "text": "The bag seems to be great quality. The only unfortunate part is that it came all scrunched up and it hasn’t straightened out completely. It’s not as stiff as I would’ve hoped. It is very large and holds all my makeup. I imagine it would be great for traveling and the velcro mirror is a plus.",
      "rating": 4.0,
      "verified": true,
      "author": "Cindy",
      "helpful_votes": 0,
      "publication_date": 20200206
    },
    {
      "title": "Looks Like Ad, NICE Appearance",
      "text": "Very pretty, just as they look on Amazon. I like this bag so much that I have ordered them in four more colors and probably will order the remainder of the colors soon. They’re a nice size, look fantastic and are great for organizing things. I’m sure they’ll work well for travel.",
      "rating": 5.0,
      "verified": true,
      "author": "Dzzperado ",
      "helpful_votes": 0,
      "publication_date": 20200208
    },
    {
      "title": "Wonderful and sturdy!",
      "text": "I bought this for me and my daughter's nail supplies. Such as, nail polish, nail polish remover, buffer, nail clippers, cuticle oil, etc. It works perfectly, and holds EVERYTHING!",
      "rating": 5.0,
      "verified": true,
      "author": "Momof3",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "Great for many use, good size, travels well.",
      "text": "I like the color shape and style. I have it with me now out of town, so it travels well. It has my important skin care product. I am sure it could be a little smaller for some people, it's the perfect size for me. I like this product very much.",
      "rating": 5.0,
      "verified": true,
      "author": "La La Linn",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "Perfect.",
      "text": "I've been looking for some inexpensive cases to stash my makeup in. These look nice and are pretty good quality, especially for the price. I can fit most of my eye shadow pallets in this bag (and I have waaaay too many, so that's saying something). There's also interior pockets which are great for stashing lipstick/small cosmetic containers, and there are also loops on the top and interior to secure brushes and larger bottles/tubes of stuff, which is nice. I will definitely be purchasing more.",
      "rating": 5.0,
      "verified": true,
      "author": "TJ_Merlovna",
      "helpful_votes": 3,
      "publication_date": 20170226
    },
    {
      "title": "Great!",
      "text": "Very large and spacious. I only have a couple issues with it. The brush holders were a bit larger than my brushes so they would sometimes fall out when opening the top. I would put two brushes in each holder to solve that problem. The bag also had a strong chemical smell that lasted for weeks. Other than that I'm very happy with it.",
      "rating": 4.0,
      "verified": true,
      "author": "Dawn P.",
      "helpful_votes": 3,
      "publication_date": 20161216
    },
    {
      "title": "Not worth it",
      "text": "I purchased 2 of these. One red and one yellow. Neither were worth the money. They don't stand up at all unless the lid is shut and even then the sides sink in. The lid is so heavy that once it's open, the whole thing flips back. Not worth the money and wouldn't purchase again.",
      "rating": 1.0,
      "verified": true,
      "author": "N1262",
      "helpful_votes": 3,
      "publication_date": 20170301
    },
    {
      "title": "Roomy, bright zippered case for all your makeup",
      "text": "Finally, after years of bags that were too small, I found this large capacity makeup bag that fits awkwardly shaped eyeshadow collections and has brush holders, and a removable mirror, too. Several colors to choose from.",
      "rating": 5.0,
      "verified": true,
      "author": "Janet M. Parlato",
      "helpful_votes": 0,
      "publication_date": 20200228
    },
    {
      "title": "Perfect",
      "text": "I bought this for a trip to Nashville and couldn't be happier. It fit all my bath and makeup products with room to spare. It fit nicely into my suitcase as well. When I got home, I just left everything in it and now I just open it up in the morning on my bathroom counter and I have everything in one place. So happy with this that I am buying my daughters each one for Christmas!",
      "rating": 5.0,
      "verified": true,
      "author": "Julie Post",
      "helpful_votes": 0,
      "publication_date": 20181119
    },
    {
      "title": "Great for keeping makeup together and for hair supplies etc.",
      "text": "Great cases. Have bought six of these I think it is and find lots of uses for them in my bathroom and for travel too. I have one just for lipsticks and lipglosses and another for eye makeup and another for face makeup and brushes for powder and cheek color. I use another for hair ties, Bobbie pins, barrettes, head bands, etc. Keeps everything super neat.",
      "rating": 5.0,
      "verified": true,
      "author": "Cynthia",
      "helpful_votes": 0,
      "publication_date": 20180818
    },
    {
      "title": "Pleasantly surprised",
      "text": "I absolutely love this makeup bag. I thought that it wouldn't be great due to the price, but I was super surprised that it was so big! I have zero complaints about this bag",
      "rating": 5.0,
      "verified": true,
      "author": "Courtney",
      "helpful_votes": 0,
      "publication_date": 20200805
    },
    {
      "title": "Perfect Size, Good Quality with Handy Pockets Inside!",
      "text": "Medium sized cosmetic bag that collapses flat for storage. I found the many pockets inside very handy. Good quality. The outside zipper worked smoothly. It came with a funky smell which disappeared after airing it out for a few hours. Handy mirror inside attached to top flap. Arrived on time and packaged well. I would buy again and recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "EvaluatorTop Contributor: Cooking",
      "helpful_votes": 0,
      "publication_date": 20180723
    },
    {
      "title": "Sturdy, spacious and great for organizing",
      "text": "Inside is roomy with lots of pockets and loops/straps for organizing. The mirror is nice to have as well. Seems sturdy but soft enough to be flexible. I got the pink one which is a bright fun color.",
      "rating": 5.0,
      "verified": true,
      "author": "JFUtah",
      "helpful_votes": 0,
      "publication_date": 20201023
    },
    {
      "title": "I’m too cheap to buy the Jeffree Star ones.",
      "text": "This thing is pretty dang big. I personally can not imagine trying to travel with it. But I didn’t buy it for that intention anyways. It holds a massive chunk of my makeup. I like the color, and I like the material. It’s very sturdy and doesn’t fold in on itself.",
      "rating": 5.0,
      "verified": true,
      "author": "Katy",
      "helpful_votes": 0,
      "publication_date": 20191003
    },
    {
      "title": "Great bag!!!",
      "text": "I love this!! I measured it with a tape measure before I bought it and it is still bigger than I thought. It fits more than enough things in there. I didn't like the mirror where it was and then realized it dettaches. The only complaint I would have about this bag is the brushes tend to fall out sometimes when you store them in the top. But I love this bag!",
      "rating": 5.0,
      "verified": true,
      "author": "Danielle",
      "helpful_votes": 0,
      "publication_date": 20180430
    },
    {
      "title": "Great product.",
      "text": "I bought this for my medicine bottles because I have a LOT and had no where to store them. I also bought another bag for my makeup. These are great bags. Sturdy and has a lot of room.",
      "rating": 5.0,
      "verified": true,
      "author": "Jen",
      "helpful_votes": 0,
      "publication_date": 20200223
    },
    {
      "title": "Plenty of room for all of my make up. ...",
      "text": "Plenty of room for all of my make up. The reason I only gave it four stars was because one of the zippers was separated from the teeth on the tract so it would not close the bag properly. Was going to return but luckily the other zipper was able to actually close the bag, so I kept it.",
      "rating": 4.0,
      "verified": true,
      "author": "Mia",
      "helpful_votes": 2,
      "publication_date": 20170410
    },
    {
      "title": "Only option on Amazon",
      "text": "It's fine. However, it can be easily damaged through. One pair of sharp item (scissors) and the entire bag was damaged from the inside out while traveling. Mirror is too unpolished. Also the exterior isn't exactly the same as the picture.",
      "rating": 3.0,
      "verified": true,
      "author": "Mingxin",
      "helpful_votes": 2,
      "publication_date": 20170914
    },
    {
      "title": "Great Large Bag",
      "text": "I do my own acrylic nails and use this bag for all my supplies. It's perfect - large, sturdy - and the yellow color is fantastic. Very bright. The exterior is easy to clean with a simple wipe down. There are even a few pouches inside for keeping bottles upright. Highly recommended. Great price.",
      "rating": 5.0,
      "verified": true,
      "author": "saltbox",
      "helpful_votes": 0,
      "publication_date": 20181016
    },
    {
      "title": "Large bag is what I wanted and got!",
      "text": "This cosmetics bag is large enough to hold my make-up and much of my medicine. (Diabetes supplies are something else for long trips!) I haven’t used it yet but think I will like it.",
      "rating": 5.0,
      "verified": true,
      "author": "W. L. Walter",
      "helpful_votes": 0,
      "publication_date": 20200204
    },
    {
      "title": "But the quality of this bag is awesome! I even managed to personalize it with HTV",
      "text": "I would call this a travel bag. I showed a few girlfriends of mine the size of this and none of them carry this much make up around with them lol. The person I bought this for actually used it for a travel case over a daily make up bag. But the quality of this bag is awesome! I even managed to personalize it with HTV. So for any of you looking at these for personalization it can be done...but is very difficult!",
      "rating": 5.0,
      "verified": true,
      "author": "Chris & Kristine",
      "helpful_votes": 0,
      "publication_date": 20170215
    },
    {
      "title": "Solid zipper and seems durable",
      "text": "I am using this to hold my blood pressure cuff. It seems sturdy and durable so I gave five stars. However, time will tell.",
      "rating": 5.0,
      "verified": true,
      "author": "Chihood",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "Nice size",
      "text": "Nice size! I’ve been looking for a new makeup bag for a while and after reading reviews decided to go with this one/ it has great depth and keeps everything pretty organized. The brushes do fall out of the top like I had read in other reviews but that doesn’t really bother me. Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181216
    },
    {
      "title": "High quality",
      "text": "Much nicer than I figured it would be. Great color. Sense like it will clean easily. I use it too keep and my pills in. Larger than dinner others too. Some eleactic inside to hold bottles",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "Too soft and not sturdy",
      "text": "Brought it for my medication bottles, which are not heavy at all. It’s ok though for 4-5 bottles of meds but definitely not for the makeup, which is way heavier It’s not like sturdy it’s more like a coverup for a kitchen aid, very soft",
      "rating": 3.0,
      "verified": true,
      "author": "Susan",
      "helpful_votes": 0,
      "publication_date": 20190323
    },
    {
      "title": "Perfect",
      "text": "Omg this bag is huge! I got it because I spend the weekends with my boyfriend, and I needed something to transfer my makeup. I've got enough room in it for ALL of my makeup! My eye shadow palettes, contour palette, lipsticks, brushes, everything. Plus, I have room for my vitamin e oil, makeup remover, astringent, travel sized face wash, and my medications. This is exactly what I needed and then some!",
      "rating": 5.0,
      "verified": true,
      "author": "Janice",
      "helpful_votes": 0,
      "publication_date": 20180228
    },
    {
      "title": "New cosmetic bag",
      "text": "Bought this for my wife to replace a rigid cosmetic tote with a broken handle. It was a little smaller than I had expected but my wife likes it and says that it works better than the one that she had carried for years. She especially likes the light weight of it and the overall quality of construction seems very good.",
      "rating": 4.0,
      "verified": true,
      "author": "Bodysolid48",
      "helpful_votes": 2,
      "publication_date": 20160905
    },
    {
      "title": "I don’t regret buying it. Good space.",
      "text": "Looks so good in red, loved it. You can use it for different stuff. Makeup bag, baby bottles, jewelry, lmfao.",
      "rating": 5.0,
      "verified": true,
      "author": "DiablaAndy",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "Spacious, cute, and durable!",
      "text": "I love this makeup bag! I can fit 8-9 full make up palettes plus other loose makeup. I love all the places for brushes, eyeliner, mascara, etc. in the top. I was very thrilled at the value, quality, and durability. I planned to use this just when I traveled , but I may make it part of my makeup organization system at home. Very very pleased!!",
      "rating": 5.0,
      "verified": true,
      "author": "Ameeeeee",
      "helpful_votes": 0,
      "publication_date": 20190501
    },
    {
      "title": "Nice but Big",
      "text": "I needed a new makeup bag because mine was falling apart and super old. This bag is bigger than I need but that’s my fault for not measuring correctly. It’s made nice and the color is vibrant. The inside is big and even has a little mirror on the lid. It’ll do.",
      "rating": 4.0,
      "verified": true,
      "author": "Sheri K",
      "helpful_votes": 0,
      "publication_date": 20180917
    },
    {
      "title": "Very nice makeup bag!",
      "text": "This cosmetic bag is just what I needed. It’s holds a nice amount of products. It has a mirror and spots for brushes. It’s made of nice thick wipeable material. I also bought one in yellow for my daughter, highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Virginia B.",
      "helpful_votes": 0,
      "publication_date": 20190401
    },
    {
      "title": "HUGE",
      "text": "Larger then expected. I use very minimal makeup (because I'm terrible with makeup) and this has so much room left over. I could pack my clothes and swimsuit in here next time I go on vacation and save on luggage costs.",
      "rating": 5.0,
      "verified": true,
      "author": "JanetSnakehole",
      "helpful_votes": 2,
      "publication_date": 20170613
    },
    {
      "title": "I'M IN LOVE!!!",
      "text": "Just what I needed! I travel a lot and never really had a bag to put my makeup products in. I used to just put them in a small bag and stuff them in my backpack. I am so glad I bought this -- it's durable, excellent quality, organized, spacious, and stylish! I definitely recommend buying this if you can't imagine traveling without your beloved makeup products <3!",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony Phan",
      "helpful_votes": 0,
      "publication_date": 20170418
    },
    {
      "title": "The bag would be perfect for her makeup and jewelry if the mirror wasn't ...",
      "text": "This would be a five star review if the mirror hadn't been broken on arrival. This was purchased for a college student to take up to school and since she is leaving in a couple of days there is no time to return it and wait for a replacement. The bag would be perfect for her makeup and jewelry if the mirror wasn't broken. She'll still use it but will probably need to find another mirror unless there is one in her dorm.",
      "rating": 3.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 5,
      "publication_date": 20160817
    },
    {
      "title": "Good quality",
      "text": "I use this to carry around my medicine in. It's the perfect size to hold medicine bottles and much more! Good quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Christin",
      "helpful_votes": 0,
      "publication_date": 20200607
    },
    {
      "title": "I love it! It’s so big yet the material is ...",
      "text": "I love it! It’s so big yet the material is able to collapse so that it doesn’t take up too much room when I need to bring it with me. I love all the spots for my brushes on the top. The only thing I don’t like is the lack of pockets on the bottom. I think more pockets would allow me to be more organized instead of everything just thrown on the bottom.",
      "rating": 4.0,
      "verified": true,
      "author": "Stacey Albert",
      "helpful_votes": 0,
      "publication_date": 20180504
    },
    {
      "title": "Very large bag",
      "text": "This bag is HUGE! There is enough space in there to hold all of my makeup, makeup brushes, perfume, and hair products! This will not work as a travel bag for me, its just too big, but I'm happy to have it in my home because it fits in a deep drawer and allows me to keep more items in it and off the counter top.",
      "rating": 4.0,
      "verified": true,
      "author": "Nicole Belkin",
      "helpful_votes": 0,
      "publication_date": 20170104
    },
    {
      "title": "Oh well",
      "text": "Like it. I like all the compartments in it and that it comes with a mirror but it could have a stronger structure. The top was squished in when I got mine so it doesn’t sit up perfectly. It looks like a deflated souffle. Lol.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180221
    },
    {
      "title": "Pretty Organization",
      "text": "I. Love. This. Bag. It's very easy to open. There's a small mirror inside, just in case. There is plenty of room for bottles and such. Along the lid are elastic bands for makeup brushes. Around the sides are pockets and elastic bands. It's just a great little organizational tool for beauty and hygiene products.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Posley",
      "helpful_votes": 0,
      "publication_date": 20161211
    },
    {
      "title": "Great buy!",
      "text": "Super handy bag. I used it for traveling. Big enough to fit all my crap, small enough to still fit into my luggage. I've dragged this thing all over the place and its pretty sturdy. Ran it through the wash a couple of times as well. Zipper is holding up. Nothing bad to say about it",
      "rating": 5.0,
      "verified": true,
      "author": "SandraP",
      "helpful_votes": 0,
      "publication_date": 20170306
    },
    {
      "title": "Great Multipurpose Bag",
      "text": "Nice size bag, compartment areas to help organize and nice brush holder. I like that I can fit more than makeup in this bag, I can throw shampoo, conditioner, lotion, shaver, jewelery, etc. into the bag, which makes it great for traveling. Not too big or small, this is perfect for my needs!",
      "rating": 5.0,
      "verified": true,
      "author": "Terese",
      "helpful_votes": 2,
      "publication_date": 20161226
    },
    {
      "title": "LOVE THIS ITEM!! MUST BUY!!",
      "text": "It's just perfect! This design is classy and simple yet super functional. Trust me, I did my research. All my cosmetic products fits in this bag and the mirror is definitely a plus for travels. Durability is unsure right now since I just got this item. So far so good though. Highly recommended item!!",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly Nguyen",
      "helpful_votes": 0,
      "publication_date": 20161214
    },
    {
      "title": "Perfect design for me",
      "text": "Perfect design for me. I use this as my main toiletry case for travel. I love the fliptop design and the clear view down into the contents. I need the relatively large size for the many items I take on long trips. It is sturdy and stands up straight on its own, but also lightweight. I am completely happy.",
      "rating": 5.0,
      "verified": true,
      "author": "MSWTop Contributor: Cooking",
      "helpful_votes": 0,
      "publication_date": 20170923
    },
    {
      "title": "Super cute & large enough to fit my makeup",
      "text": "Really good quality. Color is spot on and size is accurate. Holds all my makeup well, and some extra. The side elastics really come in handy. Easy to carry, zips well, and easy to wipe down if makeup makes a mess. 10/10 would recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Nat",
      "helpful_votes": 0,
      "publication_date": 20190124
    },
    {
      "title": "Great Portable make up bag",
      "text": "Terrific size. My make up collection is constantly growing and this is the perfect size with all the compartments. The only downfall is the mirror attached to the top, it gets a bit annoying because it's flappy. I may have to cut it off. I would compare the size to a big lunch box",
      "rating": 5.0,
      "verified": true,
      "author": "Emily",
      "helpful_votes": 0,
      "publication_date": 20180125
    },
    {
      "title": "Great For a Dog Grooming bag! 🤗",
      "text": "Okay. I know it’s a makeup bag, but I bought this for my Shih tzu. I groom him myself. I keep his trimmer all attachments comb brush nail clippers etc. I looked at all the dog grooming bags and they were too small and to much $$$. So I bought a makeup bag! And I’m super stoked that I did! It fits everything nicely! So I gave this a 5 star for the price, quality, versatility, and design!",
      "rating": 5.0,
      "verified": true,
      "author": "Loramae",
      "helpful_votes": 0,
      "publication_date": 20190720
    },
    {
      "title": "love the color and its size",
      "text": "I love this makeup case cuz I can put everything in it and it's easy to carry and it's sturdy and durable.",
      "rating": 5.0,
      "verified": true,
      "author": "Bonita",
      "helpful_votes": 0,
      "publication_date": 20200413
    },
    {
      "title": "Much bigger than I though",
      "text": "I bought this to use at home for all of my makeup. It’s the perfect size. I don’t think I’d use it to travel because it’s quite big.",
      "rating": 5.0,
      "verified": true,
      "author": "LMV",
      "helpful_votes": 0,
      "publication_date": 20191009
    },
    {
      "title": "Cute and practical",
      "text": "My daughter wanted a bag for her makeup and uses this everyday. Its cute and she takes it everywhere. Hold all her brushes also which is a nice feature",
      "rating": 4.0,
      "verified": true,
      "author": "Denise Marie",
      "helpful_votes": 0,
      "publication_date": 20190728
    },
    {
      "title": "Holds a lot",
      "text": "I've used this bag for hair care products, makeup, and skin care. It holds a lot and keep everything in place. Its a little disappointing when you first open because it looks small. But surprisingly it holds all my items.",
      "rating": 5.0,
      "verified": true,
      "author": "Adrieanne Moliere",
      "helpful_votes": 0,
      "publication_date": 20181119
    },
    {
      "title": "Other than that- I love the pockets and it's quite spacious - that was ...",
      "text": "Biggest issue is a mirror at the top and I have to prop the top against something for it to stay in place. Other than that- I love the pockets and it's quite spacious - that was a nice surprise.",
      "rating": 4.0,
      "verified": true,
      "author": "Brittany",
      "helpful_votes": 2,
      "publication_date": 20170430
    },
    {
      "title": "Nice",
      "text": "I got this to house all of my nail supplies. I like the color and it seems pretty sturdy.",
      "rating": 5.0,
      "verified": true,
      "author": "Catherine Hope Godley",
      "helpful_votes": 0,
      "publication_date": 20200318
    },
    {
      "title": "Cosmetic Bag",
      "text": "Haven't used it yet for traveling but know it's going to be great 'cause it contains even larger items I've had to pack separately. It's well made, includes inner side pockets and brush/tube pockets--even a mirror. Worth more than it cost, I think.",
      "rating": 5.0,
      "verified": true,
      "author": "Captive Yet Free",
      "helpful_votes": 0,
      "publication_date": 20170425
    },
    {
      "title": "Arrives flat",
      "text": "The bag arrived flat and even when filled, still wants to collapse. If I had know that, I would not have ordered it. I wanted a case that would stand up by itself. I will give this one to the Goodwill and go to Walmart and find a stiff sided bag.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180304
    },
    {
      "title": "Wonderful Bag",
      "text": "This bag is wonderful for holding all of my cosmetics, it is quite durable and the color is lovely! The bag has a lot of storage space which fits my vast array of products, this bag is also perfect for traveling.",
      "rating": 5.0,
      "verified": true,
      "author": "Ethan",
      "helpful_votes": 0,
      "publication_date": 20190526
    },
    {
      "title": "Very sturdy cosmetic bag with a lot of space!",
      "text": "I honestly am in LOVE with this bag! At first I was a bit worried that it would be flimsy considering how inexpensive it is, but when I got it I was very surprised at how good and sturdy it is! Before I had this small cosmetic bag that wouldn’t close completely and I don’t even have that many products, but this one holds all of my products and there’s a ton of space left for more!!! So happy with my purchase!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Naiomy Martinez Rodriguez",
      "helpful_votes": 0,
      "publication_date": 20190311
    },
    {
      "title": "Great case",
      "text": "I had an extremely difficult time finding a train like this, so I was extremely pleased when I stumbled across this. It’s large, yet compact, and very durable. Easy to use and easy to clean.",
      "rating": 5.0,
      "verified": true,
      "author": "T728",
      "helpful_votes": 0,
      "publication_date": 20190415
    },
    {
      "title": "Gets the job done!",
      "text": "It’s ok but the side fall in... i’d rather have a case that’s more sturdy. Overall for the money, this is not a bad cosmetic case.",
      "rating": 3.0,
      "verified": true,
      "author": "Kathy",
      "helpful_votes": 0,
      "publication_date": 20191104
    },
    {
      "title": "Cracked mirror",
      "text": "Really like the makeup bag. The mirror inside, even though there was bubble wrap on it, did arrive cracked. I probably won’t use the mirror, so I won’t be exchanging it for another one. Thank you.",
      "rating": 4.0,
      "verified": true,
      "author": "Sarah Dial",
      "helpful_votes": 0,
      "publication_date": 20190311
    },
    {
      "title": "holds everything I need it for",
      "text": "I used this for traveling and it is great. everything I need can be stored here without problem",
      "rating": 5.0,
      "verified": true,
      "author": "cian ai",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "Love this case",
      "text": "Have wanted a train case for a while but did not want to pay a lot for one. My sister has one that I like but she paid $100. This one is the exact same measurements as hers, for a fraction of the price! Have taken on 2 trips so far and absolutely love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Mom of book-loving kids!",
      "helpful_votes": 0,
      "publication_date": 20181024
    },
    {
      "title": "looked a lot better than expected",
      "text": "Not a Victoria Secrets makeup bag but will definitely serve its purpose..looked a lot better than expected, happy with purchase and for what I payed for it!",
      "rating": 4.0,
      "verified": true,
      "author": "blessed1986",
      "helpful_votes": 2,
      "publication_date": 20171117
    },
    {
      "title": "it had a bad odor. I used a cleaner to minimize the ...",
      "text": "Upon opening the cosmetic bag, it had a bad odor. I used a cleaner to minimize the smell, over time it eventually disappeared. The open flap contains the brush slot holders, which are too big for the brushes that I have. There are two small flimsy compartments inside of the cosmetic bag, they are not sturdy and have started tearing. Lot's of storage inside the bag.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20170626
    },
    {
      "title": "Well made",
      "text": "Bag is big, well made and even has a velcro mirror on the inside. May have to get more of these for Christmas gifts.",
      "rating": 5.0,
      "verified": true,
      "author": "M Lara",
      "helpful_votes": 0,
      "publication_date": 20201011
    },
    {
      "title": "AWESOME as a makeup travel bag",
      "text": "I love the depth in this bag, as well as the interior pockets which help keep certain items (such as foundation and other liquids) upright. I wish it had an interior divider as well but otherwise it is perfect for travel and holds a TON of makeup! Will recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "E. W.",
      "helpful_votes": 0,
      "publication_date": 20171022
    },
    {
      "title": "Stiff sides, or collasible? You choose",
      "text": "I like a stiff-sided case. But this collasible one folds flat and is handy in your suitcase for overflow products you pick up along the way to bring home. If you like to browse shops and pick up new makeup items, you'll have the perfect extra space for them.",
      "rating": 4.0,
      "verified": true,
      "author": "Still St. Leigh",
      "helpful_votes": 0,
      "publication_date": 20161110
    },
    {
      "title": "Well made and lots of storage!",
      "text": "Love love love. I like my makeup. I needed something to hold it all and this does an amazing job. I've had it for a while now and it's holding up perfectly. I would definitely buy again. As a matter of fact I did buy another for my daughter!",
      "rating": 5.0,
      "verified": true,
      "author": "Stacey Herbst",
      "helpful_votes": 0,
      "publication_date": 20180830
    },
    {
      "title": "Very nice bag",
      "text": "Very nice bag. It fits everything I need (makeup, small lotions, makeup tools, etc). I have a little room left if I need to add something else. I added dividers for more organization. I recommend this bag, especially for travelers. Good price.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180408
    },
    {
      "title": "Great makeup bag!",
      "text": "Great makeup bag! As big as I expected. I love that it’s so roomy and I have places for my brushes now! The mirror is a plus to if you’re on the go and need it.",
      "rating": 5.0,
      "verified": true,
      "author": "lnbxo",
      "helpful_votes": 0,
      "publication_date": 20181216
    },
    {
      "title": "I really like how spacious and durable this make-up bag is",
      "text": "I really like how spacious and durable this make-up bag is. It's easy to clean also. My complaint is the mirror on the lid. It makes it to where my make-up bag tips over upon opening. Another flaw is my make-up brushes fall out of the slots that are also on the lid. Still a great product though.",
      "rating": 4.0,
      "verified": true,
      "author": "Ciera",
      "helpful_votes": 0,
      "publication_date": 20170126
    },
    {
      "title": "Made My Wife So Happy!",
      "text": "My wife talked about her new bag for a week - she is so happy with it. Uses it daily and has a place for every item she uses.",
      "rating": 5.0,
      "verified": true,
      "author": "Bailey Hagar",
      "helpful_votes": 0,
      "publication_date": 20190512
    },
    {
      "title": "Worth it",
      "text": "It's a great value for the price. The case is well made.",
      "rating": 5.0,
      "verified": true,
      "author": "misaki",
      "helpful_votes": 0,
      "publication_date": 20200306
    },
    {
      "title": "Lots of pockets and large enough to carry everything!",
      "text": "Happy with my purchase. Very sturdy and love the color.",
      "rating": 5.0,
      "verified": true,
      "author": "kickchick",
      "helpful_votes": 0,
      "publication_date": 20200305
    },
    {
      "title": "Love it!",
      "text": "Perfect size fo my needs. Sturdy and well made. good price for value.",
      "rating": 5.0,
      "verified": true,
      "author": "MARY MULLNER",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "I love it!",
      "text": "I love it! So much space! But I ended up jazzing it up to enhance its styling to my liking!",
      "rating": 5.0,
      "verified": true,
      "author": "Ayana Rush",
      "helpful_votes": 5,
      "publication_date": 20161203
    },
    {
      "title": "Beautiful color",
      "text": "This bag is lovely and even looks better in person. I bought it for my makeup and it ended up being too big for my basic supplies. I tried to make it work though, because it really is a beautiful color and appears well made.",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle",
      "helpful_votes": 0,
      "publication_date": 20190115
    }
  ],
  "product_meta": {
    "title": "EN'DA Cosmetic bags with quality zipper Big size Nylon Make up Bag single layer make up organizer(Black)",
    "rating": 4.5,
    "feature_bullets": [
      "Bag Size - 7x7x10 inches",
      "This makeup cosmetic bag is made of high quality Nylon, and with durable handle and quality zipper",
      "The cosmetic bag is easy to clean",
      "With Classical diamond pattern, the cosmetic bag is including a lot of small pockets,you could put your brushes,makeups,pearls and jewels,and other stuffs seperates",
      "It's also a very good travel bag,the case is good for putting medicine,toothbrush,toothpaste,toileties etc."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "9.8 x 6.7 x 7.1 inches; 10.56 Ounces",
      "Item model number": "SG_B00SSTF8MK_US",
      "UPC": "708191644279 759894886312",
      "Manufacturer": "EN'DA professional",
      "ASIN": "B00SSTF8MK",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Cosmetic Bags",
      "Tools & Accessories",
      "Bags & Cases",
      "Beauty & Personal Care",
      "All Departments"
    ],
    "price": 14.99
  }
}