{
  "website_summaries": [
    {
      "verdict": "Formulated to boost hair health while also improving skin texture.",
      "pros": [
        "Reviewers love the Peruvian blend of saturating oil",
        "Delivers nutrients and photo-ready shine to one's hair",
        "Easy to mix in with daily skincare routines as well",
        "High marks for its effectiveness as a night oil"
      ],
      "cons": [
        "Test small patches first to make sure the oil is right for you"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "DROPPER IS IN THE BOX.  LOOK CAREFULLY SIDE COMPARTMENT",
      "text": "This is nothing short of a miracle! Arrived perfect and quick. My skin is a priority to me. It’s not a vain thing it’s a necessity. IF YALL LOOKING FOR THE DROPPER ITS IN THE BOX IN A SIDE FLAP!! I wrote to the sellers and she wrote back where it was. Simple. I feel dumb cause I know my way around shopping online. I love love love this gem of an oil and this exact brand. BUY ALL YOU CAN. I’d kiss the person who gifted me with this. I’m a customer forever. I’m 69 and look pretty good.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Krieger Chalaire",
      "helpful_votes": 82,
      "publication_date": 20190227
    },
    {
      "title": "I have purchased Jojoba oil for the last 30 years ...",
      "text": "I have purchased Jojoba oil for the last 30 years using it as part of my facial routine. This brand appeared watered down and thin compared to my regular brand. I was afraid to apply to my face. Returned, just was not right.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 297,
      "publication_date": 20170429
    },
    {
      "title": "Totally transformed my cuticles",
      "text": "I love this oil I was amazed at the difference it made in my hands and cuticles! My cuticles were dry and cracked and in 2 weeks you couldn't even recognize my fingers! I use it on my face too my skin feels so good!",
      "rating": 5.0,
      "verified": true,
      "author": "Kate L",
      "helpful_votes": 47,
      "publication_date": 20190110
    },
    {
      "title": "Nice oil for oily skin",
      "text": "My skin had big pores specially near the nose and apple of my cheeks but this oil had made them visibly smaller and my skin now has a visible glow. I bought this product beacuse jojoba oil is closer to skin sebum. My acne scars have also started to fade away. My recipe to use it - 3 drips of jojoba oil + 1 drop of castor oil + 1 drop of tea tree oil. It works wonders",
      "rating": 5.0,
      "verified": true,
      "author": "Somya",
      "helpful_votes": 53,
      "publication_date": 20180111
    },
    {
      "title": "Mold in 2 of my bottles",
      "text": "Order this the first time a few monthd ago and love it for taking off my makeup and moisturizing. I inadvertantly left it in the car overnight and with cold temps it got hard, then came back to room temo to liquid form. Fast forward a few weeks and I noticed my oil had mold in it. The mold actually came out in the dropper. Thinking this is my fault for not storing jt at room temp, i tossed it and ordered a nee one. It just arrived today, still sealed, and also has clumps of what I can only guess are mold/fungus growth.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 24,
      "publication_date": 20180304
    },
    {
      "title": "Buy it Best moisturizer for your face",
      "text": "I cannot live without this in my skincare routine. I ran out a month ago and my skin dried out and freaked out. I do have mild adult ance and it's a bummer since I'm almost 29. But this is a must for me !!!",
      "rating": 5.0,
      "verified": true,
      "author": "Brittany Spinelli",
      "helpful_votes": 58,
      "publication_date": 20170223
    },
    {
      "title": "Kate Blanc Cosmetics USDA Certified Organic Jojoba Oil",
      "text": "I am very excited to have begun on this path of healing and I have only had this product for a few days and am already experiencing some of the benefits of this oil. I started using it at night with my night time moisturiser and I feel my skin responding and looking softer. I also started using it on dry spots on my skin that occur in the cold season and feeling relief there too. I look forward to using it as a carrier oil for essential oil blends. Jojoba Oil (4 oz), USDA Certified Organic,...",
      "rating": 5.0,
      "verified": true,
      "author": "Virginia Castruita",
      "helpful_votes": 24,
      "publication_date": 20170423
    },
    {
      "title": "A great product",
      "text": "This jojoba oil is amazing as a night moisturizer, it absorbs quickly and don't give me a greasy sensation, I recommend it and I already repurchased it!",
      "rating": 5.0,
      "verified": true,
      "author": "Sonia Eguia",
      "helpful_votes": 23,
      "publication_date": 20170423
    },
    {
      "title": "Not sure if it was supposed to come like this!",
      "text": "The bottle I ordered is only half full. Not sure if it's supposed to be like this. As you can see it's only half full and the lid is still sealed so none has been taken out. Felt lighter than I thought it would be when I took it out of the box. Says 4 fl oz but I compared it to an unopened bottle of children's Benedryl that was also 4oz and the Jojoba Oil is significantly lighter and it's in a glass bottle versus the plastic that the Benedryl is in so, if anything, it should be quite a bit heavier. Not happy.",
      "rating": 1.0,
      "verified": true,
      "author": "Ashley Aston",
      "helpful_votes": 8,
      "publication_date": 20190530
    },
    {
      "title": "Received a Completely Different Item",
      "text": "Instead of the oil, I received some kind USB keyboard punching device - I guess it's good for something - I can let my anger out on it instead of the seller.",
      "rating": 1.0,
      "verified": true,
      "author": "Sophia Clark",
      "helpful_votes": 8,
      "publication_date": 20191003
    },
    {
      "title": "Scam! Not jojoba oil!",
      "text": "Not real jojoba oil. It smells like very old vegetable oil and nothing like jojoba oil.",
      "rating": 1.0,
      "verified": true,
      "author": "K. R. Chastain",
      "helpful_votes": 6,
      "publication_date": 20200124
    },
    {
      "title": "May have received an old bottle?",
      "text": "Wanted this to work for psoriasis but after the first use I noticed the smell in the bottle changed to a not so pleasant smell almost as if it was old.. also I don’t know if it’s a coincidence but my knees were itchy after using.",
      "rating": 1.0,
      "verified": true,
      "author": "jessica ",
      "helpful_votes": 5,
      "publication_date": 20190113
    },
    {
      "title": "Best jojoba oil used for my hair!",
      "text": "Being somewhat of a picky male, I have used other oil types in the past but found jojoba oil to be the best for my hair. This particular brand seems to beat other similar jojoba oil brands. My hair feels lighter yet easier to manage, which I like. I bought 2oz instead of 4oz mainly because I will be using it during my travels. Size is good. Just wish 2oz one is a bit cheaper. (I know that price includes shipping and bottle cost and all but...)",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190310
    },
    {
      "title": "Disgusting SMELL...",
      "text": "This was my first time buying this oil, and it was a huge mistake unfortunately. The oil smells seriously wrong--like rotting bacon. Do you want your face to smell like decaying pork? Don't put this anywhere near your skin.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20191218
    },
    {
      "title": "Good for oily skin",
      "text": "I use it as a moisturizer (I have oily skin), and it works really well. But my friend who has dry skin tried it and it didn't do much. I think this oil is best for those with oily skin types",
      "rating": 4.0,
      "verified": true,
      "author": "S",
      "helpful_votes": 4,
      "publication_date": 20180706
    },
    {
      "title": "Works Great!",
      "text": "I'm experiencing very dry skin on my arms this summer and oils seem to be the best hydrating solution. Jojoba oil is good and healing for your skin, so I tried this brand. I was enticed by the dropper as I thought it would be easier to use and less messy than a spray or bottle. It is. The dropper is great and so is the oil. It has already helped heal and hydrate my skin. I'm very happy with it and will be ordering more. It's also a very nice bottle. I also like that the oil is organic.",
      "rating": 5.0,
      "verified": true,
      "author": "Diane Wheaton",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "Great product!",
      "text": "It's really a nice smooth feeling, I used it right out of a nice hot shower. My skin just absorbed it up! Usually I have to dab cause some spots just don't want it. Lol but this was really great. It has no scent at all. Don't need to use much either one drop goes a long way. Even put some in a mini spray bottle for my hair, it worked! So you know it's not a heavy oil, its thin enough to use as a spray. Highly recommended!",
      "rating": 4.0,
      "verified": true,
      "author": "CANDACE",
      "helpful_votes": 4,
      "publication_date": 20170831
    },
    {
      "title": "Soft skin, but lots of breakouts",
      "text": "I really wanted to like this because honestly it made my skin SUPER soft, but unfortunately it caused lots of breakouts. I have fairly sensitive skin but I’ve never struggled with acne or products causing bumps on my face until I used this product. I wanted to like it so much that I continued to wear it for 3-4 days but I HAD to stop when I got matching pimples fhat looked like dimples. Not a good look.",
      "rating": 3.0,
      "verified": true,
      "author": "Allison",
      "helpful_votes": 3,
      "publication_date": 20190114
    },
    {
      "title": "Disappointed this time around..",
      "text": "I bought this exact product in April 2018 and loved it (despite the dropper being crappy). It wasn't greasy and it had a subtle but pleasant smell. I love to put this on my face before I put foundation/concealer on. I needed to purchase another, so I did. It just arrived and I put some on my cuticles. The dropper is of better quality, but the smell is horrible. My coworker said it smells like olive oil, although, I don't smell it; I like the smell of olive oil. Maybe I just got a bad batch, but I'm nervous about putting it on my face..",
      "rating": 3.0,
      "verified": true,
      "author": "Ashley",
      "helpful_votes": 2,
      "publication_date": 20191202
    },
    {
      "title": "Didn't work on my face, but great for my hands",
      "text": "I bought this product to try and make my skincare routine more natural-- this oil was not good for my face. It made me break out terrible. However, I started getting eczema on my hands from all the washing and sanitizing, and I had the idea to put this oil on my hands, and it is AMAZING. I have been trying everything to get rid of the itchy, bumpy rash, and after putting the oil on two times the bumps have flattened, they are much lighter in color, and they aren't itchy anymore. If you're buying this for your face and you are acne-prone, BEWARE. If you are buying this to add some moisture, go for it.",
      "rating": 3.0,
      "verified": true,
      "author": "Carlotta",
      "helpful_votes": 0,
      "publication_date": 20200926
    },
    {
      "title": "Great beard oil",
      "text": "I added this to my essential oil collection on my beards journey of growth. I like adding this oil to my beard to add softness and volume to a dry beard. I like adding a few drop to my hand going threw my beard to give it extra moisture and like allot of bulk of a heavy oil it absorbs really quickly and won't leave you oily on my beards . I hate having someone add fillers to products when you really just want a the good stuff. This oil is pure and will give you the hair you really want.",
      "rating": 5.0,
      "verified": true,
      "author": "pete scanlon",
      "helpful_votes": 2,
      "publication_date": 20180722
    },
    {
      "title": "See comments on box",
      "text": "When I ordered this no mention was made of the \"best results\". Per the box, for best results mix with Rosehip Seed Oil and/or Vitamin E oil, i.e. 5 drops of Jojoba, 1 drop of E, 3 drops of Rosehip. So do I assume that using the Jojoba oil alone I will not get the \"best results?\" Mixing 3 oils each and every time I use this does not work for me nor does the cost of two additional oils. Disappointed.",
      "rating": 2.0,
      "verified": true,
      "author": "Sammypot",
      "helpful_votes": 0,
      "publication_date": 20191203
    },
    {
      "title": "Great product, I’ll buy again!",
      "text": "Honestly think there’s a difference! I’m not sure if it was the placebo effect or what, but my stretch marks were lighter and my nails felt stronger. The oil doesn’t really smell, and I wore shorts to bed to avoid staining, but there is nothing on them. Really great product! Just make sure to keep using it. Once I skipped a few nights, and I felt like my marks went back to the original darkness. You have to keep a routine up!",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190609
    },
    {
      "title": "I like the product, use it mainly for my hands and nails, a few drops with my hand cream or along",
      "text": "I like the product, use it mainly for my hands and nails, a few drops with my hand cream or alone. When using alone, the product absorbs quickly into your skin after rubbing your hands together a few times. The only big issue I have is with the Dropper, the dropper dispenses way to much product, and instead of holding the liquid oil in the tube, it just flows out before you even squeeze the bulb on top of the dropper. I will order again only because I do like the product. Hopefully the company will change the dropper soon ...",
      "rating": 3.0,
      "verified": true,
      "author": "Lil",
      "helpful_votes": 2,
      "publication_date": 20180906
    },
    {
      "title": "Legit works!!!!",
      "text": "I’ve been having severe issues with my hair breaking for years now. Very dry and just breaks. I’ve spent hundreds of dollars on vitamins, hair products, salon treatments...you name it. I stumbled on this and read the reviews so I had to try it. I put half a dropper in my hair in the shower while shampooing and conditioning. After a weeks use....I’m mind blown. Hardly any breakage and my hair is silky soft! I can’t recommend this enough!",
      "rating": 5.0,
      "verified": true,
      "author": "babynikki81",
      "helpful_votes": 0,
      "publication_date": 20190810
    },
    {
      "title": "But it now!",
      "text": "I have the most ridiculously sensitive skin as well as severe allergies and sometimes because of my allergies my face will break out and this is literally a game changer!!! Got results within four days of using. I put it on every night before I go to sleep after I wash my face and as well put a little bit on mixed with lotion before I put on my make up. My face has been so much softer, my pores have shrunk, and I have massive pores. This is now the second bottle.",
      "rating": 5.0,
      "verified": true,
      "author": "Brit",
      "helpful_votes": 0,
      "publication_date": 20190504
    },
    {
      "title": "Magic sauce I tell ya!",
      "text": "Absolutely LOVE LOVE LOVE this oil! I have really bad psoriasis that's not just ugly but down right painful on my hands and fingers, but after cleaning with witch hazel and then rubbing in some of this oil, it completely the heals flare-ups and ugly bumps! It also does absolute wonders for my face! I'm 32 and still suffer acne, after using witch hazle to calm my face, I apply a few drops of this \"magic\" oil into my hands, and massage all over my face before bed. When I wake up I notice a brighter and clearer face!! It also is amazing for wrinkles btw ;-) !! Best product hands down guys!!",
      "rating": 5.0,
      "verified": true,
      "author": "tony colee",
      "helpful_votes": 0,
      "publication_date": 20190402
    },
    {
      "title": "Grateful for this product",
      "text": "I originally bought this for my cuticles, but it helped save my skin after I gave myself a terrible reaction. I mixed too many products on my face and broke out in blisters! My skin was bumpy, red, and overall ANGRY. Suddenly my skin became a desert but every moisturizer I owned (all fragrance-free) pissed my skin off even more. This was the only saving grace for my face. This jojoba oil soothes the redness and bumps, while moisturizing my flaky patches. One week later, I’m still sensitive to products, but this oil isn’t clogging my pores, is clearing up my skin, and giving me a more dewy look (not greasy! Which I didn’t think was possible.)",
      "rating": 5.0,
      "verified": true,
      "author": "Jenny E M",
      "helpful_votes": 0,
      "publication_date": 20191022
    },
    {
      "title": "Good oil to use for face moisture mixture",
      "text": "I replaced my face moisturizer with Kate's Favorite Moisturizer recipe from the bottle... 4 drops of Jojoba Oil 2 drops of Rosehip Oil 1 drop of Tea Tree Oil And I love the mixture. It has helped calmed my face and I think it has helped prevent minor blemishes.",
      "rating": 5.0,
      "verified": true,
      "author": "Amy Scalet",
      "helpful_votes": 2,
      "publication_date": 20180916
    },
    {
      "title": "Great Buy for Reducing Skin Redness",
      "text": "I first bought a small bottle of this oil and it lasted me two years. I recently purchased the bigger one. Both came intact, nicely packaged, and with good-quality droppers. I like to use three drops on my face and leave it on overnight. A little goes a long way with this oil! It does a great job of reducing redness and inflammation, specifically from acne in my case. I also sometimes leave it in my hair overnight, both massaged into my scalp and brushed through the ends of my hair. I haven't noticed fewer split ends since I've been using it, but it definitely helps moisturize the skin. This oil has almost no smell.",
      "rating": 5.0,
      "verified": true,
      "author": "OB",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "Does what I was hoping, one of many culprits for breaking out?",
      "text": "Works really well! Takes my makeup off faster than any of my makeup wipes ever did. The only thing keeping me form giving it 5 stars, is I have been breaking out a bit lately. But there's maybe 50 different changes I've made recently that could all be responsible, so while it could be the oil, it could also very well /not/ be the oil. The fact that it's been months and I don't look like a pepperoni pizza at least reassures me that it's better than other oils I could have used (like coconut oil).",
      "rating": 4.0,
      "verified": true,
      "author": "lemonsquare7",
      "helpful_votes": 0,
      "publication_date": 20190422
    },
    {
      "title": "Great product with great customer service!",
      "text": "This has been an incredible product. Not only is it a good deal, but the customer service was incredible! Within hours of receiving the package Kate emailed me to make sure everything was good. I never expected this from a product so affordable, not to mention that t makes my beard and skin incredibly soft. I think it's even helping with some of the acne scars I had! You will not regret this purchase, trust me!",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin M.",
      "helpful_votes": 4,
      "publication_date": 20170131
    },
    {
      "title": "Disappointed",
      "text": "Disappointed. Needed it for nails, hands, and cuticles. Put in on every night before bed for over month. No change at all. Still dry.",
      "rating": 1.0,
      "verified": true,
      "author": "Jkier",
      "helpful_votes": 3,
      "publication_date": 20200228
    },
    {
      "title": "Amazing.",
      "text": "I have combination skin. Im 25 yrs old & have always suffered from acne & on top of that very sensitive skin. I have always relied on Clinique products but they tend to get very expensive very quick. I read so much about oils & how they can be better than face creams & since Jojoba oil is the “universal” oil (meaning any skin type can use it) & bc it has great reviews I decided to risk it. I love it! Helps with acne. I’ve recommended it & it has become my family’s favorite. Definitely give it a chance!",
      "rating": 5.0,
      "verified": true,
      "author": "Alexa",
      "helpful_votes": 0,
      "publication_date": 20191010
    },
    {
      "title": "Absolutely love this product! It's light enough to use as facial oil.",
      "text": "I bought the 4oz bottle first and I loved it so much, I ordered the 16oz one. I like that it's odorless/fragrance-free and light enough use on my face. I use it as : - - a body oil: straight out of the shower when the skin is still wet. - a facial oil: as an occlusive on top of my moisturizer/serum. I just warm it up in my hands and press it onto my face. Makes my face glow-y; like a highlighter.",
      "rating": 5.0,
      "verified": true,
      "author": "Anusha",
      "helpful_votes": 0,
      "publication_date": 20200629
    },
    {
      "title": "Great product! Just wish the large bottle wasn't plastic.",
      "text": "I've been using jojoba oil for quite a while now and I absolutely love how it helps my skin. Definitely a must have for dry skin in the winter as well. This brand has a good price especially when you buy the larger bottle but I just wish the larger bottle was glass like the smaller bottles.",
      "rating": 4.0,
      "verified": true,
      "author": "Amy C.",
      "helpful_votes": 0,
      "publication_date": 20200812
    },
    {
      "title": "Versatile product with no smell!",
      "text": "I have gotten different oils for the past year for my face. They all worked well, but the reason I like this oil the most is there is no scent. It helps with dry patches, skin texture, and it improves the look of my skin. Nothing is an overnight miracle worker - but sometimes we forget about the basics. I use this night and day and the bonus is I can mix this with body lotion and put it my hair. Instead of having so many different products for different things it’s convenient to have 1 product to be able to benefit all my skin/hair needs.",
      "rating": 5.0,
      "verified": true,
      "author": "Helen",
      "helpful_votes": 0,
      "publication_date": 20180815
    },
    {
      "title": "I think it's spoiled. 🙄😒 Ridiculous!",
      "text": "Just opened my oil. The oil I received has more of a rancid very nasty scent rather than a nutty scent. I am very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "R.C",
      "helpful_votes": 3,
      "publication_date": 20190719
    },
    {
      "title": "Get some!",
      "text": "Feels fantastic on my skin and really took care of the dry skin above my upper lip... you know- that place where your lipstick flakes at the bow of your upper lip. It’s not greasy- I can use a drop under my makeup if needed.",
      "rating": 5.0,
      "verified": true,
      "author": "Julia ",
      "helpful_votes": 3,
      "publication_date": 20190130
    },
    {
      "title": "Awesome moisturizer, bad smell.",
      "text": "It's a great moisturizer. But I CANNOT stand the smell. It smells rancid. When I try to wash it off my hands, it washes off easily but I can't get the smell out of my nose.",
      "rating": 1.0,
      "verified": true,
      "author": "Loves to read",
      "helpful_votes": 4,
      "publication_date": 20180809
    },
    {
      "title": "Good",
      "text": "The oil smells ok as far as oils go. This oil does moisturize the skin. On hair, it's not very moisturizing but then again Oils don't moisturize hair they are used more for sealing in moisture into the hair. which it does.",
      "rating": 4.0,
      "verified": true,
      "author": "Nicka ",
      "helpful_votes": 0,
      "publication_date": 20200513
    },
    {
      "title": "Love it",
      "text": "I use this on my face every night and it feels amazing and my skin looks healthier!",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah G.",
      "helpful_votes": 4,
      "publication_date": 20190117
    },
    {
      "title": "Absolutely love it. I've been using it as a cleaning ...",
      "text": "Absolutely love it. I've been using it as a cleaning agent for my belly ring. I've had bad luck with keeping it clean. The jojoba oil allows it to keep clean as well as keep the skin soft. I've used it about a week now and all the redness has gone away and it's almost completely healed! I also use it for my face as Ive been struggling with acne and oily skin. It has not only cleared most of my acne, my skin is moisturized and looks healthy and no oil! Love this stuff and will continue buying!",
      "rating": 5.0,
      "verified": true,
      "author": "Chelsea Mongillo",
      "helpful_votes": 0,
      "publication_date": 20170802
    },
    {
      "title": "Very nice product and very sweet seller.",
      "text": "Very nice product and very sweet seller. Received a whole detailed list of user direction from the seller in my email. I had little bumps around the nose area, from a allergic reaction. I put this oil on and massaged for 5 minutes, the bumps disappeared. It is that obvious! I have been using it for over a month now, not much progress after the first week though. I bought the set recommended on the box, hoping it will help me in the long run.",
      "rating": 5.0,
      "verified": true,
      "author": "Jenny",
      "helpful_votes": 0,
      "publication_date": 20201023
    },
    {
      "title": "Removes dandruff buildup, easily!",
      "text": "I had clumps (not to be gross...) of dandruff buildup in my hair. So much so, it felt like metal plates on my scalp. If I tried to remove, blood wiould come with it and it was not a pleasant experience. After buying this, I applied it to my scalp and gave myself an oil scalp treatment using this stuff. Massaged it in. After about 5 minutes, it all loosened. Next, washed my hair. After shower, it was all gone. Wow!",
      "rating": 5.0,
      "verified": true,
      "author": "Tlmsrr",
      "helpful_votes": 0,
      "publication_date": 20190223
    },
    {
      "title": "Works wonders for my father's psoriasis",
      "text": "I bought a bottle of this after I read a review about it working well for psoriatic skin- thinking it could help my father. Well, after about a week he called and told me that it was not only easing the dryness of his psoriasis, but that it was controlling flares as well. I bought two more bottles for him so he wouldn't have to wait to get more if he ran out (albeit shipping was super quick). I would highly recommend this product for those with psoriasis. I plan to order some for myself, just to try it in my hair and as a moisturizer!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170509
    },
    {
      "title": "Exactly what I needed!",
      "text": "My face is normally so dry. I've tried numerous lotions, only for them to sit on top of my skin and still leave my face looking and feeling like it was crumbling apart. After just one application of jojoba oil, my face is baby soft. It sunk right in, leaving no oily residue. My face isn't peeling anymore. Extra bonus, it also helped my chapped lips, and the redness from my rosacea is much less noticable!",
      "rating": 5.0,
      "verified": true,
      "author": "jenh81",
      "helpful_votes": 0,
      "publication_date": 20190112
    },
    {
      "title": "Great addition to daily hair and skin routine.",
      "text": "The Jojoba oil is wonderful. It was delivered quickly with super packaging. I appreciate the extra time and care spent carefully packaging the oil. Yes, I have used it a couple of times on my skin for anti-aging to soften some fine lines along with a few wrinkles. I have also used the jojoba oil on my hair and dry skin. It absorbs into the skin nicely with no leftover residue. I plan to continue using the oil because I do see some good results. My hair loves the oil as I notice it is much softer and not as brittle. Love the product. Thanks for creating a wonderful addition to my hair and skin routine.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda M",
      "helpful_votes": 3,
      "publication_date": 20180102
    },
    {
      "title": "arrived with a broken dropper",
      "text": "I unscrewed the dropper cap to try the oil and saw the glass stem was broken off from the dropper. In reading other reviews I see that other buyers had trouble with the dropper too? This is super annoying but clearly the distributor is not addressing the issue!",
      "rating": 1.0,
      "verified": true,
      "author": "michelle",
      "helpful_votes": 4,
      "publication_date": 20190210
    },
    {
      "title": "I love this oil",
      "text": "I love this oil. After watching Simply Nailogical's video on growing strong nails, I went on the search for a Jojoba oils to use on my cuticles. This was by far one of the cheapest ones I found. HOWEVER, you can't tell! After just a few times of putting the oils on my cuticles, I could tell a difference! I even purchased more as a back up and so that I can make oil blends to match what I need. LOVE this oil, and will continue to reorder!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Jaelyn",
      "helpful_votes": 2,
      "publication_date": 20170905
    },
    {
      "title": "Great Oil!",
      "text": "This was my first time trying jojoba oil and it's great! I used it to make my face serum and it sits really nicely on my skin. Doesn't absorb completely but not super greasy or tacky at all. It didn't cause any irritation or acne. The down side is I can only use it at night time though as it really doesn't sit well under my makeup. Other than that, its great!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180111
    },
    {
      "title": "Kylie Jenner uses this, it is Legit Organic Jojoba too.",
      "text": "THIS IS REAL JOJOBA. The smell is exactly like all jojoba oil i have ever used (many from very reputable companies like acne.org). the texture and color is spot on too. no doubt in my mind it is legit. I saw this because Kylie Jenner posted a picture of it, if its good enough for a billionaire beauty mogul its good enough for me! Sure was!",
      "rating": 5.0,
      "verified": true,
      "author": "Q. M. of CA",
      "helpful_votes": 0,
      "publication_date": 20200222
    },
    {
      "title": "Recent bottles have quickly gone rancid",
      "text": "I liked this product, up until the last two I purchased this past winter. They both went rancid within a month. The first one, I thought was just a bad bottle, because I had good experience before. But the next one did the same thing. It ruined my essential oils (which are not cheap) where I had used it as a carrier oil. I'm not purchasing from this company anymore.",
      "rating": 2.0,
      "verified": true,
      "author": "lani girl*",
      "helpful_votes": 0,
      "publication_date": 20180523
    },
    {
      "title": "Great for my skin!",
      "text": "I originally bought this jojoba oil to use on my nails/cuticles but now I use it for EVERYTHING. I'm talking facial moisturizer, hair oil, carrier oil, make up remover, etc. I have somewhat sensitive hormonal/stress-acne-prone skin with large pores and this jojoba oil really helps get rid of makeup and dirt and moisturizerizes my skin without clogging my pores. I would definitely give this oil a try if you're on the fence!",
      "rating": 5.0,
      "verified": true,
      "author": "Lydia",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "Feels lovely and makes your skin look refreshed and rested",
      "text": "I recently received my order and started with a few drops of oil on my face in the evenings. Then I started adding it under my morning makeup and now I’m rubbing it into my eyebrows and nails and cuticles at bedtime. There is no scent and the feeling is silky, not greasy, so it integrates easily with all my other products and perfumes. I really wish I’d discovered this sooner; I will definitely be purchasing this on a routine basis. It’s more versatile than I had planned so I feel I got more than my money’s worth.",
      "rating": 5.0,
      "verified": true,
      "author": "NettieV",
      "helpful_votes": 2,
      "publication_date": 20171024
    },
    {
      "title": "Love this oil...its amazing.",
      "text": "I love this oil. I am a stylist for Color Street and I have advertised this product on my group page. Several ladies have bought it. This is great for the cuticles and nails and for your feet. Its amazing...I told my sis n law to buy for her foot since the nail salon she went to she got some type of fungus but this helped a lot. After using this product and color street she is never going to the salon again. Thanks so much.",
      "rating": 5.0,
      "verified": true,
      "author": "DICE",
      "helpful_votes": 0,
      "publication_date": 20200921
    },
    {
      "title": "Will continue to be a persistent customer!!!",
      "text": "I ordered this oil because my sister told me that i needed jojoba oil for my dry hair. I read a bunch of reviews before i ordered THIS specific one. And i must say i am SO GLAD that i did! I have very dry, damaged hair and I’ve gone months without blowing out my hair / straitening it (i usually prefer it curly) and with the help of this oil along with argan oil i was able to do so! Don’t get me wrong, i still have to cut my ends and keep it maintained BUT with the help of this argan oil I’m sure my hair will be healthier than ever before and I couldn’t be happier.",
      "rating": 5.0,
      "verified": true,
      "author": "Yeni",
      "helpful_votes": 0,
      "publication_date": 20171230
    },
    {
      "title": "Had an allergic reaction",
      "text": "Not sure if it was this oil but I had a skin irritation after using it",
      "rating": 1.0,
      "verified": true,
      "author": "Verified purchaser",
      "helpful_votes": 4,
      "publication_date": 20181230
    },
    {
      "title": "Kinda funky",
      "text": "There was no scent what so ever....I kinda think its a false product,on top of that it feels like it kinda oliy not a moisturizer,I have pretty sensitive skin and it was eh,im not really likeing this product,although I like the bottle and the pincher,it all came undamaged which is what gives it the 3 stars",
      "rating": 3.0,
      "verified": true,
      "author": "Valerie",
      "helpful_votes": 0,
      "publication_date": 20191107
    },
    {
      "title": "BE CAREFUL ON THIS PRODUCT!  IT MAYNOT BE SAFE IF ARRIVING WITHOUT SAFETY SEAL",
      "text": "Jojoba Oil, USDA Certified Organic, 100% Pure, Cold Pressed, Unrefined. Arrived leaking in box, Oil inside pump as if it has been used! Not safe for me to use not knowing for sure that it is what I ordered! Very disappointed because all my other 4 Oils I ordered arrived not leaking and they all had a safety top SEAL on each bottle. I will wait to reorder because that safety CAP is CRUCIAL so when I mix my Oils, I get the expected results!! This Oil arriving tampered with is NOT GOOD and a very much a inconvenient.",
      "rating": 1.0,
      "verified": true,
      "author": "woodleydeb ",
      "helpful_votes": 0,
      "publication_date": 20200929
    },
    {
      "title": "Great for acne prone skin",
      "text": "I have to say I was a little hesitant on buying oil for my acne prone skin, but it has done wonders for texture and skin tone balance... I ended up buying the 4 ounce bottle but didn’t realize the stopper was packaged in the lower portion of the box. I ended up accidentally throwing it away but I’m still able to use a Q-tip in order to get the right amount of oil onto my cotton ball.",
      "rating": 5.0,
      "verified": true,
      "author": "Sierra",
      "helpful_votes": 0,
      "publication_date": 20190503
    },
    {
      "title": "Multiple Uses and Fast Results",
      "text": "I used the oil on my nails along with taking a hair and nails strengthener pill. My nails grow rapidly but are very brittle so they tend to break before I can grow them out. I apply this oil to my nails 3-4 times a day and it definitely helps! My nails are now long and strong. I have barely had a break with them after using the oil. It is amazing! The oil has multiple uses too, I use it on my hair, face, and in my homemade lip moisturizers. Will be repurchasing once my bottle runs low. This product is worth the low price.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171025
    },
    {
      "title": "Airy and smooth",
      "text": "My husband bought this as a carrier for his beard oil which includes peppermint oil (also from Kate Blanc). I also bought another jojoba oil to use along with Rosehip oil. I really like how this oil feels less oily than other oils. It absorbs very quickly into the skin and leaves your skin feeling smooth and airy. I don't believe it's the oil to moisturize with. For that, I think it's Rosehip oil, or mix it in with it, but if you want a light oil for your face, this one is it!",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs. P",
      "helpful_votes": 0,
      "publication_date": 20171203
    },
    {
      "title": "Eliminate's creppy skin immediatley.",
      "text": "I started using this over a year ago, I/m on my 4th bottle, it is very oily but it comes into it very soon, it eliminates creappy skin immediately. Use often, I use 3 plus times a day on face, neck and chest. Satisfied with results.",
      "rating": 5.0,
      "verified": true,
      "author": "Kimberley W.",
      "helpful_votes": 0,
      "publication_date": 20190801
    },
    {
      "title": "Dry Cuticles NO MORE",
      "text": "I use this every night and morning on my horribly dry cuticles. I just moved from EAST coast (sauna) to West coast (oven) and my skin and cuticles are so dry. This is rich and eventually soaks right in and it really works. It has no smell and I am partial to a smell but it really works so never mind the smell (or lack therof). I use it on my elbows too. Will be grateful when my skin acclimates to the drier climate ....till then, thank heavens there is some relief!!",
      "rating": 5.0,
      "verified": true,
      "author": "vivian b smith",
      "helpful_votes": 0,
      "publication_date": 20181007
    },
    {
      "title": "Love it!!",
      "text": "This stuff is great! Very light makes my skin feel wonderful. I mix with unscented lotions and my hair moisturizer. Will buy more.",
      "rating": 5.0,
      "verified": true,
      "author": "Kimbee Shopper",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "So far so good!",
      "text": "I bought this oil to use as a nighttime face moisturizer. Have only been using it for a few days and have noticed a difference! I mix Jojoba with Rosehip seed oil and apply a few drops to my face and neck nightly. I have combination skin with minor acne and tend to get dry, red bumps on my cheeks as the seasons change. I am noticing my skin is less oily throughout the day, and the redness has reduced after only a few uses. I will update in a few weeks!",
      "rating": 4.0,
      "verified": true,
      "author": "Joce B.",
      "helpful_votes": 2,
      "publication_date": 20170928
    },
    {
      "title": "It seals in my own bodys natural oils (it acts like a wax sealant)",
      "text": "I’ve been using jojoba oil for years. I usually buy a big bottle for my body and a small purified (organic) bottle For my face (added with rose hip oil) I put it on either in the shower or riight out of the shower, and in the summer, right after I wake up. It seals in my own bodys natural oils (it acts like a wax sealant). It’s great for acne, and gives me color in the summertime. Couldn’t live with out ❤️",
      "rating": 5.0,
      "verified": true,
      "author": "Mistylee",
      "helpful_votes": 0,
      "publication_date": 20180203
    },
    {
      "title": "Awesome product..love it",
      "text": "I love the Jojoba oil ..on my skin and hair ,even face . But what I didn't like was the way it was shipped ! I received my 16 oz. bottle in a bubble bag ...when I opened it the cap was broken (in 3 pieces) the seal had been broken and the bottle was cracked...like something heavy had been on it...please invest in a box when you ship this product ! The Jojoba oil is a great product,only need a very small amount and doesn't leave your hair on skin feel oily or greasy , deserves better packaging!",
      "rating": 5.0,
      "verified": true,
      "author": "Karen VanMeter",
      "helpful_votes": 0,
      "publication_date": 20190929
    },
    {
      "title": "Good stuff.",
      "text": "This oil seems to be of good quality, and I would definitely buy again.... however, I think the 4 oz. bottle is going to last me a long time! I've only used two drops of it on the ends of my hair thus far. It absorbed nicely without leaving my hair looking greasy. I appreciate that it's USDA organic certified and comes in an amber glass bottle. I'm sure it will keep nicely.",
      "rating": 5.0,
      "verified": true,
      "author": "Ali",
      "helpful_votes": 0,
      "publication_date": 20180209
    },
    {
      "title": "Great Product!!",
      "text": "I love this oil. I use it for my nails mainly. It keeps my cuticles healthy and my hands looking very good. You get so much for the price as compared to a small bottle of cuticle oil and this is the same if not better. It smells good too.",
      "rating": 5.0,
      "verified": true,
      "author": "Dimmi",
      "helpful_votes": 0,
      "publication_date": 20181218
    },
    {
      "title": "It arrived spilled all the way out!!",
      "text": "My product arrived with the lid OFF. The oil spilled out and there’s NOTHING LEFT IN THE BOTTLE!!! The top was not tight and the protective covering around the top was not on it. Now I have to go find it from somewhere else for a ballooned price to make my whipped butters.",
      "rating": 1.0,
      "verified": true,
      "author": "KavNis Travel",
      "helpful_votes": 2,
      "publication_date": 20200116
    },
    {
      "title": "Absolutely great. I use it at home to blend my ...",
      "text": "Absolutely great. I use it at home to blend my essential oils with because my husband is allergic to coconut. So this works perfectly. I also use it as a shaving cream in the shower and moisturizer before bed. Great for sunburns to hydrate when coconut oil isn't an option. I feel its too heavy for the face but love it just about everywhere else :)",
      "rating": 5.0,
      "verified": true,
      "author": "diane throgmorton",
      "helpful_votes": 0,
      "publication_date": 20171008
    },
    {
      "title": "LOVE!!",
      "text": "LOVE!!! I have been using this along with her Rosehip Seed Oil and Tea Tree Oil along with a drop of hyularonic acid for the BEST face / body moisturizer ever. The recipe is on the bottle. I noticed a difference in my skins appearance within a few days and within about 2 weeks my skin looked better than it has in quite a few years.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180606
    },
    {
      "title": "doesn't cause breakouts!",
      "text": "i have really sensitive skin and most things break me out, this doesnt :)",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 3,
      "publication_date": 20190128
    },
    {
      "title": "Love this stuff",
      "text": "I use this for essential oil blends for my face and for shave bumps. I have combination skin and this is the perfect oil to pat on my face at night under my moisturizer. it makes my skin soft but not too oily or shiny and no breakouts. will definitely be purchasing from now on. the scent is light, not overwhelming so it blends very well with other oils.",
      "rating": 5.0,
      "verified": true,
      "author": "April T.",
      "helpful_votes": 0,
      "publication_date": 20190813
    },
    {
      "title": "I never knew how amazing this product was until the last 3 months",
      "text": "I have no idea how I lived without Jojoba oil for so long. I never knew how amazing this product was until the last 3 months. My skin has never been softer, my hair has an amazing shine, and I'm addicted to it. I usually use jojoba oil mixed with castor oil to clean my face, then I sleep with a few drops of jojoba oil at night. I use jojoba oil and lavender oil on my skin at night to sleep and wake up with the softest skin ever. I love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Tamara E Flores",
      "helpful_votes": 3,
      "publication_date": 20170430
    },
    {
      "title": "Great for body but not face",
      "text": "I wouldn’t recommend it for acne sufferers and if you use on face before applying makeup, make sure you let it dry for about 20mins before applying makeup to your face. Also I don’t recommend using it with mineral makeup powder. The two are kind like oil and water and don’t sit well together. For using on the rest of the body though I really liked it!! It was very moisturizing",
      "rating": 4.0,
      "verified": true,
      "author": "TC90",
      "helpful_votes": 0,
      "publication_date": 20190504
    },
    {
      "title": "Good so far only have ad it a week and ...",
      "text": "This is a great oil. I bought it for my nails to be more flexible and combined with a glass file my nails are so flexible and strong and they are the longest I have ever been able to grow them and not break. I have recently watched a Youtube video on adding oil to your foundation by a makeup professional and it was amazing to see what a difference it made in my skin tone with the makeup. Love this product.",
      "rating": 5.0,
      "verified": true,
      "author": "jessica",
      "helpful_votes": 0,
      "publication_date": 20171103
    },
    {
      "title": "Excellent service! I am using this to blend with ...",
      "text": "Excellent service! I am using this to blend with lemon oil to assist in removing my age spots!",
      "rating": 5.0,
      "verified": true,
      "author": "Pamela K. Sparrow",
      "helpful_votes": 2,
      "publication_date": 20180605
    },
    {
      "title": "Great product!!",
      "text": "Product was shipped on time and packaged correctly. It came in a neat box with the dropper and was properly sealed without any leakage. The oil doesn’t really have any sort of smell but it was full and good to go. It mixes well and so far has been great. I would recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Steven P Nelson",
      "helpful_votes": 0,
      "publication_date": 20180410
    },
    {
      "title": "Broken dropper",
      "text": "First time I have ordered a Kate Blanc product. The glass dropper was broken in half and the other half wasn't in the box. Obviously packaged that way. Will have to use a dropper from another product and hope it fits.",
      "rating": 1.0,
      "verified": true,
      "author": "Lynn Z.",
      "helpful_votes": 4,
      "publication_date": 20180513
    },
    {
      "title": "Very good quality oil for eczema",
      "text": "My 5 years old daughter has eczema on her 4 joints and got flare up and inflammation. Tried so many prescribed creams like Hylatopic plus, Neosalus, EpiCeram, Eucrisa but didn’t see any improvement or even worse. I applied sweet almond oil to her body every 4 hours in the last 3 months, plus I added on this jojoba oil to keep her joints moist. She is almost clear, but I still apply this oil every 6-8 hours to prevent dry skin. Finished 2 bottles already and ordering the 3rd bottle. Very good quality product.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190404
    },
    {
      "title": "Great product",
      "text": "I liked that it was shipped fast. Great consistency and I like the dropper that’s included for oil distribution. I used it for my daughter’s hair. I needed an oil to help stimulate hair growth and read that jojoba oil helped with hair growth. So far I’ve used it for almost two weeks and I can honestly say I am noticing hair growth. Her hair isn’t as thin and her few bald spots are starting to become really full of hair.",
      "rating": 5.0,
      "verified": true,
      "author": "Bree Rose",
      "helpful_votes": 0,
      "publication_date": 20190119
    },
    {
      "title": "Really great facial moisturizer!",
      "text": "This is my favorite Jojoba oil to use on my face. It always smells fresh (not rancid, like some other brands have.) I feel like the price is super fair, and the dropper bottle is easy to use! Yes, love it, will be ordering more as needed!",
      "rating": 5.0,
      "verified": true,
      "author": "mamaz",
      "helpful_votes": 0,
      "publication_date": 20180205
    },
    {
      "title": "Versatile and workers great love it.",
      "text": "I really like this product. I love the all in one versatility of the jojoba oil. I use it on the ends of my hair, on my face as a moisturizer, on my nails to hopefully help them grow, and on my exama on my arm. Love all the different uses its good for and it does seem to be helping my hair stay healthy and is helping my skin.",
      "rating": 5.0,
      "verified": true,
      "author": "AngeW",
      "helpful_votes": 0,
      "publication_date": 20200908
    },
    {
      "title": "Hair oil",
      "text": "I mixed this oil with a few other oils to put in my scalp for thickening and growing my hair.",
      "rating": 5.0,
      "verified": true,
      "author": "Johnson",
      "helpful_votes": 0,
      "publication_date": 20200911
    },
    {
      "title": "Luxurious",
      "text": "This stuff is very rich and luxurious feeling on your skin. I’ve only tried it on my nails and cuticles so far, but looking forward to using it on my hair maybe or face. The owner of the company is very nice and genuinely cares for her customer’s satisfaction. She checks on you after your purchase to give you other suggestions for use and to see that you are happy with the product.",
      "rating": 5.0,
      "verified": true,
      "author": "jenjen",
      "helpful_votes": 0,
      "publication_date": 20180718
    },
    {
      "title": "Miracle worker!",
      "text": "The first picture was my nails before using the product. The second one are my nail 6 months after. I nail have grow so fast and strong. P. S. The yellow tone in my nails it’s not because of the products and it’s not bad. It’s only because I change my nail polish color every week or every couple of days and that can make your nails stain.",
      "rating": 5.0,
      "verified": true,
      "author": "Maria Alvarez",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "Amazing Product, Amazing Price",
      "text": "At 73, I wasn't expecting much, but after the first day,my skin was noticeably softer and more elastic. The tightness at the corners of my mouth is gone. My husband and I do our jojoba treatment every night before bed. An amazing product. I have since bought additional bottles for my daughter and friends. Amazing product.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Seaman",
      "helpful_votes": 0,
      "publication_date": 20180922
    },
    {
      "title": "Great Jojoba Oil <3",
      "text": "I've used this for about a week now, and I'm pretty satisfied! I've tried a decent amount of different brands, but I'm enjoying this one so far! The smell is a lot nuttier than other ones I've tried, which is definitely not a bad thing, and for this price it's great! The only issue is the fact that there is some drip, but that happens with all of the bottles I've had that have tops like this one. It's an easy fix with a dropper though! Will definitely purchase again! :)",
      "rating": 5.0,
      "verified": true,
      "author": "Paula Ingle",
      "helpful_votes": 0,
      "publication_date": 20200423
    },
    {
      "title": "Great Company, Great Product!!!",
      "text": "First, the service at Kate Blanc Cosmetics was outstanding, even including follow-up to make sure I received and liked the product! I ordered organic jojoba oil to try to sooth my combination skin and it has done wonders...my skin LOVES it. I have an oily T zone—even in middle age—but now with dry patches and jojoba balances my whole complexion beautifully. I mix a few drops with my a.m. sunscreen/moisturizer and my foundation sets beautifully all day. At night, I use it alone and sparingly. I wish I had started with jojoba when I began experimenting with natural oils.",
      "rating": 5.0,
      "verified": true,
      "author": "Stacy Buchanan",
      "helpful_votes": 0,
      "publication_date": 20171228
    },
    {
      "title": "MUST USE THIS FOR EVERYTHING!!!",
      "text": "Love love love this product!! I've only been using it a few days on my face, lips, cuticles and hair. So much better than the coconut oil I was using. I use it to moisturize my hair roots and also spread lightly on my hands and lightly style my hair with it. SUPERB!! Loving my hair again finally and nails are starting to heal from the harsh treatment they get.",
      "rating": 5.0,
      "verified": true,
      "author": "S White",
      "helpful_votes": 0,
      "publication_date": 20180802
    },
    {
      "title": "Extremely Beneficial for Newborn Baby & Mommy",
      "text": "I absolutely love this Jojoba Oil! As all new or first time Mom's have learned or know your pediatrician will not want to prescribe your delicate baby any kinds of medicine for baby acne. I used this Jojoba oil as a skin moisturizer and her acne cleared has cleared up. Not to mention its great for hair as well as stretch marks. It has numerous uses and I will definitely be buying this product again.",
      "rating": 5.0,
      "verified": true,
      "author": "Ava",
      "helpful_votes": 0,
      "publication_date": 20180920
    },
    {
      "title": "Very happy with product and company!",
      "text": "I did my research before purchasing and this company is legit. It has been a great product! Very light and soaks right in to the skin. I have made a lot of my own skin and hair care products over the years and have just never used jojoba oil. I am now purchasing skin care from a line that I love, but I have found the perfect use for this on my face and it has worked better than I ever thought it could! So I will absolutely buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessie",
      "helpful_votes": 0,
      "publication_date": 20171121
    },
    {
      "title": "Love it",
      "text": "I use this oil on my beard and it's amazing! A lot of people add essential oils to it to add a nice scent but I just use it as is. It's thick and easy to apply. I just rub some in my hands and over my beard and then wipe the excess over my face and hair. I notice a big difference on the days I forget to use it.",
      "rating": 5.0,
      "verified": true,
      "author": "Ramy yousef",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Great product!",
      "text": "I received my order promptly and found that it is a very nice bottle and dropper! I probably didn’t need the larger size bottle, but I will be inclined to find additional ways to use the oil. So, thank you for the guide you sent along will be very helpful! Thank you! P.S. I have been using Jojoba Oil (one drop) in my moisturizer at night time for the past couple years, and it works wonders! I had struggled with acne and this routine is actually part of what helped to clear up my skin.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristin Grissom",
      "helpful_votes": 0,
      "publication_date": 20180425
    },
    {
      "title": "Perfect skin conditioner!",
      "text": "This jojoba oil is more than I hoped for. It conditions my skin perfectly. I apply it on at night and then remove it in the morning. It helps to smooth out my skin for makeup application. I wear with or without moisturizer depending on my skin atm. I no longer need a heavy moisturizer. I love it and I do recommend it!",
      "rating": 5.0,
      "verified": true,
      "author": "MrsMommyLoves7",
      "helpful_votes": 0,
      "publication_date": 20190313
    },
    {
      "title": "Helps facial routine.",
      "text": "This oil is a great addition to my nightly facial routine. I suffer from flaky skin but overly oily skin. After buffing my face, I use this oil and a moisturizer to calm my skin and brighten my skin with natural oils. I love the suggestions by the owner. Keep up the good work! I will be buying other oils to try as well!",
      "rating": 5.0,
      "verified": true,
      "author": "Angie",
      "helpful_votes": 0,
      "publication_date": 20180802
    },
    {
      "title": "Good product, good supplier.",
      "text": "I am using this product in conjunction with the castor oil for my hair. So far so good. I also use the castor oil for my eyelashes. It is of course too soon to see results, I am hoping for the best!",
      "rating": 5.0,
      "verified": true,
      "author": "Maddy",
      "helpful_votes": 0,
      "publication_date": 20180601
    }
  ],
  "product_meta": {
    "title": "Jojoba Oil, USDA Certified Organic, 100% Pure, Cold Pressed, Unrefined. Revitalizes Hair & Gives Skin a Radiant Youthful Look. Effective Treatment for Face, Lips, Cuticles, Stretch Marks. (2 oz)",
    "rating": 4.7,
    "feature_bullets": [
      "USDA CERTIFIED ORGANIC JOJOBA OIL - Kate Blanc’s Organic Cold Pressed Jojoba Oil (Aceite De Jojoba Oil) is certified by USDA and is guaranteed to be authentic, pure, natural, and hexane free. Proven results to soften skin, giving it a radiant and energetic look. 100% Guaranteed Authentic or FULL REFUND. Our Organic Certificate is shown on the product images.",
      "GLOWING FACE AND HAIR - Perfect as a daily moisturizer or treatment for skin, hair and nails with proven results. Unrefined jojoba oil easily absorbs into skin and help remove wrinkles, stretch marks, and makeup. It's great as a lip balm and sunburn removal.",
      "STIMULATE HAIR GROWTH - Grow longer and thicker hair in a quick, natural way, while also diminishing hair loss. Pure jojoba oil is a natural hair oil for cuticle, dry brittle hair, dry scalps, and dandruff. Natural jojoba oil is also great as beard oil and for men and women. It's the popular ingredient in hair growth serum, lip treatment, and natural shampoo.",
      "SMOOTHER SKIN, REDUCE STRETCH MARKS - Clinically proven to improve skin hydration and skin elasticity after only four weeks. Jojoba Oil keeps your face and body moisturized and reduce blemishes, acne, pimples, scars, rosacea, eczema psoriasis, chapped skin, and fine lines without leaving your skin dry. Pure jojoba oil is a great organic hair oil and acts as a oil free moisturizer to repair hair.",
      "100% GUARANTEE AND ONE YEAR WARRANTY - We aim to offer the highest quality and most authentic products. We guarantee your satisfaction. If you are not satisfied with your purchase, please return it for a FULL REFUND within 365 days. Add to Cart."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "4.9 x 1.8 x 1.8 inches; 3.84 Ounces",
      "UPC": "703255269559",
      "Manufacturer": "Kate Blanc Cosmetics",
      "ASIN": "B00S5UFHFU",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Hair Treatment Oils",
      "Hair Care",
      "Beauty & Personal Care"
    ],
    "price": 7.99
  }
}