{
  "website_summaries": [
    {
      "verdict": "Clear optics and easy-to-see red dot, but Glock owners will have a bit of trouble mounting this sight.",
      "pros": [
        "Sight remains zeroed through hundreds of rounds",
        "Works well for daylight use, with clear and bright dot even in sunlight"
      ],
      "cons": [
        "Setup can be frustrating as the sight is zeroed in",
        "Mounting screws can “walk out” after many uses due to vibration, misaligning sight",
        "Some pistols (particularly Glocks) make sight adjustments difficult due to size and form factor"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Third One - Still no good",
      "text": "The first one started to shut off after about 500 rounds and I returned it for a replacement. The replacement came and the lens was marred and it is being returned for yet another replacement. I hope the third time is the charm or I'm swearing off Vortex. UPDATE.... The third one came today and the elevation does not work. Getting refund......3 out of 3 scopes defective. Someone from Vortex should be reading these reviews.",
      "rating": 1.0,
      "verified": true,
      "author": "TJS",
      "helpful_votes": 8,
      "publication_date": 20190726
    },
    {
      "title": "Great fit on Glock 19 MOS",
      "text": "This sight is pretty cool. A couple things: I thought I was going to have to file down the pins on my Glock MOS posts, which wasn't the case. I did go to the hardware store on the way home to get some M3X8mm screws, which fit perfectly. Mine shipped with a dead battery, which wasn't an issue other than I was sure the thing was defective when I first tried it. If it doesn't perform at the range, I'll update my review",
      "rating": 5.0,
      "verified": true,
      "author": "Steven",
      "helpful_votes": 13,
      "publication_date": 20170420
    },
    {
      "title": "Great site, well please with all the features",
      "text": "Great site, well please with all the features, wide view with adjustable red dot which is easy to find. This site compares to Trijicon but is less than half the price. Can't beat it. Only got four stars because the battery in underneath the site and you have to remove site to change the battery, but you do have good battery life so changing is not needed that often. Would buy again or would buy the venom which sets higher but battery is on the top.",
      "rating": 4.0,
      "verified": true,
      "author": "will b.",
      "helpful_votes": 9,
      "publication_date": 20170212
    },
    {
      "title": "Great Red Dot Sighting System",
      "text": "Mounted on S&W MP9 Core using mounting plate #5 with #2 screws. Not difficult to sight in however some what cumbersome to adjust elevation and windage because you must remove from the pistol for each adjustment due to the height of the rear sights. I've shot 500+ rounds and still holding zero with 1 1/2\" groups at 25'. This Pistol and Viper Red Dot performs better than I could imagine.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 22,
      "publication_date": 20160411
    },
    {
      "title": "Vortex for life",
      "text": "I bought the Vortex Optics Viper Red Dot Sight - 6 MOA Dot to install on my XDM OSP but the Screws were too long. Called Vortex about the issue and was told that they were not in the screw business. They suggested I buy shorter screws or shave the screws that come with the Viper Down. Tried the hardware stores but no luck. Bought Gunsmith Torx Screw set on the internet. Hopefully I will get the Viper installed on my handgun... I still like the Vortex Optics, good Value...",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20180522
    },
    {
      "title": "Not truly waterproof",
      "text": "Not truly waterproof!This is what I got from Vortex themselves: \"It does state that on the website and you are correct if there are holes under the battery that would not seal the battery onto the mounting plate it would render it not waterproof. It states that on our website as if mounted to our pic rail mount that comes with the optic it will be sealed by that o-ring on the bottom side of the optic.\" However, it does not actually say that o the website! Do not believe their claims on waterproofing!",
      "rating": 1.0,
      "verified": true,
      "author": "Randolph Tiangco",
      "helpful_votes": 0,
      "publication_date": 20191120
    },
    {
      "title": "New life for old eyes",
      "text": "I wear trifocals and the last few years shooting accurately has become harder and harder. Tried this sight on a few reviews from YouTube and I can shoot again. Put it on a new Canik and was keeping everything in the 8-ring at 25 yards. Buying a second for my Glock!",
      "rating": 5.0,
      "verified": true,
      "author": "Fredrik D Palm",
      "helpful_votes": 3,
      "publication_date": 20190423
    },
    {
      "title": "Nice sight",
      "text": "Works as advertised mounted on a Walther PPQ Q5 pistol. After sighting it in, I removed it from it's base and reinstalled it. I then had to readjust the zero as point of impact was off a little. I don't know if the loss of zero will happen every time the battery is replaced or not. For this reason I would recommend the Vortex Venom as it's battery compartment is top loaded, it is not necessary to remove the sight to replace the battery.",
      "rating": 4.0,
      "verified": true,
      "author": "J. Steiner",
      "helpful_votes": 3,
      "publication_date": 20170722
    },
    {
      "title": "Disappointed",
      "text": "As a previous satisfied Vortex customer I was excited to receive my Viper Red Dot for my G19. That excitement has now turned into disappointment. I’ve now requested a second replacement. The first two Vipers failed to work. No Red Dot on the first one and the elevation could not be adjusted on the second one. I now have a third one (second replacement) coming...I’ll update accordingly.",
      "rating": 1.0,
      "verified": true,
      "author": "JB",
      "helpful_votes": 2,
      "publication_date": 20191010
    },
    {
      "title": "Less a dot than a splatter",
      "text": "Dot is more of a ‘splash’ than a dot. I have this on A .22 pistol and I don’t require pin-point accuracy..........however...this is not a ‘red dot’ sight. It’s a ‘red splash’ sight. I have the brightness actually turned down lower than I would normally just because I want to be able to see my target, and if I hadn’t the “dot” would cover it completely. If I had to do it over again - I’d go for something else",
      "rating": 2.0,
      "verified": true,
      "author": "Eric C Rapa",
      "helpful_votes": 0,
      "publication_date": 20200318
    },
    {
      "title": "Chinese junk...hard to acquire Target with red dot.",
      "text": "This is Chinese junk...hard to acquire Target.. is very glaring and not very precise. I usually don't give bad reviews but this to me is a horrible product. I have other vortex products range-finding binoculars and rangefinders way better product.",
      "rating": 1.0,
      "verified": true,
      "author": "indianjoe",
      "helpful_votes": 2,
      "publication_date": 20200628
    },
    {
      "title": "Kept turning off and on every other shot.",
      "text": "Installation went without any hiccups, sighted in, and worked well for about 100-150 rounds. After 150 rounds or so, it started turning off and on intermittently from the recoil. I removed the battery and replaced it with a fresh one/played with the mounting plate, but nothing worked. I had it installed on an m&p performance 40sw, and used it new for less than a week. Disappointed in the red dot.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20190120
    },
    {
      "title": "Vortex never disappoints",
      "text": "Added two more Vortex Red Dots to my armory to fit on recent firearm purchases. I have several Vortex scopes as well. I have never had a problem with any of their products. I am prior military, and law enforcement, and always choose Vortex. They are high performers, and rugged at affordable prices. In addition this company stands behind it’s products look like no other.",
      "rating": 5.0,
      "verified": true,
      "author": "Td Evans",
      "helpful_votes": 0,
      "publication_date": 20181003
    },
    {
      "title": "Works great with my Glock 19 gen5 MOS",
      "text": "Easy install and fit well on my Glock 19 MOS Gen5. Only drawback is that one of the adjustments requires you to remove the rear fixed site in order to make adjustments. This could be troublesome for some. Requires suppressor height fixed sights for cowitness capability. I could almost cowitness with the factory sites but not quite. Bravo Concealment has Kydex holsters that perfectly fit this rig.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Adjustments, zeroing, a tedious process.",
      "text": "The grievance I have with this otherwise good product it, it must be removed from the pistol to zero it or adjust the red dot. This makes adjustment in the field or at the range problematic. I therefore will not buy another, even though the price point is excellent for what you receive. Perhaps there was a sacrifice of convenience to control price.",
      "rating": 2.0,
      "verified": true,
      "author": "Big Al from Miami",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "Is 9.5/10 for the price and looks sick",
      "text": "Great for the price 100 rounds with my cannik tp9sfx elite Easy to installed just be aware probably you are going to buy screws that fits you base Easy to cero just follow the instructions on the manual I am happy with the sizes of the DOT, I was shooting at the range cover of snow and I didn’t have issues with the DOT Only issue probably was a small reflection of the glass at some angles due to have the sun on the front around 45 degrees to the left, if I moved to other direction it was ok I will still using it and I will send more updates later",
      "rating": 3.0,
      "verified": true,
      "author": "Roger Espinoza",
      "helpful_votes": 0,
      "publication_date": 20200214
    },
    {
      "title": "So Far So Good",
      "text": "Took the optic to the range and zeroed it. After a couple of minutes I was on target at 10 yards and never had to touch it again. Locked down the set screws and put 200 rounds through it. It never moved. I was unsure about this optic because so many have bad mouthed it over the years but so far so good. I'll do an update after 1000 rounds and again after 2000 rounds. The picture is my target the day I zeroed. Accurate with no adjustment out to 20 yards as you can see.",
      "rating": 5.0,
      "verified": true,
      "author": "USMC 8152",
      "helpful_votes": 0,
      "publication_date": 20200619
    },
    {
      "title": "I like Vortex products because of the quality and warranty",
      "text": "I like Vortex products because of the quality and warranty. I am using this on my Glock 22. I chose it because it is shorter than the venom model and it can be mounted to co-witness with suppressor sights. If you are used to acquiring targets quickly with your sights, then the red dot with the sight is a great enhancement. I am very happy with this product.",
      "rating": 5.0,
      "verified": true,
      "author": "KC",
      "helpful_votes": 5,
      "publication_date": 20160619
    },
    {
      "title": "🤦🏾‍♂️",
      "text": "My brand new sight will not set right at all, it’s stuck 2ft high at 10yrds. For 250 This sight should have been tested before being sent off but that’s to much to ask. Do not buy!",
      "rating": 1.0,
      "verified": true,
      "author": "tirrell roch",
      "helpful_votes": 2,
      "publication_date": 20200419
    },
    {
      "title": "Competition Ready!",
      "text": "Not bad!! I shoot Steel Challenge almost every weekend. I've used a Burris FastFire III, and then a C-More with a 90° mount. This thing is nice tho, even w just a 6moa. I also have a CMore RTS2 which is twice the price of the Viper. If you dont mind that the battery is underneath the unit, get one! Took me 3 shots to zero at 50 feet too..I thought that was crazy! almost spot on out of the box, just slightly left by about an inch. Held zero perfectly all morning on my 10/22, through roughly 500 rounds. Very impressed with this little guy.",
      "rating": 5.0,
      "verified": true,
      "author": "Random dude",
      "helpful_votes": 0,
      "publication_date": 20190422
    },
    {
      "title": "You're going to love this Pistol optic",
      "text": "*Update 10/10/20 Still holds zero and has changed my shooting preferences forever. Love this optic. Original review Easy to install using the titanium dovetail mount (DPP) on my Glock g45. Spent a week dry fire practiceing with a laser snapcap also purchased on Amazon. Finally took it to the range and it held zero after few hundred live rounds and is possibly the most satisfying shooting experience I've ever had. I'll never go back to Iron sights on Pistol. Well done Vortex!",
      "rating": 5.0,
      "verified": true,
      "author": "BIRTHDAY ",
      "helpful_votes": 0,
      "publication_date": 20200517
    },
    {
      "title": "22lr was apparently too much for it.",
      "text": "When it worked it was great. Had it on a Ruger Mark IV Lite and it stopped working after its third trip to the range. Tried replacing the battery, but it wouldn't come on. It appears to be a short of some sort in the horribly placed battery compartment. We'll see how they are about replacing it or fixing it. Update - Vortex took the broken one without question and replaced it with a brand new one. Works great so far. Battery placement is still horrible, so it doesn't get 5 stars. Still a great little red dot though.",
      "rating": 4.0,
      "verified": true,
      "author": "MNTC",
      "helpful_votes": 0,
      "publication_date": 20190908
    },
    {
      "title": "Great Red Dot",
      "text": "Mounted the Viper on my Walter PPQ SF (excellent firearm by the way). Easy to use, bright dot and solid mount to optic plate (use the Docter plate for the Viper and go with shorter screws like flat head M3x8mm.). I found the accuracy was very good and only limited by the larger red dot, speed and my shooting technique. Will be buying another for my Kimber KHX",
      "rating": 5.0,
      "verified": true,
      "author": "Mysfit",
      "helpful_votes": 0,
      "publication_date": 20190803
    },
    {
      "title": "get something else from vortex before this",
      "text": "This is the one optic from this company that isn't up to par. normally these guys out do more expensive units. this model is plagued with problems, mostly being unable to hold a zero on full power hand guns. It is well believed in the community that vortex commissioned this product instead of building it to get into the market of pistol red dots. dont believe me? compare its details to that of cheaper Chinese red dots. find me any other expensive red dot that out right looks like a copy. do yourself a favor and spend the extra money and buy a venom instead.",
      "rating": 2.0,
      "verified": true,
      "author": "Nathan Casteel",
      "helpful_votes": 0,
      "publication_date": 20190809
    },
    {
      "title": "Room for improvement",
      "text": "It's good, but I really wish the adjustments were in clicks. Also the locking screws are mostly annoying.",
      "rating": 3.0,
      "verified": true,
      "author": "Sy M.",
      "helpful_votes": 2,
      "publication_date": 20181015
    },
    {
      "title": "Vortex really made a mistake with battery access being under the optic.",
      "text": "Easy to install and it's a Vortex product so you know it's well made. But they really messed up on this one with the battery insert being under the optic. Its has to be removed everytime you replace the battery and then you have to re-zero it back in. Not sure what they were thinking when they did that.",
      "rating": 3.0,
      "verified": true,
      "author": "Jimmy Gregory",
      "helpful_votes": 0,
      "publication_date": 20200606
    },
    {
      "title": "Great Optic",
      "text": "This is a great optic. The 6 MOA dot is easy to see for quick target acquisition. The sight is small and light. The window could be bigger. This model has the battery underneath so you have to remove the sight to replace the battery, but overall it is a great sight.",
      "rating": 5.0,
      "verified": true,
      "author": "Snowmanmo",
      "helpful_votes": 0,
      "publication_date": 20180713
    },
    {
      "title": "Counterfeit item",
      "text": "Item was not as described. Not factory sealed. Was bought as a new item. No manufacturer labels on item, buttons didn’t match manufacture’s website, and sight was green colored. Arranging for refund. Was not bought through third party, but directly from amazon. aAmazon dropped the ball on this one.",
      "rating": 1.0,
      "verified": true,
      "author": "Chubbyghost",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "You just kinda have to adjust to the new aiming point 2nd time At the range & I was sold",
      "text": "So as much as I don’t want to like this thing I can’t deny the fact that it is impressively reliably accurate even if it is not centered you can still expect it to hit the mark when you compensate the P.O.A relative to the dot on screen & recoil doesn’t mess with your settings either, target is too small or too far away!! not a problem just adjust the unit to a lower setting witch presents you with a much finer dot to easily acquire those harder to see long range targets!!! I’m giving this thing 👍👍this is a great product good job Vortex!!!",
      "rating": 5.0,
      "verified": true,
      "author": "melissa",
      "helpful_votes": 0,
      "publication_date": 20190821
    },
    {
      "title": "Great red dot, best I've ever used or owned.",
      "text": "Vortex has the best customer service I have ever seen. If I'm ever in the market for another optic, Vortex will be my first choice.",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony Anderson",
      "helpful_votes": 0,
      "publication_date": 20200401
    },
    {
      "title": "For your buck can't be beat.",
      "text": "I took a bit of getting use to and had to relearn trg acquisition but man why did I wait so long to switch. MOA size is great for pistol. Used it daily and has work with out any issues. Vortex puts out great gear. I have a few different optics and scope by them and zero complaints.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191115
    },
    {
      "title": "Installation was super easy and looks great on my gun",
      "text": "Installed it on my M&P Pro Core. I still need to zero the sight. Installation was super easy and looks great on my gun.",
      "rating": 5.0,
      "verified": true,
      "author": "Victor Quintero",
      "helpful_votes": 2,
      "publication_date": 20171230
    },
    {
      "title": "Good site",
      "text": "Would have given this product 5 stars but it digit the gun I wanted it on, however it did work on another one. Very nice site for the price range. I have a couple trijicon red dot sights and this one seems to be every bit as good as them, I’d buy again.",
      "rating": 4.0,
      "verified": true,
      "author": "Stacy",
      "helpful_votes": 0,
      "publication_date": 20200625
    },
    {
      "title": "Holds up",
      "text": "Mounted this to my Canik TP9 SFX and have ran ,as of this review, roughly 3k rounds. It has held zero thus far and still works perfectly. I perfer the 6moa dot of the viper over the small dot on the Venom.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel Mendonca",
      "helpful_votes": 0,
      "publication_date": 20180211
    },
    {
      "title": "Two thumbs up!",
      "text": "Excellent quality and their customer service is phenomenal. It' s far superior to a laser for daylight use and is exceedingly bright. Much less expensive than other MOS sights on the market but the quality is just as good.",
      "rating": 5.0,
      "verified": true,
      "author": "Ronald Cline",
      "helpful_votes": 4,
      "publication_date": 20170326
    },
    {
      "title": "Installation",
      "text": "Very difficult to use lock screws if co-witnessing sights. You must remove the rear co-witness sight to unlock and then adjust the wind age and elevation of site. Other than that, its a great deal, excellent quality. Would buy if not using a co-witness sights.",
      "rating": 3.0,
      "verified": true,
      "author": "Allison",
      "helpful_votes": 0,
      "publication_date": 20200322
    },
    {
      "title": "Great product",
      "text": "If you think there is no difference between a quality red dot and a cheap one, you have never used a good one. The good ones have a much brighter dot and a bigger dot as well. SPEND THE MONEY, get a good one.",
      "rating": 5.0,
      "verified": true,
      "author": "Dave",
      "helpful_votes": 0,
      "publication_date": 20190905
    },
    {
      "title": "Very good",
      "text": "Great purchase for her victory 22. Very easy to use and accurate. I sighted it in at home, took it to range yesterday, it was dead on. She loves it too, she was hitting targets close at 25 yards. Me, my friend and his kid were hitting pin points at 25 yards. Update: just for kicks, I tried shooting it at 100 yards, very impressed. I used black federal 22lr",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20191209
    },
    {
      "title": "Excellent mini red dot",
      "text": "Exceptional mini red dot reflex sight. Works great on Smith & Wesson M&P CORE pistols. Added bonus, the raised iron sights on the CORE co-witness with the Viper. So, on the off chance that your Viper fails, you still have iron sights without having to take the Viper off the pistol. While it isn't built as tough and rugged as a Trijicon RMR, it is rugged enough for normal everyday use (don't run it over with the truck). The controls are easy to use with multiple brightness levels, and an automatic shutoff after 14 hours.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike in VB",
      "helpful_votes": 10,
      "publication_date": 20170216
    },
    {
      "title": "I wish there were more stars",
      "text": "Fantastic optic and the customer service is second to none. Great profile on my g19 gen5 mos.",
      "rating": 5.0,
      "verified": true,
      "author": "Dave",
      "helpful_votes": 0,
      "publication_date": 20190531
    },
    {
      "title": "It’s a Vortex... all of their products are awesome. I couldn’t be happier!",
      "text": "This sight is a great value for the money, as is the case with any Vortex product. I had the slide on my Sig P320 Tacops milled so that I can still use my suppressor height iron sights if needed in conjunction with the viper. The sight works great, has a lot of brightness settings, and provides a very clear dot without much parallax at all. I couldn’t be happier with this purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Anonymous",
      "helpful_votes": 0,
      "publication_date": 20180809
    },
    {
      "title": "Great upgrade",
      "text": "The dot is bright and clear. The various brightness levels come in handy. It is also easy to zero and does not wander.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190209
    },
    {
      "title": "This was a used item.  The on/off switch was broken.",
      "text": "The on/off switch was broken. It would turn on but the switch to adjust the brightness and to turn it off did not work. I have several Vortex Vipers and Venom Red dot optics and I highly recommend them. This one was a defect and thank you Amazon for allowing me to return it.",
      "rating": 1.0,
      "verified": true,
      "author": "Chief 4 (retired)",
      "helpful_votes": 0,
      "publication_date": 20190924
    },
    {
      "title": "These young folk better get Viper.",
      "text": "The Viper is one of the best optic sights that I have. I have it mounted on the Ruger 5.7×28. My group if I hold it steady enough was 2&1/4 × 3\" group with 20 rounds at 75ft. Possibly would have been better, but not bad for 70 years young.",
      "rating": 5.0,
      "verified": true,
      "author": "G Robby",
      "helpful_votes": 0,
      "publication_date": 20200229
    },
    {
      "title": "Remove locking screws first",
      "text": "Easy to install. Remove the locking screws before installing to set hight and windage. On my pistol, there is more play as you tighten the screws left and right, so setting windage isn't as needed. Excellent value, and performance. Remove the locking screws first. Set dot as a cowitness. Remove, reinstall locking screws. Reinstall Viper.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "Came broken",
      "text": "Item was damaged, the battery compartment was broken keeping the battery from staying in place. No replacements available, had to settle for a refund. Will write a full review once I buy a replacement one.",
      "rating": 3.0,
      "verified": true,
      "author": "..",
      "helpful_votes": 0,
      "publication_date": 20200618
    },
    {
      "title": "Didn't work for me",
      "text": "I really wanted to like this sight but it could not handle being mounted on a 12 gauge. The sight would not hold zero and after a couple of adjustments the windage dial stopped working. Returned the product, I will try the Burris Fast Fire 2 next.",
      "rating": 2.0,
      "verified": true,
      "author": "dmazon",
      "helpful_votes": 0,
      "publication_date": 20190503
    },
    {
      "title": "VORTEX IS ONE OF THE MOST RESPECTED NAMES IN SHOOTING OPTICS - A WELL-DESERVED REPUTATION!",
      "text": "I put this Vortex Optics 'Viper' MPRD on my 10mm Glock, which I then quickly (2mins) put two 30 round magazine through, with NO PROBLEM of loosening of the mount or the loss of zero. Highly recommend this product and vendor - AAA+++!",
      "rating": 5.0,
      "verified": true,
      "author": "Gil",
      "helpful_votes": 0,
      "publication_date": 20200520
    },
    {
      "title": "Great optic for the money.",
      "text": "I have two of these. They are great. My only gripe is the adjustment locking screws are covered by the rear iron sight. Other than that, it’s great.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 7,
      "publication_date": 20170925
    },
    {
      "title": "Viper red dot was made for this Gun",
      "text": "I haven’t had a chance to shoot it with the viper red dot but it looks good and it was easy to install and I got it pretty quick very surprised and very happy",
      "rating": 5.0,
      "verified": true,
      "author": "Charlie",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "Love the line but needs 1 major improvement",
      "text": "Love the vortex lineup! But the biggest flaw with this dot is the location of the locking screws. Defeats the point to take any sight off to lock it in place",
      "rating": 4.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "Looks like Red Grapes instead of a Red Dot",
      "text": "Without installing it, I put the battery in and turnEd it on. It didn’t resemble a dot at all, but more like a cluster of grapes. I’m sending it back.",
      "rating": 1.0,
      "verified": true,
      "author": "M. Daniel",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "Does not fit",
      "text": "Ordered this because someone said it would fit the cut out on my glock 19 slide, guess that only fits a trijicon rmr. Either way it mounted on my 300 blackout ruger american now and seems like it wil work great there.",
      "rating": 4.0,
      "verified": true,
      "author": "Jason",
      "helpful_votes": 0,
      "publication_date": 20200525
    },
    {
      "title": "Poor design elements by vortex.",
      "text": "If you have your rear sights mounted to co witness you lose the ability to tighten down your adjustments. Poor design by vortex.",
      "rating": 5.0,
      "verified": true,
      "author": "J V",
      "helpful_votes": 0,
      "publication_date": 20200812
    },
    {
      "title": "JUST BUY THIS SIGHT ALREADY! PLATE 01 NEEDED FOR A GLOCK M.O.S!!! FITS AMAZING ON MY GEN 5 G45 M.O.S",
      "text": "This is absolute love on my gen 5 glock 45 m.o.s Plate 01 is all you need for the glock m.o.s system. takes about 5 minutes to install and adjust.",
      "rating": 5.0,
      "verified": true,
      "author": "cameron collins",
      "helpful_votes": 0,
      "publication_date": 20200129
    },
    {
      "title": "very clear",
      "text": "This sight was very easy to install and use. It give good visuals and can be seen in all sorts of light and you can tell it is very sturdy.",
      "rating": 5.0,
      "verified": true,
      "author": "Jonathan Velasco",
      "helpful_votes": 0,
      "publication_date": 20200924
    },
    {
      "title": "Sight Glare",
      "text": "The sight gets such a glare in sunlight that you can’t find the red dot. If my learning curve does not lead to a solution I will have to replace it.",
      "rating": 2.0,
      "verified": true,
      "author": "James Dodge",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "Five Stars",
      "text": "The like all of the Vortex line,s from red dot and the high-end Viper scopes.",
      "rating": 5.0,
      "verified": true,
      "author": "Videotechman",
      "helpful_votes": 3,
      "publication_date": 20170324
    },
    {
      "title": "Item was not as advertised",
      "text": "Item was loose in box without battery, Viper Red Dot base or Picatinny rail as advertised.",
      "rating": 1.0,
      "verified": true,
      "author": "RL",
      "helpful_votes": 0,
      "publication_date": 20200403
    },
    {
      "title": "Never a second thought!",
      "text": "Great Optic, I currently have it mounted on my carry gun and I would absolutely trust my life to it. Very clear and easy to use once you have it at zero. The only thing I wish it had was an auto turn off turn on function or battery life indicator but as it stands I love it.",
      "rating": 4.0,
      "verified": true,
      "author": "Jonathon Porter",
      "helpful_votes": 0,
      "publication_date": 20170825
    },
    {
      "title": "Broken after 2 Mags",
      "text": "Mounting was easy... The battery has to be wedge in due to no battery cover... Can’t understand that... Anyways, It just lays on the slide mount... At the range I sighted it in... No prob... After two full mags it stopped working... Thought it was the battery... It wasn’t... I sent it back! Overall when it worked it was nice and slim on my Glock 26 Gen 5... But unfortunately it crapped out!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Chris Eo",
      "helpful_votes": 0,
      "publication_date": 20200725
    },
    {
      "title": "Long battery life",
      "text": "I installed this on a Canik TP9SFX. It really improved my shooting. Most of my shots now are all in the same hole.. yes that's true!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Jon Bradley Friend",
      "helpful_votes": 0,
      "publication_date": 20190713
    },
    {
      "title": "Great product but mine was faulty!",
      "text": "I love Vortex products but mine was faulty and had a short in it probably due to the way it was handled during shipping. So I called Vortex up because they have an awesome warranty service and they sent me a shipping label and are currently in the process of fixing it.",
      "rating": 3.0,
      "verified": true,
      "author": "Justin L.",
      "helpful_votes": 0,
      "publication_date": 20200308
    },
    {
      "title": "did not receive all the product i was supposed to receive",
      "text": "wanted to mount this on my ruger sr9c. when i received this all i had was the sight, no directions, no tools, no battery, no battery cover, there was empty spots in the foam for everything but no merchandise. terribly disgusted",
      "rating": 1.0,
      "verified": true,
      "author": "Karen E. Bennett",
      "helpful_votes": 0,
      "publication_date": 20200312
    },
    {
      "title": "The accuracy is very well on point, love it love it love it.....",
      "text": "I love this Optics. Its one of the top 3 optics to get, very accurate and installation on the pistol and mounting plate and it makes the gun look good too.. But if you get a optics make sure its for use and not for show I seen it alot.. Like I said on my top 3 picks, I'm glad I got this a very well investment......",
      "rating": 4.0,
      "verified": true,
      "author": "Crystal Michelle",
      "helpful_votes": 0,
      "publication_date": 20200605
    },
    {
      "title": "Three Stars",
      "text": "Needs an insulator between battery and base mount. Switches are small and close together (not for fat fingers)",
      "rating": 3.0,
      "verified": true,
      "author": "john wolf",
      "helpful_votes": 3,
      "publication_date": 20170123
    },
    {
      "title": "Perfect for handgun 1911 and tanfoglio",
      "text": "Work well, red dot super bright - I have been using it on tanfoglio stock 3 - eaa witness",
      "rating": 5.0,
      "verified": true,
      "author": "Carlos Domenice",
      "helpful_votes": 0,
      "publication_date": 20191118
    },
    {
      "title": "Did not work",
      "text": "Sight would not turn on. I replaced the battery and still would not turn on. Amazon's return program would not print on my printer even though the printer works fine on other programs.",
      "rating": 1.0,
      "verified": true,
      "author": "Dale S",
      "helpful_votes": 0,
      "publication_date": 20191209
    },
    {
      "title": "it's an excellent value. Frankly I was surprised how well made ...",
      "text": "If you want a red dot, and you've got an adapter to fit this, it's an excellent value. Frankly I was surprised how well made it was, given that it's one of the lower priced options.",
      "rating": 5.0,
      "verified": true,
      "author": "rigger7906",
      "helpful_votes": 0,
      "publication_date": 20170826
    },
    {
      "title": "This Is worth the money but the design can kick rocks",
      "text": "Look it works and it’ll hit wherever you aim it at . What I don’t like is the battery design. Also you have to unscrew the lock to be able to adjust so you have to take the entire red dot off to be able to access the lock screw to be able to make my adjustments because I can’t fit the L wrench in between my fixed sights!!!!!!!",
      "rating": 3.0,
      "verified": true,
      "author": "Elfabo93",
      "helpful_votes": 0,
      "publication_date": 20181218
    },
    {
      "title": "Not worth the money.",
      "text": "Well I bought one it failed in less then 17 rounds. So returned it and the next failed within 300 rounds it just stopped working..... I'm pretty disappointed in vortex.",
      "rating": 1.0,
      "verified": true,
      "author": "Joseph D. Griffin",
      "helpful_votes": 0,
      "publication_date": 20191008
    },
    {
      "title": "Love the WOW factor!",
      "text": "small, lite, compact, excellent value with lifetime warranty! You can't beat this red dot sight. I had to paid over twice the price for a motion detect, instant-on, Leupold Deltapoint Pro that I will use on my EDC Glock.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191121
    },
    {
      "title": "Awesome Red Dot",
      "text": "This is an amazing red dot I will be purchasing several more of these. It’s a great price also",
      "rating": 5.0,
      "verified": true,
      "author": "Amy",
      "helpful_votes": 0,
      "publication_date": 20200504
    },
    {
      "title": "its a great optic especially for the price but changing the battery is a pain",
      "text": "its a great optic especially for the price but changing the battery is a pain",
      "rating": 4.0,
      "verified": true,
      "author": "Lucky Bear",
      "helpful_votes": 0,
      "publication_date": 20190903
    },
    {
      "title": "Dead after First Use",
      "text": "Worked great the first time. A week later it was dead. Changed battery. Dead. Changed another battery. Dead. Checked battery, 3v. Won't power up. Very expensive paperweight. And, I see I'm not the only one with this experience.",
      "rating": 1.0,
      "verified": true,
      "author": "Dr. Joseph Ventura",
      "helpful_votes": 0,
      "publication_date": 20200903
    },
    {
      "title": "HOLDS TRUE UNDER FIRE.",
      "text": "WITH THE AT3 MOUNT LOOKS GOOD NO CLUTTER WHILE USING SIGHT. GOOD SIZE DOT (6) MOA.",
      "rating": 5.0,
      "verified": true,
      "author": "EpD",
      "helpful_votes": 0,
      "publication_date": 20200704
    },
    {
      "title": "NOT A REAL VORTEX PRODUCT!!!! KNOCK OFF!!!!",
      "text": "Found out this is a knock off clone of a Vortex red dot. THIS IS NOT THE REAL THING!!!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200818
    },
    {
      "title": "Great optic",
      "text": "I got this thing zeroed fast and it held up well on my glock 27.",
      "rating": 5.0,
      "verified": true,
      "author": "Bhutjolokia ",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Broke after 300 rounds",
      "text": "This optic broke after 300 rounds through y Glock 19 It might just be mine I’ve seen a lot of good reviews I just hope they replace it.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190914
    },
    {
      "title": "Love it",
      "text": "Works great on my Ruger 57 easy install I just had to get the 57 adapter.",
      "rating": 5.0,
      "verified": true,
      "author": "Willie",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "Box Was Empty",
      "text": "I got ripped off. Received an empty box. Buyer beware.",
      "rating": 1.0,
      "verified": true,
      "author": "D.P. Roberts",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "For the money?  Hell ya",
      "text": "On the top of the mid shelf. Good product. Not the super spendy but close enough",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "Vortex viper red dot **EDITED**",
      "text": "EXCELLENT red dot. I have this mounted on a Dueck Defense RBU on my EDC Glock 19 and it’s been fantastic. It gets carried everyday and shot at least once a week. Holds zero and still has original battery currently. **EDIT** I was being a cheap when I bought this. It did function, but the first time I pushed it hard I broke it. Save your money for an RMR or DPP.",
      "rating": 2.0,
      "verified": true,
      "author": "Firearm Aficionado",
      "helpful_votes": 0,
      "publication_date": 20190630
    },
    {
      "title": "Would order another for pistol or rifle.",
      "text": "Placed on my Mossburg 12 gauge SG. Work great and holds zero.",
      "rating": 5.0,
      "verified": true,
      "author": "Mitch Hayes",
      "helpful_votes": 0,
      "publication_date": 20191029
    },
    {
      "title": "Did not work right out of the box",
      "text": "The screws didn’t work right out of the box... it would not adjust windage or elevations... was pretty disappointed and ended up spending the money on the Holosun 507C. Pretty sure this is a fake reticle.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191201
    },
    {
      "title": "Nice sight.",
      "text": "Installed on a Glock 19 and the size is perfect. I haven’t tested it at the range yet.",
      "rating": 5.0,
      "verified": true,
      "author": "KrisQ",
      "helpful_votes": 0,
      "publication_date": 20191224
    },
    {
      "title": "Awesomesauce!",
      "text": "This sight is fantastic! Shipped quickly and well packed. Mounted on a G34MOS it cowitnesses the iron sights nicely.",
      "rating": 5.0,
      "verified": true,
      "author": "Piscator",
      "helpful_votes": 2,
      "publication_date": 20170302
    },
    {
      "title": "Rail must be modified to fit",
      "text": "So this is awesome! But I should have done more research! Just know if you get this you must take your rail to get modified. You CAN NOT just use the mounting bracket as I thought.",
      "rating": 4.0,
      "verified": true,
      "author": "Cassie Almon",
      "helpful_votes": 0,
      "publication_date": 20200205
    },
    {
      "title": "Poor battery placement",
      "text": "Not a fan of battery placement. Have to disassemble every time the battery needs changing.",
      "rating": 3.0,
      "verified": true,
      "author": "Tim",
      "helpful_votes": 0,
      "publication_date": 20200224
    },
    {
      "title": "Not bad",
      "text": "It’s a nice little optic, works great on my Glock 19 MOS, but unfortunately doesn’t co-witness.",
      "rating": 4.0,
      "verified": true,
      "author": "C P",
      "helpful_votes": 2,
      "publication_date": 20171209
    },
    {
      "title": "still good",
      "text": "great product great glass and adds a great deal of accuracy gave 3 stars due to shim being needed to keep battery in its housing",
      "rating": 3.0,
      "verified": true,
      "author": "RaineyJr",
      "helpful_votes": 0,
      "publication_date": 20200229
    },
    {
      "title": "Disappointed",
      "text": "Purchase this optic because I had heard a lot of good things about Vortex. I put it on a Glock 19 MOS, fired approximately 250 rounds through it and the optic died. I changed the battery still nothing...currently trying to get a refund from vortex. This was purchased for duty use and this does not seem reliable.",
      "rating": 1.0,
      "verified": true,
      "author": "richard",
      "helpful_votes": 0,
      "publication_date": 20191004
    },
    {
      "title": "Nice looks cool",
      "text": "I recommend it looks cool worth every penny ez to install fast shipping",
      "rating": 5.0,
      "verified": true,
      "author": "Lego",
      "helpful_votes": 0,
      "publication_date": 20200524
    },
    {
      "title": "Profile isn't too bad bull gear than others but love it",
      "text": "Little bigger than other models like the Trijicon but other than that it's awesome runs great shuts off when it should after 14 hours have had it for a while and haven't had a problem with it yet I've scratched it up quite a bit I have it on my carry gun that I carry every day and everyone that has seen it is looking to buy one for their gun belts",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Jones",
      "helpful_votes": 0,
      "publication_date": 20170609
    },
    {
      "title": "Great everyday carry sight",
      "text": "Great sight perfect customer service been running it on my everyday carry for about a year now zero complaints other than I wish it didn't have an auto-off feature.",
      "rating": 5.0,
      "verified": true,
      "author": "chris",
      "helpful_votes": 0,
      "publication_date": 20180911
    },
    {
      "title": "The viper is PERFECT. I've shot about 300 rounds this past weekend ...",
      "text": "I have a glock 19 MOS. The viper is PERFECT. I've shot about 300 rounds this past weekend to test it and it was flawless. A couple things i recommend if you have a glock 19 MOS is that you DO NOT purchase the shim that Vortex recommends. Finally, make sure to contact vortex to receive the correct screws to mount to your glock. Awesome red dot so far. Co-witnessed the red dot RIGHT on top of my suppressor sights and I hit dead center with each hit. Very happy with this purchase. I strongly recommend the Viper.",
      "rating": 5.0,
      "verified": true,
      "author": "Ariel",
      "helpful_votes": 5,
      "publication_date": 20170213
    },
    {
      "title": "Five Stars",
      "text": "Quick shipping easy installation good view great product for the price!",
      "rating": 5.0,
      "verified": true,
      "author": "Butch",
      "helpful_votes": 0,
      "publication_date": 20170324
    },
    {
      "title": "Looks good.",
      "text": "This sight didn’t fit my RMR cut on my slide; I had to send it back. Refund was quick and shipping was easy. It looked good quality, I never used it.",
      "rating": 5.0,
      "verified": true,
      "author": "Chesty",
      "helpful_votes": 0,
      "publication_date": 20190817
    },
    {
      "title": "Great sight!",
      "text": "The Vortex was easy to install and was accurate right out of the box. I was astonished that I didn't even have to adjust it at all for shooting targets that were 25 yards out. Took it out twice so far with no complaints.",
      "rating": 5.0,
      "verified": true,
      "author": "Jared",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "Great on S&W core handgun!",
      "text": "Mounted on a smith and wesson performance center core and fit was perfect. Installation took 5 minutes. Sight works great through 500 rounds. Only issue is the locking set screws are a little hard to adjust with rear sight installed. Minor issue that will not stop me from purchasing another sight in the future. Great product!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20160618
    }
  ],
  "product_meta": {
    "title": "Vortex Optics Viper Red Dot Sight - 6 MOA Dot",
    "description": "The Viper Red Dot’s super-low mounting height makes it the perfect solution for handguns with cutout slides. Gives shooters the simplicity and speed advantage of a dot sight, while co-witnessing with stock iron sights. The trade off? Nothing. The left-side up/down power and illumination controls are easy to access and manipulate. Recessed 1 MOA wind age and elevation adjustments are super clean, protected from incidental contact, and always at the ready. It runs on a CR2032 battery. Please update the above details, thank you.",
    "rating": 4.4,
    "feature_bullets": [
      "The Viper Red Dot Sight has a super low-profile making it perfect for handguns with cut-out slides.",
      "The Viper's low height allows it to co-witness with iron sights and the 6 MOA dot is easy to pick up and get you on target fast. Power and illumination controls are easy for shooters to access and adjust.",
      "The fully multi-coated, ultra-clear lens offers a wide, unobstructed field of view while Armortek coatings protect your lens from oil, dirt, and scratches.",
      "Hard anodized finish- highly durable low-glare matte finish. 1 MOA windage and elevation adjustments move the dot to your point of aim.",
      "Waterproof and shockproof construction ensure your Viper Red Dot is ready for all conditions; O-ring seals prevent moisture, dust and debris from penetrating for reliable performance in all environments."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "4.5 x 5.4 x 2.3 inches; 6.4 Ounces",
      "Item model number": "VRD-6",
      "Department": "Unisex-adult",
      "Batteries": "1 Lithium Metal batteries required. (included)",
      "Date First Available": "January 10, 2015",
      "Manufacturer": "Vortex Optics",
      "ASIN": "B00S2P2LXO",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Sights",
      "Sports & Outdoors",
      "Airsoft & Paintball",
      "Sports & Fitness",
      "Paintball"
    ],
    "price": ""
  }
}