{
  "website_summaries": [
    {
      "verdict": "Geared toward helping babies graduate from bottle feeding, it's the top choice in terms of convenience and features.",
      "pros": [
        "Holds up to 10 ounces and offers kid-friendly features: contoured, removable handles, durable build, and cute character designs",
        "Resists leaks"
      ],
      "cons": [
        "Toddlers may chew the spout, causing it to collapse",
        "Some parents had to make the holes in the spout larger for better flow"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Impossible for Baby to Suck Liquid Out",
      "text": "I bought this sippy cup for my son to start getting used to drinking water. I figured that the spout was similar to a bottle and the rubbery texture would help ease the transition. However, he wouldn't drink much out of it and quickly pushed it away. I didn't figure out for weeks that it was because of the cup. I tried to drink out of it myself and it was virtually impossible. Either the hole was too small or the suction didn't allow for air to go in, but even sucking as hard as I could, I could only get a few drops out. No wonder he got frustrated with it!",
      "rating": 2.0,
      "verified": true,
      "author": "Katie Lemons",
      "helpful_votes": 65,
      "publication_date": 20180615
    },
    {
      "title": "Frustrated baby",
      "text": "Unfortunately this did not work for my son. He couldn't quite grasp the fact that he needed to bite down and suck. I tried it myself and barely got anything out. This lead to my son not taking much water and becoming constipated over a few days - we ended up getting the tommee tippee trainer and it is working out much better for him. On a positive note, the design of the handles is great for holding. Its just unfortunate he couldn't drink from it!",
      "rating": 2.0,
      "verified": true,
      "author": "Hgart",
      "helpful_votes": 56,
      "publication_date": 20180405
    },
    {
      "title": "2 stars",
      "text": "I have such mixed feelings about this cup. On the one hand it's light and easy to handle for the transition of bottle to cup and it's pretty good when it's placed upside down with very little spills BUT on the other hand... the spout area collapses when the my child drinks from it. It happens every time... unscrewing the top to relieve the suction works until he begins drinking from it again. Lastly, the spout cover that came with it didn't quite fit again after I sterilized the product for the first use. I give it 2 out of 5 stars because the collapsible nipple/ spout is very frustrating!",
      "rating": 2.0,
      "verified": true,
      "author": "Marli",
      "helpful_votes": 86,
      "publication_date": 20170127
    },
    {
      "title": "Great, spill proof cup",
      "text": "My daughter loves her NUK sippy cups! I take the handles off when I want her to actually drink out of the cup, because she usually ends up chewing on the handle rather than drinking out of the top. I can tell that she feels like such a big girl when she uses it and she gets very excited to drink from it. It is also spill-proof, so when she tips it upside down she doesn’t get wet. I have purchased a few of these and love them!",
      "rating": 5.0,
      "verified": true,
      "author": "Nikki",
      "helpful_votes": 34,
      "publication_date": 20180304
    },
    {
      "title": "NOT a two pack.",
      "text": "Item description says “2 pack.” I wouldn’t have paid this much for ONE cup had I known I’d only receive one cup. Very disappointed by the misleading description.",
      "rating": 1.0,
      "verified": true,
      "author": "Tiffany",
      "helpful_votes": 29,
      "publication_date": 20180423
    },
    {
      "title": "Only cup/bottle my 5 month old likes!",
      "text": "We have been trying to give our 5 month old a bottle for 3 months +. I ordered this sippy cup to have once he was older and on a whip decided to try it... He loves it!! Loves the handles, loves chewing it, loves drinking out of it. We exclusively breastfeed and now daddy might have a chance at feeding him once in a while!",
      "rating": 5.0,
      "verified": true,
      "author": "Herpst Family",
      "helpful_votes": 31,
      "publication_date": 20170702
    },
    {
      "title": "LOVE. BOUGHT A TON",
      "text": "Love these. I couldn't get my daughter off the bottle and I ordered these after my friend suggested them....She didn't even notice the switch. All bottles are gone. The only issue is she seems to bite the top and it makes the holes bigger, causing too much milk to come out at one time...But that is not the companies fault. It is to be expected. I see they sell replacement tops so I will have to get some. That is better than buying a whole new sippie cup, so I am okay with that. I would be lost without these.",
      "rating": 5.0,
      "verified": true,
      "author": "Kim C.",
      "helpful_votes": 10,
      "publication_date": 20190223
    },
    {
      "title": "Great transition cup!",
      "text": "I love this learnercup and my daughter loves it even more. Our pediatrician told us to transition our daughter at one-year-old to a sippy cup and she took to this learner cup right away. I like that it's clear and has the dashes to tell you how many ounces are in the bottle when you add milk. My daughter has found a little monkey and lien My daughter has found a little monkey and lion on the bottle and points at them and laughs and thinks it's the funniest thing. It's easy to clean too.",
      "rating": 5.0,
      "verified": true,
      "author": "Gigi",
      "helpful_votes": 9,
      "publication_date": 20180104
    },
    {
      "title": "Awesome transition cup",
      "text": "Awesome transition cup. Easy to hold and use. My 7 month old loves it. I wish I got the smaller one. She only drinks 6oz at a time and this bottle holds 10oz. She's still learning to tilt the bottle up to get all of the milk. The smaller one only hold 5oz tho. Otherwise love it and I'll be ordering more !",
      "rating": 5.0,
      "verified": true,
      "author": "Andria Cooney",
      "helpful_votes": 15,
      "publication_date": 20170429
    },
    {
      "title": "Different than pictured.",
      "text": "Different than pictured. Great cup. I had the same one with my son so I know I wanted the same for my twin girls, but they are a different design tan pictured. This is the ONLY reason I have 1 Star.",
      "rating": 1.0,
      "verified": true,
      "author": "kaseyb",
      "helpful_votes": 8,
      "publication_date": 20190310
    },
    {
      "title": "Zero Stars",
      "text": "I ordered the Pink JUNGLE cup for my niece and what arrived was a purple butterfly one. The SAME DAY I received my order, the picture on the ad changed to the butterfly, but the title and the description still showed the jungle. So I called amazon and they had a replacement sent to me within a day in the hopes the new one would be the jungle design. Sure enough, it was STILL the butterfly and there is now a new ad for the jungle (both boy and girl designs) but the girl is almost $10 more! Horrible and very upset. Will not be ordering any more. Do not take your chances with this!",
      "rating": 1.0,
      "verified": true,
      "author": "LilNugget",
      "helpful_votes": 3,
      "publication_date": 20190409
    },
    {
      "title": "Undrinkable spout - two small holes that release very little liquid- not an easy transition cup",
      "text": "I ordered this for my baby/toddler who is transitioning from a bottle to a sippy with some difficulty. I have a NUK bottle that looks very similar and though that he would trust the look of this sippy. He did. However, he was having great difficulty sucking from the cup. I found that the nipple/spout has two tiny holes that make it nearly undrinkable. I tried seeing if there was some kind of biting trick where he would have to bite and drink but there was not. If there is a way to drink out of it, it is not easy. I was not a fan and he was not either.",
      "rating": 2.0,
      "verified": true,
      "author": "Esmeralda344",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "Impossible to drink from",
      "text": "The issue with this product is the nipple. Our baby girl was struggling to get any water out, and I even tried it. The slots are so tiny it’s impossible to suck any water out. I had to use all my night to get a sip, I can’t imagine how a baby would get any water out at all!",
      "rating": 1.0,
      "verified": true,
      "author": "ST",
      "helpful_votes": 5,
      "publication_date": 20190131
    },
    {
      "title": "Very Well Designed.",
      "text": "I am constantly impressed how little this leaks. Our sweet little girl is now 9 months and crawling at an alarming speed, and she does so holding this cup full of water and I almost never leaves droplets. Some other reviews have stated that it can't handle teething but I have evidence to the contrary. Our girl chews the heck out of hers and had been teething for 2 months now. I purchased two of these and they endure constant chewing and they work flawlessly. I don't often give 5 stars...",
      "rating": 5.0,
      "verified": true,
      "author": "Nick Grillo",
      "helpful_votes": 8,
      "publication_date": 20161216
    },
    {
      "title": "My favorite started sippy cup",
      "text": "I have four kids with huge age differences. I feel like I've seen a lot of sippy cups in my day. I discovered these with my third child and was happy to find them again after my fourth child was ready to start drinking from a sippy cup. The spout/nipple is soft, it holds just enough juice and the handles are great and remove easily. Three parts in total, similar to a bottle. The Dr. Brown's sippys are cute but the parts are annoying and easily lost. I love these though and hope they also come in larger sizes.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarrowind",
      "helpful_votes": 2,
      "publication_date": 20190404
    },
    {
      "title": "Water tastes like plastic/chemicals faintly.",
      "text": "After putting water in the cup, and then drinking the water, it tasted like pastic. Answered questions note it is made of polypropylene. Although I do not doubt that this is true, manufacturers are not required to note plastic additives. Although the polypropylene is not known to leach into the water, the additives may.",
      "rating": 1.0,
      "verified": true,
      "author": "Customer",
      "helpful_votes": 5,
      "publication_date": 20180626
    },
    {
      "title": "Only sippy my toddler will accept.",
      "text": "Because these are my daughter's only sippy she will take, I'm giving 4 stars. I love that the spout is soft without being a nipple shape which makes for a great transition into sippy cup land. Removing one because the suction is a bit too strong on these. I do have to manually cut a slit along the holes and twist the knife to create a broad slit to allow for more of a toddler like flow. Please understand that if you do this, you will experience leaking. Such is mom life though, can't win them all. Overall, my daughter is happy with these and so am I!",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200227
    },
    {
      "title": "Not for biters",
      "text": "At first I loved these bottles! They are easy for my son to hold and the nipples were a great transition from a bottle. HOWEVER! The flow is very slow and the nipples just have a slit at the tip. The slit would be fine, but for any of use who have biters, they do not last long. I think we barely made it a week before we gave up and had to buy different supply cups. My son had bitten a hole in the tips and they were leaking everywhere. So moral of the story, if your kid has teeth and also needs a stronger flow, these are not for you.",
      "rating": 3.0,
      "verified": true,
      "author": "J&S",
      "helpful_votes": 0,
      "publication_date": 20200923
    },
    {
      "title": "Nice cups! Spout is easily chewed though",
      "text": "I really like these cups. We have two of the 5oz learner cups and 3 of the 10oz active cups which we haven’t started using yet. My 9-month-old learned pretty quickly how to hold the handles and drink from the spout. However, my son likes to chew and bite so the spout was quickly chewed open which makes the water pour out all over the place. I just purchased replacement spouts so that we can continue using these cups for a few more months. Even with the spout chewed open the cup is still usable it just makes more of a mess. But they are nice cups and easy to wash.",
      "rating": 5.0,
      "verified": true,
      "author": "CaitM",
      "helpful_votes": 0,
      "publication_date": 20200612
    },
    {
      "title": "Suction does build up...needs to be relieved quite often.",
      "text": "We've been in the process of transitioning to a sippy cup for my 9/10 month old and this cup has been good. It is, as other reviewers have stated, a little bit of a pain in the butt as the suction builds up and becomes more difficult for the littles to get liquid out without taking it away and relieving the build up. But my little one doesn't seem to mind and can still get liquid out. Its also simple enough for her to hold herself, although she would perfer someone to hold it for her. The handles also make good teethers.",
      "rating": 3.0,
      "verified": true,
      "author": "Chey L",
      "helpful_votes": 0,
      "publication_date": 20190302
    },
    {
      "title": "These sippy cups are very hard to suck anything out of",
      "text": "These sippy cups are very hard to suck anything out of. I test everything before I give it to my child, and these are not worth the frustration of a child when there are other products out there that are easier for a child to use. Especially as a transition cup.",
      "rating": 1.0,
      "verified": true,
      "author": "Danielle N. Bone",
      "helpful_votes": 6,
      "publication_date": 20180322
    },
    {
      "title": "Good and easy to grab cup for infants",
      "text": "I basically like this bottle for my boy. I started giving some water to my boy since he was six months. To start off I used his milk bottle but realized later he might need something that he can grab and does not leak water. And I found it, its good. No water leaks, gets out water only if your kid bites the tip or give a good sucction. I just wish if it had a sipper, as sometimes my kid gets annoyed for not getting water out when he is upright. But ofcourse, it does what it meant to do. So I can recommend it to some one who is looking for a Nuk cup....",
      "rating": 4.0,
      "verified": true,
      "author": "Ruby Shrestha",
      "helpful_votes": 0,
      "publication_date": 20200531
    },
    {
      "title": "Nice transition cup",
      "text": "I used these as a transition from a bottle. My daughter was very reluctant to drink milk out of anything but her Comotomo bottle or wanted to be nursed. This helped quite a bit but she still asked for her bottle. She would drink water, lemonade, tea and juice out of her silly cup, 360 cup, doidy cup and even out of a straw cup, but she would not drink milk out of anything but her bottle. Now she drinks her milk from this cup BUT not as much as she would have from her Comotomo bottle.",
      "rating": 4.0,
      "verified": true,
      "author": "Vegmom",
      "helpful_votes": 0,
      "publication_date": 20181224
    },
    {
      "title": "does not leak",
      "text": "did a lot of google for the best sippy cup and came to this one. Everyone recomended it and i gave it a try. What can i say, its perfect , easy to hold and easy to drink and my baby took it from the first sight. Will recomend to everyone that i know. Sad i didnt use it for my other kids. Only found about it with my 5th baby. So im a bit sad i didnt get to enjoy them before.Never leaks and easy to get liquid when drinking from it,",
      "rating": 5.0,
      "verified": true,
      "author": "I.M",
      "helpful_votes": 0,
      "publication_date": 20190416
    },
    {
      "title": "Not Shipped As Advertised",
      "text": "$7.99 each for the elephant cup - required to purchase 2 at checkout. Only received ONE of the elephant design. Super disappointed as I needed matching cups - so I've essentially paid $14.98 for one elephant cup.",
      "rating": 1.0,
      "verified": true,
      "author": "MidwestIrishMom",
      "helpful_votes": 3,
      "publication_date": 20190315
    },
    {
      "title": "Best sippy cup!",
      "text": "Absolutely the best sippy cup we’ve bought. It doesn’t leak, easy for my little one to carry with the handles and easy to clean. It took a few tries for my one year old to get the hang of, but this is the sippy cup that finally got her off of bottles. The transition with the soft spout was seamless. We’ve tried so many sippy cups and this is by far our favorite. This is our go-to cup while the rest collect dust in the cupboard!",
      "rating": 5.0,
      "verified": true,
      "author": "brittany",
      "helpful_votes": 0,
      "publication_date": 20190222
    },
    {
      "title": "They are very good to be the first sippy cups for my babies ...",
      "text": "I bought two for my twins. They are very good to be the first sippy cups for my babies when they are 9 months old. My baby boy likes to chew the handles and turn the cup upside down. It’s good that the cup is leaking proof, no water dripping off. After 2 months’ using, the spout of my baby boy’s cup starts ripping off and water keeps dripping when he turns it down. My baby girl’s cup is still in good condition. Initially I am going to replace the spout, but now I decide to upgrade to other drinking cups for them since this cup may not suit for big babies.",
      "rating": 4.0,
      "verified": true,
      "author": "Tina L.",
      "helpful_votes": 0,
      "publication_date": 20180425
    },
    {
      "title": "Perfect for bottle transitioning!!",
      "text": "I’ve been trying to wean my son off the bottle. He only drank milk from a bottle. He will drink water or juice from a 360 cup but milk...he would only drink from his bottle. So on the hunt I went for a bottle like transition cup...this was the winner!! He drank his milk the first time and I haven’t had to offer a bottle since!! Last night he brought me this cup at bedtime! Winner!! Plus it comes in smaller sizes, with or without handles! I love this cup and the price!! Easy to clean!",
      "rating": 5.0,
      "verified": true,
      "author": "Kasie",
      "helpful_votes": 0,
      "publication_date": 20200612
    },
    {
      "title": "kind of like a bottle but not",
      "text": "We bought these to help transiting from bottle to sippy cup. My 14 month old son will drink water all day from a regular sippy cup but not milk. He drinks milk 3x/ day and will only take it from these. We've been using them for 4 months and have not made much effort to continue the transition, but while these make me feel good that we've left the bottle behind, I'm not really convinced they are much different from the bottle. The are durable and easy to clean though.",
      "rating": 5.0,
      "verified": true,
      "author": "CDM",
      "helpful_votes": 0,
      "publication_date": 20200730
    },
    {
      "title": "Doesn’t leak at all!!!",
      "text": "As a first time mom, the sippy cup world is all new to me. So many choices!!! Luckily our just-turned-1- year-old- daughter is willing to try anything (transitioning off bottle) that I give her to drink out of and had no issues (except for the straw sippy cups, though I guess that may get easier with age)! However, this sippy cup is AMAZING. It’s easy for her to hold and carry around and hasn’t leaked once (despite being tossed from the high chair or rolling across the hardwood). This also doesn’t leak in her bag on the go, which makes it perfect for the car! So, so glad I found these!!!",
      "rating": 5.0,
      "verified": true,
      "author": "hallies",
      "helpful_votes": 0,
      "publication_date": 20191013
    },
    {
      "title": "Not Sturdy Enough",
      "text": "This is a great learner cup, but it doesnt live up to the standards of an infant with teeth. If you suck on the mouth part, there are 2 tiny pieces of the nipple that are also sucked into your mouth. This is apparently very appealing to my child, as he bit them off soon after using the cup. And swallowed them, leaving a big hole. The nipple is a lot softer and easier to rip apart than some other brands. It is easy to clean, assemble, and for baby to figure out.",
      "rating": 2.0,
      "verified": true,
      "author": "Amy C.",
      "helpful_votes": 0,
      "publication_date": 20181014
    },
    {
      "title": "My fav 1st cups",
      "text": "I've been using these cups for the last ten years with four kids! They're SO easy to clean, easy to hold, cute design, portable. They don't spill, but if you have a kid that throws stuff off the high chair, they do kind of splash a little when they land. They're the best cups to transition from breastfeeding to sippy. The spout is soft and easy to figure out for a little baby to suck! My kids all started these at about 4-5mo with little sips of water.",
      "rating": 5.0,
      "verified": true,
      "author": "~°~ Momma of 4 littles ~°~",
      "helpful_votes": 0,
      "publication_date": 20190401
    },
    {
      "title": "Easy to use and clean",
      "text": "These are my go-to sippy cups. They are easy to clean and relatively cheap. I have tried every cup on the market and these were the only ones my very premature twins could figure out when we added water at 6 months. I really wish the nipples were more durable. My kids have managed to bite through all of them. They do leak if they are tipped upside down and the nipple is depressed - my kids figured that out pretty quickly. I do like that they have to tip them to drink. If you use only straw cups, they won’t learn they have to tip cups to drink.",
      "rating": 4.0,
      "verified": true,
      "author": "MARGARET CROWLEY",
      "helpful_votes": 0,
      "publication_date": 20190831
    },
    {
      "title": "Great transition sippy cup",
      "text": "So it’s only the 1st night but I’m so excited I found this cup. The reviews were good and I needed to wean her from the bottle. It’s like she would’ve taken this over the bottle a long time ago! She can lay back and drink it just like the bottle. She likes the handles on it bc I tried it both ways. She is happy with this cup. So I am happy bc tonight I was able to get rid of all the bottles! Yay. And it doesn’t spill! Full cup upside down and nothing comes out!",
      "rating": 5.0,
      "verified": true,
      "author": "Heather",
      "helpful_votes": 0,
      "publication_date": 20191118
    },
    {
      "title": "So much better than the sippy cups my 1st two kids had 9 and 6 years ago.",
      "text": "I like that there isn't a valve to make a proper cleaning difficult. I also like that the handle is removable. I wish I had the ability to grant 4 1/2 stars, just because getting the handle back on seems next to impossible. However, I could have been doing it wrong, but I don't think so...I mean, there are only 4 pieces total and I have a college degree. In my own defense, my husband took it apart to wash in my absence so I have no idea how much force or technique it took to remove it in the first place. I might just be a sissy-la-la.",
      "rating": 5.0,
      "verified": true,
      "author": "Abbynichole",
      "helpful_votes": 0,
      "publication_date": 20190502
    },
    {
      "title": "Breaks easily",
      "text": "The tip of this is very easy to chew and break off little pieces of it. This makes it no longer spill proof, and my baby probably ended up eating the pieces he chewed off. I thought the first time it happen, maybe it was after prolonged chewing that I didnt notice, so I bought another, and with in a week or two, the same thing happened. Would not recommend this cup, there must be better ones that dont just fall apart with a few bites.",
      "rating": 1.0,
      "verified": true,
      "author": "PurpleShoes",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "Great for babies just learning to use a cup!",
      "text": "My son really liked this cup when he was first learning to use a cup (6+ months). He was able to drink out of it fairly quickly but did need me to hold it for him. He LOVED to bang it against his high chair tray and throw it on the floor. It never once broke open or leaked a bunch. Plus, it has the added bonus of only being 2 pieces so its not too hard to clean.",
      "rating": 4.0,
      "verified": true,
      "author": "Tory V",
      "helpful_votes": 0,
      "publication_date": 20190327
    },
    {
      "title": "Great bottle.. At first",
      "text": "Nuk products are great so of course I bought this sippy cup. I use this as a bottle replacement for my 1 yr old daughter drinking milk in the morning. She loves this bottle but I wouldn't say it's 100% leakproof. Sometimes it leaks but it's not horrible. I have yet to find a bottle that is 100% leakproof but this one is by far my favorite. Update 9/23/20... It leaks a lot now. Time to switch to another type of cup.",
      "rating": 3.0,
      "verified": true,
      "author": "Virgie",
      "helpful_votes": 0,
      "publication_date": 20200801
    },
    {
      "title": "Difficult to get a good flow.",
      "text": "I’m sure this is a great sippy cup for some toddlers but for some reason, my 18 month old takes sooo long to get milk out of it. I tried it myself with water and I had to bite down to get a decent flow. You can’t just suck, baby has to bite down and suck at the same time. So it’s a hit or miss if my son will take it. It’s definitely spill proof and easy to clean.",
      "rating": 3.0,
      "verified": true,
      "author": "Mommie",
      "helpful_votes": 2,
      "publication_date": 20181230
    },
    {
      "title": "the milk flow is slow",
      "text": "This is a second sipping cup I’m buying of this brand. I like that it is easy to wash. The real problem is that milk flow is very slow. We tried to solve the problem by cutting the hole bigger, but I’m afraid that we made the case even worse.",
      "rating": 4.0,
      "verified": true,
      "author": "ValeryCa",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "Very nice for first sippy - slower flow than others.  Easy to hold.  Mom of twins and 3 year old - all used these.",
      "text": "These are awesome soft spout sippies. I think they have a slightly slower flow than some other designs (I also have the Avent classic sippies in similar size). I like also that you can get replacement nipples - because your baby will start chewing holes in them if you don't switch to hard spout fast enough. My twins could begin using these around 8 months. Still working on learning to completely hold them up. My only wish is that they also made available a hard spout replacement for the nipple. I will probably move on to the Avent sippies when my boys want a faster flow or hard spout but still need the handles and smaller size.",
      "rating": 4.0,
      "verified": true,
      "author": "Crazed with TwinsTop Contributor: Baby",
      "helpful_votes": 0,
      "publication_date": 20170414
    },
    {
      "title": "No flow nipple",
      "text": "Nipple has little to no flow - like stage 1 nipple on regular bottles. My 1 year old couldn’t get any liquid out. I tried to pole holes to make it better but didn’t do anything. Now I can’t even return it.",
      "rating": 1.0,
      "verified": true,
      "author": "SmrShali",
      "helpful_votes": 3,
      "publication_date": 20181125
    },
    {
      "title": "Best Sippy Cup For Bottle Transition",
      "text": "This has been the most amazing transition sippy cup for my daughter. We started transitioning her to it just before the age of one and she had no trouble switching to it. It mimics the size of her previous bottles, she can sit up and drink out of it and the handles are easy for her little hands to hold. The flow rate is ideal for her age as well. I would highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Meg",
      "helpful_votes": 0,
      "publication_date": 20190116
    },
    {
      "title": "Very durable, easy to use, doesnt leak or spill.",
      "text": "These are the best I habe to say. I was worried as our LO now has teeth and bites on everything (worried she would bite a hole or something in them), however I was doing dishes and I didn't see that one fell into the garbage disposal amd I ran it, once all the food was out I heard a crazy sound so I stopped the disposal amd reached in and pulled the nipple. To my surprise there absolutely nothing wrong with the nipple, not even a scratch!!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole",
      "helpful_votes": 0,
      "publication_date": 20200902
    },
    {
      "title": "Useless cap on a great bottle",
      "text": "Of all the nuk products i have gotten over the last 8 years, i think the lid of this bottle was the worst design and most useless ive ever seen. Got a good laugh. Only thing the lid is good for is keeping dust off when on the store shelf! Aside from that, great starter bottle for my little one. I can snap the handle on or off if we prefer, super easy to clean, has measurements on the side and is light weight making it easy to hold for baby. The nipple is durable and harder for little one to chew through.",
      "rating": 4.0,
      "verified": true,
      "author": "zeronesis",
      "helpful_votes": 0,
      "publication_date": 20201003
    },
    {
      "title": "Best first cups!",
      "text": "This is my LO's first cup, it works perfectly in her little hands. Easy to hold. Easy to drink from. No leaking even if she is slamming the cup to ground. I also got my LO 360 cups and straw cups, but only this one worked when she was about 7m -- now she is 11m and transferring to straw cups. However, after about three months, I notice there is some smell in the cup if water stayed overnight, so you should be more careful cleaning.",
      "rating": 5.0,
      "verified": true,
      "author": "benyuecindy",
      "helpful_votes": 0,
      "publication_date": 20190826
    },
    {
      "title": "7 month old loves it!",
      "text": "I bought these for my 7 month old boy, a blue one on Amazon and a pink one from Walmart... on accident, but color doesn’t matter. He loves them both, he holds them just fine and drinks water daily while sitting in his high chair. They are perfect size and easy for him to hold up and drink from. I introduced one to him at 6 months and it took him a little while, but he has the hang of it now. I tried other styles and brands and just wasn’t impressed! This one was just perfect!",
      "rating": 5.0,
      "verified": true,
      "author": "AddictedtoAmazon",
      "helpful_votes": 0,
      "publication_date": 20180308
    },
    {
      "title": "Leak proof but biting the nipple is hard to teach",
      "text": "Very easy to hold and it is leak proof. I like that the nipple is pretty small so I’m hoping it will make for an easier transition sippy cup from the bottle. Only thing we are having a hard time with is that you have to bite the nipple for it to actually release the juice inside which I know is part of it being leak proof but it’s making it a hard transition.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190610
    },
    {
      "title": "Arrived soiled from seller. Yuck!",
      "text": "It’s hard to see in pictures, but this arrived dirty and gross! It smelled of food, and has some kind of food grease on the packaging and the cup itself! So dissatisfied with the seller. This is for a baby, it should be clean and brand new looking... not looking like it sat next to your sink for weeks. Gross! Amazon however, is amazing as always and is refunding me for this disappointing purchase.",
      "rating": 1.0,
      "verified": true,
      "author": "Danielle Dalley",
      "helpful_votes": 0,
      "publication_date": 20200604
    },
    {
      "title": "Great transition cup",
      "text": "My 11 month old took to this sippy cup right away. He refused to drink milk from anything besides bottles, but this transition was so smooth. He wouldn’t drink milk from any other sippy cups I had (Mam trainer cup, munchkin miracle 360, etc). However those are great cups as well (he will drink water from them) I highly recommend this sippy cup if you are transitioning your child from bottles.",
      "rating": 5.0,
      "verified": true,
      "author": "Stacy",
      "helpful_votes": 0,
      "publication_date": 20200421
    },
    {
      "title": "Our go-to sippy cup.",
      "text": "My son has always used Avent bottles but he didn’t like their style sippy cup. This one is much easier for him to hold. It’s not bulky and it looks cuter. The only con is it became discolored when it came in contact with puréed carrots but it’s not too noticeable. Also, it’s easy to miss food that gets stuck in between the grooves of the silicone of the bottle and rubber part around the bottom of the cup but nothing to be concerned about.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20191210
    },
    {
      "title": "TERRIBLE cup, even an adult can barely get any liquid from nipple",
      "text": "This is a TERRIBLE cup. I'm an adult, and even if I suck extremely hard...to the point where it's uncomfortable on my tongue, and feels like I'm going to pull a muscle in my tongue...I can barely get a few drops of water at a time out of it. A baby/toddler would suffer from dehydration and mouth exhaustion before it could get anywhere near an appropriate amount of water out of this",
      "rating": 1.0,
      "verified": true,
      "author": "Jason K",
      "helpful_votes": 0,
      "publication_date": 20200709
    },
    {
      "title": "The only brand that works for my daughter",
      "text": "The nuk learner and training cups are the best ones I've found so far. They don't leak, they're easy to disassemble and reassemble, and my daughter drinks from them easily. She is 9 months old and learning to transition from the bottle to cup and so far Nuk has been the only one that works for her. I'm not worried about leaks even though she can be pretty rough with them. I'm glad Nuk makes replacement spouts so I can switch them out if/when necessary. And the designs are just too cute!",
      "rating": 5.0,
      "verified": true,
      "author": "L Railton",
      "helpful_votes": 0,
      "publication_date": 20190917
    },
    {
      "title": "Transition cup from bottle",
      "text": "Purchased as a transition cup to get away from the bottle. If this is your situation be prepared to be buying replacement spouts often because it's so easy for a toddler to bite a hole in the spout which causes milk to leak everywhere. I wish the spout was harder material or maybe I just need a different type of sippy cup. I would imagine this is better suited for younger babies.",
      "rating": 3.0,
      "verified": true,
      "author": "Laight",
      "helpful_votes": 0,
      "publication_date": 20200804
    },
    {
      "title": "6 month old loves it",
      "text": "I had bought a blue one of these previously for my now 3 year old son. I liked it then and it lasted long. So decided to go for it again for my daughter. The way these handles are built she knows exactly how to hold it as soon as she sees it. The spout is a bit tough, but my main goal is to get her used to holding for now and its working out great. I recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "KS",
      "helpful_votes": 0,
      "publication_date": 20200415
    },
    {
      "title": "Great transition cup!",
      "text": "These cups are amazing! I love that they don't spill because my daughter loves to dump it upside down and the bottles always leak. Its a great transition cup to get use to drinking a sippy cup and is still bottle like. I loves this design because I love stars and the color is one of my favorites and so pretty! Plus nuk is a very reliable brand.",
      "rating": 5.0,
      "verified": true,
      "author": "Brittany durham",
      "helpful_votes": 0,
      "publication_date": 20200424
    },
    {
      "title": "7 month baby- hard for beverage to come out",
      "text": "My son is 7 months old and the sippy cup is hard to drink from due to the hole being to small. Therefore, when I fill it with water it barely comes out. I tried it myself and sucked really hard in order for the water to come out. Their is no way my son could use this cup.",
      "rating": 1.0,
      "verified": true,
      "author": "Candy04",
      "helpful_votes": 0,
      "publication_date": 20190802
    },
    {
      "title": "I bought 3 more!",
      "text": "I love that the handles come off of the bottle portion. It makes it so that it's super easy to clean. Dishwasher safe, top rack makes it nice and easy to clean in a hurry and the nipple is great. Good quality silicone, seems resistant to the biting of tiny teeth. I've had this for a couple months and there's no fading on the picture yet and it's had a lot of beatings.",
      "rating": 5.0,
      "verified": true,
      "author": "NaNa Na NaNa",
      "helpful_votes": 0,
      "publication_date": 20200617
    },
    {
      "title": "Nipple rips easily",
      "text": "First off, this is my son's favorite cup. He likes how flexible the sippy nipple is, it's a lightweight cup and easy to hold and drink from. I like that there are very few pieces. However, the nipple tears very easily which makes me nervous as a choking hazard. If your kid is not a chewer or doesn't have teeth yet, this probably won't be an issue for you.",
      "rating": 3.0,
      "verified": true,
      "author": "Stapayr8485",
      "helpful_votes": 0,
      "publication_date": 20180923
    },
    {
      "title": "Awesome sippy cup.",
      "text": "Awesome sippy cup! I have like 7 different types of sippy cups and for milk, this is my favorite. It’s very easy to use. Very easy to clean. Comes with a lid. I did receive different color than on the picture (grey and blue) and love it more than the one on the picture. My one year old loves this cup. And handles are so practical. Highly recommend this one.",
      "rating": 5.0,
      "verified": true,
      "author": "Billy",
      "helpful_votes": 0,
      "publication_date": 20200627
    },
    {
      "title": "Love these cups!",
      "text": "I love these cups. They don't leak, you can have the hand holder piece on or off. Great step up from bottles. They will only leak when your littles start chewing on the nipples. Mine did that and they started to get big holes that would leak, but problem solved they have replacement nipples and also that is a sign to move up to a sippy cup for toddlers. I just love the convenience of them and they work great for our needs. We have a 12 month old that just drinks out of them great.",
      "rating": 5.0,
      "verified": true,
      "author": "Raychee",
      "helpful_votes": 0,
      "publication_date": 20200617
    },
    {
      "title": "Limited/Slow Flow",
      "text": "Pros: -looks great with cute patterns -easy for baby to hold -fairly easy to assemble and wash Cons: -flow of fluid is very slow -baby has to bite to get the fluid out -inefficient -nipple is narrow and difficult to clean Overall, I would not suggest this product for breastfeeding moms. The baby learns to BITE to get water out of this soppy cup, and ends up biting you.",
      "rating": 2.0,
      "verified": true,
      "author": "Ankit K.",
      "helpful_votes": 0,
      "publication_date": 20181004
    },
    {
      "title": "Disaster",
      "text": "This cup is a disaster. It is absolutely impossible to drink from. Every time my daughter ried to make a sip, the nipple would collapse from the suction and I had to open the cup to let air in. She barely managed to get anything out of the cup and after 10 minutes of me opening it up like 7 times and her trying to drink anything - she just gave up. Waste of money",
      "rating": 1.0,
      "verified": true,
      "author": "Dzmitry Ivanou",
      "helpful_votes": 0,
      "publication_date": 20191224
    },
    {
      "title": "Nipple not durable enough for my daughter",
      "text": "I really wish I could give this 5 stars but it didn't last a month at our house. Everything was great until my daughter figured out if she chewed on the plastic it would create a bigger hole. She also figured out (once she made the whole bigger) that she could turn it upside down and spill water on the table or floor to play in. If you have a super active child who has a good many teeth I would recommend getting something with a solid nipple instead of the plastic.",
      "rating": 3.0,
      "verified": true,
      "author": "Erin P.",
      "helpful_votes": 0,
      "publication_date": 20180717
    },
    {
      "title": "small and easily handled for babies just learning to drink from cup",
      "text": "We have used these for other grandbabies, they are small and easy to handle, It only took her a couple of days to learn how to hold on to it. I believe you can change out the spout as they grow, and later take off the handles, that slide right off. It holds a small amount so not too heavy. the parts come apart, so easy to clean. This brand is always sturdy and well made.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelleejean",
      "helpful_votes": 0,
      "publication_date": 20201024
    },
    {
      "title": "Couldn’t get any liquid from the spout, possible defect.",
      "text": "I LOVED the design of this cup and hoped it would be easy for my 7 month old to learn to hold. I sanitized it and put water in it and every time my son would drink from it he would get very frustrated. I couldn’t understand why so I tried drinking out of it. It was IMPOSSIBLE!! My husband tried it and could barely get a drop. I don’t know if this was defective but I was so disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Lisa",
      "helpful_votes": 0,
      "publication_date": 20200513
    },
    {
      "title": "Great first cup for older breastfed babies who don’t like the bottle",
      "text": "Great first cup for breastfed baby who doesn’t like a bottle. We use this and the munchkin latch (which is our first choice). This flow is slightly slower than the munchkin latch but really easy to latch on to and soft and flexible for baby. If older baby is rejecting the bottle, try this cup! Designs are sweet and I like that the cup is slim and compact, not as bulky as others.",
      "rating": 5.0,
      "verified": true,
      "author": "Danielle",
      "helpful_votes": 0,
      "publication_date": 20200628
    },
    {
      "title": "So disappointed",
      "text": "My 5.5 month LO did such a good job grasping the handles and I knew the soft spout would be gentle on her as she’s teething. I was impressed there were no leaks, but when I tried to drink from it to check the ease and flow, NOTHING came out. I hat to bite down on it and suck to get water. I’m so disappointed and will be returning this.",
      "rating": 2.0,
      "verified": true,
      "author": "Julie Tanaka",
      "helpful_votes": 0,
      "publication_date": 20200828
    },
    {
      "title": "Great beginners cup!",
      "text": "My daughter turned 6 months recently and I wanted to get her a good translational cup because we are giver her water now. I was worried because she’s mostly breastfed and has a bottle once in a while, thought the mouth price might be to different for her and she wouldn’t like it. Nope she loves it, no problems at all. The handles are great too she’s figured out how to hold up her cup! This is a great beginners cup for babies.",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel Lynn ",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "Found better training sippy cups...",
      "text": "This cup seems a little too small and isn't the best quality in comparison to the other training sippy cup I've been using. It doesn't seem like my son can easily get the water out and it looks like it could break if he tossed it to the floor. Cute design.",
      "rating": 3.0,
      "verified": true,
      "author": "M. T.",
      "helpful_votes": 2,
      "publication_date": 20180522
    },
    {
      "title": "Great First Cup *NO TEETH******",
      "text": "Took probably a full day for my daughter to get the hang of it, but being her first bottle (she is EBF) I would say that is amazing! She loves it and never sets it down. Update: CHOKING HAZARD. My daughter who is now teething and has a few teeth, was able to bite the tip of the nipple off! Do not recommend if your baby has teeth.",
      "rating": 5.0,
      "verified": true,
      "author": "Dare",
      "helpful_votes": 0,
      "publication_date": 20200412
    },
    {
      "title": "Hands down the best",
      "text": "This sippy cups is the ONLY one I use...why? Because it’s the only one that doesn’t make a ginormous mess when my daughter throws it on the ground. It’s also the best flow sippy cup and doesn’t overwhelm my daughter with too much liquid at one time either. This is perfect for the first and second stage of sippy cup needs before they transition to a cup. We literally own 5 of these. Do yourself a favor and just buy these and don’t waste your money on all the others.",
      "rating": 5.0,
      "verified": true,
      "author": "zgirl",
      "helpful_votes": 0,
      "publication_date": 20190211
    },
    {
      "title": "Love these sippy cups",
      "text": "When we were starting to use sippy cups, this was the only style my son would take. Now that we're completely off bottles, I have 4 of these, 2 of the \"active\" style and then a few weighted straw cups. These remain my favorite ones to use. They are durable, easy to clean, the silicone mouthpiece is replaceable if need be, and they're easy for little hands to hold onto. My kid's only complaint is that it won't fit in the cup holder of his carseat haha.",
      "rating": 5.0,
      "verified": true,
      "author": "Lacey",
      "helpful_votes": 0,
      "publication_date": 20180917
    },
    {
      "title": "Great sippy cup",
      "text": "Cute cup and right size for our toddler. It doesn't drip like other cups do when toddler shakes it upside down. We like this design and color better than the alternatives - this one isn't too gaudy. The cup is also more sturdy and will last longer than most others. Just watch out for your toddler chewing the plastic nipple if he or she has sharp teeth. We had to throw the first one out when the plastic ripped.",
      "rating": 5.0,
      "verified": true,
      "author": "Sara N",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "Son's Favorite Sippy",
      "text": "This is by far my son's favorite sippy cup and we have tried many. From the beginning, the two handles have made it easy to use for him and is able to easily get liquid out. When assembled properly, we have not had any leaks. As a mom, I love this cup because I find it easy to disassemble and clean, unlike some of the others that we have tried that have too many parts or that have parts where I don't feel like I can truly get it all the way clean/there is space for bacteria to hide. We have multiples of this cup!",
      "rating": 5.0,
      "verified": true,
      "author": "Lexy",
      "helpful_votes": 0,
      "publication_date": 20190504
    },
    {
      "title": "I didn't read the reviews...",
      "text": "This cup works for the purpose I bought it for- for using the handles for our nuk bottles, to eventually transition to a sippy. After reading a review (after purchase) that this was tough to drink from I tried it myself and couldn't get anything out. My husband also tried and was unsuccessful. Thus, I won't be using this as a sippy when its time- which is disappointing because we love the nuk brand.",
      "rating": 3.0,
      "verified": true,
      "author": "Becky Quick",
      "helpful_votes": 0,
      "publication_date": 20171127
    },
    {
      "title": "Great first cups!",
      "text": "We really like these cups for our daughter who is learning to use a cup! The handles are easy for her to hold, the spout seems to give her enough milk without pouring out, and it leaks only when she bangs it off of things (as any cup would). They make learning to use a cup as minimally messy as possible! I also almost exclusively breastfed up until the point of cow's milk and cups so was anticipating some trouble, but she took to these right away. They're also pretty easy to clean, even with silicone spouts. Would definitely recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Katie",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "One of the better sippy cups out there",
      "text": "One of the better sippy cups out there; love the size, the measurements on the side, and the handles. My only complaint is that the air vent doesn't seem to work that well so I sometimes have to equalize the pressure myself in between my baby's sips. However, it is apparently difficult to find a good sippy cup that checks off all the boxes, and this one definitely comes close. Great customer service as well.",
      "rating": 4.0,
      "verified": true,
      "author": "SB",
      "helpful_votes": 3,
      "publication_date": 20160818
    },
    {
      "title": "The sipping area enlarged....",
      "text": "This cup was grait, ir doesn’t leak and my baby could hold it by himself and won’t get wet. But, after some time the part where the water comes out enlarged and looks like a small hole, and if I give him the cup now he gets all wet and sometimes he starts coughing because he gets a lot more water from dhe hole. So, cant use the cup anymore. I used to love it for the short time that baby used it. Anyone else had the same problem?",
      "rating": 3.0,
      "verified": true,
      "author": "Ludmilla",
      "helpful_votes": 0,
      "publication_date": 20180720
    },
    {
      "title": "So great, you'll want two!",
      "text": "I loved this cup so much that I bought a second. No leaks/spills, and it was perfect going from exclusively nursing to this! We had no issues or aversions, he just took it right away. As my son got older, the handles really helped with holding it as too, i think the biggest part is that it's so easy to clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Caitlin D. Miller",
      "helpful_votes": 0,
      "publication_date": 20200610
    },
    {
      "title": "Great transition from bottle!",
      "text": "We used this to transition 2 year old from bottle and it worked great. It’s really similar to a bottle nipple but it’s not. My daughter fussed a little for two days but drinks milk from it now exclusively. We used the smaller size for water in the past too. Easier to clean than most out there too. Love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Jamiefay",
      "helpful_votes": 0,
      "publication_date": 20200329
    },
    {
      "title": "good for baby led weaning but spout is NOT durable",
      "text": "Update: The nipple was split and torn within 2 months! If they're going to make products that aren't durable, they should at least lower the price of the replacement parts. The replacement spout is almost as expensive as an entire new learner cup! Otherwise, we really loved this cup. Super easy for baby to get used to drinking out of a cup. We do baby-led weaning and went straight from breastfeeding to drinking from this cup, no bottle at any point because she just wouldn't take one. This has been a good product for transitioning from boob to 360 degree learner cups.",
      "rating": 3.0,
      "verified": true,
      "author": "pibblesTop Contributor: Pets",
      "helpful_votes": 9,
      "publication_date": 20170331
    },
    {
      "title": "REALLY WORKS",
      "text": "My 15 month old loves these and so do I. They are truly spill proof and make life so easy. He really liked the bottle so at 9 months we got him a smaller version of this and he loved it now that he is older drinking more this cup works perfect. Also refrigerates wells and fits great in the diaper bag.",
      "rating": 5.0,
      "verified": true,
      "author": "Dolores Baker",
      "helpful_votes": 0,
      "publication_date": 20200902
    },
    {
      "title": "Great for 6 month olds!",
      "text": "These cups have been great for both of my kids when they first started to learn how to drink from a cup at about 6 months. At first all they can really do is attempt to grab the handles, then get it to their mouth, and then drink but it is a great learning tool having those handles and being able to remove that part of it when they are ready.",
      "rating": 5.0,
      "verified": true,
      "author": "Leah",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "One Cup to Rule them All!",
      "text": "We bought one of these and also got one as a gift. After trying this cup and four other brands, this one is a clear winner. The rubberized easy grip handles are connected to a base that houses the cup. This makes turning the cup very easy, after you've put the lid on and need to align the nipple between the two handles. No leaks that I can recall and very easy to clean. Will definitely be buying more of these in the future as we continue to lose lids. Hah!",
      "rating": 5.0,
      "verified": true,
      "author": "D'Nice",
      "helpful_votes": 5,
      "publication_date": 20150909
    },
    {
      "title": "The spout does not stay “inflated”",
      "text": "We’re working on transitioning my 16 month old off of her bottles and this cup looked like it would work well. She likes the handles, but doesn’t need them, so it’s great that they’re removable. The spout is not so good. The shape is good, but as my daughter drinks from it, the spout sucks in not allowing her to get any more milk. I end up having to squeeze it to put air back into it to get its shape back.",
      "rating": 3.0,
      "verified": true,
      "author": "pfountain",
      "helpful_votes": 0,
      "publication_date": 20200329
    },
    {
      "title": "Good Transition from Bottle",
      "text": "This worked to get my 1 yo son to drink warm milk from something other than the bottle. We tried three other cups before this, so it's a good transition. He can drink it well by himself with the handles. This is not leak proof, I didn't think it would be, but they asked me to rate that.",
      "rating": 5.0,
      "verified": true,
      "author": "Hugh Anderson",
      "helpful_votes": 0,
      "publication_date": 20200124
    },
    {
      "title": "Simple and wonderful",
      "text": "After trying 4 cups, we finally found one my 10 month old likes. She is breastfed and has never liked bottles. I love this cup because it has a soft silicone spout, no leaking and no tiny parts to clean. Best of all, the piece that the handles are attached to turns, so no more trying to put the lid on perfectly so it aligns okay with the spout. Wish I had these with my boys.",
      "rating": 5.0,
      "verified": true,
      "author": "Christina A.",
      "helpful_votes": 0,
      "publication_date": 20190301
    },
    {
      "title": "Perfect 1st sippy cup for baby",
      "text": "This is a perfect cup for babies transitioning and learning how to hold a sippy cup. It's leak proof and my 7 month old loves to drink from it and chew on the mouth piece since he's teething. It's durable and cleans up well. We loved it so much we bought a second one shortly after the first one arrived!",
      "rating": 5.0,
      "verified": true,
      "author": "4dogdesigns",
      "helpful_votes": 0,
      "publication_date": 20191019
    },
    {
      "title": "Good Quality - Little Difficult to clean",
      "text": "Very good quality. Kid loves it and it holds enough volume. Spill proof and the handle is easy to hold. Only issue : Not very easy to clean. Nothing unmanageable but needs some extra effort. Would still recommend for all working moms. Just know that it may need an extra scrub aside from dishwasher.",
      "rating": 5.0,
      "verified": true,
      "author": "Anu",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "My 6 month old loves it.",
      "text": "These sippy cups are great. My 6 month old was able to drink a full 4 oz on the first try. She loves holding it by the handles and its very helpful for her to be able to do it on her own. Would recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "marissa brogan",
      "helpful_votes": 2,
      "publication_date": 20190215
    },
    {
      "title": "Spout falls apart",
      "text": "This cup works well for a couple weeks, but then the spout starts to fall apart, which is not safe. I found what looked like a shard of glass in my baby's mouth, but it was a piece of the spout that had broken off. She doesn't chew on the spout either, just sucks liquids out.",
      "rating": 3.0,
      "verified": true,
      "author": "Thresia Mouritsen",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "Not the design i wanted but aye it works",
      "text": "Ive used these cups before they work fine its an easy transition from bottle to cup im just here warn (other buyers) that i didnt get the heart style i ordered. I got these bird w/flower designs in place of the hearts. No biggie my daughter will still use them. Just keep in mind you might not get the design you picked in your order",
      "rating": 2.0,
      "verified": true,
      "author": "Victoria Velasquez",
      "helpful_votes": 3,
      "publication_date": 20190409
    },
    {
      "title": "Best sippy cup!",
      "text": "NUK learner sippy cups are my favorite! I love how pretty the blue is on this one. Cleaning is so super easy, and it is very durable. My daughter has breastfeed her whole life and is just barely turning 6 months. She loves this sippy cup!! I was worried to find one she liked but it was easy with this brand.",
      "rating": 5.0,
      "verified": true,
      "author": "AutumnStone",
      "helpful_votes": 0,
      "publication_date": 20190626
    },
    {
      "title": "God send! Really leak proof",
      "text": "If you are like me and bought every cup under the sun that said leak proof only to find out it is not. This is your cup. I have 10 (I have twins) lol. This cup can be throw on the floor and doesn’t bust open or pop the plastic spout off or even leak. You can throw in the floor because you took the quick sip of milk or juice you wanted and it won’t leave anything on the floor. I wish I would have found these sooner.",
      "rating": 5.0,
      "verified": true,
      "author": "Brittany",
      "helpful_votes": 0,
      "publication_date": 20201023
    },
    {
      "title": "Great transition cup.",
      "text": "Great product. My second time around. I bought this as a transitional drinking cup from nipple to regular safety cup for my 1 yr old. Both of my boys learned how to use right away. High quality, BPA free and doesnt leak. Might be more challenging for newborns.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott Chicago",
      "helpful_votes": 0,
      "publication_date": 20200430
    },
    {
      "title": "NO other transition cup COMPARES!!!!",
      "text": "EASY TRANSITION * My review is based upon my 7 month old grandson action. I have given my grandson a few different type of transition sippy cups. NONE compare to this. He started using this IMMEDIATELY. No hesitation no refusing & no going backwards to the bottle.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Lopez",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "Couldn’t get water out of it myself",
      "text": "I don’t recommend these. I offered this for water with meals when my son was around 7 months old. I couldn’t tell if he was getting enough and he started getting really constipated. I finally tried to drink from it myself and barely got a drop. No wonder he was always so thirsty and constpated - nothing was coming out. This might be good for a younger baby in lieu of a bottle, but the flow is inappropriate for 6m+. I switched back to Munchkin Miracle 360 and those worked so much better once he got the hang of them. Giving this 2 stars for a cute design and no leaking.",
      "rating": 2.0,
      "verified": true,
      "author": "K. Patel",
      "helpful_votes": 0,
      "publication_date": 20190217
    },
    {
      "title": "Wrong texture",
      "text": "I ordered the monkey texture cup for my boy but we received a purple cup with butterfly texture in Jungle monkey paper package. so we go a replacement. however, the new replacement still has butterfly... instead monkey design. I called Amazon, and return those cups. But the problem is if I ask to replace my order again. I might still be getting the purple cup... we just WANT monkey Texture that's all. and I double checked my order it is Jungle monkey design!!! Oh , baby love the 5oz blue elephant cup. 5 stars for it~",
      "rating": 3.0,
      "verified": true,
      "author": "Yolandacil",
      "helpful_votes": 0,
      "publication_date": 20190402
    },
    {
      "title": "Doesn't hold up to baby tossing!",
      "text": "I really loved these cups.... for the first 2 months. The style of the nipple is great! It's the one my baby found easiest to learn when she was 6 months old. But by the time she was 8 months, the handles on one of them had completely cracked so they don't hold the cup any more, and there is a crack in the rim of the other one. They just don't hold up to tosses from the high chair. Very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Bella",
      "helpful_votes": 0,
      "publication_date": 20200602
    }
  ],
  "product_meta": {
    "title": "NUK Learner Cup, 10oz, Balloons",
    "description": "Color:Balloons| Size:10 Ounce (Pack of 1)The NUK Learner Cup easily promotes baby’s transition from breast or bottle to sippy cup. This Learner Cup features a spill-proof soft spout that is gentle on teeth and gums, and it includes an air vent that helps reduce swallowed air. The cup also comes with easy-to-grip, removable handles that your growing child will love. NUK Learner Cups are BPA-free and dishwasher-safe and recommended for ages 6m+.",
    "rating": 4.7,
    "feature_bullets": [
      "Helps make the transition from bottle to cup easier",
      "Easy grip, anti-slip handles are easy for baby to hold and removable as baby grows",
      "Spill-proof, soft spout is designed to be gentle on gums while teaching baby to drink from a spout. Liquids flow easily when sipped",
      "Air vent helps reduce swallowed air",
      "BPA-free; Dishwasher-safe; Recommended for ages 6m+"
    ],
    "specifications": {
      "Product Dimensions": "2.63 x 4.65 x 8.75 inches",
      "Item model number": "69726",
      "Material free": "BPA Free",
      "Number Of Items": "1",
      "Batteries required": "No",
      "Item Weight": "3.98 ounces",
      "ASIN": "B0835SCD3R",
      "Customer Reviews": "4.7 out of 5 stars8,612 ratings4.7 out of 5 stars",
      "Best Sellers Rank": "#73 in Baby"
    },
    "categories": [
      "Baby Products",
      "Solid Feeding",
      "Baby",
      "Cups",
      "Feeding"
    ],
    "price": 6.49
  }
}