{
  "website_summaries": [
    {
      "verdict": "A well-built mirror that does its job, but not everyone enjoys the 10-times magnification.",
      "pros": [
        "1- and 10-times magnification",
        "Quality construction",
        "Swivel arm rotates smoothly",
        "Affordably priced"
      ],
      "cons": [
        "Some feel the 10-times magnification is too much"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Do not but this,  10x magnification is too much",
      "text": "Don't waste your time buying this as the magnifying is to much, you can't see anything without being 1 inch away from mirror. Get the 7x",
      "rating": 1.0,
      "verified": true,
      "author": "Kuching",
      "helpful_votes": 12,
      "publication_date": 20180628
    },
    {
      "title": "10X is VERY magnified. But I love it once I got over the shock.",
      "text": "The mirror looks nice in the bathroom and folds back flat. I've always used 7X. After one look into the new 10X, I feel very brave. It's VERY magnified, shows every wrinkle, blemish and pore. It was pretty shocking at first, but i'm getting used to it now and my makeup job is much more professional looking. It really shows every flaw, but the end result is great for flawless make up. Getting the makeup on while being unable to avoid every wrinkle, blemish and pore is disconcerting, but when you're finished and look into a regular mirror you'll look spectacular. I thought \"whew, this is much better!\" .",
      "rating": 5.0,
      "verified": true,
      "author": "Davonavo",
      "helpful_votes": 3,
      "publication_date": 20190127
    },
    {
      "title": "Mirror looks and works great. The only reason I did not give it ...",
      "text": "Mirror looks and works great. The only reason I did not give it 5 stars is because of the mounting hardware. It seems as tho most products come with questionable drywall anchors. I used the screw in type due to the mirror will be moved quite often. That being said it was easy to install. I only recommend that you install at the right height for you because it only moves side to side. Will not adjust up and down, only the mirror itself swivels. I would use this again in another house.",
      "rating": 4.0,
      "verified": true,
      "author": "Maggie",
      "helpful_votes": 21,
      "publication_date": 20160224
    },
    {
      "title": "EXACTLY WHAT I WANTED!",
      "text": "I had broken my previous mirror like this during a move, so I was really happy to find this one, especially for this price. I had paid about double for the one that got broken in the move. This is plenty sturdy, installs easily if you know how to use a drill or screw driver, and works excellent. BTW, I am 65 with poor vision in one of my eyes, so the magnification on this is perfect for me. If you've still got 'young' vision; it might be a bit much for you. Lol! Otherwise, it's great!",
      "rating": 5.0,
      "verified": true,
      "author": "D. Christian",
      "helpful_votes": 0,
      "publication_date": 20190905
    },
    {
      "title": "Better than expected",
      "text": "Excellent optics and hardware. I'm actually very pleasantly surprised at how sturdy the extension arm is and how smooth the joints operate, feels more expensive than it is. Easy to mount and tucks out of the way. A great find.",
      "rating": 5.0,
      "verified": true,
      "author": "CJ - Brewster, NY",
      "helpful_votes": 6,
      "publication_date": 20171219
    },
    {
      "title": "Easy to install high magnification wall-mount mirror",
      "text": "After deciding she no longer needed our previous wall-mount mirror and passing it along to me for use elsewhere, my wife realized she did indeed still need such a mirror. Rather than simply buying another of the mirror we had before, this time we opted for higher magnification. In addition, we got an easier install, so we are both very happy with the result. Definitely recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "Man in the MiddleTop Contributor: Photography",
      "helpful_votes": 0,
      "publication_date": 20190824
    },
    {
      "title": "The mirror is nice looking. (strange explanation for a mirror",
      "text": "The mirror is nice looking. (strange explanation for a mirror??). Chrome, shinny, nice base to attach to wall.... BUT, the 10x was way too strong. I had a wall mount magnifying mirror previously but did not remember the power of the magnification. The 10x was totally obscure and I couldn't even focus on my image. I am returning this mirror and will reorder another with an 8x to see if that will match my previous item. I thought that maybe my eye sight has changed significantly and the 10x would be a good change. But way too strong.",
      "rating": 3.0,
      "verified": true,
      "author": "Sunshine Girl",
      "helpful_votes": 19,
      "publication_date": 20151013
    },
    {
      "title": "nice quality mirror",
      "text": "Be careful with this 10X magnification. My girlfriend couldn't use(WAY TOO STRONG) for applying makeup. They do not allow a return AFTER 30 days(it was put on a shelf and she just reminded me to hang. lol). It is a nice quality mirror and they other side is non-magnified, if you just need one to extend away from wall. UPDATE: Customer service follow-thru was very attentive and well done. Five stars to them for that!",
      "rating": 3.0,
      "verified": true,
      "author": "James S.",
      "helpful_votes": 3,
      "publication_date": 20170522
    },
    {
      "title": "Like, I have to take OFF my glasses to ...",
      "text": "SERIOUS magnification. Like, I have to take OFF my glasses to see the hairs on my chin! I love the versatility of changing position and angle. Attached properly to the wall (hardware is included) it's super sturdy and tucks against the wall nice and neat. A great purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Williams",
      "helpful_votes": 0,
      "publication_date": 20180814
    },
    {
      "title": "Love this mirror!",
      "text": "I love this mirror! It took about five minutes to put up with just a drill and a screwdriver. The magnification is great. I may be slightly obsessed with my eyebrows and this mirror lets me see every tiny hair that needs to be plucked! Another reviewer complained that the magnification was too strong and when I first looked in the mirror I thought the same thing and things were blurry. But the key is to get at just the right distance away from the mirror and it is perfect. I am very pleased with this mirror and would recommend it to anyone looking for a magnifying mirror.",
      "rating": 5.0,
      "verified": true,
      "author": "Alison Juneau",
      "helpful_votes": 2,
      "publication_date": 20170228
    },
    {
      "title": "The mirror is of good quality but the 10X magnification is too strong",
      "text": "The mirror is of good quality but the 10X magnification is too strong. You have to move within 10 inches to see clearly. I had a 7X power previously with a two inch 10X mirror at the bottom of the 8 inch circle and it worked much better. The vendor immediately contacted me after I submitted the review and expressed his concern that I wasn't satisfied. The vendor offered to discount the price. I decided to keep the mirror even though the 10x power is stronger than I would have liked. But the overall quality of the mirror is quite good and lt is a nice useful addition to our bathroom.",
      "rating": 5.0,
      "verified": true,
      "author": "Luther",
      "helpful_votes": 0,
      "publication_date": 20170530
    },
    {
      "title": "Clear reflection, easy install, must be close to use 10X",
      "text": "Easy to mount on the wall, packaged well. Clear reflection on both sides. The 10x side requires my face to be very close, hence the four stars. My vision is not super sharp anymore and the 10x side is excellent when I want to be sure my make-up is just right.",
      "rating": 4.0,
      "verified": true,
      "author": "Suzanne Brock",
      "helpful_votes": 0,
      "publication_date": 20190121
    },
    {
      "title": "It is fabulous!",
      "text": "I ordered this to add to my make-up table - and it is more than perfect. The mirror is large and I don't have to squint to see what I am doing. I love this mirror!",
      "rating": 5.0,
      "verified": true,
      "author": "cmh",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "It's just okay. My only complaint is you have ...",
      "text": "It's just okay. My only complaint is you have to get very close to the large side or the mirror since the outer edges get distorted. So the view is only clear in the middle of the mirror.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20171228
    },
    {
      "title": "Great product",
      "text": "The mirror arrived promptly in perfect condition and looks great in our newly redecorated bathroom. The 10X magnification is just right for someone near-sighted like me. Installation was easy, and the mirror seems to be sturdy. Chrome finish is beautiful.",
      "rating": 5.0,
      "verified": true,
      "author": "Marion L. Coste",
      "helpful_votes": 6,
      "publication_date": 20161005
    },
    {
      "title": "Good mirror bad directions!",
      "text": "I never write reviews, but I felt that I should for this one. The mirror itself is very good, but the directions are in every language but English. One of the screws could not be installed correctly. I could not get the Phillips head screw driver on to the end of the screw. Luckily I had another one at home and replaced the one that came with the product. Other than these minor issues the mirror is sturdy and the finish is good on it.",
      "rating": 3.0,
      "verified": true,
      "author": "Brooke",
      "helpful_votes": 0,
      "publication_date": 20191116
    },
    {
      "title": "Nice but magnifying side is unusable.",
      "text": "Love this mirror, however, the magnifying side is unusable. It magnifies so much you can’t see anything.",
      "rating": 3.0,
      "verified": true,
      "author": "Barbra A.",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "Great Mirror.",
      "text": "I bought two of these. My wife liked hers so much, that she bragged to our daughter, and so I bought one for my daughter.",
      "rating": 5.0,
      "verified": true,
      "author": "robby tharp",
      "helpful_votes": 0,
      "publication_date": 20190728
    },
    {
      "title": "A bit too strong",
      "text": "Didn't work for intended purpose, would have preferred to be able to tighten pivots as we wanted to mount on slight angle. The 10X mirror is a bit much, would probably stay closer to 5x if we re-order.",
      "rating": 4.0,
      "verified": true,
      "author": "9 yards",
      "helpful_votes": 0,
      "publication_date": 20170716
    },
    {
      "title": "Good quality mirror.",
      "text": "This was perfect for my needs. I had no counter top space to speak of and this mirror was perfect! A very good quality mirror, no distortion. I am happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Donna G.",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "This is a keeper!!",
      "text": "I almost returned my Excelvan 10X mirror because I had thought it would have its own internal lighting. Lucky for me I decided to try it out in my bathroom where I had planned to mount it next to the sink. Turns out, extra lighting wasn't necessary. The mirror is sturdy, easy to install, and looks nice. So it won't be going back. I love it. And, the price was amazing.",
      "rating": 5.0,
      "verified": true,
      "author": "Carolyn T. Clark",
      "helpful_votes": 2,
      "publication_date": 20170315
    },
    {
      "title": "Fantastic mirror glad I bought it",
      "text": "This is a great mirror. I have a hard time seeing and with my back problems I can't bend over my sink. This made it great so I can pull it out and use it to do my makeup and I can actually see. Really glad I bought this.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Campbell",
      "helpful_votes": 0,
      "publication_date": 20180222
    },
    {
      "title": "10x magnify mirror",
      "text": "This mirror is fantastic! Everything it said it is. Easy to put up. Directions are in every language except English, dad had to use the photos to go by",
      "rating": 5.0,
      "verified": true,
      "author": "Gina Frye",
      "helpful_votes": 0,
      "publication_date": 20190110
    },
    {
      "title": "Durable! Double sided mirror with great magnification!",
      "text": "The villa I stayed in on vacation had a mirror just like this. LOVED it! Now I own one!",
      "rating": 5.0,
      "verified": true,
      "author": "LuvOnlineShopping",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "... shaving mirror with this 10x magnified and it's working great! I mounted it on a cabinet outside of ...",
      "text": "I replace my shower shaving mirror with this 10x magnified and it's working great! I mounted it on a cabinet outside of my shower so I didn' t have to drip on shower wall.",
      "rating": 5.0,
      "verified": true,
      "author": "SrInspector",
      "helpful_votes": 0,
      "publication_date": 20170424
    },
    {
      "title": "Great Xmas Gift and love the magnifying",
      "text": "Wife absolutely loved it as a Xmas gift. Haven't mounted it yet, but that seems simple enough. However, since this model has no attached light source I'd pay attention to where you install it and how your light effects the use. Otherwise...solid piece of equipment.",
      "rating": 5.0,
      "verified": true,
      "author": "john Williams",
      "helpful_votes": 0,
      "publication_date": 20161225
    },
    {
      "title": "Great mirror!",
      "text": "Great mirror! Hung it in my bathroom. Perfect for those of us who are in need of reading glasses, we can apply eye makeup and groom eyebrows easier. Great size and easy to move with the long arm. I can also look at the back of my hair to make sure it’s in place, very handy!",
      "rating": 5.0,
      "verified": true,
      "author": "M K Q",
      "helpful_votes": 0,
      "publication_date": 20190322
    },
    {
      "title": "Very nice quality, installs in minutes.",
      "text": "Easy to install, 2 screws, mount to a stud, it took 5 minutes. The 10 x is too strong if You wear glasses, but great quality mitrror.",
      "rating": 5.0,
      "verified": true,
      "author": "JoeNolan26",
      "helpful_votes": 0,
      "publication_date": 20170428
    },
    {
      "title": "Nice Product",
      "text": "I bought this for my mother to use to put on her makeup. The magnification has been of great help to her. It appears to be well made and installed very easily. We have had it mounted for several weeks and it is working great",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190103
    },
    {
      "title": "10x magnification mirror",
      "text": "It was way too strong! I will need to order another lower strength mirror. It looks great and came on time and was well packaged.",
      "rating": 4.0,
      "verified": true,
      "author": "Becky Freeman",
      "helpful_votes": 0,
      "publication_date": 20180908
    },
    {
      "title": "I am very happy with this product and would recommend it to my friends",
      "text": "like the quality of mirror. Easy to install and to use. It would make a great gift.",
      "rating": 4.0,
      "verified": true,
      "author": "Daniela",
      "helpful_votes": 0,
      "publication_date": 20190826
    },
    {
      "title": "Great and VERY magnifying",
      "text": "Great mirror!! Clear. Sturdy. Easy to install. My only complaint is that it's actually too up close for me. I think the 8X would've been better, but that's a personal issue. The item is wonderful! Recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "California Art",
      "helpful_votes": 0,
      "publication_date": 20170213
    },
    {
      "title": "mirror is poor quality",
      "text": "Just received this mirror, looks nice mounted in bathroom, The 10 x magnifying mirror is very distorted. The mirror is concave allowing for a small center circle of clear view when your face is very close. I am disappointed as I have the item installed. The table top 10x mirror I used previously and broke was so much better. I use the mirror for putting in contacts and applying eye makeup.",
      "rating": 2.0,
      "verified": true,
      "author": "Bessie A. Harper",
      "helpful_votes": 0,
      "publication_date": 20170708
    },
    {
      "title": "I can SEE!",
      "text": "Old eyes can't see like they used to! 10x the power is awesome!",
      "rating": 5.0,
      "verified": true,
      "author": "Arnell I. Haws",
      "helpful_votes": 0,
      "publication_date": 20190118
    },
    {
      "title": "I love this! I'm going to order one for my ...",
      "text": "I love this! I'm going to order one for my mom!",
      "rating": 5.0,
      "verified": true,
      "author": "Maggie",
      "helpful_votes": 0,
      "publication_date": 20180115
    },
    {
      "title": "Wow this thing really works well. The magnified side ...",
      "text": "Wow this thing really works well. The magnified side is kind of scary because you can see detail that is at the pore level.",
      "rating": 5.0,
      "verified": true,
      "author": "Nevadaflyboy",
      "helpful_votes": 0,
      "publication_date": 20180215
    },
    {
      "title": "Wait, THAT'S what my skin looks like?! 😮",
      "text": "Nice looking and very functional. Just be prepared to be shocked and possibly a little horrified at what you see with 10x magnification! Eeeewwwwwww!!!! Probably wasn't the smartest move I've ever made since this is installed in our RV....",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160918
    },
    {
      "title": "clean and simple",
      "text": "functional and good looking. it folds up flat against the wall when not in use.",
      "rating": 4.0,
      "verified": true,
      "author": "architect tobe",
      "helpful_votes": 0,
      "publication_date": 20170728
    },
    {
      "title": "The regular mirror is great because I can extend it and not have to ...",
      "text": "WOW!!! 10X shows every hair on your face!! Not to mention every blemish! The regular mirror is great because I can extend it and not have to lean over in the sink to be able to shave.",
      "rating": 5.0,
      "verified": true,
      "author": "Harold",
      "helpful_votes": 0,
      "publication_date": 20160719
    },
    {
      "title": "5 stars",
      "text": "Item came just as I was hoping for! Love it in my bathroom!",
      "rating": 5.0,
      "verified": true,
      "author": "Molly Bell",
      "helpful_votes": 0,
      "publication_date": 20180907
    },
    {
      "title": "STRONG MAGNIFIER",
      "text": "My wife uses it daily and I have used it several times. Works very well.",
      "rating": 5.0,
      "verified": true,
      "author": "C6",
      "helpful_votes": 0,
      "publication_date": 20180615
    },
    {
      "title": "Extreme magnification!",
      "text": "Wow - not sure I really wanted to see what I look like under 10x magnification!!! But it's a great mirror!",
      "rating": 5.0,
      "verified": true,
      "author": "WineLover",
      "helpful_votes": 0,
      "publication_date": 20180804
    },
    {
      "title": "Mirror is warped, but I needed it and I ...",
      "text": "Mirror is warped, but I needed it and I am not taking it down, it can stay with the apartment when I leave.",
      "rating": 2.0,
      "verified": true,
      "author": "natampride",
      "helpful_votes": 0,
      "publication_date": 20171207
    },
    {
      "title": "Not enough mobility options",
      "text": "I didn't realize that it doesn't move up & down and I then I missed the return window (my fault), but I just want to make sure that the next person is aware of this before purchasing.",
      "rating": 1.0,
      "verified": true,
      "author": "Tiffany Smith",
      "helpful_votes": 0,
      "publication_date": 20191006
    },
    {
      "title": "Don’t like it",
      "text": "Too much of a magnifier it actually makes me sick. It distorts my face.",
      "rating": 2.0,
      "verified": true,
      "author": "charlene",
      "helpful_votes": 0,
      "publication_date": 20180830
    },
    {
      "title": "10x is a lot of magnifying power....",
      "text": "You can see a lot more than you want to see ---",
      "rating": 5.0,
      "verified": true,
      "author": "GoodCustomer",
      "helpful_votes": 0,
      "publication_date": 20190114
    },
    {
      "title": "Great product for a great price",
      "text": "Great product for a great price. You are getting a high end product for a very reasonable price. I would buy it again!!",
      "rating": 5.0,
      "verified": true,
      "author": "Mr.Nice_Guy",
      "helpful_votes": 0,
      "publication_date": 20180202
    },
    {
      "title": "1 star",
      "text": "Not sturdy at all. Not adjustable. Very Heavy for mounting on the wall.",
      "rating": 2.0,
      "verified": true,
      "author": "Angel Michael",
      "helpful_votes": 0,
      "publication_date": 20200607
    },
    {
      "title": "More is not always the right choice!",
      "text": "Magnification is really too much. I have to get right up to the mirror to see anything and because of the height I had to install the mirror, its not working for me. Will be getting one with lower magnification",
      "rating": 3.0,
      "verified": true,
      "author": "Frustrated Mom",
      "helpful_votes": 0,
      "publication_date": 20151119
    },
    {
      "title": "TOO Magnified",
      "text": "Way too much magnification. I gotta replace it. Needs maybe 4x at most.",
      "rating": 3.0,
      "verified": true,
      "author": "Sephethus",
      "helpful_votes": 0,
      "publication_date": 20180106
    },
    {
      "title": "No directions on how to install.",
      "text": "Once installed, it is great-but IS IT so hard to include directions? It comes with absolutely NO directions on how to install.",
      "rating": 3.0,
      "verified": true,
      "author": "Erin A.",
      "helpful_votes": 0,
      "publication_date": 20170820
    },
    {
      "title": "good",
      "text": "works fine. just need to get hubby to screw to wall......",
      "rating": 4.0,
      "verified": true,
      "author": "MED ED, INC.",
      "helpful_votes": 0,
      "publication_date": 20180226
    },
    {
      "title": "Very disappointed",
      "text": "The mirror will not stay in place. It rotates instead of staying in place. You have to hold the mirror in place in order to use it. Very disappointed in this product. Now I have a mirror that is useless and holes in my wall that need to be patched.",
      "rating": 1.0,
      "verified": true,
      "author": "Charlotte W",
      "helpful_votes": 0,
      "publication_date": 20190112
    },
    {
      "title": "Not So Good",
      "text": "Returned. The magnification was so great that your face was completely distorted.",
      "rating": 1.0,
      "verified": true,
      "author": "Mary Ann Hardin",
      "helpful_votes": 0,
      "publication_date": 20170628
    },
    {
      "title": "Terrible",
      "text": "The magnification side is distorted and upside down!!! Will need to send back!!",
      "rating": 1.0,
      "verified": true,
      "author": "Kathleen Brandon",
      "helpful_votes": 0,
      "publication_date": 20190526
    },
    {
      "title": "This mirror is awesome! Now I won't be going around with long ...",
      "text": "This mirror is awesome! Now I won't be going around with long chin hairs. LOL The only thing I wish it had was a light. Otherwise very happy with the swivel, the magnification and the look of it.",
      "rating": 4.0,
      "verified": true,
      "author": "Angie N.",
      "helpful_votes": 0,
      "publication_date": 20160921
    },
    {
      "title": "Pay attention to the size of the magnification...",
      "text": "The magnification is HUGE! Pay attention to the size of the magnification.",
      "rating": 5.0,
      "verified": true,
      "author": "Lulabelle",
      "helpful_votes": 0,
      "publication_date": 20180306
    },
    {
      "title": "10x mirror is not viewable",
      "text": "Oh, the 10x mirror is impossible to look into. Had to return it.",
      "rating": 2.0,
      "verified": true,
      "author": "Tony C",
      "helpful_votes": 0,
      "publication_date": 20180220
    },
    {
      "title": "It was easy to install and can be pushed out of my way.",
      "text": "It makes putting on my makeup much simpler. Especially when you wear glasses.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan DaPonte",
      "helpful_votes": 0,
      "publication_date": 20190318
    },
    {
      "title": "Five Stars",
      "text": "Very easy to install. I love the size. It works great.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171122
    },
    {
      "title": "Four Stars",
      "text": "Everything about this is perfect, but for me, turned out to be too powerful. Have to get another one.",
      "rating": 4.0,
      "verified": true,
      "author": "Paula K",
      "helpful_votes": 2,
      "publication_date": 20150926
    },
    {
      "title": "Perfect Magnification!",
      "text": "Easy to install, great magnification, even for somebody that requires glasses. Magnification is true and not blurry.",
      "rating": 5.0,
      "verified": true,
      "author": "Renee Evoy",
      "helpful_votes": 0,
      "publication_date": 20161102
    },
    {
      "title": "Arrived in perfect shape. I am pleased with this purahase",
      "text": "My wife loves it. Really helps her with her make up. Very well made. Arrived in perfect shape. I am pleased with this purahase!",
      "rating": 5.0,
      "verified": true,
      "author": "Howie T",
      "helpful_votes": 0,
      "publication_date": 20161128
    },
    {
      "title": "Wonderful mirror. Looks nice in the bathroom",
      "text": "Wonderful mirror. Looks nice in the bathroom. One side is magnified and one size is normal. Just what I needed and wanted.",
      "rating": 4.0,
      "verified": true,
      "author": "Amy",
      "helpful_votes": 0,
      "publication_date": 20170308
    },
    {
      "title": "One Star",
      "text": "Poor focal length . Required you to put your face almoct into the mirror to focus.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20161226
    },
    {
      "title": "Worth the money",
      "text": "Very easy to install and does what it is supposed to do. Would recommend to anyone looking for this type of mirror.",
      "rating": 4.0,
      "verified": true,
      "author": "Kurt Redner",
      "helpful_votes": 0,
      "publication_date": 20161026
    },
    {
      "title": "Easy up",
      "text": "Put it up and it’s good. Just wish I didn’t have to be so close for the magnification side to work.",
      "rating": 5.0,
      "verified": true,
      "author": "Christina",
      "helpful_votes": 0,
      "publication_date": 20190804
    },
    {
      "title": "Five Stars",
      "text": "Easy to install, 10xmagnification is perfect for makeup and tweezing eyebrows. Would recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "dmleggs",
      "helpful_votes": 0,
      "publication_date": 20170209
    },
    {
      "title": "Five Stars",
      "text": "Very nice product , very innovative. Thanks . AN ART !",
      "rating": 5.0,
      "verified": true,
      "author": "Blckshine",
      "helpful_votes": 0,
      "publication_date": 20170424
    },
    {
      "title": "Five Stars",
      "text": "Great product with high quality chrome finish. Easy installation. Smooth movement when adjusting the mirror.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel Brown",
      "helpful_votes": 0,
      "publication_date": 20170701
    },
    {
      "title": "My wifeloves this.",
      "text": "My wife wanted it for the bathroom remodel and loves it. Glad I got it for her.",
      "rating": 5.0,
      "verified": true,
      "author": "Rusty",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "Great Product.",
      "text": "Nice product. Easy to install. Great addition to the bathroom.",
      "rating": 5.0,
      "verified": true,
      "author": "American girl 52",
      "helpful_votes": 0,
      "publication_date": 20170228
    },
    {
      "title": "Three Stars",
      "text": "Could be a little more sturdy but haven't had any issues. Would buy again for the price",
      "rating": 3.0,
      "verified": true,
      "author": "Rustin and Joy Coulter",
      "helpful_votes": 0,
      "publication_date": 20170403
    },
    {
      "title": "Four Stars",
      "text": "Just right for my needs. Just wish I had thought about a light on it.",
      "rating": 4.0,
      "verified": true,
      "author": "Robin",
      "helpful_votes": 0,
      "publication_date": 20180607
    },
    {
      "title": "This is so wonderful for getting ready in the morning to see the ...",
      "text": "This is so wonderful for getting ready in the morning to see the back of my hair and the magnifying side for applying eyeliner and eye make up. Great product, easy install for a do it yourself-er.",
      "rating": 5.0,
      "verified": true,
      "author": "Alan",
      "helpful_votes": 0,
      "publication_date": 20170105
    },
    {
      "title": "Clearly seeing",
      "text": "Personal bathroom use as a make up mirror, great product!",
      "rating": 5.0,
      "verified": true,
      "author": "M. Katherine Ingalls",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "Rotating Mirror",
      "text": "Nice mirror, sturdy, substantial and easy to hang (comes with all you need).",
      "rating": 5.0,
      "verified": true,
      "author": "M Casey",
      "helpful_votes": 0,
      "publication_date": 20160923
    },
    {
      "title": "10x is too much magnification",
      "text": "10x is way too much magnification. Everything else is nice.",
      "rating": 3.0,
      "verified": true,
      "author": "LW",
      "helpful_votes": 0,
      "publication_date": 20170322
    },
    {
      "title": "buy a mirror with 10x magnification at a higher price ...",
      "text": "buy a mirror with 10x magnification at a higher price and I received a 7x mirror",
      "rating": 1.0,
      "verified": true,
      "author": "JUANGUZ",
      "helpful_votes": 0,
      "publication_date": 20171208
    },
    {
      "title": "Great quality!",
      "text": "It’s a very good quality mirror! I bought it to put in the camper to save counter space and it mounted just right on the wall!! Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Renee",
      "helpful_votes": 0,
      "publication_date": 20180816
    },
    {
      "title": "Three Stars",
      "text": "it does the job and is not oversized and obtrusive ... a light would be helpful",
      "rating": 3.0,
      "verified": true,
      "author": "dee",
      "helpful_votes": 0,
      "publication_date": 20160503
    },
    {
      "title": "Five Stars",
      "text": "great makeup mirror! the 10x is a little much but still a good purchase",
      "rating": 5.0,
      "verified": true,
      "author": "Maggie",
      "helpful_votes": 0,
      "publication_date": 20170315
    },
    {
      "title": "Five Stars",
      "text": "Love this mirror, this is my second... I cannot have a bathroom without one!",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa A Bates",
      "helpful_votes": 0,
      "publication_date": 20170426
    },
    {
      "title": "It is very strong magnification and it takes a bit ...",
      "text": "It is very strong magnification and it takes a bit for me to position myself to see clearly. I have a different brand and it must be 8 X's magnification. This product is a little less substantial than my old one.",
      "rating": 4.0,
      "verified": true,
      "author": "Barbara",
      "helpful_votes": 0,
      "publication_date": 20151106
    },
    {
      "title": "Works great!!!!",
      "text": "Product came just as described. Easy to mount - came with all required hardware. It works perfectly for me. Would recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171101
    },
    {
      "title": "Happy with purchase",
      "text": "Well made. Nice additional touch to my bathroom remodel. Very easy to install.",
      "rating": 4.0,
      "verified": true,
      "author": "PeterP",
      "helpful_votes": 0,
      "publication_date": 20170305
    },
    {
      "title": "Makes taking off and putting on my makeup so easy.",
      "text": "wish Ihad ordered this sooner. Makes taking off and putting on my makeup so easy.",
      "rating": 5.0,
      "verified": true,
      "author": "Diane Mcgeachy",
      "helpful_votes": 0,
      "publication_date": 20161212
    },
    {
      "title": "Three Stars",
      "text": "This mirror works well,but it is not easy to install",
      "rating": 3.0,
      "verified": true,
      "author": "Mary Brinkmann",
      "helpful_votes": 0,
      "publication_date": 20190926
    },
    {
      "title": "I cannot use this mirror. The glass is concave ...",
      "text": "I cannot use this mirror. The glass is concave and distortion is unacceptable. I have to be less than 3 inches away to see clearly so then I can only see a small part of my face at one time. The description says 100% hassle free returns but Amazon says I am too late to return this item that I bought earlier this summer. I did not install it upon receipt, too busy. Now am I stuck with it?",
      "rating": 1.0,
      "verified": true,
      "author": "Bic",
      "helpful_votes": 5,
      "publication_date": 20170829
    },
    {
      "title": "I use everyday.",
      "text": "Great mirror, came with all the hardware & mounted easily.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Meagher",
      "helpful_votes": 0,
      "publication_date": 20160927
    },
    {
      "title": "Loved It",
      "text": "I love this mirror. It was just what I expected. Delivered on time and in perfect condition.. I would recommend it to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara",
      "helpful_votes": 0,
      "publication_date": 20160921
    },
    {
      "title": "This mirror was very easy to install and well made",
      "text": "This mirror was very easy to install and well made. My wife finds it very easy to treat her eye condition.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160713
    },
    {
      "title": "Perfect!",
      "text": "This is great! I was concerned because some folks complained about the sticker being right on the glass and that you could only see the 10x if you were looking right into the center of the mirror. Both issues were not a problem, the sticker was a clear vinyl clingform sticker and the 10x side of the mirror is exactly as it should be. It has to be fairly concave to get that kind of magnification so it is best if you are very close to the mirror, but that's how it was with my last mirror and it wasn't a problem.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20151130
    },
    {
      "title": "Great.",
      "text": "Very happy with this mirror. Not distorted. Easy to install.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda Layton",
      "helpful_votes": 0,
      "publication_date": 20160704
    },
    {
      "title": "The mirror arrived exactly as described and looks very nice mounted on the wall",
      "text": "The mirror arrived exactly as described and looks very nice mounted on the wall, my only mistake was that I bought the 10x magnification which is too strong for my needs.",
      "rating": 4.0,
      "verified": true,
      "author": "Lisa (still in my 5 mile radius)",
      "helpful_votes": 0,
      "publication_date": 20160223
    },
    {
      "title": "Like the mirror",
      "text": "Like the mirror. Installed easily. Normal side as expected. Disappointed in 10x. Face has to be within 1-2 inches to be in focus",
      "rating": 3.0,
      "verified": true,
      "author": "Judy Brayton",
      "helpful_votes": 0,
      "publication_date": 20180131
    },
    {
      "title": "Right price, right product!",
      "text": "Easy to install, folds out of the way, and inexpensive.",
      "rating": 4.0,
      "verified": true,
      "author": "Paul Morrow",
      "helpful_votes": 0,
      "publication_date": 20181223
    },
    {
      "title": "One Star",
      "text": "I can’t even see myself the mirror is curved sending back",
      "rating": 1.0,
      "verified": true,
      "author": "Leigh B.",
      "helpful_votes": 0,
      "publication_date": 20180605
    },
    {
      "title": "Non",
      "text": "You can’t see anything you have to put your face in side of it so you can see",
      "rating": 1.0,
      "verified": true,
      "author": "Mike Barakat",
      "helpful_votes": 0,
      "publication_date": 20190430
    },
    {
      "title": "I love it. It literally change my life Since my ...",
      "text": "I love it. It literally change my life Since my vision got worse",
      "rating": 5.0,
      "verified": true,
      "author": "ronit meyers",
      "helpful_votes": 0,
      "publication_date": 20170424
    }
  ],
  "product_meta": {
    "title": "Excelvan Magnification 8 Inch Double-Sided Swivel Wall Mount Makeup Mirror (10X)",
    "rating": 4.5,
    "feature_bullets": [
      "Service: All Excelvan mirrors have 1 year after-sale service, 100% satisfaction and zero hassle returns promise.",
      "Dimension: Mirror with 8 inch diameter; Arm with 12 inch extension.",
      "Flexible Arm: With flexible arm, the mirror face can be adjusted to any angle for easy fog-free viewing.",
      "Double Sides: One side is a standard mirror and the other side is a magnifying mirror. Ideal for daily use.",
      "Magnification: 10x magnification to see every detail for make-up, dress-up and shaving."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "15 x 12.1 x 2.7 inches; 1.85 Pounds",
      "UPC": "708624185102 708624053623",
      "Manufacturer": "Excelvan",
      "ASIN": "B00SM4S7QK",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Tools & Accessories",
      "Mirrors",
      "Makeup Mirrors",
      "Beauty & Personal Care"
    ],
    "price": ""
  }
}