{
  "website_summaries": [
    {
      "verdict": "This streamlined scanner works well for digitizing photos and other detailed documents. Extremely affordable.",
      "pros": [
        "Setup is straightforward with this compact scanner, which can be stored upright with its built-in kickstand",
        "Uploads documents directly to cloud storage"
      ],
      "cons": [
        "If documents are aligned with the edge of the scanner, they may be clipped"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great for Geneology",
      "text": "I bought this to scan in old family photos. It is super easy to use, very lightweight, and works as well as can be expected for the price. Some might feel it is too slow, but once I got into a rhythm, it was fine. I scanned over 100 photos in an afternoon, although I didn't time myself and I took some breaks. Most of the scans are great and will work for my purpose of geneology. If you are looking for something simple, this is your model. If you are looking for super high quality scans, this is not your model.",
      "rating": 4.0,
      "verified": true,
      "author": "Darice Bales",
      "helpful_votes": 166,
      "publication_date": 20170108
    },
    {
      "title": "A premature death.",
      "text": "The scanner does a fine job of scanning photos...when it works. Had it for three days, scanned about 10-12 photos and then the poor thing gave out a death rattle and died. Was tempted to call 911 but sent it back to Amazon instead. Poor Epson quality control? In an act of unparalleled heroism, I reordered it from Amazon. I hope I won't regret that. Wish me luck.",
      "rating": 2.0,
      "verified": true,
      "author": "Arnold Seiken",
      "helpful_votes": 130,
      "publication_date": 20180107
    },
    {
      "title": "Mechanically weak: broke on first scan",
      "text": "I was so excited when i opened this. Light, simple... i had high hopes. The s/w downloaded fine from the internet, but then after one scan (which did not go well: screeech!), i got \"Check Connection\" and it hasn't moved again. just this error again and again telling me to check my connection. The scanner bar is no longer perpendicular (odd angle) which doesn't look right. i think it got stuck on the cheap ribbon inside. Based on other reviews, i think i need to try the cannon to see if the h/w is sturdier. i don't want a replacement that breaks in 1-6 months... Glad this one busted on the first try. Sending back to Amazon now.",
      "rating": 1.0,
      "verified": true,
      "author": "SF Guy",
      "helpful_votes": 21,
      "publication_date": 20180801
    },
    {
      "title": "Would not turn on right out of the box",
      "text": "I ordered this product and did not get around to unboxing it until today 8/25/18 and ironically the Amazon support window closed on 8/24/18... this product does not come with a power cord, it connects directly with a USB. It states that it is supposed to come on directly upon plugging into the computer. Mine did not. I tried it in another port, no. Then I even tried a different USB cable. No, nothing. Dead stick. So now, because my life got hectic and I didn't open it right away, I am out the $80 or whatever it cost me. Very sad to say the least. MORAL TO THE STORY...DON'T WAIT. NO MATTER WHAT.",
      "rating": 1.0,
      "verified": true,
      "author": "Michelle",
      "helpful_votes": 17,
      "publication_date": 20180825
    },
    {
      "title": "Just what I needed to scan old photos!",
      "text": "I needed a scanner that would help me scan a massive stack of old photos. After reading some reviews on this one, I decided to give it a try. I was not disappointed! It successfully recognized the edges of the photos so I can scan multiple photos at a time and it will place each into a separate file. It also seems to make some of my older photos pop a little bit more. Very pleased with this purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Don D",
      "helpful_votes": 16,
      "publication_date": 20180613
    },
    {
      "title": "Up and running in seconds. Great scanning quality.",
      "text": "I've worked with $15,000 drum scanners, and cheap-o scanners. This scanner offers tremendous value and quality for the price. Perfect if you only need to scan a few things and need decent quality while doing it. If I had to use it everyday, I'd be frustrated by the speed (its a little slow) but thats the only draw back. The quality of the scan is fast, the software is easy to use, and the price is fantastic. Very happy with this purchase. I would have no problem scanning a photo or document with this over the $15k drum scanner.",
      "rating": 5.0,
      "verified": true,
      "author": "Justin Bieber",
      "helpful_votes": 16,
      "publication_date": 20180209
    },
    {
      "title": "Fantastic for Artists that only need A4",
      "text": "This is wicked fast! I adore this scanner and I've already scanned about 20 items. It has a great system where you can have it as a full automatic mode, Home mode, office mode and professional mode. I use the professional mode, but auto-mode was quick and adjusted the images values for me no prob! I use this with a 2015 MBP Retina. I'm glad I ended up choosing this as my desktop scanner. Make sure your epson software is fully updated, though!",
      "rating": 5.0,
      "verified": true,
      "author": "Leyda F",
      "helpful_votes": 23,
      "publication_date": 20160822
    },
    {
      "title": "RETURNED",
      "text": "I received the product with great expectations but unfortunately it was not recognized by my Windows 10 machine. I tried several different resolutions: 1. Installed the software from the provided CD and updating the software from Epson - was not recognized by computer. 2. Uninstalled the software and reinstalled the software directly from Epson (ran as Administrator) - was not recognized by computer. 3. Tried different USB ports - was not recognized by computer. After two hours I just gave up and returned the scanner. If it is this difficult to try and get it working it is not worth my time or money.",
      "rating": 1.0,
      "verified": true,
      "author": "Night Rider",
      "helpful_votes": 7,
      "publication_date": 20181108
    },
    {
      "title": "Worked great with one exception!",
      "text": "Purchased to scan old family photos removed from album books. Scanned well over 300 photos saving them to my Windows PC with no problems. Color and black & white photos came out very well. I did not use Epson color correction, I used Adobe Elements to edit photos. ONE PROBLEM, I was unsuccessful scanning and directly saving to Google Photos, I kept getting a script error when trying to log into Google Photos. Was unable to solve the problem at either Epson or Google web support. I did not pursue it further, because it was not a function I really would use.",
      "rating": 4.0,
      "verified": true,
      "author": "Cushman Ken",
      "helpful_votes": 3,
      "publication_date": 20200615
    },
    {
      "title": "Stopped working after 3 hours",
      "text": "Initial setup was fine and I could scan using my desktop software, but the buttons on the unit would not work. Tried multiple recommended fixes, including uninstalling and reinstalling the software twice. Now, after a couple of hours messing with this problem, it won't power up at all. Already arranged the return, and I will get a different brand. Sure wish we could give zero stars.",
      "rating": 1.0,
      "verified": true,
      "author": "HDF",
      "helpful_votes": 6,
      "publication_date": 20190727
    },
    {
      "title": "Atrocious Software",
      "text": "I haven't bought Epson products for years. Now I remember why. I have to reboot after each scan because the program goes into an infinite loop. When I restart, I get a \"Cannot communicate with the scanner\". As a retired software developer, I cannot believe the lack of quality control by Epson. Uninstalled all software. Reinstalled only Epson Scan. Everything works fine. Left review as one star because Epson's preferred install is all of their junk software. Otherwise, I would have rated the scanner a 5.",
      "rating": 1.0,
      "verified": true,
      "author": "Dave Owens",
      "helpful_votes": 7,
      "publication_date": 20190316
    },
    {
      "title": "One Star",
      "text": "This scanner stopped working after a couple of months of light usage. Very frustrating.",
      "rating": 1.0,
      "verified": true,
      "author": "maja",
      "helpful_votes": 18,
      "publication_date": 20171029
    },
    {
      "title": "REALLY TERRIFIC",
      "text": "I use this at home to scan in years of old family photos that were deteriorating. Unlike some other who found this excessively noisy, on the contrary mine makes very little noise at all. I'm so glad I got it. It's easy to use. I save everything as a jpeg file and then perfect the images with Window 10's editing functions before posting on Facebook. I don't find it slow either, but then again, I'm home, retired, and not using this for business functions. (One little thing, I couldn't get the bar at the back to make it stand upright, but that's ok, not a deal breaker, so I still give it five stars.)",
      "rating": 5.0,
      "verified": true,
      "author": "Dale C. Fuqua",
      "helpful_votes": 4,
      "publication_date": 20190109
    },
    {
      "title": "Pain in the butt",
      "text": "The printer is good WHEN IT WORKS. it varies in compatibility with my laptop vs desktop. The error messages tell you to contact your OS company to find drivers that work. Different features and options pop up or DON'T pop up every other time it opens. Sometimes it offers adjustments to levels, sometimes not. Sometimes it doesn't scan according to the settings I chose. Still haven't been able to get it to work on my new IMac. The printer itself is decent but the issue with finding drivers to make it compatible is a pain in the butt!",
      "rating": 4.0,
      "verified": true,
      "author": "SquirrelGurl",
      "helpful_votes": 2,
      "publication_date": 20200615
    },
    {
      "title": "Junk",
      "text": "Terrible product design. Had to call technical support just to scan to pdf, and was told that was only available in \"professional mode\", not \"office mode,\" which is what I assumed it would be in. Apparently Epson feels only \"Professionals\" use pdf files. After 20 minutes of waiting agonizing minutes for this clunker to scan a 3 page document, I tried to open the saved document and got an error message. I was out of time and patience. I put it back in the box it arrived in, and clicked Amazon's \"Return\" button. At least that part of the experience worked well. Don't waste your time on this clunky piece of garbage.",
      "rating": 1.0,
      "verified": true,
      "author": "Dwight Karlsen",
      "helpful_votes": 2,
      "publication_date": 20190514
    },
    {
      "title": "My First - and LAST - Epson Purchase!!!",
      "text": "Unfortunately, I can't give this scanner less than a one-star rating!!! The ONLY thing I want it to do is to enlarge patterns. That's it: Enlarge patterns!!!!! Epson technical support tried to help me out - and what they advised did work.........until now.......after Amazon's return window has expired. I have used computers, computer software, computer accessories for years, and I can honestly say that this item is the worst of the lot!!!",
      "rating": 1.0,
      "verified": true,
      "author": "WD",
      "helpful_votes": 2,
      "publication_date": 20191116
    },
    {
      "title": "Great photo scanner for the price.",
      "text": "Great photo scanner. Easy to set up, even on Mac, easy to use and store. If you wanted super high rez, it can do it, it will just take a while to process. Bought this to digitize all the old family photo albums, and it's working great. Quite the project... You do have to leave a decent space between multiple photos on the scanner or it will read as one image, but once you figure out what that threshold is, easy to scan a number of pictures/documents simultaneously.",
      "rating": 5.0,
      "verified": true,
      "author": "Mgmt NinjaTop Contributor: Pets",
      "helpful_votes": 5,
      "publication_date": 20170305
    },
    {
      "title": "Stopped working after a few months/Stitching program is garbage",
      "text": "Update! I have taken this from three stars to one star because it just stopped working. There’s absolutely no damage and nothing wrong with it, it just won’t turn on anymore! I’m so disappointed Because we use this scanner to run our business!!!! I hope someone contacts us to fix this problem! The scanner works great, the stitching program that is included is garbage. I bought this to scan my husbands canvas paintings to make prints but the program won’t stitch them together properly. I contacted the company, they apologized and said that the disk has been discontinued. So if you don’t need the stitching program I would definitely recommend buying this scanner.",
      "rating": 1.0,
      "verified": true,
      "author": "Daniel Stormont",
      "helpful_votes": 3,
      "publication_date": 20180925
    },
    {
      "title": "Arrived Dead as a Door Nail",
      "text": "This thing arrived DOA. I'm so over it because I had to scan several documents before I leave out of town. This thing arrived with no manual, no disk, like it said it would. I think I got a refurbished piece of junk. As someone else said, I guess I'm going to Best Buy and I'm not pleased about it. I tried different charging ports and charging it from a power strip. I'm not sure who the seller is (Epson?) but I will not be buying again and I've bought many Epson printers over the years. I know you get what you pay for but I at least expected it to turn on. Don't waste your time.",
      "rating": 1.0,
      "verified": true,
      "author": "cheekymonkey",
      "helpful_votes": 0,
      "publication_date": 20190817
    },
    {
      "title": "Don't expect it to work out of the box or the first several times you use it.",
      "text": "I suspect that the printer is just unfriendly to the apple world. Very clunky software. Did not save scans to disk and I did not have access to all the screens pictured in the very sparse software. I am doing a very simple thing, sustenances scanning black and white print, no need for any higher resolution than 2-300 DPI. I could have done my scans with a pencil and paper better.It took a lot of work to get so it would tell me where the scans went. all early scans went nowhere. I have had probably 10 scanners. This was the least easy to get to work",
      "rating": 1.0,
      "verified": true,
      "author": "Mr. Big",
      "helpful_votes": 0,
      "publication_date": 20191012
    },
    {
      "title": "Easy to use",
      "text": "Doing photos from years ago. Does the job and is better quality then any other scanner I've seen. What I really like is you can scan as many photos as will fit on the scanner and separates each photo. I've done up to 5! The only problem I've had is when I first received I has some minor problems turning the scanner on. When I called Epson, the person asked me to plug into a different outlet. Could not get thru the person that the power came from the USB port!! After a few minutes power on, and from that point on came on as soon as the computer, laptop, was turned on.",
      "rating": 5.0,
      "verified": true,
      "author": "Gary Frechette",
      "helpful_votes": 4,
      "publication_date": 20170322
    },
    {
      "title": "It works - wonderfully!",
      "text": "All of my old family photos were starting to turn yellow, and disintegrate so I knew I needed to get them digital. This scanner works perfectly AND I love the color correction option. The photos appear like they once did. VERY happy!! Also - it's nice that multiple photos can be scanned individually at one time - huge time saver.",
      "rating": 5.0,
      "verified": true,
      "author": "Buckwheat",
      "helpful_votes": 3,
      "publication_date": 20200711
    },
    {
      "title": "Nice scanner. This replaces my 16 year old Epson ...",
      "text": "Nice scanner. This replaces my 16 year old Epson Perfection 1200U, which finally bit the dust. Installation is a snap. Unit is recognized by windows right away. Relatively quiet and very compact. Only problem was the included USB cable. The 3 ft cable was a tight reach for my desk setup. Fortunately Epson uses a micro USB connection. I happened to have a 6 footer handy, and it worked with no problem. Only scanned a couple of items so far, but it was easy and the results were very clear. I would recommend this to anyone looking for an inexpensive flatbed scanner.",
      "rating": 4.0,
      "verified": true,
      "author": "beergeek",
      "helpful_votes": 3,
      "publication_date": 20160621
    },
    {
      "title": "Good for price and light weight",
      "text": "I saw the bad reviews for software issues and still decided to give it a try with intentions of returning if I couldn’t get it to work. It did take patience to get everything going the first time but since then I’ve had no problems. I love how lightweight and portable it is because I often move my work station around the house. Picture quality is great and you can scan multiple things at once into separate files.",
      "rating": 4.0,
      "verified": true,
      "author": "Jennifer Boyd",
      "helpful_votes": 2,
      "publication_date": 20200719
    },
    {
      "title": "Fails Soon",
      "text": "I have now had 3 of these (2 were Epson replacements). They all worked fine at the beginning, but failed after a few weeks. Now they do nothing at all. Completely dead. I have tried them on both my Mac and PC and they are dead. The computer cannot find them. I have spent hours on the phone with Epson support on multiple occasions. They try to be helpful, but cannot solve this problem, even after sending me 2 new ones. I have given up on them after spending much money and time. Very frustrated and unhappy.",
      "rating": 1.0,
      "verified": true,
      "author": "R. Dixon",
      "helpful_votes": 0,
      "publication_date": 20190825
    },
    {
      "title": "Very glad I have this!",
      "text": "Im using this to make digital copies of all my family pictures. We have thousands of them. Let me tell you, this thing is GREAT. The pictures look better after they have been scanned and its very fast too! Look no further. This is a good scanner! P.S. I use the windows scanner app from the windows 10 app store vecause it is very simple and has everything you need and nothing more. 600dpi is the sweet spot for regular photos.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20180109
    },
    {
      "title": "Died after 1 week of use",
      "text": "When I got this little guy, I really liked it. It wasn't the fastest scanner but it was compact, provided good quality scans and best of all was reasonably priced. However, after 1 week of use (and scanning approximately ~50 4x6 photos) it just stopped working. Whenever I tried to open the software I would get an error message that my computer could no longer connect to the scanner. Tried rebooting, nothing. Tried a different cable, no dice. Even hooked it up to my mother's PC and was getting the same error.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190328
    },
    {
      "title": "NO DRIVERS ABOVE MAC OS 10.10 - WILL NOT SCAN",
      "text": "WILL NOT SCAN - [ epson software incompatible with latest Mac OS ] EPSON scanner software drivers support stops at Apple Mac 10.10 - OLDER SYSTEM OSX My System is running Apple Mac Mojave 10.14.1 WILL NOT SCAN - [ epson software incompatible with latest Mac OS ] SCANNER RETURNED",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20181205
    },
    {
      "title": "Works OK on Linux (Ubuntu), but not extremely user-friendly",
      "text": "It works on Linux natively without a windows VM, but the interface is very unintutive and you have to do some very (easy) steps in the terminal to get it working for you. Still a bit of a hassle to re-assemble multi-page docs manually, but this is what worked for me - Download drivers from here:  - Install them from the terminal (untar the archive, view the readme, follow the instructions) - Unplug and re-attach USB cable to scanner to reset connection to scanner - Scan documents one by one - Use a terminal command to concatenate multiple pages into a single document like so: $ pdfunite in-1.pdf in-2.pdf in-n.pdf out.pdf",
      "rating": 4.0,
      "verified": true,
      "author": "Spirit In The Sky",
      "helpful_votes": 0,
      "publication_date": 20190406
    },
    {
      "title": "Very Very easy to use and quick",
      "text": "I used this to digitize old family photos for a 40th wedding anniversary. You can scan multiple photos at once, and as long as there is space between them, the software will recognize the separate pictures, saving quite a bit of time with a lot less cropping and resizing. The software also can fix the the colors on old colored photos. My pics featured a wedding with baby blue and yellow. Everything looked reddish from age. The software made them look like the real colors; even skin tones and eye colors look better. I'm sure there are fancier \"better\" scanners, but for the money, this one is great. I have used it with both PC and Mac.",
      "rating": 5.0,
      "verified": true,
      "author": "Tiffany",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "Overall all a good solid choice for a dedicated scanner.",
      "text": "I sell photographs on ebay and have scanned it seems like countless thousands of photos and one scanner is heads above all else and it is Epson. This is the only scanner I know of where I can remove the Moria Effect of scanning prints, (distortion caused by scanning lithograph prints) ,which by itself alone is a reason to buy it. I like using the scanner in Professional Mode, which gives me good control of my output. All in All a good solid choice for a scanner. It's only drawback in my opinion is the lid is a bit too light and sometimes becomes separated from the scanner to easily.",
      "rating": 4.0,
      "verified": true,
      "author": "James Bass",
      "helpful_votes": 0,
      "publication_date": 20180811
    },
    {
      "title": "All the Scanner I Need",
      "text": "When my OS no longer supported drivers for my elderly scanner I switched brands for the Epson and have no regrets about the change. Whether I'm scanning to make a copy of a document, creating a single pdf file from a hard copy document (single or mult-page), or combining documents or individual pdf files into a single pdf file, I'm pleased with the results. It works slightly differently from my previous scanner, but the learning curve was quite short.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael M.",
      "helpful_votes": 0,
      "publication_date": 20190213
    },
    {
      "title": "Will replace this thing!",
      "text": "This looked like it would be a great add-on scanner, with good apps and features, but it is a source of misery now. Every time you plug it in to use, and try to do anything, you get a constant message: \"Cannot communicate with scanner\". Tried removing and reloading the software, downloading updates, changing USB ports, but always got this message. Epson tech support (by phone) talked me thru some tweaks to the settings, and then it worked. ONCE. Seems that every time you turn it on, you have to thru the same process of new hardware recognition. Too user unfriendly to keep this. Wish otherwise.",
      "rating": 2.0,
      "verified": true,
      "author": "DesignerMan",
      "helpful_votes": 0,
      "publication_date": 20200421
    },
    {
      "title": "Eh",
      "text": "Nice that it does not run photos through a curved track to scan them. It works but always seemed a little temperamental. I would have preferred a power button. If kept plugged into the computer, you always hear it power on and move to reset every time the computer wakes up. When I unplug it between uses, it sometimes has difficulty waking up. May have to unplug and try again or even restart the computer to get it to work. Serves the purpose, but I prefer our HP all-in-one.",
      "rating": 3.0,
      "verified": true,
      "author": "Larry",
      "helpful_votes": 0,
      "publication_date": 20200830
    },
    {
      "title": "Poor Quality",
      "text": "There is no power button and it's supposed to turn on automatically when connected to the computer. It failed the other day before I finished installing the software. I had to figure out for myself that it doesn't do a complete install upfront. Once I installed it, it turned on once connected. I wasn't happy with the document scans I did, it cut off the margins of the document. I went to use it today to scan another document and it won't turn on at all. I've disconnected it and connected it several times. I tried to get assistance on the website and all it did was confirm the warranty and not offer any further assistance.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190501
    },
    {
      "title": "Buttons stopped working, and tech support is useless.",
      "text": "Buttons stopped working, and Epson tech support is pretty useless in debugging. The primary function I bought this for is to convert multi-page documents to PDF format for faxing. It *may* be possible to do this through the Epson Scan utility, but it's quite difficult to navigate. They never talk about multi-page documents in any of the help system or user manual, so I'm left trying every button to see what might work. Perhaps if I wanted a color scanner for photos this would be useful. That's not my goal. As a document scanner it's a bust. 4/28/2017 Update: Epson says \"don't use this with a USB 3.0 port\". Unfortunately that's all my computer has.",
      "rating": 1.0,
      "verified": true,
      "author": "Neil in NC",
      "helpful_votes": 25,
      "publication_date": 20160925
    },
    {
      "title": "Outstanding Scanner!",
      "text": "Perfect for my occasional scanning (about once a week). Software is a little slow to process the image but it does a very good job. Everything installed and worked perfectly the first time. I like the fact that it is USB powered (no power cord to plug in on a crowded power strip). I have also used my Acrobat to scan and everything works fine. I love it because I have been slowly scanning my collection of pictures. It is absolutely great for scanning photos, color documents, receipts, etc. Outstanding scanner!",
      "rating": 5.0,
      "verified": true,
      "author": "Deno",
      "helpful_votes": 4,
      "publication_date": 20160913
    },
    {
      "title": "Worked great for 3 months, then quit, but Amazon's customer service helped",
      "text": "Worked great for almost 3 months then completely quit and wouldn't turn on. Of course, this was past the return window, so I was out the cash I paid. I contacted Amazon customer support, who saddled me through all of the troubleshooting but couldn't fix it. They then got the manufacturer's tech support on the line. It took an hour with them, but they finally diagnosed and fixed the problem. Amazon's customer support stayed on the line the entire time, then called me afterwards to make sure it was still working and that I was satisfied with the resolution. Amazon's customer service (Rose) rocked!!",
      "rating": 3.0,
      "verified": true,
      "author": "Bytelaw",
      "helpful_votes": 0,
      "publication_date": 20191105
    },
    {
      "title": "Undersized USB-Power plug",
      "text": "This scanner worked ok for a day or two, but they used a USB-B plug to both power the unit and communicate with the computer. This is the same plug my android phone uses. Super small for this scanner. It quits communicating with the computer with the slightest wiggling. And since scanners are supposed to be opened and shut for normal operation, lots of wiggling will happen, and the connection will be broken. Look for a model with a more robust connector.",
      "rating": 1.0,
      "verified": true,
      "author": "DenButler",
      "helpful_votes": 2,
      "publication_date": 20190630
    },
    {
      "title": "Epson V39 Scanner",
      "text": "Very happy with this purchase. It had much better resolution (than my all-in-one printer) to scan all my mom's old photos. The stitch feature worked ok, but not perfectly. Not sure what drives the limitation on resolution on larger items. I have a reasonable computer, with 8Gb of ram, but I always got a not enough memory message when trying to stitch at high resolution. Worked fine at lower resolutions.",
      "rating": 4.0,
      "verified": true,
      "author": "P. Fitzsimmons",
      "helpful_votes": 2,
      "publication_date": 20180704
    },
    {
      "title": "Strong and slim scanner",
      "text": "Really good scanner. I mainly use it for scanning in drawings and stuff I do on the fly, but also it is useful for whenever someone needs a PDF of a document and you don't have a printer on hand. Not too noisy, really slim, and obviously, it's an Epson, so it's very easy to set up and use. I definitely recommend this one, especially at this excellent price point.",
      "rating": 5.0,
      "verified": true,
      "author": "Kayla G",
      "helpful_votes": 2,
      "publication_date": 20190513
    },
    {
      "title": "How easily it was to use.",
      "text": "We were looking for something to scan pictures and documents that was easily to use and had a large area to scan big pictures and documents. This is the best product I have every used. The OCR software is outstanding. We scanned over 3500 pictures and documents and was very happy with the outcome. Using a thumb or an external passport is easily to use with this machine.",
      "rating": 5.0,
      "verified": true,
      "author": "Carroll L. Adams",
      "helpful_votes": 0,
      "publication_date": 20190803
    },
    {
      "title": "Great Scanner",
      "text": "This works really good. I'm using it to scan about a million photos (OK maybe not a million, but close). Its kind of slow (four star) but the picture quality is good. The on screen prompts are easy to follow. For the price, I would definitely recommend this scanner.",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 2,
      "publication_date": 20190612
    },
    {
      "title": "SCAN STITCH SOFTWARE NOT INCLUDED",
      "text": "In contrast to the inaccurate product description, ArcSoft Scan Stitch Deluxe 2 is not included. I attempted to purchase a scanner for legal size documents and included \"legal size\" when I searched for scanners. As all to frequently with Amazon's lame product search capability, the search results included many products that did not match my inquiry. The description for this scanner only stated it was \"oversized.\" So it appears that the stitching software included qualified it to be listed as a \"legal size\" scanner. So, absence of the software is a big issue.",
      "rating": 1.0,
      "verified": true,
      "author": "Reviewer Robinson",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "Heavy use, works well.",
      "text": "Have been archiving documents, sometimes for several hours at a stretch. Only once did it refuse to scan properly. I turned it off and back on, problem solved. It is quiet and scans in about 10 seconds or less. Great price. If it dies from over-use I'll buy another. Edit 9 16 2017 This cheap scanner continues to do a great job. Has several quality settings. Scans take longer with best quality. 300 DPI meets most of my needs, 10 seconds or less.",
      "rating": 5.0,
      "verified": true,
      "author": "Happy",
      "helpful_votes": 3,
      "publication_date": 20170625
    },
    {
      "title": "Nicely pleased",
      "text": "I was not expecting super picture from this little guy but my previous scanner was Epson. I have a new MacPro with Catalina and no DVD player. As usual Epson web site had everything i needed. the scanning ( doing it as I am a teacher in Remote teaching) was perfect and very clear as I needed for my students! It is a little slow, but I can take it from room to room if i needed. I can use it at school ( when we go back) and I can put it in my computer bag with my laptop and printer! very satisfied with this purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Practical",
      "helpful_votes": 0,
      "publication_date": 20200411
    },
    {
      "title": "Didn't work with Windows 10",
      "text": "I know the product description says it will work with (up to) Windows 8, but the scanner would not load the driver for Windows 10. Not the one on the disk or the one downloaded from the Epson.com site. Support was so confused that I quit after an hour. In fact, I went back to Windows 7 so my old scanner would work. Guess I still have a year.",
      "rating": 3.0,
      "verified": true,
      "author": "GHD",
      "helpful_votes": 2,
      "publication_date": 20190303
    },
    {
      "title": "Good workhorse",
      "text": "For the price, I'm pleased with it. I don't know how other people have scanned their whole photo collection in a few hours; I have been at it for over a week already, and I am scanning only a small selection. Maybe because I'm older, so have more photos. It is a bit slow, but faster than my all-in-one HP scanner. As others have mentioned, you can remove the lid, which helps with big pages. There is a selection for what type of scanning you're doing, and what format you want it in. I have not used the repair options yet, but am approaching the old photos from my in-laws ans shall try it then.",
      "rating": 4.0,
      "verified": true,
      "author": "Danielewb",
      "helpful_votes": 4,
      "publication_date": 20160628
    },
    {
      "title": "Easy to use & saves your pictures to JPG",
      "text": "This is a great scanner. It's an easy set-up and operation. I had ordered the Canon Lide 120 and it was a total hassle. It was saving my pictures to PDF & I had a real challenge getting them out of PDF to JPG. I had to download another program to accomplish this. So, that one got sent back and I ordered this one. Very pleased with it. So if you want a simple easy scanner, that saves your photo's to JPG (my pictures file) with no hassle, then this is the scanner for you.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary L. Moessinger",
      "helpful_votes": 5,
      "publication_date": 20161026
    },
    {
      "title": "If you just want to scan old photos from a shoebox, it does exactly what you want, and it does it well.",
      "text": "Bought to scan a few thousand old photos. It is perfect. Blows \"photo scan\" apps on the phone out of the water. It's fast, and does exactly what I wanted. I wish I'd figured out \"you can load up the scanner with multiple photos and it will scan them all individually\" earlier. Duh. Easiest $75 I've ever spent.",
      "rating": 5.0,
      "verified": true,
      "author": "A. M.",
      "helpful_votes": 2,
      "publication_date": 20180622
    },
    {
      "title": "Apple killed it. Parallels/Windows 10 saved it on my Mac!",
      "text": "The scanner was the editor's choice from PC Magazine for a simple photo/document scanning for both PC/Mac.. Not perfect, but quite adequate till my Apple software apparently disabled it after 6 months of flawless performance. Apple's automatic updates do that sometimes. The Epson MacOS software could not locate the scanner...DEAD. Multiple up to date machines, and different USB cables proved fruitless. In desperation, I thought, I wonder of Windows 10 running in Parallels on the very same Apple would work. Answer-YES! I had to download the windows drivers and software, which function the same as the Mac versions, only these work! Shame on you Apple,",
      "rating": 4.0,
      "verified": true,
      "author": "C. McCollough",
      "helpful_votes": 0,
      "publication_date": 20190422
    },
    {
      "title": "easy to take with you (about a large laptop size)",
      "text": "Scans well, easy to take with you (about a large laptop size), and is pretty easy to use. Would recommend if you need to scan something that can't be taken home with you. My only troubleshoot is that if it stops working on your laptop, just restart your laptop and it should work again. I think it's my drawing tablet driver messing with it, but that's not a hard fix!",
      "rating": 5.0,
      "verified": true,
      "author": "Bell Griffith",
      "helpful_votes": 2,
      "publication_date": 20170108
    },
    {
      "title": "Nice hardware, awful software",
      "text": "For years I used an Epson Perfection 1200 and I loved it until it finally died. So I wanted to replace it with another Epson. I found this and it looked like it had all the right features at a very reasonable price, but I was disappointed. The scanner works well. Images are clear and crisp. The software -- to put it bluntly -- sucks. It frequently crashes or reports that it can't find the scanner. If you buy this scanner, plan on spending some money for a third-party software driver (I use Vuescan and with it the V39 works very well. But I'm not touting them; there are probably other drivers out there).",
      "rating": 2.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 2,
      "publication_date": 20170829
    },
    {
      "title": "Nice unit",
      "text": "Wife likes it. Need I say more? Seriously, my wife is scanning old photos onto a thumb drive for storage. She says the scans are very clear and concise and there is software included that allows her to touch up the scans too. Very good for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Howard",
      "helpful_votes": 3,
      "publication_date": 20180102
    },
    {
      "title": "Scanner died an early death",
      "text": "This scanner died an early death. It had a lot of problems holding a connection through the USB port cord (kept on connecting and disconnecting repeated- when every other USB device works in that same port on my laptop with no problem). The software requires a solid /constant connection to the hardware, so it would crap out halfway through multi page scans (frustrating) or would just keep on beeping (disconnect/connected) and the software would not even open correctly (without an error). At some point I was on the phone with tech support and it magically started working again for a couple months. And then it died again. I guess I should not have high expectations for a cheap scanner.",
      "rating": 3.0,
      "verified": true,
      "author": "edb",
      "helpful_votes": 0,
      "publication_date": 20190114
    },
    {
      "title": "Mac works with slight workaround",
      "text": "I have to open image capture on my Mac first and then the software that came with the scanner works. It won’t open without first opening image capture. Other than that I don’t have any issues. It works well. It’s very hard to find a flatbed scanner that works with Mac computers.",
      "rating": 3.0,
      "verified": true,
      "author": "April T.",
      "helpful_votes": 2,
      "publication_date": 20190805
    },
    {
      "title": "Great scanner",
      "text": "Simple to use but has the ability to get in and tweak factors like jpg compression factor. Automatic works amazingly well. Put multiple pictures on flatbed, press the start button and each of the pictures are identified, and scanned correctly. Can even mix black/white and color pictures. Fast scan compared to my older canon scanner. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "JG44070",
      "helpful_votes": 0,
      "publication_date": 20190424
    },
    {
      "title": "Shipped with Spanish instructions only",
      "text": "Yes I know you can go to the internet and find the English version, but it would be nice if an item ordered in the US and shipped in the US included English instructions. The scanner is odd in the it only relies on the USB port for its power, so this took a little finagling using a Mac with OS 10.15.3. Went through website troubleshooting which did not help, finally go hooked up with Amazon/Epson support and was clued in on the unusual way to turn the system on.",
      "rating": 4.0,
      "verified": true,
      "author": "R. Sullivan",
      "helpful_votes": 0,
      "publication_date": 20200206
    },
    {
      "title": "Epson Perfection V39 Color Photo & Document Scanner",
      "text": "It is a good scanner, but... May be it is my only problem? I hope so. The problem is - the \"start\" manual, which one comes with scanner, is just a total waste! I followed this instruction few times, and all I got was just a strange window, not Epson Scanner icon, what I expected. Why? I do not understand. So, what did I do? I go to Epson website, and I got everything, what I need. If you have the same problem - just do the same.",
      "rating": 5.0,
      "verified": true,
      "author": "Igor B.",
      "helpful_votes": 0,
      "publication_date": 20200705
    },
    {
      "title": "Worked Great - Until it Didn't",
      "text": "I really liked this scanner. Only used it occasionally but it was easy to use and the images were great. And then after about six months of light use, it just stopped working. The power light would not come any more and it was dead. Basically a disposable scanner. I can't recommend this product to anyone.",
      "rating": 1.0,
      "verified": true,
      "author": "Robea",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "Better than smartphone pictures of printed pictures",
      "text": "Resolution is great. Bundled software for Mac is outdated. You can download new software from the website. However, I used default image capture within Photoshop. Nowadays, most people use their smartphones to snap a picture of printed pictures. Though you need to remove dust and scratches, a flatbed scanner offers superior results.",
      "rating": 5.0,
      "verified": true,
      "author": "Kwill",
      "helpful_votes": 0,
      "publication_date": 20191203
    },
    {
      "title": "Scan quality is good. The only major problem I encountered is that ...",
      "text": "Scan quality is good. The only major problem I encountered is that it numbers the pictures as you scan them and I can't find any way to change those numbers. Just make sure you have your pics in the correct order and everything will be fine.",
      "rating": 4.0,
      "verified": true,
      "author": "Bev Turner",
      "helpful_votes": 5,
      "publication_date": 20170206
    },
    {
      "title": "Works great!",
      "text": "We needed a scanner to get a lot of pictures digitized. I didn't want to move my MFP to my mother-in-law's house, so I purchased this scanner. It's fast, easily portable, and I really like that it separates pictures that are scanned together! A time saver!",
      "rating": 5.0,
      "verified": true,
      "author": "Donald Denny",
      "helpful_votes": 0,
      "publication_date": 20200117
    },
    {
      "title": "Buggy and hard to use, probably dead",
      "text": "I've had this scanner for less than a year, and it hardly works. The software that comes with it is badly designed, with important actions hidden behind random menus and settings. After about six months of infrequent use, it started to die -- just not turning on when I plugged it into my laptop. I could persuade it to work by messing with the cord and trying to launch it several times, but now it looks like that doesn't work anymore. It's probably dead for good.",
      "rating": 2.0,
      "verified": true,
      "author": "Danny H.",
      "helpful_votes": 0,
      "publication_date": 20190407
    },
    {
      "title": "Way too slow and not capable.",
      "text": "Not easy, takes time to learn how it operates as it is not as you would expect. The software used to clean, correct, straighten images is very limited, not very capable, and difficult to learn. Primarily, it is slow! Had I know this, this unit would not have been my choice.",
      "rating": 3.0,
      "verified": true,
      "author": "PMB",
      "helpful_votes": 0,
      "publication_date": 20200723
    },
    {
      "title": "Sure it scans slow, but the quality is great!",
      "text": "If you need a scanner this is better than just some average scanner. You can do up to like 1000 DPI on your scan. That's really good. Normal print images are like 300 DPI. I don't mind that it scans slow. This is for business use and errands and stuff where people need copies. I have yet to use it to scan a photo, i'm sure it will be great. Sure it scans slow, but I only scan like 2-3 things at a time. I am patient enough lol",
      "rating": 5.0,
      "verified": true,
      "author": "Myra",
      "helpful_votes": 0,
      "publication_date": 20191008
    },
    {
      "title": "Works very well with excellent quality",
      "text": "Very pleased. Works very well with excellent quality. On Windows 10 I had to change to run the setup file as administrator but that was no big deal. After install, I found an updated driver, downloaded and installed. I have an opportunity to travel and scan some documents in as pdf's and my trial run here at home was without flaws. This is my first LED scanner and I love there is no warm-up delay.",
      "rating": 5.0,
      "verified": true,
      "author": "Gadgetman",
      "helpful_votes": 2,
      "publication_date": 20171022
    },
    {
      "title": "Hangs Bad in Windows 10",
      "text": "When it worked, it was nice, but if you did any alternate task while scanning, the units locks and will not connect. This problem also happened randomly. Since I am out of town, and wife is not tech in nature, it took a while to find new Win10 drivers. Too bad they didn't help. Took long enough Amazon won't let it be returned. Would not recommend until manufacturer can make a usable driver. Summary, a POS.",
      "rating": 1.0,
      "verified": true,
      "author": "Farmer",
      "helpful_votes": 0,
      "publication_date": 20190328
    },
    {
      "title": "Perfect for my needs!",
      "text": "I love the Epson V39 Perfection scanner... no regrets whatsoever. It is lightweight, portable, and driven by USB, so there is no power cord to deal with. Installation went without a problem at all. During installation it tells the installer if there is a faster USB port and lists them. When I went through the testing part of installation I was very impressed with the quality of the scans. I have software that is dependent on a scanner, and when I opened the software program the scanner went through a battery of tests to configure itself for optimal quality for that program. I am very pleased with my purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Les Esch",
      "helpful_votes": 2,
      "publication_date": 20160604
    },
    {
      "title": "Quality Scanning  Device",
      "text": "Quality Device Very nice scanner; I have had several brands over the years including commercial models and this V39 is very nice to use. It is plug and play if you install the software first as instructed. Set up requires following directions in proper order but is simple to do; most people don't read instructions now days so they get into trouble and complain about product.",
      "rating": 5.0,
      "verified": true,
      "author": "Jarl MacSalt",
      "helpful_votes": 0,
      "publication_date": 20200404
    },
    {
      "title": "Works like a charm, easy to use",
      "text": "Scanning family photos to hand out to adult children. Scanner works fast, very easy to operate. No issues at all. I found the users manual online. I like that the USB connection is also the power source so I don't have to have the charger plugged into the wall, so fewer cords to deal with. It scans the pics very nicely, very clear, although I do notice a very slight change in color, the copy is a tiny bit darker, it loses some of the light effect. Otherwise it's a great scanner.",
      "rating": 5.0,
      "verified": true,
      "author": "Kerri S. Barclay",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "Lasted 13 months",
      "text": "Plugged it in today and nothing. No blue light, no scanner movement. Connected to several computers and used different USB cables. It's just dead. Bought this 13 months ago and possibly connected it to my computer 20 times and and possibly scanned 60 pages of documents. Definitely did not see serious utilization. When it worked it was a good scanner. I would not buy this again, and certainly not without a extended warranty.",
      "rating": 1.0,
      "verified": true,
      "author": "beenerd",
      "helpful_votes": 0,
      "publication_date": 20200630
    },
    {
      "title": "Easy to use - great photo quality- durable....",
      "text": "I have been scanning all my pre-digital travel photos (and I travel a lot!) - so far I've scanned about a thousand images...no problems!!! Love this little inexpensive scanner!! Easy to set up to get the quality scan you want (without needless MB's!) - and to name all your files and automatically number each image. And just one tip - don't be annoyed if the scanner doesn't wake up when you start your computer - just unplug the USB and then plug it back in. Great product!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Blukey",
      "helpful_votes": 0,
      "publication_date": 20190910
    },
    {
      "title": "Just perfect.",
      "text": "No it is not super noisy nor super slow. I don't know what the other reviewers expect. It does the job beautifully and the included software is fantastic. When you receive it, download the software first instead of using the CD. Then once the software is loaded then connect the device. It is really no more noisy than any other scanner and, depending on the resolution, no slower than any other. All the power is provided by the USB and there is no power Brick to deal with. This makes it very portable. 5 stars for the quality and the price, combined!",
      "rating": 5.0,
      "verified": true,
      "author": "Bjoerk",
      "helpful_votes": 0,
      "publication_date": 20181106
    },
    {
      "title": "Not worth it",
      "text": "Much like some other reviewers, this just did not work out for me. I unboxed it, downloaded the drivers, and tried to do a test scan. It didn't even make it that far; I got a preview with the bottom of the image dragged and unfinished, while the unit made an ungodly sound. The optic jammed at an angle, pictured, and would not work any further. Aside from the obvious point of it not working, it feels like a flimsy product. It weighs almost nothing (which in some cases could be a pro, but not here), and any moving parts felt just moments away from giving up and detatching. Needless to say, it has been returned.",
      "rating": 1.0,
      "verified": true,
      "author": "Tirza",
      "helpful_votes": 0,
      "publication_date": 20190401
    },
    {
      "title": "Not new, for sure.",
      "text": "I had to buy another one (actually the same) from another seller. What happened was that was everything ok with the box, there was an outside box e the box from Epson (the brand). Arrived with the glass broken. I did not have the option to ask for a replacement, because the price was raised right after. I just took care to not buy from the same seller. BTW the scanner is just amazing!!! I paid a little more, but totally worth it!",
      "rating": 1.0,
      "verified": true,
      "author": "Giovana G.",
      "helpful_votes": 0,
      "publication_date": 20200805
    },
    {
      "title": "Wow!  Great scanner!",
      "text": "Easy to use. Push one button on scanner to initiate scan to laptop. Perfect for genealogy research. No bigger than a laptop- fits in my laptop bag WITH my laptop. Uses power from computer - no need for wall outlet.",
      "rating": 5.0,
      "verified": true,
      "author": "Puma1966",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "Great compact scanner. It IS loud, but that's not a dealbreaker.",
      "text": "Got this as a replacement for my Canon LidoScan which no longer works with Windows 10. I've scanned a few things before and the quality is exactly as expected. I agree with other reviewers that it's very loud and gravelly sounding, but not so much that it's annoying. And if you don't want to hear it everytime your computer wakes up, just unplug it, not a big deal.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott Schiffmacher",
      "helpful_votes": 0,
      "publication_date": 20180516
    },
    {
      "title": "Color quality",
      "text": "Im an artist, and I have been trying to upload my work more often. I used this product to do so. When I uploaded my work, the color quality went down, which is disheartening. If you are using it for sketches, outlines or documents, it will work fine. But if you are putting up fully colored pencil drawings, the color will fade",
      "rating": 4.0,
      "verified": true,
      "author": "Ashley",
      "helpful_votes": 2,
      "publication_date": 20190620
    },
    {
      "title": "junk",
      "text": "in no way could one ever recommend this item. I thought I got a defective one and got a replacement. it's still just as bad. I am unsure if it's overheating or what. scan a couple of pics and it locks up and crashes.",
      "rating": 1.0,
      "verified": true,
      "author": "corey lane",
      "helpful_votes": 4,
      "publication_date": 20180715
    },
    {
      "title": "Functional",
      "text": "It is fine for my purposes and the price is reasonable. I like the feature that allows you to stitch together multiple scans of oversized source materials. The driver is OK, but I do not care for the provided application program. Instead, since the driver presents the standardized Twain interface, I prefer to use IrfanView to do scans and print them. I had hoped that the \"Copy\" button on the device would cause a page to be scanned and printed with no further interaction, but it only brings up the copy utility, which still requires you to explicitly invoke scan and then print. No win there.",
      "rating": 4.0,
      "verified": true,
      "author": "DrHow",
      "helpful_votes": 2,
      "publication_date": 20160207
    },
    {
      "title": "Terrific value for a home office flatbed scanner",
      "text": "I needed a scanner to upload numerous documents for a license application. At first I didn't think a scanner in this price range would be up to the job -- but wow! It is a great machine! I chose a flat bed scanner because I want to use it to scan many family photos in the near future. This is easy to set up, easy to use -- for an amazingly low price.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon customer",
      "helpful_votes": 0,
      "publication_date": 20190914
    },
    {
      "title": "Easy setup and good quality scans even on \"auto\" scan",
      "text": "Easy setup and good quality scans even on \"auto\" scan. Only issue: no on / off switch. Epson says unplug the cable to completely turn off the unit. I didn't want that wear on the scanner plug. My solution was to buy a Sabrent 4-Port USB 2.0 hub with individual power switches. Plugged it into the port replicator and plugged the scanner cable into it. Press the switch and activate the scanner. Works great!",
      "rating": 4.0,
      "verified": true,
      "author": "whitepass",
      "helpful_votes": 4,
      "publication_date": 20160508
    },
    {
      "title": "maybe I should have asked tech support.",
      "text": "I like most of the options but when I want to send something to my computer it sends everything to my pictures folder, sometimes I want to send things to my documents folder. my last printer/ scanner sent things to my documents. perhaps this one can if I contacts the service department but I havent tried that yet. boo for me not for you",
      "rating": 5.0,
      "verified": true,
      "author": "Roger L. Hicks",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "Won't connect",
      "text": "Was a pain to get working, would not connect to computer. Tried two different PCs. Finally got working and it worked a few times and now it will not connect again.",
      "rating": 1.0,
      "verified": true,
      "author": "Tessie Rodkewich",
      "helpful_votes": 3,
      "publication_date": 20180530
    },
    {
      "title": "Scanner hangs up a lot",
      "text": "This product continues to hang up while scanning pictures. At times I need to reset my laptop to get it back on-line. Also, the CD sent with the product was not for Windows 10, which hung up my laptop when trying to download from the CD. A note in the instructions to go to the epsom site and download the epsom software and drivers would have been nice. When it is working, the pictures are good and its easy to use. Overall, I don't recommend this product.",
      "rating": 2.0,
      "verified": true,
      "author": "Miguel",
      "helpful_votes": 0,
      "publication_date": 20200425
    },
    {
      "title": "Won't power on",
      "text": "This scanner worked really well with my old laptop but it wouldn't work with my desktop or my new laptop at all (all Mac). I read that it won't power on automatically on Macs if there's another printer registered so I made my laptop forget my printer, tried all the recommendations from the user manual and nada. I've only used it like three times so I'm pretty frustrated that I can't get it to power on at all. It was great when it worked. Maybe it works better with Windows. It was a complete waste of money for me, and as someone who hates creating unnecessary waste for the environment I find it morally upsetting as well.",
      "rating": 2.0,
      "verified": true,
      "author": "Heidi M. Rolf",
      "helpful_votes": 0,
      "publication_date": 20191208
    },
    {
      "title": "GREAT SCAN - SOUNDS LIKE DEATH",
      "text": "Wow - you guys weren't kidding! This thing sounds broken right out of the box! grinding PLASTIC gears. That said - I called Epson - they answered right away! (i know! right!?) they listened to it grinding over the phone & said it must be broken & they're sending me a new one. I just have to box up the old one & return it. It's a hassle - but I'm hoping the next one is quiet. If it is - the price is certainly right.",
      "rating": 1.0,
      "verified": true,
      "author": "kelly m condon",
      "helpful_votes": 0,
      "publication_date": 20181012
    },
    {
      "title": "DO NOT BUY, warranty is a joke",
      "text": "Do not buy this cheap scanner, get a cannon instead for the same price. It broke within 2 months, power would no longer turn on no matter what, and Epson factory warranty is a nightmare to deal with! Save yourself some time. I loved my cannon scanner, for the same price it lasted over 6 years and I gifted it to my mother before I experimented with Epson.",
      "rating": 1.0,
      "verified": true,
      "author": "Metha",
      "helpful_votes": 0,
      "publication_date": 20200820
    },
    {
      "title": "Does a great job",
      "text": "This scanner is perfect for my needs. It's slim and light so I can put it away on my bookshelf when it's not in use. It does a fantastic job scanning everything from pictures to posters and everything between. The software that it comes with does a decent job of stitching together big items like posters. It takes a lot of memory though! Definitely worth the money if you need a no-nonsense scanner.",
      "rating": 5.0,
      "verified": true,
      "author": "Il Diavolo",
      "helpful_votes": 0,
      "publication_date": 20171227
    },
    {
      "title": "Great product after difficult install",
      "text": "Once I got it to work I absolutely loved this thing!! But it took me two days to get it working with my computer and a call to tech support just happened to magically fix what I had already been doing. Highly recommend but just go ahead and call tech support if it doesn’t set up right away. Don’t struggle and almost return it thinking it’s broken like I did.",
      "rating": 4.0,
      "verified": true,
      "author": "Jade Faulkner",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "White Streaks",
      "text": "This scanner is easy to use and the results are good, especially considering the price. HOWEVER, after about 100 scans a part of the sensor strip failed and all scans in that area (near the center unfortunately) have a white streak. No response from the vendor.",
      "rating": 1.0,
      "verified": true,
      "author": "Casey Carrow",
      "helpful_votes": 0,
      "publication_date": 20200821
    },
    {
      "title": "Wow",
      "text": "Unbelievably easy to set up and use. First scan went very well. Bought this scanner because my Canon was not compatible with windows 10. This one works great.",
      "rating": 5.0,
      "verified": true,
      "author": "1966 GTO",
      "helpful_votes": 0,
      "publication_date": 20200923
    },
    {
      "title": "This is a great scanner, especially for someone who wants to preserve ...",
      "text": "This is a great scanner, especially for someone who wants to preserve and improve old photos, but who isn't a professional photographer. It's easy to use, and you can scan multiple photos at once, then edit them later. The editing process is easy too. The quality of the photos is really quite good. I would highly recommend this scanner! Good quality at a moderate price!",
      "rating": 5.0,
      "verified": true,
      "author": "Gillian Tevlin",
      "helpful_votes": 3,
      "publication_date": 20170804
    },
    {
      "title": "Great scanner but broke after 2 1/2 years.",
      "text": "Great scanner when it works. I've had it 2 1/2 years and I've had several problems. The software didn't work with MAC OS upgrades, though there was a recent Epson Scan 2 driver issued that solved that problem. Then the scanner would not power up. After evaluating Canon and HP scanners I ended up buying this Epson scanner again. A lot of reviews of the Canon and HP scanners raised concerns about working with MAC OS.",
      "rating": 4.0,
      "verified": true,
      "author": "R. Palladino",
      "helpful_votes": 0,
      "publication_date": 20191202
    },
    {
      "title": "You will need to go to the Epson site to download the software for this.",
      "text": "The install CD that comes with it is useless. Go to the Epson site, you can download the latest software. Picture and document quality is good.",
      "rating": 4.0,
      "verified": true,
      "author": "Katie's Grammy",
      "helpful_votes": 0,
      "publication_date": 20191016
    },
    {
      "title": "Lightweight, portable, easy to set up and use.",
      "text": "Super easy to use--plug and play! Small, lightweight, portable. I've only scanned a few things. On one, I was slightly surprised at the color--it looked harsher than the original, but I was scanning a note card with art on it. Sometimes a scanner fails to pick up subtle colors, or the softness and texture of the original paper just doesn't translate well in a digital format. Must explore further.",
      "rating": 4.0,
      "verified": true,
      "author": "D. K. Pritchett",
      "helpful_votes": 0,
      "publication_date": 20190720
    },
    {
      "title": "Cheap device",
      "text": "USB is the only power source for this scanner. The construction of this port is uniquely flimsy and can be described as cheap; I would go so far as to say it is designed to break by the time warranty expires. My scanner full stop would not turn on after 17 months. Besides that it works as expected. Be warned.",
      "rating": 2.0,
      "verified": true,
      "author": "LBailey",
      "helpful_votes": 0,
      "publication_date": 20191103
    },
    {
      "title": "Ease-of-use is great. Colors and sharpness are good.",
      "text": "I got this for a relative, with a premium on its being simple to operate. It delivered on that. I have an older version and was very pleased with the ease-of-use, and my older one is still running after a very long service life. The software here was (thankfully) the same familiar simple interface.",
      "rating": 5.0,
      "verified": true,
      "author": "Philo",
      "helpful_votes": 0,
      "publication_date": 20190819
    },
    {
      "title": "Not great for full-color scanning.",
      "text": "Fine for a lightweight scanner, but picture quality is lacking. I use an Epson 11000XL for work (watercolor comics), and it is incredible. BUT took a shot on this inexpensive Epson V39 since I’m not able to get to the studio now, for obvious reasons. Needless to say, I am underwhelmed with the optics on it. Often blurry scans in full-color mode. Even at 600 dpi. Fine in an emergency, but unable to really use it for professional scanning. Pros are it is very lightweight and doesn’t take up much space. It starts up immediately and doesn’t need an external power source.",
      "rating": 2.0,
      "verified": true,
      "author": "g benton",
      "helpful_votes": 0,
      "publication_date": 20200420
    }
  ],
  "product_meta": {
    "title": "Epson Perfection V39 Color Photo & Document Scanner with Scan-To-Cloud & 4800 Optical Resolution,Black",
    "description": "Style:NewThe sleek Epson Perfection V39 makes scanning, restoring and sharing photos easier than ever. Featuring 4800 dpi Optical resolution (1), the V39 delivers high-quality scans — fast. No warmup time is required. From photos to documents, This versatile performer makes everyday scanning simple. Scan to Evernote, Google Drive and other cloud services (2). Plus, scan directly to emails and PDF with easy-to-use buttons. Save space with a built-in kickstand for vertical placement. The removable lid accommodates bulky items and books. It also includes software to scan oversized prints and documents (3), restore color to faded photos, remove dust and even convert documents into editable text. 1. Optical resolution is the maximum scan resolution of the image sensor, using the definition of ISO 14473. 2. With Epson Document capture software Installed on the connected windows PC or Mac. 3. Arcsoft scan-n-stitch Deluxe is available for Windows only. 4. For convenient and reasonable recycling options, visit our official site. 5. Smart Way is an innovative partnership of the U.S. Environmental Protection Agency that reduces greenhouse gases and other air pollutants and improves fuel efficiency.",
    "rating": 4.2,
    "feature_bullets": [
      "High quality scanning for photos and documents : 4800 dpi optical resolution (1) for amazing clarity and detail",
      "Preserve priceless memories: Restore, archive and share family photos for generations to come",
      "Scan to Google Drive and other cloud services (2): Epson Document Capture Pro and Easy Photo Scan software included",
      "Convenient: Easy to use buttons for scan jobs, plus a space saving built in kickstand for vertical placement",
      "Scan over sized prints, documents and artwork : ArcSoft Scan n Stitch Deluxe 2 included (3)",
      "Restore color to faded photos: With one click, Easy Photo Fix technology makes it simple",
      "Scan books and photo albums: High rise, removable lid",
      "Remove dust from scanned photos : Advanced Digital Dust Correction",
      "Convert scanned documents into editable text: Optical Character Recognition (OCR) software included",
      "USB powered: No AC adapter required"
    ],
    "specifications": {
      "Product Dimensions": "14.4 x 9.9 x 1.5 inches",
      "Item Weight": "3.4 pounds",
      "Domestic Shipping": "Item can be shipped within U.S.",
      "International Shipping": "This item is not eligible for international shipping. Learn More",
      "ASIN": "B00SSXQ7Q2",
      "Item model number": "Perfection V39",
      "Customer Reviews": "4.2 out of 5 stars1,657 ratings4.2 out of 5 stars",
      "Best Sellers Rank": "#12,375 in Office Products",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "April 2, 2015",
      "Manufacturer": "Epson"
    },
    "categories": [
      "Office Products",
      "Scanners",
      "Electronics",
      "Scanners & Accessories",
      "Flatbed & Photo Scanners",
      "Office Electronics"
    ],
    "price": 99.99
  }
}