{
  "website_summaries": [
    {
      "verdict": "A durable, warm two-person sleeping bag designed with backpackers and bike packers in mind.",
      "pros": [
        "Survival rated to 5 degrees Fahrenheit (meaning it’s comfortable at 20 degrees and above), with synthetic insulation to ensure warmth in wet conditions",
        "Packs easily into a stuff sack",
        "And it holds up to rough multiday trips with little to no damage"
      ],
      "cons": [
        "Still heavy at  8.2 pounds, though it’s lighter than other double bags at its insulation rating"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Perfect for 30 day tandem cycling tour.",
      "text": "My wife and I took this on our 30 day tandem cycling tour down the pacific coast, Canada to Mexico. We loved it so much!!! It's study and cozy and warm. When rolling it up we learned to fold it in half not thirds, put the fatter side in first, and use the compression straps to make it shorter. Once you get into the hang of it it's pretty easy. We used this 30 nights in a row and it is still almost good as new! It is definitely a worth while investment. We are so happy to have this for camping in years to come!",
      "rating": 5.0,
      "verified": true,
      "author": "Christopher McGee",
      "helpful_votes": 59,
      "publication_date": 20150821
    },
    {
      "title": "It is pretty heavy, but I carry the sleeping bag",
      "text": "It is pretty heavy, but I carry the sleeping bag, she carries the tent! works out. We've used it as cold as -10. That kinda sucked, and we wore our socks, sweatpants, jackets etc. the mummy part of the bag froze solid from our breath too... good times...",
      "rating": 5.0,
      "verified": true,
      "author": "dennis pryor",
      "helpful_votes": 15,
      "publication_date": 20180209
    },
    {
      "title": "Hate the cold? This is the perfect bag for you!",
      "text": "One of the very few things I hate about camping is how cold it is at night. Not only is this bag made of really comfortable material but it's rated to very low temperatures. My wife and I enjoyed the bag and the closeness it provides. On several occasions we actually unzipped it a bit due to how warm we were. Very highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Sammy B",
      "helpful_votes": 8,
      "publication_date": 20180705
    },
    {
      "title": "Other than that aspect it is wonderfully toasty, comfy and everything the description tells you",
      "text": "HUUGE. So big, so bulky... but oh so warm. I kind of expected that when I ordered it but I guess I wasn't expecting it to be bigger than my pack. Other than that aspect it is wonderfully toasty, comfy and everything the description tells you. The description also tells you the size but don't be fooled, I figured I could replace two sleeping bags in a pack w/ this one but that's going to be impossible. At least with the compression sack it comes with. I plan on buying a separate nicer compression sack and trying to fit it in that and see how it goes. I will update the post if i find any success.",
      "rating": 4.0,
      "verified": true,
      "author": "dottiii",
      "helpful_votes": 16,
      "publication_date": 20151031
    },
    {
      "title": "Spacious and warm.",
      "text": "We love it! Went camping in MI for a week by Lake MI...40 degree nights were chilly, but we were warm in this. I was worried it would be small, but me, my hubs and the baby all slept in it just fine.",
      "rating": 5.0,
      "verified": true,
      "author": "A. B. Moradi",
      "helpful_votes": 6,
      "publication_date": 20180202
    },
    {
      "title": "I'm obsessed with this sleeping bag!",
      "text": "This is literally the best two person sleeping bag. I initially bought a different one and returned it because it was two thin and not very comfy. This one is perfect in post departments. AND for those who get hot feet, you can unzip at the bottom and stick those suckers out to cool on down. Really really good bag!",
      "rating": 5.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 2,
      "publication_date": 20181029
    },
    {
      "title": "verified at 28 degrees F in Southeast USA. in ...",
      "text": "verified at 28 degrees F in Southeast USA. in a tent with sleeping pad, wearing a hat I woke up in the night due to being too hot and took my hat off. it was snowing in the morning when I woke up. my wife is always cold and she said she was warm and cozy all night.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 6,
      "publication_date": 20171030
    },
    {
      "title": "Man sized sack",
      "text": "Being 6’3” and 200lbs and having a proportionate wife of 5’6” we were so happy to find the bag ample to sleep curled back to back and no problems on the length. Stuffs down small enough and only slightly heavier that ones twice the price. Toasty warm would definitely buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Some guy in Oregon",
      "helpful_votes": 6,
      "publication_date": 20171023
    },
    {
      "title": "Too short, not comfortable",
      "text": "This bag is too short for a 6'3\" individual and his 5'7\" significant other. Feels too small both width and especially height. When I tried to fit my head under the hoodie portion it felt unnatural. Also, The material feels rough on the skin. Did I mention when I try to cinch down the hoodie around our heads it hurts? It doesn't slip easily through the material and it also feels like your neck is getting bent. The middle tab doesn't help. Also, this thing is way too heavy. I guess you get what you pay for. I am returning.",
      "rating": 1.0,
      "verified": true,
      "author": "Josh Abbott",
      "helpful_votes": 0,
      "publication_date": 20200723
    },
    {
      "title": "Great sleeping bag",
      "text": "Purchased it for Fall camping, but my trip was canceled. So I've been using it for my summer trips where the temperature never fell below 60° F. So far I love this sleeping bag. It is very cozy. I does well in the summer and I don't get too overheated. If so it's very easy to just stick out a leg and cool down. It is not very lightweight, but I use it for car camping so that isn't a problem. I recommend this bag based on how comfortable and durable it is.",
      "rating": 5.0,
      "verified": true,
      "author": "Christine C",
      "helpful_votes": 0,
      "publication_date": 20200813
    },
    {
      "title": "Should've bought years ago",
      "text": "Packed it is big, really big. Even with the compression sack, huge. Sleeping in it, car camping, was great. When I was cold, my wife was hot...when I was hot, she was cold - we were easily able to adjust to our needs. It is a comfortable bag, slightly heavier than two individual mummy sacks, but definitely worth the weight. It'll take some creativity to take it when we go back country for four nights, but I think it'll be worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "FANLig",
      "helpful_votes": 0,
      "publication_date": 20190423
    },
    {
      "title": "Warm with plenty of room inside",
      "text": "We love this sleeping bag. Plenty of room for two people and my boyfriend and I are not small. It got down to 34 the first night and I had to strip down in the middle of the night because I was hot. The second night it was 28 and we were perfect. The material is soft inside. The only thing I noticed is the zipper are a little tough to zip up I had to make sure I held both side tight to pull the zipper up. I highly recommend this to anyone thinking about a double sleeping bag",
      "rating": 5.0,
      "verified": true,
      "author": "Cassi Novratil",
      "helpful_votes": 0,
      "publication_date": 20181104
    },
    {
      "title": "Great bag!",
      "text": "This sleeping bag is amazing! I ordered this for my spouse and I for the anticipated freezing temperatures on the Frio River, it was the BEST sleep I've ever gotten on a camping trip! We stayed warm all night long, super easy to zip, never snagged. Super easy to clean (kids!!) delicately. There was more than enough room inside for us (5'2 & 5'9) and it totally comfortable to adjust and move around in during the night!",
      "rating": 5.0,
      "verified": true,
      "author": "Carol B.",
      "helpful_votes": 12,
      "publication_date": 20161127
    },
    {
      "title": "Well worth the money!",
      "text": "I am very pleased with this purchase. The comfort and ease of packing is exactly what I was looking for. The material is great for camping and seems to keep all your body warmth in when used with the mummy hoods. The only thing I can say bad about this bag is that it is difficult not to get the zipper stuck when your zipping it up, not a big deal for me though.",
      "rating": 5.0,
      "verified": true,
      "author": "romero",
      "helpful_votes": 0,
      "publication_date": 20190819
    },
    {
      "title": "GREAT bag.",
      "text": "This is THE bag for us. Packs down small, light weight...we'll see how it does in zero degrees. I love the double \"hoodies\" and ability to button the top shut between sleepers. Great bag.",
      "rating": 5.0,
      "verified": true,
      "author": "MontanaKitty",
      "helpful_votes": 3,
      "publication_date": 20170802
    },
    {
      "title": "Great double sleeping bag - almost too warm!",
      "text": "We loved this sleeping bag for our trip out to Glacier and Yellowstone. It kept us (almost too) warm and was the perfect size for us. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "EH",
      "helpful_votes": 0,
      "publication_date": 20190827
    },
    {
      "title": "Zipper broke immediately.",
      "text": "Zipper broke immediately. Its sobwarm and nice i would give it five stars but now im stuck on a commercial fishing vessel for 3 minths and i cant return it with a broken zipper. I used it once before. One side the zipper just wont stay together. Its too bad because i love this bag. I should of got a better brand for ta harty situation like this. i live in Alaska. Good gear s important.",
      "rating": 1.0,
      "verified": true,
      "author": "Tree",
      "helpful_votes": 0,
      "publication_date": 20190530
    },
    {
      "title": "Warm, HEAVY, comfortable",
      "text": "It's hard to be displeased with this product when it kept us warm and next to each other on a multi day backpacking trip up a couple 14ers in early summer. The nights were high 30s and the bag was toasty. Zippers worked well, but it was difficult to get into and keep straight. Cuddling and moving around each other likely made that difficult.",
      "rating": 5.0,
      "verified": true,
      "author": "Stefano",
      "helpful_votes": 0,
      "publication_date": 20190827
    },
    {
      "title": "This is a very comfortable bag",
      "text": "I have to admit my partner an I are not large, I'm 5'7' and she is 5'5\", but we had a ton off room. I loved that there is additional \"vertical\" room for you feet, I hate it when your feet feel all compressed. The only Con is It is a bit bulky/Heavy, but I took no points off as I knew that when I brought it. But it does seems to be plenty warm, but I have only used it down to 50F so far. It is a nice material and stayed inplace all night. Great deal for the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Ken S.",
      "helpful_votes": 0,
      "publication_date": 20190923
    },
    {
      "title": "Comfortable and warm!",
      "text": "Plenty of room and super warm! I dont know why I haven't always used the 2 person sleeping bags. Life changer.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180815
    },
    {
      "title": "Warm! sharing is better than alone!",
      "text": "I bought this for a hiking trip with my girlfriend. It was perfect because we were able to share a double sleeping bag instead of each having our own, which allows us to conserve heat when it is cold outside.",
      "rating": 5.0,
      "verified": true,
      "author": "Niles Getz",
      "helpful_votes": 0,
      "publication_date": 20200819
    },
    {
      "title": "Loved it!",
      "text": "I can’t say enough about this bag. The liner is extremely comfortable, almost like a tencel sheet. The bag itself is bigger than backpacking would probably permit, but it’s with the haul. Great quality, warm, and perfect features like dual zippers for couples that can run hot and cold.",
      "rating": 5.0,
      "verified": true,
      "author": "Rob J",
      "helpful_votes": 0,
      "publication_date": 20190813
    },
    {
      "title": "Super comfortable and warm!",
      "text": "My husband and I loved sleeping in this together! We stayed really warm and comfortable the whole time. We used this on a backpacking trip in the Sawtooth Mountains. Because it's a two person sleeping bag it was a little larger and was more awkward to carry on the pack, but we made it work!",
      "rating": 5.0,
      "verified": true,
      "author": "Rosie",
      "helpful_votes": 0,
      "publication_date": 20190603
    },
    {
      "title": "Perfect for warmth",
      "text": "We love this for camping! It’s perfect for couples who cuddle and sleep well together. I would always be freezing whenever we camped but now I actually get a little too warm! Works great it is bulky and would be way too heavy for backpacking but car camping it’s perfect!",
      "rating": 5.0,
      "verified": true,
      "author": "Alexandra",
      "helpful_votes": 0,
      "publication_date": 20200413
    },
    {
      "title": "Warm and comfortable.",
      "text": "This is a wonderful sleeping bag plenty of room for myself and my husband who is 6’ 3” the only issue is that the zippers can at times get stuck. Very warm and would recommend it!",
      "rating": 4.0,
      "verified": true,
      "author": "Lindsey Tompkins ",
      "helpful_votes": 0,
      "publication_date": 20200313
    },
    {
      "title": "Teton never fails me.",
      "text": "Keeps us warm and it is made to last! I'm 6'0 and my girlfriend is 5'4\" and we feel comfortable in this.",
      "rating": 5.0,
      "verified": true,
      "author": "Sidney",
      "helpful_votes": 2,
      "publication_date": 20170401
    },
    {
      "title": "Kept us warm!",
      "text": "This was a great buy! Easily kept us warm in 35 degrees. Love how it unzips on both sides. Super comfortable-only thing I could complain about is that getting it back into the stuff sack literally took two people-and I am a master roller!",
      "rating": 5.0,
      "verified": true,
      "author": "C Johnson",
      "helpful_votes": 0,
      "publication_date": 20190603
    },
    {
      "title": "Great double wide sleeping bag",
      "text": "Great double wide sleeping bag. Very warm....and I'm always cold. Enough room that you can move around without disturbing each other, but not too roomy that it's cold. Packs compactly. Very happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "cmerg",
      "helpful_votes": 3,
      "publication_date": 20161214
    },
    {
      "title": "Comfortable and warm sleeping bag for two",
      "text": "I'm very happy with this purchase. We love the quality of this sleeping bag. We were very warm and comfortable at 40 degrees. The inside liner is soft. The only negative I can see is that it will take an act of God to get it back into the compression bag it came in.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181112
    },
    {
      "title": "Keeps the wife happy",
      "text": "Pretty good value, definitely warm enough for even my wife, who is always cold, on 20F nights out camping",
      "rating": 5.0,
      "verified": true,
      "author": "Justin",
      "helpful_votes": 0,
      "publication_date": 20200221
    },
    {
      "title": "Warm and roomy",
      "text": "This sleeping bag is extremely spacious. Plenty of room for me and my husband. It’s EXTREMELY warm too!! My only complaint is I wish it packed down smaller because it does take up quite a bit of space, as it’s so large.",
      "rating": 4.0,
      "verified": true,
      "author": "Jordan Best",
      "helpful_votes": 0,
      "publication_date": 20200521
    },
    {
      "title": "Roomy & warm",
      "text": "I'm 6'3\" 200lbs & my girlfriend & I had plenty of space, almost too much room. The plush lining was an unexpected bonus. We were in a yurt with an outside temp of about 20 degrees & we were just fine, I'm not sure it would be warm outside in 5 degrees though. It's also easy to get back into the stuff-sack. Only downside is the zipper tends to get caught on the fabric, I'm happy with this purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "Aaron",
      "helpful_votes": 0,
      "publication_date": 20180107
    },
    {
      "title": "This Sleeping bag sure kept my husband and I nice and warm on the cold windy nights when we ...",
      "text": "This Sleeping bag sure kept my husband and I nice and warm on the cold windy nights when we went hiking. It is a little heavy and sometimes a bear to get back into the bag. But I would recommend this to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Cassy Ferguson",
      "helpful_votes": 3,
      "publication_date": 20150924
    },
    {
      "title": "nice to have a double sleeping bag - packs down ...",
      "text": "nice to have a double sleeping bag - packs down to a reasonable size for car camping. interior is not too 'shiny'. very pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "Filmmonkey",
      "helpful_votes": 4,
      "publication_date": 20160120
    },
    {
      "title": "My wife and I love this sleeping bag",
      "text": "My wife and I love this sleeping bag. It is definitely for car camping though; we took it backpacking but it took up the entire main compartment of my 70L backpack. Temperatures did get below freezing though and we were both very comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian S.",
      "helpful_votes": 2,
      "publication_date": 20160604
    },
    {
      "title": "Nice but HUGE",
      "text": "Very cozy and great features. It could stand to have a vent though. But definitely NOT FOR BACKPACKING as they say it is lol here it is compared to my dog and my pack",
      "rating": 4.0,
      "verified": true,
      "author": "Michael AM",
      "helpful_votes": 0,
      "publication_date": 20191107
    },
    {
      "title": "Warm and cozy in Patagonia",
      "text": "Very comfortable and warm. My girlfriend and i brought this to Patagonia for our W trek hike, and it was perfect!! Definitely on the bulky side, but it does what it says. warm comfy!!",
      "rating": 5.0,
      "verified": true,
      "author": "Terence Zubieta",
      "helpful_votes": 0,
      "publication_date": 20190807
    },
    {
      "title": "Where’s the second person?",
      "text": "Just so you know it doesn’t come with “someone” .... so that should be put in the description",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200828
    },
    {
      "title": "I used on a boat and it was fine. Plenty of room for one",
      "text": "Works well, but a little bulky. Would not suggest for back packing. I used on a boat and it was fine. Plenty of room for one.",
      "rating": 4.0,
      "verified": true,
      "author": "Roger",
      "helpful_votes": 0,
      "publication_date": 20180502
    },
    {
      "title": "Huge!",
      "text": "Bougth this for my partner. We havent used it yet but we tried it out and couldn't believe how spacious it was. It seems really warm too! Not really ideal for trekking but we think it will be great for a motorcycle trip or car camping !",
      "rating": 5.0,
      "verified": true,
      "author": "Hannah ",
      "helpful_votes": 0,
      "publication_date": 20200517
    },
    {
      "title": "Best Double Sleeping Bag",
      "text": "Best Sleeping Bag EVER!! WE live in Colorado where it can get cold at night camping! Seriously best Sleeping Bag! Worth every penny!",
      "rating": 5.0,
      "verified": true,
      "author": "Morgan",
      "helpful_votes": 0,
      "publication_date": 20190307
    },
    {
      "title": "Super warm and soft inside",
      "text": "Fits too fat people comfortably. Has a little pocket thing for your wallet. At least mine did.",
      "rating": 5.0,
      "verified": true,
      "author": "Christophe Horn",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "Good quality. Used for 1 week",
      "text": "Good quality. Used for 1 week. Temp down to 25F one night. Stayed pretty warm. Does not pack quite as small as advertised.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20161019
    },
    {
      "title": "Great bag! My husband got a little claustrophobic though",
      "text": "We took this bag camping at the south rim of the grand canyon. It got down to 28 degrees with snow and wind. This was so warm!!!!! I was sweating... Great bag! My husband got a little claustrophobic though.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20160417
    },
    {
      "title": "Love it!",
      "text": "Was worried it would be crowded for two people, but it's not. We love it! Material is really soft and nice!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20161114
    },
    {
      "title": "Worked like a champ! But packs quite large.",
      "text": "This thing is so comfy! My wife and dog and I used it for camping in some below freezing weather the other day and it was super spacious and warm. Great buy! Only downside... It doesn't pack small at all...",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 6,
      "publication_date": 20151115
    },
    {
      "title": "Comfy for two",
      "text": "I am 6' 210lbs my wife is 5'7\" 140lbs and this bag is omfy for two and just the right temp!",
      "rating": 5.0,
      "verified": true,
      "author": "K. Moger",
      "helpful_votes": 2,
      "publication_date": 20160712
    },
    {
      "title": "There is nothing I don't love about it",
      "text": "Warm and cozy, roomy, soft and light-weight. There is nothing I don't love about it.",
      "rating": 5.0,
      "verified": true,
      "author": "Soma Bhargo",
      "helpful_votes": 2,
      "publication_date": 20171223
    },
    {
      "title": "Very warm",
      "text": "Great for both indoor and outdoor camping. It provides great warmth. Very lightweight and portable. I love the texture and sturdy ness.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200829
    },
    {
      "title": "The most comfortable, roomy",
      "text": "The most comfortable, roomy, and easily accessible double bag we have used, my wife and I love it as it allows us to go camping when before it was too cold.",
      "rating": 5.0,
      "verified": true,
      "author": "David Beddard",
      "helpful_votes": 0,
      "publication_date": 20160225
    },
    {
      "title": "Overall, a solid product",
      "text": "Great for warmth and comfort. It can be tough to get back in the carrying bag, and then to subsequently stuff into a backpacking pack, but manageable nonetheless.",
      "rating": 4.0,
      "verified": true,
      "author": "Nick S.",
      "helpful_votes": 0,
      "publication_date": 20180829
    },
    {
      "title": "snuggy",
      "text": "This thing rocks. Only bad part is the Velcro by you head gets stuck in your hair if you don't stick together prior.",
      "rating": 5.0,
      "verified": true,
      "author": "Kiilsgaard",
      "helpful_votes": 3,
      "publication_date": 20150812
    },
    {
      "title": "Just what we needed.",
      "text": "Needed something for the two of us, and this is the best thing for couples. Can't wait to use it in the Southern Rockies.",
      "rating": 5.0,
      "verified": true,
      "author": "The Machine",
      "helpful_votes": 2,
      "publication_date": 20150312
    },
    {
      "title": "Perfect for the V-berth",
      "text": "Very nice in the v-berth of our 28' sailboat. Very soft and light but plenty warm enough for nights out on the water.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Ullrich",
      "helpful_votes": 2,
      "publication_date": 20150628
    },
    {
      "title": "Good in moist environments",
      "text": "The exterior is water repellent and works great at keeping you dry. I woke every morning with a thick layer of frost on the bag but never worried about getting wet.",
      "rating": 5.0,
      "verified": true,
      "author": "Cheyenne",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "Great product, keeps us very warm, great size for two.",
      "text": "The stuff sack is just the right size and the advertised dimensions are tighter than I could get mine...However, I was very pleased that it includes the stuff sack!",
      "rating": 4.0,
      "verified": true,
      "author": "Kasey Pearce",
      "helpful_votes": 0,
      "publication_date": 20180801
    },
    {
      "title": "Great bag!",
      "text": "What a nice bag! I'm 6'2\" and a bit chlosterphobic but this bag has plenty of room for my girl and to sleep comfortably! High quality zippers and material and is very soft!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160324
    },
    {
      "title": "It is very comfortable. It is bigger than it needs to be",
      "text": "It is very comfortable. It is bigger than it needs to be. I would have liked it if it was smaller and lighter. It keeps you warm though. My wife and I are not small people and we had waaaay more room than we needed.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161003
    },
    {
      "title": "Four Stars",
      "text": "This fits two well. It is a bit warm for summer camping.",
      "rating": 4.0,
      "verified": true,
      "author": "Jason",
      "helpful_votes": 0,
      "publication_date": 20160521
    },
    {
      "title": "Warm but zipper needs to be updated",
      "text": "It keeps you warm, the only thing is the zipper sucks.",
      "rating": 3.0,
      "verified": true,
      "author": "Travis Mathes",
      "helpful_votes": 0,
      "publication_date": 20200221
    },
    {
      "title": "hard to put away",
      "text": "I have not been camping yet with the family but I always have to take things out and try them in the house first. What I did notice is that it is very big for me and my husband but we aren't big people. The zipper did get stuck on me one time so take your time using the zipper. I think it will do the job of keeping us warm at night we will be going camping soon so I will know better then. The biggest problem is getting it back in the bag it took my husband and myself 5 times to get it back in.",
      "rating": 4.0,
      "verified": true,
      "author": "Melissa",
      "helpful_votes": 0,
      "publication_date": 20160523
    },
    {
      "title": "For warm weather it would be great I liked the fact it had double zippers and ...",
      "text": "I used this once for car camping in weather that got down to 35 degrees. We were both cold all night long and my girlfriend is a very warm person. I returned it for a warmer bag. For warm weather it would be great I liked the fact it had double zippers and it was roomy and comfortable. But at best this is a 2 season bag.",
      "rating": 3.0,
      "verified": true,
      "author": "Douglas D. Ellis",
      "helpful_votes": 3,
      "publication_date": 20160509
    },
    {
      "title": "Works but too large for backpacking",
      "text": "It does its job and all, but it cannot fit into any backpack I own. The pack size is just entirely too large. If you are planning on backpacking with this sleeping bag, I would recommend getting two individual bags that zip together instead.",
      "rating": 3.0,
      "verified": true,
      "author": "Cameron Paulk",
      "helpful_votes": 3,
      "publication_date": 20170324
    },
    {
      "title": "highly recommended",
      "text": "I was skeptical about the two person sleeping bag. Now I love it. It is really warm and lots of room. My husband is a tall man with lots of muscle and we still had lots of wiggle room.",
      "rating": 5.0,
      "verified": true,
      "author": "Honesty-counts",
      "helpful_votes": 6,
      "publication_date": 20150731
    },
    {
      "title": "Not meant for long hikes",
      "text": "Sleeping bag is extremely warm and nice quality. We ended up returning it because it wasn't what we were looking for. It's super heavy so don't expect this for multi-day hikes. Maybe sleeping in the back yard or something.",
      "rating": 4.0,
      "verified": true,
      "author": "Heath A Tuma",
      "helpful_votes": 4,
      "publication_date": 20160529
    },
    {
      "title": "and seems that it will be warm ( appears have good quality materials but I haven't used it camping yet)",
      "text": "This thing is very large, and seems that it will be warm ( appears have good quality materials but I haven't used it camping yet). If you were wanting to hike with it/carry it long distance then despite it being fairly light weight it is difficult to pack down and fit into a backpack - great for everything else!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Justin and Kara Reed",
      "helpful_votes": 0,
      "publication_date": 20170122
    },
    {
      "title": "Great sleeping bag for 2",
      "text": "Great sleeping bag for 2. Took in to mammoth for tent camping in march. Temp got down to low 20s and this bag kept my girlfriend and i really warm. Its really wide so there are plenty of room if you like to move a lot. Like other purchasers said, the dual zippers is really handy. The extra materials in the foot box kept our feet warm. Its kinda heavy and big though. Wouldnt recommend if you want to back pack camping.",
      "rating": 5.0,
      "verified": true,
      "author": "Ly Nguyen",
      "helpful_votes": 0,
      "publication_date": 20170512
    },
    {
      "title": "decent bag but i found it too loose and not ...",
      "text": "decent bag but i found it too loose and not packed enough that cold air was getting in..i also find it slightly heavy and its definitely not a +5F sleeping bag.",
      "rating": 3.0,
      "verified": true,
      "author": "Sankar Nair",
      "helpful_votes": 3,
      "publication_date": 20150603
    },
    {
      "title": "Great product",
      "text": "This is a great deal for the price if you think about it you can sleep with your significant other or fold it and use half under for a matress. It's kinda bulky but manageable comes with compression sack.",
      "rating": 5.0,
      "verified": true,
      "author": "Ja Ja",
      "helpful_votes": 0,
      "publication_date": 20160226
    },
    {
      "title": "Romantic, warm, and cozy!",
      "text": "Super awesome and warm, put it on our bed to test it, we left it there for a few days it was so comfy!",
      "rating": 5.0,
      "verified": true,
      "author": "Matt",
      "helpful_votes": 0,
      "publication_date": 20161012
    },
    {
      "title": "Four Stars",
      "text": "Haven't put it through its full paces yet. Seems well constructed and is light weight.",
      "rating": 4.0,
      "verified": true,
      "author": "Steven N.",
      "helpful_votes": 0,
      "publication_date": 20160710
    },
    {
      "title": "Five Stars",
      "text": "Super sweet bag that my husband and I can stay warm in together",
      "rating": 5.0,
      "verified": true,
      "author": "Amber Lee Lusk",
      "helpful_votes": 0,
      "publication_date": 20170121
    },
    {
      "title": "Three Stars",
      "text": "It's not bad. But I'm buying another one coz I need something warmer than that.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20151130
    },
    {
      "title": "BUGS",
      "text": "Very excited to get this bag and upon opening I found bugs crawling inside the bag. Appeared to be bed bugs but once I saw a few I quickly repacked the bag and sealed the box. I will not purchase anything from Teton ever again. Should have bought locally like I usually do. Disgusting.",
      "rating": 1.0,
      "verified": true,
      "author": "Susan",
      "helpful_votes": 2,
      "publication_date": 20170415
    },
    {
      "title": "Smelly bag",
      "text": "Very disipointed It smelled very bad and felt very cheap in the materials used to make it",
      "rating": 1.0,
      "verified": true,
      "author": "austin",
      "helpful_votes": 2,
      "publication_date": 20160311
    },
    {
      "title": "Comfortable!",
      "text": "My boyfriend is basically a heater when he sleeps, but this sleeping bag manages to make both of us a comfortable temperature on cooler nights. We got a cheap, light blanket for warmer nights, but we are both impressed with how roomy and cozy this bag is. We don't have any problems repacking it, and for how big it is, it is fairly lightweight. Still pretty heavy if you're backpacking or something though. Definitely worth the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Allison Canaday",
      "helpful_votes": 0,
      "publication_date": 20190826
    }
  ],
  "product_meta": {
    "title": "TETON Sports Tracker Ultralight Double Sleeping Bag; Lightweight Backpacking Sleeping Bag for Hiking and Camping Outdoors; Compression Sack Included; Never Roll Your Sleeping Bag Again",
    "description": "When you wait all week to go hiking into the unknown with that special someone by your side, you need a double bag that is comfortable, lightweight, and ready for the adventure. The TETON Sports Tracker +5°F/-15C Double-Wide Mummy Bag is lined with PolarLite insulation that keeps both of you warm even though the entire bag is thin and light. The 3-piece hoods pull in perfectly around the face. Bag includes body mapping to keep you warm in all the right places (especially your feet) and has a vaulted foot-boxes for comfort. Thermal enhancing, double-layer construction works with full-length zipper draft tubes to eliminate cold spots. Zippers inside and outside of bag are anti-snag to make closure easy. Includes its own compression sack for easy transport.",
    "rating": 4.4,
    "feature_bullets": [
      "WARM AND COMFORTABLE: Mummy hoods are designed specifically to eliminate the gaps to keep the warmth in around your head and face; Zipper draft tubes and added insulation in the vaulted footboxes provide much needed comfort and warmth",
      "NEVER ROLL YOUR SLEEPING BAG AGAIN: TETON provides a great compression sack for stuffing your sleeping bag; Start at the bottom and stuff the bag in, then tighten the heavy-duty straps",
      "LIGHTWEIGHT AND LOFTY: Lightweight for backpacking, hiking, and other outdoor activities; Innovative microfiber insulation offers more loft and first-rate compressibility without sacrificing quality or comfort",
      "SLEEP WARM: Fluff your sleeping bag and use a camp pad to sleep warmer; Hang loops for long-term storage to maintain maximum loft",
      "TETON SPORTS PROMISE: Reach out to our AMAZING product support team if you have any questions or concerns; YOU CAN COUNT ON US to get you taken care of and back OUTDOORS with TETON Sports"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "86.5 x 63 x 4 inches; 8.2 Pounds",
      "Item model number": "1109",
      "Department": "Unisex-adult",
      "Date First Available": "January 23, 2015",
      "Manufacturer": "Teton Sports",
      "ASIN": "B00SWE08BW",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Outdoor Recreation",
      "Sleeping Bags",
      "Sports & Outdoors",
      "Sleeping Bags & Camp Bedding",
      "Camping & Hiking"
    ],
    "price": 107.83
  }
}