{
  "website_summaries": [
    {
      "verdict": "While it's a good alternative for consumers who are trying to cut back on simple carbs, the flavor and texture is unique.",
      "pros": [
        "Offers healthful benefits due to the wholesome recipe – organic edamame pasta packed with protein and fiber",
        "Gluten-free and fairly low in carbs"
      ],
      "cons": [
        "Though it has earned praise for the flavor, it's not exactly like typical pasta",
        "Texture is firmer than most pastas cooked al dente – has been described as rubbery",
        "Pricey"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "The Best!",
      "text": "The best!!! Once you go Edamame you won't go back to carb heavy noodle pasta. This stuff is so good that my grandchildren will consume mass amounts of it and beg for more...and they hate veggies! First purchased at Costco and they no longer had it...desperate I located on Amazon and ordered two boxes. You need to know one box goes a long way and once I overcame my anxiety of not finding it I gave the other box to my grandchildren. I hope they still will come over.",
      "rating": 5.0,
      "verified": true,
      "author": "Frank G.",
      "helpful_votes": 16,
      "publication_date": 20160330
    },
    {
      "title": "Great stuff, 50% cheaper at Costco",
      "text": "These are awesome noodles and perfect for anyone looking to get more protein into their diet. They have nothing but edamame in them so of course the texture is not going to be the same as regular noodles. They're more like the whole-wheat noodles that are a little gummy and dense. Cook them for like 5 minutes tops. I like to mix it with store-bought pesto from TJ's. Makes a good quick healthy lunch.",
      "rating": 4.0,
      "verified": true,
      "author": "A. K-C",
      "helpful_votes": 7,
      "publication_date": 20160826
    },
    {
      "title": "Absolutely love this spaghetti",
      "text": "Absolutely love this spaghetti! Tossed it with olive oil, garlic and ginger once. Tossed it with olive oil, garlic, onions, ginger and broccoli once. I love it hot or cold. Next time I'm making a spaghetti salad with tomatoes, onions, black olives and bell peppers. I like the taste and texture of the spaghetti. I am a vegetarian so very happy to find food that has so much protein! Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "New user",
      "helpful_votes": 8,
      "publication_date": 20160204
    },
    {
      "title": "Diabetic substitute",
      "text": "Great stuff if your diabetic and love pasta, it don't taste quite like spaghetti, but it is an acceptable alternative to spiking your blood sugar. Sometimes in life we have to accept that we are not getting the real thing in order to stay healthy.",
      "rating": 5.0,
      "verified": true,
      "author": "wewally",
      "helpful_votes": 4,
      "publication_date": 20170708
    },
    {
      "title": "We love this pasta",
      "text": "We love this pasta!!!! Instead of eating white flour pasta with low nutritional value, we can now eat edamame (soy bean) pasta with incredible amounts of protein in it. The taste is sort of 'green' but not bad. At first we served it with a pesto sauce, which is a perfect taste combination. Now we use it all the time and are glad to have found this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Patricia Thorp",
      "helpful_votes": 2,
      "publication_date": 20160830
    },
    {
      "title": "and the best supporting dish Oscar goes to ...",
      "text": "YUP YUP YUP! This stuff is gold. Periodically they have it at Costco and I'll stock up (same for Quinoa penne), but in the luls I can't wait and come on over to Amazon to pick up a few boxes. It's so good you can nearly eat it with just a bit of Olive Oil only.",
      "rating": 5.0,
      "verified": true,
      "author": "Sara & Mike",
      "helpful_votes": 3,
      "publication_date": 20160604
    },
    {
      "title": "Noodle On without the worry...",
      "text": "We originally found these noodles at Costco (only once as they were there for a limited time). So we looked and found them on Amazon. These are great for replacing high carb pastas with something much more healthy. The taste is great for many styles of pasta dishes from Italian to Asian to whatever concoction you can do with regular noodles. So noodle on with these great tasting noodles made from organic soy beans (gluten free).",
      "rating": 4.0,
      "verified": true,
      "author": "DWalls",
      "helpful_votes": 2,
      "publication_date": 20160518
    },
    {
      "title": "good taste & texture.",
      "text": "great substitute for white pasta if you are going paleo. 180 calories/ 20 g carbs of which 13g fiber/ 24 g protein/ sugar 3 g/ no salt. It is NOT pasta. make no mistake, but it does the trick w/ a little marinara or oil/parm/pesto/garlic",
      "rating": 4.0,
      "verified": true,
      "author": "Cara K.",
      "helpful_votes": 0,
      "publication_date": 20190306
    },
    {
      "title": "... stuffs im not supposed to eat) this is a pretty great sub",
      "text": "kinda strange texture and they cook very fast -but with a little seasoning not that much different than regular pasta (which due to medical stuffs im not supposed to eat) this is a pretty great sub.",
      "rating": 4.0,
      "verified": true,
      "author": "Lilly Marie",
      "helpful_votes": 6,
      "publication_date": 20151215
    },
    {
      "title": "I love this Edamame spaghetti",
      "text": "I love this Edamame spaghetti. We eat this regularly as a replacement for pasta. It is tasty and we also like the texture. We usually mix it with Alfredo sauce. It isn't as good with tomato sauces.",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda R.",
      "helpful_votes": 2,
      "publication_date": 20170319
    },
    {
      "title": "This is a good and healthier alternative for pasta",
      "text": "This is a good and healthier alternative for pasta. I think these noodles go well with green (pesto) sauce. I cooked them as directed, but mine came out a little mushy. They do leave a bit of an after taste as well so if you are expecting pasta-like taste you may be a bit disappointed. I personally like the flavor and it's a great alternative to pasta.",
      "rating": 4.0,
      "verified": true,
      "author": "Juliette K.",
      "helpful_votes": 0,
      "publication_date": 20160605
    },
    {
      "title": "Close Enough to Traditional Pasta",
      "text": "Great alternative to pasta, I pair it with a veggie meat substitute so I can pretend I am eating traditional pasta with meat sauce. The illusion is not quite perfect but close enough for my better health. I am bummed my local Costco stopped selling it but I am happy I can still get it from Amazon.",
      "rating": 5.0,
      "verified": true,
      "author": "A Gamer at Heart",
      "helpful_votes": 0,
      "publication_date": 20160911
    },
    {
      "title": "I did not get what was pictured. Received a ...",
      "text": "I did not get what was pictured. Received a different brand, Made in China, with more carbs than what is pictured.",
      "rating": 2.0,
      "verified": true,
      "author": "Tim Sheehan",
      "helpful_votes": 6,
      "publication_date": 20170710
    },
    {
      "title": "Great noodles, and a fair price",
      "text": "Love it. Don't have to have tons of shipments sent to my house. Tastes great, high fiber, high protein, high in vitamins and nutrients. I like the slightly tougher texture. Reminds me of Al Dente. Can cook longer and soften the texture probably.",
      "rating": 5.0,
      "verified": true,
      "author": "DJ",
      "helpful_votes": 0,
      "publication_date": 20171106
    },
    {
      "title": "Yummy deliciousness",
      "text": "We LOVE this pasta! My gluten intolerant daughter can eat it, us old people with no metabolism can eat it as its full of protein! We mix it with pesto and tomatoes for a quick, easy dinner. I used to get it at Costco, but they stopped carrying it. I was thrilled to find it on Amazon!! I always buy two - one for my brother and his wife, too!",
      "rating": 5.0,
      "verified": true,
      "author": "Maryellen H",
      "helpful_votes": 0,
      "publication_date": 20160810
    },
    {
      "title": "How can something so healthy be so delicious??",
      "text": "Super tasty! Wish it was a little cheaper, but still decently priced!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200221
    },
    {
      "title": "i like mixing them with pesto/ various sauces",
      "text": "the taste is meh and these are a bit pricy but these have so much protein and fiber ! i like mixing them with pesto/ various sauces. A little goes a long way",
      "rating": 4.0,
      "verified": true,
      "author": "Miranda",
      "helpful_votes": 0,
      "publication_date": 20170603
    },
    {
      "title": "Yummy",
      "text": "Very tasty and very healthy. Even converted my boyfriend who is a pasta addict!!",
      "rating": 5.0,
      "verified": true,
      "author": "A. Matz",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "Yum!",
      "text": "I never thought I would enjoy these Edamame Noodles as much as I do. They really are delicious! I am very pleased with the consistency of them. They cook quickly and are great with all sorts of sauces and dishes. I do wish that the price was a bit more competitive, as I think they are very overpriced here.",
      "rating": 4.0,
      "verified": true,
      "author": "Melanie M.",
      "helpful_votes": 0,
      "publication_date": 20161022
    },
    {
      "title": "Wholesome tasting pasta without the carb load",
      "text": "Really enjoy this pasta-- nice savory flavor, slightly chewy texture, and low carb. I think it has more character than regular wheat-based pasta. A bit on the expensive side, so be on the lookout for good deals. The pricing seems to fluctuate between $14 and $19, depending on God knows what.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael F",
      "helpful_votes": 0,
      "publication_date": 20161108
    },
    {
      "title": "Taste but needs your full attention.",
      "text": "Tastes good but needs you attention as it cooks very quickly, very quickly. Do not expect it to take more than 60-90 seconds to cook if the water to product ratio is correct.",
      "rating": 4.0,
      "verified": true,
      "author": "Ken",
      "helpful_votes": 0,
      "publication_date": 20161006
    },
    {
      "title": "Delicious, good for you",
      "text": "Delicious. Hardly distinguishable from regular pasta, but SO good for you. Immediate repurchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Kate",
      "helpful_votes": 0,
      "publication_date": 20180128
    },
    {
      "title": "Great product",
      "text": "Love them, looooove them! They taste like pasta with a bit of seasoning. Easy to cook!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181009
    },
    {
      "title": "great for paleo or just watching carb intake",
      "text": "Love this stuff!! Its a bit more chewy than traditional pasta but with sauce and veggies/meat it tastes great. Great for paleo diet.",
      "rating": 5.0,
      "verified": true,
      "author": "Meredith Samson",
      "helpful_votes": 0,
      "publication_date": 20171126
    },
    {
      "title": "Yuck!",
      "text": "Really very disappointed. I didn’t expect it to really make me forget wheat pasta but I bought it based on glowing reviews that it tasted great. So not true. And, cooked according to directions and it was a sticky lump.",
      "rating": 2.0,
      "verified": true,
      "author": "caps",
      "helpful_votes": 0,
      "publication_date": 20180114
    },
    {
      "title": "Yum",
      "text": "So much better then I thought they be. Actually solves my craving for pasta",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170809
    },
    {
      "title": "BEST AND MOST HEALTHY SPAGHETTI EVER!",
      "text": "MY WHOLE FAMILY USES THIS WONDERFUL VERY THIN EDAMAME SPAGHETTI IN EVERYTHING ...LOW CALORIE...AND SINCE I STARTED USING IT, I HAVE LOST 15 POUNDS.",
      "rating": 5.0,
      "verified": true,
      "author": "Marilyn Erickson",
      "helpful_votes": 0,
      "publication_date": 20160927
    },
    {
      "title": "I've bought this 2 times before and loved it. This box was different",
      "text": "I've bought this 2 times before and loved it. This box was different.. the spaghetti was much thinner. It broke into tiny pieces just getting it out of box, and it cooked to mush using the recommended cooking time. If the pasta was thicker, I'd order it would be OK- but this box was horrible.",
      "rating": 2.0,
      "verified": true,
      "author": "Richard Bieu",
      "helpful_votes": 0,
      "publication_date": 20170118
    },
    {
      "title": "UHGG BUT THIS STUFF IS THE BOMB IM A ITALIAN AND NO PASTA IS A KILL WORD FOR ME BUT THIS IS SOOOO CLOSE I DONT MIND IT I LIKE TH",
      "text": "I'VE BEEN ON A DIET ..UHGG BUT THIS STUFF IS THE BOMB IM A ITALIAN AND NO PASTA IS A KILL WORD FOR ME BUT THIS IS SOOOO CLOSE I DONT MIND IT I LIKE THE TASTE OF MY SAUCE. GO FOR IT YOU WILL BEE AMAZED.",
      "rating": 5.0,
      "verified": true,
      "author": "tman",
      "helpful_votes": 0,
      "publication_date": 20160315
    },
    {
      "title": "Best Spaghetti Ever",
      "text": "This is the best spaghetti ever!!! For a Gluten Free gal who has spent too many years eating Italian pasta, I am purring and in heaven!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Caroline G. Muir",
      "helpful_votes": 2,
      "publication_date": 20160806
    },
    {
      "title": "Very Tasty",
      "text": "While it doesn't taste like traditional pasta, it is very delicious. I wish it was cheaper. However, it's easy to cook and even my husband enjoys it and I get to enjoy spaghetti again.",
      "rating": 4.0,
      "verified": true,
      "author": "Anne S.",
      "helpful_votes": 0,
      "publication_date": 20170726
    },
    {
      "title": "love love love this stuff",
      "text": "love love love this stuff!!! it's dense, filling, and has a great taste. it may not be angel hair pasta, but for the nutrient food value vs enriched white flour/carbs, it's no contest",
      "rating": 5.0,
      "verified": true,
      "author": "Bret",
      "helpful_votes": 0,
      "publication_date": 20170512
    },
    {
      "title": "This spaghetti is pretty good for not pasta",
      "text": "This spaghetti is pretty good for not pasta. You do have to dress it up with some sauce or pesto. Alone, it's not all that great, but when you do want pasta and don't want the carbs this is the spaghetti to use.",
      "rating": 4.0,
      "verified": true,
      "author": "Tee",
      "helpful_votes": 0,
      "publication_date": 20160603
    },
    {
      "title": "Tasty",
      "text": "I love this stuff. I use to get it at Costco but they quit carrying it. Very filling and a healthy pasta alternative. Tastes great.",
      "rating": 5.0,
      "verified": true,
      "author": "Michele Cianfrani",
      "helpful_votes": 0,
      "publication_date": 20170109
    },
    {
      "title": "And it's good for them",
      "text": "My whole family loves the edamame spaghetti!!! And it's good for them, too, so good all around! 😃",
      "rating": 5.0,
      "verified": true,
      "author": "kbow",
      "helpful_votes": 0,
      "publication_date": 20160228
    },
    {
      "title": "Five Stars",
      "text": "This is great, 4 min in boiling water, drain and serve with your favorite sauce.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Mao",
      "helpful_votes": 0,
      "publication_date": 20161216
    },
    {
      "title": "Healthy, Tasty and Great Price",
      "text": "A great way to eat a healthy, tasty and vegan meal which like pasta you can easily adapt to create different meals to your palette, at an excellent price!",
      "rating": 5.0,
      "verified": true,
      "author": "Charles Thompson",
      "helpful_votes": 0,
      "publication_date": 20160702
    },
    {
      "title": "Great product",
      "text": "I love the product. We have bought it at Costco for $6.49, but they no longer carry it in Wharton NJ. I have seen it offered by the case, and would like to purchase it that way. Is it still available by the case?",
      "rating": 5.0,
      "verified": true,
      "author": "Gabriela Buis",
      "helpful_votes": 0,
      "publication_date": 20161120
    },
    {
      "title": "ty",
      "text": "Great product! Thank-you for fast shipping. Great retailer. Will be using for my wedding cake business. Thank-you very much! THX",
      "rating": 5.0,
      "verified": true,
      "author": "Chef Ain't B",
      "helpful_votes": 0,
      "publication_date": 20170506
    },
    {
      "title": "it still is a very nice taste. I will cook them and eat with ...",
      "text": "My husband hates the texture of most bean noodles. These are thin and though the texture is a little different...it still is a very nice taste. I will cook them and eat with just butter, salt and pepper.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160325
    },
    {
      "title": "Five Stars",
      "text": "Makes for a nice change from pasta. We enjoy this product very much.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael P. Williams",
      "helpful_votes": 0,
      "publication_date": 20161023
    },
    {
      "title": "Excellent alternative to white pasta!!!",
      "text": "Looking for a white pasta alternative...this is it!! It cooks without clumping and sticking together! Taste good. I have tried it with several toppings and all have been good",
      "rating": 5.0,
      "verified": true,
      "author": "Pamela Dorsey",
      "helpful_votes": 0,
      "publication_date": 20180223
    },
    {
      "title": "I love them. very quick to cook - 3-5 min ...",
      "text": "I love them. very quick to cook - 3-5 min and its done. I usually mix with shrimp and pesto souse.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric/Kate",
      "helpful_votes": 0,
      "publication_date": 20170112
    },
    {
      "title": "Low carb HIGH PROTEIN pasta",
      "text": "Low carb very HIGH PROTEIN pasta!! Really!! I sent some to my niece and she loves it, too. This is worth a try.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon customer",
      "helpful_votes": 0,
      "publication_date": 20170512
    },
    {
      "title": "If the labeling is correct it's much healthier than traditional spaghetti.",
      "text": "Been eating it for months and I'm still alive. Tastes ok, you'll get used to it.",
      "rating": 5.0,
      "verified": true,
      "author": "D",
      "helpful_votes": 0,
      "publication_date": 20161007
    },
    {
      "title": "VEGAN Diet source",
      "text": "Protein source in a new form, not dairy fat or meat fat.",
      "rating": 5.0,
      "verified": true,
      "author": "Tirewasher",
      "helpful_votes": 0,
      "publication_date": 20171211
    },
    {
      "title": "Five Stars",
      "text": "We love this pasta, and getting it in the large size saves a whole lot of money.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert A. Cohen",
      "helpful_votes": 0,
      "publication_date": 20170926
    },
    {
      "title": "tastes great and low in carbs.",
      "text": "Tastes great and low in carbs! It doesnt stick together like regular spaghetti and cooks in 4 minutes. We evenise it inplace of rice.",
      "rating": 5.0,
      "verified": true,
      "author": "Joycesheff",
      "helpful_votes": 0,
      "publication_date": 20160822
    },
    {
      "title": "Delish!",
      "text": "Great alternative to spaghetti. Works well with all sauces and has much more of a noodle texture then say a zucchini noodle.",
      "rating": 5.0,
      "verified": true,
      "author": "Adam",
      "helpful_votes": 0,
      "publication_date": 20160825
    },
    {
      "title": "Love this product!",
      "text": "I really love this pasta! Initially I found it at Costco (for half the price), but unfortunately they discontinued it. Even though it cost more through this site, I felt it was worth it. This is a very healthy and delicious alternative for anyone, but especially for diabetics.",
      "rating": 5.0,
      "verified": true,
      "author": "L. D.",
      "helpful_votes": 0,
      "publication_date": 20170120
    },
    {
      "title": "One Star",
      "text": "Disappointed not really like spaghetti at all would not recommend.",
      "rating": 1.0,
      "verified": true,
      "author": "Brenda McIntyre",
      "helpful_votes": 0,
      "publication_date": 20180319
    },
    {
      "title": "great texture, lower carbs and calories and healthier than ...",
      "text": "Delicious, great texture, lower carbs and calories and healthier than regular pasta!! Highly recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Miriam Attias",
      "helpful_votes": 0,
      "publication_date": 20151231
    },
    {
      "title": "This stuff is an amazing alternative to pasta",
      "text": "This stuff is an amazing alternative to pasta. Even my picky eater (she is 7) eats this like regular pasta.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20180222
    },
    {
      "title": "Hulk noodles for kids",
      "text": "Taste great! My kids loved them and the color. Taste very much like regular spaghetti. Will buy them again.",
      "rating": 5.0,
      "verified": true,
      "author": "StacieLS",
      "helpful_votes": 2,
      "publication_date": 20151013
    },
    {
      "title": "this is a terrific substitute for wheat or rice pasta",
      "text": "this is a terrific substitute for wheat or rice pasta. no gluten, and lots of protein! tastes good, and easy to make. i highly recommend this.",
      "rating": 5.0,
      "verified": true,
      "author": "flowerchild",
      "helpful_votes": 0,
      "publication_date": 20160507
    },
    {
      "title": "Just like regular noodles!",
      "text": "Like the texture of these noodles better than the black bean. Use it for spaghetti, stir fry, anything!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160910
    },
    {
      "title": "and my children loved it too",
      "text": "Delicious! I bought them because I eat low carb. The texture is so similar to real pasta, and my children loved it too!",
      "rating": 5.0,
      "verified": true,
      "author": "Theresa",
      "helpful_votes": 0,
      "publication_date": 20170809
    },
    {
      "title": "Veggie staple",
      "text": "Great tasting high protein pasta. Buy the boxed product over the bulk bag, though!",
      "rating": 5.0,
      "verified": true,
      "author": "Renee Boschert",
      "helpful_votes": 0,
      "publication_date": 20171226
    },
    {
      "title": "This is an excellent and delicious product",
      "text": "This is an excellent and delicious product, but ridiculously expensive. I will probably by again, but not as often as I would if it were more reasonably priced.",
      "rating": 4.0,
      "verified": true,
      "author": "searchlight75",
      "helpful_votes": 0,
      "publication_date": 20160118
    },
    {
      "title": "Good pasta substitute",
      "text": "It's different but can be used instead of pasta. Do not overlook it!",
      "rating": 4.0,
      "verified": true,
      "author": "Christina K",
      "helpful_votes": 0,
      "publication_date": 20161130
    },
    {
      "title": "My favorite of the veggie-noodle explosion",
      "text": "My favorite of the veggie-noodle explosion. This is a protein super food and tastes great. Eat quickly, though. This stuff dries out really fast.",
      "rating": 5.0,
      "verified": true,
      "author": "Shwe17",
      "helpful_votes": 0,
      "publication_date": 20160411
    },
    {
      "title": "The best pasta out there",
      "text": "The best pasta out there! So happy we found these Super versatile for all kinds of cuisines Nutritious You never feel guilty or weighted down after eating this",
      "rating": 5.0,
      "verified": true,
      "author": "Lina",
      "helpful_votes": 0,
      "publication_date": 20160921
    },
    {
      "title": "Love",
      "text": "I was worried about the texture, but honestly A++ I like when eating healthy isn't the same as eating cardboard. I absolutely love this pasta. Goes well with just marinara and cheese. High-fiber high-protein easy to pack a lunch with & incredibly filling for the entire day. I honestly feel way better because it makes me skip a lot of sugars/snacks because it's really substantial/filling. I initially bought some at Cost-co on a whim. Now I'm addicted.",
      "rating": 5.0,
      "verified": true,
      "author": "X",
      "helpful_votes": 3,
      "publication_date": 20170330
    },
    {
      "title": "Delish and healthy",
      "text": "I have fallen in \"love\" with this spaghetti. It takes on the taste of anything you add and it has 24 grams of protein per 2 ounces. Delish!",
      "rating": 5.0,
      "verified": true,
      "author": "Irene Dubyk Bergen",
      "helpful_votes": 0,
      "publication_date": 20160523
    },
    {
      "title": "Cant believe something this healthy tastes so good!",
      "text": "Tastes great, does not fall apart when cooking, doesn't taste like paste. Has great nutritional values, loaded with fiber and protein & low in carbs. I introduced it to 3 other people in the short time I've had it & they are hooked on this product!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160511
    },
    {
      "title": "Great tasting and healthy",
      "text": "Love this product. Very good and better for us. Will be ordering again",
      "rating": 5.0,
      "verified": true,
      "author": "Julie L. Mink",
      "helpful_votes": 0,
      "publication_date": 20161207
    },
    {
      "title": "PASTA  with low carbs and high protein",
      "text": "it is a good pasta. I like it with just olive oil and parm. lots of fiber, but I need 4 ounces, which is 400 calories.",
      "rating": 4.0,
      "verified": true,
      "author": "joe colton",
      "helpful_votes": 0,
      "publication_date": 20160509
    },
    {
      "title": "Healthy Pasta",
      "text": "Tried this previously and was sold on its taste and nutritional quality.",
      "rating": 5.0,
      "verified": true,
      "author": "GroovHoov",
      "helpful_votes": 0,
      "publication_date": 20170608
    },
    {
      "title": "Five Stars",
      "text": "An excellent gluten free substitute. My husband and I love this brand. It has a great texture.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristen",
      "helpful_votes": 0,
      "publication_date": 20160406
    },
    {
      "title": "Yum! and healthy too",
      "text": "The wonderful flavor and texture make up for it's fragility.",
      "rating": 5.0,
      "verified": true,
      "author": "LV Tutu",
      "helpful_votes": 0,
      "publication_date": 20161221
    },
    {
      "title": "Great Spaghetti",
      "text": "bought this many times and made according to directions. Was never satisfied with the texture, but continued getting it for health reasons. One day a bolt of lightning struck my brain and I decide to not follow the directions on the box. I found that timing it for either 13 or 14 minutes made perfect pasta with a wonderful consistency. So, if at first you don't care for this spaghetti, try cooking it a bit longer and you will be pleasantly surprised.",
      "rating": 5.0,
      "verified": true,
      "author": "Bluebird",
      "helpful_votes": 3,
      "publication_date": 20160728
    },
    {
      "title": "Buyer did a fantastic job-will order again",
      "text": "If you want some healthy spaghetti-buy this. It has 24g of protein. Buyer did a fantastic job-will order again.",
      "rating": 5.0,
      "verified": true,
      "author": "maxoh",
      "helpful_votes": 0,
      "publication_date": 20150909
    },
    {
      "title": "Awesome product",
      "text": "This is one of my go to meal prep staples. I love the taste and I get good carbs and protein with little fat.",
      "rating": 5.0,
      "verified": true,
      "author": "D Sav",
      "helpful_votes": 0,
      "publication_date": 20160627
    },
    {
      "title": "Broken spaghetti!",
      "text": "Unfortunately this product showed up at my house in crumbles. The Spaghetti was all broken into small pieces. Not nearly as enjoyable as when I bought it in the store. Sure wish Costco would get on this band wagon again.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170206
    },
    {
      "title": "The flavor is good but they taste water-logged",
      "text": "The flavor is good but they taste water-logged. Probably because you have to rinse them in cold water. So if you're serving them warm, you need to reheat them on the stove or with your sauce.",
      "rating": 4.0,
      "verified": true,
      "author": "Rob Daumeyer",
      "helpful_votes": 0,
      "publication_date": 20160513
    },
    {
      "title": "No longer sold at Costco. Bite the bullet and pay the price; this product is worth it!!",
      "text": "I love them and like everyone else I have been buying them at Costco for a much better price. BUT no more. Costco no longer carries them and I went to several health food stores and no one had the product so I am happy to pay the price to have this great product.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Gray",
      "helpful_votes": 0,
      "publication_date": 20160410
    },
    {
      "title": "its pretty good, but if you are looking for a ...",
      "text": "its pretty good, but if you are looking for a spaghetti like product, this is a little different but tastes good and if you are trying to stay away from gluten products then this is pretty good",
      "rating": 3.0,
      "verified": true,
      "author": "AndreaS",
      "helpful_votes": 0,
      "publication_date": 20161206
    },
    {
      "title": "Five Stars",
      "text": "Love this. its so yummy, easy to make, and healthy",
      "rating": 5.0,
      "verified": true,
      "author": "poppyir86",
      "helpful_votes": 0,
      "publication_date": 20160415
    },
    {
      "title": "LOVE THESE!",
      "text": "cooks fast; delicious, nutty flavor--great with shrimp, garlic, EVOO and fresh romano",
      "rating": 5.0,
      "verified": true,
      "author": "LoftyLanaTruthTeller",
      "helpful_votes": 0,
      "publication_date": 20160912
    },
    {
      "title": "Pretty tasty but not the same as real pasta",
      "text": "Pretty yummy for being healthy, but definitely not the same as the real thing.",
      "rating": 4.0,
      "verified": true,
      "author": "Cassidy",
      "helpful_votes": 0,
      "publication_date": 20160314
    },
    {
      "title": "Five Stars",
      "text": "Very tasty and a wonderful substitute for the higher carb pasta. It also works well in chicken noodle soup.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160316
    },
    {
      "title": "Great Product Overpriced",
      "text": "Love the product; expensive relative to other retailers. A one time purchase for us",
      "rating": 5.0,
      "verified": true,
      "author": "Happy Shopper",
      "helpful_votes": 0,
      "publication_date": 20151007
    },
    {
      "title": "very good!! nice variety pack",
      "text": "very good !! nice variety pack, so I can be choosey when I'm in the mood.",
      "rating": 5.0,
      "verified": true,
      "author": "Bonnie J. Miller",
      "helpful_votes": 0,
      "publication_date": 20151221
    },
    {
      "title": "it's a great tasting source of protein",
      "text": "This is the 2nd time I've bought this. As a vegetarian, it's a great tasting source of protein.",
      "rating": 5.0,
      "verified": true,
      "author": "MJ",
      "helpful_votes": 0,
      "publication_date": 20170803
    },
    {
      "title": "Four Stars",
      "text": "It's a great substitute for regular pasta. No guilt! Looking forward to adding different ingredients to it.",
      "rating": 4.0,
      "verified": true,
      "author": "minkey",
      "helpful_votes": 0,
      "publication_date": 20151105
    },
    {
      "title": "This stuff is amazing. But be careful of eating too much",
      "text": "This stuff is amazing. But be careful of eating too much, it is high and fiber and your significant other will not enjoy being around you.",
      "rating": 5.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20161024
    },
    {
      "title": "One Star",
      "text": "This was terrible., I’m truly disappointed. I would like a full refund please",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180306
    },
    {
      "title": "Five Stars",
      "text": "Love these. My granddaughter even loves to eat them uncooked",
      "rating": 5.0,
      "verified": true,
      "author": "Angela",
      "helpful_votes": 0,
      "publication_date": 20160923
    },
    {
      "title": "Get it",
      "text": "Pretty awesome - taste just like Reg pasta to me",
      "rating": 5.0,
      "verified": true,
      "author": "MaciekMiami",
      "helpful_votes": 0,
      "publication_date": 20160520
    },
    {
      "title": "OK if you hate pasta",
      "text": "Not my cup of tea, but the wife loves it.",
      "rating": 2.0,
      "verified": true,
      "author": "Mike Allred",
      "helpful_votes": 0,
      "publication_date": 20170308
    },
    {
      "title": "plus portion control is easy because of the thin strands",
      "text": "Fabulous product!! Healthy and Tasty, plus portion control is easy because of the thin strands. Really Great!",
      "rating": 5.0,
      "verified": true,
      "author": "Doktor G",
      "helpful_votes": 0,
      "publication_date": 20150825
    },
    {
      "title": "Love it!",
      "text": "Love these noodles! I was very skeptical, but gave them a try. I am happy I did.",
      "rating": 5.0,
      "verified": true,
      "author": "Marisa Briggs",
      "helpful_votes": 0,
      "publication_date": 20160524
    },
    {
      "title": "My family loves this",
      "text": "Healthy alternative to whole grain spaghetti. Great with pesto sauce!",
      "rating": 5.0,
      "verified": true,
      "author": "California mom",
      "helpful_votes": 0,
      "publication_date": 20160625
    },
    {
      "title": "Five Stars",
      "text": "Absolutely love these edamame noodles! I enjoy these more than other gluten free options out there!",
      "rating": 5.0,
      "verified": true,
      "author": "Monica",
      "helpful_votes": 2,
      "publication_date": 20150711
    },
    {
      "title": "Five Stars",
      "text": "Enough like \"real\" pasta to satisfy without the gluten! Wish it was less expensive though:)",
      "rating": 5.0,
      "verified": true,
      "author": "Bikinmomma",
      "helpful_votes": 0,
      "publication_date": 20160928
    },
    {
      "title": "Four Stars",
      "text": "I love this stuff, but realized I like the texture more of the fettuccine noodles.",
      "rating": 4.0,
      "verified": true,
      "author": "L cole",
      "helpful_votes": 0,
      "publication_date": 20160625
    },
    {
      "title": "DELICIOUS!",
      "text": "I LOVE these organic edamame noodles. They are hard to find in stores, so it's great that it's available online. They have so much flavor and make any noodle dish more tasty.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161017
    },
    {
      "title": "Five Stars",
      "text": "Great alternative to regular pasta; texture and taste are very similiar to regular pasta.",
      "rating": 5.0,
      "verified": true,
      "author": "NancyG",
      "helpful_votes": 0,
      "publication_date": 20160825
    },
    {
      "title": "A Delightful Protein Alternative!",
      "text": "An interesting alternative to basic pasta, especially those monitoring their glycemic levels. This spaghetti does have a distinctive taste and texture. If you like edamame, you will love this! After cooking, I just add a bit of garlic powder and olive oil or a pat of butter. The spaghetti cooks toward the al dente texture. A little bit will fill you up, as it it loaded with protein. Perfect meal when paired with a salad or as a side dish with fish or chicken.",
      "rating": 5.0,
      "verified": true,
      "author": "DBR",
      "helpful_votes": 2,
      "publication_date": 20160925
    },
    {
      "title": "Great noodles, fast shipping",
      "text": "I love these edamame noodles! A nice texture and healthy too.",
      "rating": 5.0,
      "verified": true,
      "author": "Judy Weiss",
      "helpful_votes": 0,
      "publication_date": 20160428
    }
  ],
  "product_meta": {
    "title": "Organic Edamame Spaghetti - 2 lbs (907g)",
    "description": "Size:2 PoundSafety Warning Manufactured in a plant that processes soybean and other beans. This Organic Edamame Spaghetti offers a tasty, healthy pasta for your family. This delicious spaghetti offers 24 grams of Protein and 11 grams of fiber per 2 ounce serving.",
    "rating": 4.1,
    "feature_bullets": [
      "2 pound box (18 servings",
      "Gluten free, vegan, kosher",
      "Organic",
      "High Protein",
      "Low Carb"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "7.4 x 4 x 8 inches; 2 Pounds",
      "UPC": "786173909004 650748779852",
      "Manufacturer": "UCCI (European Credit and Commerce International)",
      "ASIN": "B00TCUM7X2",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Grocery & Gourmet Food",
      "Pasta",
      "Pasta & Noodles",
      "Pantry Staples",
      "Spaghetti"
    ],
    "price": ""
  }
}