{
  "website_summaries": [
    {
      "verdict": "Natural ingredients in a powder formula that provides joint pain relief. Seems to work especially well for older dogs.",
      "pros": [
        "Owners say the beef formula is popular among their dogs",
        "Powder formula sprinkled over dog's food makes it easy to use",
        "Gives older dogs new level of energy and desire to move around"
      ],
      "cons": [
        "Much higher price point than other glucosamine products",
        "Some owners reported dogs had stomach problems after eating"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Didn't work and couldn't get a refund",
      "text": "It did not work for our older German Shepherd. We lost him in October! Although I was told by the makers of this product that it has a money back guarantee I couldn't get our money back from an unopened box.",
      "rating": 1.0,
      "verified": true,
      "author": "Margaret Tusan",
      "helpful_votes": 55,
      "publication_date": 20190110
    },
    {
      "title": "Disappointed and disgusted at ingredients",
      "text": "I’ve been giving this EXTREMELY expensive product to my dogs thinking it must have healthy ingredients at this price point then I finally read the label. Here are the side effects of the toxic chemical maltodextrin: Side effects may include allergic reactions, weight gain, gas, flatulence, and bloating. Maltodextrin may also cause a rash or skin irritation, asthma, cramping, or difficulty breathing. Extend Pets should be ashamed of themselves to put this toxin in and charge such and an exorbitant amount of money. Disappointed and disgusted.",
      "rating": 1.0,
      "verified": true,
      "author": "lisa b",
      "helpful_votes": 10,
      "publication_date": 20190627
    },
    {
      "title": "Pay attention to side effects",
      "text": "Thought I had found the perfect product to help 2 of our dogs. Lab was able to start chasing ball again. Collie mix has had problem walking for a few years. She was able to start walking half acre to back fence again. One month and side effect of diarrhea and gastro problems started. $120 vet bill and they can no longer take Extend. Very upsetting that their improved mobility is over.",
      "rating": 1.0,
      "verified": true,
      "author": "Tammy Augspurger",
      "helpful_votes": 8,
      "publication_date": 20181120
    },
    {
      "title": "It has made a huge difference from sad to happy dog",
      "text": "I have a two year pit bull not even an older dog she diagnosed with hip dysplasia she went from falling all the time where she just wanted to lay down to running jumping playing just a very happy dog she has been on it for three months now it has made a big difference I will continue to give it to Sophia I am a customer for life thank you for bringing my dog back to her happy self",
      "rating": 5.0,
      "verified": true,
      "author": "Irma",
      "helpful_votes": 10,
      "publication_date": 20180307
    },
    {
      "title": "After 3 weeks of taking this product he was getting up and down so easily and running through the house like a puppy",
      "text": "I was very hesitant to pay so much for this but decided it was worth it for my German Shepherd who was having trouble getting up after having been laying down for a while. My house has wooden floors so he didn’t have any traction. After 3 weeks of taking this product he was getting up and down so easily and running through the house like a puppy. I am so happy I bought this and will continue to give it to my dog.",
      "rating": 5.0,
      "verified": true,
      "author": "Purple Dot",
      "helpful_votes": 19,
      "publication_date": 20171228
    },
    {
      "title": "Don’t buy!",
      "text": "My dog did NOT respond well to Extend. He is vomiting and has the runs. When I called the company to ask about ingredients they couldn’t tell what’s in this powder. What do I tell his vet about what he is taking. Buy something else that has an ingredient list on the box.",
      "rating": 1.0,
      "verified": true,
      "author": "Nancy Garcia Harris",
      "helpful_votes": 8,
      "publication_date": 20190325
    },
    {
      "title": "Doesnt work at all.  2 boxes of wasted money",
      "text": "The flavor must be good as my dog gobbles it up. But, i have used 2 whole boxes and see not a whit of difference. She still limps terribly from joint pain. Her activity level is the same. And her coat...well before this her beautiful great pyrennes fur was much more lustrious. Now looks dull even after bathing. I will not recommend this product",
      "rating": 1.0,
      "verified": true,
      "author": "Kimoncoast",
      "helpful_votes": 6,
      "publication_date": 20181110
    },
    {
      "title": "Great product just started to late with my dog.",
      "text": "I started on January 25 and now its March 21. I have been giving to my dog for 8 weeks. I see no improvement. As I know it will work for some not all. I am just the no case. I do like that it was powder form; which made it really easy to give to my dog. This was a better alternative than shoving a pill down his throat every day. My dog is very smart and doesn't like medicine. He will run down the road if he knows its medicine. I think I just started this too late in my dog's life as he just turned 14 last week. I think the company has a great product.",
      "rating": 5.0,
      "verified": true,
      "author": "WhoDat2553",
      "helpful_votes": 2,
      "publication_date": 20200321
    },
    {
      "title": "A Godsend!",
      "text": "Although inevitable, watching Winnie get old has been difficult for me. Over the past 2 years, she started spending endless hours in bed, she became uninterested in our daily routines, and she started limping during walks. It killed me to watch her in that state. I researched this product online, and I decided that we'd try it (we had nothing to lose). Each day, for the past 5 months, I've added one packet of powder to wet food. Honestly, it's a godsend. She, undoubtedly, is more agile. For Winnie, this powder has offered a new lease on life. For me, I get to see my best friend age a little more gracefully. Thank you.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 2,
      "publication_date": 20200204
    },
    {
      "title": "If they worked out for some of you , that's great but a waste for me.",
      "text": "Bought 2 month supply. I have 9 days left on them. My dog is nearly 15. Incontinence and aching hips and stumbling. These didn't work. I wanted them to work very much. I have a great pet and wanted to help her. I followed directions to the letter and she did digest the product well.",
      "rating": 1.0,
      "verified": true,
      "author": "LINDA A. THOMPSON",
      "helpful_votes": 10,
      "publication_date": 20180323
    },
    {
      "title": "He went back to being an active happy dog on my 18 acre farm",
      "text": "Extend Joint Care has made an incredible difference in my 13 y/o Australian Cattle Dog. His hips were so arthritic, he could barely get up when he sat down. He also couldn't handle stairs at all. In just one month on this product, he went back to being an active happy dog on my 18 acre farm. Yes, it's expensive and, no, I didn't get free product for writing this review. Bottom line, it's an incredible supplement and I can't find anything else on the market with exactly the same ingredients. I highly recommend it if you've tried other joint support that just doesn't make your dog feel 110% better. I've purchased five times and will keep ordering from Amazon.",
      "rating": 5.0,
      "verified": true,
      "author": "BJG",
      "helpful_votes": 11,
      "publication_date": 20160409
    },
    {
      "title": "it was great to see no hesitancy taking this when mixed with ...",
      "text": "Five months ago I became very depressed at the sudden crippling of our 12 year dalmatian mix, Sam. After investigating meds for his hips problem, I decided to try a one month regimen of Extend Joint Care. And before the end of that month's trial, Sam had resumed being his old self again! And, being particular about what he ingests, it was great to see no hesitancy taking this when mixed with a tablespoon of peanut butter. We are so thankful that Sammy's himself again, i.e., we're still taking our walks and he's playful. -- A+ Extend!",
      "rating": 5.0,
      "verified": true,
      "author": "Dada",
      "helpful_votes": 7,
      "publication_date": 20180708
    },
    {
      "title": "It really works",
      "text": "Using this product, I had read the reviews on how it helped sever pain in the back or hind legs. Not sure if my dog had arthritis or hip dysphasia (did not get checked by the vet) but after 2 1/2 months of use, my dog was not screaming of pain anymore. Have been using this product for about 4 months and I do believe it works. My dog (Italian Greyhound) has a little bit of irritation but has not showed signs of distress since taking this product. Has been his normal self (age 12) with this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Ruth Gonzalez",
      "helpful_votes": 4,
      "publication_date": 20180816
    },
    {
      "title": "3 months no difference. though my dog is 15 yr old I",
      "text": "Though my dog Sophie will be 15 in November of this year, I guess I was expecting too much, just another waste of money for me. Took video before 12-15-18 and 0317-19 after --- on Youtube, not sure how to get it on this. Sophie on Extend. Sad, she tries so hard, she is a happy dog, and full of love, just wish she wasn't suffering.",
      "rating": 1.0,
      "verified": true,
      "author": "shopper",
      "helpful_votes": 4,
      "publication_date": 20190317
    },
    {
      "title": "Amazing for my boxer girl",
      "text": "Bought directly from the manufacturer the first go round. Within days saw a drastic improvement on our walk. She went from only putting her paws up on the logs we walk over to leaping over them like she did as a pup. Tried another joint supplement and it didn't work. It's so hard to see her stiff and painful so I will continue this therapy. The vet even commented on how well she's doing at this years well dog visit!",
      "rating": 5.0,
      "verified": true,
      "author": "HPL8NITE",
      "helpful_votes": 9,
      "publication_date": 20170422
    },
    {
      "title": "I have my sweet girl back!",
      "text": "I have a 6.5 yr old white lab that was starting to limp due to arthritis in her front shoulders. She couldn't go our daily walks together anymore, I had to leave her home and she would watch me from the window, just broke my heart. I started Extend Joint Care after hitting a link on Facebook and then found it on Amazon. All the reviews were great, so I thought, why not? It took about 5 weeks, but I've finally got my old girl back! No more limping and shes back to walking with me every day! I will continue to give her Extend Joint Care! Thanks so much for giving me my sweet girl back!!",
      "rating": 5.0,
      "verified": true,
      "author": "Carri",
      "helpful_votes": 6,
      "publication_date": 20170404
    },
    {
      "title": "Expensive Beef Bouillon",
      "text": "I really prayed this would work. My Jack Russell/Chi mix is going on only 8 y/o but continues to have issues with her joints, I started giving this to her about 2 months ago hoping that after the vet prescribed pain meds wore off this time she would be feeling normal. Nope. Super bummed. She loves the taste but if she has to limp and hobble to her food dish, I can't in good conscious spend $1.30 a day on something that simply makes her food taste better.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20200123
    },
    {
      "title": "It does work!",
      "text": "My dog ten year old on Thanksgiving week 2017 both back leg gave out. The weather was cold. Previous year one back leg out, got meds from was good in couple days. This year took same meds for a week. It did not help. I brought to vet hospital did X-ray and blood work. They claim she might had a stroke. They wanted to do Cat scam for $2,500.00. They could not find anything from X-ray or blood work. I been give her this stuff for a month. She walking but not able jump high as before. The stuff works the delay in shipping of product is bad. It took almost a week even with Prime.",
      "rating": 5.0,
      "verified": true,
      "author": "Joseph C.",
      "helpful_votes": 4,
      "publication_date": 20180112
    },
    {
      "title": "This product works.",
      "text": "We have an 11 1/2 lab. We started her on this in September and within 2 weeks we saw a difference, she was running around and saw the ease of her jumping on the bed at night. I stopped giving it to her for about 2 weeks and we notice she was not as active. We immediately starting giving it to her again and she running around and jumping like a puppy. We highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Patrick Tenneriello",
      "helpful_votes": 2,
      "publication_date": 20200203
    },
    {
      "title": "This product helped my 10 year old dog become more playful and less stiff.",
      "text": "My 10 year old dog had been slowing down and having trouble getting up on the couch and other places. She also became less playful. After about a month on Extend she seemed less stiff and much more playful She now gets up on the couch and in the car much more easily. I have tried other supplements with her and this is the only one that helped her. Product is pricey but worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "V. Oas",
      "helpful_votes": 3,
      "publication_date": 20191113
    },
    {
      "title": "Tastes good, apparently",
      "text": "I haven't tasted it, but my dog really likes this. I had tried a different joint supplement in tablet form and even crushed up she would eat around it. She likes this one, though, and I think the MSM added to it helps her joints, also. (she is a 17 year old Basenji)",
      "rating": 5.0,
      "verified": true,
      "author": "Valerie Hebert",
      "helpful_votes": 3,
      "publication_date": 20191205
    },
    {
      "title": "Worth the money",
      "text": "Extend gave new life to our aging Weimaraner. He was showing signs that he was hurting and much less mobile. After we started giving him extend we saw a remarkable difference. He was able to go up and down stairs more and wanted to get out and move around more. We have used extend with our Great Dane and German Shorthaired Pointers as well and really see the benefits it gives.",
      "rating": 5.0,
      "verified": true,
      "author": "Barb",
      "helpful_votes": 2,
      "publication_date": 20200102
    },
    {
      "title": "Greatly helped our 21 year old Chihuahua",
      "text": "After trying several products with no success, I decided to try this one based on the reviews. After about two weeks we started to notice a difference. She was able to walk easier and was less \"stiff legged\" than before. After a month, she was actually able to hop up a little when she was excited about something. This product, while expensive, has been worth it. I'm sure it won't work for every dog, but it sure worked for ours. Since she's lost several teeth (again, she is 21) we have been feeding wet food, and we just stir this in with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Diane",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "HOAX, SNAKE OIL",
      "text": "Didn't change a thing. Tried for 3 months, no improvement. Went to CBD oil, he's a puppy again! CBD is also much more inexpensive.",
      "rating": 1.0,
      "verified": true,
      "author": "Carla",
      "helpful_votes": 6,
      "publication_date": 20190308
    },
    {
      "title": "Not working",
      "text": "We have been giving these to our 13 yr old dog for 4 months now, one a day and sometimes 2x a day and I just have not seen any improvement, very disappointing, was really hoping this would work for her but she still can barely get around. This is super expensive and I feel like I have thrown my money away.",
      "rating": 1.0,
      "verified": true,
      "author": "Steph",
      "helpful_votes": 3,
      "publication_date": 20190718
    },
    {
      "title": "We were first told about this amazing product a few years ago",
      "text": "We were first told about this amazing product a few years ago. Maggie our Boxer was not walking on her right back leg. Within a week she was jumping bouncing walking running as if she was a puppy again. Years passed and we ran out one time. Thought it would be ok to let it go. But a month went by and she was limping again. We put her back on the supplement and bam she was all new again. She just passed away two days ago but lived almost 4 years longer than all her siblings. I attribute Her \"extension of life\" to Extend!! I would recommend it to everyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard Myers",
      "helpful_votes": 6,
      "publication_date": 20171011
    },
    {
      "title": "This product really works great!",
      "text": "My dog Addy is only 2 years old but already had arthritis problems. She was limping badly and couldn't go up and down the 3 steps from the porch to the yard without pain. I am on my third box of Extend and she can now jump up on to my bed and looks forward to walking in the park along with my other 2 dogs. At some point she will need hip surgery but for now this product seems to be relieving pain and inflammation so that she can enjoy life.",
      "rating": 5.0,
      "verified": true,
      "author": "christine skocik",
      "helpful_votes": 2,
      "publication_date": 20190827
    },
    {
      "title": "Helps with dog's pain from arthritis.",
      "text": "One of my dogs is 10 years old and has arthritis in one of his legs which affects his walking. I have tried many kinds of pain relief for him. Nothing seems to help long term. This is my second box of EXTEND and since trying the first box, I have seen a lot of difference in his walking. I will continue using this and hopefully it will be long term.",
      "rating": 5.0,
      "verified": true,
      "author": "MarleneLouiseTop Contributor: Coloring",
      "helpful_votes": 2,
      "publication_date": 20200105
    },
    {
      "title": "This works!!",
      "text": "My rottweiler was fussy and seemed to be hurting. We started him on this, and it made a HUGE difference in his comfort, he is a much happier dog and doesn't seem to be in pain. We have already repurchased, and will keep him on this forever. He went from grumpy to jumping around like a happy kid!",
      "rating": 5.0,
      "verified": true,
      "author": "KellyS",
      "helpful_votes": 3,
      "publication_date": 20190911
    },
    {
      "title": "Gear relief",
      "text": "My 12 year old golden retriever was having hip and leg issues and was showing signs of problems getting up. He has done a 180 and runs on the beach during our walks and goes up the stairs like a champ. Thank you!!",
      "rating": 5.0,
      "verified": true,
      "author": "margaret siemer",
      "helpful_votes": 3,
      "publication_date": 20191108
    },
    {
      "title": "My dog can run Again!",
      "text": "Love this product. My dog went from limping and even though she just turned five we knew she was having problems. She is a German Shepherd who weighs 106 lbs. since giving her this within three days she was jumping up and doing everything she did as a puppy. I am so grateful for this product. Thank you",
      "rating": 5.0,
      "verified": true,
      "author": "Joyce Silvia",
      "helpful_votes": 2,
      "publication_date": 20191229
    },
    {
      "title": "SO FAR, SO GOOD!",
      "text": "So far, so good. My 17-year-old Jack Russell / Rat Terrier has arthritis in his hips. He ways 11-12 lbs. I had to cut the dose in half as he didn't require the entire packet for one meal. I can tell he's not in as much pain and his grumpy attitude is slowly getting better! He has not been on Extend for 30 days yet and it is already making a difference! I mix half the dose in a small amount of warm water and put it on his dry dog food. After the food soaks it up, he'll eat it, but not before. He doesn't like the soupiness, so I let the dose sit for a bit.",
      "rating": 4.0,
      "verified": true,
      "author": "Jodi",
      "helpful_votes": 3,
      "publication_date": 20180125
    },
    {
      "title": "Old man has pep in his step!",
      "text": "I give this to my 13 yr lab mix. We rescued him in May. He was an owner surrender. Has arthritis in all joints pretty bad. After about a month of adding extend to his meds I noticed a huge pep in his step! He’s even trying to play with our little dog. Very happy with this product. My only complaint is that it’s pricey. I foster senior dogs and I would love to try this on them but with all the other meds these dogs are on it just adds up.",
      "rating": 5.0,
      "verified": true,
      "author": "Janice G. Keeler",
      "helpful_votes": 2,
      "publication_date": 20200101
    },
    {
      "title": "Works great for my old guy.",
      "text": "In two weeks my 15 1/2 year old 5 lb Yorkie is moving around like he used to. I have three little dogs and I sprinkle one package on three plates (over a little food) every evening, with 1/3 of the pack for each pup. They all love it! Cosmo is ready for his walks and running in and out the door to go potty. I'm so happy he is back to enjoying life again.",
      "rating": 5.0,
      "verified": true,
      "author": "Marcie B",
      "helpful_votes": 6,
      "publication_date": 20170707
    },
    {
      "title": "Wonderful product. So helpful for my pup.",
      "text": "This was the second time I ordered this and will continue now on a monthly basis. I ordered the first time on a trial basis to see if the reviews ran true, hoping it would help my aging chocolate lab. He's struggled with arthritis and joint trouble after having lyme. The limping and limited mobility was getting worse and my heart was breaking for him. Now he is running more, still has a slight limp, but nothing like before, and he's so happy! I highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "mary",
      "helpful_votes": 3,
      "publication_date": 20190131
    },
    {
      "title": "He still has good days and bad",
      "text": "This really seems to have helped my 15 year old arthritic dog with a partially fused spine. He still has good days and bad, but the continuous use of this product seems to have bolstered his quantity of good days.",
      "rating": 4.0,
      "verified": true,
      "author": "A. Cox",
      "helpful_votes": 9,
      "publication_date": 20170303
    },
    {
      "title": "Smooth and easy.",
      "text": "My dog would no longer take this cosquin pills because he had trouble chewing and swallowing them. This medicine u just mix with water. Apparently it tastes really good because my dog loved it. Drink it up with no problem. He even looked forward to his daily does. I didnt really notice any difference with his mobility between the cosequin and the extend but know he couldnt be without it.",
      "rating": 5.0,
      "verified": true,
      "author": "becky",
      "helpful_votes": 2,
      "publication_date": 20190626
    },
    {
      "title": "Great product my dog is no longer flopping on the ...",
      "text": "Great product my dog is no longer flopping on the floor in a sprawled position, she's able to stand and walk without issues. She even hops again. Would give 5 stars if the cost came down. Price is way too high",
      "rating": 4.0,
      "verified": true,
      "author": "P. Clossey",
      "helpful_votes": 9,
      "publication_date": 20170303
    },
    {
      "title": "This stuff is the real deal!!",
      "text": "My boy used to take one stair at a time due to hip dysplasia and lumbar disease. I had him on Dasuquin with MSM and a high quality CBD and had no change after 2 weeks. This video was after 2 weeks on Extend. It's been almost a month now and he is doing AMAZING! I have recommended this to everybody I know and I won't use anything else.",
      "rating": 5.0,
      "verified": true,
      "author": "CiCi",
      "helpful_votes": 3,
      "publication_date": 20190328
    },
    {
      "title": "Making a difference?",
      "text": "Our 12 year old Jack Russell has been on this a week or so now. I can definitely tell a difference. Hopefully the longer he is on it, the better he will get. UPDATE: So it's been a few months. He isn't doing as well as I had anticipated. Maybe I am expecting too much. He is 19lbs but loses his footing a lot and limps often. He can get up and down okay but isn't keen on anyone rubbing or touching his hips or back legs. He is getting 1/2 of a packet a day since he is so small.",
      "rating": 3.0,
      "verified": true,
      "author": "Lowej",
      "helpful_votes": 5,
      "publication_date": 20170401
    },
    {
      "title": "16 year old Yorkie doing better on Extend Joint care",
      "text": "My Yorkie is going on 17 and had not been walking with much energy and has arthritis. There is a very pronounced improvement since I started using this. She is now on his second box. It is easy to use; just spread it over her breakfast every morning and she loves it....",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Ann Cintron",
      "helpful_votes": 3,
      "publication_date": 20190424
    },
    {
      "title": "Great Product For Dogs With Arthriitis Pain!!",
      "text": "Our dog has arthritis in the hips, knees & back. We started giving her Extend a few months ago, and along with a couple other supplements, these are helping her quite a bit! I would highly recommend this product to anyone's pet. It's a bit costly, but we feel it's worth the price for our dog!! We bought the first 2 boxes from the company that makes Extend, and upon recommendation, have found it equally priced at Amazon! Plus, we have Amazon Prime, so it never costs anything to ship it to us!!",
      "rating": 5.0,
      "verified": true,
      "author": "Chlobert",
      "helpful_votes": 7,
      "publication_date": 20160709
    },
    {
      "title": "Works wonderfully",
      "text": "Our 11 year old dog was limping badly in spite of being on another Glucosamine product - I decided to add Extend - perfect! After a week she is no long limping and has some of her old pep back.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 4,
      "publication_date": 20190117
    },
    {
      "title": "Highly recommended!",
      "text": "Since our 12 year old Weim has been taking these, she no longer shows pain in her hips or breathes heavily when walking. In fact, she's even leaping up at dinner time now, something she hasn't done in a long time. Highly recommended for any dog with arthritis (She was diagnosed with bad arthritis in May, and showed great progress within 6 weeks).",
      "rating": 5.0,
      "verified": true,
      "author": "Rob Gutro",
      "helpful_votes": 7,
      "publication_date": 20170128
    },
    {
      "title": "I Was Skeptical...",
      "text": "I was somewhat skeptical about this product, but after reading the reviews on Amazon I decided to give it a try. IT WORKS! After about two to three weeks of giving it to our 12-year-old Border Collie on a daily basis, there was an undeniable improvement. He's getting up on his feet with much less effort/struggle and wants to play ball and chase squirrels again! I am confident that Extend has improved our beloved pet's quality of life and we will gladly purchase it monthly from now on!",
      "rating": 5.0,
      "verified": true,
      "author": "Bill M.",
      "helpful_votes": 2,
      "publication_date": 20190907
    },
    {
      "title": "Dont think it's helping my dogs",
      "text": "Didnt notice a change on my dogs. I'm assuming it tastes fine for them, since they ate it with their food (one of them is a picky eater) the 2 months they were on it. Stopped giving it to them to see if I noticed a change, nope, they limp the same if they walk too much. Maybe they're just too old but I dont think this stuff is working for them.",
      "rating": 3.0,
      "verified": true,
      "author": "lcaba123",
      "helpful_votes": 2,
      "publication_date": 20190723
    },
    {
      "title": "Good product",
      "text": "Seems to work I don't really know. My dog doesn't have any problems, but he is going to be 11 years old and he is a Mastiff. He does seem to be somewhat happier and moving around faster though. Yes, 11 year old Mastiff. I don't give those poison inoculations or that poison store-bought dog food",
      "rating": 5.0,
      "verified": true,
      "author": "Bert Othouse",
      "helpful_votes": 2,
      "publication_date": 20191006
    },
    {
      "title": "Made my dog very sick!",
      "text": "This made my dog very sick. Vomiting and diarrhea a few days after taking it and she wouldn't eat. It took a week for her to get better after I discontinued it.",
      "rating": 1.0,
      "verified": true,
      "author": "s. devaraux",
      "helpful_votes": 12,
      "publication_date": 20170917
    },
    {
      "title": "Works great but pricey...",
      "text": "It works well, my dog lapped it right up and from the way he acted and got around, I am confident that he was painfree...however this stuff is pricey...I have switched to a different product that is as good and less than half the cost.",
      "rating": 5.0,
      "verified": true,
      "author": "James Johnson",
      "helpful_votes": 3,
      "publication_date": 20190415
    },
    {
      "title": "This works!",
      "text": "I have been using this supplement for over a year noticed a big improvement in the 12 year old Aussie. He can run easily. English Bulls always have hip issue my guy can get up on a chair by himself again. Happy!",
      "rating": 5.0,
      "verified": true,
      "author": "Pat B.",
      "helpful_votes": 3,
      "publication_date": 20190817
    },
    {
      "title": "After the gas cleared!",
      "text": "The first week of using it my dog could clear a room or wake me up at night because of the gas. After about a week his system got used to it and it went away. Around 10 days of using it we did see an increase in his energy and flexibility. I have ordered the next two-month supplies because it works and he seems to not mind the flavor in his food.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Arey",
      "helpful_votes": 0,
      "publication_date": 20200915
    },
    {
      "title": "THIS REALLY MADE A DIFFERENCE",
      "text": "I have a 10-year-old Rottweiler and we live on a river with 5 acres, so my Rottie gets plenty of excercise.After romping with our 10 month old German Shepherd you could visibly see that he had a harder time getting up and he would limp quite often. He has been on other glucosamine dog medication that I think helped a little, but every since I've been using \"Extend\" I have seen a remarkable difference! He is hardly limping anymore . I just bought my third order of a double pack of \"Extend joint care\". Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "jmax",
      "helpful_votes": 2,
      "publication_date": 20180507
    },
    {
      "title": "My Shiba is moving again!",
      "text": "My shiba is 8 and was diagnosed with hip dysplasia about a year ago. She has been on glucosamine, pain meds, arthritis meds and CBD oil. Was still rocking herself to try to get up. After using Extend for a week we started seeing improvement. After using emExtend for about 3 weeks she is now getting up and down much easier and is much more playful. She even bends her left leg which she hadn't done in a long time. So happy she even has a brightness to her eyes again.",
      "rating": 5.0,
      "verified": true,
      "author": "Jan",
      "helpful_votes": 3,
      "publication_date": 20190923
    },
    {
      "title": "Helped our elderly dog",
      "text": "For us, it took about 2-3 weeks before we started to see real differences in our 14 year old dog struggling with back leg strength. We have now been using it once a day and she was walking around on her own. Last week we ran out of it and she has not had it for almost a week and is currently not able to walk on her back legs. We know she is elderly and is going to get worse but as soon as we ran out she started to go down hill. Placed an order to expedite the next shipment. It may not work for everyone but it worked for us, you just have to give it time.",
      "rating": 5.0,
      "verified": true,
      "author": "Westward Bound",
      "helpful_votes": 4,
      "publication_date": 20170123
    },
    {
      "title": "It Helps",
      "text": "Started giving it to my eight year-old German Shepherd after noticing almost four weeks ago what appeared to be a weakening hip, rear leg stiffness, and fewer jumping power. He jumped into the car this morning with noticeably less struggle and as much ease as before. Will definitely buy again, beef flavor helps!",
      "rating": 5.0,
      "verified": true,
      "author": "B. P. Petersen",
      "helpful_votes": 2,
      "publication_date": 20190622
    },
    {
      "title": "Jasmine loves this product.",
      "text": "Love the product. My 14 y/o Mini Pinn was having trouble getting around the house and climbing up and down her doggie stairs do to painful hips and joints. She has only been on it for 5 weeks, she has had a full recovery and no plays and chases the other dogs in the house like a puppy. She was in bad shape a month ago. We thought we were going to loose her to the Rainbow Bridge. Now she has more energy and plays like a puppy.",
      "rating": 4.0,
      "verified": true,
      "author": "Chuck Burke",
      "helpful_votes": 3,
      "publication_date": 20190830
    },
    {
      "title": "My dog is acting young again!",
      "text": "This joint care is added daily to 2 of my older dogs food and the results are undeniable. They are both moving so much better, even running again! They are 14 and 15 years old and were showing signs of inflammation and trouble getting up and moving slowly before this was added. We have been using it for about 4 months now but saw a change in a little over a couple of weeks.",
      "rating": 5.0,
      "verified": true,
      "author": "Patti C",
      "helpful_votes": 2,
      "publication_date": 20190617
    },
    {
      "title": "Extend, Wow.",
      "text": "I love it. She was already taking Rimadyl for her pain in her hips. She is also having trouble with her mind. Anyway we were anticipating having to put her down but she is doing pretty good. She can get around on her own, still some problems but 90% better.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Carroll",
      "helpful_votes": 3,
      "publication_date": 20190106
    },
    {
      "title": "Miracle",
      "text": "If your dog is showing signs of joint pain. Use this. It's a miracle. Our 2 year old Pitbull has hip dysplasia. He could hardly walk. I started googling ways to naturally help, as I began to feat the inevitable. After seeing reviews and stories. I thought I'd try this. He's our puppy again. His back leg atrophy was terrible. After using this for about 5 months, his leg muscles are building up again. He gets the zoomies again. 🤗",
      "rating": 5.0,
      "verified": true,
      "author": "Stacy Neace",
      "helpful_votes": 2,
      "publication_date": 20190428
    },
    {
      "title": "Some Relief for My Old Dog but Packaging Problems Exist",
      "text": "My old German Shepherd has had some relief from this product. We've been using it for two months. However, we give this to two dogs and one box should last 15 days. The last three boxes opened have been short one sleeve of the product. For this reason, I'm going to another product.",
      "rating": 3.0,
      "verified": true,
      "author": "Rob and Glo Carroll",
      "helpful_votes": 3,
      "publication_date": 20181113
    },
    {
      "title": "Expensive but worth it.",
      "text": "This stuff has helped my 11 year old Beagle greatly. She wouldn’t walk up the stairs before. Now she can run up them. Our hikes have been restored too. It’s expensive, sure, but it’s total worth it. I use 1/2 of a packet once per day as she is a little runt if a thing (28lbs). I have not noticed the effects having been minimized due to the reduced dosage. So I can get 2 months out of a box of these.",
      "rating": 5.0,
      "verified": true,
      "author": "Ferris Bueller",
      "helpful_votes": 2,
      "publication_date": 20200307
    },
    {
      "title": "Big improvement",
      "text": "I noticed a big improvement in my 12 year old Weanon Terrier the third day I started using it. He had problems getting up and down and walking. He's not going to walk like a young pup but he certainly has improved. When my 9 year old Wheaton needs it I'll put her on it too. My husband who doesn't notice anything told me the third day he was amazed how Buddy was walking better.",
      "rating": 5.0,
      "verified": true,
      "author": "JLA",
      "helpful_votes": 4,
      "publication_date": 20171016
    },
    {
      "title": "Still evaluating",
      "text": "Haven't noticed a huge improvement like in the commercials, but over time it seems to be helping some. My only concern is that glucosamine is generally dosed according to the dogs weight? How can this be one size fits all? I have very small dogs and this concerns me. My dogs do seem to like the flavor.",
      "rating": 4.0,
      "verified": true,
      "author": "Linda",
      "helpful_votes": 3,
      "publication_date": 20181005
    },
    {
      "title": "My old dog was lame and now runs like a puppy -- for short ...",
      "text": "\"My old dog was lame and now runs like a puppy -- for short periods, but he definitely feels his increased mobility. Up and down stairs slow, but he feels like he can do it and he does.\" All true. This dog runs happily in spurts, something that had disappeared from his life before a friend suggested that I try Extend Joint Care. It has added moments of joy to his life, and ours. I just wish it were not so expensive. When I tell people about it, they are turned away by the price.",
      "rating": 4.0,
      "verified": true,
      "author": "Lea Terhune",
      "helpful_votes": 3,
      "publication_date": 20171217
    },
    {
      "title": "So much more active",
      "text": "Our 11 year old labrador was finally starting to show limping from arthritis in her right back leg. We did not want to have to give her medication though. We started her on these powders, and she is back up and running without pain! So glad we found this.",
      "rating": 5.0,
      "verified": true,
      "author": "Charlene Rountree",
      "helpful_votes": 3,
      "publication_date": 20190903
    },
    {
      "title": "Priceless!",
      "text": "As the instructions informed, it took about 1 month to see any results but after that it was very obvious! I have an almost 15 year old Chihuahua and his hind legs have weakened over time. This has done wonders for him and he even plays like a puppy some nights! So thankful I found this.",
      "rating": 5.0,
      "verified": true,
      "author": "Reader2016",
      "helpful_votes": 3,
      "publication_date": 20181009
    },
    {
      "title": "Perfect name Extended my dogs life",
      "text": "I don’t write many reviews but feel this one is needed. I absolutely understand why this product is called Extend. That’s exactly what it did for my 13 year old 100+ LB lab. His hips were failing and he was struggling to get up. We got him this product and the second month we saw a huge difference. River is 14 now and his time is up. I feel fortunate to get that extra year and want to thank this company. Much love",
      "rating": 5.0,
      "verified": true,
      "author": "tobey canada",
      "helpful_votes": 2,
      "publication_date": 20200514
    },
    {
      "title": "Definite improvement but not a cure all",
      "text": "I originally received this product directly from Extend Pets. However their delivery is atrocious, taking up to 8 days with auto order to arrive. When you get a 30 day supply and you get it every 35-38 days, it doesn't work. Ordering through Amazon is more expensive, but you get I when you need it. Otherwise it is a very good product. My 10 year old Husky shows noticable improvement but be aware it is not a miracle supplement",
      "rating": 4.0,
      "verified": true,
      "author": "T. Sandy",
      "helpful_votes": 0,
      "publication_date": 20200605
    },
    {
      "title": "Thank you for helping my buddy...",
      "text": "I have 2 older dashounds ones 14 going on 15 and one just turned 13. The older one had had back problems since he was 4 years old. It's made him have issue with his rear legs not working well at times. He was getting worse over the last couple months, and I wasn't sure what do to to help him, until I found Extends. He been on it for 3 weeks now, and its amazing what it has done for him. Hes walking easier, getting up from his dog bed easier, and just about running around our back yard again. Iam so thankful for this product and helping my boy feel better again.",
      "rating": 5.0,
      "verified": true,
      "author": "Sean Rubin",
      "helpful_votes": 2,
      "publication_date": 20191215
    },
    {
      "title": "It Really Does Work!",
      "text": "This is the first time using Extend for my dogs. My older Aussie’s limping has been relieved and she is much more playful. My PomChi who is also aging but doesn’t have as many joint problems also seems to be benefiting from Extend as well. I will say that I was skeptical of it working after being burned by other products that have made similar claims of relieving joint pain. Thank you for giving me my pups back.",
      "rating": 5.0,
      "verified": true,
      "author": "arayrissa",
      "helpful_votes": 2,
      "publication_date": 20190308
    },
    {
      "title": "Can’t Do Without This!",
      "text": "I ended up using this along with medication from my vet. I thought I could stop using this once my dog went on medication. That was a mistake! Once I added this back into her diet, my 10 year old German Shepherd Dog is acting like a 1 year old again! You can just tell she feels so much better. I mix this in warm water and pour over her regular dry food. She eats all her food with gusto! I plan on continuing with this as long as I’m blessed to have her with me.",
      "rating": 5.0,
      "verified": true,
      "author": "Diane G.",
      "helpful_votes": 3,
      "publication_date": 20171027
    },
    {
      "title": "I like Extend because it is a powder so I make ...",
      "text": "My female athlete dog tore her left rear ACL about a year ago. At that time we elected to have the less expensive surgery. Nine months after that she tore her right rear ACL. This time due to her age we elected to just treat the pain and inflammation. We had been giving her another type of glucosamine tablet but she had learned to identify what cheese it was wrapped in and would just eat the cheese. I like Extend because it is a powder so I make a little bit of a gravy with it. She loves it. And she is definitely recovered. I like to think the Extend is part of the solution.",
      "rating": 5.0,
      "verified": true,
      "author": "DianeM",
      "helpful_votes": 4,
      "publication_date": 20161213
    },
    {
      "title": "It Works!",
      "text": "Started giving this to my 2 big dogs (10 yr old & 3 yr old). They play outside in the backyard like young puppies!! I will buy again and again and keep on buying. I reorder it myself I do not have it sent monthly . . .",
      "rating": 5.0,
      "verified": true,
      "author": "G LEWIS",
      "helpful_votes": 3,
      "publication_date": 20190126
    },
    {
      "title": "Trouble Be Gone",
      "text": "When I ran out of extend for 1 1/2 weeks,, my dog Wallee started limping again; front quarters. Now he’s back on it and front quarters aren’t hurting (he still has a small limp, but I am now giving him two packets in the am). He loves the beefy gravy over his dry food. Also for his hip displacia in his hind quarters, her is on a liquid steroid at night & it really helps that problem. I wish there was something that could dissolve the cysts under the poor guys armpits.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Watts",
      "helpful_votes": 2,
      "publication_date": 20180408
    },
    {
      "title": "It helped my 15 year old dog.",
      "text": "My 15 year old mix breed, junk yard dog is having rear leg and hip issues, I was afraid I was going to have to put her down. I was on Facebook and saw a video ad for Extend, bought it and just reordered. It works and I have more quality time with my Sophie girl. Started working after a week, keeps getting better.",
      "rating": 5.0,
      "verified": true,
      "author": "Vernon Wilkins Jr.",
      "helpful_votes": 2,
      "publication_date": 20190903
    },
    {
      "title": "Great product.",
      "text": "I like the product. I can see improvement in my dog. My only issue is. I have to disguise it in beef broth and put his Moist & Meaty in it. He won't eat in on his try food and won't drink it in beef broth until I add the Moist and Meaty. Does it come in pill form also? EXTEND definitely does what it advertises.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "She now runs to meet me at the door each day and acts like she did in her younger days",
      "text": "Our dog Annabelle is a Yorkshire terrier that is approaching 10 years old in May. She has had hip and knee joint issues for a while now. She mainly just laid around all the time, very inactive, and always appeared to be in pain especially when trying to stand from a laying down position. Since starting extend she has regained some pep in her step. She now runs to meet me at the door each day and acts like she did in her younger days. She has only been taking Extend for about 2 weeks now, but I can definitely see a positive change in her mobility, stiffness, and overall demeanor. I would highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 7,
      "publication_date": 20170304
    },
    {
      "title": "Our 80#, 12 year old lab is playful again.",
      "text": "We've had our lab on Extend for months now and she is like a playful puppy again. It took several months for there to be a definite change. She comes to us now wanting to run and play. Extend is quite expensive but you can't put a price on your loving pet's health and to see her jogging around the yard and playing with the kids is worth every penny. No more watching her struggle to get her back haunches up from her bed where she used to spend all her time. She had very little \"quality of life\" before Extend. Amazon has Extend, 2 boxes with a discount.",
      "rating": 5.0,
      "verified": true,
      "author": "Suzy",
      "helpful_votes": 0,
      "publication_date": 20201005
    },
    {
      "title": "My dog is walking and running better",
      "text": "My eleven year old Jackrat is now walking better and his knee stays in place much better. His knee was slipping out several times a week and now a couple of times a monthis all. Good product but expensive to continue to purchase. Seems like we should be able to get a better deal on the product!",
      "rating": 5.0,
      "verified": true,
      "author": "CINDY PELL",
      "helpful_votes": 3,
      "publication_date": 20190513
    },
    {
      "title": "Finally, relief for my dog!",
      "text": "My GSD is 12 and has spine issues. Her rear end hardly worked, dragging her feet, her hips did the splits when she sat, going to the bathroom wherever she was. It was so bad we were ready to put her down. After the Extend product, she can walk, sit, lay down, and goes to the bathroom normal. She will walk with us out in the yard and doesn't drag her rear end so bad. I see a spark in her eyes that just wasn't there before. LOVE THIS PRODUCT!",
      "rating": 5.0,
      "verified": true,
      "author": "Memphis housewife",
      "helpful_votes": 2,
      "publication_date": 20181005
    },
    {
      "title": "It seems to help.",
      "text": "I have two senior dogs that have had more difficulty just getting around. The product seems to help with their mobility. They are not jumping up on the bed like they used to, but they seem more comfortable after approximately one month on Extend. My lab's hind legs still tremble when we go for walks, so it's not all that I hoped for, but they are doing better than when they were just on Cosequin. It's quite a bit more expensive than Cosequin, which I buy at Costco, but I think Extend has added some quality and time to their life, and I am grateful for that.",
      "rating": 4.0,
      "verified": true,
      "author": "ProdigalPruner",
      "helpful_votes": 0,
      "publication_date": 20201005
    },
    {
      "title": "Great product",
      "text": "This has helped my pet, tremendously. After having surgery, to repair a stifle and knee injury, this really has made the difference!! I keep It, on regular delivery now. She loves it and will wait, till I put It on her food. Great product!",
      "rating": 5.0,
      "verified": true,
      "author": "Laurie Johnson",
      "helpful_votes": 2,
      "publication_date": 20190803
    },
    {
      "title": "Seems Promising",
      "text": "So gar I've used this product for two months and I've seen some progress with my 14 year old dog however he was also taking another medicine which helped him with arthritis but I stopped giving that to him about a month ago, so I need I little longer to decide if in fact that this is what is helping him and not the other medicine. If afte two months it turns out to be positive then I'll change it to 5 stars",
      "rating": 4.0,
      "verified": true,
      "author": "chato",
      "helpful_votes": 2,
      "publication_date": 20180721
    },
    {
      "title": "Dog finds the product very tasty. Hopeful.",
      "text": "Hopeful. Australian Cattle dog with spine and joint issues. I added water to the product and she loves it. She has only been on the product for 5 days, but yesterday she rolled around on her back in the grass, and she has not done that in quite awhile. 3 weeks and she has energy, jumping, and not wobbly. Making very good progress.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20180519
    },
    {
      "title": "This product is outstanding! My dog is older. ...",
      "text": "This product is outstanding! My dog is older...12 plus years and suffered a fall, making it difficult to walk and stand. Although he went through trips to the vet and a series of drugs to begin his recovery, not until I changed his supplements did his \"normal playful\" personality return. I have used this product for the past 2 months along with an exercise plan as part of his rehab, Sammy can now go for longer walks, walk up and down stairs with little to no help, and go potty without holding onto his halter. I think the combination of joint blend supplements plus chicken collegen has been the reason for his healing process. Thank you Extend!",
      "rating": 5.0,
      "verified": true,
      "author": "Genette",
      "helpful_votes": 2,
      "publication_date": 20161121
    },
    {
      "title": "This product really works!",
      "text": "My goldendoodle was limping for several weeks. I assumed it was due to arthritis and before taking him to the vet, I decided to try Extend Joint Care. Within a few days he was no longer limping. For the first 3 weeks I gave it to him daily, now I give it every other day. This is the third month of use and my goldendoodle is doing great!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Peg",
      "helpful_votes": 2,
      "publication_date": 20190717
    },
    {
      "title": "15 year old lab mix improving",
      "text": "My 15 year old lab mix is extremely arthritic but is otherwise pretty healthy. I've been giving her Extend Joint Care for about 6 weeks and I'm seeing definite improvement. She's more active, more participatory with my other dog and clearly feels better. While it hasn't turned her into a puppy again (she is geriatric) she's obviously feeling less pain. Hopefully a longer time on Extend will continue to help her mobility.",
      "rating": 4.0,
      "verified": true,
      "author": "MEB",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "It works!",
      "text": "Our dog, Dallas, has had surgery for torn CCLs in both back legs plus he has developed arthritis. He is 13 years old and was not walking around a lot. When he did, he would not our any weight on his back right leg. After 2 weeks on Extend, he is walking in all four legs and his limp is barely noticeable. He’s also in a much better mood with less barking and growling.",
      "rating": 5.0,
      "verified": true,
      "author": "Diane",
      "helpful_votes": 2,
      "publication_date": 20190911
    },
    {
      "title": "This stuff works!",
      "text": "My dog is 12 years old her hips were starting to go, she also has some tumors. Changing her food helped tremendously.... but Extend was the icing on the cake. My dog was dragging her back legs her hips were not strong enough to hold her up to walk. I have been religiously for 4 months sprinkling extends over her food everyday. Now she is running after a ball playing fetch. Previously she was on medication given by our vet, that did not work.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "Month 2, excellent results.",
      "text": "Seems to help our 12 year. Maltipoo, once again will jump up on the couch and enjoys her walks. She's fairly picky and seems to like the taste.",
      "rating": 5.0,
      "verified": true,
      "author": "Celeste Y Cooney",
      "helpful_votes": 2,
      "publication_date": 20191002
    },
    {
      "title": "Excellent Results After Eight Weeks",
      "text": "My 11.5 year old Chesapeake Bay Retreiver has had amazing results with this product. His energy level and agility have both shown a remarkable change after two months of use. As a senior dog, I sensed he was in pain and now, he appears to be much more comfortable, as witnessed by him speeding past me in the staircase. I combine this product with turmeric supplements and omega 3 fish oil. This combo really has worked wonders for him.",
      "rating": 5.0,
      "verified": true,
      "author": "Annemous",
      "helpful_votes": 2,
      "publication_date": 20180107
    },
    {
      "title": "She is getting around much better after using Extend",
      "text": "I bought it for 4 dogs, all older. One is 18-20 years old and has a knee that pops out of place. She is getting around much better after using Extend. I have another medium size dog that is about 12 years old who was having trouble with her hips. Since putting her on Extend she is able to jump up on the bed again! I think all of them benefit from the vitamin C and MSM as a general preventative supplement. Thanks!",
      "rating": 5.0,
      "verified": true,
      "author": "Natural Gardener",
      "helpful_votes": 2,
      "publication_date": 20180330
    },
    {
      "title": "Works great To bad I can't leave more reviews",
      "text": "I have 2 older dogs and this has helped them both. I mix it in their food they eat it with no problem. I have seen a big difference in them. I am very pleased. I wish they made it for humans. I could use some...lol I order this a lot but I can't leave but one review. !00% happy with this. Thank you",
      "rating": 5.0,
      "verified": true,
      "author": "Sparrow",
      "helpful_votes": 0,
      "publication_date": 20190821
    },
    {
      "title": "The powder in her food has made a HUGE difference in her ability to move around comfortably. She is happy and the cloudy look has ...",
      "text": "ONLY order it from Amazon, if you order it from the company it is an auto order at a high price. We have a 14.5 year old lab that is 90 pounds. She has arthritis and 15 is old for a large lab. The powder in her food has made a HUGE difference in her ability to move around comfortably. She is happy and the cloudy look has left her eyes. I don't know how much longer we will be lucky to have her but at least I know she is comfortable and happy with this stuff. She has no negative effects from it at all.",
      "rating": 5.0,
      "verified": true,
      "author": "Jo C.",
      "helpful_votes": 2,
      "publication_date": 20170619
    },
    {
      "title": "Some improvement",
      "text": "Has seemed to help my 13.5 yo lab with her hip pain and stiffness some. Wasn’t expecting miracles, and I also give her other supplements. She had refused to go up stairs for awhile and now she does climb the stairs. She is still stiff and walks slightly awkward but will climb the stairs after the other dog without whining.",
      "rating": 4.0,
      "verified": true,
      "author": "Soul Mate",
      "helpful_votes": 0,
      "publication_date": 20200711
    },
    {
      "title": "Can't believe it worked!",
      "text": "My valley bulldog, Lulu, was limping for months before I started using Extend. I knew if I took her to the vets it would literally cost thousands of dollars in tests, etc. I decided to try this product before spending more $ on her. After 3 weeks she no longer was limping. 4 months later she is still walking normally. I also have 2 daschunds and when I finish the supplements I already have I will be giving them EXTEND instead of the supplement I have because I know it works and will delay any problems they may have in the future.",
      "rating": 5.0,
      "verified": true,
      "author": "Pamela Tibbrine",
      "helpful_votes": 0,
      "publication_date": 20180826
    },
    {
      "title": "Extend save my beloved pet",
      "text": "3 times the vet wanted to put Riley down due to sever arthritis. I begged for just a few more months with her and they relented. 2 weeks later I found a testimonial for Extend and even the vet could not believe the dramatic turn around. Love it and share samples with others too. Thank you Extend",
      "rating": 5.0,
      "verified": true,
      "author": "Bonnie",
      "helpful_votes": 3,
      "publication_date": 20181220
    },
    {
      "title": "Great Improvement in Mobility",
      "text": "We have seen a great improvement in our 14.5 yr old doxies movement. He is actually \"bouncing\" around more now. Runs through the house with our 7.5 yr old Chi. He was getting to the point where he did not want to even walk before starting him on Extend. Will definitely keep him on it.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen D. Bailey",
      "helpful_votes": 0,
      "publication_date": 20190528
    },
    {
      "title": "Doesn't work",
      "text": "This does not work. Tried it for 6 weeks and it did not work. My poor dog started falling down. I have gone back to my vet for prescription Glucosamine and I think he is getting back to where he was. It was a big mistake to try this. Deregulation strikes again, no telling what it contains or if it was properly tested.",
      "rating": 1.0,
      "verified": true,
      "author": "Renee",
      "helpful_votes": 2,
      "publication_date": 20191126
    },
    {
      "title": "No more limping.",
      "text": "We plan on buying this again. Our two senior dogs (13 and 11) are acting more playful and seem to be in a lot less pain. It took 3 or 4 weeks to see some results. Our oldest dog gets up now without limping for a few minutes. Update 5/26/17: Our 13 yr old Wheaten Terrier is totally off the pain meds and has been playing again. She still has some hot spots we know not to touch, but she gets around great. She gets up off the hard floor fairly easily, and no yelping.",
      "rating": 5.0,
      "verified": true,
      "author": "J. A. C.",
      "helpful_votes": 3,
      "publication_date": 20170118
    }
  ],
  "product_meta": {
    "title": "Extend Joint Care Natural Glucosamine with MSM for Dogs, 2 Box",
    "description": "GLUCOSAMINE - Supports hydration, mobility and comfort.\n\nMETHYLSULFONYLMETHANE (MSM) - Supports proper maintenance, connective tissue function and joint comfort.\n\nTYPE II CHICKEN COLLAGEN - Essential building block for maintaining healthy articular cartilage.\n\nASCORBIC ACID - Increases the production of collagen and glycosaminoglycans like chondroitin sulfates and hyaluronic acid",
    "rating": 4.5,
    "feature_bullets": [
      "Our proprietary formula is specifically designed to soothe the effects of joint damage, support joint and cartilage, help retain flexibility, and improve mobility",
      "DELICIOUS BEEF FLAVOR - Is your dog a picky eater? Don’t worry! This nutritious formula has a savory beef flavor that every dog loves. TIP: Add water to make a delicious gravy!",
      "GET IT WITH CONFIDENCE - For Extend Pet Health, making you and your dog happy is our #1 priority. That’s why we offer a 100% money-back satisfaction guarantee! If you or your pet are not completely satisfied with the results, we will refund your purchase, no questions asked",
      "CONTENTS: GLUCOSAMINE, METHYLSULFONYLMETHANE (MSM,TYPE II CHICKEN COLLAGEN, ASCORBIC ACID"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "7.6 x 5.8 x 2.5 inches; 11.22 Ounces",
      "Item model number": "FBA_ex-102",
      "Date First Available": "February 17, 2015",
      "Manufacturer": "Extend Pets",
      "ASIN": "B00TQ7B2D2",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Health Supplies",
      "Hip & Joint Care",
      "Dogs",
      "Pet Supplies"
    ],
    "price": 79.95
  }
}