{
  "website_summaries": [
    {
      "verdict": "A beautiful wall fountain that looks very high end and provides a soothing sound.",
      "pros": [
        "Made to look like an old copper fountain",
        "The pump on this fountain is very quiet",
        "Product offers easy set up and maintenance",
        "It includes a screen to keep debris out of the pump"
      ],
      "cons": [
        "The only real drawback of this fountain is finding a way to conceal the cord",
        "You may have to paint it the color of the wall"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "There is no easy way to mount this!",
      "text": "Does not come with any type of mounting bracket; there are two \"slots\" molded into the fountain but apparently no one bothered to check any hardware store to see if brackets even existed to fit these slots. The unit is very light and molded from fiberglass and hallow, so I used a \"Moly\" wall anchor with \"all thread\" to secure it to my wall.",
      "rating": 2.0,
      "verified": true,
      "author": "Frank  in California",
      "helpful_votes": 3,
      "publication_date": 20190821
    },
    {
      "title": "Good!",
      "text": "A lot of reviews said the spaces for hanging was uneven but it seems like the seller solved this issue as mine were perfectly aligned. Was easy to set up and so far so good. It was a bit smaller than I thought it was going to be but it looks beautiful in my entryway. The sound it makes is spectacular.",
      "rating": 5.0,
      "verified": true,
      "author": "dickenslover",
      "helpful_votes": 0,
      "publication_date": 20200901
    },
    {
      "title": "Undecided but I love how it looks",
      "text": "The first fountain I got had a cracked screen in 5 places , and the main water spout at the top didn't pour water at all. I exchanged it and I'm hoping the new one works. I love it, it is so beautiful in my living room.",
      "rating": 4.0,
      "verified": true,
      "author": "Jennifer J.",
      "helpful_votes": 0,
      "publication_date": 20190111
    },
    {
      "title": "Died  one year to the day",
      "text": "Lovely loved beautiful on wall. Took very good care of it. Died one year from purchase. Since the line is built in no way to fix it.",
      "rating": 4.0,
      "verified": true,
      "author": "Ellen McLaughlin",
      "helpful_votes": 0,
      "publication_date": 20190719
    },
    {
      "title": "Not what I expected for about $170",
      "text": "Color is different in person, more on the red color. They two hanging hooks on the back are uneven making it hard to level for a even water flow.",
      "rating": 3.0,
      "verified": true,
      "author": "DANTE",
      "helpful_votes": 0,
      "publication_date": 20200512
    },
    {
      "title": "This unit was not level so I had to modify ...",
      "text": "This unit was not level so I had to modify the back hangers so it would hang vertically.. now the upper bowl is not level but it works",
      "rating": 3.0,
      "verified": true,
      "author": "Dan",
      "helpful_votes": 2,
      "publication_date": 20170614
    },
    {
      "title": "Otherwise a nice fountain.",
      "text": "After less than one year the color has come off in the upper \"dish\" so it is white inside. This is a surprise. Otherwise a nice fountain.",
      "rating": 4.0,
      "verified": true,
      "author": "Philip B.",
      "helpful_votes": 3,
      "publication_date": 20160513
    },
    {
      "title": "Great little wall fountain",
      "text": "Mine is a little darker than the picture, nothing to complain about here.. Just add teaspoon of bleach every couple of months to keep clear and clean nice water fall sound",
      "rating": 5.0,
      "verified": true,
      "author": "greg b",
      "helpful_votes": 7,
      "publication_date": 20130503
    },
    {
      "title": "Love it",
      "text": "Great wall fountain for your bucks! Love the sound and the look! It was easy to install. Just wish the cord was a little longer since it is a wall fountain. Had to get an extra extension cord.",
      "rating": 5.0,
      "verified": true,
      "author": "Brent",
      "helpful_votes": 0,
      "publication_date": 20130604
    },
    {
      "title": "Lovely fountain",
      "text": "I love my fountain. Only had for two months, but so far it's working great. Looks exactly as pictured.",
      "rating": 5.0,
      "verified": true,
      "author": "readerone",
      "helpful_votes": 0,
      "publication_date": 20201105
    }
  ],
  "product_meta": {
    "title": "Muro Elegante Wall Fountain Finish: Copper",
    "description": "The Muro Elegante Fountain cascades water over the first tier and then cascades down into main reservoir - Constantly recycles water from a hidden reservoir - Creates a relaxing atmosphere on your patio, deck, balcony or in your garden - Easy to install and enjoy.",
    "rating": 3.8,
    "feature_bullets": [
      "Electric power , Weatherproof",
      "Constantly recycles water from a hidden reservoir",
      "Durable polyresin and fiberglass construction",
      "For outdoor/indoor use, Pieces Included: Includes fountain and pump"
    ],
    "specifications": {
      "Product Dimensions": "10 x 19 x 33 inches",
      "Item Weight": "21 pounds",
      "Manufacturer": "Jeco Inc.",
      "ASIN": "B00TPUUE9I",
      "Item model number": "B00TPUUE9I",
      "Customer Reviews": "3.8 out of 5 stars18 ratings3.8 out of 5 stars",
      "Best Sellers Rank": "#150,790 in Patio, Lawn & Garden",
      "Is Discontinued By Manufacturer": "No"
    },
    "categories": [
      "Patio, Lawn & Garden",
      "Outdoor Décor",
      "Fountain Accessories",
      "Garden & Outdoor"
    ],
    "price": 158.99
  }
}