{
  "website_summaries": [
    {
      "verdict": "Acer's Chromebook 15 is the largest Chromebook yet, but this 15-inch, Web-connected laptop doesn't offer much else to distinguish it from the pack.",
      "pros": [
        "Large, 15.6-inch display with full HD resolution",
        "Full-size keyboard and touchpad",
        "High-quality sound",
        "Long battery life in testing"
      ],
      "cons": [
        "Sparse port selection"
      ],
      "aspects": {},
      "publication_date": 20150320,
      "rating": 7.0,
      "source": "pcmag"
    }
  ],
  "customer_reviews": [
    {
      "title": "Mostly good, but missing some useful keys on the keyboard",
      "text": "I love the bigger screen & it is quick & light. But, I had to take a star away because they took away the delete key & the page up & down keys. You would think on a larger notebook like this they would have these keys - the space is there for them. I don't know why they took them away.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 6,
      "publication_date": 20170906
    },
    {
      "title": "Piece of Garbage",
      "text": "Worked fine for the first few weeks. Then I noticed it began to \"hang.\" It would get stuck on processes. Then that \"sticking\" became locks. Now I have to reboot the machine a minimum of 4 times a day, and sometimes as much as 10. I can never open more than 2 windows, or they'll all freeze. It'll absolutely freeze completely, and no matter how long I wait (I've tried 2 hours) it won't unfreeze. Pretty worthless. Worse, I bought it before beginning a long stretch of traveling, so now I'm overseas with a machine I'm constantly having to reboot. Don't waste your time or money...many better products out there. Won't ever buy from them again.",
      "rating": 1.0,
      "verified": true,
      "author": "Ted Persinger",
      "helpful_votes": 2,
      "publication_date": 20190203
    },
    {
      "title": "Reliability problem",
      "text": "After 12 months the charging socket became loose. The plug doesn't fit tight and often doesn't charge. Acer's customer forum has many complaints about this problem and repeated failures after factory repairs.",
      "rating": 1.0,
      "verified": true,
      "author": "Billeee",
      "helpful_votes": 17,
      "publication_date": 20161225
    },
    {
      "title": "Crash Into Me...",
      "text": "It looks like I’m one of many people with this problem— after six months of working fairly well, my screen started flickering, then going black every time I opened a browser. It’s completely unusable. I keep seeing other reports of identical crashes and poor customer service in response. So, buy at your own risk, I guess! The worst thing is that when it would crash, I would always get that Dave Matthews Band song, “Crash Into Me,” stuck in my head. Unforgiveable.",
      "rating": 1.0,
      "verified": true,
      "author": "Hannah",
      "helpful_votes": 8,
      "publication_date": 20171030
    },
    {
      "title": "BIG and does what I need.",
      "text": "This thing is YUGE. Like really, really wide. I downgraded from my Macbook Pro after about five years when I realized I didn't need a $1500 Facebook machine and the Macbook started conking out. Figured it was better to buy a new Chromebook for a couple of hundred rather than spending that money on old Macbook repairs. Touchpad is not as sensitive as I would like and no way to adjust that. Have to tap harder than my Macbook. No date on screen. Have to hover over the time to get the date. These are minor things to get used to and not a YUGE deal. Speakers are great! Everything is cloud now so Chromebooks are the way to go.",
      "rating": 4.0,
      "verified": true,
      "author": "Jeff Bozos",
      "helpful_votes": 8,
      "publication_date": 20160707
    },
    {
      "title": "OS Missing Error less than year used???",
      "text": "Got this for browsing/streaming. Acceptable viewing/ audio. Less than a year..Without notice error on screen” OS MISSING! Followed Chrome “fix” instructions.. many attempts.. nothing! Forums no help! No resourses to send to technician!!As a homebound senior its a major inconvenience and LOSS of limited fixed income. I give fair reviews this gets NO STARS!",
      "rating": 1.0,
      "verified": true,
      "author": "BeLoved",
      "helpful_votes": 5,
      "publication_date": 20180410
    },
    {
      "title": "Acer Chromebooks are Awesome - Dear Acer, please make a printer for these!",
      "text": "Beautiful computer purchased on prime day - screen clarity excellent, fast computer and fairly priced. Dear Acer Chromebook, why oh why can't you create a chromebook compatible with a printer ... how about just designing and selling your own cheap chromebook printer please? That's the only drawback - otherwise, these are amazing computers - the third we've had - they wear like iron, nice screen size options, great for the net. Not being able to print is the only downside.",
      "rating": 5.0,
      "verified": true,
      "author": "Michele",
      "helpful_votes": 3,
      "publication_date": 20170807
    },
    {
      "title": "You’ll love it as long as you know the limitations of a Chromebook",
      "text": "This thing is awesome! I had a small Chromebook that I used for school that I kept in the front pocket of my backpack, so I knew what to expect with a Chromebook. The screen is huge and crisp. The sound is surprisingly nice with the two speakers on either side of the keyboard. I gave the battery a test run after a full charge - got a solid 9 hours out of it - actually a little more. I bought this to make the switch from windows to Chromebook for my daily use computer, and I couldn’t be happier!",
      "rating": 5.0,
      "verified": true,
      "author": "P. Munoz",
      "helpful_votes": 0,
      "publication_date": 20180408
    },
    {
      "title": "thinking it was just like the white acer chromebook that I bought on Amazon ...",
      "text": "I bought this laptop for my mom, thinking it was just like the white acer chromebook that I bought on Amazon a few years ago. It's actually even better than my chromebook. The screen is crystal clear. The chromebook is fast and extremely easy to use, especially for my 66-year old mom who's not always quick to learn new technology.",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth",
      "helpful_votes": 2,
      "publication_date": 20171002
    },
    {
      "title": "I am convinced....this is a better way to go, I didn't need anything more than this",
      "text": "there is only the google Chrome operating system on this chromebook you cannot use an external dvd player I should have done more research :( ........ But on the other hand: for web surfing, it is Fast and easy beautiful design display and speakers are excellent it's only been a week but I am really liking this don't know what I am going to do when the complimentary cloud storage expires.....?",
      "rating": 4.0,
      "verified": true,
      "author": "Siasl in s.i.",
      "helpful_votes": 7,
      "publication_date": 20170520
    },
    {
      "title": "Slightly under-powered, but a solid work station.",
      "text": "I purchased this as an emergency replacement when my last laptop died, and have been using it for work (writing and editing reports) for several months. I find it works well as a productivity machine. Since I cannot install or play many games, I have no temptations to distract me from what I should be doing. While I am perfectly happy working in Google's online productivity environment, the ability to use the Android version of Microsoft Office means I can still collaborate with clients who prefer MS's suite. The small amount of RAM can be an issue when opening too many Chrome tabs simultaneously. I plan to purchase a more powerful Chromebook in the near future.",
      "rating": 4.0,
      "verified": true,
      "author": "Stephen P. Fisher",
      "helpful_votes": 0,
      "publication_date": 20180409
    },
    {
      "title": "At first it seemed like this would be pretty nice and a good value",
      "text": "At first it seemed like this would be pretty nice and a good value. It started up fine, but then it fell short in just about everything. It took multiple attempts and restarts to get the Play Store working. The first app I tried to get going was Youtube TV, but said it couldn't run the app and had to be opened in the Chrome web browser. After trying to do that, it says Chrome needs to be updated. Go to update that app, but it says it's up to date. So I update the OS, and then I get stuck in a forever login loop. Multiple hard restarts and washdowns did not fix the problem. Returned.",
      "rating": 1.0,
      "verified": true,
      "author": "G Fnow",
      "helpful_votes": 0,
      "publication_date": 20180612
    },
    {
      "title": "Got one previously and it's so easy to use and FAST that my college daughter always ...",
      "text": "I'm buying this again. Got one previously and it's so easy to use and FAST that my college daughter always grabs it from me when she is home. So, I think we need to have another Acer Chromebook. Highly recommended for people who wants to escape from the sluggishness of Windows in their daily computing usage. Windows is still good for some serious works, like video editing, etc. But just leave it for that purpose, everything else can be done on a Chromebook.",
      "rating": 5.0,
      "verified": true,
      "author": "Kuang-Sheng C.",
      "helpful_votes": 4,
      "publication_date": 20161114
    },
    {
      "title": "About as good as a Chrome book can get",
      "text": "Extremely fast and user friendly. About as good as a Chrome book can get!",
      "rating": 5.0,
      "verified": true,
      "author": "Lido",
      "helpful_votes": 21,
      "publication_date": 20171119
    },
    {
      "title": "Great for college student",
      "text": "Perfect for my daughter for college. She uses it strictly for accessing her online work , essays & items posted by professors. It's great for this type use. Since it's doesn't have lots of ram or other things for gaming, videos etc... I probably wouldn't purchase if that is what you are seeking. We bought on prime day & got a good price. She is happy with the performance for what she needs it for.",
      "rating": 5.0,
      "verified": true,
      "author": "Penny Sosebee",
      "helpful_votes": 2,
      "publication_date": 20171002
    },
    {
      "title": "Should have got one of these earlier",
      "text": "Read several articles on how much more secure this operating system is. System all solid state, great battery life, simple thus fast. Hard to beat for surfing web, since u are not near as worried about being hacked. Love the clear large screen for movies on the go. If you find u do everything on the web, & have no need to install programs, this is the way to go, should have got one sooner. Big plus is no more huge Windows & antivirus updates, or costs.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard A. Goins",
      "helpful_votes": 0,
      "publication_date": 20180621
    },
    {
      "title": "Great laptop for the money.",
      "text": "This was a graduation gift for my granddaughter's 8th grade graduation. Excellent laptop for its intended use which is doing homework, sending email and surfing the net. If you do not need any business related programming such as PowerPoint, Excel or other more sophisticated programs this computer will fill your need at a very reasonable price. It arrived on schedule as promised and was simple and easy to set up.",
      "rating": 5.0,
      "verified": true,
      "author": "Arthur L. Gillespie",
      "helpful_votes": 3,
      "publication_date": 20170629
    },
    {
      "title": "Not working right out of the box",
      "text": "Arrived with an outdated OS! Tried to Powerwash and start over, but it didn't help. Acer was unable to resolve the issue. They told me it was a software issue and not their problem...on a machine I just bought from them. Sending it back for a refund.",
      "rating": 1.0,
      "verified": true,
      "author": "Joe V",
      "helpful_votes": 4,
      "publication_date": 20180224
    },
    {
      "title": "Great chromebook that my teenage daughter loves.  Great price for what you get.",
      "text": "This was my first purchase on a non-windows based device. I was skeptical at first, but the price was great so I decided to buy this for my daughter's birthday. She loves it. She uses it primarily for watching movies and other teen related apps. She doesn't have a need for any kind of productivity types of applications. This Chromebook works great for her needs.",
      "rating": 5.0,
      "verified": true,
      "author": "Gregory M",
      "helpful_votes": 3,
      "publication_date": 20160121
    },
    {
      "title": "I am so very happy with the purchase of my new Chromebook",
      "text": "I am so very happy with the purchase of my new Chromebook. It is fast, easy to use and does everything I need it to do. I don't need to learn Windows 10, moreover, Windows is way more than I need. I stream movies, use social media, create documents/blogs and learn about new features within Google Docs every day. Best part--no virus protection as the updates take care of virus protection. It was so reasonable that my husband and I each bought one. I'm a convert....Chromebook all the way. Not everyone needs Windows, certainly not me!",
      "rating": 5.0,
      "verified": true,
      "author": "YaYa1637",
      "helpful_votes": 0,
      "publication_date": 20171028
    },
    {
      "title": "Nice Chromebook",
      "text": "Two things that should be addressed by Acer, white of all colors WHY and connection for power is not tight. We have 4 laptops and all battery connections are tight, it's as though they forgot a piece, not thinking! And to find one that's not white, white shows every cat hair, show all dirt period. The rest is on Google, default front is tiny, hard to change all font setting but it's a step up from Android so if you can handle Android this will be easier. Was bought for one thing, watching movies and that it does fine.",
      "rating": 4.0,
      "verified": true,
      "author": "bmac32",
      "helpful_votes": 0,
      "publication_date": 20180822
    },
    {
      "title": "Great product, just a little heavy for a chromebook.",
      "text": "I love everything about it, except the weight. The picture and sound are great. The speed is great. The large keyboard is wonderful. I've had it since Jan. 2018 and the only problem I've ever had is how heavy it is. If it was not so heavy I would have given it 5 stars. I will say that I like it so much that I ordered 1 for my Father and my youngest brother. It's great quality for the money.",
      "rating": 4.0,
      "verified": true,
      "author": "Kita E. Champion",
      "helpful_votes": 0,
      "publication_date": 20180725
    },
    {
      "title": "Chromebook",
      "text": "I love my chromebook. this is the second one I've purchased. My son, who is an absolute computer wizzard, and computer engineer highly recommended this particular computer to me. I hope they are always available, because I have no desire to ever use any other computer.",
      "rating": 5.0,
      "verified": true,
      "author": "Pam in Michigan",
      "helpful_votes": 2,
      "publication_date": 20170507
    },
    {
      "title": "Great bang for your buck",
      "text": "Good display, snappy system. Works as it should. My only real con is that the keyboard is a little on the small side, I feel like the speaker placement could have been a little better to expand the keyboard some. Nothing I can't get used to though considering the price point I got it at",
      "rating": 4.0,
      "verified": true,
      "author": "Josh",
      "helpful_votes": 3,
      "publication_date": 20170830
    },
    {
      "title": "Compared to my former C7, 11 inch screen, ...",
      "text": "Compared to my former C7, 11 inch screen, the power and versatility of the Acer 15 inch screen is the Cadillac of Chomebooks!",
      "rating": 5.0,
      "verified": true,
      "author": "Rick Barrett",
      "helpful_votes": 3,
      "publication_date": 20170701
    },
    {
      "title": "I like this Chromebook",
      "text": "I like this Chromebook. I bought one for my in-law's last year and liked it so I got one myself. Before this I had a Toshiba with a smaller screen, but it was an excellent unit. This is pretty light and fairly thin. The battery lasts for many hours, and recharges quickly. The only thing about this one is it will sometimes lock up, and i have to hit the power button to un-freeze it. I bought this during Prime days and the price discounted even more, so i consider it a good deal.",
      "rating": 4.0,
      "verified": true,
      "author": "JimEddie",
      "helpful_votes": 0,
      "publication_date": 20170827
    },
    {
      "title": "LOVE it!!",
      "text": "I love how quickly it got here, and how fast it boots up. That its lighter than a normal laptop. And that it doesn't seem to get warm like a laptop. Its like the best parts of a tablet and laptop combined. Only drawbacks are some things like Kindle and figuring how to make and send documents I have not figured out. And hooking to the printer.... But for watching Netflix and Hulu its fabulous. Facebook is a breeze. I prefer it to my more expensive (and older) Acer laptop.",
      "rating": 5.0,
      "verified": true,
      "author": "Shadowsfire",
      "helpful_votes": 0,
      "publication_date": 20180808
    },
    {
      "title": "Great chromebook!",
      "text": "I love chromebooks. This is the 3rd in our household. I need a larger chromebook to do work from home. Got tired of Windows that needs constant updates and dealing with viruses. Chromebook is so much faster and serves the purpose of what we need our computer to do. I enjoy this chromebook so far. Fast, efficient. Larger screen. Good speaker. Price is good. Glad I got this!",
      "rating": 5.0,
      "verified": true,
      "author": "Trangirl",
      "helpful_votes": 0,
      "publication_date": 20180602
    },
    {
      "title": "Five Stars",
      "text": "luv it! This chromebook is da bomb!!! I love the price and most of all it is so lightning fast! I havent touched my regular office computer since I got this. Its so easy, so fast, and it did take awhile to get my printer set to it but now its great! Makes my work from home job super easy, and best of all my SURFLINE which normally takes forever pops up to show me the surf immediately, LUV LUV LUV",
      "rating": 5.0,
      "verified": true,
      "author": "silvi",
      "helpful_votes": 3,
      "publication_date": 20160913
    },
    {
      "title": "Good Size for Young Children",
      "text": "Purchased for children 3 & 5 to share at home for games and homework. Initially thought it would be too big. Its actually a perfect size for the kids. Durable given the number of times it has been \"dropped\". Excellent price since we did not want to invest too much money into a product that children would eventually break.",
      "rating": 5.0,
      "verified": true,
      "author": "criken",
      "helpful_votes": 3,
      "publication_date": 20160209
    },
    {
      "title": "Unusable after 10 weeks, and Acer won't pay the shipping for warranty repair",
      "text": "About two months after purchase, performance started deteriorating. The Chromebook would become completely unresponsive more and more frequently; the only way to recover the system was to recycle power. A week later, the Chromebook shut itself off and could not be restarted. It is completely, totally unresponsive. That's not even the worst part. After selling me merchandise so defective it lasted barely more than 2 months, Acer demands that *I* pay the shipping fees to return it. Other device makers have sold me defective equipment in the past, but at least they have stood behind their equipment enough to pay the shipping fees for warranty service. Not Acer. You buy their defective merchandise, you pay for the return shipping.",
      "rating": 1.0,
      "verified": true,
      "author": "Christopher J. Falter",
      "helpful_votes": 12,
      "publication_date": 20171004
    },
    {
      "title": "Not so good...",
      "text": "This was a gift for my grandfathers bday. He's always had a PC so this laptop was the first for him! He has seemed to learn quickly, he's owned it almost 1 year but suddenly the screen has become black. It has power, the blue light turn on but no screen? I've connected acer, w are in the middle of a product repair case. Hope they can fix my grandfathers laptop, warranty is still good! This just isn't the place (Amazon) to buy electronics 😕🤷 sorry",
      "rating": 3.0,
      "verified": true,
      "author": "Jessie Holland",
      "helpful_votes": 0,
      "publication_date": 20180622
    },
    {
      "title": "Good value",
      "text": "This is my 3rd Chromebook between work and family use. I went with a bigger screen this time and like it, but it does make it heavier. The only issue is the spacebar needs real pressure applied which makes large amounts of typing a bit of a pain. But I don't usually use that particular Chromebook in that way so it's just a small annoyance.",
      "rating": 4.0,
      "verified": true,
      "author": "Ellie63",
      "helpful_votes": 0,
      "publication_date": 20171215
    },
    {
      "title": "Big screen",
      "text": "Purchased for an elderly relative. This was the biggest screen I could find on a chromebook which is were my main purchasing criteria. The processor and ram are adequate for any general use tasks. No complaints for watching streaming video, editing documents, email etc. This was generally used plugged in so never really tested the battery life, but it was plenty to use around the house. It is still in daily use with no complaints.",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew Feibusch",
      "helpful_votes": 0,
      "publication_date": 20200929
    },
    {
      "title": "Wonderful and worth the wait!",
      "text": "Great color, very clear, the font is wonderful no strain on the eyes, and easy installation. I got the cover to keep it cleaner because itis white and it snaps on so easy it is stupid easy, anyone can do it! My only complaint is that it is heavy but I love all the pros and the the felt to protect the keyboard and the cover to keep it in is a plus too.",
      "rating": 5.0,
      "verified": true,
      "author": "Patti J. Cushman",
      "helpful_votes": 0,
      "publication_date": 20170421
    },
    {
      "title": "Runs great, zippy has heck",
      "text": "Version: Celeron w/ 4GB ram. Pros: Screen is gorgeous. Runs great, zippy has heck. Microsoft Office apps work offline (huge bonus in the chrome ecosystem). Great keyboard. Cons: It's very wide - excessively wide than a typical 16\" laptop. The speakers are garbage (solution: use Bluetooth to connect to an external speaker). Overall: Tremendous price for a very capable computer. Definitely recommend going with 4GB of ram to future-proof yourself.",
      "rating": 5.0,
      "verified": true,
      "author": "E. S.",
      "helpful_votes": 2,
      "publication_date": 20150826
    },
    {
      "title": "It's fine for just google based usage but nothing more",
      "text": "I've had this chromebook for a while now. It's fine for just google based usage but nothing more. Can't watch dvds or listen to cds. Printing is such a pain that need another laptop, which defeats the purpose. I can't seem to stream certain things like sports as on certain websites. I ended up getting a Dell laptop which I love, but I still use this for very basic things like email and reading the news.",
      "rating": 3.0,
      "verified": true,
      "author": "redsox14",
      "helpful_votes": 0,
      "publication_date": 20171213
    },
    {
      "title": "Great Chromebook",
      "text": "i just had the chromebook for a few hours..love the size ..upgrade from my 13\" chromebook ..its refurbished but everything seems to be brand new..i cant tell the difference..thank you for an awesome price and a great looking laptop..very fast ..i only buy refurbished..better price and just as good thanks to the seller",
      "rating": 5.0,
      "verified": true,
      "author": "Karin Elliott",
      "helpful_votes": 0,
      "publication_date": 20171207
    },
    {
      "title": "Love the keyboard",
      "text": "I've been using this more than my 2011 macbook and custom built PC. Love the keyboard, it's not mushy nor is it super cheap feeling. The trackpad is also big and responsive. The speakers, omg the speakers are amazing. I like to watch youtube and take baths, and when the water is running, it was hard to hear stuff with my MacBook, but with this, it's ultra loud and clear. Plan on keeping this one for a few more years. :) Also, be sure to tear off the protective film found on the bottom of the laptop. I didn't and it got all nasty over time.",
      "rating": 5.0,
      "verified": true,
      "author": "Human",
      "helpful_votes": 2,
      "publication_date": 20151120
    },
    {
      "title": "Best Chromebook For $300",
      "text": "Great product! Good quality construction besides that the screen feels a tad flimsy (but dont most laptops feel that way). Packing material is good quality. Arrived with 92% battery. Keyboard feels a bit strange, a higher quality/smoothly molded plastic might improve it. 5ghz internet is a nice feature. Speakers are decent. Touch pad is JUNK! Might be fine for some people, including me, who use an actual mouse (gamer habbits :P) BEST FEATURE: Amazing performance! Good display! (Summon the netflix binge) Would buy again.",
      "rating": 4.0,
      "verified": true,
      "author": "Nate K",
      "helpful_votes": 0,
      "publication_date": 20160824
    },
    {
      "title": "Decent Chromebook, but battery failed in less than a year...",
      "text": "This is a nice student chromebook and works well for my 10 and 11 year old children. They use something similar in school and this bridges the home experience well. I will say that I am disappointed that the battery failed in this one in less than a year. Due to the battery being installed in the unit, I had to order a new battery and will need to take the bottom panel off the machine to replace it. A new laptop should not need to replace a battery in less than a year. I may look for a different manufacturer for my kids next chromebook.",
      "rating": 2.0,
      "verified": true,
      "author": "J. Campbell",
      "helpful_votes": 0,
      "publication_date": 20180906
    },
    {
      "title": "Three Stars",
      "text": "After a year, the screen is flickering and going :(",
      "rating": 3.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 5,
      "publication_date": 20170724
    },
    {
      "title": "I love my Acer Chromebook 15..!",
      "text": "It's been about 3 weeks with my new Chromebook, and loving it..! I'm surprised that Google Docs can now interface with MS Office products, such as Excel, Word, PowerPoint, etc. It really does boot in a few seconds. I have my Gmail account, and/or browser always open, and when I flip the cover and voila!!! The big 15.6\" screen is amazing, and the processing speed is fast, very, very fast... Totally recommend this product. Now I'm considering getting an Acer R11 for versatility and mobility. I've always liked Acer products ever since the early 90s. They're a great reduced cost option compared to actual brand names like the Google Pixel or Apple Books.",
      "rating": 5.0,
      "verified": true,
      "author": "Chito",
      "helpful_votes": 2,
      "publication_date": 20161230
    },
    {
      "title": "All perfect after years of use",
      "text": "Bang for the buck. Although it would have been appreciated to have the screen to be touch screen for the same price model.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Mandeiro",
      "helpful_votes": 0,
      "publication_date": 20200516
    },
    {
      "title": "Get it Now",
      "text": "This Chromebook is absolutely beautiful. Like any other chromebook it functions better than any laptop that I have ever owned and I have owned a number. This is a must have.",
      "rating": 5.0,
      "verified": true,
      "author": "CLBD",
      "helpful_votes": 4,
      "publication_date": 20170214
    },
    {
      "title": "Awesome buy.",
      "text": "Awesome buy....use it everyday. Can't believe it took me so long to purchase one. My go to for getting on the internet.",
      "rating": 5.0,
      "verified": true,
      "author": "Dana M Bealkowski",
      "helpful_votes": 2,
      "publication_date": 20170715
    },
    {
      "title": "It performs like I was hoping it would",
      "text": "I just wanted a faster, quicker online browsing experience as my PC was way too slow. I went with the 4gb cuz I figured the 1 or 2gb version would be the same as what I'm replacing. It performs like I was hoping it would. It's a nice laptop, but for what you get, I think it's a little pricey....",
      "rating": 4.0,
      "verified": true,
      "author": "TB - White Lake",
      "helpful_votes": 2,
      "publication_date": 20180128
    },
    {
      "title": "I loved it, and I love this computer",
      "text": "This is the latest version of the Acer Chromebook. I have had one of the first version up until now. I loved it, and I love this computer. There was a problem at first, until I discovered by accident that the machine required to be updated to OS Chrome. This is done in Settings. I wish I had known that with the previous machine I had to return. It might have worked with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Alainnah Robertson",
      "helpful_votes": 0,
      "publication_date": 20180220
    },
    {
      "title": "This Chromebook won me over to Chrome OS!",
      "text": "Been a Windows user forever. Got tired of dealing with viruses. Don't have any problems with that anymore with this Chromebook. I got this for my wife and Son. My wife only uses it for Facebook, online shows abs surfing the Web. My son uses it for school since they use chromebooks there as well as Google Classroom. This is the perfect solution for our needs.",
      "rating": 5.0,
      "verified": true,
      "author": "Solus Christus",
      "helpful_votes": 2,
      "publication_date": 20151029
    },
    {
      "title": "Best purchase I've made in the last few years",
      "text": "Best purchase I've made in the last few years. This CB has a big beautiful HD screen... great for watching movies and streaming shows. Listening to music is great, the two top mounted speakers are loud and clear. Unit runs very fast and no worry of viruses. Would be great for students going to college. Very nice. I moved up to this one after 2 -3 yrs with the Acer 11 inch CB.",
      "rating": 5.0,
      "verified": true,
      "author": "Nemo",
      "helpful_votes": 0,
      "publication_date": 20170724
    },
    {
      "title": "than this is actually a really great investment. It's cheaper than most laptops",
      "text": "If you plan on doing most of your work online with Google, than this is actually a really great investment. It's cheaper than most laptops, and it runs fast. The battery life is amazing, and it all works really well.",
      "rating": 5.0,
      "verified": true,
      "author": "S. M. Hortin",
      "helpful_votes": 2,
      "publication_date": 20170908
    },
    {
      "title": "Long Lasting!",
      "text": "This is the first refurbished purchase I have ever made. I was a bit leary but it was a great price so I went for it. I am really pleased with my Chromebook. I purchased the white color. It looks really clean and so easy to navigate. The battery life is great. The Acer Chromebook is very lightweight which is a nice switch to what I am used to. I also really like the screen size I chose. It is just the right size and easy to navigate for someone who is NOT tech-savvy.",
      "rating": 5.0,
      "verified": true,
      "author": "Diane",
      "helpful_votes": 0,
      "publication_date": 20200628
    },
    {
      "title": "Love it!!!!!",
      "text": "Great tablet especially for the price! I'm on my second one of the same exact model, not because it didn't work long but because I ruined it by dropping it in a VERY large puddle of muddy yuck. But this thing has better sound than ANY other laptop I've ever had or seen, because the speakers are on top! Very happy with purchase, love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Max Fam ",
      "helpful_votes": 0,
      "publication_date": 20180114
    },
    {
      "title": "Love it! I have an ancient Mac that I ...",
      "text": "Love it! I have an ancient Mac that I use for work, correspondence, etc., but this is a wonderful, portable alternative for surfing, media, etc. Love the larger screen & the light-weight portability. Decent resolution, sound for a good price.",
      "rating": 5.0,
      "verified": true,
      "author": "Joni Resce",
      "helpful_votes": 0,
      "publication_date": 20180117
    },
    {
      "title": "Great Chromebook!",
      "text": "I bought this to upgrade from my 3-year old Chromebook and my first reaction was, \"WOW!\" The picture quality is so much better, it sounds great, it's portable and it has replaced my laptop. It is very easy to use and set up. Would buy recommend and would buy again and again and again!",
      "rating": 5.0,
      "verified": true,
      "author": "Rhonda",
      "helpful_votes": 0,
      "publication_date": 20190112
    },
    {
      "title": "Oh Yes..Speed and all you need for every day computing",
      "text": "My mother's 8 year old laptop was just unusable when I went to visit. It was a Window's 10 running on hardware more in line with Window's 7 or earlier. So for Christmas I bought this Acer Chromebook, never using or seeing one before, and gave it to her. When I went to visit her I asked to check out her new laptop and was surprised at how quickly it booted up and navigated through web pages and youtube. I moved all of her files from the old laptop using google drive to the new one and she cannot be happier. I will purchase one myself as this Toshiba Win10 is too chunky.",
      "rating": 5.0,
      "verified": true,
      "author": "Miles Underfoot",
      "helpful_votes": 0,
      "publication_date": 20170123
    },
    {
      "title": "Screen Problems on two different units",
      "text": "Serious defect. Don't buy. There is something wrong with the screen. First one started flickering and had a pink hue over the entire screen after 2 weeks. I sent it back and received a replacement. Now after 45 days, the second one is doing the same thing. Found a post on the Acer Community forum where others are having the same/similar problem.",
      "rating": 1.0,
      "verified": true,
      "author": "JO",
      "helpful_votes": 19,
      "publication_date": 20151019
    },
    {
      "title": "First Acer 15 Chromebook purchase",
      "text": "Item works good.acer 15 Chromecast starts up quickly once you log on. Google search is Good. Only wish the Acer Chromebook 15 hooked up to WiFi printers cause it didn't work for me .",
      "rating": 4.0,
      "verified": true,
      "author": "jon nay",
      "helpful_votes": 5,
      "publication_date": 20170827
    },
    {
      "title": "Just the thing!",
      "text": "This has been great! It's lightweight with a huge crisp screen. Perfect for my internet surfing habit and the price is just right. I'm a big fan of Google docs for the little bit of personal spreadsheets and documents I need. I do not miss having office products like Word at all! Loved mine so much I bought one for my daughter as well. She's able to use hers for college - the school prefers that the students use their online (like Google Docs) apps over products like Word - so this is perfect!",
      "rating": 5.0,
      "verified": true,
      "author": "Lizzy",
      "helpful_votes": 0,
      "publication_date": 20160104
    },
    {
      "title": "Bought this laptop and within 3 months the display stopped ...",
      "text": "Bought this laptop and within 3 months the display stopped working. Guess I'll try to send it back to the manufacturer because Amazon won't let me send it back",
      "rating": 1.0,
      "verified": true,
      "author": "josephMadre",
      "helpful_votes": 4,
      "publication_date": 20160724
    },
    {
      "title": "(Was) great screen, snappy performance, ok battery life, WiFi unreliable recently",
      "text": "Update 4 years later: I bought two of these, and the screens failed on both of them the same way: the screen has a red tint, a bunch of blank lines, and a strange ghost image of whatever was last displayed. One lasted about there years, the other about four. Still usable, but not great for, say, watching video. Original review: Screen is head and shoulders above those of most Chromebooks. (I compared many of them side-by-side at Google's visitor center.) I don't usually keep more than 6-8 tabs open at once, so I've found the amount of RAM perfectly adequate.",
      "rating": 2.0,
      "verified": true,
      "author": "A. Evans",
      "helpful_votes": 0,
      "publication_date": 20151224
    },
    {
      "title": "Best Chromebook yet!",
      "text": "These Chromebooks have grown up. The ONLY thing missing is keyboard backlighting. I use a Mac as my main machine, and remote into Windows VMs in the cloud all day. I use the Chromebook to keep personal stuff separate from work. But I can also grab the Chromebook and go work somewhere else or on the couch without missing a beat. I often use a wireless keyboard (Anker & Amazon Basics), wired mouse, and wireless headset with this Chromebook. I occasionally hook it up to a second screen for more desktop space. Works great.",
      "rating": 5.0,
      "verified": true,
      "author": "Brad Hutchings",
      "helpful_votes": 0,
      "publication_date": 20150726
    },
    {
      "title": "So far so good! This is a good size Chromebook with a ...",
      "text": "So far so good! This is a good size Chromebook with a very good screen! My 10 year old takes it to school and says it's not too heavy to lug around all day. I think he prefers this one mainly because the size of the screen. It makes it easier to share while working in teams. I also use it on occasion, and it's definitely well built.",
      "rating": 5.0,
      "verified": true,
      "author": "Matt",
      "helpful_votes": 0,
      "publication_date": 20170425
    },
    {
      "title": "HIGHLY disappointed I bought two of these laptops and my husbands ...",
      "text": "HIGHLY disappointed I bought two of these laptops and my husbands refused to turn on after initial factory charge then mine not shortly after!!!! What in the world!!! Guess you get what you pay for....",
      "rating": 1.0,
      "verified": true,
      "author": "Kayla Bohley ",
      "helpful_votes": 4,
      "publication_date": 20170712
    },
    {
      "title": "Omg",
      "text": "I love this I got it from my daughters 9 birthday birthday and she loved it it was so fun for her and it helped her do her online schoolwork if you were looking for a cute easy computer for a young kid that this is the one it is perfect for them I recommend buying this",
      "rating": 5.0,
      "verified": true,
      "author": "Melinda giese",
      "helpful_votes": 0,
      "publication_date": 20200410
    },
    {
      "title": "Very solid device with good performance",
      "text": "Purchased this chromebook for my 75 yr old father to replace a windows7 PC. Had him up and running in minutes and eliminated his frequent calls to me for tech support. Great screen, keyboard and top facing speakers are good as well. Works very well and he is extremely happy with this device. I have used several chromebooks for years and have to say this device is very good all around. I fully recommend for anyone looking for a chromebook with large screen.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim T.",
      "helpful_votes": 0,
      "publication_date": 20170727
    },
    {
      "title": "But the Acer Chromebook 15 is perfect, its about the size of a normal laptop ...",
      "text": "My laptop died a year ago and I needed something simple so I can have a laptop again. I do everything through Google drive anyways so I decided to buy a Chromebook. Plus its reasonably priced, and its everything I could ever ask for. It does take some time to get use to it if you are coming from a PC. Mainly the keyboard, and the setup. But the Acer Chromebook 15 is perfect, its about the size of a normal laptop and the keyboard is big enough to actually be able to type. I love it. Just wish it came in different colors.",
      "rating": 5.0,
      "verified": true,
      "author": "HaleyM",
      "helpful_votes": 2,
      "publication_date": 20160402
    },
    {
      "title": "Great value for the money, does the basics, allows you to travel with less gear",
      "text": "These Chromebooks keep getting better, as long as you don't need to use power intensive applicaitons like Graphic heavy programs or PowerPoint, you can get buy doing almost everything you need to do on the road. The price also makes you less worried about damaging it with the average wear and tear of travel.",
      "rating": 5.0,
      "verified": true,
      "author": "Avi Gur",
      "helpful_votes": 0,
      "publication_date": 20180806
    },
    {
      "title": "Great laptop. Works great",
      "text": "Great laptop. Works great. For my needs and some multitasking works fantastic. Love the NO updates for it. Turns on and off fast. Lightweight even as a 15 incher. Very nice indeed.",
      "rating": 5.0,
      "verified": true,
      "author": "Elena",
      "helpful_votes": 0,
      "publication_date": 20180424
    },
    {
      "title": "like it, but heavy",
      "text": "love the size of this Chromebook, but it is very heavy.....wish there was this size, but less heavy. I had the smaller one to begin with, but it eventually wore out, not able to keep it's charge (had it 3 years)....hopefully this will last awhile, as I have less $$ as I get older",
      "rating": 4.0,
      "verified": true,
      "author": "Midwest Liberal, yeah Me",
      "helpful_votes": 0,
      "publication_date": 20181020
    },
    {
      "title": "Five Stars",
      "text": "Great Chromebook! Set up was very easy that an eight (8) year old did it!!",
      "rating": 5.0,
      "verified": true,
      "author": "Bob",
      "helpful_votes": 3,
      "publication_date": 20180130
    },
    {
      "title": "Computer arrived a day early in good condition.",
      "text": "Handy computer for web browsing, email etc. Large screen is clear and bright. Haven't had it long enough to evaluate battery life but that's not going to matter much to us anyway as it's always plugged in. Nice little computer for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Tom",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "the functionality is great and the matte screen greatly reduces the amount of ...",
      "text": "Overall, the functionality is great and the matte screen greatly reduces the amount of glare. My two complaints are: 1) It's white so it gets dirty very easily. 2) It feels like it's made out of bees nest and feels super flimsy Number 2 hasn't happened yet but I feel like I'm just counting the days.",
      "rating": 5.0,
      "verified": true,
      "author": "Louis Krieger",
      "helpful_votes": 0,
      "publication_date": 20170803
    },
    {
      "title": "Processor is can't keep up with 1080p viewing of NHL ...",
      "text": "Processor is can't keep up with 1080p viewing of NHL hockey game. Maybe the i-3 or i-5 can. Oh, well.",
      "rating": 1.0,
      "verified": true,
      "author": "Dale T.",
      "helpful_votes": 3,
      "publication_date": 20180117
    },
    {
      "title": "Great internet connectivity solution.",
      "text": "This Acer Chromebook meets my expectations for internet connectivity, personal communications and general productivity; the price and my expectations matched.",
      "rating": 4.0,
      "verified": true,
      "author": "Cal Engstrom",
      "helpful_votes": 2,
      "publication_date": 20180117
    },
    {
      "title": "Love it",
      "text": "My first chromebook and i love it good for college papers easy access and hooks up to internet super fast definitely a big change compared to my older hp laptop",
      "rating": 5.0,
      "verified": true,
      "author": "Randi Michael",
      "helpful_votes": 0,
      "publication_date": 20180918
    },
    {
      "title": "Excellent inexpensive option for basic needs.",
      "text": "My needs are pretty basic. I need to surf the internet and occasionally print stuff. I do wish the HD screen were true to color. Its washed out and muted. That's my only complaint, though. This was a great inexpensive choice for me. I don't need a $600+ laptop.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie P.",
      "helpful_votes": 0,
      "publication_date": 20180719
    },
    {
      "title": "This product is wonderful. Fast",
      "text": "This product is wonderful. Fast, fast, fast and beautiful display. No concerns about updates and offers everything I need. Love the large display screen and it doesn't weigh anymore than my previous laptop. No problem keeping the white case clean.",
      "rating": 5.0,
      "verified": true,
      "author": "trueblue",
      "helpful_votes": 6,
      "publication_date": 20150909
    },
    {
      "title": "Love it!",
      "text": "I buy only Chromebooks for my family members that really just want to browse the web. This is my wife's 4th Chromebook. Unfortunately, there was a problem with the screen connection and the picture would go fuzzy. I asked for a replacement and Amazon shipped it right away without waiting for me to send back the bad unit. My wife is really happy with the big screen and resolution. The processor is very responsive and she love's the white color. I only have to provide MINIMAL Tech Support, so everyone's happy!",
      "rating": 5.0,
      "verified": true,
      "author": "Rick",
      "helpful_votes": 0,
      "publication_date": 20150725
    },
    {
      "title": "What's not to like? Impressive 15",
      "text": "What's not to like ? Impressive 15.6\" screen framed in a beautiful white case with full HD makes watching videos & movies fun ! This thing is HUGE and I look forward to using it for work & pleasure. Very satisfied with purchase and Amazon PRIME.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim Cowan",
      "helpful_votes": 0,
      "publication_date": 20170727
    },
    {
      "title": "ACER,YOU'RE THE MAN",
      "text": "I got my Acer 15.6 Cromebook today, i'm Soooo inlove with it already, love the bigger screen, the volume is really loud, trust me people, this laptop is the BooM, i bought the 11.6\" 18 months ago, still working great, i give 5 stars to both of these beautiful laptops.",
      "rating": 5.0,
      "verified": true,
      "author": "queen Simmons",
      "helpful_votes": 2,
      "publication_date": 20170810
    },
    {
      "title": "Primary machine. Use for web development.",
      "text": "This Exceeded my expectations in speed, stability and utility. I've had the machine for about one month and I'm glad I got it. The battery life and charge time is great (~7 hours), screen quality, brightness, speakers are not-deficient. With the 4/32 ram/SSD setup I'm duel runing Ubuntu 12.04 for my developing environment and Chrome OS for internet/media stuff. I say go for it.",
      "rating": 5.0,
      "verified": true,
      "author": "Software dev",
      "helpful_votes": 3,
      "publication_date": 20151123
    },
    {
      "title": "Maybe it’s me but I can’t get used to this",
      "text": "Maybe it’s me but I cannot get used to this computer. It’s not easily compatiable with Microsoft and other programs I need to use for school. However, I love the size of the screen. It’s very big though so if you want something light weight I wouldn’t recommend this computer.",
      "rating": 2.0,
      "verified": true,
      "author": "Abigail",
      "helpful_votes": 0,
      "publication_date": 20180918
    },
    {
      "title": "Not a \"9 hour\" battery life or a \"7 second boot-up\"",
      "text": "Lots of false advertising by the company selling this product. The \"9 hour\" battery lasted for about two months, now I'm lucky if I get five hours out of it. Additionally, the \"7 second boot-up\" is flagrantly false, since it came out the box it's been a minimum of 25 seconds, usually closer to 45. It does have a good hi-res screen. But the audio is awful, sounds like 1980's plastic speakers. Not worth the money compared to the HP version of Chromebook that friends have & the battery actually lasts what it says it does for more than a couple of months.",
      "rating": 2.0,
      "verified": true,
      "author": "Patrick O'Hara",
      "helpful_votes": 0,
      "publication_date": 20180612
    },
    {
      "title": "fast and smooth",
      "text": "This feels so luxurious! Switching from a windows laptop and it's SO fast and smooth. Screen is bigger than I expected. I'm used to a 17 inch laptop and this isn't too horrible",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 2,
      "publication_date": 20170526
    },
    {
      "title": "Like the bigger screen",
      "text": "I love Chromebooks!! My old one was a 14\" so this one has a much bigger screen. The other thing I like is, unlike the older one, this has full access to Google Play. The \"Chrome Store\" is fairly limited in its offerings. Really was a good buy!!",
      "rating": 5.0,
      "verified": true,
      "author": "Leslie W. Molnar",
      "helpful_votes": 0,
      "publication_date": 20180922
    },
    {
      "title": "really enjoy this",
      "text": "i love the white, looks so clean if you keep it clean. size is great. does everything any laptop would do. the sound isn't great, a little tinny and not very loud, probably better with earbuds.",
      "rating": 5.0,
      "verified": true,
      "author": "G. DELLINGER",
      "helpful_votes": 0,
      "publication_date": 20181014
    },
    {
      "title": "I really like the chromebook",
      "text": "I really like the chromebook. Delivery was fast. The product works great. The speakers sound great. I was afraid I would miss my windows laptop but I love my chromebook.",
      "rating": 5.0,
      "verified": true,
      "author": "BlueDiamond",
      "helpful_votes": 0,
      "publication_date": 20171130
    },
    {
      "title": "Five Stars",
      "text": "I gave it a 5 star rating before however after only 3 months I started to have problems with this Chromebook ,It won't come on as it did before ,it takes bet 3 to 5 minutes to start and this is beyond ridiculous ,I'm very disappointed and frustrated with this purchase",
      "rating": 1.0,
      "verified": true,
      "author": "Rod Helfer",
      "helpful_votes": 0,
      "publication_date": 20180319
    },
    {
      "title": "SD card...",
      "text": "This laptop works great and I love it other than the fact that the SD card slot does not allow the SD card to go all the way into the computer so the it risks being broken. but with the large memory in the computer there is no need for a SD card if you don't want one. But I have found that this is very common in all chomebooks so if your looking for a good chrome book this is the one to buy",
      "rating": 5.0,
      "verified": true,
      "author": "Bassline",
      "helpful_votes": 0,
      "publication_date": 20160105
    },
    {
      "title": "Good, but heavy.",
      "text": "This laptop overall is great value. It gets the job done and is pretty easy to use. I purchased mine for schoolwork and it has worked great. Only downside is how heavy it is and it’s sometimes hard to take with me to school since it is also pretty large and doesn’t fit in all of my backpacks. Good product if you want something mainly for the home though!",
      "rating": 4.0,
      "verified": true,
      "author": "Wendy Mendez",
      "helpful_votes": 0,
      "publication_date": 20190107
    },
    {
      "title": "good choose",
      "text": "fast thin large screen. Battery life not as strong as id like but nice unit !",
      "rating": 5.0,
      "verified": true,
      "author": "PJ Speezz",
      "helpful_votes": 0,
      "publication_date": 20200502
    },
    {
      "title": "This is great if everything you do is web-based",
      "text": "This is great if everything you do is web-based. I love it. Super good deal for me because everything I used my laptop for was online, so this is faster and was cheaper than a replacement.",
      "rating": 5.0,
      "verified": true,
      "author": "Swanky P.",
      "helpful_votes": 2,
      "publication_date": 20160419
    },
    {
      "title": "Excellent for web browsing and light office work",
      "text": "Bought this for my wife as a replacement for a dying Compaq Presario. It took her a bit of time to get used to the track pad, but she quickly adapted, and she loves it. For the size, it is surprisingly light weight. Boot times are extremely fast, you can go from power off to login screen in about 10 seconds, and another 5 seconds tops to go from log in to desktop. My only complaint is the power adapter is extremely small, and not durable. Need to be VERY careful with it, or it will break.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161207
    },
    {
      "title": "Love this Chromebook",
      "text": "Absolutely great video and sound, and Chrome OS is so much better than Windows. I am sorry that I did not give up Microsoft and go to Chrome a long time ago. I will never go back. Google has a much better idea, and Acer has come up with the right combination of components. Bright sharp video, amazing sound, fast start up, no endless updates or crashes, easy to navigate, does everything I want to do, looks good, and VERY reasonable price for what you get. Get one today, you will not be disappointed!",
      "rating": 5.0,
      "verified": true,
      "author": "Wayne D Rebrook",
      "helpful_votes": 0,
      "publication_date": 20171011
    },
    {
      "title": "This computer has been awesome! It's fast and easy to use and serves ...",
      "text": "This computer has been awesome! It's fast and easy to use and serves it's purpose, which for me is just light use. My only compliant is that it's not compatible with iTunes (which I didn't realize) and I can't hook it up to my printer because HP doesn't have the drivers for chrome, so I have to keep my old labtop for printing and music. But a great buy, would recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Shay H",
      "helpful_votes": 0,
      "publication_date": 20170824
    },
    {
      "title": "really really happy with htis",
      "text": "Incredible value for the money, really really happy with htis",
      "rating": 5.0,
      "verified": true,
      "author": "Connie",
      "helpful_votes": 0,
      "publication_date": 20180424
    },
    {
      "title": "... was for my sister and I haven't heard any bad feedback from her",
      "text": "This was for my sister and I haven't heard any bad feedback from her, so I assume all is good with this item. Reasonable priced!",
      "rating": 5.0,
      "verified": true,
      "author": "Pam",
      "helpful_votes": 0,
      "publication_date": 20180620
    },
    {
      "title": "One Star",
      "text": "Screen goes black at random times, requiring a restart. Item returned.",
      "rating": 1.0,
      "verified": true,
      "author": "bob j",
      "helpful_votes": 2,
      "publication_date": 20180210
    },
    {
      "title": "Great machine, instant on and ready to go",
      "text": "Great machine, instant on and ready to go. Battery last real long time. Only thing I have problem with and not really worth telling, the letters on the keys are not as clear as past computer.",
      "rating": 5.0,
      "verified": true,
      "author": "James Lairson",
      "helpful_votes": 0,
      "publication_date": 20170805
    }
  ],
  "product_meta": {
    "title": "Acer Chromebook 15 CB5-571-C09S (15.6-Inch Full HD IPS, 4GB RAM, 32GB SSD)",
    "description": "CPU:Celeron| Capacity:32GBAcer CB5-571-C09S Chromebook comes with these high level specs: Intel Celeron Dual-Core Processor 3205U, Chrome, 15.6\" Full HD IPS Widescreen LED-backlit Display, Intel HD Graphics, 4GB DDR3L Memory, 32GB SSD, Secure Digital (SD) card reader (supports up to 128GB SDXC), 802.11AC WiFi featuring MIMO technology (Dual-Band 2.4GHz and 5GHz), Bluetooth 4.0, HD Webcam (1280 x 720), supports High Dynamic Range (HDR), 1 - USB 2.0 Port, 1 - USB 3.0 Port, 1 - HDMI Port, 4-cell Li-ion Battery (3220 mAh), Up to 9-hours Battery Life, 4.85 lbs. | 2.2 kg (system unit only) (NX.MUNAA.003)\n\nAMAZON.COM",
    "rating": 4.2,
    "feature_bullets": [
      "Intel Celeron 1.6 GHz",
      "4 GB DDR3L SDRAM",
      "32 GB Solid-State Drive",
      "15.6-Inch Screen, Intel HD Graphics",
      "Chrome, 9-hour battery life"
    ],
    "specifications": {
      "Standing screen display size": "15.6 Inches",
      "Screen Resolution": "1920x1080 Full HD",
      "Max Screen Resolution": "1920 x 1080 Pixels",
      "Memory Speed": "1600 MHz",
      "Graphics Coprocessor": "Intel HD Graphics",
      "Chipset Brand": "Intel",
      "Card Description": "Integrated",
      "Wireless Type": "802.11ac",
      "Number of USB 2.0 Ports": "1",
      "Number of USB 3.0 Ports": "1",
      "Average Battery Life (in hours)": "9 Hours",
      "Brand": "Acer",
      "Series": "CB5-571",
      "Item model number": "CB5-571-C09S",
      "Hardware Platform": "Unknown",
      "Operating System": "Chrome OS",
      "Item Weight": "4.85 pounds",
      "Product Dimensions": "15.08 x 9.65 x 0.97 inches",
      "Item Dimensions  LxWxH": "15.08 x 9.65 x 0.97 inches",
      "Color": "Linen White",
      "Processor Brand": "Intel",
      "Processor Count": "1",
      "Computer Memory Type": "Unknown",
      "Flash Memory Size": "32",
      "Hard Drive Interface": "Unknown",
      "Power Source": "AC & Battery",
      "Batteries": "1 Lithium Polymer batteries required.",
      "ASIN": "B00T03KQ34",
      "Customer Reviews": "4.2 out of 5 stars658 ratings4.2 out of 5 stars",
      "Best Sellers Rank": "#23,517 in Computers & Accessories",
      "Date First Available": "March 18, 2015"
    },
    "categories": [
      "Computers & Accessories",
      "Laptops",
      "Electronics",
      "Traditional Laptops",
      "Computers & Tablets"
    ],
    "price": ""
  }
}