{
  "website_summaries": [
    {
      "verdict": "A well-loved brand with a loyal following, these socks are a decent budget option if odor control and breathability are more of a concern than durability.",
      "pros": [
        "Enhanced with patented Fresh IQ Odor Protection Technology",
        "Toe seam designed for comfort",
        "Cushioning in sole",
        "Wash well with no pilling or shrinkage",
        "Affordable"
      ],
      "cons": [
        "Thin material",
        "Wear out faster than other athletic socks"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "ZERO % cotton, and they contain LATEX! What about people with latex allergies?",
      "text": "The label reads 97% polyester, 1% natural latex rubber, 1% spandex, and 1 % nylon. So they contain ZERO % cotton. Two questions: what about people with LATEX ALLERGIES, and who is going to fix this?",
      "rating": 1.0,
      "verified": true,
      "author": "Peter in NYC",
      "helpful_votes": 0,
      "publication_date": 20170917
    },
    {
      "title": "Did they say 84% cotton?",
      "text": "Description states: 84% Cotton, 14% Polyester, 2% Nylon. Packaging states: 97% Polyester, 1% Natural Latex, 1% Spanex, 1% Nylon. Look elsewhere if you want cotton socks.",
      "rating": 1.0,
      "verified": true,
      "author": "Richard P. Janda Jr.",
      "helpful_votes": 0,
      "publication_date": 20171201
    },
    {
      "title": "but I was very disappointed. They look and feel very cheap",
      "text": "Unfortunately, these are very low-quality socks. I bought them because they were made by a name brand, but I was very disappointed. They look and feel very cheap. I washed them (hoping the fabric would tighten up a little bit), but I think they're mostly man-made material because they didn't shrink at all. It feels like I'm wearing cheese cloth on my feet... I wore a couple pairs and then just threw them all away.",
      "rating": 1.0,
      "verified": false,
      "author": "Chris and Alyssa",
      "helpful_votes": 0,
      "publication_date": 20171223
    },
    {
      "title": "Besides thin material, these socks are short: about ...",
      "text": "Besides thin material, these socks are short: about 1 1/4\" shorter than a crew sock should be. Is Hanes spending too much money on advertising when they should be spending that money on FABRIC. I guess now-a-days when you buy Hanes you're buying HYPE. If there's anything I can't stand: it's a short sock. These will be going right to the thrift store, where perhaps 50 cents/pair is a more realistic \"retail\" price. I hope Hanes investors are making money - because I just threw $12 away.",
      "rating": 1.0,
      "verified": false,
      "author": "bertwest",
      "helpful_votes": 0,
      "publication_date": 20160612
    },
    {
      "title": "Too big.  Hanes doesn't care about it's customers.",
      "text": "I bought these at a Hanes store and they were too big. They wouldn't let me return them since they were worn. (1 sock was worn for about 10 seconds). Conclusion: I will never buy Hanes products again.",
      "rating": 1.0,
      "verified": false,
      "author": "Andy",
      "helpful_votes": 0,
      "publication_date": 20180516
    },
    {
      "title": "Elastic died.",
      "text": "The fit was fine, but after i washed them 4 or 5 times the elastic just died in them. As you pull them up you can hear the stuff braking ...",
      "rating": 2.0,
      "verified": false,
      "author": "Stephen",
      "helpful_votes": 0,
      "publication_date": 20180423
    },
    {
      "title": "These socks are terrible",
      "text": "I thought Hanes was a good middle of the road brand. These socks are unusable. I threw them out.",
      "rating": 1.0,
      "verified": false,
      "author": "Erik Haggstrom",
      "helpful_votes": 0,
      "publication_date": 20190308
    },
    {
      "title": "Very poor quality sock",
      "text": "Very poor quality sock. Hanes should be embarrassed these are so thin. Never again will I buy these. Go to Sam's and get theirs. They're still a good quality sock for the money.",
      "rating": 1.0,
      "verified": false,
      "author": "Elizabeth Maro",
      "helpful_votes": 0,
      "publication_date": 20180519
    },
    {
      "title": "Not soft/pliable",
      "text": "These socks are not soft or pliable, the elastic material in them feels like it’ll be gone be within a a couple washes rather than a couple dozen washes.",
      "rating": 2.0,
      "verified": false,
      "author": "Ktawfik",
      "helpful_votes": 0,
      "publication_date": 20180123
    },
    {
      "title": "WORST SOCKS - EVEN AFTER LIKE 3 WASHES THEY STILL ...",
      "text": "WORST SOCKS - EVEN AFTER LIKE 3 WASHES THEY STILL SHED AND LEAVE BLACK STUFF ALL OVER YOUR FEET SUPER CHEAP",
      "rating": 1.0,
      "verified": false,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160621
    }
  ],
  "product_meta": {
    "title": "Hanes Men's FreshIQ Crew Socks 12 Pack",
    "description": "Crew socks made with cotton for all over softness, superior fit and ultimate durability",
    "rating": 1.2,
    "feature_bullets": [
      "98% Polyester/1% Nylon/1% Spandex; 97% Polyester/1% Nylon/1% Spandex/1% Natural Latex Rubber",
      "Imported",
      "Pull On closure",
      "Machine Wash",
      "Cotton/polyester/natural latex rubber/nylon",
      "Fresh IQ advanced odor protection technology attacks odor-causing bacteria in your clothing to help you feel fresh all day",
      "12-pair pack. Crew length socks stay up and hits at mid-calf",
      "Comfort toe seam, our most comfortable seam ever",
      "Grey cushioned sole for extra comfort",
      "Crew socks each featuring ribbed leg"
    ],
    "categories": [
      "Men",
      "Clothing, Shoes & Jewelry",
      "Clothing",
      "Casual Socks",
      "Socks"
    ],
    "price": "",
    "specifications": {}
  }
}