{
  "website_summaries": [
    {
      "verdict": "Durable hand truck with a high weight capacity and top-of-the-line construction.",
      "pros": [
        "Can hold up to 275 lb",
        "Telescope handle can extend up to 42\"",
        "Wheels are made of durable rubber that can travel over most terrain",
        "Folds to 2.5\" thick when collapsed",
        "Aluminum frame won't rust",
        "Weighs in at 10 lb",
        "with nothing on it"
      ],
      "cons": [
        "Expensive when compared to other hand trucks"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "Sturdy, easy to use, and portable. The best hand truck/dolly on the market today.",
      "pros": [
        "High-quality, heavy-duty dolly",
        "Folds for easy portability",
        "Aluminum and plastic construction weighs just ten pounds, and it won't rust"
      ],
      "cons": [
        "Relatively more expensive, but you are paying for quality and durability"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Works great! Purchased for our Sales Department to carry Concrete ...",
      "text": "Works great! Purchased for our Sales Department to carry Concrete Samples to our Customers.Seems sturdy, portable, fits great in the trunk of the Salemen's cars. Easy to unfold and use.",
      "rating": 5.0,
      "verified": true,
      "author": "MelGJ",
      "helpful_votes": 15,
      "publication_date": 20180730
    },
    {
      "title": "Don’t get a foldable!",
      "text": "This worked ok for a few weeks the the wheels became stuck in folded position and was useless.",
      "rating": 1.0,
      "verified": true,
      "author": "x54odin",
      "helpful_votes": 6,
      "publication_date": 20190825
    },
    {
      "title": "Cheap wheels",
      "text": "The wheels are not sturdy. Already wearing out and I’ve only had it for two months.",
      "rating": 1.0,
      "verified": true,
      "author": "Catherine Rotan",
      "helpful_votes": 6,
      "publication_date": 20190831
    },
    {
      "title": "Fails To Unfold - Then A Battle!",
      "text": "It was great for about two years of light use then it stopped unfolding without a fight that involves two people or both hands and one leg. When I try to pull the platform down the wheels no longer unfold and lock in. I have to get into a contorted position to stand on one foot, use the other to try to unfold the platform, and leaning over it use both hands to push the wheels apart! Not easy to do as a senior. A serious agility test. I don't mind fixing things but I can't find the source of the problem. So I have a too short regular unfordable hand truck. It goes in the trash.",
      "rating": 2.0,
      "verified": true,
      "author": "James Preston",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "Not as advertised",
      "text": "Really sticks to bog down with a case of paper. There aren't any bushings to prevent the wheels from running against the frame or to keep them running strait. I wouldn't buy it again and use it reluctantly. It's been this way since day one and I should have returned it when I had the chance.",
      "rating": 1.0,
      "verified": true,
      "author": "Brett S",
      "helpful_votes": 4,
      "publication_date": 20190731
    },
    {
      "title": "AVOID!",
      "text": "Junk! The wheels buckle inward with a load of 50 lbs. making it very difficult to manouver. Instead of pulling it comfortably, you gotta drag it with all your might.",
      "rating": 1.0,
      "verified": true,
      "author": "mike",
      "helpful_votes": 9,
      "publication_date": 20180213
    },
    {
      "title": "Trusted sturdiness",
      "text": "I had purchased a less sturdy, lesser priced hand truck dolly from a well known home improvement store for small tasks around the house and it didn't last. This one will do the job no doubt. We haul bags of compost, mulch, 5-gal pails of soil, water softener salt, garbage cans, etc and it all goes down cement terracing steps. This dolly is much sturdier and though it's stated as a few pounds heavier there is little notice because the wheels and how it handles is wonderful. For anyone aging or with back issues this is worth the the price!",
      "rating": 5.0,
      "verified": true,
      "author": "Marguerite",
      "helpful_votes": 0,
      "publication_date": 20190921
    },
    {
      "title": "After four months, no complaints...",
      "text": "So far, so good. I've used this cart now for about 4 months, and while I can't say for sure it can be loaded to its stated capacity, it does handle loads of 75-100# without issue. I use it for moving musical equipment (amplifiers, instrument flight cases, toolbox, etc, etc). I am curious how it holds up long term; nice light weight design, but seems pretty well engineered. Price was right, ease of use has been fine, and I particularly like the portability and storage footprint of the unit. Here's hoping it lasts and lasts!",
      "rating": 4.0,
      "verified": true,
      "author": "Wedloe",
      "helpful_votes": 2,
      "publication_date": 20180723
    },
    {
      "title": "So Far I Love It Best Small Dolly Yet!",
      "text": "Very nice! I had a slight bit of trouble getting the handle extended, but it's up now. Might be because it was new....and I'm old lol. This saves my back as well as extra steps. I order everything I can online and have to get big boxes inside so this is great. I had smaller cheaper ones that wobbled and eventually broke or warped. I have high hopes for this one. It is so much nicer and very sturdy. It is light and I can easily fold it and place in SUV.",
      "rating": 5.0,
      "verified": true,
      "author": "ClassCultureStyle",
      "helpful_votes": 0,
      "publication_date": 20191004
    },
    {
      "title": "NOT STURDY",
      "text": "My dad bought this item for work to roll his work bag on he only used it max 3 times before one of the wheels snapped off. The worst part was that he didn’t even load anything on when the wheel came off. All he did was unfold it and it was falling off. Unfortunately he missed his grace period for returns but I really hope they can take care of this :/.",
      "rating": 1.0,
      "verified": true,
      "author": "Viviana Jurado",
      "helpful_votes": 2,
      "publication_date": 20200910
    },
    {
      "title": "Best one I've used yet",
      "text": "So the first one I bought had a loose axle nut so while transporting it came out and the wheel fell off. No clue where the nut went so I returned for an exchange. After checking torque on the replacement it's been absolutely solid. Shopping trips to costco using the insta cargo boxes is a breeze. Smooth rolling, large platform, almost as good as one of the standard hand trucks (dollies). When folded, the wheels stick out just enough at the bottom so you can still roll it instead of having to carry it.",
      "rating": 5.0,
      "verified": true,
      "author": "Monkie",
      "helpful_votes": 0,
      "publication_date": 20200917
    },
    {
      "title": "Solid and useful as hell",
      "text": "My only concern before buying was how solid it really was and I was not disappointed... It feels very heavy duty and really sturdy so no concern there. Now that I own it, my only complaint is that the wheels and tray don't necessarily lock in place but I wish they did. I wish there was a latch or something that would lock the wheels and tray open no matter what, but that's not really a consistent concern, just something that would be nice to add. I'm still very happy with it and plan to continue using it for years. Definitely worth the money.",
      "rating": 4.0,
      "verified": true,
      "author": "Adam Wright",
      "helpful_votes": 0,
      "publication_date": 20201027
    },
    {
      "title": "Its ease of operation.",
      "text": "I purchased this for my husband. He's 87 yrs. old and uses it to take the garbage out. Sometimes the bags are heavy and I don't have to worry about him hurting himself lifting or falling. He also uses it to maneuver things around the garage. He's still very active and it has enabled him to do a lot of things he couldn't do without it.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan Marie",
      "helpful_votes": 2,
      "publication_date": 20191009
    },
    {
      "title": "Really large, yet surprising lightweight!!",
      "text": "I deliver packages all day long and have to haul a large amount of boxes and stuff, when my old handtruck started showign its age (2+ years) I looked for another one, hopefully larger than my current one. The specs don't do this handtruck justice, it is only a couple inches wider and taller, but feels like I could move fridges with this thing it is so sturdy! And yet it is really lightweight!! The wheels are amazing, this cart feels like it is floatign on air it is so easy to move. I am VERY happy with this purchase and I would highly recommend this to anyone that needs one!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20181012
    },
    {
      "title": "Great product",
      "text": "This dolly was exactly what I was looking for to move my Honda 2000 generator back and forth. Sturdy and extremely easy to use. The bonus is in the design. When your done using the dolly it folds up creating a small unit that can easily be hung in your garage or stored out of the way. Excellent design and function!",
      "rating": 5.0,
      "verified": true,
      "author": "Pwdrski",
      "helpful_votes": 0,
      "publication_date": 20191125
    },
    {
      "title": "Solid cart for working musician",
      "text": "I'm a guitarist, and have used it now for many gigs, carrying my amplifier, gadget bag and music stand all at once. I use a flat bungee cord to keep the three items fastened to the cart; otherwise they may fall off. I wish the nose plate were longer, as it would add some stability. The large rubber wheels roll very smoothly, even in snowy parking lots. The cart folders up compactly and quickly. This cart is a big improvement over the office style cart I struggled with before.",
      "rating": 4.0,
      "verified": true,
      "author": "Denis K",
      "helpful_votes": 3,
      "publication_date": 20161217
    },
    {
      "title": "No back pain",
      "text": "This is my second foldable wheeled cart and would be without one for moving just about anything inside or outside the house. First model last approx 15 year and worth every penny especially the wear and tear on my aging back. Five star all the way. Rick",
      "rating": 5.0,
      "verified": true,
      "author": "Richard E. Lane",
      "helpful_votes": 0,
      "publication_date": 20191111
    },
    {
      "title": "Save your back",
      "text": "Im an hvac service tech, i do alot of big type of repairs from evap coils compressors heat exchangers. I bought the dolly to help save my back. Very nice and compact. The wheels fold in when the platform is fold up. I have moved some heavier parts with it no problem.",
      "rating": 5.0,
      "verified": true,
      "author": "dan",
      "helpful_votes": 0,
      "publication_date": 20190809
    },
    {
      "title": "Just what we needed",
      "text": "I bought this for an apartment move of a block and half so that we could carry things over before and after the movers did the heavy lifting. It works like a dream, folds up for easy storage, and balances very well when toting things. It has done quite a lot of heavy moving over the last 3 weeks and has stood up to it. It was invaluable and I am very happy with it, and we will now use it when we go to book fairs and readings to tote my husband's novels and display items. I bought a bag of bungee cords to go with it which was also helpful.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190716
    },
    {
      "title": "POS",
      "text": "Genuine POS. The button that is supposed to latch the handle in place never worked, consequently the unit is next to worthless.",
      "rating": 1.0,
      "verified": true,
      "author": "Joseph Nevotti, Ph.D.",
      "helpful_votes": 4,
      "publication_date": 20180618
    },
    {
      "title": "Great light weight hand cart!",
      "text": "After several months of use, just had to do a review! This cart is easy to fold and use for lots of items from moving boxes to unloading shopping. Folds and unfolds easily, just lean platform forward and catch with your foot to unfold and lean forwards to fold. Just remember this is a light weight cart, not designed for really heavy loads, two cases of bottled water is a good limit. Otherwise a great Household addition to save your back. Large wheels are a plus, especially for stairs. A very handy item to have around the house and easy to put in a vehicle as well!",
      "rating": 5.0,
      "verified": true,
      "author": "Steve R",
      "helpful_votes": 0,
      "publication_date": 20200820
    },
    {
      "title": "Good Product",
      "text": "I repurposed this as a Disc Golf cart so far it has held up to some heavy abuse & mud. I did have to remove a wheel and reattach the bearing it came loose due to hitting a big rock. I like that it's 42\" tall 19\" wide with 7\" wheels. I am 6' 2\" & have no problem pulling the cart through all kinds of terrain. Not sure about it holding heavy objects have never tried it out. My only gripe is that the wheels sometimes don't lock out straight and turn in slightly. Not sure why doesn't really have to much effect on the use of the product.",
      "rating": 4.0,
      "verified": true,
      "author": "David R. Diaz",
      "helpful_votes": 8,
      "publication_date": 20150701
    },
    {
      "title": "Great cart",
      "text": "Great relatively heavy duty cart. For a very light weight and portable cart it is quite heavy duty and should carry the rated weight capacity though I haven’t tested that.",
      "rating": 5.0,
      "verified": true,
      "author": "Lynn",
      "helpful_votes": 0,
      "publication_date": 20191114
    },
    {
      "title": "Light weight fits in back of SUV easily.",
      "text": "It's great for moving moderately heavy boxes across the parking lot to my apartment. Doesn't take up much space. Just do not expect to move refrigerators with it.",
      "rating": 5.0,
      "verified": true,
      "author": "TBAustin",
      "helpful_votes": 0,
      "publication_date": 20191203
    },
    {
      "title": "wheels turn in while pulling",
      "text": "I like it very much but for some reason when I am pulling the cart the wheels are turn inwards so it becomes hard to pull. When I am pushing the dolly it is easy to push because the wheel are turn inward. The is the only comment that I have. Maybe for some reason I am the only one that has that problem.",
      "rating": 3.0,
      "verified": true,
      "author": "Robert S. Tamashiro",
      "helpful_votes": 2,
      "publication_date": 20190508
    },
    {
      "title": "Overwelmed!",
      "text": "This hand truck far surpassed all expectations. So well designed and manufactured, much better than others I have used. Great strength , compact , ease of use and handle proper height for folding and weight load. Excellent!",
      "rating": 5.0,
      "verified": true,
      "author": "SterlingNite",
      "helpful_votes": 22,
      "publication_date": 20140411
    },
    {
      "title": "Easy to store, easy to operate, and works well for what I need it for every week.",
      "text": "This was exactly what I was looking for. I use it every week to move large yard waste cans that are too heavy for me to lift and carry down to the street each week. I wrap a flat bungee cord around the can and a attach it to the hand truck then pull it from my back yard to the curb in the front of the house. When I am done I fold the hand truck and roll it out of the way along my garage wall. It is easy to use, works well, and takes very little space to store.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20191109
    },
    {
      "title": "Lasted about 9 months",
      "text": "This dolly is great, when it opens easily. It is very compact, folds together nicely and is easy to store. However, it no longer opens without a struggle. It worked so well, and we're making the difficult unfolding work, but it would be nice if it continued to function as intended.",
      "rating": 3.0,
      "verified": true,
      "author": "Katie in Michigan",
      "helpful_votes": 0,
      "publication_date": 20190920
    },
    {
      "title": "Convenient, and Sturdily Built",
      "text": "The folding design that stays in configuration during makes for a convenient, small dolly for minor jobs moving heavy items. Not quite as \"lightweight\" as I'd inferred from the product's adverts, but overall it was a good buy. Would buy again, no doubt.",
      "rating": 5.0,
      "verified": true,
      "author": "PT",
      "helpful_votes": 0,
      "publication_date": 20190503
    },
    {
      "title": "Not as good as I had hoped.",
      "text": "Pro: compact, foldable design. Decent sized load plate Con: Handle a bit short (I'm 5'8\"), wheels really too small for anything other than a smooth, level path. Steps are a real challenge with any sort of load.",
      "rating": 3.0,
      "verified": true,
      "author": "melwest",
      "helpful_votes": 6,
      "publication_date": 20160313
    },
    {
      "title": "Very well designed",
      "text": "I owned another, older folding hand truck that I never liked, so I bought this one to replace it. This one is much better. Pros: 1. Easy and fast to fold and unfold. 2. Stays folded. 3. Bottom platform and back will hold narrow and shallow items. 4. Sturdy. 5. Big wheels are very smooth and quiet. 6. Compact -- folds flat without protruding parts. This one is slightly heavier than my old one, but about the same or lighter than comparable models I considered before buying it.",
      "rating": 4.0,
      "verified": true,
      "author": "Michael Knoll",
      "helpful_votes": 5,
      "publication_date": 20140108
    },
    {
      "title": "Vergo Industrial 275 lbs Capacity Folding Hand Truck Dolly",
      "text": "This is a great hand truck dolly. The dolly is strong, sturdy and well balanced. It is easy to carry and will not take up much space in a closet. Most importantly it is the best value of any Hand truck dolly I could find.",
      "rating": 5.0,
      "verified": true,
      "author": "GALA",
      "helpful_votes": 15,
      "publication_date": 20140220
    },
    {
      "title": "Perfect all around cart",
      "text": "Perfect all around cart... I searched and searched for one with a large bottom shelf...Accommodates a 20 inch fan laying flat perfectly...luggage on top",
      "rating": 5.0,
      "verified": true,
      "author": "dale mills",
      "helpful_votes": 2,
      "publication_date": 20170728
    },
    {
      "title": "This is the only folding hand-truck I have found suitable ...",
      "text": "This is the only folding hand-truck I have found suitable for commercial use. Most are light duty. This is at least medium duty. My technicians' vans are full of parts and tools. Having a hand truck that takes very little room AND can also handle a load is a big plus.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric Kahn",
      "helpful_votes": 2,
      "publication_date": 20171130
    },
    {
      "title": "This is a great product and very durable!",
      "text": "This is a great product. I have been buying these fold up carts for several years now. Normally, I have been purchasing the slightly smaller hand truck that only holds 150 pounds and we were replacing them about three to four months. So, I was thrilled to find a larger folding hand truck that could handle 250 pounds and still small enough to fold up flat and keep in the trunk of my car and still \"have my trunk\". The best feature is that the handle is about 4\" taller than the other models we have used which is the perfect height to move around without having bend over slightly.",
      "rating": 5.0,
      "verified": true,
      "author": "Ron Mann",
      "helpful_votes": 0,
      "publication_date": 20160510
    },
    {
      "title": "Overall happy with quality and price.",
      "text": "I have only had it for a few weeks so far and it's been great. It is surprising beefy which makes me feel pretty confident that it will hold up. I purchased it with plans to use it for hauling tools back and forth to my truck and small/light weight cabinets. The only down sides is that it seems to be designed for smooth even surfaces, does not do well on rough surfaces with rocks or wood scraps. Handle could be a little taller. Overall I'm happy with quality and price.",
      "rating": 4.0,
      "verified": true,
      "author": "Jonsjerk",
      "helpful_votes": 2,
      "publication_date": 20140814
    },
    {
      "title": "Sturdy construction",
      "text": "Very sturdy, I use it to haul a bunch of heavy sound equipment from mixer racks to speakers. It holds out all the weight I've put on it and glides across smooth surfaces. But the wheels are not filled with air, so if you use it across sidewalk cracks it will make a noise over every crack which can get annoying. Love the compact design and how the wheels fold when you fold the bottom. Feels very firm and should last me a long time, which is what I wanted.",
      "rating": 5.0,
      "verified": true,
      "author": "Ben",
      "helpful_votes": 3,
      "publication_date": 20141125
    },
    {
      "title": "Easy to open and close and the longer handle is great for tall people.",
      "text": "As a senior I need a great dolly to move things. This cart has it all and the longer handle is especially helpful compared to my old dolly.",
      "rating": 5.0,
      "verified": true,
      "author": "loggie",
      "helpful_votes": 0,
      "publication_date": 20191206
    },
    {
      "title": "Amazing Amazing Amazing",
      "text": "Amazing! I'm a tradesman, so I have to carry a lot. This makes my job easier. I put my tools on the cart with a bungie cord and away I go. Good quality material, light weight, easy to store.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190306
    },
    {
      "title": "It just works period.",
      "text": "This hand truck is excellent for my application. I'm a musician and I use this item frequently hauling equipment from home to car. From car to gig. From gig to car and so forth and so on. It meets all my expectations. If you are doing similar things it'll meet yours.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190725
    },
    {
      "title": "Light and easy to fold.",
      "text": "Light and easy to fold but won't hold up to anything heavy. I use it for 50 lb. feed bags. Recommend only 1 at a time.",
      "rating": 3.0,
      "verified": true,
      "author": "ONA ALEXANDER",
      "helpful_votes": 0,
      "publication_date": 20201023
    },
    {
      "title": "Pleased",
      "text": "Works well. I gave it only four stars because the handle is a little short for me. Otherwise, a surprisingly good product at reasonable price. For a folding device, it is sturdy.",
      "rating": 4.0,
      "verified": true,
      "author": "T. A.",
      "helpful_votes": 0,
      "publication_date": 20191101
    },
    {
      "title": "Rugged enough to get the job done",
      "text": "The dolly is as compact as you could want it when folded up. It unfolds easy enough. Used it to help move a child into a college dorm. Particularly appreciated the larger wheels. While this is not a commercial dolly, it functions quite well for our occasional uses.",
      "rating": 5.0,
      "verified": true,
      "author": "UTChief",
      "helpful_votes": 0,
      "publication_date": 20190830
    },
    {
      "title": "Great handy tool.",
      "text": "Used this folding cart to move a houseful of furniture around the house as I was having all my floors changed from carpet to vinyl flooring. I was able to move boxes and cabinets easily with the 275 pound weight limit . It does fold up easily and stands up by itself . Great tool and price that I will be using for years.",
      "rating": 5.0,
      "verified": true,
      "author": "Uncle Dave",
      "helpful_votes": 0,
      "publication_date": 20180324
    },
    {
      "title": "Well worth buying sturdy strong",
      "text": "Helps me move heavy garbage bags good size base plate . Bungee cords help at times . Love this 👍🏻",
      "rating": 5.0,
      "verified": true,
      "author": "Tina P",
      "helpful_votes": 0,
      "publication_date": 20200929
    },
    {
      "title": "Lightweight, takes up little space when compacted",
      "text": "love it! love the rubber wheels so I don't have to worry about deflation or holes. I used it in my current move and to get my new recliner up the stairs. nice little household addition for a woman who needs a little help around the house. very light, and hangs easily on my peg board in my garage, and folds up thin enough to slip behind something, like under a bed, on the side of the fridge...wherever. did I already say that I love it? oh, ok.",
      "rating": 5.0,
      "verified": true,
      "author": "NPHX",
      "helpful_votes": 2,
      "publication_date": 20140113
    },
    {
      "title": "So convenient and easy to use",
      "text": "Fits right under my back seat. I move A/C condensers and furnaces with it and it is super sturdy and easy to use. The larger wheels make this one the one to get.",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony Rocco",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "Wow",
      "text": "Very compact and sturdy. Lightweight but durable. Hauls alot of weight. Best help to my back",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff and Amy",
      "helpful_votes": 0,
      "publication_date": 20200823
    },
    {
      "title": "At first it seemed like a great dolly but the wheels don't lock out ...",
      "text": "At first it seemed like a great dolly but the wheels don't lock out and tend to \"toe in\" making it difficult to use heavy loads. returned to Amazon",
      "rating": 2.0,
      "verified": true,
      "author": "Nimble",
      "helpful_votes": 0,
      "publication_date": 20180619
    },
    {
      "title": "Excellent portable hand truck...",
      "text": "I really like this folding hand truck idea. The truck is sturdy, well-built and completely portable. Nice idea.",
      "rating": 5.0,
      "verified": true,
      "author": "J. S.",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "Worked well for a little while",
      "text": "I have 2 of these that I use daily. I loved them at first, but now the nose plate gets stuck every time I try to use one. Stuck to the point that I have to almost break it to get it unfolded. I would suggest buying the $20 version from Walmart or wherever you can find it and just replace it when it gets worn out. I had 2 of those for 3-4 years and they wore out, but I've paid way more for these to work well for about 2 months.",
      "rating": 3.0,
      "verified": true,
      "author": "Johnice Glisson",
      "helpful_votes": 4,
      "publication_date": 20150127
    },
    {
      "title": "Arrived broken",
      "text": "Arrived broken. Looks like it would have been great but won’t open on one side",
      "rating": 1.0,
      "verified": true,
      "author": "Dr. B",
      "helpful_votes": 0,
      "publication_date": 20201101
    },
    {
      "title": "Great quality",
      "text": "Very sturdy, good height, nice and small when folded, easy to unfold, light but strong, great quality. I had to return as I have damage to my hip, back and right knee and found too much of the weight loaded on a two-wheel hand truck rests on me - bummer - hated to return it as I really liked it. Had to buy a four wheel hand truck instead, which is not as nicely designed as this one, but doesn't put any weight on me except when going up the front stairs (I need a ramp, lol).",
      "rating": 4.0,
      "verified": true,
      "author": "Compulsive Reader",
      "helpful_votes": 0,
      "publication_date": 20140526
    },
    {
      "title": "Excellent hand truck",
      "text": "This truck is very well made, simple to fold and unfold, and saves lifting things.",
      "rating": 5.0,
      "verified": true,
      "author": "OldRetiree",
      "helpful_votes": 0,
      "publication_date": 20200719
    },
    {
      "title": "Legit handcart. Can't live without one",
      "text": "Had a another one of these folding hand trucks that I lost at a campsite or maybe when tailgating (woops :)). I can't live without these now, so I found this one for a better price than at the O so I decided to go for it. The Good: I absolutely love the folding wheels; how they tuck away so smoothly. It does take a bit getting used to with various loads and different weight balances, but once you use it for a day you understand how it works. Also good is how light this thing is... The Bad: Nothing yet!! I just put three ~75 lb moving boxes on it yesterday and nothing happened.",
      "rating": 5.0,
      "verified": true,
      "author": "M. A.",
      "helpful_votes": 29,
      "publication_date": 20131105
    },
    {
      "title": "Excellent cart that holds up over time",
      "text": "I use this cart everyday to carry my heavy tool case for work. I’ve used a few different carts and this one has held up the longest by far. The wheels can take a beating and still work fine. It folds up for convenience too. Definitely recommend this cart.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew Dallas",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Very strong and lightweight little helper.",
      "text": "Compact, lightweight, easy to fold out and put up. It is totally unstable when rolling over rough ground (i.e. if you hit a rock the whole thing could tip over...) but with some ties and a little finesse it works great. Compared to the size and weight of any alternative it is unbeatable. I weigh 250lb and can stand on the end while someone lifts me off the ground. It is strong!",
      "rating": 5.0,
      "verified": true,
      "author": "asendic",
      "helpful_votes": 0,
      "publication_date": 20141119
    },
    {
      "title": "Great hand truck",
      "text": "Well made unit with easy to deploy lift plate. When lift plate is folded up the wheels pivot 90 degrees for compact storage. Moves moderatly heavy loads (150 lbs) with ease. Its well worth the money to buy this hand truck and be confident that it will work flawlessly for many years.",
      "rating": 5.0,
      "verified": true,
      "author": "Tom 1948",
      "helpful_votes": 0,
      "publication_date": 20170322
    },
    {
      "title": "I’m very pleased with the product .",
      "text": "This open hand truck is everything that I hoped it would be . The main thing I like is the nose plate for bigger and wider packages .",
      "rating": 5.0,
      "verified": true,
      "author": "Rockson Robbins",
      "helpful_votes": 0,
      "publication_date": 20200729
    },
    {
      "title": "Sturdy & easy to use.",
      "text": "This dolly/hand cart is very good. Well made. Easy to open and close and maneuver. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Bill",
      "helpful_votes": 0,
      "publication_date": 20190917
    },
    {
      "title": "Awesome hand truck",
      "text": "Awesome hand truck! Solidly built. Carried a generator, and several suitcases weighing over 75lbs each without flexing thru several airports. Can easily be stored in aircraft coat closet. Would buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Andre",
      "helpful_votes": 0,
      "publication_date": 20171024
    },
    {
      "title": "I love this! I have used it so much during ...",
      "text": "I love this! I have used it so much during a recent move. I may have over burdened it, moving flower pots though. the wheels no longer op out to the sides s you open it. I have to force the bottom plate down while pushing the wheels out to get it open. Once open it still works fine, and closes easily. I have hauled some pretty big cabinets using this. Also some large flower pots.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20141217
    },
    {
      "title": "4.8 out of 5",
      "text": "Nearly perfect dolly, use ti daily for work as a delivery driver.... its my 2nd one, that's how good it is.",
      "rating": 5.0,
      "verified": true,
      "author": "J Martinez",
      "helpful_votes": 0,
      "publication_date": 20190825
    },
    {
      "title": "Love it!",
      "text": "I'm an author and this works wonderfully for carrying my books to events. I love that it folds up easily and almost flat. I love that it holds so much weight. Books are heavy! Great product! Great price! Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "DeborahAnn",
      "helpful_votes": 0,
      "publication_date": 20161110
    },
    {
      "title": "Heavy duty and space saving",
      "text": "This is awesome! I needed a compact dolly for art and craft fairs, especially a heavy duty model that could safely transport boxes of heavy pottery. A major plus is the fact that it comes assembled and folds totally flat! This is a huge help when packing up my car, not having to worry about making room for wheels that stick out. Can't beat the quality for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Peachy in WI",
      "helpful_votes": 0,
      "publication_date": 20140712
    },
    {
      "title": "Seems like a net product just under engineered",
      "text": "Very disappointing. I have something that weighs 102lbs. I need to move to and from the garage 3 times a month and it can't even handle that. I figured I would buy a hand truck that could handle almost 3 times the weight just to make sure there would be no problem. The wheels are held on by plastic and the plastic starts bending almost right away. Seems like the product is just under engineered.",
      "rating": 2.0,
      "verified": true,
      "author": "rckjhn",
      "helpful_votes": 2,
      "publication_date": 20151019
    },
    {
      "title": "Back saver",
      "text": "When traveling it is easy to pack and makes hauling items into your unit very easy. It can save you from back aches when moving items around home as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Donald W Heavirland",
      "helpful_votes": 0,
      "publication_date": 20200327
    },
    {
      "title": "Extending handle. Great folding dolly.",
      "text": "I use this for moving all sorts of heavy items around the house.",
      "rating": 5.0,
      "verified": true,
      "author": "Skyler",
      "helpful_votes": 0,
      "publication_date": 20190521
    },
    {
      "title": "Love This!",
      "text": "Works GREAT! I have a farm and greenhouse. I use this often to help me move large potted plants from one place to another. The wheels are hard (not full of air) and do well over rough terrain. Opens easily, folds up easily. I use a bungee cord when I've put something big on it, just to secure the item. This makes life a lot easier!",
      "rating": 5.0,
      "verified": true,
      "author": "NK",
      "helpful_votes": 0,
      "publication_date": 20160429
    },
    {
      "title": "It is sturdy, lightweight",
      "text": "In looking for a handcart for a retail location, this one was definitely the right choice. It is sturdy, lightweight, and stores easily. I use it mainly to receive products from distributors and move them to our storeroom. One feature I really like is the big wheels, which makes going over bumps and curbs very easy. Would definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Will's Mom",
      "helpful_votes": 0,
      "publication_date": 20160210
    },
    {
      "title": "Best <300lb dolly you can buy!",
      "text": "I have bought and tested over 8 collapsible hand trucks and hands down this is the best quality of any for the money. Do not buy $20-50 ones and waste your money just buy this and be done.",
      "rating": 5.0,
      "verified": true,
      "author": "David2117",
      "helpful_votes": 0,
      "publication_date": 20180824
    },
    {
      "title": "Great product at what used to be a great price",
      "text": "Found this from a comment made in someone's review that the hand truck was a great product for a great price. It is a really nice product and I would have bought a second one, except from the time I bought mine for $39.00 to a month later the price had nearly tripled to $97.00! Still a nice product, but we picked up a",
      "rating": 5.0,
      "verified": true,
      "author": "M. Benedict",
      "helpful_votes": 2,
      "publication_date": 20140123
    },
    {
      "title": "Quality",
      "text": "We have several different brand and styles of these types for hand trucks. This one ranks the best in quality and easy to use. I am very pleased with this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Pinal County Office of Emergency Management",
      "helpful_votes": 0,
      "publication_date": 20200214
    },
    {
      "title": "Easy heavy duty large hand truck",
      "text": "This hand truck is a beast. It isn’t as compact as others but is much heavier duty and the wheels are amazing. Very smooth functioning and easy to use",
      "rating": 5.0,
      "verified": true,
      "author": "Pancho Villa",
      "helpful_votes": 0,
      "publication_date": 20171124
    },
    {
      "title": "Great purchase!",
      "text": "My husband is a musician, and we purchased this for hauling a drum set and sound system back and forth to our vehicle from his studio and gigs. It is very sturdy, very easy to use, compact and a great deal! Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Lillibet",
      "helpful_votes": 0,
      "publication_date": 20160307
    },
    {
      "title": "Well designed and sturdy dolly",
      "text": "I have only had the dolly a few days and have used it several times. The durability is something to be determined over a lot more time. Thus far I have been thrilled with how it handles. The engineering and materials are excellent. The wheels fold out for use as the nice wide and long base opens down. I have hauled wooden boxes for speakers with the dolly. The boxes were approximately 18\"W x 18\"D and 30'H. I would definitely recommend this product. JW",
      "rating": 5.0,
      "verified": true,
      "author": "John Whalen",
      "helpful_votes": 13,
      "publication_date": 20131206
    },
    {
      "title": "Very poor .. Do NOT buy",
      "text": "Very poor. Would not carry a 1 cubic foot of mulch without collapsing. I waited too long to return it other wise I would have. It is absolutely useless and will end up in the recycling bin.",
      "rating": 1.0,
      "verified": true,
      "author": "Mary L. Rago",
      "helpful_votes": 4,
      "publication_date": 20150523
    },
    {
      "title": "Good light weight hand trunk",
      "text": "Well constructed, and small folded up in the car. Best for about two file boxes full of books, but I have overloaded it a few times with no issues. Would buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Geopeople",
      "helpful_votes": 0,
      "publication_date": 20161106
    },
    {
      "title": "Find one with a locking blade.",
      "text": "NO. blade does not stay down. put a bungie on it and folds up quickly! Heavy.",
      "rating": 1.0,
      "verified": true,
      "author": "Elenabel",
      "helpful_votes": 4,
      "publication_date": 20160605
    },
    {
      "title": "Capable Cooler Carter",
      "text": "Most excellent cart. I got this for my wife who does the weekly deliveries of our farm's pastured pork. She can tote two full 80 lb coolers full of delicious pastured pork - much easier than hand carrying the coolers which is what she's been doing for the last eleven years. See:",
      "rating": 5.0,
      "verified": true,
      "author": "Walter Jeffries",
      "helpful_votes": 0,
      "publication_date": 20141011
    },
    {
      "title": "Worked good",
      "text": "I used it for musical equipment like amps and guitars, it did a good job.",
      "rating": 5.0,
      "verified": true,
      "author": "Telecat",
      "helpful_votes": 0,
      "publication_date": 20181008
    },
    {
      "title": "Got bigger and stronger",
      "text": "Very sturdy and durable. Much bettet than my previous hand cart.",
      "rating": 5.0,
      "verified": true,
      "author": "Bryan Choi",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "SINGER CAN TRANSPORT GIG GEAR IN ONE TRIP WITH VERGO HAND TRUCK",
      "text": "I am a singer, and this well-engineered unit has taken the place of my human roadie! I can load my amplifier, keyboard stand, microphone stand, and gear bag securely onto my Vergo and roll it onstage in one trip, making set-up and take-down so much easier than before. There is a comforting substantial feel to this product, and the way everything from the handle to the wheels are designed is a tribute to smart engineering.",
      "rating": 5.0,
      "verified": true,
      "author": "fromthedairystate",
      "helpful_votes": 0,
      "publication_date": 20151114
    },
    {
      "title": "Wheel broke off",
      "text": "After a few uses the wheels got to where they wouldn’t unfold, then I broke it trying to force it.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "Easy to Use",
      "text": "We are senior citizens and we wanted something that was light and easy to use in the home and garden. This has worked really well for us.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Young",
      "helpful_votes": 0,
      "publication_date": 20191028
    },
    {
      "title": "Sturdy and easy to use",
      "text": "The truck came just in time to help my daughter moved from the dorm. Just the right size and weight to move her fridge from the dorm to the car.",
      "rating": 5.0,
      "verified": true,
      "author": "dareadel",
      "helpful_votes": 0,
      "publication_date": 20180603
    },
    {
      "title": "Five Stars",
      "text": "Good product for right price. I have another brand for $30 more. This one is more sturdy.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve Rosner",
      "helpful_votes": 0,
      "publication_date": 20180323
    },
    {
      "title": "good for massage table transport",
      "text": "I am using this primarily to transport my massage table to the doorway of client homes.It works well and takes the load a little closer. I store this folded behind the passenger seat and have it on hand when needed. It will be useful for transporting other heavy loads when needed.",
      "rating": 5.0,
      "verified": true,
      "author": "Soulaware",
      "helpful_votes": 0,
      "publication_date": 20150723
    },
    {
      "title": "Five Stars",
      "text": "Well built and will support heavy weights. Lite weight and compact it will serve a multitude of purposes.",
      "rating": 5.0,
      "verified": true,
      "author": "michael macklin",
      "helpful_votes": 0,
      "publication_date": 20180225
    },
    {
      "title": "Industrial Truck/dolly",
      "text": "I ordered this Industrial truck for dolling several flat & odd shaped items. Its lightness was good for easy lifting, my only glitch or issue is I wish the bottom plate was bigger as to move the load with greater balance and stability.",
      "rating": 4.0,
      "verified": true,
      "author": "Linda T",
      "helpful_votes": 0,
      "publication_date": 20150416
    },
    {
      "title": "The perfect dolly",
      "text": "absolutely incredible design. Ultra strong, elegant fold up. a perfect dolly",
      "rating": 5.0,
      "verified": true,
      "author": "Startist Products",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "Folds and stores easily. Not too heavy",
      "text": "Very handy. Folds and stores easily. Not too heavy. Only complaint I have is that the wheels get stuck sometimes, and are not released by the button. I have to manually release them sometimes.",
      "rating": 4.0,
      "verified": true,
      "author": "Awesome!!!",
      "helpful_votes": 0,
      "publication_date": 20150913
    },
    {
      "title": "This hand truck is great! It is sturdy",
      "text": "This hand truck is great! It is sturdy. The height of the handle is perfect. When tilted, can walk normal with hunching or having the hand truck hit my feet. Opens and closes with ease. I recommend this hand truck for small jobs.",
      "rating": 5.0,
      "verified": true,
      "author": "Bosscoe",
      "helpful_votes": 0,
      "publication_date": 20160921
    },
    {
      "title": "Outstanding Value",
      "text": "This product is as good as it gets. Don't be fooled if you're looking for a good dolly. I've had the steel ones and they work great, but weigh a ton. These are just as good, hold a considerable amount of weight--certainly more than any normal consumer would carry--and does it easily with great maneuverability, and low cost.",
      "rating": 5.0,
      "verified": true,
      "author": "Geoffrey Cook",
      "helpful_votes": 13,
      "publication_date": 20140317
    },
    {
      "title": "Great item for the price",
      "text": "Great two wheeler. compacts easily and is ready to use in seconds. strong and durable; but don't over load.",
      "rating": 5.0,
      "verified": true,
      "author": "Greggrey Cudworth",
      "helpful_votes": 0,
      "publication_date": 20180709
    },
    {
      "title": "Well Made Easy To Use Hand Truck That Folds Flat",
      "text": "This Well Made, Easy To Use Hand Truck was perfect for our recent move. Folds Flat. Holds a lot of weight and is easy to use. Thank you for making this quality product!",
      "rating": 5.0,
      "verified": true,
      "author": "William Kirkwood",
      "helpful_votes": 0,
      "publication_date": 20180207
    },
    {
      "title": "Strong, stable—it does the job.",
      "text": "I use this hand truck to move a Fender Rhodes stage piano (approx 125 lb) around the city. It works well. Since the Rhodes is taller than the hand truck, it would be ideal if there was a handle that was perpendicular to the rest of the stand (as is the case in some of the industrial hand trucks). But all in all, and for the money, this is a solid product.",
      "rating": 4.0,
      "verified": true,
      "author": "glickmas",
      "helpful_votes": 0,
      "publication_date": 20140816
    },
    {
      "title": "Can’t beat it for the price",
      "text": "Worked perfectly moving my kid into college .. other people said what a great idea",
      "rating": 5.0,
      "verified": true,
      "author": "gregc11514",
      "helpful_votes": 0,
      "publication_date": 20190904
    },
    {
      "title": "A Good Product",
      "text": "A well built sturdy product that fulfilled my expectation. I have a collection of tool buckets that have gotten too heavy to lug around with my aging back. I particularly like the way that it folds up so I can easily put it in the trunk of my car.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard A. Oravetz",
      "helpful_votes": 0,
      "publication_date": 20150120
    },
    {
      "title": "Disapointed",
      "text": "Good product was constructed well and looked good. Had to return it due to the handle wouldn't look in place in extended or closed position. Looked like a manufacturing defect. Amazon e-mailed me a return shipping label and made arrangements for UPS to pick up the package and issued me a full refund. I didn't have an option to replace it only a refund. Didn't understand that thinking! Amazon handle the purchase & returned GREAT, I use them whenever I have the opportunity.",
      "rating": 4.0,
      "verified": true,
      "author": "Edward Caissie",
      "helpful_votes": 2,
      "publication_date": 20140502
    }
  ],
  "product_meta": {
    "title": "Vergo Industrial 275 lbs Capacity Folding Hand Truck Dolly (Model S300BT)",
    "rating": 4.6,
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "33.5 x 20 x 3.25 inches; 10 Pounds",
      "Item model number": "S300BT",
      "Date First Available": "July 18, 2013",
      "Manufacturer": "Vergo Industrial",
      "ASIN": "B00UBWJDZU",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}",
      "GTIN": "789957456190 , 639713617511"
    },
    "categories": [
      "Industrial & Scientific",
      "Material Handling Products",
      "Dollies",
      "Material Transport Equipment"
    ],
    "price": 69.0
  }
}