{
  "website_summaries": [
    {
      "verdict": "Offers the benefits of collagen in a convenient vegetarian capsule.",
      "pros": [
        "With their specialty formula of ch-OSA, this supplement triggers your body to generate its own collagen",
        "It also includes keratin and elastin to support youthful skin and beauty"
      ],
      "cons": [
        "Since it only includes the three basic proteins, some users have noted that have to also take other supplements such as biotin"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Perfect for GAPS people, or anyone with gut / intestinal disorders.",
      "text": "The skin is only a reflection of the inside of the body. Heal the skin (outside tissue), and you will also heal your intestinal lining (inside tissue) at the same time. They are both skin. And they are both largely composed of silica. Hence why this supplement is so powerful, and so necessary. For anyone dealing with intestinal disorders, especially bacteria overgrowth and leaky gut (where you cannot absorb minerals like silica well), this is quite literally a magic bullet. Every disease and disorder that the GAPS diet addresses will also be combat with this supplement; from crohn's, to colitis, to candida, to IBS, to autism and schizophrenia, this supplement should undoubtedly be a staple in one's regime.",
      "rating": 5.0,
      "verified": true,
      "author": "Davide Bianchini",
      "helpful_votes": 166,
      "publication_date": 20171220
    },
    {
      "title": "It works!",
      "text": "I've been using this product for several years. I've found that Natural Factors through Amazon has much better pricing than any local store or health food store. I'm sure BioSil is part of the reason my hair, nails, bones and joints are healthy considering my age of 69!",
      "rating": 5.0,
      "verified": true,
      "author": "MAR",
      "helpful_votes": 121,
      "publication_date": 20170424
    },
    {
      "title": "Very Pleased! Great Things Are Happening!",
      "text": "I started take six drops of this at least once a day, along with a scoop of powdered collagen, in a green smoothie. In two weeks, my damaged nails have grown long and strong, the “eleven” lines between my eyebrows have become less prominent, I have more energy, my knees are less stiff, and I’ve lost some weight. The smoothie masks any unpleasant taste. I will keep purchasing this supplement.",
      "rating": 5.0,
      "verified": true,
      "author": "Regina",
      "helpful_votes": 59,
      "publication_date": 20171006
    },
    {
      "title": "Used for many years and won't stop",
      "text": "I've been using this for many years for my nine health. It's one of many things I do for bone density but my scans have consistently shown my bone density is improving so I'm not changing my plan!",
      "rating": 5.0,
      "verified": true,
      "author": "Joey",
      "helpful_votes": 115,
      "publication_date": 20161116
    },
    {
      "title": "We (wife and I) like it.",
      "text": "My wife and I use this. She doesn't like the flavor, but she can get it down with a little orange juice. I can hardly taste it, so I'll put it in anything. She uses it for her hair and nails, and she looks beautiful. I use it for detox, by faith, as I haven't been able to tell (yet) if it is doing that job. But I can say, since I'm bald and keep my nails short, that my ear and nose hair is glossier than usual and the calluses on my hands are softer too.",
      "rating": 5.0,
      "verified": true,
      "author": "Provy",
      "helpful_votes": 17,
      "publication_date": 20191109
    },
    {
      "title": "That this product focuses on you hair bones nails and joints you can see  the difference and feel it",
      "text": "I saw a difference in my hair was growing and I saw a big difference in my skin",
      "rating": 4.0,
      "verified": true,
      "author": "Oreta Gaines",
      "helpful_votes": 32,
      "publication_date": 20180616
    },
    {
      "title": "Great for hair and nails",
      "text": "Great for hair and nails! My hair was falling out due to hormone issues. Now it is so thick! I take it with a shot of milk.",
      "rating": 5.0,
      "verified": true,
      "author": "Iktomnii",
      "helpful_votes": 40,
      "publication_date": 20170514
    },
    {
      "title": "I would not say that the hair is thicker than my regular fine hair, but there's definitely more of it",
      "text": "Although the website says hair results take some time, I've seen and enormous amount of new hair sprouting up. I would not say that the hair is thicker than my regular fine hair, but there's definitely more of it. An excellent product. Still waiting to see any difference in nail breakage. Definitely recommend adding this to juice as per the instructions.",
      "rating": 5.0,
      "verified": true,
      "author": "B. J",
      "helpful_votes": 49,
      "publication_date": 20170203
    },
    {
      "title": "Caused my nails to peel",
      "text": "I bought this as it was recommended to me by a friend. This product was awful for me. I bought this to help with my nails, I would like them to grow more but this product did the opposite my nails were not only not growing they started peeling in very thick layers. I took notice of my diet and other supplements and nothing had changed expect the addition of the BioSil so I decided to not use the BioSil for 2 weeks and within that timeframe my nails started to get better. I haven't been using this product for a few months now and my nails are back to normal and no peeling at all.",
      "rating": 1.0,
      "verified": true,
      "author": "Ronni",
      "helpful_votes": 31,
      "publication_date": 20180426
    },
    {
      "title": "TW from Bklyn NY. Dec. 2, 2017",
      "text": "I'm very pleased with this product! I have noticed significant difference in the laugh lines on my face. My skin feels soft & it's help the muscles in my neck from sagging. It's only been almost a month & I can't wait to see how it affects my hair & nails! JJ Smith recommended this product & she was spot on!!!",
      "rating": 5.0,
      "verified": true,
      "author": "toni williams",
      "helpful_votes": 24,
      "publication_date": 20171202
    },
    {
      "title": "Disappointing",
      "text": "I read some reviews stating it could cause painful acne, but thought I'd give it a try anyway. Within a week of starting this (only once a day) my face began itching constantly, and broke out with painful bumpy acne. I decided to continue for another week to see if it got better. My nails started peeling and breaking and my hair began falling out. I'd definitely not recommend this if you're sensitive or prone to cystic acne, like I am. Disappointed that it didn't work.",
      "rating": 1.0,
      "verified": true,
      "author": "Julia",
      "helpful_votes": 37,
      "publication_date": 20161004
    },
    {
      "title": "Really works!!!",
      "text": "I have written reviews on this product before because I have taken it for many years (5 or so?) I highly recommend it. For years I could not grow my hair past my shoulders and it was fine and thin. Now it is thicker and grows like a weed. I really bought this product for bone health ... the hair is a side benefit.",
      "rating": 5.0,
      "verified": true,
      "author": "JRN",
      "helpful_votes": 19,
      "publication_date": 20171116
    },
    {
      "title": "Amazing",
      "text": "I’m only 20 but I have no collagen underneath my eyes. My undereyes sink in and I have lines. I’ve only been using this product for about two weeks and I can already see a huge difference. The skin is starting to thicken under my eyes and a wrinkle that was forming between my eyebrows is gone.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 15,
      "publication_date": 20181224
    },
    {
      "title": "Made me sick after 4 days of use, plus gave me a big red zit.",
      "text": "I can't believe I paid for this. After 4 days I began having serious indigestion (I never get digestive issues after 12 years on a probiotic, my system is strong as steel). That began yesterday. Today, my whole day is ruined. I have horrible bloating, pain, headache and the indigestion is still pretty major. I also woke up with a huge zit on my chin (another issue I never usually have). I just want to feel better and I want this product to go away.",
      "rating": 1.0,
      "verified": true,
      "author": "starbrite70",
      "helpful_votes": 9,
      "publication_date": 20190420
    },
    {
      "title": "Hair and Nails Doing Fine...",
      "text": "I was introduced to the BioSil products about a year ago. I didn't use it at first but, ordered the liquid when I noticed the wonderful results my daughter was having with the pills. My hair and nails are growing - not necessarily strengthened but, definitely growing. I haven't noticed any difference in my aching joints so I can't endorse it on that point. The negative I have found with the product is, in liquid form, it will alter the taste of what you put it in. A minor inconvenience... I will order the pills next time.",
      "rating": 4.0,
      "verified": true,
      "author": "Michelle",
      "helpful_votes": 16,
      "publication_date": 20170905
    },
    {
      "title": "It works!",
      "text": "Better than biotin, my 93 year old Mother has never been able to grow her nails. They are longer now than they have ever been. And, while her hair still falls out more than she would like, it is not as much, and apparently it's growing in as well, ,because people are always amazed how nice her hair looks, especially considering her age. Plus the drops are easy to add to morning juice or coffee rather than taking more pills.",
      "rating": 5.0,
      "verified": true,
      "author": "Blabbin",
      "helpful_votes": 10,
      "publication_date": 20181001
    },
    {
      "title": "The Liquid worked immediately!",
      "text": "I am a chronic pain sufferer and have been one for many years. I have horrible musculoskeletal pain that affects all parts of my body, but especially my hips. I kid you not, the first day I used this, I noticed after a few hours that I wasn't in as much pain at all. Really, I couldn't believe it! I think many of you might have quicker results with the liquid. My mother actually told me about this and I'm so glad that she did. I will keep you all posted on the progress!",
      "rating": 5.0,
      "verified": true,
      "author": "Verlinda",
      "helpful_votes": 6,
      "publication_date": 20200701
    },
    {
      "title": "It works!",
      "text": "I'm 63 and I had noticed that in the last 6 months or so when washing my hair I would end up with large amounts on the shower floor. I spoke to the woman who does my facials and she recommended the product. Within two weeks I saw dramatic results, very little hair loss when shampooing. I'm on my second bottle. Even though it says 5 drops twice a day, I do 6 drops once a day. The taste doesn't bother me at all. I don't normally have juice in the house and will put it in a 16 oz bottle of water which I drink on the way in to work.",
      "rating": 5.0,
      "verified": true,
      "author": "Sue",
      "helpful_votes": 7,
      "publication_date": 20190316
    },
    {
      "title": "My Nails Have Been Saved",
      "text": "This stuff is great! Easy to take and does a great job of strengthening hair and nails. Prior to taking this supplement regularly, my nails were a horrible, brittle mess. No exaggeration. It took a few weeks of regular use but I noticed the other day that my nails are now smooth and strong. I am thrilled. Definitely recommend to anyone needing support for hair, nails, bones and/or joints.",
      "rating": 5.0,
      "verified": true,
      "author": "Maya",
      "helpful_votes": 10,
      "publication_date": 20180524
    },
    {
      "title": "always a great product. I have used the pills and the ...",
      "text": "always a great product. I have used the pills and the liquid drops, both are great with great result. My nails aren't fragile when I use this product and My hair seems thicker and my skin seems brighter. I think it is doing something. This isn't my first usage of this product.",
      "rating": 5.0,
      "verified": true,
      "author": "T",
      "helpful_votes": 12,
      "publication_date": 20180113
    },
    {
      "title": "Good product.",
      "text": "Product appears to be working as my skin is less dry, originally started using as I had a sore spot on my lower lip that kept bleeding for months and would not respond to regular applications of rose hip oil or a special product called Somaluxe lip rescue, but shortly after I started taking BioSil, the sore spot healed and has not come back. I still use rose hip oil on my lips for extra moisturizing, but it isn's as necessary as before using BioSil. Good product.",
      "rating": 4.0,
      "verified": true,
      "author": "Outdoor Gym Bloke",
      "helpful_votes": 11,
      "publication_date": 20170907
    },
    {
      "title": "Great detox product",
      "text": "Great product, pulls out lots of different heavy metals, I take every morning, I think it tastes slightly salty but I mix in with other stuff anyway so really dont taste at all.",
      "rating": 5.0,
      "verified": true,
      "author": "Tim A.",
      "helpful_votes": 20,
      "publication_date": 20160919
    },
    {
      "title": "Thank you Biosil",
      "text": "I am so happy to find this product! I never new how important collagen was so good for your body. My knee pain has disappeared within three weeks. I take this product with a collagen supplement tablet. BioSil will generate more collagen which will help with, mobility, pain and stiffness. You must try to believe. It has made such a difference in my life. I have made a complete recovery in my knee pain in just three weeks. Thank you so much!",
      "rating": 5.0,
      "verified": true,
      "author": "Anniebeeall",
      "helpful_votes": 19,
      "publication_date": 20171126
    },
    {
      "title": "True to its word",
      "text": "BioSil always work for me in one way or another. Nails, hair, skin texture, this product holds true. Unfortunately i have mild rosacea so i do have the slight discoloration but my pores are tight. My nails always grow longer and get stronger. My hair even though not much in growth stops breaking - this is however during the course of its use. I have been using off and on for five years.",
      "rating": 5.0,
      "verified": true,
      "author": "Dee",
      "helpful_votes": 9,
      "publication_date": 20180106
    },
    {
      "title": "Better than chondroitin/glucosamine and collagen",
      "text": "Amazing! Had a Achilles tendinitis and spine pain, healed temporarily with chondroitin/glucosamine and collagen per 2-3 months, and again with morning stiffness even taking the products. With BioSil stiffness and pain disappeared in 15 days. Just took 1 bottle and have months without mayor complaints.",
      "rating": 5.0,
      "verified": true,
      "author": "radioterapeuta",
      "helpful_votes": 7,
      "publication_date": 20181224
    },
    {
      "title": "Easy Peasy to use no taste no smell",
      "text": "I received my order very quickly and tried it right away - I am a coffee drinker so I just put the drops in my coffee and I did not smell or taste anything different (I use fake cream and the pink sugar packets). All is good - I am hoping to see some results in 2 more months (I have been using daily for 1 month). Very simple to use. If I see my hair or nails change for the better I will add another star to my review!",
      "rating": 4.0,
      "verified": true,
      "author": "JD",
      "helpful_votes": 12,
      "publication_date": 20170311
    },
    {
      "title": "The liquid Biosil is half the price of the capsules, but same exact ingredients",
      "text": "I have taken Biosil for years, then decided to test it by quitting for a few months. Rather rapidly I noticed my fine lines and wrinkles appearing under my eyes and my hair and eyelashes started to fall out again. I've also noticed my nails becoming thinner/weaker. So, despite taking numerous other hair/nail products in conjunction with Biosil, the Biosil is the ONE hair/skin/nail formula which truly shows results and is worth the price. I don't know what magic is in this bottle, but it works.",
      "rating": 5.0,
      "verified": true,
      "author": "JuliaPhotoFL",
      "helpful_votes": 3,
      "publication_date": 20200129
    },
    {
      "title": "Caused terrible migraines. No refunds if it doesn’t work. What a crock!",
      "text": "I took 5 drops as recommended, and once a day only (vs twice a day), as I am very sensitive to medications and supplements. It gave me terrible migraines and I never have migraines unless I have a sinus cold, which I did not. Cannot return. Wasted $28 on something that doesn’t work. Who does this? Don’t waste your time or money. It’s supposed to be a collagen booster, but there is no collagen in the ingredients. Total scam!!",
      "rating": 1.0,
      "verified": true,
      "author": "D. Gordon",
      "helpful_votes": 3,
      "publication_date": 20200611
    },
    {
      "title": "Really helps with all-over body aches",
      "text": "I used to get up in the morning with sore feet before I began using this. I am sure it is having all the other effects advertised, but in particular, I think the cartilage and other tissues in my feet would be cramped every morning (I am getting older, and I work out a lot), and with this, I wake up with almost NO stiffness. Really none. So I can tell it is working at a total body level to strengthen my connectitve tissues.",
      "rating": 5.0,
      "verified": true,
      "author": "Lexis B",
      "helpful_votes": 4,
      "publication_date": 20181010
    },
    {
      "title": "After a couple of months the hair loss is nothing like I've been experiencing",
      "text": "Hair started falling out noticeably more than usual. Can't be sure if it was due to a year of back pain stress + medications, or change of life moment... as they were happening simultaneously. Then had surgery and hair started coming out in alarming amounts. Have read this can be a result of anesthesia. Started taking this daily. After a couple of months the hair loss is nothing like I've been experiencing, and more in line with what has been my norm over the years. I will not be without BioSil. Note - have noticed no improvement to nails....",
      "rating": 5.0,
      "verified": true,
      "author": "CathleenCalvert",
      "helpful_votes": 20,
      "publication_date": 20170110
    },
    {
      "title": "Taste of drops is bad.",
      "text": "I have been ordering the capsules, and I am very happy with them. I am seeing a difference in my hair thickness and skin over time. I accidentally ordered the drops this time and the taste is awful. Even tried it in water, and still didn't help. Will not order drops again.",
      "rating": 1.0,
      "verified": true,
      "author": "Caren E. Waters",
      "helpful_votes": 8,
      "publication_date": 20180717
    },
    {
      "title": "Hot Tip: take with OJ",
      "text": "I was worried about the flavor but the label says to take with 1/4 cup of juice. I took it with CALCIUM-fortified OJ and didn't taste a thing! Plus I got a bonus 90mg calcium from the fortified OJ. If you're taking Bio-Sil for bone density, this is a win-win.",
      "rating": 5.0,
      "verified": true,
      "author": "LagunaGirl78",
      "helpful_votes": 4,
      "publication_date": 20190713
    },
    {
      "title": "Beware, this will bloat you and give you gas",
      "text": "First, it tastes disgusting, like potent fish skin, so don't try taking it on its own or with water, it must be with something strongly flavoured, like a small amount of sweet/tart juice. Second, once you do get it down (which isn't too bad with the right juice) it bloats you instantly. Your stomach will start rumbling and you'll have uneasy gas until it passes. I'm not sure if it's actually doing anything good, but I've only had it three times and that's enough to convince me the side effect isn't worth it. I wish I hadn't waited so long to try it, can't return it now and waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "Lena",
      "helpful_votes": 4,
      "publication_date": 20190702
    },
    {
      "title": "Great for hair growth just taste pretty bad",
      "text": "This stuff is amazing. I was told about it by a friend who wanted her hair to grow which I desperately do. It works well and makes your hair have more resilience. It does have a not so great taste but it’s worth it. Just put 5 drops in about 1/4 inch of juice (or whatever you want to drink but juice is best for taste) swirl it together and drink as quickly as you can. Do it twice a day. The little bottle last for quite a while. If you wanna grow your hair something to consider buying and adding to your daily routine",
      "rating": 5.0,
      "verified": true,
      "author": "Brittany Scheid",
      "helpful_votes": 7,
      "publication_date": 20180102
    },
    {
      "title": "Works’",
      "text": "After couple of weeks I notice that my nails were getting stronger (usulialy they are as thin as a paper) and my hair is regrowing. But you have to drink with some juice. Don’t drink on the water or pure. It taste bad!",
      "rating": 4.0,
      "verified": true,
      "author": "Angelica Borges",
      "helpful_votes": 7,
      "publication_date": 20180619
    },
    {
      "title": "It worked before.....",
      "text": "I started using this product sometime last year, it went well. After using it, second purchase, I started to breakout all over my face. I usually get a hormonal breakout here and there, so this was unusual for me. I did a process of elimination of what the culprit could be, and after research and reading reviews the verdict is that Biosil has been causing my breakouts. I stopped using it two days ago. Am not sure as to why it worked the first time around with no effects, but this time it caused such bad breakouts. Bad/expired product maybe????",
      "rating": 2.0,
      "verified": true,
      "author": "Siukey",
      "helpful_votes": 2,
      "publication_date": 20190408
    },
    {
      "title": "I’m a Hairstyist, So far I’ve been using for ...",
      "text": "I’m a Hairstyist, So far I’ve been using for 30 days. I fractured my wrist in August. I’m praying that this helps with the healing, because I feel I have 25 years left in the hair business",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 9,
      "publication_date": 20180330
    },
    {
      "title": "Boosts collagen",
      "text": "Helps to strengthen hair, but while you're drinking, after a couple of months the action goes away. Initially, I really liked the effect, because for a couple of weeks my hair became more shiny, came back to normal, somewhere in a month of taking the nails became stronger! The taste and especially the smell is somewhat unpleasant , but if these drops are added to the juice or tea, it is not felt. Contains choline and silicon, which generates the formation of collagen. It is taken 2 times a day-5 drops in 1/4 cup of water. It's important to drink immediately as soon as the remedy is stirred!",
      "rating": 5.0,
      "verified": true,
      "author": "Zulya",
      "helpful_votes": 0,
      "publication_date": 20200520
    },
    {
      "title": "Great product!",
      "text": "I've been using this product off and on for about 2 years now. I notice that during the times that I use it, my hair loss slows down and overall feels healthier. My nails are much thicker and healthier and stopped breaking. I usually just put the drops in some OJ and drink it down. It does have kind of a fishy sort of taste to it which is why I prefer to mix it with juice, but it isn't completely unbearable. It's completely worth the results I have experienced.",
      "rating": 5.0,
      "verified": true,
      "author": "Kim B",
      "helpful_votes": 11,
      "publication_date": 20160914
    },
    {
      "title": "Favorite beauty secret!!",
      "text": "Absolutely love this texture! I honestly don’t know if it takes my back pain away, but to be fair, that’s not why I bought it. Biosil makes my nails long and beautiful!! If it does so much good for nails, I’m sure it’s also doing good for both skin and internal collagen, as well as hair!! Warning: if this gets old it tastes devastatingly like fish!! But otherwise, it has no flavor and mixes flawlessly into any liquid you please. Buy it!",
      "rating": 5.0,
      "verified": true,
      "author": "Megan H",
      "helpful_votes": 2,
      "publication_date": 20200326
    },
    {
      "title": "Tastes like what road-kill smells like",
      "text": "I bought this product because of a recommendation from a friend. I think I'm noticing less hair in the drain after I shower, but I can only get it down it once a day so I may not be seeing the full benefits. It's almost unbearable to drink with water. Tastes like what road-kill smells like. Highly recommend to take it with cranberry juice.",
      "rating": 4.0,
      "verified": true,
      "author": "cls",
      "helpful_votes": 11,
      "publication_date": 20161115
    },
    {
      "title": "Wow",
      "text": "Love this product. I have been using it faithfully for almost a month. I didnt see any results right away and then noticed how hard my nails were one day. I was shocked. My fine lines and a couple of expression lines between my eyes are fading. My husband also started using Biosil for his thinning hair and now has some new hair growing in , after a month. I placed our second order and will write a review after 2 months of use. Love this product... and would recommend to my clients. ( I am a licensed esthetician)",
      "rating": 5.0,
      "verified": true,
      "author": "Ruth Shadders",
      "helpful_votes": 3,
      "publication_date": 20200525
    },
    {
      "title": "Yes, it works.  Very pleased.",
      "text": "I've been taking this product for about nine months. My nails are stronger, and I can tell an improvement in my skin. This product does what it says it will do. Is it a miracle that erases all of time and gravity? No, but I was pleasantly surprised and pleased with what I've seen so far. In my reading, I understand it only gets better in time and use It's a bit spendy, but it works. If it works on my nails, I can only imagine the impact to my bones. I've even got the husband unit taking it.",
      "rating": 5.0,
      "verified": true,
      "author": "MG Hammock",
      "helpful_votes": 13,
      "publication_date": 20170421
    },
    {
      "title": "This is some great stuff! My left knee was really in pain ...",
      "text": "This is some great stuff! My left knee was really in pain with swelling. After taking the BioSil for about a week I noticed that I was getting around with no pain!!!🤗🤗🤗",
      "rating": 5.0,
      "verified": true,
      "author": "Donna",
      "helpful_votes": 8,
      "publication_date": 20180323
    },
    {
      "title": "Slow and steady wins the race!",
      "text": "Be patient.. This won't work overnight. But I have seen a drastic improvement in my hair strength and skin. I also feel less strain on my joints from the gym. I also noticed my face looks better in photos. Sticking to Biosil for sure!",
      "rating": 5.0,
      "verified": true,
      "author": "jska27",
      "helpful_votes": 20,
      "publication_date": 20160708
    },
    {
      "title": "I do recommend it.",
      "text": "I have been taking this for over a year... I used to get it in a local health food store until I found it on Amazon...My nails are no longer splitting & my hair appears to be thicker....I'm taking the dose for my bones but don't have any significant tests results back as yet on that...I do recommend it....",
      "rating": 5.0,
      "verified": true,
      "author": "nancy lubofsky",
      "helpful_votes": 4,
      "publication_date": 20180623
    },
    {
      "title": "My nails have never been stronger!",
      "text": "My nails were splitting and cracking, and very soon after I started using biosil they stopped doing that. The longer I used this product, the stronger my nails got. I gave it 4 stars because of the Packaging. I've never seen such a waste of paper in my life. Each 1 came in a box that was several times its size and these boxes were all put in a even bigger box. It was ridiculous! The next time I buy this product I'll see if another company is selling it for the same price.",
      "rating": 4.0,
      "verified": true,
      "author": "Karen",
      "helpful_votes": 3,
      "publication_date": 20181030
    },
    {
      "title": "DEFINITELY HELPS WITH HAIR SHEDDING",
      "text": "Love this stuff! With regukar use it definitely helps with diminishing hair shedding from alopecia areota. Honestly I can't say I see any difference in my skin but I do see a definite improvement with my hair issues.",
      "rating": 5.0,
      "verified": true,
      "author": "Babchia",
      "helpful_votes": 7,
      "publication_date": 20170509
    },
    {
      "title": "Caution: can cause severe acne!",
      "text": "Used this product for several weeks in hopes that it would help with hair growth. Instead, I got terrible acne all over my forehead + cheeks after just 3 weeks. I eat very healthy and generally have very clear skin and only get occasional hormonal breakouts, so I was wondering what was causing this. The acne was so severe and out of the blue for me. I started researching and read on several reputable blogs + websites that BioSil can be the culprit. I immediately stopped taking it. Be careful!",
      "rating": 1.0,
      "verified": true,
      "author": "Cynthia A Garland",
      "helpful_votes": 17,
      "publication_date": 20180308
    },
    {
      "title": "I think you are better off using the powder form of collagen",
      "text": "This is okay. I think you are better off using the powder form of collagen. At least you cant taste that in your water or coffee in the morning. This stuff tastes pretty bad. I cant use it anymore because it leaves such a bad after taste in my mouth.",
      "rating": 3.0,
      "verified": true,
      "author": "sja6",
      "helpful_votes": 5,
      "publication_date": 20180323
    },
    {
      "title": "Amazing product!!!",
      "text": "I've been using this product for 7 years now, and it does wonders! I am a chef and I am constantly on my feet. This product does wonders to keep healthy joints and bones. It also improves hair, nails and keeps skin's elasticity. Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Maria Perez",
      "helpful_votes": 13,
      "publication_date": 20160919
    },
    {
      "title": "Did not work for me.",
      "text": "I did not notice the product helping with hair or nail growth. It did give me large red pimples.",
      "rating": 1.0,
      "verified": true,
      "author": "K879",
      "helpful_votes": 11,
      "publication_date": 20180723
    },
    {
      "title": "but my hairdresser recommended it and she doesn't get a commission",
      "text": "I was totally skeptical, but my hairdresser recommended it and she doesn't get a commission. I've noticed my nails are stronger and I have many new baby hairs!",
      "rating": 5.0,
      "verified": true,
      "author": "Lutheran Chick",
      "helpful_votes": 5,
      "publication_date": 20171113
    },
    {
      "title": "Five Stars",
      "text": "I mix this with my fiber and collagen in a smoothie, it is an extra boost of enery.",
      "rating": 5.0,
      "verified": true,
      "author": "Bluuegoddess",
      "helpful_votes": 7,
      "publication_date": 20180321
    },
    {
      "title": "Works Well",
      "text": "A friend told me about this product. When she had bariatric surgery, her doctor recommended this since one of the side effects can be hair loss. I used it because of hair loss due to stress and it worked very well! After a month or so, I could see new hair coming in along my side part.",
      "rating": 5.0,
      "verified": true,
      "author": "Cat",
      "helpful_votes": 5,
      "publication_date": 20180408
    },
    {
      "title": "IT WORKS!!!",
      "text": "I started using this 2 years ago to combat early onset bone loss and brittle hair and nails. I have actually regrown and KEPT hair that I initially (and repeatedly) lost due to severe autoimmune thyroid. I can wear the cutest short pixie now and would never have dared that before. I also can grow long nails for the first time in my life. I am an artist so I end up clipping them instead of them breaking off in the quick all the time!! I cannot wait to have a DEXA scan to see improvement in my bone loss!",
      "rating": 5.0,
      "verified": true,
      "author": "Lou",
      "helpful_votes": 8,
      "publication_date": 20160412
    },
    {
      "title": "Better than the capsules",
      "text": "I used the drops for with the Biosil calcium several months and my fingernails were the best of my life - then I bought the combination calcium and capsules and my fingernails are as bad as before I started the Biosil drops! I've gone back to the Biosil calcium and the Biosil drops. If my fingernails are great again I'll know my bones are getting stronger also.",
      "rating": 5.0,
      "verified": true,
      "author": "kayinwyo",
      "helpful_votes": 0,
      "publication_date": 20191102
    },
    {
      "title": "Miracle drops",
      "text": "My third bottle I see a huge difference in my hair. Other benefits as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer R",
      "helpful_votes": 6,
      "publication_date": 20170902
    },
    {
      "title": "life saver",
      "text": "taste bad but take with juice, I could not walk with out it. I dont need knee surgery because of this product",
      "rating": 5.0,
      "verified": true,
      "author": "colleen stobinsky",
      "helpful_votes": 5,
      "publication_date": 20190718
    },
    {
      "title": "Five Stars",
      "text": "I am 57, and thus far do not show it. This is one of my youthful secrets.",
      "rating": 5.0,
      "verified": true,
      "author": "Anonymous bosch",
      "helpful_votes": 14,
      "publication_date": 20160610
    },
    {
      "title": "So far so good!",
      "text": "Hoping this works although it may take 6 months to find out. Everyone says the taste is really bad but I add 6 drops to 4 ounces of Cranberry grape juice and I notice no taste at all excepting for the juice. It says to drink it immediately after adding; not sure why but I let my drink sit for about 20 minutes or so to take the chill off so I can drink it all at once and not get brain freeze after adding the drops. Works perfectly! Will write another review after I see results.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20171103
    },
    {
      "title": "Amazing Product!",
      "text": "I use this product 2x day in juice to strengthen my nails, hair and the added bonus is it helps plump up areas of your face as you age that may have started to get wrinkles or puffiness due to age. I’ve used this for about a year, takes about 30-60 days to notice a difference, my naps are stronger than ever, o no longer wear or need gel nails because mine grow like weeds and they are rock solid strong. Love this product!!",
      "rating": 5.0,
      "verified": true,
      "author": "JC",
      "helpful_votes": 0,
      "publication_date": 20201021
    },
    {
      "title": "Good for bones and teeth.",
      "text": "I thought I was ordering the capsules when I received these drops. I decided to keep them however. I only gave three stars because, although they probably are more efficacious than the capsules I forget to use them. They also have a bitter taste but then not everything can taste good!! I put them in my OJ in the morning. Just swallow quickly~~",
      "rating": 3.0,
      "verified": true,
      "author": "Barbara",
      "helpful_votes": 0,
      "publication_date": 20190112
    },
    {
      "title": "WOW, IT REALLY SEEMS TO WORK",
      "text": "I'm usually skeptical on supplements but I started using this after a friend swore by it. My wrist was giving me problems. But after only a few days of this, my pain was gone and hasn't come back. So yes, I'm a believer. I hope it works for you too.",
      "rating": 5.0,
      "verified": true,
      "author": "Henry S. Williams",
      "helpful_votes": 0,
      "publication_date": 20200927
    },
    {
      "title": "Working!",
      "text": "I started noted improvement in my hair and nails in the 3rd month. Looking forward to additional positive results as I continue use!",
      "rating": 4.0,
      "verified": true,
      "author": "lynn",
      "helpful_votes": 5,
      "publication_date": 20180313
    },
    {
      "title": "Aide to thinning hair",
      "text": "Recommended by my hair stylist. Due to a recent Dx of Myasthenia Gravis, noted considerable hair loss. At my last hair appointment she noted new hair growth. It works",
      "rating": 5.0,
      "verified": true,
      "author": "Ewolram",
      "helpful_votes": 4,
      "publication_date": 20180909
    },
    {
      "title": "Not sure yet.",
      "text": "Cant complain not sure if they are working but I feel they could be as my skin does look brighter, and no acne outbreaks. Nails are not growing and my joints are okay for the most part. Recommended by JJ Smith during the cleanse so I purchased them and put them in my smoothies daily. Thanks,",
      "rating": 4.0,
      "verified": true,
      "author": "PHOEBE ANTHONY",
      "helpful_votes": 2,
      "publication_date": 20180809
    },
    {
      "title": "Not impressed",
      "text": "Not impressed by this product ...been taking it for 2 months now ...nails are still the same ...the main reason I wanted to take this is to make my hair grow faster ...it hasn't at all ..except for baby hairs ...very disappointed...I'll try something else ...",
      "rating": 2.0,
      "verified": true,
      "author": "leighann gee",
      "helpful_votes": 0,
      "publication_date": 20200407
    },
    {
      "title": "This Stuff Really Works!",
      "text": "I use six drops twice a day, it took about a week to kick in but my nails grew stronger, hair got thicker and my skin complection improved! Its reasonably prices and about a 60 to 90 day supply depending how you use it. Also, I swear my joints got even better too! STRONG BUY RATING!",
      "rating": 5.0,
      "verified": true,
      "author": "E.J.L",
      "helpful_votes": 2,
      "publication_date": 20191229
    },
    {
      "title": "Five Stars",
      "text": "It has helped my hair and nails become thicker and more healthy",
      "rating": 5.0,
      "verified": true,
      "author": "infojunkee",
      "helpful_votes": 9,
      "publication_date": 20160903
    },
    {
      "title": "Works",
      "text": "Love Biosil....yes the taste is gross, but I mix it in my coffee and you can barely taste it. Juice would also work. My nails are healthy again, hair meh, skin looks a lot better. I have hypothyroidism so hair, nails and skin are always a battle, but Biosil really helps. Need to take it religiously.",
      "rating": 4.0,
      "verified": true,
      "author": "Nope",
      "helpful_votes": 0,
      "publication_date": 20200208
    },
    {
      "title": "Allergic to eggs?  Shedding hair? You could have a choline deficiency.",
      "text": "THIS IS NOT MEDICAL ADVICE, BUT WORKED FOR ME!! I learned the hard way that my body is deficient in choline because I'm allergic to eggs. As a result, I've suffered severe hair loss from this deficiency over the past 11 years. I now take Bio Sil twice a day in a little bit of orange juice. It smells awful, but my bald spot is filling in! Small price to pay for gorgeous hair again.",
      "rating": 5.0,
      "verified": true,
      "author": "doodlebug",
      "helpful_votes": 2,
      "publication_date": 20200126
    },
    {
      "title": "Liquid Biosil not working out for me.",
      "text": "So I really wanted the capsules which I had before but ended up with the liquid. So I thought I would try it but for whatever reason the drops irritate my bladder and make me feel like I have a urinary tract infection. I ordered two bottles and obviously only opened one and barely used that one. Is there any way I can exchange them for the capsules?",
      "rating": 1.0,
      "verified": true,
      "author": "Lynn A Fennell",
      "helpful_votes": 18,
      "publication_date": 20170203
    },
    {
      "title": "Really amazing",
      "text": "Within just a couple of weeks or so, both of us noticed significantly more finger nail growth and thickness. Neither of us noticed much if any change in hair, but just the nail growth and quality were worth it. It tastes terrible, but a small amount of liquid (as they recommend) with it takes care of that taste fairly well. If we get joint and hair help that'll be another advantage, but the nail growth alone is worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "Grits",
      "helpful_votes": 0,
      "publication_date": 20181024
    },
    {
      "title": "Help With Bursitis",
      "text": "I purchased this product to help with relief fro bursitis. I would say it gives me about 60 to 70% relief. I also do exercises that help with the pain. So between the two I get about 95% relief. I would say it is worth the try!",
      "rating": 4.0,
      "verified": true,
      "author": "Jacklyn",
      "helpful_votes": 0,
      "publication_date": 20201019
    },
    {
      "title": "Using it for years and Yesss they work as describe it just add vitaminC",
      "text": "I have using this drops for 3 months a year to stop my hair fooling same time it grows faster and grows new hair . I have a hair that is frizzy so every 2 or 3 months i get brazilian treatment which make it easy to manage but after all i loose a lot of it too then i know it s time to get some minerals which BioSill has it ... beside the hair my nails and skin get the benefits too !! I prefer drops because they are easy on your kidney and liver ... down side u need to add vitamin c to bust the performance and ease your kidney !!",
      "rating": 5.0,
      "verified": true,
      "author": "livia dumitru",
      "helpful_votes": 0,
      "publication_date": 20200216
    },
    {
      "title": "Still hopeful",
      "text": "I’ve been taking it for a while but haven’t been taking 2 day as recommended; just increased in last couple weeks.. My nails are stronger and less brittle. I haven’t noticed any change in skin or hair loss",
      "rating": 3.0,
      "verified": true,
      "author": "Mizzou5300",
      "helpful_votes": 2,
      "publication_date": 20181110
    },
    {
      "title": "Hair & eyelashes & nails longer!",
      "text": "My nails and hair are growing quickly with Biosil! Even my eyelashes are longer! My skin looks more plump. And I've only been using it for a month! I've recommended this to a few friends & will continue to tell more friends. I highly recommend it!",
      "rating": 5.0,
      "verified": true,
      "author": "Mary",
      "helpful_votes": 7,
      "publication_date": 20160516
    },
    {
      "title": "SUBSTANTIAL growth from 12/19 to 7/20",
      "text": "I began taking BioSil in December of ‘19. My hair was braided and a weave was installed in February of 2020; removed in July of 2020. I am truly shocked at the amount of growth, in 7 months! My hair, typically, grows to a certain length, then, seems stagnant. The pic on the left was taken in December of ‘19; right pic taken in July ‘20. Just so happens I had on the same tee shirt! 🤣😂 So glad I did, because it’s a stunning photo, side by side.",
      "rating": 5.0,
      "verified": true,
      "author": "DJ Joyce",
      "helpful_votes": 0,
      "publication_date": 20200829
    },
    {
      "title": "Best product ever for my weak nails",
      "text": "I have never been able to grow my nails. They have always been ridiculously short and thin. After a month of using this product, My nails started to come in strong and unbreakable. I’ve been joking with people that I don’t know how to cut my nails because I’ve never had to do it. This product is fantastic for nails, still trying to determine if it’s impacting my thin hair",
      "rating": 5.0,
      "verified": true,
      "author": "Anita F.",
      "helpful_votes": 2,
      "publication_date": 20200117
    },
    {
      "title": "Made my nails stronger!",
      "text": "I am in my 50’s and my nails have gotten thinner with ridges. One nail kept splitting down the ridge line. After starting Biosil, my nails have gotten stronger and that one nail has stopped splitting. So I am happy with the product for that. Can’t say there is much difference in my skin or joints. I use the liquid and just drop it right on my tongue then drink some water. It doesn’t taste good but doesn’t bother me either. I don’t have time to bother mixing it into something.",
      "rating": 5.0,
      "verified": true,
      "author": "LSeattle",
      "helpful_votes": 0,
      "publication_date": 20181026
    },
    {
      "title": "Very impressed with the double-blind studies",
      "text": "Very impressed with the double-blind studies (included in the box) showing that bone density in BioSil users actually increased slightly, compared with calcium takers alone, and calcium with vitamin D takers, both of which groups continued to lose bone density over the course of the tests. As a woman in my 40's I need to do what I can to keep my bones strong and healthy.",
      "rating": 5.0,
      "verified": true,
      "author": "Kivak",
      "helpful_votes": 0,
      "publication_date": 20190119
    },
    {
      "title": "Biosil-for bone strength",
      "text": "I uses this product in the hope of stabilizing or increasing bone density. It's supposed to encourage osteoblasts that help to make bones stronger. It doesn't taste great, but tolerable.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191012
    },
    {
      "title": "Good product.",
      "text": "Works great for my nails, not so much my hair. I was using it for a while, and once I stopped, my nails got bad again; so I started using it again.",
      "rating": 5.0,
      "verified": true,
      "author": "Kacklebarney",
      "helpful_votes": 4,
      "publication_date": 20170906
    },
    {
      "title": "unimpressive",
      "text": "I really didn't see any difference by using this product no wrinkle smoothing, no less fatigue nothing changed. Quite possibly I did not use it long enough to see any positive results. It was easy to swallow because you can mix it with anything and there is no taste. Other then that I would not buy again.",
      "rating": 3.0,
      "verified": true,
      "author": "polapola",
      "helpful_votes": 0,
      "publication_date": 20200917
    },
    {
      "title": "Ignore the taste....it seems to work!",
      "text": "Doesn't taste too good. But boy does it work! Hair and nails are longer and stronger and skin seems younger!",
      "rating": 5.0,
      "verified": true,
      "author": "Gabby",
      "helpful_votes": 4,
      "publication_date": 20180305
    },
    {
      "title": "Disgusting!",
      "text": "Absolutely disgusting tasting! I wish I could return it! HORRID.",
      "rating": 1.0,
      "verified": true,
      "author": "DBC",
      "helpful_votes": 3,
      "publication_date": 20180601
    },
    {
      "title": "Works well but tastes bad",
      "text": "Works well. I have used Biosil for years because it makes may hair thicker. Note that it may also cause some growth of unwanted hair (worth it anyway). These drops taste like formaldehyde or plastic, so I take it with a swig of coffee and drip it right into the back of my throat so I don’t taste it.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "No improvement for me.",
      "text": "This product has done nothing for me but take money out of my wallet. My nails break just as much as they did before, no improvement whatsoever. My hair also is unchanged. I've been using it for almost three months. Maybe it's not enough time to see a difference, but I won't buy it again. Too expensive to take a gamble on. The terrible taste that other reviewers have mentioned I didn't experience. I used it according to the instructions in juice. Cranberry/apple for a while and then Naked Green Machine from Costco.",
      "rating": 2.0,
      "verified": true,
      "author": "cologirl",
      "helpful_votes": 9,
      "publication_date": 20170302
    },
    {
      "title": "This stuff works!!",
      "text": "I love this stuff! After a month of taking it my hair has gotten thicker and glossier, I have noticed vast improvement to my skin's texture and tone, and my fine lines have faded & filled in a bunch! It's even helped my scars fade. Yeah it doesn't taste great but that's my only complaint about the product. I absolutely will be buying this again!",
      "rating": 5.0,
      "verified": true,
      "author": "Maggie",
      "helpful_votes": 0,
      "publication_date": 20190726
    },
    {
      "title": "Love this !",
      "text": "This is one of my favorite additions to my daily vitamins. My hair has been growing, as well as my nails. My skin feels so smooth and soft. I'm so happy I have found this. Shipping was fast and item was just as described. I will definitely be ordering more.",
      "rating": 5.0,
      "verified": true,
      "author": "Brandi",
      "helpful_votes": 3,
      "publication_date": 20170715
    },
    {
      "title": "Not quite sure just yet",
      "text": "Sure to put in for juice it tastes awful but with enough juice you can't taste it. I can't say that I've seen amazing results with it but I think I've noticed some changes in my hair he knows I don't know if that's just placebo but for the people that seem to love it really seems to work so I will keep using it and update",
      "rating": 5.0,
      "verified": true,
      "author": "andrew reber",
      "helpful_votes": 5,
      "publication_date": 20160613
    },
    {
      "title": "Great for hair growth and strength",
      "text": "Great product- my hair has grown so much fast while using this and I will continue to repurchase. I’ve lost far less hair that I used to, even my husband commented on the decrease in hair he finds on his clothes now. I’ve bought this twice already and it has lasted about 4 months total. Tastes terrible on its own but when added to a small amount of juice, it’s hardly noticeable. I have recommended this to several people already and will continue to.",
      "rating": 5.0,
      "verified": true,
      "author": "Savannah Fiedler",
      "helpful_votes": 0,
      "publication_date": 20200523
    },
    {
      "title": "Bones, Beauty, Joints and Lose Les Hair",
      "text": "I read in magazines about Biosil for hair loss, bones, skin and joints. I ordered some and have been using it for about 4 months. I have noticed that there is a lot less hair on the bathroom counter when I brush or comb my hair. Love the fact that it is making my bones stronger and very little aches in my joints. This is a product that I will continue to use daily!",
      "rating": 5.0,
      "verified": true,
      "author": "Beth",
      "helpful_votes": 12,
      "publication_date": 20170109
    },
    {
      "title": "NOT VEGAN FRIENDLY AT ALL! GOT SICK. NOT RETURNABLE.",
      "text": "This review has nothing to do with the efficacy of the product. It’s strictly related to how it affected me as someone who is vegan. It made me terribly sick. I won’t go into the details but IF YOU ARE VEGAN I WOYLD THINK TWICE ABOUT TAKING THIS!!! Plus it’s not returnable so I’m out $30 on a product that clearly says it’s “vegan friendly.” IT IS NOT!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Athena",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "Great product.",
      "text": "This product has really made a difference in my Hair and skin. It has made my hair feel fuller and my skin softer. I have psoriasis and it has really helped my hands. I have been using it for about 3 weeks.",
      "rating": 5.0,
      "verified": true,
      "author": "Ep",
      "helpful_votes": 6,
      "publication_date": 20160911
    },
    {
      "title": "BioSil",
      "text": "Good product. I can see and feel the differents in my nails, hair and joints. Thanks to JJ Smith for recommending it with her detox program.",
      "rating": 5.0,
      "verified": true,
      "author": "Giggles",
      "helpful_votes": 2,
      "publication_date": 20180808
    },
    {
      "title": "Five Stars",
      "text": "This product works very well when used consistently. I've seen my nails grow quickly by using this product!!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Danielle Vilson",
      "helpful_votes": 3,
      "publication_date": 20171219
    },
    {
      "title": "My nails grew for the 1st time ever!",
      "text": "The first time I started taking BioSil drops (fall 2019) I noticed that my nails started growing after a few weeks for the first time ever! Nothing I’ve tried before has worked. And when they broke they would grow back! I prefer drops In any supplement (vs pills/capsules) because I seem to absorb it better. The taste is terrible, fishy somehow but worth it. The BioSil drops I received in May 2020 don’t seem to be as effective. My nails still grow but not as fast. The directions have changed a bit, maybe this means the formula has also.",
      "rating": 4.0,
      "verified": true,
      "author": "EE",
      "helpful_votes": 0,
      "publication_date": 20200911
    },
    {
      "title": "Can't stand the taste",
      "text": "I took BioSil capsules and noticed no change, but thought I'd try the liquid. I'm usually pretty good at swallowing \"medicine,\" but this stuff tastes so bad that I can't stand it. I'm still looking for a good silica source and will probably try their capsules again.",
      "rating": 3.0,
      "verified": true,
      "author": "Late Shopper",
      "helpful_votes": 0,
      "publication_date": 20190123
    }
  ],
  "product_meta": {
    "title": "BioSil by Natural Factors, Beauty, Bones, Joints Liquid, Supports Healthy Hair, Skin and Nails, Vegan Collagen, Elastin and Keratin Generator, 0.5 fl oz (60 Servings)",
    "rating": 4.4,
    "feature_bullets": [
      "ADVANCED COLLAGEN GENERATOR: Beautify your hair, skin and nails and protect your healthy bones and joints with a natural collagen generator you can add to your beverage, hot or cold",
      "VEGAN FRIENDLY: Formulated with a patented and vegan silicon and choline complex to help improve beauty protein levels without the use of beef, chicken or fish collagen",
      "LIQUID DROPS: Take 6 drops once daily for bone benefits; Take 5 drops, twice daily in at least 1/4 cup of any liquid for skin, hair, nails, bones and joints benefits",
      "CLINICALLY PROVEN: Delivers ch-OSA at a potency shown to support your body's natural ability to regenerate collagen, keratin and elastin",
      "FIGHT THE DECLINE: Brittle nails, fine lines, wrinkles and thinning hair are just a few signs that your body needs help producing the 3 beauty proteins; Push back with BioSil"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "2.37 x 2.37 x 4.55 inches; 1.6 Ounces",
      "Item model number": "5425010391859",
      "Date First Available": "May 1, 2010",
      "Manufacturer": "Natural Factors",
      "ASIN": "B003K4ID0M",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Vitamins & Dietary Supplements",
      "Supplements",
      "Health & Household",
      "Health, Household & Baby Care",
      "Collagen"
    ],
    "price": 19.66
  }
}