{
  "website_summaries": [
    {
      "verdict": "The design on this sink provides a lovely way to upgrade the look and utility of your laundry room.",
      "pros": [
        "This glossy white, preassembled utility sink comes ready to install with a faucet and cabinet",
        "Faucet has sprayer attachment",
        "Includes extra storage in the cabinet underneath the sink",
        "Shaker style doors",
        "Sink gives cabinet extra stability in the way it fits"
      ],
      "cons": [
        "The cabinet on this model is a bit flimsy and not entirely waterproof"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "But it arrived in perfect condition with easy to assemble instructions followed by two ...",
      "text": "I read all of the other reviews reviews and was somewhat hesitant to purchase this item. But it arrived in perfect condition with easy to assemble instructions followed by two emails from the company making sure I had a contact if there was anything wrong. All in all very happy and satisfied with the purchase and customer service.",
      "rating": 5.0,
      "verified": true,
      "author": "SRR",
      "helpful_votes": 34,
      "publication_date": 20180430
    },
    {
      "title": "Looks nice not sure about quality and longevity",
      "text": "You get what you pay for o this item was cheap and is cheap. I realized this from some of the other review. It’s not a high use item in our house and I will be surprised if the faucet lasts a year. Very poorly packaged. Mine arrived damaged but luckily we could hid the damage so I didn’t have to return. On the positive side the sink is large and deep.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 24,
      "publication_date": 20180719
    },
    {
      "title": "Lose that sinking feeling",
      "text": "Checked all the 'big box' stores and found nothing as good as this nor as reasonably priced. The fact that faucet is included is great. Sturdy construction and nice deep sink.",
      "rating": 5.0,
      "verified": true,
      "author": "Curmudgeon",
      "helpful_votes": 15,
      "publication_date": 20180813
    },
    {
      "title": "Works for what I need it to",
      "text": "I wanted an all-in-one piece - cabinet, faucet and sink. Bonus on the soap dispenser since I don't have any counter around it! Nice deep sink and tall faucet with pull out sprayer. Cabinet a bit on the cheap side, but for what I wanted it for, it's fine. This was installed in my mudroom today - will be used to wash dirty hands from yardwork, fill up the dog's water bowl, and clean grill grates. For the price, it will work just fine!",
      "rating": 4.0,
      "verified": true,
      "author": "RHunter",
      "helpful_votes": 11,
      "publication_date": 20181024
    },
    {
      "title": "Looks nice, easy assemble, but bad quality and value",
      "text": "This cabinet has a good design and looks nice but it has poor quality. The assembly process of this cabinet was surprisingly quick and easy but the sides of the cabinet are very thin and feel like paper, the sink itself also has poor quality. For storage or light use, this is an acceptable cabinet. If you intend to use this cabinet for washing clothes on a regular basis then I would look elsewhere due to its poor quality. In conclusion, this cabinets look decent but the product images don’t convey its port quality, for $350, I wouldn’t recommend this cabinet to anyone due to its poor value.",
      "rating": 3.0,
      "verified": true,
      "author": "MH",
      "helpful_votes": 4,
      "publication_date": 20191102
    },
    {
      "title": "Good Looking tub.",
      "text": "I like the looks of the tub very much. The packaging wasn't the greatest....the feet and screws were just thrown in the bottom of the carton and base and one knob screw was missing. The flange seat is too large and dirt tends to get trapped around the drain. Also it would be better if the tub was pitched toward the drain because now a lot of water just sits in the tub. I am keeping it.",
      "rating": 4.0,
      "verified": true,
      "author": "Jan K",
      "helpful_votes": 8,
      "publication_date": 20181112
    },
    {
      "title": "On the flimsy side.",
      "text": "This was installed in our laundry room bathroom and is the perfect size. The style is nice. However the sink material is very thin and when using the pull down sprayer with the faucet you have to hold firmly on to the faucet otherwise I worry the sink material may crack. Had I been home when the contractor got this out of the box and assembled it I would have stopped him and returned it.",
      "rating": 2.0,
      "verified": true,
      "author": "JuliaW",
      "helpful_votes": 6,
      "publication_date": 20180925
    },
    {
      "title": "Great looking utility sink/cabinet",
      "text": "This arrived in a timely manner and it was well packaged to protect it. The cabinet is very attractive and the sink is deep - 13-1/2\". It was easy for the plumber to install. If you have knowledge of plumbing, etc. (which I do not) I imagine it would be fairly straightforward to install yourself. The frosted \"glass\" in the front of the cabinet is not actually glass but it is a sturdy and good-looking plastic material. It should hold up well. Overall, I'm very pleased with this cabinet and thrilled I now have a utility sink in my laundry room!",
      "rating": 5.0,
      "verified": true,
      "author": "Mom of 2",
      "helpful_votes": 0,
      "publication_date": 20190824
    },
    {
      "title": "The cabinet is great; faucet is not",
      "text": "The cabinet packaging was very solid, no issues with condition upon arrival. It does come with everything you'll need with the exception of some silicone and screws to mount the cabinet to the wall (which is totally understandable.) It is easy to assemble, level-out, and connect. My only beef is with the quality of the faucet. It is very cheap: The handles are wobbly, the neck is plastic and does not seat very tightly to the base. I suppose this should be expected since the entire group is not very expensive. Just be aware this portion will likely require replacement sooner than later. I am still impressed with the product for the overall cost.",
      "rating": 4.0,
      "verified": true,
      "author": "Theresa Smith",
      "helpful_votes": 3,
      "publication_date": 20190906
    },
    {
      "title": "The description says it is glossy white. NO it is a dingy off white!",
      "text": "It looks terrible with a White washer and dryer. It is Dingy looking. Very Disappointing! Off White is Not Glossy White. The description is totally misleading!",
      "rating": 1.0,
      "verified": true,
      "author": "Frank R. Lima",
      "helpful_votes": 7,
      "publication_date": 20181114
    },
    {
      "title": "Arrived broken",
      "text": "The look of the product is great, but it feels cheap and arrived damaged. This is very disappointing considering how expensive it was. The front door is completely broken and could not be repaired. We are unfortunately outside of the return window, so cannot get a refund or exchange the product. We didn’t open the product for our contractor to install it. Had to get a cheaper basin instead. Very frustrating.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20191104
    },
    {
      "title": "Depends on What you want...",
      "text": "I was mistaken in assuming the tub was enamel. You know what they say about assuming, makes an a** out of U and Me. In any event, the unit is adequate, but not as sturdy as I had envisioned. So I returned it. If, however, you are looking for a nice, BIG, PVC (?) tub, reasonable faucet included and melamine cabinet, then this is a good cabinet. Has good storage space.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190409
    },
    {
      "title": "Great sink",
      "text": "Looks like photo. Aesthetically pleasing. Fantastic for laundry or shop sink. Easy install. Faucet works great, soap pump is not good at all. Only watered down liquid soap can get pumped out and it sticks also which requires jigging it to get it to work. I wouldn’t give my beautiful sink up so I bought a wall mount soap dispenser to replace the one it came with.",
      "rating": 4.0,
      "verified": true,
      "author": "Laura B",
      "helpful_votes": 0,
      "publication_date": 20190125
    },
    {
      "title": "Great for the price",
      "text": "Everything was installed by an experienced plumber. Went very smoothly in about 40 minutes. Which the plastic tub was just one step thicker. But for the price and the very limited use, it’s great for the price",
      "rating": 4.0,
      "verified": true,
      "author": "Charles B",
      "helpful_votes": 0,
      "publication_date": 20191114
    },
    {
      "title": "Very Very Cheap Plastic",
      "text": "Sink is made of the cheapest plastic available and is very fragile. If you plan on using this AS a true Utility sink...do not buy. If you plan to use this simply as a discharge sink for your washer it should be fine. Installed 3 months ago and the sink has cracked along the bottom.",
      "rating": 1.0,
      "verified": true,
      "author": "DOUGLAS S HEFFRON",
      "helpful_votes": 2,
      "publication_date": 20191118
    },
    {
      "title": "Sink Arrived Damaged",
      "text": "Cracks in both sides of particle board of base. Sink handle plastic and broken in half. However The sink part itself is nice in that its deep and has pre-drilled holes.",
      "rating": 1.0,
      "verified": true,
      "author": "ten",
      "helpful_votes": 0,
      "publication_date": 20200216
    },
    {
      "title": "Looks nice but when you operate the faucet it feels flimsy",
      "text": "Installed in my laundry area. Looks great and the cabinet is good. The sink itself looks fine, but it could do with more rigidity in the space where the faucet is installed. Given the tall faucet, it exerts considerable leverage on the plastic to make it feel flimsy. Suggest a angled metal strip underneath, below the plastic. The back of this angled strip could be attached to the wall, thus better supporting the faucet and making for a more sturdy installation overall",
      "rating": 3.0,
      "verified": true,
      "author": "Ragvinder S. Rekhi",
      "helpful_votes": 0,
      "publication_date": 20190921
    },
    {
      "title": "Arrived damaged",
      "text": "Beautiful cabinet, but had a crack in the finish, see pics. Box was not damaged. Decided to keep it, since installer had arrived on the job, but I'd like to have an adjustment to the price I paid, since cabinet was not perfect.",
      "rating": 3.0,
      "verified": true,
      "author": "Page Turner",
      "helpful_votes": 2,
      "publication_date": 20190227
    },
    {
      "title": "Nice sturdy cabinet and extra deep sink",
      "text": "I found this product to be definitely worth the price when compared to other utility sink and cabinet combo's, and the tub is extra deep which will help when soaking clothes or even rinsing off boots. It was super easy to put together and looks even easier to install.",
      "rating": 5.0,
      "verified": true,
      "author": "Patrick",
      "helpful_votes": 0,
      "publication_date": 20200528
    },
    {
      "title": "defective faucet",
      "text": "This vanity was installed in my garage. Took quite a bit to adapt the plumbing and when it finally was ready for the faucet to be installed and connected the faucet had a leak and was deemed by the plumber as unusable and defective. One of the reasons I bought the sink was because of the cool faucet. However in examining the product found it to be made cheaply and of poor quality.",
      "rating": 1.0,
      "verified": true,
      "author": "cheri kennedy",
      "helpful_votes": 0,
      "publication_date": 20190606
    },
    {
      "title": "There was a slight dent in the lower part of the right door.  It is hard to notice.",
      "text": "We are happy with the product. I went together fairly easy. One of the plastic faucet stems was broken so I had to go to the hardware store to get a replacement. There was a slight dent in the bottom of the vanity door.",
      "rating": 5.0,
      "verified": true,
      "author": "Tom Brady",
      "helpful_votes": 0,
      "publication_date": 20181127
    },
    {
      "title": "Online Dimensions Not Accurate",
      "text": "Product is an inch wider with sink bowl lip (25\") than diagram shown online (24\"). We were installing this in a laundry room with very tight specifications so the extra inch caused some problems. Also, sink cabinet arrived with dent in front door and crack in the upper door hinge area. Our contractor is going to try and patch these defects.",
      "rating": 3.0,
      "verified": true,
      "author": "SifterNifter",
      "helpful_votes": 0,
      "publication_date": 20190613
    },
    {
      "title": "A perfect utility sink!!!",
      "text": "This is one terrific find on Amazon. It was easy to install and works flawlessly. The unit modernizes our laundry area. It is a handsome piece of furniture. The sink is quite deep which is an extra added touch. The faucet has a pullout mechanism which comes in so handy. The faucet itself is very well made and adds a modern touch to the cabinet. All in all a terrific unit.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "Not what I expected.",
      "text": "Product received was damaged in two places. Plastic door insert was very cheaply made. I did receive fast credit however UPS pickup was a nightmare.",
      "rating": 2.0,
      "verified": true,
      "author": "lori",
      "helpful_votes": 0,
      "publication_date": 20191113
    },
    {
      "title": "Quality offering from a quality company",
      "text": "The cabinet and sink are just what I was looking for and exactly as described. They arrived well packaged and on time. Unfortunately, the faucet arrived broken. Their customer service department replied immediately after I contacted them and we more than helpful in providing an accommodating resolution.",
      "rating": 4.0,
      "verified": true,
      "author": "Brenda W.",
      "helpful_votes": 0,
      "publication_date": 20191030
    },
    {
      "title": "Great quality product and price too",
      "text": "You need a plumber to install because of the sewer connection but the quality of the faucet, sink and cabinet are great. It would be great if they have an stainless steel option for the sink.",
      "rating": 5.0,
      "verified": true,
      "author": "Rocks are just hard as stones",
      "helpful_votes": 0,
      "publication_date": 20190902
    },
    {
      "title": "Poorly packed will arrive damaged",
      "text": "Poorly packed and arrived damaged. Made from mdf too. Complete garbage.",
      "rating": 1.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 2,
      "publication_date": 20200303
    },
    {
      "title": "A Great Utility Sink",
      "text": "This sink is the perfect size for washing large items and small doggies. The best purchase I've made in a long time. It fits great in my small bathroom and looks great.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190819
    },
    {
      "title": "For the money it does the job",
      "text": "The sink arrived damaged but the customer service was great! They quickly resolved the issue and I'm a happy customer with a sink that does the job :)",
      "rating": 4.0,
      "verified": true,
      "author": "Bob H.",
      "helpful_votes": 0,
      "publication_date": 20200130
    },
    {
      "title": "You get what you pay for",
      "text": "I was surprised that the doors were plastic. I must have confused it with another product. You get what you paid for. It will do, it it wasn’t cheap.",
      "rating": 3.0,
      "verified": true,
      "author": "Sara J Dutton",
      "helpful_votes": 0,
      "publication_date": 20191006
    },
    {
      "title": "Great utility sink!",
      "text": "Great company to buy from. I had a slight problem with my first unit. Contacted them. They replied immediately. Highly recommend! Thanks!",
      "rating": 5.0,
      "verified": true,
      "author": "Mommer101",
      "helpful_votes": 0,
      "publication_date": 20191022
    },
    {
      "title": "It’s okay",
      "text": "It looks nice. The faucets were pre assembled backwards so it was a challenge to reverse them. The water does not drain fully, I believe it’s a flawed design. There is always a puddle left in the sink. The drainer sits too high with no solution.",
      "rating": 4.0,
      "verified": true,
      "author": "Ann Vanzutphen",
      "helpful_votes": 0,
      "publication_date": 20200222
    },
    {
      "title": "Looks great",
      "text": "I needed a tub in a hurry and I got it before it was scheduled to be here. I was very impressed. To be honest had a little nick in the back but no one would see it since in the back behind closed doors. I would recommend this it is very pretty exactly what I wanted.",
      "rating": 5.0,
      "verified": true,
      "author": "Lynne O",
      "helpful_votes": 0,
      "publication_date": 20190117
    },
    {
      "title": "Shipped broken",
      "text": "Came broken. The piece was packed up splinter and then shipped. Should have not made it through quality control. Difficult and heavy to pack back up and take to ups location.",
      "rating": 1.0,
      "verified": true,
      "author": "jessica",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "Looks nice but cheaply made",
      "text": "Very flimsy and the faucet took some rework to keep it from leaking Looks nice but would not buy again",
      "rating": 2.0,
      "verified": true,
      "author": "corey",
      "helpful_votes": 2,
      "publication_date": 20181009
    },
    {
      "title": "Very nice assembly.",
      "text": "My first impression is a very nice assembly and I like the smooth slick finish of the sink. I do have one suggestion, somehow figure a way to have more contour on the bottom so the water will run better toward the drain and not sit in the sink. I used a level to make sure the sink was sitting correct so not to puddle the water.",
      "rating": 5.0,
      "verified": true,
      "author": "Larry",
      "helpful_votes": 0,
      "publication_date": 20181206
    },
    {
      "title": "Ideal Features",
      "text": "We liked the style and features of the cabinet. Perfect for a laundry sink, it is nice & deep, offers some storage below and high faucet to get large items into the sink to clean. Sink & cabinet arrived in good condition (no defects or damage).",
      "rating": 4.0,
      "verified": true,
      "author": "Arbos",
      "helpful_votes": 0,
      "publication_date": 20190427
    },
    {
      "title": "Excellent product",
      "text": "We bought this to replace that cheap plastic sink most laundry rooms have. Although the sink is plastic it looks very nice, and is very study. We received many compliments",
      "rating": 5.0,
      "verified": true,
      "author": "Berton Reynolds",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "Very sturdy and great value",
      "text": "The sink comes already assembled, you'll have to attach the base and install the drain and faucet. The material is made out of plastic so getting wet isn't an issue since it's a laundry tub. Overall great product.",
      "rating": 5.0,
      "verified": true,
      "author": "OliverTwist",
      "helpful_votes": 0,
      "publication_date": 20190423
    },
    {
      "title": "Not for tall people",
      "text": "The unit is not as tall as the one we replaced but we are getting used to it. Definitely need a professional to do installation.",
      "rating": 4.0,
      "verified": true,
      "author": "crossgroves",
      "helpful_votes": 0,
      "publication_date": 20190422
    },
    {
      "title": "Great customer service and product!",
      "text": "Replaced our existing unit with a better unit and it looks great. The support from Jackson was the best I've had and will definitely buy again from them.",
      "rating": 5.0,
      "verified": true,
      "author": "Cliff",
      "helpful_votes": 0,
      "publication_date": 20190712
    },
    {
      "title": "EXCELLENT COMPANY",
      "text": "PRODUCT WAS VERY NICE, SINCE THE SINK WAS SO DEEP THE DRAIN WAS TO LOW FOR ME. EXCELLENT COMPANY TO DEAL WITH.",
      "rating": 5.0,
      "verified": true,
      "author": "tony cat",
      "helpful_votes": 0,
      "publication_date": 20190516
    },
    {
      "title": "Looks Great in our Laundry Room",
      "text": "We replaced an old wooden vanity with this unit. The bright white matches the washer & dryer and brightens the whole room. It looks great and the tall faucet is a plus.",
      "rating": 5.0,
      "verified": true,
      "author": "Glenn R",
      "helpful_votes": 0,
      "publication_date": 20190501
    },
    {
      "title": "Easy to install and looks better than the old sink ...",
      "text": "Easy to install and looks better than the old sink it replaced. Gives more of a finished look in our laundry room.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180524
    },
    {
      "title": "Quality",
      "text": "Overall a good product. The sprayer is a little cheap but overall a good buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Bert C.",
      "helpful_votes": 0,
      "publication_date": 20181212
    },
    {
      "title": "Great update to our laundry room",
      "text": "Great tub, looks nice and clean. Makes the entire laudry room looks better.",
      "rating": 5.0,
      "verified": true,
      "author": "L. Hadley",
      "helpful_votes": 0,
      "publication_date": 20181107
    },
    {
      "title": "Great sink!",
      "text": "Love this sink! It fit our space perfectly, the tub is a nice size and the faucet has regular/spray options, a very nice touch. Easy for our plumber to install.",
      "rating": 5.0,
      "verified": true,
      "author": "G. Fletcher",
      "helpful_votes": 0,
      "publication_date": 20181115
    },
    {
      "title": "Beautiful!",
      "text": "after some original concerns I was pleased that Jackson Supplies LLC Agent out of their way to make my purchase perfect. Thank you for excellent customer service and for taking the time to help me get this great piece just right!",
      "rating": 4.0,
      "verified": true,
      "author": "Jennie Smith Wilson",
      "helpful_votes": 0,
      "publication_date": 20190919
    },
    {
      "title": "Good cabinet, fair faucet",
      "text": "Cabinet is sturdy and functional. Faucet and nozzle are noticeably cheaper...will likely have to replace that piece in a year or so",
      "rating": 5.0,
      "verified": true,
      "author": "Alicia",
      "helpful_votes": 0,
      "publication_date": 20190707
    },
    {
      "title": "Don’t do it",
      "text": "This product looks nice but flimsy facet and tub. Received damaged corner of cabinet broken. Would not recommend would never repurchase. Easy to install and assemble but not worth the money at all.",
      "rating": 3.0,
      "verified": true,
      "author": "Brody’s Mon",
      "helpful_votes": 0,
      "publication_date": 20200412
    },
    {
      "title": "nice looking but cheap product",
      "text": "the product came chipped in 2 places also very plastic also very weak faucet",
      "rating": 3.0,
      "verified": true,
      "author": "jean almeida",
      "helpful_votes": 0,
      "publication_date": 20200301
    },
    {
      "title": "Awesome Product.",
      "text": "Simply beautiful! The sink is deep and the doors are very good looking. The entire set, sink, cupboard and faucet is awesome.",
      "rating": 5.0,
      "verified": true,
      "author": "Goody",
      "helpful_votes": 0,
      "publication_date": 20200124
    },
    {
      "title": "It works and looks great",
      "text": "It came in very nicely wrapped everything was as I hoped",
      "rating": 5.0,
      "verified": true,
      "author": "T  MAN",
      "helpful_votes": 0,
      "publication_date": 20200508
    },
    {
      "title": "I recommend highly",
      "text": "Way good. Easy to wash dishes and small clothes. Easy to keep clean",
      "rating": 5.0,
      "verified": true,
      "author": "Joycesmith",
      "helpful_votes": 0,
      "publication_date": 20200312
    },
    {
      "title": "Not a good quality",
      "text": "It is not a quality. Very inexpensive quality material, faucetter and sink very poor quality material. I doubt it will last long. Too much hassle to return due to size.",
      "rating": 1.0,
      "verified": true,
      "author": "Michael Ansari",
      "helpful_votes": 0,
      "publication_date": 20190317
    },
    {
      "title": "Sink is NOT white as stated and advertised",
      "text": "Sink is not white and more of a yellowish white color. Put it right back in box to return only to be charged return shipping. DO NOT RECOMMEND product or service.",
      "rating": 3.0,
      "verified": true,
      "author": "Julie Cowan",
      "helpful_votes": 0,
      "publication_date": 20200407
    },
    {
      "title": "High quality for the price",
      "text": "Instructions were clear. Parts were wonderful. Installation was a breeze. The included supply lines were short, but overall, this was a great buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul Harper",
      "helpful_votes": 0,
      "publication_date": 20200602
    },
    {
      "title": "Very pretty",
      "text": "Like this a lot. Had to put shims in the front so water would drain from sink. Had plumber connect as did not have sink previously. I had no problem putting it together",
      "rating": 5.0,
      "verified": true,
      "author": "Shirley Pye",
      "helpful_votes": 0,
      "publication_date": 20200121
    },
    {
      "title": "Very nice quality sink",
      "text": "Sink is made of quality acrylic. Cabinet is sturdy and attractive",
      "rating": 5.0,
      "verified": true,
      "author": "Terry",
      "helpful_votes": 0,
      "publication_date": 20190508
    },
    {
      "title": "Good price, poor quality materials.",
      "text": "Good for price but cheap materials used to build unit.",
      "rating": 4.0,
      "verified": true,
      "author": "Collin and LaRisa",
      "helpful_votes": 0,
      "publication_date": 20190403
    },
    {
      "title": "Great quality!",
      "text": "Good quality cabinet. Sink is deeper than others that I looked at and great for my needs. Faucet is nice and I really like the adjustable sprayer.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan Lavigne",
      "helpful_votes": 0,
      "publication_date": 20180719
    },
    {
      "title": "Quality product",
      "text": "Love the design and overall quality. Minor issue about the misalignment of the two cabinet doors. They cannot be adjusted.",
      "rating": 4.0,
      "verified": true,
      "author": "Don H",
      "helpful_votes": 0,
      "publication_date": 20190714
    },
    {
      "title": "Impressed",
      "text": "I looked for sometime to find a nice looking one in cabinet form. Very happy with this unit.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190103
    },
    {
      "title": "Poor quality",
      "text": "The cabinet had damaged finish. The cabinet was too narrow for plumbing to work right. The faucet was very cheaply made.",
      "rating": 2.0,
      "verified": true,
      "author": "Sam A Martindale",
      "helpful_votes": 0,
      "publication_date": 20180701
    },
    {
      "title": "Three Stars",
      "text": "Doors are warped and do not meet evenly in the middle. For the price it is ok",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180625
    },
    {
      "title": "Great tub and cabinet!",
      "text": "Very easy to install the faucet seems to work very well!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181118
    },
    {
      "title": "Looks great. Easy to assemble and install",
      "text": "Looks great. Easy to assemble and install. Just received this item so I have no comment re durability. Price is Right.",
      "rating": 4.0,
      "verified": true,
      "author": "Jeff Goodman",
      "helpful_votes": 5,
      "publication_date": 20180206
    },
    {
      "title": "I believe the person who put the cabinet together was not careful",
      "text": "I like how it looks and is really a good item, the only complaint is the broken corner it came with.",
      "rating": 4.0,
      "verified": true,
      "author": "Gloria montoya",
      "helpful_votes": 4,
      "publication_date": 20180814
    },
    {
      "title": "Four Stars",
      "text": "Nice looking. Cabinet came reassembled but plumbing took a little work.",
      "rating": 4.0,
      "verified": true,
      "author": "Don B.",
      "helpful_votes": 10,
      "publication_date": 20150421
    },
    {
      "title": "Similar to other reviews, this item arrived damaged. ...",
      "text": "Similar to other reviews, this item arrived damaged. The particle board on left side of the cabinet was split. Unfortunately it wasn't recognized until half-way through instillation process.",
      "rating": 2.0,
      "verified": true,
      "author": "Robert Mercier Turner II",
      "helpful_votes": 0,
      "publication_date": 20180730
    },
    {
      "title": "a big drip",
      "text": "The faucet is probably the cheapest piece of garbage I have ever seen. If your a light sleeper stay away from this cause you will hear drip drip drip drip drip drip drip drip, should I continue?",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 13,
      "publication_date": 20180130
    }
  ],
  "product_meta": {
    "title": "LDR 7712CP-SD Laundry Utility Cabinet Sink Vanity Chrome Faucet with Pull Out Spray and Soap Dispenser",
    "description": "Bring functional and sleek design into your laundry or utility room with the LDR utility sink and cabinet set. Heavy-duty faucet features a high arc design so you can fit all those bulky items, pull-down spout makes washing, soaking and filling pails easy. Change from a steady stream of water to a powerful spray with just one touch of a button. Spout is weighted to ensure it stays in place without sagging. Extra deep 13½-inch sink and built in washboard accommodate all your washing and scrubbing needs. Say goodbye to messy soap bottles- attached chrome soap dispenser does the job with elegance. The cabinet is perfect for hiding away all your detergents and other laundry accessories so the room stays neat. The glossy white finish and frosted door design add to the stylish finish. Slow close doors prevent slamming and prolong the life of the cabinet. Hardware is chrome to match the faucet. Pre-assembled base provides extra quality and stability. Solidly glued at the factory increases stability, and decreases time needed to assemble the unit. Sits on a 4.5-inch high wooden base. Includes everything you need to have the cabinet and sink set up in no time. Dimensions- Overall- 22”L 24.25”W X 32.75”H; Sink Dimensions- 22”L X 24.25”W X 13.5”D. 1-year limited warranty. Make it yours today!",
    "rating": 4.2,
    "feature_bullets": [
      "This cabinet and sink set combines everything you were looking for in a laundry tub vanity, plus all the extras that you weren’t even envisioning- think extra-deep sink basin, attached soap dispenser, built-in scrubbing board and elegant frosted glass- for a complete laundry room makeover. Quality built with both functionality and style in mind, this pre-assembled unit comes with all the plumbing parts (including supply lines) and hardware needed for a complete installation",
      "The base of this vanity is preassembled at the factory. This highly increases stability, as well as decreases time needed to assemble the unit; cabinet is perfect for hiding away all your detergents and other laundry accessories, keeping the room neat. Glossy white finish and frosted door design adds a stylish touch; slow close doors prevent slamming to prolong cabinet life; cabinet hardware is chrome to match the faucet and to match any existing decor",
      "Features: Extra-Deep Sink Basin accommodates all your washing needs; built-in scrubbing board for removing those stubborn stains; attached soap dispenser means no more messy spilling soap bottles; full-size 4.25” drain increases drain flow for efficient sink drainage and reduced blockages strainer can be used to stop the water from going down for soaking and will catch any degree when straining which can be easily discarded",
      "Faucet is constructed with a metal base, handles, arch and even metal shanks for lasting quality. Extra High Arc design and weighted pull-out head makes washing, soaking, and filling pails easy; alternate between a steady stream and a powerful spray with just a touch of a button conveniently located on the spout",
      "Set Includes Vanity, deep slop sink, stylish cabinet, Pull-Down Faucet, soap dispenser and plumbing installation parts; easy step-by-step illustrated instructions; 13.5” deep sink; Dimensions- Overall- 22”L 24.25”W X 32.75”H; Sink Dimensions- 22”L X 24.25”W X 13.5”D. Some assembly required; 1-year limited warranty."
    ],
    "specifications": {
      "Manufacturer": "LDR",
      "Part Number": "040 7712CP-SD",
      "Item Weight": "68.9 pounds",
      "Product Dimensions": "21.8 x 25.3 x 33.8 inches",
      "Item model number": "040 7712CP-SD",
      "Is Discontinued By Manufacturer": "No",
      "Size": "29\"H x 25.3\"W x 21.8\"D",
      "Color": "White",
      "Item Package Quantity": "1",
      "Number of Handles": "2",
      "Measurement System": "Inch",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "ASIN": "B00U0K3KIO",
      "Customer Reviews": "4.2 out of 5 stars136 ratings4.2 out of 5 stars",
      "Best Sellers Rank": "#231,234 in Tools & Home Improvement",
      "Date First Available": "February 25, 2015"
    },
    "categories": [
      "Kitchen & Bath Fixtures",
      "Tools & Home Improvement",
      "Laundry & Utility Fixtures",
      "Laundry & Utility Sinks"
    ],
    "price": ""
  }
}