{
  "website_summaries": [
    {
      "verdict": "Instant sun-kissed look that lasts 7 days.",
      "pros": [
        "Provides you with a sun-kissed glow that lasts up to 7 days",
        "Doesn't have the typical unpleasant smell of many self-tanners",
        "A little goes a long way – you need just 2 drops a day",
        "Works well on sensitive skin"
      ],
      "cons": [
        "Not suggested for oily skin",
        "Some comments of a greasy consistency"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Orange, Orange face outcome.  Don't do it. 🍊 👎",
      "text": "Possibly just me, but I ended up with an ORANGE face. I did the directions as stated, but ended up with an orange, orange face. Would never recommend to a friend. Again, maybe it's just my face.",
      "rating": 1.0,
      "verified": true,
      "author": "Brian",
      "helpful_votes": 2,
      "publication_date": 20180528
    },
    {
      "title": "Poor packaging and bottle broke",
      "text": "While id love to actually review this product and not cheap... i was so excited to receive it, took it out of the box and saw it had a plastic square stand, thinking it was part of the packaging to keep the bottle upright, i went to pull it off and the bottle broke in my hand and product went everywhere. So i cant actually review the product but the packaging is awful. If the plastic stand that was attached is actual packaging, its stuck and the force caused the bottle to break, if its not part of packaging then ya may want to redesign the bottle and omit tht square base",
      "rating": 1.0,
      "verified": true,
      "author": "Kimberly L.",
      "helpful_votes": 11,
      "publication_date": 20170425
    },
    {
      "title": "Four Stars",
      "text": "I love this product it's a little orange at first but once you shower it looks great!",
      "rating": 4.0,
      "verified": true,
      "author": "LG",
      "helpful_votes": 5,
      "publication_date": 20160814
    },
    {
      "title": "Doesn’t work, not worth money",
      "text": "This product did not do anything at all for me. I’m not sure if it’s because it was from Amazon and not from a store, but I used it for 2 weeks every night as directed on bottle, and there was *literally* ZERO hint of a tan. Super disappointing to say the least, and definitely not worth the money.",
      "rating": 1.0,
      "verified": true,
      "author": "Nicole Jones",
      "helpful_votes": 2,
      "publication_date": 20180418
    },
    {
      "title": "Gives a great overnight tan",
      "text": "Gives a great overnight tan! It’s very runny so I put several drops in my hands and rubbed it all over my face and neck. It’s completely streak free and dries quick I love this stuff!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171206
    },
    {
      "title": "Nice glow",
      "text": "Nice. Nice glow in the winter. Not fake. Very light color but noticeable",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle M.",
      "helpful_votes": 0,
      "publication_date": 20190131
    },
    {
      "title": "Four Stars",
      "text": "it was easy to use and looked like a real tan.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180312
    },
    {
      "title": "Found that this oil did give a good tan but never fully sank into my skin resulting ...",
      "text": "Found that this oil did give a good tan but never fully sank into my skin resulting in my needing to wash my face the next morning which results in washing away the tan. Was just okay.",
      "rating": 3.0,
      "verified": true,
      "author": "Kmsimmo",
      "helpful_votes": 4,
      "publication_date": 20160708
    },
    {
      "title": "Works really well and looks natural, but do not ...",
      "text": "Works really well and looks natural, but do not use on face if you have brown spots (sun spots). These will get darker.",
      "rating": 5.0,
      "verified": true,
      "author": "c west",
      "helpful_votes": 3,
      "publication_date": 20171017
    },
    {
      "title": "My favorite face tanner",
      "text": "I bought this from Ulta a couple years back, and I honestly love it. It gives my face a nice bronzey glow! I've never noticed it being orange, but it may look different on other skin tones.",
      "rating": 5.0,
      "verified": false,
      "author": "Barefootblonde",
      "helpful_votes": 3,
      "publication_date": 20170729
    },
    {
      "title": "Not an oil",
      "text": "It’s not an oil, more like liquid and it did nothing for me!",
      "rating": 1.0,
      "verified": false,
      "author": "jill cobb",
      "helpful_votes": 0,
      "publication_date": 20180710
    }
  ],
  "product_meta": {
    "title": "St. Tropez Self Tan Luxe Facial Oil, 1.01 Fl Oz",
    "description": "This Brazilian inspired, non-greasy Lux Facial Oil is the most luxurious tan yet for the ultimate natural-looking sun kissed glow. It lasts up to seven days, contains a 100 percent natural tanning agent suitable for all skin tones, and features a 100 percent natural fragrance for no telltale self-tan aroma. Ultra-hydrating and easy to use, it promotes a beautiful, streak-free finish.\n\nBRAND STORY\nWhether you prefer an all-over bronze glow or a lighter, natural tone, St. Tropez provides a powerful, healthy self-tanner for all types of sunkissed needs.",
    "rating": 3.8,
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "1.69 x 1.69 x 4.65 inches; 4.59 Ounces",
      "Item model number": "15076",
      "UPC": "709102223941",
      "Manufacturer": "St. Tropez",
      "ASIN": "B00U7DVWRU",
      "Amazon Best Sellers Rank": "#308,573 in Beauty & Personal Care",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Skin Care",
      "Self-Tanners",
      "Beauty & Personal Care",
      "Sunscreens & Tanning Products"
    ],
    "price": ""
  }
}