{
  "website_summaries": [
    {
      "verdict": "3-pack of 100% cotton, durable burp clothes at a discounted price.",
      "pros": [
        "Multiple color and style options for both genders",
        "3 cloths",
        "100% cotton",
        "Machine washable",
        "12\" x 17\"",
        "Double layered for extra durability",
        "Perfect over-the-shoulder fit"
      ],
      "cons": [
        "Customers commented that these shrank in the dryer after washing"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Sturdy and absorbent enough for burp cloths, soft enough for blankies",
      "text": "I first bought a set of Spasilk burp cloths 6 years ago for my newborn twins because I loved the designs. I purchased several more sets that year because we all liked them so much. Besides looking cute, they're absorbent as burp cloths, they wash up really well, and they are so soft and snuggly that my 6 year old son still uses them as blankies that he sleeps with every night. So when baby #3 was on the way, I picked this grey set that goes perfectly with other grey striped and star-patterned blankets, and they're just as nice as the ones we bought 6 years ago. Love them and definitely recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Gwenelle",
      "helpful_votes": 0,
      "publication_date": 20190518
    },
    {
      "title": "Happy with this purchase",
      "text": "These are very pretty and practical. I liked them so much that I ordered a second set in the same color (pink) with a slightly different design. I looked at a lot of different sets before ordering these and they turned out to be very cute.",
      "rating": 5.0,
      "verified": true,
      "author": "Minnie",
      "helpful_votes": 4,
      "publication_date": 20170126
    },
    {
      "title": "So soft",
      "text": "I received these cloths as a gift when I had my daughter several years ago. They are the softest and held up with each wash. Since then, they are my go to baby gift for all of my friends. My absolute favorite!",
      "rating": 5.0,
      "verified": true,
      "author": "EJ22",
      "helpful_votes": 0,
      "publication_date": 20190201
    },
    {
      "title": "but I ended up buying these immediately after having my baby because they are much more like the hospital burp cloths which are way better than ...",
      "text": "I originally didn't plan on buying this style burp cloth because they weren't as stylish as some of the other ones out there, but I ended up buying these immediately after having my baby because they are much more like the hospital burp cloths which are way better than the fancy new ones that are available.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa",
      "helpful_votes": 0,
      "publication_date": 20180419
    },
    {
      "title": "Pretty and very soft but not very absorbent",
      "text": "These burp cloths are super soft and pretty but they are not very absorbent. A cotton prefold diaper works better at absorbing big messes like when a baby throws up or spits up heavily. So if you have that kind of baby dont make these your go to.",
      "rating": 4.0,
      "verified": true,
      "author": "Yuneisy M.",
      "helpful_votes": 0,
      "publication_date": 20190406
    },
    {
      "title": "Decent",
      "text": "These are decent burp cloths. They're not my favorite but we do use them as a backup. The fabric is very soft but it's not as absorbent as I would like it ideally. If you're cleaning up drool they're fine, but if your baby spits up a lot these are not the best option.",
      "rating": 4.0,
      "verified": true,
      "author": "LS",
      "helpful_votes": 0,
      "publication_date": 20170928
    },
    {
      "title": "Very Absorbent",
      "text": "It was really hard for me to find good burp cloths for a reasonable price. These are the perfect size (smaller which is what I wanted) and the material is very absorbent (much much more absorbent than the cloth diapers everyone seems to love). Will probably order more.",
      "rating": 5.0,
      "verified": true,
      "author": "Lizzy",
      "helpful_votes": 2,
      "publication_date": 20170828
    },
    {
      "title": "Soft & Durable",
      "text": "I ordered these because we used the same ones with our son 5 years ago. At 4.99 for a pack of 3 it was also an excellent bargain. They're very soft, and they appear just as well made as the sets we had previously. We still have those, but they've be relegated to the rag bin but they're still holding up. I ordered 4 sets of these.",
      "rating": 5.0,
      "verified": true,
      "author": "Patricia Meeks",
      "helpful_votes": 0,
      "publication_date": 20180407
    },
    {
      "title": "Soft and thick",
      "text": "I needed more burp clothes since mine were getting dingy. I ordered these because they were the cheapest and had good reviews. They are so nice and soft. They are much softer than the white cloth diapers that I use for burp cloths which I'm sure my baby appreciates when he lays his head on my shoulder. They are also nice and thick and the patterns on them are also cute. I would highly recommend these. Pros: Cheap Soft Cute Thick Cons: Non",
      "rating": 5.0,
      "verified": true,
      "author": "Sassy homemaker",
      "helpful_votes": 0,
      "publication_date": 20160715
    },
    {
      "title": "Soft burp cloths",
      "text": "These are my favorite burp cloths. They are soft and I'm not afraid to use them to wipe my baby's soft skin. The only negative is they are rather small but compared to the flannel burp cloths I much prefer these. They do soak up spit up and whatever else you need to clean. Pattern is gender neutral. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "KKTop Contributor: Baby",
      "helpful_votes": 0,
      "publication_date": 20171102
    },
    {
      "title": "I did not like them as much as the Gerber burp cloths",
      "text": "While these burp cloths are very soft and have bright colors, I did not like them as much as the Gerber burp cloths. They are a few inches smaller than the Gerber ones. I've found that I really need big cloths because my baby spits up a lot and once I'm going with the bigger ones, may as well buy the Gerbers which are significantly larger than these.",
      "rating": 3.0,
      "verified": true,
      "author": "3littlekittens",
      "helpful_votes": 0,
      "publication_date": 20161101
    },
    {
      "title": "MUST HAVE",
      "text": "Love love! I’ve used these with both my babies and I have a over supply of breast milk so I always need something with a lot of absorbency without being hard or to thick.",
      "rating": 5.0,
      "verified": true,
      "author": "olivia carril",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "Good quality is very important for burp cloths!",
      "text": "As a parent of a very spitty baby, good burp cloths are very important. To us, size (not too small), softness (survives many washes), and absorbing ability are very important. These meet those requirements. The patterns are also nice",
      "rating": 5.0,
      "verified": true,
      "author": "Madeline",
      "helpful_votes": 0,
      "publication_date": 20181008
    },
    {
      "title": "Good, neutral set!",
      "text": "Perfect! Great price too! Can't beat $10 for 3 burp cloths! We are being surprised on the gender of our baby so these were the perfect design! They aren't as big as I thought, but a good enough size to toss on your shoulder while you burp baby. I feel like even if I went to a craft store and bought fabric and made my own, this would still be the better deal and I love how you get 3 different styles. I will prob end up buying more down the road once we know if we have a boy or a girl.",
      "rating": 5.0,
      "verified": true,
      "author": "ShannonPA",
      "helpful_votes": 0,
      "publication_date": 20150710
    },
    {
      "title": "These are sewn nicely and are the size I was expecting",
      "text": "These are sewn nicely and are the size I was expecting. They do not shirk or change/lose shape after washing which is nice. The only reason I didn't give five stars is because I was expecting the fabric to be different and they seemed more stretchy/spandex-like than I anticipated.",
      "rating": 4.0,
      "verified": true,
      "author": "Lety ",
      "helpful_votes": 0,
      "publication_date": 20180203
    },
    {
      "title": "Soft and nice",
      "text": "These are cotton jersey fabric, soft and nice to the touch. I thought they would be like the typical cotton burp cloth which is what I wanted, but my mistake. They are nice and would make a nice gift for a new little one.",
      "rating": 4.0,
      "verified": true,
      "author": "PC",
      "helpful_votes": 0,
      "publication_date": 20190912
    },
    {
      "title": "Soft but strange design",
      "text": "These are soft and come in super handy as burping cloths, but they have a seam in the middle, which is weird to me (it doesn't interfere with the softness of the product, but makes it difficult to fold neatly and is just strange as a design choice). I wouldn't buy this again but like just about any piece of soft cloth in a house with an infant, they come in handy.",
      "rating": 3.0,
      "verified": true,
      "author": "Aleksandra",
      "helpful_votes": 0,
      "publication_date": 20160515
    },
    {
      "title": "Blankie soft burp cloths",
      "text": "I ordered these because I had some narrow burp cloths from Carters that were just too small. These burp cloths are great! They are so so soft and seem to get softer as I wash them. They are a great size for putting over my shoulder when burping the baby and I keep one next time me constantly while nursing for any leaks or messes. The prints are adorable! I ordered 2 sets of these burp cloths and couldn't be happier!",
      "rating": 5.0,
      "verified": true,
      "author": "Honeybee Lady",
      "helpful_votes": 0,
      "publication_date": 20160120
    },
    {
      "title": "The Best Burp cloth to wipe face!",
      "text": "I love these Burp clothes! They are the softest ones we have and great for wiping the baby's face. Yes they are shorter than the Gerber ones but far better made and useful. I loved them so much I just bought 9 more of them for my grandson!",
      "rating": 5.0,
      "verified": true,
      "author": "Kate S",
      "helpful_votes": 0,
      "publication_date": 20171217
    },
    {
      "title": "Our Favorite!",
      "text": "Love love love these! I ended up buying 5 more sets - I have a spitty baby and fly through them every day :). They are the softest burp cloths we own, and we have had quite a few different brands over the years (all three of my kids were spitty). They wash up well and don't hold stains. My favorite by far. You should buy them! :)",
      "rating": 5.0,
      "verified": true,
      "author": "Kristin",
      "helpful_votes": 0,
      "publication_date": 20160526
    },
    {
      "title": "Not pretty but strong and soft",
      "text": "Really strong and soft at the same time. Not pretty but get the job done. Plus they last ... 12 months later, still using them (as towel or else)",
      "rating": 4.0,
      "verified": true,
      "author": "Michele",
      "helpful_votes": 0,
      "publication_date": 20171018
    },
    {
      "title": "Nice Price, absorbant and soft",
      "text": "These burp clothes were very affordable and we are satisfied with them. As with all burp clothes, it would be nice if they were a few inches larger because they shrink a little after washing but not more than expected. Nice clothes!",
      "rating": 4.0,
      "verified": true,
      "author": "Esther Smith",
      "helpful_votes": 0,
      "publication_date": 20160930
    },
    {
      "title": "So soft and absorbent",
      "text": "They are very similar to the Gerber burp cloths from about 8 years ago. Very soft and absorbent!!",
      "rating": 5.0,
      "verified": true,
      "author": "jodi52",
      "helpful_votes": 0,
      "publication_date": 20190304
    },
    {
      "title": "Not very soft after washing and still rather small. ...",
      "text": "Not very soft after washing and still rather small. Baby would always manage to spit up every bit on the rag and I wear a lot of dark colors. Serviceable so got what I paid for (it is one of the cheaper options).",
      "rating": 3.0,
      "verified": true,
      "author": "Eric & Patty Hsiao",
      "helpful_votes": 0,
      "publication_date": 20170518
    },
    {
      "title": "Okay, but seem like you could make them yourself.",
      "text": "These look cute and were delivered super fast, but they look like something that could be sewn yourself if you had any constructive talent. My MIL told me quite bluntly that she could totally make something just like them herself. At least they were inexpensive, good sized, and seemingly well made. A little thin, though.",
      "rating": 3.0,
      "verified": true,
      "author": "HotLeopardMama",
      "helpful_votes": 0,
      "publication_date": 20150209
    },
    {
      "title": "Nice material, wish they were bigger",
      "text": "Very nice, soft material, beautiful colors! I really like the feel of the material (100% cotton), although I wish these were made to be bigger. My little one spits up a lot on occasion and I tend to use these more to clean his face and use a larger burp cloth or a hand towel for over my shoulder. These are great for newborns or if your baby only spits up a tiny bit at a time.",
      "rating": 4.0,
      "verified": true,
      "author": "T. Talbot",
      "helpful_votes": 0,
      "publication_date": 20150123
    },
    {
      "title": "Nice and soft for baby.",
      "text": "These were exactly what I was wanting. Love them, will buy again in the future.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa",
      "helpful_votes": 0,
      "publication_date": 20190918
    },
    {
      "title": "Soft, absorbent and cute",
      "text": "These are my favorite burp cloths. The material is very soft, it absorbs well, is easy to wash, and they're very cute. I've been washing mine in cold water, tumble dry low, and in 3 months of use so far they haven't shrunk at all, and haven't suffered any other damage either. I got several packs so we can have them scattered around the house. You never know when you're gonna need one!",
      "rating": 5.0,
      "verified": true,
      "author": "Diana",
      "helpful_votes": 0,
      "publication_date": 20140819
    },
    {
      "title": "Soft, but shrunk! Not big enough for high spit-up babies",
      "text": "I bought these because of the great reviews and was looking forward to using them. They are very soft and absorbent, which is a plus. Unfortunately, despite following the washing instructions, these shrunk a lot. They are so small now, and smaller than other burp cloths I have, so these are just collecting dust in a drawer. Small burp cloths might work well for some infants, but our son has huge amounts of spit-up, and this size just doesn't cut it for us. For that reason, I still gave it 3 stars because they probably work well for babies that do not have a lot of spit-up.",
      "rating": 3.0,
      "verified": true,
      "author": "Brooke",
      "helpful_votes": 0,
      "publication_date": 20150329
    },
    {
      "title": "Great for teething babies",
      "text": "I purchased these for my daughter who blessed our family with a beautiful baby girl. She loves this brand of burp cloths and when she said she needed more, I didn't hesitate to purchase them. She is teething right now and goes through several clothes each day. These are nice and soft.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20160913
    },
    {
      "title": "Great Product So I Bought More",
      "text": "These have been working great for me. They're a little larger and thicker than some other burp cloths, which I find ideal because that makes them more absorbent. They're also relatively soft. Each cloth has two vertical seams - the seams do not affect their functionality, but I'm mentioning it because you can't see them in the photo. After my baby arrived, I bought another pack of these since I like them so much.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica Inman",
      "helpful_votes": 0,
      "publication_date": 20131114
    },
    {
      "title": "Really soft burp cloths for baby!",
      "text": "These burp cloths are SO soft. I like using them just because of that fact, though they aren't as large as others. I would still recommend - they are good quality and make a nice gift as well. We have two sets and use them everyday!",
      "rating": 4.0,
      "verified": true,
      "author": "LC",
      "helpful_votes": 0,
      "publication_date": 20160428
    },
    {
      "title": "Maybe go for something that'll absorb",
      "text": "Goodness, you can never have too many of these! The only reason I give them 3 stars instead of 5 is the fact that these aren't as absorbent as the ought to be. Spit up and milk just kinda sit on top and don't soak up or soak in. This is a problem when you're using these to clean up messes like that.",
      "rating": 3.0,
      "verified": true,
      "author": "AMZ S.",
      "helpful_votes": 0,
      "publication_date": 20170818
    },
    {
      "title": "These are my favorite burp clothes",
      "text": "These are my favorite burp clothes. So soft and dry quickly. It doesn't hurt that they come in cute colors too!",
      "rating": 5.0,
      "verified": true,
      "author": "Pamela L Shaw",
      "helpful_votes": 0,
      "publication_date": 20171008
    },
    {
      "title": "Thye issue is they do not cover a large enough area and spit up can easily get on my",
      "text": "These shrank a lot after washing and hardly cover a shoulder. They are not very thick yet they seem to be absorbant. Thye issue is they do not cover a large enough area and spit up can easily get on my clothes",
      "rating": 1.0,
      "verified": true,
      "author": "Crystal Thompson",
      "helpful_votes": 0,
      "publication_date": 20160627
    },
    {
      "title": "Soft",
      "text": "These are soft and my baby seems to like them. They wash well. They are about the size of a cloth prefold diaper. Longer and way softer than the Gerber burp rags I have. I would definitely buy these again, but I don't need anymore!",
      "rating": 5.0,
      "verified": true,
      "author": "Tang",
      "helpful_votes": 0,
      "publication_date": 20161006
    },
    {
      "title": "Love these",
      "text": "These are so cute! Super soft and perfect. I ordered both the girl and boy ones for 2 baby showers that I'm going to.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Ellen Riley",
      "helpful_votes": 0,
      "publication_date": 20180730
    },
    {
      "title": "Very small",
      "text": "Pros: 1. Love the patterns and colors 2. Very soft fabric Con: 1. Small compared to other burp cloths (Gerber) so you don't get good coverage especially if your baby spits up a lot. Overall I probably would not buy again due to the size.",
      "rating": 3.0,
      "verified": true,
      "author": "Sibi",
      "helpful_votes": 0,
      "publication_date": 20160716
    },
    {
      "title": "Love these!",
      "text": "So soft! Spasilk was my favorite brand for my first son and I can't wait to use these new ones for his baby brother!",
      "rating": 5.0,
      "verified": true,
      "author": "TLJagord",
      "helpful_votes": 0,
      "publication_date": 20180416
    },
    {
      "title": "So soft",
      "text": "I love these burp clothes. They are super soft for my baby's face.",
      "rating": 5.0,
      "verified": true,
      "author": "Devonay Lashay",
      "helpful_votes": 0,
      "publication_date": 20190824
    },
    {
      "title": "Go with Gerber instead!",
      "text": "The fabric is soft and absorbent, but these burp cloths are laughably small. I much prefer the 4-pack of Gerber Baby flannel burp cloths which are also available from Amazon.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160921
    },
    {
      "title": "Great Quality!",
      "text": "Supersoft! I love Spasilk Burp cloths. I used these with my son 5+ years ago and was lucky to have some still so I ordered them for my daughter!",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer Bermudez ",
      "helpful_votes": 0,
      "publication_date": 20190820
    },
    {
      "title": "Soft , small burp cloths",
      "text": "These are soft and just the right size for a burp cloth. Small to be used as a towel or on the car seat. Retained softness after wash.",
      "rating": 4.0,
      "verified": true,
      "author": "AK",
      "helpful_votes": 0,
      "publication_date": 20160623
    },
    {
      "title": "Good size and extra soft",
      "text": "The one thing we didn't get as a baby shower present was burp cloths. I've since bought a few different kinds, and I like these the best. They are so soft,it is nice to wipe baby's face with them. They are also a good size for over the shoulder. They give a decent amount of coverage and protection for your clothes. I'd give these as a shower gift inthe future.",
      "rating": 5.0,
      "verified": true,
      "author": "JupiterGirl",
      "helpful_votes": 0,
      "publication_date": 20130116
    },
    {
      "title": "Would definitely recommend to other new moms",
      "text": "Soft enough on the baby’s skin when burping and the material isn’t cheap- returns back to its original state after being washed. Would definitely recommend to other new moms",
      "rating": 1.0,
      "verified": true,
      "author": "Johari",
      "helpful_votes": 0,
      "publication_date": 20180628
    },
    {
      "title": "Best",
      "text": "The best size and thickness/softness. I’ve gotten 4 sets so far. No other burp cloths have compared.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190709
    },
    {
      "title": "Good buy",
      "text": "Great burp cloths, I initially bought 2 sets for my twins, then bought another two (they are big spitup-ers!) after I saw how well they hold up in the wash. Quality fabric, lots of cute prints.",
      "rating": 5.0,
      "verified": true,
      "author": "neiha17",
      "helpful_votes": 0,
      "publication_date": 20170228
    },
    {
      "title": "Softest burp rags ever!",
      "text": "Very soft!! I love these and find myself reaching for them first in my stash. They are slightly smaller than another one I have but are still much better and larger than the oval shaped ones you find in all the stores.",
      "rating": 5.0,
      "verified": true,
      "author": "Laura E Gardner",
      "helpful_votes": 0,
      "publication_date": 20160417
    },
    {
      "title": "Love these burp cloths",
      "text": "Love these burp cloths. The most important thing we were looking for is they need to be 100% cotton which they are. Easy to wash and light weigh and folds good. Would recommend them.",
      "rating": 5.0,
      "verified": true,
      "author": "kron",
      "helpful_votes": 0,
      "publication_date": 20170104
    },
    {
      "title": "Four Stars",
      "text": "felt the price was too high for the quality of the product.",
      "rating": 4.0,
      "verified": true,
      "author": "Yvette L Blodgett",
      "helpful_votes": 0,
      "publication_date": 20181017
    },
    {
      "title": "soft and cute, but not big enough for us",
      "text": "We've been using these for about 4 months. They're very soft and stretchy, but not as big as I'd like. Our little man has really big spit-ups and these wouldn't catch it if it was under his head or over a shoulder... but they're good for wiping up afterward and super soft to use on his face.",
      "rating": 4.0,
      "verified": true,
      "author": "KTM",
      "helpful_votes": 0,
      "publication_date": 20160506
    },
    {
      "title": "Super soft",
      "text": "This fabric is the softest ever! I’ve bought other baby items from Spasilk because of this fabric. It feels so luxurious. Not scratchy at all like some other burp cloths.",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth S.",
      "helpful_votes": 0,
      "publication_date": 20200823
    },
    {
      "title": "Great burp cloths",
      "text": "I love these burp cloths. They wash well, are very absorbent, and are incredibly soft. I received these and also some gerber brand as a shower gift, and I love these so much I went back and bought all the girly and gender-neutral colors.",
      "rating": 5.0,
      "verified": true,
      "author": "AST42701",
      "helpful_votes": 0,
      "publication_date": 20160724
    },
    {
      "title": "Great Quality",
      "text": "Had spasilk burp cloths for by 1st son and he loved them so much that they became his \"binkys\". Quality is so great I had to order them for my daughter.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer Bermudez ",
      "helpful_votes": 0,
      "publication_date": 20190319
    },
    {
      "title": "Super soft. I wish they were slightly larger",
      "text": "Super soft. I wish they were slightly larger. Overall good purchase for babies who do a lot of spitting up.",
      "rating": 4.0,
      "verified": true,
      "author": "A. Kunis",
      "helpful_votes": 0,
      "publication_date": 20180117
    },
    {
      "title": "Perfect!",
      "text": "Great burp cloths. Super soft and they wash great! I haven't used them yet but they feel and look like they can hold up well. With my precious kids, I used reusable cloth diapers as burp cloths and after one wash, those would start to pile. I have now ordered 4 sets of these so that I can have them stock piled in the nursery, down stairs, diaper bag and car. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Issy",
      "helpful_votes": 0,
      "publication_date": 20170818
    },
    {
      "title": "Soft & absorbent",
      "text": "Probably my favorite of a few type of burp cloths I bought.",
      "rating": 5.0,
      "verified": true,
      "author": "MT",
      "helpful_votes": 0,
      "publication_date": 20181216
    },
    {
      "title": "... this for our 2 week old daughter and we love it! It is very soft and absorbent",
      "text": "Bought this for our 2 week old daughter and we love it! It is very soft and absorbent. Serves its purpose of a bib!!",
      "rating": 5.0,
      "verified": true,
      "author": "SP",
      "helpful_votes": 0,
      "publication_date": 20170202
    },
    {
      "title": "Loved them!",
      "text": "I became a burp rag cloth snob and would only use these for our twins. Even though they're great, don't try to use them for too long as they can get smelly and stiff if the spit-up sits in there for a while.",
      "rating": 5.0,
      "verified": true,
      "author": "Brandon R.",
      "helpful_votes": 0,
      "publication_date": 20170907
    },
    {
      "title": "Love these",
      "text": "As I mentioned these burp cloths are really great. I've had them for 18 mths now since baby was born and they still look new and in great condition. Absorbs liquids very well and size is just great, not too big or small. Texture is soft for baby's face.",
      "rating": 5.0,
      "verified": true,
      "author": "NK",
      "helpful_votes": 0,
      "publication_date": 20140919
    },
    {
      "title": "Best Burp Cloths",
      "text": "These are soft and just the right size. So many now are too narrow. I used this brand for my granddaughter who is now 4 and they are still in good condition. She uses them with her dolls!",
      "rating": 5.0,
      "verified": true,
      "author": "Teacher from San Jose",
      "helpful_votes": 0,
      "publication_date": 20151231
    },
    {
      "title": "These burp cloths are amazing. They cover your whole shoulder",
      "text": "These burp cloths are amazing. They cover your whole shoulder, which makes a difference when you have burp cloths that only cover part of your shoulder. These burp cloths really catch it all.",
      "rating": 5.0,
      "verified": true,
      "author": "Emilyann B",
      "helpful_votes": 0,
      "publication_date": 20150928
    },
    {
      "title": "Nice burp cloths",
      "text": "These burp cloths are functional, cute, and well sized for out-of-the-house use. I have a lot of burp cloths in different media & sizes (cloth diapers, homemade, hand-me-downs). I use each for different reasons. These I use in the diaper bag. They are SO cute and really quite soft, yet absorbent. I would recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Snowchick",
      "helpful_votes": 0,
      "publication_date": 20130918
    },
    {
      "title": "Soft!",
      "text": "These do what they're supposed to and absorb and spit up they catch. They wash well, too.",
      "rating": 5.0,
      "verified": true,
      "author": "Alexandra King",
      "helpful_votes": 0,
      "publication_date": 20180422
    },
    {
      "title": "Five Stars",
      "text": "These are a little smaller then other burp cloths in in similar shape, but are much softer.",
      "rating": 5.0,
      "verified": true,
      "author": "Shannon ",
      "helpful_votes": 0,
      "publication_date": 20180609
    },
    {
      "title": "shrink a lot!",
      "text": "The print and softness of the material is great, but the first time I washed them, they shrunk to nearly half their original size, big enough, but I like to have enough in a burp cloth to hang over both sides of my shoulder, that is barely possible after the first wash, if you don't mind a smaller cloth, this is perfect for you. Would not purchase these again for myself.",
      "rating": 3.0,
      "verified": true,
      "author": "blueghost3181",
      "helpful_votes": 4,
      "publication_date": 20121230
    },
    {
      "title": "Perfect size and softness",
      "text": "These are so soft and the perfect size. Very cute designs on them and easy to clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Amy Nedd",
      "helpful_votes": 0,
      "publication_date": 20180128
    },
    {
      "title": "Favorite burp rags",
      "text": "These are the softest burp rags I have (and I have a lot). I like the size, not too small. It doesn't cling to itself (like some do) so it is easy to open quickly. I buy these for baby shower gifts.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160713
    },
    {
      "title": "Cute",
      "text": "Nice for the price for burp cloths..not the best but decent",
      "rating": 4.0,
      "verified": true,
      "author": "Kaylene Merkel",
      "helpful_votes": 0,
      "publication_date": 20190825
    },
    {
      "title": "So soft",
      "text": "Love these burp cloths. they are soft and the size of a pre-folded cloth diaper not like some burp cloths that are a small strip that the spit up can completely miss and run down your shirt sleeve. Dressier than plain white diapers and softer on those little face too.",
      "rating": 5.0,
      "verified": true,
      "author": "C. OCONNOR",
      "helpful_votes": 0,
      "publication_date": 20140314
    },
    {
      "title": "They're soft and pretty!",
      "text": "These are so cute for a baby girl and most of all soft. I have used these right from the start at the hospital, their washcloths etc. are so rough!! I have 3 sets of them, I probably could have used 4 : ) Definitely reccomend.",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda Overly",
      "helpful_votes": 0,
      "publication_date": 20150223
    },
    {
      "title": "our favorite",
      "text": "We tried lots of different cloths for our twins and these are hands down our favorite. Soft, very absorbent, hold up well i the wash, and cute colors. They do stretch out width wise with time and repeated washing but this doesn't affect their function. Our go to baby shower gift.",
      "rating": 5.0,
      "verified": true,
      "author": "JesaLore",
      "helpful_votes": 0,
      "publication_date": 20140512
    },
    {
      "title": "Supersoft and cute",
      "text": "I love these burp cloths because of their smooth touch and the size is also perfect. Someone said that the yellow ones are too strong colors, too neon, but i actually like it. It's a nice change to all the soft colored baby stuff out there. Juss orded another set in blue.",
      "rating": 5.0,
      "verified": true,
      "author": "kerstin.k21",
      "helpful_votes": 0,
      "publication_date": 20130408
    },
    {
      "title": "Four Stars",
      "text": "I really like these - almost as good as cloth diapers. Easy to wash and dry and absorbent!",
      "rating": 4.0,
      "verified": true,
      "author": "Texas reader",
      "helpful_votes": 0,
      "publication_date": 20180518
    },
    {
      "title": "Pretty colors and soft burp rags",
      "text": "Really soft burp rags. Pretty colors and durable. If I have a con it would be that the tag is large relative to the rag and you can't cut it out or seam rip it without re-stitching the spot where it was. I still bought a few 3 packs anyways.",
      "rating": 4.0,
      "verified": true,
      "author": "Ash",
      "helpful_votes": 0,
      "publication_date": 20150708
    },
    {
      "title": "Great quality and soft",
      "text": "These are going to be perfect for my baby when I use them. They are a great quality and they are extremely soft! I can't wait to use them.",
      "rating": 5.0,
      "verified": true,
      "author": "Chelsea Hiles",
      "helpful_votes": 0,
      "publication_date": 20160601
    },
    {
      "title": "LOVE",
      "text": "I LOVE these burp cloths. I received one from a coworker and had to find more. They are a little thicker and really soft. They also absorb really well.",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda ",
      "helpful_votes": 0,
      "publication_date": 20170125
    },
    {
      "title": "They wash up nicely. I really like them compared to most of ...",
      "text": "these are soft and absorbent. They wash up nicely. I really like them compared to most of the others I've tried. I find them to be equal to the Gerber brand that are the same style.",
      "rating": 5.0,
      "verified": true,
      "author": "CountryMom",
      "helpful_votes": 0,
      "publication_date": 20141024
    },
    {
      "title": "Mishi",
      "text": "The baby burp towels were just what I needed for my small dog who has skin issues and needed 100% cotton.",
      "rating": 5.0,
      "verified": true,
      "author": "Joanne Balekdjian",
      "helpful_votes": 0,
      "publication_date": 20170610
    },
    {
      "title": "I like how soft they are",
      "text": "Compared to other burp cloths, these are just OK. I like how soft they are, but they're smaller than I would prefer and they stay cold and wet after use so I have to replace them more throughout the day.",
      "rating": 3.0,
      "verified": true,
      "author": "Marion",
      "helpful_votes": 0,
      "publication_date": 20160402
    },
    {
      "title": "Three Stars",
      "text": "A little bit smaller than expected but they are pretty and soft.",
      "rating": 3.0,
      "verified": true,
      "author": "Karen M. Ojeda Rodriguez",
      "helpful_votes": 0,
      "publication_date": 20180127
    },
    {
      "title": "Burp cloths - you need them.",
      "text": "It's too bad burp cloths aren't cheaper, since they're really just squares of fabric, but this is about as good as it gets. The one with the animals is really cute. The color scheme on the other two is a little weird and neon-ish. Then again, the patterns don't show stains as much.",
      "rating": 4.0,
      "verified": true,
      "author": "Alison Hayward",
      "helpful_votes": 0,
      "publication_date": 20130307
    },
    {
      "title": "I love SpaSilk!",
      "text": "I have a couple sets of SpaSilk burp cloths and they're all wonderfully soft and absorbent..... they're far better than any other burp cloth I have (Gerber & Babies R Us), which are all rough on baby's skin.",
      "rating": 5.0,
      "verified": true,
      "author": "7Lil",
      "helpful_votes": 0,
      "publication_date": 20140410
    },
    {
      "title": "Soft and Gentle for Baby",
      "text": "I like these cloths, the material is soft and gentle on baby's face and neck. I haven't figured out however why there is a big seam down the cloth about 1/3 of the way from the edge. I have ordered another set because I have found that I don't have enough and needed to replace the Gerber cloths I had ordered which are quite rough to the touch.",
      "rating": 4.0,
      "verified": true,
      "author": "Shirls",
      "helpful_votes": 0,
      "publication_date": 20140406
    },
    {
      "title": "Soft and good size for over the shoulder or as a light ...",
      "text": "Soft and good size for over the shoulder or as a light blanket for my small 6lb newborn while in his bassinet or carseat",
      "rating": 5.0,
      "verified": true,
      "author": "jmd109",
      "helpful_votes": 0,
      "publication_date": 20160802
    },
    {
      "title": "Five Stars",
      "text": "material is great and holds up to alot of washing and drying.",
      "rating": 5.0,
      "verified": true,
      "author": "Amy",
      "helpful_votes": 0,
      "publication_date": 20160801
    },
    {
      "title": "Super soft and absorbing cotton material",
      "text": "Super soft and absorbing cotton material, but are a tad smaller than the Gerber and the Koala Kid ones from Babies R Us.",
      "rating": 4.0,
      "verified": true,
      "author": "cintia",
      "helpful_votes": 0,
      "publication_date": 20170819
    },
    {
      "title": "Perfect Burp Cloths",
      "text": "This is my second or third time ordering the Spasilk Unisex-Baby Newborn burp cloths. I previously ordered for my use and also as a baby gift. I find them to be exceptionally soft and a perfect size. I also like the wide selection of various colors and patterns.",
      "rating": 5.0,
      "verified": true,
      "author": "BB",
      "helpful_votes": 0,
      "publication_date": 20170818
    },
    {
      "title": "nice but small",
      "text": "they are nice, but somewhat small, thought they were bigger. Overall, will do the job unless the baby decides to spit up more.",
      "rating": 3.0,
      "verified": true,
      "author": "Sweezee",
      "helpful_votes": 0,
      "publication_date": 20161018
    },
    {
      "title": "Soft and absorbent",
      "text": "I really like these burp clothes. They are very soft and absorbent. I wish they were a little bigger/longer, but overall I'm happy with my purchase and would recommend them.",
      "rating": 4.0,
      "verified": true,
      "author": "Kelly",
      "helpful_votes": 0,
      "publication_date": 20160911
    },
    {
      "title": "Awesome!  Entertains baby too!",
      "text": "Incredibly soft! My baby loves looking at the design on the two of these. I highly recommend these. They take a good beating and can handle the spit up/drool. This is a must!",
      "rating": 5.0,
      "verified": true,
      "author": "Libdog",
      "helpful_votes": 0,
      "publication_date": 20160305
    },
    {
      "title": "Five Stars",
      "text": "Love the burp pads. Bought the receiving blanks that match. Would recommend them,",
      "rating": 5.0,
      "verified": true,
      "author": "Marty",
      "helpful_votes": 0,
      "publication_date": 20170406
    },
    {
      "title": "Wonderful",
      "text": "I also bought the blue ones and I love them!!! They're soft and big and my baby loves to rub his face on them. You won't be disappointed with these. I just wish their blankets were just as soft as these. They hold the spit up well and lots of it to.",
      "rating": 5.0,
      "verified": true,
      "author": "ART",
      "helpful_votes": 0,
      "publication_date": 20130926
    },
    {
      "title": "Three Stars",
      "text": "fabric is not that absorbent and shrinks and warps with washing",
      "rating": 3.0,
      "verified": true,
      "author": "Kate V",
      "helpful_votes": 0,
      "publication_date": 20171206
    },
    {
      "title": "which is great since I'm wiping baby's soft little face",
      "text": "Very soft, which is great since I'm wiping baby's soft little face. Cute designs.",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle",
      "helpful_votes": 0,
      "publication_date": 20170410
    },
    {
      "title": "Three Stars",
      "text": "Not as nice as I thought it was going to be.. Could have bought at dollar store/",
      "rating": 3.0,
      "verified": true,
      "author": "dkray",
      "helpful_votes": 0,
      "publication_date": 20160219
    },
    {
      "title": "They are super soft too",
      "text": "They are thin but seem to soak up a lot. They are super soft too. I have tried a bunch of different ones and so far I really like these the best",
      "rating": 5.0,
      "verified": true,
      "author": "Sweet",
      "helpful_votes": 0,
      "publication_date": 20160621
    },
    {
      "title": "great product",
      "text": "These are the best they just get better with every wash. They hold up really well and don't stain easily. They are very soft and a must have. Perfect size. I got the blue ones too to match all my son's outfits.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 0,
      "publication_date": 20140308
    },
    {
      "title": "Very soft and absorbent.. much bigger than the ...",
      "text": "Very soft and absorbent.. much bigger than the usual burp cloth and so covers the shoulder very well while burping the baby. Soft enough to even use as a wash cloth to give sponge bath to the baby. Will definitely buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "T&Y's Mom",
      "helpful_votes": 0,
      "publication_date": 20160603
    },
    {
      "title": "Best available!",
      "text": "Best burp rags available, my daughter has acid reflux and these are the only ones that do no leak through our of several brands we've tried!!",
      "rating": 5.0,
      "verified": true,
      "author": "Katy",
      "helpful_votes": 0,
      "publication_date": 20150523
    }
  ],
  "product_meta": {
    "title": "Spasilk Baby-Boys Newborn 3 Pack 100% Cotton Burp Cloths",
    "description": "Our double layered 100% cotton burp cloth is soft and absorbent for those little accidents, size 12 inch x 17 inch fits perfectly over shoulder or on lap and has multiple uses, keeps baby clean and smiling with our soft burp cloths\n\n\n\n\nPRODUCT DETAILS\n * Product Dimensions :12 x 1 x 17 inches; 5.6 Ounces\n * Manufacturer recommended age :0 - 2 years\n * Item model number :BC 012\n * Department :Baby-boys\n * Date First Available :April 8, 2015\n * Manufacturer :Layette Spasilk\n * ASIN :B00U47JLNG\n\n * Amazon Best Sellers Rank: #10,933 in Baby (See Top 100 in Baby)  *  #44 inBaby Burp Cloths \n   \n   \n\n * Customer Reviews:4.6 out of 5 stars482 ratings Our double layered 100% cotton burp cloth is soft and absorbent for those little accidents, size 12 inch x 17 inch fits perfectly over shoulder or on lap and has multiple uses, keeps baby clean and smiling with our soft burp cloths",
    "rating": 4.6,
    "feature_bullets": [
      "100% Cotton",
      "Imported",
      "Machine Wash",
      "3 burp cloths",
      "Double layered",
      "12 inch x 17 inch",
      "Absorbent and soft",
      "Multiple uses"
    ],
    "specifications": {
      "Product Dimensions": "12 x 1 x 17 inches; 5.6 Ounces",
      "Manufacturer recommended age": "0 - 2 years",
      "Item model number": "BC 012",
      "Department": "Baby-boys",
      "Date First Available": "April 8, 2015",
      "Manufacturer": "Layette Spasilk",
      "ASIN": "B00U47JLNG"
    },
    "categories": [
      "Baby Products",
      "Clothing, Shoes & Jewelry",
      "Burp Cloths",
      "Bibs & Burp Cloths",
      "Feeding"
    ],
    "price": 7.92
  }
}