{
  "website_summaries": [
    {
      "verdict": "A pretty lamp that offers an upscale look.",
      "pros": [
        "Beautiful silver tone and individually hanging crystals",
        "Elegant and unique",
        "It's pretty without satisfying function"
      ],
      "cons": [
        "Material is silver-tone plastic rather than true metal",
        "A few complaints that crystals fall off of lamp easily"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great look!",
      "text": "After reading some reviews about this lamp being plastic I was pleasantly surprised at the quality. First the lamp is has a metal look but it is plastic. However looking at it you would not be able to tell. But what really upscaled the look of this lamp are the crystals. They don't look cheap they have a high gloss beautiful shine that looks real. They are not cheap looking plastic crystals. I love the look. For the price you can't expect metal and real crystals but this is definitely a quality look. I bought it to pair with a high end lamp and they work well together.",
      "rating": 4.0,
      "verified": true,
      "author": "Shopaholick",
      "helpful_votes": 86,
      "publication_date": 20161223
    },
    {
      "title": "Not metal but it would get very hot if it was",
      "text": "It's a very cute little lamp. I tried several different lightbulbs in it and you can get very many different effects with it. The patterns it projects around it with any clear lightbulb are stunning. I just got a color changing LED lightbulb with a string inside of a clear globe with about 30 LEDs that twinkle and fade from color to color. I tried it in my crystal table lamp yesterday and everyone at work was stunned at the ever changing firework display! It was the perfect pairing. Watch the video.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephen Bottorf",
      "helpful_votes": 42,
      "publication_date": 20170422
    },
    {
      "title": "Beautiful lamp!!",
      "text": "This is a beautiful lamp for the money and looks quite expensive. Great quality. Happy with this purchase!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 116,
      "publication_date": 20160109
    },
    {
      "title": "Gorgeous lamps!",
      "text": "If you are questioning whether to buy this lamp or not...do it! I was a bit nervous due to all the reviews about it being plastic and cheap looking, but I went ahead and bet on it. It's not too much money in case they weren't what I wanted anyways. I bought two, one for each side of my bed. And I'm in love with them. Obviously they are plastic! I mean, look at price! But unless you touch them, you'd never know it. Plus everyone saying it came missing a crystal or two...it brings a bag with 3 crystal replacements! I'm glad I bet on these. They are awesome.",
      "rating": 5.0,
      "verified": true,
      "author": "KCmogo",
      "helpful_votes": 94,
      "publication_date": 20160723
    },
    {
      "title": "Love it!",
      "text": "Absolutely stunning! Also you would never know that it's made out of plastic unless you actually touched it.",
      "rating": 5.0,
      "verified": true,
      "author": "Alifa Esmail",
      "helpful_votes": 32,
      "publication_date": 20161007
    },
    {
      "title": "Cute, dainty lamp",
      "text": "Cute lamp, it isn't sturdy metal, but more bendable. I am placing on my antique vanity for extra lighting. Looks pretty and dainty.",
      "rating": 3.0,
      "verified": true,
      "author": "Natalie Rose",
      "helpful_votes": 46,
      "publication_date": 20160417
    },
    {
      "title": "which was easy.",
      "text": "Gorgeous lamps! I painted mine rose gold and I use colored light bulbs. I did remove each crystal before painting, which was easy.",
      "rating": 5.0,
      "verified": true,
      "author": "Kiara",
      "helpful_votes": 10,
      "publication_date": 20171210
    },
    {
      "title": "Surpassed my expectations! Beautiful!",
      "text": "This lamp is absolutely beautiful! Very well made, truly of excellent quality. This lamp definitely met my expectations and then some beyond. It's taller (11\" tall and 4.5\" across) than I had envisioned, but in a great way. Very well packaged, even including extra crystals for possible future replacements. I highly recommend this lamp. Very impressive!",
      "rating": 5.0,
      "verified": true,
      "author": "P. Schlegel",
      "helpful_votes": 4,
      "publication_date": 20170816
    },
    {
      "title": "Cute but doesn’t work. Don’t want to spend the money to ship back.",
      "text": "Doesn’t work without a little jiggle of the electrical cord. The light is cute. Not high quality materials or construction but what I expected for the price. Unfortunately it doesn’t work properly.",
      "rating": 3.0,
      "verified": true,
      "author": "Lori H.",
      "helpful_votes": 2,
      "publication_date": 20190329
    },
    {
      "title": "Looks nice on a table that I just purchased",
      "text": "Looks nice on a table that I just purchased. Yes it's not really glass but plastic. The little beads hang individually on the lamp. Doesn't look cheap at all. However I take away one star because of the title. \"Crystal.\" That's why I make sure to read all the details before buying. Actually.......I just read the technical details and it says material: Crystal..... Hmmm, I will give 2 star rating for misleading title and details. Looks good though.",
      "rating": 2.0,
      "verified": true,
      "author": "Hector Miramontes Jr",
      "helpful_votes": 2,
      "publication_date": 20171227
    },
    {
      "title": "Very stylish looking",
      "text": "Got this as a gift for the wife,and she loves it (as do I) it gives off a nice glow/texture on the wall.I use a dimmable Edison-style bulb,with a dimmer (that you can purchase here on Amazon) to get that perfect lighting effect I want.I wish every light/lamp just came w/ a built in dimmer switch,but glad I did some research,and realized you can plug in a dimmer to just about any lamp (as long as you have the right bulbs).Was a good deal too,for how cool this light looks.Don't hesitate to buy this one!",
      "rating": 5.0,
      "verified": true,
      "author": "Mick Schnabel",
      "helpful_votes": 0,
      "publication_date": 20181207
    },
    {
      "title": "I stare at them a lot...:)",
      "text": "I almost didn't purchase these two lamps based on some of the reviews about them looking cheap, but I am so glad I went with the majority of the reviews and bought them. They are so pretty and look great in my bedroom. Someone would have to actually tap on the lamp to figure out if they are metal or tin. If someone cares that much about what I have as my decoration, that may indicate something is wrong with the friends I chose. I love the light it casts in the bedroom.",
      "rating": 5.0,
      "verified": true,
      "author": "Wendy",
      "helpful_votes": 4,
      "publication_date": 20161223
    },
    {
      "title": "Pretty",
      "text": "I thought the light holder was a solid piece around the light and open at the top, but it's not, these are individual little crystals all hanging off it, so the whole thing is actually open, which makes it much more delicate than I was expecting. It's a beautiful piece though and goes with other decor I have, so I kept it, but do wish it had been a bit less delicate and one solid piece instead.",
      "rating": 4.0,
      "verified": true,
      "author": "TiffanyM",
      "helpful_votes": 0,
      "publication_date": 20191214
    },
    {
      "title": "Really nice lamps!",
      "text": "I was looking for new lamps for my bedroom when I saw these and decided I needed a little bling in my life. They arrived on time and were packed really well. You do have to be careful taking off the wrap on the lamps themselves, otherwise you might have crystals fall off but they are very easy to put back on. I bought two LED Daylight bulbs (they do not come with bulbs) and they provide plenty of light, not to mention plenty of sparkle. I am considering buying a couple more for my guest room!",
      "rating": 5.0,
      "verified": true,
      "author": "Pixilox",
      "helpful_votes": 0,
      "publication_date": 20181107
    },
    {
      "title": "Pretty",
      "text": "It's very pretty, but the quality isn't what I expected. The plastic crystals are hanging on little hooks. When you tilt the lamp, some of the crystals fall off. Also, since you can see the light bulb through all the openings, it's very bright. I see it recently went on sale, I think it's worth the sale price.",
      "rating": 4.0,
      "verified": true,
      "author": "Amanda L. Arthur",
      "helpful_votes": 3,
      "publication_date": 20170120
    },
    {
      "title": "Beautiful little table lamp",
      "text": "This little lamp is quite beautiful and looks gorgeous with the right lightbulb. I am using mine as a decorative ambiance light in a bedroom. With a decorative 25 watt vintage light bulb it looks fantastic. If you choose to use a 40 watt bulb it looks great too and will put off plenty of light in a room. The little crystals all over the lamp cast off a shimmering light that reflect off walls and surfaces, making it very pretty all around the lamp.",
      "rating": 5.0,
      "verified": true,
      "author": "becksem",
      "helpful_votes": 0,
      "publication_date": 20171220
    },
    {
      "title": "So pretty",
      "text": "This a lamp is so pretty. No need to buy the more expensive ones unless you want the dimmer switch or other bells and whistles. This is so pretty and is really nice quality. I love it. The only thing is I lost some crystals since moving and I don't know where to get replacement ones. I can't find anything that looks the same!",
      "rating": 4.0,
      "verified": true,
      "author": "Renee Newton",
      "helpful_votes": 0,
      "publication_date": 20191018
    },
    {
      "title": "How to get warm crystal reflection",
      "text": "Nice little lamp. Wanted mood lighting in my bedroom. Posting pics to help others out with what I had a problem with. I originally had a incandescent 40 w light bulb. Bright enough to read. I wanted a warm light & to get the crystal reflection on the wall. I ordered a 15w (appliance incandescent size). That’s 2nd picture. Warmer light, no reflection. Finally I got a 25w Edison bulb (3rd pic) & got the look I wanted. So, if you want the neat reflection, go with an Edison bulb. If you want enough light to read, go with 40w incandescent. I did not try LED bulbs at all.",
      "rating": 5.0,
      "verified": true,
      "author": "Mom-aholic",
      "helpful_votes": 0,
      "publication_date": 20180418
    },
    {
      "title": "The lamp is gorgeous! Safe packaging. I initially ...",
      "text": "The lamp is gorgeous! Safe packaging. I initially purchased one but after it received it I had to have two of them!",
      "rating": 5.0,
      "verified": true,
      "author": "Shay",
      "helpful_votes": 5,
      "publication_date": 20171101
    },
    {
      "title": "Great light for the price",
      "text": "I bought this light about two years ago. I bought this for my baby's room and I still love it. It looks really nice on or off. What I really like about it is when it is on and you give it a little shake, it makes it look like you are underwater and the light is shining. I painted my daughter's room light blue which worked perfectly with the ocean effect. It is really calming and creates such a pretty light in the room.",
      "rating": 5.0,
      "verified": true,
      "author": "Laura",
      "helpful_votes": 0,
      "publication_date": 20180702
    },
    {
      "title": "Nice from afar...",
      "text": "The housing is plastic that has a chrome finish other than that they are nice for the price I got them for ($15) each. I put in some rgb led lights and set them on side tables around the house. They look really pretty especially with the rgb led lights.",
      "rating": 4.0,
      "verified": true,
      "author": "Ed C",
      "helpful_votes": 0,
      "publication_date": 20200427
    },
    {
      "title": "Appears nice but arrived in shipping box only",
      "text": "Ordered it as gift so I cannot tell you about the quality of using it. But it did look beautiful like many others I had seen. Was disappointed that it arrived only in a shipping box with styrofoam (rather than a product box with styrofoam). So since I didn't have a good gift box I pulled it out and put it in a gift bag - but then it looked like I was giving a used product - oh well - it is a nice product and the thought that counts!",
      "rating": 4.0,
      "verified": true,
      "author": "Chocolate Lover",
      "helpful_votes": 0,
      "publication_date": 20180107
    },
    {
      "title": "Elegant & Lovely",
      "text": "I bought this lamp for my daughter & we all love it. We have it in the kitchen and it adds a large touch of elegance. Beautifully made and lovely to enjoy, especially at night. When the lighting is right it's crystals bestow drops of sparkle on the ceiling. Am considering ordering another. Am extremely satisfied with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "abbyb",
      "helpful_votes": 2,
      "publication_date": 20170506
    },
    {
      "title": "Exquisite Elegance!",
      "text": "As others have said, this really IS an exquisitely beautiful lamp and it does look expensive. It seems as sturdy as anything else and I just love it. In fact I will be purchasing more as gifts because you cannot go wrong with a piece like this! I hope Amazon continues to offer this, it is REAL value for money too. In short, a real winner hands down! Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "Colleen Brit",
      "helpful_votes": 0,
      "publication_date": 20200219
    },
    {
      "title": "Beautiful",
      "text": "This lamp is beautiful. It was packaged well and puts off an amazing light reflection when it's on. I do worry about it's sturdiness, however, I have not had an issue. They even send a few extra jewels should you need them. I would buy this again.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200604
    },
    {
      "title": "Great decorative light",
      "text": "More than happy with this cute lamp. I followed one reviewer’s advice and put in a color changing led light /40 watt equivalent bulb (with remote). This proved to be a hit with everyone, down to grandchildren.The crystals and silver color metal that surrounds, shimmer and provide a nice decorative addition to my living room.",
      "rating": 5.0,
      "verified": true,
      "author": "BostonMA62",
      "helpful_votes": 0,
      "publication_date": 20190312
    },
    {
      "title": "Beautiful lamp",
      "text": "This is a beautiful lamp. I wanted a small lamps to sit on a small table in my upstair hallway. The lamp puts out a lot of lamp when you purchase the suggested light bulb for it. I'm planning to purchase a couple more just because of its beauty.",
      "rating": 5.0,
      "verified": true,
      "author": "BAtristain",
      "helpful_votes": 2,
      "publication_date": 20170709
    },
    {
      "title": "You Get What You Pay For",
      "text": "This lamp arrived yesterday and it is the cheapest looking thing I have ever laid my eyes on. This is not made of metal. This is plastic with spray paint to look like it's metal. I don't understand the people who are saying this is great quality and it looks expensive. It looks like a cheap POS, but a cute POS. When I put it on my bedside table it looks a bit better. Let's see what happens I put the lightbulb in...",
      "rating": 3.0,
      "verified": true,
      "author": "Michelle",
      "helpful_votes": 0,
      "publication_date": 20161130
    },
    {
      "title": "Wow!",
      "text": "Just wow, absolutely stunning. Bigger than I expected. Love how the gems are just hung and can sway. I put a 15 watt white light bulb inside (though the picture looks like an LED brightness) and it's the perfect subtle bed side light. Very pleased with this purchase",
      "rating": 5.0,
      "verified": true,
      "author": "bran hemp",
      "helpful_votes": 0,
      "publication_date": 20200309
    },
    {
      "title": "Check out Target or Lowes instead",
      "text": "Bought two of this item. MISTAKE! Shoddy workmanship, inferior materials, cheap looking, and flimsy. Gee, yeah, I know they weren't a hundred bucks each, but shouldn't they be worth at least what I paid?",
      "rating": 1.0,
      "verified": true,
      "author": "ilookfamous",
      "helpful_votes": 3,
      "publication_date": 20171028
    },
    {
      "title": "I returned it!",
      "text": "Probably it was just ok for the price, but I did not like it and returned it. The chrome part is so thin and low quality!",
      "rating": 3.0,
      "verified": true,
      "author": "A J",
      "helpful_votes": 0,
      "publication_date": 20190315
    },
    {
      "title": "Better than I expected",
      "text": "Lamp is beautiful. Looks perfect in my guest room. Yes it's plastic but for the price I paid I was not expecting top quality. One crystal fell off but I easily hooked it back on. Lamp stationary so I don't foresee the crystals falling. I used 25 watt light bulb.",
      "rating": 5.0,
      "verified": true,
      "author": "YoliS",
      "helpful_votes": 3,
      "publication_date": 20171017
    },
    {
      "title": "Cheap at best",
      "text": "The quality is not at all what I had expected. The metal feels like cheap tin. I knew about the plastic Chrystal's, that was expected. I do like the switch better. I would not purchase this again. I'm going to buy something different and give these to my young granddaughter's​.",
      "rating": 1.0,
      "verified": true,
      "author": "Susan Boothe",
      "helpful_votes": 3,
      "publication_date": 20170812
    },
    {
      "title": "Pretty next to bed at night",
      "text": "Love this purchase and its lighting effects against the wall. Be careful to buy a 25 watt bulb that is perfectly round and low in order to enjoy the effects. A tall bulb does not give the same effects.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Church",
      "helpful_votes": 2,
      "publication_date": 20170821
    },
    {
      "title": "Very pretty bedside lamp!",
      "text": "This is an adorable little table lamp and the LED light changing bulb I got for it make it a great.room light for my bedside or a fabulous night light! All my girlfriends adore it and threaten to steal it! Very pretty",
      "rating": 5.0,
      "verified": true,
      "author": "Deb Russell",
      "helpful_votes": 0,
      "publication_date": 20190510
    },
    {
      "title": "Better Than Expected",
      "text": "Cute lamp! Plastic but a lot heavier and sturdier than I thought it would be. It does tilt a little bit which is why I gave it 4 stars. I don’t feel like sending it back and it doesn’t really bother me so it will stay. Other than that it’s perfect for what I needed and it’s my style. I put a Philips Hue color bulb in it and it’s just beautiful!",
      "rating": 4.0,
      "verified": true,
      "author": "Philly_Nurse",
      "helpful_votes": 0,
      "publication_date": 20180611
    },
    {
      "title": "Good with a low watt, warm bulb",
      "text": "This is truly a beautiful lamp but it is definitely meant to look pretty and not really provide enough light to read by. I have it on a side table in a guest room and it makes a beautiful, decorative piece. Be sure to use a low watt, warm light bulb.",
      "rating": 3.0,
      "verified": true,
      "author": "mlowemom",
      "helpful_votes": 0,
      "publication_date": 20171216
    },
    {
      "title": "Love this lamp 😍",
      "text": "I absolutely love this lamp! It's a great size, the illumination is perfect with a 40 watt soft white bulb, it's not overbearing. I am using a A21Bluetooth speaker bulb to play my music. I was afraid the bulb might be too big, wrong! It fits perfectly!",
      "rating": 5.0,
      "verified": true,
      "author": "NJ2U",
      "helpful_votes": 2,
      "publication_date": 20170814
    },
    {
      "title": "Nice for price, works perfect.",
      "text": "Perfect as a low light fixture in my kitchen. We use it with a color changing bulb for low light at nighttime. Looks nice, better than a plug in night light.",
      "rating": 5.0,
      "verified": true,
      "author": "Teamara",
      "helpful_votes": 0,
      "publication_date": 20191130
    },
    {
      "title": "These lamps are super beautiful!",
      "text": "These lamps are super beautiful!!!! I was looking for a bohemian style for the bedroom and they just look lovely on my nightstands!",
      "rating": 5.0,
      "verified": true,
      "author": "HappyThoughts",
      "helpful_votes": 4,
      "publication_date": 20170131
    },
    {
      "title": "This lamp is beautiful !!! Very bright ! Read below",
      "text": "I bought 2 of these. Put a medium base 40 watt candelabra bulb way to bright ! So I changed to a 25 watt bulb of the same. Is still plenty bright enough !!! All in all love the lamp !",
      "rating": 5.0,
      "verified": true,
      "author": "wendy",
      "helpful_votes": 0,
      "publication_date": 20190526
    },
    {
      "title": "Don't purchase",
      "text": "The lamp is plastic and the plastic pieces fall off. Not worth the buy.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 45,
      "publication_date": 20151203
    },
    {
      "title": "Quality",
      "text": "Oh!!!My gosh I love this lamp finally received after the first one I ordered got lost in transit Love it 😍put in an amber bulb it is amazing the light it gives. Very satisfied with this product will order one more in the near future",
      "rating": 5.0,
      "verified": true,
      "author": "Marie ",
      "helpful_votes": 0,
      "publication_date": 20180926
    },
    {
      "title": "Beautiful",
      "text": "I love this lamp. I use a clear 25W appliance bulb in order to ensure the light casts beautiful designs on surrounding walls in the evening. I use it strictly for atmosphere and it's perfect!",
      "rating": 5.0,
      "verified": true,
      "author": "SDShopper",
      "helpful_votes": 0,
      "publication_date": 20190528
    },
    {
      "title": "Nothing Special",
      "text": "Cheap quality. The lamp material feels as if you were to accidentally drop it the sides would bend in. The crystals are a plastic-like material which i could see turning yellow if you have the lamp near a sunny window. For the inexpensive price it works, but now going to purchase something more expensive.",
      "rating": 3.0,
      "verified": true,
      "author": "H. Gill",
      "helpful_votes": 0,
      "publication_date": 20171019
    },
    {
      "title": "An awesome lamp! Would recommend.",
      "text": "Love this lamp! The lightbulb is not included, so I opted to get an amber bulb as suggested. It's a beautiful addition to my home. It was well-packaged and arrived undamaged. It's classy-looking and emits a nice amount of light without being overpowering. PROS Elegant, beautiful design looks expensive and ornate Very nice amount of light from lamp Well-made CONS None",
      "rating": 5.0,
      "verified": true,
      "author": "Carolette",
      "helpful_votes": 0,
      "publication_date": 20160717
    },
    {
      "title": "Excellent customer service",
      "text": "I am editing my original review. When I contacted the company and told them the lamp I received leaned to one side, they immediately sent a replacement, and I love it! Very cute lamp at a good price.",
      "rating": 5.0,
      "verified": true,
      "author": "Kay Long",
      "helpful_votes": 2,
      "publication_date": 20170412
    },
    {
      "title": "I really love the lamp",
      "text": "Use a 40 watt clear globe light, I really love the lamp!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Ms. Jenkins",
      "helpful_votes": 9,
      "publication_date": 20170514
    },
    {
      "title": "Make sure things work before selling.",
      "text": "I barely open the lamp and tried to connect it and it bk w up on me. It does not work. It is a very pretty lamp but now I can’t use it since it went Into fumes as soon as I tried turning it on.",
      "rating": 1.0,
      "verified": true,
      "author": "daisy",
      "helpful_votes": 3,
      "publication_date": 20180713
    },
    {
      "title": "Beautiful",
      "text": "These are absolutely stunning! I put a small round clear 40w bulb in, and just beautiful. I purchased for my guest bedroom make over and wish I had them in my master!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20170216
    },
    {
      "title": "Ambient lighting for the win",
      "text": "I bought this lamp for ambient lighting on my bookshelves. I really like the look. As other customers have said, it is metallic plastic, but it looks like metal. I will probably get another one or two for the shelf unit. The only downside is I misread the height and thought it would be shorter. So, not as much headroom on the shelf as I thought. Very pretty. I have a color changing led bulb in it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amber",
      "helpful_votes": 0,
      "publication_date": 20180713
    },
    {
      "title": "Beautiful lamp and you can't beat the price!",
      "text": "Agree with everything they say, the lamp is beautiful, comes well packed, make sure you remove the cellophane that is protecting the crystals on the outside. I put in a blue light and it is very nice. Great product and great price!",
      "rating": 5.0,
      "verified": true,
      "author": "Liz D.",
      "helpful_votes": 0,
      "publication_date": 20180423
    },
    {
      "title": "Perfect!",
      "text": "I needed a little something to make a small area in my apartment pop without being too overwhelming and this was the answer. I highly recommend! I plan to get dimmable smart bulbs so I can adjust the lighting, but I'm satisfied with the turnout.",
      "rating": 5.0,
      "verified": true,
      "author": "Tanya",
      "helpful_votes": 0,
      "publication_date": 20181211
    },
    {
      "title": "They're just as good looking as the gold ones I bought",
      "text": "They're just as good looking as the gold ones I bought. The gold version is $50 a piece! So 2 silver for the price of one gold is deal since these are equally nice. Nothing cheap looking at all about them. lol and they're only on the floor because their tables won't be here til tomorrow",
      "rating": 5.0,
      "verified": true,
      "author": "Vito Corleone",
      "helpful_votes": 0,
      "publication_date": 20170820
    },
    {
      "title": "In love with this table lamp",
      "text": "In love with this table lamp, its small but it does light up my room. Packaging was so great, did not come broken at all, was very well protected. Comes with the switch for easy turn on.",
      "rating": 5.0,
      "verified": true,
      "author": "Lu",
      "helpful_votes": 14,
      "publication_date": 20161124
    },
    {
      "title": "Pretty Little Light",
      "text": "For a bedroom entrance light it works great, it's attractive and a little different.",
      "rating": 4.0,
      "verified": true,
      "author": "SherryLee",
      "helpful_votes": 0,
      "publication_date": 20200818
    },
    {
      "title": "Very attractive lamp",
      "text": "Loved the looks of this lamp but it did not fit in the place I wanted to put it.",
      "rating": 5.0,
      "verified": true,
      "author": "blazer",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "Beautiful warm glow.",
      "text": "This lamp is great quality and beautiful. I was worried the crystals would be tacky or cheap looking, but theyre not. Great warm glow lamp.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190426
    },
    {
      "title": "Very Very Pretty",
      "text": "Not high end but looks it. I put a blue light bulb in it and it makes the wall look like a reflective swimming pool. Getting another one.",
      "rating": 5.0,
      "verified": true,
      "author": "Jen K.",
      "helpful_votes": 0,
      "publication_date": 20190316
    },
    {
      "title": "It's pretty",
      "text": "It's pretty, but one of the crystals was missing upon arrival. Luckily, there were 3 extras included in a little bag in the box so I was able to replace it.",
      "rating": 4.0,
      "verified": true,
      "author": "Ef Smith",
      "helpful_votes": 0,
      "publication_date": 20171107
    },
    {
      "title": "Beautiful lamp",
      "text": "The lamp was the perfect size! Fits a regular bulb and puts out plenty of light ! I ordered 2 more and now my friends want them!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190322
    },
    {
      "title": "Gorgeous!",
      "text": "I bought this for my Mom, she just got it today and it is gorgeous!! It actually looks like multifaceted diamonds. It has a beautiful cast from the light. Now the only question is, can we find places to put more of them?",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20180304
    },
    {
      "title": "Beautiful and a bargain.",
      "text": "I was looking for an \"up\" light that was both unusual and affordable and this was both, plus, with the editon of a full spectrum LED buib, it's great for the plants, too. Blends well with my glass and stained glass lamp collection.",
      "rating": 5.0,
      "verified": true,
      "author": "Tove J.",
      "helpful_votes": 0,
      "publication_date": 20191019
    },
    {
      "title": "I love this lamp!",
      "text": "I love this lamp! I ordered 2, 1 for my night stand & 1 for my husband's night stand! They are beautiful. It puts out more light than you would think. It has an easy turn on & off switch on the cord.",
      "rating": 5.0,
      "verified": true,
      "author": "Elrica Tarpley",
      "helpful_votes": 0,
      "publication_date": 20180405
    },
    {
      "title": "Hot mess from shipping",
      "text": "While it looks pretty, it arrived as a hot mess. I’m hoping I’m able to reconstruct it",
      "rating": 3.0,
      "verified": true,
      "author": "CJ",
      "helpful_votes": 0,
      "publication_date": 20200322
    },
    {
      "title": "Super cute",
      "text": "I LOVE this cute lamp. I would not recommend the IKEA light bulb that is in the \"bought with\" suggestion though because it is REALLY eye-hurting bright. The lamp looks better quality than what it costs.",
      "rating": 5.0,
      "verified": true,
      "author": "Selena",
      "helpful_votes": 0,
      "publication_date": 20171223
    },
    {
      "title": "Beautiful Little Lamp!",
      "text": "Lovely, Lovely, Lovely Little Lamp!! I absolutely love this piece. There are tiny little Crystal like pieces that shimmy in the light. It is so nice on my little table next to my \"Reading Chair\".",
      "rating": 4.0,
      "verified": true,
      "author": "Crystal Pringle",
      "helpful_votes": 0,
      "publication_date": 20180418
    },
    {
      "title": "love it",
      "text": "Looks great in person, perfect. I wish it came with a dimmer switch, but still happy over all with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Mercy",
      "helpful_votes": 3,
      "publication_date": 20170411
    },
    {
      "title": "I bought 2 and I love them.",
      "text": "I paid $25/each for 2 lamps. When I first opened the box, it felt kind of cheap but it looked pretty. When I put a bulb in it and turned it on... I FELL IN LOVE!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Cheryl P",
      "helpful_votes": 13,
      "publication_date": 20161015
    },
    {
      "title": "Perfect in the bedroom",
      "text": "Perfect in the bedroom! Leaves a cool shadow on the walls too! Note: it's not metal. A very bendable silver plastic along the sides. The bottom base is sturdy and heavier however.",
      "rating": 4.0,
      "verified": true,
      "author": "Steph",
      "helpful_votes": 0,
      "publication_date": 20180713
    },
    {
      "title": "Very pretty. It's small in size",
      "text": "Very pretty. It's small in size, perfect for a little bedside table light that doesn't take up much space, but is still elegant.",
      "rating": 5.0,
      "verified": true,
      "author": "AD",
      "helpful_votes": 0,
      "publication_date": 20180920
    },
    {
      "title": "Love this",
      "text": "I actually saw this recently used for a center piece, in the dark room, they had 3 of these in the center.",
      "rating": 5.0,
      "verified": true,
      "author": "Candy0823",
      "helpful_votes": 0,
      "publication_date": 20190130
    },
    {
      "title": "Beautiful",
      "text": "Love this lamp I use it on my desk. Just the perfect lighting. I used a candelabra clear bulb for the extra sparkle. The lamp is well made",
      "rating": 5.0,
      "verified": true,
      "author": "Mayra ",
      "helpful_votes": 0,
      "publication_date": 20170706
    },
    {
      "title": "LOVE!! So unique",
      "text": "LOVE!! So unique! I get compliments on it every time someone comes over. I would advise to use a very low wattage lightbulb because it is VERY bright!",
      "rating": 5.0,
      "verified": true,
      "author": "ecoulter",
      "helpful_votes": 0,
      "publication_date": 20170511
    },
    {
      "title": "Love this! yes",
      "text": "My new fave lamp. Love this! yes, it is not robust lead crystal and heavy metal, but the price should reflect that. I put it in my dining room and from afar it looks as nice as the fancy chandelier.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Bacon",
      "helpful_votes": 2,
      "publication_date": 20170119
    },
    {
      "title": "Worth the money",
      "text": "This night light is stylish and for a decent price. Still happy with it. Bought a round one as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert C.",
      "helpful_votes": 0,
      "publication_date": 20171108
    },
    {
      "title": "Self-destructs?",
      "text": "This only worked for about 3 weeks and replacing the bulb did not help. It is beautiful and casts a very bright light throughout the room.",
      "rating": 3.0,
      "verified": true,
      "author": "Scooter Pie",
      "helpful_votes": 0,
      "publication_date": 20180514
    },
    {
      "title": "good.",
      "text": "Pretty, especially form a distance. Up close its a little cheap looking, and the metal is thin. but it's meant to be seen in the dark right? And that;s where it shines..",
      "rating": 4.0,
      "verified": true,
      "author": "Jason",
      "helpful_votes": 0,
      "publication_date": 20180606
    },
    {
      "title": "Awesome for a teens room!",
      "text": "This is awesome for a teens room! The little jewels are super cute! We used a multi colored bulb and she totally loves it!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200228
    },
    {
      "title": "A little disappointed however the lamp delivers good",
      "text": "Picture appears much larger than lamp. A little disappointed however the lamp delivers good lighting",
      "rating": 3.0,
      "verified": true,
      "author": "Dave H",
      "helpful_votes": 0,
      "publication_date": 20170904
    },
    {
      "title": "Yessss",
      "text": "Love this lamp I bought 2 and added some Seinfeld smart lights into them. Worth it!",
      "rating": 5.0,
      "verified": true,
      "author": "Ayce Carne",
      "helpful_votes": 0,
      "publication_date": 20181208
    },
    {
      "title": "Beautiful desk lamp!",
      "text": "Beautiful desk lamp. I have this same design style chandeliers throughout my house, so when I found this lamp I was ecstatic. It's packaged really well, and received it within days of ordering. Very pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "Mimi J",
      "helpful_votes": 0,
      "publication_date": 20180303
    },
    {
      "title": "Five Stars",
      "text": "This lamp is gorgeous, especially with the programmable color changing bulb I bought to put in it.",
      "rating": 5.0,
      "verified": true,
      "author": "Noelle Meade",
      "helpful_votes": 0,
      "publication_date": 20170826
    },
    {
      "title": "Great little lamp for the bathroom",
      "text": "Great little lamp for the bathroom. Only wish cord was either clear or white instead of black. Packaged well, no broken crystals, they even give you several extras !",
      "rating": 5.0,
      "verified": true,
      "author": "Patty Wagon",
      "helpful_votes": 0,
      "publication_date": 20171207
    },
    {
      "title": "cute!",
      "text": "Great little lamp. puts off nice cozy lighting. appropriate for facial/massage rooms",
      "rating": 4.0,
      "verified": true,
      "author": "Bob",
      "helpful_votes": 0,
      "publication_date": 20181103
    },
    {
      "title": "Surpassed expectations!",
      "text": "While the framing is chromed plastic, this lamp is FAR more beautiful than we expected. Simply a great value!",
      "rating": 5.0,
      "verified": true,
      "author": "🌹 🌺",
      "helpful_votes": 0,
      "publication_date": 20180711
    },
    {
      "title": "Plastic? So what? It's gorgeous!",
      "text": "This lamp was perfect for the space we were looking to light up. It's made of questionable materials but the construction is quite solid. Imagine how much it *would* cost had it been constructed of crystal! Definitely not $26.",
      "rating": 5.0,
      "verified": true,
      "author": "Rex Kramer",
      "helpful_votes": 0,
      "publication_date": 20161105
    },
    {
      "title": "Absolutely Beautiful!",
      "text": "So pretty I ordered a second one! It's lightweight, delicate looking. Love the hanging crystals!",
      "rating": 5.0,
      "verified": true,
      "author": "Alabama Catlady",
      "helpful_votes": 0,
      "publication_date": 20170712
    },
    {
      "title": "I love this lamp",
      "text": "I love this lamp! Its so sparkley. Doesnt light up a room--more of an accent lamp. But its so cool.",
      "rating": 5.0,
      "verified": true,
      "author": "Miss Margaret",
      "helpful_votes": 0,
      "publication_date": 20170626
    },
    {
      "title": "Beautiful and sparkly",
      "text": "Beautiful lamp! Wanted something for my dresser top that was more ambient for nighttime use. I love how it almost twinkles and reflects the light off the little stones.",
      "rating": 5.0,
      "verified": true,
      "author": "Crishultz",
      "helpful_votes": 0,
      "publication_date": 20180301
    },
    {
      "title": "I am very happy with my",
      "text": "Has a bit too much of a plastic look . But at least the crystals dont look plasting once the light is turned on. I am very happy with my lamp",
      "rating": 5.0,
      "verified": true,
      "author": "Tyson",
      "helpful_votes": 0,
      "publication_date": 20170821
    },
    {
      "title": "but It looks really pretty. I used a white led light bulb and ...",
      "text": "The lamp is indeed made of plastic, but It looks really pretty. I used a white led light bulb and it is useful for reading. You get what you pay for.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrea GT",
      "helpful_votes": 0,
      "publication_date": 20161110
    },
    {
      "title": "Love them",
      "text": "These lamps are beautiful. Makes a really pretty pattern on the wall when lit.",
      "rating": 5.0,
      "verified": true,
      "author": "Amy",
      "helpful_votes": 0,
      "publication_date": 20190117
    },
    {
      "title": "Beautiful Lamp!!!!",
      "text": "I was pleasantly surprised that the lamp was larger than I expected. It was nicely packed when it was shipped, which I also appreciated. The lamp is beautiful and looks very elegant. Hard to believe it was only $22. I will be ordering another one for my other night stand!",
      "rating": 5.0,
      "verified": true,
      "author": "Andi",
      "helpful_votes": 0,
      "publication_date": 20180430
    },
    {
      "title": "Not what I had expected defects present",
      "text": "Not crystal its plastic, looks inexpensive and has zero ability go diffuse the bulb therefore, even low lunens will blind my eyes at night. Not a recommended purchase.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20160802
    },
    {
      "title": "Four Stars",
      "text": "Pretty and illuminates well, but it doesn't \"Paint the walls with shadows\" like the picture showed.",
      "rating": 4.0,
      "verified": true,
      "author": "sajha eden",
      "helpful_votes": 0,
      "publication_date": 20180523
    },
    {
      "title": "Beautiful lamp especially when on",
      "text": "Beautiful lamp especially when on. This lamp matches the 2 sconces I bought at Lamps Plus that were made of metal and crystals, but more affordable.",
      "rating": 5.0,
      "verified": true,
      "author": "Din",
      "helpful_votes": 0,
      "publication_date": 20180602
    },
    {
      "title": "Xmas gift",
      "text": "This product was purchased for my daughter for Christmas. She was very happy when she unwrapped it and saw the lamp.",
      "rating": 5.0,
      "verified": true,
      "author": "Judy Baggenstoss",
      "helpful_votes": 0,
      "publication_date": 20190109
    },
    {
      "title": "It is plastic, but you would never know that ...",
      "text": "It is plastic, but you would never know that if you did not touch it. It is light weight. It does not come with a light bulb.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristin Strong",
      "helpful_votes": 0,
      "publication_date": 20171110
    },
    {
      "title": "Gorgeous",
      "text": "Omg such a beautiful lamp! Getting another one asap lol",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190811
    }
  ],
  "product_meta": {
    "title": "Crystal Silver Table Lamp",
    "description": "This lamp is in mini style, over 110 pieces of k9 crystal hanging on the shade,when the lamp lit,the crystal shine with the light,it looks charmin and fantastic. This is a switch on the middle of the wire. This lamp will make you feel piece and warm! Type: Table Lamp Features: Crystal Style: Modern Contemporary Wattage: Max 40W Dimensions: dia11cm Bulb Information: Number of Bulbs: 1 Bulb NOT included Base: E27 Material: Crystal Color: Silver Net Weight: 1kg Shipping Wight: 1.2kg Box packing",
    "rating": 4.6,
    "feature_bullets": [
      "Recommend an E26 40 watts bulb,but bulb not included",
      "On/off switch in line,standard American plug",
      "Well packed and fast delivery"
    ],
    "specifications": {
      "Brand": "Surpass Lighting",
      "Manufacturer": "Surpass Lighting",
      "Part Number": "1500033",
      "Item Weight": "1.8 pounds",
      "Product Dimensions": "4.4 x 4.4 x 11 inches",
      "Item model number": "X9009-1500033",
      "Is Discontinued By Manufacturer": "No",
      "Assembled Height": "11 inches",
      "Assembled Length": "4.4 inches",
      "Assembled Width": "4.4 inches",
      "Assembled Diameter": "4.4 inches",
      "Style": "Modern",
      "Color": "Silver",
      "Shape": "Tube",
      "Material": "Crystal",
      "Finish Types": "Chrome",
      "Number of Lights": "1",
      "Voltage": "110 Volts",
      "Special Features": "Chrome shade with crystal, E26/27 bulb base,but not included, Made by real K9 crystla, Traditional and mini style, Has a switch in the middle of the wire",
      "Shade Color": "Silver",
      "Shade Material": "Glass",
      "Light Direction": "Uplight",
      "Power Source": "Corded Electric",
      "Switch Style": "Toggle",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "Type of Bulb": "LED",
      "Wattage": "40 Watts",
      "ASIN": "B00UCM00TW",
      "Customer Reviews": "4.6 out of 5 stars597 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#72,163 in Tools & Home Improvement",
      "Date First Available": "June 15, 2014"
    },
    "categories": [
      "Lighting & Ceiling Fans",
      "Tools & Home Improvement",
      "Lamps & Shades",
      "Table Lamps"
    ],
    "price": 19.98
  }
}