{
  "website_summaries": [
    {
      "verdict": "A compact case with few flaws, owners may struggle a bit to configure components properly during build.",
      "pros": [
        "Cools relatively well, with included 120 millimeter fan that runs fairly quiet",
        "Sturdy mounting brackets"
      ],
      "cons": [
        "Significant pre-planning is required to install components without much trouble",
        "Too few drive mounts for some owners",
        "Carrying handle is small and uncomfortable"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great case for console-killer gaming PC.",
      "text": "Great little case for the money. Lots of mesh for keeping things cool. It will also come out - I removed it to paint it. Fits ATX power supply and big video cards (I put an R9 285 in it). Careful when removing the front panel. The power and reset switch wires in mine were barely attached and broke off with a very light touch. Make sure your PSU is no longer than 150cm. For air cooling your only options will be stock cooler or an extremely low profile aftermarket cooler as the PSU is directly above the CPU.",
      "rating": 4.0,
      "verified": true,
      "author": "It's a me, Mario!",
      "helpful_votes": 31,
      "publication_date": 20150812
    },
    {
      "title": "Great for micro build.",
      "text": "Pros: Great little unit, can't beat the price either. Everything fits and works as it should. Cons: Only downside is it doesn't come with any preinstalled fans. With it being so small It does run on the hot side as idle temps are in the 60c range so a front fan is essential unless you're running a watercooler. I'm running AMD's supplied heat sink, although it fits a water cooler is recommended. There's definitely no room for an aftermarket heat sink. System Specs: AMD Ryzen 3 2200g APU Standard Ryzen heat sink B450 I AORUS PRO WIFI motherboard ASUS ROG STRIX R 570 8GB DDR4 Ballistics 500 watt 80+bronze EVGA 250GB SSD",
      "rating": 5.0,
      "verified": true,
      "author": "Tim R",
      "helpful_votes": 7,
      "publication_date": 20190324
    },
    {
      "title": "Great tiny case... with a couple of caveats...",
      "text": "It's a great tiny case for the money with a couple of caveats.. One of the LEDs came loose out of its tube but wiring was intact so just re-hot-glued it in place. I would recommend a modular SFX sized power supply due to space. 140mm front case fan doesn't fit with 10.5 inch (maximum for case) EVGA gtx-1080 SC card unless you drill new holes (too wide) so easier to go with 120mm fan. Don't put the power supply in until last! Connect the wires from the case to the motherboard before putting in the video card. Plan on using 2.5\" SSDs due to space constraints and heat. Have fun!",
      "rating": 4.0,
      "verified": true,
      "author": "Teresa",
      "helpful_votes": 4,
      "publication_date": 20170315
    },
    {
      "title": "Best Case!",
      "text": "I really LOVE this case! It has been 1 month into its life now and it has been impressive! It fit my small form factor MOBO with easy and even fit my huge EVGA 2080 graphics card no problem. I also have a full ATX power supply in here. The airflow is also super nice in this little case. Overall extremely impressed with this case. The front AUX ports are a little weird and dont quite fit my headset, but the MOBO ports work for me anyway.",
      "rating": 5.0,
      "verified": true,
      "author": "drthrax",
      "helpful_votes": 0,
      "publication_date": 20200711
    },
    {
      "title": "okay for the price",
      "text": "Looks okay. I really wanted something smaller as I do not use any DVD, 3.5\" drive, and only one 2.5\" SSD if any. I had a few ATX power supplies so for that reason I chose this case, using a Ryzen 5 2600, MSI Geforce 710 and an NVMe drive on a Gigabyte Aorus B459 I Pro WIFI. Removing the top cover can be a bit finicky unless you take your time to line to line the two sides and top carefully. The screws seem a bit rough to install sometimes. I like the lighting on the front panel. Plenty of room, but still not a big footprint.",
      "rating": 4.0,
      "verified": true,
      "author": "reviews @%$!",
      "helpful_votes": 0,
      "publication_date": 20200423
    },
    {
      "title": "Very good mini itx case",
      "text": "Easy to work with. I was originally more into console like mini itx cases and after having some I missed the practicality of more cubic pc cases or bare bones. Got this one to fit in a home theater with a 1060 GTX and a Noctua as cpu cooler for a Ryzen 2700 and it's a perfect fit. Components are definitely warmer than in a conventional case, however nothing like other form factors. I also was surprised at the end of the still quite small case it is regarding what you can fit in, definitely pleased with Silverstone cases and this one in particular",
      "rating": 5.0,
      "verified": true,
      "author": "Mederic Mausse",
      "helpful_votes": 0,
      "publication_date": 20190704
    },
    {
      "title": "Great case, just be careful",
      "text": "This is the second SG13 I've owned. This seems to be a revision because the metal plate that holds storage drives is much heavier and sturdier than the last one, and the packaging comes with more screws and accessories. The only complaint I have about this case is the internal cables (power, reset, hard drive LED) are flimsy. On the last case I snapped one by mistake with hardly any pull and nearly did the same on this one. Other than that, if you know how to route your cables and can find a decent single-fan cooler, you'll love this chassis.",
      "rating": 4.0,
      "verified": true,
      "author": "Anthony Carbajal",
      "helpful_votes": 0,
      "publication_date": 20190710
    },
    {
      "title": "Amazingly compact yet accommodating.",
      "text": "This is a remarkably small case given it accepts conventional ATX power supplies and full size two slot video boards. As long as you don’t need an optical drive or other front panel drive bay this is great case for a very compact build with excellent cooling. I like it has the ports on the front rather than the top like many compact cases do. Beware the power switch, however, is on the top front edge if you plan to stack anything on top of it which is a stupid design flaw with everything else on the front. Silverstone loses a star for that.",
      "rating": 4.0,
      "verified": true,
      "author": "EmbeddedFlyer",
      "helpful_votes": 0,
      "publication_date": 20190514
    },
    {
      "title": "Amazing amount of room for the size!",
      "text": "This case has an amazing amount of room for how compact it is. I have a full size ATX power supply, an i3 with a low profile cooler, an RX480 full size GPU and a 120mm fan on the front. The only thing that could make this better would be some sort of option for a slim optical drive, but honestly I don't know where you would put it without increasing the size of the case. I have this in my entertainment center as a media/gaming PC, and it's quiet and stays cool. The only issue I saw was that the bottom panel has some flex to it, but honestly, once it's set up, you won't notice it.",
      "rating": 5.0,
      "verified": true,
      "author": "Joaquin Berrios",
      "helpful_votes": 0,
      "publication_date": 20171022
    },
    {
      "title": "... the black version of this case and it seems like that case is higher quality than the white case",
      "text": "I own the black version of this case and it seems like that case is higher quality than the white case. The metal of the white case seems thinner than the black case. The weight of the components I used is enough to make the case sag towards the front left foot pad. I have the same components in the black case and didn't have any issues with it. Its a nice case for $45, but it would be nicer if it was strong enough to support its weight without sagging.",
      "rating": 3.0,
      "verified": true,
      "author": "MagnumPI",
      "helpful_votes": 2,
      "publication_date": 20180701
    },
    {
      "title": "Very flexible, user friendly itx case!",
      "text": "Fantastic mini itx chassis, fit a full atx 450 watt power supply, a full-sized two slot graphics card and a single-fan AIO (with some careful planning and re-configuring). The pink color really pops and looks fantastic for my girlfriend’s build, plus the front mesh panel is really sleek. Only complaints are that the plastic around the front panel feels a little cheap, there isnt a dedicated restart button and it didn’t ship with a manual. That being said I highly recommend to anyone looking for a sff chassis",
      "rating": 5.0,
      "verified": true,
      "author": "Brady Baldwin",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "Easy and spacious for an ITX build. Fits full sized (non-modular) ATX PSU without difficulty",
      "text": "Easy and spacious for an ITX build. Fits full sized (non-modular) ATX PSU without difficulty... Smaller than a shoebox. See the picture. This was for my wife's computer, I took her old computer apart, took her old ATX non-modular PSU, her SSDs, and her fans, and merged them with a new Ryzen 3600 and an ITX motherboard... and less than an hour later... I had this thing running... I put my size 10 shoe next to it for comparison. You know what they say about a man with small ... computers...",
      "rating": 5.0,
      "verified": true,
      "author": "Jsizzle",
      "helpful_votes": 0,
      "publication_date": 20191116
    },
    {
      "title": "The best budget itx case!",
      "text": "I originally purchased a Thermaltake Core V1 case, but I ended up unhappy with the relatively large size for an ITX computer (great case, but I wanted to go SMALLER) The SG13 is perfect for those who want a small PC, don't have the experience to build in a super tiny enthusiast ITX case (Like the Velka 3), and are looking for something at a reasonable price. I personally fit a 140mm ATX PSU in here (turned downward to act as an exhaust) with a Corsair H60 AIO (Silverstone recommends an AIO for this case, due to the lack of clearance for tall air coolers). Very happy with this case; doubt I will go even smaller!",
      "rating": 5.0,
      "verified": true,
      "author": "Sandra",
      "helpful_votes": 0,
      "publication_date": 20200508
    },
    {
      "title": "Great case, easy to build with. Great customer service",
      "text": "Awesome case. Easy to all your parts in. It's a MINI-ITX case so I planned ahead and bought all mini itx compatible parts. First pc build went perfectly smooth with this tiny case. Got a 140mm exhaust fan. Full size atx power supply and an i7-2600k with noctua NH-l9i to clear the power supply headroom. It idles around 95-105f and maxes out 185f under full load for long periods using only air cooling in a tiny form factor case. I'm really impressed with those numbers. I can game on high settings using my gtx 1050ti on most AAA games and it's super smooth. Their customer service is amazing as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 0,
      "publication_date": 20200413
    },
    {
      "title": "Very good case. I was surprised to get what I ...",
      "text": "Very good case. I was surprised to get what I did in it. I thought it was a very easy build. Please make sure to use the proper screws on the front face plate when you put it back together. I used what I thought were the right ones but got it all together and found out that I had the case screws on it instead of the hard drive screws that should have been used. Easy fix, just giving advise as it will cause the outer shell cover to protrude at the front of the case.",
      "rating": 5.0,
      "verified": true,
      "author": "steeda1974",
      "helpful_votes": 3,
      "publication_date": 20170125
    },
    {
      "title": "Great case, be careful with tear-down and non-modular PSU's",
      "text": "Probably the best case I have ever used. I like to build computers and sell them for cost or close to it since the build is the fun part for me. I built a pretty wicked moderate system with a 6600k and a 950 with a 650W non-modular PSU. Be careful when taking the top brace off since I striped one of the mounting holes the bracket screws into. Not a lot of space for unused cables but it is doable and the inside does't get but maybe 50C and the GPU only got up to 72C",
      "rating": 5.0,
      "verified": true,
      "author": "Justin",
      "helpful_votes": 0,
      "publication_date": 20180614
    },
    {
      "title": "Great case.",
      "text": "CPU: Ryzen 7 3700X Motherboard: ASRock B550M-ITX/AC AM4 Cooler: SilverStone SST-PF120-ARGB Permafrost 120mm RAM: Vengeance LPX 32GB DDR4 3600 PSU: Silverstone 650W SST-SX650-G GPU: EVGA RTX 2070 Super Black 8GB Memory: ADATA XPG SX8200 Pro 1TB & Samsung SSD 860 EVO 2TB 2.5\" Solid case with the perfect amount of space for everything. The AIO cooler keeps the CPU around 60 degrees under load. Some of the heat vents have some cosmetic distortion but do not affect any of the components so it's still good. I use this both as a main rig and as a portable rig for LAN parties. A great buy and definitely recommend it for a no-frills build.",
      "rating": 5.0,
      "verified": true,
      "author": "Joseph Baxter",
      "helpful_votes": 0,
      "publication_date": 20201028
    },
    {
      "title": "Power house in miniture size",
      "text": "I have done many builds and this case has been relatively very easy to work with. Obviously with any mini itx system planning is required, but building with is case has been very straight forward. one thing to note though, there is very little space between the top dual 2.5\" harddrive bracket when a full size PSU is installed so either buy a SFX PSU or a fully modular PSU with real flex cables",
      "rating": 5.0,
      "verified": true,
      "author": "Goryglass",
      "helpful_votes": 0,
      "publication_date": 20200226
    },
    {
      "title": "Great case",
      "text": "As long as you know to use a 120mm liquid cooler, or a super low profile CPU fan, this case is pretty slick. I'm using it for a VR rig with a 1080 ti and it works well. Initially it looked like the card might not fit, but once the front panel was off, the PNY reference cooler fit with just enough space. The card even stays cool while crypto-mining, due to the ample venting on the case.",
      "rating": 5.0,
      "verified": true,
      "author": "Colin",
      "helpful_votes": 0,
      "publication_date": 20190724
    },
    {
      "title": "I love this compact case!!!!",
      "text": "As you can tell from my title this case is amazing. My first gaming PC a hulking tower that makes it a pain to take on the go. I decided I'm going to sell it and wanted to downsize. I came across this case and thought it was perfect for me. It was down to this or an Lz7 3D case, but I didn't feel like spending a bunch of money for just a case. So Silverstone came to the rescue. This gaming case is highly portable and has a nice metal construct. This is really nothing flashy, but I plan on slapping some decals on this sucka to the make it stands out a bit.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris. B",
      "helpful_votes": 0,
      "publication_date": 20190816
    },
    {
      "title": "No Instructions",
      "text": "Some screws needed more than some gentle persuasion to come out. On top of this slight fit and finish detail I didn't have any kind of instructions for the case but that's relatively minor. No SFX bracket included but it can fit a full sized PSU if needed. I would absolutely recommend this case especially for the $60 price tag it can hold its own with some of the $200+ cases. Not the best fit like I said.",
      "rating": 4.0,
      "verified": true,
      "author": "Destiny",
      "helpful_votes": 0,
      "publication_date": 20200421
    },
    {
      "title": "Great Attractive Standard Mini Itx case.",
      "text": "Received promptly in perfect condition from Amazon. I had previously tested all components putting them together on a piece of matting I then followed the directions carefully and had only one user error issue. I did not try as I should of far away from the case inserting the cables into the PSU. I had difficulty making them go all the way in when assembling under very tight conditions. Also The directions did not make it clear that all possible wiring should be done BEFORE installing the PSU. Conclusion: As with an earlier model years ago still going strong this new one looks good, is as solid as a tank, and is totally quiet. Recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Happy Server Buyer",
      "helpful_votes": 0,
      "publication_date": 20170213
    },
    {
      "title": "I've been using this case since 2014, ROG Impact x570",
      "text": "Added ROG Impact x570 to title for searches, if you're using the new x570 asus ROG impact board for this case you have to use an SFX PSU if you're using m.2 drives. The daughter board dimm.2 will interfere with a normal sized power supply, luckily for me I've also used SFX power supplies since 2014 for the shorter cables and smaller chassis. To also note: I've been mounting the SFX PSU in this case without an ATX adapter and I could see some problems with this motherboard and some adapters if they center the SFX PSU in the adapter.",
      "rating": 5.0,
      "verified": true,
      "author": "Aaron Gallagher",
      "helpful_votes": 0,
      "publication_date": 20200424
    },
    {
      "title": "Ok, but.",
      "text": "If you're looking for a small footprint this is good. I will not say great. Build quality is okay, but could be better. Not a lot of room for routing cables. If you do choose this case, get a power supply with removable cables, it will give a lot more room in this tiny case. I also have a Thermatake V1. The V1 case is a little bigger, but cable management is better and it comes with a massive fan. If size is really a consideration, get this case. If you can go a little bigger, get the V1.",
      "rating": 3.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200211
    },
    {
      "title": "Very pleased with this case!",
      "text": "Perfectly sized to hold a full size ATX power supply and full sized video card. Plenty of clearance for the Wraith cooler included with AMD CPUs. Nice and small otherwise. Stylish design. Build went quick and easy with this case. Nothing I can think of negative about it!",
      "rating": 5.0,
      "verified": true,
      "author": "Cliff Shockley",
      "helpful_votes": 0,
      "publication_date": 20200322
    },
    {
      "title": "Perfect size and looks nice",
      "text": "I didn't want to spend that much on a budget built but I'm glad I did. This case is great and fits on shelves and desk cabinet perfect. Fits a full size power supply and good room for graphics card. Cons: No fans included but has mounting holes in front for water cool or one fan. The front only has USB 3.0 so if your board don't have a 3.0 connection you will have two dead USB inputs in front. The top hard drives place is always bent / worped. I have bout 4 units already and all have the same issue. Nothing big deal",
      "rating": 5.0,
      "verified": true,
      "author": "Barrioscriptures",
      "helpful_votes": 0,
      "publication_date": 20161119
    },
    {
      "title": "This is a great little case",
      "text": "This is a great little case. I managed to fit the following... Full sized PSU 1070ti founders edition Cooler master aio with x2 120mm noctua fans Itx board ryzen2700x 3 laptop hds 1 SSD The only mod I had to do was bend the lip of the top hd tray flat to accommodate the PSU. It is a bit flimsy in a few areas and I had to move the back feet further to the edges because I was concerned about the amount of give on the floor of the case. I take this case with me everywhere and it does it's job.",
      "rating": 4.0,
      "verified": true,
      "author": "CJC&SANC",
      "helpful_votes": 0,
      "publication_date": 20180620
    },
    {
      "title": "Cheap build quality",
      "text": "Poor grounding with the case, and the quality of the materials is fairly poor. Within months of owning it, I have lost power to a front USB port. Something to also mention is that my I/O shield also was not compatible with this case, although that could have been my motherboard. From a ASRock AB350",
      "rating": 2.0,
      "verified": true,
      "author": "Anonymous .",
      "helpful_votes": 0,
      "publication_date": 20181115
    },
    {
      "title": "Small but great.",
      "text": "This case is sick, Even for it's size your customizability is endless. The case is so small that it fits right under my monitor stand and looks absolutely beast. Here's all the things I like and dislike. Pros: > Great ventilation > Looks great > smart design > Flexible for advanced builders Cons: > If you aren't liquid cooling then good luck finding a good heatsink. > The right side vent is blocked by the power supply so why is it even there? LOL",
      "rating": 5.0,
      "verified": true,
      "author": "Sean del muerto",
      "helpful_votes": 3,
      "publication_date": 20151125
    },
    {
      "title": "Love this mini itx case",
      "text": "I absolutely love this case over my old raijintek Mentis Plus, I was able to fit a full size rx 580 xfx retro dd in this case!!!! I was able to manage one 2.5 hdd, 3.5 hdd, and a 2.5 ssd. This case is a little longer and narrow than my old case and this allows it to fit better in my backpack.",
      "rating": 5.0,
      "verified": true,
      "author": "JakeZTech",
      "helpful_votes": 0,
      "publication_date": 20200427
    },
    {
      "title": "Logically laid out lunchbox",
      "text": "A logically, well thought out interior. not much in terms of cable management, and you need to be creative when trying to mount hard drives. but you can fit a corsair radiator cooling system, a gtx 980, and pretty much all big components. like I said, it was well thought out and the layout is just right as long as you can figure out the little tricks to squeezing in bigger items without having to modify anything. Only negative thing is be careful when removing front panel. The soder work on wires is terrible and mine snapped right away. I just ghetto rigged an old power switch with thicker cables from my old case and worked just fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Matt Sweeny",
      "helpful_votes": 0,
      "publication_date": 20160106
    },
    {
      "title": "( The rest is cheap metal that bends like crazy. Because of this 1 star for the ...",
      "text": "Front is plastics slowly turning yellowish :( The rest is cheap metal that bends like crazy. Because of this 1 star for the white version. Go for the black, it won't look as cheap as this one.",
      "rating": 1.0,
      "verified": true,
      "author": "Cosnomate",
      "helpful_votes": 3,
      "publication_date": 20170807
    },
    {
      "title": "This case is amazing. It fits an H90 water cooler (with a ...",
      "text": "This case is amazing. It fits an H90 water cooler (with a tad bit of case modification (drill a couple holes), atx power supply, and a FULL length 1070GTX. And the price is so low compared to other cases. The case stays super quiet. Only have one fan for the H90 (upgraded to Noctural 140mm fan) and asrock mini 2011-v3 mb controls the speed to low unless temp spikes on heavy load which is no big deal (rare). Do yourself a favor and get the reduced length power supply by coolermaster or silverstone which makes fitting stuff like the watercooler easier.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160711
    },
    {
      "title": "Quality",
      "text": "One of the smallest micro ITX cases you are going to find. Just make sure to get a low profile CPU cooler, follow the manual build instructions carefully, and route your cables correctly. Built out a perfect little system.",
      "rating": 5.0,
      "verified": true,
      "author": "B.L.",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "Amazing ITX case for new PC downsizers",
      "text": "I love this case. It’s a mini ITX case that is mini, but has some ATX features. Being able to cram a full sized ATX power supply into this case is great, along with two 2.5” hard drives. The construction seems to be all metal, including the mesh at the front. Assembly is pretty straightforward.",
      "rating": 5.0,
      "verified": true,
      "author": "Neil",
      "helpful_votes": 0,
      "publication_date": 20191213
    },
    {
      "title": "Meh",
      "text": "And what do you mean an mini-itx doesn't properly mount an SFX power supply?? And you need to almost exclusively use an AIO/water cooler for the cpu as the your power supply will take up the headroom needed for a decent air cooler. Also you need to remove the front panels so you can slide out your gpu? Sure mine is a beefy Vega64. but still...",
      "rating": 2.0,
      "verified": true,
      "author": "Wiryan Tirtarahardja",
      "helpful_votes": 0,
      "publication_date": 20181102
    },
    {
      "title": "It's small and light.",
      "text": "It is very light, compact, manage to install an EVGA CLC 120mm, in addition to a GTX 1060 3gb EVGA. But you should be careful with the video card, the airflow is not very optimal, I recommend it for HTPC and office, not for a gaming PC.",
      "rating": 5.0,
      "verified": true,
      "author": "Jonathan",
      "helpful_votes": 0,
      "publication_date": 20200228
    },
    {
      "title": "Cheap but well built.",
      "text": "The sg13 is a good looking and well built case, however its $40 price tag means that there are some trade offs. Also I forgot to mention that You can fit a full asus strix 970 in the sg13 if you are willing to do a little cutting.",
      "rating": 4.0,
      "verified": true,
      "author": "justin",
      "helpful_votes": 6,
      "publication_date": 20160416
    },
    {
      "title": "Good case, but hard drive bracket is unusable",
      "text": "Overall it's a very good option for itx builds. I was dissapointed however that you can't really fit the upper hard drive bracket in the case with a graphics card. It pushes down very badly on the pcie power cables for your gpu. Also you can't use the 140mm fan option if you try to put a 3.5 inch hard drive in the bracket.",
      "rating": 3.0,
      "verified": true,
      "author": "Matthew R Amos",
      "helpful_votes": 0,
      "publication_date": 20181127
    },
    {
      "title": "Hare some pics to give a sense of scale",
      "text": "I love this case, that being said it might not be for beginners. I had a blast putting things together and working it all out but that's what I enjoy. As with all small form factor builds don't expect this to be super easy to build in but for a small case it is awesome. I wish it had some magnetic dust covers but I can find those pretty easily. For those who got something to say about me having a 750w psu and a 2060 this is spare parts rig I put together for travelling to a couple friends' places out of state(which I do frequently) so relax haha",
      "rating": 5.0,
      "verified": true,
      "author": "Kyle Roberts",
      "helpful_votes": 0,
      "publication_date": 20191221
    },
    {
      "title": "PERFECT FIT.",
      "text": "So small, so cute. Please be sure to measure when ordering parts for this. It looks bviously requires a micro mobo and a smaller gpu. Not easy to fit everything inside, but it should be expected. I'll update with a full parts list soon.",
      "rating": 5.0,
      "verified": true,
      "author": "Gyn",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "Great little case",
      "text": "I bought 2 of these for my kids gaming PC builds, they work great and i have no complaints. i even ordered a 3rd one so grandma can have the \"same\" computer as the kids",
      "rating": 5.0,
      "verified": true,
      "author": "Richard C.",
      "helpful_votes": 0,
      "publication_date": 20200929
    },
    {
      "title": "Easy access and installation!",
      "text": "This is a tiny box, and looks great on my desk. It was easy to install all the components, I picked Silverstone's SFF power supply, which helps. Also, the materials say it will take either a 140mm or 120mm fan. Both literally fit, but a 140mm fan blocks the 2.5-inch drive bay. Go with the 120mm fan.",
      "rating": 5.0,
      "verified": true,
      "author": "Jon T.",
      "helpful_votes": 0,
      "publication_date": 20200129
    },
    {
      "title": "Awesome little case.",
      "text": "This is a very nice and very versatile case. Build quality rivals $80-100 cases. It's able to fit very long power supplies (like an HX 850), but you will sacrifice the top HDD mounts (either 2x 2.5 or 1x 3.5), and there is only one other 2.5 mount outside of that. It fits a Zalman CNPS8900 Extreme, but just barely. There's maybe 3mm of clearance left over the cooler underneath the PSU. I ended up using a Silverstone SFX power supply that included an adapter bracket, so this wasn't an issue in terms of airflow. Fits a decent range of graphics cards and will accommodate for tall GPU heatsinks.",
      "rating": 5.0,
      "verified": true,
      "author": "Dmitriy Loshakov",
      "helpful_votes": 0,
      "publication_date": 20151210
    },
    {
      "title": "nice case. I got a custom cooler",
      "text": "nice case. I got a custom cooler, one HDD, one SSD, two sticks of RAM, a standard ATX power supply, a graphics card and an inflow fan all into this thing. trust me the space is super tight inside when you put this amount of stuff into the case, but the case took all the components and the computer is functioning fine. the screws which go into the plastic front are able to break the plastic easily and either the screws or the plastic needs to be updated.",
      "rating": 4.0,
      "verified": true,
      "author": "abhijeet",
      "helpful_votes": 0,
      "publication_date": 20160604
    },
    {
      "title": "Perfect HTPC case!",
      "text": "Built an HTPC with a 4th i5 and a 1050ti to hook up to a 4k TV in my room. Streams games from my main PC just fine and pushes 4k video with no excessive noise.",
      "rating": 5.0,
      "verified": true,
      "author": "Luke",
      "helpful_votes": 0,
      "publication_date": 20201011
    },
    {
      "title": "Good case for a mini ITX built",
      "text": "Building a mini ITX for $400. Needed a computer for data analysis. With a 2 core/4 threads processor at 3.5GHz, DDR4 2400 RAM, and a SSD it's quite a build for running engineering applications not requiring too many threads. - MSI B250 Gaming Pro - Crucial Ballistix 2x4GB RAM - Noctua 140mm Case Fan - Pentium G4560 - EVGA 500W PSU - Samsung Evo 250GB - SG13B Case",
      "rating": 4.0,
      "verified": true,
      "author": "AM",
      "helpful_votes": 0,
      "publication_date": 20170508
    },
    {
      "title": "Buy it!",
      "text": "Awesome case. Simple, classy. And it fits in my carry on with a reference 1080Ti",
      "rating": 5.0,
      "verified": true,
      "author": "NDE-Tech",
      "helpful_votes": 2,
      "publication_date": 20180511
    },
    {
      "title": "great case.  won't accommodate included AM4 cooling unit",
      "text": "I love it but you have to buy a separate cooling solution if you want to use the case with a Bluray drive. If you don't want a bluray/DVD drive, it will work with the standard cooling unit. Silverstone is great.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Stout",
      "helpful_votes": 0,
      "publication_date": 20200509
    },
    {
      "title": "Headphone jack stopped functioning",
      "text": "when i get the case, i build my pc then realized sound coming from only the right side and none from the left, i tried to unplug and plug back in and nothing works, i also tried using other headphones, same issue. otherwise would have been a great case to be honest. just sad that i found this out after i finished my build.. not i gotta take apart my newly built pc and look for another one, dont want to take anymore chances for that reason, im going with a different itx case. i am sad.",
      "rating": 2.0,
      "verified": true,
      "author": "Tammy",
      "helpful_votes": 0,
      "publication_date": 20190610
    },
    {
      "title": "Great case!!! The size of a 4 slice toaster!!!",
      "text": "Excellent that I can build a system the size of a 4 slice toaster and still use a full ATX sized power supply!!! Cable management in such a space is not optimal however. But that is to be expected. You can fit a Single core 140mm radiator in this, but it will cramp the length on you video card a little more. I recommend the Zotach Mini series Like the Zotach GTX 1080 or 1080ti",
      "rating": 5.0,
      "verified": true,
      "author": "Joel Haakonson",
      "helpful_votes": 0,
      "publication_date": 20181007
    },
    {
      "title": "Cool case",
      "text": "Case is awesome, it's 50 dollars so do not expect it to be some alien cube, it does it's job perfectly and efficiently. Great cool temps in this case. BUYER BEWARE: If you are installing an ASUS ROG STRIX H470-I motherboard with a pre-installed I/O shield, you may have to do some minor fabrication. Had to pull out the Dremel and grind down a grommet to ensure a perfect fit.",
      "rating": 5.0,
      "verified": true,
      "author": "Jenna Johnson",
      "helpful_votes": 0,
      "publication_date": 20200702
    },
    {
      "title": "Does the job",
      "text": "It's as utilitarian as a computer case can be, but I wanted something small and simple, and so it is. I used it to build a music server, and it's hidden from view.",
      "rating": 4.0,
      "verified": true,
      "author": "GaMo",
      "helpful_votes": 0,
      "publication_date": 20200901
    },
    {
      "title": "good design, quality needs some improvements",
      "text": "Good design, but quality is a bit lacking. Two holes stripped, and one motherboard standoff wasn't welded into place. Not very tough, chinesium pot metal. But, it works fine, everything fits.",
      "rating": 3.0,
      "verified": true,
      "author": "Distortionwarrior",
      "helpful_votes": 2,
      "publication_date": 20170318
    },
    {
      "title": "Overall great",
      "text": "Good build quality, plenty of room. The only problem, and the loss of one star, is that it is notoriously difficult to get the top cover back on properly. I've taken this thing off and on 5 times now trying to get all the little clips to line up so the top cover attaches properly, and every time at least one of the clips fails to get, well, clipped. This leaves parts of the cover non-flush with the rest of the body.",
      "rating": 4.0,
      "verified": true,
      "author": "bfkolle",
      "helpful_votes": 0,
      "publication_date": 20200514
    },
    {
      "title": "Compact and versatile but missing some features",
      "text": "Pros: Visually appealing (Small, black and white, the included LED's make it pop) Fits a lot of things for its size Fairly cheap (although not including the case fan) Cons: No fan included (I got Noctua NF-F12 due to high airflow and pressure necessary in mini-itx builds) No dust-proofing on the white vents of the case (but there is on the front panel) No motherboard speaker included which is good for diagnosing motherboard errors (especially on first startup)",
      "rating": 4.0,
      "verified": true,
      "author": "Marshalynne",
      "helpful_votes": 0,
      "publication_date": 20160519
    },
    {
      "title": "Best mini itx case?",
      "text": "I purchased the quiet model. This case was definely my favorite PC case. For the price of this you cannot find another case which does such an amazing job at managing space while keeping cooling and airflow in mind. With a non-modular PPS, an MSI R9 390 and a simple air cooled CPU cooler (core i5 haswell) I never saw CPU temps over 55c and GPU temps over 70c under full load. This will be my go to case for as long as they make it!",
      "rating": 5.0,
      "verified": true,
      "author": "Joe Mossoczy",
      "helpful_votes": 0,
      "publication_date": 20160526
    },
    {
      "title": "spooky silent",
      "text": "spooky silent, I use WOL (Wake On LAN) to turn it on. I'm never sure WOL worked until I see the BIOS flash screen. I modified the case to mount two 500GB 2.5\" drives in RAID-1 configuration and a 140mm PWM fan. The USB front panel cable plug doesn't match my ASUS P8H61 mother board and I haven't found an adapter that converts 2 x 10 socket into a pair of 5 x 2 pin sockets",
      "rating": 5.0,
      "verified": true,
      "author": "Ancient-Geek",
      "helpful_votes": 0,
      "publication_date": 20170111
    },
    {
      "title": "The Best mini itx smaller case and price",
      "text": "If you Need a true mini itx case This is your option If perfect for build a power Little machine. Avoid bad comments too much builders noobs For 40 usd This case is a winner My build is Gtx 1070 I5 6500 16 gb Asrock h110 mini itx mobo EVGA 550 GOLD MODULAR PSU 2X CORSAIR LE 480GB The most commun problem Whit This case is the psu. You dont Need a 850 Or 750 watts to run a vga stay on 430 Or 550 . You can fin any vga Like the 1070 ref desing Or 970 strx",
      "rating": 5.0,
      "verified": true,
      "author": "CarlosALberto",
      "helpful_votes": 0,
      "publication_date": 20160716
    },
    {
      "title": "Thin metal in a nice small package",
      "text": "This case is nice but the metal is thin and one of the USB ports does not work. It's a nice size for an ITX build.",
      "rating": 4.0,
      "verified": true,
      "author": "SycsFinest",
      "helpful_votes": 0,
      "publication_date": 20191208
    },
    {
      "title": "Great case with a minor drawback",
      "text": "Definitely a solid case well designed and its unique layout really optimizes its compact size. Solid airflow only drawback is it really is designed for a watercooled cpu. Running a air cooler with a higher end cpu like a 3700x I ran into some thermal constraints and ended up having to add a side exhaust fan to help keep thermals in check.",
      "rating": 5.0,
      "verified": true,
      "author": "Sean W. Lynn",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "Great case, the mesh part could be better though.",
      "text": "The black mesh front is a little bit too transparent when you look at it head on. The white bits on the front part of the chassis show through, that part would be better painted black, but overall a great case. Silverstone has always been a trusted brand to me and they make quality cases. Good cable management, good graphics cards options (even though I would prefer the case to not be so deep but I see the benefits)",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180815
    },
    {
      "title": "Dissapointed with Fan Mount Placement",
      "text": "If you use a 140mm fan, it will block you from using the upper drive bay and a full length graphics card. This seems wholly unnecessary, as the fan could be moved 1/2 an inch down and over to accommodate both. I think they did this to center the fan in the front panel, but I'd rather it be slightly off and fit everything. Otherwise this case is excellent if you only use one drive and a shorter GPU.",
      "rating": 4.0,
      "verified": true,
      "author": "T. E. Duffy",
      "helpful_votes": 0,
      "publication_date": 20190921
    },
    {
      "title": "everything installed easily, there is plenty of ventilation due to it's ...",
      "text": "Built a system with Gigabyte Z270N WIFI board, i5 7560K, 16 GB DDR4 3200, ASUS Geforce GTX 1050. With a little planning, everything installed easily, there is plenty of ventilation due to it's design and no temp/throttling issues. And it was 39 dollars. Awesome deal",
      "rating": 5.0,
      "verified": true,
      "author": "James A. Kitts",
      "helpful_votes": 0,
      "publication_date": 20171229
    },
    {
      "title": "Great case! I used to to build a mini ...",
      "text": "Great case! I used to to build a mini travel pc and it worked like a charm. I can fit this bad boy in my backpack and take it almost anywhere. The fact that you can fit a standard atx PSU in it is a plus and it has plenty of room for a solid GPU. My 960 gtx has plenty of room and I can't wait to drop a 1080 gtx in this rig when they come out!",
      "rating": 5.0,
      "verified": true,
      "author": "Kyle W. Sickau",
      "helpful_votes": 0,
      "publication_date": 20160507
    },
    {
      "title": "Excellent. Unbeatable value",
      "text": "Excellent case. Recieved exactly as advertised. Perfect for SFX builds, especially gaming PCs which may require full length GPUs. Outstanding value per dollar spent. The only caveat is while the case does infact support standard ATX PSUs, and I was able to complete a build utilizing one, I would definitely recommend using a SFX PSU instead.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170325
    },
    {
      "title": "Impressive part compatibility for the form factor",
      "text": "Nothing fancy to it just a well designed case that is built good. I fit a 3600x with a NH-L9i and one 140mm Noctua on the front all powered by an atx psu. It runs super quiet and super cool because at idle my gpu fans are off.",
      "rating": 5.0,
      "verified": true,
      "author": "Peter",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "Exactly what i needed",
      "text": "Worked out great for what I needed. I didn't build an entire pc in it. I have a pci expansion, which is a small motherboard with 4 pci slots. Use one of the pci slots for my awesome ASUS Xonar HDAV1.3 Slim 24-bit 192KHz Audio Card with True Blu-ray Audio. My $20 450w power supply fit perfectly too.",
      "rating": 5.0,
      "verified": true,
      "author": "Hairylegs222",
      "helpful_votes": 0,
      "publication_date": 20170522
    },
    {
      "title": "I ended up liking this case",
      "text": "It is small but still holds a standard ATX power supply. Not much room to work in but it worked out fine for me.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Schmidt",
      "helpful_votes": 0,
      "publication_date": 20200827
    },
    {
      "title": "Needs Kensington lock support.",
      "text": "As expected, very cramped to work in, but beautifully compact for being able to hold my 580. Should support SFX power supplies without an adapter, but the option for ATX is nice. Biggest issue is the lack of a slot for a Kensington lock, which is an important feature for mini-ITX cases.",
      "rating": 4.0,
      "verified": true,
      "author": "Scheneighnay",
      "helpful_votes": 0,
      "publication_date": 20180516
    },
    {
      "title": "Maybe To Small...",
      "text": "This case falls short on cable management and overall cooling. The open front model is a must. The side also rattles a bit more than you might expect. Side note: my return has been submitted and the items were mailed over a week ago, still no refund.",
      "rating": 1.0,
      "verified": true,
      "author": "Kaleb",
      "helpful_votes": 0,
      "publication_date": 20200611
    },
    {
      "title": "No problems fitting 1080Ti!",
      "text": "Snug but a everything fit. Used an Nvidia 1080TI. Had to take off the front panel to fit the video card but for so much power in that small of a package it was worth it. Using this rig for a portable Oculus Rift VR PC.",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew B. Drummonds",
      "helpful_votes": 0,
      "publication_date": 20180830
    },
    {
      "title": "Perfect case for a mini server",
      "text": "Pros: Looks great 140mm fan looks great mounted in front easy to build in. Cons: Paint can chip easily Front panel IO should be fixed to the main chassis, not the front face panel. Front dust filter is difficult to get at. front fan mount for 140mm is a bit weird. One corner will have no support",
      "rating": 4.0,
      "verified": true,
      "author": "Dominic",
      "helpful_votes": 0,
      "publication_date": 20191103
    },
    {
      "title": "Great buy!",
      "text": "Great case for a great price! It's a very small case, smaller than Thermaltake's flagship small form factor case, my old one. It works great with a Corsair CM series PSU. There is about an inch of space between the PSU and a stock Intel cooler. If there was anything that I would change about the case, it would be the inclusion of a front fan and make it about 1/2 inch longer.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah Wiel",
      "helpful_votes": 0,
      "publication_date": 20170202
    },
    {
      "title": "Awesome case!",
      "text": "I used it as a case for my classic console emulator and it was perfect! Matches my other black and white console themes",
      "rating": 5.0,
      "verified": true,
      "author": "AlvarezCollected",
      "helpful_votes": 0,
      "publication_date": 20190325
    },
    {
      "title": "great with liquid cooling",
      "text": "Have been using this for almost 2 years. Great little case. Have a 140mm all in one in push/pull, sfx power supply, 1070. Sits in my tv stand with my old game consoles.",
      "rating": 5.0,
      "verified": true,
      "author": "Adam",
      "helpful_votes": 0,
      "publication_date": 20190507
    },
    {
      "title": "very nice small form factor chassis.",
      "text": "This chassis was small, but large enough to fit a full sized GPU (gtx 760). It was a bit of a pain to build in, but that can be overlooked due to the small size, this is inherently bad to build in because of the small size. The size if about 2 ps4's stacked on top of each other so this fits into an entertainment center nicely. the thermals of GPU/CPU are also pretty good (better then was i was expecting). i would recommend this to anyone who wants to build a small form factor PC and has some experience building PC's already.",
      "rating": 5.0,
      "verified": true,
      "author": "Jacob",
      "helpful_votes": 0,
      "publication_date": 20160510
    },
    {
      "title": "Good Case. Minimal Lighting.",
      "text": "I was pleasantly surprised at the blue light bar across the front. I didn't want anything spectacular, just a small black box. My RTX 2070 actually extends from the back of the case to the very front (having to remove the front faceplate to install it). This makes a 'hotspot' at the front bottom left corner of the case. It's the closest corner to you in the photo. Other than that, I have no complaints. It was a great challenge to fit as much as possible in this little beast. It will hold more than you think.",
      "rating": 5.0,
      "verified": true,
      "author": "Dustin",
      "helpful_votes": 0,
      "publication_date": 20190628
    },
    {
      "title": "Awesome tiny little guy",
      "text": "Pros: It's tiny and looks awesome. Ventilation can be quite good if you plan your installation and manage cables. Did I say how tiny it is? Cons: the only thing I disliked is my case already had scuffs on the front panel from shipping.",
      "rating": 5.0,
      "verified": true,
      "author": "D00dleB0b",
      "helpful_votes": 0,
      "publication_date": 20171226
    },
    {
      "title": "Great",
      "text": "Love it but it came to me kinda messed up. It came pre assembled very poorly but because I had to take it apart anyway, it was not a big deal. Once assembled it worked great. Easy buy if u need an itx case that fits full sized gpu. I do recommend going with a shorter gpu and 140mm fan in the front.",
      "rating": 5.0,
      "verified": true,
      "author": "works great!",
      "helpful_votes": 0,
      "publication_date": 20200615
    },
    {
      "title": "best small form avail !!",
      "text": "i really love how this case is made and the thought that went in to it. just be sure what you want to configure will fit.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190514
    },
    {
      "title": "Surprising value, with a small footprint.",
      "text": "first off, if you're worried about the size of this case because of its support for a full size GPU, don't worry about it. this is my first itx build and this thing is TINY. seriously, its about the size of a shoe box and was able to fit an r9 270x vapor-x edition with no problems. it feels solid, looks awesome, and will satisfy anyone looking for a small build that still can support all you want to add in. would recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 0,
      "publication_date": 20170106
    },
    {
      "title": "Great compact Workstation/Gaming/HTPC case!",
      "text": "Great size! Will fit any reference Nvidia card with the 980TI or GTX 1080 look. The Titian line-up and the 770/780TI have the same length. If you're buying a graphics card right now though, make sure it fits and make sure it's a blower do you don't overheat any components! (Not like a Open-Air cooler wont work too.)",
      "rating": 5.0,
      "verified": true,
      "author": "Zukesers",
      "helpful_votes": 0,
      "publication_date": 20160814
    },
    {
      "title": "Sweet looking case.",
      "text": "This case was exactly what I was looking for. The case is high quality but a little crowded. You need to be aware of the order you install things.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190601
    },
    {
      "title": "dope dope dope",
      "text": "make sure to watch some yt videos on this before buying, but its a great case. Highly reccomend",
      "rating": 5.0,
      "verified": true,
      "author": "Jack Reynolds",
      "helpful_votes": 0,
      "publication_date": 20200616
    },
    {
      "title": "Best mini ITX case",
      "text": "Definitely a struggle to build within this small tower. With that said, it will always get harder to manage cables as the tower gets smaller. I was more than satisfied after building my desktop with this. If you want to go small, this is the way to go.",
      "rating": 5.0,
      "verified": true,
      "author": "Gloriouz",
      "helpful_votes": 0,
      "publication_date": 20181205
    },
    {
      "title": "Trash",
      "text": "The metal is bending from the heat of my PC being idle for 3 hours on a new install lmao",
      "rating": 1.0,
      "verified": true,
      "author": "Nathan",
      "helpful_votes": 0,
      "publication_date": 20200531
    },
    {
      "title": "Nice little case",
      "text": "Nice little cube. I had some issues with the power supply but I should have bought an SFX size power supply. I have a fully ATX power supply and non-modular. the wiring is a little tight but I manged it. I should have bought the case with the front grill instead of covered plastic to improve airflow. I am wondering if I can order it separately.",
      "rating": 5.0,
      "verified": true,
      "author": "Ken",
      "helpful_votes": 0,
      "publication_date": 20160318
    },
    {
      "title": "Great case. Don't buy the solid front.",
      "text": "The vented sides aren't enough for a front mounted liquid cooler. I suggest buying the mesh front. Other that the solid front making it hard to cool, this is a great case. It's easy to build with and looks good, also.",
      "rating": 4.0,
      "verified": true,
      "author": "Sebastian Vencill",
      "helpful_votes": 0,
      "publication_date": 20181003
    },
    {
      "title": "POOP!",
      "text": "There was poop on the packaging! Factory must be nasty. Case is okay though.",
      "rating": 2.0,
      "verified": true,
      "author": "Rami Malik",
      "helpful_votes": 0,
      "publication_date": 20200515
    },
    {
      "title": "Best budget mini ITX case",
      "text": "Fits in a backpack, fits any standard graphics card, up to 3 2.5\" drives and a standard power supply... and is cheap. PERFECT.",
      "rating": 5.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 0,
      "publication_date": 20200910
    },
    {
      "title": "Little Giant",
      "text": "Thought this was a great buy. It is very small just as it’s advertised so unless you have a plan do not go into this. I created an amazing computer inside this small at rig. I created an amazing computer inside this small case. You will only have a few inches to work with and if you’re hands are big you’re screwed. The metal is kinda easy to break even when you screw to hard. Still a great buy. Have a 1080ti in this bad boy.",
      "rating": 5.0,
      "verified": true,
      "author": "markecko23",
      "helpful_votes": 0,
      "publication_date": 20181021
    },
    {
      "title": "Screw holes strips too easily",
      "text": "I like this case a lot but my pet peeve about it was how easily the screw holes would strip. The 4 outside screw holes holding the case lid together, one of them strip and now I can’t use the provided screw to secure it. The inside also one of the four screw hole to secure the front panel also strip.",
      "rating": 3.0,
      "verified": true,
      "author": "Doncheeto",
      "helpful_votes": 0,
      "publication_date": 20190423
    },
    {
      "title": "Maybe a dud?",
      "text": "for some reason it could not fit my gpu correctly. I seated everything properly and my gpu couldnt line up in a way for my ports to be exposed",
      "rating": 3.0,
      "verified": true,
      "author": "Phil",
      "helpful_votes": 0,
      "publication_date": 20200316
    },
    {
      "title": "Perfect for a mobile lifestyle",
      "text": "I got this case because I do a lot of traveling for work. Let me say it's perfect. I could have spent $1k on a laptop that had half the power of my pc, but chose to spend just 50. This thing is tiny. I had a thermaltake core v21. This can fit in a backpack or duffel bag with no problem. It can fit anywhere. I can take a fully functional and powerful pc anywhere with me. Its amazing.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer M",
      "helpful_votes": 2,
      "publication_date": 20161231
    },
    {
      "title": "Best case I have ever used",
      "text": "This case fit all my ATX motherboard, full-size graphics card, and single-fan radiator without any modification. Great case, but I recommend using an SFX power supply for more room to run cables.",
      "rating": 5.0,
      "verified": true,
      "author": "RedSquirrel",
      "helpful_votes": 0,
      "publication_date": 20171227
    },
    {
      "title": "Good mITX case for reasonable price",
      "text": "Great case for a mITX build. Instructions were surprisingly helpful, the reccomendations for the order to install the components made it easy to fit everything into this compact case. One star off for the build quality. One of the four motherboard standoffs was bent when i got the case, but it was easy to straighten with a pair of pliers. I would recommend getting a modular psu for this case as it can get cramped inside. The rest of my build below: Intel i3-6100 Cpu Gigabyte H110N Motherboard Msi Geforce Gtx 950 2Gb Gpu Evgae 500B Psu Crucial Ballistix 8Gb Ram 120GB SSD (forget the brand)",
      "rating": 4.0,
      "verified": true,
      "author": "Andrew Piper",
      "helpful_votes": 0,
      "publication_date": 20160627
    },
    {
      "title": "I love it",
      "text": "I used this case for my first gaming PC building. I’m happy with it. Would recommend getting a short PSU so you can use the SSD card bracket holder.",
      "rating": 5.0,
      "verified": true,
      "author": "cappatown",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "Small cube,  plenty of room for itx. Keeps EXTRA cool when paired with fan.",
      "text": "Plenty of room for air to circulate. Paired this with an ASROCK J3455B-ITX and it doesn't even get hot. Feels like an Airconditioner it runs so cool. It does require assembly in a specific order, so plan your build accordingly.",
      "rating": 5.0,
      "verified": true,
      "author": "K Angel",
      "helpful_votes": 0,
      "publication_date": 20170407
    },
    {
      "title": "Amazing Case Amazing Value",
      "text": "Seriously my favorite case. Done many itx builds but this case is perfect balance between usability and price. It fits my evga 1080 ti, and AIO liquid cooling for the cpu. Just make sure to buy a bracket for a small form factor psu for extra room above the cpu.",
      "rating": 5.0,
      "verified": true,
      "author": "Health Informatics",
      "helpful_votes": 0,
      "publication_date": 20191208
    }
  ],
  "product_meta": {
    "title": "Silverstone Computer Case with Mesh Front Panel,Black (SG13B)",
    "description": "Color:SG13B-V1| Style:Version 1After bringing Mini-ITX into mainstream DIY (do it yourself) market in 2009 with the Sugo SG05, Silverstone is looking to define the category again with SG13, a newly evolved design that aims to satisfy every type of computer users. At only 11.5 liters in size, it has suitably small statue for easily integrating into numerous computing environments and will comfortably fit many standard components for general purpose or office builds. For enthusiasts and in keeping with Sugo series' famed tradition, the SG13's ability to fit 10.5\" long expansion card, standard ATX power supply, and all-in-one liquid cooler in 120mm or 140mm size will help produce amazingly small and powerful systems.",
    "rating": 4.6,
    "feature_bullets": [
      "Support standard-length expansion cards (10.5 inches)",
      "Mini-DTX / Mini-ITX motherboard & ATX PSU compatible",
      "Support 120mm or 140mm single fan All-in-One Liquid Cooler",
      "Support 2.5\" and 3.5\" hard drives",
      "Elevated standoff for motherboard back side components"
    ],
    "specifications": {
      "Number of USB 3.0 Ports": "2",
      "Brand": "SilverStone Technology",
      "Series": "CS-SG13B",
      "Item model number": "SG13B",
      "Item Weight": "5.4 pounds",
      "Product Dimensions": "7.13 x 11.22 x 8.74 inches",
      "Item Dimensions  LxWxH": "7.13 x 11.22 x 8.74 inches",
      "Color": "SG13B-V1",
      "Manufacturer": "Silverstone",
      "ASIN": "B00U8IS89E",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "March 2, 2015",
      "Customer Reviews": "4.6 out of 5 stars495 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#993 in Computer Cases"
    },
    "categories": [
      "Computers & Accessories",
      "External Components",
      "Computer Components",
      "Electronics",
      "Computer Cases"
    ],
    "price": ""
  }
}