{
  "website_summaries": [
    {
      "verdict": "You get a lot of tea tree oil for the price, but it comes with some quality concerns that may not be so appealing.",
      "pros": [
        "Comes with a handy squeeze dropper that makes it easy to apply",
        "Therapeutic-grade and pure – contains no additives",
        "Company offers attentive customer service"
      ],
      "cons": [
        "Very strong scent",
        "A few reports of leaking bottles, and some complaints that the product is \"thin\" compared to other brands"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "What in the entire F?!",
      "text": "OMG this was the rankest batch of Tea Tree oil I have ever received in my life. I had just run out of tea tree from the SAME company a day prior to this arriving and they smell nothing alike.",
      "rating": 1.0,
      "verified": true,
      "author": "Minnie The Moochie",
      "helpful_votes": 69,
      "publication_date": 20180323
    },
    {
      "title": "Nail fungus disapearing.",
      "text": "After years of embarrassing nail fungus on my big toe I'm happy to say my toe is 2/3 healed. Just the last 1/8\" of nail is infected and I expect that to grow out in the next month or so. I've been applying the oil 2-3 times a day for the last 2 months. Finally I can go barefoot with out feeling embarrassed.",
      "rating": 5.0,
      "verified": true,
      "author": "S. A. Miller",
      "helpful_votes": 91,
      "publication_date": 20170224
    },
    {
      "title": "Outstanding product",
      "text": "This is the third bottle I purchased and I love it. I use it for the aroma and to help clean the skin when needed. I also have coworkers that go to the gym and find themselves getting ringworm. I give them little samples of this stuff and cleans it right up for the in about a week. Because I have now become the walking pharmacy with the miracle liquid that gets ride of fungus, I’m always buying more. That’s another reason I don’t go to the gym. That and I’m lazy but the product is great. Very strong to don’t get any in your eyes or you will feel it for sure.",
      "rating": 5.0,
      "verified": true,
      "author": "Johnny M",
      "helpful_votes": 18,
      "publication_date": 20180110
    },
    {
      "title": "Something Was Off",
      "text": "I bought 1 bottle of Radha tea tree oil. First, the bottle was packaged in only a plastic bag. There had been leakage and the plastic bag was clinging to the bottle (therefore moisture was on the inside). Second, when I opened the product, the smell was off. I compared it to another bottle of tea tree oil, and there was something in the Radha that made me suspicious of either contamination or spoilage. I returned it to Amazon.",
      "rating": 1.0,
      "verified": true,
      "author": "W. Raper",
      "helpful_votes": 15,
      "publication_date": 20190105
    },
    {
      "title": "Smells different - Has an odor",
      "text": "I had purchased a bottle in 2017 and the smell was that of tea tree oil. However the second bottle I purchased this year smells like a chemical and has peculiar odor. Not sure what changed in the product, the company is the same and I had no issues with my first bottle. I am going to give this another try and purchase it one more time.",
      "rating": 1.0,
      "verified": true,
      "author": "BMD",
      "helpful_votes": 12,
      "publication_date": 20180818
    },
    {
      "title": "It works to remove skin tags!",
      "text": "This actually worked to take off skin tags but the smell is strong! Best to put on at night before going to bed. It removed some very small tags on my neck and a big one is almost gone now after two months of use at just once per day.",
      "rating": 4.0,
      "verified": true,
      "author": "TNEB",
      "helpful_votes": 25,
      "publication_date": 20170418
    },
    {
      "title": "I also sometimes add a few drops to my oil warmers because I love the scent",
      "text": "I got this to help shrink a couple of bumps next to a daith piercing. when I first started using it, I noticed them shrinking the next day and got lazy and forgot to apply the oil and the bumps came back. I’ve been using it once or twice a day for the past week and the bumps are both almost completely gone. I also sometimes add a few drops to my oil warmers because I love the scent. love that it comes with a regular top and the dropper top.",
      "rating": 5.0,
      "verified": true,
      "author": "brenn baker",
      "helpful_votes": 8,
      "publication_date": 20180113
    },
    {
      "title": "INFERIOR TEA TREE OIL!",
      "text": "The smell is off, from other Australian tea tree oils. Doesn’t smell like dessert essence, or some of the other 100% Australian tea oils I've tried. It's weak! Really good tea tree oils has a very powerful smell when you open the bottle. It will almost burn your nose. I had to stick my nose directly in the bottle and its like meh!!! I Can't recommend. Will go back to using some of the more trusted brands when I finish this bottle. You do get a lot in the bottle however. Other brands, the bottles are much smaller, so that tells me this may not be 100% tea tree oil.",
      "rating": 3.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 4,
      "publication_date": 20190311
    },
    {
      "title": "Not REAL TEA TREE OIL!",
      "text": "This tea tree oil is horrible now! I ordered this same brand months ago and loved it, and I just received a totally different oil! It was so bad it made me gag! They definitely changed it and it kinda smells like burnt rubber! I'm so glad Amazon issued a refund!",
      "rating": 1.0,
      "verified": true,
      "author": "Jessica Maldonado",
      "helpful_votes": 11,
      "publication_date": 20180223
    },
    {
      "title": "Good product, packed wrong",
      "text": "The Tea Tree Oil is of high quality. Unfortunately the packaging wasn’t carefully packed: Tea Tree Oil will slowly eat away rubber. (I learned my lesson through the school of hard knocks!) The product comes with an oversized eye dropper, with a rubber bulb. In the product, and I could smell the Tea Tree Oil. Thankfully the rubber bulb was still in tact. The package I received was laying on its side it should have been labeled to keep upright or it wasn’t capped and the eye dropper was separate. Please use this as an educational moment.",
      "rating": 5.0,
      "verified": true,
      "author": "Indydog",
      "helpful_votes": 0,
      "publication_date": 20201009
    },
    {
      "title": "I applied product to affected area and got tired of the smell (strong eucalyptus like smell) and discontinued it before the 6 week period",
      "text": "This oil is highly effective! I applied product to affected area and got tired of the smell (strong eucalyptus like smell) and discontinued it before the 6 week period, little did I know that the product had worked its magic and the skin tag fell of three weeks later. It was also effective for acne.",
      "rating": 5.0,
      "verified": true,
      "author": "Guitarrista",
      "helpful_votes": 8,
      "publication_date": 20170613
    },
    {
      "title": "Great stuff",
      "text": "This oil is fantastic, and with do almost anything. The reason for four stars is that the eye dropper that comes with the oil will not stay screwed onto the bottle. Did I just get a bad one? Maybe.",
      "rating": 4.0,
      "verified": true,
      "author": "Scott M.",
      "helpful_votes": 6,
      "publication_date": 20170501
    },
    {
      "title": "Great for an all-purpose around the house!",
      "text": "I used this for tender back pains and for my daughters warts. After applying one time to my husbands back he noticed relief just hours later. And the warts on my daughters hands started turning white! Also, great for acne. After cleaning my face with my regular cleaner I put a few drops on a cottonball and noticed it got more off! Warning - it has a strong menthol odor when applying to the face keep clear of eyes! Good luck. I hope you find more ways to use this oil too!",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie Warren",
      "helpful_votes": 2,
      "publication_date": 20190425
    },
    {
      "title": "Possibly counterfeit",
      "text": "My first purchase of this oil from Amazon was excellent. Real melaleuca has a pungent smell that is initially off-putting but grows on you with use, and it is a great anti-fungal. The second bottle I received appeared to be in good physical condition, but the odor was diminished, somewhat different, and it appeared to be much less effective. The oil appears to have been either damaged oil or counterfeit. - Changed brands",
      "rating": 2.0,
      "verified": true,
      "author": "Dr. D. Rossbach",
      "helpful_votes": 0,
      "publication_date": 20190702
    },
    {
      "title": "Order at your own risk",
      "text": "Product was open and leaking upon arrival. I had to place it in the trunk of my car because it was so rancid. The smell mimicked gasoline and made my stomach ache. I'm unsure of if it worked for not because I refused to use it and i returned the item. I will never order this brand again.",
      "rating": 1.0,
      "verified": true,
      "author": "Bella Reine",
      "helpful_votes": 3,
      "publication_date": 20190530
    },
    {
      "title": "Impressed a Skeptic",
      "text": "I'm one of those people who don't think much of natural remedies. If a pill or a shot will handle whatever ailment I've got I'll take it. Against my nature, I decided to give this product a shot to clear up severe toenail fungus on both of my big toes. Wow am I impressed! Used in conjunction with a tree tea oil soap in the shower, this stuff began eating away the fungus within 2-3 weeks while leaving the healthy part of the nail alone. After 6 weeks I'm almost completely fungus free. I've been saturating the nail every night and sometimes 2x a day. Best results after filing down infected area and then applying oil. Highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Brooke I. Collins",
      "helpful_votes": 324,
      "publication_date": 20160810
    },
    {
      "title": "It is likely blended with inferior less expensive ingredients to achieve lower price point.",
      "text": "Solution is much thinner and runnier than known brands, i.e. Now Foods, and odor is not one associated with tea tree oil. It is likely blended with inferior less expensive ingredients to achieve lower price point. Now Foods offers the 4 ounces bottle without glass dropper for only three more dollars which is thicker oil and odor more known to be associated with Tea tree oil. Of course, pure tea tree oil applied consistently on skin undiluted over an extended period of time will result in chemical burn known as contact dermatitis - first hand experience aka lesson learned. I applied Radha Tea Tree oil undiluted over a few months without experiencing contact dermatitis.",
      "rating": 1.0,
      "verified": true,
      "author": "Jesus Brito",
      "helpful_votes": 4,
      "publication_date": 20160924
    },
    {
      "title": "Will update with results on keloid on industrial piercing. Strong odor. UPDATED!",
      "text": "Will update as far as results, still too soon to tell, but so far the oil ate through the dropper rubber :/ Also, VERY strong smell. I don't care about it as long as it works, but some people may care more about the smell. 3/2019 UPDATE: It had worked wonders on the keloid I had on my piercing! It healed it and made it go away. I hit my ear much later and the keloids (one on each side of piercing) came back, so used the oil again and it worked like a charm! Love it! Since then I keep a bottle in my house at all times.",
      "rating": 4.0,
      "verified": true,
      "author": "Toobs",
      "helpful_votes": 4,
      "publication_date": 20170404
    },
    {
      "title": "Comes with dropper and drip dispenser as well as cap",
      "text": "I've included two photos so you can see everything that comes with this tea tree oil. I've been using Radha's rose hip oil for months now for scarring and as a facial moisturizer. This tea tree oil comes with: 1. A screw on cap with a prong in the middle. 2. An essential oil drip dispenser (the clear plastic). 3. A glass dropper that at maximum will fill a third full and tends to drip. 4. A blue glass bottle of tea tree oil. It comes well packages in it's own box and SEALED.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200305
    },
    {
      "title": "My 2¢",
      "text": "Very amazed at the broad spectrum of uses with actual effectiveness... Tea tree oil isn't a recent discovery of mankind, nor is it a magical solution to every need. It is however a very real healing potion that's effective on far too many levels to mention. This is of very good quality, potency & freshness. I'm 110% satisfied & will reorder as needed.",
      "rating": 5.0,
      "verified": true,
      "author": "Tommy Lee",
      "helpful_votes": 4,
      "publication_date": 20170415
    },
    {
      "title": "the first time i bought it it was fantastic! i recently repurchased and just opened it because ...",
      "text": "the first time i bought it it was fantastic! i recently repurchased and just opened it because i ran out of my original bottle... they're completely different. the smell is awful and not of tea tree, i still have the old one to compare it to so i know that something is wrong with this one!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 8,
      "publication_date": 20171009
    },
    {
      "title": "Not pure tea tree oil!",
      "text": "This is definitely not 100% pure tea tree oil! This is the second time I’ve purchased this brand of tea tree oil, the first time was from a different seller and this stuff smells nothing like the first bottle I purchased. It has definitely been mixed with something to dilute it. Anyone who uses tea tree oil knows that it has a very stron, distinctive smell and this does not! Bottle is going in the trash and I won’t be purchasing again!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190328
    },
    {
      "title": "Rancid upon arrival! Used to be a great product, but now terrible!!!!",
      "text": "I used to love this product but my latest bottle arrived and I opened it up and ughhh!!! Disgusting! It was horribly rancid. I am so disappointed. This used to be a trustworthy brand, but clearly their product has gone downhill. Buy Eve Hansen - far more reliable and worth the few extra dollars :/",
      "rating": 1.0,
      "verified": true,
      "author": "Amanda R",
      "helpful_votes": 0,
      "publication_date": 20190904
    },
    {
      "title": "I like this oil because it comes with a dropper",
      "text": "I use Young Living Essential Oils for diffusing, topical use, and ingesting. But for my cleaning business, I use cheaper essential oils to make my all-natural cleaning products. I like this oil because it comes with a dropper. You can tell the difference though. It's definitely not a high quality oil and the smell is a really \"off.\" When I combine it with Lemon oil for the same brand, it smells like Pine Sol! Not the all-natural scent I'm going for! But for my cleaning purposes, it works well (as long as I don't combine it with lemon) and makes houses smell pleasant. I would never ingest this oil, use it topically, or diffuse it, though!",
      "rating": 4.0,
      "verified": true,
      "author": "Pearl",
      "helpful_votes": 4,
      "publication_date": 20160305
    },
    {
      "title": "Great Tea Tree Oil - Unbeatable Price",
      "text": "I've purchased a lot of Tea Tree over the years and this is a steal. You will struggle to find this volume of Tea Tree at this price anywhere else - it blows the boutique oil blends out of the water (the high end blend by those aroma therapy companies). I've just finished my first bottle of Tea Tree oil and from everything I can tell - it's a high quality oil. Some cheaper oils leave undesirable residue behind after use, this oil doesn't cause me any of those associated headaches. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Brit Capizzano",
      "helpful_votes": 2,
      "publication_date": 20170213
    },
    {
      "title": "love this brand of tea tree oil",
      "text": "smell is strong (so you know it’s not diluted - all tea tree oil smells) works to fight against zits and we even put it in our shoes to fight smells. we have 3 bottles just around the house. love the dropper. sometimes we have to put that back together if it falls off but it’s worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "Blue",
      "helpful_votes": 2,
      "publication_date": 20171028
    },
    {
      "title": "Best Essential Oil Brand I've Tried To-Date",
      "text": "Let me tell you, I have tried numerous Tea Tree Oil brands and this is by far the best! The potency is great. I use it on my skin and in my essential oil diffuser. I am about to run out and will be buy more from this same company, along with some of their other oils. Good job Radha Beauty!",
      "rating": 5.0,
      "verified": true,
      "author": "Richie",
      "helpful_votes": 2,
      "publication_date": 20180201
    },
    {
      "title": "Many uses",
      "text": "I love this stuff and use it for a variety of things. For example, when I put out the trash bag for pick up, I squirt drops of it on the bag and the crows are not interested in pecking into it. I also used a q-tip to apply it on a sore inside my nose and it promptly went away, even though that sa not to use it directly on sores, etc. I plan to mix a few drops into my dogs' shampoo to discourage fleas.",
      "rating": 5.0,
      "verified": true,
      "author": "WingSpread",
      "helpful_votes": 0,
      "publication_date": 20180618
    },
    {
      "title": "It doesn't smell like tea tree!",
      "text": "I have bought this brand of essential oils once before and I liked the tea tree oil. So I purchased the big bottle thinking it'll be same quality. Big disappointment! It didn't even smell like tea tree! I thought I got scammed and it wasn't the break product. I had to return it.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190330
    },
    {
      "title": "Ive ordered 3 oils from this brand now, and ...",
      "text": "Ive ordered 3 oils from this brand now, and this one was leaking very badly. First time that has happened. Disappointing, as I had ordered other things that now have oil stains and the very distinct smell of tea tree oil all over them. However I'm not totally mad, because this I the first time this has happened. Probably a fluke.",
      "rating": 4.0,
      "verified": true,
      "author": "Hanna K.",
      "helpful_votes": 2,
      "publication_date": 20170831
    },
    {
      "title": "If the smell is a bit off-do not use!!!",
      "text": "My first two bottles were fantastic-I actually really like the smell of tea tree. This bottle, however, smells off-chemically I suppose? I didn’t use until a few days ago, and actually had a breakout, whiteheads popping up wherever I applied the oil. Missed the return window, I’m terribly disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "HK Skincare Junkie",
      "helpful_votes": 2,
      "publication_date": 20200915
    },
    {
      "title": "Top broke apart, have to throw away so much tea tree oil.",
      "text": "The tea tree was fine, until the top completely fell apart. There are plastic pieces in the tea tree oil, so I have to throw it out. I bought this so it would last a long time. Waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "Marisa",
      "helpful_votes": 3,
      "publication_date": 20180903
    },
    {
      "title": "Quality product",
      "text": "This is my favorite tea tree oil as far as quality and price! I've read other reviews about the smell, but what I've received smells better and truer than most tea tree oils. I've bought at least 5 bottles at this point and I'm putting in for another. Tea tree oil is a very strong smell and some people just don't like it but it should not smell like ammonia. It's earthy, minty, and strong is the closest I know how to describe it.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Gray",
      "helpful_votes": 0,
      "publication_date": 20191005
    },
    {
      "title": "Doesn't work on skin tags.",
      "text": "A person suggested this product might work on skin tags in preference to surgical removal. Didn't work. That is all I know. At this point I would have to class it with all the other \"voodoo cures\" that don't deliver!",
      "rating": 1.0,
      "verified": true,
      "author": "William T. Cuzick",
      "helpful_votes": 2,
      "publication_date": 20181127
    },
    {
      "title": "Great Product for Acne",
      "text": "I like to use my product for a few weeks before I review. This is my favorite by far. I was buying a more expensive name brand before and it did not do anything for me. This works! I use this for acne and it works amazing. I wish I would have found this sooner instead of paying an outrageous price for Tea Tree Oil from other companies that somewhat worked. If you have acne, this can be your outlet. Please read about Tea Tree Oil before applying to skin and always dilute. This can be a great addition to your skin care treatment and it is a great price.",
      "rating": 5.0,
      "verified": true,
      "author": "Erin Z",
      "helpful_votes": 4,
      "publication_date": 20160610
    },
    {
      "title": "It also made the acne less painful and after 2 days of not using it",
      "text": "Bought this product for skin tags for a family member- they haven't used it for that purpose yet so I decided to use it on my face to help with acne breakouts. I can honestly say, my sensitive skin didn't react to this at all and the redness was diminished overnight. It also made the acne less painful and after 2 days of not using it, my acne was completely cleared up. It worked fast with no irritation or leaving my skin dry. I cannot wait to see what this will do with skin tags for my family member- I feel they will be pleasantly surprised.",
      "rating": 5.0,
      "verified": true,
      "author": "Cindy",
      "helpful_votes": 0,
      "publication_date": 20160609
    },
    {
      "title": "Inconsistent scent...really really disappointed.",
      "text": "I recently bought a 2nd bottle of this oil after having loved and finished my 1st. It was quite disappointing though as this smelt nothing like the 1st. It made me instantly nauseous!!! It seems as though it was expired or something went completely wrong with the scent. I was really looking forward to the amazing scent...after having read the most recent reviews it seems I wasn't the only one to experience the awful scent. You all should refund clients....if I could return this bottle for free I would...",
      "rating": 1.0,
      "verified": true,
      "author": "laurel chadee",
      "helpful_votes": 5,
      "publication_date": 20170609
    },
    {
      "title": "Not the quality that it used to be.",
      "text": "Bought this product a few years ago and it had worked wonderfully. Not quite sure if the latest one that i bought was part of a bad batch or what. The quality control needs to be upped here as the product itself makes it easy enough to see if its good just by the smell. Please be aware that you may get an inferior product here. I hope they can fix it for their company's sake.",
      "rating": 1.0,
      "verified": true,
      "author": "AmazonShopper",
      "helpful_votes": 0,
      "publication_date": 20191118
    },
    {
      "title": "Look for another brand of tea tree oil",
      "text": "I have purchased this product previously so I felt confident about ordering it again and buying an additional one as a gift. This shipment was a huge disappointment as the oil in the shipped bottle smelled rancid. I have been using tea tree oil for the past 3+ years and used various brands to know that this item was off. I am returning it. Hopefullly my friend to whom I gifted the other bottle did not experience the same issue.",
      "rating": 1.0,
      "verified": true,
      "author": "MelbertN01",
      "helpful_votes": 2,
      "publication_date": 20170907
    },
    {
      "title": "Smells Terrible - Seems Off",
      "text": "I just finished a bottle (different brand) so I ordered a new one...doesn't smell the same at all. In fact it smells completely off! Also has a lingering oily-ness I'm not used to. Wondering if it's not 100% pure afterall.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190624
    },
    {
      "title": "Great product and very satisfied with my results so far",
      "text": "I've never had any infection problems before, but developed a toe fungus recently that caused my toe to swell and be mildly discomforting and the nail to not grow. After hoping it would resolve itself over the course of a couple weeks, I decided to get this after reading about it. I applied the oil all over the nail including around the skin and the swelling has gone down a lot just in a couple days with no more discomfort! Great product and very satisfied with my results so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Laura E.B.",
      "helpful_votes": 2,
      "publication_date": 20160323
    },
    {
      "title": "More like Ammonia than Real Tea Tree Oil - Please discontinue!",
      "text": "It took me smelling an old bottle of REAL tea tree oil to see that this product smells like ammonia. My partner said it smells like old mop water and immediately ammonia came to my mind. It burns more than the tea tree oil I've used. I should've known how most tea tree oil is sold for an average of 12 bucks for ONE ounce but this is sold for the same price for four...This is not the real deal. I'm upset that I was using this for my face and ears to clean for my gauges.",
      "rating": 1.0,
      "verified": true,
      "author": "Evelyn D. Lipsey-White",
      "helpful_votes": 3,
      "publication_date": 20160728
    },
    {
      "title": "Not real tea tree oil",
      "text": "Not real tea tree oil. Something has been added to this product (you can tell from the smell and consistency) and it doesn't have the same effect as 100% tea tree oil. Took me over a year to figure it out.",
      "rating": 1.0,
      "verified": true,
      "author": "AM",
      "helpful_votes": 2,
      "publication_date": 20180826
    },
    {
      "title": "A Million and One Uses",
      "text": "I imagine this stuff has a million and one uses, but I managed to get the worst case of Athlete's foot ever. I made a bath, added a dropper-full of oil (I love that there is an included medicine dropper--it makes dispensing the proper amount of oil easy) and proceeded to soak my feet. There is a slight tingly/coolness associated with soaking with the oil in the bath, but it felt good and refreshing. Helped my feet after the first use. And after a couple uses, my feet were good as new.",
      "rating": 5.0,
      "verified": true,
      "author": "S. H. Wells",
      "helpful_votes": 0,
      "publication_date": 20170428
    },
    {
      "title": "Smells  Horrible!!",
      "text": "OMG it’s smells soooo bad! I’ve never smelt any tea tree oil that smells so horrible 😷!!! Want buy again!",
      "rating": 1.0,
      "verified": true,
      "author": "Queen",
      "helpful_votes": 2,
      "publication_date": 20190103
    },
    {
      "title": "One Star",
      "text": "has a weird smell, also the rubber part of the pipette disintegrated after a while",
      "rating": 1.0,
      "verified": true,
      "author": "Philipp",
      "helpful_votes": 2,
      "publication_date": 20181029
    },
    {
      "title": "Very Potent!🎉",
      "text": "This is very potent! But that's a good thing!! It lasts longer than the oils that are watered down. I love this brands products. I have bought this oil and their peppermint oil twice now. And I plan on buying again. I use this as a lice prevention spray and bug repellent. Great product to have stocked in your cabinet!",
      "rating": 5.0,
      "verified": true,
      "author": "BlessedReviews",
      "helpful_votes": 0,
      "publication_date": 20201023
    },
    {
      "title": "Awesome product",
      "text": "Love this! I had bought it for my forward helix piercing because its been a bit of a pain lately (hypertrophic scarring) and I'd read that this would help tremendously. I've been using it a little less than a week and its helped a lot! The swelling has gone down and it's helped to dry out the bump so that the fluid would come out. Plus I really love the smell in my oil diffuser mixed with lavender oil and it helps to stop bug bite itches - something I found out this weekend by accident. Would recommend and definitely buy again :)",
      "rating": 5.0,
      "verified": true,
      "author": "Isabella",
      "helpful_votes": 0,
      "publication_date": 20160725
    },
    {
      "title": "Repeat buyer",
      "text": "I've purchased this tea tree oil several times now, and it is always consistent in color, scent, and fluidity. I mix it with distilled water to make my own disinfectant, and I've safely used it on many different types of surfaces with no issues.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike Hachey",
      "helpful_votes": 0,
      "publication_date": 20191026
    },
    {
      "title": "Suspicious scent",
      "text": "I’m quite suspicious of this Tea Tree. The scent is not Tea tree oil that I have ever used. I enjoy the fresh clean smell of Tea tree oil but this scent is a turnoff. I will be ordering a different brand. The packaging is nice but the oil is suspect. However, I am enjoying the Lavender oil by Radha.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20180515
    },
    {
      "title": "Had to see it for myself",
      "text": "After suffering from toenail fungus for a long time, I plan on buying open toe shoes next summer for the first time in 30+ years. I used the tea tree oil on my toes every day and after about four weeks and could see new, healthy nails beginning to grow. I stopped using it, to see if the new growth would continue and it has. I expect by summer I will no longer be embarrassed to show off my toes!",
      "rating": 5.0,
      "verified": true,
      "author": "caryan",
      "helpful_votes": 0,
      "publication_date": 20180921
    },
    {
      "title": "Good price",
      "text": "I use tea tree as an insect repellent as well as in my laundry. It smells like good quality tea tree oil and I love the price. I also really like the dark blue glass bottle it comes in as well as the cap and dropper so you can choose. It looks nice enough to leave sitting on my kitchen counter. I will be purchasing this again.",
      "rating": 5.0,
      "verified": true,
      "author": "R.H.",
      "helpful_votes": 0,
      "publication_date": 20180102
    },
    {
      "title": "Good Value",
      "text": "This smells like tea tree oil to me; I'm not sure what others are complaining about. I don't know how good or effective it is since I have only had it for a short time. I put a few drops in my shampoo bottle and the smell was noticeable immediately. I have been dropping the oil directly onto my toenail fungus twice daily, but I won't know if it is doing anything for 6-12 months. If it is the miracle cure, I'll be sure to write a follow-up.",
      "rating": 4.0,
      "verified": true,
      "author": "Eric Borchardt",
      "helpful_votes": 0,
      "publication_date": 20161213
    },
    {
      "title": "You HAVE to BUY IT!",
      "text": "You cannot go wrong when purchasing anything from Radha Beauty and their Tea Tree Oil is unsurpassed. It's very potent, will last you forever and it works very well for skincare, scalp care, facials and aromatherapy just to name a few.",
      "rating": 5.0,
      "verified": true,
      "author": "LadydiamondT",
      "helpful_votes": 0,
      "publication_date": 20190705
    },
    {
      "title": "One of our favorites",
      "text": "We have tried a number of different oils in our diffusers. This one lasts a long time, smells great and causes no issues in a pure defuser or water based one. Although the packaging isn't sexy it works awesome. Great value in essential oils.",
      "rating": 5.0,
      "verified": true,
      "author": "Catara Carrell",
      "helpful_votes": 0,
      "publication_date": 20190603
    },
    {
      "title": "“Burnt rubber” smell...",
      "text": "Not sure why but the scents of the tea tree oils I’ve been getting lately have all basically been “burnt rubber“. Not even just this brand but the last couple of orders I’ve done have all smelled this way. There’s maybe only been one time when the tea tree oil actually smelled like tea tree oil...lately, not so much.",
      "rating": 1.0,
      "verified": true,
      "author": "Stephania",
      "helpful_votes": 0,
      "publication_date": 20200212
    },
    {
      "title": "2 months in. No effect on toenail fungus.",
      "text": "Been using for 2 months 2x daily for toenail fungus and no change whatsoever. It does deserves one star cuz my family is so happy I'm not using it anymore. The stuff does smell pretty bad.",
      "rating": 1.0,
      "verified": true,
      "author": "Ken N",
      "helpful_votes": 4,
      "publication_date": 20161213
    },
    {
      "title": "Plastic/chemical smell",
      "text": "i have been purchasing tea tree oil for quite a long time for this vendor and others. the latest bottle we received has a very strong plastic/chemical smell to it. I've never had this issue in the past with this vendor but it seems something changed recently.",
      "rating": 1.0,
      "verified": true,
      "author": "Henry M.",
      "helpful_votes": 3,
      "publication_date": 20170609
    },
    {
      "title": "I like that it comes with a dropper because it makes ...",
      "text": "Rada tea tree oil works really well. I've used it on bug bites and it practically took it away overnight. No burning sensation. Very mild smell and it's almost watery so the skin absorbs it quickly without having to dilute it. I like that it comes with a dropper because it makes it easier to get on a cotton ball or swab without waste. I've also used it on a skin tag on my neck and it's already gone down quite a bit since the first application. I've used other tea tree oils before and this one is by far the best one I've used so far. You certainly get your money's worth.",
      "rating": 5.0,
      "verified": true,
      "author": "Joyous Joy",
      "helpful_votes": 0,
      "publication_date": 20151230
    },
    {
      "title": "Dropper all but dissolved, letting oil spill.",
      "text": "The oil itself seems fine and works, but the rubber of the dropper dissolved and came apart, so I lost half the bottle in my cabinet when it turned over. I had to use foil to cover the hole in the cap for the dropper. Seems crazy to me the oil would cause the rubber of the dropper to fall apart.",
      "rating": 2.0,
      "verified": true,
      "author": "Christopher Allen",
      "helpful_votes": 0,
      "publication_date": 20180915
    },
    {
      "title": "ABSOLUTELY LOVE LOVE LOVE",
      "text": "Recently found this company, ABSOLUTELY LOVE LOVE LOVE! all of the Radha oils! High quality yet affordable! I also have rosehip and rosemary! The only thing is the Tea tree did spill before it got to my house so half of it was actually gone and I practically fumigated my house just by having the box inside! Anyway... even that couldn't get in the way of my devotion for the products! <3",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171026
    },
    {
      "title": "5 stars",
      "text": "I use this oil a lot, it was recommended & i tried it. Been using this product for 2 years now, just bought my 2nd bottle! I use this oil right after i waxed & i also mix this oil with my toner. Very benificial 🙂",
      "rating": 5.0,
      "verified": true,
      "author": "EJ",
      "helpful_votes": 0,
      "publication_date": 20200307
    },
    {
      "title": "Product works well, just be careful if you have pets",
      "text": "I was using this to topically treat a nail fungus on my toe. Too much running and too much soccer makes me susceptible to nail fungus. This product worked well enough. I applied it twice a day and within a couple of weeks, it improved my condition significantly.However be careful if you have pets. My doggie likes to sleep by my feet and sometimes she does lick my feet. She caught an allergic reaction to the tea tree oil. Needed to take her to the vet but she is fine now. The product works well, just be careful with your pets.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Moran",
      "helpful_votes": 0,
      "publication_date": 20160101
    },
    {
      "title": "STINKY but works to remove skin tags.",
      "text": "This stuff STINKS. It nearly smells like a strong petro oily smell. I am using it to dissolve skin tags and it is working quickly. I can't stand the smell, however. I got small circle bandaids to apply the oil to & try to seal the smell in. I cannot stand to apply it at night due to the really strong odor. It keeps me awake. I use it during the day when I am active and not as bothered by the odor. I use tea tree shampoo and have used tea tree oil before. I have never smelled one this stinky.",
      "rating": 4.0,
      "verified": true,
      "author": "twosweet4",
      "helpful_votes": 0,
      "publication_date": 20160724
    },
    {
      "title": "Tea Tree Oil in name only, this product is not as advertised.",
      "text": "If I could give this item 0 stars I would, It doesn't a deserve a beautiful star. The reason being it smells horrendous. Does not smell like tea tree oil AT ALL. Sadly, I was too busy to return this item and it's outside the window of opportunity for this. I just did a side by side comparison and oh my lord....I wouldn't spray this down the sink to scare away cockroaches (which by the way, is a great way to keep them at bay). Smells like actual vagrant urine. Not Recommended.",
      "rating": 1.0,
      "verified": true,
      "author": "Onna Bugeisha",
      "helpful_votes": 4,
      "publication_date": 20160803
    },
    {
      "title": "The softest tea tree I've ever used-good for sensitive skin",
      "text": "I've used tea tree oil for many years. I honestly swear by it in any healthy home. I had never used this brand before (out of the dozens I have already) and absolutely feel in love with it in my FIRST use. Some tea tree oils can be mixed with other substances, or irritate the skin more than others, but this tea tree oil is very soft and good for even the most sensitive skin. Also, I found it smells much better than most brands... If you are a frequent user such as myself.",
      "rating": 5.0,
      "verified": true,
      "author": "c-bert",
      "helpful_votes": 0,
      "publication_date": 20161217
    },
    {
      "title": "Fantastic!",
      "text": "Love this brand for essential oils! Smells so good and is so relaxing. I especially love the tea tree oil for my skin - any blemish I just dilute equal parts water and tea tree oil and use as a toner.",
      "rating": 5.0,
      "verified": true,
      "author": "Jamie",
      "helpful_votes": 0,
      "publication_date": 20170911
    },
    {
      "title": "Gas smell + tingling",
      "text": "I am going to do middle range - for now. It is my first day but if you can get past the gas smell + tingling on your face you’ll be able to see how it works. I did extensive reviews which noted the strong smell but noting of such. So we’ll have to see how it works.",
      "rating": 3.0,
      "verified": true,
      "author": "Victoriazzzz",
      "helpful_votes": 0,
      "publication_date": 20190205
    },
    {
      "title": "but I smelled like pine sol so I switched to peppermint oil instead",
      "text": "A lot of people complained about the pine sol smell associated with this tea tree oil and I can attest to that. Not sure why that is when it is therapeutic grade tea tree oil. I used it at first as a deodorant, but I smelled like pine sol so I switched to peppermint oil instead. Nonetheless, I will continue to use it as a mouthwash, foot soak and astringent. I'll have to see when I finish the bottle whether or not I will purchase again. This bottle is huge - will probably last a while!",
      "rating": 3.0,
      "verified": true,
      "author": "Mss F",
      "helpful_votes": 2,
      "publication_date": 20160306
    },
    {
      "title": "Great product but one problem",
      "text": "I absolutely love this oil for my hair after a shampoo. It's lightweight and does not weigh my hair down, leaves it nice and shiny (salt & pepper grey). It does have a rather unusual smell. The bottle came in a box with a dropper but some of the oil had leaked out into the box.",
      "rating": 5.0,
      "verified": true,
      "author": "John M",
      "helpful_votes": 0,
      "publication_date": 20190905
    },
    {
      "title": "Do not purchase",
      "text": "I rarely write reviews, but had to take the time for this product. I love & believe in tea tree oil, but this one smells horrible. The scent lingered in our bathroom for days & smelled completely medicinal. I’m going back to my Body Shop tea tree oil.",
      "rating": 1.0,
      "verified": true,
      "author": "SLC",
      "helpful_votes": 0,
      "publication_date": 20201018
    },
    {
      "title": "Cured Several of Our Problems",
      "text": "I have eliminated a growth near my collarbone that was itchy and would not heal. Underneath that was an age spot. All have disappeared. I thought I would have to go to a dermatologist. My husband had growths he called birth marks that encircled his torso. (He has had them the 41 years I've known him.) Lately, they had become raised and dark brown. I was worried they were cancerous. They are almost gone after using the oil a couple of months. My husband's nail fungus is going away. Anecdotal? Well, works for us.",
      "rating": 5.0,
      "verified": true,
      "author": "Ann M.",
      "helpful_votes": 0,
      "publication_date": 20151227
    },
    {
      "title": "Also the scent is like Pine-sol so that was also a turn off",
      "text": "Bought this awhile back so wanted to wait till we used it for a while. Used it to try to remove skin tags. Did not see any changes whatsoever. Also the scent is like Pine-sol so that was also a turn off. No directions or anything included. :(",
      "rating": 1.0,
      "verified": true,
      "author": "Rochelle",
      "helpful_votes": 2,
      "publication_date": 20170607
    },
    {
      "title": "One Star",
      "text": "Not sure if something was wrong, but the product smelled very off. Couldn’t use it. Was almost rotten.",
      "rating": 1.0,
      "verified": true,
      "author": "TheMimbo",
      "helpful_votes": 4,
      "publication_date": 20171028
    },
    {
      "title": "Smells GROSS!!!!!!!",
      "text": "As soon as I took the cap off, I was met with a horrible stench. This tea tree oil was rancid!! I read reviews of people stating they had the same issue, but I thought I’d try to get this one since I’d purchased the smaller bottles before without issue. I am returning and I don’t think I’ll order this brand again!",
      "rating": 1.0,
      "verified": true,
      "author": "Hamilton",
      "helpful_votes": 0,
      "publication_date": 20190902
    },
    {
      "title": "Great Product!",
      "text": "This is a wonderful product. It comes in a large dark blue glass bottle with a regular cap and an optional dropper cap. I use both. It's pure and there are no added ingredients, which is also a plus! I love tea tree oil and I'm happy that I've found this brand on Amazon as I will be repurchasing. I use it for foot baths, acne, rashes, body washes, and many other things. I also appreciate how well this product was packaged. It was wrapped in bubble wrap and double boxed. I would highly recommend purchasing tea tree oil from this company.",
      "rating": 5.0,
      "verified": true,
      "author": "Babycakes",
      "helpful_votes": 0,
      "publication_date": 20160109
    },
    {
      "title": "Everyone needs this in their medicine cabinent.",
      "text": "I've purchased from this seller countless times. Amazing products and this tea tree oil didn't disappoint. Love, love and love it. The fact is that tea tree is a natural healer for so many ailments. You're doing yourself a disservice if you don't purchase this.",
      "rating": 5.0,
      "verified": true,
      "author": "Shell",
      "helpful_votes": 3,
      "publication_date": 20170504
    },
    {
      "title": "I think this is a great product and am amazed at the price",
      "text": "I think this is a great product and am amazed at the price. I have bought Tea Tree Oil in much small sizes for a lot more money. So far I am using it to remove warts I have on the body of my feet and it seems to be working. I don't expect this to be a quick process since I have had these warts for over two years now but I have to say I have seen progress in the eight days I have been using this product. I will most certainly buy again from this company. As far as some reviewers saying it smells like Pine Sol I disagree. It smells like Tea Tree Oil.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathye Epley",
      "helpful_votes": 0,
      "publication_date": 20151104
    },
    {
      "title": "Decent smell, but has yet to work...",
      "text": "I purchased this because I read reviews that it works on skin tags. I have put several applications on patches of tags for a few days and I haven't seen much change. The smell is refreshing, so it is better than some reviews mentioned. I did experience some redness and slight burning with this product. I will continue applying this to the tags a few more days to see if there is improvement. I will update if there is any positive change.",
      "rating": 3.0,
      "verified": true,
      "author": "Heather",
      "helpful_votes": 2,
      "publication_date": 20160608
    },
    {
      "title": "I love the Radha Tea Tree Essential Oil",
      "text": "I love the Radha Tea Tree Essential Oil. It was a great value for the size of the bottle. I was also surprised to see all the uses that there are for Tea tree oil. I use it mixed with Coconut oil for my skin. I also use it as a cleaner. This stuff is awesome. I loved the informational paperwork that came with the oil. The packaging was great. It came in the mail on the day that they said it would be here. I am very pleased and will purchase this again.",
      "rating": 5.0,
      "verified": true,
      "author": "Kimberly Keyes",
      "helpful_votes": 0,
      "publication_date": 20160911
    },
    {
      "title": "Most bang for your buck!",
      "text": "The absolute cheapest tea tree oil we could find on Amazon. Ingredients are 100% tea tree oil. Huge bottle. This should last you a LONG time. We add it to shampoo and have had great results.",
      "rating": 5.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 3,
      "publication_date": 20171018
    },
    {
      "title": "VERY STRONG FRAGRANCE",
      "text": "Having just received this product on September 18th I haven't had it long enough to see any results. I purchased it for the use on skin tags and am trying very hard to stick with it. However, I am having a problem with the very strong fragrance from the Tea Tree Oil. I am sensitive to many fragrances and this one does seem to bother me. I only wished that the other reviewers would have mentioned this. Also I can only use it before bedtime as it can be smelled by other people if I should wear it out. Hopefully it will work for the purpose intended.",
      "rating": 3.0,
      "verified": true,
      "author": "JS.",
      "helpful_votes": 0,
      "publication_date": 20150923
    },
    {
      "title": "Truly amazing!",
      "text": "This is an all around go to oil. I put it in my hair/scalp, on my toes, my underarms (let stand for about 5 mins before jumping into the shower, it's like a natural deodorant) .",
      "rating": 5.0,
      "verified": true,
      "author": "Swtpotato",
      "helpful_votes": 0,
      "publication_date": 20191023
    },
    {
      "title": "Love this tea tree oil- it's healing treatment for skin issues.",
      "text": "This stuff is AMAZING! I have been struggling with infections of post-op wounds and my doctor did not know what to recommend aside from, maybe, some tea tree oil. Combined with Amerigel (oak) treatments, this tea tree oil is doing wonders for my feet- after only one day of using it consistently I can finally say the healing process has begun. I personally LOVE the smell of tea tree, too, and so does my family. I also use it in foaming face wash- it's the best for oily, acne- prone skin. I find the quality of this particular tea tree oil superior to other products.",
      "rating": 5.0,
      "verified": true,
      "author": "T. Elis",
      "helpful_votes": 0,
      "publication_date": 20150831
    },
    {
      "title": "Awesome natural smell!",
      "text": "I LOVE this for my diffuser. I mix some of the tea tree with peppermint for a fresh smell in my classroom. In the winter, I add fir needle to the mix for a great scent to get people in the holiday spirit!",
      "rating": 5.0,
      "verified": true,
      "author": "Damiteyeo",
      "helpful_votes": 0,
      "publication_date": 20171121
    },
    {
      "title": "This stuff is Great!",
      "text": "I have been using Tea Tree Oil for years and from time to time i shop around to find better prices. I have ended up with products that smell like petroleum and then products that feel watered down. This one gives me that cooling effect i enjoy from tea tree oil and it also smells very natural to me. A*",
      "rating": 5.0,
      "verified": true,
      "author": "Christina",
      "helpful_votes": 0,
      "publication_date": 20190823
    },
    {
      "title": "Great for acne!",
      "text": "I use this in my homemade face wash (Castile soap, raw honey, this, and water) and as a spot treatment. My acne, which no commercial product has helped, has gone away in less than two weeks. Now I just have some old marks/scars that are slowly healing. My skin is also less oily, even though I use this oil and rosehip oil as my moisturizer. I also use diluted apple cider vinegar as a toner/astrigent (4:1 ratio). My all natural skin care regimen is cheaper than drug store products and works so much better.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie L.",
      "helpful_votes": 0,
      "publication_date": 20160229
    },
    {
      "title": "This is a Steal",
      "text": "Worked well for a serious case of athletes foot (time consuming but better better than taking antibiotics ), dramatically decreased the size of a skin tag under my eye. The huge 4oz bottles arrives individually boxed and bubble wrapped. Not this one, but the jojoba oil glass dropper immediately separated and fell apart from the rubber and plastic. And their jojoba broke my face out which for me is extremely rare. So I'm not 100% sure on their 100% certified organic statements. All the tops on the glass droppers were a little different from the next. The tea trea oil gets 5 stars. If i could, I would give the company 4.",
      "rating": 5.0,
      "verified": true,
      "author": "Sharon",
      "helpful_votes": 0,
      "publication_date": 20151127
    },
    {
      "title": "Didn't work on my skin tag",
      "text": "I bought this to get rid of a skin tag on my head and it did not work at all. It's possible it's because the hair absorbs the oil, but I'm somewhat bald up top so I don't know for sure. Cons: the smell. It's not a bad smell, but it's strong and not one I (or my wife) cared for. Pros: Company offers a full refund and they honored that after my 6 weeks of using it.",
      "rating": 2.0,
      "verified": true,
      "author": "Timtoast",
      "helpful_votes": 0,
      "publication_date": 20160726
    },
    {
      "title": "Good natural cleaner and deodorizer",
      "text": "If you have never used tea tree oil before you may be caught off guard by the strong odor. I know I was the first time; however, you become accustomed to it fairly quickly, especially if you use less than called for at first. So far I have used it for general purpose cleaning and odor removal. It does a great job at both. Having done my comparison shopping, Radha seems to offer their product at a very fair price. Now if they would add a sheet of suggestions for use and/or come clean my house with it, it would be truly perfect:)",
      "rating": 5.0,
      "verified": true,
      "author": "Beachreader",
      "helpful_votes": 0,
      "publication_date": 20150810
    },
    {
      "title": "Rubber in dropper disintegrated.",
      "text": "This is the first time I’ve ordered from this supplier. It was true essential oil but the rubber in the dropper disintegrated making it useless and some of the rubber got into the oil.",
      "rating": 3.0,
      "verified": true,
      "author": "Bonnie",
      "helpful_votes": 3,
      "publication_date": 20171106
    },
    {
      "title": "Nice stuff!",
      "text": "Product smells wonderful and worked well for my uses. I'm sure it's not perfect pure but it gets the intended job done for good price and seems like nice quality. Love the dropper top it came with, very thoughtful and handy. Stores well in the glass bottle. Was packaged and shipped nicely. Definitely recommend this one!",
      "rating": 5.0,
      "verified": true,
      "author": "kaseyTop Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20170122
    },
    {
      "title": "Trustful",
      "text": "The dropper is broken. I have to find out how to count the drops. Anyway, after this I ordered 2 other oils. I use essential oils since a long time and I Radha seems a good brand to me.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190822
    },
    {
      "title": "Smells wonderful.",
      "text": "Seems to be the real deal. I used to as a topical treatment for my terrible allergic reaction to some bug bites. I applied it to my skin, undiluted with a cotton swab, twice a day. After the second day, I think I was a little sensitive to the undiluted oil, so my skin got a little dry (and peeled a little bit), but that might be more related to my allergic reaction. In any case, I diluted the tea tree oil without any detrimental effects.",
      "rating": 5.0,
      "verified": true,
      "author": "S",
      "helpful_votes": 0,
      "publication_date": 20151018
    },
    {
      "title": "Store in an airtight container!",
      "text": "The moment it arrived on our doorstep you could smell it. It's a great product though. We've been using it on our toenails and it is absolutely helping with the fungus. (Tmi, sorry!) My nail is growing in normally now! Store it in an airtight container because it's very potent, unless you want your whole house to smell like tea tree oil.",
      "rating": 5.0,
      "verified": true,
      "author": "David C.",
      "helpful_votes": 2,
      "publication_date": 20160519
    },
    {
      "title": "Algae and mold",
      "text": "I think the steam they dilute this with is a combination of algae and mold",
      "rating": 1.0,
      "verified": true,
      "author": "Stacy",
      "helpful_votes": 0,
      "publication_date": 20190403
    },
    {
      "title": "Price and quality generally are the best.",
      "text": "Radha has become one of the best quality oils that we've ever bought. We really love how effective and pure all of the oils are, and how attractive the price cost remains.",
      "rating": 5.0,
      "verified": true,
      "author": "Adam H.",
      "helpful_votes": 0,
      "publication_date": 20181116
    },
    {
      "title": "I had a raised flesh colored bump on my forehead ...",
      "text": "I had a raised flesh colored bump on my forehead about 1/16 inch high and 1/8 inch in diameter. I applied a few drops of this product on a Q tip and lightly rubbed the bump once in the morning and once before bed. In two months, the bump was completely gone with no visual or tactile evidence of the bump. I will now start using this on other old age bumps that crop up. My only complaint is that the liquid does leave a smell on your skin for a few hours that reminds me of turpentine.",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy R",
      "helpful_votes": 0,
      "publication_date": 20180501
    },
    {
      "title": "Used with water on skin, very refreshing and great quality",
      "text": "This is my first time using tea tree oil. This bottle was recommended for skin care to mix with water. So far I've used it for a week and have seen great results! It also smells amazing which is a plus.",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole F",
      "helpful_votes": 0,
      "publication_date": 20200719
    },
    {
      "title": "Something way off",
      "text": "Was so disapointed in this. Not sure if it was a bad batch or what, but used it once and won't again. What a waste.",
      "rating": 1.0,
      "verified": true,
      "author": "gracie",
      "helpful_votes": 2,
      "publication_date": 20200203
    }
  ],
  "product_meta": {
    "title": "Radha Beauty Tea Tree Essential Oil 4 oz. - 100% Pure & Natural Premium Melaleuca Therapeutic Grade - Great with Soaps, Shampoo, Body Wash, Aromatherapy - Antifungal Treatment for Acne, Lice, & Nails",
    "description": "Our 4 oz Tea Tree Oil is a powerful essential oil made from the leaves of the native Australian coastal trees. It has a fresh, pungent camphor aroma along with potent antiseptic and purifying properties. This oil is beneficial for minor cuts, wounds and blemish-prone skin. When used in Aromatherapy, it stimulates and naturally supports the immune system. It is an excellent natural alternative that reduces the appearance of blemishes and other problematic skin conditions. Just a little amount goes a long way!",
    "rating": 4.3,
    "feature_bullets": [
      "Large 4 oz bottle",
      "Packaged with dropper for ease of use",
      "Ideal for blemish-prone skin, Skin tags, and household freshness",
      "Uses: aromatherapy, Massage and body oils, diffusers, blends, spa and home care"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "1 x 1 x 1 inches; 9.59 Ounces",
      "Item model number": "B00VKHKH8C",
      "Date First Available": "April 2, 2015",
      "Manufacturer": "Barg Engine",
      "ASIN": "B00VKHKH8C",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Oils",
      "Moisturizers",
      "Skin Care",
      "Body",
      "Beauty & Personal Care",
      "Health, Household & Baby Care"
    ],
    "price": 15.95
  }
}