{
  "website_summaries": [
    {
      "verdict": "The fine-tip markers are a quality choice for the creative wine drinker looking to do more than write their name.",
      "pros": [
        "Markers are available in a pack of 4 or 7",
        "Ink dries quickly and is smudge-resistant",
        "Glasses can be cleaned effortlessly with a damp cloth, even if they have sat and dried for a few days",
        "The fine tip allows for neat lettering and detailed designs"
      ],
      "cons": [
        "Red marker is more of a light-pink color so may not stand out on a glass of rosé"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great for a party, easy to clean",
      "text": "This is the perfect final touch to any party! When throwing an engagement party, I bought these so that our guests wouldn't spend the time wondering which glass belonged to whom. Whether it be wine glasses, beer glasses, or just water, this is a great final touch to any party. I recommend waiting a few minutes before picking up the glass where you wrote on it just to let it dry, but overall, the writing came off the in the dishwasher which was an added bonus. I read a few reviews that said you'd have to take it off manually, but the dishwasher did just fine!",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 3,
      "publication_date": 20190317
    },
    {
      "title": "Great product, easy to clean up.",
      "text": "These were excellent. We used them for Thanksgiving and everyone loved drawing on their wine glasses. The marker doesn't come off while using the glass, but once under water it comes off very easily. If you wash it off quickly, the water alone will take it off. If you wait hours or until the next day, you may have to give it a gentle rub for it to come off. Definitely no scrubbing needed though. Highly recommend these markers.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael P. Utke",
      "helpful_votes": 7,
      "publication_date": 20170411
    },
    {
      "title": "Love these!",
      "text": "Bought these to write on mason jars and they're great! The colors are as expected and the ink stays on. If you touch them while your hands are wet or scrub at them with a wet towel, the ink comes off. But, other than that, it stays on pretty well! I write with them on mirrors and put names on wine glasses at parties. Everyone loves them. The only thing that you have to watch for is that some colors work better on some things than others (i.e. Gold won't show up if you write on a jar full of white rice or a glass of white wine, it it's great on a jar of black beans or red wine).",
      "rating": 5.0,
      "verified": true,
      "author": "Ainslie Schroeder",
      "helpful_votes": 5,
      "publication_date": 20170911
    },
    {
      "title": "They work great.",
      "text": "These markers make an opaque even writing on the glass. They look great. I use them for White wine and write above the pour line with out any smearing. Definitely recommend these. In fact, they will be my new add on gift when I bring a bottle of wine to a party. I should mention that I was skeptical because I have not been very happy with chalk markers (which I find almost impossible to write with legibly) but these markers are quite the opposite. Very clean and smooth to write with.",
      "rating": 5.0,
      "verified": true,
      "author": "MG",
      "helpful_votes": 10,
      "publication_date": 20150805
    },
    {
      "title": "These markers were great! I used them for a bridal shower and ...",
      "text": "These markers were great! I used them for a bridal shower and they were perfect. They did not smudge, but still washed off easily with dish water. The colors are very vivid and opaque. I liked them so much I gifted a set to my mom and will take my set to the winery where i work for events. I thought they were great value too, especially since they come in such a nice little container for keeping them in. You could easily just keep the container in your cupboard with your wine glasses. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Wednesday Vail",
      "helpful_votes": 3,
      "publication_date": 20170908
    },
    {
      "title": "Nice deviation from wine glass charms.",
      "text": "These are a lot of fun - great change from the charms. We leave them out and find that people like to draw and design all over their wine glass. However, the silver pen doesn't seem to want to wash off. You have to scrub and scrub with a scrubby of some sort to get the silver pen off. The others wash off just fine.",
      "rating": 4.0,
      "verified": true,
      "author": "Patti K",
      "helpful_votes": 5,
      "publication_date": 20170109
    },
    {
      "title": "Perfect wine charm!",
      "text": "We LOVE these!! We have all different types of glasses (wine, cordial, stemless...etc) so these are the perfect “wine charm” that works for every type of glass. I’ve gotten so many compliments on “what a great idea” this is. Marker washes off instantly and doesn’t damage glass at all. Gold is a little harder to see but the red is fantastic. I still like the gold too though because it’s not like an obnoxious name tag on your drinking glass.",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle H.",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Grool",
      "text": "LOVE the concept but not all glasses were treated equally. Stem glasses worked well, it worked well with red wine, the condensation made it a bit hard to stay on with white wine but, overall it was awesome to have, my guest loved being able to write whatever they wanted, even if they chose to be someone else for the night! In the end when you’re drunk you start drinking from anything anyways, enjoy!",
      "rating": 4.0,
      "verified": true,
      "author": "Caitveg",
      "helpful_votes": 0,
      "publication_date": 20190705
    },
    {
      "title": "Cool pens. I used them for my sisters wine ...",
      "text": "Cool pens. I used them for my sisters wine and cheese birthday and not only do they write on glasses but I used them to write on the clear plastic drink cups as well and they were perfect. Less waste and confusion. The guests also had a great time designing their glasses.",
      "rating": 5.0,
      "verified": true,
      "author": "Vanessa Elyse Benitez",
      "helpful_votes": 11,
      "publication_date": 20151106
    },
    {
      "title": "Just like all the others!",
      "text": "All wine glass markers wash off or run off the glass /smear as the glass gets condensation I have never found one that doesn’t and this is the same. It is easy to wash off the glass, but really there is no good way to make it stay put unless you are drinking a room temp red wine and allow a few moments for the ink to dry. I personally love red, but my guests never do 😢. I’ll keep trying to use but not a perfect solution.",
      "rating": 3.0,
      "verified": true,
      "author": "Ryan Boen",
      "helpful_votes": 0,
      "publication_date": 20190804
    },
    {
      "title": "my guests all loved them and writing their name and more on their ...",
      "text": "Had these for a wine tasting party, my guests all loved them and writing their name and more on their glasses. Had a blast with these. And they did not wipe off during use but washed off easy when washing them . Great product.",
      "rating": 5.0,
      "verified": true,
      "author": "...",
      "helpful_votes": 3,
      "publication_date": 20170106
    },
    {
      "title": "Vibrant & smooth",
      "text": "Love these, the colors are vibrant and the markers write well. Although if you wet the part of the glass that has the writing the ink falls off and turns waxy. Not sure how or why but I noticed it twice when using these. Other than that they’re perfect!",
      "rating": 4.0,
      "verified": true,
      "author": "Maggie",
      "helpful_votes": 0,
      "publication_date": 20201018
    },
    {
      "title": "Loved these for my wine tasting party",
      "text": "Thank you! Loved these for my wine tasting party! It was a great added touch!",
      "rating": 5.0,
      "verified": true,
      "author": "Chwawagirl",
      "helpful_votes": 16,
      "publication_date": 20151213
    },
    {
      "title": "These pens were outstanding!",
      "text": "I wasn’t totally sold on the idea of wine glass pens but These pens were outstanding!!! They worked and worked well on just about all surfaces and were not washed out looking or faint. They were bold and readable even after use. Well worth the price and a good purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "lubes",
      "helpful_votes": 0,
      "publication_date": 20181209
    },
    {
      "title": "Ok",
      "text": "Wipes off glass easily even after the ink has dried, especially if the wine glass has condensation from being cold.",
      "rating": 3.0,
      "verified": true,
      "author": "Kelly",
      "helpful_votes": 0,
      "publication_date": 20200604
    },
    {
      "title": "Great gift idea",
      "text": "These were better than expected. They wipe off really cleanly on glass with little effort in all colors, write smoothly and look nice. The box they come in makes it easy to store. A great stocking stuffer gift for all the ladies in my family.",
      "rating": 5.0,
      "verified": true,
      "author": "austenfitzgerald",
      "helpful_votes": 0,
      "publication_date": 20190520
    },
    {
      "title": "Does exactly it’s job",
      "text": "I use these all the time, so that the man and the kids don’t use a million drinking glasses a day. They have held up, for months now, and it comes right off in the dishwasher. Does exactly it’s job. I hope this review was helpful!",
      "rating": 5.0,
      "verified": true,
      "author": "Marisa",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "its ok",
      "text": "I guess it works for wine since they are typically served in tall glasses. I used it for mojitos and well, due to glass shape... my guest's hands were able to remove the marker very easily, unwillingly.",
      "rating": 4.0,
      "verified": true,
      "author": "Churka",
      "helpful_votes": 0,
      "publication_date": 20190508
    },
    {
      "title": "Good but needs to be thicker",
      "text": "Cool idea, but the pens are pretty fine points. I ordered these to see if I could save money instead of ordering custom wine glasses for my bridesmaids. The red pen is very faint like a pink. Looks like I'll still be ordering glasses lol. Great for labeling on plates or drawing on a mirror.",
      "rating": 3.0,
      "verified": true,
      "author": "bajaleah",
      "helpful_votes": 2,
      "publication_date": 20180109
    },
    {
      "title": "Hard to see on glass",
      "text": "It is really hard to see any writing with these pens. No matter if you write it big or in caps. The only color that barely works is red. Silver and gold are basically invisible! Wouldn't recommend it.",
      "rating": 1.0,
      "verified": true,
      "author": "LH",
      "helpful_votes": 0,
      "publication_date": 20200907
    },
    {
      "title": "Great Stocking Stuffer for That Wine Lover!",
      "text": "Gave this to my friend along with other wine related products! She said this is a FUN gift and has used it at parties so people know whose wine glass they are picking up! Works well, colors are great!",
      "rating": 5.0,
      "verified": true,
      "author": "Sue",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "A must have for wine drinkers",
      "text": "Very cute for when u have guest. guest will enjoy the personal touch/color/deigns Definitely let it dry before using . Will smudge if the cup prespires from ice/ sweat so you must let dry well and only use on completely dry glass Make a great gift too !",
      "rating": 4.0,
      "verified": true,
      "author": "daniel leites",
      "helpful_votes": 2,
      "publication_date": 20180716
    },
    {
      "title": "Gold Markers were dry, Red marker was pink",
      "text": "Gold markers, were dry, Red marker was pink, Silver marker did work but I needed Gold. Return was easy through Amazon.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20161011
    },
    {
      "title": "Good on glass",
      "text": "These markers are awesome! You can still use your pretty glassware and use these to write names or anything on really, it wipes off very easily with washing, but not so easily that it wont come off while the glass is still in use.",
      "rating": 5.0,
      "verified": true,
      "author": "ksraber",
      "helpful_votes": 0,
      "publication_date": 20200309
    },
    {
      "title": "Super light can barely see the ink on the glass!!!",
      "text": "I bought Wine Glass Writers brand from Bed Bath and Beyond before and loved them. I needed some more and decided to try this brand because of the great reviews! They were aweful. I bought them to decorate 12 wine glasses and the ink was so light and you could barely see the writing. Also, I had to use all 4 markers because they went dry quickly. I do not recommend these at all!!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Jason",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "Cool, but...",
      "text": "These are cool and fun, but they do not come off as easily as suggested. If left on through appetizers, dinner and then conversation (a few hours) the ink does not come off easily.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190319
    },
    {
      "title": "Cooler than charms!!",
      "text": "I loved these. So much better than wine charms and it worked on rock glasses and water glasses as well for marking. We wrote on the base of the wine stem - perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "DJS",
      "helpful_votes": 0,
      "publication_date": 20191127
    },
    {
      "title": "Totally pleased!",
      "text": "Took a chance on these pens for our Thanksgiving dinner wine glasses and they worked beautifully right out of the package. I set them out and guests used them right out of the cute package. Ink showed up well, easy to use, and stayed on all evening. The silver and gold pens were really pretty against the cab and merlot. Ink washed off easily with soap and water, no scrubbing. I would buy again and recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Jedi",
      "helpful_votes": 0,
      "publication_date": 20191202
    },
    {
      "title": "The silver was useless",
      "text": "I like this markers for writing names on wine glasses, but the silver is barely visible on glass. I wish I could have more choice in colors. The marker washes off really easily, which is great.",
      "rating": 3.0,
      "verified": true,
      "author": "Mary",
      "helpful_votes": 0,
      "publication_date": 20200509
    },
    {
      "title": "Excellent purchase!",
      "text": "Great purchase. Guests can have fun decorating their glass. Used it with plastic clear cups for a party. Excellent idea for marking glasses especially with COVID concerns.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly M",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "Perfect for our Christmas party!",
      "text": "These were a big hit at our Christmas party! Everyone loved writing their name (or other!) and when the party was over, the writing washed off very easily.",
      "rating": 5.0,
      "verified": true,
      "author": "Colette",
      "helpful_votes": 0,
      "publication_date": 20200122
    },
    {
      "title": "Work well on glasses",
      "text": "My wife and I prefer stemless wine glasses so regular charms don't work. I tried the magnet kind and promptly broke a $12 Reidel glass. The Vino Markers are the ticket for this ride.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul S.",
      "helpful_votes": 0,
      "publication_date": 20190104
    },
    {
      "title": "Must have",
      "text": "What a simple and useful idea! Worked perfect for our holiday gatherings this year. Wish we got them sooner.",
      "rating": 5.0,
      "verified": true,
      "author": "Mel",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "If there is any condensation or the slightest bit of ...",
      "text": "If there is any condensation or the slightest bit of moisture present at all the ink rubs off/disappears. I have tried using these for two different events and it ends up being a mess. It doesn't matter if you let the ink dry and then pour the liquid in the glass, the ink starts to wipe off on people's hands. Not worth the money.",
      "rating": 1.0,
      "verified": true,
      "author": "Arch girl",
      "helpful_votes": 5,
      "publication_date": 20161021
    },
    {
      "title": "These were a big hit!",
      "text": "I bought these as a hostess gift and she loved them. Her daughter-in-law liked them so well that they were shared between the two women!",
      "rating": 5.0,
      "verified": true,
      "author": "Sandy Sue",
      "helpful_votes": 0,
      "publication_date": 20190630
    },
    {
      "title": "Great!",
      "text": "These are super nice and perfect for use in the hot tub. I really like them and catch my hubby using them for other drinks.",
      "rating": 5.0,
      "verified": true,
      "author": "C. E. Wright",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "Great all around!",
      "text": "First it’s such a pretty color. I bought the neon purple. It goes on so smooth. That’s key. I’m getting all the colors. I want them to give more options of colors. Awesome!!",
      "rating": 5.0,
      "verified": true,
      "author": "Doreen lambert",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "Love these!",
      "text": "I bought these as gifts, and kept one for myself. I use these markers to write on my tupperware the dates and food inside, the wine and beer glasses at parties ... washes off with soap, water and a good scrub sponge.",
      "rating": 4.0,
      "verified": true,
      "author": "N&R C",
      "helpful_votes": 0,
      "publication_date": 20190520
    },
    {
      "title": "Love it!",
      "text": "Love it and its amazing that you can use it on any glass and it wipes off easily or cleans off in the dishwasher. I would purchase this again as gift, as I believe mine will last for a long time. I have had bought glass charms but ended up not using them as people would forget their colors or charms and get a new glass or waste the wine. This helps avoid the confusion and the hassle big time! Pros Affordable Practical Ease of use Cons None",
      "rating": 5.0,
      "verified": true,
      "author": "Avi",
      "helpful_votes": 0,
      "publication_date": 20161212
    },
    {
      "title": "Makes life so much easier!",
      "text": "Makes life so much easier! I use it for marking on fridge/freezer containers too.",
      "rating": 5.0,
      "verified": true,
      "author": "Michellest",
      "helpful_votes": 0,
      "publication_date": 20191106
    },
    {
      "title": "Fun gift!",
      "text": "These are so different, and so much better/modern/ easy than the old charms!",
      "rating": 5.0,
      "verified": true,
      "author": "Brooke",
      "helpful_votes": 0,
      "publication_date": 20200308
    },
    {
      "title": "Crayons for adults",
      "text": "Great product that allows names, notes, anything fun to be written on glasses, plates or bottles. Can ID what it is or whose it is.",
      "rating": 5.0,
      "verified": true,
      "author": "Lloyd Young",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Perfect for stemless glasses, washes off easy!",
      "text": "These markers are incredible and so affordable! My family can now draw sassy phrases on our stemless wine glasses. We found that we had a problem remembering whose stemless glass was whose - no more! And the marks wipe off or wash off very cleanly. No problems whatsoever there. The colors are fun, I plan to purchase more as gifts!",
      "rating": 5.0,
      "verified": true,
      "author": "Emily CTop Contributor: Baby",
      "helpful_votes": 0,
      "publication_date": 20160415
    },
    {
      "title": "Lovely",
      "text": "Loved these. Used them for the holidays. Easy to clean and easy to use. Look really nice too!",
      "rating": 5.0,
      "verified": true,
      "author": "MMT",
      "helpful_votes": 0,
      "publication_date": 20190223
    },
    {
      "title": "Great for mimosas too!",
      "text": "I had a bridal shower at my house and set up a mimosa bar and needed some way to make the glasses. This fit the bill. Easy to write with and washes right off. Didn't smear at all while you were holding the glass.",
      "rating": 5.0,
      "verified": true,
      "author": "Hot mama",
      "helpful_votes": 0,
      "publication_date": 20190529
    },
    {
      "title": "Worth it",
      "text": "Comes in silver and gold. A little hard to read, but nice and easy to clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Heather",
      "helpful_votes": 0,
      "publication_date": 20200208
    },
    {
      "title": "Great buy",
      "text": "Work well as advertised on different materials and uses. Have used mostly golden thus far.",
      "rating": 5.0,
      "verified": true,
      "author": "Dee",
      "helpful_votes": 0,
      "publication_date": 20190312
    },
    {
      "title": "Work well!",
      "text": "Work well but, do not stay on for long. Great idea though!",
      "rating": 3.0,
      "verified": true,
      "author": "Caprisa Ann Grillo",
      "helpful_votes": 0,
      "publication_date": 20191220
    },
    {
      "title": "I love these pens",
      "text": "I love these pens!! I've been using them to write on my kombucha bottles and it has stayed un-smudged on the bottles after being handled multiple times. The fine tips make the writing very legible.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170322
    },
    {
      "title": "Able to wash off",
      "text": "Love love. My gfs loved putting theirs names drawing on their own glass. Easy to wash. Will buy more ☺️",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190907
    },
    {
      "title": "They write nicely on the glasses and the variations of color are ...",
      "text": "The markers were a hit at my recent party. They write nicely on the glasses and the variations of color are a great touch.",
      "rating": 5.0,
      "verified": true,
      "author": "Heather Lowe",
      "helpful_votes": 0,
      "publication_date": 20180223
    },
    {
      "title": "It works nicely. My friends had fun with them in the ...",
      "text": "It works nicely. My friends had fun with them in the last two parties we hosted. After use we just put the glasses in the dishwasher and done!",
      "rating": 5.0,
      "verified": true,
      "author": "Carmen",
      "helpful_votes": 0,
      "publication_date": 20170115
    },
    {
      "title": "Great idea",
      "text": "What a great idea for wine glasses, it makes everything so much easier by having this markers.",
      "rating": 5.0,
      "verified": true,
      "author": "Carolina FC",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Many uses!",
      "text": "I bought these for writing on mirrors/windows and they work great for schedules and little notes!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191107
    },
    {
      "title": "Better than charms for identity of your glass",
      "text": "Loved these worked so much better than charms that everyone forgets what charm they were. Only had a few glasses where their name was smudged and I think that was wet fingers. Super easy to clean name right off. My mom was so impressed she is going to buy some",
      "rating": 5.0,
      "verified": true,
      "author": "Tiffany S",
      "helpful_votes": 0,
      "publication_date": 20200124
    },
    {
      "title": "No more “Is this my wine?”",
      "text": "Love these markers.We use them at family gatherings for wine glasses and often for coffee cups in the morning. Really cuts down on dishes when everyone knows which glass is their’s! Washes right off in the dishwasher.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Beth Smith",
      "helpful_votes": 0,
      "publication_date": 20190117
    },
    {
      "title": "Just as described.",
      "text": "Perfect for my party. Worked great and my guests were very impressed.",
      "rating": 5.0,
      "verified": true,
      "author": "Besey",
      "helpful_votes": 0,
      "publication_date": 20190302
    },
    {
      "title": "Not just for wine (but works great!)",
      "text": "Sooo many other uses! La eling Mason jars, writing notes on Windows or mirrors! Love these",
      "rating": 5.0,
      "verified": true,
      "author": "B. Smith",
      "helpful_votes": 0,
      "publication_date": 20180909
    },
    {
      "title": "It takes a little bit of work to erase the names but it is worth it.",
      "text": "These were my Xmas stocking stuffers and hostess gifts. When I gave them out you would think I gave someone a pot of gold, Everyone loves them.",
      "rating": 5.0,
      "verified": true,
      "author": "SUSAN TUPPER",
      "helpful_votes": 0,
      "publication_date": 20180102
    },
    {
      "title": "great glass markers",
      "text": "these glass markers are exactly what we were looking for and work well. The colors are subtle -- don't expect them to \"pop\".",
      "rating": 5.0,
      "verified": true,
      "author": "Christine",
      "helpful_votes": 0,
      "publication_date": 20180121
    },
    {
      "title": "A fun gift",
      "text": "I gave these to my sister as a gift. She said she loved the markers and they worked well.",
      "rating": 5.0,
      "verified": true,
      "author": "Illinois shopper",
      "helpful_votes": 0,
      "publication_date": 20201004
    },
    {
      "title": "Washes off very easily. Much easier than people having to remember which ...",
      "text": "Washes off very easily. Much easier than people having to remember which wine charm they have on their glass. We wrote names on the circular base of the glass, below the stem.",
      "rating": 5.0,
      "verified": true,
      "author": "Customer",
      "helpful_votes": 0,
      "publication_date": 20180204
    },
    {
      "title": "Fun!",
      "text": "I use these almost every weekend. They work well and wash off easily with soap and water. My artistic friends love to be able to decorate their own glass and my husband loves that theres nothing clanking on his glass.",
      "rating": 5.0,
      "verified": true,
      "author": "MichaelVA",
      "helpful_votes": 0,
      "publication_date": 20160725
    },
    {
      "title": "Great gift",
      "text": "I ordered these for a friend, who makes her own wine, and she loves them. I ordered two more sets.",
      "rating": 5.0,
      "verified": true,
      "author": "Debbie",
      "helpful_votes": 0,
      "publication_date": 20190911
    },
    {
      "title": "Love these! Colors are fun and not too hard ...",
      "text": "Love these! Colors are fun and not too hard to clean up.",
      "rating": 5.0,
      "verified": true,
      "author": "josh roberson",
      "helpful_votes": 0,
      "publication_date": 20180823
    },
    {
      "title": "... used it for our bachelorette weekend and the bridesmaids loved it. We didnt have to guess whose glass ...",
      "text": "I used it for our bachelorette weekend and the bridesmaids loved it. We didnt have to guess whose glass it was and saved us dishes",
      "rating": 5.0,
      "verified": true,
      "author": "Erin Parsons",
      "helpful_votes": 0,
      "publication_date": 20170515
    },
    {
      "title": "great",
      "text": "easy to write with and come off in the dishwasher.",
      "rating": 5.0,
      "verified": true,
      "author": "Sydney Mogul",
      "helpful_votes": 0,
      "publication_date": 20200125
    },
    {
      "title": "Smaller than expected, but very cute and they work.",
      "text": "Cute little set of wine glass markers! They are smaller than I expected, but They work perfectly and dried quickly. Storage box is cute too.",
      "rating": 5.0,
      "verified": true,
      "author": "Jmoss0219",
      "helpful_votes": 0,
      "publication_date": 20171213
    },
    {
      "title": "Great idea",
      "text": "Bought as a gift for my sister and we used them while I was there. They were a hit. We chose to write on the base. It dried quickly and there was no smudging during use, but it washed off easily. The company sent along a follow-up email of many other uses for the markers, so I've already ordered a set for myself!",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara Elliott",
      "helpful_votes": 0,
      "publication_date": 20160131
    },
    {
      "title": "Fun and Easy!!",
      "text": "These are actually the cooler things! My daughter bought them for me for a Christmas and it was so much fun decorating my wine glasses for the day! It stays on pretty well but comes off very easily with water!!",
      "rating": 5.0,
      "verified": true,
      "author": "SabrinaD",
      "helpful_votes": 0,
      "publication_date": 20170311
    },
    {
      "title": "Fun & easy wine glass identifier.",
      "text": "Great idea to identify everyone's wine glass, or to add something funny or special on glasses.",
      "rating": 5.0,
      "verified": true,
      "author": "Dee",
      "helpful_votes": 0,
      "publication_date": 20191224
    },
    {
      "title": "Great product. Not just for wine glasses.",
      "text": "These worked perfectly for our gathering. We were able to use them to write the names of different cheeses on our marble cheese board and used them for the wine and coffee glasses. The markers are durable, lasting the entire night and washed off easily.",
      "rating": 5.0,
      "verified": true,
      "author": "M Jenkins",
      "helpful_votes": 0,
      "publication_date": 20191129
    },
    {
      "title": "Really love these!",
      "text": "These have been such a hit at gatherings. People draw all sorts of things on their glasses. It does smear if you write on the glass and there is a lot of condensation, but the base of the glass always works. Really love these!",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Lynn",
      "helpful_votes": 0,
      "publication_date": 20180621
    },
    {
      "title": "Party Hit!",
      "text": "I bought these for a baby shower I was hosting. We used them to write the name of each juice in each pitcher for our champagne bar and on the wine glasses. They were a hit and the guests were creative with writing funny names on their glasses. I'll definitely order more of these in the future!",
      "rating": 5.0,
      "verified": true,
      "author": "Emily G.",
      "helpful_votes": 5,
      "publication_date": 20151103
    },
    {
      "title": "Five Stars",
      "text": "The markers made it super easy to identify everyone's glasses at a large party.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah Gille",
      "helpful_votes": 0,
      "publication_date": 20170130
    },
    {
      "title": "Five Stars",
      "text": "We use these regularly for parties where everyone's glass looks the same. :D",
      "rating": 5.0,
      "verified": true,
      "author": "AzV",
      "helpful_votes": 0,
      "publication_date": 20180420
    },
    {
      "title": "The markers are awesome but the package is very poor quality",
      "text": "The markers are awesome but the package is very poor quality. I bough several for gifts and they came with the package broken or with tape on them. The quality of the printing in the carton of the package is really poor and makes the product look less than cheap. The markers once dry they won't come off unless you rub them with little water, easy to wash and doesn't leave residue. The ink looks great in the wine glass.",
      "rating": 5.0,
      "verified": true,
      "author": "Claudia F",
      "helpful_votes": 0,
      "publication_date": 20160827
    },
    {
      "title": "Great problem solver, and fun too!",
      "text": "Big hit at an outdoor family gathering. One of the youngsters, with an artistic flare, decorated individual guests' glasses to rave reviews! I'll be using these again, even during indoor gatherings at which real wine glasses are employed.",
      "rating": 5.0,
      "verified": true,
      "author": "Helen A.",
      "helpful_votes": 0,
      "publication_date": 20171013
    },
    {
      "title": "These pens are awesome -- especially love the ideas they show like writing ...",
      "text": "These pens are awesome -- especially love the ideas they show like writing names on plates instead of using place cards -- did this at a dinner and it was a BIG hit! I'm throwing away all of those silly wine charms since no one remembers which charm is theirs anyway.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Schoeneman",
      "helpful_votes": 0,
      "publication_date": 20151015
    },
    {
      "title": "Fun gift",
      "text": "Purchased for an add on to a birthday gift. This is my 3rd time I ordered these. Cute idea, very nice packaging and the markers work great on glasses, plates or any glass you want to write on. Dinner guests enjoyed decorating their own glasses. They make a great little gift.",
      "rating": 5.0,
      "verified": true,
      "author": "sycamorefarm",
      "helpful_votes": 0,
      "publication_date": 20190605
    },
    {
      "title": "Personal touch to wine on the patio !",
      "text": "Awesome addition to cocktail hour! Great for parties. Write on them ahead of time for no smudging Easily washed off at the end of the night",
      "rating": 5.0,
      "verified": true,
      "author": "South Carolina ",
      "helpful_votes": 0,
      "publication_date": 20180721
    },
    {
      "title": "I like how writes easily on the wine glass and i ...",
      "text": "I like how writes easily on the wine glass and i love how it takes off easily after wash. It’s so convenient to write peoples name or do designs to distinguish the glasses. I would buy this again",
      "rating": 5.0,
      "verified": true,
      "author": "Pao N.",
      "helpful_votes": 0,
      "publication_date": 20180121
    },
    {
      "title": "Good gift",
      "text": "This was a gift so I'm not personally sure how they are in practice. The gift recipient loves them though. The markers can be used on wine glasses, mason jars, and more.",
      "rating": 4.0,
      "verified": true,
      "author": "Graedon Li",
      "helpful_votes": 0,
      "publication_date": 20160329
    },
    {
      "title": "Easy to wash and stay on well",
      "text": "Works great! Used them at our wedding and they were perfect and was off easily!",
      "rating": 5.0,
      "verified": true,
      "author": "JW",
      "helpful_votes": 0,
      "publication_date": 20190618
    },
    {
      "title": "Nice touch!",
      "text": "These worked great for our brunch. I pre-wrote the guests names on their flutes and it made for a lovely presentation at the mimosa bar.",
      "rating": 5.0,
      "verified": true,
      "author": "PetuniaPetals",
      "helpful_votes": 0,
      "publication_date": 20170205
    },
    {
      "title": "They work!",
      "text": "Good, bright colors. Good price. Shows up well, wipes off easily. Would buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer L Brown",
      "helpful_votes": 0,
      "publication_date": 20190320
    },
    {
      "title": "Great hostess gift.",
      "text": "This is a nice hostess gift. For the price, it is an easy thing to bring. And, since it has to do with wine, it is almost always appropriate.",
      "rating": 4.0,
      "verified": true,
      "author": "LM Gaydos",
      "helpful_votes": 0,
      "publication_date": 20180406
    },
    {
      "title": "Just as expected and they are very good quality. Easy to wash and last long on ...",
      "text": "Just as expected and they are very good quality. Easy to wash and last long on glass while using them. And is a very useful thing.",
      "rating": 5.0,
      "verified": true,
      "author": "Isabel",
      "helpful_votes": 0,
      "publication_date": 20170718
    },
    {
      "title": "... plates during the family Christmas dinner and it looked great. The writing on the plates looked as if ...",
      "text": "We used them to decorate the glasses and plates during the family Christmas dinner and it looked great. The writing on the plates looked as if they were part of them",
      "rating": 5.0,
      "verified": true,
      "author": "NadimC",
      "helpful_votes": 0,
      "publication_date": 20151228
    },
    {
      "title": "WRITES PERFECTLY ON GLASS",
      "text": "Useful when hosting dinner parties! Love the personal touch of adding guest's name in calligraphy.",
      "rating": 5.0,
      "verified": true,
      "author": "Marion M.D.",
      "helpful_votes": 0,
      "publication_date": 20171115
    },
    {
      "title": "Other great uses too",
      "text": "Awesome! Perfect to even write on the edge of plates and such for serving !",
      "rating": 5.0,
      "verified": true,
      "author": "Lauren R.",
      "helpful_votes": 0,
      "publication_date": 20161218
    },
    {
      "title": "Work great!",
      "text": "Great idea ....no need to remember which charm is yours!!",
      "rating": 5.0,
      "verified": true,
      "author": "Wanderer",
      "helpful_votes": 0,
      "publication_date": 20171229
    },
    {
      "title": "Labelingw",
      "text": "Loved it for my 50th Birthday Celebration themed “ Swirl Sip & Cigars”. Everyone was able to write their name on their individual wine glass.",
      "rating": 5.0,
      "verified": true,
      "author": "Kimberly Hopkins",
      "helpful_votes": 0,
      "publication_date": 20190413
    },
    {
      "title": "Three Stars",
      "text": "Marker still runs a little even when it's not wet!",
      "rating": 3.0,
      "verified": true,
      "author": "teresa paradiso",
      "helpful_votes": 2,
      "publication_date": 20150629
    },
    {
      "title": "Great for wine glasses",
      "text": "Every pen worked well out of the box. Writes clearly on glass. Doesn't wipe off after it dries. Does was off very easily by wiping with soapy water. Everything it claimed it would do.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170505
    },
    {
      "title": "Perfect",
      "text": "I used these at my wedding reception for people to label their glasses. It worked perfectly and washed off easily the next day!",
      "rating": 5.0,
      "verified": true,
      "author": "SJT",
      "helpful_votes": 0,
      "publication_date": 20190405
    },
    {
      "title": "Stayed on during the party and easily washed off when done",
      "text": "Solved our problem about whose glass was whose! Stayed on during the party and easily washed off when done.",
      "rating": 5.0,
      "verified": true,
      "author": "Careful Spender",
      "helpful_votes": 0,
      "publication_date": 20171214
    },
    {
      "title": "Its a wine pen",
      "text": "They write on wine glasses and wash off easily, not much more to say.",
      "rating": 5.0,
      "verified": true,
      "author": "dmr",
      "helpful_votes": 0,
      "publication_date": 20181222
    },
    {
      "title": "no more germs!",
      "text": "going to a party? tired of people drinking out of your glass sharing god knows what kid of germs! write on your glass and wash it off! keeps germs to yourself and prevents the spread of illness!",
      "rating": 5.0,
      "verified": true,
      "author": "Rosie Forte",
      "helpful_votes": 0,
      "publication_date": 20160513
    },
    {
      "title": "These are fun and do WASH right off",
      "text": "These are fun and do WASH right off! Make a great gift along with that bottle of wine, of course for all glasses!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180321
    }
  ],
  "product_meta": {
    "title": "Vino Marker Metallic Wine Glass Washable Pens (4 pack) - Perfect Housewarming Present or Hostess Gift for Wine Tastings, Dinner Parties, or Any Event",
    "rating": 4.6,
    "feature_bullets": [
      "WINE TIME: Each pack of pens includes 4 markers, one silver, one red, and two gold pens.",
      "EASY TO USE: For red wine, write anywhere on the glass. Just let it dry for 3 to 5 minutes and it will stay on for the life of the party. The ink will not smear even while holding your wine glass. For white wine and cold drinks write on the base of the wine glass for best results. The ink washes off easily with warm soapy water.",
      "PERFECT PRESENT: Wine marker pens make a great hostess gift and housewarming present, and are a great party favor or unique gift idea for wine lovers. The ink is non-toxic and food grade allowing you to customize a multitude of surfaces.",
      "PARTY IDEAS: Vino Markers work on any glass or glazed ceramic surface. Perfect for wine tastings, to replace wine tags, to label a present, on canning jars, to add names to place settings, to replace wine charms....the possibilities are endless."
    ],
    "specifications": {
      "Manufacturer": "Cayman Products",
      "Brand": "Vino Marker",
      "Item Weight": "3.84 ounces",
      "Package Dimensions": "8.27 x 4.41 x 0.67 inches",
      "Is Discontinued By Manufacturer": "No",
      "Color": "Red, gold, silver",
      "Material Type": "Plastic",
      "Size": "4 pack",
      "Manufacturer Part Number": "12",
      "ASIN": "B00V7B7H7A",
      "Customer Reviews": "4.6 out of 5 stars952 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#8,876 in Arts, Crafts & Sewing",
      "Date First Available": "April 1, 2015"
    },
    "categories": [
      "Painting, Drawing & Art Supplies",
      "Office Products",
      "Drawing",
      "Arts, Crafts & Sewing",
      "Markers",
      "Drawing Media"
    ],
    "price": 6.99
  }
}