{
  "website_summaries": [
    {
      "verdict": "The Gaems M-240 Professional Gaming Monitor is a 24-inch display designed for gamers by gamers. It's built for travel and delivers booming audio, but its overall performance is middling.",
      "pros": [
        "Slick-looking design",
        "Strong audio output",
        "Travel-ready"
      ],
      "cons": [
        "HDMI only",
        "No USB ports",
        "Finicky function buttons",
        "Middling gray-scale and color performance in testing"
      ],
      "aspects": {},
      "publication_date": 20160217,
      "rating": 6.0,
      "source": "pcmag"
    }
  ],
  "customer_reviews": [
    {
      "title": "Awesome!",
      "text": "Worth the price. Speakers give loud solid signal. I have used it as XBox display, PC monitor, and just a TV. Screen guard elastic straps broke after a few months but does not effect functionality.",
      "rating": 5.0,
      "verified": true,
      "author": "BOSS",
      "helpful_votes": 0,
      "publication_date": 20170120
    },
    {
      "title": "So far I love that it came with a screen protector and this ...",
      "text": "So far I love that it came with a screen protector and this is a nice TV for truck driver who game a lot on the go.",
      "rating": 5.0,
      "verified": true,
      "author": "Christopher",
      "helpful_votes": 3,
      "publication_date": 20150810
    },
    {
      "title": "Amazing product!!!",
      "text": "This is well worth every penny, best gaming monitor I've ever had!!! Love it!!!",
      "rating": 5.0,
      "verified": true,
      "author": "shannon",
      "helpful_votes": 2,
      "publication_date": 20160524
    },
    {
      "title": "It's Meh, Get a BenQ for cheaper",
      "text": "Unit is MASSIVE. Looks small, is not. Picture quality is not worth the cost; Buy a BenQ for this price, will be a much better value. 4 out of 10 would date!",
      "rating": 3.0,
      "verified": true,
      "author": "Atomsk",
      "helpful_votes": 0,
      "publication_date": 20160617
    },
    {
      "title": "Four Stars",
      "text": "It does not come on right away it take several tries to get monitor to turn",
      "rating": 4.0,
      "verified": true,
      "author": "carl",
      "helpful_votes": 3,
      "publication_date": 20160223
    },
    {
      "title": "Five Stars",
      "text": "Great multi purpose TV! Good quality screen and easily transported.",
      "rating": 5.0,
      "verified": true,
      "author": "Red",
      "helpful_votes": 0,
      "publication_date": 20170109
    },
    {
      "title": "Five Stars",
      "text": "I like the sound, colors and brightness are great, perfect for my ps4",
      "rating": 5.0,
      "verified": true,
      "author": "edsgar",
      "helpful_votes": 4,
      "publication_date": 20150724
    },
    {
      "title": "I would recommend it.",
      "text": "Nice product. No lag, great screen great size and great sound, easy to transit the back stand can be turned up to carrying and the grip is too comfortable to hold and carry. The only problem is the wight ( heavier than ps4 about 1 kg ) and the power supply better if it can be work in usb like m155. I wish it cames with backpack to be easier to transit. Thinks for this product its really nice to have it.",
      "rating": 5.0,
      "verified": true,
      "author": "s.malek",
      "helpful_votes": 26,
      "publication_date": 20150606
    },
    {
      "title": "I dont have the power!",
      "text": "Did not get power supply in box. The box said pre release special edition, I guess they teamed up nintendo and decided not to include a way to power it.",
      "rating": 3.0,
      "verified": true,
      "author": "Biily S.",
      "helpful_votes": 2,
      "publication_date": 20160522
    },
    {
      "title": "Great monitor, but bigger than it looks.",
      "text": "Great picture and sound, but I really didn't like the Matte screen. Also it's a lot bigger than it appears. The description on the page lists it as 28\" wide but it's closer to 3 feet. Needless to say it's not as portable as it's advertised to be. I decided to stick with the GEAMS M155 portable monitor, It's picture isn't as nice but it's way more portable which is what I personally needed.",
      "rating": 4.0,
      "verified": true,
      "author": "T. Knight",
      "helpful_votes": 6,
      "publication_date": 20150728
    },
    {
      "title": "I was literally blown away....but then...",
      "text": "This is the best display product I've ever seen. The picture is amazing and ridiculously crisp. Plenty of options for adjustments, which was my gripe with the Gaems Vanguard. Very well built and the handle on the back is fantastic for portability. Very highly recommended! Update* After using the monitor for a couple hours I turned it on the next day and surprise....dead pixels. Sending it back for replacement. It is a great product, unfortunately mine is defective.",
      "rating": 2.0,
      "verified": true,
      "author": "Jenna",
      "helpful_votes": 5,
      "publication_date": 20150820
    },
    {
      "title": "Five Stars",
      "text": "I love it, it's everything I wanted and more. Best monitor going for gaming",
      "rating": 5.0,
      "verified": true,
      "author": "robert cortez",
      "helpful_votes": 0,
      "publication_date": 20160413
    },
    {
      "title": "*READ BEFORE YOU BUY*",
      "text": "After 2 months of using, the colors on the screen are starting to mess up. Right now there is a green-ish color in the background and little bit of blur, which makes it hard for me to focus on the game or play. I would not recommend a monitor with that price to be faulty after 60 days.",
      "rating": 1.0,
      "verified": true,
      "author": "yousef adel aladwani",
      "helpful_votes": 5,
      "publication_date": 20151015
    },
    {
      "title": "Five Stars",
      "text": "It's size and quality were both very impressive. My husband loves it!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160509
    },
    {
      "title": "a very good screen,the first time to buy games' product",
      "text": "just a little for me,I almost don't have place to put it",
      "rating": 5.0,
      "verified": true,
      "author": "Franky",
      "helpful_votes": 0,
      "publication_date": 20160518
    },
    {
      "title": "Great product!!",
      "text": "Product came very fast. The item is awesome. Thank you so much!!",
      "rating": 5.0,
      "verified": true,
      "author": "Kenneth L. Reese",
      "helpful_votes": 4,
      "publication_date": 20150705
    },
    {
      "title": "One Star",
      "text": "So disappointed in this product. Arrived with dead pixels. Returned to Amazon",
      "rating": 1.0,
      "verified": true,
      "author": "Richard Arnold",
      "helpful_votes": 0,
      "publication_date": 20160423
    },
    {
      "title": "Best PC gaming screen i tried hands down.",
      "text": "Best pc screen i ever had and sound is just phenomenal. I would recommend this gaming monitor to anyone looking for the best screen out there. Unfortunately i would have wanted a bigger screen like 27 or 32 but this one does just fine until gaems makes one.",
      "rating": 5.0,
      "verified": false,
      "author": "ispeedca",
      "helpful_votes": 0,
      "publication_date": 20170614
    },
    {
      "title": "Versatile, Powerful, Aesthetic",
      "text": "GAEMS is a company I've been following since its inception; the M240 is an incredible product not only because of performance but because of the aesthetic as well. It is a very elegant looking product that is highly useful both for gaming and for normal use.",
      "rating": 5.0,
      "verified": false,
      "author": "Romi Mahajan",
      "helpful_votes": 2,
      "publication_date": 20150830
    }
  ],
  "product_meta": {
    "title": "GAEMS M240 Professional Gaming Monitor",
    "description": "Is the lag on your gaming system killing you? GAEMS customers expect virtually lag free gaming experiences with quality sound and a unique ability to safely and conveniently game anywhere. We designed the M240 Professional Gaming Monitor with all of these expectations in mind. So stop sacrificing your lives and your standards and start playing smarter. Built to be the best VG/PC gaming experience on the market, this killer 24\" 60 hz portable monitor will help you lag less and live longer. The M-240 will bring your gaming to a whole new level. Professional gamers and video streamers (or those aspiring to become either) will appreciate the ultra-fast performance of our 24\" 1080p HD LED monitor. Best in class audio is achieved through proprietary \"Dynamic Sound Stage\" technology utilizing 4 chambered speakers and passive subwoofer. Dedicated HDMI output improves the video and audio capture performance while at the same time eliminating the need to use splitters and other non-reliable solutions. Having twin HDMI inputs makes it easy to connect 2 consoles or a console and PC to the same monitor for editing and stream capture. Want better bass? GAEMS provides a subwoofer only output port alongside the 3.5mm audio output jack. Turn the VESA mount handle 180 degrees and it doubles as a handle. Attach the protective cover and feel secure taking your monitor to another room, to a LAN event or even on a plane for work or vacation! Why leave your best monitor at home? Casual gamers will also enjoy out of box settings for console and PC use without the need to tweak every setting every time.",
    "rating": 3.2,
    "feature_bullets": [
      "24\" 1080 Full HD LED Display",
      "VESA mounted stand rotates as a carry handle",
      "2X HDMI dedicated inputs plus 1 HDMI Output",
      "Best in Class sound - 4 Speakers",
      "Gaming, Media, and Extended Desktops"
    ],
    "specifications": {
      "ASIN": "B00VWCK1A4",
      "Release date": "May 28, 2015",
      "Customer Reviews": "3.2 out of 5 stars37 ratings3.2 out of 5 stars",
      "Best Sellers Rank": "#72,757 in Video Games",
      "Pricing": "The strikethrough price is the List Price. Savings represents a discount off the List Price.",
      "Product Dimensions": "32.01 x 12.01 x 19.02 inches; 0.18 Ounces",
      "Binding": "Video Game",
      "Item model number": "M240",
      "Is Discontinued By Manufacturer": "No",
      "Item Weight": "0.176 ounces",
      "Manufacturer": "GAEMS",
      "Date First Available": "April 7, 2015"
    },
    "categories": [
      "Xbox",
      "Accessories",
      "Legacy Systems",
      "Video Games"
    ],
    "price": ""
  }
}