{
  "website_summaries": [
    {
      "verdict": "Great if you're looking for an affordable body butter with your choice of scent.",
      "pros": [
        "Available in 18 scents",
        "Isn't greasy and won't clog pores",
        "Affordably priced",
        "Softens skin",
        "Rich, creamy consistency"
      ],
      "cons": [
        "A few users have complained that their product arrived unsealed and damaged"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Body Shop packaging, but not butter",
      "text": "Unless the Body Shop has significantly changed its product, what I received was some other cream in Body Shop packaging. I have other containers of this body butter, and they are more like Crisco (or butter) in consistency. My last order through this listing arrived and looked like lotion. At first, I thought it was because it arrived on a warm day. It never regained the correct consistency, never smelled right, and certainly doesn’t moisturize like the body butter. I’m finding a new supplier for my next order.",
      "rating": 1.0,
      "verified": true,
      "author": "Mena ",
      "helpful_votes": 32,
      "publication_date": 20190817
    },
    {
      "title": "Not filled all the way",
      "text": "Nice lotion but it's only filled about half way of the very small container. Probably won't even be able to lotion my whole body once.",
      "rating": 2.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 44,
      "publication_date": 20180509
    },
    {
      "title": "No product",
      "text": "It was delivered so early (day after ordered)! Which was great, but the container was nearly empty! I know things settle but it still would have not been worth the money!",
      "rating": 1.0,
      "verified": true,
      "author": "CK",
      "helpful_votes": 49,
      "publication_date": 20171119
    },
    {
      "title": "Missing Half of Product???",
      "text": "The product itself seems good. I'm giving this a 1-star review because the container I received is half full. One whole side of the container is almost completely without product. I opened it like that and just opened it again now, to see if it was just something to do with shipment and the product settling, but no.",
      "rating": 1.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 53,
      "publication_date": 20171011
    },
    {
      "title": "Don't Buy this Product!!",
      "text": "Not worth the Money!! Ugh! The container was almost \"EMPTY\"??? Don't waste your MONEY!! It is such a waste!! UGH!!!",
      "rating": 1.0,
      "verified": true,
      "author": "LvstoRead2",
      "helpful_votes": 37,
      "publication_date": 20171025
    },
    {
      "title": "Lovely scent",
      "text": "My favorite body butter cream! The fruity and fresh scent makes me happy every time I use it. Just be careful if you want to buy this for the gift since it might seems empty a bit. Other than that, pretty satisfied with this purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Joy",
      "helpful_votes": 18,
      "publication_date": 20190613
    },
    {
      "title": "Please carry the 13.5oz size!",
      "text": "I love this product, but I gave it 4 stars because it needs to come in a larger container. I was able to purchase a 400ml (13.5oz) size once through Amazon; it was a bit more economical and used less plastic than buying 2 200ml containers. But now, the only 400ml size available is like quadruple the price of a 200ml size. What?!!? I hope that Amazon will go back to carrying the 400ml sizes at a price consistent with the pricing on the 200ml size.",
      "rating": 4.0,
      "verified": true,
      "author": "ska",
      "helpful_votes": 16,
      "publication_date": 20180327
    },
    {
      "title": "Regular Woman",
      "text": "I cannot believe there would be any bad reviews on this, whatsoever. Put this on my body, then got licked from head to toe. I vaguely remember something was said about me being like strawberry candy, but the main point is this gives pheromone-strength attractiveness to the wearer. The grass is greener where you water it, ladies. This is your water.",
      "rating": 5.0,
      "verified": true,
      "author": "lauren",
      "helpful_votes": 7,
      "publication_date": 20190624
    },
    {
      "title": "I absolutely LOVE this body butter",
      "text": "I absolutely LOVE this body butter! To be honest, I think most other scents from Body Shop smell terrible. But this coconut one is delicious. Besides smelling amazing, it is the only one that works when my hands get super dry in the winter. My skin is happy, and so am I. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 6,
      "publication_date": 20180107
    },
    {
      "title": "Not Shea",
      "text": "If the Body Shop changed their formula then I apologize in advance for this review. This is not the Shea body butter I’ve used in the past. It came unsealed, and smells very floral (think, old lady). It used to have a nice light nutty scent but this is absolutely nothing even close. I didn’t use and returned it. Very disappointed. Will try ordering directly from Body Shop’s website.",
      "rating": 1.0,
      "verified": true,
      "author": "AmazonCustomer",
      "helpful_votes": 5,
      "publication_date": 20200606
    },
    {
      "title": "Love it!",
      "text": "I love Body Shop products. This body butter is wonderful! It smells great but isn’t overpowering on your body. Love how soft it makes my skin w/o feeling greasy or heavy on my skin.",
      "rating": 5.0,
      "verified": true,
      "author": "Kammy17",
      "helpful_votes": 6,
      "publication_date": 20171205
    },
    {
      "title": "Over priced",
      "text": "This is by far the best moisturizer, without a doubt. I thought when buying this it was a great price, however I was recently at Ultra and they have it priced at 12.99.",
      "rating": 2.0,
      "verified": true,
      "author": "Shari Goscinak",
      "helpful_votes": 5,
      "publication_date": 20190327
    },
    {
      "title": "Citrus and Soothing",
      "text": "If you love the scent of citrusy orange, you will LOVE this body butter. Usually, this costs around $35 on the website for The Body Shop. I was able to purchase this for a lower price on Amazon from a seller. The body cream is smooth and a bit thicker. The 13.5 ounce size is huge even though the picture doesn't show this accurately. I have used Satsuma for years and love it. The scent is fresh, lively and it wakes you up. Try the shower gel if you can and the body scrub, too. Wonderful!",
      "rating": 5.0,
      "verified": true,
      "author": "TinaBug",
      "helpful_votes": 8,
      "publication_date": 20160606
    },
    {
      "title": "Moisturizes without that sticky feeling.",
      "text": "I love Body Shop products. This moisturizer, in particular, has a very pleasant scent and counters my dry skin without giving me that sticky feeling. Very nice stuff.",
      "rating": 5.0,
      "verified": true,
      "author": "Julie McNeely-Kirwan",
      "helpful_votes": 3,
      "publication_date": 20190528
    },
    {
      "title": "Nice but too little",
      "text": "I won’t get this again, I will probably keep the container and fill it up for traveling. Before you buy it make sure you looks at the size. I love the scent and texture of all the body shop body butters, but this one looked half full when I opened it.",
      "rating": 4.0,
      "verified": true,
      "author": "J",
      "helpful_votes": 5,
      "publication_date": 20190105
    },
    {
      "title": "Love!",
      "text": "Products works great! I use this on my feet every night and it gives the perfect moisture to prevent cracking but not greasy. Definitely recommend this product",
      "rating": 5.0,
      "verified": true,
      "author": "Alicia",
      "helpful_votes": 3,
      "publication_date": 20190422
    },
    {
      "title": "Smells amazing but the cream is not thick at all",
      "text": "When I look for body butter I want something that makes my skin feel moisturized. I had been using Jergen's for years but the formula is just a little too watery and doesn't do anything for my dry skin. For nearly $20 I expected this to be A LOT more moisturizing than it was. The smell was very nice to me, although my husband said it's too strong. This cream was way too thin and my dry skin still felt dry after using it. I now pair it with body oil. I would not recommend this product. For the price there are better options out there.",
      "rating": 4.0,
      "verified": true,
      "author": "TFBenitez",
      "helpful_votes": 0,
      "publication_date": 20201019
    },
    {
      "title": "Prepare yourself for a box full of cocobutter",
      "text": "The lid is horrible and doesn’t seal at all. First one I ordered was opened and contents were poured all over the box. Amazon was amazing and replaced it asap. But the 2nd one came with the same issue lid was still on but horribly sealed. Great stuff if you actually get it, the lady friend I bought it for loves it. But I would order it as a stand alone not with other products or you will spend some time cleaning it off them and calling amazon to replace what it’s spill damages.",
      "rating": 1.0,
      "verified": true,
      "author": "Jack Neef",
      "helpful_votes": 0,
      "publication_date": 20190823
    },
    {
      "title": "Satsuma scent smelled awful!",
      "text": "The scent was awful! It smelled citrusy but there was an undertone of something else. My husband and son both smelled it and said there was something wrong, so it wasn’t just my nose being overactive. I think it got hot or sat too long. Amazon was wonderful and refunded it for me. I got the Satsuma one. May try another scent because overall the formula felt good! I just couldn’t stand the smell.",
      "rating": 1.0,
      "verified": true,
      "author": "J. Walker",
      "helpful_votes": 2,
      "publication_date": 20200406
    },
    {
      "title": "LOVE LOVE LOVE!!! my BOdy butter i cant survive without this one my body",
      "text": "Thank you Amazon for selling my favorite body butter by The body shop. what can I say about this product is AMAZING it heals every scratch i have in my body. i love to cook so my hands has lot of burn.. well sometimes i got lucky but most all the time i have burn either my fingers or side of my arms, but i don't have to worry about it because i know i have this lotion to heal me after..Because i love this body butter that much i even subscribes to the seller.. gonna make sure have my supply :)",
      "rating": 5.0,
      "verified": true,
      "author": "Vanessa",
      "helpful_votes": 0,
      "publication_date": 20190816
    },
    {
      "title": "This is the best lotion for creppy skin.  It makes my skin look like a 18 yr old",
      "text": "Fast shipping good price. Just a note...ive used this product for YEARS. I have had to buy other body butters when I ran out and couldnt find a bodyshop to buy from. Nothing compares. This lotion makes my skin look like an 18 year old, im 55. The scent is not overpowering and it doesnt look greasy. I need to buy stock in. Bodyshop",
      "rating": 5.0,
      "verified": true,
      "author": "diane carroll",
      "helpful_votes": 2,
      "publication_date": 20200627
    },
    {
      "title": "The quality of the product.",
      "text": "I love this lotion. I smell like strawberries for days. Lol. Fresh out the shower. I wear it all day. N when I finally get undress for bed I still smell the lotion on my clothes. Strong. It's a really good lotion. I have this lotion coming in the mail once a month. Thts how much I love it.",
      "rating": 5.0,
      "verified": true,
      "author": "msladytrue",
      "helpful_votes": 5,
      "publication_date": 20191228
    },
    {
      "title": "Worth the cost.",
      "text": "Crazy expensive but it is by far the best cream I’ve ever used on my feet. Yes, my girlfriend can’t believe I’m using something so expensive on my feet, but it’s worth every penny. I walk barefoot a lot so you know what happens. Well my feet are soft by morning. I put on before bed and presto. I’m going to gift to my mom because I know she would never pay this much for foot cream. But it’s a nice luxury.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff B",
      "helpful_votes": 0,
      "publication_date": 20200426
    },
    {
      "title": "Only half full and consistency is like lotion.",
      "text": "I have bought Satsuma body butter from The Body Shop when there were stores here in Kansas City. First of all, the jar is only half full which appears to have happened to a lot of people. The smell is ok but the consistency is too creamy. Compared to the Tree Hut Mango I bought at the same time, it is a huge disappointment and costs twice as much. I find for a lot of health and beauty stuff, it's better to go to the actual website for the product.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20200608
    },
    {
      "title": "Is TRAVEL SIZE !!",
      "text": "Should state 'TRAVEL SIZE' right next to main photo. Disappointed in your deceiving photos that make product appear larger than is. In the 'frequently purchased with' pic, looks almost as big as the bottles of bath gel. In pic with bottle of cream next to it, that must be a doll-size bottle. Yes, I did see travel size listed much farther down on site in description after was received, but STILL, didn't look for it there before because photos appear so much larger. Overpriced as well.",
      "rating": 3.0,
      "verified": true,
      "author": "abelha727",
      "helpful_votes": 0,
      "publication_date": 20200818
    },
    {
      "title": "Hard NO on this product",
      "text": "I ordered the rose scent. Product arrived and I was shocked by how little product was actually in the container. For comparison, I would say 2-3 squirts of a regular lotion. The actual container was less than a 1/4th full. As to the scent, I ordered this specifically for the rose scent. This product may as well be marked scent free. I’ve never actually returned a product until this lotion crossed my path. It simply is a DO NOT PURCHASE.",
      "rating": 1.0,
      "verified": true,
      "author": "Anonymous",
      "helpful_votes": 2,
      "publication_date": 20190717
    },
    {
      "title": "I love this lotion but will never buy it on Amazon again.",
      "text": "This lotion does wonders for my dry skin without irritating my skin allergies, however I opened the Amazon box and it was sitting wide open, lid under the jar, with a fingerprint in the middle of the lotion. Now I have to go through the annoying return process to get my refund for a product that they're just going to have to throw out anyways.",
      "rating": 1.0,
      "verified": true,
      "author": "Liz",
      "helpful_votes": 2,
      "publication_date": 20200418
    },
    {
      "title": "A Marvelous Moisturizing Body Butter",
      "text": "This body butter was recommended to me by my best friend in India. She said it was going to make my poor dried out hands from washing them constantly and help my skin from living in the desert in Las Vegas. I just received it so I don't expect it to be a miracle butter. What I didn't expect or remember was Vitamin E is a little greasy-not liking so much but will have to get used to. I would have ordered a smaller container if there was one.",
      "rating": 5.0,
      "verified": true,
      "author": "Dana Ihnen",
      "helpful_votes": 0,
      "publication_date": 20200521
    },
    {
      "title": "I'm confused...",
      "text": "Well it \"smells\" like The Body Shop Coconut body butter BUT the texture is way off ! It should be super thick ya know , like butter ! This whatever I got is more like lotion. Unless they changed drastically I don't think this is authentic.",
      "rating": 1.0,
      "verified": true,
      "author": "Tarjara",
      "helpful_votes": 0,
      "publication_date": 20200618
    },
    {
      "title": "Good results",
      "text": "Very smooth and creamy as suggested by the title. the perfume is lovely. I have been using it on my very dry hands, each evening, and my hands are soft now. Started using it on my daughters feet each night also. she had very rogh heels and the balls of her feet. what an improvement, and what a lovely perfume to go to sleep with. Happy withthe product. will buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Geisler",
      "helpful_votes": 0,
      "publication_date": 20200315
    },
    {
      "title": "Love the olive body butter.",
      "text": "I received a smaller tub of this as a gift. Love it! When I ran out, I bought another because I like the scent and how it absorbs without being greasy. When it arrived it was packed on its side so it was on the seal, but after setting it upright for awhile it evened back out. Should have been packaged upright. The body butter is fantastic!",
      "rating": 5.0,
      "verified": true,
      "author": "AmazonCustomer",
      "helpful_votes": 0,
      "publication_date": 20181029
    },
    {
      "title": "a Very good product",
      "text": "I’ve always liked this particular body butter. It has a light fresh scent without being too heavy and definitely does the job. I tend to be pretty dry and winter is especially tough. This cream has me covered. I would recommend it to anybody who wears body butter in general.",
      "rating": 5.0,
      "verified": true,
      "author": "TL",
      "helpful_votes": 2,
      "publication_date": 20191212
    },
    {
      "title": "Pretty sure it’s a fake!",
      "text": "Pretty sure this stuff isn’t real. Look how it was taped and there wasn’t a cover underneath the top. I wouldn’t buy from this seller!",
      "rating": 1.0,
      "verified": true,
      "author": "Carey1712",
      "helpful_votes": 2,
      "publication_date": 20191215
    },
    {
      "title": "Glowing!",
      "text": "I saw others post regarding the lack of product inside, which is partially true—the container itself was smaller than I expected, but that also makes it easy to toss in your purse or makeup bag, so I don’t mind. The scent is not strong, but it really does moisturize and I love how it did give a radiating glow!",
      "rating": 4.0,
      "verified": true,
      "author": "Melinda Black",
      "helpful_votes": 0,
      "publication_date": 20190802
    },
    {
      "title": "EDIT! Price Baiters :( - I LOVE(d) this stuff!!",
      "text": "EDIT!! Still love. But sucky seller price baiting model. Bought last week for $18 now 1 week later $36??? C’mon. I’m out. You lose customers that way. Greed much? Truly love. Smells incredible, moisturizes fantastically. I end up putting it on several times a day, not as the moisture doesn't last, but as I just so love the fresh, invigorating scent of orange. \\o/",
      "rating": 1.0,
      "verified": true,
      "author": "M. Lynn",
      "helpful_votes": 0,
      "publication_date": 20200610
    },
    {
      "title": "Smells great",
      "text": "I love to use body butters but I use them as layering if your skin is really dry I suggest using a regular lotion first and then the butter .",
      "rating": 4.0,
      "verified": true,
      "author": "DEBBIE ",
      "helpful_votes": 2,
      "publication_date": 20190304
    },
    {
      "title": "Moisturized all day",
      "text": "So I bought this scent after giving their mango body butter a try. I will say this, it has an almost diaper rash cream smell underneath the strawberry scent when applying. But neither I or my spouse noticed anything but strawberries after it dried. The smell does transfer to whatever you put on, but it lasts one you and your clothes for 12+ hours.",
      "rating": 5.0,
      "verified": true,
      "author": "Sereniti Chacon",
      "helpful_votes": 0,
      "publication_date": 20190608
    },
    {
      "title": "Pretty, not overpowering scent.",
      "text": "This is a very nice scent. People stop me and ask \"what is that wonderful smell?\" I also like the consistency. Unfortunately, my dogs like it so much they try to lick it all off!",
      "rating": 5.0,
      "verified": true,
      "author": "imanuyawka",
      "helpful_votes": 3,
      "publication_date": 20180414
    },
    {
      "title": "Lightly scented",
      "text": "Have bought this several times for the ladies in my family and for me. Lightly scented and feels good on the skin. Really good for older ladies too! They love the scent because it is not too strong. Smooth texture and feels emollient! This is a winner for holiday and birthday presents!",
      "rating": 5.0,
      "verified": true,
      "author": "B3loyalist",
      "helpful_votes": 2,
      "publication_date": 20171203
    },
    {
      "title": "Divine Scent!",
      "text": "A wonderful, all-over moisturizer--the scent is heavenly, the texture is terrific.",
      "rating": 5.0,
      "verified": true,
      "author": "Cynthia S.",
      "helpful_votes": 2,
      "publication_date": 20190826
    },
    {
      "title": "My all time favorite lotion!",
      "text": "My all time favorite lotion!! I generally get the raspberry or strawberry scents, and they smell divine! The lotion keeps your skin feeling great, without it feeling greasy. The only downside is that it is a bit pricey, but that is probably because of the quality products that they use to create it. I feel good about putting this on my body.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180530
    },
    {
      "title": "Good moistureizer",
      "text": "For me, a great product for the following reasons: 1. Good moisturizer. I use it instead of body lotion. 2. Long lasting. 3. Wonderful clean fragrance. 4. Good for dry shin with outdoor exposure. 5. Company has a wide variety of products with numerous scents.",
      "rating": 5.0,
      "verified": true,
      "author": "C in Yakima",
      "helpful_votes": 6,
      "publication_date": 20160723
    },
    {
      "title": "Body butter",
      "text": "Best body butter ever. I would recommend this product to anyone that had dry skin. Great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Dorothy B. Yeich",
      "helpful_votes": 4,
      "publication_date": 20171112
    },
    {
      "title": "The truest mango butter there is!",
      "text": "I love Mango Butter more than anything on the earth. Living in Hawaii I know a thing or two about mangos! I've tried 5 different brands and this one absolutely takes the juicy mango cake! You won't regret it--its also heavenly thick and a lot goes a long way. The scent also lasts the longest of all the others I've tried. Love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Never Compromises",
      "helpful_votes": 0,
      "publication_date": 20200521
    },
    {
      "title": "Amazing body butter!!",
      "text": "Best body butter I’ve used for several years now. The scent is a slightly sweet strawberry scent and I always get asked what I’m wearing when I put this on. I put this on right after i shower to retain the moisture and it does an excellent job. Completely absorbs into the skin and does not leave a sticky residue. One container can easily last me over a month if used daily. I’ve tried other scents by the body shop but always go back to this one. Best body butter out there for your money!!",
      "rating": 5.0,
      "verified": true,
      "author": "Andrea",
      "helpful_votes": 0,
      "publication_date": 20190810
    },
    {
      "title": "Subtle smell. Great moisturizer.",
      "text": "Pretty good. I prefer to have a stronger smelling lotion. I love fruity scents and flower scents. I thought this one would smell sweet. It’s a very light scent. Great for someone who does not like a strong scent. Or for pregnant women who are sensitive to strong smells, this will be perfect. It is moisturizing and fast absorbing.",
      "rating": 5.0,
      "verified": true,
      "author": "Elisa",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "I love this stuff!",
      "text": "I initially discovered The Body Shop butters at Ulta. I saw that there was a coconut version so I immediately tested it out. I was pretty amazed at how it felt on my skin. I frequently need moisture on my upper arms, however most lotions just seems like flavored water. This, on the other hand, applies smoothly and makes your skin feel great. I recommend using it before bed. I also recommend buying it from here instead of Ulta, because you pay 6 dollars less (as of this moment in time.) One last note - the coconut scent is out of this world. It smells like sun tan lotion or a coconut sno-cone, which is pleasant and calming.",
      "rating": 5.0,
      "verified": true,
      "author": "William Sebren",
      "helpful_votes": 0,
      "publication_date": 20150610
    },
    {
      "title": "Smells divine",
      "text": "Probably my new favorite scent. I never light rose send it anything growing up and I decided trying it recently and I love it. It’s definitely different from any resent I’ve ever smelled. It arrived on time and well packaged, incredibly moisturizing.",
      "rating": 5.0,
      "verified": true,
      "author": "Krisie",
      "helpful_votes": 0,
      "publication_date": 20200506
    },
    {
      "title": "The best",
      "text": "This body butter is a staple in my routine and always apply it after showering. It works great for dry winter skin. I usually purchase from Ulta where it's $20 and since I go through them quickly I was very happy when I found it on here for $17. It came quicker than expected and I will continue to purchase it through amazon. BUT- and this isn't that big of an issue to me but I know it will be to some people, it did not come with a seal. You just open the lid and the product is there. So if you're worried about germs and contamination you might want to order another lotion.",
      "rating": 5.0,
      "verified": true,
      "author": "Olivia",
      "helpful_votes": 2,
      "publication_date": 20150507
    },
    {
      "title": "Is it me or is something missing?",
      "text": "The container was only half full upon opening. Even when I evened out the product, it was still less than a full container, even with taking into account the total volume of the container. Great scent and moisturizing but I would like a full container!!",
      "rating": 3.0,
      "verified": true,
      "author": "RevB",
      "helpful_votes": 0,
      "publication_date": 20200629
    },
    {
      "title": "Love,love,love!!!!",
      "text": "I first rcv’d this body butter as a Xmas present with a bunch of other yummy things from The Body Shop, from my daughter. I loved this so much I ordered more. My husband tells me on the daily how good I smell and how soft my skin is. The Almond Milk & Honey one, I’m totally addicted to. I’m going to try another fragrance. Try this, you will be in love!!! Only downfall is that there isn’t enough body butter in the container!",
      "rating": 5.0,
      "verified": true,
      "author": "Jayden's Yeyo",
      "helpful_votes": 0,
      "publication_date": 20180408
    },
    {
      "title": "Not Authentic",
      "text": "I have been buying this body butter for a while. This product is thinner and does not smell the same. I don’t believe it to be the authentic body butter from The Body Shop. It also wasn’t sealed, either. Returning...",
      "rating": 1.0,
      "verified": true,
      "author": "Jeffrey Day",
      "helpful_votes": 2,
      "publication_date": 20200609
    },
    {
      "title": "I think it is a fake",
      "text": "Pretty sure this is a knock off. I have The Body Shop grapefruit body butter and that is exactly what it is like - butter. It is wonderful! The strawberry body butter that came is like someone squeezed strawberry lotion into the container - so disappointing.",
      "rating": 1.0,
      "verified": true,
      "author": "Kendra A.",
      "helpful_votes": 0,
      "publication_date": 20200717
    },
    {
      "title": "Love this body butter!",
      "text": "This is my go-to for moisturizing skin, especially when I've been gardening or having my hands in water too much!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200621
    },
    {
      "title": "My favorite The Body Shop product",
      "text": "I absolutely love this product. The heavy citrus scent is my favorite of all The Body Shop products, so much so that I consider it my signature scent. The lotion feels rich and luxurious and really softens skin. I've been buying this product loyally for about 15 years now.",
      "rating": 5.0,
      "verified": true,
      "author": "Adam Hansen",
      "helpful_votes": 0,
      "publication_date": 20190816
    },
    {
      "title": "So Good Need More",
      "text": "So good! Love it and am going to buy the bigger container because I am almost out of it, that’s how great this lotion/brand is. Seriously, it’s silky softness at it’s best, I can never get enough of it, and I’ve already converted my step mom and 6 yr old sister. Now just need to convert the father.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisy",
      "helpful_votes": 0,
      "publication_date": 20191014
    },
    {
      "title": "Disappointed",
      "text": "Bought it for the wife she loved it but someone shipping it didn’t pack it right blew up in the box had to return it couldn’t salvage it",
      "rating": 5.0,
      "verified": true,
      "author": "New Utrecht Ave",
      "helpful_votes": 0,
      "publication_date": 20190811
    },
    {
      "title": "Very moisturizing.",
      "text": "I love this cream. It smells wonderful, and is very moisturizing. I have sensitive skin, and it does not irritate my skin.",
      "rating": 5.0,
      "verified": true,
      "author": "AB",
      "helpful_votes": 0,
      "publication_date": 20200606
    },
    {
      "title": "Not the body butter you know and love...",
      "text": "I had hoped enough time had passed for Amazon to remedy the complaints, but no. The lid was completely off when I opened the box AND the container was not full. The consistency was also rubbery and not at all like that of the body butter from the Body Shop. Don't waste your time here. Buy from the Body Shop - at least you know what you are getting.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200513
    },
    {
      "title": "Body Butter at it's best!",
      "text": "If you like Satsuma this is Satsuma at it's best. The body butter is creamy smooth and nicely scented but not overpowering. It is not sticky at all and it's high heat & humidity here right now in Kentucky. So pleased with my purchase. Will definitely buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "M. West",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "Excellent except for the scent",
      "text": "Same as the body wash - it’s not a real rose scent it’s the sweet child-like rose smell. It’s ok and I’ll finish it but I’ll look elsewhere for a better scent. Very creamy and nourishing! If the scent was better it’d be gold!",
      "rating": 4.0,
      "verified": true,
      "author": "Val (Bubbles)",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "Love this stuff - but it arrives with the lid off",
      "text": "So be sure to use Prime One Day, or you'll get a box of delicious-smelling mango grease smear.",
      "rating": 5.0,
      "verified": true,
      "author": "KoJones",
      "helpful_votes": 0,
      "publication_date": 20200605
    },
    {
      "title": "What a waste...smells awful.",
      "text": "I was disappointed with the size and unhappy with the scent. I’m glad I found some winter candy apple body butter in a larger jar from Bath and Body Works and ordered that instead. I’m going to have to put this upstairs in our guest bathroom, give it away, or throw it out. It’s a waste.",
      "rating": 3.0,
      "verified": true,
      "author": "Andrea S.",
      "helpful_votes": 0,
      "publication_date": 20190920
    },
    {
      "title": "A Rose Scent",
      "text": "I have known this scent three years now and I keep a handy supply nearby. I love its delicate scent and the soft feel on the skin. It is like giving skin a little water to drink.",
      "rating": 5.0,
      "verified": true,
      "author": "Estrella",
      "helpful_votes": 0,
      "publication_date": 20181213
    },
    {
      "title": "Packaging was damaged.",
      "text": "The product was great and exactly what I ordered, but then I took the body butter out of the box I found that the bottom of the container was cracked. I had to move all of the body butter into another container.",
      "rating": 3.0,
      "verified": true,
      "author": "Emily Darjany",
      "helpful_votes": 4,
      "publication_date": 20170915
    },
    {
      "title": "Works as perfume, too!!",
      "text": "Love the smell better than perfume and lasts 2x as long and softens my elbows and hands just fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Gretchen O'Donnell-Skaggs",
      "helpful_votes": 0,
      "publication_date": 20190825
    },
    {
      "title": "Smells rotten and old",
      "text": "Smells like rotten grapefruit, not at all like The Body Shop typical pink grapefruit scent at all. There wasn’t a seal on the container at all, and it had a weird consistency. Returned immediately.",
      "rating": 2.0,
      "verified": true,
      "author": "Amanda Worthington",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Not a body butter",
      "text": "Frustrated, as this is definitely not a ‘body butter’ its more of a whipped lotion....",
      "rating": 1.0,
      "verified": true,
      "author": "brendan mosley",
      "helpful_votes": 3,
      "publication_date": 20190717
    },
    {
      "title": "Smells like summer!",
      "text": "I love the body shop body butters. I use them daily, and they make my skin soooo soft! The coconut is my favorite scent, but I love them all!",
      "rating": 5.0,
      "verified": true,
      "author": "Megan",
      "helpful_votes": 0,
      "publication_date": 20190607
    },
    {
      "title": "Fully Satisfied.",
      "text": "One of my friends recommended me this product. As I had moved from a humid to a very dry area, I was very having very itchy skin. This not only keeps my skin hydrated but I am free from itchy skin. And, I love its scent too. It feels you put perfume in your body.",
      "rating": 5.0,
      "verified": true,
      "author": "Subash Pandey",
      "helpful_votes": 0,
      "publication_date": 20200906
    },
    {
      "title": "The Best!",
      "text": "I absolutely love this product as it has kept my skin moisturized under some of the harshest winter conditions. The smell is excellent and it glides on to your skin without leaving any sort of residue. I’d also like to add that I have sensitive skin and have had no issues with this product. Will continue to purchase without hesitation.",
      "rating": 5.0,
      "verified": true,
      "author": "Issa Lee-Hall",
      "helpful_votes": 0,
      "publication_date": 20190102
    },
    {
      "title": "Don’t waste your money! Almost empty!",
      "text": "The container was almost empty! Such a waste of money! Terrible product!",
      "rating": 1.0,
      "verified": true,
      "author": "V",
      "helpful_votes": 3,
      "publication_date": 20190504
    },
    {
      "title": "Great product, smooth skin",
      "text": "Love the smell, leaves a great skin feeling without the oily feeling. Should be sealed a little tighter for shipping, both I purchased came almost open and could have spilled everywhere in the package.",
      "rating": 5.0,
      "verified": true,
      "author": "AD",
      "helpful_votes": 0,
      "publication_date": 20200618
    },
    {
      "title": "The Best!",
      "text": "This is by far my favorite lotion! The scent is beautiful and the feel is even better. It is so moisturizing, but does not leave you feeling sticky or oily. I have SUPER SENSITIVE skin but this product has never irritated me in the slightest.",
      "rating": 5.0,
      "verified": true,
      "author": "julie",
      "helpful_votes": 4,
      "publication_date": 20170905
    },
    {
      "title": "Love this stuff",
      "text": "Love the scent and keeps my skin moisturized. So much better than the bath and body lotion.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah A",
      "helpful_votes": 0,
      "publication_date": 20190618
    },
    {
      "title": "The only way to moisturize your skin.",
      "text": "This product is the best on the market when it comes to moisturizing the skin. I have also found it fun to mix two of the Scented products . People always ask what I’ve got on.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark J Dunn",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "Bottom exploded and broke in transport",
      "text": "So sad I love this product but when it arrived it was broken on the bottom and there was lotion everywhere I had to move into tupelware cuz The product was still good but it must of been dropped cuz it like exploded in the package I was so upset :(",
      "rating": 2.0,
      "verified": true,
      "author": "Miestro ",
      "helpful_votes": 0,
      "publication_date": 20200908
    },
    {
      "title": "Super Amazeballz!",
      "text": "A great product, great price. Leaves your skin smoother than a babies butt, smells amazing and not too heavy. Mix it with Hemp Lotion and you won’t go wrong!",
      "rating": 5.0,
      "verified": true,
      "author": "Nichola Fitzsimmons",
      "helpful_votes": 0,
      "publication_date": 20181128
    },
    {
      "title": "Not sealed",
      "text": "Love the smell and the feel and what it does to my skin. But...... it was just rolling around in an over sized box. not packed, and when I opened it, butter was all over the lid. plus no blister seal. you know the plastic seal on the top that you peel back. Why. Is that how it is packed? seemed like some was gone ,like it wasnt full I wanted to weigh it.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180915
    },
    {
      "title": "Smallest, yet best smelling body butter",
      "text": "I’m so torn about this. It smelled so divine. I love everything rose. it was the tiniest little container I have ever seen in my life. I don’t think it’s survived past one use. And it was pretty expensive considering",
      "rating": 3.0,
      "verified": true,
      "author": "katiekat",
      "helpful_votes": 0,
      "publication_date": 20181215
    },
    {
      "title": "Great product for me!!",
      "text": "This is my second jar of BS mango body butter. It smells so pleasant, smooths on and moisturizes nicely!! Will continue to use as my after-shower body moisturizer. I’m 68 and I find everything about this product very useful to me!! Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "brendesou",
      "helpful_votes": 0,
      "publication_date": 20200222
    },
    {
      "title": "Just exactly what rose lotion should smell like. Light and feminine",
      "text": "Lovely floral scent - not too strong, not \"grandma potpourri\" strong either. Just exactly what rose lotion should smell like. Light and feminine.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary",
      "helpful_votes": 2,
      "publication_date": 20180118
    },
    {
      "title": "Not The Best",
      "text": "Was not expecting this stuff to be like noxema in consistency... I have used the other Body Shop body butters and they were smooth and creamy. The texture is more pasty until you really rub it in. Non scented really and that is ok. Worked good enough... Used it on vacation to soothe skin after being in sun. Would not purchase again though. Will use the Coconut Body Shop butter instead... Not only does it have a smoother texture it smells really nice.",
      "rating": 2.0,
      "verified": true,
      "author": "Lostie in Chicago",
      "helpful_votes": 2,
      "publication_date": 20150419
    },
    {
      "title": "I’m addicted",
      "text": "This stuff is amazing and the company isn’t human crap like some exploitive companies. Scent is great, not too strong. The quality control is on point. I always have a tub in my bathroom for leg shaving day... and smooth skin day...",
      "rating": 5.0,
      "verified": true,
      "author": "Kate Lucas",
      "helpful_votes": 0,
      "publication_date": 20190502
    },
    {
      "title": "Really nice butter",
      "text": "Read some negative reviews, but have purchased previously at Body Shop store. Product was exactly the same: smooth, creamy and filled to the same level as in store.",
      "rating": 5.0,
      "verified": true,
      "author": "Ben M",
      "helpful_votes": 0,
      "publication_date": 20190408
    },
    {
      "title": "Huge Disappointment",
      "text": "I’ve purchased Body Shop coconut body butter many times and love the Body Shop Body butters. This “body butter” is a big disappointment and will likely result in my not purchasing this item from Amazon in the future. When the package arrived, the item was not sealed whatsoever and the lid was off. There was no coconut scent. The consistency was off. When I tried it on my hands, the product was flakey and difficult to absorb. All in all, there are no redeeming qualities. Big disappointment.",
      "rating": 1.0,
      "verified": true,
      "author": "Anita Nemick",
      "helpful_votes": 0,
      "publication_date": 20201013
    },
    {
      "title": "Nothing is better than this lotion!",
      "text": "This has been my favorite lotion for years! There is nothing that compares. From the texture, to the scent it’s amazing. A true drink for your skin. Best moisturizer out there. I always get compliments on my soft, healthy looking skin- it’s truly a result of this lotion.",
      "rating": 5.0,
      "verified": true,
      "author": "Erin A. Lickteig",
      "helpful_votes": 0,
      "publication_date": 20190629
    },
    {
      "title": "Soothing for Feet Neuropathy",
      "text": "Soothing for all parts of the body, especially those affected by chemo induced neuropathy!",
      "rating": 5.0,
      "verified": true,
      "author": "Putz",
      "helpful_votes": 0,
      "publication_date": 20190620
    },
    {
      "title": "Delicious scent & superior to lotion",
      "text": "I'm a bit late to the body butter party, but am I glad I've arrived! I purchased the coconut body butter which has a really subtle scent that's more sweet than tropical. The cream seems like it will go on greasy but it quickly absorbs into the skin leaving it feeling luxurious and smooth. It's too early to tell exactly how long the container will last, but I imagine it'll be good for at least 2 months. Highly recommended for its moisturizing properties and scent.",
      "rating": 5.0,
      "verified": true,
      "author": "E. Aldworth",
      "helpful_votes": 0,
      "publication_date": 20150508
    },
    {
      "title": "Nice Hand Cream",
      "text": "I use the Aloe Body Butter to help with dry skin and cracking on my hands in the winter. It works great and isn't greasy once it's rubbed into the skin.",
      "rating": 5.0,
      "verified": true,
      "author": "David Regan",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "Love everything about this!",
      "text": "Great moisturizer, plus scent really smells like fresh picked strawberries. My son would buy me gift packages with this in it. I have continued ordering for self since he passed away. Scent makes me feel so happy, remembering him.",
      "rating": 5.0,
      "verified": true,
      "author": "ChristopherRobin",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "A little goes a long way",
      "text": "This is a great lotion. It’s thick and you do t need to use a lot. Smells great, not too strong.",
      "rating": 5.0,
      "verified": true,
      "author": "Michele F",
      "helpful_votes": 0,
      "publication_date": 20190516
    },
    {
      "title": "Love this stuff",
      "text": "I love this stuff!!! I have been using it for ages and am so glad I can get it on subscribe and save!!! It is lovely and smooth, smells good and makes my skin feel great and isn't too greasy.",
      "rating": 5.0,
      "verified": true,
      "author": "kate kipling",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "Unsealed...",
      "text": "Love the product but this butter wasn't sealed and it didn't have the inner seal either...It seems like it has been open for awhile..fragrance is off...Going to return it",
      "rating": 1.0,
      "verified": true,
      "author": "Lisa",
      "helpful_votes": 7,
      "publication_date": 20160229
    },
    {
      "title": "Great product",
      "text": "I have used for years! First time from this vender, packaging and product was great! Bought the mango and coconut body butter",
      "rating": 5.0,
      "verified": true,
      "author": "Cristi",
      "helpful_votes": 0,
      "publication_date": 20200613
    },
    {
      "title": "Smells so strong!",
      "text": "When I bought this I thought it would be more like an organic product with natural smell. But this is so perfumey and strong! The cream is ok. It's not oily or sticky but it's not enough for my skin. I have eczema, so this cream doesn't do it for me. When I wake up in the morning my skin is dry again.",
      "rating": 3.0,
      "verified": true,
      "author": "Beenana",
      "helpful_votes": 2,
      "publication_date": 20160622
    },
    {
      "title": "Delivered with an open lid",
      "text": "The lid of the container was removed and sitting separately with the product (body butter) exposed in the delivery box when it arrived.",
      "rating": 1.0,
      "verified": true,
      "author": "Calico",
      "helpful_votes": 2,
      "publication_date": 20200606
    },
    {
      "title": "Lovely Bodybutter",
      "text": "This body butter had a nice scent that is not too overbearing. It makes your skinn feel soft and moisturized without being to greasy. I love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Shoe Guru",
      "helpful_votes": 0,
      "publication_date": 20191103
    },
    {
      "title": "Runny. What's up with that",
      "text": "This was not like the others I have used at all. It was funny and not creamy.",
      "rating": 2.0,
      "verified": true,
      "author": "Candi",
      "helpful_votes": 2,
      "publication_date": 20180916
    },
    {
      "title": "Smells great!",
      "text": "Love the scent and the lotion. I currently have one and thought this was the same... this little guy is teensy. Me not reading details but I was still disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "mk",
      "helpful_votes": 0,
      "publication_date": 20191117
    }
  ],
  "product_meta": {
    "title": "The Body Shop Mango Body Butter, 13.5 Ounce (Pack of 1)",
    "description": "Flavor Name:Mango| Size:13.5 OunceOur super-rich and creamy Body Butter is a feast for the skin. It melts straight in to leave skin feeling soft and smooth. It contains Community Trade cocoa butter and has an exotic mango scent.\n\nFROM THE MANUFACTURER\nQuench your skin with juicy moisture, with The Body Shop's skin-softening Mango Body Butter, perfect for around the clock hydration. Reveal silky-soft, hydrated skin after every use. Gluten-free.",
    "rating": 4.6,
    "feature_bullets": [
      "Escape to the tropics with our Mango Softening Body, perfect for round the clock hydration.",
      "Reveal silky-soft, hydrated skin after every use.",
      "For dry skin.",
      "24hr hydration.",
      "Mango seed oil."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "4.13 x 4.13 x 3.15 inches; 13.5 Ounces",
      "Item model number": "1099845",
      "Manufacturer": "The Body Shop",
      "ASIN": "B00VCMO9U2",
      "Domestic Shipping": "Currently, item can be shipped only within the U.S. and to APO/FPO addresses. For APO/FPO shipments, please check with the manufacturer regarding warranty and support issues.",
      "International Shipping": "This item is not eligible for international shipping.",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Moisturizers",
      "Skin Care",
      "Body",
      "Beauty & Personal Care",
      "Body Butter"
    ],
    "price": 36.0
  }
}