{
  "website_summaries": [
    {
      "verdict": "An impressive battery-powered leaf blower that delivers air speeds of over 130 miles per hour.",
      "pros": [
        "This easy-to-assemble powerhouse leaf blower is capable of delivering up to 507 cu",
        "ft. of air per minute",
        "The lightweight design coupled with the ergonomic handle allow the user to work comfortably for extended periods of time"
      ],
      "cons": [
        "Some users felt that the battery life wasn't quite as long as stated"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Quiet, powerful but didn't last...",
      "text": "I own an Oregon pole saw so i got this without battery and charger, cheaper that way so they can share. Great blower - quiet, powerful, long lasting. Gas blowers are way more, louder etc. Very happy with this unit. Update - used it 2 months this past fall, 2 months this spring, the trigger is no longer working, bummer. Battery is still super strong but blower may not be as well made as expected....",
      "rating": 3.0,
      "verified": true,
      "author": "greg kiger",
      "helpful_votes": 15,
      "publication_date": 20171118
    },
    {
      "title": "Powerful",
      "text": "It is definitely heavier than our corded blower, but the great 40v battery puts out plenty of wind. I haven't run down the battery yet, but I do have Oregon's chainsaw (for 3 years now) which uses the same 40v batt, and typically get 30-40 minutes of cutting time before needing a recharge. I expect this blower will not use nearly the amps of the saw. Plus now I have 2 batteries. The unit is compact and has a 'Turbo' button that will blast the gravel off your driveway...so easy does it! Like all Oregon products, the quality is here and I am glad I purchased this blower...and the chainsaw, too. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "cappy102",
      "helpful_votes": 2,
      "publication_date": 20190412
    },
    {
      "title": "Get the 6 Ah battery",
      "text": "Love the blower. It’s quiet and powerful. That said, I have two concerns. I ordered the 6 Ah battery, but they sent the 4 Ah. Amazon quickly refunded the difference in price, so that was great. The problem with the 4 Ah battery is that it only lasts 12 to 15 minutes before it’s dead. The 6 Ah would give you closer to 20 minutes. The turbo feature is awesome. You can move wet leaves with ease, but it eats the battery life fast, so use it sparingly. I’d rate this 5 stars if I could get 30 minutes of use. I’d be sick of leaf blowing by then. Happy to take a break by then. 😊",
      "rating": 3.0,
      "verified": true,
      "author": "Sailfish55",
      "helpful_votes": 4,
      "publication_date": 20181121
    },
    {
      "title": "Very Disappointed",
      "text": "My wife and I are Very disappointed in the fact that after only using on the turbo setting for approximately 20 minutes, the battery completely depleted. My wife and I have tried battery-powered blowers in the past and thought that this one would be different regarding battery longevity because it is a much 6.0 AH Battery but we were mistaken. Time to purchase a gas-powered leaf blower.",
      "rating": 1.0,
      "verified": true,
      "author": "Fitnes1408",
      "helpful_votes": 2,
      "publication_date": 20191111
    },
    {
      "title": "So far so good",
      "text": "Wasn't quite sure about this purchase but so far it's been worth it. I've used it 3 times this fall here in New England and it makes pretty quick work of clearing my driveway (it's a long one) and my deck and porch. I get about 20 minutes of use before the battery goes. I have another battery for my Oregon chainsaw so I can keep working while re-charging the first one. Have tested the turbo and it works really well but so far I haven't had a need for it. The regular power moves leaves, acorns and twigs without issue. (My only surprise was that I thought Oregon was American-made. Was surprised to see China on the box).",
      "rating": 4.0,
      "verified": true,
      "author": "T. T. Ross",
      "helpful_votes": 2,
      "publication_date": 20191019
    },
    {
      "title": "Awesome!",
      "text": "I am so glad I bought this. I have the Oregon chainsaw and pole saw (both of which are great btw). Of course it doesn't have the power of a gas or plug in blower but it is so convenient. I have found that the turbo mode provides enough power for heavy duty stuff. The battery seems to last really well just using the regular power. I even take this up on the roof and blow out the gutters.",
      "rating": 5.0,
      "verified": true,
      "author": "a student of life",
      "helpful_votes": 0,
      "publication_date": 20191028
    },
    {
      "title": "The switch acts up before the first season is over.",
      "text": "I love cordless appliances. Got tired of having old gas plug up the carburetor, and having to fix tools frequently. Also, much less noise with battery powered devices. Very please with the power of this blower, and much lighter than many others. This one has a variable speed switch, which worked well for the first couple of months. After that, a partial depression of the switch would work for a couple of seconds, then shut off. A full depression of the switch does nothing, until you wiggle the switch around a bit, then goes on full power. Poor quality switch. Also, it takes a good couple of hours to charge the battery, so plan on charging between projects, not during.",
      "rating": 3.0,
      "verified": true,
      "author": "Val",
      "helpful_votes": 0,
      "publication_date": 20181120
    },
    {
      "title": "0 Ah Battery Pack and Standard Charger is to date one of my best investments. The blower is more powerful than expected",
      "text": "The Oregon Cordless 40V Max BL300 Blower Kit with 4.0 Ah Battery Pack and Standard Charger is to date one of my best investments. The blower is more powerful than expected, it moves even wet leaves when used properly. The light weight and maneuverability is spot on for sweeping, especially with the variable speed control.",
      "rating": 5.0,
      "verified": true,
      "author": "Rehsawg",
      "helpful_votes": 0,
      "publication_date": 20180423
    },
    {
      "title": "Oregon Cordless BL300 40V 151 MPH Leaf Blower",
      "text": "This blower has all the power you need. Buy the Quick Charger for the batteries. The blower discharge horn needs an accessory tip of smaller diameter to make herding of dry clippings and leaves easier. I do recommend the blower et.al. Oregon products.",
      "rating": 5.0,
      "verified": true,
      "author": "Donald R. Hames",
      "helpful_votes": 0,
      "publication_date": 20191014
    },
    {
      "title": "I can't believe how great this leaf blower is",
      "text": "I can't believe how great this leaf blower is. It's way more powerful than any of electric or gas blowers that I've had. I can clean leaves in front yard (approx. 50' by 50' grass, driveway and planters), back yard (50' by 100' grass, driveway and planters) without battery needing recharge. I bought extra battery just in case I might need it for extra heavy cleaning. It's a little heavy and using it on turbo really uses up battery buy is so powerful it doesn't take long to clean up both yards (about 3 times quicker than my old blower). I be leave the volume of air ( more than the speed) makes such a big difference.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Jones",
      "helpful_votes": 0,
      "publication_date": 20151020
    },
    {
      "title": "Best blower in my experience of several other brands.",
      "text": "This blower functions much better than expected. It vastly superior to the competing \"DEWALT DCBL790H1 40V MAX 6.0 Ah Lithium Ion XR Brushless Blower\" (failed in a short time, very noisy). The Oregon blower noise is low enough not to require ear protection. I use this blower for clearing a large aircraft apron every day.",
      "rating": 5.0,
      "verified": true,
      "author": "Fledermaus",
      "helpful_votes": 4,
      "publication_date": 20151116
    },
    {
      "title": "It's powerful enough",
      "text": "This my 3rd Oregon cordless product, love them all, easy to assemble, works right away, quiet in between use, the strap is very useful and most importantly it BLOWS ! This is a replacement for a Stihl back pack blower that decided not to start....",
      "rating": 5.0,
      "verified": true,
      "author": "Mariposawizard",
      "helpful_votes": 0,
      "publication_date": 20190701
    },
    {
      "title": "The best electric leaf blower. Period.",
      "text": "Hands down the best electric blower at any price. I bought one. Loved it. Wanted another but was initially too cheap. After some crappy alternates, I bought another Oregon. They are far and away the best.",
      "rating": 5.0,
      "verified": true,
      "author": "greg wilson",
      "helpful_votes": 0,
      "publication_date": 20200925
    },
    {
      "title": "Amazing tool",
      "text": "Great power. Blows leaves out of other plants and ground cover. I would suggest the large battery for the blower.",
      "rating": 5.0,
      "verified": true,
      "author": "spark 112359 2 19394",
      "helpful_votes": 0,
      "publication_date": 20191126
    },
    {
      "title": "Awesome item.",
      "text": "This leaf blower is great for blowing leaves off the deck/porch. It also works for blowing off the pontoon boat, cement patio, and blowing a dusting of snow off the porch. I have not blown the leaves off the entire yard yet, but certainly has the power to do it. Love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Walter",
      "helpful_votes": 0,
      "publication_date": 20200910
    },
    {
      "title": "best battery powered blower around",
      "text": "This is by far the most powerful battery powered handheld blower I've ever seen. The battery life is short when using the turbo mode, but otherwise I have zero complaints. It's a well built, lightweight, ultra powerful blower that allowed me to ditch at least one of my 2 stroke engines. Well worth the investment.",
      "rating": 5.0,
      "verified": true,
      "author": "kahmann",
      "helpful_votes": 4,
      "publication_date": 20150615
    },
    {
      "title": "Great leaf blower",
      "text": "There are several hundred reviews on Amazon about this blower that are very positive and mine is one more. It has exceeded my expectations and I no longer need to bother with my commercial- grade ECHO backpack blower as the Oregon Power unit gets the job done. It has plenty of power to move most debris even without using the \"turbo\" button. I would recommend this to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric",
      "helpful_votes": 3,
      "publication_date": 20160523
    },
    {
      "title": "Superb Tool",
      "text": "This blower resets the category entirely: it's powerful, well balanced, and substantially quieter than gas models. Battery life is surprisingly good, and many tasks can be accomplished at less than full output. As to volume level: at max power this unit sounds very much like a shop vac, meaning a decibel count well under what is produced by eardrum-lacerating two-stroke machines. Yes, the Oregon blower may seem a bit pricey. But if you've been using gas blowers for years, and gritting your teeth through each session, you'll thank yourself (and the manufacturer) every time you pick up this excellent tool.",
      "rating": 5.0,
      "verified": true,
      "author": "Gardener",
      "helpful_votes": 0,
      "publication_date": 20151206
    },
    {
      "title": "Not wise choice",
      "text": "Used with battery and charger that I already had. The battery only runs the blower for a very few minutes. Not a very acceptable blower.",
      "rating": 3.0,
      "verified": true,
      "author": "Maineguth",
      "helpful_votes": 0,
      "publication_date": 20181214
    },
    {
      "title": "Great",
      "text": "I did a lot of research, and talked too landscapers who used these products. With out exception all recommended this company. I love it and would recommend it. I intend to purchase other 40 Volt items.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris A. Hansen",
      "helpful_votes": 3,
      "publication_date": 20160220
    },
    {
      "title": "This is the most excellent Blower i have ever owned",
      "text": "This is the most excellent Blower i have ever owned, it is well built and the controls are easy and awesome.... i will re-write another review in the next year to tell shoppers how well it held up for me. Michael Vinyard",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Vinyard",
      "helpful_votes": 4,
      "publication_date": 20160215
    },
    {
      "title": "Good blower",
      "text": "Great hand held blower. Plenty of power and battery life is plenty for the normal home owner.",
      "rating": 5.0,
      "verified": true,
      "author": "Matt Boswell",
      "helpful_votes": 0,
      "publication_date": 20200902
    },
    {
      "title": "Light- powerful- works perfectly for my purposes",
      "text": "Fast arrival...works great! Very powerful and the perfect \"garage broom\"....",
      "rating": 5.0,
      "verified": true,
      "author": "Randy Robison",
      "helpful_votes": 0,
      "publication_date": 20200904
    },
    {
      "title": "You will like it. High quality",
      "text": "Power Horse! More power than my Stihl gas model, quiet, battery last longer than a tank of gas.",
      "rating": 5.0,
      "verified": true,
      "author": "Willy",
      "helpful_votes": 0,
      "publication_date": 20190704
    },
    {
      "title": "Very easy to use",
      "text": "Works perfectly and very user friendly. I had occasion to contact customer service and they were the best. I am now very brand loyal to Oregon.",
      "rating": 5.0,
      "verified": true,
      "author": "Henry C",
      "helpful_votes": 0,
      "publication_date": 20190125
    },
    {
      "title": "Best Cordless Leaf Blower",
      "text": "So much easier to handle than my plug in blower. Great around the pool after a storm and holds a charge. Shoulder strap so it can hang there while you point it with your arm. Very powerful turbo boost feature. Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "deckart52",
      "helpful_votes": 0,
      "publication_date": 20190824
    },
    {
      "title": "Great blower",
      "text": "Great blower, especially since I already have some Oregon tools using the same battery",
      "rating": 5.0,
      "verified": true,
      "author": "John E Williams III",
      "helpful_votes": 0,
      "publication_date": 20181211
    },
    {
      "title": "Battery is a match with me 'ole pole saw!",
      "text": "wow, I luvit! sory, I just don't know what else to write but it seems like a high quality kik ars item.",
      "rating": 5.0,
      "verified": true,
      "author": "Greg",
      "helpful_votes": 0,
      "publication_date": 20180114
    },
    {
      "title": "Leaf blower.",
      "text": "When I push the blower button it gives me a shock.. I'm going to contact the Oregon company to fix or replace. I think otherwise it's a great machine.",
      "rating": 5.0,
      "verified": true,
      "author": "Code five 360.",
      "helpful_votes": 0,
      "publication_date": 20151103
    },
    {
      "title": "Overall I'm pleased with my Oregon Blower",
      "text": "Overall I'm pleased with my Oregon Blower. My one minor complaint is that the product information stated that when fully charged the 40 volt battery would last 30 plus minutes...my unit when fully charged lasted about 22 to 25 minutes. Other than that its a very good and powerful blower...love the turbo feature!",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20160314
    },
    {
      "title": "Works well but you may want a second battery if you have other Oregon products",
      "text": "Works very well. However, it consumes 4 Ah batter faster than the weed trimmer. I recommend having a second battery if you have more than one Oregon product.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171116
    },
    {
      "title": "This is an amazing blower. It has as much power as my ...",
      "text": "This is an amazing blower. It has as much power as my gas one. I bought it because i was tired of running out of mixed fuel. The other feature is that it has a battery life indicator, press a button on the battery and it gives you a reading of how much usage is left. It is also nicely balanced.",
      "rating": 5.0,
      "verified": true,
      "author": "RCG",
      "helpful_votes": 0,
      "publication_date": 20151022
    },
    {
      "title": "Best blower ever!!",
      "text": "It’s so powerful. It does the job super well. And that it is cordless, it makes it so much easier to use!",
      "rating": 5.0,
      "verified": true,
      "author": "Gabrielle DeMichele",
      "helpful_votes": 0,
      "publication_date": 20200915
    },
    {
      "title": "Excellent tool- cut my time to clean up significantly compared ...",
      "text": "Excellent tool- cut my time to clean up significantly compared to running cords. Has plenty of power. It does use the battery quicker than the pole saw and hedge trimmer but I have a second battery so if needed it is available. Have not needed the second one yet for any of the blowing off of driveway, decks and garage.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160708
    },
    {
      "title": "Blows Milwaukee away get the 6 amp battery 6X40volts equals 240 watt battery.",
      "text": "Power 240 watt battery. milwaukees biggest battery 12X18=216 watt battery compared to 240 watts on power now blower.",
      "rating": 4.0,
      "verified": true,
      "author": "Doofire",
      "helpful_votes": 0,
      "publication_date": 20180823
    },
    {
      "title": "light wight pretty quiet and always ready to go",
      "text": "Wow - cleanup around here is more than just a breeze. :) Fast, light wight pretty quiet and always ready to go.",
      "rating": 5.0,
      "verified": true,
      "author": "L. Quillen",
      "helpful_votes": 0,
      "publication_date": 20160903
    },
    {
      "title": "Great blower that works good but uses up the battery ...",
      "text": "Great blower that works good but uses up the battery in about 20 minutes. That is not so bad because I bought the battery and charger. They work very good also. No problems so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Dana",
      "helpful_votes": 0,
      "publication_date": 20150914
    },
    {
      "title": "Works Awesome / Turbo Power 😃👍🏼",
      "text": "I have been raking up pine needles and other Fall debris and ended up buying this blower so glad I did works awesome on hard to reach areas saves so much time cleaning up - highly recommend / This works awesome",
      "rating": 5.0,
      "verified": true,
      "author": "Rick Nunez",
      "helpful_votes": 0,
      "publication_date": 20151103
    },
    {
      "title": "quick and easy to use",
      "text": "very easy to use, bought for clearing 1/4 mile driveway. have second battery",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191014
    },
    {
      "title": "Primarily use to dry my vehicles after washing vs towel drying.",
      "text": "Great for quick clean up. I primarily use it to dry my vehicles after washing versus using towels.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180814
    },
    {
      "title": "Plenty of power",
      "text": "Plenty of power. A little heavy because of the big battery. Moves so much air that loose clothing could get pulled into the intake, which is on the back of the machine.",
      "rating": 5.0,
      "verified": true,
      "author": "undisclosed",
      "helpful_votes": 0,
      "publication_date": 20160715
    },
    {
      "title": "Love my oregon cordless battery powered chain saw",
      "text": "too heavy for me.. Love my oregon cordless battery powered chain saw.. it is the best",
      "rating": 2.0,
      "verified": true,
      "author": "ranchers wife",
      "helpful_votes": 0,
      "publication_date": 20171202
    },
    {
      "title": "I love it this is the best way to blow leaves ...",
      "text": "I love it this is the best way to blow leaves off your porch steps etc. might end up buying two.",
      "rating": 5.0,
      "verified": true,
      "author": "John D. Atherly",
      "helpful_votes": 2,
      "publication_date": 20160328
    },
    {
      "title": "good",
      "text": "the air intake is in the back of it so I have to hold it out so it don't suck my clothes in",
      "rating": 4.0,
      "verified": true,
      "author": "ronald lovern",
      "helpful_votes": 0,
      "publication_date": 20200920
    },
    {
      "title": "Awesome blower!",
      "text": "I absolutely LOVE this blower. It is powerful yet I am able to slow the motor down for delicate areas of the garden. I love not having a cord to drag around. I have used it 10 times and will not go back to the power corded ones.",
      "rating": 5.0,
      "verified": true,
      "author": "nancy west",
      "helpful_votes": 0,
      "publication_date": 20150920
    },
    {
      "title": "It is great not to have gas fumes wafting up as I ...",
      "text": "The blower does have power that's fairly close to my Stihl 56 2-stroke machine.However,it does seem to \"cut out\";i.e. the power level oscillates.I've yet to call Oregon regarding this,I'll re-post after I do.It is great not to have gas fumes wafting up as I blow,and it does move debris fairly well;however,it's a stretch to call it \"commercial grade\".To me, it's a blower that should be priced between $150-$200,which would put it at a similar price point as a good gas powered handheld(i.e. Stihl,Echo.Husqvarna).Maybe I should have checked out Shindaiwa's new battery blower;$400 but has a 56 volt battery along with the fact that Shinny's been making commercial grade equipment for a long time.",
      "rating": 3.0,
      "verified": true,
      "author": "Frank Swift",
      "helpful_votes": 2,
      "publication_date": 20170228
    },
    {
      "title": "Four Stars",
      "text": "It only runs 10 to 15 min on high battery didnt last long",
      "rating": 4.0,
      "verified": true,
      "author": "KENNA URFER",
      "helpful_votes": 0,
      "publication_date": 20170824
    },
    {
      "title": "Battery run time is good, even at full power",
      "text": "Powerful air stream, really works well. Battery run time is good, even at full power. Batteries are expensive.",
      "rating": 5.0,
      "verified": true,
      "author": "Harry Flora",
      "helpful_votes": 0,
      "publication_date": 20180330
    },
    {
      "title": "Quick delivery and this is an excellent tool. I even enjoy using it",
      "text": "Quick delivery and this is an excellent tool. I even enjoy using it. It has a lot of power and you can control the blowing power down to a small breeze or start and stop as needed.",
      "rating": 5.0,
      "verified": true,
      "author": "Larry Harris",
      "helpful_votes": 0,
      "publication_date": 20151021
    },
    {
      "title": "Five Stars",
      "text": "Love this little guy! Exactly what you need for clearing the deck or patio.",
      "rating": 5.0,
      "verified": true,
      "author": "Edward M. Tobin",
      "helpful_votes": 0,
      "publication_date": 20150527
    },
    {
      "title": "Amazing. Surprised at first use.",
      "text": "Owned many leaf blowers over 35 years. This kicks a$$. Hands down. Pricey but well well worth it. 1st time use, wet thick heavy leaves, 4500 sq ft driveway done 9 minutes. Minimal use of battery.",
      "rating": 5.0,
      "verified": true,
      "author": "T. Cavanaugh ",
      "helpful_votes": 0,
      "publication_date": 20181107
    },
    {
      "title": "Excellent purchase!!",
      "text": "I recently purchased this and we are very happy with how it works.",
      "rating": 5.0,
      "verified": true,
      "author": "Mathilda Westerman",
      "helpful_votes": 0,
      "publication_date": 20200607
    },
    {
      "title": "this unit blows.... (well)",
      "text": "I bought this and the 40V Oregon pole saw based on reviews, stats and feedback from buddies. Both work very well. Worth the investment.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170509
    },
    {
      "title": "Five Stars",
      "text": "The Oregon cordless blower is great! It is powerful and lightweight! The battery easily snaps into place!",
      "rating": 5.0,
      "verified": true,
      "author": "Toni mezey",
      "helpful_votes": 0,
      "publication_date": 20170909
    },
    {
      "title": "0 battery works best.",
      "text": "The first one I received quit working soon after. It was replaced quickly. They really blow. 4.0 battery works best.",
      "rating": 4.0,
      "verified": true,
      "author": "T. Burns",
      "helpful_votes": 0,
      "publication_date": 20180317
    },
    {
      "title": "this blower was great only problem was that the battery only lasted about ...",
      "text": "this blower was great only problem was that the battery only lasted about twenty minutes of continuous blowing and that did not work fort the number of trees we had. It would be great for a city yard with a couple of trees.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20151107
    },
    {
      "title": "Does a much better job than my old blower",
      "text": "Wow, Power to spare. Fast charge. Does a much better job than my old blower.",
      "rating": 5.0,
      "verified": true,
      "author": "Sandra Conklin",
      "helpful_votes": 0,
      "publication_date": 20151017
    },
    {
      "title": "It's great for medium jobs like blow drying my truck after ...",
      "text": "Not as powerful as my back pack blower but I didn't expect it to be. It's great for medium jobs like blow drying my truck after washing it, etc.",
      "rating": 4.0,
      "verified": true,
      "author": "Carla J. Beckerle",
      "helpful_votes": 0,
      "publication_date": 20170511
    },
    {
      "title": "Five Stars",
      "text": "This blower beats out my old electric black and decker by a mile!",
      "rating": 5.0,
      "verified": true,
      "author": "Brenda J. Michanczyk",
      "helpful_votes": 0,
      "publication_date": 20150719
    },
    {
      "title": "This blower is on the big side and little heavy ...",
      "text": "This blower is on the big side and little heavy but really blows the leaves, wish battery life was longer 14 to 20 mins on usage, however for my applications this works for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Larry W",
      "helpful_votes": 0,
      "publication_date": 20150528
    },
    {
      "title": "I am very happy with this blower for what we bought it for ...",
      "text": "Used this unit a few times for blowing leaves and debris from a concrete patio and cedar deck. It is surprisingly powerful, especially in the \"Turbo\" mode. However, in the turbo mode the battery does drain faster than it's normal operating mode, but this is to be expected. I am very happy with this blower for what we bought it for - a quick and easy way to just pick up the blower & clean up around our home without having to mess with gas or a power cord.",
      "rating": 5.0,
      "verified": true,
      "author": "Darrell",
      "helpful_votes": 2,
      "publication_date": 20151122
    },
    {
      "title": "More power than expected",
      "text": "Works great for an electric blower. Much more powerful than I expected. Easy to start and operate. I love the turbo blast capability.",
      "rating": 5.0,
      "verified": true,
      "author": "deb a",
      "helpful_votes": 0,
      "publication_date": 20160919
    },
    {
      "title": "Outstanding Customer Service",
      "text": "The blower is excellent. Customer service outstanding. I've owned this blower for over a year now and find it unmatched.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeffrey Latterell",
      "helpful_votes": 0,
      "publication_date": 20170110
    },
    {
      "title": "Very powerful",
      "text": "This blower is very powerful. I was able to blow leaves and pine needles out of my house gutters and off my deck with no problem.",
      "rating": 5.0,
      "verified": true,
      "author": "Marsha K. Johnson",
      "helpful_votes": 0,
      "publication_date": 20151020
    },
    {
      "title": "Plenty of power",
      "text": "bought for my husband, he is very satisfied. He doesn't have to pull a rope, and it is quieter than the fuel model.",
      "rating": 5.0,
      "verified": true,
      "author": "Deb Watterson",
      "helpful_votes": 0,
      "publication_date": 20150708
    },
    {
      "title": "My review of the Oregon Cordless 40 Volt Max BL 300 Handheld Blower",
      "text": "The only thing I have against it is that the battery doesn't last very long.",
      "rating": 4.0,
      "verified": true,
      "author": "James W. Burkhalter",
      "helpful_votes": 0,
      "publication_date": 20160319
    },
    {
      "title": "I do like the blower",
      "text": "I already have several oregon tools that use the same battery so the battery cost is shared over several pieces. I do like the blower, but it is heavy and you really need to use the shoulder strap to distribute the weight. I get about an hour of use from the 4 amp battery especially because I use the turbo boast often.",
      "rating": 5.0,
      "verified": true,
      "author": "simpleperson",
      "helpful_votes": 0,
      "publication_date": 20160715
    },
    {
      "title": "Well designed product",
      "text": "I used over a year now. It is well powered and light. Can clear leaves over an acre of land in one sweep. Battery charges in an hour or so. Has worked without any problems.",
      "rating": 5.0,
      "verified": true,
      "author": "NPS",
      "helpful_votes": 0,
      "publication_date": 20160929
    },
    {
      "title": "So much better than gas blowers",
      "text": "Amazing - no choke or fuel to deal with - plenty of power - not to heavy either.... Great - The Wife",
      "rating": 5.0,
      "verified": true,
      "author": "lisa green",
      "helpful_votes": 2,
      "publication_date": 20160113
    },
    {
      "title": "Four Stars",
      "text": "Better than expected, battery could last longer, could be lighter in weight.",
      "rating": 4.0,
      "verified": true,
      "author": "GTH",
      "helpful_votes": 3,
      "publication_date": 20150730
    },
    {
      "title": "Sent back.",
      "text": "It really blows but it would speed up and slow down constantly like the power fluctuated. Returned for a refund.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170601
    },
    {
      "title": "We re so happy with our new battery powered blower",
      "text": "We re so happy with our new battery powered blower! It's incredibly powerful and the battery life is awesome!! Worth every penny!!!👍😊",
      "rating": 5.0,
      "verified": true,
      "author": "Susan Hosking",
      "helpful_votes": 0,
      "publication_date": 20150724
    },
    {
      "title": "Worked 6 times for me....the 7th time it broke.",
      "text": "Over a period of 90 days I used the blower 6 times and the 7th time it completely stopped working. Still trying to find out how to return the thing.",
      "rating": 1.0,
      "verified": true,
      "author": "OHSpidermanfan",
      "helpful_votes": 3,
      "publication_date": 20161204
    },
    {
      "title": "Crappy Blower",
      "text": "I have owned this blower for 2.5 months and it has already stopped working ... ran fine for about 6 weeks ... then it started to sputter on and off. Now it will barely ever engage the motor and blow. Used it probably a total of 10 times ... I was trying to replace my gas operated Stihl blower with something easier that I wouldn't have to winterize ... it was a big mistake! I cannot return item because it's outside of the 30 day window ... $300 purchases should last longer than 2 or 3 months ... I only gave it a one star because it was required ... Zero is more appropriate!",
      "rating": 1.0,
      "verified": true,
      "author": "FoBo",
      "helpful_votes": 5,
      "publication_date": 20161021
    },
    {
      "title": "Two Stars",
      "text": "as described -- battery life isn't 2 minutes more than the data sheet says.",
      "rating": 2.0,
      "verified": true,
      "author": "95014 wilson",
      "helpful_votes": 2,
      "publication_date": 20160208
    },
    {
      "title": "Great product BEST service warranty",
      "text": "Great company to deal with. Oregon and Amazon work together when you have an issue. My blower started running sporadically after 360 days of reliable use. I used it to blow snow ...blow leaves and to blow dust and debris out of the garage. The Amazon folks put me together with the Oregon hotline and they resolved the issue in two steps by sending me first a new battery to see if the battery was the issue, which it wasn't, and then sending me a new blower that works very well and allowing me to keep the second battery which is very handy while letting the other recharge",
      "rating": 5.0,
      "verified": true,
      "author": "Bigsky",
      "helpful_votes": 0,
      "publication_date": 20190221
    }
  ],
  "product_meta": {
    "title": "Oregon Cordless BL300 40V 151 MPH Leaf Blower with 4.0Ah Battery and Charger",
    "description": "Style:4.0Ah Battery Pack IncludedRemove leaves and debris quickly and easily using the Oregon BL300 Cordless Leaf Blower. With air speeds of up to 131.5 mph, this blower allows you to clear your yard, driveway or terrace within minutes. Work comfortably all day thanks to the BL300’s lighter weight and ergonomically designed handle. Since this is a battery-powered tool, you don’t have to deal with the hassle or noise associated with gas-powered blowers. Even at full power, the BL300 is much quieter than gas powered leaf blowers. Part of Oregon’s 40V Max Cordless Tool System, a line of powerful, emissions-free tools. Includes one standard charger and one 4.0 Ah lithium-ion battery which provides up to 90 minutes of run time.",
    "rating": 4.5,
    "feature_bullets": [
      "Brushless motor delivers 507 cfm of air power. Variable speed trigger allows you to operate the blower at speeds of up to 131.5 miles per hour.",
      "The lightweight design and ergonomic handle allow you to work comfortably all day long",
      "Work for up to 90 minutes when the 4.0 Ah lithium ion battery is fully charged",
      "Product can be stored vertically on the wall since it has a hook at its base",
      "Easy to assemble. Simply attach the nozzle to the blower unit."
    ],
    "specifications": {
      "Product Dimensions": "31.25 x 5.5 x 11.5 inches",
      "Item Weight": "8.9 pounds",
      "Manufacturer": "Blount International/Oregon",
      "ASIN": "B00V6SQOP0",
      "Item model number": "572621",
      "Batteries": "1 A batteries required.",
      "Customer Reviews": "4.5 out of 5 stars143 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#64,867 in Patio, Lawn & Garden",
      "Is Discontinued By Manufacturer": "No"
    },
    "categories": [
      "Patio, Lawn & Garden",
      "Leaf Blowers & Vacuums",
      "Outdoor Power Tools",
      "Garden & Outdoor"
    ],
    "price": 246.75
  }
}