{
  "website_summaries": [
    {
      "verdict": "Recommended for petite riders who find traditional bike helmets too large or heavy. Adjustments can be made with a simple pull of the chin strap.",
      "pros": [
        "Stylish design with 16 vents",
        "Tru-fit technology replaces adjustment knob",
        "Easily adjustable",
        "Chin strap includes reflectors"
      ],
      "cons": [
        "Collects sweat like a sponge, not a wick",
        "Head size not easily adjustable",
        "Chin strap is short, does not stay fastened"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great fit",
      "text": "I am really frustrated because I have to poop and my 11 year old daughter is on the toilet. She has the butt of a 60 year old man! Does anyone else experience this frustration? Also, I live in a ground floor apartment and I really think my upstairs neighbors wear cement clogs and shower 9 times a day. How is it possible to make so much noise? I just got back from a bike ride and was looking forward to a relaxing, quiet poop. At least my helmet was comfortable with a good fit!",
      "rating": 5.0,
      "verified": true,
      "author": "Tirado Family",
      "helpful_votes": 18,
      "publication_date": 20190208
    },
    {
      "title": "Pretty nice helmet",
      "text": "Helmet came looking like it has been a returned or something, had some scratches/ dirt on top. But, still works and fits well. Probably wouldn't fit people with bigger heads. Measure yours first! Also, it's more light blue than mint I think",
      "rating": 4.0,
      "verified": true,
      "author": "Vera k",
      "helpful_votes": 69,
      "publication_date": 20150626
    },
    {
      "title": "Great helmet",
      "text": "Really great quality. I definitely feel safe wearing this while riding my bicycle. The sun blocker broke a little but that's my fault, but it could be less delicate.",
      "rating": 5.0,
      "verified": true,
      "author": "Chloe D.",
      "helpful_votes": 18,
      "publication_date": 20160906
    },
    {
      "title": "Too small for humans.",
      "text": "This is too small for any adult person, female or not. There is no size adjustment. The finish is a hideous green and not the mint blue shown on my fone. Is is a matte finish, not gloss, and it shows every little scratch where it was touched. This is the worst thing I ever got on Amazon and I have no way to return it without a printer to print a label. Very disappointed and surprised since Amazon stuff is usually a winner in my book.",
      "rating": 1.0,
      "verified": true,
      "author": "Redhed bich",
      "helpful_votes": 2,
      "publication_date": 20190904
    },
    {
      "title": "Very comfortable, nice color and great price",
      "text": "Not a whole lot else to say about this. It's a very good quality bike helmet, that is lightweight and comfortable, while providing proper protection. If you like the color(s) available, you're going to be hard-pressed to find a better value.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas & Jessii",
      "helpful_votes": 3,
      "publication_date": 20200110
    },
    {
      "title": "No way to adjust for YOUR head size!",
      "text": "This helmet is not worth anything, that is... unless it fits your head perfectly right out of the box. There is no way to adjust the head circumference, no dial on the back like most helmets, only a piece of elastic. This is UNSAFE since a helmet is supposed to be snug on the head. You might as well not a wear one! Or, hope you don't crash wearing this one. That is... unless it fits your head perfectly, and snuggly. It is really ONE SIZE since it is not adjustable.",
      "rating": 2.0,
      "verified": true,
      "author": "LT",
      "helpful_votes": 3,
      "publication_date": 20180617
    },
    {
      "title": "I don't want to know if it works",
      "text": "So, I guess it works, but I hope that I never find out (since it means that my wife took a spill and smashed her noggin). Looks nice, she's got no complaints about comfort...I'm quite happy with the purchase (and more importantly, so is she!).",
      "rating": 5.0,
      "verified": true,
      "author": "GK",
      "helpful_votes": 0,
      "publication_date": 20200422
    },
    {
      "title": "Love it!",
      "text": "This helmet looks great and seems to be great quality. I haven't crashed (knock on wood!) so I'm not sure how impacts would effect it. It does have a strap to keep it tight, however there is no dial to change the tightness, it just has elastic around the back.",
      "rating": 5.0,
      "verified": true,
      "author": "Deanna drury",
      "helpful_votes": 7,
      "publication_date": 20161012
    },
    {
      "title": "Yes",
      "text": "So if this was with rose gold instead of silver I'd ride my bike around like a queen but it does the job for fitting my smaller I would say head (I have a shorter forehead so I wear youth size hats). It adjusted nicely and has been normal level comfortable. Do I feel cool wearing this thing around on my bike? No, however, safety first people. Safety. First.",
      "rating": 5.0,
      "verified": true,
      "author": "MMills",
      "helpful_votes": 0,
      "publication_date": 20180720
    },
    {
      "title": "Way too small",
      "text": "I measured my head, which is on the small-medium size for a woman, to make sure it would fit. I also double checked the measurements listed in the description and ordered with confidence since it stated it could fit heads 1.5” bigger than mine. Unfortunately, it was uncomfortably tight. I tried it on my daughter who has an even smaller head and it was tight on her too, fitting like her old kids helmet. The helmet itself looked good. Just beware that the description is off and it is for a very small head!",
      "rating": 1.0,
      "verified": true,
      "author": "fishymail",
      "helpful_votes": 0,
      "publication_date": 20200730
    },
    {
      "title": "It melted!!!",
      "text": "I liked the helmet when i received it. It was just as expected. However, while using it on my first bike ride i was disappointed to find that when i took it off, it had begun to melt. I live in PA and while we have hot temperatures, it’s nothing so hot that a helmet can’t handle. I returned the item!",
      "rating": 1.0,
      "verified": true,
      "author": "Kendra Nealon",
      "helpful_votes": 2,
      "publication_date": 20190716
    },
    {
      "title": "WAY too small",
      "text": "I'm an average size person, in fact, hats are usually a little big. However, this helmet felt like it was squeezing my brains. I gave it to my 11 year old and she said it was way too tight. So my 9 year old is using it. It seems like a good helmet overall, but the advertised \"14+\" is way off. Color looks just like pictured. It is a matte finish, not glossy.",
      "rating": 2.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200611
    },
    {
      "title": "Mostly comfortable to wear",
      "text": "Mostly comfortable to wear. The visor that is not very functional- does not do much to block out the elements when you're riding yet not detachable. The color is great, however our helmet was delivered with strange scratch/scuff marks on both sides. We were very disappointed, as the helmet was ordered through Prime 2-day shipping with the intent of utilizing it the next day and we were forced to use it instead of being able to return. Overall an okay purchase, may try another brand next time.",
      "rating": 3.0,
      "verified": true,
      "author": "Alex Balinao",
      "helpful_votes": 2,
      "publication_date": 20150814
    },
    {
      "title": "Cool Head Safety!",
      "text": "WOW! What a pretty helmet, and made with great quality materials. The helmet surprised me with a reflector on the back of it, and the ventilation system is just what you need when you’re out there seriously cycling. I have to give a high five to the sun visor on the front of the helmet as well. Great job Thalia!",
      "rating": 5.0,
      "verified": true,
      "author": "Belle Of Texas",
      "helpful_votes": 0,
      "publication_date": 20180907
    },
    {
      "title": "Warning: Very tight elastic",
      "text": "This is a great looking helmet. I really wanted to like it. But it’s got elastic at the back to hold it on your head and it’s not adjustable. I don’t think my head is particularly large, but this helmet was so tight I couldn’t stand it. I can’t imagine trying to wear this helmet with my hair in a braid or angtbing that added a little bit to the size of my head. I had to return it.",
      "rating": 3.0,
      "verified": true,
      "author": "Matthew Tucker",
      "helpful_votes": 0,
      "publication_date": 20180417
    },
    {
      "title": "Seems more for child/teen than women. I don't have ...",
      "text": "Seems more for child/teen than women. I don't have a particularly large head and I have to have the straps as loose as they will go to fit.",
      "rating": 3.0,
      "verified": true,
      "author": "Philip o",
      "helpful_votes": 4,
      "publication_date": 20170407
    },
    {
      "title": "Great helmet.",
      "text": "Fits a little tighter than expected, but is a great helmet and fits. If you have a larger than average head this might be a little small for you. Matches the color of my Schwinn Perla Cruiser perfectly. Visor piece is removable. I trust the Bell brand for helmets for my family. They are well padded and chin straps are very easy to adjust.",
      "rating": 5.0,
      "verified": true,
      "author": "MommyIves",
      "helpful_votes": 0,
      "publication_date": 20180405
    },
    {
      "title": "Size too small",
      "text": "Strap in rear of helmet is sewn in elastic instead of being adjustable, due to this its very uncomfortable and even painful to wear longer than 5 seconds. Recommended for Children to Preteens but not teenagers or adult women (unless you have a small head)",
      "rating": 1.0,
      "verified": true,
      "author": "Daniel Samford",
      "helpful_votes": 0,
      "publication_date": 20181208
    },
    {
      "title": "One size does not fit all",
      "text": "No size is specified but I would call this a small/medium. Padding is relatively thick so shaving down the pads will help fit larger heads. Otherwise a great value.",
      "rating": 4.0,
      "verified": true,
      "author": "Alan M.",
      "helpful_votes": 0,
      "publication_date": 20200201
    },
    {
      "title": "Cute cover",
      "text": "I had two parameters for my first bike helmet: air holes to cool my head and color to match my water bottle. This helmet is lightweight and comfortable. My husband says it’s cute. Sized to fit small to medium heads. Removable visor, adjustable chin strap. I’m happy with my purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "jaspurp",
      "helpful_votes": 0,
      "publication_date": 20180802
    },
    {
      "title": "Great helmet for the money",
      "text": "It’s a good helmet. It’s a little uncomfortable in the back straps. Just takes some work to get them in a good place. Other then that I do enjoy this helmet",
      "rating": 5.0,
      "verified": true,
      "author": "Anna Sonnenberg",
      "helpful_votes": 0,
      "publication_date": 20191013
    },
    {
      "title": "Bike helmet",
      "text": "I like the color & fit on my head BUT the strap is at it's very longest setting & still chokes me a little. I am a regular size woman & the neck strap is simply not long enough!",
      "rating": 3.0,
      "verified": true,
      "author": "Caryn Gilliland",
      "helpful_votes": 0,
      "publication_date": 20191026
    },
    {
      "title": "Light weight well vented",
      "text": "Really love this bike helmet, it's really great...fit is perfect...the color is great match for my new bike...practical and necessary for a safe ride. Added bonus is that it is light weight and well vented and the small sun visor is great.",
      "rating": 5.0,
      "verified": true,
      "author": "MMR",
      "helpful_votes": 0,
      "publication_date": 20180628
    },
    {
      "title": "A little small for my head",
      "text": "It may be too late to return. It's a bit too snug for my head. No adjustable straps (only chin)",
      "rating": 4.0,
      "verified": true,
      "author": "Norge",
      "helpful_votes": 0,
      "publication_date": 20200303
    },
    {
      "title": "This was too small for my 18 year old daughter's head, so she can't wear it.",
      "text": "Too small. Maybe my daughter has an extremely large head? Not sure. Didn't work for her, though.",
      "rating": 3.0,
      "verified": true,
      "author": "R. Marshall",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "Super cute and comfy",
      "text": "Looks great and feels great! My step daughter loves her new helmet",
      "rating": 5.0,
      "verified": true,
      "author": "Meagan Scott",
      "helpful_votes": 0,
      "publication_date": 20200409
    },
    {
      "title": "I was a bit leery of buying a helmet online ...",
      "text": "I was a bit leery of buying a helmet online so was pleasantly surprised to find that this helmet fits perfectly, the color is true to what you see online, and it is a perfectly functional safety net for my brain.",
      "rating": 5.0,
      "verified": true,
      "author": "Glittergirl",
      "helpful_votes": 0,
      "publication_date": 20171002
    },
    {
      "title": "Not adjustable",
      "text": "Couldn’t fit my head (and it isn’t a particularly large head - I can wear normal hats), and couldn’t adjust if my head was smaller either.",
      "rating": 2.0,
      "verified": true,
      "author": "Lauren",
      "helpful_votes": 0,
      "publication_date": 20190719
    },
    {
      "title": "Did not get the product I thought I was going to",
      "text": "I wanted a helmet and to my surprise ended up with this giant bottle of personal lube. I needed this helmet and am very disgusted that I did not receive what I told. What a waste of my money! Now I have to find a new order, mail this back etc..... this was not ok",
      "rating": 1.0,
      "verified": true,
      "author": "Brittnee Schmith",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "Poor quality",
      "text": "The price is average for a helmet and it does the job. Except the clip to secure it already fell off several times. So quality on that end is poor.",
      "rating": 1.0,
      "verified": true,
      "author": "Maldives",
      "helpful_votes": 0,
      "publication_date": 20190515
    },
    {
      "title": "Good helmet! Not adjustable.",
      "text": "Nice helmet! I have used it a few times and it works well. It is not adjustable and I don't think I have a large head, but I had to cut the elastic in the back to make it not press against my forehead with force. Overall, good fit though.",
      "rating": 4.0,
      "verified": true,
      "author": "Allie",
      "helpful_votes": 2,
      "publication_date": 20170512
    },
    {
      "title": "For adult??",
      "text": "It’s advertised as an adult helmet, yet the straps aren’t even long enough for me to buckle it. Fits my 7 year old fine, but not me.",
      "rating": 2.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190831
    },
    {
      "title": "Not big enough for my 12 year old, let alone a grown woman!",
      "text": "This is a good looking helmet. Basically well made, but very small for a woman, or even my 12 year old daughter. I’m going to see if it will fit one of the younger kids in the neighborhood.",
      "rating": 2.0,
      "verified": true,
      "author": "Jen1",
      "helpful_votes": 0,
      "publication_date": 20180710
    },
    {
      "title": "Very happy with this product and the vendor",
      "text": "Very happy with this product and the vendor. The first one arrived damaged (the visor partially broken off) but the replacement was received the next day after I requested it. Seamless return. A great helmet!",
      "rating": 5.0,
      "verified": true,
      "author": "Chadillac",
      "helpful_votes": 0,
      "publication_date": 20180125
    },
    {
      "title": "Its good but..",
      "text": "Great helmet but wife does not use. I think it's because this looks kiddy. I'll get her more mature looking one",
      "rating": 4.0,
      "verified": true,
      "author": "Lifeisgood",
      "helpful_votes": 0,
      "publication_date": 20190425
    },
    {
      "title": "Cute and safe",
      "text": "This is the first helmet I've had because ones I tried on in the store were cumbersome, partially blocked my vision, and were tight. This helmet was none of these things. It's super cute and I feel safer wearing it. Even my husband complimented me.",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew Leonard",
      "helpful_votes": 0,
      "publication_date": 20170430
    },
    {
      "title": "Easily cracked or broken",
      "text": "The zip tie that held it in to the package bent and broke the plastic around one of the holes in the helmet, not really to confident on how protective it will be of my head if it was defeated by a zip tie.",
      "rating": 2.0,
      "verified": true,
      "author": "Kat",
      "helpful_votes": 0,
      "publication_date": 20180530
    },
    {
      "title": "Beautiful and so light :)",
      "text": "Super lighter than I expected! When I got box, I thought there’s nothing inside lol but it was! So nice",
      "rating": 5.0,
      "verified": true,
      "author": "Sammy",
      "helpful_votes": 0,
      "publication_date": 20180812
    },
    {
      "title": "Lightweight and comfortable",
      "text": "I love that this helmet is lightweight. I thought it had something to adjust the fit in the back but it does not, that's my fault though. I looked at many helmets before picking this one and I'm happy with my choice.",
      "rating": 5.0,
      "verified": true,
      "author": "Cecilia Clarkson",
      "helpful_votes": 0,
      "publication_date": 20200915
    },
    {
      "title": "Meh",
      "text": "It's fine for the price. I would spend an extra ten dollars and get a better brand. Helmet has a matte finish on the light aqua part.",
      "rating": 2.0,
      "verified": true,
      "author": "Kim B.",
      "helpful_votes": 0,
      "publication_date": 20190821
    },
    {
      "title": "comfortable and  beautiful",
      "text": "My daughter loved it. Was the First helmet she really enjoyed use",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190904
    },
    {
      "title": "Works well for basic, simple bike riding",
      "text": "I can definitely tell this is a bit of a cheaper helmet, and that if I dropped it it could definitely be susceptible to cracks/breaks, but it's a helmet. I'm just using it to ride back and forth to work so it fits my needs.",
      "rating": 4.0,
      "verified": true,
      "author": "Kelsey",
      "helpful_votes": 0,
      "publication_date": 20180808
    },
    {
      "title": "This is small not for woman.",
      "text": "This is not a woman's helmet it's a kids helmet. 7 year and below.",
      "rating": 1.0,
      "verified": true,
      "author": "CArlos",
      "helpful_votes": 0,
      "publication_date": 20190619
    },
    {
      "title": "Size limitations for chin straps and head sizing",
      "text": "It is marketed as an adult helmet, but barely has enough strap to comfortably latch under my chin. And there is no rear adjustment",
      "rating": 3.0,
      "verified": true,
      "author": "Jimmy Batterton",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "Arrived on time",
      "text": "It was a perfect fit and I love the color. Would recommend this to everyone",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190725
    },
    {
      "title": "Fits snug but great protection",
      "text": "Fits perfectly on my head, and I feel fully covered and protected by wearing this helmet. Before purchasing I noticed that a lot of the reviews mentioned that this helmet runs on the smaller size. It does run on the smaller size but I felt like it felt perfectly snug on my head.",
      "rating": 5.0,
      "verified": true,
      "author": "michelle",
      "helpful_votes": 0,
      "publication_date": 20151206
    },
    {
      "title": "I was at the top of the size they recommend and it fits fine",
      "text": "I was at the top of the size they recommend and it fits fine. It's a little uncomfortable after about 30 minutes or so, so I just move it around a bit and it's fine for a while longer.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170818
    },
    {
      "title": "The women's adult helmet did not fit my head.",
      "text": "I gave it to my grandson. If an advertisement is for women than it should accommodate a woman's head. I gave it to a four year old and had to buy another helmet.",
      "rating": 1.0,
      "verified": true,
      "author": "Teresa Wiggins",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "For the price it's a great helmet! It seems a bit bulky",
      "text": "For the price it's a great helmet! It seems a bit bulky, but I like the color and the elastic back which makes it easier to fit. I have a tiny head and it fits perfectly.",
      "rating": 4.0,
      "verified": true,
      "author": "Sean Hays",
      "helpful_votes": 0,
      "publication_date": 20180415
    },
    {
      "title": "Doesn’t fit",
      "text": "Does not fit and it’s not adjustable and I have a pretty small head. Feels more like a youth Helment and not an adults.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190430
    },
    {
      "title": "Protect your head",
      "text": "Works great and easy to wear. Protect your head while doing sports during which you may fall.",
      "rating": 5.0,
      "verified": true,
      "author": "floridagal",
      "helpful_votes": 0,
      "publication_date": 20180816
    },
    {
      "title": "Chin strap is odd.",
      "text": "Only wish the chin strap was a little looser. Have it set to the loosest it can be and it's still uncomfortably tight under my neck",
      "rating": 4.0,
      "verified": true,
      "author": "Christina Chenoweth",
      "helpful_votes": 0,
      "publication_date": 20191209
    },
    {
      "title": "cute helmet seems to fit well too",
      "text": "its snug...but I think maybe its supposed to be that way its really cute though and I like it a lot",
      "rating": 5.0,
      "verified": true,
      "author": "Angemama5",
      "helpful_votes": 0,
      "publication_date": 20180905
    },
    {
      "title": "easy to use and fits nicely",
      "text": "it also matches the color of the bike, easy to use and fits nicely. great for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Roy",
      "helpful_votes": 0,
      "publication_date": 20180709
    },
    {
      "title": "Besides that I like the color and the price",
      "text": "It’s supposed to fit snug so if you have a big head it will probably fit small. Besides that I like the color and the price!",
      "rating": 5.0,
      "verified": true,
      "author": "MJ",
      "helpful_votes": 0,
      "publication_date": 20180510
    },
    {
      "title": "Poor quality",
      "text": "I've used this helmet about 10 times and it has not been exposed to any harsh weather conditions. After a short time of owning this, the outer shell has started to peel off. It looks like there wee small glue spots that easily let go. It's a very low quality helmet. I've had this helmet for seven months and already have to buy another brand new one. I will never buy from this company again.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20160602
    },
    {
      "title": "Light and comfortable",
      "text": "The price is reasonable and it matches my bicucle. It is light and comfortable",
      "rating": 5.0,
      "verified": true,
      "author": "mary e page",
      "helpful_votes": 0,
      "publication_date": 20201006
    },
    {
      "title": "Look different from the picture and not so comfortable",
      "text": "Color is lighter than in the picture. I tired it on and not so comfortable.",
      "rating": 2.0,
      "verified": true,
      "author": "Bungheng",
      "helpful_votes": 0,
      "publication_date": 20180202
    },
    {
      "title": "Great for the price!",
      "text": "Was able to use it right away! Pleased with it so far! For the price, you can't beat it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180619
    },
    {
      "title": "Cool helmet - but won't clip!",
      "text": "Love the helmet. I just wish it fit! Fits my head but won't clip due to shortness of strap. Now I have to buy an extension of some sort -- which is a hassle in and of itself.",
      "rating": 4.0,
      "verified": true,
      "author": "Shay A.",
      "helpful_votes": 0,
      "publication_date": 20170801
    },
    {
      "title": "Runs small.  I have a small head & I even think its a bit small.",
      "text": "Think would be good for girl (middle schooler) due to it running small.",
      "rating": 3.0,
      "verified": true,
      "author": "Happy Reviewer",
      "helpful_votes": 0,
      "publication_date": 20190606
    },
    {
      "title": "Too small",
      "text": "This helmet is very small for an adult helmet. I can barely get it on my head and it is far from comfortable.",
      "rating": 2.0,
      "verified": true,
      "author": "E. Frohman",
      "helpful_votes": 0,
      "publication_date": 20180624
    },
    {
      "title": "and this helmet fits me comfortably.",
      "text": "My head measurements were right at the top of the range they listed, and this helmet fits me comfortably.",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole",
      "helpful_votes": 0,
      "publication_date": 20171216
    },
    {
      "title": "The strap is too small",
      "text": "Small for my head. The strap is really small hit barley fits around my head.",
      "rating": 3.0,
      "verified": true,
      "author": "Gail",
      "helpful_votes": 0,
      "publication_date": 20200514
    },
    {
      "title": "but it was quite annoying.",
      "text": "Then entire colored top shell fell off... had to glue it, but it was quite annoying.",
      "rating": 3.0,
      "verified": true,
      "author": "Tim",
      "helpful_votes": 0,
      "publication_date": 20180310
    },
    {
      "title": "Not enough adjustments",
      "text": "This was too small for my wife, with the strap adjusted all the way out it was still too tight. No other adjustments can be made.",
      "rating": 1.0,
      "verified": true,
      "author": "JJ s",
      "helpful_votes": 0,
      "publication_date": 20180424
    },
    {
      "title": "Nice, inexpensive helmet",
      "text": "The color is more aqua or teal, not mint green. When I wrote this criticism previously, the company contacted me and offered a refund, which seemed very fair. The helmet is nice, lightweight, but runs a little small by adult sizes. The front piece was loose when I received it and would move up & down when I hit a bump. It was not such that it would endanger the rider's safety, however. I would have liked it to keep it if the color had not clashed so badly with the color of my bike.",
      "rating": 3.0,
      "verified": true,
      "author": "jjrw",
      "helpful_votes": 4,
      "publication_date": 20170128
    },
    {
      "title": "Fun colors, for a smaller head",
      "text": "This is too tight on my adult noggin, but the colors are fab! Gave it to my niece and she loves it.",
      "rating": 4.0,
      "verified": true,
      "author": "MacDarby",
      "helpful_votes": 0,
      "publication_date": 20171025
    },
    {
      "title": "It works!",
      "text": "Has been keeping my head safe! I love the color!!",
      "rating": 5.0,
      "verified": true,
      "author": "Chelsea Z",
      "helpful_votes": 0,
      "publication_date": 20180702
    },
    {
      "title": "Great Helmet!",
      "text": "Great helmet! Does exactly what I needed it to do. Keep me cool and eyes shaded a bit. The color matches my bike, as well! =-)",
      "rating": 5.0,
      "verified": true,
      "author": "Anne Elizabeth",
      "helpful_votes": 0,
      "publication_date": 20170513
    },
    {
      "title": "Four Stars",
      "text": "Very cute but didn't fit my head (25 year old female)",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180718
    },
    {
      "title": "Too small",
      "text": "I love the color but the size is too small for an adult woman's head.",
      "rating": 2.0,
      "verified": true,
      "author": "Shweet",
      "helpful_votes": 0,
      "publication_date": 20191020
    },
    {
      "title": "fit me well",
      "text": "it is so shiny! I like it so much.... however I lost my bike today with it. Heartbreaking... I need to buy it again.",
      "rating": 5.0,
      "verified": true,
      "author": "Yuchen Zhao",
      "helpful_votes": 0,
      "publication_date": 20190124
    },
    {
      "title": "and I like that the pads are a little thicker than my ...",
      "text": "Unisex helmets were all too big. This one fits my head as a petite female, and I like that the pads are a little thicker than my last helmet.",
      "rating": 5.0,
      "verified": true,
      "author": "jmwestplate",
      "helpful_votes": 0,
      "publication_date": 20170709
    },
    {
      "title": "Nice pretty color and fits great",
      "text": "Nice pretty color and fits great. I had to adjust but it was easy.",
      "rating": 5.0,
      "verified": true,
      "author": "catcity",
      "helpful_votes": 0,
      "publication_date": 20180222
    },
    {
      "title": "Nice helmet",
      "text": "Bought for my granddaughters birthday. It looks as it does in the picture and fit her perfectly. Would buy again",
      "rating": 5.0,
      "verified": true,
      "author": "PLS",
      "helpful_votes": 0,
      "publication_date": 20160612
    },
    {
      "title": "Color just as pictured",
      "text": "This helmet is very comfortable and lightweight. Helmet is just as pictured. Great for everyday use, I have a smaller head and this fits perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "MiLo",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "Five Stars",
      "text": "I’m a 29-year-old female the helmet fits perfect on me",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 0,
      "publication_date": 20180515
    },
    {
      "title": "Returning this right away. Says \"adult size\" and is ...",
      "text": "Returning this right away. Says \"adult size\" and is the size for the eight year old I babysit. If I wore this I'd have a headache in minutes.",
      "rating": 1.0,
      "verified": true,
      "author": "Madelyne",
      "helpful_votes": 0,
      "publication_date": 20170529
    },
    {
      "title": "Pretty and lightweight, but smaller than advertised.",
      "text": "Love the color, hate the fit. In like how lightweight this helmet is, but it's far too small. My head measurements are within the recommended fit, but I get a headache after wearing it for just a few minutes.",
      "rating": 3.0,
      "verified": true,
      "author": "Kimberly Jensen",
      "helpful_votes": 0,
      "publication_date": 20180429
    },
    {
      "title": "Head strong",
      "text": "Love this helmet. Very comfortable. There’s a little loop you can put your ponytail through, not sure if it’s meant for that but it works.",
      "rating": 5.0,
      "verified": true,
      "author": "EEMac",
      "helpful_votes": 0,
      "publication_date": 20181115
    },
    {
      "title": "I originally bought this for myself, but ended up ...",
      "text": "I originally bought this for myself, but ended up having to pass it on to my 11 y/o daughter because it is way way too small for my head.",
      "rating": 3.0,
      "verified": true,
      "author": "Hayls",
      "helpful_votes": 0,
      "publication_date": 20161001
    },
    {
      "title": "Five Stars",
      "text": "I LOVE the mint green color. It's kind of a matte finish, really smooth, and fit perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "J Wheeler",
      "helpful_votes": 0,
      "publication_date": 20170710
    },
    {
      "title": "My big head does NOT fit but it looks good!",
      "text": "I have a big head ad cannot wear it at all...cute though!",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180319
    },
    {
      "title": "It has built in reflectors",
      "text": "Good fitting and comfortable helmet especially for the money. Looks good and seems well built. I trust it for my girl.",
      "rating": 5.0,
      "verified": true,
      "author": "Single Coil Michael",
      "helpful_votes": 0,
      "publication_date": 20190902
    },
    {
      "title": "Ok helmet",
      "text": "Ok for a casual rider. Not sure how much protection this helmet would provide; however, it's probably equitable for the cost.",
      "rating": 3.0,
      "verified": true,
      "author": "UserBK",
      "helpful_votes": 0,
      "publication_date": 20161030
    },
    {
      "title": "No customer support help, helmet clip comes off, totally unusable",
      "text": "Unusable - - clip won't stay on. I called the manufacturer, Bell, and they offered no support. Said I would have to send the helmet it at my own cost for them to do an \"inspection.\" Why would I spend $10 to send in a crap helmet that cost $16? Waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "Sheena",
      "helpful_votes": 0,
      "publication_date": 20160413
    },
    {
      "title": "It's a helmet, and it looks as pictured. ...",
      "text": "It's a helmet, and it looks as pictured. I bought this for my sister, and the helmet size fits us both - women age 23. I think I have a normal sized head.",
      "rating": 5.0,
      "verified": true,
      "author": "Megan",
      "helpful_votes": 0,
      "publication_date": 20160216
    },
    {
      "title": "This is a nice helmet. I don't like the color",
      "text": "This is a nice helmet. I don't like the color, but have spray painted it the color of my bike, and it looks great. I got a good deal on this on Amazon.",
      "rating": 5.0,
      "verified": true,
      "author": "Spicy Mamma",
      "helpful_votes": 0,
      "publication_date": 20160107
    },
    {
      "title": "small for size",
      "text": "small for size, my 12 yr old has to until her hair to put this on her head",
      "rating": 3.0,
      "verified": true,
      "author": "Rav",
      "helpful_votes": 0,
      "publication_date": 20190820
    },
    {
      "title": "Too small",
      "text": "This product runs pretty small period I have a smallish head and it's too tight and the straps can only extend so far. It says it's a woman size but I think it's more of a youth size.I would recommend purchasing a different brand.",
      "rating": 2.0,
      "verified": true,
      "author": "Laurianne W",
      "helpful_votes": 0,
      "publication_date": 20170629
    },
    {
      "title": "Five Stars",
      "text": "Almost too small until I adjusted the chin strap beautiful headgear!",
      "rating": 5.0,
      "verified": true,
      "author": "kathy stone",
      "helpful_votes": 0,
      "publication_date": 20170728
    },
    {
      "title": "Nice shape, true color, just what I needed!",
      "text": "Love the color, fits really well, though on the small size but it is what I needed. Took awhile to arrive but I knew that upon ordering so that was not a problem.",
      "rating": 4.0,
      "verified": true,
      "author": "Sharon Appel",
      "helpful_votes": 0,
      "publication_date": 20151013
    },
    {
      "title": "I like it - feels nice and secure",
      "text": "This fits perfectly. I like it - feels nice and secure.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Mary G.Top Contributor: Cooking",
      "helpful_votes": 0,
      "publication_date": 20171005
    },
    {
      "title": "Great buy, safety first!",
      "text": "This helmet looks cool, matches my bike and is easy to adjust. I recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa Leonard-Sisco",
      "helpful_votes": 0,
      "publication_date": 20190709
    },
    {
      "title": "Good Cheap Bike Helmet",
      "text": "Fits comfortably and looks nice. The color is as shown in the picture.",
      "rating": 5.0,
      "verified": true,
      "author": "William",
      "helpful_votes": 0,
      "publication_date": 20170701
    },
    {
      "title": "Runs Small",
      "text": "The helmet looks great--and matched my new bicycle--but it was too small for my head. So, for any women who often can't fit OS hats, this isn't the helmet for you.",
      "rating": 3.0,
      "verified": true,
      "author": "Heather W. Rudulph",
      "helpful_votes": 0,
      "publication_date": 20170611
    },
    {
      "title": "Great buy for the money!",
      "text": "Lightweight and fits great. I love it. Not too hot either.",
      "rating": 5.0,
      "verified": true,
      "author": "Singh Rasile ",
      "helpful_votes": 0,
      "publication_date": 20190629
    },
    {
      "title": "Seems to run small",
      "text": "Says it's for women, but it barely fits my head, which is on the smaller side.",
      "rating": 4.0,
      "verified": true,
      "author": "M. Thomas",
      "helpful_votes": 0,
      "publication_date": 20190403
    },
    {
      "title": "Too small.",
      "text": "The shell wasn't attached to the foam insert and it was too small for my, I think normally, adult sized head.",
      "rating": 1.0,
      "verified": true,
      "author": "Erica",
      "helpful_votes": 0,
      "publication_date": 20180919
    }
  ],
  "product_meta": {
    "title": "Thalia Women's Bike Helmet",
    "rating": 4.3,
    "feature_bullets": [
      "DESIGN - Specifically for women who are on the go.",
      "FIT SYSTEM - True Fit system for easy one-step adjustment every time you ride, it's that simple.Magnetic key lockers",
      "AIR FLOW - 16 vents for channeled air flow to keep you cool while you ride. AIR FLOW - 16 vents for channeled air flow to keep you cool while you ride.",
      "SIZE - Recommended for ages 14+, but will fit most heads measuring 54-58 cm. Important: Always take a head measurement. Head sizes and shapes can vary, even within and age range. Using a helmet that does not fit can be dangerous.",
      "COMPLIANCE – Complies with the U.S. CPSC Safety Standard for Bicycle Helmets for Persons Age 5 and Older."
    ],
    "specifications": {
      "Department": "Women",
      "Date First Available": "April 25, 2018",
      "ASIN": "B07CNBBV2J",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Outdoor Recreation",
      "Adult Helmets",
      "Sports & Outdoors",
      "Helmets & Accessories",
      "Cycling"
    ],
    "price": 19.96
  }
}