{
  "website_summaries": [
    {
      "verdict": "Creates an aurora borealis effect and features a variety of other lighting effects. Perfect for parties.",
      "pros": [
        "The inexpensive projector features 8 bright lighting modes but can be used with its lid for a softer effect",
        "Automatic shutoff",
        "Can play music from an iPod or smartphone via its AUX input"
      ],
      "cons": [
        "Some of the lighting effects are a bit harsh, so it's not appropriate as a night-light"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "UPDATE:  2 stars to 4 stars for customer service.",
      "text": "Am I doing something wrong? The lights don't move. Everything I read indicates there should be some movement. I read the instructions, but it doesn't say. If this is what it's supposed to look like, I'm not impressed. UPDATE: SOAIY contacted me within 2 days of posting my review above and offered to replace or refund the night lamp. I had already purchased an alternative lamp, so they refunded me immediately. That is excellent customer service. Based on that, I have upgraded my review.",
      "rating": 4.0,
      "verified": true,
      "author": "Potent Menagerie",
      "helpful_votes": 46,
      "publication_date": 20161021
    },
    {
      "title": "Northern lights for Xmas village!",
      "text": "I purchased this light to create \"the northern lights\" for my Christmas village and I am so happy with how it turned out. There is a speaker that I won't use but it's nice to have. My only complaint is that it turns off after one hour. I wish the options were on, off, and timer.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica Thompson",
      "helpful_votes": 168,
      "publication_date": 20151207
    },
    {
      "title": "Only lasted 4 months",
      "text": "If only I could give it 0 stars. It stopped working back in May. So it lasted what? 4 months with inconsistent use. If you want a throw away item for a party or special event this will probably suit your needs; although the light isn't very strong nor does it cover a lot of territory. And of course the darker the room the better. I saw the other reviews saying it wasn't durable but I thought I'd take a chance on it since there would be no children or wild parties anywhere near near it. If you are looking for something to use long term I'd look elsewhere.",
      "rating": 1.0,
      "verified": true,
      "author": "Kali Zyre",
      "helpful_votes": 11,
      "publication_date": 20170628
    },
    {
      "title": "Junk , easily broken",
      "text": "Seriously broke after 2 days use, kid very disappointed. I was able to \"wiggle\" the connection to get it to work for a whole nother night. Junk item",
      "rating": 1.0,
      "verified": true,
      "author": "Dennis B.",
      "helpful_votes": 11,
      "publication_date": 20170906
    },
    {
      "title": "Perfect for background ambiance",
      "text": "Can’t say one bad thing, I just love this thing! This was at my friends house and her ceiling is vaulted, and the lights made their way up across the wall and ceiling both. This was without the top on it, which is our favorite mode. It’s absolutely worth the price. The speaker is meh, but I didn’t buy it for that reason.",
      "rating": 5.0,
      "verified": true,
      "author": "Heather McDonald",
      "helpful_votes": 9,
      "publication_date": 20180621
    },
    {
      "title": "The perfect night light!",
      "text": "I bought one for my son then another for a friend's child. Both are the model that does not come with a remote. It's a fantastic light. The brightness is just right to light up a room but not too bright to disturb sleep. The movement of the light mimics the Aurora borealis and is very soothing. There are a few light pattern/color options that are easy to click through and choose. It goes off automatically in 15 minutes. I highly recommend this for childrens' rooms of any age.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "beautiful display and very bright",
      "text": "I bought this for an adult that loves the northern light but has not seen them in person and I was blown away with how bright and cool this thing was and she loved it as well....looks best with out the lid on it, but might want to use the lid in a kids room so it's not so bright light shuts off by itself after a few hours",
      "rating": 5.0,
      "verified": true,
      "author": "woops",
      "helpful_votes": 2,
      "publication_date": 20191118
    },
    {
      "title": "Love it!",
      "text": "I love this light! Obviously it works best in a dark room, but I also use it during the day in a slightly darkened room to help put my baby down for naps and it still provides a decent amount of movement/color for him to watch. Pros: nice bright light, variety of ways to use it(color modes, dome on or off, etc), seems to be fairly well made, easy to set up, looks amazing! Cons: angle adjustment is a bit rough, no separate off button or back button so you have to cycle through all the options before looping back to the one you want, preset off timer with no way to adjust it.",
      "rating": 5.0,
      "verified": true,
      "author": "Chamari",
      "helpful_votes": 9,
      "publication_date": 20160110
    },
    {
      "title": "Doesn't last long.",
      "text": "We loved this night light for the very brief time it worked. After only a couple months, it has malfunctioned to the point that it will not ever turn on, no matter what we try. So disappointed we spent this much for a kids night light and it was used for such a short time.",
      "rating": 1.0,
      "verified": true,
      "author": "Sarah Thorne",
      "helpful_votes": 6,
      "publication_date": 20170817
    },
    {
      "title": "Worked great...for 18 months",
      "text": "I bought two of these to serve as nightlights for the children in their respective rooms. They enjoy the option to set their own fvorite patterns. I enjoy that it stays on for an hour, enough time to fall asleep. We have used these for 18 months, most every night. The first one has wore out. The motor turning the light now makes a grinding sound. Before then, it was quiet as a mouse and a great addition to the bedroom. 5 stars for when it worked, but too expensive to last only 18 months.",
      "rating": 3.0,
      "verified": true,
      "author": "LovinParents",
      "helpful_votes": 0,
      "publication_date": 20200414
    },
    {
      "title": "Good Night Light- but forced into a 1hr timer",
      "text": "Bought the white and black projector light for my children (6yr & 5yrs) to use at bed time. They enjoy the lights and its a great alternative to simply plugging in a light on the wall. That being said I wish there was a way to have more than one timer setting. While these are working great for them initially falling asleep due to being forced to use the one hour timer if they wake up in the middle of the night their rooms are pitch dark. Which they find less then stellar. Would love to be able to keep it on all night or at least have a longer timer option.",
      "rating": 3.0,
      "verified": true,
      "author": "Brown",
      "helpful_votes": 0,
      "publication_date": 20191001
    },
    {
      "title": "Fatal Flaw.",
      "text": "I have previously bought the more enhanced version of this product, and I can honestly say that in comparison, I wish I'd not bought this one. The fact that it only runs for 1 hours of horrible. For this reason alone, I would recommend other projectors. The only thing I appreciate about this design is the ability to pivot the base. Also, something I would have like to have seen on both this and the enhanced version is a hole in the bottom for wall mounting. Hopefully they'll incorporate that into future versions.",
      "rating": 1.0,
      "verified": true,
      "author": "Capt.Kira",
      "helpful_votes": 0,
      "publication_date": 20200211
    },
    {
      "title": "Very good customer service.",
      "text": "it was a little too bright as a night light for our kids room and the designs were a bit blurry. we opted for \"Baby Night Lights for kids, Ansbro Starry Night Light Rotating Moon Stars Projector, 9 Color Options Romantic Night Lighting Lamp, USB Cable / Batteries Powered for Nursery, Bedroom\". That one has better color and crispness of stars/designs, but on the flip side, has really poor control mechanism to power on/off. this one has better controls but sadly wasn't as peaceful for our kids room. was a little too intense. However the customer service was excellent. They went above and beyond to make sure I was a happy customer.",
      "rating": 4.0,
      "verified": true,
      "author": "Quality Control Unit",
      "helpful_votes": 0,
      "publication_date": 20171213
    },
    {
      "title": "Great for trying to sleep!",
      "text": "I purchased this for my guest bedroom for when the grandkids spent the night. Of course they loved it. While since the virus and no family stay overs, I forgot I had this. I went to the guest bedroom a couple days ago and saw this. I thought, I’ll use it in our bedroom. My husband can sleep through anything. I on the other hand need music etc. I set this up, Put on music and it was awesome! This is now staying in my bedroom!",
      "rating": 5.0,
      "verified": true,
      "author": "KitkatR16",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "Awesome Projector for calming a sweet baby girl who is hospitalized.",
      "text": "I purchased this for a friends grand daughter who is 10 months old, & has been in the hospital for the last 2 months. I talked with her mother Saturday. She said it is amazing. She said it is the best one they have ever seen, & are thinking of buying one for her Nephew. She loved that she could leave the cap on for a softer light, or remove the cap for much brighter, vivid, clear colors. Her baby absolutely loves this projector. Mom said it helps keep her calm. Thank you SOAIY for this awesome projector.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 3,
      "publication_date": 20161121
    },
    {
      "title": "Poor Quality",
      "text": "Bought this thinking it would be awesome for a night light. - VERY POOR light quality. (can barely see it) - makes noise, not talking about the aux cord and speaker - volume of the speaker is very low - Even though it has measurements of the size, it looks very small. - top heavy and not sturdy - the plastic top falls off easily so you cant hang it - the laser lights on the inside are (obviously) not safe and considering the top comes off, I would not recommend for a kids light or night light - broke within 2 weeks",
      "rating": 1.0,
      "verified": true,
      "author": "Hope Imming",
      "helpful_votes": 0,
      "publication_date": 20191023
    },
    {
      "title": "Fantastic!",
      "text": "This is a great product! My 9 year old daughter loves it as the colors remind her of aurora borealis. My video doesn't do the product justice! I highly recommend this.",
      "rating": 5.0,
      "verified": true,
      "author": "Samuel B. Johnson",
      "helpful_votes": 0,
      "publication_date": 20200512
    },
    {
      "title": "Item didn’t power on.",
      "text": "This product is a joke. It didn’t work when I recieved it. The box it came in looks like it was dropped before it was shipped. Everything looked good when I unpacked it, but it sounded like parts were broken off inside the base of the light. I plugged it into the power supply, and nothing happened. It looks like it’s cheaply made and could’ve easily been damaged during shipping. Even if the thing did work, it’s definitely not worth $20. I would not reccomend this product.",
      "rating": 1.0,
      "verified": true,
      "author": "Deena",
      "helpful_votes": 2,
      "publication_date": 20190209
    },
    {
      "title": "Very cool night light for my 8 year old twin girls",
      "text": "Very cool night light for my 8 year old twin girls. Its bright enough to see everything and still dark enough to sleep through. the base where the cord is, is VERY easy to break. If younger children are involved I would put it higher where they couldn't reach it. I love that it has a timer and goes off after an hour or so. I have not plugged it in to the iPod yet for music so I do not know how well that part works. We took the lamp off so we could see the lines move around. Very pleased! Bought in August and now its October.. Works great with everyday use.",
      "rating": 5.0,
      "verified": true,
      "author": "Leslie",
      "helpful_votes": 4,
      "publication_date": 20161017
    },
    {
      "title": "Coolest night light EVER!",
      "text": "This is by far the COOLEST night light / light show I have ever purchased and my kids are in complete fascination with it. The lights with the cover over the top are soft and soothing with the multiple selections and patterns to choose from and with the cover off it displays such a cool a laser light show. The icing on this cake it the built in speakers that you can hook an Ipod or you're phone to sound pretty darn good. I posted the laser show in my kids room and Facebook and so many of my friends were pretty impressed and asked where I got it from :)",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa",
      "helpful_votes": 2,
      "publication_date": 20161019
    },
    {
      "title": "Great.",
      "text": "I love it. It’s so bright you can see it even with the room light on. It’s amazing. My two years old loves it. The only thing is it shuts off after a while which kind of sucks sense it’s for a toddler. I have to turn it back on every couple hours.",
      "rating": 5.0,
      "verified": true,
      "author": "Miller",
      "helpful_votes": 0,
      "publication_date": 20191202
    },
    {
      "title": "Keep searching, this ain't it chief.",
      "text": "Not worth it. Take your money elsewhere. I expected something peaceful for my toddler but there's a bright laser that shoots out of the thing and I'm afriad it will hurt their vision. You can't shut the red laser off its on every single setting. I'm highly disappointed in the over all quality as well. Speaker is OK but not why I bought the product. I will be returning the item immediately and be seeking other options.",
      "rating": 1.0,
      "verified": true,
      "author": "Mr Anderson",
      "helpful_votes": 0,
      "publication_date": 20200910
    },
    {
      "title": "Can't sleep without it",
      "text": "There are a few different settings where the main color can vary from green, blue, and red. The lights move in a very calming way and it automatically shuts off after a period of time (I'm usually asleep by then). It also has an auxiliary cord to connect a phone to which also works well, but I don't use as often. It's a great way to transition from being awake with the lights on, to getting ready for bed and falling asleep!",
      "rating": 5.0,
      "verified": true,
      "author": "Paty",
      "helpful_votes": 0,
      "publication_date": 20190819
    },
    {
      "title": "Dies fast",
      "text": "First bad things was that it doesn't have white noise built in but rather and aux jack to plug in a head phone jack. Second - purchased 5/3/20. Yesterday 10/10/20 it died. Dead dead bury in the back yard dead Third- if you are wanting to buy this I wouldn't recommend it.",
      "rating": 1.0,
      "verified": true,
      "author": "Casey",
      "helpful_votes": 0,
      "publication_date": 20201011
    },
    {
      "title": "Loved it for the last year, now it's starting to squeak/Updated!",
      "text": "I've used this basically every night for the last year. Not sure what the lifespan is, because now it squeaks something awful. If I have a fan on or are watching TV, you can't hear it. Can't have it on while trying to fall asleep anymore because the squeak is unbearable, unfortunately. Wondering if this is a design flaw or if it's just mine? ***Updated: Contacted the seller directly. They quickly responded that the squeaking was not something that could be fixed and immediately shipped out a replacement at no charge. Wonderful customer service!",
      "rating": 5.0,
      "verified": true,
      "author": "LLW",
      "helpful_votes": 0,
      "publication_date": 20181202
    },
    {
      "title": "I rate this 4.5 stars",
      "text": "I want to call it a night light, but it's more than that. I'd call it a party light, but it's more than that. The colors are beautiful and in constant flux. The laser beam darts around in its pattern and it's really amazing looking. The button on it sticks quite a bit and it feels cheaply made on the bottom, but the top parts are where it shines, literally. Looks like something from an alien world. Tons of settings and the geodesic dome adds this softness that looks great for a night light. I really love this light. USB compatible is great and really earns it a 4.5 rating",
      "rating": 4.0,
      "verified": true,
      "author": "Ajuvix",
      "helpful_votes": 0,
      "publication_date": 20170922
    },
    {
      "title": "Fun lights!",
      "text": "These are fun lights or night lights... many different patters. I bought a few a year ago & they still work. My kids love them but I do also to add ambiance to my bedroom or living room. Different colors to chose from. We haven't had any problems at all !!! I bought about 12 of the lights that screw in like a bulb from another maker and those were junk. 1/2 didn't even work from the date of delivery so I decided to buy these... I'm completely satisfied & would buy again. Great for parties or even just a mellow night home to chill .",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170827
    },
    {
      "title": "Highly recommend purchasing this product!",
      "text": "The company is amazing! The products are wonderful! The lights are gorgeous on the ceiling and walls! The audio player is a great addition, the volume to the music is phenomenal! I am so happy I purchased this for my son and my daughter! The company is very generous and I am beyond happy that I made this decision to purchase for my son and my daughter! They love there night lights! I use them every night to help them have a smoother sleep ❤ Highly recommend this to my friends and family! The products are wonderful and the company cares truly about there products! Thank you! 😊❤",
      "rating": 5.0,
      "verified": true,
      "author": "Seanna",
      "helpful_votes": 0,
      "publication_date": 20171122
    },
    {
      "title": "Cord stops working less than 6months in--beware (EDIT)",
      "text": "Beautiful--while it lasts. Purchased this at Christmas for my son as a cool nightlight, and last month it stopped working. There's a short in the cord, even though the light has never been moved off the table since i placed it there and has never been tugged or thrown around. (EDIT) Within a day of posting this review, SOAIY contacted me via email and offered a new product replacement. I received it in the mail and it works perfectly! Definitely amazing customer service!!!",
      "rating": 4.0,
      "verified": true,
      "author": "Kasei",
      "helpful_votes": 2,
      "publication_date": 20170629
    },
    {
      "title": "Sleepy. Sexy. Strobey. What else could you want",
      "text": "we use it every night. Has multiple colors including a strobe function that we never use, and frankly, kind of scares us. There's a just red function that is kind of sexy. And we switch the other colors up for sleep. It turns off on its own after maybe 45 minutes or so.",
      "rating": 4.0,
      "verified": true,
      "author": "Brittany",
      "helpful_votes": 0,
      "publication_date": 20200905
    },
    {
      "title": "Beautiful, Soothing",
      "text": "I really love this light. The patterns and colors mixing and moving on my bedroom ceiling as I try to fall asleep are so soothing. The unit is silent and I love the timer that shuts it off after 30 mins (usually I've fallen asleep by then), which saves energy and device life. The speaker works fine for my rain sounds when I feel like using it, which isn't often, but isn't a very high quality speaker (you get what you pay for). This product is a good value for what you get and serves its purpose well. I love it!",
      "rating": 5.0,
      "verified": true,
      "author": "SanAnGirl",
      "helpful_votes": 2,
      "publication_date": 20160720
    },
    {
      "title": "Stopped working, replacement did the same thing",
      "text": "Great for about 3 months then stopped working. This happened for both the first one we bought and the replacement which is why I can only give 1 star. This light should have a longer lifespan. Our daughter loved the colors display and the low hum of the machine seemed to be a bit soothing. Automatic shut off feature was nice too.",
      "rating": 1.0,
      "verified": true,
      "author": "Heather ",
      "helpful_votes": 0,
      "publication_date": 20190910
    },
    {
      "title": "The kids love this",
      "text": "This is really nice, whether you leave the cover on for a blurred effect or take it off for sharper lines. I don't use the sound option just the light but the kids must have it every night. Bed time is more agreeable and when they have sleep overs their friends are so impressed. Sturdy little light too. The light automatically turns off after an hour so you don't have to have it running all night and it doesn't interrupt with REM sleep.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie",
      "helpful_votes": 0,
      "publication_date": 20180815
    },
    {
      "title": "Too bright so disappointed.",
      "text": "Edited: this product may not have been ideal for our purposes, however this company's customer service is really above and beyond. I will definitely order items through them in the future. (Also want to emphasize that the light show was beautiful just too bright for my six year old troubled sleeper to fall asleep to) Bought this for my daughters room to help her fall asleep and its way to bright, we've tried every setting and it doesn't help. They all seem to cycle to a too bright for bedtime setting. I was really hopeful with this, I may try putting something over it tomorrow to dim it a bit. Otherwise I'll be donating it",
      "rating": 4.0,
      "verified": true,
      "author": "Sarah K.",
      "helpful_votes": 0,
      "publication_date": 20160812
    },
    {
      "title": "Excellent product",
      "text": "I wish it were angled outward. It sits upright and has to be a near a wall because of the outlet. So half the light shines onto the wall and not the ceiling unless I lay it on its side. Which looks kind of silly and thrown about, but that's ok. We love this little light. I turn it on for the kids in my daycare during naptime and they all just watch the lights until they fall asleep. I think it's about 60 seconds before the pattern repeats itself and it's not obviously the same pattern whatsoever so it keeps their little minds wandering around the room with the lights",
      "rating": 4.0,
      "verified": true,
      "author": "T.",
      "helpful_votes": 0,
      "publication_date": 20171102
    },
    {
      "title": "Nice but.....",
      "text": "First day the center button to change the lights broke. Now it is stuck on one set of lights Sending back for a refund. Hopefully the upgraded version works better. Update. Turns out the little slit that the main button has to stay aligned on the bases notch is short so if pressed hard it will slide to the side and not engage the color changing part properly. To fix this I put a small piece of double sided tape on the button and now it can not slide out. Works great now.",
      "rating": 4.0,
      "verified": true,
      "author": "DREDD",
      "helpful_votes": 0,
      "publication_date": 20180307
    },
    {
      "title": "Nice light, on timer for 20 minutes.",
      "text": "I have a similar lamp for my toddler and wanted one for my baby as well. The light and music features are great, but this one automatically shuts off after 20 minutes. There is no way to turn this feature off, so it's ok for falling asleep as long as your kid takes less than 20 minutes (hahaha). Don't buy this one, get the newer model that can stay on continuously. Review edit: customer service was really great! When they saw my review they refunded half the cost and let me keep the light.",
      "rating": 4.0,
      "verified": true,
      "author": "Lisa Winger",
      "helpful_votes": 0,
      "publication_date": 20170121
    },
    {
      "title": "Coolest Nightlight Ever!",
      "text": "This gadget is TOO cool. My kids all fight over it. The hubs and I like it, too. My 5yo will not sleep without it in her room at night. I like that I can turn it on for her and know that it will turn off an hour later automatically. My 8mo loves the more muted lights (with the lid on) and my 5yo prefers the 'lazer show' lights (without lid). I plan to purchase another one! Truly the coolest night light around. Even my 9 and 11yo boys want it in their room.",
      "rating": 5.0,
      "verified": true,
      "author": "LB+6",
      "helpful_votes": 0,
      "publication_date": 20180706
    },
    {
      "title": "Love this!",
      "text": "Bought it as part of my 13 year-olds Easter basket and he absolutely loves it. It has different settings for color and movement. Best of all it shuts off in an hour so it's not wasting electricity while he's asleep. Love that it has the option for battery or can plug into the wall. Know that it really only reflects on the wall or corner where it's placed and a section of the ceiling. The range does not allow it to dance around the whole room but he is OK with that as it's very colorful and lively. Will be buying another for his brother as the one I bought for him wasn't even close in effect to this.",
      "rating": 5.0,
      "verified": true,
      "author": "Mom22",
      "helpful_votes": 0,
      "publication_date": 20160330
    },
    {
      "title": "Nice Mood Light, Not a Night Light",
      "text": "Love the soft, dancing light emitted from this, but it only stays on for an hour so it doesn’t serve the purpose of an all night light. Sending back simply because I need one that will stay on all night. Instead, I purchased the upgraded version of this light which has multiple brightness settings and an option to keep it on indefinitely.",
      "rating": 4.0,
      "verified": true,
      "author": "Jen",
      "helpful_votes": 0,
      "publication_date": 20180424
    },
    {
      "title": "worked while it did...",
      "text": "Used every night for my sons room, he loved it.... Never moved it or anything. Now it just stopped working after using it nightly after a few months..... great...",
      "rating": 1.0,
      "verified": true,
      "author": "Les",
      "helpful_votes": 5,
      "publication_date": 20170421
    },
    {
      "title": "Wonderful Night Light-Like the Northern Lights",
      "text": "I purchased three of these units, the first being a Christmas present for my wife. She loves this light. It's a great night light and turns itself off after thirty or forty minutes. The lighting patterns on the ceiling of our bedroom reminds her of the Northern Lights. I also purchased two more units for two of my grandchildren for use in their bedrooms. I personally believe they will love the lighting patterns in their bedrooms when they go to sleep.",
      "rating": 5.0,
      "verified": true,
      "author": "Lee",
      "helpful_votes": 0,
      "publication_date": 20180202
    },
    {
      "title": "New model better than the old one",
      "text": "I bought this last year for my son for Christmas. He loved it, but after a month it quit turning though the lights still work, so he was disappointed and it was too late to return it. Then the power cord stopped working and I replaced it. A year later I wrote a negative review on Amazon. The manufacturer immediately contacted me and asked to replace my light for free. I accepted the offer. The new one was better with more beautiful light display. Son is very pleased. I've waited 2 months before I rewrite this review and it is still working nicely. I do recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Puppy's Mama",
      "helpful_votes": 0,
      "publication_date": 20161123
    },
    {
      "title": "I feel like a kid again!",
      "text": "I love products like these. It enhances my movie experience and wows all of my guests with the aurora lights. I LOVE IT. Be sure not to put the top on when the light is on though, it will certainly melt the cover. But other then that its a nice addition to have if you like adding more excitement to movie nights",
      "rating": 5.0,
      "verified": true,
      "author": "R. Morton",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "******Updated review*****Guess I got a bad apple cause after 30 seconds of the prettiest night ...",
      "text": "******UPDATED******* seller contacted me immediatly and sent replacement item. Switch works perfectly this time, beautiful vibrant lights, my 4 month old sleeps soundly to it every night!! ***** Was very excited about this item, figured it was hit or miss after reading reviews. Guess I got a bad apple cause after 30 seconds of the prettiest night light I've ever seen it just quit working. :( ******",
      "rating": 5.0,
      "verified": true,
      "author": "Cassssienova",
      "helpful_votes": 3,
      "publication_date": 20161026
    },
    {
      "title": "Just as pictured and described",
      "text": "The colors are beautiful. My granddaughter loved it and she hadn't even seen it in the dark yet. Not sure about my grandson and other granddaughter yet. Christmas morning was so chaotic that they hadn't tried it by the time I had to leave. I'm sure they will love it. I may update in a few days",
      "rating": 5.0,
      "verified": true,
      "author": "Susan Gray",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "Beautiful, soothing, fascinating!",
      "text": "One of the best light protector toys I've ever bought. Lovely, flowy \"undersea\" pattern that can be used in any RGB combo or single solo color, AND with or without an amazing red laser pattern. The latter is oddly soothing despite being very animated; it moves in a very random and organic way that makes it never boring, it reminds me of medical school videos of blood pumping through veins. My favorite settings are blue and green undersea with no laser... or red undersea with red laser. I'm kind of a monochromatic person, haha. Anyway, it's the best $23 you ever spent, buy it already!",
      "rating": 5.0,
      "verified": true,
      "author": "K. Mulholland",
      "helpful_votes": 0,
      "publication_date": 20160610
    },
    {
      "title": "A good alternative to the poorly constructed planetariums.",
      "text": "A lot of light is packed into this little unit. Pressing the center button cycles through the different colors which are splashed on the ceiling along with a red laser. With the top on the light is greatly mutted and works as a night light from across the room, if it was on a bedside table it would be too bright to sleep. Remove the top and the patterns spring to life and dance around. It makes for a nice mood light or to entertain the little ones as they fall asleep.",
      "rating": 5.0,
      "verified": true,
      "author": "David Smith",
      "helpful_votes": 2,
      "publication_date": 20160302
    },
    {
      "title": "Not great for nursery",
      "text": "Clear top that covers the light falls off. Light is very bright if that’s what you are looking for but too vibrant for baby room/nursery. Light modes include a strobe flash setting that also is too much movement for infants room. Also would prefer something that also has white noise/sound built in and this has none. Pros are It’s light weight and relatively small for a fairly wide projection.",
      "rating": 1.0,
      "verified": true,
      "author": "Kelly",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "Happy baby happy parents!",
      "text": "We bought this for our 3 month old daughter who loves to watch shadows and lights bounce around on the walls and ceiling. It arrived today and it truely is amazing. Not sure who loves it more, her or us! It's beautiful and unique. Way better alternative to a tradition night light or mobile.",
      "rating": 5.0,
      "verified": true,
      "author": "MrsZ",
      "helpful_votes": 2,
      "publication_date": 20170911
    },
    {
      "title": "But it for yourself or as a gift!",
      "text": "Great product! Very easy to use, and has different light settings, from a slow moving blue and red setting for sleep, to a rapidly flashing multicolor setting that’s fun for an impromptu dance session. The speakers are okay, connectable with an aux, nothing to rave about but that’s to be expected considering it’s not really the purpose of this product. This is NOT a starry night type of light projection, it’s more of an aurora borealis type deal. Overall, I’d purchase again should anything happen to this one, and would totally gift it as well.",
      "rating": 5.0,
      "verified": true,
      "author": "odeh",
      "helpful_votes": 0,
      "publication_date": 20200929
    },
    {
      "title": "I got this product to use as a nightlight for ...",
      "text": "I got this product to use as a nightlight for my daughter. We have had it for less than two months and already it has broke. It has stopped turning on the inside so the effect of Aurora borealis is now just a solid light. Not worth the money. *** customer service contacted me upon review and sent me a free replacement. They have been very helpful and easy to communicate. Will update review to see if replacement lasts longer!",
      "rating": 3.0,
      "verified": true,
      "author": "Emily",
      "helpful_votes": 2,
      "publication_date": 20160511
    },
    {
      "title": "Beautiful",
      "text": "I use this light in my 1 year old's bedroom. It's very beautiful. She likes looking at all the colors. The light stays on for about an hour and turns off automatically. It has several different color \"light shows.\" I personally like the blue tones. Very good for my daughter to fall asleep. Not too bright. Some of the others probably wouldn't be appropriate for bedtime. Too bright and flashy. I hope it lasts a long time. :-) Update: 7/30/16 The light no longer moves. I guess the motor malfunctioned. This is disappointing. I thought this was going to last a lot longer than 6 months.",
      "rating": 3.0,
      "verified": true,
      "author": "Ashleigh",
      "helpful_votes": 0,
      "publication_date": 20160312
    },
    {
      "title": "Loved this",
      "text": "Loves this product. Bought it for my wife that loves the Northern Lights. The product is good but if you’re clumsy and drop it, it will break pretty easily. I’m still giving it 5 stars because it was my fault it broke",
      "rating": 5.0,
      "verified": true,
      "author": "Jacque Lagomarsino",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "Good value. Pretty nice product.",
      "text": "This is nice because you can change some of the colors/lights that display. You can use it with the faceted cover or without. It is very small, so it fits nicely on a table or headboard. I love the auto-off feature. It is extremely quiet, but it is a bit bright if you are trying to just relax in the dark. The patterns are beautiful. We may pass this along to our grandsons, as they were very taken with it when they stayed overnight. I was looking for something with more of a \"galaxy\" or \"star\" pattern, but this one is very nice, too.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170406
    },
    {
      "title": "Very happy with this product!! Proud purchase",
      "text": "I was actually worried how this was going to work out but it exceeded my expectations!!!! Bought it for my fiance's little sister and she loved it! The minute she opened it we all tried it out in the living room and once you remove this protective slip for the lights it was super clear on the walls and lit up the whole room! We couldn't stop watching it; so relaxing and amazing with the music! The different settings are awesome for the colors!!! Speakers were ok but I say worth the purchase if you're contemplating it.",
      "rating": 5.0,
      "verified": true,
      "author": "Bri B.",
      "helpful_votes": 0,
      "publication_date": 20170319
    },
    {
      "title": "I would buy again.",
      "text": "A great little light show. I works better than I had hoped. It is quite a lot smaller than what I expected (smaller than a softball), but I didn't pay much attention to the dimensions when I bought it. It's great for kids and even some adults. The fact that it works as a speaker is awesome for everyone. I would buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Cheyenne L. Miller",
      "helpful_votes": 2,
      "publication_date": 20170228
    },
    {
      "title": "Better than I expected",
      "text": "This thing is actually really good. I wasn't expecting the speaker to sound good. And it sounds really solid. The light patterns are great, and the variety is pretty good too. I don't give 5 really, but this is a solid 4 stars all day. No remote being the only gripe I have.",
      "rating": 4.0,
      "verified": true,
      "author": " Rare_breed ",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "Updated  review - works great!",
      "text": "UPDATED: I originally plugged mine in and it would not power on. I was very disappointed and returned it. The seller/manufacturer contacted me and sent me a new one to try and I received it today. It worked perfectly and lit up my entire ceiling which is about 18 x 14 feet or so. This is with the dome removed. Very pleased with the replacement. Thank you to the seller.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristi",
      "helpful_votes": 2,
      "publication_date": 20170205
    },
    {
      "title": "My neice loves it!",
      "text": "I bought this as a gift for my 5 year old niece. She absolutely fell in love with it the moment that I showed her what it was and how to use it. I love the fact that it is simple to teach a kid how to use all of the functions on it. The speaker played loud than what I was expecting. Only reason why I deducted a star, is because I wish the lights would expand more across the room.",
      "rating": 4.0,
      "verified": true,
      "author": "EBONE'",
      "helpful_votes": 0,
      "publication_date": 20180921
    },
    {
      "title": "This night light is super cool!",
      "text": "This night light is super cool!! It offers a few different lighting patterns and colors and definitely makes enough light to light up a room while also keeping it dark enough so as not to disturb sleep. I have actually just laid in bed watching the lights go around the ceiling because its so mesmerizing and my 2 month old baby loves looking at it while falling asleep. I actually took the dome cover off the top and like the view better that way. Overall, I am very impressed with this night light and definitely need one for each of my children's bedrooms.",
      "rating": 5.0,
      "verified": true,
      "author": "Jamie House",
      "helpful_votes": 0,
      "publication_date": 20160413
    },
    {
      "title": "Seems to work okay, I didn't realize the light was used every time with a timer.",
      "text": "To clarify, there is no way to run the light all the time, it shuts off after an hour of use. I knew it had a one hour timer, however I thought that was an option to turn on (the timer). I guess part my fault for not reading more reviews first. However I should have ordered the upgraded version for the longer run time. 8 hours would be great for me.",
      "rating": 3.0,
      "verified": true,
      "author": "Grateful Daisy",
      "helpful_votes": 0,
      "publication_date": 20190205
    },
    {
      "title": "Automatic shut off after 1 hour!",
      "text": "I missed the part of the description where it says it shuts off after one hour. I bought this for my young daughter that is scared of the dark. It has served it's purpose, she stopped talking about the bad guys in her room. However, she knows it turns off and that scares her now. I am upgrading to the newer version that will stay on, if you are buying for a small child I suggest you skip this version. This light is great though, it is really pretty and she loves it. She likes to lay blankets down and just watch it during the day. It is a great buy, my only issue was the timer.",
      "rating": 4.0,
      "verified": true,
      "author": "fox",
      "helpful_votes": 0,
      "publication_date": 20170830
    },
    {
      "title": "Great little light show!",
      "text": "My husband and I love this light! We use it without the cover, as it makes much brighter designs that way. You can use it safely with or without the cover. We use it late at night when we don't want any lights on, but don't want it be super dark either. The colors and designs are quite relaxing! I deducted 1 star because the speaker does not work very well, but I didn't purchase this product for that feature anyway! I do wish it stayed on longer, but its nice that it shuts itself off so it isn't wasting power all night.",
      "rating": 4.0,
      "verified": true,
      "author": "Katrina W.",
      "helpful_votes": 0,
      "publication_date": 20160820
    },
    {
      "title": "Light/laser is NOT bright",
      "text": "It's way too dim to be used and you have to be in a completely dark room for it to show up on the walls/ceiling. Even then the colors aren't that bright or vibrant as advertised.",
      "rating": 3.0,
      "verified": true,
      "author": "peony",
      "helpful_votes": 0,
      "publication_date": 20200516
    },
    {
      "title": "Awesome light",
      "text": "This light is actually amazing. I got the white one for my girlfriend as a small side gift for Valentine’s Day and she loved it as well. We’ve spent many nights staring at the walls and ceiling just mesmerized by the lights. Great to look at while on any psychedelics, and always enjoyed at parties. Highly recommend to everyone.",
      "rating": 5.0,
      "verified": true,
      "author": "MSnakeK",
      "helpful_votes": 0,
      "publication_date": 20200426
    },
    {
      "title": "Never Operable",
      "text": "I received this product the day before I went out of town for a month and it never actually worked. I'm sure I got a defective model but did not have time to return it because I just missed the Amazon return window when I got back from my trip. I tried a few different ways to power this on hoping that it could function but unfortunately looks like I wasted money on this product. If it never worked to begin with I highly doubt it would've even lasted very long, hope this manufacturer ups their quality control as they seem to have quite a few products on the market.",
      "rating": 1.0,
      "verified": true,
      "author": "Myranda",
      "helpful_votes": 0,
      "publication_date": 20180924
    },
    {
      "title": "decently giftable",
      "text": "This product a great idea for a gift. unfortunately it jus wasn't as bright as I had hoped. The remote control feature is great and I liked being able to change the settings at a distance.",
      "rating": 3.0,
      "verified": true,
      "author": "Wayland",
      "helpful_votes": 0,
      "publication_date": 20200605
    },
    {
      "title": "Stopped working correctly",
      "text": "I bought 2 of them at the end of March, as a present for my daughters in April. It was lightly use since offered. Both of them started to not function properly in the last few days !! and in both case, it seems to be a bad plugging connection... it does not turn on, or the music is scattered. Of course, we can't return it anymore with Amazon... My girls are heartbroken as they loved it and I feel like I've been duped. It is a well rated item and it lasted less than 2 months !!",
      "rating": 1.0,
      "verified": true,
      "author": "Mle M.",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "Needed something to jazz up the mancave",
      "text": "Love it! I had my buddy order one when I did all of the color and accent lighting for his man cave. It was pretty \"meh\" until we popped the cover off. That's when I realized I had to get one for my room as well. UPDATE: The manufacturer reached out to me after apparently reading my original update, which detailed the failure of the motor. They replaced the item free of charge. I have re-rated the product to reflect a working unit. UPDATE: Motor is once again making noise just like the first one before it failed. Not good. :(",
      "rating": 5.0,
      "verified": true,
      "author": "Rex Kramer",
      "helpful_votes": 0,
      "publication_date": 20151107
    },
    {
      "title": "YES, it WILL turn off after an hour, and NO, there's no way to disable that",
      "text": "This is a good product, although I believe I might've gotten a lemon, as I've been using this product for just a little under two months, and it's already making a really loud, irritating grinding noise whenever the light source slowly rotates to produce the wonderful light effects on the ceiling. Before the grinding noise, my biggest complaint was that it turns off after an hour, but the fact that it does so is pretty clearly stated on the product information and in the answered customer questions. I'm pleased with the product overall -- just not particularly enchanted by the unit that I got!",
      "rating": 3.0,
      "verified": true,
      "author": "Avery",
      "helpful_votes": 0,
      "publication_date": 20160111
    },
    {
      "title": "Awesome!",
      "text": "I think this is the best purchase I've made all year. If you want it to be really bright and detailed take off the little dome cover but I like the dome cover for nights I just want to have a little light going. The speakers are as good as any phone speakers (maybe better, I don't know) but I wish there was a brightness control like there is a volume control. Otherwise, super cool and I'm so glad I bought this.",
      "rating": 5.0,
      "verified": true,
      "author": "Samantha Barthel",
      "helpful_votes": 2,
      "publication_date": 20161206
    },
    {
      "title": "Very cool lighting effects with this lamp",
      "text": "Very cool lighting effects with this lamp. It has the option of real sharp dancing lines with the cloud effect behind, or a covering lens that softens the entire effect. It also acts as a speaker so you can plug your MP3 player or whatever into it, but it is very quiet with my devices. It will take USB to power it or use the 110V converter. My only complaint with this item is it times out after a short while and turns off so if you want to turn it on and forget it, you are out of luck. I had to reset it about 6 times over my last party.",
      "rating": 3.0,
      "verified": true,
      "author": "tlwilkes1",
      "helpful_votes": 0,
      "publication_date": 20151109
    },
    {
      "title": "Alright for$20ish",
      "text": "Not bad for around $20 i wish it were a bit brighter, and there wasn't an auto off timer. But if you aren't using the speaker you can defeat that. See pic!",
      "rating": 5.0,
      "verified": true,
      "author": "HarleyR.inFL",
      "helpful_votes": 0,
      "publication_date": 20200919
    },
    {
      "title": "Love, love love this",
      "text": "Love, love love this! I was very pleased about the display of lights this device puts off. My 14 year old used it during his birthday party and all of his friends felt like they were in a dance club atmosphere. You can take the top off to display sharper looking lights or you leave the top on to display a soft light. The lights also fill the whole room. My 6 year old uses this as a night light every night. You can also change the light movement setting to be fast or transition slow. Well worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160602
    },
    {
      "title": "Amazing customer service.",
      "text": "After writing this review, customer service immediately contacted me and refunded my money. I'm so happy that this company stands by their product and cares about customer service. I will be doing business with this company defiantly in the future and really do love their product. Worked fine for a week, then 1 hour timer stopped working. After that the internal motor quit working a few days after that. When it worked properly the product was amazing.",
      "rating": 5.0,
      "verified": true,
      "author": "JMG",
      "helpful_votes": 0,
      "publication_date": 20151201
    },
    {
      "title": "Love it",
      "text": "I love this product. Relaxes me. Shuts self off in hour which is good for what I need it for. Looks really awesome across my whole ceiling and nice thing is u can tilt the light so the light effect covers more area.",
      "rating": 5.0,
      "verified": true,
      "author": "alyssa",
      "helpful_votes": 0,
      "publication_date": 20200323
    },
    {
      "title": "My girls LOVE this night light",
      "text": "My girls LOVE this night light! And the best part is the fact that it has a timer for 2 hours allowing them to fall asleep with it on but then I don't have to turn it off nor does it wake them up if they are having a hard time staying asleep. The colors in it are all very fun and the northern lights look could be better. It is a little pricey in my opinion for a night light but it works so well and is of top quality that I am more than happy to pay the $20 for it.",
      "rating": 5.0,
      "verified": true,
      "author": "cmoulton",
      "helpful_votes": 0,
      "publication_date": 20160828
    },
    {
      "title": "Helps the kids fall asleep",
      "text": "This night light has greatly helped settle our kids for bed. They love watching the dancing lights as they fall asleep. Pros: Very bright and vibrant colors. Love the dancing, rotating feature. Has different color and speed settings that the kids like to choose from. Helps settle the kids and give them something to keep them occupied while they fall asleep. The 1 hour timer is perfect. Cons: Was a little hard to position. Kids insisted on using it without the dome cover, so the lights were very strong and it needed to be put above eye-level so it wouldn't shine in their eyes. Would be nice if the power cord was longer.",
      "rating": 5.0,
      "verified": true,
      "author": "AmazonFam",
      "helpful_votes": 0,
      "publication_date": 20151230
    },
    {
      "title": "Love it! perfect for a kid's room",
      "text": "I was waiting for Christmas to have my child open it, but decided to take a look at it. Love it! perfect for a kid's room. Lights are fun to watch and not so bright as to keep you awake. Has ability to attach a music device, volume control and a few different light patterns to choose. Cool gift!",
      "rating": 5.0,
      "verified": true,
      "author": "soozeeque",
      "helpful_votes": 2,
      "publication_date": 20161209
    },
    {
      "title": "Bummed that it broke!",
      "text": "This would be an easy 4 stars if the rotation function did not stop working after 2 months. I'm so very disappointed, as I would have probably purchased more than one (it's that cool.) I was out of the Amazon 3-day window, though I wish I could exchange this one for a working model that would continue to work. It would be a 4.5-star product if it had the capacity to turn on and off at will, as well as the 1-hour timer. So sad.",
      "rating": 2.0,
      "verified": true,
      "author": "Karen",
      "helpful_votes": 0,
      "publication_date": 20160528
    },
    {
      "title": "Stunning!",
      "text": "Stunning! Best bang for your buck light that borders or exceeds professional light shows! No remote with mine but I think this version doesn’t come with one.",
      "rating": 5.0,
      "verified": true,
      "author": "Djb manifested",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "Life-saver for bedtime",
      "text": "This was a life-saver for my boys. They absolutely love this, and use it every night when they go to bed. Take the globe off and it makes a lot better designs on the ceiling. It was a little distracting to them for the first couple of nights, but became very soothing and calming after that. The blue and green settings are a little too bright for my liking, but the red setting is just right.",
      "rating": 5.0,
      "verified": true,
      "author": "Kurt C.",
      "helpful_votes": 0,
      "publication_date": 20161013
    },
    {
      "title": "This worked great. Only thing I see is we can t ...",
      "text": "My son really enjoys this as a night light/ bedtime soothing light. He went from his mobile as a baby to projector only from mobile and then once he reached 4 it was too baby-ish and he wanted a \"big boy\" night light thing. This worked great. Only thing I see is we cant make it stay just blue which is his favorite color. Other than that it's easy for a four year old to turn on and it sits on his toy box like a night stand. (Looks better on ceiling with the cover removed though)",
      "rating": 4.0,
      "verified": true,
      "author": "lweiss",
      "helpful_votes": 0,
      "publication_date": 20160612
    },
    {
      "title": "Amazing.",
      "text": "Omg pictures don't even do it justice. At first I plugged it in with the globe on top and I thought it was cool. But I took the top part off and omg so much brighter and just amazing looking. Super relaxing. You can tell this product probably won't last long but the price isn't bad I would def keep purchasing this.",
      "rating": 5.0,
      "verified": true,
      "author": "Michaela",
      "helpful_votes": 2,
      "publication_date": 20160926
    },
    {
      "title": "This product is great. I bought it for my newborn because he ...",
      "text": "This product is great. I bought it for my newborn back in 2018 because he loves lights and colors. He adored it. Talked to it and stared. Different settings, very beautiful. Read some negative comments but truthfully, if it breaks or burns out I'll buy another. It's cheap enough and I'm satisfied. Hard to find good projectors. 2020 re-bought it for my newborn son hoping he loves it the same. Adore this product",
      "rating": 5.0,
      "verified": true,
      "author": "Heather Y. ",
      "helpful_votes": 0,
      "publication_date": 20170225
    },
    {
      "title": "Soothing Light",
      "text": "This is a nice soothing light to stare at when laying in bed. It shuts off automatically after an hour so I just drift off to sleep with no worry of having to turn it off. The one I purchased had a crack in the plastic globe that fits on the top, but I do not use that part anyway. The built in speaker is not that great and I do not use it at all. This company should just do away with the speaker all together as it really serves no purpose.",
      "rating": 4.0,
      "verified": true,
      "author": "fishsticks",
      "helpful_votes": 0,
      "publication_date": 20160812
    },
    {
      "title": "Soothing nightlight or disco party - you choose!",
      "text": "My son and I both love this. Makes a great nightlight as it turns off automatically almost like it can sense when the child has gone to sleep (it can't sense it, it is a timer, duh). He likes the second setting the best, it is calming. Some of the options are like being in a disco hall, which works for an instant dance party. Can't go wrong either way.",
      "rating": 5.0,
      "verified": true,
      "author": "AspenLiv",
      "helpful_votes": 2,
      "publication_date": 20160927
    },
    {
      "title": "Looks fantastic when it works.",
      "text": "The motor stopped on first use... It's the first of 2 I got, identical to the ATiC. The seller noticed a poor rating and took all the steps necessary to correct the problem. When this product works it is great! I am hoping this one lasts a long time. If it doesn't I think the seller will make it right. Excellent customer service!",
      "rating": 5.0,
      "verified": true,
      "author": "Justin Tyme",
      "helpful_votes": 0,
      "publication_date": 20180114
    },
    {
      "title": "Birthday Gift",
      "text": "Just received this week, and it's great! It's a birthday gift for my little sister and she's so happy to have received it. The lights look really cool when projected on the ceiling and the speaker is a great addition. You don't have to play music for the light to work, there's a separate button for both. Now she won't be scared of sleeping in her own room. Thanks for a great product!",
      "rating": 5.0,
      "verified": true,
      "author": "Laura",
      "helpful_votes": 0,
      "publication_date": 20160922
    },
    {
      "title": "Bright and amazing light show, super fast shipping!",
      "text": "I had received one before it, the motor broke upon arrival. I contacted Little Red Lion customer service to try and send it back: They credited me another one free of charge and told me to keep the old one. The new one works perfect and the show is incredible! I'm currently using it behind my TV with the softcover on the back so it looks like there's an aurora light show behind my tv. I always get compliments when people walk in my room and people ask where I got it from.",
      "rating": 5.0,
      "verified": true,
      "author": "Rich",
      "helpful_votes": 0,
      "publication_date": 20160106
    },
    {
      "title": "My lo loves this lamp",
      "text": "This has changed my life! My 7 yr old sleeps in her own bed bec of this purchase! Its bright but not glaring. She loves it",
      "rating": 5.0,
      "verified": true,
      "author": "Amazonluva",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "Perfect cute night light",
      "text": "LOVE LOVE LOVE. My younger two girls have this light in their room.. They love it and alternate who chooses the light color ever night. I have not explored the music aspect as of yet but will in the future. For now the light color options are perfect and my girls are happy. So I am as well! Times out after an hour or so. You don't have to worry about having to go in later to turn it off.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrea the Domestic Goddess",
      "helpful_votes": 0,
      "publication_date": 20170107
    },
    {
      "title": "1 hour shut off = return!!",
      "text": "I guess I missed the part about a 1 hour shut off. This makes it a deal breaker.. it’s a night light for little kids it should stay on through the night!",
      "rating": 1.0,
      "verified": true,
      "author": "Cory Croteau",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "My cat and I love it",
      "text": "I purchased this as an amusement for my cat, who needs more environmental stimulation. She loves it, and I think it's pretty awesome, too! It has an automatic shut-off and I've already dropped it a few times--it's totally solidly built. I highly recommend it!!",
      "rating": 5.0,
      "verified": true,
      "author": "MAF",
      "helpful_votes": 2,
      "publication_date": 20161213
    },
    {
      "title": "Not the cheapest night light, but definitely the coolest!",
      "text": "The build quality looks good, and the lighting effects are very cool! I like how there are two brightness/design options depending on whether or not you leave the top hemisphere on. Also, I didn't realize that the unit has a speaker and aux in! Even comes with an aux cord, very nice. My only comment is that it would be cool to choose the speed at which the visuals rotate. Aside from that, it's perfect!",
      "rating": 5.0,
      "verified": true,
      "author": "DyM",
      "helpful_votes": 0,
      "publication_date": 20160106
    },
    {
      "title": "Cute and Quiet.",
      "text": "Its a Christmas present but I plugged it in and tested it. VERY quiet, which surprised me after reading the reviews. Maybe its been improved since they earlier reviews or maybe I got lucky and got a good one. I could see the colors on the wall even in a fairly lit room (It was daytime when i tested). Small device wont take up much table space. I doubt it projects on an entire room but if your laying in bed aren't you really just looking straight up anyway? So far no complaints!",
      "rating": 4.0,
      "verified": true,
      "author": "Tammy",
      "helpful_votes": 0,
      "publication_date": 20151222
    },
    {
      "title": "Junk",
      "text": "The rotation of the device stopped working after about five minutes of use. Save your money. Very poor product.",
      "rating": 1.0,
      "verified": true,
      "author": "Richard",
      "helpful_votes": 10,
      "publication_date": 20160406
    },
    {
      "title": "Not what I expected.",
      "text": "The amount of light/color that this item puts out in no way compares to that of the picture in the ad. It might be okay in a very small room, but don't expect much \"wow\" factor in a medium sized room. I agree, too, with other reviewers that if the object is at eye level it is too bright. Unfortunately that brightness at eye level doesn't get projected to the ceiling. I tried the cover off, as well, and got a really vibrant red cross on the ceiling which reminded me of splattered blood you'd see on a TV crime scene! (I did not try out the speaker). I am returning.",
      "rating": 2.0,
      "verified": true,
      "author": "S Guzman",
      "helpful_votes": 0,
      "publication_date": 20151214
    },
    {
      "title": "Great for an insomniac!",
      "text": "Bought this for my mother who loves anything that lights up and she loved it. After it arrived, I decided to test it out just to see what the big deal was all about...MAN was I surprised. The beautiful auroras created on the ceiling were so relaxing and almost put me to sleep. While both ways produce interesting visuals, I recommend removing the plastic lid for the more serene, calming effect. Considering buying one for myself now, too.",
      "rating": 5.0,
      "verified": true,
      "author": "Lili St. Cyr",
      "helpful_votes": 0,
      "publication_date": 20160701
    }
  ],
  "product_meta": {
    "title": "Aurora Night Light Projector Lights, Soaiy, 8 Changing Aurora and 360°Rotatable, 1h Auto closes , Built-in Speaker, for kids or Adults to Sleep Soothe, Insomniac and Anxious Relax, Party Lights-White",
    "rating": 4.1,
    "feature_bullets": [
      "[Amazing aurora projector light ]- Project realistic active aurora borealis and nebular on ceiling or wall (as shown in the pictures on the left when the dome cover is removed), create an enjoyable and relaxing bedtime experience for children, soothe and comfort kids to sleep, also perfect for adults to attain a relaxing and calming effect.",
      "[8 Aurora Projection Modes]- red, blue, green and 3 colors allochroism, colors gradient, you can choose which color show depending on your mood. All colors combination shows you the Aurora relaxing magic world.45 degree tilt, allow you to project the light straight up or point in a different direction, convenient for you to cover a larger area and get the wide panoramic effect",
      "[Built-in Speaker]- Volume adjustable, there is a audio cable in the package , you can plug in an iPod, iPhone, MP3 or other device and with another side plug into the light then play lullaby music or White noise, relaxing, Quickly fall asleep and eliminate anxiety",
      "[Automatically Shut Off ]- Auto Shut Off After 1 hour, you can go to sleep with it and it will shut down on it's own, really convenient in kids bedroom.",
      "[Safe for Use]- FDA approved and accession Number: 1710661-000, the laser is under 5mW , Class IIIA is safe and will not hurt eyes when normal using.[ One Year Warranty ]12 MONTHS EXCHANGE WARRANTY! To contact us please do the following: Go to Your Orders, find your order in the list, and click Contact Seller."
    ],
    "specifications": {
      "Manufacturer": "SOAIY",
      "Part Number": "SY-NL04",
      "Item Weight": "10.8 ounces",
      "Product Dimensions": "4.7 x 5.7 x 4.7 inches",
      "Item model number": "projector",
      "Is Discontinued By Manufacturer": "No",
      "Color": "Mood Light for Baby Nursery,",
      "Style": "Contemporary",
      "Material": "Plastic",
      "Shape": "Bulb",
      "Power Source": "Corded Electric",
      "Voltage": "5 Volts",
      "Wattage": "1 watts",
      "Item Package Quantity": "1",
      "Type of Bulb": "LED",
      "Special Features": "Dimmable, 3-way switching",
      "Included Components": "No",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "Warranty Description": "1 one package return, 12 months replacement, lifetime warranty.",
      "ASIN": "B00V7LPG6Y",
      "Customer Reviews": "4.1 out of 5 stars1,782 ratings4.1 out of 5 stars",
      "Best Sellers Rank": "#12,634 in Tools & Home Improvement",
      "Date First Available": "March 26, 2015"
    },
    "categories": [
      "Lighting & Ceiling Fans",
      "Tools & Home Improvement",
      "Wall Lights",
      "Night Lights"
    ],
    "price": 21.96
  }
}