{
  "website_summaries": [
    {
      "verdict": "A solidly constructed pool skimmer that easily picks up small and larger debris from both the pool surface and bottom without damage to the netting.",
      "pros": [
        "Picks up debris and even mud from the bottom of the pool, as well as skimming the surface",
        "Small debris doesn’t slip through the mesh, users note",
        "Durable mesh takes a few seasons to fade",
        "Owners who’ve needed warranty replacement are satisfied",
        "Good customer service"
      ],
      "cons": [
        "Rake feels too heavy for some owners",
        "Nabbing surface debris efficiently takes a bit of practice",
        "Net can be difficult to empty and clean"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Excellent Warranty",
      "text": "I have NEVER had such fantastic service from a company. They truly have the best warranty and they definitely stand by their word with their 100% lifetime warranty. I had purchased a pool net and at the time I thought it was a bit expensive but I decided to try it anyway. Four years later it started to come apart at the top of the net. I contacted the company, they didn’t even want a picture of the net, and just sent me a brand new net. That is truly exceptional service. I will purchase from them again because the quality and replacement warranty is well worth the initial price. Thanks ProTuff!",
      "rating": 5.0,
      "verified": true,
      "author": "Garrett K.",
      "helpful_votes": 0,
      "publication_date": 20200828
    },
    {
      "title": "Almost survived a dust storm. Almost.",
      "text": "We have been super happy with our pool skimmer from ProTuff. We get really bad monsoons where we live in AZ, and recently a particularly nasty dust storm came through and blew several of our pool items not just through our yard but into neighboring yards. Needless to say, the net survived almost totally unscathed. Which is pretty impressive, through close to 35-40 mph winds. However, it did get punctured so we decided to pursue a warranty claim which was astonishingly easy. 4 questions through facebook and now our new one is on the way. I'm so impressed. Thanks ProTuff!",
      "rating": 5.0,
      "verified": true,
      "author": "Aria M.",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "LifeTime Warranty is a big Advantage!",
      "text": "I love my ProTuff pool net and have used it constantly for the last 4 years. It works great especially for all the leaves and small sediment that collects at the bottom of the pool. I noticed a very small tear in the bottom of my net this summer and remembered that this net had a Lifetime Warranty. I contacted ProTuff Products and the customer service was great. They promptly sent me a new net! It's rare that companies stand by their products with such a Lifetime guarantee!",
      "rating": 5.0,
      "verified": true,
      "author": "C. E.",
      "helpful_votes": 0,
      "publication_date": 20200912
    },
    {
      "title": "Amazing replacement policy",
      "text": "I have a large pool that requires frequent, almost daily cleaning. The skimmer I bought in May, 2018 developed a hole in one of the seams. I contacted the company and they replaced the product within just a few days at no charge to me. Thank you Pro-Tuff, you have a lifelong customer.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20200822
    },
    {
      "title": "This is the one to buy",
      "text": "I have had the Pro Tuff skimmer net for 2 1/2 years. It is super. Previously, I was going through skimmer nets every 6-8 months as they would rip, etc. This one does not. Strongly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200926
    },
    {
      "title": "Best we've had !",
      "text": "Our pool is set in a heavily wooded area -- what is there to say?",
      "rating": 5.0,
      "verified": true,
      "author": "juliebee",
      "helpful_votes": 0,
      "publication_date": 20200908
    },
    {
      "title": "Customer Service Amazing",
      "text": "Not only is this a perfect net, customer service is handled by a live person without a protracted computer dance. Friendly/Professional & LISTENS. I almost keeled over from disbelief !",
      "rating": 5.0,
      "verified": true,
      "author": "OL",
      "helpful_votes": 0,
      "publication_date": 20201117
    },
    {
      "title": "Terrible warranty!",
      "text": "I have had this product for a couple of years, and now that it has broken, the 100% forever guaranteed warranty is no good because the company has said that this product is no longer available. DO NOT BUY anything from them.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201027
    },
    {
      "title": "Expensive but the best I have owned",
      "text": "Net worked great and when I experienced a failure they replaced it with no questions asked. I was so impressed with their customer service I purchased one for my neighbor and their pole. I will post a review of the pole after I use it for a period of time.",
      "rating": 5.0,
      "verified": true,
      "author": "James Plog",
      "helpful_votes": 0,
      "publication_date": 20201130
    },
    {
      "title": "Outstanding Customer Service- Warranty",
      "text": "I had an issue with the rake after 4 years. Protuff honored their full lifetime warranty and replaced it in no time and with no hassle. Very impressed with both the product and the customer service. Outstanding.",
      "rating": 5.0,
      "verified": true,
      "author": "Narmela Nakhjavani",
      "helpful_votes": 0,
      "publication_date": 20201216
    },
    {
      "title": "Not so durable but good warranty",
      "text": "Mesh bottom broken after a year and a half medium usage. Emailed them and got replacement right away!",
      "rating": 4.0,
      "verified": true,
      "author": "Ken",
      "helpful_votes": 0,
      "publication_date": 20201107
    },
    {
      "title": "Best leaf rake ever",
      "text": "In Florida we have year round pool cleaning. Had this product for 2 seasons and a piece of netting unraveled from clamp in frame. True to their warranty Pro Tuff had a new one to me within a few days. I was able to use the net until the new one arrived. Great product now finishing up third season on free replacement net, no problems.",
      "rating": 5.0,
      "verified": false,
      "author": "Colleen H Deemer",
      "helpful_votes": 0,
      "publication_date": 20200927
    }
  ],
  "product_meta": {
    "title": "ProTuff Products Medium Fine Mesh Hot Tub Spa and Swimming Pool Cleaning Leaf Rake Skimmer Net, 17.5 Inch (Net Only)",
    "rating": 4.7,
    "feature_bullets": [
      "SCOOPS DEBRIS: Clean and collect debris off the surface and bottom of your pool with this 17.5-inch pool rake net (net only; pole sold separately)",
      "MEDIUM FINE MESH: Features medium-fine mesh, great for larger or sharp debris like leafs, twigs, pine needles, and insects",
      "MADE TO LAST: Built strong with heavy-duty plastic rim and aluminum alloy frame with winged handle connector that won't bend, twist, or break as you clean",
      "STRONG NETTING: Double-stitched, double-layer nylon pool net bag holds up to 50 pounds of debris, and resists abrasion, mold, mildew, tearing, and snags; Netting holds its shape, making it efficient for cleaning",
      "EASY TO USE: Easy to use with tapered bag that glides through the water and an angled frame that's great for cleaning pool sides; Won't scrape, scuff, or mark your pool walls or floor"
    ],
    "specifications": {
      "Item Weight": "16 ounces",
      "Manufacturer": "ProTuff Products",
      "ASIN": "B00VO01W1G",
      "Customer Reviews": "4.7 out of 5 stars288 ratings4.7 out of 5 stars",
      "Best Sellers Rank": "#131,543 in Patio, Lawn & Garden",
      "Is Discontinued By Manufacturer": "No",
      "Batteries Required": "No"
    },
    "categories": [
      "Pools, Hot Tubs & Supplies",
      "Rakes, Skimmers & Nets",
      "Patio, Lawn & Garden",
      "Home & Kitchen",
      "Cleaning Tools & Chemicals"
    ],
    "price": ""
  }
}