{
  "website_summaries": [
    {
      "verdict": "Our pick if you want a manual log splitter or have a very tight budget and won't need to split a lot of logs at once.",
      "pros": [
        "Splits logs up to 18 inches long and 8 inches wide",
        "Made of sturdy steel",
        "Two-year warranty",
        "Easy to use, does not require a ton of strength"
      ],
      "cons": [
        "Requires more physical labor than electric or gas-powered splitters",
        "Can only tackle small to mid-sized logs"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Don't believe all the fake reviews, this is log splitter is complete garbage",
      "text": "I purchased this log splitter based on the overwhelmingly positive reviews it had. As others have pointed out a lot of the 5 star reviews have to be fake. It is simply too slow to operate for people to be able to split logs as quickly as they claim. It is also not built to last either. I didn't have a chance to use mine until after the return period had ended and it broke the very first day I used it. Save your money and either split your logs the old fashioned way or pony up a little more to get a gas or electric splitter.",
      "rating": 1.0,
      "verified": true,
      "author": "Eric",
      "helpful_votes": 49,
      "publication_date": 20180708
    },
    {
      "title": "My husband is very pleased with his new \"toy\"!",
      "text": "I bought this for my husband, and he has been very pleased with his log splitter. It is light weight compared to big electric splitters. It does NOT need electricity. It can be folded up and stored in a small space. It is easy to move to wherever he is working. He says I did \"good\" choosing this new toy for him to play with!",
      "rating": 5.0,
      "verified": true,
      "author": "Pamela Dalton",
      "helpful_votes": 23,
      "publication_date": 20170112
    },
    {
      "title": "Great and love it but it only fits 18\" logs",
      "text": "I couldn't live without this splitter now. I used it to split down pieces into smaller starter logs. it splits them with ease. It's quite and I can split as much wood as i want even at midnight and not wake up the house or neighbors. The only complaint I have with it is that it only fits 18\" logs. So if you have a piece that is slightly larger, you can't split it. Bummer. This thing should be a 20 Inch to give you that flexibility of pieces cut accidentally slightly over the 18\" mark.",
      "rating": 4.0,
      "verified": true,
      "author": "F. Digiovanni",
      "helpful_votes": 14,
      "publication_date": 20170412
    },
    {
      "title": "Great Way to Burn Calories",
      "text": "Product arrived as expected. Pleased with the power and performance. Always wear your personal protective equipment and have bystanders keep their distance, especially if you are splitting large, dry hardwoods. There is alot of energy stored in the ram and we had some pieces of dry logs fly when it finally split. Also, to prevent splitter movement, it works best if it is placed against a frame or stump. Quiet operation and a great way to assign chores to your teenage kids.",
      "rating": 5.0,
      "verified": true,
      "author": "WASECPRO",
      "helpful_votes": 9,
      "publication_date": 20181117
    },
    {
      "title": "Broke on the 10th split - its a shame - such a good concept",
      "text": "I loved the idea of a log splitter that would let me get a bit of exercise while safely splitting logs for the fireplace. Unfortunately the hardware does not appear to be up to the task. After splitting about 10 logs the pump stopped working - no leaks or obvious issues, but the piston does not move when pumping and the arms give zero resistance. The pump mechanism must have failed internally.",
      "rating": 1.0,
      "verified": true,
      "author": "S. David Andersen",
      "helpful_votes": 6,
      "publication_date": 20190407
    },
    {
      "title": "Excellent value!",
      "text": "talk about ease of splitting. just went through a half cord with zero issues. Handles could be a little longer to alleviate back strain, other than that, this thing gets it done. Excellent value!",
      "rating": 5.0,
      "verified": true,
      "author": "JASON FRASER",
      "helpful_votes": 27,
      "publication_date": 20160422
    },
    {
      "title": "Split One Log, and that's it",
      "text": "I was able to split one log, then the ram was stuck in the fully extended position and would not return. No matter what I did it would not return. Opened the hydraulic fluid reservoir, and it was completely bone dry. Emailed Sun Joe / Snow Joe support, days now with no response. Beware.",
      "rating": 1.0,
      "verified": true,
      "author": "Daniel DaRocha",
      "helpful_votes": 10,
      "publication_date": 20181026
    },
    {
      "title": "Where the handles!",
      "text": "Ok this thing came, no box or anything just a label slapped on the thing, but where are the handles to move the hydrolics? Pictures show them so I would have thought they were included? So If i can get the handles I'll updat ethe review, otherwise I'm sending the whole unit back. all 97 # of it.",
      "rating": 1.0,
      "verified": true,
      "author": "L. Gyrion",
      "helpful_votes": 5,
      "publication_date": 20190715
    },
    {
      "title": "Me me sucked",
      "text": "This thing sucks. First I be broke and they sent new one for free. 2 months later, the second one broke",
      "rating": 1.0,
      "verified": true,
      "author": "sung chir",
      "helpful_votes": 8,
      "publication_date": 20190310
    },
    {
      "title": "Many hands make light work.",
      "text": "We just got 6 large trees , and four smaller ones cut down that we are chopping and splitting into firewood for the winter. That's a lot of wood to go throuh by hand, so we bought this hoping it would be quicker and easier. It is! It's so simple that my four year old (pictured) can help split the logs! I am so impressed with the quality and ease. The fact that the whole family can use it has made everything fast! When one of us gets tired, someone else can take over.",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley Brown Hahn",
      "helpful_votes": 3,
      "publication_date": 20190824
    },
    {
      "title": "A Total Piece Of Junk",
      "text": "Hydraulic system failed the second time I used it. A total piece of junk. Will not work at all now.",
      "rating": 1.0,
      "verified": true,
      "author": "Greg W.",
      "helpful_votes": 10,
      "publication_date": 20180306
    },
    {
      "title": "Cheap",
      "text": "After only about a month, only just weekend use, and not every weekend, at that, one of the cylinders broke. This thing is a good workout, but kind of cheaply made. Now to find their website to see about a fix.",
      "rating": 1.0,
      "verified": true,
      "author": "Terri Z.",
      "helpful_votes": 4,
      "publication_date": 20200102
    },
    {
      "title": "So-so could be better",
      "text": "Not real impressed. It works if the logs are the right length and the right diameter, but it's not practical because most wood 8 inch in diameter doesn't really need to be split. I'm thinking the wood needs to be very dry or seasoned to split easily. My wood must be kinda green cuz it was difficult to split. I also had problems with the bars bending. I put rebar in the handles and that helped a little. I should have done it before I used it but I shouldn't have to if the product was built to last. Also put hydraulic oil in right away cuz it doesn't have much in it when it ships.",
      "rating": 3.0,
      "verified": true,
      "author": "Kim H.",
      "helpful_votes": 0,
      "publication_date": 20180629
    },
    {
      "title": "No motor, no problem. Really fun and useful splitter.",
      "text": "Love this. Just did a big job and cut down 6 nearly dead 40 year old alder trees. They’re in between hardwood and softwood and we’re pretty dry. However I was able to easily exceed size limits and split some huge logs with it. It’s fun and works very well. One trick I realized was when I cut logs too short for piston to extend, I would just lay down a sledgehammer head to extend the reach and then split it. Love that my kids could help split big logs safely and love that it’s not another motor to maintain.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin",
      "helpful_votes": 5,
      "publication_date": 20171010
    },
    {
      "title": "Buyers beware make sure to have your warranty",
      "text": "Well I had to send back my first unit just a couple weeks ago and that was on February 24th 2020. They did honor the warranty on sent me a replacement unit now the unit was leaking from its seals. And after receiving the new one we've got it back around March 15th and we tried to use it here on April 1st and the same problem the seals brand new just out of the box it was leaking oil like a sieve call the company and of course Sun Joe honored the warranty and are sending another one hey it's a great unit Cuts wood perfect what their Hydraulics are not the greatest in the world.",
      "rating": 3.0,
      "verified": true,
      "author": "David ",
      "helpful_votes": 0,
      "publication_date": 20200402
    },
    {
      "title": "Good for a Small Amount",
      "text": "Works really well on seasoned wood, even oak. Green hardwood takes a bit of muscle power. I have had a few pieces that would not split but I just sat those aside for more seasoning time. Pay attention to the bar connecting the springs to the ram. I did bend mine a bit on a piece that was too hard to split. A little hammering and it was fine. If you don’t do cords and cords and chopping with an axe sounds like torture, this is the product for you.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20171028
    },
    {
      "title": "Best thing I EVER bought! LOVE this SunJoe hydraulic log splitter!",
      "text": "OMG!! I LOVE this log splitter!!! I am a city girl, 69 yrs old, in good shape, but I’m no Paul Bunyan ! I was very sceptical of buying my very own log splitter, but I can say this is the best thing ever!! It’s easy to use, does a great job. It comes ready to use. All I had to do is take it out of the packaging. I highly recommend this particular SunJoe splitter. No gas, no electricity, just easy peesy hydraulics. I’m very happy with this splitter. I feel so self-sufficient and independent!",
      "rating": 5.0,
      "verified": true,
      "author": "Sharon Frisch",
      "helpful_votes": 0,
      "publication_date": 20190110
    },
    {
      "title": "A great splitter without too much force",
      "text": "I just tried it yesterday and split a cord of hardwood without any issue. The only inconvenience was that I had to cut a small piece of wood to put between the tool and the wood to split when the target wood is short, if would be helpful if the vendor can come up with something like that with this product. I learned that the right handle requires less force if you feel too much resistance on the left side",
      "rating": 5.0,
      "verified": true,
      "author": "West",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "Everything is Perfect!",
      "text": "I use this product to make ice cream. What a silly question! I use it to split wood. It comes in quite handy. I used to use a large, motorized wood splitter, as we cook and heat with wood, but now that I am in my 70's, a smaller splitter is easier to use because I no longer collect my own wood. I buy it already mostly split, and just have to adjust some of it to fit my stoves. It works perfectly. And the Seller was extremely cooperative and quick when the first splitter was lost in transport. I got the second one overnight! They were fantastic.",
      "rating": 5.0,
      "verified": true,
      "author": "Tali",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "Great log splitter if you don't burn a Hugh amount of wood.",
      "text": "The log splitter works very well. It will split oak very easy. Sweetgum trees are very hard to split, and it split it without difficult. My 8 year old grandson was able to split Sweetgum using this splitter. I was able to split a 5' bucket load of wood in about 30 minutes. The only problem is the splitter will wobble some with hard to split pieces of wood. I wish it has a cross member that would prevent this little problem. I may get a cross member welded on, or bolt it to a metal beam or 4x4, which would prevent the wobble. I would definitely buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Royce Miller",
      "helpful_votes": 0,
      "publication_date": 20181201
    },
    {
      "title": "Easy to use and effective",
      "text": "This splitter is great! It’s so much less effort than using an axe to split and much more affordable than electric or gas powered. It is a serious ab twist workout, so that’s really a bonus. I workout regularly and did this pile over two days, so about 2 hours each. If it wasn’t in the 90s I probably could’ve kept going. It’s a good workout. The worst part about it is that the wheels are super tiny and it’s not that easy to roll around. Being that it’s so heavy, they probably should have given it larger wheels. I saw in one review that someone made a cart for it.. I may do that eventually.",
      "rating": 5.0,
      "verified": true,
      "author": "Mmc",
      "helpful_votes": 0,
      "publication_date": 20200726
    },
    {
      "title": "Works well, much easier than hand splitting",
      "text": "My hubby loves this and I do too! He doesn't mind keeping a fire going more often and longer now that he's not splitting wood by hand any more. From what I hear when he tells friends about it, I'm sure he's probably sold a few more for the company that makes them",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle Harston",
      "helpful_votes": 8,
      "publication_date": 20161129
    },
    {
      "title": "Practical and effective for domestic use",
      "text": "I find the Sun Joe log splitter to be tremendous value. It is easy to move having wheels at the pump end of the assembly. It can also be stood on end and stored in a very small footprint. It splits logs easily with both a high-pressure and low-pressure hydraulic pump. It is perfect for use at home, too slow for somebody who splits would in bulk, and can reduce the split logs to the smallest sizes that might be wanted. I highly recommend it to somebody who doesn't want to waste money buying split word, and even when split wood is purchased sometimes the size needs to be reduced. Excellent value for money",
      "rating": 5.0,
      "verified": true,
      "author": "Anjin",
      "helpful_votes": 0,
      "publication_date": 20190328
    },
    {
      "title": "Eco-friendly and does the job",
      "text": "Although I have access to a gas powered splitter, I have to drive ten miles to get it, load it on a trailer, drive back home, unload it, split my wood, and the load it back on the trailer for the return trip. A fair amount of work before I even split any wood. I like this product because it is affordable, doesn't use any fossil fuel, doesn't have a noisy engine, and I get a nice workout when using it. Split about a half cord of wood today in four hours. The wood was seasoned, stringy ash, mostly eight to twelve inches in diameter. There was only one piece, a three way crotch that defeated Logger Joe.",
      "rating": 4.0,
      "verified": true,
      "author": "J R REICH",
      "helpful_votes": 2,
      "publication_date": 20170706
    },
    {
      "title": "Broke after second time",
      "text": "Unfortunately it broke the second time i tried to use it. I have on y had it 4 months and the customer service for Sun Joe in nonexistent. I have been trying the for 3 weeks. Only automated responses. Too bad I am out of the amazon return window or I would send it back. The guide rod that hold the ram broke and bent so now I cant use it safely.",
      "rating": 1.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20200702
    },
    {
      "title": "Perfect Light Use Splitter",
      "text": "This splitter works great - easy to use, has wheels so you can roll it out of the way when not in use and is solidly built. Since it is manually powered it's not the fastest splitter for high volume splitting, but perfect for occasional or light use. It will split decently sized logs with ease, and if you don't fully reset the hydraulics you can quickly reload and split another log with a few pulls on the levers. I highly recommend it! (I only say \"light use\" because of the speed - if you have the time to split a lot of wood it'll handle it.)",
      "rating": 5.0,
      "verified": true,
      "author": "R. Ritchey",
      "helpful_votes": 0,
      "publication_date": 20201022
    },
    {
      "title": "Very specific help.",
      "text": "Did not work as good as I had hoped. Your wood has to be cut very straight...any angle makes it impossible, it also has to be a pretty exact measurement, any thing too small or long won’t work, and trying to put two logs end to end to extend the leingth will not work. It also is not stable on dirt....it requires a hard floor, and is extremely heavy....it takes two people to move it, and it is suggested to keep it inside where it can’t get wet. It will pop a hard to pop log when all these situations are met however. To be honest I would have returned it had it been light enough to move.",
      "rating": 2.0,
      "verified": true,
      "author": "Pam Parker",
      "helpful_votes": 0,
      "publication_date": 20181114
    },
    {
      "title": "Excellent customer service",
      "text": "I really put this splitter through its paces in the first 2 months - over 5 cords of wood split, some of it really tough, twisted logs. I may have overdone it a bit. The ram plate got pretty twisted up in the process, so I emailed Sun Joe, and after a brief delay, they sent me a replacement part, with the option of replacing the entire unit if i couldn't complete the installation. I was able to replace the part and the splitter is like new. This company is amazing, I will consider buying their other products over other brands in the future.",
      "rating": 5.0,
      "verified": true,
      "author": "Maryanne Whitney",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "You might not be getting a brand new product. Otherwise I recommend it.",
      "text": "We are impressed how easy this is to use. My wife can split large logs as long as she can lift and get them loaded to split. I have one big issue. This item was supposed to be brand new and it’s not. It arrived with wood chips still on it and the decompression knob is bent to the side, damaged. It is still usable and it will be more trouble than it’s worth to return it, but I should get a USED/DAMAGED price for it. Just saying",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth A. Heston",
      "helpful_votes": 0,
      "publication_date": 20190512
    },
    {
      "title": "Worked only one day! Not happy.",
      "text": "Wanted to like this item, but used it for one day and then a piston/lever quit working. Probably just needs a new seal. It was the left one that gives it a lot of travel so now takes a long time to split one log. Customer service was no help and just referred me to Amazon support. I needed some new parts to fix it as I lugged it to a cabin in the mountains. Returning it would be very difficult and could not do that in a timely manner. Look for other options.",
      "rating": 1.0,
      "verified": true,
      "author": "Connor Griffin",
      "helpful_votes": 0,
      "publication_date": 20200612
    },
    {
      "title": "A good investment.",
      "text": "I took it out of the box and went to work and split 4 Elm logs in about 30 minutes. Most over 10 inches in diameter. The rapid lever made it quick to engage the wood, then the power lever did the work. As soon as the logs split I switched back to the rapid mode to finish them. Just make sure the logs are seasoned at least two months. One log wasn't dry enough and just wouldn't split even with close to the force limit. I agree with the customer who said the wheels could be larger, but overall this was a good investment. Will update if any problems arise that force me to read the instructions.",
      "rating": 5.0,
      "verified": true,
      "author": "Oldeneye",
      "helpful_votes": 0,
      "publication_date": 20180730
    },
    {
      "title": "It works!",
      "text": "It is heavy...that being said, I had trouble getting it in out of the rain after it was delivered. I finally opened it tonight, to get started splitting some wood. As a test left it in the box and tried one log in the house. The box kept the loose pieces from going anywhere. I was so pleased I tried another, then another, finally quitting after 10 logs that were sitting in the yard. Very happy and since i have 11 trees that were cut down 18 months ago this will be well used next spring and in the mean time for house firewood.",
      "rating": 5.0,
      "verified": true,
      "author": "Deborah B",
      "helpful_votes": 0,
      "publication_date": 20181230
    },
    {
      "title": "It’s okay I guess",
      "text": "I nearly broke this thing the first day. It is good for splitting wood with loose fiber, but a tree with a dense center will be too much for it. For those you need a 40 T or bigger.",
      "rating": 3.0,
      "verified": true,
      "author": "RICHARD H SCIBEK",
      "helpful_votes": 2,
      "publication_date": 20181106
    },
    {
      "title": "Great for small jobs.",
      "text": "I was a bit worried with a large number of fake reviews but I am very pleased with the results. Bit of background, I need to split approximately 1.5 cords of wood and didn't feel like destroying my back. I purchased this anticipating to have a few issues splitting wood but have only come across a few logs of elm where the stringy nature of elm made it more difficult to split. Overall its not a necessarily fast process but it also isn't a very arduous one either. I came and went fairly often to do different tasks but once I stayed and got into a system I could easily split my pieces in a fairly timely manner.",
      "rating": 5.0,
      "verified": true,
      "author": "Buyer Review",
      "helpful_votes": 0,
      "publication_date": 20181128
    },
    {
      "title": "Sturdy, well built and will split just about anything",
      "text": "Sturdy, well built and will split just about anything. I have split four cords of fir, pine and some oak with this log splitter with no problems. I have even split some 12 to 14 inch rounds with some effort. If you have logs that are 8 to 10 inch and you need a reliable and fairly inexpensive splitter this is it. It is a manual/hydraulic assist splitter so there is some effort on the operators part.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Bracke",
      "helpful_votes": 0,
      "publication_date": 20180201
    },
    {
      "title": "The pump has a high pressure side and a low pressure side",
      "text": "The user manual does not describe this two pressure feature. The Chat person for Sun Joe has no knowledge of it either. I was told to check for low oil by their Customer Service. Your tool is not broken it is designed this way . One handle will move the piston quickly to load the wood and the other handle pumped with less effort splits it. Sun Joe does not know how their own tool works. Your splitter is not broken. January 2020",
      "rating": 5.0,
      "verified": true,
      "author": "True Rating",
      "helpful_votes": 0,
      "publication_date": 20200122
    },
    {
      "title": "Works ok.",
      "text": "Splits wood well, but no pieces under 16 inches as piston reaches its limit. Leaked hydraulic fluid during shipping. Right side handle barely moves the piston as compared to the left side. Not sure if intentional, but it does help using just that side when pressure builds up making it difficult to move handles. Have filled and bled hydraulic fluid, with no change in performance.",
      "rating": 4.0,
      "verified": true,
      "author": "Thomas M. Cook",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "BEST purchase I have made!!! And I buy a LOT of stuff...",
      "text": "BEST purchase of 2017!!! This thing snaps frozen logs like butter. Wish we had bought one many years ago! I might not have had to have shoulder surgery...I love how easy it is to use and the fact that I can work it even if there is no power. We can still keep the fire going. I cannot say enough good about this or how happy we are with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Patricia Bondor",
      "helpful_votes": 0,
      "publication_date": 20171230
    },
    {
      "title": "This splitter is under-rated. It can handle BIG chunks of wood.",
      "text": "If you are willing to spend some time, you can make this splitter handle sections of wood a lot wider than 8 inches, as stated. I just had a 65' Pine dropped in my backyard. This splitter has been able to tackle the job of splitting this pine, even if the pieces are almost 2 feet across! Is it fast? No. Is it effective? Yes. 10 tons of force is a lot of power. I do not think there are any electric splitters with this much force, and if you go with a 10 ton gas powered splitter, you are talking major bucks. This is a perfect fit for a retired guy with time on his hands!",
      "rating": 5.0,
      "verified": true,
      "author": "Dr Mark",
      "helpful_votes": 0,
      "publication_date": 20180320
    },
    {
      "title": "FANTASTIC!!",
      "text": "I usually don't write a lot of review but this has to be said. FANTASTIC!! It snaps up kindling wood with ease. I am using it for my Chiminea on my porch because I needed thinner cut pieces. Also if you want to leave it on your porch just leave it in the shipping heavy lined box so the mess stays in the box and not all over you deck or patio. This way it stays near my burn area. GREAT PRODUCT!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "Back saver.",
      "text": "Well I use to do the old axe and sledge but after a few back injuries that took a toll on me so i wanted something i could use anywhere and found this. Was debating on just getting a electric one but decided to give this a shot and honestly I love it. I can use it anywhere and it doesnt effect my back. I could use it all day and be fine. Yeah it does go slower but it's a back saver.",
      "rating": 5.0,
      "verified": true,
      "author": "Jacob T.",
      "helpful_votes": 0,
      "publication_date": 20200629
    },
    {
      "title": "so far so good",
      "text": "It has worked every time I have used it, adhering to the diameter size limit. Let my neighbor borrow it, and he was splitting logs much bigger the the diameter limit, so am I now! and it works great. So people complain about the amount of work. I guess if you have lots and lots of wood, maybe so. But my experience is after you reach the pressure point, it is only two or three handle moves b4 the wood splits, i.e. not much work to me.",
      "rating": 4.0,
      "verified": true,
      "author": "RipWms",
      "helpful_votes": 0,
      "publication_date": 20190316
    },
    {
      "title": "would recommend",
      "text": "works very well, split a cord of wood yesterday, worth the money if you only use it once a month. would recommend it",
      "rating": 5.0,
      "verified": true,
      "author": "Horace",
      "helpful_votes": 7,
      "publication_date": 20161018
    },
    {
      "title": "Broke after 2 days",
      "text": "So I purchased the log splitter a few weeks ago and on the 2nd day of using it, the piston no longer holds pressure and will retract on its own if you don't continuously work the handles. This was after only splitting 5 logs during the 2 days. I contacted Snowjoe's through their chat messaging and was told that it would be taken care of. This was 3 weeks ago and I've still not heard anything back. I am disappointed in their customer service. If you call you're looking at an on hold and the chat even took 20 minutes for someone to take the chat and another hour to conclude.",
      "rating": 1.0,
      "verified": true,
      "author": "Michael D.",
      "helpful_votes": 0,
      "publication_date": 20200711
    },
    {
      "title": "effective and fast",
      "text": "splits logs up to maybe 10\" but this size is much easier to split if you use both hands on one handle. You can split a lot of wood in a short time. Have split about 1 cord so far, mostly cedar and maple, and it's still working fine. The wheels are ridiculously small and don't roll on anything except concrete. Hard to move the unit around, you have to drag it. It's pretty heavy to lift. I leave it in one place and bring the wood to it.",
      "rating": 4.0,
      "verified": true,
      "author": "B. G.",
      "helpful_votes": 0,
      "publication_date": 20181228
    },
    {
      "title": "Amazing!",
      "text": "This is an amazing piece of equipment. I wanted to split logs, not legs, so made this purchase. I have split half a cord of wood with (I am female and in my 70's). With the rollers on it, I can move it easily, even up a steel ramp into a storage shed when not in use. It was a little pricey, but worth it and have no regrets on the expense.",
      "rating": 5.0,
      "verified": true,
      "author": "Paula",
      "helpful_votes": 0,
      "publication_date": 20200302
    },
    {
      "title": "perfect",
      "text": "If you're looking for an easy way to split your firewood without breaking the bank, this is it. I'm a small woman, 5'1', and I can operate this easily. You might have to add a piece of wood to the back of the hydraulic if the piece you are splitting is pretty short, but otherwise, this is great and you don't have to spend a fortune on a gas powered splitter.",
      "rating": 5.0,
      "verified": true,
      "author": "Cait",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "Very Limited Uses",
      "text": "It's easy to use, but can only split a very specific length of wood. Seems like 18-16 inches is the prime splitting length, for the wood I was splitting, 16-12 would have been great but the splitter doesn't completely go to the end. I will keep it because it helps with some of the larger pieces I cannot easily split with my maul. Would recommend spending a little extra money and getting an electric or gas powered that will split nearly anything you want.",
      "rating": 2.0,
      "verified": true,
      "author": "darin green",
      "helpful_votes": 2,
      "publication_date": 20181010
    },
    {
      "title": "Excellent product",
      "text": "Excellent product, and I’m giving it 5 stars because it’s only $125. Comes with two handles: the left handle pushes the piston about twice as fast as the right. Be aware the stroke on the piston is about a foot, leaving about a 12 inch gap when fully extended, so you need a second piece of wood if you want to split short pieces. I don’t find that to be an inconvenience though. If you’re on the fence with this one, it’s worth the $$$",
      "rating": 5.0,
      "verified": true,
      "author": "ryan rogel",
      "helpful_votes": 0,
      "publication_date": 20181218
    },
    {
      "title": "Makes the job easier.",
      "text": "Does a great job of splitting large and small logs. Makes the job of splitting wood a lot less tiresome. You still need a good splitting axe because sometimes the log does not fully split (not completely dried out) and you reach the max extension of the piston. Then the axe can finish the work. Also on some larger (>8\" dia) you can start the split with the axe and the ram can finish it for you. The only complaint I have was the packaging was not good enough to survive the shipping process. See photos.",
      "rating": 5.0,
      "verified": true,
      "author": "GAM",
      "helpful_votes": 0,
      "publication_date": 20180306
    },
    {
      "title": "Makes Easy Work of Log Splitting",
      "text": "This is easy to use right out of the box. Simple, effective design for splitting wood - depending on how much you need to do. I go through a cord or so per year for an outdoor fireplace, so using this to split 8-10 logs each time makes quick work. If you are splitting large amounts of wood, this would get tedious, but if so you likely have a gas powered splitter already. Highly recommend for smaller home use.",
      "rating": 5.0,
      "verified": true,
      "author": "HPR",
      "helpful_votes": 0,
      "publication_date": 20200508
    },
    {
      "title": "Sunjoe makes life easier for sure!!",
      "text": "I took this Sunjoe hydraulic wood splitter out of the box and dropped it right on to a hand-truck and thats where it stayed. It works exactly as advertised and with the hand truck it makes it even more easy to transport. I’m very satisfied and very happy with this purchase. I would recommend this highly to anyone that has been splitting wood the old fashion way.",
      "rating": 5.0,
      "verified": true,
      "author": "Marshall Mathews",
      "helpful_votes": 2,
      "publication_date": 20191226
    },
    {
      "title": "Splits wood well, but heavy",
      "text": "First off, this is heavy. I’m a big guy but not a weight lifter. If you get this find a place for it so you don’t have to move it. It works quite well. You place the wood to be split against the pointed side and then work with a hydraulic jack which has two speeds. The pressure splits the wood. It works quite well. It’s just heavy.",
      "rating": 5.0,
      "verified": true,
      "author": "saxman",
      "helpful_votes": 0,
      "publication_date": 20200612
    },
    {
      "title": "Easy Peasy",
      "text": "Love it! So easy! Should've bought this before investing in axes/wedges. I have some stringy Cherry that would take me an hour to split a piece with axe/wedge/sledge hammer, I'd get it all stuck and still not split it, was exhausting. I put a piece in here, a few easy pumps with my fingers on one handle and wala!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20170523
    },
    {
      "title": "Heavy",
      "text": "It's rather heavy and hard to move around. I'm really disappointed that it doesn't split all the way through. It only goes maybe half way so don't except to split a lot of semi wet logs. It just wont' work. They need to be dry and hard or you will need to invest in gloves to pull the rest of the log apart.",
      "rating": 3.0,
      "verified": true,
      "author": "cheeseheadjf",
      "helpful_votes": 0,
      "publication_date": 20200403
    },
    {
      "title": "Great buy",
      "text": "Used this thing for about 6 hours today, slowly split about a half cord of Mac nut tree. some logs were between 12\" to 14\" Well I was hoping for the best but I got better I must say Sun Joe log splitter did surprise me, seems to be bullet proof. I highly recommend This item. Shipping was very fast came 4 days early, although it is heavy and I used it on concrete for stability.",
      "rating": 5.0,
      "verified": true,
      "author": "Andy Villa",
      "helpful_votes": 0,
      "publication_date": 20190406
    },
    {
      "title": "So far, so good",
      "text": "I have been looking for a log splitter like this one for a while now. It's well built. The splitter is easy to use and splits the wood fine. I would suggest using drier wood for smaller pieces - the 18\" limit is a real thing. My only concern is the hydraulic fluid. There appears to be some small amount of liquid at the base of the hydraulic case. There is also a video I saw that said this model sometimes needs the fluid replaced. It doesn't look like a big deal - but just some thing I noticed.",
      "rating": 4.0,
      "verified": true,
      "author": "Denis A. Engel",
      "helpful_votes": 0,
      "publication_date": 20200130
    },
    {
      "title": "Wood splitter ease",
      "text": "I read a lot of the reviews after I purchase this item. A lot of the reviews had said that this was too slow and did not accomplish what they set out to do. However I found it to be an awesome item a very good purchase it works exactly like I thought it would I’m not looking to speed things up I was looking just to split wood without use the use of gas or electric and that’s exactly what this does is a very good purchase I read it a number five across-the-board",
      "rating": 5.0,
      "verified": true,
      "author": "Scott Johnston",
      "helpful_votes": 0,
      "publication_date": 20191103
    },
    {
      "title": "Ideal for the fire ring lumberjack",
      "text": "Great product! Was a bit skeptical but hopeful when I bought this but ya proven itself more than capable for my needs. We’re city folk who occasionally enjoy a night around our backyard fire ring. This thing is perfect for splitting up logs to fit in the ring. Ridiculously easy to use and takes zero storage space. Win win for any city slicker.",
      "rating": 5.0,
      "verified": true,
      "author": "Bill",
      "helpful_votes": 0,
      "publication_date": 20200812
    },
    {
      "title": "easy to use",
      "text": "very awesome product. i love having bonfires and to have a log splitter like this that is so portable and easy to use is a plus. obviously there is some manual labor involved but dont have to worry about mixing gas or renting a log splitter. as long as your wood is dry it had no problem splitting 12 plus inch logs, although it is only rated for 8\". just make sure when you are cutting your logs not to exceed the 18\" maximum length. if you have shorter logs that wont quite split just put a block by the ram to fill the gap.",
      "rating": 5.0,
      "verified": true,
      "author": "Beth Rytkonen",
      "helpful_votes": 0,
      "publication_date": 20200311
    },
    {
      "title": "Great little tool!",
      "text": "I didn't want something bulky. Also wanted something my 11 year-old could use without me having to watch him every minute. This has been great! I probably use it for wood bigger than I should, but it has performed well. Also very nice to move and stand upward to save space in my shed. Very pleased!",
      "rating": 5.0,
      "verified": true,
      "author": "BMDavis",
      "helpful_votes": 0,
      "publication_date": 20200301
    },
    {
      "title": "Great tool, great value",
      "text": "Fantastic tool. I especially like having the two speed pumps. One lever is higher volume and works for most applications. The other is lower volume but higher pressure for the really tough logs. All in all, it's a great value on an awesome splitter. Remember, it is not gas or electric so your not going to break any speed records, but once you get into a rythm, it goes pretty fast.",
      "rating": 5.0,
      "verified": true,
      "author": "West_MI_Mark",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "Put it to the test",
      "text": "When I bought this splitter it was my intention to beat it til it couldn't take anymore.I've used it to split big,small and monster logs for the last 8 weekends.This splitter has surpassed my expectations.I have put this splitter pass it's limits and it is still going strong. I still have much more to split and have no doubt it can handle it.This is the best manual splitter I have ever purchased.I recommend it to all.",
      "rating": 5.0,
      "verified": true,
      "author": "Billy",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "awesome",
      "text": "awesome splitter but crappy wheels. how the crap are these tiny wheels suppose to be useful outdoors? they lock up like a skateboard on gravel at the tiniest thing, they can't support this thing on grass or dirt, cant take it across flat level paver stones because the back edges gouge the seams between two stones. i ended up just dragging it through the yard on a Rubbermaid tote lid.",
      "rating": 2.0,
      "verified": true,
      "author": "lunchbox",
      "helpful_votes": 0,
      "publication_date": 20190115
    },
    {
      "title": "Almost fun to use",
      "text": "Swinging the ax is getting hard, did not want the noise and pollution of the gas powered model. This is easy to use. We fastened it to an old hand truck to roll out of the garage. Products attached wheels are too small. Wood needs to be right size to be cut. Handles are a little wonky. I like this machine.",
      "rating": 5.0,
      "verified": true,
      "author": "Liz F.",
      "helpful_votes": 0,
      "publication_date": 20181212
    },
    {
      "title": "Slow, simple, steady. Perfect for knotty or large rounds.",
      "text": "Wahoo! This is an affordable, valuable tool for our farm. It is not fast. It is not dramatic or really all that satisfying to use, but I LOVE it. For rounds that are too large or too knotty to split efficiently with a maul, this is the tool. The little wheels are pretty much useless out in the field, so be prepared to lug this thing. It's already saved me a ton of time and effort.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessi Heys",
      "helpful_votes": 0,
      "publication_date": 20180405
    },
    {
      "title": "Great for home use.",
      "text": "I have a lot of wood that i need to split for firewood so i operate it in a concrete floor basement area. The feature I like best is the ability to move the piston relatively quickly with one handle and slower with the other handle. My wife and a female guest could readily split a solid log with reasonable effort.",
      "rating": 5.0,
      "verified": true,
      "author": "J Walker",
      "helpful_votes": 0,
      "publication_date": 20200923
    },
    {
      "title": "Works good",
      "text": "I didn't realize that the logs had to be of a st length to work. However, it works well for logs the right length. I even split logs much wider. Was a little tough on the fresh cut logs here an there. However, even in my 50's can still manually split using this device.",
      "rating": 4.0,
      "verified": true,
      "author": "Kengineer",
      "helpful_votes": 0,
      "publication_date": 20190801
    },
    {
      "title": "No Customer Service. You’re on your own.",
      "text": "The hydraulics stopped working after a few months and customer service will not return my emails. Even went to their website and posted a message. No luck. Now I have an expensive paper weight.",
      "rating": 1.0,
      "verified": true,
      "author": "Byron J.",
      "helpful_votes": 0,
      "publication_date": 20200609
    },
    {
      "title": "Excellent",
      "text": "I bought this to split wood that was already split, but still to big to burn in my wood stove. It works very well and doesn’t take up much space. It has wheels on it, so it’s easy to move on hard surfaces. Not to sure how it would roll on soft ground. I use it on my porch. It’ll also split a piece of wood with a knot in it. The wood has to be 18” or less. It would’ve been nice if it could split up to 20”, but 18” is about right. I’ve been using this for a few months and love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Tom",
      "helpful_votes": 0,
      "publication_date": 20200117
    },
    {
      "title": "Low quality steel",
      "text": "The steel in this product is cheap and Ben's after just a few uses. this causes an extreme safety hazard with the tension on the springs. Due to its size and weight returning it is a big hassle. Was supposed to get a refund from the company that was never applied.",
      "rating": 1.0,
      "verified": true,
      "author": "Amy J Bernard",
      "helpful_votes": 0,
      "publication_date": 20200426
    },
    {
      "title": "Split knotty uneven wood",
      "text": "I got hosed in the delivery of wet, knotty, misshapen wood. It was a real pain to split with my axe. So far, this little Gizmo is getting through it pretty good. Posted a video.",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle Early",
      "helpful_votes": 4,
      "publication_date": 20180130
    },
    {
      "title": "very pleased",
      "text": "I moved to Montana and I am a female in my late late 60's :-) I wanted to split as much of my own wood as I could. I ordered this product and used in for less than 2 months and it became defective. I called Sun Joe customer service and they are by far the best customer service I have ever dealt with. No squabbles, no questions....just sent out a new one and a box with a shipping label to mail the other one back. I have split over 3 cords of wood with this product. I heat primarily with wood so I go through almost 2 cords a year. This is absolutely perfect for me.",
      "rating": 5.0,
      "verified": true,
      "author": "kathleen",
      "helpful_votes": 0,
      "publication_date": 20200705
    },
    {
      "title": "This Is A Great Product!",
      "text": "I use this occasionally for splitting trees or limbs that fall in my back yard and it works great! I wish I would have had one of these ten years ago! There's no engine to maintain and it is very powerful. It is exactly what I wanted! The design is simple and effective!",
      "rating": 5.0,
      "verified": true,
      "author": "Donald Hoversten",
      "helpful_votes": 0,
      "publication_date": 20200927
    },
    {
      "title": "works great great",
      "text": "i bought this because we have a small wood stove the dore., is smaller than a sheet of paper some of the pieces are too tough to chop with ax anyway to get to the point this works great does the job takes about 40 seconds to split one piece that we could not get to chop with ax or maul the wood that i have is hard wood love this thing. ((i did not get this free or discounted for my opinion)",
      "rating": 5.0,
      "verified": true,
      "author": "Jillrogers",
      "helpful_votes": 3,
      "publication_date": 20170106
    },
    {
      "title": "It is so easy to use my 7 year old was splitting the ...",
      "text": "It is so easy to use my 7 year old was splitting the wood. One side has a stronger push but can be harder to break the log so switching to the other handle is likely much easier but has a shorter pushing distance. After breaking up logs outside I brought it in and keep it next to my wood stove. Now my 7 year old makes the kindling with it inside.",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth",
      "helpful_votes": 0,
      "publication_date": 20180124
    },
    {
      "title": "Save yourself some back pain!",
      "text": "This has been a back saver! Splits my wood easily and quickly. Product is well crafted and materials are standing up to very hard wood. Recommend to anyone that wants to save themselves back pain from chopping. It also transports and stores easily so it would be a great investment for those who camp a lot.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew",
      "helpful_votes": 0,
      "publication_date": 20190302
    },
    {
      "title": "Well worth it",
      "text": "Easy to use, 2 hydraulic cylinders (one applies pressure faster, other slower for harder to split logs). While the alternating dual pump method is useful, having 2 different \"speed\" cylinders helps for cracking larger pieces. The right goes slower but will split just about anything within the size range it was designed for. Be aware, it's for18 inch logs. I found that I needed a block of wood to extend the range of travel of the hydraulic piston for some logs shorter than 12 inches.",
      "rating": 5.0,
      "verified": true,
      "author": "Zip E",
      "helpful_votes": 0,
      "publication_date": 20191014
    },
    {
      "title": "Excellent value",
      "text": "This product is perfect for my needs. I had wood delivered however the pieces were still too large for fireplace use. This product easily splits whatever piece of wood I attempt to cut. The splitter is on wheels so i can easily store and move when not in use. Excellent value for the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Tawrin",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "Works great",
      "text": "Works great some smaller logs need ablock to help them reach but easy fix. This will give your arms a work out and i recommend putting it on something to save your back. This thing has split logs larger than it says you can do and has split some tough wood as well logs i couldn't split with an axe.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike81",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "Good product for what it's designed for",
      "text": "Does what it's suppose to do. Splits wood. You may want to have some 4x4 wood blocks to help with the shorter pieces.",
      "rating": 4.0,
      "verified": true,
      "author": "stevej2316",
      "helpful_votes": 14,
      "publication_date": 20161103
    },
    {
      "title": "arrived broken",
      "text": "One of the handle inserts and connecter were broken and badly damaged. The way the box arrived I'm guessing that it was returned and they banded and just shipped back out a damaged product. Too heavy for me to return so a loss of money for me.",
      "rating": 1.0,
      "verified": true,
      "author": "Barb C",
      "helpful_votes": 2,
      "publication_date": 20200521
    },
    {
      "title": "broke after a week of use",
      "text": "This product broke after a week of use. I am very sad. Video proof included. I was splitting oak and now the hydraulic cylinder will not clamp down and split the wood. I really needed this to work. #sad",
      "rating": 1.0,
      "verified": true,
      "author": "LeeAnn",
      "helpful_votes": 0,
      "publication_date": 20191002
    },
    {
      "title": "Easy operation and Powerful!",
      "text": "Great product - I often exceed the allowable log size and it works. For smaller logs, the equipment is very easy to use. One arm extends the lever in broader motions, the other makes minor advancements. Build quality is good too! Nothing feels cheap or flimsy. Overall very satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "nixy",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "When you have a lot of small logs or bigger half & quarter rounds.",
      "text": "Makes quick work of medium sized logs, it's a pretty good workout for one or you can have a partner take the second handle. My wife and I were both surprised how well and how easily this contraption worked, although it protests if you push your luck too far seeing how big a log you can go. Take it easy at first, and it's a good idea to have two people to carry it.",
      "rating": 5.0,
      "verified": true,
      "author": "Jack B",
      "helpful_votes": 0,
      "publication_date": 20180510
    },
    {
      "title": "A Fantastic Splitter",
      "text": "I purchased this recently for my husband and he loves it! He began using it as soon as he got it out of the box, and has been using it daily since. He says it's very easy to use and does a fantastic job splitting logs. No gasoline or electricity needed. A very good buy!!",
      "rating": 5.0,
      "verified": true,
      "author": "C.Rogers",
      "helpful_votes": 0,
      "publication_date": 20200205
    },
    {
      "title": "Easy to use.  Fair enough to call this a 10-ton",
      "text": "Wish I had this years ago. I really struggled to split firewood with a wedge and maul, because the wedge kept getting stuck. No issues with this, but as others have stated, it is incredibly heavy and the wheels are too small to run over a pebble driveway. I use a dolly to move it, since it's not something I need to move often.",
      "rating": 5.0,
      "verified": true,
      "author": "Lady",
      "helpful_votes": 0,
      "publication_date": 20181012
    },
    {
      "title": "Always keep work area clean and make sure the ends of the log are square for best results.",
      "text": "This log splitter is very easy to use. Splitting soft wood such as lodge pole pine it will easily slit 10 inch diameter logs in fact we have a 7 year old boy at home that was able to split a 8 inch diameter log with no problem under close supervision. If you are splitting a hard wood then I think 6 inch diameter logs would be about the maximum diameter to safely split without damaging the log splitter. It is well worth the money and is a good value.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas E Benson",
      "helpful_votes": 0,
      "publication_date": 20190628
    },
    {
      "title": "No more swinging an axe!!",
      "text": "You will love having this.. it sure is easy to use, If you have a bad lower back with arthritis and have huge hunks of wood this is for you. Be careful of not bending the side rails, I did with my huge hunks of wood. Anyways I love it, Now I look forward to splitting wood. After splitting some wood, mine didnt have enough hydraulic oil, so I had to refill mine up. After I refilled it, it worked fine",
      "rating": 5.0,
      "verified": true,
      "author": "The Crowtons",
      "helpful_votes": 0,
      "publication_date": 20180728
    },
    {
      "title": "Splits any wood I be out in it. Elm, mulberry, oak, hickory.",
      "text": "Works great. And splits a lotg way bigger than 8\" the 1 8\" is a better be close mess though.I would recommend it, unless you are a weakling or can t pick anything up more than 1 0 lbs. I love doing it. And I m not beating on a piece of wood with a maul.",
      "rating": 5.0,
      "verified": true,
      "author": "buford bingham",
      "helpful_votes": 0,
      "publication_date": 20181208
    },
    {
      "title": "Nice and Easy to Use",
      "text": "Perfect for 8 to 10 inch logs - standard cut. Should be 2 inches larger, for human cut logs!",
      "rating": 4.0,
      "verified": true,
      "author": "Robert H. Adams Jr.",
      "helpful_votes": 4,
      "publication_date": 20170207
    },
    {
      "title": "Love it!",
      "text": "Works like a dream, I have never done this before, but after my first winter in my new home in the country I got sick of buying wood and possibly running out so now I am taking care of that all by myself.",
      "rating": 5.0,
      "verified": true,
      "author": "Zion Ranch on YouTube",
      "helpful_votes": 0,
      "publication_date": 20200506
    },
    {
      "title": "Love this product",
      "text": "Love this product, best log splitter for money. Takes the hard work out of chopping logs for firewood. Splitting logs by hand with an axe (or a sledge and wedge) is a lot of work. If you heat your home with wood you need one to save time and a little backbreaking work.",
      "rating": 5.0,
      "verified": true,
      "author": "ODB",
      "helpful_votes": 0,
      "publication_date": 20180114
    },
    {
      "title": "Perfect for my needs.",
      "text": "Love this splitter! I use it at camp where I have wood delivered that is already cut and split but it isn't split small enough. So, the Sun Joe easily splits them another 2 or 3 times. No more swinging an axe to split logs before throwing them on the fire. No more flying logs from splitting with an axe. It's perfect for my needs and easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200527
    },
    {
      "title": "Simple and effective",
      "text": "You can't go wrong with this for value. It's limited to certain lengths/diameters of logs, but we were able to get a seasons worth of firewood out of a tree we had to cut down without renting a big gas powered behemoth, and honestly it's really fun and satisfying to use!",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole Fitzpatrick",
      "helpful_votes": 0,
      "publication_date": 20191126
    },
    {
      "title": "Sooooo glad I purchased....  Splitting firewood with ease",
      "text": "I was using a splitting maul, was looking for a splitter easy to use. Once received was easy setup, super easy to use. Split a truck load of logs about 17\" in length, even had wife try it.",
      "rating": 4.0,
      "verified": true,
      "author": "Steven R. Olmsted",
      "helpful_votes": 0,
      "publication_date": 20200818
    },
    {
      "title": "Value for money",
      "text": "This splitter is awesome! Easy, durable, and we love the “crack” the logs make when they reach a certain point. Our only complaint is it doesn’t manage short logs (less than 18 inches) as well.",
      "rating": 4.0,
      "verified": true,
      "author": "S. Fitzgibbon",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Actually works great!",
      "text": "When I unpacked this (very heavy) thing, I expected that it would cap out on the as-documented 8\" diameter logs. Not so! This thing is solid, and handily splits the 14\"-ish logs I've got hanging around. No fuss at all. This is an amazingly well built solid piece of machinery. Easy to use, does its job well.",
      "rating": 5.0,
      "verified": true,
      "author": "JB",
      "helpful_votes": 0,
      "publication_date": 20200629
    },
    {
      "title": "Good if you don't have huge numbers of logs to split",
      "text": "Very skeptical at first but it works really well even on giant logs. Takes a bit of muscle power to operate. Much easier and safer than using an ax. Fairly robust but the stabilizing arms bend quite easily. Falls sideways in use.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200224
    },
    {
      "title": "Excellent",
      "text": "Bought this for my husband as he has been wanting one. It’s so easy to use, I have been using it! Works great! Our cord wood is quartered but makes chopping kindling up supper easy.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa Keeney",
      "helpful_votes": 0,
      "publication_date": 20200103
    }
  ],
  "product_meta": {
    "title": "Sun Joe LJ10M 10-Ton Hydraulic Log Splitter, Green",
    "description": "Log on. Log off. Then split. Embrace your inner Paul Bunyan as you make light work of the piles of large logs you've been meaning to tackle around your yd with the Sun Joe Logger Joe LJ10M 10-Ton hydraulic log splitter. Harness the power of the manually operated 2-speed pump to quickly generate to 10 Tons of driving force to easily split firewood logsup to 18 in. Long x 8 in. Wide. The LJ10M log splitter is crafted of durable steel construction for reliable power & performance, season after season, Year after year. Rear wheels make it easy to maneuver wherever it's needed - & its compact size makes it a cinch to store when it's not.",
    "rating": 4.3,
    "feature_bullets": [
      "Powerful: hydraulic RAM Builds up to 10 Tons of driving force",
      "Large capacity: splits logs up to 18 in. Long x 8 in. Wide",
      "Efficient: RAM return spring for quick resets",
      "Durable: Steel frame construction with wheels for easy portability",
      "Easy to use: No gas, oil or cords.Wheel Size:2.48 inch",
      "We’ve got you covered!: your new log splitter is backed by the snow Joe + Sun Joe customer promise. We will warrant New, powered products for two years from the date of purchase. No questions asked. Contact snow Joe + Sun Joe customer Support at 1-866-766-9563 for further assistance."
    ],
    "specifications": {
      "Product Dimensions": "41.12 x 8.12 x 11.8 inches",
      "Item Weight": "87 pounds",
      "Manufacturer": "Snow Joe",
      "ASIN": "B00VPJAPS2",
      "Item model number": "LJ10M",
      "Customer Reviews": "4.3 out of 5 stars671 ratings4.3 out of 5 stars",
      "Best Sellers Rank": "#9,104 in Patio, Lawn & Garden",
      "Is Discontinued By Manufacturer": "No"
    },
    "categories": [
      "Power & Hand Tools",
      "Tools & Home Improvement",
      "Power Tools",
      "Garden & Outdoor"
    ],
    "price": 169.99
  }
}