{
  "website_summaries": [
    {
      "verdict": "Earns our top spot for 100-foot length, beautiful lighting, and manufacturer's quality guarantee.",
      "pros": [
        "Well-made sockets, reliable wiring, and impressive 100-foot length",
        "Round shape with subtle glow produces excellent ambient light",
        "One-year quality guarantee"
      ],
      "cons": [
        "Doesn't come assembled",
        "You must screw the bulbs into the sockets"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great wedding lights",
      "text": "I bought these for my wedding and they worked great. Really worked well. I would recommend stringing some steel cable with turn buckles to keep the cable tight. The light strings will clip right over the cable so this method will keep your lights from sagging.",
      "rating": 5.0,
      "verified": true,
      "author": "AirplaneBlaine",
      "helpful_votes": 110,
      "publication_date": 20161220
    },
    {
      "title": "... of string lights for my daughters wedding & kinda disappointed that the bulbs are so thin",
      "text": "I bought 400 ft of string lights for my daughters wedding & kinda disappointed that the bulbs are so thin! They need to put extras just incase they break as your putting the bulbs in their sockets or accidentally bump into each other or something. No they didn't come with extras and didn't even think about that until I opened up the box and worried that they might break easily SO I bought extras UPDate : All the lights worked & The wedding turned out beautiful!! Even tho they.bumped from setting them up, not one broke : ) Happy Mom",
      "rating": 5.0,
      "verified": true,
      "author": "C G",
      "helpful_votes": 44,
      "publication_date": 20170921
    },
    {
      "title": "Helpful Advice for Bulbs/Sockets Not Working",
      "text": "Out of the box, about 10 of the sockets could not make a connection with the bulbs. Here's the fix that got all of them working. ***UNPLUG FIRST*** That's important. :) Use a pick to pry out the gold piece that runs along the inside - just a little bit. You can see in the picture; 1. How it arrived; 2. Prying the piece; 3. Fixed (notice how little it needed). I haven't hung these up yet, but so far I'm happy now that they are all working. It was a pretty quick fix that is acceptable considering the price. Will update after use. Thanks!",
      "rating": 4.0,
      "verified": true,
      "author": "Aub",
      "helpful_votes": 80,
      "publication_date": 20170522
    },
    {
      "title": "These bulbs work great, just a couple things to note for anyone ...",
      "text": "These bulbs work great, just a couple things to note for anyone looking to purchase- They do not come assembled, meaning you need to screw in every single light bulb into the string. Several bulbs did not screw in, so I had two empty spots. They do NOT have plugs on the ends, so you can not continue the strand to another strand (not that you would need to since the string is 100' long) One of the bulbs fell out after the lights were all hung. Kind of startled me. (Could have been that it wasn't screwed in properly). Overall, for the price, it's a good set for being so long.",
      "rating": 4.0,
      "verified": true,
      "author": "Sean Hughes",
      "helpful_votes": 215,
      "publication_date": 20151019
    },
    {
      "title": "Beautiful Patio Lights",
      "text": "We strung the 100ft and 50ft together and they look amazing. One of the bulbs didn't work but other than that so happy with them. You do have to screw in every bulb so be prepared for that, definitely worth it tho!",
      "rating": 5.0,
      "verified": true,
      "author": "CalNorms Revenge",
      "helpful_votes": 66,
      "publication_date": 20160420
    },
    {
      "title": "Makes my back yard a delight at night.",
      "text": "This is a really nice set of lights. I used them to run along the inside of the fence around my back yard. Very well packaged, with all the bulbs individually protected with bubble-wrap sleeves in sectioned boxes. As others have noted, the easiest way was to run the cord, and then add the bulbs. All of them worked perfectly. It's the perfect kind of light for this use - a bit of a fairy-land feel - not too bright, yet turns a dark yard into something special.",
      "rating": 5.0,
      "verified": true,
      "author": "Peter Guither",
      "helpful_votes": 13,
      "publication_date": 20180205
    },
    {
      "title": "Nice Lights",
      "text": "Strung these up for bistro-type lighting on our patio. Probably ordered a little bit longer than we needed, but it worked out great, we have more lighting than expected but it looks great! Don't know if we can try 10W bulbs for a little more light. As mentioned in other reviews, the bulbs don't come installed, so you have to screw each one in. I actually preferred that since we weren't taking the chance of breaking the bulbs while installing. All were packaged very well. 4 boxes of 25 count bulbs which were all foam protected and 4 spare bulbs individually packed in separate boxes. All bulbs were in great shape upon unboxing.",
      "rating": 5.0,
      "verified": true,
      "author": "David Rosenbaum",
      "helpful_votes": 0,
      "publication_date": 20200608
    },
    {
      "title": "These Lights DO NOT String Together",
      "text": "A couple of things about these lights. First, as my headline says, they do not string together. You can only plug them into an outlet. There is not way to connect a new strand to the first strand. That was a no go for me. I was trying to string them all the way around our pool. Second, and this was an aggravation until I realized that they wouldn't string together. The bulbs are not installed for you. You have to install them. I purchased 300 feet of lights with 100 lights per strand. That would have gotten old if I had to install them all. We returned them and purchased lights that string together.",
      "rating": 3.0,
      "verified": true,
      "author": "Jeffrey C. Smith",
      "helpful_votes": 0,
      "publication_date": 20200702
    },
    {
      "title": "I purchased this item, and my husband spent three ...",
      "text": "I purchased this item, and my husband spent three hours designing and installing an intricate zig zag pattern for our backyard patio. After hanging the lights, he screwed in the bulbs. 35 of the 100 bulbs did not work, because the little brass tab that the bulb is supposed to make a connection to was depressed. The socket is so narrow that it is impossible to reach anything in there to pull up on the tab. The lights will have to be taken down. Next time, I will purchase a quality commercial set of lights.",
      "rating": 1.0,
      "verified": true,
      "author": "soheila",
      "helpful_votes": 8,
      "publication_date": 20170705
    },
    {
      "title": "Pretty but didn't last",
      "text": "Were pretty but started to sag in the sun pretty quickly after like 2 weeks. Also, were very delicate and glass bulbs broke easily and shattered. You get what you pay for, so if you need them for a single event that may work, but longevity was not this products strength as they didn't last 30 days in my yard. I would not buy again for seasonal use, but single use and extreme care in handling would be okay.",
      "rating": 3.0,
      "verified": true,
      "author": "Theycallmetodd",
      "helpful_votes": 5,
      "publication_date": 20170901
    },
    {
      "title": "Great product, value, plenty of light but not overpowering",
      "text": "Awesome used staple gun to attach under our patio they look great and its just the right amount of light (300ish sq ft) and not overpowering. I laid them out on the ground so the design one outer loop and one inner loop over the table measured out perfect. With the staple gun (one for electric wires with the plastic loop thing) it looks like a pro did it. I got a bunch of extra bulbs thinking I would break some but a year later none have gone out or broken so now I just have a box of 25 bulbs laying around. Wish I had done this years ago.",
      "rating": 5.0,
      "verified": true,
      "author": "JWP",
      "helpful_votes": 3,
      "publication_date": 20170921
    },
    {
      "title": "Great price, great light, great look",
      "text": "I’ve only had this product up a couple of weeks but so far so GREAT! The lights look amazing when turned on and have a nice low profile look during the day when not in use. I hooked mine up using a $35 wire kit off Amazon, highly recommend doing it that way. The wire electrical wire is basically home appliance/lamp gauge, which I love for the low profile but can see that being a problem down the road if it’s supporting all the weight. Already these lights with cable kit have withstood some ferocious Santa Ana winds here in SoCal.",
      "rating": 5.0,
      "verified": true,
      "author": "Benjamin Steeples",
      "helpful_votes": 0,
      "publication_date": 20191029
    },
    {
      "title": "Wonderful!",
      "text": "These are great. Didn't have any bulbs that were out when coming out of the box. Arrived in perfect condition. One small side note to add. Bugs are attracted to these lights so only turn on the lights when needed. They aren't over bearing but create just the right amount of light.",
      "rating": 5.0,
      "verified": true,
      "author": "Bovalle28",
      "helpful_votes": 6,
      "publication_date": 20170604
    },
    {
      "title": "Great lights especially for the price!",
      "text": "Great lights! Packaged really well, no broken bulbs. I would suggest installing the bulbs after stringing the lights up. I didn't use any steel cable to hang them, just pulled the lights pretty tight and double zip tied them to an eye hook. I didn't use the entire strand (used about 90ft) and just didn't place bulbs for the tail end of the string. Now I have extra bulbs but none has burned out yet and have been up in very heavy hurricane rains. I placed these over a 10x20 area and ended up getting a dimmer as they were brighter than I needed. Work great with the dimmer and all the lights are evenly dimmed.",
      "rating": 5.0,
      "verified": true,
      "author": "Vinny",
      "helpful_votes": 0,
      "publication_date": 20201007
    },
    {
      "title": "SUPER FRAGILE",
      "text": "Don't waste your money. A few bulbs arrived broken and a few more broke when I was screwing them in (gently). I've purchased other brands like this and never had an issue. These are SUPER fragile, so I don't know how they would handle in the rain. When we plugged it in to turn the lights on they didn't work. We tried different plugs around the home and they still didn't work.... Such a waste of money and time setting it up.",
      "rating": 1.0,
      "verified": true,
      "author": "Chloe",
      "helpful_votes": 0,
      "publication_date": 20200621
    },
    {
      "title": "Well pleased",
      "text": "I installed these I a zig zag pattern over our deck and they look great. Several neighbors have complimented and asked where I got them. Actually only needed about 50’ so I cut this string to the length I needed and installed a plug. Now I have an extra string to hang somewhere else...porch maybe. They put out a nice warm yellowish light and are just the right brightness for my taste.",
      "rating": 5.0,
      "verified": true,
      "author": "JEM",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "Wow!  Turned my covered deck into a 24 hour room",
      "text": "What I love is the way it is wired. Example, if a bulb goes out, the rest stay on. Why is this cool. Because I only needed 75% of the line to wrap the ceiling on my covered deck. The excess, I can just snip and terminate properly (This is 110V, you must follow protocol when terminating the line, treat it like an AC line in the house). It provides a wonderful warm light on the deck, but dim enough not to keep the neighbors up through the windows. LOVE IT!",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Spindler",
      "helpful_votes": 0,
      "publication_date": 20190816
    },
    {
      "title": "Perfect for summer nights",
      "text": "Absolutely love these. We strung them up amongst the trees in our backyard. Just the right amount of light when you're hanging out around the fire pit. Like another reviewer said, the bulbs need to be screwed in, so stringing the wire before adding the bulbs is definitely the way to go. (thanks for the tip, fellow reviewer) only complaint is the two spare bulbs that came with no packing support were shattered in their boxes. Seems like a pretty silly way to pack glass, but we didn't end up needing them and no one got cut...so it wasn't a big deal.",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley",
      "helpful_votes": 0,
      "publication_date": 20190613
    },
    {
      "title": "Great if you need a lot of lights",
      "text": "Hung this under a sun shade. It looks good but the clips made me nervous. When you attach the clip to almost anything, it presses the bulb against it. Bulbs didn't seem to get hot but you may have to get creative to hang. I used zip ties so the bulbs didn't touch anything. The kit comes with 2 extra bulbs but I had 6 bad bulbs. I recommend buying a case of spare bulbs. They were inexpensive and matched the factory supplied bulbs.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "Beautiful lights!",
      "text": "Beautiful lights! However keep in mind the bulbs are very fragile, and do not come already on the string, they need to be manually screwed into the sockets. The bulbs were also individually wrapped. So, this took a little longer than I was expecting. Keep in mind, this does not have a connecting end, so this will need to be your only, or last strand of lights! This is only a 4 star because it did not come with any extra bulbs. 1 or 2 would have been nice. Beautiful but very fragile!",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170918
    },
    {
      "title": "Beautiful",
      "text": "I bought these to hang on the fence in my back yard. They're 100' long so they were easy to plug in and hang. I have them on a timer to come on at dusk and stay on for 4 hours. My back yard looks like a park! They've been up a few months now and every bulb still works perfectly! I've never had string lights that were this dependable.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly B. Grimes",
      "helpful_votes": 0,
      "publication_date": 20200617
    },
    {
      "title": "So pretty!",
      "text": "I love these lights! Purchased for our covered porch which measures 12 X 24. I ordered 100 ft. Could have ordered 2 sets but we were able to arrange them to cover the entire porch except about 3 ft on one end but you can't tell with all the lights on at night. So beautiful and were easy to hang. We used a staple gun ~ very careful to NOT hit the wires! The bulbs took some time to screw in but the end result is lovely! 1 bulb was broken and there were no extras like I thought I read?? I ordered a box of extras to have on hand in case any burn out later.",
      "rating": 5.0,
      "verified": true,
      "author": "Christy Kimball",
      "helpful_votes": 2,
      "publication_date": 20180102
    },
    {
      "title": "Recommended!",
      "text": "Arrived fast and every single bulb worked! Nothing broken. The brightness is good, not overwhelming but bright enough for me. Used it on my deck. If you’re needing to cover a larger area or need more brightness I would recommend doubling up. Overall I’m very happy 😊 This review is based off my 1st impression, not long term use.",
      "rating": 5.0,
      "verified": true,
      "author": "Jamie",
      "helpful_votes": 0,
      "publication_date": 20191118
    },
    {
      "title": "DONT hang string lights w/out support cables",
      "text": "If you want your string lights to last, I recommend first putting up some vinyl coated braided cables and the hooking the string lights on the braided cables. That way there isn’t any tension or weight on the electrical cables themselves and they will last just fight in extreme weather conditions.",
      "rating": 5.0,
      "verified": true,
      "author": "Z. B.",
      "helpful_votes": 0,
      "publication_date": 20200128
    },
    {
      "title": "No remote control, no end-to-end connection",
      "text": "I was asked to rate the quality of the remote control, but there was none included in the order. It is also important to know that these do NOT connect with one another, so if you're wanting to use more than one strand, you'll need to connect them to a plugin individually. We did break three bulbs during setup, and one was burnt out, all across four strands. This wasn't an issue as they did provide plenty of extras, but please be careful if setting up near children or pets. If you're aware of the above, these are great value for the price!",
      "rating": 4.0,
      "verified": true,
      "author": "Lauren O'Connor",
      "helpful_votes": 0,
      "publication_date": 20200828
    },
    {
      "title": "Great value!",
      "text": "My pergola is 12x12, I thought the 100ft would be sufficient and it turns out I should of got the 50ft! Lots of light me that’s only half of the bulbs! It has created the perfect ambience I was trying to achieve. I followed others recommendations of hanging the string before attaching the bulbs. Not one bulb broken and it was easy. First photo is just the lights alone. Second photo my backyard light is on as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa",
      "helpful_votes": 0,
      "publication_date": 20190727
    },
    {
      "title": "Expect the lights to break when hanging them",
      "text": "The lights themselves are great. I use them in my house and they look great and the light is soft and calming. But the bulbs are made of thin glass and are incredibly fragile. I screwed the bulbs in and then hung them up, but if I could I would have hung them up and then screwed the bulbs even though it would be a lot of trouble. Around 8 bulbs broke while hanging them. Also, the connection on one light was bent inside and did not work with any bulb.",
      "rating": 3.0,
      "verified": true,
      "author": "Nicole",
      "helpful_votes": 0,
      "publication_date": 20180119
    },
    {
      "title": "nice for the price",
      "text": "inexpensive decorative string lights. Some light bulbs were already not working. but spare bulbs were included. Nice decorative string lights that we hung w/ a staple gun under our new \"Lean Too\" we built on the back of our garage. Not sure how'd they'd work in open elements. But perfect for our use. & less than 1/2 the price of the LED lights we had looked at.",
      "rating": 4.0,
      "verified": true,
      "author": "frdykw",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "Breaks easy",
      "text": "These lights are very fragile. There were 3 cracked upon arrival and my husband had a slip and 3 shattered instantly (you get 4 extra but we are already 2 short). Had I known they were so fragile, we would of gone in a different direction but they are up now... will see how they last.",
      "rating": 2.0,
      "verified": true,
      "author": "jlacivit",
      "helpful_votes": 2,
      "publication_date": 20200428
    },
    {
      "title": "Dangerous product- ULTRA THIN GLASS",
      "text": "Purchased these for outdoor use. I can’t tell you how dangerous these are. I cut myself and broke several bulbs just screwing them on. We are still daily stepping on chards of glass from these. These are not as advertised and I can’t imagine how they would be durable out doors. We returned them, broken bulbs and all.",
      "rating": 1.0,
      "verified": true,
      "author": "ashley m",
      "helpful_votes": 0,
      "publication_date": 20200531
    },
    {
      "title": "Great Set of String Lights",
      "text": "We bought these for a backyard party and left them up permanently on a timer. Gives a very festive atmosphere to our backyard in the evening. Great quality but make sure you are careful in the way you string them because we had some wind and a few of the bulbs (which are somewhat fragile) were banged against our house and broke. Otherwise they made it through one cold Colorado winter thus far. And one other thing to note is they are not LED bulbs. They are incandescent. So 100 bulbs x 7.5W per bulb = 750 Watts.",
      "rating": 5.0,
      "verified": true,
      "author": "zhansman",
      "helpful_votes": 0,
      "publication_date": 20170630
    },
    {
      "title": "good buy",
      "text": "love the lights, easy to install and put off a lot of light but not too bright. The bulbs do break very easily! Might almost be best to hang the light strand, then screw in all the lights...i ended up having to buy a whole box of extra bulbs right away since I broke so many trying to get it up.",
      "rating": 5.0,
      "verified": true,
      "author": "Jess89",
      "helpful_votes": 0,
      "publication_date": 20200531
    },
    {
      "title": "Extremely Bright Patio Lights",
      "text": "These are EXTREMELY bright. We had to unscrew 1/4 of them and they are still so very bright. If you need bright patio lights then these are it. I wanted much softer ones. But we already had them out up and that was a lot of work so we kept them. There is no remote control so I don't know why that was on here.",
      "rating": 3.0,
      "verified": true,
      "author": "Gina Jackson",
      "helpful_votes": 0,
      "publication_date": 20200918
    },
    {
      "title": "Such a pretty effect",
      "text": "THese lights look just wonderful around my deck, giving off a warm glow, and the strand was long enough to light up the steps too. The bulbs need to be screwed into each socket so that took some time and the bulbs are quite fragile, but apart from that I couldn't be happier.",
      "rating": 5.0,
      "verified": true,
      "author": "Virginia Story",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "Cute but delicate",
      "text": "I got these lights to hang in the backyard for an event that I was hosting. I needed three packs of lights to cover the area I wanted and it was some work to get them all hung up since they do not connect together (also I was worried about blowing a fuse). BE GENTLE WITH THESE LIGHTS! They tapped the ground while I was hanging them and shattered at least two or three. As long as you are cautious, they will look great once they are hung up!",
      "rating": 4.0,
      "verified": true,
      "author": "Rachel Trujillo",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "May need to take down after use.",
      "text": "Loved the look of these lights but unfortunately we had issues with the glass breaking very easily. Once we had hung arse trend of lights it really looks great over patio especially for a surprise party that we threw for her daughter really set the mood. Unfortunately something occurred to where the wiring snapped in half and a large portion of the strand of lights came crashing down. I don’t know if this was due to the wind and hook, the wiring being too thin to withstand the wind or something else but due to this we were only able to enjoy the lights for about 2 1/2 weeks.",
      "rating": 3.0,
      "verified": true,
      "author": "K. Dillman",
      "helpful_votes": 0,
      "publication_date": 20180223
    },
    {
      "title": "Poor Quality.  Dangerous.",
      "text": "No stars. This product is of extremely poor quality and dangerous. The bulbs are made from glass so thin when it shatters, pieces fly everywhere. My 16 year old and I were putting these lights up, and one bulb shattered nearly injuring his eye. The strand was new this year, and there are multiple bulbs that won’t even light up. I am very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "SL",
      "helpful_votes": 4,
      "publication_date": 20171219
    },
    {
      "title": "Perfection! But hang before attach bulbs",
      "text": "The bulbs are super thin! The bulbs come packed in a padded box. Put up the string BEFORE you attach the bulbs. If you have them on the string and they touch anything they pop. However, these are so stunning. I couldn't be happier and am in love!",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle Gondor",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "Perfect ambiance for a relaxed atmosphere!",
      "text": "I bought two 100-feet light strands for a nice ambiance in my yoga classes and I could not be more pleased. I read a lot of the comments on how to hang them (strands first, then lights) and installation went great with no issues. My husband thought the lights might be too bright but they are just what I was looking for! I’m so excited - tonight is my first yoga class using the lights and I can’t wait!",
      "rating": 5.0,
      "verified": true,
      "author": "J. Kays",
      "helpful_votes": 0,
      "publication_date": 20191016
    },
    {
      "title": "W O R S T PURCHASE EVER!!!!!!!!!",
      "text": "AWFUL PRODUCT!!! Please read. These come unassembled. We’ve had them up for ONE WEEK and there are FOUR lights not working. Requesting refund. Unacceptable. No remote control. A week later and we’re 5 lights down not working. I WANT A REFUND ABD NO ONE WILL GET BACK WITH ME.",
      "rating": 1.0,
      "verified": true,
      "author": "AB",
      "helpful_votes": 0,
      "publication_date": 20200531
    },
    {
      "title": "Great product",
      "text": "I purchased these for my wedding and they worked perfectly! They are beautiful and I got a lot of compliments. A couple things to know, they do not come assembled, so you need to screw in every single light bulb into the string. They also cannot be connected end-to-end. But they are durable enough to withstand a rain storm (morning of the wedding, then it cleared up!) and being hung/taken down/put back into the box with no damage.",
      "rating": 5.0,
      "verified": true,
      "author": "Angela Fruik",
      "helpful_votes": 0,
      "publication_date": 20181029
    },
    {
      "title": "Great buy. Perfect for a garden party at night.",
      "text": "These are great little lights. We have other larger ones that were more expensive to compare these to. These did a great job of giving a soft but strong glow all over the back garden. We had a garden party at night and these were perfect. Can be set with dimmer to make them softer if needed. Easy assembly, no support wire was needed. They didn’t sag & all the lights hung downward. Can’t beat the price.",
      "rating": 5.0,
      "verified": true,
      "author": "DW",
      "helpful_votes": 0,
      "publication_date": 20181021
    },
    {
      "title": "They served their purpose... INDOORS",
      "text": "We bought two packs of these for our indoor wedding. They looked amazing, especially for the price. We know how them outdoors wrapped around our porch. About every month or so, another light bulb will stop working. These things are clearly NOT meant for extended outdoor use.",
      "rating": 4.0,
      "verified": true,
      "author": "Jake Taylor",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "Nice",
      "text": "All bulbs included were good with no duds. I cut mine to fit the application and they are easy to work with. Been up for two seasons and they stay up in the winter and I’ve seen no change in quality or deteriorating.",
      "rating": 5.0,
      "verified": true,
      "author": "Senor Blanco",
      "helpful_votes": 0,
      "publication_date": 20190517
    },
    {
      "title": "taking a beating and keep on working",
      "text": "got them strung up across a 25' space, out and back a couple times. so far they've weather 60 MPH winds and driving rain with no issue. they have completely transformed a dull sitting area into an inviting one that impresses everyone that see it. great value, easy to set up. DO NOT put bulbs in prior to stringing, common sense.",
      "rating": 5.0,
      "verified": true,
      "author": "TS",
      "helpful_votes": 0,
      "publication_date": 20190815
    },
    {
      "title": "Great lights! Be careful, bulbs are fragile",
      "text": "Beautiful lights, really made our fire pit area pop! We did read the previous reviews prior to purchase and instillation which said the bulbs will break if the bang together. So we hung the lights first and then went back and installed the bulbs. They have survived in a wooded area through several severe storms! Just be careful with the bulbs during installation and you should be fine!",
      "rating": 5.0,
      "verified": true,
      "author": "KLP",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "Don’t buy these! They look pretty but go out!",
      "text": "We loved these at first but for some reason, we see that bulbs keep going out. We thought 1-2 was normal but we have 8! And the ones that keep going in and out are different colors too. Brighter than the original yellow hue when first purchased. I had planned on ordering another one of these but I won’t be doing that now.",
      "rating": 1.0,
      "verified": true,
      "author": "geneva",
      "helpful_votes": 0,
      "publication_date": 20200523
    },
    {
      "title": "good deal",
      "text": "This does not come with a remote control. I had to buy that separately. Overall the lights were easy to hang, but take time to do a good job. They well packaged and came with 4 additional replacement bulbs",
      "rating": 4.0,
      "verified": true,
      "author": "Waggs3228",
      "helpful_votes": 0,
      "publication_date": 20200910
    },
    {
      "title": "Our patio is now a bright, fun place to entertain!",
      "text": "We ordered these to hang out on the eaves over our covered patio. Instead of being dark, our patio is now a well-lit, fun place to entertain family. We are so happy with these, we are considering ordering another set to fill in the gaps, but if we don't, the first string will be sufficient. The packaging did a great job protecting the little bulbs, and everything was intact when we opened the boxes. We are very pleased with this order, the arrival time and the product. Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "Annette Taylor",
      "helpful_votes": 0,
      "publication_date": 20180106
    },
    {
      "title": "EXCELLENT AND HIGH QUALITY LIGHTS USED FOR DRIVEWAY AND TENT",
      "text": "I COULD NOT RATE THESE LIGHTS HIGHER. WE PURCHASED 5 100' STRINGS OF THESE LIGHTS AND ALL 500 BULBS WORKED PERFECTLY. THEY ARE CAREFULLY PACKAGED TO ENSURE THEY DON'T BREAK. WE USED THE LIGHTS TO LIGHT UP OUR DRIVEWAY AND TENT FOR A WEDDING. I GIVE THEM A 10/10.",
      "rating": 5.0,
      "verified": true,
      "author": "MBV97",
      "helpful_votes": 0,
      "publication_date": 20200702
    },
    {
      "title": "Budget Wedding reception on family land",
      "text": "We were scared they wouldn’t be bright enough or long enough, but here are pics proving us wrong. 100ft over 20x20 dance floor, & 100ft inside a 40x40 pole tent (didn’t connect to pole just made a perfect “V” inside the tent) Used for our wedding reception on family land-budget reception.",
      "rating": 5.0,
      "verified": true,
      "author": "Elisa",
      "helpful_votes": 12,
      "publication_date": 20180313
    },
    {
      "title": "Beautiful, but a bit delicate!",
      "text": "These lights are beautiful but pretty delicate. They’ve held up against some big storms but I broke a few right of the gate when hanging them. They did come with a couple of back ups luckily. The install was sort of a bugger because they come as a string along with lots of bulbs that have to be screwed in one by one! I’ll be keeping them but have to be very careful go forward! The definitely look great in my backyard.",
      "rating": 5.0,
      "verified": true,
      "author": "MH",
      "helpful_votes": 0,
      "publication_date": 20190708
    },
    {
      "title": "Broken, tangled and CUT when arrived",
      "text": "I just received these exactly as you see from Amazon. There are 6, (7 including the broken one that cut my finger) bulbs and they are just thrown into the mix of wadded string. To make it even more frustrating, the string appears cut! I am so thankful we didn’t plug these in and get electrocuted. Bad enough to cut your finger on a product you have been eagerly awaiting to arrive. Whoever packaged and shipped this to us at Amazon should absolutely be made aware this is not funny, and it is careless! Posting this publicly to make sure this doesn’t get passed along to the next purchaser as I am now sending it right back! Super disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Shoppingtyme",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "Love these lights!",
      "text": "These lights looks sooo good! I did put the string up first then I put the lightbulbs on that way I wouldn’t risk breaking any. Also the first time I turned it on I panicked because some of them were not on but all you have to do is go back and make sure they’re put on right! So that was my fault lol but I fixed it and I Love them and I would buy it again!",
      "rating": 5.0,
      "verified": true,
      "author": "ANA SANTANA",
      "helpful_votes": 0,
      "publication_date": 20190422
    },
    {
      "title": "Great for decor projects",
      "text": "These were the perfect choice for decorating a gym for a wedding. Bright, well made, well packed. A very minor complaint is that the clips don't do a good job attaching to paracord and it is possible for a whole string to come off once it begins to fall off. So we used a twist tie every 6' or so. The G40 lights are plenty bright and reasonably durable. We used 8 100' strands so we had 800 bulbs and a herd of people helping put up and take down. Altogether we probably broke only about a dozen bulbs. Good choice.",
      "rating": 4.0,
      "verified": true,
      "author": "Sebastian",
      "helpful_votes": 0,
      "publication_date": 20190629
    },
    {
      "title": "Great to hang on tents for weddings or parties",
      "text": "Purchased these to be placed around 100 feet of tents for our backyard wedding. They offered enough light for guests to talk and eat. They were easy to setup. Right out of the box I left the lights rolled up and put the lights up section by section without the bulbs. After setting up the string if lights, you screw in the bulbs. The bulbs do not get hot. All bulbs worked.",
      "rating": 5.0,
      "verified": true,
      "author": "Islanders Man",
      "helpful_votes": 0,
      "publication_date": 20180720
    },
    {
      "title": "It is beautiful when lit - but this product",
      "text": "Trying to be fair about this product - but five bulbs do not work. I ordered replacement bulbs, but 5! Also, one of the sockets was not connecting and cannot be fixed. It is beautiful when lit - but this product, on day one, does not appear to be sturdy. By day three- seven bulbs are not working. This is exhausting.",
      "rating": 1.0,
      "verified": true,
      "author": "Islandgirl",
      "helpful_votes": 0,
      "publication_date": 20180202
    },
    {
      "title": "Great for what I needed",
      "text": "I purchased these lights to use during an outdoor festival I was helping plan in my hometown. They worked great for what we needed while staying within the limited budget we had. I can't speak to how well they would hold up for extended use, but they did great during our 4 day event. One light bulb stopped working, but the lights came with extra so it was a simple fix.",
      "rating": 5.0,
      "verified": true,
      "author": "Tristan E.",
      "helpful_votes": 0,
      "publication_date": 20180801
    },
    {
      "title": "Basic but Well-Functioning",
      "text": "These plug in lights (no remote control with this particular product) were exactly what we needed for our tent during our wedding! They added a touch of ambiance, and kept the party going after sunset. Now we'll have a great string of lights for our porch at home. No bells of frills, but they do exactly what they need to. The bulbs do not come attached to the string, so factor some extra time in for set up. Would recommend!",
      "rating": 4.0,
      "verified": true,
      "author": "Rachel",
      "helpful_votes": 0,
      "publication_date": 20191016
    },
    {
      "title": "some hardware issues",
      "text": "They come with lights separate which is nice because we only had 1 light that did not work, BUT the plug that the lights screw into are poorly made, we had many lights that even after screwed in you would have to wiggle the light to get it to properly connect and turn on. When the wind blew lightly the some of the bulbs would flicker on and off. You get what you pay for on this one.",
      "rating": 2.0,
      "verified": true,
      "author": "Shane Henninger",
      "helpful_votes": 0,
      "publication_date": 20191001
    },
    {
      "title": "Love the lights",
      "text": "Loved the lights and how they looked. Very bright for lighting up the porch. Very smart idea of them to send the bulbs detached so that they do not break, as they are VERY delicate. Could have used more than just 2 replacements but overall very good.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessie",
      "helpful_votes": 0,
      "publication_date": 20190922
    },
    {
      "title": "Perfect for any outdoor space!",
      "text": "Gorgeous lights! They fit my 20x20 deck perfectly. They were packaged well and all the bulbs worked. I hooked these up to a dimmer switch, and it works great in setting the mood. Highly recommend for any outdoor space. I had purchased a different set, but they were too heavy for my poles! These worked great attached to 2x2 cedar boards attached to the deck.",
      "rating": 5.0,
      "verified": true,
      "author": "Nick E.",
      "helpful_votes": 0,
      "publication_date": 20180519
    },
    {
      "title": "Perfect Night Lightning",
      "text": "These are gorgeous once installed. It changes the whole dynamic/mood once installed. It is important to note the bulbs themselves are sensitive and will break if you are not careful. I suggest installing first then install the bulbs. The bulbs arrive unattached to the string lights. Each one must be individually installed.",
      "rating": 5.0,
      "verified": true,
      "author": "Cherisen",
      "helpful_votes": 0,
      "publication_date": 20171022
    },
    {
      "title": "Great for backyard",
      "text": "Absolutely love these lights! Strung them up in my backyard and couldn't be happier! Puts out a great amount of light but isn't too bright. Only downside is each bulb has to be installed one by one and I did this off a ladder after I strung the strand up because I definitely didn't want to accidentally bust any of the glass bulbs",
      "rating": 5.0,
      "verified": true,
      "author": "Tonya",
      "helpful_votes": 0,
      "publication_date": 20170913
    },
    {
      "title": "21 busted bulbs",
      "text": "These lights looks great when they work! We just installed ours tonight and 21 of the bulbs on the last 1/2 of the string didn’t work of the 100ft strand I ordered. They sent 2 extra bulbs, which is nice, but about 19 short. Minus the faulty bulbs, they seem pretty resilient from breaking. Not that super fragile bulbs you get from target. Hope to receive some extra bulbs from the manufacture to make it right and perfect our backyard for summer.",
      "rating": 2.0,
      "verified": true,
      "author": "Allison Harris",
      "helpful_votes": 0,
      "publication_date": 20190512
    },
    {
      "title": "Best bang for your buck",
      "text": "If you want to take your patio to the next level, get these lights. They don’t look cheap, the bulbs are packaged carefully and the whole strand works great even through the rain.",
      "rating": 5.0,
      "verified": true,
      "author": "TypicalConsumer777",
      "helpful_votes": 0,
      "publication_date": 20200517
    },
    {
      "title": "Get extra bulbs!",
      "text": "I used this for my wedding. Fantastic lights. Gave a really nice ambience to the dance floor. The caterer charged $800 to rent their lights so we got two of these and so glad we did. Be very careful with the bulbs. We broke 10 while setting up.",
      "rating": 5.0,
      "verified": true,
      "author": "F.Caetano",
      "helpful_votes": 0,
      "publication_date": 20190901
    },
    {
      "title": "Was glad to be able to find these",
      "text": "Needed to replace a string of lights provided with a large tent for a wedding. Was glad to be able to find these. They were the correct wire color which were difficult to find. They came packaged well and were nice clean and new. We were proud to give them to replace the broken ones. They arrived quickly. Thank you.",
      "rating": 5.0,
      "verified": true,
      "author": "T. Malone",
      "helpful_votes": 0,
      "publication_date": 20171104
    },
    {
      "title": "Good quality string lights",
      "text": "We bought the 100ft string lights over a year ago and installed them around our patio and pool area. The only lights that have broken so far have been the ones my gardener broke by mistake doing his job. We have recently bought an extra string to illuminate the bbq area and a box of extra lightbulbs to have for the future. I can highly recommend the product!",
      "rating": 5.0,
      "verified": true,
      "author": "esukseus",
      "helpful_votes": 0,
      "publication_date": 20180818
    },
    {
      "title": "Great lights for indoor or outdoor!",
      "text": "Using these in my dance studio and they are exactly what I hoped for. They fill in around industrial fluorescent lighting, warming the light significantly. I wish it came with some spare bulbs, as we had a couple which were dead on arrival, but we just left those out in parts of the room that didn't matter as much.",
      "rating": 5.0,
      "verified": true,
      "author": "Sharon Rose",
      "helpful_votes": 0,
      "publication_date": 20171106
    },
    {
      "title": "Can only use 1 strand, not multiple",
      "text": "We bought this product to help light up our entire back yard. The crumby part is we needed 2 - 100 foot strands, so that is what we ordered. When we got the product we found out, you cannot put 2 strands together. The end of the strand will end with a lightbulb, not another plug. So now we have to plug in 2 different parts to light up the yard. Very annoying.",
      "rating": 2.0,
      "verified": true,
      "author": "Sara",
      "helpful_votes": 0,
      "publication_date": 20181210
    },
    {
      "title": "Real Nice Light",
      "text": "I am very pleased with this purchase. I hung the lights myself around the patio, 100 ft was a little more than I needed, but that was ok. I have set the lights on a timer and they provide so much light and it is a warm light. I am very happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "ldydianna",
      "helpful_votes": 0,
      "publication_date": 20190512
    },
    {
      "title": "Great for weddings",
      "text": "This came very well packaged. All the bulbs were in their own little cubby. The lights were perfect for our wedding. We had one strand strung up under a 10 x 30 tent and it was just the right amount of lighting!",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie Morgan",
      "helpful_votes": 0,
      "publication_date": 20200624
    },
    {
      "title": "Shorted sockets",
      "text": "These would have been great if they worked however came with several sockets shorted out. After pulling out the string and screwing in 100 bulbs it was disappointing to find several not working. At first I thought it was the bulbs but after further investigation and moving bulbs around it was the sockets that were bad. Painful to unscrew 100 bulbs and pack it back up.",
      "rating": 1.0,
      "verified": true,
      "author": "R3842ID",
      "helpful_votes": 2,
      "publication_date": 20171007
    },
    {
      "title": "Not worth  it",
      "text": "I Had to send back because they are so fragile. The bulbs are very thin and you also have to assemble everything.",
      "rating": 1.0,
      "verified": true,
      "author": "Wendy",
      "helpful_votes": 0,
      "publication_date": 20190819
    },
    {
      "title": "Perfect outdoor patio lights!",
      "text": "I couldn't be happier with this purschase! I have a tree on my patio that I hung these lights on and they work great. They give off nice warm ambient light that's subtle but lights the area well. In the past I purchased very similar lights from Crate & Barell for $40 per 25 ft string. These lights are basically the exact same and for 100 ft, it's a fraction of the price compared to Crate & Barrel. I'm glad that I found these.",
      "rating": 5.0,
      "verified": true,
      "author": "D Vodka",
      "helpful_votes": 0,
      "publication_date": 20170722
    },
    {
      "title": "Great VALUE for the money",
      "text": "We needed lights last minute for a BBQ and all the local stores were overpriced. We came across these from Brightown and my husband at first was skeptical that they may be too long but they were PERFECT! We ordered and paid extra for next day delivery and they arrived before 2 pm which gave us more than enough time to set up before the BBQ. We got A LOT of rave reviews from our guests who now want to purchase a box. Great value for your money and they are super bright since they come in a pack of 100 lights.",
      "rating": 5.0,
      "verified": true,
      "author": "Rosie Ortiz",
      "helpful_votes": 0,
      "publication_date": 20190204
    },
    {
      "title": "Love these lil lights of mine !",
      "text": "These make your shindig 10 times better.. they are bright and sturdy but look so nice as it illuminates your setting. Super long strand, I cant say enough about these. Comes with plenty extra bulbs.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "Great Purchase",
      "text": "I wasn't expecting these to be such good quality but I have been more then pleased with them. I actually ended up returning lights that I bought from home dept and purchased more of these because they were so much better and cheaper!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191015
    },
    {
      "title": "Keep in mind that they do suck a lot of electricity though",
      "text": "We ordered these lights to hang in our barn for our wedding. They looked so incredible at night, and the warm white color was exactly what we wanted. Everything came as expected. No broken bulbs, and all of them worked when plugged in. Keep in mind that they do suck a lot of electricity though, as we did have to run extension cords from a different building for them to work without being dull.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20160905
    },
    {
      "title": "Looks so pretty but... they shatter everywhere!!!!",
      "text": "These lights are beautiful but they break VERY easily. We literally broke about 6 bulbs just hanging them. Wish I could return but not worth it now.",
      "rating": 1.0,
      "verified": true,
      "author": "Mrs. Bando",
      "helpful_votes": 0,
      "publication_date": 20200921
    },
    {
      "title": "Perfect for our Barn Reception!",
      "text": "This set of lights was exactly what we were looking for to hang across our reception area in a barn. Provided enough light and looked gorgeous! Didn't mind that the bulbs were separate, just took a little extra time to prepare. All lights worked and we had NO broken bulbs! Awesome!",
      "rating": 5.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20181030
    },
    {
      "title": "Does not have connection at the end of the string",
      "text": "The lights themselves are exactly what you would expect however, once I got finished hanging the string, I realized there's no connection at the end to attach another string. Really bummed.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200418
    },
    {
      "title": "Absolutely terrible and extremely dangerous! DO NOT BUY!!!",
      "text": "Absolutely terrible and extremely dangerous! DO NOT BUY!!! The bulbs are ridiculously fragile and they break for absolutely no reason!!! I didn't even successfully get them hung up because so many bulbs kept breaking and now my yard is covered in shards of broken glass due to this terrible product.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200617
    },
    {
      "title": "DISAPPOINTED",
      "text": "Bought these once before and liked them. This time I bought them for a party we were having for labor day. Hung them up the day before only to find out none of the string worked. Then found out my window to return was over. So disappointed!!!",
      "rating": 1.0,
      "verified": true,
      "author": "greg brown",
      "helpful_votes": 0,
      "publication_date": 20190421
    },
    {
      "title": "They look nice. One bulb went out on the first night ...",
      "text": "They look nice. One bulb went out on the first night of use. it would have been nice to get some extra bulbs. I will see how they do over time. It has rained and there are no issues. The string of lights were tangled pretty good and not easy to untangle. Other than the minor nuances they do look good in the yard. I hope they last",
      "rating": 4.0,
      "verified": true,
      "author": "Melky",
      "helpful_votes": 0,
      "publication_date": 20170808
    },
    {
      "title": "Fragile",
      "text": "Did not come with a remote control. Light bulbs are incredibly fragile for outdoor use. Had the help of multiple people to install these lights and broke 6 of the lightbulbs while being gently trying to hang them up.",
      "rating": 2.0,
      "verified": true,
      "author": "Marie",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "These are a great buy. I bought these for a movie premiere ...",
      "text": "These are a great buy. I bought these for a movie premiere event that we were hosting and it truly added to the decor. The bulbs were individually wrapped to avoid being broken and none were broken when our package arrived. I was completely satisfied with my ordering experience. I would definitely order from them again. I give them five stars for the product and customer service!!",
      "rating": 5.0,
      "verified": true,
      "author": "jim",
      "helpful_votes": 0,
      "publication_date": 20180322
    },
    {
      "title": "love these!",
      "text": "Very cute! The bulbs come in 4 packages of 25. Of all 100 bulbs, only 1 was broken. While there were a couple burnt out already, the extra bulbs definitely came in handy. So excited to have these, great product for their price!",
      "rating": 4.0,
      "verified": true,
      "author": "Lindsay Rose",
      "helpful_votes": 0,
      "publication_date": 20200924
    },
    {
      "title": "Nice effect!",
      "text": "These lights work perfectly, all bulbs and sockets lit up out of the box. They are a nice soft white and look great! I followed the tip mentioned in the reviews to hang the light strand before inserting the bulbs and I’m glad that I did- this strand is 100 feet+ and it took a bit of laying out and repositioning in order to make the final product look even. The strand is nice and light, even with the bulbs installed. We used self tapping screws and zip ties to hang.",
      "rating": 5.0,
      "verified": true,
      "author": "Heather",
      "helpful_votes": 0,
      "publication_date": 20190527
    },
    {
      "title": "Tedious Assembly for a product that Didn't Even Work",
      "text": "All bulbs came in separate boxes so you need to install every single bulb! Which would be annoying enough if the string was packed well. But it's not, so I found myself untangling 100ft of light string while screwing in 100 ft of bulbs. All of this was annoying enough but then I plugged them in annnndd..... NOTHING! I was so frustrated I just gave up, put them back in the box and right into the garbage.",
      "rating": 1.0,
      "verified": true,
      "author": "McCartney",
      "helpful_votes": 0,
      "publication_date": 20180613
    },
    {
      "title": "they should find a better to package them but I emailed them back and ...",
      "text": "They came out very well but the only problem was that I had so many shattered lights, they should find a better to package them but I emailed them back and they were able to send me about 25 new bulbs which 5 was still shattered but other than that, it came out great for my thanksgiving backyard dinner",
      "rating": 4.0,
      "verified": true,
      "author": "Ney",
      "helpful_votes": 0,
      "publication_date": 20171204
    },
    {
      "title": "Super bright.",
      "text": "Lights look amazing. Used them in my backyard and it completely lights it up, no other lighting needed. Adds a classy touch that normal string lights wouldn’t have. You have to put all the bulbs in on your own. I dropped one from the ladder and it hit a step then the ground. Didn’t even crack!!",
      "rating": 5.0,
      "verified": true,
      "author": "Dean",
      "helpful_votes": 0,
      "publication_date": 20181021
    },
    {
      "title": "10/10 would recommend",
      "text": "We’ve bought these twice now.. really great quality! They made it through winter and high wind with no problem. They put off loads of light and are super durable. People compliment them all the time",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer Jane Hirschmann",
      "helpful_votes": 0,
      "publication_date": 20191020
    },
    {
      "title": "Unsafe.",
      "text": "Do not buy this product! I bought the lights for my patio and not even a month later they stopped working. After doing a little troubleshooting it was determined that there was moisture somewhere in the lights. I contacted the manufacturer who insisted this was impossible and almost had me convinced until I almost electrocuted myself the next time I plugged in the lights. Complete waste of money, and quite dangerous.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200712
    },
    {
      "title": "Highly recommend!!!",
      "text": "Amazing! These lights came so well packaged I don’t see how any bulbs could be broken and you get two spares. They were exactly what we were looking for and let off so much light way more then we were expecting. We hung on the pergola and no longer use the patio lights. I highly recommend!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Nita",
      "helpful_votes": 0,
      "publication_date": 20180710
    },
    {
      "title": "Very good purchase. Screw in bulbs after wire is strung.",
      "text": "I’m very happy with this product. I bought the 100’ set and strung it in my back yard with some cable. Everyone in the negative reviews complained about the bulbs not being installed when they got them. But I found it to be perfect. Because you don’t have to be as careful when string the wire. After I strung everything and screwed in bulbs, they looked wonderful. I did this last summer and they’re still going strong through or 50 mph winds during the winter and all. Would recommend to a friend.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa",
      "helpful_votes": 0,
      "publication_date": 20190405
    },
    {
      "title": "These broke within 3 tmonths",
      "text": "These were lovely while they lasted but the wire broke within 3 months. They were kept in one place once they were hung so they were not damaged from use. They were just poorly made. These were not cheap so I would go with a more reputable brand.",
      "rating": 2.0,
      "verified": true,
      "author": "Katherine Parker",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "Lasting lights",
      "text": "These lights are long cover alot of ground exactly what I needed. They have a long bulb life I've had them up for over 4 months with every night use and they are still going strong.",
      "rating": 5.0,
      "verified": true,
      "author": "Shlynn",
      "helpful_votes": 0,
      "publication_date": 20190929
    },
    {
      "title": "As advertised.  Look great",
      "text": "Light bulbs all worked after being installed (they included some extras), there are alsdo little clips in case you want to attach this to a support wire. After inspecting how durable they are, I decided not to use a support wire.",
      "rating": 5.0,
      "verified": true,
      "author": "C Johnston",
      "helpful_votes": 0,
      "publication_date": 20190511
    }
  ],
  "product_meta": {
    "title": "Brightown Outdoor Patio String Lights-100Ft G40 Backyard Lights with 104 5W Edison Clear Bulbs(4 Spare), UL listed Waterproof Hanging Lights for Balcony Porch Bistro Party Decor, C7/E12 Socket, Black",
    "rating": 4.5,
    "feature_bullets": [
      "【Dimmable & Energy Saving】G40 outside deck lights with 100 glass bulbs and 4 spare bulbs. 1.5\" bulb, E12/C7 candelabra socket base, 5W per bulb, help you to save more electricity bid. Dimmer compatible bulb, creating a warm and romantic atmosphere",
      "【Durable】100 hanging sockets, 6\" lead, 12\" spacing between bulbs, 6\" tail with female connector, total 100FT. The flexible strand that is thicker than a traditional rope to withstand the wear and tear of year-round outdoor use. NOT CONNECTABLE",
      "【Waterproof & Safety】UL certified outdoor lights is built with weatherproof technology, which can withstand extreme temperatures, rain, wind, and damp climates. Safety electric string light either with a built-in spare fuse for easy replacement",
      "【Practical & Easy to Install】Outdoor bistro decorative lights is very easy to install with a cable tie or cup hook, fix it or place it anywhere as you need. Flexible and practical, a light bulb that goes out does not affect other lighting bulbs",
      "【Widely Used & Warranty】These commercial lights great for balcony garden pergola gazebo tent market cafe umbrella wedding party etc. Please contact the seller directly if you have any quality problems. For Bulbs replacement, please search B00R25V92Y"
    ],
    "specifications": {
      "Product Dimensions": "17.1 x 12.2 x 5.5 inches",
      "Item Weight": "5.3 pounds",
      "Manufacturer": "Brightown",
      "ASIN": "B00V2UKN0Y",
      "Item model number": "100black-G40",
      "Customer Reviews": "4.5 out of 5 stars2,211 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#3,421 in Tools & Home Improvement",
      "Is Discontinued By Manufacturer": "No"
    },
    "categories": [
      "Lighting & Ceiling Fans",
      "Outdoor Lighting",
      "Garden & Outdoor",
      "Tools & Home Improvement",
      "String Lights"
    ],
    "price": 59.99
  }
}