{
  "website_summaries": [
    {
      "verdict": "This high-end tamper is factory calibrated to deliver the right pressure, and clicks to let you know when you've hit the mark.",
      "pros": [
        "Factory calibrated for 30 lb",
        "of pressure, the recommended force for great espresso",
        "No need for calibration or adjustment",
        "Subtle click releases at the proper pressure",
        "Stainless steel base, anodized aluminum handle",
        "Comes in several sizes",
        "Solid and well-made"
      ],
      "cons": [
        "Very pricey",
        "Ensures proper tamping pressure, which espresso experts may have already achieved"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great",
      "text": "We have purchased 3 of these tamps and as I do like them and their consistency they seem to be extremely fragile and will quit clicking. Out of the 3 that we purchased they have all quit clicking. We have a foam mat in our shop and when a barista accidentally drops on of these tamps they always quit clicking. In a perfect world a barista would never drop a tamp but as it is bound to happen I feel like these tamps are too fragile and expensive for the coffee shop environment.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181110
    },
    {
      "title": "Update: Clicker stopped working!!!!",
      "text": "Update: The \"click\" stopped working after a few regular uses. This is extremely disappointing because for over $100, I now have a regular tamper. I do not recommend now and the company should correct this with their customers.",
      "rating": 1.0,
      "verified": true,
      "author": "JBSerious",
      "helpful_votes": 0,
      "publication_date": 20200725
    },
    {
      "title": "Precision tampering",
      "text": "Great unit once you lubricate the shaft with food quality silicone lubricant. The spring movement was anything but smooth when this unit arrived, so if you purchase one, plan to lubricate it. Once lubricated, it is the ticket for consistent tamping pressure for someone who only makes a few coffees a day. I'm now forever spoiled. All I have to do now is tweak my grind a bit and it's perfect shots every time.",
      "rating": 5.0,
      "verified": true,
      "author": "Harry J Stuivenga",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "Quality tamper, helps with consistency of tamping.",
      "text": "Well constructed. Measured 27lb force on my bathroom scale (which isn't the most accurate in the world - but it's in the ballpark). The magnitude of the tamping force isn't as critical as the repeatability. Works well on a Silvia double basket (though at low doses, eg. 12g, the basket shoulder prevents the tamper from fully tamping). Most importantly, it helps a beginner with consistency when applying the tamping force. One less variable to worry about.",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony Thng",
      "helpful_votes": 0,
      "publication_date": 20161011
    },
    {
      "title": "Crema Suprema..",
      "text": "....constently with every pulled shot...Yes, costly however worth every penny in the results. You sprung for \"La Maquina\" now outfit it with a calibrated tamper...looks faboo on my counter.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Beck",
      "helpful_votes": 2,
      "publication_date": 20140930
    },
    {
      "title": "not truly convex",
      "text": "The description is stating convex, the box is stating convex but the tamper is flat",
      "rating": 1.0,
      "verified": true,
      "author": "Mohammed A.",
      "helpful_votes": 2,
      "publication_date": 20181226
    },
    {
      "title": "Perfect",
      "text": "This tamper is well made and does what it is supposed to do. I would recommend this to anyone needing a 57mm tamper. The calibrated tampers take the guess work out how much pressure to apply with a standard tamper.",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan C. Greene",
      "helpful_votes": 0,
      "publication_date": 20140114
    },
    {
      "title": "Well built",
      "text": "This tamper is very well built and easy to use. I’m so glad we purchased it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200223
    },
    {
      "title": "Highly recommend!",
      "text": "Sturdy and you can definitely feel the quality that has been put into this tamper. Highly recommend and very satisfied!",
      "rating": 5.0,
      "verified": true,
      "author": "George Shlimon",
      "helpful_votes": 0,
      "publication_date": 20191120
    },
    {
      "title": "I love this tamper",
      "text": "I love this tamper. My shots are super consistent. This tamper + good grinder and high end espresso machine are the perfect match.",
      "rating": 5.0,
      "verified": true,
      "author": "Sergey",
      "helpful_votes": 0,
      "publication_date": 20180610
    },
    {
      "title": "amazing",
      "text": "I love it, it feels great in the hand and it works amazingly well. my Espresso got improved from the first use. costly ..but worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "Wiaam Al Salmi",
      "helpful_votes": 0,
      "publication_date": 20180312
    },
    {
      "title": "supersweet",
      "text": "awesome!!!!!!!!! I wish I bought one of these earlier instead of buying other ones before this one. I love it!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Rick Hill",
      "helpful_votes": 0,
      "publication_date": 20131206
    },
    {
      "title": "30lbs of pressure every time... what's not to love about this???",
      "text": "This is by far my favorite espresso machine accessory. I have a few other tampers but this one is the easiest one to use. The built in \"click\" is nice to know once you've reached the 30lb worth of force down on the puck. It really does make tamping almost fool proof. I use this in combination with a, which helps me to level out the grinds prior to tamping. So far so good!",
      "rating": 5.0,
      "verified": true,
      "author": "gadgetman",
      "helpful_votes": 0,
      "publication_date": 20170203
    },
    {
      "title": "Excellent, I can now tamp properly",
      "text": "I'm new to the espresso world and had a heck of a time tamping (I was over-tamping before this product and wasting lots of coffee). It has a very sturdy high quality build, looks great next to the machine and is very easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "MikeSoCal",
      "helpful_votes": 0,
      "publication_date": 20190821
    },
    {
      "title": "Overpriced, but does what it claims to, built well",
      "text": "Do you need this? No. Is it overpriced? Yes. But.. it really helps get a consistent tamp, removing a variable from the equation when trying to get a perfect shot. The workmanship and materials are appropriately premium, and it has a very hefty feel to it.",
      "rating": 3.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 2,
      "publication_date": 20160204
    },
    {
      "title": "Exceeds expectations",
      "text": "Wife loves it. End of story. Small of stature, she can work the tamper just fine. She now has crema on her double shot, a revelation.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael SB",
      "helpful_votes": 2,
      "publication_date": 20170111
    },
    {
      "title": "The gold standard for tamping!",
      "text": "Pretty darned cool. Wish I had bought one years ago! Great weight and feel. It ain’t really sexy like some others, but it Works perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Capt. Gizmo",
      "helpful_votes": 0,
      "publication_date": 20180417
    },
    {
      "title": "Surprisingly heavy",
      "text": "If you get the perfect grind size then the tamper will have perfect pressure when it clicks down. It will click down at 30 lbs which is the recommended pressure for tamping. It’s also surprisingly heavy.",
      "rating": 5.0,
      "verified": true,
      "author": "KyeDye",
      "helpful_votes": 0,
      "publication_date": 20180716
    },
    {
      "title": "it works",
      "text": "works as described... and that is refreshing, a key part of consistent espresso shots",
      "rating": 5.0,
      "verified": true,
      "author": "Becca V.",
      "helpful_votes": 0,
      "publication_date": 20180302
    },
    {
      "title": "This is the LAST and ONLY tamper you'll ever buy.",
      "text": "Literally the BEST tamper on the market for your morning routine. Yes, it's not the prettiest wooden tamper on the market, but I'll pay you $5 to find one as simplistic and time-saving as this, in terms of consistency AND decreasing channeling!",
      "rating": 5.0,
      "verified": true,
      "author": "Student Pharmacist",
      "helpful_votes": 0,
      "publication_date": 20161223
    },
    {
      "title": "My Cappuccino's are consistantly perfect. I will never make another Cappuccino without a ...",
      "text": "Using this product makes a big difference. My Cappuccino's are consistantly perfect. I will never make another Cappuccino without a Tamper.",
      "rating": 5.0,
      "verified": true,
      "author": "ira s klepper",
      "helpful_votes": 0,
      "publication_date": 20170718
    },
    {
      "title": "Recommended!",
      "text": "Really well built. It is solid and the pressing force corresponds to the description (verified with the digital scale). Recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "Giancarlo",
      "helpful_votes": 0,
      "publication_date": 20170901
    },
    {
      "title": "Stopped clicking.",
      "text": "I did purchase this item less than a year ago. This week for whatever reason, it stopped clicking for whatever reason it is. That is very disappointed especially for the little use I had for it and especially for the price I paid for. I am very disappointed",
      "rating": 4.0,
      "verified": true,
      "author": "Malik Tabet",
      "helpful_votes": 0,
      "publication_date": 20201127
    },
    {
      "title": "Consistency",
      "text": "They are so many variables in making a good cup of espresso that elimination of any of them is a good idea. I know I have a consistent tamp from by Espro",
      "rating": 5.0,
      "verified": true,
      "author": "Eric J. Hoover",
      "helpful_votes": 0,
      "publication_date": 20201217
    },
    {
      "title": "A waste of money!",
      "text": "There's a lot more to pulling a shot of espresso than a good tamp. You're a schmuck if you buy this. Buy a regular tamp and a cheap kitchen scale. Practice tamping until the scale reads 30 pounds. I just saved you $100.",
      "rating": 1.0,
      "verified": false,
      "author": "E. Perreault",
      "helpful_votes": 4,
      "publication_date": 20181127
    },
    {
      "title": "Cost to performance....",
      "text": "At last! A tamper costing more than my espresso machine!",
      "rating": 5.0,
      "verified": false,
      "author": "NHead",
      "helpful_votes": 0,
      "publication_date": 20190223
    }
  ],
  "product_meta": {
    "title": "ESPRO Calibrated Stainless Steel Convex Espresso Coffee Tamper, 58 mm, Black",
    "description": "Size:58 mmSometimes Things Just Click. Our company began with a search for perfection and a desire to eliminate unknown variables from the brewing process, which led us to develop the ESPRO Calibrated Tamper, our very first product and patent. The Tamper replaces guesswork with precision by delivering an exact 30 pounds of force with a reassuring click every time. Water will always seek the path of least resistance. ESPRO’s Calibrated Tamper ensures that all the grounds are compressed uniformly and consistently, creating perfectly even resistance against water pressure and ensuring full saturation. By eliminating variations in tamping force, we’ve made it possible to ensure consistent espresso from barista to barista, hour to hour, day to day, with only the need for a simple grinder adjustment. We designed the tamper with a stainless steel base and an anodized aluminum handle for durability, and it’s available in a variety of sizes with both flat and convex bases.",
    "rating": 4.1,
    "feature_bullets": [
      "CONSISTENT ESPRESSO, EVERY TIME - Consistently great espresso needs a constant 30 pounds of tamping force. The ESPRO Calibrated Tamper brings this consistency day in, day out",
      "FACTORY CALIBRATED - Does not require recalibration or adjustment",
      "PERFECT BALANCE - Just like the perfect espresso, the perfectly balanced ESPRO Calibrated Tamper just feels right in your hand",
      "A CLICK YOU FEEL - The click is a subtle click that you feel rather than hear - it won’t disturb the grinds and cause channeling",
      "SUBSTANTIAL - A solid tool for baristas, with a stainless-steel base and an anodized aluminum handle",
      "FIVE CONVEX BASE OPTIONS - please check your espresso machine basket size - 49 mm, 51 mm, 53 mm, 57 mm, 58 mm (good for espresso baskets with slightly curved bottoms)"
    ],
    "specifications": {
      "Product Dimensions": "2.25 x 3.5 x 2.25 inches",
      "Item Weight": "1 pounds",
      "Manufacturer": "ESPRO",
      "ASIN": "B00VJWGHIW",
      "Item model number": "3058C",
      "Customer Reviews": "4.1 out of 5 stars68 ratings4.1 out of 5 stars",
      "Best Sellers Rank": "#6,690 in Amazon Launchpad",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "March 16, 2015"
    },
    "categories": [
      "Home & Kitchen",
      "Coffee & Espresso Machine Parts & Accessories",
      "Small Appliance Parts & Accessories",
      "Espresso Machine Accessories",
      "Tampers",
      "Kitchen & Dining"
    ],
    "price": 99.95
  }
}