{
  "website_summaries": [
    {
      "verdict": "For anyone who suffers from dry, cracked lips, this lip mask makes a world of difference and is an essential part of a nighttime routine.",
      "pros": [
        "Penetrates deep into lip skin to add moisture and make lips soft and supple",
        "Can easily be worn during the day in addition to at night as it gives lips an attractive shine",
        "Has pleasant berry scent",
        "Purchase includes spatula to use in applying mask"
      ],
      "cons": [
        "Is a bit sticky, making it hard to wash off fingers"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "I LOVE laniege lip sleeping mask",
      "text": "I LOVE laniege lip sleeping mask. It is a miracle worker, plus it smells so good and feels like nothing on my lips. However, the product I got from this seller was NOT the normal lip sleeping mask- instead it is odorless, feels waxy and tastes bad. the normal mask is thin and sheer, while the one I got was thick and opaque. Definitely buy this mask- just don't buy it from this seller.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 399,
      "publication_date": 20180624
    },
    {
      "title": "SCAM PRODUCT ⚠️",
      "text": "The jar looks completely different than the Laneige Brand's and the instructions were in a foreign language. No telling what kind of ingredients are in the actual product so I definitely won't be using it.",
      "rating": 1.0,
      "verified": true,
      "author": "Cassie M.",
      "helpful_votes": 262,
      "publication_date": 20190131
    },
    {
      "title": "Fake product",
      "text": "This product is fake. Not the real lip mask. Packaging doesn’t look the same and neither does the container itself.",
      "rating": 1.0,
      "verified": true,
      "author": "Mary Nelson",
      "helpful_votes": 81,
      "publication_date": 20180802
    },
    {
      "title": "Miracle worker",
      "text": "I read the concerns about this being a fake product and I do not think it is. It just appears that it is a different version that might be sold in Korea, which explains the Korean writing and the different scents available. The product is thick but not greasy or goopy, and so moisturizing. I put a lot on at night and wake up with soft, hydrated lips. I use a little during the day to keep them feeling soft. I have tried so many different products to get rid of my chapped, suburned and windburned skin, and this one does the trick.Has a light fragrance but no flavor.",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 69,
      "publication_date": 20180313
    },
    {
      "title": "Fake product?",
      "text": "Don't know if this is the genuine product on the market or not. Maybe I'm just highly disappointed. I've been eyeing this product for MONTHS as a person with severely chapped lips and finally just went and bought it. However, as far as I can tell, this is just a jar of very sticky, fruity balm that does nothing. In fact, it was so sticky that I feel like it made my situation worse. Can't believe I spent almost $20 on this, wow.",
      "rating": 1.0,
      "verified": true,
      "author": "Daphne wang",
      "helpful_votes": 20,
      "publication_date": 20180910
    },
    {
      "title": "No regrets.",
      "text": "I wasn’t sure if this was worth the money, but totally is. I have crusty nasty lips during the hot summer and cold winters. so far this has saved me every night! I forgot to use it for 2 nights and my lips were so sore again. Lipstick the next morning looks amazing! This stuff is great! Sweet subtle smell. I’m super sensitive so this is really mild. Although the wand is great, I doubt after 6 more months, I’ll still know where it is. Too bad bc it’s a nice touch. Maybe I’ll tape its little envelope to the lid!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazonhappy",
      "helpful_votes": 11,
      "publication_date": 20180731
    },
    {
      "title": "This is a knockoff. Don’t buy from this supplier.",
      "text": "This is a knockoff and NOT the real product and should be advertised as one.",
      "rating": 1.0,
      "verified": true,
      "author": "MyTake",
      "helpful_votes": 15,
      "publication_date": 20181116
    },
    {
      "title": "FAKE PRODUCT! Do not buy.",
      "text": "Fake product. All instructions in Korean. If you refer to the LANEIGE website, you will realize that their product instructions are in ENGLISH! Requesting refund ASAP!",
      "rating": 1.0,
      "verified": true,
      "author": "Van",
      "helpful_votes": 19,
      "publication_date": 20180807
    },
    {
      "title": "Works well for me",
      "text": "Korean market version of product. Honestly I can't see the difference vs the sample I had from Sephora. Seems to be the same texture, color and fragrance. Perhaps there are more lax quality control standards which explains the mixed reviews. Results are the same. Amazon should probably specify that this is not the US version of the product. I understand why people are put off by it and honestly I'll just go to Sephora next time. Since it works just as well for me, 4 stars. I had a sample size pot and the full size is much bigger than I realized. This will probably last 6 months or longer.",
      "rating": 4.0,
      "verified": true,
      "author": "GoodNoodle",
      "helpful_votes": 9,
      "publication_date": 20190206
    },
    {
      "title": "great for CPAP users",
      "text": "Saved my lips when nothing! else was working, not even carmex. I use a CPAP machine so essentially have wind blowing over my nose and mouth all night. This forms a long lasting, moisturizing, protective barrier. Also, I am prone to pimple break outs on my lip line and this caused no irritation or breakouts. I find the application a little messy and not as easy as a stick, but that is really minor. So glad to have found this!",
      "rating": 5.0,
      "verified": true,
      "author": "Tesla Sulu",
      "helpful_votes": 7,
      "publication_date": 20180707
    },
    {
      "title": "Best ever!",
      "text": "I LOVE this. The hype is real with this product. I didn’t like the berry scent that Sephora has, but I’ve heard such good things about the actual product. This smells like real grapefruit, and feels SO nice on the lips. You also get a ton of product, which is great, and a tiny spatula so you’re not putting your fingers in the product. There is a noticeable effect the morning after using the mask, and my lips feel so nice!",
      "rating": 5.0,
      "verified": true,
      "author": "Samantha",
      "helpful_votes": 8,
      "publication_date": 20180602
    },
    {
      "title": "Fabulous Lips!",
      "text": "I’m addicted, it does everything it says. Read some previous reviews about authenticity and it does contain Korean instructions but that’s because you’re getting it from Korea and not the American version from Sephora.",
      "rating": 5.0,
      "verified": true,
      "author": "Grizz",
      "helpful_votes": 9,
      "publication_date": 20181102
    },
    {
      "title": "Great for dehydrated lips",
      "text": "I feel that this lip balm works very well to moisturize as opposed to only sitting on top of the lips as a protectant, i. e. Vaseline. I use it nightly or apply it before a shower and end up with very soft, hydrated lips. Skip the spatula, it's tedious. Generous amount in container so it should last a while.",
      "rating": 5.0,
      "verified": true,
      "author": "AC",
      "helpful_votes": 96,
      "publication_date": 20160809
    },
    {
      "title": "FAKE PRODUCT!!",
      "text": "DO NOT order this product. It is fake!! I went and bought the actual real “Laneige Lip Sleeping Mask” at Sephora. The one on here is FAKE!! don’t waste your money!! The front of the boxes are different- the bottles look different and the back of the fake box is written in a foreign language.",
      "rating": 1.0,
      "verified": true,
      "author": "Darren ODonnell",
      "helpful_votes": 8,
      "publication_date": 20190908
    },
    {
      "title": "Great formula, sweet grapefruit flavor",
      "text": "I’m torn about this. I love the Laneige lip sleeping mask formula, but the grapefruit flavor is too strong for me. I know it’s very YMMV, but it’s like a sickly sweet grapefruit gummy candy. I do actually use this most often before bed, so the punchy citrus is not my fav. Everything else is great. Texture, hydration, packaging. Vanilla will always be where it’s at.",
      "rating": 3.0,
      "verified": true,
      "author": "A & J",
      "helpful_votes": 5,
      "publication_date": 20180812
    },
    {
      "title": "Love",
      "text": "I really like this sleeping mask, I have a bad habit of biting or picking at my lip when I'm nervous and it's hard to stop when the new skin is so rough growing back. But this helps nourish my lips and the skin grows back much more smoothly and although I'm not completely cured of this habit, it has gotten a lot better thanks to this sleeping pack. I use it every night and there's a little applicator that comes with it which is a lifesaver because the actual product is so thick and sticky it's hard to wash off your fingers (when I used a free sample of this I had problems with that).",
      "rating": 5.0,
      "verified": true,
      "author": "EmmaTop Contributor: Makeup",
      "helpful_votes": 8,
      "publication_date": 20170602
    },
    {
      "title": "Disappointed",
      "text": "Background: I suffer from chronic eczema and I’ve always had very dry lips and the skin around my lips as well. I don’t know if I necessarily have eczema round my mouth but either way I am some one that needs to apply high quality chapstick every 3-4 hours. When I drink more water on certain days, it seems I need to apply it every 5 hours. SO I was excited to try this. Sadly I woke up the first three mornings in a row with just as dry lips as I did before testing this lip mask. It feels great going on! But no results means I’ll probably just end up using this as a backup daily lip balm.",
      "rating": 1.0,
      "verified": true,
      "author": "Marisa Nelson",
      "helpful_votes": 2,
      "publication_date": 20191014
    },
    {
      "title": "It's the real product, yall are just xenophobes",
      "text": "This is the real product. Just the Korean version. Just because the instructions and the box are \"not even in english\" doesn't make it fake. It's a Korean based brand. In other news, I love this product. My lips are ALWAYS horribly chapped because I'm a anxious lip biter who loves matte lipstick. This has done WONDERS for my lips. They're super hydrated and plump when I wake up and dont get chapped throughout the day. 10/10 will be recommending to everyone I know",
      "rating": 5.0,
      "verified": true,
      "author": "Katharine Daniels",
      "helpful_votes": 4,
      "publication_date": 20190704
    },
    {
      "title": "Works well but it's not the real thing",
      "text": "1. I sincerely doubt this is the \"real\" product as all of the writing is in Asian characters and this is not an Asian product. 2. It worked super well for me. I've been using this product pretty much every night for over a month and my lips went from chapped and pealing to smooth. 3. About a week ago I started breaking out along my lip line. Could be a coincidence but my gut tells me it's not. Bottom line? Get this from Sephora or another beauty store. Beauty products from Amazon may look like the product, but they don't have to be the actual product.",
      "rating": 3.0,
      "verified": true,
      "author": "Nicole A.",
      "helpful_votes": 4,
      "publication_date": 20181113
    },
    {
      "title": "Really works",
      "text": "I read an article about this product that claimed it was a great product for chapped lips. I got this for my daughters for Christmas and they both tell me it really works. We all suffer from chapped lips all winter long and are always looking for effective products. I am definitely going to buy some for myself.",
      "rating": 5.0,
      "verified": true,
      "author": "Frannie",
      "helpful_votes": 3,
      "publication_date": 20200104
    },
    {
      "title": "Really excellent lip treatment. Feels great, works great!",
      "text": "I've always loved to put something thick and hydrating on my lips at night. A treatment. It's not terribly sick but you can adjust the thickness. It smells excellent I ordered Barry and I love the little applicator. After the second day when I woke up I couldn't see any dry skin and my lips felt very soft. Then after using it, once in a while, I would wake up with a little bit of dry skin but it came off very easily. The skin was soft enough just to roll off my lips. But that is a pretty rare occasion when I have some skin on my lips in the morning.",
      "rating": 5.0,
      "verified": true,
      "author": "Reallylovespink",
      "helpful_votes": 2,
      "publication_date": 20190813
    },
    {
      "title": "Make the trip and buy this at Sephora",
      "text": "I’ve purchased this product before at Sephora. I figured I would save myself a trip and order online. The consistency did seem a little off but I didn’t think much about it, until the next morning when my lips were chapped and burning. I wear chapstick everyday and have never had my lips this dry. Please DO NOT PURCHASE THIS PRODUCT!! I have no idea what I put on my face. After watching these documentaries online about fake makeup I’ve decided I will no longer buy certain things online",
      "rating": 1.0,
      "verified": true,
      "author": "Breanna Nava",
      "helpful_votes": 2,
      "publication_date": 20200203
    },
    {
      "title": "Great product and value!",
      "text": "Great product! As advertised. My sister has the same product but it was purchased at sephora for about $20. Laneige is a Korean brand. The packaging is written in a foreign language so I’m assuming it’s from the original Korean brand but without the int’l shipping.",
      "rating": 5.0,
      "verified": true,
      "author": "ACobs73",
      "helpful_votes": 4,
      "publication_date": 20190627
    },
    {
      "title": "Knock off lip sleeping mask (berry)",
      "text": "Okay I ordered this thinking I got an amazing deal and it was the real thing but it wasn’t. When I received it there was Chinese or Korean writing on the back I’m not sure. I took it out the box and it had the same thing on the lip mask. The scent I could barley even smell. To me the moisture wasn’t good. The only good thing about this is that it copied the real deal the box the lip mask it self the name of the company and the berry flavor/ look itself . I regret buying it waste of money. Just buy the real thing worth the money.",
      "rating": 1.0,
      "verified": true,
      "author": "celeste",
      "helpful_votes": 3,
      "publication_date": 20190701
    },
    {
      "title": "I LOVE this for my lips!",
      "text": "I have troubles waking up with dry, chapped lips. I put some kind of lip balm on every night, but still wake up with flaky dry lips. I heard about this from Angie on You Tube (Hot&Flashy), and I LOVE it! It feels so luxurious and the smell is amazing. When I wake up in the morning my lips are still dewy and soft. (And I even drink water several times during the night!) I also like using it during the day on non-makeup days. I'm getting these for gifts for all my friends and family!",
      "rating": 5.0,
      "verified": true,
      "author": "Karen",
      "helpful_votes": 2,
      "publication_date": 20190528
    },
    {
      "title": "Very good texture, not sticky.",
      "text": "Good smooth texture, not sticky, very mild scent that is not really detectable once applied. I use as a balm throughout the day, every lip product Ive ever applied and had on overnight makes my lips feel weird the next morning, this did the same. So I wont be using it as a mask. But nothing against this product personally because all lip products/and face moisturizers that slip down on to the lips feel that way to me if left on overnight and Its a pet peeve for me. Its not sticky at all. I liked the little silicone tipped applicator, never seen that before and it was nice! Pretty Packaging. Arrived fast.",
      "rating": 4.0,
      "verified": true,
      "author": "Lady Frost",
      "helpful_votes": 0,
      "publication_date": 20190715
    },
    {
      "title": "Not worth it",
      "text": "I have been using this for a while and it is not any better than any other lip product in my opinion. I have extremely dry chapped peeling lips due to being 45, living in Albuquerque, and picking at them absentmindedly when I am stressed. So I would try anything, but am very sad to say that this product did not change my situation, and my lips are still peeling in the morning. There IS A LOT of product in the jar, however, it does not really help me. The only thing I have tried so far that makes a small dent in the problem is a balm by Pacifica.",
      "rating": 1.0,
      "verified": true,
      "author": "cheryl sw",
      "helpful_votes": 2,
      "publication_date": 20180625
    },
    {
      "title": "Would recommend",
      "text": "Costly but appears to be authentic and you receive a large quantity. Even after one use noticed a difference on my lips....I put it on at night before bed and in the morning before make up. Been a life savor this winter.",
      "rating": 5.0,
      "verified": true,
      "author": "Katie Hobson",
      "helpful_votes": 3,
      "publication_date": 20190310
    },
    {
      "title": "Holy Grail for Dry Lips",
      "text": "I cannot rave about this product enough. I have bought this as a present for all of my friends because of how great it worked for me. I do lip masks almost every night, but I would still get chapped lips on cold days. This lips mask has (no exaggeration) transformed my lips. It not only smells nice, it applies evenly, and after three days of use I did not have chapped lips. I stopped using it for a couple of days and experienced some flaking, but when I use it every night my lips remain soft and nonflaky. Definitely is worth the try for anyone with dry lips.",
      "rating": 5.0,
      "verified": true,
      "author": "JJTop Contributor: Pets",
      "helpful_votes": 2,
      "publication_date": 20171230
    },
    {
      "title": "I bought this at the recommendation of a pretty popular youtuber",
      "text": "I bought this at the recommendation of a pretty popular youtuber; and I am on my second night using this, and I can visibly see how much better my lips are after I use this. My lips are softer, and got a healthy rosey plup to them. I am very impressed, and seeing how little you need to actually cover your lips, I'd imagine this jar is gunna last three or four months, maybe more. As someone who is obsessed with MATTE, unforgivingly non-transfer, all day liquid lipsticks, this is gold in a jar. I just might be able to wear mattes all summer after all ;)",
      "rating": 5.0,
      "verified": true,
      "author": "christina",
      "helpful_votes": 4,
      "publication_date": 20170704
    },
    {
      "title": "LOVE IT",
      "text": "My lips were so chapped and absolutely NOTHING was working. It literally looked like there were stitches in my lips from how chapped they were. At my last resort, I found this product from a google search. The hype on this product is very well deserved. I put it on before bed and they were almost back to normal the next morning. I also enjoyed the berry scent. It definitely gave me lips a youthful look as well after using for a week straight. I would 100% recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "TheTay",
      "helpful_votes": 0,
      "publication_date": 20190420
    },
    {
      "title": "Befitting for a Queen !!!!",
      "text": "Hello Queens you will love this. My lips stay dry from thyroid disease so I needed something that works great, last long, smooth and makes my lips feel soft. For the size as you see in my hand it's a bit pricey but worth it. It does have a berry scent but not a berry color once it goes on your lips, if you want color add your favorite lipstick. Good luck Queens and enjoy",
      "rating": 5.0,
      "verified": true,
      "author": "Pretty-N-Pink",
      "helpful_votes": 0,
      "publication_date": 20200905
    },
    {
      "title": "Better than lip balm.",
      "text": "My lips are always dry and chapped. I use lip balm until I lose them - which is, every other day. Laneige lip sleeping mask is awesome. I usually put it on every other night, right after my night time routine (night moisturizers after a shower and then the lip sleeping mask). Next morning I wake up to soft lips. No need to apply and re-apply lip balm throughout the day! I've used this while I was living in Northern California (mild temperatures), to Las Vegas (very hot in the summer and very cold and dry in the winters). Incorporate it into your night time routine - it's worth it! It also has a very light and pleasant, sweet smell.",
      "rating": 5.0,
      "verified": true,
      "author": "Patricia M.S",
      "helpful_votes": 0,
      "publication_date": 20170410
    },
    {
      "title": "No more dry cracking peeling lips...really works!",
      "text": "This stuff is amazing! My lips are always chapped and peeling no matter if I drink a ton of water and slather on lip balm. After one night and day of using this my lips are soft and smooth. No more nasty peeling lips. I can actually wear lipstick! I put it on before bed and before I leave for work. Smells delicious and love that they provide and applicator so you don't have to stick your finger in the jar. Wish this stuff came in a tube for convenience! My lips look soft, supple and hydrated...even a little plumper than usual. I highly recommend it!",
      "rating": 5.0,
      "verified": true,
      "author": "SPI",
      "helpful_votes": 0,
      "publication_date": 20170314
    },
    {
      "title": "Luscious lips 👄",
      "text": "This replaced my Skin by Ann Webb eye and lip balm. They both replenish and heal my lips like no other. The balm by Ann Webb is much cleaner in ingredients but because I can't find it anymore, I decided to try this one. This lip mask will feel every single line on your lips and make your lips look bigger! I once put a thick layer on, and when I woke up it looked like I had lip fillers. K already have very full lips, so the feeling was really strange. It's a great product overall, and it will last forever. There is so much product in this little container.",
      "rating": 5.0,
      "verified": true,
      "author": "Di",
      "helpful_votes": 2,
      "publication_date": 20170901
    },
    {
      "title": "Can't Wait to Try This n Winter",
      "text": "My results weren't as immediate as some other reviewers but it's definitely working. The texture of my lips is improved but if you generally take care of your lips you might not notice as much of a difference. But the tone has really improved. I bite my lips and before this mask they had dark spots, cracks and blotchy areas. Now my lips are a beautiful even pink. The jar is quite large and you only need enough product to cover the tip of the little spatula. Definitely worth it.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20160722
    },
    {
      "title": "Best lip mask",
      "text": "I'm sure a lot of people are wondering if this is authentic. Yes it is! The reason why it's cheaper than Sephora is because this is the Korean version. If you lather a thick layer before bed, you'll have baby soft lips in the morning. If you have dry cracked lips, put on a thick layer and exfoliate in the morning. It will restore moisture to your lips. If you want BABY SOFT lips then this is your holy grail product!",
      "rating": 5.0,
      "verified": true,
      "author": "Sophia",
      "helpful_votes": 0,
      "publication_date": 20200919
    },
    {
      "title": "BEWARE!!!! DO NOT BUY!!!!!!",
      "text": "DO NOT BUY! FAKE! I had my cousin from Korea compare the two. Great knock off! Destroyed my lips! Skin peeled off and woke up with bleeding lips! Still healing and it feels like they are sunburned! Contacted the seller, he didn’t offer any way of fixing or explaining the entire issue. BEWARE!!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Hong Dexter",
      "helpful_votes": 2,
      "publication_date": 20190803
    },
    {
      "title": "Possible fake?",
      "text": "Not sure if it is a fake product or just not what I expected. A lot of YouTube beauty bloggers recommend this lip mask and claim it has a light pink tint, however it was completely clear on me. I have incredibly pale lips so I feel like it's pretty easy for me to detect if something has a tint or not... This definitely does not. Doesn't seem to be working any better than the Aquaphor I usually use on my lips",
      "rating": 3.0,
      "verified": true,
      "author": "Jezah",
      "helpful_votes": 0,
      "publication_date": 20190829
    },
    {
      "title": "Well, a pink drew me in......",
      "text": "Just kidding. A good review or two on here talked me into it pretty quickly. I love this stuff. How about getting us some tube version that is easy application on the go. I smells great, it stays on, great consistancy.",
      "rating": 5.0,
      "verified": true,
      "author": "Cderrick",
      "helpful_votes": 4,
      "publication_date": 20180323
    },
    {
      "title": "Not for me!",
      "text": "This product did not do anything for my dry lips, if anything it dried them out more. I thought that maybe I could use it as a daytime lipgloss, but it was drying during daytime use also. Upon application the product feels a little sticky but not too bad; smells very nice. The feeling on my lips was neither pleasant nor unpleasant. I will probably just incorporate it into some hand lotion. Expensive product to do that with it, but I certainly won’t use it for what it was intended for.",
      "rating": 1.0,
      "verified": true,
      "author": "Judy",
      "helpful_votes": 0,
      "publication_date": 20190219
    },
    {
      "title": "My favorite lip product, hands down.",
      "text": "Love this stuff. It makes my lips look and feel amazing. I use it in place of lipstick or lip gloss. I’ve never slept with it on . If I’m not wearing it exclusively, I’ll put it on after I moisturize my face and then apply lip stick over it when I’m done with my full face.",
      "rating": 5.0,
      "verified": true,
      "author": "Eogeaux",
      "helpful_votes": 0,
      "publication_date": 20190424
    },
    {
      "title": "I would have been better off using good ole Vaseline",
      "text": "This did nothing for my lips. I would have been better off using good ole Vaseline. Not worth the money in my opinion.",
      "rating": 1.0,
      "verified": true,
      "author": "crazyCEE",
      "helpful_votes": 5,
      "publication_date": 20171102
    },
    {
      "title": "KNOCKOFF!",
      "text": "Well my original review was rejected. So all I’m gonna say is this product is a knockoff. Look at the photos. Pay a little more and get authentic product!",
      "rating": 1.0,
      "verified": true,
      "author": "Mimi J",
      "helpful_votes": 2,
      "publication_date": 20200111
    },
    {
      "title": "It's...OK.",
      "text": "There was so much hype about this \"lip mask\" that I thought I'd try it (especially because I'm currently in the middle of a winter vortex) but honestly, I don't feel the difference between this product and plain old petroleum jelly...and actually, after viewing the huge ingredients list on their website, I'm not so keen to continue to use it. For all intents and purposes, I'll continue to use it as a daily, light lip balm.",
      "rating": 3.0,
      "verified": true,
      "author": "TMD",
      "helpful_votes": 0,
      "publication_date": 20190204
    },
    {
      "title": "Lip life saver!",
      "text": "For about a year now I have suffered from some unknown issue with my lips that causes them to itch, dry up, peel, burn and hurt. I have failed to find anything that helps...until I found this product. I absolutely LOVE this product. It heals my lips and stops the peeling and pain returing my lips back to normal. I will be buying this product for as long as they make it! Thank you for the relief.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20160915
    },
    {
      "title": "Not super rich/heavy- good for a lighter lip cream at night",
      "text": "Product does not dupe for Dermalogica renewal lip complex but is satisfactory to put on before bed to keep lips for drying out during the night. I had minimal amount left on in the morning. It lacks the super rich texture of Dermalogica and not worth the price I felt. I will finish it but not reorder. Pleasant light berry smell and is slightly colored so hoping it does not stain my pillows...",
      "rating": 3.0,
      "verified": true,
      "author": "Lisa Smith",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "Softer lips after 2 consecutive nights of use",
      "text": "I’ve used this 2 nights in a row since receiving them and I can def tell a difference in the texture of my lips! Many people say it’s a knock off, but honestly, if it does the exact same thing AND is cheaper then I really don’t care about which brand it is. So far so good, I’ll update if anything changes.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 0,
      "publication_date": 20190407
    },
    {
      "title": "Berry not worth the price - but I might still try the original",
      "text": "I've seen great reviews for this elsewhere, but I'm thinking the original (non-flavored) was the way to go. I didn't see it on Amazon, so I went for the berry. It doesn't seem to be doing much more than your average chapstick. I've noticed flavored versions of other lip brands also have this issue - the original is great, but once flavoring is added, it just doesn't work as well.",
      "rating": 3.0,
      "verified": true,
      "author": "Hailey K",
      "helpful_votes": 0,
      "publication_date": 20191126
    },
    {
      "title": "Too expensive for what it does",
      "text": "I purchased this after reading rave reviews online - in blogs and on YouTube. I was expecting a miracle product and this isn't it. It is thick and smells like bubble gum. It melts on my lips and makes them feel moisturized. However, in the morning my lips are not noticeably softer than when I use a much cheaper drugstore lip balm. The Laneige Lip Sleeping Mask is good. It just isn't better than a ton of cheaper options. Save your money and buy a tube of lip balm at Target.",
      "rating": 3.0,
      "verified": true,
      "author": "kathylcswTop Contributor: Makeup",
      "helpful_votes": 0,
      "publication_date": 20170717
    },
    {
      "title": "Best lip mask out there",
      "text": "I've been using this lip mask over a year and when I came across different brands on Amazon with a little price difference couple dollars less I figured I'd try them. I tried two different ones and they don't come close in comparison to Laniege. It has done wonders for my lips especially in the winter. Pleasant scent, good consistency, very moisturizing and definitely worth every penny.",
      "rating": 5.0,
      "verified": true,
      "author": "Bonnie ",
      "helpful_votes": 0,
      "publication_date": 20200502
    },
    {
      "title": "For very dry lips , this is amazing!!",
      "text": "This is amazing for dry lips omg forget all those chapstick this is wonderful love the smell and leaves your lips so moisture is amazing for those people that suffer from dry lips and they get so dry that crack your lips and bleeds . This will save you from all that you will love it I use it everyday because of the change of weather my lips get so dry and I use it before I put any lips stick on hydrates my lips for a smooth lips and juicy.",
      "rating": 5.0,
      "verified": true,
      "author": "cici",
      "helpful_votes": 0,
      "publication_date": 20191112
    },
    {
      "title": "More smoothing, less moisturizing",
      "text": "I put a hefty layer of this on at night and by the morning it's still there. So my lips don't get dried out at night. I would clarify though that that's not to say this is moisturizing, because when I wipe it off my lips are just bare. What it does do though is break down the dead skin cells over night so when I wipe it off my lips are smooth and aren't cracked. You just have to make sure to use a moisturizing lip balm after wiping it off to keep it that way.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170414
    },
    {
      "title": "Pretty sure it’s a knock off",
      "text": "I wish I hadn’t ignored the other reviews that said this product was a knock off but I wanted to see for myself. And unfortunately, I’m pretty sure it is. I’ve never experienced the real product so I guess I don’t know for sure but it has done nothing beneficial for my lips. It feels like you’re spreading cheap kids lip smackers on your lips. It smells decent but taste awful, and doesn’t stay on for long. Waste of money!",
      "rating": 1.0,
      "verified": true,
      "author": "Candice ",
      "helpful_votes": 2,
      "publication_date": 20190417
    },
    {
      "title": "Love this",
      "text": "I got a free sample from Sephora's membership rewards program and loved it. So before buying it full price from the beauty giant I checked Amazon and yes, it's a lot cheaper. I love it because it's so moisturizing without being sticky or slimy. Other lip moisturizers cause my lips to dry out later in the day but I feel like Laneige actually delivers moisture. I even feel like my lips are more full and plump.",
      "rating": 5.0,
      "verified": true,
      "author": "Greta M.",
      "helpful_votes": 0,
      "publication_date": 20191219
    },
    {
      "title": "A MUST HAVE lip mask if your lips easily to feel dry!!!",
      "text": "This sleeping mask works great!!! It makes my lips so soft. I normally put it right before I go to sleep, and I feel my lips are hydrating when I wake up in the morning! Actually I can't leave without lipstick because my lips used to feel dry. I have tried a lot of lipstick, lip serum, lip oil, lip mask, etc, but this is the one I would HIGHLY RECOMMEND to my families and friends.",
      "rating": 5.0,
      "verified": true,
      "author": "Queenie Hearst",
      "helpful_votes": 2,
      "publication_date": 20160614
    },
    {
      "title": "Use regularly and see the results",
      "text": "I got a sample and it really made a difference for me so now I brought the full sized version here. It is a bit sticky but I use it at night so it is not an issue, have used it during the day just use very sparingly so you lessen the shiny look. Used to have full time chapped peeling lips and since I have been using this at night my lips no longer peel. I do not have to use my chap stick during the day now (unless its super cold or dry out) since my lips stay hydrated. Before I used to have chronic dry peeling painful lips and now they really have smoothed out.",
      "rating": 5.0,
      "verified": true,
      "author": "YA",
      "helpful_votes": 0,
      "publication_date": 20180217
    },
    {
      "title": "Rich.",
      "text": "I love the container. This is a nice rich lip balm and my lips are moist from it, though I use 3 or 4 different kinds throughout the day because that's what I've found works best. The only thing I don't like about this is that once I dip my finger in to apply it to my lips, my finger is quite sticky with it and I have to wash it well to get the balm off.",
      "rating": 3.0,
      "verified": true,
      "author": "Trutti",
      "helpful_votes": 0,
      "publication_date": 20190825
    },
    {
      "title": "KNOCK OFF PRODUCT!!!",
      "text": "KNOCK OFF PRODUCT! I’ve been using Laneige Lip Sleeping Mask for years! I know the packaging like the back of my hand and what I received is NOT it. Close to no scent and no long luxurious and moisturizing texture. Spend the extra bucks and purchase from Sephora! Dear seller, I’d appreciate a full refund as you’ve done for other unsatisfied customers. I purchased this for my mother and I refused to have her use a fake product, especially after seeing before and after photos on other comments from other unsatisfied customers.",
      "rating": 1.0,
      "verified": true,
      "author": "Lisa Lorenzana",
      "helpful_votes": 0,
      "publication_date": 20200606
    },
    {
      "title": "... mask because the Laneige water sleeping mask was absolutely amazing, and thought this product could do the same ...",
      "text": "I bought this lip sleeping mask because the Laneige water sleeping mask was absolutely amazing, and thought this product could do the same for my lips- not so much. I can't really convince myself that this product is much better than vaseline overnight. My lips are not dry in the morning, but they're not soft either and there's nothing special about them. It rubs off very easily, and so it's not a lip product that can be used during the day.",
      "rating": 2.0,
      "verified": true,
      "author": "Jennifer Lee",
      "helpful_votes": 0,
      "publication_date": 20170517
    },
    {
      "title": "Kind of disappointed",
      "text": "Honestly, I heard amazing things about this lip sleep mask from beauty influencers. It feels moisturizing and luxurious when you first put it on (although it's pretty sticky so if you have a pet that sheds, especially if they sleep in your bed, prepare for furry lips if you don't wait until it's dry before bed lol). But I thought it would hydrate my lips more and I've seen no changes in how moisturized they feel. I really wanna love this so I'm gonna keep putting it on before bed. The good thing is that a little goes a long way so it lasts a long time!",
      "rating": 3.0,
      "verified": true,
      "author": "Joy Sheehan",
      "helpful_votes": 0,
      "publication_date": 20200627
    },
    {
      "title": "Perfection for dry lips",
      "text": "Holy grail for chapped lips. I use it as a regular balm and don’t just use it at night as a mask. If you are not okay with putting your fingers in your product you may want to get sample sizes and refill them with the big pot so you don’t have to deal with the nice little spoon thing it comes with. It’s impractical to carry.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarina Daniels",
      "helpful_votes": 0,
      "publication_date": 20190221
    },
    {
      "title": "Not life changing",
      "text": "It's okay. Put it on before bed and wipe off in the morning. Lips feel moisturized and not dry after, but vaseline or Aquaphor can do the same thing. Didn't feel it transformed my skin. The little spatula is a pain. You have to keep it in this little pouch lest it collect dust. Smells and feels like melted cherry chap-stick. I know it sounds like I hated it - really didn't, just wouldn't buy again.",
      "rating": 3.0,
      "verified": true,
      "author": "Infrareda",
      "helpful_votes": 0,
      "publication_date": 20181204
    },
    {
      "title": "Lips of luxury",
      "text": "I cannot say enough good about this! It smells amazing, keeps my lips moisturized for hours, and makes me feel like a queen when I put it on. I wear it to bed and even on my no make up make up days where I want a fresh glisten to my lips. I honestly can’t wait to run out of this so I can try more from them!",
      "rating": 5.0,
      "verified": true,
      "author": "Danielle LeBoeuf",
      "helpful_votes": 0,
      "publication_date": 20191126
    },
    {
      "title": "Saved my lips!",
      "text": "I'd heard people rave about this product for years, but always assumed it was overhyped and overpriced. It is neither. I saw a humongous difference in the very first night I used it. I've never had a product work this well to soften and heal chapped and cracked lips. Plus, I've been using this almost every single night for a full month and have barely made a dent in it - you only need the tiniest little bit, so this jar will last you. The scent/flavor is pleasant but very very subtle and unobtrusive. If you hate greasy lip products you probably won't enjoy this. It doesn't absorb quickly at all, so you can definitely feel it sitting there.",
      "rating": 5.0,
      "verified": true,
      "author": "Spenser",
      "helpful_votes": 0,
      "publication_date": 20181215
    },
    {
      "title": "Applying it is nice and soothing",
      "text": "I really wish it did more for my lips. I decided to try it out after someone's review saying their lips are always cracked and their partner has noticed a difference... but sadly it hasn't done much for me. It leaves them somewhat smoother, but it only lasts maybe an hour or two in the morning after taking it off. After the first month of using it, I learned to exfoliate my lips before applying, but it still didn't make much of a difference. Applying it is nice and soothing, but the effects are just not there in the long-term.",
      "rating": 3.0,
      "verified": true,
      "author": "Montserrat",
      "helpful_votes": 0,
      "publication_date": 20180513
    },
    {
      "title": "Love Laneige products but this one doesn't work for me",
      "text": "I have a few products from Laneige and all of them are amazing, so I was surprised when this one had little effect on my lips! The smell is amazing, and it leaves a small tint, but no matter how much I applied it, my lips were still always dry and flaky! This surprised me as regular lip balms that I've applied at night have peeled them dead skin from my lips by morning! I'm not sure why this product doesn't work on my lips tbh. The packaging is great and the smell is also amazing though.",
      "rating": 3.0,
      "verified": true,
      "author": "Erika O.",
      "helpful_votes": 0,
      "publication_date": 20181127
    },
    {
      "title": "I love this lip mask",
      "text": "I love this lip mask!! I use it every night diligently. My lips are very sensitive and I've tried almost every single lip balm/mask girls rave about. Most of them I threw out because they made my lips more dry, but this makes my lips so soft and supple when I wake up in the morning. The tub is small, but a little goes a long way.",
      "rating": 5.0,
      "verified": true,
      "author": "Jane Kim",
      "helpful_votes": 3,
      "publication_date": 20170227
    },
    {
      "title": "Just Okay",
      "text": "Just okay. I heard that Sara Happ’s lip mask is amazing but it’s close to $40 so I was looking to try something similar for less. I will end up just purchasing the Sara Happ mask bc this mask isn’t really rave worthy. The packaging is nice and the little spatula is a great touch but the product itself isn’t cutting it for my severely dry and cracked lips. I think Aquafor is just as good.",
      "rating": 3.0,
      "verified": true,
      "author": "Amy Adair",
      "helpful_votes": 0,
      "publication_date": 20181124
    },
    {
      "title": "Moisturizing",
      "text": "By far the best lip mask ever! I grabbed one because I tried my friends and fell in love with it. I cannot say enough good things about this lip mask. The smell is perfectly subtle and amazing. It is berry smell and just smells so delicious (but don't eat it lol). I would definitely buy again. I believe it will last me a long long time though because it is a pretty good sized container. So happy with my purchase! Highly impressed with Laneige and have been hearing all my friends have the same one.",
      "rating": 5.0,
      "verified": true,
      "author": "Karla Grisham",
      "helpful_votes": 0,
      "publication_date": 20200307
    },
    {
      "title": "Figured I would give this a shot and I was not disappointed. If my lips are cracked - I use ...",
      "text": "I suffer from excessive dry lips as a result of medication. I have read every forum, tried anything I could find in drug stores and nothing was helping. Figured I would give this a shot and I was not disappointed. If my lips are cracked - I use it ask a mask and in the morning they are pretty well healed. I use it throughout the day here and there and I finally have some relief. Great stuff!",
      "rating": 5.0,
      "verified": true,
      "author": "Rebecca ",
      "helpful_votes": 3,
      "publication_date": 20170512
    },
    {
      "title": "Great product",
      "text": "I love this product. I love anything that makes me feel like my lips are prettier. I do recommend exfoliating prior to use. I gave 4 stars because I can't say that I visually see a big difference but I have went from someone that applies chapstick a million times a day to maybe twice. Then again, I've only been using this product for roughly a week so maybe the visual differences will come over time with repeated use. Either way,great product. Love the way it looks and feels on my lips. I put a thick amount on before bed nightly.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170416
    },
    {
      "title": "Maybe the reviews are true",
      "text": "This hasn't really worked...maybe it's not authentic as some reviews suggest? I have used this in the past with better results.",
      "rating": 1.0,
      "verified": true,
      "author": "MVH",
      "helpful_votes": 0,
      "publication_date": 20200314
    },
    {
      "title": "Definitely recommend. Is it over priced",
      "text": "Definitely recommend. Is it over priced? Possibly. But how much do you value having smooth, non chapped lips? This has helped changed my lips around. Wearing liquid lipsticks has dried it out during the day, and this has restored to fight another day",
      "rating": 5.0,
      "verified": true,
      "author": "Kat",
      "helpful_votes": 0,
      "publication_date": 20170827
    },
    {
      "title": "Great product",
      "text": "I don’t get the negative reviews. This is the best lip treatment I’ve had. It’s super moisturizing and stays on all night. My lips feel better after one use.",
      "rating": 5.0,
      "verified": true,
      "author": "Nik",
      "helpful_votes": 0,
      "publication_date": 20190702
    },
    {
      "title": "Lip mask to use at night",
      "text": "My friend recommended me this product and I tried twice and love it since then. My lips is super dry when the season changes and every morning my whole body is in dry phases let alone my lips. Sometimes my lips is always dry with dry weather and sometimes will split with blood on it, this lip mask gives enough moisture and light smell that I love a lot.",
      "rating": 5.0,
      "verified": true,
      "author": "Binbin Du",
      "helpful_votes": 0,
      "publication_date": 20191020
    },
    {
      "title": "Battling dry lips?",
      "text": "If you have dry lips use this is the product for you. I only use this over night by applying to both upper and lower lips. This helps my lips stay hydrated and my lip stick to stay fresh during the day.",
      "rating": 5.0,
      "verified": true,
      "author": "Glenn Mooney",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "more like a lip gloss that coats the lips",
      "text": "This product was totally worth the cost. My lip color is lighter and healthier looking. It stays on all night, which is a miracle as I toss and turn a bunch. It is a stickier consistency, more like a lip gloss that coats the lips. Don't plan on drinking or eating anything afterward. It tastes fine. A slight berry taste maybe? But nothing that will put you off. It smells good and comes with a small little applicator spoon that makes it easy to apply without getting the stickiness on your fingers.",
      "rating": 4.0,
      "verified": true,
      "author": "samifaith",
      "helpful_votes": 3,
      "publication_date": 20160317
    },
    {
      "title": "Been using this over a month and it’s perfect.",
      "text": "I’ve tried a lot of different things to fix my winter lips, but most things would more protect or seal. This stuff actually rehydrates and in the morning my lips are plump and smooth. This is very shiny, but I only wear it at night or as a very thin layer over my lip stain. It has never clogged my pores at the edge of my lip like some things do which is a huge selling point. 10/10 best lip product I’ve ever tried",
      "rating": 5.0,
      "verified": true,
      "author": "Tabitha Rich",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "Lifesaver for dry lips!",
      "text": "This is the most moisturizing thing I have ever put on my lips. They used to very very dry - cracked and peeling all winter long. I started using this in November at night and it has made a world of difference. My lips are soft and not dry at all. It is really thick but that doesn’t bother me since I put it on right before I go to sleep. It is a small jar but I’ve been using it daily for months and barely made a dent in it.",
      "rating": 5.0,
      "verified": true,
      "author": "Laura",
      "helpful_votes": 0,
      "publication_date": 20190618
    },
    {
      "title": "Fake Product",
      "text": "So as many have already said this is a fake product. I know this for sure because I bought the real one. Why did I buy the real one after having the fake one for about 2 weeks? Because it irritated my lips and lead to hyperpigmentation on them. I would return it but for some reason it doesn't allow returns... DO NOT BUY!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190518
    },
    {
      "title": "Alright..not worth purchasing",
      "text": "I first heard about Laneige from a friend of mine who said their products were pretty good on the skin. I decided to purchase this since I have pretty dry lips despite drinking a decent amount of water. The scent is really nice and I do like the packaging! It comes with a little applicator which I assume is for sanitary purposes. But, I thought that in terms of results my lips were fairly the same as it was before using it. It would still be chapped.",
      "rating": 2.0,
      "verified": true,
      "author": "Kate Nguyen",
      "helpful_votes": 0,
      "publication_date": 20200912
    },
    {
      "title": "This is what I was looking for because I am tired of buying different type of Chopsticks and it does not work and this is perfect. I love that it brings the little applicator ...",
      "text": "I use this product yesterday and this morning and I noticed that my lips are more soft and Plum. This is what I was looking for because I am tired of buying different type of Chopsticks and it does not work and this is perfect. I love that it brings the little applicator and it doesn't smell its awesome. I totally recommend this to everyone you will love it",
      "rating": 5.0,
      "verified": true,
      "author": "MARANGELY HUERTAS  (Angie)",
      "helpful_votes": 0,
      "publication_date": 20180422
    },
    {
      "title": "Nice",
      "text": "Not the best moisturizer but I’m not disappointed either. I would say the Vasaline Lip Therapy does a better job but this product is not bad either. I use it every night in rotation with the Vasaline one. You get allot of product for the price and lips feel moisturized. I would say I feel more of a difference with the Vasaline one though",
      "rating": 3.0,
      "verified": true,
      "author": "Blanca",
      "helpful_votes": 0,
      "publication_date": 20191018
    },
    {
      "title": "So conflicted...",
      "text": "So.... I got a sample size of this from Sephora and LOVED IT. But since getting the full size from Amazon and using it for two weeks now, its almost as if I got a knock off? Or Im not using it right (maybe it shouldnt be used every night)? It is definitely the same texture and smell, but my lips are now so dry in the morning and have very deep lines **Im 21. In this picture, my lips do not look 21**. I love the feel, but it doesnt seem to be helping me in any way... bummer.",
      "rating": 2.0,
      "verified": true,
      "author": "deanna.",
      "helpful_votes": 0,
      "publication_date": 20200819
    },
    {
      "title": "Best lip mask ever!",
      "text": "I LOVE this product and have talked multiple people into buying this! I like to wear matte lipsticks but my lips always looked peely or chalky after a second application. After a few nights of this lip mask i can reapply matte lipstick all day and it looks perfect! My lips are so soft and the smell is amazing. Just enough of a smell but not too strong either!",
      "rating": 5.0,
      "verified": true,
      "author": "Danielle Gray",
      "helpful_votes": 0,
      "publication_date": 20180715
    },
    {
      "title": "This Stuff Is Amazing!!!!!",
      "text": "Lanegie Sleep Mask for Lips is OH MY GOODNESS GOOD!!!!!! I have used a ton of other lip smoothers. This is different. My lips feel smooth and moist the next morning. I’m 67. My lips look great and I used those awfully drying liquid lipsticks. I will buy this again and again. Yes I recommend it. It’s a great product.",
      "rating": 5.0,
      "verified": true,
      "author": "VB10",
      "helpful_votes": 0,
      "publication_date": 20181220
    },
    {
      "title": "Love this lip mask",
      "text": "I love this sleeping mask! I’ve purchased a few times for myself and to give as gifts. I put it on at night before going to bed and my lips feel great when I wake up in the morning. I also use it as a quick lip gloss during the day if needed.",
      "rating": 5.0,
      "verified": true,
      "author": "Aron Henderson",
      "helpful_votes": 0,
      "publication_date": 20190929
    },
    {
      "title": "Amazing product!!",
      "text": "This is product is one of my favorite products ever! It really is amazing. My lips have been healed from dryness and cracks. I only wish I could have more than one because I need one at work and home. The only draw back is the packaging. You can't put it in a small wristlet wallet for date night etc. Also don't love having to put my finger in it every time. I always need a tissue to wipe off the excess as well but everything else about it is fabulous and it's totally worth it!",
      "rating": 5.0,
      "verified": true,
      "author": "NSHB",
      "helpful_votes": 0,
      "publication_date": 20180226
    },
    {
      "title": "Rave",
      "text": "I've been using this for 3 days straight alternating with Bert bee's and I used a lip scrub. This morning I woke up with perfect hydrated lips and I can't Rave enough! My lips needed it so badly after being so dry and chapped. I'm so thrilled! So much comes in it and you need very little. You can easily use it just at night but I needed a serious treatment and this was great;)",
      "rating": 5.0,
      "verified": true,
      "author": "alicialeeanne",
      "helpful_votes": 0,
      "publication_date": 20170205
    },
    {
      "title": "Feels great going on, by morning I see no difference in my lips",
      "text": "I thought I liked this so much. Are used it religiously for almost 2 weeks. My lips are no better than when I started. I had already ordered a second one in a different flavor. When it comes I am going to return it on opened. This stuff last for quite a while and well it feels good going on in the morning my lips are still dry and unattractive",
      "rating": 2.0,
      "verified": true,
      "author": "Mary Mary Mary",
      "helpful_votes": 0,
      "publication_date": 20180710
    },
    {
      "title": "not the REAL laneige lip mask",
      "text": "I had used the laniege lip mask before and loved it, but this mask was not the same. buy from the sephora website, not amazon.",
      "rating": 1.0,
      "verified": true,
      "author": "Alyssa Hyde",
      "helpful_votes": 4,
      "publication_date": 20181215
    },
    {
      "title": "I like smooth lips",
      "text": "I think this product helps me the most with my goal of having smooth/soft lips. I have had both lip sleeping masks. I think I prefer the fruit flavor one the best although it someone were to put the grapefruit one in my stocking; I would not complain. I would say a sincere THANK YOU. *Hint to my family*",
      "rating": 4.0,
      "verified": true,
      "author": "Leslie",
      "helpful_votes": 0,
      "publication_date": 20190825
    },
    {
      "title": "Perfect for dry climate dwellers!",
      "text": "I love the moisturizing qualities of the Laneige Lip Sleeping Mask. I put it on every night before sleep and during the day, I put it on whenever my lips feel dry. I live in an arid climate and previously would often get cracked lips, which can really be painful! Regular use of the Laneige Lip Sleeping Mask just makes my lips feel good all the time. I will keep using it! The taste and smell are very light; pleasant , but not overpowering. Stop using petroleum jelly and get some of this!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190827
    },
    {
      "title": "I personally wouldn't buy again. Doesnt help me and too expensive.",
      "text": "I still use it, because i paid so much for it- but it doesn't work. Does not moisturize my dry chapped lips at all. Sticky when applied.",
      "rating": 1.0,
      "verified": true,
      "author": "Jennifer R.",
      "helpful_votes": 3,
      "publication_date": 20180108
    },
    {
      "title": "LOVE THIS STUFF!",
      "text": "I've always had chapped lips, doesn't matter where I live or what I do! This stuff not only feels amazing while its on but it has smoothed my lips so much they rarely get chapped these days! Sometimes I put it on in the morning as well because its THAT GOOD!",
      "rating": 5.0,
      "verified": true,
      "author": "Chelsea Layton",
      "helpful_votes": 0,
      "publication_date": 20190530
    },
    {
      "title": "Great product",
      "text": "Great nighttime or daytime moisturizing lip product. Beware of fakes.",
      "rating": 5.0,
      "verified": true,
      "author": "teacher",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Average and over priced",
      "text": "I typically give really good reviews, but was kind of disappointed with this product, it almost seems like petroleum instead of a product that can really heal your skin. My lips don't really seem like there any more improved, but I don't use it every single night. At first I was using it every single night but when I didn't see results it just sits by my bedside",
      "rating": 3.0,
      "verified": true,
      "author": "Nicki",
      "helpful_votes": 0,
      "publication_date": 20170423
    },
    {
      "title": "A must buy lip treatment!",
      "text": "This is a miracle treatment for chapped or dry lips. A must buy! I was skeptical about it but it is amazing and definitely worth every penny! Will always add this to my bedtime routine from now on for baby soft lips",
      "rating": 5.0,
      "verified": true,
      "author": "Crystal",
      "helpful_votes": 0,
      "publication_date": 20190413
    },
    {
      "title": "Magical",
      "text": "Everyone says how it’s a knock off...listen....mine came in a foreign language I can’t even read, but I absolutely love this product. My lips have never been so soft and hydrated....so if it’s a knock off...cool. It’s working great!!",
      "rating": 5.0,
      "verified": true,
      "author": "Lauren",
      "helpful_votes": 0,
      "publication_date": 20190321
    }
  ],
  "product_meta": {
    "title": "LANEIGE Lip Sleeping Mask ,Berry, Lip Treatment, 0.7 Qunce",
    "description": "Color:BerryA nutritive and moisturizing lip-sleeping mask. Formulated with Berry Mix Complex. rich in Vitamin C and anti-oxidants. Helps eliminate dry. flaky dead skin on lips during the night. Blended with Hyaluronic Acid that builds a moisturizing film to seal in active ingredients. Infused with a sweet and fruity berry fragrance. Leaves lips soft and smooth. To use: Before going to bed. apply a liberal amount with the spatula. Gently wipe skin clean with tissue or cotton pad the next morning.",
    "rating": 4.3,
    "feature_bullets": [
      "Skin Friendly Ingredients",
      "Help To Boost Your Appearance",
      "Keep It Smooth And Radiant"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "4 x 4 x 2 inches; 0.64 Ounces",
      "Item model number": "2724451103650",
      "UPC": "647409808556 643517721640 641489614601 641243100258 747726944651 667297136906 739862684591 803319416858 667297137170 827189905397 711915290560 725330686334 789398320173 755838827649",
      "Manufacturer": "MarginMart, Inc.",
      "ASIN": "B00VR0Z0I4",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Skin Care",
      "Treatments & Masks",
      "Face",
      "Beauty & Personal Care",
      "Masks"
    ],
    "price": 20.07
  }
}