{
  "website_summaries": [
    {
      "verdict": "This top-of-the-line pillow available in a regular size and a larger form is sure to impress.",
      "pros": [
        "Thick, curved design allows head to be snugly cradled in any terrain",
        "Inflatable design for supreme portability and function",
        "Available in regular or large sizes"
      ],
      "cons": [
        "Material tends to crinkle when head is moving",
        "Fairly easy to rip"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Flimsy lining, doesn't last",
      "text": "This is an innovative and very useful product. At face value I absolutely loved mine. However, it lacks any semblance of durability. Within a year the lining of mine began to completely disintegrate and it will not hold air. If you are a serious outdoorsman/woman don't buy this product. You'll be charged a premium price for something that is certainly not premium quality. If I'd have known that the lifespan of this product was so short I would have bought a cheaper one.",
      "rating": 1.0,
      "verified": true,
      "author": "J",
      "helpful_votes": 36,
      "publication_date": 20170424
    },
    {
      "title": "So much better than a bag of clothes",
      "text": "I've always used my bag of clothes as a a camp pillow. And almost always, unless I was absolutely tired out, I'd find myself adjusting the \"pillow\" several times during the night. That doesn't help me get good sleep. I thought this pillow was a luxury item when I purchased it. After sleeping on it for several nights in a row, I've come to realize that it is almost a necessity. My quality of sleep is waaay better then before, and I don't even notice the tiny amount of space or weight it adds to my pack. Comfortable, strong, very easy to adjust, and packs down so small. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "PNW_SteveA",
      "helpful_votes": 0,
      "publication_date": 20190814
    },
    {
      "title": "Wish they made them for the bed!",
      "text": "I'm so pleased to have purchased this pillow. The little baggy seems water proof. When I pulled it out of the bag it was so soft to the touch and that was the part your head doesn't rest on. This was amazingly easy to blow up. Two normal breaths and it's full. Deflates in seconds. Super comfy when resting your head. It was smaller than I imagined in my head but yet it's still perfect. I will probably invest in the larger one at some point. Wraps back easy and fits in it's bag perfectly. I can't wait to use it officially when camping.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 2,
      "publication_date": 20171120
    },
    {
      "title": "returned. not for me.",
      "text": "I found that if this pillow is not fully inflated, your head is forced to roll to whatever side of the pillow you have just a bit more weight on - until it's basically off the pillow - unless you hold the pillow with one hand to stabilize. If it's fully inflated, it's way too thick, even while I'm on my side. This may be in part because I have a fairly cushy mat, which allows the shoulder to sink down a bit. Just could not get comfortable on it. Will go back to small therm-a-rest cushion, even if larger pack-size and weight.",
      "rating": 2.0,
      "verified": true,
      "author": "Monika W",
      "helpful_votes": 2,
      "publication_date": 20160912
    },
    {
      "title": "Awesome Pillow!!!!",
      "text": "We love these pillows!! We have never used pillows for backpacking so this is not a comparison, but they are light enough that it was not a concern which is why we have not tried pillows before, we just didn't want the weight. These pillows made a complete difference in our sleep. We woke up feeling restored!! They are easy to inflate with just a few breaths. They seem sturdy, and the side that has a soft feel is quite nice. Hen they deflate easily and go back in their compact little bag. AWESOME!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Rachael in Colorado ",
      "helpful_votes": 0,
      "publication_date": 20170804
    },
    {
      "title": "Hands down the best backpacking pillow I've ever used.",
      "text": "Absolutely worth the money! Easily packs down to a very small size, is easily adjustable & durable. I wouldn't use it as a sit pad but it's probably tough enough for you to. I wish the tiny stuff sack was attached.",
      "rating": 5.0,
      "verified": true,
      "author": "Justin Hamblin",
      "helpful_votes": 0,
      "publication_date": 20200120
    },
    {
      "title": "Such a comfortable Travel Pillow",
      "text": "I like the ease with which I can inflate this pillow to the desired firmness. It's small and foldable into its own pouch. I can fit into a suitcase as well as a purse. When I didn't use it for actual sleep, I could use it as a lumbar pillow during the long drives. Well done!",
      "rating": 5.0,
      "verified": true,
      "author": "Bikerchella",
      "helpful_votes": 0,
      "publication_date": 20190101
    },
    {
      "title": "Well worth buying and packing",
      "text": "Damn this is a comfortable pillow. Spent 2 weeks backpacking with it. Used to use my spare clothes as a pillow but this thing is so much better. Only advice I would have is to not assume that you should inflate it all the way. My comfort level was about 3/4 full. Test yours out before using it for the first time.",
      "rating": 5.0,
      "verified": true,
      "author": "DeWayne",
      "helpful_votes": 0,
      "publication_date": 20180818
    },
    {
      "title": "Worth the money!",
      "text": "Deflated, it basically fits in the palm of your hand so takes up no space in your pack. Takes a few puffs, and it's ready for use. It has a soft side that is cozy on your face and you can easily adjust the firmness by a special one-way valve it to make it to your liking. I used it for a week on trail, and so far it's a keeper! Could also bring it traveling by car, plane or train.",
      "rating": 5.0,
      "verified": true,
      "author": "janice",
      "helpful_votes": 0,
      "publication_date": 20170814
    },
    {
      "title": "and t's much more comfortable when it's slightly deflated",
      "text": "For me this is the ultimate light camping pillow. The material is soft on the skin, and t's much more comfortable when it's slightly deflated. It inflates in just 3 breaths, and has a valve system so no air escapes when you put the air cap back on. It packs down to a tiny size. Also, be sure not to over inflate this item. I had one before that I over-inflated too much and it sprung a leak at the seam of the internal bladder. That was my fault, though.",
      "rating": 5.0,
      "verified": true,
      "author": "Josh R.",
      "helpful_votes": 0,
      "publication_date": 20160503
    },
    {
      "title": "Great for back support too!",
      "text": "I use this pillow all the time for traveling in the care or on the plane. I use it for back support. For me, I only need to inflate a small amount to get the support and relief needed.",
      "rating": 5.0,
      "verified": true,
      "author": "CherryB",
      "helpful_votes": 0,
      "publication_date": 20191027
    },
    {
      "title": "Good Ultralight Pillow for Backpacking",
      "text": "This pillow is extremely lightweight and fits into the hood of my sleeping bag. It has a flannel-feel surface, and it works best, IMHO, when it's not fully inflated. I recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "KL",
      "helpful_votes": 0,
      "publication_date": 20190610
    },
    {
      "title": "Very compact and comfortable",
      "text": "This is actually an incredibly comfortable inflatable pillow. I don't blow it up all the way so it still has some give and that's been the best and most comfortable method for me. And the fact it packs up smaller than a 12 oz soda can is amazing!",
      "rating": 5.0,
      "verified": true,
      "author": "Curtis Blake",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "Great for hammock",
      "text": "Using this almost exclusively in hammock. For reading, I need my head propped up, so I fully inflate. For sleeping, I like it softer, so I let out about half the air. Always use the soft side, comfortable, no plasticky feeling. Inflates quickly and very small uninflated. Initially hesitated because of cost, but believe to be a good value.",
      "rating": 5.0,
      "verified": true,
      "author": "Ross A. Seymour",
      "helpful_votes": 0,
      "publication_date": 20160802
    },
    {
      "title": "I can't believe how comfortable this little pillow is",
      "text": "I can't believe how comfortable this little pillow is!! I was skeptical about purchasing this pillow but after extensive research everyone had positive things to say about it and now I see why. I'm the type of person that sleeps with big latex and memory foam pillows and was afraid this pillow wouldn't suffice, but oh was I wrong. Great for backpacking as it compresses down smaller than a sock. I will definitely be purchasing another one of these down the road for my wife. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Finman11",
      "helpful_votes": 0,
      "publication_date": 20150914
    },
    {
      "title": "This pillow is great! It inflates and deflates faster than any inflatable ...",
      "text": "This pillow is great! It inflates and deflates faster than any inflatable product that I've ever seen. Mind blowing. It's super small and light, the cover is sooo nice and soft, and its nicely flat. Totally great product",
      "rating": 5.0,
      "verified": true,
      "author": "Steve Markgraf",
      "helpful_votes": 0,
      "publication_date": 20180222
    },
    {
      "title": "Very lightweight and convenient to carry for backpackers",
      "text": "I've used this plenty of times when I go backpacking on the weekends. It's very lightweight and super easy to blow up.",
      "rating": 5.0,
      "verified": true,
      "author": "Van",
      "helpful_votes": 0,
      "publication_date": 20190715
    },
    {
      "title": "Perfect for packpacking",
      "text": "I bought this for my husband who went on a hunting backpacking excursion and he said it was perfect for him. It is lightweight enough to carry in his pack and comfortable to sleep on. Would purchase again and recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Stacie Dunn",
      "helpful_votes": 0,
      "publication_date": 20181015
    },
    {
      "title": "I loved this pillow",
      "text": "I loved this pillow! I toss and turn from left side to right side then front to back as I got more sunburned and this product kept up with my tossing and turning! I absolutely love the comfort of this pillow and its so very cool how small and compact it gets in its little bag! Very comfortable and durable! Very high quality!",
      "rating": 5.0,
      "verified": true,
      "author": "Dakotaam1",
      "helpful_votes": 0,
      "publication_date": 20160526
    },
    {
      "title": "Incredibly comfortable.",
      "text": "I didn't think a lightweight inflatable pillow could be this comfortable. My others haven't been. I love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Harrybagels",
      "helpful_votes": 0,
      "publication_date": 20190804
    },
    {
      "title": "Slept like a baby on a 6 day backpacking trip through ...",
      "text": "Slept like a baby on a 6 day backpacking trip through the Grand Tetons. Really comfortable and actually fits in the mummy hood of my sleeping bag. Best sleep I've ever had on the trail by far. I had no issues with it holding air.",
      "rating": 5.0,
      "verified": true,
      "author": "Vulture",
      "helpful_votes": 0,
      "publication_date": 20161023
    },
    {
      "title": "Great for my head and my back.",
      "text": "This has been great for camping trips, back support on long flights, crashing on friend's floors. In fact, this is my second one, since I accidentally left my first on a plane. It packs down to about two thirds the size of a can of soda and is very light.",
      "rating": 5.0,
      "verified": true,
      "author": "Katushya",
      "helpful_votes": 0,
      "publication_date": 20170406
    },
    {
      "title": "I had to buy one as my Wife wont let me keep borrowing hers",
      "text": "This is a great camp pillow. small and very comfortable shape and material. I have had 2 other camp pillows and they were both disappointing.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott",
      "helpful_votes": 0,
      "publication_date": 20181105
    },
    {
      "title": "Inflates and deflates super quickly. It only took three full breaths to ...",
      "text": "Inflates and deflates super quickly. It only took three full breaths to fill the pillow. Rolls up in a nice little bag. The bag doesn't stay attached to the pillow, so it's easy to lose around the tent. You can attach it to the fill valve though, to prevent losing it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180531
    },
    {
      "title": "and love the double valve design",
      "text": "Quality materials, soft padding, and love the double valve design. Wish I had purchased the larger size though. I wanted it small for backpacking, but found that it was actually a little too small for me, however I see others have been happy with it, so it comes down to personal preference.",
      "rating": 4.0,
      "verified": true,
      "author": "Ryan Crane",
      "helpful_votes": 0,
      "publication_date": 20170427
    },
    {
      "title": "Blissful",
      "text": "I’ve been sleeping real good. I use at home, only 35% inflated it is great.",
      "rating": 5.0,
      "verified": true,
      "author": "Nathan",
      "helpful_votes": 0,
      "publication_date": 20190807
    },
    {
      "title": "Makes her happy, so I am happy",
      "text": "GF loves it. So speaks for itself. Makes her happy, so I am happy. Fairly comfortable, but takes a little to get used too. It really helps to play with the amount of air in it to get the fit that is right for you.",
      "rating": 5.0,
      "verified": true,
      "author": "BLA",
      "helpful_votes": 0,
      "publication_date": 20170926
    },
    {
      "title": "Must have",
      "text": "Hands down the best inflatable pillow I have every used.Easy adjustment, small, light, comfortable. My only issue was that I am a side sleeper and it isn't tall enough for me to sleep on my side easily, I was able to overcome by putting dirty clothes or my arm under it.",
      "rating": 5.0,
      "verified": true,
      "author": "Brandon Watson",
      "helpful_votes": 0,
      "publication_date": 20160812
    },
    {
      "title": "but it inflates and deflates nicely and rolls back up into the bag easily",
      "text": "works as expected. its smaller than the pictures look, but it inflates and deflates nicely and rolls back up into the bag easily. get a bigger one if you roll around a lot",
      "rating": 5.0,
      "verified": true,
      "author": "Byron",
      "helpful_votes": 0,
      "publication_date": 20180301
    },
    {
      "title": "Perfect Pillow....",
      "text": "I had been resisting getting a backpacking pillow. I don't know why, maybe pride? My clothes in a stuff sack are good enough... Well, I backpacked with a friend who had purchased this pillow....I had terrible pillow envy! I immediately ordered one for myself...I'm so glad I did! I love this so much. It fits right in the hood of my sleeping bag and doesn't move around when I do (which is a lot). It doesn't make that annoying crinkly noise either.",
      "rating": 5.0,
      "verified": true,
      "author": "S",
      "helpful_votes": 0,
      "publication_date": 20161003
    },
    {
      "title": "Great product! Love it.",
      "text": "Excellent product. Highly recommend it. Easy inflate/deflate. My 2 nd one.",
      "rating": 5.0,
      "verified": true,
      "author": "snooty Jim",
      "helpful_votes": 0,
      "publication_date": 20190305
    },
    {
      "title": "Ultralight",
      "text": "Ultralight, Easy to blow up with a couple of breaths, Very compact and small bag included",
      "rating": 5.0,
      "verified": true,
      "author": "Katie",
      "helpful_votes": 0,
      "publication_date": 20181221
    },
    {
      "title": "Not super comfy but for the weight savings and space savings ...",
      "text": "Packs into a tiny bag! Not super comfy but for the weight savings and space savings I will take it",
      "rating": 4.0,
      "verified": true,
      "author": "Dani R",
      "helpful_votes": 0,
      "publication_date": 20180917
    },
    {
      "title": "A great comfortable light pillow",
      "text": "I always have had to travel with a pillow so I decided to try this in order to travel light. It exceeded all my expectations. Easy to blow up, easy to adjust to the right fullness, comfortable. It is tiny when deflated and fits easily back into its stuff sack. And I slept great!",
      "rating": 5.0,
      "verified": true,
      "author": "Beth",
      "helpful_votes": 0,
      "publication_date": 20160510
    },
    {
      "title": "Comfortable, light weight",
      "text": "Comfortable, light weight, small volume when packed. After five weeks of rugged use (packing up camp each morning) it started to deflate a little bit but still usable. I like the soft surface (not scratchy) and it tucked perfectly into my sleeping bag top.",
      "rating": 5.0,
      "verified": true,
      "author": "abracadabra",
      "helpful_votes": 0,
      "publication_date": 20161103
    },
    {
      "title": "Awesome Product",
      "text": "These are great. See my review for the other size. I use them on airplanes for back support but I keep leaving them on the seat. Great, super lightweight and strong.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Fisher",
      "helpful_votes": 0,
      "publication_date": 20170220
    },
    {
      "title": "Ultralight, Ultra-Awesome!",
      "text": "This is a very comfortable pillow that is extremely light and small. It's easy to inflate so that it cradles your head. This is worth the investment for backpacking. I would even take this to a hotel over a crummy hotel pillow. I have already given one as a gift- definitely a must on your backpacking gear list!",
      "rating": 5.0,
      "verified": true,
      "author": "J. Drew",
      "helpful_votes": 0,
      "publication_date": 20160625
    },
    {
      "title": "Get the largest size you can",
      "text": "Great pillow, but I encourage you to buy the largest size. It's nominally heavier but so much bigger.",
      "rating": 5.0,
      "verified": true,
      "author": "Backpacker SB",
      "helpful_votes": 0,
      "publication_date": 20191104
    },
    {
      "title": "... yet on a camping trip but it sure feels comfortable. Extremely light and feels so good I may ...",
      "text": "Haven't tried it yet on a camping trip but it sure feels comfortable. Extremely light and feels so good I may use it as my normal pillow.",
      "rating": 4.0,
      "verified": true,
      "author": "TB",
      "helpful_votes": 0,
      "publication_date": 20170504
    },
    {
      "title": "They love it. Perfect size packed up and",
      "text": "Bought as a gift. They love it. Perfect size packed up and comfy",
      "rating": 5.0,
      "verified": true,
      "author": "Rell",
      "helpful_votes": 0,
      "publication_date": 20180421
    },
    {
      "title": "easy and comfortable",
      "text": "Packs down super small and is very easy to inflate. Fits snuggly in the hood of my sleeping bag",
      "rating": 5.0,
      "verified": true,
      "author": "C8",
      "helpful_votes": 0,
      "publication_date": 20190505
    },
    {
      "title": "Treat yourself to some ultralight hiking comfort.",
      "text": "This pillow is awesome. I'm an ultralight hiker so everything is considered for weight before I bring it. Its super comfortable, light, doesn't get clammy. I tried for a long time to use one of my stuff sacks filled with whatever as a pillow, but this upgrade is seriously worth every penny. Treat yourself to some ultralight hiking comfort.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike Reid - mikereidphotography dot com",
      "helpful_votes": 0,
      "publication_date": 20160914
    },
    {
      "title": "It does the trick",
      "text": "It's not the most comfortable, but it does the job.",
      "rating": 3.0,
      "verified": true,
      "author": "Alex Sibille",
      "helpful_votes": 0,
      "publication_date": 20180815
    },
    {
      "title": "Better than thermarest airhead",
      "text": "Packs smaller and more comfy than the thermarest airhead which I used for about 4 years. I lost it and took a chance on this one. So far so good.",
      "rating": 4.0,
      "verified": true,
      "author": "chris",
      "helpful_votes": 0,
      "publication_date": 20190302
    },
    {
      "title": "Five Stars",
      "text": "I like this pillow a lot- great for my hiking trips!",
      "rating": 5.0,
      "verified": true,
      "author": "John Martin",
      "helpful_votes": 0,
      "publication_date": 20180408
    },
    {
      "title": "Work great in my hammock for camping",
      "text": "Work great in my hammock for camping. But would almost prefer a crush sack of dirty clothes in my tent [...]",
      "rating": 5.0,
      "verified": true,
      "author": "Hikersreview",
      "helpful_votes": 0,
      "publication_date": 20161221
    },
    {
      "title": "Fantastic pillow and very comfortable",
      "text": "Fantastic pillow and very comfortable. Used it on two backpacking trips now and I can't say enough good about it! If I find I have too much air I can take some out without having to turn on a light or even sit up! Packs away in seconds!",
      "rating": 5.0,
      "verified": true,
      "author": "DanoD",
      "helpful_votes": 0,
      "publication_date": 20160628
    },
    {
      "title": "Comfortable",
      "text": "I think this is as comfortable as an air pillow can get. Very lightweight, compact, and very good quality",
      "rating": 4.0,
      "verified": true,
      "author": "Jeanne in Oregon",
      "helpful_votes": 0,
      "publication_date": 20181002
    },
    {
      "title": "... as my regular pillow because Aeros Pillow is so comfortable.",
      "text": "I use as my regular pillow because Aeros Pillow is so comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Me",
      "helpful_votes": 0,
      "publication_date": 20170411
    },
    {
      "title": "Very comfortable",
      "text": "This pillow is s ludesaver for my neck. Don't fill it super full for a very comfortable pillow",
      "rating": 5.0,
      "verified": true,
      "author": "Hez",
      "helpful_votes": 0,
      "publication_date": 20160815
    },
    {
      "title": "Good pillow",
      "text": "Very easy to fill and deflate. Very comfortable and very compact when rolled up in travel bag. I may buy the larger size as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Frank E. Gunyah",
      "helpful_votes": 0,
      "publication_date": 20181016
    },
    {
      "title": "Five Stars",
      "text": "Son loved this on his long camping trip. Said it worked great!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161221
    },
    {
      "title": "Love it! Took it on the Long Trail and ...",
      "text": "Love it! Took it on the Long Trail and it was everything I needed. Pro tip: don't inflate all the way. If it's a little 'softer' it feels more like the real thing.",
      "rating": 5.0,
      "verified": true,
      "author": "Kira Pilot",
      "helpful_votes": 0,
      "publication_date": 20160923
    },
    {
      "title": "Five Stars",
      "text": "Amazing quality and so easy to blow up. Super comfortable!",
      "rating": 5.0,
      "verified": true,
      "author": "Rebecca Thompson",
      "helpful_votes": 0,
      "publication_date": 20161112
    },
    {
      "title": "Worth the weight.",
      "text": "Huge benefit when sleeping on the ground. Also nice to be able to adjust softness.",
      "rating": 5.0,
      "verified": true,
      "author": "brad769",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "Perfect travel size but deflates.",
      "text": "I am returning it because it slowly begins deflating over the course of 20 to 30 minutes. I’ve made sure the cap is securely closed. I’m not sure what’s causing the air leak.",
      "rating": 3.0,
      "verified": true,
      "author": "BA",
      "helpful_votes": 0,
      "publication_date": 20171021
    },
    {
      "title": "Awesome design! I've been dealing with sore necks for ...",
      "text": "Awesome design! I've been dealing with sore necks for thirty years with my stuff sack pillows. Easy packing and terrific shape. I'm a big guy and this lightweight pillow is worth every penny. Gets stuffed in with the bag so it will always be there.",
      "rating": 5.0,
      "verified": true,
      "author": "Christopher Sauer",
      "helpful_votes": 0,
      "publication_date": 20160823
    },
    {
      "title": "Four Stars",
      "text": "It is very light and easy to carry but not as comfortable as I thought.",
      "rating": 4.0,
      "verified": true,
      "author": "Mauricio Herrera",
      "helpful_votes": 0,
      "publication_date": 20151003
    },
    {
      "title": "This pillow was great. I used it in Haiti for a week",
      "text": "This pillow was great. I used it in Haiti for a week. Stayed inflated the whole week at the same pressure. Comfortable, no neck or back pain.",
      "rating": 5.0,
      "verified": true,
      "author": "JM",
      "helpful_votes": 0,
      "publication_date": 20180625
    },
    {
      "title": "Works great so far",
      "text": "Bought it for my hammock. Works great so far! Its nice and soft, not noisy at all, and is extremely small when packed up. Definitely worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Samantha S",
      "helpful_votes": 0,
      "publication_date": 20170306
    },
    {
      "title": "Five Stars",
      "text": "I use it a few times a month while backpacking.",
      "rating": 5.0,
      "verified": true,
      "author": "ML",
      "helpful_votes": 0,
      "publication_date": 20160725
    },
    {
      "title": "Five Stars",
      "text": "More comfortable than my real pillow. Leave a tiny bit under-inflated for best results.",
      "rating": 5.0,
      "verified": true,
      "author": "Oliver MuhleBruce",
      "helpful_votes": 0,
      "publication_date": 20160303
    },
    {
      "title": "Great Comfort",
      "text": "This was one of the best items I had taken during camping--it was great, really comfortable, easy to blow up and carry. Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161009
    },
    {
      "title": "Five Stars",
      "text": "This pillow is soft and comfortable. Easy to inflate and deflate.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 0,
      "publication_date": 20170518
    },
    {
      "title": "Awesomeness!!!",
      "text": "Whether or not you are going light weight this pillow is awesome. Packs up ultra small. I am a hammock camper and this will stuff into my La Siesta Double stuff sack. No wasted room in pack. You can tell its a blow up pillow but surprises you with it's comfort. Was hesitant to buy, tried a friends then immediately threw my Teton camp pillow in the fire :)",
      "rating": 5.0,
      "verified": true,
      "author": "Josh",
      "helpful_votes": 0,
      "publication_date": 20150818
    },
    {
      "title": "Perfect backpacking pillow",
      "text": "this pillow is awesome. It's smaller than my wife's fist when it's packed (she's tiny) and its big enough for my huge head when it's inflated. It literally takes me two breaths to fill it completely, then you just use your finger to let small amounts of air out, to customize the firmness to your liking. I went backpacking with a buddy last weekend and it pretty much blew his mind when I broke it out.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian",
      "helpful_votes": 0,
      "publication_date": 20150824
    }
  ],
  "product_meta": {
    "title": "Sea to Summit Aeros Pillow Premium (Regular/Blue)",
    "rating": 4.7,
    "feature_bullets": [
      "Aeros Pillow Premium-Regular-Blue",
      "Aeros Pillow Premium-Regular-Blue",
      "Sea to Summit",
      "Aeros Premium Pillow Regular"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "Yes",
      "Product Dimensions": "10.63 x 5.12 x 5.12 inches; 0.64 Ounces",
      "Item model number": "SG_B00WW7GFU8_US",
      "Department": "Unisex",
      "Date First Available": "April 30, 2015",
      "Manufacturer": "571",
      "ASIN": "B00WW7GFU8",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Outdoor Recreation",
      "Sports & Outdoors",
      "Camping Pillows",
      "Sleeping Bags & Camp Bedding",
      "Camping & Hiking"
    ],
    "price": 47.9
  }
}