{
  "website_summaries": [
    {
      "verdict": "Powerful clay mask soaks up oil and clears congestion for healthy-looking skin.",
      "pros": [
        "Clay mask is cooling and works to minimize pores",
        "Detox treatment draws out impurities in the skin quickly",
        "Leaves skin with a silky smooth, even tone",
        "Clean ingredients include coffee to help clean out pores"
      ],
      "cons": [
        "Easy to apply too much of the pink, almost translucent mask, which may dry out the skin"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Love this gentle quick and easy mask",
      "text": "This mask is gentle but works so well - and you don't need to chisel it off your face like some other clay masks. Proactiv's sulfur mask had been my go-to for maintaining clear skin, but this may just replace it. It keeps my skin clear but also noticeably reduces pores, and my skin just feels smoother after using. Smells so awesome, too.",
      "rating": 5.0,
      "verified": true,
      "author": "LVS",
      "helpful_votes": 9,
      "publication_date": 20190325
    },
    {
      "title": "Best mask!",
      "text": "Obsessed with this face mask My face feels so soft and fresh!! Everyone needs this mask if they want to look younger and great!",
      "rating": 5.0,
      "verified": true,
      "author": "BAE",
      "helpful_votes": 7,
      "publication_date": 20190521
    },
    {
      "title": "It's Ok but not as powerful as the Aveda Tourmaline ...",
      "text": "It's Ok but not as powerful as the Aveda Tourmaline Mask. The Caudalie leaves my face feeling clean and somewhat smooth after use but I tend to have breakouts shortly after. When I use the Aveda Tourmaline Mask my face feels especially smooth and polished for days and no breaks out afterward. I'll go back to the Aveda once I'm done with this product.",
      "rating": 2.0,
      "verified": true,
      "author": "Bettlebee",
      "helpful_votes": 4,
      "publication_date": 20180708
    },
    {
      "title": "Great product!",
      "text": "This mask seems to really be helping my skin. My blackheads shrink considerably after using this mask. It hasn't dried out my skin. It seems like a really gentle and skin balancing treatment. I've been using it for nearly a month and I really do see and feel the difference.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer G",
      "helpful_votes": 4,
      "publication_date": 20171121
    },
    {
      "title": "It just goes nicely, stays on without irritating your skin and",
      "text": "Don't know how this is \"Amazon Choice\" because this mask does nothing for my face. Detox is a lot to promise and this mask certainly doesn't deliver even a basic cleanse. It just goes nicely, stays on without irritating your skin and... that's it. You won't see any difference in your face. Don't waste your money.",
      "rating": 2.0,
      "verified": true,
      "author": "Miss Apple",
      "helpful_votes": 0,
      "publication_date": 20180717
    },
    {
      "title": "Really clears out the pores",
      "text": "This does a good job of clearing out my pores. I don't detect any scent from it at all, and I have combination skin, giant pores, and sensitive areas. This has not irritated my skin at all (using it 2x week). I am happy with it.",
      "rating": 5.0,
      "verified": true,
      "author": "chica",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "If at first u dont succeed...",
      "text": "Great feeling. The first use is underwhelming, but for some reason on second use you will notice a difference. Your face will feel very clean.",
      "rating": 5.0,
      "verified": true,
      "author": "ee",
      "helpful_votes": 6,
      "publication_date": 20161007
    },
    {
      "title": "I'm not seeing any results as of now but I ...",
      "text": "I'm not seeing any results as of now but I have only used it for a week so maybe its to soon to see a change in my skin",
      "rating": 3.0,
      "verified": true,
      "author": "felicia",
      "helpful_votes": 4,
      "publication_date": 20171021
    },
    {
      "title": "Made me “glow”!",
      "text": "I could tell a difference in my “glow” after one application. I read a few complaints about the smell/ it smells like many lavender spa products if you don’t like the smell lavender spa products you won’t like the smell of this- however, I love love love the smell!",
      "rating": 5.0,
      "verified": true,
      "author": "Lopez",
      "helpful_votes": 0,
      "publication_date": 20200614
    },
    {
      "title": "It really worked for me",
      "text": "I absolutely love this line of products. I have the moisturizing one as well! Which is incredible! Being vegan and working better than anything I have ever tried. My skin clears up so fast and painlessly with this product. I recommend tring it because I was sceptical at first and became a believer.",
      "rating": 5.0,
      "verified": true,
      "author": "Taylor Goodnight",
      "helpful_votes": 3,
      "publication_date": 20180528
    },
    {
      "title": "there is no allergic reaction and my skin feel very comfortable. If anyone is seeking for a daily care ...",
      "text": "very effective in cleaning. I am sensitive to ingredients of cosmetic. So if there is some hormone drugs in it, my face will have allergic symptom soon or later. But when using this one, there is no allergic reaction and my skin feel very comfortable. If anyone is seeking for a daily care cosmetic, I strongly recommend this mask with Nuxe's face cleansing gel.",
      "rating": 5.0,
      "verified": true,
      "author": "Francis_Zhou",
      "helpful_votes": 0,
      "publication_date": 20171116
    },
    {
      "title": "Fabulous Face Mask",
      "text": "This is my favorite face mask and love the way it detoxes and cleans your skin. It is a perfect \"go-to\" stocking stuffer because I KNOW it is a great product and any girl would love to try it.",
      "rating": 5.0,
      "verified": true,
      "author": "Jamie L. Whitaker",
      "helpful_votes": 0,
      "publication_date": 20181103
    },
    {
      "title": "Tight mask that tingles and burns my eyes.",
      "text": "This detox mask feels so tight on my face and some ingredient in the product makes my eyes burn. It broke me out in little pimples. You can not return this product so please don’t waste your money.",
      "rating": 2.0,
      "verified": true,
      "author": "Lisa G.",
      "helpful_votes": 2,
      "publication_date": 20181105
    },
    {
      "title": "So in love with this mask",
      "text": "So in love with this mask! It is by far the best facial mask I have used! I can tell my pores are shrinking after using this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Erin Achram",
      "helpful_votes": 2,
      "publication_date": 20180227
    },
    {
      "title": "Quick and beautiful mask!!",
      "text": "Absolutely favorite quality facial mask that I recommend to all my friends!",
      "rating": 5.0,
      "verified": true,
      "author": "Miranda",
      "helpful_votes": 0,
      "publication_date": 20190228
    },
    {
      "title": "The best there is!",
      "text": "There’s nothing out there like this mask. I have been hooked on Caudalie products since I went to France. This mask is fabulous! It tightens your skin, cleans out your pores and lasts a long while!",
      "rating": 5.0,
      "verified": true,
      "author": "Chrystie Caldarella",
      "helpful_votes": 0,
      "publication_date": 20190414
    },
    {
      "title": "Eh won’t buy again",
      "text": "I felt like it didn’t really do anything for my skin",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20171108
    },
    {
      "title": "Love it",
      "text": "Love this mask. Makes my pores clean and look small and smooth.",
      "rating": 5.0,
      "verified": true,
      "author": "AjoyThor",
      "helpful_votes": 0,
      "publication_date": 20191224
    },
    {
      "title": "I love it",
      "text": "I use this whole last summer, like twice a week. It is the best Detox Mask I have ever used. Other similar products make my skin itchy and dry, but it won't. It gets rid off the oily feel from your face with fresh and moisture. I JUST LOVE IT!",
      "rating": 5.0,
      "verified": true,
      "author": "kaiqi",
      "helpful_votes": 0,
      "publication_date": 20190621
    },
    {
      "title": "Very smooth and very good at clearing out pores",
      "text": "Very smooth and very good at clearing out pores. A little expensive, but a little of it goes a long way.",
      "rating": 5.0,
      "verified": true,
      "author": "allyssa",
      "helpful_votes": 0,
      "publication_date": 20180722
    },
    {
      "title": "Could cause major breakouts",
      "text": "Made my sensitive skin break out horribly Had major cystic acne",
      "rating": 1.0,
      "verified": true,
      "author": "Madelyn Clifford",
      "helpful_votes": 0,
      "publication_date": 20201017
    },
    {
      "title": "Love it",
      "text": "I love this mask, great for large pores & was $10 less here compared to Sephora ❤",
      "rating": 5.0,
      "verified": true,
      "author": "Victoria Cardoza",
      "helpful_votes": 0,
      "publication_date": 20181008
    },
    {
      "title": "FAV",
      "text": "I love this product. My boyfriend even uses it. Pores disappear and skin GLOWS!",
      "rating": 5.0,
      "verified": true,
      "author": "Amber Ryan",
      "helpful_votes": 0,
      "publication_date": 20191110
    },
    {
      "title": "... USE THIS IN SPRING AND SUMMER AND IT WORKS WONDERFUL. I WOULD ORDER IT AGAIN",
      "text": "I HAVE DRY SKIN SO I ONLY USE THIS IN SPRING AND SUMMER AND IT WORKS WONDERFUL. I WOULD ORDER IT AGAIN.",
      "rating": 4.0,
      "verified": true,
      "author": "Marcia Sasloff",
      "helpful_votes": 5,
      "publication_date": 20170217
    },
    {
      "title": "Love it.",
      "text": "I love this mask so much. I use it 3 times a week and it does wonders for my skin. Heads up though, being a deep cleaning mask, it can dry out your skin so be sure to follow up with a good oil or cream.",
      "rating": 5.0,
      "verified": true,
      "author": "Alexandra Carley",
      "helpful_votes": 4,
      "publication_date": 20160128
    },
    {
      "title": "My long time favorite mask. The great texture and light aroma makes ...",
      "text": "My long time favorite mask. The great texture and light aroma makes it real spa experience to use this product. My skin is great-full.",
      "rating": 5.0,
      "verified": true,
      "author": "Customer",
      "helpful_votes": 3,
      "publication_date": 20161010
    },
    {
      "title": "Cheaper than SEPHORA",
      "text": "I love Caudalie!! Took a while to get here because it game from Greece, but wonderful purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Lauren Daniel",
      "helpful_votes": 2,
      "publication_date": 20160629
    },
    {
      "title": "Does what it says!",
      "text": "This is the best mask product I have ever used. Fantastic!",
      "rating": 5.0,
      "verified": true,
      "author": "BAS",
      "helpful_votes": 3,
      "publication_date": 20150612
    },
    {
      "title": "very good, I can recommend to buy it",
      "text": "very good, I can recommend to buy it, especially if you are going put after working day it helps you to look more fresh",
      "rating": 5.0,
      "verified": true,
      "author": "SK",
      "helpful_votes": 3,
      "publication_date": 20160410
    },
    {
      "title": "smells great, made my skin surprisingly soft",
      "text": "smells great, made my skin surprisingly soft, and my skin was noticeably brighter. it's also a really pretty pink color so that's a plus. realy just a great mask!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20160809
    },
    {
      "title": "Smells nice, not big on results.",
      "text": "This mask smells very nice and makes my skin feel good immediately after I use it. I can't say I've noticed any long term improvements and I would recommend skipping it for the price that you pay. If you're just looking to spoil yourself and have a reasonably priced spa day, this is your product. I wouldn't expect any long-term clarifying or detoxing results though.",
      "rating": 3.0,
      "verified": true,
      "author": "Karin",
      "helpful_votes": 3,
      "publication_date": 20170323
    },
    {
      "title": "Love it!",
      "text": "I first received this as a birthday gift and I fell in love with it. I just had to have more so now, I keep it in my skin care regime. I have really oily, sensitive skin and sometimes break out with acne. I use this mask at night and by morning, everything (bumps, pores, redness,etc) is reduced. I tried using it in the mornings before applying make up, but I don't get the same results so I only use it at night. Sometimes I apply a moisturizer afterwards and my skin always looks better by morning. I use it about twice a week.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 7,
      "publication_date": 20160707
    },
    {
      "title": "Three Stars",
      "text": "doesn't really do much. i use it because i paid for it.",
      "rating": 3.0,
      "verified": true,
      "author": "kmoran2",
      "helpful_votes": 0,
      "publication_date": 20160526
    },
    {
      "title": "Smooth skin",
      "text": "I don't think I'll repurchase this product again but I don't hate the product, it just didn't work for my skin",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20151201
    },
    {
      "title": "OVER RATED PRODUCT!",
      "text": "This product is totally over rated! I bought it hoping it would be better than other masks, as they claim. But, I have used $6.00 masks that worked just the same as this one. I would never recommend spending hard earned money on this product, Aztec clay works better than this and is much less expensive.",
      "rating": 1.0,
      "verified": true,
      "author": "Manduhlynn",
      "helpful_votes": 13,
      "publication_date": 20160817
    }
  ],
  "product_meta": {
    "title": "Caudalie Instant Detox Clay Mask, 2.5 Ounce",
    "rating": 4.6,
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "4.7 x 4.7 x 14 inches; 1.6 Ounces",
      "Item model number": "3522930001805",
      "UPC": "827175647348",
      "Manufacturer": "Caudalie",
      "ASIN": "B00W3SIY1E",
      "Amazon Best Sellers Rank": "#43,524 in Beauty & Personal Care",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Skin Care",
      "Treatments & Masks",
      "Face",
      "Beauty & Personal Care",
      "Masks"
    ],
    "price": 39.0
  }
}