{
  "website_summaries": [
    {
      "verdict": "Sleek, compact pump for Presta and Schrader valves delivers virtually leak-proof pumping.",
      "pros": [
        "Unique and favored among cyclists for its threaded valve connector that screws on for airtight connection",
        "Little air loss when removing or attaching to valve stem, especially important with thin tires",
        "Very lightweight",
        "Built-in pressure gauge"
      ],
      "cons": [
        "Takes twice as many strokes, too much upper body strength to inflate tire for some"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "High quality",
      "text": "I bought two other pumps and returned them both before getting this one. Much easier to use than the others. The gauge is a nice added bonus and the pump is very slim compared to others. I also like that you have to fasten the pump on the valve and that it has a flexible hose. Makes for a much more secure latch and easier to pump. Very high quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 207,
      "publication_date": 20190817
    },
    {
      "title": "very handy tool to have",
      "text": "really glad i picked this up. its been a life saver. its nicely made, looks good, and does a great job!",
      "rating": 5.0,
      "verified": true,
      "author": "skyler hill",
      "helpful_votes": 198,
      "publication_date": 20191010
    },
    {
      "title": "Works great",
      "text": "Got this today. Tried it out to see how well it works. Works great! Looks great on my Diamondback!",
      "rating": 5.0,
      "verified": true,
      "author": "Christy",
      "helpful_votes": 232,
      "publication_date": 20190331
    },
    {
      "title": "High quality product.",
      "text": "This product is presented very accurately in it's description. It is rather compact and subsequently can be mounted on a number of locations on the bike frame (self-drilling screws were used). The pump was used to inflate a variety of bike tires with ease. Would recommend and purchase again.",
      "rating": 5.0,
      "verified": true,
      "author": "Hugh G. Rektion",
      "helpful_votes": 88,
      "publication_date": 20190903
    },
    {
      "title": "It works very well",
      "text": "It’s a good gadget and very important when you go to the mountains",
      "rating": 5.0,
      "verified": true,
      "author": "Gustavo Mora",
      "helpful_votes": 87,
      "publication_date": 20180712
    },
    {
      "title": "Great design. Fitts any wheel.",
      "text": "I almost never wore a review, but this pump is just amazing. Very compact and lightweight. Fitts pretty much any wheel. Gauge is accurate. But most importantly- design. It is made so you'd never loose and part of it. Thank you guys!",
      "rating": 5.0,
      "verified": true,
      "author": "Ilya",
      "helpful_votes": 56,
      "publication_date": 20190706
    },
    {
      "title": "but it is the first that actually screws onto the valve for a perfect, airtight connection",
      "text": "This is not my first Presta valve pump, but it is the first that actually screws onto the valve for a perfect, airtight connection. That's the first plus. Others include (1) The integral pressure gauge, which I don't expect to be accurate. But its readings can be calibrated to a known-accurate gauge, and thereafter provide a meaningful readout. (2) Solid construction. (3) Hose-based strain-relieving attachment (which reduces the possibility of stressing the valve). (4) Reasonable compactness and lightness. The expected downside of having to pump a lot to get a tire up to higher pressure is really no problem, since flats are rare compared to regular top-offs using the big floor pump in my garage.",
      "rating": 5.0,
      "verified": true,
      "author": "Raphael Frommer",
      "helpful_votes": 59,
      "publication_date": 20171119
    },
    {
      "title": "Great little pump",
      "text": "Used on my 6000 mile bike tour through Africa. My bike has shrader valves and it worked really well. Small and compact. I reached out to support when I needed a replacement rubber cover which I lost (my fault) and they were friendly and quick to send me a replacement free of charge. I recommend this to anyone who needs a small light pump.",
      "rating": 5.0,
      "verified": true,
      "author": "Cullen Quine",
      "helpful_votes": 111,
      "publication_date": 20200415
    },
    {
      "title": "Broke with 4 months of use",
      "text": "The product was not as durable as I expected. The product stopped working with less than 10 uses. I tried to fix it but it wasnot Possible.",
      "rating": 1.0,
      "verified": true,
      "author": "Tomas Toso",
      "helpful_votes": 22,
      "publication_date": 20180728
    },
    {
      "title": "Lots of pumping for not so much...",
      "text": "I tested the pump and after a lot of pumping and when it was barely able to put any more air in the tire, the pressure was slightly over 20psi. Good enough in a 28c tire like I use to get me back home, but not quite enough to continue riding comfortably or probably at all in a 23c or 25c tire. Basically, meh... I can only guess how this has got so many good reviews...",
      "rating": 2.0,
      "verified": true,
      "author": "Reviewer from Redmond, WA",
      "helpful_votes": 7,
      "publication_date": 20171219
    },
    {
      "title": "This pump is nice and compact and feels well-made",
      "text": "This pump is nice and compact and feels well-made. It's a little awkward to use because you have to hold the end on the tire valve so it doesn't fall off, but also need to hold the body of the pump with one hand and the handle with the other hand. I have 35mm 700c tires which I was trying to pump to 80 psi. I could only get them up to 60 with this pump. It would get me home in an emergency which I think is the main point of these.",
      "rating": 4.0,
      "verified": true,
      "author": "Hip E.",
      "helpful_votes": 4,
      "publication_date": 20180806
    },
    {
      "title": "One Star",
      "text": "This pump worked great first two times on the third it fell a part.",
      "rating": 1.0,
      "verified": true,
      "author": "Marina & Vlad Bokserman",
      "helpful_votes": 19,
      "publication_date": 20171003
    },
    {
      "title": "we've had a few over the years and like to have one on the bike while riding",
      "text": "We had high hopes for this pump.... we've had a few over the years and like to have one on the bike while riding. This one is useless!!! Who ever engineered this never examined valves that well. Impossible to use as the valve blocks the airway! No amount of fussing, reading instructions etc will dove the problem the pump will not screw on to any valve and we tried many different kinds of valves... we have six bikes. SO don't even consider this we have sent it back.",
      "rating": 1.0,
      "verified": true,
      "author": "Robert",
      "helpful_votes": 6,
      "publication_date": 20171216
    },
    {
      "title": "Perfect for Bike Touring",
      "text": "We used this pump on a recent adventure touring trip, and it worked reliably. I really like the flexible hose that attaches to the stem, which reduces the risk of damaging the tube when inflating the tire. The accuracy of the inline pressure gauge is a bit suspect, but it provided decent general feedback and then, from there, we inflated by feel. Lightweight and durable, it stored easily in a pannier pocket for easy access.",
      "rating": 5.0,
      "verified": true,
      "author": "RTK",
      "helpful_votes": 118,
      "publication_date": 20200223
    },
    {
      "title": "Pressure gauge does not work.",
      "text": "I bought this mainly because it comes with a built-in gauge. Sadly I cannot get the gauge to work. It simply will not rise when I pump. I have tried everything, and now I'm returning the pump. The pump itself is a nice size and works quicker than expected.",
      "rating": 1.0,
      "verified": true,
      "author": "S. Fontaine",
      "helpful_votes": 5,
      "publication_date": 20190122
    },
    {
      "title": "After 'repairing' the pump the volume of each stroke was so useless that I could not get the tire to more ...",
      "text": "Purchased last summer and thankfully never had use this pump until this week and I will never attempt to use it again. When I took it off the bike either it was never assembled correctly or the shaft had somehow unwound itself and had to be reattached. After 'repairing' the pump the volume of each stroke was so useless that I could not get the tire to more than 25% inflated. Thankfully a fellow biker found me and let me have one of his canisters or I would have had to hike out.",
      "rating": 1.0,
      "verified": true,
      "author": "James Tugman",
      "helpful_votes": 16,
      "publication_date": 20180313
    },
    {
      "title": "Good with flaws",
      "text": "The gauge to measure pressure is not accurate or at least it was defective on the unit I received. I tried putting 60 psi on one of my tires and the mark reading was at 20 psi and the tire was already extremely stiff (I thought I was going to pop it). Thought about just buying an pressure measure additionally but why buy additional equipment? I decided to give another brand a try instead.",
      "rating": 3.0,
      "verified": true,
      "author": "MA0X2",
      "helpful_votes": 3,
      "publication_date": 20190711
    },
    {
      "title": "Impressively well manufactured and engineered.",
      "text": "This is a fine unit. Very well crafted. Very light. Very sturdy. Excellent design. I really like it a lot. I suppose that my only real critique is that it does become pretty touch to pump once you reach around 80 PSI. It gets warm after around 35 full pumps. But this isn't that much of an issue for me. I like that I can stow it in my bag and it is so convenient having a dedicated Presta or Schrader valve adapter that screws on nice and tight. Plus the silver finish is so smooth and shiny. They really knocked it out of the park with this tool. A+ on this one.",
      "rating": 5.0,
      "verified": true,
      "author": "MightyDragon",
      "helpful_votes": 0,
      "publication_date": 20200729
    },
    {
      "title": "the product was not as advertised. The air hose ...",
      "text": "the product was not as advertised. The air hose did not have the air gauge in it, only a rubber hose without a gauge. The purpose of my purchase was to have it as advertised, in one contained unit.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 7,
      "publication_date": 20180625
    },
    {
      "title": "It may be good but not for me.",
      "text": "I purchased this based on the excellent reviews. When I tried inflating my tire (presta valve) it seemed to work very well. Unfortunately when I unscrewed the hose it pulled the presta valve core out as well and completely deflated the tire. It was a bummer for sure. Perhaps I did something wrong but if I have to figure it out when I need it then this isn't the pump for me. I'm disappointed. I guess I'll buy a pump the pushes on and snaps closed.",
      "rating": 1.0,
      "verified": true,
      "author": "Michelle Foster",
      "helpful_votes": 0,
      "publication_date": 20200524
    },
    {
      "title": "Great hand pump",
      "text": "I recently bought a bike and I'm completely new to biking. This pump is great because it has two of the most common valves covered (I didn't even know there were two types of valves). Construction of this pump is very solid and it feels high quality. I don't imagine this pump taking alot of abuse, but if I were to accidentally drop it then I'm sure it would only sustain minimal damage, such as a scrape. It also has a very small footprint and would fit easily on any bike. The instructions that it comes with are very clear and once you use the pump once, you'll never forget. I'm really happy with the built-in gauge too.",
      "rating": 5.0,
      "verified": true,
      "author": "dezymondTop Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20200409
    },
    {
      "title": "Beautiful Design, Poor Mounting",
      "text": "The design of the pump is BEAUTIFUL, with a screw-on hose (not those lousy lever attachments) which secures via threads to the inside of the pump for convenient storage and the pump works well. My only gripe is the mounting, which makes the pump problematic. Instead of mounting wihhin the frame, the mount goes to the side and interferes with your knees or ankles, depending on the placement. And the combination of a loose plastic clip with a thin rubber strap almost guarantee it will fall off and be lost on Rocky Colorado trails. Would also be great to include mounting screws.",
      "rating": 3.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190709
    },
    {
      "title": "Great little pump",
      "text": "Great little pump. Mounted it on my seat tube. Sits nicely and doesn’t disrupt the bike lines. High quality. Easy to pump - however it does take a bit more effort at 70psi +. It’s not meant to replace your main pump at home so for what’s it’s intended for it’s very good. Only downside is on removable valve presta setups. If your valve isn’t extremely tight this will undo the valve stem when you remove it. I have removable valve stems, but don’t need them to be. I solved by using red Loctite. So if you need your valve to be removable, you will have to make sure they are very tight or it will come off.",
      "rating": 4.0,
      "verified": true,
      "author": "Patrick Jones",
      "helpful_votes": 0,
      "publication_date": 20200125
    },
    {
      "title": "Nice portable bike pump",
      "text": "I recently decided to take cycling a bit more \"seriously,\" and I realized I should probably carry a tire pump on every ride. I carry CO2 canisters but realized if you have a flat, it's best you inflate the replacement inner tube a bit to help secure it on the ride, and for that you need an old fashioned pump. The Pro Bike Tool is lightweight, and small enough to slip into your back jersey pocket. You could attach it to your bike as well but in my case it did not work because my cadence sensor, attached to the inside of my pedal, was striking the pump. A small quibble, though, and I do recommend this pump.",
      "rating": 5.0,
      "verified": true,
      "author": "Reed Ramlow",
      "helpful_votes": 0,
      "publication_date": 20190917
    },
    {
      "title": "AMAZING It's light, reliable, accurate, and has withstood a significant amount of abuse",
      "text": "It comes with a bike mount, it stayed with my bike after 2 gnarly downhill spills. It's light, it works, it stays in place. I unknowingly filled it with water when washing my bike and the next day I mangled my tire. I grabbed the pump and the water poured out and I was sure I was screwed. To my astonishment it worked flawlessly, I had to patch the tire 3 times, inflating it 3 times, then gave up inflated the spare, IT TOO had a puncture so I patched it and inflated it. 5 inflations, and this thing handled like a champ. I love it I would recommend to a friend but not a competitor",
      "rating": 5.0,
      "verified": true,
      "author": "B. Little",
      "helpful_votes": 0,
      "publication_date": 20180710
    },
    {
      "title": "Quality, but finicky pressure gage.",
      "text": "It works as expected, but it can be very difficult to pump, and the pressure guage can be very finicky with Presta valves- a little disappointed by that fact but that's my only real complaint. Made quality, Would be difficult to break if you tried.",
      "rating": 4.0,
      "verified": true,
      "author": "Patrick A. Foster",
      "helpful_votes": 2,
      "publication_date": 20180620
    },
    {
      "title": "Beautiful product and will bring it on our ride each ...",
      "text": "This pump come at the right time, our mountain bike has a rear flat tire. The pump work most efficiently if pump was drawn back slowly enough to let air fully in and push in slowly enough for air transfer into tire. Within about 20 pumps, if you do slow your arm is not sore, the tire inflate enough and about 60 - 70 pumps it will be able to ride. Beautiful product and will bring it on our ride each time. Let's see how long it will last but I have high hope for it base on initial used. BTW, the air gauge is cleverly hidden and will show after about 15-20 pumps as said in manual.",
      "rating": 5.0,
      "verified": true,
      "author": "Minh Nguyen",
      "helpful_votes": 2,
      "publication_date": 20171016
    },
    {
      "title": "Sleek device, great customer care.",
      "text": "The design is great, very compact and light. Included is a frame mount with Velcro that works really well; very easy to mount anywhere, and feels secure. The pump is fine at what it does: pumping tires. My one issue was that I used it only a few times, and it came apart where it's not supposed to. However, I contacted customer support, and they sent me a new one within a few days, no questions asked. With that kind of customer care, how could I not give 5 stars? I'll continue to use this product with the replacement.",
      "rating": 5.0,
      "verified": true,
      "author": "EC",
      "helpful_votes": 2,
      "publication_date": 20180206
    },
    {
      "title": "Good balance of portability and power",
      "text": "I can get my road bike tires to 100PSI with this. Yes, it takes over 200 strokes, but it's doable, and it's small enough not to be a burden when attached under a water bottle. I like the flexible hose too; it makes it easier to get leverage without breaking your valve stem off. The gauge isn't super accurate but it'll let you know when you're in the ballpark. All in all, it's good enough that I don't use CO2 cartridges much anymore.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeremy Stanley",
      "helpful_votes": 3,
      "publication_date": 20170915
    },
    {
      "title": "get ready for a workout",
      "text": "Takes forever to 60lbs in a tire and it's like benchpressing 100lbs to do so. Sprained my shoulder using the first time. I'm 6'1\" 230lbs and the pump sprained my shoulder pumping two tires to 60lbs. Might be good in a pinch, but I will be buying another one that is easier to use for normal use.",
      "rating": 1.0,
      "verified": true,
      "author": "Luis R.",
      "helpful_votes": 3,
      "publication_date": 20190108
    },
    {
      "title": "Small universal emergency pump with gauge.",
      "text": "Works like a champ and the gauge works too. Very compact and the flex hose with integrated gauge is very cool. The only problem, if you can call it that, it's really for emergencies only or if you need a workout. On a 27.5x2.1 tire it took a few min to get to 30 psi, the pump was getting noticeably warm in the hand. I could have kept going to 50-60 psi but I have a compressor, I didn't want a total upper body workout, and I'm lazy. I can guarantee it works like a champ to 30 psi and the gauge was accurate, beyond that you have to have faith...",
      "rating": 5.0,
      "verified": true,
      "author": "Sixiron",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "Great, in a roadside flat situation",
      "text": "This is a well made and easy to use pump. It is made strictly for roadside emergency situations. Don't think that buying this will absolve you from a foot/hand pump or compressor. Unless you like a workout in your garage, this is merely supplemental, but will get you home (it got me home once already this year) should you get a flat. I also use mine when I gravel ride on tubeless tires - I'll deflate to ~20 psi or so for gravel roads, then when I get back to the road, bust out this pump and inflate back to 50-60 psi.",
      "rating": 5.0,
      "verified": true,
      "author": "Matts'zon",
      "helpful_votes": 0,
      "publication_date": 20200805
    },
    {
      "title": "I love the built in gauge",
      "text": "I intitally had issues using this pump, but it was my cheap stock tubes that were the issue. This pump has weathered the elements with ease for over a year of daily riding now, with my bike sitting outside in the rain and snow almost every single day. It does get difficult to use the pump once I get near 60 psi, but that is expected for a hand pump of this size. I love the built in gauge, and the swap-able nozzle attachment is incredibly useful when I need to pump other cyclists tires that have mountain bikes. I did, however, recently break the mount that connects the pump to the frame, but it was all my fault.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171211
    },
    {
      "title": "BUY IT AND LOOK NO FURTHER",
      "text": "I've had it for about 6 weeks and finally needed it today. Flat tire on the trail. First off this thing is attractive and light. That being said I replaced a tube on the rail trail today on a Trek Verve hybrid bike. I changed out the tube and had the tire inflated to 50 pounds with about 1 and a half minutes of pumping. I usually run the tires at 60 psi off of my air compressor at home but 50 pounds was plenty to make it the 22 miles back to the car. Great mini pump and thank you PRO BIKE TOOL for saving our ride today",
      "rating": 5.0,
      "verified": true,
      "author": "Eric H",
      "helpful_votes": 0,
      "publication_date": 20201004
    },
    {
      "title": "This wasn`t a happy experience.",
      "text": "I wasn`t able to figure out why it got such rave reviews. I did like the look a lot and it looks great on bike, however I couldn`t get a tight fit for the presta valve, so the air kept leaking and when there was a seal, pumping wasn`t easy and it would get 'unsealed quickly but a shift of the hose. So it is a no for me.",
      "rating": 1.0,
      "verified": true,
      "author": "Roman",
      "helpful_votes": 0,
      "publication_date": 20200811
    },
    {
      "title": "Quick and easy",
      "text": "I've only used it once, but it was quick and very easy, and I figured it out using the \"quick start\" printed material. I am not very handy, and I don't know much about my bike. So that I was able to use it with ease was great. I'll keep it in my bike bag. I'll be buying several of these for next Christmas stocking stuffers. Good riddance to my old pump!",
      "rating": 5.0,
      "verified": true,
      "author": "cooiecarmel",
      "helpful_votes": 3,
      "publication_date": 20170519
    },
    {
      "title": "Broke after a year of little use",
      "text": "Allows me to inflate a road bike tires up to 100lb, it just gets super stiff, good triceps workout also. I don't really like the presta valve head, it feels like it wont properly fit and can fall while inflating. *** Update: I'm lowering the rate to two stars because the head just detached under normal use, it won't fit anymore, same as other users bought january 2018, one year and a half later the pump just fell off, it's a bummer ** Update: I contacted customer service and they were prompt and nice offered me their total customer guarantee, considering that and that the pump worked well while it lasted I'll rate it as three stars.",
      "rating": 3.0,
      "verified": true,
      "author": "Javi",
      "helpful_votes": 0,
      "publication_date": 20190621
    },
    {
      "title": "Terrific Design and Quality",
      "text": "This is a terrific pump. The design and quality are top notch. The hose design with its integrated gauge and Presta and Schrader compatibility along with the way it stores is elegant. Anyone buying this should understands the physics of a small pump do mean that it's volume per pump will not be that of a larger pump and that when air is compressed and pushed through small orifices that some heat will result. This pump does not magically overcome those realities.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe Burgart",
      "helpful_votes": 0,
      "publication_date": 20190809
    },
    {
      "title": "Great little pump",
      "text": "I needed a pump that I could use for my bikes. I wanted a pump that could accommodate both my road bike and mountain bike. This pump works great for both Presta and Schrader valves. I was also quite surprised to find a lightweight pump with a built-in pressure gauge. Without hesitation, I purchased this pump. I have now used this pump a multitude of times and I love the compact and lightweight design. I have not had any issues and will continue using this pump. If I have any issues, I will update my review.",
      "rating": 5.0,
      "verified": true,
      "author": "J",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "Nice little pump.",
      "text": "I've bought several of these mini pumps, and this is the best one I've found. The screw-on valve connection is secure, so you know you're not wasting your effort pumping only to find out it wasn't connected securely--which I find happens with the push-on type. It only takes a half a minute or so to remove the air hose from its compartment and screw it onto the end of the pump--and this design makes the pump is compact in size, and it's lightweight enough to carry in a toolkit or backpack if you don't want to use the mounting bracket.",
      "rating": 5.0,
      "verified": true,
      "author": "Leeonine",
      "helpful_votes": 0,
      "publication_date": 20201003
    },
    {
      "title": "HIGHLY RECOMMEND - Excellent Product and Company!",
      "text": "So impressed with this pump, I purchased 3 more for my other bikes! Small and compact enough to carry, but large enough pump up a 700cx48 tire up to 90psi. Inline hose pressure gauge is reasonably accurate (within 10psi of professional digital gauge). Excellent customer support! One of my four pumps had a minor problem. UK-based company IMMEDIATELY shipped another pump from the U.S.A Amazon.Com which arrived the next day. Great Company. Good Quality products. Well Designed. Fair Price.",
      "rating": 5.0,
      "verified": true,
      "author": "Ocean Gypsy",
      "helpful_votes": 0,
      "publication_date": 20201011
    },
    {
      "title": "Capable. Compact. Solid. Value.",
      "text": "I recommend this pump. I’ve been using a department store bike pump and a separate small air gauge for years. I didn’t think it mattered. This little pump is lighter than both, has a superior fit and feel, while combining both tools into one. It’s machined aluminum body is sleek and looks expensive compared to the cheap appearance the standard plastic pumps I’ve always mounted to my bikes. Now that I’ve used this pump, I find it’s even more capable than I’d imagined. Definitely a good purchase choice.",
      "rating": 5.0,
      "verified": true,
      "author": "John Q Public",
      "helpful_votes": 0,
      "publication_date": 20200404
    },
    {
      "title": "Lightweight, solidly built bike mountable pump",
      "text": "I received, tested and installed this bike pump. It's very light, solidly built, compact, and easy to use. It came with instructions but I was able to figure out how to use it without referring to them. It has a clever configuration storing the hose and pressure gauge within the pump body. It's a small pump so it does requirea lot of effort to get a tire up to ideal pressure, too hard to use as an everyday main pump but perfectly serviceable as an emergency road pump",
      "rating": 5.0,
      "verified": true,
      "author": "Nick",
      "helpful_votes": 0,
      "publication_date": 20190802
    },
    {
      "title": "Nice compact pump",
      "text": "Very nice quality pump. It does not come with mounting hardware so that was a bit misleading. I bought 2, one for myself and one for my husband, was planning on putting them inside our bike bags but unfortunately they are a bit longer than anticipated, so I will have to mount them onto our Boss Cruisers. The only other thing I noticed is that the pump shaft does not lock in place when not in use, it keeps expanding, it would be nice if you could lock it with a twist motion. Time will tell how these hold up.",
      "rating": 4.0,
      "verified": true,
      "author": "Denise J. Seda",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "Good compact pump with pressure gauge",
      "text": "I like the slim design and light weight. The extension with gauge is hidden in the inside shaft and is easy to install. I use it to inflate Presta valve tires. One recommendation I want to leave for the users is to make sure the extension is correctly screwed in position into the Presta valve thread before pumping, otherwise it just falls off the valve at the first pump. To be a compact pump is quite efficient, but not comparable to the floor pumps, so be prepared to some muscle work.",
      "rating": 5.0,
      "verified": true,
      "author": "alferit",
      "helpful_votes": 0,
      "publication_date": 20200615
    },
    {
      "title": "Nice pump but difficult to get psi over 100 due to the small size and arm strength.",
      "text": "Nice portable air pump for both Schrader and presta valve with accurate gauge. Very solid construction and I could see this pump will last a long time. However, this pump will get very warm after few minutes of use. It's very difficult to use this pump to get PSI above 80 unless you have super arm strength. Taking breaks and let the pump cool off does help. Good for easy 60-70psi for mtb tires. I suppose the foot version is much better since you can use all your body weight instead of your arm. This is why not 5 star.",
      "rating": 4.0,
      "verified": true,
      "author": "Alz",
      "helpful_votes": 0,
      "publication_date": 20200306
    },
    {
      "title": "A real mighty might",
      "text": "Bought this pump several months ago. Needed something small to fit in a lockable pouch on my bike. I lost two previous pumps due to theft while my bike was unattended. Yesterday after departing the supermarket I had a flat tire. This little pump worked so well for its size decided I needed to give it a good review. The leak was slow enough that I made it back several miles to home without incident.",
      "rating": 5.0,
      "verified": true,
      "author": "James C Sauers",
      "helpful_votes": 0,
      "publication_date": 20201002
    },
    {
      "title": "Not recommended",
      "text": "Looks nice....which is why I bought it......but Very difficult to use and it broke the second time I used it. Would not recommend at all.",
      "rating": 1.0,
      "verified": true,
      "author": "Ana",
      "helpful_votes": 15,
      "publication_date": 20170421
    },
    {
      "title": "Great addition for any bicycle! Lightweight!",
      "text": "Great tool to have, does the job! I really like the fact that it has a built in gauge, that helps out a ton! If you are planning to use this as a main pump though, don't. It took all my strength to pump up my road bike tire to 100 PSI. For those \"less weight\" oriented towards their bike, this is perfect for you. It does not weigh much at all.",
      "rating": 5.0,
      "verified": true,
      "author": "WRB",
      "helpful_votes": 2,
      "publication_date": 20170406
    },
    {
      "title": "Must have tool",
      "text": "Very nice pump. Small and lightweight so it can easy fit your backpack. You can attach to frame as well if you’d prefer to do so. Built in gauge so you can easy see how more to pump. It can server both types of valves so no need to carry adapters. No need in co2 cartridges as it simply does not use it. I selected pump over co2 based on how many miles you are going to ride and terrain. Pump in this case is a better companion and I’m very happy with it",
      "rating": 5.0,
      "verified": true,
      "author": "Maksym",
      "helpful_votes": 0,
      "publication_date": 20200725
    },
    {
      "title": "Hard to connect",
      "text": "I love the design but... have used it successfully once, after some issues with the connection and then upon the second time I got frustrated. I’ve watched the how to videos for my presta bike connection and it's not easy to figure out how to inflate a bike tube. I’m not sure why, but it seems to be screwing the presta connection back in to close the tube so no air can get through when the device is tightly screwed on. I figured out that I have to screw it in counter-clockwise and then clockwise, which worked after almost an hour of fidgeting with the device...",
      "rating": 2.0,
      "verified": true,
      "author": "jonathan j.",
      "helpful_votes": 0,
      "publication_date": 20200606
    },
    {
      "title": "Great pump for my schrader valve tubes",
      "text": "I had my first flat on the road since I bought this pump. It did a great job for me! Other reviewer complained it doesn't work well for presta valves. I can't comment on that. Others said that it took too long, and was difficult to get all the way to 100 psi, and the gage isn't perfect. I see this as an emergency pump to get me home where I have an air compressor and a full sized pump. It easily did the job for me! I like it!",
      "rating": 5.0,
      "verified": true,
      "author": "Pseudonym Warner",
      "helpful_votes": 0,
      "publication_date": 20200516
    },
    {
      "title": "Safety Hazard while mounted, too much work to inflate.",
      "text": "Quite difficult to use and mounting it to your bike while riding seems like a safety hazard with how it opens up for use. Also really difficult to inflate and the gauge isn't a seamless addition to the product. I decided to just get presta heads and pump at home using my compressor. This is definitely more for pumping on the go, which I don't think I'm going to be doing often with my 10 mile daily bike rides within town.",
      "rating": 1.0,
      "verified": true,
      "author": "George Odisho",
      "helpful_votes": 0,
      "publication_date": 20200709
    },
    {
      "title": "Not Good for Presta Valves (WARNING)",
      "text": "Don’t buy this if you have Presta valves on your bicycle. It says it works for both Schaefer and Presta, but it doesn’t. It causes the Presta valve to come apart and shoot out of the valve stem. It doesn’t lock on, instead it screws on. And when you unscrew it, all hell breaks loose. If you are on a trail, you would be doomed!!! I had trouble finding the little piece in the carpet! I have this to my cousin who has Schrader valves and hopefully it will work for her.",
      "rating": 3.0,
      "verified": true,
      "author": "nancy flynn",
      "helpful_votes": 0,
      "publication_date": 20200609
    },
    {
      "title": "Unscrews your presta valve cores far too easily",
      "text": "4 of the 5 times I've used this pump, the hose unscrewed the presta valve core when removing it. Few things are more demoralizing after putting a couple hundred pumps into a tire than to remove the pump and have the tire go flat in seconds. As I learned of this quirk, I even bought a valve core tool and tried tightening my valve cores as much as possible before using the pump - and it still unscrewed them! When I've tried screwing on the pump hose as loosely as possible, air leaks out of it. I'm done with this thing.",
      "rating": 1.0,
      "verified": true,
      "author": "ScottG",
      "helpful_votes": 0,
      "publication_date": 20200729
    },
    {
      "title": "Red Pressure Gauge Problem",
      "text": "I used this after the return window, of course :-( . It does pump up the tires easily, but the air pressure gauge doesn't work. I have no idea how much air is in the tires. Bummer cuz they should be at different pressures for road, training rollers, etc. Two stars cuz that was the main reason I bought this.",
      "rating": 2.0,
      "verified": true,
      "author": "Kate Klein",
      "helpful_votes": 2,
      "publication_date": 20181013
    },
    {
      "title": "Works well, well made, lightweight, needs one improvement",
      "text": "Impressive quality and does the job. Only one quibble, the pressure gauge barely indicates at the pressure I use (less than 50#) so I find it more or less useless. Would get the one without the gauge if I had to buy again. Suggest they make a model with a gauge that shows the 20-40# range with more than 3mm deflection. Not sure how far the gauge goes out (distance) since I haven’t had it over 50# if that.",
      "rating": 4.0,
      "verified": true,
      "author": "R. S. Jones",
      "helpful_votes": 0,
      "publication_date": 20200711
    },
    {
      "title": "Low volume, useless gauge",
      "text": "Kudo’s for trying to make an in-line pressure gauge; but this doesn’t work. Perhaps it might work for a road bike tire, but doubtful. The gauge only functions if the inflation tube is straight; which is almost never the case while pumping up a MTB tire. Also the volume of the output seems low. I pumped and pumped and only pushed in a few PSI. Ended up using my floor pump. While it is nicely build, I returned it and bought a Leyzine",
      "rating": 2.0,
      "verified": true,
      "author": "Stanley Ogle",
      "helpful_votes": 0,
      "publication_date": 20200529
    },
    {
      "title": "Solid piece but not good for high pressure",
      "text": "Pros: Well made. Compact. Has a gauge ( I still check pressure with a standard one). Works on both valve types. Mounts easily under bottle cage. Cons: Very difficult to get over 60 PSI (it will do it but the arms will pay!) Must mount upside down to keep pump from expanding. This allows sweat/ debris to accumulate in the top hood/ rod area. This was my only on the bike pump but it's now going to stay on my mountain bike (30 PSI) and I'm going to get a compact floor model for my road bikes (100 PSI)",
      "rating": 4.0,
      "verified": true,
      "author": "JR",
      "helpful_votes": 0,
      "publication_date": 20191031
    },
    {
      "title": "Terrible for road bikes with high PSI tires",
      "text": "This bike pump is not able to handle the pressure... literally. I bike on a road bike that has tires that have to be filled between 100 and 120 psi and this bike pump started leaking air at about 80 psi. It also becomes extremely hard to hand pump as the pressure builds (something i have not encountered with other pumps, as other pumps do not try to force as much air per pump). It also ended up ripping out my tube's valve. I do not recommend this product and wish that I had chosen a different pump.",
      "rating": 1.0,
      "verified": true,
      "author": "Bentley",
      "helpful_votes": 0,
      "publication_date": 20200801
    },
    {
      "title": "Excellent pump",
      "text": "Made of solid as a rock and super simple to use. The fact that this is ultra compact and light weight, made of quality materials that are going to last AND has a pressure gauge built in makes this an amazing pump! My only gripe is that the gauge on it has PSI and Bars of pressure. It’s not easy to get it perfectly aimed at you which side you wanted to see. PSI is what I care about while others may want Bars. If that part could rotate so you could read what you care about without contorting yourself to read the gauge would be awesome! It seemed every time I’d put it on, Bars would be facing me.",
      "rating": 5.0,
      "verified": true,
      "author": "Christian",
      "helpful_votes": 0,
      "publication_date": 20200606
    },
    {
      "title": "Inaccurate Pressure Readings...",
      "text": "At first glance, it seems extremely promising. But I used another tire pressure gauge which showed that the readings were 20 psi lighter than what was showing on this item. By that reasoning alone, I cannot recommend this tool. Perhaps it’s best suitable for road bikes, but not for your mountain bikes. Also, it takes quite a bit of strength and energy to pump air into a tire. Took me about 10 minutes when it should have taken 1-2 minutes.",
      "rating": 2.0,
      "verified": true,
      "author": "Gonzo",
      "helpful_votes": 0,
      "publication_date": 20200506
    },
    {
      "title": "Elegant and functional",
      "text": "First, I’ve given this a try and while the size will make it challenging to get to some of the higher PSIs the convenience of having the hose attachment makes it much easier to use than most pumps. This is a beautifully designed tool and it feels very high quality. It will look good on your bike when you are not using it and you will enjoy thankful for it when you need it.",
      "rating": 5.0,
      "verified": true,
      "author": "Donald M. Bishop",
      "helpful_votes": 0,
      "publication_date": 20180711
    },
    {
      "title": "A man's pump",
      "text": "I purchased this for my daughter to take with her to college. The pump is very small and compact, so it can easily be taken with you. While the pump fits both US and European style bicycle fittings it takes a significant amount of strength to put 50-60 PSI into the European style tubes. I am not sure how it works on US tubes as they usually require a lower PSI and my daughter's bike is European.",
      "rating": 2.0,
      "verified": true,
      "author": "Edward D. Rouse",
      "helpful_votes": 5,
      "publication_date": 20161001
    },
    {
      "title": "Highly-Recommended! Built-In Pressure Gauge",
      "text": "Great compact, on-the-road pump (Schrader/Presta combo). Shown here in photo attached to Origin8 27.2 mm x 400 mm seatpost just under seat bag. I purchased separately on Amazon the \"ZTTO Aluminum Alloy CNC Machined Water Bottle Cage Holder Mount for 22.2 mm 25.4 mm 31.8 mm Handlebar Seatpost\" which is how it's attached behind the seatpost under the seat bag. The pump includes an inline pressure gauge which works and is very helpful for getting correct inflation on the road without needing to carry a separate pressure gauge. High-quality precision-manufactured item at a good price. Highly-recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Gilbert L. Standen",
      "helpful_votes": 0,
      "publication_date": 20180621
    },
    {
      "title": "I highly recommend it. Pros",
      "text": "By far the smallest and lightest pump I've ever had. I highly recommend it. Pros: -lightweight, ergonomic - can fit in any travel case, bag, etc. -has a handy pressure gauge -compatible with schrader and presta valves, easy to interchange -easy to pump -good customer service and support Cons: -this is getting pretty picky but I kinda wish the connector was a bit more flexible in the middle (ends are flexible). It needs to be straight/rigid in the middle for the gauge, which I would way rather have than the flexibility but there ya go. Very little wrong with this.",
      "rating": 5.0,
      "verified": true,
      "author": "Bski",
      "helpful_votes": 0,
      "publication_date": 20160724
    },
    {
      "title": "Well made and compact Air Pump",
      "text": "Pump is made of metal, screw fittings are metal, and rubber end caps protect the metal and threads. The bracket that is included was not useful for me, as more hardware is required. If you use your bike for commuting on campus and leave your bike at a rack, don't leave your air pump in the bracket. It will get stolen. This air pump is small and fits nicely into my backpack. I would say a solid 4.35 stars, but amazon only let's me select whole stars. Made in Taiwan, and this is a good thing.",
      "rating": 4.0,
      "verified": true,
      "author": "Joe User",
      "helpful_votes": 0,
      "publication_date": 20180928
    },
    {
      "title": "Great Pump, easy to use.",
      "text": "This is a great pump, easy to use and made very well. I've used it a couple of times and it works very well, when you screw it on the valve it wont come off as you pump and as you back it out it doesn't lose that much air if you're quick about it. Honestly I think this pump looks too good and it'll be stolen if I leave it on my bike all the time. I just hope it lasts a long time..so I'll update if it doesn't.",
      "rating": 5.0,
      "verified": true,
      "author": "Darian",
      "helpful_votes": 0,
      "publication_date": 20200629
    },
    {
      "title": "Great travel pump",
      "text": "I used this pump to inflate my road bike tires, 700 x 25 with max 120 PSI. Starting low, around 30 PSI and working up to 90. I noticed the pump works easily to around 50-60 PSI, then gets much more difficult to pump. The body of the pump itself is a little difficult to hold on if your hands are wet / sweaty due to the amount of effort it takes to keep pumping up to 90 PSI. Overall it’s a great little pump for on the go; lightweight, solid construction, and I love the built in gauge.",
      "rating": 4.0,
      "verified": true,
      "author": "Teddy I",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "Perfect road pump!",
      "text": "I've had a few Topeak pumps in the past, but hated how big and \"loud\" they appeared on my road bike. I went for matte black PBT pump and absolutely love it—the small logo, small mount footprint—it blends in with the frame beautifully. Tried both presta and shrader valves, and they work flawlessly. And the in-line gauge is pretty nifty.",
      "rating": 5.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 0,
      "publication_date": 20200629
    },
    {
      "title": "Pro Bike Tool Bike Pump",
      "text": "I love it. This bike pump seems well made. It is small, compact, lightweight, attractive and fits securely to my road bike. Hopefully, it will work well if and when I ever need it. The vendor also emailed explicit instructions as to its use - the connecting hose is stored inside the actual pump and must be removed and screewed onto the other end (presta or schraeder) - it's a very simple procedure. It has two end caps to keep out road debris.",
      "rating": 5.0,
      "verified": true,
      "author": "VNNCKC",
      "helpful_votes": 0,
      "publication_date": 20181109
    },
    {
      "title": "Just what's advertised - nice product!",
      "text": "I am not an avid biker, but I do own a Trek 7.9 FX Carbon Fiber hybrid. Every winter the tires go flat and this pump had the presta valve which I needed so I gave it a shot. Was a nice unit - very compact and solid materials. I had to fidget with the valve stem on the bike a little bit but after I got it dialed in the pump worked great and it stores very nicely - even with a bracket to attach to the bike (I assume) The packaging was nice and easy to open. I'm very happy I now have a way to inflate presta or schrader valves.",
      "rating": 5.0,
      "verified": true,
      "author": "Friyet",
      "helpful_votes": 0,
      "publication_date": 20200602
    },
    {
      "title": "You’ll wear yourself out using this pump.",
      "text": "This pump is terrible. My wife had a flat and it took 30 minutes to inflate after patching the tube. Ergonomically, it’s very hard to grip and you have to apply a lot of pressure to inflate. In addition, I pinched my finger while trying to use it. Lastly, the PSI meter kept fluctuating the whole time I was inflating the tire. It’s light and looks nice but I NEVER want to use it again.",
      "rating": 2.0,
      "verified": true,
      "author": "DTH",
      "helpful_votes": 0,
      "publication_date": 20200601
    },
    {
      "title": "Do not recommend!",
      "text": "I worked with this product for a couple of months and unfortunately I'm outside the return window. If your recommended tire pressure is 80 p.s.i., common for Presta valve tires/bikes, and you want to get a major workout, this pump is for you! Fairly easy to use to inflation pressures up to 40 p.s.i., but effort required to inflate beyond that pressure is extremely high. I'm assuming anyone but the strongest people would have difficulty inflating their tires to the recommended 80 p.s.i.",
      "rating": 1.0,
      "verified": true,
      "author": "Allan Cohn",
      "helpful_votes": 0,
      "publication_date": 20200726
    },
    {
      "title": "Flexible connecting hose for the win!",
      "text": "Compact, sturdy, and with the flexible hose that screws onto the tire valve makes pumping easier than ever with a handheld pump of this size. The gauge is helpful for tire pressure measurements rounded to the nearest 10 in a pinch without disconnecting the pump. Inflated to 70psi easily on my Brompton. The stock Brompton pump is expensive but mostly for looks. When screwing onto and off tire valve, very minimal air loss. So far this pump is a winner.",
      "rating": 5.0,
      "verified": true,
      "author": "B. A. Canright",
      "helpful_votes": 0,
      "publication_date": 20200509
    },
    {
      "title": "Nice pump, but flimsy mount",
      "text": "Pump is nice, build quality seems high, and it does what it's supposed to. It takes a fair amount of work to get up to high pressure, but you knew that--it's a lightweight pump to carry, not a floor pump. The nice air gauge isn't very precise, but you knew that too. The only downside I've found is that the mount isn't stiff enough, and on fast downhills on bumpy roads (especially dirt roads), the pump slaps the frame rather loudly on every bump. I guess I'll have to epoxy a little bit of rubber to the bottom of the mount...but I shouldn't need to!",
      "rating": 4.0,
      "verified": true,
      "author": "Brad Compton",
      "helpful_votes": 0,
      "publication_date": 20170820
    },
    {
      "title": "Lightweight, efficient, & quality workmanship.",
      "text": "Very light, easy to use, excellent build quality. The insert that fits in side of the pump has such a tight clearance that are can't escape as it's going in except through the hole in the insert. The volume it pumps is also very good, it does not take a very long time to pump up a tire from flat. I wonder if they will make a titanium version... :}",
      "rating": 5.0,
      "verified": true,
      "author": "tman14",
      "helpful_votes": 0,
      "publication_date": 20190209
    },
    {
      "title": "It’s nice. It works. But...,",
      "text": "Compact. Solid. Finish is nice. It works. Execution is bit off. The hose attachment doesn’t swivel at the end, so you have to turn the whole unit when twisting it onto the valve stem. And you can’t just twist on the hose attachment by itself, because it just leaks air.",
      "rating": 3.0,
      "verified": true,
      "author": "Nonze",
      "helpful_votes": 0,
      "publication_date": 20180922
    },
    {
      "title": "Indespensible",
      "text": "I can use this pump as my everyday pump without having to break out a more expensive one in my shed. Pumping is easy and it is pretty accurate when it comes to air pressure. I carry it in my fanny pack with no issues, as I don't have a water bottle cage on my bike, and with this and an extra tube and wrench, I never have to worry about getting a flat on the road ever again. I don't have one bad word to say about this pump. If you are in the market for a new pump, look no further.",
      "rating": 5.0,
      "verified": true,
      "author": "I read and write",
      "helpful_votes": 0,
      "publication_date": 20200624
    },
    {
      "title": "Pump :) ,Mount :)",
      "text": "After killing a tube valve with a rigid mini pump I got this flexible hose type and couldn't be happier. Not so happy with the mount which broke after 6 months / 1500 miles. Fortunately only one tab failed so I did not lose the pump but now have no way to mount it. Wish I could get another mount. Edit: now 5 stars for outstanding customer service. A replacement mount was sent to me by the seller. The new mount looks to be made from a different material so hopefully it will not fail like the first one. Thank you ProBikeTool.",
      "rating": 5.0,
      "verified": true,
      "author": "Rosedale Technical Institute",
      "helpful_votes": 0,
      "publication_date": 20190114
    },
    {
      "title": "AMust Have for Serious Riders",
      "text": "I love this tire pump. The built-in air gauge is really, really nice. The whole unit is very lightweight and compact, and the finish gives it a quality feel and look. If you are sick and tired of fiddling around with big pumps that are clumsy, heavy and inaccurate, get this pump. Pro Bike Tool has great customer service and they are truly interested in making your riding experience all it can be.",
      "rating": 5.0,
      "verified": true,
      "author": "Charles Anthony",
      "helpful_votes": 3,
      "publication_date": 20170424
    },
    {
      "title": "Very efficient, nicely designed and well built little pump",
      "text": "Very cleverly designed and well built, super light, takes half the number of strokes than the Vibrelli mini bike pump, while still being lighter. About 280 strokes to inflate a 4in tire. An absolute keeper. Time will tell if durable but so far happy customer.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul",
      "helpful_votes": 2,
      "publication_date": 20170405
    },
    {
      "title": "Great/AMAZING product",
      "text": "This must be one of my favorite purchases of all time. I’ve always had trouble with inflating my tires at the gas station but with this pump I’m saving time and money. This inflated my tires better than a machine it’s insane. 10/10 would purchase for a friend and would recommend for any bike lovers !! Easy to use and a beautiful design !",
      "rating": 5.0,
      "verified": true,
      "author": "Erika Alexandra Paredes",
      "helpful_votes": 0,
      "publication_date": 20190830
    },
    {
      "title": "Excellent and very clever",
      "text": "Other reviewers cover the usability and the fact that this thing is great. I'm going to cover the thing you actually need to know - it's not missing parts when it arrives. When this thing arrives, you're going to have cold sweats believing the flexible tube portion didn't bother getting in the clamshell. Nope, it's hidden inside the body of the pump unit playing side-and-seek from you. You're welcome. Happy cycling!",
      "rating": 5.0,
      "verified": true,
      "author": "I.B. Miller",
      "helpful_votes": 0,
      "publication_date": 20190105
    },
    {
      "title": "Awesome bike tool",
      "text": "Just got into mountain biking and sadly experienced several flats during long rides. Purchased this “portable” pump/inflator to attach to my bike. This is a great product, compact, performs exactly as advertised and is very reasonably priced for such a great piece of equipment. I ride 20 to 50 miles a day and never have a concern about experiencing a flat as I have a spare tube and my Pro Bike Tool Bike Pump on board. A great experience, delivered lighting fast amd free shipping. What’s not to love? I can highly recommend this product and this company.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim F",
      "helpful_votes": 0,
      "publication_date": 20200527
    },
    {
      "title": "Don't bother",
      "text": "Doesn't inflate easily AND removes the presta valve when unscrewing, which completely deflates the tire. Tried multiple times. I had very high hopes for this but it sucks",
      "rating": 1.0,
      "verified": true,
      "author": "Asketes",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "I wouldn’t buy this again",
      "text": "The pressure gauge doesn’t work at ALL, on my road bike. The Attachment will not stay strewed onto the bike. When i am pumping the pump becomes harder to use even thought the tire is not half way filled up. Also while pumping the attachment begins to fall off the tire and release air. This product is good for home use. Terrible if you’re out and need a quick fix to continue or finish your ride. I feel like i should return this and get a better pump.",
      "rating": 2.0,
      "verified": true,
      "author": "Pree-fit",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "PERFECT!!",
      "text": "this pump is great!! i had to return 2 other different ones until i found this one. it's great that it has a locking mechanism. took less than a minute to get fully pumped and going. nice and compact! the separate ends is ingenious, no fumbling around with attachments or messing with the nozzle while air is leaking out. buy this!! cheaper ones are just that.....cheap! i started out wanting to save a little money and ended up wasting time returning 2 other cheap ones. you get what you pay for!",
      "rating": 5.0,
      "verified": true,
      "author": "Claudia Yang",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "The integrated gauge is useful.",
      "text": "Very well made pump, yet it might be a little heavy if you're planning to carry it on your bike. I bought it to have a compact portable pump when I do not want to bring along my big pump. I do appreciate that it is well made, since most pumps this size are very fragile. The integrated gauge is useful.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20170416
    },
    {
      "title": "Great little pump",
      "text": "This was a great purchase. I needed a pump to carry on my bike and this one does the job perfectly, it is light weight, it inflates the tires quickly and it comes with a holder which is easily installed on one side of the water holder. I’m more than satisfied with this product and I would totally recommend it to a friend!",
      "rating": 5.0,
      "verified": true,
      "author": "Giovanna V.",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "Perfect for Emergency Situations",
      "text": "Not the cheapest product but the quality doesn't lie. Compared to my old portable hand pump, this one does put out more air in a single pump. The gauge is also very handy when wanting to know your tire's pressure. It's also very lightweight and easy to carry around. It comes with a bike attachment but I haven't had the chance to test it out as I mainly ride a BMX.",
      "rating": 5.0,
      "verified": true,
      "author": "Timothy Sely",
      "helpful_votes": 0,
      "publication_date": 20181215
    },
    {
      "title": "Works surprisingly well",
      "text": "I tested this out before needing to use it on the road. It worked surprisingly well. There were no air leaks and pretty quickly got me to 60 psi which I checked against my floor pump and it was within a couple psi. It did seem to get a little warm, not too bad, and it's definitely not the smallest or lightest pump, but to me the frustration saved by having a gage, no leaks and not having to pump a million times are worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert A. Norris",
      "helpful_votes": 2,
      "publication_date": 20170517
    },
    {
      "title": "great pump but...",
      "text": "The best pump I've ever seen. The quality and attention to details is amazing but the pressure gauge is useless though. In order to make it show something you need to pump your motorbike or car because the pressure of a regular mountain bike is not enough to make it move. Apart from this pump is the best on the market.",
      "rating": 4.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 0,
      "publication_date": 20191116
    },
    {
      "title": "Removes Presta Valve Cores",
      "text": "On the surface this is a very nice looking and well built pump. Unfortunately it doesn’t like to work on my presta valves. If I screw it on far enough to fill the tire/read the pressure it removes the valve core when I take it off which lets out all the air and breaks the tubeless seal. Thankfully I had a CO2 pump to fill the tire quickly enough to reseat the bead. I wish this pump worked well because it’s quite small and looks great but it just doesn’t.",
      "rating": 2.0,
      "verified": true,
      "author": "Ritch Percival",
      "helpful_votes": 0,
      "publication_date": 20200628
    },
    {
      "title": "It broke the first valve it touched, will not return to stowed position once used.",
      "text": "What an utter piece of junk. I'm not returning it so I can rate it. From rubber stoppers that won't stay, to a pump handle that won't screw down, to breaking the valve out of the first presta stem it touched, this is an unacceptable product. It's worth the cost just to warn others.",
      "rating": 1.0,
      "verified": true,
      "author": "Ash Kalb",
      "helpful_votes": 3,
      "publication_date": 20170227
    },
    {
      "title": "Excellent Pump!",
      "text": "I’ve went MTB twice this week and needed it both times, so it’s already paid for itself. It’s easy to use and the extended tubing is so much easier than trying to hold the pump up to the stem and trying to pump. I also received an email from Pro Bike the day it was delivered giving me tips on how best to use it. It’s those little details that keep customers coming back. Thanks.",
      "rating": 5.0,
      "verified": true,
      "author": "BB",
      "helpful_votes": 0,
      "publication_date": 20200616
    },
    {
      "title": "Impossible to inflate to 100 psi",
      "text": "This pump at first looks very solid and well built. Trying to pump your road bike to 100 psi will cramp your arms and chest as the product does not have any compression ratio built to it. By the time you reach 50 to 60 psi, you're already exhausted, and trying to finish off to 100 psi is almost not possible. I would look into other hand pumps where it has compression ratio built-in, otherwise get a CO2 canister.",
      "rating": 2.0,
      "verified": true,
      "author": "K. Huang",
      "helpful_votes": 0,
      "publication_date": 20190716
    },
    {
      "title": "Hard to inflate",
      "text": "The wife has a Trek Silque Road Bike and the tires are almost impossible to get to 90 PSI using this pump. We have it as a back up for when she is out on training rides and as a back up during her Ironman events. It will keep you going, but you will need a CO2 cartridge or foot pump to get up to full pressure. The dual valve stem adapters and its internal storage all worked well.",
      "rating": 3.0,
      "verified": true,
      "author": "Michael Wenek",
      "helpful_votes": 0,
      "publication_date": 20191110
    },
    {
      "title": "I had a frame pump I loved but it has been displaced by a second water ...",
      "text": "I had a frame pump I loved but it has been displaced by a second water bottle cage. Leary of traveling with just CO2 cartridges, I'm more reassured with a pump and bought this one based on the reviews. I had my bike shop mount it for me while getting a tune up and they were really skeptical about the pressure claims on the package but tested it out and found that although they couldn't get nearly as high as claimed, they could get as high at 80, much higher that they originally expected.",
      "rating": 4.0,
      "verified": true,
      "author": "WoodChuck",
      "helpful_votes": 0,
      "publication_date": 20161020
    },
    {
      "title": "Pulls valve core out of the stem of the inner tube.",
      "text": "I think this pump has a big problem with the threads. It pulls the Valve cores out of stems every time I try to use it (total 3 I used to replace inner tube). Very hard to inflate. Not recommended at all.",
      "rating": 1.0,
      "verified": true,
      "author": "Sang Lee",
      "helpful_votes": 0,
      "publication_date": 20200719
    }
  ],
  "product_meta": {
    "title": "PRO BIKE TOOL Bike Pump with Gauge Fits Presta and Schrader - Accurate Inflation - Mini Bicycle Tire Pump for Road, Mountain and BMX Bikes, High Pressure 100 PSI, Includes Mount Kit",
    "rating": 4.5,
    "feature_bullets": [
      "QUICK PUMPING POWER & ACCURATE INFLATION - High pressure 100 psi/6.9 bar. Oversized piston design enables this portable pump to reach riding pressure with 30% fewer strokes compared to conventional mini bike pumps. Flexible air hose design works with awkward or tight valve placements. Air hose cleverly stored in handle to maximize compactness. The hose features an INTEGRATED PRESSURE GAUGE so you can accurately pump to your desired air pressure!",
      "DURABLE, COMPACT & LIGHTWEIGHT - Stunning design and finish. Superior quality CNC machined aluminum alloy with durable and precise parts - THIS PUMP IS BUILT TO LAST! 8.75 inches long and weighing in at only 4.5oz. Check out our ‘How to Video’ in the ‘Related Video Shorts’ section. Please NOTE this mini bike pump with gauge is not a replacement for a ‘full size floor pump’ which will deliver larger air volume per pumping stroke due to it’s much bigger size barrel.",
      "SUPER TIGHT PRESTA & SCHRADER CONNECTION WITH NO LEAKS - Easy switching between Presta & Schrader valves thanks to innovative hose design - No adapters needed! Secure thread-on valve connection, enables a super tight seal with no air leaks and NO MORE DAMAGED BIKE TIRE VALVES! Not compatible with non threaded valve extenders. For Presta valves with removable cores, extra care should be taken to tightly screw the core into the valve stem.",
      "NO PUMP RATTLES OR LOST PUMP with our safe & secure frame mount bracket with extra security strap. Pre-drilled holes in bike frame required for installation of pump mount.",
      "‘BEST BUY AWARD WINNER’ BY OUTDOOR GEAR LAB, an Amazon Verified Expert - We’re very proud to have been awarded their ‘Best Buy Award’ for ‘quality products that offer the most bang-for-the-buck’ in their Best Bicycle Frame and Mini Pump Review."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "8.75 x 1 x 1 inches; 4.5 Ounces",
      "Department": "Unisex",
      "Date First Available": "May 17, 2015",
      "Manufacturer": "Pro Bike Tool",
      "ASIN": "B00XLGKT10",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Frame-Mounted Pumps",
      "Accessories",
      "Outdoor Recreation",
      "Sports & Outdoors",
      "Bike Pumps",
      "Cycling"
    ],
    "price": 29.98
  }
}