{
  "website_summaries": [
    {
      "verdict": "Netatmo still needs work, but it breaks new ground with facial recognition and shows enough prowess with that feature to be worth a look for anyone interested in cutting edge camera tech.",
      "pros": [
        "The Netatmo Welcome successfully implements facial recognition in a consumer product for the first time",
        "It has cleverly customizable notifications based around that feature and the specs to keep up with the competition as a connected camera"
      ],
      "cons": [
        "In practice, it doesn't keep up with the competition as a webcam or a security cam",
        "The camera is slow at everything",
        "The live feed lags, the notifications are delayed, and it takes awhile to learn faces"
      ],
      "aspects": {
        "Features": 7.0,
        "Usability": 8.0,
        "Design": 7.0,
        "Performance": 6.0
      },
      "publication_date": 20150702,
      "rating": 7.0,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Tried for two years to make this work. It goes in the trash tonight.",
      "text": "This is the biggest ripoff piece of junk ever scammed on the world. At best, this will work 37 seconds out of the year. After that, you're going to be reading incoherent rambling support articles that BARELY apply to your case and searching endlessly online for a way to contact the manufacturer; who I can only assume doesn't really exist. Stay awa from this overpriced, unusable, nonsensical product and buy something else. There's myriad solutions that will work. OH and the design of this thing is dreadful. Where the hell am I supposed to put this metallic dildo camera?",
      "rating": 1.0,
      "verified": true,
      "author": "clayton gibson",
      "helpful_votes": 15,
      "publication_date": 20170707
    },
    {
      "title": "Mobile app settings ineffective",
      "text": "The camera sends alerts far too often, and for the wrong reasons. The software for the phone has two settings that don't work: a) ignore pets. It sends me an alert every time one of my cats walks in front of the lens, so that setting isn't functioning. b) don't send alerts when I'm at home. It sends me alerts all the time, regardless of whether I'm home or not. None of them are alerts that involve someone entering my home, which is why I bought the camera. As it is, it's worthless. Really cannot recommend the camera as is, with different software it might be useful.",
      "rating": 1.0,
      "verified": true,
      "author": "HungryCats",
      "helpful_votes": 7,
      "publication_date": 20180408
    },
    {
      "title": "They don’t last...go another direction.",
      "text": "I bought 3 of these and the outdoor camera. Of the 3 inside cams, 1 has been replaced, the others have quit working, mostly with the wireless, even when next to the router. I have 2 dogs, a yellow and a black lab. The yellow lab is recognized, the black lab is not. Setup is simple, but notifications never fully worked how I would of expected. The outside one has now quit working as well. I give up. Support is overseas. Well try Nest next I guess.",
      "rating": 2.0,
      "verified": true,
      "author": "Jeffrey L Kirk",
      "helpful_votes": 0,
      "publication_date": 20191130
    },
    {
      "title": "It works! Software is fine and after sales service a bit slow but reliable.",
      "text": "The cámara does what it promises and very well, I bought three at the end and all work seamlessly, my family is identied and not recorded and new faces are instantly announced. Motion is detected and in most cases may animals are recognized. It’s stands alone, no need to buy other things, it connects to your WiFi and I have watched my house from around the globe.",
      "rating": 5.0,
      "verified": true,
      "author": "Alonso Carral Cuevas",
      "helpful_votes": 3,
      "publication_date": 20180304
    },
    {
      "title": "So far has met most of my expectations",
      "text": "I purchased this camera when it first came out. I've been very please with the camera so far. Netatmo has been very quick to release firmware updates and the technical support has been great. I have seen were people have complained about the heat issues, but it's more like warm to the touch. I do wish that you can somehow move data to a NAS like Synology so you can archive the videos. I like the alerts as well. Will be purchasing another one soon",
      "rating": 5.0,
      "verified": true,
      "author": "S. Lockhart",
      "helpful_votes": 5,
      "publication_date": 20150927
    },
    {
      "title": "I wanted to love this",
      "text": "This camera has almost everything I want, private local video storage, notifications, a good mobile app, home kit support. However, It lacks HDR which makes it completely useless for a room that has almost any natural light coming into it (e.g. windows). Due to the wide angle lens, no matter how I placed the camera the picture was washed out due to the light coming in from the windows. It made people completely unidentifiable which neutralized one of its most interesting features in facial detection. If they come out with a v2 with HDR and a better camera sensor it will be a day 1 purchase for me.",
      "rating": 3.0,
      "verified": true,
      "author": "Ian M.",
      "helpful_votes": 0,
      "publication_date": 20190525
    },
    {
      "title": "Works well.  Takes a while to train it.",
      "text": "Works fairly well. Takes a lot of training to recognize people well. Still often detects “motion” instead of people. To be fair, we probably have it in a sub optimal position for what it’s designed for (we don’t have a convenient spot for or main entrance, and it’s a bit far from the place people walk in). I wish it would expose a “Person Arrived at Home” action in IFTTT (it supports away, but not a home).",
      "rating": 4.0,
      "verified": true,
      "author": "Jesse",
      "helpful_votes": 0,
      "publication_date": 20190618
    },
    {
      "title": "Great camera",
      "text": "I’ve recently bought a second one of these amazing cameras to monitor my elderly father living by himself. I got the first one about 8 months ago for home and have found it very reliable and accurate in face-recognition and detection. The software is easy to use and allows you to view from anywhere with internet. I use it to make sure my teens get home on time, and as a peace of mind for security when we’re not at home.",
      "rating": 5.0,
      "verified": true,
      "author": "JM",
      "helpful_votes": 0,
      "publication_date": 20190920
    },
    {
      "title": "Great camera, too expensive",
      "text": "I have been pleased with this camera. I use it with HomeKit mostly, but also use the app for the motion detection stuff. It is a pretty cool camera, with FTP storage, and the app is good. The price at nearly $200 though is a joke. This camera should not cost more than $99. Their outdoor camera is also way over priced at $300. When the outdoor camera price drops below $200 I will probably buy one because of the good experience I have had with this indoor camera.",
      "rating": 4.0,
      "verified": true,
      "author": "freerock",
      "helpful_votes": 0,
      "publication_date": 20190610
    },
    {
      "title": "good daddy cam",
      "text": "exceeded expectation. bought this to keep an eye on my father's caregiver. its been doing its job. minus 1 star however because every now an then the camera will disconnect and takes about 20minutes to connect again. this has happened 3x in few months. also cannot zoom in. but vid and voice quality is good.",
      "rating": 4.0,
      "verified": true,
      "author": "k",
      "helpful_votes": 8,
      "publication_date": 20151105
    },
    {
      "title": "No Monthly Fees!",
      "text": "The main reason I went with Netatmo is because there are no monthly fees for me to go back and watch videos of anything that may be happening at my home. I also wanted to try their face recognition technology, which I have not seen from any other cameras when I was doing my research. It's a great feature! I can adjust the setting to turn off notifications based on when it sees me and then the will turn on when I leave. For the price and no monthly fees I'm very happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Fernando M.",
      "helpful_votes": 5,
      "publication_date": 20150904
    },
    {
      "title": "Notification wild and semi-decent camera",
      "text": "Needs software update. Need notification control in HomeKit. Would be great to stop notifications once your home. No setting in HomeKit not netatmo Security app. Needs a better camera, but it’s not a bad buy. Just needs better software.",
      "rating": 3.0,
      "verified": true,
      "author": "C. Lopez",
      "helpful_votes": 2,
      "publication_date": 20190314
    },
    {
      "title": "it's good mostly",
      "text": "The camera works really well, except... there are issues with facial recognition. It does not log the new people that came into the house as \"unidentified\" (they are completely ignored) but records all the people on TV as \"unidentified\". Even the ones on my computer screen get noticed by the machine. And you can't disable facial recognition when annoyed by all that. I think it would be great if Welcome allows us to specify an area or areas within the view that facial recognition function should ignore.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20151231
    },
    {
      "title": "This is a fantastic product. It recognizes faces",
      "text": "This is a fantastic product. It recognizes faces, so even when we are not home, we know when ourvteen are. The downside it it does not integrate into Amazon Alexa as does the Netatmo weather. I hope an issue they will adjust. There also seems to be no alarm in the app sounded for a stranger as it sounds for everyone.",
      "rating": 4.0,
      "verified": true,
      "author": "Lorelei",
      "helpful_votes": 0,
      "publication_date": 20180221
    },
    {
      "title": "Decent camera, simple set up. Can use USB chargers.",
      "text": "I dig it. It was simple and easy for me to use. There is about a 9 second delay for lag, but I just use this to watch my dog and cat. Not good enough to monitor for accidents or so though. The ports on the device feel pretty cheaply made, like knock off quality, and the power adapter a generic Chinese one. Eh it works though.",
      "rating": 4.0,
      "verified": true,
      "author": "Mykii",
      "helpful_votes": 0,
      "publication_date": 20180719
    },
    {
      "title": "Great security product!",
      "text": "It does what it says it does. I actually love it! I’m able to watch my kid from the office and keep an eye on the nanny. The facial recognition is cool. It does get a little annoying when it recognizes faces on TV but you can just delete them as unknowns at the end of your day.",
      "rating": 5.0,
      "verified": true,
      "author": "Kanyiva",
      "helpful_votes": 0,
      "publication_date": 20180426
    },
    {
      "title": "Easy set up",
      "text": "I love this camera, I bought a second one. The picture is really good. I can look at it away from home. Can't get a better deal then this camera.",
      "rating": 5.0,
      "verified": true,
      "author": "Rita A. Maschmeier",
      "helpful_votes": 0,
      "publication_date": 20191024
    },
    {
      "title": "No warranty support",
      "text": "My security camera stopped functioning properly. The picture background color is red. Keep getting motion detection alarms.Camera is 4 months old. Went to the Netatmo web site, there is no way to contact them reguarding warrenty. Buyer beware on all Netatmo products.",
      "rating": 1.0,
      "verified": true,
      "author": "Douglas E.",
      "helpful_votes": 0,
      "publication_date": 20190712
    },
    {
      "title": "and it clearly satisfied my needs",
      "text": "the size is smaller than I though, and it clearly satisfied my needs, notification for face detected, so that I don't have to watch the recording, even x4 fast-forward still a waste of time, to monitor what happened in my apartment. the con as per what have been shared by others, delayed 'live' monitoring, perhaps 10 seconds, quality of video image does not let you feel it's 1080. if you want to have notification of people detected in your place, go for this",
      "rating": 5.0,
      "verified": true,
      "author": "Wang Tao",
      "helpful_votes": 0,
      "publication_date": 20171024
    },
    {
      "title": "It has problems connecting to AT&T networks.",
      "text": "The camera would not work on my AT&T WiFi. So I took it to my Florida home where I have Centurylink and it works fine there.",
      "rating": 4.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20190602
    },
    {
      "title": "\"Love The Design\"",
      "text": "I love the design! It blends in nicely with where I have it setup & people don't even know it is a security camera. The picture quality is good & I like that I can save videos from the app to my phone. Sometimes watching videos may take a few seconds to load before they start to play but it may just be my wifi. I actually like to use watch on my desktop from the netatmo website while I'm at work & it will allow me to download videos right to my computer.The face recognition is very cool & getting alerts of when each of my family members are home I find very useful.",
      "rating": 5.0,
      "verified": true,
      "author": "Marcella Minoia",
      "helpful_votes": 2,
      "publication_date": 20150728
    },
    {
      "title": "Great product, great price.",
      "text": "Bought this on a recommendation. It is nice, but slow. I bought it right before moving, so I haven’t had a ton of time to learn how to best use it. Main benefit is that the video recorded locally to the SD card and can be configured to where ever you want to send it.",
      "rating": 4.0,
      "verified": true,
      "author": "Tim Malone",
      "helpful_votes": 0,
      "publication_date": 20170930
    },
    {
      "title": "Five Stars",
      "text": "This is the best internal security camera on the market. You can even use them with POE with an adapter. It would be nice if you could rotate the image in settings and they sold a way to wall mount it. Love the homekit support. Love how you. can choose if you want cloud or not.",
      "rating": 5.0,
      "verified": true,
      "author": "Raymond",
      "helpful_votes": 0,
      "publication_date": 20180422
    },
    {
      "title": "HomeKit totally worth it.",
      "text": "The face recognition AI is very useful. I really enjoy the cameras configuration and that I can record when I need with HomeKit.",
      "rating": 5.0,
      "verified": true,
      "author": "FJ",
      "helpful_votes": 0,
      "publication_date": 20200917
    },
    {
      "title": "Needs some streamlining, but a good start!",
      "text": "Facial recognition is surprisingly good. I know there are cameras out there with better picture quality, faster speed, less lag, but the high cost subscription service that comes along with them is a dealbreaker for me. I like how it recognizes me (and other people I specify) and then won't record those events. Perfect if you're worried about privacy. Fun for spying on my pets!",
      "rating": 4.0,
      "verified": true,
      "author": "Tom",
      "helpful_votes": 0,
      "publication_date": 20161230
    },
    {
      "title": "Nice quality and good views.",
      "text": "It’s a really nice cam with motion and human sensors. Flip over to setup the camera via Bluetooth and automatically setup the WiFi. But the power port is too old and you have to remember the HomeKit code. Hopefully they can update the camera with USB-C powered and NFC to pair.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric",
      "helpful_votes": 0,
      "publication_date": 20190805
    },
    {
      "title": "Must-have gadget",
      "text": "I thought I made a mistake that I bought this since in the beginning it poorly recognized our faces but eventually it improved: it's pretty accurate in doing so to about 99 percent of the time. Pretty impressive! It's fun to have it now. It's my one of those must-have gadgets. Update: Over a year after, I still love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Christian N",
      "helpful_votes": 0,
      "publication_date": 20160316
    },
    {
      "title": "Installed very easy. The app works great",
      "text": "Installed very easy. The app works great. Picture quality is subpar No mic on app to communicate. If this had the lens and quality of the Kodac security camera it would be almost perfect. But I do love the no subscription costs. Will probably return it",
      "rating": 3.0,
      "verified": true,
      "author": "Infinitiboi",
      "helpful_votes": 0,
      "publication_date": 20160226
    },
    {
      "title": "Great for the price,  needs to integrate with other products",
      "text": "Great camera and very good facial recognition. But it takes a lot of image verification for it to predict accurately. I wish there was more automation integration. The phone app is OK, but it would be a great product if it worked with smart home automation systems.",
      "rating": 4.0,
      "verified": true,
      "author": "George Rusak",
      "helpful_votes": 0,
      "publication_date": 20171227
    },
    {
      "title": "Great indoor cam!",
      "text": "I like the facial recognition feature the most. You have to be cautious where you place it though so that it gives you the most consistent results. If light is blinding it like too much sun directly hitting it, it will not work effectively. Great addition to your home security.",
      "rating": 5.0,
      "verified": true,
      "author": "Richie R",
      "helpful_votes": 0,
      "publication_date": 20180427
    },
    {
      "title": "Worth it.",
      "text": "So far it’s great. The facial recognition is actually pretty good. It takes some training though, and it’s certainly not flawless, but it’s definitely does what it purports to do. I can’t wait for the alarm to come out!",
      "rating": 5.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 0,
      "publication_date": 20190531
    },
    {
      "title": "The best thing about it is the design",
      "text": "Video has glitches, takes multiple attempts to turn on/off from app. The best thing about it is the design.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180610
    },
    {
      "title": "How to install it???",
      "text": "It was frustrating to get very little instruction with this product and if I could use it at all, perhaps I could give it more stars?",
      "rating": 1.0,
      "verified": true,
      "author": "Glenda Isbell",
      "helpful_votes": 0,
      "publication_date": 20180603
    },
    {
      "title": "Really bad product.",
      "text": "Had lots of problems, the wifi does not work, no troubleshooting information, no quality control, really a very bad product.",
      "rating": 1.0,
      "verified": true,
      "author": "Daniel Emilio Bengtson.",
      "helpful_votes": 0,
      "publication_date": 20191115
    },
    {
      "title": "Good product",
      "text": "Works well. Had to tweak the notifications so I didn’t get them every time it spotted someone in the chair watching tv every few seconds, but that worked well. Good facial recognition.",
      "rating": 4.0,
      "verified": true,
      "author": "Lance B. Thigpen",
      "helpful_votes": 0,
      "publication_date": 20200802
    },
    {
      "title": "amazing camera, face recognition is fantastic",
      "text": "amazing camera, face recognition is fantastic, but sometimes not perfect ;-) anyway the camera it worth its price. the only cons is that the camera get really hot (phisically)",
      "rating": 5.0,
      "verified": true,
      "author": "Slawek",
      "helpful_votes": 0,
      "publication_date": 20170721
    },
    {
      "title": "2 year lifespan dont waste money",
      "text": "Don’t waste your money to this product it’s broken after 2 years i have two of them they broke after two years of usage piece of garbage",
      "rating": 1.0,
      "verified": true,
      "author": "cem tacir",
      "helpful_votes": 0,
      "publication_date": 20180710
    },
    {
      "title": "Replacement Netamo security camera",
      "text": "The replacement doesn't work either with our wifi settings and therefore have to return it as well . Pls refund us the initial payment of $185.- and also credit us the initial gift card amount of $60.- . Thanks, Sandra",
      "rating": 1.0,
      "verified": true,
      "author": "schwendtke",
      "helpful_votes": 0,
      "publication_date": 20180808
    },
    {
      "title": "Works really well.",
      "text": "Activity detection works really well. Not perfect but pretty good compare to dumb security cameras. Face detection seems to be pretty accurate so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Herve",
      "helpful_votes": 0,
      "publication_date": 20171122
    },
    {
      "title": "Never connected to my Wiffi",
      "text": "The camera looks cool. I it says in the description that it's easy to set up. I have been talking to a tech guy from Netatmo Welcome for over two weeks now trying to connect to my Wifi, but with out luck:-).",
      "rating": 1.0,
      "verified": true,
      "author": "hameyer",
      "helpful_votes": 0,
      "publication_date": 20190110
    },
    {
      "title": "HomeKit support?",
      "text": "Works good, but HomeKit support was promised and has yet to be delivered. HomeKit support is the reason I selected this product over competitors.",
      "rating": 3.0,
      "verified": true,
      "author": "deepknight",
      "helpful_votes": 0,
      "publication_date": 20180408
    },
    {
      "title": "Excellent product. ready for the app to start working ...",
      "text": "Excellent product. ready for the app to start working with some others a little better, but I am sure that will come in short time. The face identification is working great for an airbnb I have, and it is identifying well at night in low lights too. What I am looking for is a means to identify guests from their intitial check in with august.",
      "rating": 5.0,
      "verified": true,
      "author": "B",
      "helpful_votes": 0,
      "publication_date": 20171224
    },
    {
      "title": "bad",
      "text": "Failures. Do not download video from the camera which is more than 5 minutes.",
      "rating": 3.0,
      "verified": true,
      "author": "Shevchuk Taras",
      "helpful_votes": 0,
      "publication_date": 20180208
    },
    {
      "title": "I didn't like it in busier areas of my",
      "text": "Too many false identifications for me to reccomend. I have deleted my profiles multiple times. Overall a decent garage monitoring camera though. I didn't like it in busier areas of my house",
      "rating": 3.0,
      "verified": true,
      "author": "_justin",
      "helpful_votes": 0,
      "publication_date": 20151101
    },
    {
      "title": "Five Stars",
      "text": "great camera love that I get notified with face recognition..",
      "rating": 5.0,
      "verified": true,
      "author": "Melanie OConnor",
      "helpful_votes": 0,
      "publication_date": 20180610
    },
    {
      "title": "Great indoor camera",
      "text": "Good camera good quality packed with lots of features , I like the Facial recognization ,and no subscription fee.",
      "rating": 5.0,
      "verified": true,
      "author": "x3d101",
      "helpful_votes": 0,
      "publication_date": 20200424
    },
    {
      "title": "Ordered a replacement",
      "text": "First camera received was defective, would not connect to internet. Amazon promptly replaced.",
      "rating": 1.0,
      "verified": true,
      "author": "novahil",
      "helpful_votes": 0,
      "publication_date": 20190113
    },
    {
      "title": "Different color options would also be nice, along with a cloud archiving *option* - for ...",
      "text": "A unique product that works well, just requires an understanding of how to work the app. The facial recognition can take some patience to train. Also needs more configuration settings for additional users, such as feature restrictions. I will be buying another one of these. Different color options would also be nice, along with a cloud archiving *option* - for example iCloud drive.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20151126
    },
    {
      "title": "So far so good.",
      "text": "Not easy to setup initially with all the software updates but once it's up, all is good. Although I should comment, the device is pretty hot.",
      "rating": 4.0,
      "verified": true,
      "author": "Vincent",
      "helpful_votes": 0,
      "publication_date": 20171227
    },
    {
      "title": "Stable, good interpretation, reliable",
      "text": "Works perfectly with homekit. Good recognition of people. No false alarms until now ...",
      "rating": 5.0,
      "verified": true,
      "author": "Paolo",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "Works as advertised",
      "text": "Great at face recognition does tend to drop if wi go is not strong",
      "rating": 5.0,
      "verified": true,
      "author": "tlkflat",
      "helpful_votes": 0,
      "publication_date": 20180628
    },
    {
      "title": "Easy to setup",
      "text": "Love the ease of setup and the notifications in the app.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott",
      "helpful_votes": 0,
      "publication_date": 20161203
    },
    {
      "title": "Works great love",
      "text": "I have had it for about 2 months. Works great love it",
      "rating": 5.0,
      "verified": true,
      "author": "Paul D Walker",
      "helpful_votes": 0,
      "publication_date": 20171220
    },
    {
      "title": "Make sure to have Dropbox set up if you are going to want to keep an archive.",
      "text": "Very good facial recognition ... late on integration with Apple Home/Siri",
      "rating": 5.0,
      "verified": true,
      "author": "DCG",
      "helpful_votes": 0,
      "publication_date": 20180410
    },
    {
      "title": "This is a great camera. It took me 30 minutes to set ...",
      "text": "This is a great camera. It took me 30 minutes to set up not even. It detects faces very easily. I would recommend to anyone",
      "rating": 5.0,
      "verified": true,
      "author": "Corey",
      "helpful_votes": 0,
      "publication_date": 20180425
    },
    {
      "title": "Was okay for awhile.",
      "text": "Update. The Welcome seemed to be working okay, and then decided to stop recognizing people that had been coming and going in our house since we got it. It constantly indicates there is an unknown face and when I check it, it's someone that there's already a profile for. It also stopped being as sensitive like it used to be. I could enter the house and walk right by it and it never indicated that it saw me. I don't know what happened, but I stopped using it.",
      "rating": 1.0,
      "verified": true,
      "author": "Honest Review",
      "helpful_votes": 4,
      "publication_date": 20150725
    },
    {
      "title": "Five Stars",
      "text": "wow its wonderful easy to hook up and really beats canary very happy great product",
      "rating": 5.0,
      "verified": true,
      "author": "Lillian R. Ruehlman",
      "helpful_votes": 0,
      "publication_date": 20160612
    },
    {
      "title": "One of the best gizmos I've purchased in years!",
      "text": "I have to say this is one of the best products I've purchased in years in the \"gizmos\" category. If you are looking simply for a camera, this is probably not it. What sets this product apart is the facial recognition. I've been running it for months and it has never gotten the recognition and identification of a person wrong. It does have to be trained at the beginning but that's it. All the other gizmos I've purchased have ranged from nearly complete failures (CAO tags, Flics) to semi-failures (IFTTT). By the way, I have Welcome hooked up through IFTTT and into my high end home automation system. Now if every product worked this well!!",
      "rating": 5.0,
      "verified": true,
      "author": "Tahl Milburn",
      "helpful_votes": 3,
      "publication_date": 20161212
    },
    {
      "title": "stopped working",
      "text": "Bought it Dec 3, 2015. It has stopped working. Steady green light. Can not reset. Can not get to website. Contacted manufacture , they said its a broke. Can not return . Very expemsive camera for what little time it worked. Worked well while it worked.",
      "rating": 4.0,
      "verified": true,
      "author": "Bob B",
      "helpful_votes": 0,
      "publication_date": 20151207
    },
    {
      "title": "Five Stars",
      "text": "Love this security camera can recognize faces and getting rid of the false alarms",
      "rating": 5.0,
      "verified": true,
      "author": "EricaK",
      "helpful_votes": 0,
      "publication_date": 20180331
    },
    {
      "title": "- Beautiful product. - Face detect is OK",
      "text": "- Beautiful product. - Face detect is OK. But: - Very hot ~60 oC. - Very slow (5~10s) for detect.",
      "rating": 3.0,
      "verified": true,
      "author": "Le Tri Cuong",
      "helpful_votes": 0,
      "publication_date": 20170907
    },
    {
      "title": "This is a very good product works great and has great pictures And video ...",
      "text": "This is a very good product works great and has great pictures And video the night vision is great to! :)",
      "rating": 5.0,
      "verified": true,
      "author": "colten",
      "helpful_votes": 0,
      "publication_date": 20171210
    },
    {
      "title": "Good except setup time.",
      "text": "I've had the Netatmo Welcome for a day or so. I'm just adding three tags. So far, it works well. My major complaint is that it takes 10-20 minutes to add the Welcome and the same for each tag. I have trouble understanding this delay.",
      "rating": 4.0,
      "verified": true,
      "author": "Phil",
      "helpful_votes": 0,
      "publication_date": 20160805
    },
    {
      "title": "Works well.",
      "text": "Loves it and considering getting another. Never had an issue yet. Eager to get my hands on the HomeKit upgrade. Please release soon. Also the outdoor presence is great.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180710
    },
    {
      "title": "Five Stars",
      "text": "Excellent device. Lots of IFTT options. Love it. Getting another.",
      "rating": 5.0,
      "verified": true,
      "author": "Bryant",
      "helpful_votes": 0,
      "publication_date": 20171129
    },
    {
      "title": "Facial recognition my eye!!",
      "text": "Facial recognition my eye!! I have \"taught\" it 100's of photos of my face and it only occasionally recognizes my face. So as I walk through my house there are constant \"Motion Detected\" alerts on my phone. And when it does recognize my face it still alerts that I have been seen. Well, DUH!!! Thanks for that! The video is OK but I want something that can notify me reliably without being a nuisance.",
      "rating": 1.0,
      "verified": true,
      "author": "Sturgeon",
      "helpful_votes": 5,
      "publication_date": 20160326
    },
    {
      "title": "Picture quality is average",
      "text": "Omna picture quality is better. Nevertheless facial recognition is useful. Camera gets quite hot. Yet to have home kit support",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180821
    },
    {
      "title": "You know if it sees an unknown face.",
      "text": "Not quite perfect. However I do like the fact that it tells and shows me an unknown face.",
      "rating": 5.0,
      "verified": true,
      "author": "Cwald",
      "helpful_votes": 0,
      "publication_date": 20180604
    },
    {
      "title": "Broken with a little less use. Very disappointed",
      "text": "Broken with a little less use. The green led appears in use but the app doesn't recognize the câmera.",
      "rating": 2.0,
      "verified": true,
      "author": "RENATO OPICE BLUM",
      "helpful_votes": 0,
      "publication_date": 20181120
    },
    {
      "title": "Just perfect",
      "text": "I had made the learning process, one it's done, the cam recognized the faces really good.",
      "rating": 5.0,
      "verified": true,
      "author": "MARIANO CENTO",
      "helpful_votes": 0,
      "publication_date": 20160409
    },
    {
      "title": "CONSTANT disconnections  from the wifi.",
      "text": "Very disappointed with this product. Constantly disconnects from the wifi for no reason at all. (Netatmo Weather works perfectly well connected to the same wifi router and located next to the Netatmo Welcome) Then takes over 30 minutes to reconnect. If I could turn back time, I would save my money and not buy this.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20170215
    },
    {
      "title": "I own 3 of the weather stations and love them. I just returned the second Welcome due ...",
      "text": "I own 3 of the weather stations and love them. I just returned the second Welcome due to the fact that it would not install. Customer service was almost non existent . A response every couple of days finally admitting it was their hardware problem. Great idea but not perfected. I suspect Customer service is being overwhelmed with calls. Amazon as usual made even the returns easy.",
      "rating": 1.0,
      "verified": true,
      "author": "Paul J. Nemeth",
      "helpful_votes": 6,
      "publication_date": 20150719
    },
    {
      "title": "Useless, Unreliable",
      "text": "This camera is useless. Keeps disconnecting from Wifi, no matter how good wifi or internet you have. Its NOT A PROBLEM WITH MY WIFI. Does not detect face, recognises faces if detected. Poor Backlight compensation. you will see nothing if you have bright background. my Amcrest camera works awesome in the same position.",
      "rating": 1.0,
      "verified": true,
      "author": "Droidoholic",
      "helpful_votes": 3,
      "publication_date": 20170827
    },
    {
      "title": "Amazing product with high precision face recognition",
      "text": "Loved the product. Extremely easy to setup . High video quality and face recognition precision. Extremely recommended if you are looking for a user friendly camera with high quality video. Planning to get my second camera soon",
      "rating": 5.0,
      "verified": true,
      "author": "Tarek ElRaey",
      "helpful_votes": 2,
      "publication_date": 20160112
    },
    {
      "title": "Facial recognition is an interesting feature. Unfortunately the image ...",
      "text": "Facial recognition is an interesting feature. Unfortunately the image quality of the camera is sub-par compare to other models I have bought (Nest,Canary...etc).",
      "rating": 3.0,
      "verified": true,
      "author": "Mochi",
      "helpful_votes": 2,
      "publication_date": 20160622
    },
    {
      "title": "Talk about a great addition to the smart home",
      "text": "Talk about a great addition to the smart home. This camera offers what others don't (yet) which is face detection. I have this setup in my home to turn the lights red when an unknown face is detected. The options are limitless as this supports IFTTT.",
      "rating": 5.0,
      "verified": true,
      "author": "JDH",
      "helpful_votes": 0,
      "publication_date": 20160322
    },
    {
      "title": "Camera is amazing and helps me ensure the safety of my house ...",
      "text": "Camera is amazing and helps me ensure the safety of my house when I am away on travel. Also ensures the cleaning services are completed as well. First week I got it I found the cleaner not doing his job but just looking around the house. It completely gave my wife peace of mind that no one was in the house, with the ability to check the house live on camera.",
      "rating": 5.0,
      "verified": true,
      "author": "Rice",
      "helpful_votes": 0,
      "publication_date": 20170416
    },
    {
      "title": "Great product idea",
      "text": "Great product idea. Unimpressed with execution, though. Even more disappointed in Netatmo support or lack thereof. Often times the camera is not detecting the faces in my home at all. Furthermore, mine tipped over on its side while cleaning slightly cracking the lens. Netatmo, the maker of the product, does not repair it. A cracked lens recognizes zero faces, making the product entirely useless. Netatmo does not have any other suggestions less purchasing another one. Maybe I'll consider that if a better brand pursues something similar.",
      "rating": 1.0,
      "verified": true,
      "author": "Cole",
      "helpful_votes": 5,
      "publication_date": 20160523
    },
    {
      "title": "Hot product (but not the right kind of hot)",
      "text": "I give it one additional star for the fact that it does actually recognize faces. The problems are the following: - if it gets disconnected from wifi, it doesn't reconnect without a manual reset. (I fixed this by switching to a physical Ethernet connection) - it gets REALLY hot. The SD card stops getting recognized when it reaches this state of temp. The last point was the breaking straw. I felt it was too much a fire hazard and not worth the risk and hence disconnected it. It was a worthy experiment but I think I may switch to dropcam or canary.",
      "rating": 2.0,
      "verified": true,
      "author": "N31L",
      "helpful_votes": 3,
      "publication_date": 20150727
    },
    {
      "title": "Doesn't Work Properly!",
      "text": "Would not pick up the facial recognitions at least 85% of the time. Says you can view in 1080p but the most it can get up to is 720p (mostly views in 360p) and it would constantly say the camera has been disconnected and can't view the video. Would recommend not buying this and investing in the Canary All-In-One Home Secruity Device.",
      "rating": 2.0,
      "verified": true,
      "author": "Cr4kinskullz",
      "helpful_votes": 0,
      "publication_date": 20160123
    },
    {
      "title": "Constantly going offline, unviewable",
      "text": "The thing is a pain in my side. I like the facial recognition. That works well. But the constant repeated issues of it falling offline makes it basically worthless.",
      "rating": 2.0,
      "verified": true,
      "author": "ryan p.",
      "helpful_votes": 0,
      "publication_date": 20180209
    },
    {
      "title": "parts missing",
      "text": "The package did not contain the camera. What a joke. Returning.",
      "rating": 1.0,
      "verified": true,
      "author": "Rafiul Shihab",
      "helpful_votes": 0,
      "publication_date": 20180131
    },
    {
      "title": "Two Stars",
      "text": "Very bad connection to the wifi, it has to be very close to make it work.",
      "rating": 2.0,
      "verified": true,
      "author": "Francisco Ramirez",
      "helpful_votes": 0,
      "publication_date": 20170621
    },
    {
      "title": "It is a bad dream",
      "text": "I received ㄧ a second-hand goods, not only the product in question still missing parts, as shown in the picture",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 7,
      "publication_date": 20160701
    },
    {
      "title": "Would not connect with HTC phone",
      "text": "Plugged in unit and it would not connect up with smart phone.",
      "rating": 1.0,
      "verified": true,
      "author": "J. Brown",
      "helpful_votes": 2,
      "publication_date": 20160124
    },
    {
      "title": "Great concept, poor execution",
      "text": "Worked for a few seconds and froze. Hard to setup right from the start. Great concept, poor execution.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160115
    },
    {
      "title": "Gets very hot",
      "text": "Works as advertised except it gets very hot - measured at 110 degrees F. Returned for replacement with the same result. Tech support said that is normal. I don't think so.",
      "rating": 1.0,
      "verified": true,
      "author": "Michael Goddard",
      "helpful_votes": 5,
      "publication_date": 20150717
    },
    {
      "title": "Five Stars",
      "text": "looks to have great quality - just have not installed yet.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20150903
    }
  ],
  "product_meta": {
    "title": "Smart Indoor Security Camera - Netatmo Welcome, Gold",
    "description": "Receive home intruder alerts direct to your smartphoneWelcome is a new-generation smart indoor security camera. Unlike the usual motion alerts which require you to waste time watching footage, Welcome sends an immediate alert if an intruder has been detected in your home, complete with a picture of the person's face and a video recording. The camera uses facial recognition technology to help you look after your children or elderly parents, sending their name to your smartphone to let you know they are well. You can also use the app to disable video recording and notifications for familiar faces. When Welcome hears an alarm, whether it be a smoke alarm, CO alarm, security alarm or the Siren, it will send a notification and record a video. Welcome's setup is quick and easy: place the camera facing your entrance, plug it in and download the app to connect it to your home Wi-Fi network. Identify your loved ones with a simple click. That's it. Your home is now protected against break-ins!Specifications:-Video sensor: 4 MP-Full HD: up to 1920x1080-Field of view: 130°-Infrared night vision-Local data storage: MicroSD (8 GB Class 10 card included)-Wi-Fi: 802.11 b/g/n (2.4 GHz)",
    "rating": 3.8,
    "feature_bullets": [
      "PROTECT YOUR HOME: receive home intruder alerts direct to your smartphone",
      "RECEIVE CUSTOM ALERTS: Welcome uses facial recognition to distinguish between intruders and your friends and family",
      "ROUND-THE-CLOCK SECURITY: use the app to watch Full HD footage of what happens in your home, 24/7",
      "PROTECT YOUR PRIVACY: disable video recording and notifications for familiar faces via the app",
      "FREE VIDEO STORAGE: store your videos at no additional cost and stream them whenever you want.Android compatibility: Android 5.0 minimum required",
      "ALARM DETECTION: receive an alert when the system detects an alarm coming from the Siren or Smoke Detector. Anodized aluminum",
      "EFFORTLESS SETUP in a few minutes: place the camera indoors, facing your entrance, plug it in and download the app."
    ],
    "specifications": {
      "Product Dimensions": "1.8 x 1.8 x 6 inches",
      "Item Weight": "14.1 ounces",
      "ASIN": "B00X5X1XPU",
      "Item model number": "NSC01-US",
      "Customer Reviews": "3.8 out of 5 stars289 ratings3.8 out of 5 stars",
      "Best Sellers Rank": "#853 in Camera & Photo",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "June 9, 2015",
      "Manufacturer": "NETATMO LLC"
    },
    "categories": [
      "Surveillance Cameras",
      "Video Surveillance",
      "Electronics",
      "Camera & Photo",
      "Dome Cameras"
    ],
    "price": 191.82
  }
}