{
  "website_summaries": [
    {
      "verdict": "An extra-tough dog pool that will serve you well for an extended period of time.",
      "pros": [
        "Pool is 12\" deep and has a diameter of 50\" to provide plenty of space for your dog",
        "Comes with an attached drain plug that ensures you can empty the pool instantly",
        "Boasts paneled segments that enable you to fold the pool for seamless storage",
        "Pool setup is quick and stress-free",
        "A wonderful option for large and small dogs alike"
      ],
      "cons": [
        "Bottom of the pool is very thin and punctures easily",
        "Plastic panels inside the pool tend to wear down quickly"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Dog says it's delicious.",
      "text": "1. Search Amazon for a pool for my dog. I'm thinking maybe $20. 2. Finally find one. It's $80. 3. Think about how much I like my dog. Decide not that much. 4. Wife tells me I like my dog exactly that much. 5. Grumble and then buy pool. 6. Set up, fill with water, dog very happy. 7. Leave for half an hour. 8. Come back home to pool eaten and spread all over my back yard. 9. This is a dog pool like I'm a pterodactyl. It's just a pool. Your dog will eat it.",
      "rating": 2.0,
      "verified": true,
      "author": "C. Wood",
      "helpful_votes": 385,
      "publication_date": 20160630
    },
    {
      "title": "VERY thin bottom that punctures easily, which is ridiculous since this is a pool ...",
      "text": "VERY, VERY thin bottom that punctures easily, which is ridiculous since this is a pool supposedly MADE for dogs. Got the run around from the company (check with so and so, who told me to email so and so), which must be their way of avoiding any issues. They wear you down until you shrug your shoulders and say. \"Ok, I give\". DO NOT BUY THIS POOL IF YOU HAVE DOG(S) OVER 10 POUNDS. It was a major joke. Too bad too, because I was really looking forward to it lasting more than 3 days in my yard.",
      "rating": 1.0,
      "verified": true,
      "author": "marygrace maresh",
      "helpful_votes": 113,
      "publication_date": 20150817
    },
    {
      "title": "Poor Quality / Poor Return Policy",
      "text": "My puppy girl enjoyed the pool for 2 weeks until I noticed a leak in the bottom of the pool. I found a small tear. I don't know where it came from. The material should be strong enough to handle a dog's paws for only a few sessions in the pool. Have to say I am disappointed in the quality and now it's too late for a return. A company should stand by their product/quality!!",
      "rating": 1.0,
      "verified": true,
      "author": "MNW",
      "helpful_votes": 62,
      "publication_date": 20160712
    },
    {
      "title": "Worth every penny",
      "text": "I've got 3 large indoor dogs, but they still get a little funky... Professional grooming can be expensive, so I had a hot water option added to my outdoor hose connection so I could bathe them, myself, with warm water, when the weather is appropriate for outside bathing. The trick was finding a tub / pool, sturdy and suitable for them and me. One of them loves bath time, and gets pretty rowdy with the tub. Not only does it stand up to his shenanigans (I'd post a video of him roughing the tub up, if Amazon supported videos, but I'll post a pic), it drains easily, and folds nearly flat when not in use. I highly recommend this product!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 17,
      "publication_date": 20170418
    },
    {
      "title": "Good design. Pretty expensive.",
      "text": "It's durable and easy to fill and empty. It's pricey. I paid about $20 more for it last year, but it's still not cheap at $65. You can buy and throw away a few kiddie pools for this price. Also, it's red when it arrives but if you use i in the sun, pretty much a given, it will be pink by the end of the season. And it will be an uneven pink based on where the sun hits it. My dog loves it though and doesn't seem to mind the color change. She's such a girl.",
      "rating": 3.0,
      "verified": true,
      "author": "Rossputin",
      "helpful_votes": 8,
      "publication_date": 20170621
    },
    {
      "title": "Strong enough to entertain my Rottweiler.",
      "text": "I bought this pool for my little, 90 lb Rottweiler. This size doesn’t allow her to swim, of course, but it was plenty big to splash around in. She has spent hours a day biting the water and jumping around in it. It helped her cope with the Los Angeles summer heat while providing a fun chance for exercise. It is useable right out of the box. So far, it has been very sturdy. No punctures. No tipping. Easy to empty (which I do every night) and easy to fold or refill. It was a good purchase. It is a simple, well thought out product.",
      "rating": 5.0,
      "verified": true,
      "author": "cityoftheangels",
      "helpful_votes": 5,
      "publication_date": 20180802
    },
    {
      "title": "Take a plastic sandpit instead... this one is not worth the money!",
      "text": "After I bought a cheap plastic sandpit and found out my dogs are real water lovers, I decided to buy this expensive dog pool hoping to have a more durable and stable pet pool. But I was wrong... my dogs (medium size) didn't like it at all because the edge is very high, and it always folds down when the dogs step in... After one week it was ripped at the bottom just from the paws.. I wouldn't buy it... just go to your local Garden Center and take the plastic sandpit for $10.... your dogs will love it even more!",
      "rating": 1.0,
      "verified": true,
      "author": "blueberry",
      "helpful_votes": 3,
      "publication_date": 20180731
    },
    {
      "title": "... on vacation in the outer banks as she doesn't like to swim in the in ground pool",
      "text": "We bought this pool for our 6 year old border collie mix Lucy to use on vacation in the outer banks as she doesn't like to swim in the in ground pool. We set it up for her on day 2 of our vacation and she loved it! She is a 70 pound cutie pie who loves to spin around in the water to cool off. This was perfect. On our last day we drained water and set in sun to dry (very quickly). Folded up and back into carrying bag 1-2-3! Could not have been easier and worth the money to make her happy as well! I recommend this for all dog lovers!",
      "rating": 5.0,
      "verified": true,
      "author": "SUS",
      "helpful_votes": 5,
      "publication_date": 20170821
    },
    {
      "title": "Not a pool for playful dogs!!! ☹️",
      "text": "Bought this pool for my Lab. He enjoys the water, but also like to play in it & be silly. First time I used it he was splashing the water in the pool & I notice a hole in the bottom area close to the seem. Pool is made of cheap plastic & very thin. Sides are covered with thin plastic over heavy cardboard. For what I paid for this pool I would expect it to last longer that 10 minutes. It is also not easy to fold back up to get it back in the packaging. Don’t waste your money on this pool. Not worth it!!! Great idea, but very cheaply made. 😠",
      "rating": 1.0,
      "verified": true,
      "author": "Carol S.",
      "helpful_votes": 0,
      "publication_date": 20200421
    },
    {
      "title": "Cool pool",
      "text": "Excellent product. Durable and the perfect size. I got this so my dogs would have a wading pool for the summer. We have a small backyard/deck so it couldn't take up too much room, but had to be large enough for the dogs to enjoy. My pit bull loves it and will even lay down to cool off. The cattle dog has to be put in. But enjoys the cool down. It drains easily and folds back up when not in use.",
      "rating": 5.0,
      "verified": true,
      "author": "Kerrie Byrne",
      "helpful_votes": 6,
      "publication_date": 20170625
    },
    {
      "title": "but as long as your dog isn't a jerk and doesn't use it like a chew toy",
      "text": "My 94 lb pitbull and his German Sheppard friend had a blast in the pool. I laughed at other reviews that give 1 star but show the pool half eaten by their dog. So the pool is not indestructible, but as long as your dog isn't a jerk and doesn't use it like a chew toy, it will last.",
      "rating": 5.0,
      "verified": true,
      "author": "autoo ",
      "helpful_votes": 9,
      "publication_date": 20170720
    },
    {
      "title": "it's held up beautifully (we've had it about two weeks and she uses ...",
      "text": "My border collie is really enjoying her pool! So far, it's held up beautifully (we've had it about two weeks and she uses it daily due to the excessive heat we've been experiencing) and, although she's a chewer, she's made no attempt to chew the sides as other reviewers' dogs have done. However, I supervise her constantly when she's in the pool to prevent her from damaging it. The vinyl is durable even as she runs through the pool or paws at her floating ball. I'm so happy I purchased this for her.",
      "rating": 5.0,
      "verified": true,
      "author": "mykarass",
      "helpful_votes": 0,
      "publication_date": 20180701
    },
    {
      "title": "German Shepard tested",
      "text": "This has been thoroughly tested and received an A+ rating by my German Shepard. As you can see, he’s definitely giving it a run for his money and has no desire to eat it.",
      "rating": 5.0,
      "verified": true,
      "author": "T. Williams",
      "helpful_votes": 6,
      "publication_date": 20180506
    },
    {
      "title": "Only 2 down sides found",
      "text": "Our dogs are older (a Heeler and a Chesapeake) so we needed something low for them to step into. My heeler has a little bit of difficulty getting in and out but she’s 14. She still manages on her own and both dogs are happy with it. The only 2 negatives I have found are the difficulty cleaning it out and the bottom is very thin so definitely need a flat even surface to put it on. Since it folds up and there’s no support for the bottom it is impossible to hose the bottom and clean it thoroughly. All in all happy with my purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "Sheena Rhoades",
      "helpful_votes": 0,
      "publication_date": 20180829
    },
    {
      "title": "very simple to use and effective",
      "text": "My wife adopted a baby goose abandoned by its family because it couldn't walk and keep up. She is raising it until it can fly. It outgrew the $9 wading pool in a week, so I bought an inflatable pool which lasted two weeks. The FrontPet Foldable Dog Pool Pet Bathing Tub works the best. It is sturdy and drains easily. We drain it almost every day and hose it out before refilling it. The young goose helps and when we put the hose back in to refill it, he belly flops into the empty pool and enjoys the hose as it fills up. We have about four more weeks until he can fly but this pool will make it.",
      "rating": 5.0,
      "verified": true,
      "author": "Terry O'Brien",
      "helpful_votes": 0,
      "publication_date": 20200523
    },
    {
      "title": "I would not buy this again.",
      "text": "Easy to set up, just unfold and fill with water. Easy to empty with the valve. More difficult to clean/wash/rinse out than a solid pool. Not very durrable, vinyl covered cardboard sides will bend and bow under the pressure of the water. If you are concerned about space and storage this works well. If not, I would purchase the solid type bath/pool. My 65 lb Starndard Poodles does enjoy this pool.",
      "rating": 3.0,
      "verified": true,
      "author": "William B. Boyce",
      "helpful_votes": 4,
      "publication_date": 20160604
    },
    {
      "title": "This is the dog pool I was looking for!",
      "text": "Now that we have Corgis instead of Golden Retrievers, we needed something much smaller and easier to drain. Finding this dog pool hit the spot! For dogs who only are looking for cool fun during heat of summer, this is perfect. Smaller capacity means using far less water. Draining half the water is easy with the spigot. And the remaining water is easy to toss. Because of mosquitos, we need to drain more often and because this requires far less water, it’s not as wasteful.",
      "rating": 5.0,
      "verified": true,
      "author": "Ken Fong",
      "helpful_votes": 0,
      "publication_date": 20200529
    },
    {
      "title": "Great pool",
      "text": "I bought two of these pools for my Brittany pups. They love them. I love the drain plug makes it super easy to drain. When we’re done I rinse it out with a hose and the best part is that it’s sturdy I bought this pool for 2 pups whi have sharp nails and they get in and out. When we’re done another great feature is how easy it is to store folds up nicely for storage. We have used it about 15 times already and it still looks new",
      "rating": 5.0,
      "verified": true,
      "author": "Awesome",
      "helpful_votes": 0,
      "publication_date": 20200525
    },
    {
      "title": "Perfect for Kid and Dog",
      "text": "Ordered this for our backyard for our toddler, but because we have a black lab mix that loves all things water we wanted to make sure that we got one that would survive the dog. This was perfect. Very pleased with how easily it folds up and stores.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Sage",
      "helpful_votes": 0,
      "publication_date": 20200408
    },
    {
      "title": "Accurate information on product was missing",
      "text": "When package was delivered the package indicated small pet pool and has no measurements on it. However after opening and setting up it measures 30 inches across and 8 1-2 high. The item does not idicate it to be for small dogs. My dog is 45 lbs mid size and she can only stand it it. Either the wrong order was sent or the item is misleading. Don't look at the picture of the dog. This pool is for mini to small dogs.",
      "rating": 1.0,
      "verified": true,
      "author": "Mark davison",
      "helpful_votes": 4,
      "publication_date": 20180529
    },
    {
      "title": "Nice pool but didn't last",
      "text": "130 lb Lab Loves his Birthday Pool. Great for cooling down in Hot gulf coast Tx. Bottom seems sturdy enough put a layer of sand under it to make sure holds up and comes with a Drain hole How easy to change out when water gets dirty. June 10 2020 update. Dog just soaks in pool but sad to say found 2 1/4 inch holes and no water wish I saved my Money and brought kiddie pool from Walmart. Lesson learned pool not as sturdy as thought.",
      "rating": 3.0,
      "verified": true,
      "author": "AMZ shopper",
      "helpful_votes": 0,
      "publication_date": 20200413
    },
    {
      "title": "Absolutely the Best item we ever got Kate",
      "text": "We could barely fill it up before Kate was in it jumping around and blowing bubbles. She absolutely LOVES it!! She's an 8-month old German Shepherd and it's one of the best things we've ever gotten her. We couldn't let her out in the heat very long if she didn't have that to jump in to cool down. She jumps in and out and back in again. We don't need to fill it up with much water either, so it's not bad on the utility bills. It's SO easy to set up and take down - - that's almost as good as how much Kate loves it!",
      "rating": 5.0,
      "verified": true,
      "author": "Michele Topor",
      "helpful_votes": 3,
      "publication_date": 20180619
    },
    {
      "title": "Great pool for dogs",
      "text": "My dog loves this pool. I have a 60lb black lab and this pool is just the right size for her. The material is strong and of good quality. Her nails do not puncture the bottom which was one of my primary concerns. Be careful where you store it though. I put mine in the garage over the winter and the chipmunks turned it into swiss cheese. But I didn't think twice and bought another one.",
      "rating": 5.0,
      "verified": true,
      "author": "Alex Nies",
      "helpful_votes": 4,
      "publication_date": 20160623
    },
    {
      "title": "Does not stand the Dog play test.",
      "text": "I ended up buying a plastic pool from tractor supply for 12.00, and it is still holding it's own. If you have Pup's that love to jump and play in water, this pool is no good. Holes in the bottom 1 hour after setting up. Great for a huge water dish but thats all.",
      "rating": 1.0,
      "verified": true,
      "author": "Sue Chapman",
      "helpful_votes": 0,
      "publication_date": 20190426
    },
    {
      "title": "Nice doggy pool",
      "text": "Perfect for our water loving English Bulldog.. good quality and easy to empty with the valve on the side. Much easier to clean and store than a hard plastic pool. This is very durable and will last many seasons.",
      "rating": 5.0,
      "verified": true,
      "author": "KLL",
      "helpful_votes": 6,
      "publication_date": 20170527
    },
    {
      "title": "POOR CONSTRUCTION",
      "text": "For the money I spent on this, it did not last a summer! The color faded quickly, which isn't a big deal but I live in WI and I think the fading caused the material to thin and tear, which caused it to leak. I think the sidewalls are maybe a heavy duty cardboard underneath and also did not hold up. Great idea just VERY POOR construction. Going back to my plastic kiddie pools that I can throw away at the end of the summer :-(.",
      "rating": 1.0,
      "verified": true,
      "author": "Nancy",
      "helpful_votes": 4,
      "publication_date": 20170913
    },
    {
      "title": "Good size for my 75 lbs Labrador",
      "text": "I use this to bathe my 75 lbs Labrador and it's more than enough room. I fill this high enough to reach just below her knees. It holds more than enough water to bathe my dog. It's easy to open and easy to collapse. When draining the water it will stop at a certain height and you'll have to slightly lift it to continue the draining. But that takes only a couple of minutes before you can lift the whole thing and spill the remaining water.",
      "rating": 4.0,
      "verified": true,
      "author": "August Blaze",
      "helpful_votes": 3,
      "publication_date": 20170704
    },
    {
      "title": "disappointing",
      "text": "This is plastic covered cardboard sides. The bottom seems like thick enough plastic. The drain works well. The instructions say not to place in the direct sunlight and not to leave filled with water. Rather the opposite of what I wanted it for, which was water play on hot summer days. My dog likes it and it has become a summertime bathtub. Taped up. She bit the top of a section so it has a couple punctures and would easily get wet inside then we'd be missing a panel. So we use it only for bath time and put it away immediately.",
      "rating": 2.0,
      "verified": true,
      "author": "HealthyMama",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Punctures easy.",
      "text": "I love this pool but seriously disappointed that I have found a hole and I am not sure how it happened. This pool is not used daily and used only to cool my lab down. We follow the instructions, turning it upside down to dry it out completely before putting it away. Really disappointed to have spent so much money on a product that was supposed to not puncture easily.",
      "rating": 3.0,
      "verified": true,
      "author": "Kris",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "Folds up very easily",
      "text": "Pull this out when the weather gets really hot for the dogs. They love to jump in and out of it and basically cool off. It's held up well, doesn't leak and easy to drain when were done with it. Folds up nicely and quickly to store away for the winter months. They get all excited when they see me pull it out to set up Haha! Recommend this for dogs just to cool off a little, they love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Stephen C.",
      "helpful_votes": 0,
      "publication_date": 20191017
    },
    {
      "title": "Dog Party Pool",
      "text": "Great pet party pool! Good size, durable, and ready to use. Easy to set up (no inflating and easy to drain). Dogs love it! Thanks!",
      "rating": 5.0,
      "verified": true,
      "author": "Russ Wheeler",
      "helpful_votes": 56,
      "publication_date": 20150617
    },
    {
      "title": "Pretty pricey for quality",
      "text": "We recently got this for our baby to use outside. We noticed it bows out when filled and already has a small hole in the bottom of it. We’ve also noticed it’s gotten sun damage and we’ve only had it for a month. We empty it after every use, which is also kind of difficult to fully empty because the empty valve isn’t flushed to the bottom of the pool. So it empties 80% of the way and then is pretty heavy to lift and fully empty the rest. We enjoy using it just was pretty expensive for the quality.",
      "rating": 3.0,
      "verified": true,
      "author": "Jessica M. OBrien",
      "helpful_votes": 0,
      "publication_date": 20200606
    },
    {
      "title": "Amazing",
      "text": "Bought an L for my 16mo. Perfect for her. A little too small for my 4 and 3 yr-old bonus kids. It is very sturde the drain plug holds tight and makes cleaning and draining super convinent. I've set it up on the sand and on the wooden porch. It is all around a nice pool. Next year I'll probably get a bigger one tho.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathleen long",
      "helpful_votes": 0,
      "publication_date": 20200528
    },
    {
      "title": "Great product!",
      "text": "My dogs absolutely love this pool! My boxer practically stays in it during the heat of summer! The side panel with the water cap to drain the water tends to lean a little but is easily propped up. I have a Mastiff, Boxer and Shepherd, all three very large dogs and they play rough in it. It's holding up very well.",
      "rating": 5.0,
      "verified": true,
      "author": "R.  Thomson",
      "helpful_votes": 0,
      "publication_date": 20191206
    },
    {
      "title": "Exactly as Described",
      "text": "Bought this pool for my son's dog to use when he comes over. Dog just loves it. He spent the first day jumping in and out and chasing his balls and toys in the water. Was a great way for him to cool off. Also very easy to empty, clean, and fold back up when you are not using it. So happy I found this!",
      "rating": 5.0,
      "verified": true,
      "author": "J. Levasseur",
      "helpful_votes": 0,
      "publication_date": 20190809
    },
    {
      "title": "Good purchase",
      "text": "I like how durable it is for my large puppy. He like to sit in the water and we also use it for bathing him. Its so much easier than the bathtub or shower inside. I don't like how hard it is to get dirt out of the bottom but its understandable why its hard. My puppy likes sitting in dirt and than getting in the pool.",
      "rating": 5.0,
      "verified": true,
      "author": "Ginger",
      "helpful_votes": 0,
      "publication_date": 20191002
    },
    {
      "title": "Stores easily, works great to catch water for makeshift portable shower.",
      "text": "Folds up nice and compact for great stowaway. I'm using to catch water as I give my husband a sponge bath from the kitchen sink. I used a spray nozzle from the sink, and a sump pump to drain the pool. Works wonderfully for a makeshift shower as I don't have one downstairs. I just need to add a portable shower curtain around the top to avoid oversplash.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathleen L Coleman",
      "helpful_votes": 0,
      "publication_date": 20180625
    },
    {
      "title": "Nice quality",
      "text": "I just bought my second one. I use it for my 6 pigs. They lay in it for hours on hot days. The red color does fade super fast, so it won't stay attractive for very long, but it does hold up nice. Mine did just spring a leak at the bottom, but bare in mind that it's 6 pigs. I got a year and a half out of it so I'm pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "SwallowTheMoon2",
      "helpful_votes": 0,
      "publication_date": 20170814
    },
    {
      "title": "Great big pool for the fur kids.",
      "text": "Great product and extremely easy to fill, empty with the easy to use drain and then fold up and put away. Folds easily and appears to be very durable for our black lab pup and 12 year old beagle to get in and out of as they see fit. Only down side is the drain could be a little lower to the bottom for easier draining but in all honesty, It’s manageable, 5 Stars!",
      "rating": 5.0,
      "verified": true,
      "author": "Patrick E. Wilcox",
      "helpful_votes": 0,
      "publication_date": 20180729
    },
    {
      "title": "Big puppy love!",
      "text": "Our fog, a 97 pound Black Lab really likes having his own pool. Now he doesn’t have to wait for us to go to the creek or river. You know Labs are naturally drawn to water. Now at least we can keep him out of the mud by setting his pool up on a surface where there is no dirt!",
      "rating": 5.0,
      "verified": true,
      "author": "Dee",
      "helpful_votes": 0,
      "publication_date": 20200527
    },
    {
      "title": "So far .....so good !!!!",
      "text": "The only reason I took off stars for durability and sturdiness (which are all out the same ) is that we haven't had this very long. So far so good!!! Both out furry baby Delilah enjoyed it and we then cleaned it so our Grandkids could use. It's very easy to set up -not too heavy and unlike the last pool I bought does not need to be inflated . That one lasted an afternoon .....almost . I would recommend this .",
      "rating": 5.0,
      "verified": true,
      "author": "della",
      "helpful_votes": 0,
      "publication_date": 20191008
    },
    {
      "title": "Good quality",
      "text": "She loves this pool already!! Seems pretty durable as long as she doesn’t go to town in digging mode. The picture shows a full size dog and two kids in it, I donno about all that not that big but it’s perfect for her and to cool down on a hot day 😁",
      "rating": 5.0,
      "verified": true,
      "author": "Lulu",
      "helpful_votes": 0,
      "publication_date": 20200318
    },
    {
      "title": "It Works!",
      "text": "What can you say about a folding doggy pool? It's relatively easy to fold and unfold, holds water well and is big enough for large dogs. Getting reluctant dogs to get into and stay in the pool is another matter!",
      "rating": 4.0,
      "verified": true,
      "author": "Jon R. Herman",
      "helpful_votes": 0,
      "publication_date": 20190823
    },
    {
      "title": "Our German Shepherd loved this!",
      "text": "Our GS loved it. She tried to destroy it when not filled with enough water. We had been using it to try and keep her out of my koi pond which helped some. Unfortunately, we drained after her surgery to keep her dry and she destroyed it beyond repair. We liked the overall product, ease of draining. Might purchase again but a lot of $ if she ends up ruining it again!",
      "rating": 5.0,
      "verified": true,
      "author": "MelF.",
      "helpful_votes": 0,
      "publication_date": 20180826
    },
    {
      "title": "Perfect dog wading pool",
      "text": "Best dog/human portable foldable pool ever. This is my second time purchasing a A FrontPet pool. The first one lasted approximately 4 years (not super heavily used but enough for sun damage and fading). I bought the XL this year as I’ve acquired a puppy who we are water training. Although this one had a small hole in the seam, I patched it with Gorilla water seal tape and went on with the day because trying to return it in a pandemic just seemed like too much of a pain.",
      "rating": 4.0,
      "verified": true,
      "author": "Shirin Ahmed",
      "helpful_votes": 0,
      "publication_date": 20200425
    },
    {
      "title": "Great dog pool",
      "text": "Second pool. First pool purchased 2 plus years ago and still going strong. Most recent purchase for my dog's aunts house. As a black lab/great Dane mix he needs to cool off after playing. Easy to empty - water the lawn and clean. My dog is not a chewers of things not toys or bones. If yours is, supervision recommended. Love the pool. Easy storage in winter as folds easily.",
      "rating": 5.0,
      "verified": true,
      "author": "PDF",
      "helpful_votes": 0,
      "publication_date": 20190507
    },
    {
      "title": "Amazing!!",
      "text": "I love this!! It’s great for living in the PNW. I can easily store it away when the weather doesn’t cooperate. Worth the money my dogs love it. It’s also nice for us on hot days to stick our feet in.",
      "rating": 5.0,
      "verified": true,
      "author": "Megan",
      "helpful_votes": 0,
      "publication_date": 20190823
    },
    {
      "title": "Happy doggo",
      "text": "American Pitbull loves the water but can't swim (sinks like a rock lol). This was the solution. After walks in the summer this was his favorite place in the yard. Now that its winter it cleaned well and folded back to the shape it was shipped in for storage. Good buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike Daniel",
      "helpful_votes": 0,
      "publication_date": 20191214
    },
    {
      "title": "Great so far!",
      "text": "Leaving 5 stars for now, will update after more vigorous use has ensued. Very easy set up. Just unfold and fill. We got the XL and our 2 80 pound goldens fit with extra room. They love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Hollerback",
      "helpful_votes": 0,
      "publication_date": 20200516
    },
    {
      "title": "A doggone good time.",
      "text": "Very easy to set up and holds up well against my dogs. The drain plug is a bonus and makes draining so easy. I used to kill my back trying to dump those cheap plastic pools. Also my dogs love the water draining out, maybe more than having it in the pool.",
      "rating": 5.0,
      "verified": true,
      "author": "Edwin E. Taylor Jr.",
      "helpful_votes": 0,
      "publication_date": 20180825
    },
    {
      "title": "Our 4 month old golden doodle puppy was not sure she liked it until we threw her ball into the pool",
      "text": "Fabulous product. Our 4 month old golden doodle puppy was not sure she liked it until we threw her ball into the pool. Then she gingerly stepped over the edge to retrieve the ball and bring it back to us. We kept tossing it back in the pool and she started to get used to it. Has not sat down yet but is no longer afraid of it. Pool seems to be well made.",
      "rating": 5.0,
      "verified": true,
      "author": "janet z fitzgibbon",
      "helpful_votes": 0,
      "publication_date": 20170706
    },
    {
      "title": "His loves this pool! 2 years and still going",
      "text": "We have had our pool for 2 years now and it’s still going strong. It’s very durable. Other than faded from the sun, it has held up wonderfully. It’s fills and drains easily as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer",
      "helpful_votes": 0,
      "publication_date": 20200524
    },
    {
      "title": "Works Perfectly = Great Dane Thrilland",
      "text": "We got the pool and I could immediately unzip the bag and fold it into place with little to effort or issues. It was perfect. I got the pool for my great dane so we set up the beginning of a wonderful summer. His reaction was PURE EXCITEMENT and it hasn't gone away even for a second! My dog does not have a chewing problem so this has been perfect. Having the opportunity to watch my great dane puppy (18 months)",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200517
    },
    {
      "title": "Great product",
      "text": "This foldable dog pet pool is great! Our use of this item was because our 100 lb lab needed weekly baths during the heart of winter. She is unable to get into the bath tub upstairs. Instead we set this up in the kitchen and she was able to get in and out very easily and she had plenty of room to move around. Pool easily folded into a smaller version of itself and was easy to store. Great quality and great value!",
      "rating": 5.0,
      "verified": true,
      "author": "Jeanne",
      "helpful_votes": 0,
      "publication_date": 20170417
    },
    {
      "title": "Perfect for water therapy!",
      "text": "Very Sturdy pool. It arrived on time without any damage. I had it assembled and filling with water in 5 minutes. I also emptied it and moved it to another location. It was easy to empty and refill. My dog is afraid of it but he needs water therapy for his spinal injury so I go in it with him. It's large enough to hold both of us and deep enough for him actually swim in (he's a doxie) . This pool is perfect for that purpose. I highly recommend this pool.",
      "rating": 5.0,
      "verified": true,
      "author": "Dorothy Chartrand",
      "helpful_votes": 2,
      "publication_date": 20150817
    },
    {
      "title": "Didn't last",
      "text": "It's a good idea for a dog on a hot day. We got the 6 foot version for our golden retriever who loves the lake. My kids set it up on a tarp to protect it, and would leave it up for a couple days, then carefully dried it and stored it in the package it came in. The dog was kinda into it, but more just to walk through at my kids' prompting. It got little use. Nevertheless, in less than three months, a small hole developed at one of the seams. Not worth the money.",
      "rating": 2.0,
      "verified": true,
      "author": "Bri K.",
      "helpful_votes": 0,
      "publication_date": 20200716
    },
    {
      "title": "Not good for dogs that chew",
      "text": "great idea but not puppy proof! my mini aussie had this in shreds in less than 48 hours. I had purchased the large pool for our aussie and older border collie. they loved to get in it, but the younger dog (1 yr old) ripped into the bottom and sides and had it demolished in 48 hrs after I set it up and filled it. Not sturdy for dogs who may chew.",
      "rating": 2.0,
      "verified": true,
      "author": "Joanne E. Hesser",
      "helpful_votes": 0,
      "publication_date": 20170814
    },
    {
      "title": "Puppy love",
      "text": "We got this for our Golden Retriever puppy. We keep it on our deck and she loves it. Size is good. Now she jumps in and out after a ball and she will be able to use even as an adult.",
      "rating": 5.0,
      "verified": true,
      "author": "Lyn H",
      "helpful_votes": 0,
      "publication_date": 20190713
    },
    {
      "title": "Great doggy pool for my 65lb boxer",
      "text": "Very durable! My boxer loves this pool. She jumps in and out - and never made a tear in material! Easy to clean and store away! This Is my second order of these only as the first one was worn out after a few years!",
      "rating": 5.0,
      "verified": true,
      "author": "Jodie ",
      "helpful_votes": 0,
      "publication_date": 20190820
    },
    {
      "title": "Very happy with my purchase",
      "text": "After reading other reviews about tears, I decided to only keep the pool on a flat surface (ie I put planks of wood underneath it). I have 3 large active dogs that run in & out of the pool & there are NO tears (and one of my dogs has wolverine-like toenails). Very happy with my purchase, the dogs LOVE it, and I LOVE that it's easy to drain. Would recommend it to others, but suggest keeping on a flat surface to prevent alleged tearing.",
      "rating": 5.0,
      "verified": true,
      "author": "Scorpion85",
      "helpful_votes": 0,
      "publication_date": 20161016
    },
    {
      "title": "Great Doggy Pool!",
      "text": "This large size pool is perfect for my 55 lb. Greyhound to cool off in during the scorching South Florida summers with room to spare. Easy to set up and drain. Not super sturdy but serves my purposes well. Pool comes in a plastic tote and folds away for easy storage.",
      "rating": 5.0,
      "verified": true,
      "author": "I. Martinez",
      "helpful_votes": 0,
      "publication_date": 20170503
    },
    {
      "title": "Pet Pool",
      "text": "This product is easy to set up and clean. Holds a decent amount of water and is easy for the dogs to get in and out of. The only downside is that it is not good for younger dogs that are still in their chewing stage because they will take it apart pretty easily.",
      "rating": 4.0,
      "verified": true,
      "author": "DRS",
      "helpful_votes": 0,
      "publication_date": 20190427
    },
    {
      "title": "Riggz loves it!",
      "text": "Good buy. My 90 pound, 16 month old German Shepherd loves it and has not destroyed it. The plug could be a little lower but not a deal breaker. It is a little small for him. I don't let him chew it. He does paw at it trying to get his ball. So far so good. If they had a bigger one I would purchase it. Made of tough material.",
      "rating": 5.0,
      "verified": true,
      "author": "Ladyfirebird84",
      "helpful_votes": 0,
      "publication_date": 20170803
    },
    {
      "title": "Great, but has room to improve.",
      "text": "Pool is pretty great. My dogs didn't chew it up like some other people have been saying. They love it. Only thing is I would recommend adding handles on the opposite side to the water spout so it's easier to empty out the last bit of water.",
      "rating": 5.0,
      "verified": true,
      "author": "Alina Kalinina",
      "helpful_votes": 0,
      "publication_date": 20200407
    },
    {
      "title": "Easy to Use",
      "text": "I am using this pool as my dog's bathtub, and I like it. It was easy to unpack and unfold, and it is easy to keep clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Dianne Sorrell",
      "helpful_votes": 0,
      "publication_date": 20191218
    },
    {
      "title": "I am completely satisfied with my purchase",
      "text": "My Cocker Spaniel ( 22 lb 5 weeks old) loves it. Filling it about half way seem about right. It appears well made and folds up for easy portability. Large was the perfect size. My dog splashes and jumps in and out with ease.",
      "rating": 5.0,
      "verified": true,
      "author": "John S",
      "helpful_votes": 0,
      "publication_date": 20180731
    },
    {
      "title": "1 year review",
      "text": "it torn after a year. we put it up after usage, light use but our dog.. but it has holes in it and is losing water quickly",
      "rating": 3.0,
      "verified": true,
      "author": "Bryahna Brewster",
      "helpful_votes": 0,
      "publication_date": 20200811
    },
    {
      "title": "Not durable",
      "text": "Nice size, all my GSD's loved it. It lasted one time. I drained it, dried it and folded it up when I observed a small tear in the floor. 😥 My boys loved this and had a great time, but I would not recommend for large or giant breed dogs....maybe calmer seniors would be ok?",
      "rating": 1.0,
      "verified": true,
      "author": "Heather S.",
      "helpful_votes": 0,
      "publication_date": 20190707
    },
    {
      "title": "Slow leak to begin and then progressively worse.",
      "text": "We liked the pool when it first arrived but there was a slow leak which required us to add water every couple of days. This wasn't a big deal for a while, but the leak continued to worsen over time and now it leaks to the point it is unusuable. I don't know if there is a warranty but when we finally tried to contact the seller after four months, it was apparently too late.",
      "rating": 2.0,
      "verified": true,
      "author": "Teri2035",
      "helpful_votes": 0,
      "publication_date": 20180929
    },
    {
      "title": "Not what I was expecting",
      "text": "For the price, it fell apart quickly. Not sturdy. I went out and purchased a $5.99 wadding pool for my dog which is holding up.",
      "rating": 1.0,
      "verified": true,
      "author": "Elizabeth Martinez",
      "helpful_votes": 2,
      "publication_date": 20190624
    },
    {
      "title": "Not just for dogs!",
      "text": "I bought this for my bunnies when they are indoors and it’s perfect. As they grew, the sides weren’t tall enough, so I had to add a perimeter pet pen. Even so, easy to move, clean and store.",
      "rating": 5.0,
      "verified": true,
      "author": "Marsha Lindsay",
      "helpful_votes": 0,
      "publication_date": 20191026
    },
    {
      "title": "Durable and easy to clean and store",
      "text": "The large size is perfect for our Labrador, he loves it and helps him cool down on hot days. We’ve been using it for nearly 4 months and have found it to be durable and easy to clean and store. No issues whatsoever!",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth L.",
      "helpful_votes": 0,
      "publication_date": 20200429
    },
    {
      "title": "Disappointed",
      "text": "We opened the pool up for the first time! So excited for our pup Bo to be able to have a cool place to chill this summer. Sadly , even before Bo was able to use it, we noticed a leak 🤦🏼‍♀️ We are so disappointed and are returning it.",
      "rating": 1.0,
      "verified": true,
      "author": "Pember",
      "helpful_votes": 0,
      "publication_date": 20200516
    },
    {
      "title": "It seemed like a good product",
      "text": "I only opened this one time to add water...so I dont think I can make accurate review...I have a big Malamute and he almost fit inside...then my puppy chewed it up...",
      "rating": 3.0,
      "verified": true,
      "author": "Joseph Torres's ",
      "helpful_votes": 0,
      "publication_date": 20191003
    },
    {
      "title": "Solid pool for the pups",
      "text": "Definitely a great size (the large) for one medium to large sized dog. Our pup is around 55-60lb and fits perfectly in this pool. Feels sturdy enough, we have filled and emptied it a few times now and had it in the serious heat. Hoping it will hold up all summer long!",
      "rating": 4.0,
      "verified": true,
      "author": "Jake Kenna",
      "helpful_votes": 0,
      "publication_date": 20180527
    },
    {
      "title": "Great product",
      "text": "Great product - my 30lb puppy has a blast! Easy to drain, very easy to store when dry",
      "rating": 5.0,
      "verified": true,
      "author": "V. Balagopal",
      "helpful_votes": 0,
      "publication_date": 20190928
    },
    {
      "title": "pretty good however...",
      "text": "for the most part this worked great! awesome way for my lab to cool off on hot days and he loves it. however after about a month of having it i noticed tiny little holes on the sides where water was going out. i usually would keep it full for a few days before changing the water so i didn’t waste and this would just drain by itself. currently trying to patch it up so i don’t have to spend another 80 dollars for a new one.",
      "rating": 4.0,
      "verified": true,
      "author": "anonymous ",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "Fun item for dogs, but not as sturdy/Durable as expected",
      "text": "Dogs love it and play in it a lot as they love their water, but the bottom already started getting holes which I was a bit disappointed considering this is supposed to be dog tough or as the ad says DURABLE, water now just drains out and its not even been a month since I got it and was actually able to start using it",
      "rating": 2.0,
      "verified": true,
      "author": "JamesG",
      "helpful_votes": 0,
      "publication_date": 20161001
    },
    {
      "title": "FUN!!!",
      "text": "This item is really good, just make sure you only fill to your dogs likeness. My dog loves it!",
      "rating": 5.0,
      "verified": true,
      "author": "sharon richardson",
      "helpful_votes": 0,
      "publication_date": 20191006
    },
    {
      "title": "I love it! It's the perfect size for my two ...",
      "text": "I love it! It's the perfect size for my two Yorkies, who are 12 lbs. and 6 lbs. And, it's not too scary for them, because I introduced it gradually without water at first, and rewarded them for being in it, etc. It's very sturdy construction as well. I'm VERY pleased!",
      "rating": 5.0,
      "verified": true,
      "author": "teacher gal",
      "helpful_votes": 0,
      "publication_date": 20180616
    },
    {
      "title": "I should have looked for an Extra-Large size of this item...it wasn’t offered here.",
      "text": "This is a fantastic pool for my dogs! Fantastic quality, easy to use. Enjoy!!!",
      "rating": 5.0,
      "verified": true,
      "author": "S. Radovsky",
      "helpful_votes": 2,
      "publication_date": 20180816
    },
    {
      "title": "Leaked from seams after two uses",
      "text": "It worked as described at first, but after a couple uses it began leaking from the seams. It only lasted about one month, only used twice, by dogs which only lay or walk in and out, without any scratching. Definitely not as durable as described. Very surprised it didn't last longer.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200707
    },
    {
      "title": "Weak bottom material",
      "text": "It worked great the first time we used it! The second time we filled it up (a couple weeks later) it had three large holes in the bottom. The bottom material is thin and easily torn/punctured/destroyed by bugs. For a pool this expensive I didn’t expect to have to fix leaks after only one use. If it gets worse we will have to throw it a away and buy a plastic one.",
      "rating": 1.0,
      "verified": true,
      "author": "April Hernandez",
      "helpful_votes": 0,
      "publication_date": 20200705
    },
    {
      "title": "Best puppy pool ever",
      "text": "Best puppy pool ever! I LOVE that it easily collapses so I can store it during the winter. Extremely durable. I have two water crazy pit bulls who rough and tumble around in this thing and there are no tears or anything. It drains easily and cleans easily.",
      "rating": 5.0,
      "verified": true,
      "author": "heatherleighx",
      "helpful_votes": 0,
      "publication_date": 20171117
    },
    {
      "title": "This is the BEST doggie pool on the market",
      "text": "This is the BEST doggie pool on the market. The large size is perfect for our 60 lb dog to run in and out of it. Doggie nails do not puncture this material. We had one that lasted 2 summers but we left it out instead of packing it up this winter and some critters chewed it up. We will take better care of this one.",
      "rating": 5.0,
      "verified": true,
      "author": "NS",
      "helpful_votes": 0,
      "publication_date": 20170808
    },
    {
      "title": "still working fine..",
      "text": "used it for puppies in the mud room..foldable to work in the space...still working fine....have old sleeping bags/quilts for the mess of puppies/mommy,,,and change/wash them regularly...did not use it for a pool..but think it would be fine..... it is thick on bottom, and if it did leak a little, in the yard...oh darn....i think this is a very good product...ricky",
      "rating": 5.0,
      "verified": true,
      "author": "Ricky",
      "helpful_votes": 0,
      "publication_date": 20151123
    },
    {
      "title": "Only lasted two days with my  lab puppy",
      "text": "Very much disliked that my lab puppy ( 1 year) chewed the sides up while I was at the grocery store! I never would have paid that much had I known that would happen. All the reviews were good so I went for it. Don’t get this pool if your dog is a chewer. Get the hard plastic $10 one that I should have chosen.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200428
    },
    {
      "title": "would recomend",
      "text": "Very easy set up and breakdown. Perfect for small yard on a very hot day. Fits 1 large adult and two medium sized dogs. Add shampoo and stir. Fun!!!!! Doubt I'll ever get it back in the carry bag though....",
      "rating": 5.0,
      "verified": true,
      "author": "jay",
      "helpful_votes": 0,
      "publication_date": 20170131
    },
    {
      "title": "After just a few uses, the inside plastic panels ...",
      "text": "After just a few uses, the inside plastic panels that make up the walls of the pool broke in half due to being too thin to withstand the weight of the water. When I contacted the seller, they informed me there was not a product malfunction and refused to work out a solution with me.",
      "rating": 1.0,
      "verified": true,
      "author": "Janice Lee, CA",
      "helpful_votes": 6,
      "publication_date": 20160812
    },
    {
      "title": "Don’t buy, the product failed after 32 days, just outside the Amazon 30 day return window.",
      "text": "Recommend that you don’t buy this product. The plastic sides between the panels stretched out allowing one side to flop out and dump the water. Very poor quality and not worth the money. Unfortunately the Amazon 30 Day return window had passed by 2 days when it failed",
      "rating": 1.0,
      "verified": true,
      "author": "Jerry W Mayfield",
      "helpful_votes": 0,
      "publication_date": 20200606
    },
    {
      "title": "Good for little kids, too.",
      "text": "I thought it was great, but my dog simply prefers the plastic cheap pools. However, my 4-year-old niece loves it!!",
      "rating": 5.0,
      "verified": true,
      "author": "Skitt5",
      "helpful_votes": 0,
      "publication_date": 20190902
    },
    {
      "title": "Way better than the plastic pools as the drain is on ...",
      "text": "Our inground pool that our golden retriever loves is being serviced and out of commission for a while (new liner needed). Our 9 year old girl loves the water. We bought this pool and as you can see she loves it! Way better than the plastic pools as the drain is on the side. Great buy!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180525
    },
    {
      "title": "Easy peasy",
      "text": "It is great! Our dog loves it and it keeps him busy and cool! Very easy to drain, fold and store, a great addition to vacation/visiting gear.",
      "rating": 5.0,
      "verified": true,
      "author": "marylisa Altomari",
      "helpful_votes": 0,
      "publication_date": 20190804
    },
    {
      "title": "So sad",
      "text": "My Saint Bernard punctured in in less than 2 hours :( sad I spent this much money to not have more than 2 hours of play time with it. Will return.",
      "rating": 1.0,
      "verified": true,
      "author": "margeaux",
      "helpful_votes": 0,
      "publication_date": 20200513
    },
    {
      "title": "... catch basin for my portable shower and it works great.",
      "text": "I bought it for a catch basin for my indpot portable shower and it works great. Here in remote Alaska an indoor shower in the cold months is a real treat. The pool fold's up real nice whenever I'm not using it. I do wish the drain was lower. All in all it's a great pool.",
      "rating": 5.0,
      "verified": true,
      "author": "dusty284",
      "helpful_votes": 0,
      "publication_date": 20161015
    },
    {
      "title": "Well made",
      "text": "Perfect size for my little puppy. She’s still trying to get use to water. I’m really happy with the durability of this item and have no worries of it tearing.",
      "rating": 5.0,
      "verified": true,
      "author": "amber r. schmidt",
      "helpful_votes": 0,
      "publication_date": 20200514
    },
    {
      "title": "Great pool!",
      "text": "This pool is great. We fill it up in the morning and drain it at night. The greyhounds LOVE it. They will run around in the yard, and after they are done will come and lay down in this pool. It is so easy to set up and take down that we can take this with us whenever we go somewhere with the dogs for a day when it is hot and not have to worry about them overheating!",
      "rating": 5.0,
      "verified": true,
      "author": "Kellie Spalding",
      "helpful_votes": 0,
      "publication_date": 20160715
    },
    {
      "title": "Safety Hazard",
      "text": "HORRIBLE RIP OFF! I've only had it out for my small dog to play in the last 3 weeks & it was so badly constructed that she was able to barely nibble on it and the entire thing collapsed. Then it became a safety hazard as the red & blue rubber pieces were blown across the yard by the wind and my dog could have eaten one and suffocated. And I go to return it and I'm told I can't get a refund since the \"window\" closed 72 hours earlier. They must have known EXACTLY how long their pool would last - 30 days but not 33! .",
      "rating": 1.0,
      "verified": true,
      "author": "HappyDog",
      "helpful_votes": 9,
      "publication_date": 20170524
    },
    {
      "title": "Great quality and sturdy.",
      "text": "My rescue dog..a German Shorthair..loves this ! We’ve had incredibly hot weather and this product has been wonderful . It’s high quality, easy to empty, and folds back up easily for storage. A great addition to our dog’s playtime!",
      "rating": 5.0,
      "verified": true,
      "author": "Suzanne Canuck",
      "helpful_votes": 0,
      "publication_date": 20180731
    },
    {
      "title": "dogs love it",
      "text": "great to have a place wear the dog can splash around on hot days, kids love to put their feet in while the dog cools off.",
      "rating": 5.0,
      "verified": true,
      "author": "Emily Greenberg",
      "helpful_votes": 0,
      "publication_date": 20200313
    }
  ],
  "product_meta": {
    "title": "FrontPet Foldable Dog Pool Pet Bathing Tub, Kiddie Pool, (Small - Extra Large)",
    "rating": 4.2,
    "feature_bullets": [
      "LARGE: Diameter of 50 inches and 12 inches deep.",
      "DURABLE: Constructed from extra-tough PVC material made for long lasting use. Perfect dog toy or pet toy for your animal",
      "SIMPLE USE: Simply fill with water and open sealed drain to empty before storage or transportation",
      "FUN: Give your dog something to enjoy in the summer heat and its large enough for you to hop in as well acting as a mini pool. Can also be used for a pet bathing tub",
      "PORTABLE: Pool drains and fold up and is easy to transport to bring with you and your dog everywhere. Can also be used as a dog pool, dog bath tub, outdoor water pond, fish pond, baby bathtub"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "50 x 50 x 11.8 inches; 10 Pounds",
      "Item model number": "FRO-LDP",
      "Date First Available": "May 21, 2015",
      "Manufacturer": "Frontpet",
      "ASIN": "B00XZM8Q2Y",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Grooming",
      "Dogs",
      "Shower & Bath Accessories",
      "Pet Supplies"
    ],
    "price": ""
  }
}