{
  "website_summaries": [
    {
      "verdict": "If you have a desire to give your existing set of smoke detectors a Smart Home feel, this Leeo device is a great addition. It can send information to your smartphone when it detects a problem, and it can call the fire department automatically if you don’t respond.",
      "pros": [
        "Offers connectivity with smartphone app",
        "Can automatically call authorities if you don’t respond to alarm",
        "Customers in reviews say device works well with many home networking setups",
        "Plugs into a wall outlet"
      ],
      "cons": [
        "Customer reviewers report alarm won’t pick up on signals from older smoke detectors",
        "Price is at higher end of market",
        "Connection to your home Wi-Fi network can be a little tricky for novices"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "Since it costs as much as the more capable Nest Protect, this device needs a price drop or a software upgrade before it can fully earn its keep.",
      "pros": [
        "The Leeo Smart Alert Nightlight is cleverly designed and easy to use",
        "The tiered alert system can reach out to an emergency contact if it can't reach you"
      ],
      "cons": [
        "The short recorded clip that accompanies the alerts isn't helpful, and you'll be left wondering what's going on in a potential moment of crisis"
      ],
      "aspects": {
        "Features": 5.0,
        "Usability": 7.0,
        "Design": 7.0,
        "Performance": 5.0
      },
      "publication_date": 20141021,
      "rating": 6.0,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "DO NOT BUY, NETWORK HAS BEEN SHUT DOWN",
      "text": "This company that runs Leeo ran out of money and was forced to shutdown the network indefinitely. Meaning everything that Leeo connected to, to operate, no longer exists. The app doesn’t work, etc. My Leeo is now a really expensive nightlight. Let it be known that Alexa Echos can now detect smoke alarms or other loud noises with guard mode.",
      "rating": 1.0,
      "verified": true,
      "author": "Ian",
      "helpful_votes": 19,
      "publication_date": 20191114
    },
    {
      "title": "Would've rated 5 starts but...",
      "text": "Yesterday a REAL alarm went off (burned food) and it didn't notify me. Now I have little faith it would work during a real emergency rendering it a 50 dollar nightlight. The frustrating thing is it notified me previously when it heard an alarm on TV, but not when a real alarm went off. ***UPDATE*** Our patio grill just set off our fire alarm. Leeo did NOT send a notification. Sigh...",
      "rating": 1.0,
      "verified": true,
      "author": "eloza777",
      "helpful_votes": 56,
      "publication_date": 20160804
    },
    {
      "title": "Do Not Purchase: Leeo ran out of money/shutting down iOS/Android access",
      "text": "Just received notice that Leeo is running out of money/will be stopping their Smart Alert network next month and customers will therefore no longer have access to using their iOS/Android devices to control/receive notifications from Leeo, rendering it practically useless. Do not buy one of these until you know for sure the company has been acquired by someone else who will keep the Smart Alert network alive for existing customers.",
      "rating": 1.0,
      "verified": true,
      "author": "Jolly Techie",
      "helpful_votes": 5,
      "publication_date": 20190828
    },
    {
      "title": "Everyone should own one.",
      "text": "I think everyone should own one of these. It has never failed to send me an alert when a smoke alarm goes off. It can hear my alarm downstairs and upstairs with ease. Never a false alarm. It pushes a notification and gives me a call. Makes me feel much better when I'm at work or traveling and my wife and/or dogs are home alone. The night light is a great feature as well. I made all of my family members buy one also. 1) Significantly cheaper then buying individual \"smart\" alarms. 2) Allowed my to buy a dual smoke alarm Photo and ion. 3) Listens AND distinguishes CO2 alarms 4) Night light",
      "rating": 5.0,
      "verified": true,
      "author": "D. Kaczmarek",
      "helpful_votes": 2,
      "publication_date": 20170612
    },
    {
      "title": "Company shutting down",
      "text": "ALERT! Excerpt from email from LEEO rec'd this morning stating: Unfortunately, we’re still facing a challenging situation and are unable to keep the network on. When the third-party services that Leeo has paid for that are required to support the network run out, the network will stop working. We expect that to be in the very near future. Your and our Smart Alert units will no longer be connected to the net, and the app will no longer function. -Jon Castor, Chairman",
      "rating": 1.0,
      "verified": true,
      "author": "KD Lady",
      "helpful_votes": 0,
      "publication_date": 20191029
    },
    {
      "title": "Possibly discontinuing iOS and Android support",
      "text": "I just got an email alerting me that the Smart Alert Network is more than likely shutting down around the end of September. I'd hold off on buying this product to find out more. This could make the device an expensive nightlight. I waiting to hear back from support for more information.",
      "rating": 5.0,
      "verified": true,
      "author": "RGC",
      "helpful_votes": 2,
      "publication_date": 20190829
    },
    {
      "title": "greed ruined this product",
      "text": "works great. i bought 3 at $50 each. then these two greedy guys started adding features that need subscriptions. then they got even more greedy and TRIPPLED the price of the unit. well, you know what happens to greedy people... it’s not a prime item anymore. oh well. i got mine at $50 each. i bought a ring alarm which is now owned by amazon and they are coming out with a device that’s the same as leeo for.....$40.",
      "rating": 2.0,
      "verified": true,
      "author": "Donutlou",
      "helpful_votes": 2,
      "publication_date": 20181227
    },
    {
      "title": "Company just sent an email: Shutting down services",
      "text": "I have mine for a few years. Works fine. Occasionally hung but appear to be working as other reviewers said. But most importantly, the company just sent out an email to announce that they are shutting down all services if they can not find new funding. If that happens, the device will be useless. So watch out.",
      "rating": 3.0,
      "verified": true,
      "author": "KP",
      "helpful_votes": 2,
      "publication_date": 20190828
    },
    {
      "title": "LEEO IS BANKRUPT!!! DO NOT BUY THIS DEVICE IT NOW HAS NO FUNCTIONALITY!!!",
      "text": "The Leeo device requires internet connectivity to their network. The company went bankrupt and took down the network. Not only does this mean that the device has no functionality, since the product is basically a listening device it is now a security risk. Anyone who has control over the network can listen in via your leeo device. Please report this information to Amazon. This product should not be allowed for sale on their site. Any suggestion that this device has any functionality is now a lie.",
      "rating": 1.0,
      "verified": true,
      "author": "R. E. Miller",
      "helpful_votes": 0,
      "publication_date": 20200221
    },
    {
      "title": "Leeo sent an email they are going out of business - don't buy these now!",
      "text": "I ordered 2 of these in Oct. 2017 and they are great devices BUT, they rely on a cloud network to notify your phone of any alarm condition. Leeo recently sent email notifying it's users that they have run out of money and will likely shut down their network at the end of Sept 2019 if they can't get someone to buy their assets and take over their network. As a result, the only functionality will be the night light - $195 for a night light is outrageous and it would be a mistake to buy this right now.",
      "rating": 1.0,
      "verified": true,
      "author": "Mike Medina",
      "helpful_votes": 2,
      "publication_date": 20190918
    },
    {
      "title": "Skip it",
      "text": "I was really excited about this product but it never recognized my alarms. Easy return",
      "rating": 1.0,
      "verified": true,
      "author": "Matt Patterson",
      "helpful_votes": 9,
      "publication_date": 20170306
    },
    {
      "title": "No longer works - network shut down",
      "text": "This was a great product when it was supported, but essentially the company has gone out of business as the product is no longer supported. Just a paper weight now.",
      "rating": 1.0,
      "verified": true,
      "author": "JS",
      "helpful_votes": 2,
      "publication_date": 20191205
    },
    {
      "title": "Awesome Product",
      "text": "This is a great and simple little product. For a very reasonable price, you can Internet enable your current smoke detectors. My wife was burning something in the kitchen, and I got a notification on my phone with audio of the alarms going off. It also does other cool things like measuring temperature and humidity, plus being a night light that you can change to any color you like. The design is sleek too. All in all, I like this little guy a lot.",
      "rating": 5.0,
      "verified": true,
      "author": "Jackson Stephens",
      "helpful_votes": 2,
      "publication_date": 20170506
    },
    {
      "title": "Going out of business, will not work soon, do not buy.",
      "text": "I bought mine four years ago, and it has worked great, always reported alarms, which thankfully were kitchen smoke related and not fires. It is a shame that the company is going out of business. I am unaware of any competing products that do what it does.",
      "rating": 1.0,
      "verified": true,
      "author": "SigDigitTop Contributor: Camping",
      "helpful_votes": 0,
      "publication_date": 20191029
    },
    {
      "title": "Expensive night light",
      "text": "Complete waste of money. Worked when I got it, and then like many others, it stopped working a few months later and now functions as a nice, but overly expensive night light. Company is going out of business. I would not buy at this point in time.",
      "rating": 1.0,
      "verified": true,
      "author": "Samara M.D.",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "Great idea - zero reliablity and follow through from company",
      "text": "This appeared to work until it didn't. I tested at 6 mos it worked... then at 10mos it wouldn't detect on testing. So very unreliable. Impossible to get support. Invest in a nest or some wifi cameras have the same sensor like Wyze or Yi Home",
      "rating": 1.0,
      "verified": true,
      "author": "goofy scuba",
      "helpful_votes": 0,
      "publication_date": 20190806
    },
    {
      "title": "Does what expected.",
      "text": "This is a pretty useful device. It has an awesome night light that you can control from your phone. The light can also be integrated into IFTTT (where I found this device). It does detect fire and carbon monoxide alarms, even if they are not close by. ONE DOWN SIDE... it will not detect a burglar alarm. I have a security system set up through Wink, which is not professionally monitored. I was hoping that this would be a solution. It is not! It cannot detect any alarm you wish. If it could, this would be 5 stars! Hopefully, this may be part of Leeo's future!!!",
      "rating": 4.0,
      "verified": true,
      "author": "EH",
      "helpful_votes": 0,
      "publication_date": 20170207
    },
    {
      "title": "Now, two years later. It keeps loosing its connection.",
      "text": "Update: it keeps loosing its connection to its server. And there is no notification. So you can go months without an protection and never know it. To regain that connection you have to delete your accounts and read add them. I gave up on the product. One demerit since the temperature and humidity indicators are way off. the temperature is of by 10 degrees. It also looses its internet connection frequently so there are large gaps in the line graphs. Very solid unit. Set up is fairly clear and quick. It does have trouble recognizing some smoke/CO2 alarms. I have two, it recognized one, but not the other during testing. That they need to improve on.",
      "rating": 1.0,
      "verified": true,
      "author": "PN",
      "helpful_votes": 0,
      "publication_date": 20180203
    },
    {
      "title": "It simply didn't work. I tried setting it up ...",
      "text": "It simply didn't work. I tried setting it up with two brand new smoke alarms, and two brand new carbon monoxide detectors, and it just wasn't reliably picking up on the sounds of the alarms, regardless of how closely I placed it to them. The smoke alarms weren't picked up at all, and only one of the carbon monoxide alarms were, but only every third time or so. We bought this for peace of mind for when we're not home with our pets, but it's far too unreliable for that.",
      "rating": 1.0,
      "verified": true,
      "author": "Justin",
      "helpful_votes": 6,
      "publication_date": 20160815
    },
    {
      "title": "Worth every penny \"",
      "text": "Easy to setup, Cool humidity and temperature readings right at your fingertips \"week and month long graphs showing average temperature and humidity throughout the day\" Best of all no subscription or membership fees' have peace of mind knowing your house or property is being monitored for carbon monoxide and smoke detection and it alerts your phone immediately! Don't be a cheapskate just buy it 👍🏻",
      "rating": 5.0,
      "verified": true,
      "author": "Best Life ‘",
      "helpful_votes": 0,
      "publication_date": 20171122
    },
    {
      "title": "Not good enough.",
      "text": "This product ONLY works with a select few smoke detectors. It also in testing, wouldn't consistently notify the primary phone number listed to contact. If you truly were relying on this product to notify you in an emergency you very possibly could be SOL. It also took customer service over three days to respond to emails.",
      "rating": 1.0,
      "verified": true,
      "author": "brent",
      "helpful_votes": 3,
      "publication_date": 20170427
    },
    {
      "title": "LEEO monitor",
      "text": "We have several of these in our home and the nightlight function is exceptional, the environmental monitor seems accurate and the units appear to function as advertised regarding alarm detection (worked on test). The only concern that I had, with the last monitor, was that the unit's box seals had been opened previously, one of the protective shrouds on the unit was not affixed properly and there was moisture (droplets) underneath the improperly affixed shroud; the unit appears to be functioning properly so I will keep the unit. The other units I ordered were all sealed properly.",
      "rating": 5.0,
      "verified": true,
      "author": "Ronnie",
      "helpful_votes": 0,
      "publication_date": 20160904
    },
    {
      "title": "Piece of mind.",
      "text": "I have it over 2 years now. Last month contractor was installing tile in house. I wasn’t home. He was cutting a tile and made lots a dust tripped fire alarm. I got the warning right the way. Called the guy asked him if everything was ok. He was surprised how I knew. I let him listen to alarm sound from app. It is pretty cool. Piece of mind. Highly recommend it, going to buy more gift to my family and friends.",
      "rating": 5.0,
      "verified": true,
      "author": "EA",
      "helpful_votes": 0,
      "publication_date": 20180102
    },
    {
      "title": "Great idea",
      "text": "Very clever idea that this unit uses. With this unit you can use your inexpensive detectors and still have a smart home vibe. The other \"connected\" smoke detectors start at twice what ths unit does and can potentially cover a larger area than one of those expensive units. This monitors for the alarm frequency of your existing alarm and when it receives the sound it starts to call pre-arranged phone numbers to inform them something is up. I have two numbers set but i think you can have more. I tested it with smoke the alarms kicked in then this unit responded to the alarms and notified me and my other notifier. Nice.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Back",
      "helpful_votes": 0,
      "publication_date": 20161103
    },
    {
      "title": "Amazon should provide service.",
      "text": "I loved the device, while it worked. As pointed out in other recent reviews, the company ceased support. Amazon could buy the support software, and use just a smidgen of one of their AWS servers to provide the service to all of those that bought these on Amazon. Please, help us!",
      "rating": 1.0,
      "verified": true,
      "author": "mjb",
      "helpful_votes": 0,
      "publication_date": 20200207
    },
    {
      "title": "Better alternative than adding these individual sensors to an alarm system",
      "text": "Easy to set up and verify that it's working. This thing just listens for a alarm and then sends a message through your Wi-Fi system to monitoring station who then sends you a Text or email message and calls multiple phone numbers when an alarm activates. The night light is very bright. You can adjust the on and off sensitivity and adjust the color to any color. Works with smoke detectors, carbon monoxide detectors and flood/leak detectors. The monitoring service is included for free!",
      "rating": 5.0,
      "verified": true,
      "author": "Tom Moon",
      "helpful_votes": 2,
      "publication_date": 20170507
    },
    {
      "title": "I’m so so so glad I purchased this item for my dad’s home",
      "text": "I’m so so so glad I purchased this item for my dad’s home. He is handicap and it literally saved his life last night. I received the call from the Leo System around 3:45 AM that a fire alarm was sounding in his home & I was able to call 911 so the emergency responders could get to him in time! Thank you so much for an affordable & completely user friendly product. I will be purchasing one for my personal home now too! So many many heartfelt thanks Lleo!!!! ❤️❤️❤️",
      "rating": 5.0,
      "verified": true,
      "author": "Aaron or Carman Ward",
      "helpful_votes": 0,
      "publication_date": 20180316
    },
    {
      "title": "Off to a good start",
      "text": "The setup was smooth with only a minor (~5 min) delay as the unit downloaded new software. The monitor was compatible with our smoke, carbon monoxide, and water detectors. I placed the unit in a relatively quiet location to avoid any potential \"echo\" issues associated with multiple interconnected smoke detectors going off at the same time. I tested the unit a couple of times and each time it was able to successfully call my cell phone with an alert. This appears to be the only product by this firm and I wonder what is ahead for this firm. I'll update this review quickly if I run into any significant problems.",
      "rating": 5.0,
      "verified": true,
      "author": "Luap",
      "helpful_votes": 0,
      "publication_date": 20170219
    },
    {
      "title": "Cannot be trusted to work. Company going under.",
      "text": "Randomly does not work. Every time we leave our home we have to test it to be sure its working. The other reviews are right, an over priced night light. Edit: I received an email that the company is going under and the unit will not work any longer. It's now a paperweight. At least burning the $50 spent on this hunk of junk would have been entertaining. I hope the owners are proud of their failure.",
      "rating": 1.0,
      "verified": true,
      "author": "KDEL",
      "helpful_votes": 0,
      "publication_date": 20180903
    },
    {
      "title": "Good concept bad execution.",
      "text": "Leeo is a great concept but lacks in execution. I plugged it in and created an account on the app. However after multiple tries, I was unable to log into the app on my Nexus 6P. Always kept on saying - sorry, could not connect. Please try again later.",
      "rating": 1.0,
      "verified": true,
      "author": "Rahul Pandit",
      "helpful_votes": 3,
      "publication_date": 20170416
    },
    {
      "title": "Works Great Aboard A Boat at Dock Side",
      "text": "I purchased and installed this to monitor a large boat for CO2 and Smoke Alarm. The set up was very easy and with strong WI FI we have no issues using this onboard. I did notice the temperature appeared to be reading high a few degrees. I turned down the brightness of the night light as the unit appeared warm to the touch. Overall very pleases with this devce. I also have 2 smoke alarms on board and 2 hard wired CO2 alarms and in test mode it was able to recognize and distinguish the difference from each alarm sound.",
      "rating": 4.0,
      "verified": true,
      "author": "Scott D",
      "helpful_votes": 0,
      "publication_date": 20170729
    },
    {
      "title": "Great peace of mind",
      "text": "UPDATE 9/6/19- DO NOT BUY! Company has sent an email saying they're running out of money and the app/device will likely stop working 9/30/19 unless someone buys the company. I'll update this review when they update us again. Initial review: I love this little device! My husband and I both work full time, and this provides great peace of mind. The only downside is that if the WiFi goes down, it doesn't work. That said, it's nice having and a truly great deal, as there isn't a subscription involved.",
      "rating": 1.0,
      "verified": true,
      "author": "alphajuice14",
      "helpful_votes": 0,
      "publication_date": 20170423
    },
    {
      "title": "Really works!",
      "text": "I have had Leeo for quite some time now. Works just fine. Have to reset him if you change your router and sometimes if the power goes out. We like the night light feature as well. They just sent me an email with some new feature but that would require a monthly subscription.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Stone",
      "helpful_votes": 0,
      "publication_date": 20180408
    },
    {
      "title": "Be VERY careful",
      "text": "Ok, I have this alert device synched up to my wifi, went through the \"test alarm\" sequence with a \"Basement Watchdog\" water sensor alarm which was successfully heard by this LEEO system as it sent a message to my phone that the alarm was recognized ... \"and had it been an actual water alarm the LEEO system would send a push notification to my device and call my cell. My checked my settings to ensure my phone is allowing push notifications from the App ... I did an actual test and I did NOT receive notification via push or call from LEEO. WTH?",
      "rating": 1.0,
      "verified": true,
      "author": "Jon A.",
      "helpful_votes": 0,
      "publication_date": 20180313
    },
    {
      "title": "Amazingly good",
      "text": "WOW it is amazing. I am a simple guy and I want something simple, easy to install and efficient - Leeo is the answer. Why would I want to pay $700 for other alarm systems to change the entire fire alarms in the house while I have this device? It took me 15 min to set it up and worked first time. Send me a notification with my recorded house alarm :~) - very impressive. Also, the device looks sexy in the living room since I have an outlet high on the wall. I have been searching for something like that in last 2 years. Finally I found it.",
      "rating": 5.0,
      "verified": true,
      "author": "Ed",
      "helpful_votes": 0,
      "publication_date": 20170928
    },
    {
      "title": "Good, but needs better support",
      "text": "Purchased in Dec 2015 and it was working like a charm until a month ago. Won’t connect and we have done multiple factory resets. Am going back and forth with customer service right now. Hope to get a resolution.",
      "rating": 2.0,
      "verified": true,
      "author": "bethany barch",
      "helpful_votes": 2,
      "publication_date": 20180426
    },
    {
      "title": "Works as advertised",
      "text": "Worked pretty well detecting my smoke and carbon monoxide alarms. I've manually triggered them a few times to test and always works as expected. The night light is bright and efficient. The chart on temperature and humidity is a nice bonus. It's a nice device that I hope I'll never have to use, just like insurance.",
      "rating": 5.0,
      "verified": true,
      "author": "Bruno Soares",
      "helpful_votes": 2,
      "publication_date": 20170221
    },
    {
      "title": "Price jumped from $50 to $200!!!",
      "text": "I've had my Leeo for about 2 years and it works great. No complaints about Leeo functionality at all, but the price jumping from $50 to $200 really rubs me the wrong way and I will definitely seek an alternative product next time around.",
      "rating": 3.0,
      "verified": true,
      "author": "Jesse",
      "helpful_votes": 2,
      "publication_date": 20190513
    },
    {
      "title": "Great way to get alerts on your smart phone",
      "text": "So far so good. Hopefully I will never have to find out if it works in a real situation. Wanted to get smart smoke detectors for the house so I could get alerts on my smart phone if a detector went off. But the cost of smart smoke detectors made it impractical. This allows you to use regular smoke (and carbon dioxide) detectors and still get alerts on your phone. Setup was easy, I have it installed in the center of my house (approx 1700 sq ft / one story) and it seems to detector all detectors in the house. Even can be used as a night light.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20170608
    },
    {
      "title": "Great product",
      "text": "Wish I could buy more at price I got this one. Works well.. even alerted to fire alarm on TV. Called my cell phone while I was watching tv at home! It works. Gave one as present to friend and they also love the security since they also have pets inside when they are away.",
      "rating": 5.0,
      "verified": true,
      "author": "Ruth S.",
      "helpful_votes": 0,
      "publication_date": 20190820
    },
    {
      "title": "Wow,great product for peace in mind",
      "text": "Wow,how this come in the easy way to remote monitor fire alarm when i don't want to replace all smoke alarm.I add battery power supply and one security camera .Modem and wifi router all on back up when power is out and this fire alarm still on watch for while (depend on power back up size).Thanks for genius product and the price is afordable.).I wish the APP can be add more users in the same house so notify can sent to all.",
      "rating": 5.0,
      "verified": true,
      "author": "Quang Truong",
      "helpful_votes": 0,
      "publication_date": 20171217
    },
    {
      "title": "Get it..easy setup and great feature for what it is!",
      "text": "Awesome product and great concept, originally was going to get the kidde verson of this but it doesn't offer the extra features like night light, temp and humidity..very well built and not over priced..plus the reviews on the RemoteLync Smart Home Monitor for your Alarms one was really bad, and lately kidde products are having a lot of issues had to replace 2 fire alarm because they were defective found out they also had open recalls which they replaced for free but still question reliably...",
      "rating": 5.0,
      "verified": true,
      "author": "mikey1",
      "helpful_votes": 0,
      "publication_date": 20151225
    },
    {
      "title": "Goo concept and execution. Value for money.",
      "text": "All you need is one device in a inter-connected home, which most new homes are. IMO better option than having mutiple ROOST batteries and replacing all detectors with NEST. You do get phone call and in app alerts that is great. My only wish is that Leeo comes up with a centralized monitoring service or partnership like ADT canopy, to provide little extra peace of mind and homeowner policy discount :)",
      "rating": 4.0,
      "verified": true,
      "author": "Gaurav Vijaywargia",
      "helpful_votes": 2,
      "publication_date": 20160322
    },
    {
      "title": "Great concept and brilliant execution!",
      "text": "I love the simple design and functionality. Installed in less than 5 minutes, updated automatically and tested as desired. I was seeking \"away\" notification without replacing existing detectors. The environment monitoring/reporting to the app are a fantastic plus! I did have to check the Leeo web site as the device would not connect and update to an hidden network. That was quickly resolved by exposing the network, allowing the device to update and store information, then hiding the network again. Great concept and brilliant execution!",
      "rating": 5.0,
      "verified": true,
      "author": "Ziellos",
      "helpful_votes": 2,
      "publication_date": 20170107
    },
    {
      "title": "Dont waste your money",
      "text": "The leeo worked great for about 6 months and then stopped working. I contacted customer service and they gave me all sorts of steps to try and nothing has worked. They are not helpful at all and now I'm stuck with a $50 nightlight because that's all that it's good for now. What a waste of money!",
      "rating": 1.0,
      "verified": true,
      "author": "brady farr",
      "helpful_votes": 0,
      "publication_date": 20171218
    },
    {
      "title": "They sent it to me to Canada, but the ...",
      "text": "They sent it to me to Canada, but the app isn't available here. The Leeo support simply told we're not supporting Canada. had to ask my US friend to download and extract app from his phone to be able to use it as a night light, and added IFTT integration to notify me if there will be rain or sun the next day using the light colour",
      "rating": 3.0,
      "verified": true,
      "author": "Stanislav",
      "helpful_votes": 0,
      "publication_date": 20170415
    },
    {
      "title": "Broke in less than a year. Support was not responsive",
      "text": "Worked Ok for a while. Was prone to false alarms, but when I actually had smoke alarms it worked well. One day after about 10 months of use it just stopped working. Did a hard reset, nothing. Reached out to tech support, told them I had already performed a hard reset, so they suggested another type of reset. I performed that procedure, and it didn't work. Emailed them back repeatedly and received no response for a few weeks. So in short, its works OK, but quality is an issue and it probably wont last very long.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190220
    },
    {
      "title": "Doesn't work with all smoke detectors.",
      "text": "I wanted to like this device. Setup was easy but our detectors are made by Universal Security Instruments and it doesn't work with them. This is surprising since USI is a large manufacturer of smoke detectors. Apparently they emit a T3 tone that isn't quite what the Leeo is looking for. So I'm sending it back. Maybe I'll try the Roost battery but that doesn't get as good reviews. Leeo does have great customer support though!",
      "rating": 3.0,
      "verified": true,
      "author": "Tucker",
      "helpful_votes": 0,
      "publication_date": 20160105
    },
    {
      "title": "I got it on sale for 30$ and i pretty much forgot of this device for a while",
      "text": "I got it on sale for 30$ and i pretty much forgot of this device for a while. Other day we have some repair work which requires welding that produces some big smoke. I did receive a call from 1800 number (Leeo) alerting me that my home is having a fire alert and asking me to confirm its true or false alarm. So i know this device really works and it changed its color to red when there is smoke. :-)",
      "rating": 4.0,
      "verified": true,
      "author": "Solaris",
      "helpful_votes": 0,
      "publication_date": 20180109
    },
    {
      "title": "Drops connection too often.",
      "text": "Loses connection way too often. Almost on a weekly basis I get a notification that the LEEO has lost connection. It will usually reconnect after an hour or so but not always. A few times now I've had to power cycle the thing to get it to reconnect. Don't reccomend.",
      "rating": 2.0,
      "verified": true,
      "author": "Scott Yelof",
      "helpful_votes": 0,
      "publication_date": 20170711
    },
    {
      "title": "I absolutely love this product",
      "text": "I absolutely love this product! The functionality, looks, and app are all great. Unfortunately, I was unable to get this completely working on my network. Customer service was great, but there still wasn't a work around. I wish we could have found a solution, as this is the best and most affordable way to add \"smarts\" to your smoke/CO monitor. Now I may have to purchase some other solution which will cost a fortune compared to this Leeo. I highly recommend this product!",
      "rating": 5.0,
      "verified": true,
      "author": "Paul A Rehm",
      "helpful_votes": 0,
      "publication_date": 20160607
    },
    {
      "title": "This thing is pretty neat. I was cooking and the smoke detector ...",
      "text": "This thing is pretty neat. I was cooking and the smoke detector went off and there was an alert on my phone letting me know it had gone off. I've only got a 1000 sqft house, and the device here is within 10 feet, no walls, of the alarms, so I can't speak to any distance detection; I've placed it as close as possible. The nightlight is really nice, I needed one in the hallway anyway. At it's lowest brightness setting, it can still be a little too bright, but maybe it's because we picked a really light color like Blue. It might be tamer with a Red.",
      "rating": 5.0,
      "verified": true,
      "author": "Nicholas W. Wright",
      "helpful_votes": 0,
      "publication_date": 20170306
    },
    {
      "title": "Great nightlight with bonus features",
      "text": "Neat little product, I bought it primarily as a smart nightlight, programmed through IFTTT to come on at bedtime, go off in the morning. Changes color to tell me tomorrows weather. Plus the added security of being notified if my fire detector goes off is great (never need it until you do). It gets warm even when the light is off, so I imagine it draws a lot of power just listening, but it can't be that much...",
      "rating": 5.0,
      "verified": true,
      "author": "Joseph",
      "helpful_votes": 0,
      "publication_date": 20160617
    },
    {
      "title": "Love it!",
      "text": "Works like a charm! Quick and easy to set up. One time there was a smoke detector activating on the television and my Leeo was activated! ha ha! I also like that as I run my humidifier in the house, I can go to my Leeo app and see what the humidity really is. When I'm not at home, I know when the power goes out because my Leeo alerts me that it has lost connectivity. I would definitely recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "John F. LaRocque",
      "helpful_votes": 0,
      "publication_date": 20180407
    },
    {
      "title": "Pretty cool product, but not as great as I hoped.",
      "text": "Cool product, range is not what I hoped. Surely needs one per floor in the house, and frankly If its not central it wont pick up the other end of the house. Besides that, the function of the unit is great. Personally, I would rather invest in the NEST device that functions as an actual detector AND notifies.",
      "rating": 3.0,
      "verified": true,
      "author": "Tyler Tornstrom",
      "helpful_votes": 0,
      "publication_date": 20180227
    },
    {
      "title": "My Leeo just stopped communicating one day. Noticed the ...",
      "text": "My Leeo just stopped communicating one day. Noticed the light on the unit turned on, l keep it turned off. The app no longer communicates with the unit. I reset it and tried again without any luck.",
      "rating": 1.0,
      "verified": true,
      "author": "Christopherguth",
      "helpful_votes": 0,
      "publication_date": 20171231
    },
    {
      "title": "Overpriced nightlight",
      "text": "Worst purchase I've made in a while. Won't recognize my alarms that are only 8 years old , 11 in the house total . Tested too many times to count and do not feel comfortable relying on a product that is so unreliable!!",
      "rating": 1.0,
      "verified": true,
      "author": "Kudi777",
      "helpful_votes": 0,
      "publication_date": 20180102
    },
    {
      "title": "A solid addition to any smart home.",
      "text": "It works exactly as described. It can track temp, humidity, smoke and CO alarms which can be tied together with other smart systems through IFTTT systems. The light is bright and useful in my bigger living area as most smaller plug lights don't quite have enough glow. Will be keeping an eye on this brand for future products for sure.",
      "rating": 5.0,
      "verified": true,
      "author": "Doug",
      "helpful_votes": 0,
      "publication_date": 20170324
    },
    {
      "title": "Got this on a great lightning deal",
      "text": "Got this on a great lightning deal. Setup was simple. Hopefully I'll never have to receive an alert that turns out to be an actual fire, but it's nice to know I'll be notified and have a chance to take some action. The light is a nice nightlight that helps my children navigate a hallway at night. The temperature and humidity readings go nicely with my smart thermostat which is located on a different floor. I'm pleased with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Dave in NJ",
      "helpful_votes": 0,
      "publication_date": 20170728
    },
    {
      "title": "Leeo is an inexpensive solution to alarm monitoring. It ...",
      "text": "Leeo is an inexpensive solution to alarm monitoring. It connects via WiFi to the internet. It monitors your alarms, temperature and humidity. It can also serve as a nightlight or remotely activated light. The Leeo learns what alarms you have and can tell what type(only for newer alarms) of alarm is sounding. You can set limits for temperature and humidity.",
      "rating": 5.0,
      "verified": true,
      "author": "John Urish",
      "helpful_votes": 0,
      "publication_date": 20170304
    },
    {
      "title": "In April 2018 they added one of the most valuable ...",
      "text": "In April 2018 they added one of the most valuable features - a loud noise detector. This would allow a traditional siren alarm to trigger a Leeo alert. Unfortunately, they are charging $4.99 a month for this new feature. Slimy move.",
      "rating": 1.0,
      "verified": true,
      "author": "G. Chamak",
      "helpful_votes": 0,
      "publication_date": 20180408
    },
    {
      "title": "Great night light (not so sure about alarm monitor)",
      "text": "This product is a fantastic web controlled RGB led nightlight. It does a terrible job detecting my smoke and CO alarms though. Out of all of my tests, it worked about 5% of the time. Luckily I enjoy gadgets like LED nightlights. The light sensor works very well.",
      "rating": 3.0,
      "verified": true,
      "author": "Andrew S",
      "helpful_votes": 2,
      "publication_date": 20160519
    },
    {
      "title": "Too easy! Love it.",
      "text": "Simple, very simple, easy, very easy, it does what it says. The alarm reporting feature does really work and works well. I love the nightlight feature and the recolor option. The app connects every time no problem. Never falls off of the network. Maintenance free.",
      "rating": 5.0,
      "verified": true,
      "author": "Troy Vogel",
      "helpful_votes": 2,
      "publication_date": 20160329
    },
    {
      "title": "works pretty good, needs to be close to WiFi to ...",
      "text": "works pretty good, needs to be close to WiFi to connect. Will loose connection even close to WiFi once per week or so which can be frustrating and question in your mind if it is really connected when you need it. We have a dog kennel that we monitor temp/alarms in so was hoping for a little better reliability. Need to unplug every time it disconnects and plug back in. Kennel is 50' from home so understand the disconnect issues there. Used in house as well however with reduced issues but still the one disconnect every week or two in the house next to the wifi router. I would buy again I think.",
      "rating": 4.0,
      "verified": true,
      "author": "Brett Nearman",
      "helpful_votes": 0,
      "publication_date": 20161223
    },
    {
      "title": "Good Idea",
      "text": "Cheap and integrates with IFTTT, I wish these guys the best, hope they do well and expand. BTW if you own an android phone you'd best have 4.4. Do not let it call 911, do that yourself if you are away from home. 911 is regional so you will need to get the alternate number from the 911 center where the house is if you want anyone to come.",
      "rating": 5.0,
      "verified": true,
      "author": "Davo",
      "helpful_votes": 0,
      "publication_date": 20170112
    },
    {
      "title": "Partially defective",
      "text": "The smoke and CO alarms worked when tested. Unfortunately, I found the the thermometer and humidity readings to be inaccurate. The thermometer understates the temperature by at least 3F and the humidity percentage is off by about 5%. I have compared these readings to two other calibrated thermometers and I'm certain that the the Leeo product is inaccurate. I contacted customer service and was advised to unplug to re-calibrate. It didn't work. Since there is no means to re-calibrate, I have no choice but to return the device as defective.",
      "rating": 3.0,
      "verified": true,
      "author": "Oceanic16",
      "helpful_votes": 0,
      "publication_date": 20170426
    },
    {
      "title": "Love love this idea and device",
      "text": "I'm loving this so much! It's a great idea, no brilliant idea! Now that IFTTT is supported, I do a few more things with it, like have it change colors based on tomorrow's forecast for a couple hours before bed. Now if they would only get it integrated with wink, I'd be that much happier!",
      "rating": 5.0,
      "verified": true,
      "author": "Indyrobb",
      "helpful_votes": 0,
      "publication_date": 20160521
    },
    {
      "title": "Such a sweet gadget. I was able to set up 6 ...",
      "text": "Such a sweet gadget. I was able to set up 6 smoke and 2 COs without issue. 2 of which are one the basement of my ranch. The humidity sensor is a bit off from other hydrometer I tested against. It's about 10 perfect off. The temp matches my thermostat. I also like how I get notified if it loose connection so I can assume the house lost power if I am not home.",
      "rating": 5.0,
      "verified": true,
      "author": "ChinoXS203",
      "helpful_votes": 0,
      "publication_date": 20160621
    },
    {
      "title": "So this will handle a few smoke detectors around your house as long as they are with in audible range. I have a three level home",
      "text": "So this will handle a few smoke detectors around your house as long as they are with in audible range. I have a three level home and the smoke detectors are close to the stair ways so the sound travels. This is on the middle floor close to the stairs and picked up on all three levels during the test modes. Very nice unit.",
      "rating": 5.0,
      "verified": true,
      "author": "Jimmy",
      "helpful_votes": 0,
      "publication_date": 20171106
    },
    {
      "title": "I recommend this product.",
      "text": "I recommend this product. I found it worked very well. I like the fact that if I don't answer my cellphone when this unit detects a smoke/CO alarm, it will call a programmable emergency contact. I found the setup to be relatively easy. The light is very easy to customize. The only issue I encountered when setting up the unit was the Smart Alarm wouldn't connect with my cellphone via Bluetooth. If that happens to you, reinstall the app and it should work.",
      "rating": 5.0,
      "verified": true,
      "author": "Nighthawk",
      "helpful_votes": 0,
      "publication_date": 20170902
    },
    {
      "title": "Nice and simple to use",
      "text": "Nice and simple to use. I haven't had any connectivity problems or other issues. I like that I can also use it of If This Then That (IFTT) and change the nightlight color based on tomorrow's weather report!",
      "rating": 5.0,
      "verified": true,
      "author": "P. Olson",
      "helpful_votes": 0,
      "publication_date": 20171213
    },
    {
      "title": "Great smart device for monitoring alarms when you aren't home",
      "text": "This smart device is very easy to setup. You use the app and connect to it via Bluetooth for initial setup. After that you use the app to have it listen to tests of each alarm type in your home. It also monitors temperature and humidity levels, which is great for those with basements such as myself.",
      "rating": 5.0,
      "verified": true,
      "author": "The Fox",
      "helpful_votes": 0,
      "publication_date": 20170205
    },
    {
      "title": "I have it setup on the first floor, as ...",
      "text": "I have it setup on the first floor, as it picks up alarm test from basement and most of the rooms on the 2nd floor. One flaw is that it won't be able to connect to hidden SSID, hope there's a fix for it. Thanks",
      "rating": 4.0,
      "verified": true,
      "author": "Total Random",
      "helpful_votes": 0,
      "publication_date": 20170411
    },
    {
      "title": "Awesome little smart home night light",
      "text": "This is a pretty neat peice of hardware. My family really likes the Leeo. It works with the IFTTT channel and changes color depending on the next day's weather. It also picks up smoke alarm sounds even on a different floor. Got a notification from Leeo while at work that my alarm was going off when my wife burned a surprise dinner. I really recommend this product if you're looking for a low cost smart home product.",
      "rating": 5.0,
      "verified": true,
      "author": "Zachary",
      "helpful_votes": 0,
      "publication_date": 20170407
    },
    {
      "title": "Connects to phone and Wifi just fine. Held smoke alarm six inches in front of ...",
      "text": "Does not detect new smoke alarm. Alarm has same alert pattern as in example. Connects to phone and Wifi just fine. Held smoke alarm six inches in front of Leeo, still did not detect. Just an overpriced nightlight...junk",
      "rating": 1.0,
      "verified": true,
      "author": "Lawman12",
      "helpful_votes": 3,
      "publication_date": 20170322
    },
    {
      "title": "The perfect solution and a great device.",
      "text": "I’d been looking at wifi based smoke/co2/water sensors to alert me if I wasn’t home when they went off. A co-worker told me about these and they work great. It’s in a spot where it can hear the alarms and where we needed a nightlight so it served both well. Highly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "RobertB",
      "helpful_votes": 0,
      "publication_date": 20171217
    },
    {
      "title": "Goodbye leeo ....",
      "text": "My leeo has been dead for 2 days, can't logon to server. Good bye leeo .... Easy to set up and it works with my smoke and CO alarms that are less than a year old. Like the FAQ said, the alarms must be no more than 7 years old for the device to recognize the alarm. It would be nice if it would also work with my burglar alarm that has a pulsing tone, but maybe a future upgrade would support this .",
      "rating": 4.0,
      "verified": true,
      "author": "John Reynolds",
      "helpful_votes": 0,
      "publication_date": 20170716
    },
    {
      "title": "Can't guarantee it will work, but it's good enough for me!",
      "text": "Really enjoy the peace of mind that comes with the Leeo. Hasn't failed a test I've thrown at it yet. I know I can't be 100% sure it's going to come through in an emergency, but just knowing it's there is good enough for me. Cool idea- much cheaper than a Nest Protect!",
      "rating": 5.0,
      "verified": true,
      "author": "holodoctor1",
      "helpful_votes": 0,
      "publication_date": 20170322
    },
    {
      "title": "Nice quality product",
      "text": "Nice quality product, high tech gadged, 100% recomended to use with your old technology smoke detectors. One simple objection.. you cannot use the \"emergency call feature\" offside USA.",
      "rating": 5.0,
      "verified": true,
      "author": "Aldo Portillo",
      "helpful_votes": 0,
      "publication_date": 20180108
    },
    {
      "title": "Very useful.",
      "text": "Very useful. Get an instant remote report of smoke alarms, loss of electrical power, low or high humidity, and low or high temperature. Great if you travel and live in a cold environment and have unreliable electrical power.",
      "rating": 5.0,
      "verified": true,
      "author": "John P. Langmore",
      "helpful_votes": 2,
      "publication_date": 20160228
    },
    {
      "title": "Infrastructure was discontinued. The device is now a bad night light.",
      "text": "The network infrastructure is offline now. This device was nice while the company was afloat, but now it is just an expensive nightlight.",
      "rating": 1.0,
      "verified": true,
      "author": "Steven",
      "helpful_votes": 0,
      "publication_date": 20191206
    },
    {
      "title": "It works!",
      "text": "I have had Leeo for over a year (maybe two years?) because I live in California and my dogs are locked inside when I’m gone. My biggest fear is that they would be trapped in an emergency. Today I accidentally set off the smoke detectors. Leeo responded immediately alerting my phone of the alarm and location. It even called our contact numbers with a recording of the alarm so that we could determine whether it was an emergency! I am so impressed! So worth the peace of mind.",
      "rating": 5.0,
      "verified": true,
      "author": "Holly McDonough",
      "helpful_votes": 0,
      "publication_date": 20190325
    },
    {
      "title": "Works well, detects alarm and send SMS to your ...",
      "text": "Works well, detects alarm and send SMS to your mobile phone and call the emergency contacts. The only drawback is when it's really quiet at night, the HAVC fan noise somehow could trigger the sensor and let it call the phones, have to move the sensor away at some distance to avoid false alarm. But not a big deal.",
      "rating": 4.0,
      "verified": true,
      "author": "JIE",
      "helpful_votes": 0,
      "publication_date": 20171127
    },
    {
      "title": "No longer works",
      "text": "No longer supports alerting you via app or phone. Useless!",
      "rating": 1.0,
      "verified": true,
      "author": "Lauren",
      "helpful_votes": 0,
      "publication_date": 20191029
    },
    {
      "title": "Easy to set up for monitoring if a smoke/CO alarm ...",
      "text": "Easy to set up for monitoring if a smoke/CO alarm has been triggered or to check ambient temperature. I am not convinced that the humidity meter feature is very accurate though.",
      "rating": 4.0,
      "verified": true,
      "author": "A. C. Bullock",
      "helpful_votes": 0,
      "publication_date": 20180320
    },
    {
      "title": "Stylish and functional",
      "text": "This is a cool little device. Easy to set up in a few minutes. Looks really stylish and the app has a color wheel option so it can glow as a nightlight any color you want! I tested the CO and smoke alarms, it got these two confused but as long as it recognizes any alarm that doesn't matter. If it hears an alarm it notifies you and will actually call you. Very happy so far!",
      "rating": 5.0,
      "verified": true,
      "author": "queenvic82",
      "helpful_votes": 0,
      "publication_date": 20170215
    },
    {
      "title": "Cool Device",
      "text": "only 4 stars as it gave me some Bluetooth connectivity issues on startup so I almost returned it. When it somehow miraculously fixed itself, it connected perfectly, and IFTTT works great on it - I set it up so that if it will rain per weatherunderground, the backlight turns red. Pretty slick device.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170515
    },
    {
      "title": "Great piece of mind when you have old folks that ...",
      "text": "This little gadget is very impressive. Installed the first of more to come in an elderly family members house, it knows the difference between the sound of a smoke detector vs carbon monoxide detector (I can't), you can change the night light feature color and intensity via the Phone app, the night light turns red when it hears an activated alarm, you can monitor the room temp and humidity levels via the Phone app and it sends you alerts if the temp or humidity levels fall below or exceed the parameters you set it to. Great piece of mind when you have old folks that you care about, much less your own home. Ordering more now.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff",
      "helpful_votes": 0,
      "publication_date": 20160107
    },
    {
      "title": "Good product",
      "text": "During my initial test period of one week this device has worked well. I like the temperature and humidity logging feature. I am able to consistently connect remotely. Plays recording of audible alarm detected to allow you to determine whether it is a false alarm. Fast response time when sending a notification. This device could also send notifications of security system audible alarms as well.",
      "rating": 5.0,
      "verified": true,
      "author": "MH",
      "helpful_votes": 0,
      "publication_date": 20160607
    },
    {
      "title": "Love Leeo!",
      "text": "I absolutely love my Leeo! I ended up buying this for my dad for Father's Day as well and he also loves his. It works great and makes me feel much better knowing I will know if an alarm goes off when we are not home, as we have a dog.",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole Cormier",
      "helpful_votes": 0,
      "publication_date": 20170630
    },
    {
      "title": "A Real Convenience, Money Well Spent!",
      "text": "As long as you have a stable internet connection, the Leeo allows you to monitor the temperature and humidity in your second or vacation home to be sure the heat or A/C is working without having to have someone physically go into the place. Add a water alarm that the Leeo can hear to protect against leaks from your pipes or water heater. Money well spent!",
      "rating": 5.0,
      "verified": true,
      "author": "Robert E. Bain",
      "helpful_votes": 0,
      "publication_date": 20150415
    },
    {
      "title": "Now completely useless",
      "text": "I can no longer use the product which would other wise be completely functional but the company completely wrote off all of their original customer base and no longer allow the devices to connect and operate.",
      "rating": 1.0,
      "verified": true,
      "author": "Kyle",
      "helpful_votes": 0,
      "publication_date": 20200510
    },
    {
      "title": "Just What I Was Looking For",
      "text": "I was looking for a way to connect my non-smart co/smoke alarms to the internet, so I could get notified if there's an emergency while I'm away at work. This does that perfectly. You get an in-app alert, and a phone call.",
      "rating": 5.0,
      "verified": true,
      "author": "Reviewer",
      "helpful_votes": 0,
      "publication_date": 20160227
    },
    {
      "title": "Upgraded to complete trash",
      "text": "I can't connect either one of these pieces of garbage anymore. Wtf did i buy? They never worked right.",
      "rating": 1.0,
      "verified": true,
      "author": "David Eynon",
      "helpful_votes": 0,
      "publication_date": 20180517
    },
    {
      "title": "Excellent",
      "text": "This works great. It hears our smoke alarms and CO2 detector. We have ours mounted on the main floor and, to my surprise, it even reacts to the alarms in the basement.",
      "rating": 5.0,
      "verified": true,
      "author": "Estevan",
      "helpful_votes": 0,
      "publication_date": 20181122
    },
    {
      "title": "Works great!",
      "text": "Really works. Calls my phone every time the wife makes pizza and sets off the smoke detector. Feel better about leaving our doge home alone.",
      "rating": 5.0,
      "verified": true,
      "author": "Craig Williams",
      "helpful_votes": 0,
      "publication_date": 20180515
    },
    {
      "title": "Very recommended!",
      "text": "Fantastic product. I have Kiddee smoke and carbon monoxide combo which are linked together (6 of them). I have tested 4-5 times and it correctly identified the alarms and alerted me each time. This product is a fantastic way to have remote monitoring for fire without paying a monthly fee!",
      "rating": 5.0,
      "verified": true,
      "author": "Randy",
      "helpful_votes": 0,
      "publication_date": 20170105
    },
    {
      "title": "Smart device!",
      "text": "Easy set up. Tested with smoke and CO alarms and worked perfectly. Just what I needed to get notification of alarms of these non-connected devices remotely. Nice feature that you can enter other numbers of family and friends to be notified in case you are not available.",
      "rating": 5.0,
      "verified": true,
      "author": "busyteach",
      "helpful_votes": 0,
      "publication_date": 20160527
    },
    {
      "title": "Do not buy it",
      "text": "I have a second home, want to get reliable alert. But it is not really working, you can not trust the temperature reading from it or alert. Wait it too long to return, now just a expensive night light now.",
      "rating": 1.0,
      "verified": true,
      "author": "Ben Lee",
      "helpful_votes": 0,
      "publication_date": 20181122
    },
    {
      "title": "Great item. Peace of mind and easy to set up and use.",
      "text": "Great item. Gives me peace of mind while away from home. Tested with all 3 smoke alarms and 2 CO alarms all on different levels and works and reports flawlessly. Not sure what issues other reviewers are having with communication between the device and their phones, but for me the item worked exactly as advertised. Purchased a month ago for the initial retail price and was a good price then, so the current \"sale\" price is even better- thinking about getting them as gifts for others this year. The glowing ambient light is also a nice touch.",
      "rating": 5.0,
      "verified": true,
      "author": "Steven Henri",
      "helpful_votes": 0,
      "publication_date": 20170207
    }
  ],
  "product_meta": {
    "title": "Leeo Smart Alert Smoke/CO Remote Alarm Monitor for iOS and Android",
    "description": "Leeo Smart Alert is the smart, plug-in safety device that lets you know via smartphone if your home’s smoke or carbon monoxide (CO) alarms go off while you’re away. You can listen, dismiss, or notify local 911 from wherever you are. What’s more, there are no monthly fees and it works with the smoke and CO alarms you already have, giving you connected home security without the cost. With over 16 million soothing colors, peace of mind has never looked better.\n\n\n\nFROM THE MANUFACTURER\n \n\n\nAdded security when seconds count In a fire or CO leak, acting fast can make all the difference. Leeo listens for alarms and notifies you the moment it hears one, so you can take action from wherever you are. You can listen to the alarm, dismiss the notification, or contact local 911 — all right from the app.\n\nNo installation. No monthly fees. Because Leeo works with the alarms you already have, there’s no complicated setup. And with no monthly fees, Leeo makes peace of mind very affordable. Just plug it in, connect to your home’s WiFi, and you’re good to go.\n\n\nTwo-minute setup Leeo works with your existing, up-to-code smoke and CO alarms. Just plug it in and connect to your home’s WiFi for the easiest installation ever.\n\n\nOne per home Because Leeo listens for the frequency of your existing smoke/CO alarms, you only need one — and not 7 or 8 — for a typical home. \n\n\nCalls for help Leeo knows your home’s local emergency number and calls friends and family members you choose if you’re away from your phone. \n\n\n\nLeeo blends seamlessly into any home, while the ambient light setting turns on a soft light when it’s dark. Easily change the color right in the app for soothing or dramatic lighting effects. Simply rotate the outer ring to change the brightness. \n\nAbout the Startup \nDescribe your product in 3 words.\n\nComforting, enlightening, beautiful. \n\nWhere did you get the inspiration for your product?\n\nIn our previous company, RoboteX, we designed and manufactured first responder robots for hundreds of federal, state, and local government agencies across the world and saw how our robots quickly became an essential part of first responder strategy and tactics. Everything was becoming interconnected and intelligent. We kept thinking about ways we could translate this technology into the consumer space. That’s why, when Adam’s family friend’s house burned down and they lost everything they owned (including their cats), we were deeply affected. If a home had working smoke alarms and Wi-Fi, and its owner had a smartphone, why couldn’t they be alerted when something went wrong? Our friends eventually rebuilt their home. We put together an amazing team, including our chief designer Robert Brunner (former chief designer of Beats by Dre and head of design at Apple) and chief operating officer Charles Huang (founder of Guitar Hero), to build Leeo with the mission of providing beautiful products and services that provide peace of mind and make you say, “Wow.\" \n\nWhat differentiates your product from similar products out there?\n\nLeeo is extremely easy to use. Just plug it in and connect to your home’s WiFi. That’s it! And because it listens for the frequency of your existing smoke/CO alarms, you only need 1 for a typical home – much cheaper than replacing all of your existing alarms. It has additional features like millions of hues and temperature/humidity monitoring, too. \n\nTell us about the best and most challenging parts of the creation process.\n\nWe knew we wanted the Leeo Smart Alert to be beautiful – something you'd be proud to display in your home. Even though sensors have become smaller over the years, it was a huge challenge to fit both the sensor technology and power supply into its current form factor. We went through dozens of iterations until we were happy with the size. One of the best parts was working with our chief designer Robert Brunner and chief product strategist Matt Rolandson. Their team brought so much energy and expertise in designing not just a beautiful product, but a striking and enlightening brand. And there’s more to come!",
    "rating": 3.1,
    "feature_bullets": [
      "Monitors your existing smoke and carbon monoxide alarms 24/7 and alerts you via smartphone if your alarms go off",
      "Provides local emergency services phone number based on your home's address, no matter where you are",
      "Calls friends and family for backup if you don't respond to smoke and carbon monoxide alert notifications",
      "Requires iPhone 4S or later running iOS 8+ or Android phone with Bluetooth 4.0 and running 4.3+, In-home WiFi, U.S. residence address and ten digit phone number and free Leeo iOS or Android app. No international support.",
      "Easy setup - just plug it in, download the free iOS or Android app and connect to your home's Wi-Fi!",
      "Adjust the Leeo nightlight manually, or remotely via your smartphone, to help illuminate a hallway or room",
      "Personalize the color or shade to fit your mood or decor, with over 16 million color options to choose from",
      "Use IFTTT to change the color of your Leeo nightlight to signal changes in your home or surrounding environment"
    ],
    "specifications": {
      "Manufacturer": "Leeo",
      "Part Number": "Na",
      "Item Weight": "4.4 ounces",
      "Product Dimensions": "3.5 x 3.5 x 2 inches",
      "Item model number": "LNL9ZA1CB",
      "Is Discontinued By Manufacturer": "No",
      "Material": "Plastic",
      "Power Source": "AC Power",
      "Voltage": "240 Volts",
      "Item Package Quantity": "1",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "Warranty Description": "1 year limited warranty",
      "ASIN": "B00XMX4GUC",
      "Customer Reviews": "3.1 out of 5 stars525 ratings3.1 out of 5 stars",
      "Best Sellers Rank": "#301,042 in Tools & Home Improvement",
      "Date First Available": "October 21, 2014"
    },
    "categories": [
      "Tools & Home Improvement",
      "Fire Safety",
      "Safety & Security",
      "Combination Smoke & Carbon Monoxide Detectors"
    ],
    "price": ""
  }
}