{
  "website_summaries": [
    {
      "verdict": "Unless you use dimmer switches in your home, it's hard to go wrong with this light -- and the price is just right.",
      "pros": [
        "The Philips 60W Replacement LED offers exceptional efficiency and strong light quality at a truly tempting price of just $5"
      ],
      "cons": [
        "The bulb isn't dimmable, and it isn't rated to last as long as most other LEDs"
      ],
      "aspects": {
        "Design": 7.0,
        "Value": 9.0,
        "Performance": 8.0
      },
      "publication_date": 20150528,
      "rating": 8.0,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "I was amazed and delighted at the color and brightness",
      "text": "I used all four bulbs in a light fixture over the Master Bath Vanity. I was amazed and delighted at the color and brightness. It is almost impossible to tell they are LED! But then...I heard a sound that was like a low fan running in the room. Yup, it was the bulbs. These DO make noise. Based on another review here, it said they didn't. Not sure if I should return them. Disappointed. Update..they stopped making a \"low fan running noise\" after using them a few times. That changed my rating from 2 stars to 5! Glad I didn't return them! They are now PERFECT!!",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara L.",
      "helpful_votes": 15,
      "publication_date": 20171214
    },
    {
      "title": "Too yellow, even for 2700K",
      "text": "This is more yellow than other 2700K light bulbs. It also has a slight delay before illuminating when you flip the light switch. I'm on a quest to find the perfect colored light bulbs - too blue interrupts my sleep patterns, but too yellow doesn't quite produce the \"light and bright\" feel I am trying to achieve. This bulb is definitely one of the most yellow I have tested. Too bad, because the price is great. If you're going for *very* warm lighting, these would be really good bulbs for you.",
      "rating": 2.0,
      "verified": true,
      "author": "Kelly McCantsTop Contributor: Calligraphy",
      "helpful_votes": 29,
      "publication_date": 20160805
    },
    {
      "title": "Full 360 spread of light.",
      "text": "The only LED bulb where the light shines in nearly a full sphere. Look closely at other LED bulbs and you’ll see that the bottom half of the dome part is blocked by the plastic housing. That means that if you put that in a table lamp, the light will only shine upwards and leave the table dark",
      "rating": 5.0,
      "verified": true,
      "author": "Leslie",
      "helpful_votes": 10,
      "publication_date": 20171210
    },
    {
      "title": "Don't even last a year.",
      "text": "LED light bulbs are supposed to save you money in the long run, because, although they're more expensive than incandescent bulbs, they're supposed to last longer and use less electricity, so over the life of the bulb, you save money. In order for that to work out, though, the bulbs have to last as long as they say they'll last. These bulbs, unfortunately, don't. I bought quite a few of these bulbs, and over half have failed in far less than a year, so I ended up losing money, not saving it. I thought Philips was a dependable brand. I guess not.",
      "rating": 2.0,
      "verified": true,
      "author": "BASS!",
      "helpful_votes": 0,
      "publication_date": 20201007
    },
    {
      "title": "Nice, but... Certainly NOT 2700K",
      "text": "Nice, but... Certainly NOT 2700K. These are at least 3000K. I took a pic of these next to what is a 2800K halogen and you can see the bulb and refraction/illumination difference right next to one another. My whole house both inside and out is 2800K and below, so I'm very aware of how each bulb I purchase matches-up. These LEDs appear to be between 3000-3200K in person.",
      "rating": 2.0,
      "verified": true,
      "author": "DoubleR",
      "helpful_votes": 0,
      "publication_date": 20191209
    },
    {
      "title": "An unexpectedly short life",
      "text": "I purchased the Phillips LED bulbs because I thought the brand would ensure me of getting a good product, one that would deliver accurate light, low expense and long life. I placed two of the bulbs into one fixture and as of this morning it is 9+ months later and both bulbs have failed. To say I am displeased is to minimize my displeasure a great deal. Obviously the brand name no longer carries any guarantee that the product will live up to its claims.",
      "rating": 2.0,
      "verified": true,
      "author": "Mowerman",
      "helpful_votes": 0,
      "publication_date": 20200721
    },
    {
      "title": "Confused",
      "text": "The first time I ordered this item it was perfect. So I can't understand why today, when I finally got to opening the package I ordered of a second set, I have the wrong item. I got DIMMABLE bulbs. That will teach me to trust everything was fine, because the return window literally closed yesterday. I've got a nice useless set of bulbs. Awesome. Now, I can't even trust to order this again and hope to get the right thing.",
      "rating": 3.0,
      "verified": true,
      "author": "Heather B.",
      "helpful_votes": 0,
      "publication_date": 20191125
    },
    {
      "title": "Great bulb for saving on electricity",
      "text": "I love these bulbs! The light is just as bright as a standard, incandescent 60W bulb and the have a nice warm, soft glow. Consuming only 6 watts is important since where I am we are among the highest electricity rates in the nation! I bought a four pack first and like the so much that I went and bought a package of sixteen bulbs. The price was good and the savings, in the long run, even better!",
      "rating": 5.0,
      "verified": true,
      "author": "Ruben.G",
      "helpful_votes": 3,
      "publication_date": 20170516
    },
    {
      "title": "Fantastic value",
      "text": "Purchased from amazon. Absolutely love. Put in ceiling fan. Beautiful color tone of light. Thankful they invented these because I hate the color of swirly fluorescent bulbs. Highly recommend to replace incandescent bulbs.",
      "rating": 5.0,
      "verified": true,
      "author": "Florida Commodore",
      "helpful_votes": 7,
      "publication_date": 20161004
    },
    {
      "title": "Light up the room!",
      "text": "I bought these bulbs when I purchased my lamp & because it takes 3 bulbs I got this 4 pack then after buying these they had a 6 pack ( yes, I was upset only because I searched all of Amazon & they only had this one! But gotta say the original 3 are still in my lamp & that makes up for it in my book they're the best not hot @ all great lightning way better than the clear bulbs that get hot & sets heat out of them, I hate that/ well not anymore these bulbs are the BOMB!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Dancing fireTop Contributor: Makeup",
      "helpful_votes": 0,
      "publication_date": 20180523
    },
    {
      "title": "Philps NEW 60 WATT Equivalent A19 Light  Philps",
      "text": "These 60 Watt bulbs are great SOFT WHITE LEDS, THEY LAST A VERY LONG TIME AND ARE CHEAPER TO RUN AND GIVE MORE LGHT TO SEE BY. They are not cheap to buy especially in a four pack. And according where you buy them. I like them a lot. They are made by PHILPS A GREAT BRAND NAME. (LEDS LAST LONGER THAN A REGULAR LIGHT BULB AND GIVE MORE LIGHT, AND USE LESS ENERGY.) TRY THEM AND YOU MAY LIKE THEM ALSO. James D.North",
      "rating": 5.0,
      "verified": true,
      "author": "James D North",
      "helpful_votes": 0,
      "publication_date": 20171017
    },
    {
      "title": "Not for an enclosed fixture, so there are better alternatives.",
      "text": "It's a nice clean design, with a good spectrum, at a good price, but I was a little surprised that these are not rated for an enclosed fixture. A better bet is this  Feit 6-Pack. I've bought these bulbs at Costco. They are very good - dimmable, and they can be used in an enclosed fixture.",
      "rating": 3.0,
      "verified": true,
      "author": "Camp RunamokTop Contributor: Cycling",
      "helpful_votes": 0,
      "publication_date": 20171204
    },
    {
      "title": "50% of these defective after 1 year",
      "text": "I have purchased around 25 of these for my home. The light output is great. The color temperature, spot on. However, I have since had to replace over half of them because of flickering. After a year of use, the bulbs begin to randomly flash. I was hoping that I purchased a bulb that would last for years and pay for itself over time. However, these have failed me.",
      "rating": 1.0,
      "verified": true,
      "author": "JDA",
      "helpful_votes": 0,
      "publication_date": 20200204
    },
    {
      "title": "Good Bulbs, Fair Price",
      "text": "Too soon to tell about longevity, but the bulbs are fine. Two are outside in porch fixtures, and will not be on for consecutive hours. Tried one in a 3-way touch lamp, which did not work. Two positions were fine, the last position (brightest) flickered like seizure-time. Not a fault, by any means.",
      "rating": 5.0,
      "verified": true,
      "author": "Shari A. Mann",
      "helpful_votes": 2,
      "publication_date": 20170923
    },
    {
      "title": "Terrific Bulbs",
      "text": "Very pleased with these bulbs. I chose the soft white and they are beautiful. I am using them in the lights above my bathroom vanities, a very difficult place to have to reach and change bulbs. My previous bulbs were going out every couple of weeks and I was having to hire some one to change them for me. These are long lasting and terrific. As soon as I finish all the regular bulbs in my lamps, I will replace them with these.",
      "rating": 5.0,
      "verified": true,
      "author": "FiestaLover",
      "helpful_votes": 0,
      "publication_date": 20170319
    },
    {
      "title": "lasted 3 months",
      "text": "All four light bulbs died one by one after just three months in my living room lamp. Aren't these supposed to be eternal?",
      "rating": 1.0,
      "verified": true,
      "author": "Kate",
      "helpful_votes": 2,
      "publication_date": 20190110
    },
    {
      "title": "Excellent",
      "text": "Well this product basically solves 60W indoor lighting for me. The color is good; if you didn't know it was LED you would assume it was a traditional yellowish incandescent. Non-dimmable is feature; dimmable LED power supplies make radio frequency noise I do not want. Between the power savings, less heat and fewer bulb changes it is a genuine, no compromise improvement over incandescent.",
      "rating": 5.0,
      "verified": true,
      "author": "AllenC",
      "helpful_votes": 0,
      "publication_date": 20181218
    },
    {
      "title": "Like a firefly: brilliant but fleeting",
      "text": "I purchased these in September 2017 for my kitchen. Today is December 23, 2017. I have to replace these bulbs right now. During their brief life, they were VERY bright. But I'd prefer a slightly dimmer bulb than having to change them every few weeks.",
      "rating": 2.0,
      "verified": true,
      "author": "Nakia",
      "helpful_votes": 2,
      "publication_date": 20171223
    },
    {
      "title": "Peacemaker",
      "text": "So my wife is a nut about walking around behind me turning lights off. I hate having a pitch dark house. I put these in my kitchen over sink hanging lights so I can have some illumination without having her constantly berating me and no guilty conscience. Just as bright as a 60 watt bulb, no yellow tinge. Wish me luck. Highly recommend. Thanks for reading",
      "rating": 5.0,
      "verified": true,
      "author": "MooseTop Contributor: Camping",
      "helpful_votes": 0,
      "publication_date": 20171111
    },
    {
      "title": "Perfect replacement for a 60 watt incandescent.",
      "text": "Great bulb! Cannot tell the difference from a standard incandescent 60 watt. Works in outside lamps even in -10 Deg Chicago winters. I do not like the look of the compact florescent bulbs, much less the Mercury they contain and the warm-up time to reach full brightness. Bought a few to try and now have replaced all the bulbs in my home, and yes I recycled the old florescent bulbs.",
      "rating": 5.0,
      "verified": true,
      "author": "Charles 911",
      "helpful_votes": 2,
      "publication_date": 20160813
    },
    {
      "title": "good value, good color",
      "text": "Dimmable a plus, the soft-white spectrum is closer to incandescent bulbs (more yellowish light) rather than the harsh bluish light from other LED bulbs, can't comment on durability and longevity yet",
      "rating": 4.0,
      "verified": true,
      "author": "Christopher Baker",
      "helpful_votes": 0,
      "publication_date": 20181106
    },
    {
      "title": "These Phillips are MUCH better.!",
      "text": "I made a big mistake and ordered the Feit (Chinese manufactured) light bulbs. These Phillips are MUCH better.!!!!! Those from Feit were terrible. Didn't last the 15000 hours. More like 300 hours. Horrible don't order any from Feit. These Phillips MUCH better.",
      "rating": 5.0,
      "verified": true,
      "author": "John W Bennett",
      "helpful_votes": 0,
      "publication_date": 20180326
    },
    {
      "title": "Great Bulbs - One was dead on arrival.",
      "text": "I like the warm, not too bright, glow of these lights. I'd give it a 5 star review but one of the lights was dead on arrival. Not worth it to me to go and unscrew the working ones to return the whole box with the defective one for the refund though. Other than that these are great lights that don't put off much of any heat/waste, and give the home the warm feel that we like.",
      "rating": 3.0,
      "verified": true,
      "author": "Andrew A. Pilling",
      "helpful_votes": 0,
      "publication_date": 20170608
    },
    {
      "title": "Great LED bulbs, just make sure you verify how many lumens you want/need",
      "text": "Really great lights but much brighter than I expected although that was mostly my fault as these are labeled for 800 lumens and my old bulbs were 300. Still work great, easy ton install, and I'm liking my slightly brighter room!",
      "rating": 4.0,
      "verified": true,
      "author": "Nick Kidd",
      "helpful_votes": 2,
      "publication_date": 20170901
    },
    {
      "title": "Phillips replacement policy: A+",
      "text": "One of the bulbs we bought in late 2017 burned out. It was installed in my wife's office so no way were we anywhere near the 10,000 hour estimated lifespan. I wrote to Phillips, they asked me to take a few pictures and provide some additional info. A few weeks later: BOOM - a box shows up containing EIGHT bulbs. THANKS Phillips!",
      "rating": 5.0,
      "verified": true,
      "author": "Allen Yang",
      "helpful_votes": 0,
      "publication_date": 20200306
    },
    {
      "title": "Good, basic bulbs. Work as expected.",
      "text": "Good, basic replacement bulbs for closets and other enclosed fixtures. Non-dimmable, so make sure to use them in the appropriate places. I've ordered many of these and have had zero failures so far.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Newman",
      "helpful_votes": 3,
      "publication_date": 20170326
    },
    {
      "title": "These LEDs do not last",
      "text": "I have other Philips brand LEDs that are holding up but for some reason these do not last. I've had 2 of the 4 fail now in less than 2 years with average use. They are all installed in an open air ceiling pendant fixtures. Philips warranty policy is a joke. When you make a warranty claim on a failed bulb they just send you a check for 25% of what you paid for the 4-pack. They should send you a new bulb! If you need this form factor/wattage I would skip this model for a different brand. You've been warned!",
      "rating": 2.0,
      "verified": true,
      "author": "Nick H.",
      "helpful_votes": 0,
      "publication_date": 20190524
    },
    {
      "title": "NOT 'WARM' LIGHT",
      "text": "Even with the low wattage and the claim that these produce a 'warm' light these bulbs produce a very cold and overly bright light. Not as advertised. Buy something different.",
      "rating": 2.0,
      "verified": true,
      "author": "K. Jackson",
      "helpful_votes": 0,
      "publication_date": 20180926
    },
    {
      "title": "Burn out fast",
      "text": "Like all other LED bulbs in this form factor that I have tried they dont last. I put one in my front port fixture and it only lasted 4 months.",
      "rating": 1.0,
      "verified": true,
      "author": "Sprocket",
      "helpful_votes": 2,
      "publication_date": 20180312
    },
    {
      "title": "Let there be light",
      "text": "I don't know about you guys, but I've tried almost every budget friendly LED bulb out there. THIS one, takes them all. I have a set in that's going on 3 years right now, that have had no issues. Brightness is just right, 2 of them are the lights outside my house, that are on continuously, no problems.",
      "rating": 5.0,
      "verified": true,
      "author": "Matt, the Matt Matt",
      "helpful_votes": 0,
      "publication_date": 20191209
    },
    {
      "title": "Lower Bulb Life Than Expected",
      "text": "I installed many of these in my light fixtures. I have had two burn out in a year and a half. At the most, these were on 8 hours per day and generally far less, so they have lasted no more than 4,400 hours. Still, as far as LEDs go, I like the warm white light of the 2700 and they were inexpensive comparitively.",
      "rating": 3.0,
      "verified": true,
      "author": "CAL Consumer",
      "helpful_votes": 0,
      "publication_date": 20190517
    },
    {
      "title": "One out of eight bulbs was DOA",
      "text": "I ordered 2 packs of these. Out of them, one bulb did not work. It's more than 12% failure rate. Don't know if it was just a bad luck, but I suvvest checking all bulbs upon arrival. BTW: the seller was great and replaced the broken bulb.",
      "rating": 3.0,
      "verified": true,
      "author": "Doberman",
      "helpful_votes": 2,
      "publication_date": 20170312
    },
    {
      "title": "Lifespan",
      "text": "Lasted only 1.5 years...based on my (liberal) estimate of 3000 hours. That’s s far cry from the est life of10,000 hours. Should have lasted 5 years. I have other mfg bulbs that have. Even 4 years with no failures.",
      "rating": 2.0,
      "verified": true,
      "author": "Point  Bob",
      "helpful_votes": 0,
      "publication_date": 20190318
    },
    {
      "title": "Does what it says on the box.",
      "text": "Unlike some LED lamps, these really do match the light output of a conventional 60w bulb. Color matches that of a conventional bulb. Nothing fancy, just gets the job done inexpensively.",
      "rating": 5.0,
      "verified": true,
      "author": "B. Campbell",
      "helpful_votes": 3,
      "publication_date": 20170302
    },
    {
      "title": "Nice product, BAD Packaging",
      "text": "Great Product, sucky packaging. Arrived with all 4 bulbs out of the package, rolling around loose. Maybe the bubble bag helped. Amazingly, they work... for now. BTW, excellent color from these bulbs. Get Your FERAL On.",
      "rating": 3.0,
      "verified": true,
      "author": "FERALBoy",
      "helpful_votes": 0,
      "publication_date": 20171025
    },
    {
      "title": "They work as described and all came through shipping in good shape. I had bought some similar GE bulbs ...",
      "text": "Just what I was looking for. They work as described and all came through shipping in good shape. I had bought some similar GE bulbs locally and they were disappointing. One of the GE's failed completely in a few days and the other switches from bright to dim and back again, over and over.",
      "rating": 5.0,
      "verified": true,
      "author": "Trevor C.",
      "helpful_votes": 0,
      "publication_date": 20180206
    },
    {
      "title": "Never Again",
      "text": "I have bought many decals for the doors/walls and this one is by far the worst. I couldn't send it back as I opened up the plastic seal. When I unrolled it I saw that the image was blurry, the colors were no sharp and vibrant. The whole thing looks orange. When I tried to peel it away from the backing, the top clear top coating kept coming off then finally the rest of the image came up off the backing. Will never buy again.",
      "rating": 1.0,
      "verified": true,
      "author": "Purple45",
      "helpful_votes": 0,
      "publication_date": 20190917
    },
    {
      "title": "Owned for 3 years so far",
      "text": "Soft white. Looks like incandescent bulbs, can't tell it is LED. Quiet, don't get hot. Own about 10 bulbs. Look nice under the fixture.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "Lots of buzzing and flickering.",
      "text": "Buzzing and flickering on different light fixtures. Other brand led lights haven’t given me this issue.",
      "rating": 1.0,
      "verified": true,
      "author": "Ruben",
      "helpful_votes": 0,
      "publication_date": 20190211
    },
    {
      "title": "Works great",
      "text": "This actually worked out very well. There's a few settings on the light color, so that's a good thing. The light is good and the electronics have not failed; would buy these again.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert W",
      "helpful_votes": 0,
      "publication_date": 20190222
    },
    {
      "title": "Phillips LED bulbs among the best",
      "text": "Phillips LED bulbs are the closest to matching the incandescent \"look\" that we're accustomed to. The 40 & 60 watt (equivalent) bulbs are also constructed so they look good in open fixtures. The Phillips 3-way bulbs ar also outstanding!",
      "rating": 5.0,
      "verified": true,
      "author": "Stanton",
      "helpful_votes": 0,
      "publication_date": 20170524
    },
    {
      "title": "Quality product. Great price.",
      "text": "Great bulb. Bought them from another vendor 2 years ago. One of them blew out recently. Philips sent me 2 new ones. Good Product and exceptional customer service.",
      "rating": 5.0,
      "verified": true,
      "author": "AMZ Customer",
      "helpful_votes": 0,
      "publication_date": 20190629
    },
    {
      "title": "Not long lasting at all!",
      "text": "Considering these are LED bulbs, they are burning out at an incredibly fast rate. Basically, they are lasting 8 months when they are guaranteed for 5 years. We contacted Philips and got absolutely no satisfaction.",
      "rating": 1.0,
      "verified": true,
      "author": "none",
      "helpful_votes": 0,
      "publication_date": 20190912
    },
    {
      "title": "BRIGHT",
      "text": "Extremely bright. Slight buzzing noise if you listen very closely. Only throws light in certain directions so they may not work the best for all applications.",
      "rating": 4.0,
      "verified": true,
      "author": "colton",
      "helpful_votes": 0,
      "publication_date": 20190501
    },
    {
      "title": "Not a big fan",
      "text": "Not a big fan of these. They buzz and they're not on a dimmer.",
      "rating": 3.0,
      "verified": true,
      "author": "M. Milton",
      "helpful_votes": 4,
      "publication_date": 20170402
    },
    {
      "title": "💡👍",
      "text": "Lightbulb 💡 it lights up whatever else can I say LOL",
      "rating": 5.0,
      "verified": true,
      "author": "ClayBuster",
      "helpful_votes": 0,
      "publication_date": 20200713
    },
    {
      "title": "Good bulbs",
      "text": "I continue to be impressed with these Phillips LED bulbs. They are a great alternative to the old incandescent \"soft white\" bulbs. Put out 60w equivalent. Light is a warm white with a hint of yellow.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Long",
      "helpful_votes": 0,
      "publication_date": 20170711
    },
    {
      "title": "Great LED bulbs for indoor lamps",
      "text": "Work great! I had to replace some cheap bulbs that were provided with the lamps I bought that were flickering. These are perfect and are the soft white that I wanted. No flickering at all and great for all day use.",
      "rating": 5.0,
      "verified": true,
      "author": "Erica C Henning",
      "helpful_votes": 0,
      "publication_date": 20200717
    },
    {
      "title": "One Star",
      "text": "Purchased these not even a year ago already 2 of the 4 isn't working.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180131
    },
    {
      "title": "Nice daylight bulbs!  Bought these and 100 watt equivalent.  Love both.",
      "text": "Hard to find bright white bulbs. These are great in the bathroom and hallways. I also love the 100 watt equivalent. Not dull yellow light, but nice bright daylight like light.",
      "rating": 5.0,
      "verified": true,
      "author": "V. A. Stevens",
      "helpful_votes": 2,
      "publication_date": 20170305
    },
    {
      "title": "Nice warm lights, good price and good quality.",
      "text": "Great price, very bright and warm color, instant on. Put them in our bathroom, and they have been working great for about 2 years now.",
      "rating": 5.0,
      "verified": true,
      "author": "ValueMan01",
      "helpful_votes": 0,
      "publication_date": 20190330
    },
    {
      "title": "Bulbs",
      "text": "It is a light bulb. What more can I say",
      "rating": 5.0,
      "verified": true,
      "author": "Roberta Paver",
      "helpful_votes": 0,
      "publication_date": 20200303
    },
    {
      "title": "Love these LEDs",
      "text": "Changed all the bulbs in the house. So many I could not get at the local store. So very easy to order and they all were perfect the perfect size.",
      "rating": 5.0,
      "verified": true,
      "author": "B C",
      "helpful_votes": 0,
      "publication_date": 20181223
    },
    {
      "title": "Bulb base not attached.",
      "text": "Packaging was undamaged but bulb base not attached on one of the bulbs. The other three work fine but I paid for a four pack.",
      "rating": 1.0,
      "verified": true,
      "author": "KH",
      "helpful_votes": 2,
      "publication_date": 20170601
    },
    {
      "title": "The Philips 60 Watt LED dimmable bulbs are a good price, however they don't dim as much as ...",
      "text": "The Philips 60 Watt LED dimmable bulbs are a good price, however they don't dim as much as my other bulbs., maybe need to buy 40 W instead?",
      "rating": 3.0,
      "verified": true,
      "author": "TAG",
      "helpful_votes": 0,
      "publication_date": 20180701
    },
    {
      "title": "Philips is the Best",
      "text": "LED for the win. Save money and reduce AC bills by installing these low-heat LED bulbs in your house.",
      "rating": 5.0,
      "verified": true,
      "author": "D. K.",
      "helpful_votes": 2,
      "publication_date": 20170520
    },
    {
      "title": "Phillips A19 LED Bulb 60W Eq. Is A Great Looking Bulb",
      "text": "Phillips A19 LED Bulb 60W Eq. is a great looking bulb. I used this to replace my 75W incandescent bulbs. The 75W were always a little bright, these are a great replacement.",
      "rating": 5.0,
      "verified": true,
      "author": "DMWorrel",
      "helpful_votes": 0,
      "publication_date": 20180323
    },
    {
      "title": "Four Stars",
      "text": "Okay for a 2-bulb fixture. A single bulb is too dim, primarily due to it's configuration.!",
      "rating": 4.0,
      "verified": true,
      "author": "essjay",
      "helpful_votes": 2,
      "publication_date": 20170619
    },
    {
      "title": "Perfect soft white color",
      "text": "Perfect soft white color. I leave it on 24/7 in the living room as a night light.",
      "rating": 5.0,
      "verified": true,
      "author": "South Texan",
      "helpful_votes": 0,
      "publication_date": 20190329
    },
    {
      "title": "Not to bright",
      "text": "The lights work great. One in the box didn't work at all. Didn't feel like sending them all back. Not to bright, seem perfect and natural in the house.",
      "rating": 5.0,
      "verified": true,
      "author": "Christy C",
      "helpful_votes": 0,
      "publication_date": 20180408
    },
    {
      "title": "Spectacular light",
      "text": "These bulbs give off gorgeous light. I had to replace two bulbs in a four bulb fixture. The other two are incandescent, so I could directly compare them These beat the incandescent. The light is warm and they're brighter than the 60 watt incandescents. They also make colors pop. These are a bargain at less than two dollars each. Fingers crossed that they don't start to flicker and last the 10+ years they're advertised for. If they do it will be a modern technological miracle.",
      "rating": 5.0,
      "verified": true,
      "author": "George",
      "helpful_votes": 5,
      "publication_date": 20170526
    },
    {
      "title": "Love that it is LED",
      "text": "Great bulbs, and they will probably last an incredibly long time. Love that it is LED!",
      "rating": 5.0,
      "verified": true,
      "author": "allegro",
      "helpful_votes": 0,
      "publication_date": 20181208
    },
    {
      "title": "Two Stars",
      "text": "I like natural light, and didn't think to make sure these were what I wanted.",
      "rating": 2.0,
      "verified": true,
      "author": "Laurel Ivie",
      "helpful_votes": 0,
      "publication_date": 20180106
    },
    {
      "title": "Excellent delivery status and arrival",
      "text": "Excellent delivery status and arrival. Competitive price, correct temperature color and no breakage during shipment. Great investment to save replacement time labor, ladder time to reach burnt out short life incandescent and reduce your power Company bill due to design. We have replaced all incandescent bulbs on our property. Very pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "Gman",
      "helpful_votes": 0,
      "publication_date": 20180201
    },
    {
      "title": "Great bulbs. I don't think I'll ever buy another ...",
      "text": "Great bulbs. I don't think I'll ever buy another LED that doesn't say Phillips on it. You can see the quality difference between it and a generic brand.",
      "rating": 5.0,
      "verified": true,
      "author": "Curt Esper",
      "helpful_votes": 0,
      "publication_date": 20171117
    },
    {
      "title": "Great light bulb",
      "text": "Arrived a couple of hours ago and already being used. I replaced one of those pigtail bulbs with this, much warmer, nicer light. Glad I got them.",
      "rating": 5.0,
      "verified": true,
      "author": "Gary Pero",
      "helpful_votes": 0,
      "publication_date": 20171212
    },
    {
      "title": "Watch Brightness Numbers Before Ordering",
      "text": "Way too bright. Perhaps I ordered wrong one, but they do not look good.",
      "rating": 2.0,
      "verified": true,
      "author": "TJ Ohio",
      "helpful_votes": 2,
      "publication_date": 20170315
    },
    {
      "title": "60w of light for 8.5w worth of energy",
      "text": "60w of light for 8.5w worth of energy how can you go wrong/ I like the color as I have 2 gooseneck lamps on my desk with them...very bright. NOT FOR ENCLOSED LIGHT FIXTURES.",
      "rating": 5.0,
      "verified": true,
      "author": "adriftinpa",
      "helpful_votes": 0,
      "publication_date": 20160812
    },
    {
      "title": "Flickering light",
      "text": "One bulb out of the package is flickering otherwise nice lighting abilities",
      "rating": 3.0,
      "verified": true,
      "author": "flammable",
      "helpful_votes": 0,
      "publication_date": 20171116
    },
    {
      "title": "Great for reading",
      "text": "The \"soft\" version works great for bedroom or areas that do not need to be very bright.",
      "rating": 5.0,
      "verified": true,
      "author": "Denny",
      "helpful_votes": 0,
      "publication_date": 20180820
    },
    {
      "title": "Incrediable Technology",
      "text": "Both the Soft White and the Daylight are super Awesome!!! I changed every lamp in the house that had CFL's. Way better, the lighting is incrediable!!",
      "rating": 5.0,
      "verified": true,
      "author": "ODIE",
      "helpful_votes": 0,
      "publication_date": 20171115
    },
    {
      "title": "Good Value",
      "text": "A good value if you are like me and want to change out all of your old bulbs with new LED energy efficient ones.",
      "rating": 5.0,
      "verified": true,
      "author": "Randy P",
      "helpful_votes": 0,
      "publication_date": 20180413
    },
    {
      "title": "Soft warm light like an incandescent",
      "text": "Previous LED light purchases scared me off from buying these energy efficient bulbs. I finally decided to give them another try. The quality of the light is much, much warmer and softer than previous LED bulbs I had purchased that were cold and offered a blue/white light. Highly recommend for living space bulbs.",
      "rating": 5.0,
      "verified": true,
      "author": "Raija Vaisanen",
      "helpful_votes": 0,
      "publication_date": 20181018
    },
    {
      "title": "Nice bright light",
      "text": "I bought these to replace my desk lamp’s bulb. It work great it’s nice and bright and I don’t feel bad leaving it on for long periods of time.",
      "rating": 5.0,
      "verified": true,
      "author": "Dustd3",
      "helpful_votes": 0,
      "publication_date": 20170929
    },
    {
      "title": "These are great and I've ordered the 40 watt replacements as well ...",
      "text": "These are great and I've ordered the 40 watt replacements as well to get rid of old bulbs. Not glaring like the tube ones.",
      "rating": 5.0,
      "verified": true,
      "author": "Wisconsin Shopper",
      "helpful_votes": 0,
      "publication_date": 20180321
    },
    {
      "title": "Great LED bulbs",
      "text": "Needed a set of LEDs for an antique custom lamp. Found the specs for these online and they fit perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Mac Simpson",
      "helpful_votes": 0,
      "publication_date": 20180405
    },
    {
      "title": "Good LEDs",
      "text": "So far, these are good bulbs. Bought to replace the problematic GE LED bulbs in my bathroom. Output is as advertised.",
      "rating": 5.0,
      "verified": true,
      "author": "thebigalboski",
      "helpful_votes": 0,
      "publication_date": 20180126
    },
    {
      "title": "I like buying brand name LED lights because the color and ...",
      "text": "I bought these to replace the light bulbs on the porch. They give off the same type of light as my old bulbs, but with so much less energy. I like buying brand name LED lights because the color and quality are more consistent.",
      "rating": 5.0,
      "verified": true,
      "author": "Rebecca M.",
      "helpful_votes": 0,
      "publication_date": 20160304
    },
    {
      "title": "Great warm LEDs, good color for a bedroom, compact size",
      "text": "Great warm LED bulbs. The color is just right for a bedroom. Small and can fit in any lamp supporting normal bulbs.",
      "rating": 5.0,
      "verified": true,
      "author": "Steven Chen",
      "helpful_votes": 0,
      "publication_date": 20180122
    },
    {
      "title": "Great bulb; one arrived defective",
      "text": "Love their brightness! I have three above my bathroom mirror. Only 4 stars because at least one of the bulbs was defective.",
      "rating": 4.0,
      "verified": true,
      "author": "bdette",
      "helpful_votes": 0,
      "publication_date": 20171206
    },
    {
      "title": "Nice looking bulbs.",
      "text": "Nice looking bulbs. Good price, nice, bright, good color temperature. Nice uniform light. Nothing more to say.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazn Shopper",
      "helpful_votes": 0,
      "publication_date": 20180310
    },
    {
      "title": "Don't last",
      "text": "75% of bulbs burned out in less than 2 years",
      "rating": 2.0,
      "verified": true,
      "author": "Jarod",
      "helpful_votes": 0,
      "publication_date": 20200823
    },
    {
      "title": "Five Stars",
      "text": "Arrived as promised. Have used this product before and I am more than satisfied",
      "rating": 5.0,
      "verified": true,
      "author": "Lew39",
      "helpful_votes": 0,
      "publication_date": 20180624
    },
    {
      "title": "These were much more yellow than I anticipated. I ...",
      "text": "These were much more yellow than I anticipated. I was looking for a bright natural light, but these are a warm/yellow hue.",
      "rating": 3.0,
      "verified": true,
      "author": "Ariel",
      "helpful_votes": 0,
      "publication_date": 20171117
    },
    {
      "title": "Work great",
      "text": "Work great and are actually replacements for the daylight version of these bulbs that were too bright for my bedroom ceiling fan.They are not on a dimmer so I do not know if they \"buzz\"",
      "rating": 5.0,
      "verified": true,
      "author": "CarGuy",
      "helpful_votes": 0,
      "publication_date": 20160824
    },
    {
      "title": "Soft, warm light",
      "text": "I was pleasantly surprised at how nice the light is. LED lights can be harsh and too bright but this was just perfect. Makes the room feel cozy.",
      "rating": 5.0,
      "verified": true,
      "author": "Kennard Alton",
      "helpful_votes": 0,
      "publication_date": 20160825
    },
    {
      "title": "Great bulbs, more light than I expected",
      "text": "Great bulbs, more light than I expected, good color temperature (I like the lower end stuff around 3000K) Beats out the CFLs for light output, instant on and watts consumed for lumens delivered Jury is still out on life of the bulb",
      "rating": 5.0,
      "verified": true,
      "author": "S. Cloutier",
      "helpful_votes": 0,
      "publication_date": 20150804
    },
    {
      "title": "Excellent value",
      "text": "Did research on the color spectrum and these were exactly what I was expecting in LED Technology. Great product for a great price... Thanks",
      "rating": 5.0,
      "verified": true,
      "author": "Jimbo Rose",
      "helpful_votes": 0,
      "publication_date": 20170714
    },
    {
      "title": "so good!",
      "text": "Hooked the whole house up. Hoping to see a little difference compared to last years usage. So far, so good!",
      "rating": 5.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20180105
    },
    {
      "title": "These will definitely light up a room. I can't ...",
      "text": "These will definitely light up a room. I can't use them as they are blinding bright. I changed the bulbs in my bedroom without telling my husband so he was shocked when he turned on the light. He immediately turned off the light and shouts...help too bright!",
      "rating": 2.0,
      "verified": true,
      "author": "Michelle",
      "helpful_votes": 0,
      "publication_date": 20170119
    },
    {
      "title": "Five Stars",
      "text": "I'm glad I discovered LED bulbs. They don't get hot and they last longer than fluorescent or incandescent.",
      "rating": 5.0,
      "verified": true,
      "author": "Customer",
      "helpful_votes": 0,
      "publication_date": 20171018
    },
    {
      "title": "4 Bulbs that shine like stars",
      "text": "They last a long time and they are cool to the touch, must buy if you're a cheapo like me who likes touching bright things.",
      "rating": 5.0,
      "verified": true,
      "author": "Eddie B.",
      "helpful_votes": 0,
      "publication_date": 20171119
    },
    {
      "title": "PHILIPS products are the best, using these to light up in front of ...",
      "text": "PHILIPS products are the best, using these to light up in front of my garage, as shown and described, speedy shipping...thank you :)",
      "rating": 5.0,
      "verified": true,
      "author": "Lois Gauvin",
      "helpful_votes": 0,
      "publication_date": 20170513
    },
    {
      "title": "Great LED bulbs",
      "text": "Great LED bulbs and very inexpensive compared to store bought. Would recommend changing all traditional bulbs over to LED bulbs for cost and efficiency.",
      "rating": 5.0,
      "verified": true,
      "author": "Khager",
      "helpful_votes": 0,
      "publication_date": 20161220
    },
    {
      "title": "We've changed out all our light bulbs to LED's. ...",
      "text": "We've changed out all our light bulbs to LED's. They last longer and will cut down on your electric bill. These light bulbs are great",
      "rating": 5.0,
      "verified": true,
      "author": "slyne",
      "helpful_votes": 0,
      "publication_date": 20170407
    },
    {
      "title": "Be warned... my bulb exploded!",
      "text": "Bought 4 in April 2018. On New year's eve 2018, I turned off my light and the bulb exploded. Good thing I had a lampshade. Threw all mine in the trash",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190109
    },
    {
      "title": "Great lights",
      "text": "Just replaced the bulbhichd in the bathroom. They are great. The light is the same with lower wattage. I'm so impressed. Great quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20170113
    },
    {
      "title": "Not harsh on the eyes",
      "text": "The Philips LED lamps are more true to their color than other brands. The 2700k is not harsh on the eyes, which is important, at least for me. Will keep on buying.",
      "rating": 5.0,
      "verified": true,
      "author": "Kohana",
      "helpful_votes": 0,
      "publication_date": 20160716
    },
    {
      "title": "Great deal for the money. Replaced all the bulbs in my house.",
      "text": "Great deal for the money. Replaced all the bulbs in my house.",
      "rating": 5.0,
      "verified": true,
      "author": "Lee Morales",
      "helpful_votes": 0,
      "publication_date": 20180309
    },
    {
      "title": "Flickering bulb within 2 months",
      "text": "Within less than 2 months of use, the lightbulb started flickering. When replaced with a different bulb (new or in another light fixture), the light worked fine. Pretty frustrating when an LED bulb stops working correctly in such a short time span. Hopefully the other 3 lights in the package last longer than the first.",
      "rating": 2.0,
      "verified": true,
      "author": "Colette",
      "helpful_votes": 0,
      "publication_date": 20180103
    }
  ],
  "product_meta": {
    "title": "Philips New 60-Watt Equivalent A19 LED Light Bulb Soft White - 2700K – (Pack of 4).",
    "description": "Size:Pack of 1Philips New 60-Watt Equivalent A19 LED Light Bulb Soft White - 2700K - 4 Pack",
    "rating": 4.5,
    "feature_bullets": [
      "Brightness: 800 Lumens. Light appearance: 2700K (soft white). 60W Equivalent.",
      "Non-dimmable bulb",
      "Estimated yearly energy cost: $1.02 (based on 3 hours/day, 11/kWh. costs depend on rates and use)",
      "Energy used: 8.5-Watt (equivalent to a 60W standard incandescent light bulb)",
      "Life hours: 10000 hours (based on 3 hours/day)"
    ],
    "specifications": {
      "Product Dimensions": "7 x 4.99 x 1.7 inches",
      "Item Weight": "1.44 ounces",
      "Manufacturer": "Philips",
      "ASIN": "B00XNHGL28",
      "Item model number": "461129",
      "Customer Reviews": "4.5 out of 5 stars492 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#31,781 in Health & Household",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "May 14, 2015"
    },
    "categories": [
      "Tools & Home Improvement",
      "LED Bulbs",
      "Light Bulbs"
    ],
    "price": 11.85
  }
}