{
  "website_summaries": [
    {
      "verdict": "Great price point for a beginner training sled. Can add Olympic-sized weight plates for tougher workouts.",
      "pros": [
        "Extremely simple design, so it's easy to figure out for beginners to use without having to worry about assembling different parts",
        "A little smaller than some other sleds, so it's easier to transport and store",
        "Ships with a harness so you can start using it right away"
      ],
      "cons": [
        "No option to use it as a push sled",
        "Only weighs 37 pounds, so it needs weight plates for tougher workouts"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "works great but annoying problems",
      "text": "get a quality speed resistance workout easy. moves great in grass. only problems i had 1) the post bangs against the sled creating lots of noise - just put something in between that 2) the post is very annoying to put on and off, and you cant just flip the post down to fit in your trunk. so Rogue's $120 equivalent sled work better for me",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191106
    },
    {
      "title": "Heavily, sturdily built",
      "text": "I love being able to pull it when exercising. I pull it through the grass and fields for a mile or two at a time. Very heavy and heavily built, essentially a huge sheet of metal with rolled up edges. I don't use the belt it came with but use \"Speed Harness Vest w/ 9' Pull Strap by CCS,...\" that does great. Although I have not used the ones with tubes, I think this should be better, especially when going through rougher terrain. I also have not started using extra weight on it as it is heavy enough, but will soon.",
      "rating": 5.0,
      "verified": true,
      "author": "Dr. B",
      "helpful_votes": 3,
      "publication_date": 20151116
    },
    {
      "title": "Excellent design and price",
      "text": "This sled is perfect for design and price. I bought another one that broke the very first day and wouldn't even hold the plates properly and that was with my 11 year old using it. This one is heavy duty metal plate, heavier than I expected but not a problem at all and the carabiner is actually heavy duty not like the other product that bent after one pull with 45lbs. This is a great sled.",
      "rating": 5.0,
      "verified": true,
      "author": "Joel R Anderson",
      "helpful_votes": 0,
      "publication_date": 20170919
    },
    {
      "title": "Great sled",
      "text": "Great solid sled. I use it for sprint start conditioning. Works great. Solid! Will last forever.",
      "rating": 5.0,
      "verified": true,
      "author": "jeff pasley",
      "helpful_votes": 0,
      "publication_date": 20190612
    },
    {
      "title": "Great thick sled",
      "text": "This is a great sled! I was looking at a heavy duty sled - thick one that could go on concrete. This one is very thick and sturdy and works great. I was originally looking at a Rogue sled, but saw this as an alternative a good bit cheaper. There were no reviews when I purchased it, I'm glad I got it. It's built like a tank and works great. The tow straps that come with it are just general tow straps. Don't expect much from them, but they work for what you need.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Idell",
      "helpful_votes": 0,
      "publication_date": 20150812
    },
    {
      "title": "Titan Fitness did it again!",
      "text": "This is my 3rd item from Titan Fitness and they made another great product. I highly recommend this sled. It's sturdy as heck and it does its job very well. The straps that it comes with are pretty impressive as well. I've been doing 1/2 mile sled drags and I don't see this thing wearing out anytime soon. Thank you for making an affordable yet awesome product.",
      "rating": 5.0,
      "verified": true,
      "author": "thicknchunky",
      "helpful_votes": 0,
      "publication_date": 20170425
    },
    {
      "title": "Solid sled for a very solid workout",
      "text": "Sled is beefy and I have pulled it everywhere, including up and down hills. I strapped a sandbag to it instead of using plates. On grass and snow it worked great. Over asphalt, the straps wore through. I went ahead and picked up a harness, and that set up works great.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael W Kaster",
      "helpful_votes": 0,
      "publication_date": 20180207
    },
    {
      "title": "Buy this sled",
      "text": "Best value out there without sacrificing quality. Heavy and built for functional work. Far better than other sleds we have at the gym.",
      "rating": 5.0,
      "verified": true,
      "author": "my view",
      "helpful_votes": 0,
      "publication_date": 20171112
    },
    {
      "title": "Good sled",
      "text": "I own several other sleds and I am very happy with this one. No frills, but very sturdy and I’m able to load a good amount of weight on it.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel Trevino",
      "helpful_votes": 0,
      "publication_date": 20200426
    },
    {
      "title": "Good cheaper alternative to Rogue Fat Boy",
      "text": "Good cheaper alternative to Rogue Fat Boy. Solid build. My calves and glutes burned like no other. Too bad my hi-temp bumpers won't fit on the post. Otherwise a good sled for steel oly plates.",
      "rating": 4.0,
      "verified": true,
      "author": "VT",
      "helpful_votes": 0,
      "publication_date": 20160209
    },
    {
      "title": "Nice Sled, Poor Quality Control",
      "text": "Very happy with this sled. However quality control could use some improvement due to the fact that the holes for the weight pole did not line up.",
      "rating": 4.0,
      "verified": true,
      "author": "J.H.",
      "helpful_votes": 0,
      "publication_date": 20170815
    },
    {
      "title": "Built like a brick **** *****!",
      "text": "Excellent product. Heavy metal construction. A great value for the price. You will not be disappointed with this sled.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert S.",
      "helpful_votes": 0,
      "publication_date": 20190720
    },
    {
      "title": "like the sled but not much good at gym the ...",
      "text": "like the sled but not much good at gym the stem is larger than the holes in the weights so I have to paid extra to have it shaved",
      "rating": 3.0,
      "verified": true,
      "author": "J d D Jones",
      "helpful_votes": 0,
      "publication_date": 20160125
    },
    {
      "title": "Four Stars",
      "text": "Sled is great. Would have given a 5 except the harness included is junk.",
      "rating": 4.0,
      "verified": true,
      "author": "tyler",
      "helpful_votes": 2,
      "publication_date": 20150731
    },
    {
      "title": "good quality, does not mess up grass",
      "text": "I expect this bad boi to last a long time.",
      "rating": 5.0,
      "verified": true,
      "author": "Vincenzo Piraino",
      "helpful_votes": 0,
      "publication_date": 20201019
    },
    {
      "title": "Great product! & not over priced",
      "text": "Great product ! & not over priced. Will be purchasing more product from you guys",
      "rating": 5.0,
      "verified": true,
      "author": "tim pettit",
      "helpful_votes": 0,
      "publication_date": 20160323
    },
    {
      "title": "very happy with my purchase",
      "text": "Product is built heavy duty, very happy with my purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Rebecca Leddy",
      "helpful_votes": 0,
      "publication_date": 20170524
    },
    {
      "title": "Useless. Beware",
      "text": "Buyer beware. Looked used and did not come with attached collar. Useless. Beware.",
      "rating": 1.0,
      "verified": true,
      "author": "Sean",
      "helpful_votes": 2,
      "publication_date": 20150831
    },
    {
      "title": "Purchased sled and was dissapointed to find out that the ...",
      "text": "Purchased sled and was dissapointed to find out that the bar where the weights are stacked on doesn't lay flat as shown in the picture, either the hole needs to be drilled lower or the u shape wedge where it goes into needs to be longer",
      "rating": 1.0,
      "verified": true,
      "author": "rafael aguirre",
      "helpful_votes": 0,
      "publication_date": 20150827
    },
    {
      "title": "Effective product",
      "text": "Keeps my overactive 20 month old in his crib all night/nap long. Peace of mind is well worth the price, plus it holds up surprisingly well to the child's initial biting, pulling, hitting and overall protest to being confined. He likes it now and I think it makes him feel cozy.",
      "rating": 5.0,
      "verified": true,
      "author": "Lori",
      "helpful_votes": 0,
      "publication_date": 20170925
    },
    {
      "title": "Sturdy and holds a heavy load",
      "text": "I’ve been working outside with sandbags, crowbar swings, push-ups and rope pull-ups in the tree. This sled is just what I needed for hard work and fun. It came without the center bar attached (of course) and that’s ideal because it holds my 200lb dingo sandbag and the provided click carabiner is great for attaching my pull rope. (It comes with a strong strap but I prefer to attach rope for a fat grip. This is solid! Built well and sturdy. Should last a lifetime.",
      "rating": 5.0,
      "verified": true,
      "author": "03mp",
      "helpful_votes": 0,
      "publication_date": 20201031
    },
    {
      "title": "Great deal and great price",
      "text": "This is a great sled I’m able to fit 320lbs of bumper plates it slides well and it’s an all around great purchase especially for the price",
      "rating": 5.0,
      "verified": true,
      "author": "Nathan Brindley",
      "helpful_votes": 0,
      "publication_date": 20201213
    }
  ],
  "product_meta": {
    "title": "Titan HD Power Speed Sled Weighted Drag Football Fat Boy s25 Max Capacity 500 lb",
    "description": "Build explosive speed and strength with this weight sled from Titan Fitness. Designed for use with Olympic plates it's a great addition to any personal or professional gym. Forward facing drags are excellent for speed development, primarily targeting your posterior chain, and backward facing (facing toward sled) drags are a great way to build quadriceps strength.\n\nFeatures:\n- Use with Olympic plates\n- Includes leash / harness\n- Use on grass, carpet, or concrete\n- Little assembly required\n- Powder Coated finish\n\nSpecifications:\n- Weight: 37 LBS\n- Width: 16\"\n- Length: 24\"\n- Leash / harness length: 10 ft.",
    "rating": 4.6,
    "feature_bullets": [
      "Fits 2\" Olympic plates - Includes leash / harness",
      "Use on grass, carpet, or concrete - Little assembly required",
      "Weight: 37 LBS - Width: 16\"",
      "Length: 24\" - Leash / harness length: 10 ft.",
      "Leash / harness width: 2\" - Finish: Powder Coated"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "24 x 16 x 18 inches; 36.4 Pounds",
      "Date First Available": "May 7, 2015",
      "Manufacturer": "Titan Fitness",
      "ASIN": "B00XB2CQEC",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Training Equipment",
      "Sports & Outdoors",
      "Team Sports",
      "Sports & Fitness",
      "Sleds & Chutes",
      "Football"
    ],
    "price": 84.99
  }
}