{
  "website_summaries": [
    {
      "verdict": "Choose these waterproof socks if you are more concerned about keeping your feet dry than warm, as they are best suited for wearing in warmer temperatures.",
      "pros": [
        "Coolmax FX lining keeps exterior moisture away",
        "Wicks perspiration",
        "Unisex sizes"
      ],
      "cons": [
        "Not as warm as competing pairs",
        "Sizes run small"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "3 days in the rain bike camping = dry, warm feet!",
      "text": "Wow! These socks perform just as advertised. I did a 3 day bike camping trip on Pine Creek in PA over the last weekend and it rained every day - heavily at times - with temperatures only in the mid 50's. The trail was saturated and camp was soaked but these socks kept my feet dry and warm for 3 days straight under a pair of open Keen cycling sandals. I can HIGHLY recommend them!",
      "rating": 5.0,
      "verified": true,
      "author": "Brian Raines",
      "helpful_votes": 18,
      "publication_date": 20161003
    },
    {
      "title": "Really works!",
      "text": "The fit is a little weird but they work! I was sceptical when I first got them, but I immediately put them on and sprayed them with the hose for a solid minute and they work! My friends love to try and get them wet by pouring their water bottles on my socks, but the water just runs off. Definitely worth it.",
      "rating": 4.0,
      "verified": true,
      "author": "SamuraiSch",
      "helpful_votes": 10,
      "publication_date": 20160616
    },
    {
      "title": "These socks are great. I bought them because my work shoes were ...",
      "text": "These socks are great. I bought them because my work shoes were not waterproof and my socks kept getting wet. They are a tight fit, perhaps because I have wider feet and in turn made my feet sore the first few times I wore them. However, they kept my feet dry and it made all the difference when working a 10 hour shift. I have also worn them hiking when it was pouring. They kept my feet fairly warm and once again, dry. These socks are waterproof not water resistant. When washing make sure you flip them inside out or the water will stay inside.",
      "rating": 4.0,
      "verified": true,
      "author": "JVizcaya",
      "helpful_votes": 3,
      "publication_date": 20170109
    },
    {
      "title": "Waterproof for sure",
      "text": "They definitely are waterproof. I used them for clamming in the ocean. I got water in my boots but did not realize it until after I took the boot off! I also tried them as a winter sock for cycling, but they didn't keep me warm enough. Nonetheless, I would get them again, because they perform as described.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 3,
      "publication_date": 20170112
    },
    {
      "title": "I like them, yes they get a bit warm but what do you expect? They keep your feet from getting soaked. I'll buy again",
      "text": "I like them, they so get a little hot but would you rather your feet be soaked or a little clamy from perspiration? I'm an irrigation tech and my feet are soaked in the am. Switch them out at lunch and I'm a happy camper.",
      "rating": 5.0,
      "verified": true,
      "author": "RR",
      "helpful_votes": 0,
      "publication_date": 20171218
    },
    {
      "title": "Not waterproof",
      "text": "I was really disappointed. After reading reviews that said these are completely waterproof, even when immersed, I was expecting that they'd at least keep my feet dry in the rain. They didn't. After about 15 minutes of running in a light rain, they were leaking in the toes, damp and uncomfortable. If others have had better results I can only conclude that the product quality is very inconsistent. At nearly $40/pair these were a waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "Jeeter",
      "helpful_votes": 0,
      "publication_date": 20190202
    },
    {
      "title": "Waterproof socks perform as advertised",
      "text": "These waterproof socks perform as advertised. M feet stayed nice and dry during a rainy cycling trip. The socks are slightly heavier weight than I expected, but they work! Would buy them again.",
      "rating": 5.0,
      "verified": true,
      "author": "P. Fisher",
      "helpful_votes": 0,
      "publication_date": 20170612
    },
    {
      "title": "Works as expected. I bought these because my motorcross ...",
      "text": "Works as expected. I bought these because my motorcross boots are not very waterproof and I was tired of having wet cold feet end my ride early. They felt a little bulky when I first put them on but once I put my boots on I didn't notice. After I went through a deep puddle I could tell my boots were soaked on the inside because I could feel a drop in temperature on my feet but my feet stayed dry. These socks did exactly what they're supposed to do. Keep you feet dry.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161207
    },
    {
      "title": "My husband used them in the snow the other day and he was pleasantly surprised and quite pleased with the performance and comfor",
      "text": "Purchased these for my husband and two sons. My husband used them in the snow the other day and he was pleasantly surprised and quite pleased with the performance and comfort. He was able to keep the socks on long after he came in which made him very happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Donna",
      "helpful_votes": 2,
      "publication_date": 20170110
    },
    {
      "title": "My husband is a Groundskeeper so a majority of his ...",
      "text": "My husband is a Groundskeeper so a majority of his worklife is outside - Rain or Shine or Snow;) I purchased 2 pair and he loves them He always thinks his feet will be wet each time his day is over due to his boots being a wet mess!! But Every time he removes his boots while wearing these waterproof socks his feet have been dry! He's all I needed to convince;) Will order a couple more for his birthday!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170115
    },
    {
      "title": "Love them!",
      "text": "I'm a hold out for hiking boots in November... I'll give in soon enough. I appreciate the fit in my current trail runners. I broke them in on mud strewn trails. My feet were dry! I'd recommend an ultralight sock liner. I noted a standard sock liner began causing rubbing, which ultimately leads to blisters. A fine product! I'd highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191124
    },
    {
      "title": "Fits good, keeps feet warm and dry.",
      "text": "Fits great and so far holds up to whats advertised. Don't like the length of time it takes to fully dry after washing. The waterproof membrane prevents the inside from drying unless turned inside out after the outside is dry, or vise/verse.",
      "rating": 4.0,
      "verified": true,
      "author": "Gerald E Wade",
      "helpful_votes": 0,
      "publication_date": 20180211
    },
    {
      "title": "Worn during 13 day European tour. Kept my ortho booted foot dry.",
      "text": "Great waterproof socks. Only wore one sock at a time on my orthopedic booted foot. Kept my foot dry while in the boot which also was protected by a boot cover and contractor bootie. Worked great and I will use the socks to keep my feet dry at home where we get lots of rain in the winter.",
      "rating": 5.0,
      "verified": true,
      "author": "Teena Suzuki",
      "helpful_votes": 0,
      "publication_date": 20181223
    },
    {
      "title": "Great Product, feet did get a little hotter than ...",
      "text": "Great Product, feet did get a little hotter than normal but not so bad given the benefit of water proofing.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Watson",
      "helpful_votes": 2,
      "publication_date": 20160905
    },
    {
      "title": "Not warm, tight, but keeps the water out",
      "text": "Pro: Keeps the water out (waterproof) Con: The socks are tight and not warm",
      "rating": 2.0,
      "verified": true,
      "author": "Selene M.",
      "helpful_votes": 0,
      "publication_date": 20171226
    },
    {
      "title": "Great socks",
      "text": "Worth their weight in platinum when one is riding in cold/wet weather.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181106
    },
    {
      "title": "Great for snow too",
      "text": "Great sock perfect for the winter right now to shovle snow. Truly does keep out water and keeps feet warm. Con this sock will make your feet sweat.",
      "rating": 4.0,
      "verified": true,
      "author": "Sofia Inca",
      "helpful_votes": 0,
      "publication_date": 20170110
    },
    {
      "title": "Very hard socks!",
      "text": "They look in the picture like normal socks, but they are very hard, when you wear them, they feel like they are made of cardboard. I soaked them in water to test them, and yes they are waterproof, but they remained wet on the outside for a while.",
      "rating": 2.0,
      "verified": true,
      "author": "CAS",
      "helpful_votes": 0,
      "publication_date": 20181208
    },
    {
      "title": "Showers Pass Socks",
      "text": "These socks are fantastic for search and rescue in our very rainy climate, just not quote as comfortable as the ones I bought my husband. A little thick. But I will wear them over any of the others I have!",
      "rating": 4.0,
      "verified": true,
      "author": "Debsjustk9",
      "helpful_votes": 0,
      "publication_date": 20170509
    },
    {
      "title": "Not 100% water proof",
      "text": "The socks are not 100% water proof it’s only up till around the ankle and the rest gets really wet. Once water gets inside from these areas above the ankle you might as well be wearing regular socks. They are warm when dry and comfortable but not reliable.",
      "rating": 3.0,
      "verified": true,
      "author": "Jason Martinez",
      "helpful_votes": 0,
      "publication_date": 20191218
    },
    {
      "title": "It is NOT a waterproof at all.",
      "text": "First time used. After 15 miles or 3.5 hours on wet trail my feet completely wet. It is NOT a waterproof at all. Water was insight of the socks. It is overpraised 2 layers socks with something insight but it is NOT a waterproof. Total disappointment from the product every single word in description is misleading will contact manufacturer.",
      "rating": 1.0,
      "verified": true,
      "author": "S B",
      "helpful_votes": 4,
      "publication_date": 20180324
    },
    {
      "title": "Great product!",
      "text": "They feel really nice and we had a great time testing them in the bathtub",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180601
    },
    {
      "title": "Perfect for those that have to work outdoors in all ...",
      "text": "They are definitely waterproof! Perfect for those that have to work outdoors in all kinds of weather.",
      "rating": 5.0,
      "verified": true,
      "author": "Emily Littrell",
      "helpful_votes": 0,
      "publication_date": 20180125
    },
    {
      "title": "Best Quality Around",
      "text": "Best waterproof sock around, much thicker than you realize so assume a wool sock when sizing with shoes.",
      "rating": 5.0,
      "verified": true,
      "author": "Benin Bembry",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "Buy this",
      "text": "Sized correctly. I wear 11 an purchased xl. Feels flexible and comfortable as well. Will be ordering pair for wife and 2 more for myself",
      "rating": 5.0,
      "verified": true,
      "author": "Rdt",
      "helpful_votes": 0,
      "publication_date": 20171028
    },
    {
      "title": "Eager for dry feet",
      "text": "I purchased this for my boyfriend as a gift, he is a builder that works in all weather. He loves the concept of these socks and the way they fit and feel. He is yet to wear them but looks forward to having dry feet in rainy conditions. I will update again after he has the opportunity to utilize them.",
      "rating": 5.0,
      "verified": true,
      "author": "Tisha",
      "helpful_votes": 0,
      "publication_date": 20170128
    },
    {
      "title": "Says water proof, IS WATERPROOF! Important to know, these should only be used for cycling.",
      "text": "Over all excellent product! Strictly for cycling 🚴. Product maintains its waterproof characteristics even when fully submerged! Perfect for the commuter who knows they have to push through a torrential downpour!",
      "rating": 5.0,
      "verified": true,
      "author": "Brad P Klopp",
      "helpful_votes": 0,
      "publication_date": 20180111
    },
    {
      "title": ". No more skin cream to heal damaged feet. Free at last!",
      "text": "They really work wonderfully. My grandson walks in water and his feet are dry.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190922
    },
    {
      "title": "Winter Bike Commuting in Sandals with these",
      "text": "Great socks! I can bike to work in my sandals and just these socks down into the low 40's. About 40 minutes outside. If I put on midweight Defeet wool socks underneath I can go down to the upper 20's.",
      "rating": 5.0,
      "verified": true,
      "author": "Xchequer",
      "helpful_votes": 0,
      "publication_date": 20161222
    },
    {
      "title": "Great socks. Highly",
      "text": "I walked around in the snow to put this product to the test. I had another thin pair of socks on underneath, and my feet were warm and dry after a half an hour. Great socks. Highly recommended",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170217
    },
    {
      "title": "these worked great. Feet never wet and warm the whole time",
      "text": "Did a bike race this weekend in the rain, these worked great. Feet never wet and warm the whole time. I have bought a second pair....",
      "rating": 5.0,
      "verified": true,
      "author": "Moneedr",
      "helpful_votes": 0,
      "publication_date": 20161031
    },
    {
      "title": "love these things",
      "text": "WATER PROOF SOCKS WILL CHANGE YOUR LIFE. love these things, the definitely beat shoe covers, although they are quite thick so be sure you have enough room in your shoes for a few layers.",
      "rating": 5.0,
      "verified": true,
      "author": "Becca",
      "helpful_votes": 0,
      "publication_date": 20170114
    },
    {
      "title": "Awesome and truly waterproof!",
      "text": "Exactly as advertised. Kept my feet dry and comfortable hiking in wet soggy conditions.",
      "rating": 5.0,
      "verified": true,
      "author": "Bob Foster",
      "helpful_votes": 0,
      "publication_date": 20200128
    },
    {
      "title": "Absolutely waterproof",
      "text": "It`s very good product. I soaked these socks in the water and tried and It`s really absolutely waterproof.",
      "rating": 5.0,
      "verified": true,
      "author": "Giorgi Lanchava",
      "helpful_votes": 0,
      "publication_date": 20181208
    },
    {
      "title": "Outdoor Walker",
      "text": "I recommend wear another pair of socks underneath as the material does not stick to your feet so the slide around against the sock which is a little uncomfortable for my toes.",
      "rating": 4.0,
      "verified": true,
      "author": "Cassie",
      "helpful_votes": 0,
      "publication_date": 20170515
    },
    {
      "title": "Four Stars",
      "text": "Warm socks, haven't been wet, but I can tell they will work.",
      "rating": 4.0,
      "verified": true,
      "author": "William C",
      "helpful_votes": 0,
      "publication_date": 20161128
    },
    {
      "title": "Great product!",
      "text": "Bought pairs for my son and he loves them! Has worn them everyday since he opened the package. Great product!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170314
    },
    {
      "title": "Five Stars",
      "text": "Not as waterproof as I would have liked but I still like them.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161202
    },
    {
      "title": "Run on the small side!",
      "text": "They def are waterproof! Wish I would have got the next size up! They run small and my small toe goes numb!",
      "rating": 3.0,
      "verified": true,
      "author": "David Johnson",
      "helpful_votes": 7,
      "publication_date": 20160217
    },
    {
      "title": "Would not recommend wearing them with waders while duck hunting",
      "text": "The socks definitely keep your feet dry, but they fail to provide warmth at all. Would not recommend wearing them with waders while duck hunting.",
      "rating": 1.0,
      "verified": true,
      "author": "kelly motes",
      "helpful_votes": 2,
      "publication_date": 20170213
    },
    {
      "title": "Three Stars",
      "text": "The socks do have a rubbery feel to them and they feel tight.",
      "rating": 3.0,
      "verified": true,
      "author": "brittny collins",
      "helpful_votes": 0,
      "publication_date": 20171031
    },
    {
      "title": "I like them for cycling",
      "text": "For having a rubber liner sandwiched between two socks basically. I thought they fit good. They are made for hiking/walking but I use them for cycling. There is a \"get used to\" period but after that they didn't swim in my cycling shoes and I didn't overheat in them either. Perfect for keeping dry. I haven't used them i a downpour but 3 hour light shower ride.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Don",
      "helpful_votes": 0,
      "publication_date": 20161121
    }
  ],
  "product_meta": {
    "title": "Showers Pass Waterproof Crosspoint WP Crew Sock",
    "rating": 4.1,
    "feature_bullets": [
      "STAY DRY - No soggy toes and keep your feet dry while cycling, running, hiking, hunting or any outdoor activity in the rain.",
      "COMPLETELY WATERPRROF - a wear resistant knit exterior (feels like a regular sock),",
      "BREATHABLE - Waterproof sock with Coolmax FX moisture wicking anti-bacteria lining.",
      "78% Nylon 15% Polyester 7% Spandex, Close Fitting to help prevent blisters",
      "DURABLE - Long lasting waterproofing won't wear down"
    ],
    "categories": [
      "Men",
      "Outdoor Recreation",
      "Sports & Outdoors",
      "Clothing, Shoes & Jewelry",
      "Outdoor Clothing",
      "Socks"
    ],
    "price": 35.0,
    "specifications": {}
  }
}