{
  "website_summaries": [
    {
      "verdict": "The Inov-8 Fastlift 325 has been extensively praised as a weightlifting shoe. Users were united in saying that the sole was sturdy enough and that the shoe helped to improve their posture, squats, and lifts. The trainer was deemed as a great weightlifting shoe which is also light and flexible enough for some CrossFit WODs.",
      "pros": [
        "A great number of the purchasers liked that the Fastlift 325 offered a combination of flexibility and sturdiness",
        "A number of training aficionados stated that the shoe helped them improve their squats, posture, and lifts",
        "The heel section of the platform had just the right height, according to a majority of testers",
        "Some buyers commented that the shoe looks durable",
        "Multiple users said that it was very light for a weightlifting shoe",
        "Many users were pleased with the snug fit as it made the shoe feel supportive",
        "Some mentioned that the toe box had just the right width for toe splaying"
      ],
      "cons": [
        "A few testers said the laces easily came undone during the workout session",
        "The tongue dug into the skin of some wearers"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": 9.1,
      "source": "runrepeat"
    }
  ],
  "customer_reviews": [
    {
      "title": "Inov8 fastlift 325",
      "text": "I purchased these inov8 fast lift 325 weight lifting shoes around three weeks ago. They arrived within the expected delivery time. The fit is perfect. The quality of the shoe is amazing and I love the color. I can feel the extra stability when lifting. But especially when lifting heavy or doing pistols. I would recommend these shoes to anyone thinking of buying weight lifting shoes.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20160930
    },
    {
      "title": "Great for focused lifting",
      "text": "Great for focused lifting, the front of the sole (towards the toes) is more flexible than some other brands so can be used for certain Crossfit WODS where a fully rigid sole would not be suitable.",
      "rating": 4.0,
      "verified": true,
      "author": "J G",
      "helpful_votes": 0,
      "publication_date": 20170620
    },
    {
      "title": "Must buy",
      "text": "Great shoes. Added stability has increased my squat and DL",
      "rating": 5.0,
      "verified": true,
      "author": "William S.",
      "helpful_votes": 0,
      "publication_date": 20170522
    },
    {
      "title": "Five Stars",
      "text": "A truly awesome lifting shoe. Well made, looks great and offers great support",
      "rating": 5.0,
      "verified": true,
      "author": "2Sc00ps",
      "helpful_votes": 0,
      "publication_date": 20160815
    },
    {
      "title": "Love these shoes",
      "text": "Love these shoes! I wear them 3 times a week. They are comfy, provide a stable lifting platform and look pretty good.",
      "rating": 5.0,
      "verified": true,
      "author": "Simon D.",
      "helpful_votes": 0,
      "publication_date": 20170531
    },
    {
      "title": "Great purchase, exactly as advertised",
      "text": "Great purchase, exactly as advertised.Top quality lifting shoe. Dispatched and delivered to Ireland 4 days after ordering so they arrived almost a week early.👍",
      "rating": 5.0,
      "verified": true,
      "author": "Nick McCarthy",
      "helpful_votes": 0,
      "publication_date": 20170331
    },
    {
      "title": "Buy buy buy",
      "text": "Very light weight with a firm base and plenty of movement and flexibility. Perfect for weightlifting. Would recommend to anyone looking for weightlifting shoes.",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony Ellis",
      "helpful_votes": 0,
      "publication_date": 20160811
    },
    {
      "title": "UK/US size",
      "text": "Real problems with ordering - ordered as a UK size but keep getting sent a US 9 which is a UK 8, not a UK 9. Three attempts to get the right UK size",
      "rating": 1.0,
      "verified": true,
      "author": "Sinead Baxter",
      "helpful_votes": 0,
      "publication_date": 20180323
    },
    {
      "title": "Great service",
      "text": "Top class prompt delivery, had to return item because fit was too large.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. Brendan Hanley",
      "helpful_votes": 0,
      "publication_date": 20161105
    },
    {
      "title": "Excellent",
      "text": "Love them. Very nice shoe and the fit is fantastic. Very comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170107
    },
    {
      "title": "Another great lifting shoe from Inov-8",
      "text": "My old pair of 335s were starting to look a bit tatty. I did get a lot of use out of them so opted for a refresh. Again, size 10.5 UK fit my 11 foot perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Wigginton",
      "helpful_votes": 0,
      "publication_date": 20170928
    },
    {
      "title": "Great comfortable lifting shoe",
      "text": "Great comfortable lifting shoe. I'm between a 7 and 8 in most shoes so ordered a 7.5 - perfect fit.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Harrison",
      "helpful_votes": 0,
      "publication_date": 20170205
    }
  ],
  "product_meta": {
    "title": "inov-8 Men's Fastlift 325 Road Running Shoes",
    "description": "A state-of-the-art lifter series delivery maximum stability and forefoot flexibility for functional and plyometric training. The lightest, most flexible shoe in weightlifting. The Fastlift 325 offers unmatched versatility in the performance training category with its superior flexibility and grip paired with inov-8's powertruss heel system for stability.",
    "rating": 4.6,
    "feature_bullets": [
      "For weightlifting, fitness, and performance training",
      "Lightest weightlifting shoe on the market",
      "Outer Material: Synthetic",
      "Sole: Synthetic",
      "Closure: Combination",
      "Heel Height: 9 millimetres",
      "Material Composition: Synthetic",
      "Shoe Width: Medium",
      "Flexibility: meta-flex technology in the forefoot provides more comfortable movement, allowing transition from Olympic weightlifting to other functional movements in the same workout",
      "Incredible stability: external heel cage and power-truss technology deliver lateral stability and a stable base for lifting",
      "Standard fit"
    ],
    "specifications": {
      "Package Dimensions": "35.56 x 17.78 x 12.7 cm; 453.59 Grams",
      "Date First Available": "17 Nov. 2009",
      "Manufacturer": "Inov-8, LLC",
      "ASIN": "B084W9CPN2",
      "Item model number": "FASTLIFT 325",
      "Department": "Men's"
    },
    "categories": [
      "Fashion & Athletic Trainers",
      "Shoes",
      "Sports & Outdoor Shoes",
      "Men's Shoes",
      "Road Running Shoes",
      "Running Shoes",
      "Shoes & Bags"
    ],
    "price": 182.48
  }
}