{
  "website_summaries": [
    {
      "verdict": "The JBL Charge 2+ is a wireless Bluetooth speaker that sounds flat-out great -- and can double as a backup battery for your phone, too.",
      "pros": [
        "The JBL Charge 2+ is a well-designed, water-resistant portable Bluetooth speaker that features good battery life and doubles as an external charger for your portable devices",
        "It also has built-in speakerphone capabilities, and plays loudly with relatively strong bass and top-notch performance for its size and price class"
      ],
      "cons": [
        "While the speaker is water-resistant, it isn't waterproof (its ports remain exposed)"
      ],
      "aspects": {
        "Design": 8.0,
        "Features": 9.0,
        "Sound": 8.0,
        "Value": 8.0
      },
      "publication_date": 20150717,
      "rating": 8.3,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Very short life!!!",
      "text": "Great sound quality when it arrived. Great battery life too. After about a year the battery life was mor like an hour and on top of that it would start making this terrible “ alarm “ type noise and wouldn’t take a charge. Tried letting it sit a few days but to avail. Just threw it away. Won’t EVER buy another. The UE Boom that I bought used is still going strong.",
      "rating": 2.0,
      "verified": true,
      "author": "James McCoy",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Great speaker, but the battery is crap",
      "text": "Great speaker, but the battery is crap! One year old just out of warranty and the battery won't hold a charge long. After a full charge, which doesn't take as long as it should anymore, it drains down rapidly at medium volume levels. I am very disappointed. Initially, I loved it so much I also bought a Flip 3 to compliment the Charge 2. Well the Flip 3 got sent back to JBL two weeks ago as the charger quit working. Thankfully it was still under the warranty. Needless to say, I won't be a JBL fan anymore. I have friends that have other brands 1-4 years old and still working great. Buy something else.",
      "rating": 2.0,
      "verified": true,
      "author": "Ronwasright",
      "helpful_votes": 2,
      "publication_date": 20170701
    },
    {
      "title": "Best sounding speaker for their size.",
      "text": "I needed a speaker that fits inside my every day work lunch bag. There are actually four speakers inside this unit. The two side speakers give that extra base. You can hear the bass but you can't feel the bass, so don't expect it to shake the walls or windows. What do you expect from something so small? These do sound great and the battery lasts pretty long, 8-10 hours at near full volume for me. JBL takes care of its customers too. I had a slight problem with a previous speaker and instead of repairing mine, JBL sent me a brand new speaker.",
      "rating": 5.0,
      "verified": true,
      "author": "LAZ",
      "helpful_votes": 0,
      "publication_date": 20180311
    },
    {
      "title": "Lasted about a year until it quit working",
      "text": "This is a great speaker for what it does but one day went to use it; it had the light on but no sound or any other response. Apparently that's been the most common problem I found others having when I researched troubleshooting issues on it. When it works it does a great job. Good sound, good bass for it's size. I should add I used this daily for maybe one to three hours for about a year. Luckily it's under warranty but really what a pain. I have to pack it, ship it and wait. Meanwhile I need to purchase ANOTHER bluetooth speaker to use in the meantime.",
      "rating": 3.0,
      "verified": true,
      "author": "Virgil",
      "helpful_votes": 0,
      "publication_date": 20180818
    },
    {
      "title": "So far looks good",
      "text": "Let me start by say that i don't like the saying great sound for such a little speaker or a great bang for your buck. I bought this because it had great reviews and I didn't need it for a party mode, i have a receiver that takes care of those needs. I wanted something that was just good enough to compliment my Echo Dot. I have had and i'm still using my original JBL Flip which was fine and is still working, but the Charge 2+ is much better sounding speaker with a decent bass that kicks it up a notch. The price was half of the Charge 3 so that's what helped me with my choice.",
      "rating": 5.0,
      "verified": true,
      "author": "Barry J. Gervais",
      "helpful_votes": 0,
      "publication_date": 20170826
    },
    {
      "title": "Souds awesome",
      "text": "When it was working it sounded great with really good bass and voice and we used it a lot. Its been around a year since purchase and it works sometimes and other times the speakers crackle and cut in and out. I'm on the fence on if I should purchase a replacement from JBL as I purchased their headphones at around the same time and one of the earbuds doesn't work already. These two events has me questioning the quality and reliability of the JBL products I once loved and raved about.",
      "rating": 4.0,
      "verified": true,
      "author": "JR",
      "helpful_votes": 0,
      "publication_date": 20190417
    },
    {
      "title": "Lopsided, don’t buy",
      "text": "This speaker is lopsided, resulting in rolling with a little bit of movement. A little wind and this speaker rolled right off our BBQ, from 3 feet and that was it, she died. Poor design. They could easily have widened the base to combat this problem, but they didn’t. As a result, I’ll be switching to to another manufacturer.",
      "rating": 1.0,
      "verified": true,
      "author": "Dennis B.",
      "helpful_votes": 2,
      "publication_date": 20180606
    },
    {
      "title": "Great speaker, excellent battery life, but a bit wobbly.",
      "text": "Great sound quality and excellent battery life. The \"party\" mode is interesting too, although it can cause issues if you have several devices and one gets a text message or something. In that case, it will switch the audio to the other device, and not switch back. It does seem to be splash proof thus far. The only downside is that the base isn't very sturdy so it doesn't like to stay in place that well on surfaces that aren't perfectly level.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin Hudson",
      "helpful_votes": 0,
      "publication_date": 20180103
    },
    {
      "title": "Would not recommend this speaker",
      "text": "Would not recommend this speaker, although it worked great at first. After 5 months of use having been well taken care of just crapped out one day and now just makes a loud buzzing noise. And for the price I would expect a better quality product also after a few months use I experienced a sharp drop in battery life although it advertises that you can charge your phone from it doing so drains the battery to the point that the speaker dies after a few hours",
      "rating": 2.0,
      "verified": true,
      "author": "Rick C",
      "helpful_votes": 2,
      "publication_date": 20170419
    },
    {
      "title": "High Quality Sound",
      "text": "I have a Jabra Solemate bluetooth speaker, and it works really well in delivering high-quality music from my iPad. I keep the Solemate in the kitchen area, and wanted another high-quality bluetooth speaker. At first, I bought a highly-rated $49 bluetooth speaker, and for $49, it was very good, but it didn't produce the sound quality I wanted. Next I bought the JBL Charge2+, and it rocks! It's sound quality is probably better than my Solemate, with crisp highs and decent bass. We had a small party (about eight people) and it was a solid performer. I find the loudness to be plenty, and I've never needed to crank the volume past about two-thirds.",
      "rating": 5.0,
      "verified": true,
      "author": "Iron Drive",
      "helpful_votes": 0,
      "publication_date": 20160915
    },
    {
      "title": "Such a nice addition to my home",
      "text": "I love love love this. It connects quickly to my phone and laptop BUT it's not true that it's seamless going back and forth between both. It starts acting up if both are connected -- I'll be listening to music on my laptop but then I get a text on my phone and everything comes to a stop. Regardless, the sound is awesome and the battery life is fantastic (I have had it for months now). Speakerphone is good too but for me it's all about the music/sound, and you get a whole lot of it for the price. It would take a lot for me to go back to Bose!",
      "rating": 5.0,
      "verified": true,
      "author": "NN",
      "helpful_votes": 0,
      "publication_date": 20171106
    },
    {
      "title": "A+ JBL is a industry leader for the last 20years for a reason. Amazing Sound+Bluetooth Range",
      "text": "Can’t ever go wrong w/ JBL and the price is a bargain. I have used this thing in snow, sleet and pouring rain with absolutely no problems. I will say you can tell a noticeable difference in battery life when using outside during very warm days, it will drain it fast. The Bluetooth range is pretty remarkable, I have had mine on the bed of a pickup truck while phone is on my side in a bucket truck an never lost signal or faded one bit.",
      "rating": 5.0,
      "verified": true,
      "author": "Troy",
      "helpful_votes": 0,
      "publication_date": 20181008
    },
    {
      "title": "IM SO TIRED OF THE BATTERY DYING",
      "text": "IM SO TIRED OF THE BATTERY DYING. It’s an ok little speaker with decent sound quality as long as you can guarantee it is constantly plugged in. Don’t bother trying to charge and bring Somewhere with you, it will be dead by then. This is the 3rd one I’ve bought telling myself ‘it’s just THAT one with a crappy battery.’ But they’re all the same. What a nuisance, I want a refund.",
      "rating": 2.0,
      "verified": true,
      "author": "Ryan",
      "helpful_votes": 0,
      "publication_date": 20181229
    },
    {
      "title": "This has amazing sound for the price",
      "text": "I bought one of these for myself, then I sold it to a friend that has a teenager. Her husband and her teenager fight over it. She is now in the market for another JBL Charge... probably of the third generation. Also, I bought one of these for my sister (who was asking for a bluetooth speaker for christmas). I have now received two thank you notes: one from my sister, one from her husband. This fits in a bike bottle cage, by the way. This has amazing sound for the price, but the bass is a little strong, when using with an iPad.",
      "rating": 4.0,
      "verified": true,
      "author": "Theoretical Schism",
      "helpful_votes": 0,
      "publication_date": 20161008
    },
    {
      "title": "Great Little Speaker!",
      "text": "This speaker has performed well above my expectations for sound, battery life, and portability. The battery has lasted on average 10 hours before needing a charge. The sound is clear, crisp and very loud. I charge my I-phone while I listen to music on the golf course and my friends want to know who makes the speaker. I have dropped this speaker two times from the back of my truck onto concrete and it has not broken. Great speaker!",
      "rating": 5.0,
      "verified": true,
      "author": "T. Hufstetler",
      "helpful_votes": 3,
      "publication_date": 20160520
    },
    {
      "title": "Mini Boombox with Boom!",
      "text": "This is a very good personal Bluetooth speaker. I use it at work during my lunch break with YouTube videos on my phone to enjoy songs and news as I eat. The bass is very deep and clear, and the mids are strong too. It is also a good size and weight. I have one by another manufacturer that's a little louder, but doesn't hold a charge as long as this one. You just can't go wrong with JBL. This is great for small get-togethers, relaxing, grilling, picnics,etc. I'd buy it again.",
      "rating": 4.0,
      "verified": true,
      "author": "Happy Fella",
      "helpful_votes": 0,
      "publication_date": 20161230
    },
    {
      "title": "Beyond Awesome!",
      "text": "This is the second JBL Charge I've had. The charging circuit died on the first one, but the speaker sounded so good that I bought another one. The run time is crazy (10-12 hours) and I bought the extended warranty with this one just in case I have problems. Frigging love this thing and I use it every day. You WON'T regret your purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170702
    },
    {
      "title": "Speaker died right after warranty ended!",
      "text": "I bought this a little over a year ago....loved it until it started having problems charging. Called the company and they told me how to reset the speaker and all was well. Now, it will not charge at all, it is also very finicky when trying to use it plugged in. My only complaint with this speaker is the charge connector. It always seemed cheap and unable to connect well. It is now out of warranty. I will try to keep using it hooked to power, but disappointed that it only lasted this long with very little use. Sad.",
      "rating": 2.0,
      "verified": true,
      "author": "Lynn Hansen",
      "helpful_votes": 0,
      "publication_date": 20160913
    },
    {
      "title": "These speakers work just like the JBL Charge 2",
      "text": "These speakers work just like the JBL Charge 2, but are waterproof. I showered with these twice so far and everything appears to be in good working condition. If youre unfamiliar with the Charge 2, the sound quality is impressive. It has 2 mini subwoofers on each end of the speakers to give a lot of attention to the bass. The battery life also appears to be impressive. So far, I have used them for about 4 hours straight and it still appears to have an 80%+ charge left. Sound quality wise, I own a set of beats over hear headphones and these kind of remind me of those.",
      "rating": 5.0,
      "verified": true,
      "author": "Adrian",
      "helpful_votes": 0,
      "publication_date": 20151222
    },
    {
      "title": "The little speaker that could",
      "text": "Got this as a gift and wasn't sure what to make of it. I've had it over a year now and it's an essential part of my life! It's rugged and can just be tossed into my backpack and has great base for being a little soda can sized device. It also fits any micro usb phone charger so it's easy to charge it up anywhere. I not keep it in a small zipper carry case to keep it clean when I travel. Absolutely love this speaker.",
      "rating": 5.0,
      "verified": true,
      "author": "Crumb Jar",
      "helpful_votes": 0,
      "publication_date": 20180511
    },
    {
      "title": "Very portable, good battery life, and sounds good",
      "text": "Not sure if I am qualified as sound expert, however, the speaker is build for a party. It focus a lot on the Bass sound. If you are into techno or Hip-Hop music this should do great for your outdoor party. If you are a classical lover, this gives you a good overall sound but would not let you hear all the instruments from it. The battery life is very good. I have used it for 3 hours continuously and still have half of the power.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181206
    },
    {
      "title": "Great Sound & easy to connect",
      "text": "Lots of sound from a very small package. Charges up quickly and I've never run out of battery life ... but haven't really pushed it too far so I don't know how long it will last. Best part, very easy to connect to Bluetooth device, also used the dual Bluetooth option, again, very easy to use and sounds great.",
      "rating": 5.0,
      "verified": true,
      "author": "ArtR",
      "helpful_votes": 0,
      "publication_date": 20190816
    },
    {
      "title": "Powerful and impressive...",
      "text": "I’m really picky about how my music sounds...really picky! This little guy has powerful sound for such a small speaker, efficient amount of bass, though I do wish it had a little more high end clarity. I’ve tested it with multiple genres ranging from metal to blues, and the balance between frequencies is impressive, as is the range. It cranks...loud!!!! The device itself feels durable, without being bulky or too cumbersome to drag from room to room. You can pay way less than $115 for a Bluetooth speaker, but you get what you pay for. I’m telling you that this JBL is money well spent.",
      "rating": 5.0,
      "verified": true,
      "author": "M3",
      "helpful_votes": 0,
      "publication_date": 20160415
    },
    {
      "title": "Highly recommended, couldn't be happier with the Charge 2+",
      "text": "One of the best values I've every gotten for $80. Beautiful quality sound, excellent battery life, and generally a high quality product. There is the very occasional bluetooth connectivity issue but its once out of every 40 connections or so. Short of that this speaker has been perfect in the last 2 years of ownership despite being dropped from waist height onto concrete and seeing other abuse.",
      "rating": 5.0,
      "verified": true,
      "author": "Tom",
      "helpful_votes": 0,
      "publication_date": 20180720
    },
    {
      "title": "Broke in under 2 years",
      "text": "Internal battery failed in less than 18 months. If you buy, get the insurance. Until then it had been wonderful, but as a student I can't spend money replacing expensive electronics annually. Ridiculous.",
      "rating": 1.0,
      "verified": true,
      "author": "Elky82",
      "helpful_votes": 4,
      "publication_date": 20170704
    },
    {
      "title": "Fantastic speaker. Gets plenty loud for indoor use and ...",
      "text": "Fantastic speaker. Gets plenty loud for indoor use and is exceptional for outdoor use as well. I take this thing in the shower with me every day and use it combined with the yoshi waterproof phone cover for music and netflix in the shower/bath. The only complaint that I have is that there is just a bit too much bass. This speaker is very capable of producing fantastic music but the built in EQ ramps up the bass a bit too much for me. Thanks to Viper4Android I now have the perfect sound. Overall a great speaker though for the price!",
      "rating": 4.0,
      "verified": true,
      "author": "Corbin D.",
      "helpful_votes": 0,
      "publication_date": 20160514
    },
    {
      "title": "Great Portable Bluetooth Speaker!",
      "text": "Great Portable Bluetooth Speaker! Sound is awesome - my husband and his friends are really into music and we used this at a New Year's party. Everyone commented on and loved the sound of this speaker. The fact that 3 people can tap into it was great as well, so everyone could play their own music from their phones too! Not as tiny as some portable speakers out there, but the sound is so much better - you will not regret it.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20170102
    },
    {
      "title": "I love it!",
      "text": "I use it everywhere i go. Battery lasts a full 12hrs without needing to charge. For a few hours of use a day, I go about a month before I have to charge it again. Ive used this little guy for hiking, parties, at the pool, & at the beach. great for watching movies on a laptop at the pool! Pros Booming bass. Battery Life gets pretty Loud Cons. Bass is overpowering at times. too quiet to take phone calls.",
      "rating": 5.0,
      "verified": true,
      "author": "frank javier",
      "helpful_votes": 0,
      "publication_date": 20170319
    },
    {
      "title": "The best portable speaker",
      "text": "The sound quality is amazing! My friends and family are blown away how small the speaker is but how great they sound. I purchased mine with a case which helps store and transport the speaker, charger, and cable. The wall changer is bigger than the regular iPhone charger, almost twice the size. I usually have a concern with small speakers about not having enough bass. There is plenty of bass with these speakers. Great speaker for the backyard, the beach, park, camping etc. I carry a power bank to charge my iPhone, iPad, etc but haven't used it on these speaker. Many hours of playing time, I used it to charge my phone and still played for many hours.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe H. Cota",
      "helpful_votes": 0,
      "publication_date": 20160611
    },
    {
      "title": "Best bang for your buck when it comes to a bluetooth speaker",
      "text": "This is my 3rd JBL Charge 2+ reason being is this speaker is so amazing that people keep borrowing mine so I keep ordering replacements. Best sound around, lasts for what seems like ever, very easy to connect to, so far so good with being in the rain / touching water briefly. handled the dust of the desert perfectly and lasted the whole weekend effectively at a reasonable volume",
      "rating": 5.0,
      "verified": true,
      "author": "MikeVertx",
      "helpful_votes": 0,
      "publication_date": 20171120
    },
    {
      "title": "You wont find a better speaker for the money.",
      "text": "I was very impressed at the amount of bass and clear sound this thing put out. I'm not a true \"audiophile\" but I do care about clear/crisp sound with good bass. The battery on this thing is insane, I swear they have a nuclear reactor in this thing... just goes for many hours without any issues. Connects right up to my phone, Echo, and other products. I heard this is actually a better model than the 3 for sound, and so far that feels true.",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan O'Connor",
      "helpful_votes": 0,
      "publication_date": 20170110
    },
    {
      "title": "Great speaker.",
      "text": "Great speaker for its size. Definitely worth it's current price of $69.99. Price will probably drop even more since there are newer models out. I didn't want to spend over $100. So this was perfect for me. Battery last me about 3 days with off and on use and varying volume levels. Would easily last a whole day at a picnic or beach. Only thing I wish it had was a cover for the inputs/output. I'd be worried about sand at the beach. A piece of tape could help with that, maybe.",
      "rating": 5.0,
      "verified": true,
      "author": "Moose",
      "helpful_votes": 0,
      "publication_date": 20170901
    },
    {
      "title": "Great sound with a not-so great battery life",
      "text": "I purchased this June of 2016, worked flawlessly up until August of 2018. Problems with the battery holding a charge became very obvious as I now have to charge the battery every day whereas I could go a full 3 days without a charge.",
      "rating": 3.0,
      "verified": true,
      "author": "2wings4icarus",
      "helpful_votes": 0,
      "publication_date": 20181031
    },
    {
      "title": "BATTERY FRIED!!",
      "text": "Battery fried and no longer takes a charge!! Speaker now has to be tossed, Only lasted a little over a year. For a product that costs this much, i would expect a much longer lifespan! I have bought a couple other cheaper speakers that i've used more frequently that lasted longer than this! This speaker worked fairly well to provide sound for a single room, though it does lean a little bass heavy and does not produce bright high notes/treble.",
      "rating": 2.0,
      "verified": true,
      "author": "Luke T Marshall",
      "helpful_votes": 0,
      "publication_date": 20181212
    },
    {
      "title": "Very portable.  Suits my needs well. I'd buy it again. Has an aux input for a wire if needed.",
      "text": "The sound is good for the price. You get what you pay for. But it's very portable. It has the aux input - so you can do a wired connection. The wireless/bluetooth connection is reliable. It will charge your phone or tablet while you play music. You can unplug it from the wall, and it will still work and still charge your phone. I'd but it again. It's plenty loud for my purposes but I'm not using it for big parties.",
      "rating": 5.0,
      "verified": true,
      "author": "Larry P.",
      "helpful_votes": 0,
      "publication_date": 20160530
    },
    {
      "title": "So disappointed I can not return the item for a new ...",
      "text": "This item stopped charging after 2 months. I plug the charger in and it does not charge. I tried other chargers and they do no charge also, so the charger is not the problem, its the actual speaker not accepting. So disappointed I can not return the item for a new one. $115 down the drain. Has anyone else had this problem?",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 7,
      "publication_date": 20161211
    },
    {
      "title": "Bottom line I love the sound and this speaker can stand up to ...",
      "text": "Trust me when I say this speaker about 8 inches in length and is extremely powerful and can handle the volume. I wanted an outdoor speaker for our pool. I set this up on our upper deck and its more than enough to hear over splashing and loud pool voices. It has even taken a 12 foot drop onto grass (thank you to my 4 yr old) and has gotten splashed repeatedly when moved next the pool (thanks to the 7 yr old). Bottom line I love the sound and this speaker can stand up to my two boys and their antics. You cant go wrong with JBL.",
      "rating": 5.0,
      "verified": true,
      "author": "Otis",
      "helpful_votes": 0,
      "publication_date": 20150930
    },
    {
      "title": "Love this JBL Charge 2+!",
      "text": "My sister and I bought this for our Dad as a gift and we all love it. It's super easy to grab and go. We bought the Khanka EVA hard case from Amazon to store it in and take on the go. We use it for pool parties (it has great sound and volume!), events, around the house, etc. Very easy to connect to Bluetooth. Very pleased!!",
      "rating": 5.0,
      "verified": true,
      "author": "auberdauber0187",
      "helpful_votes": 0,
      "publication_date": 20170503
    },
    {
      "title": "Battery Stopped Recharging",
      "text": "I was happy with the sound quality and thought this was a good product until the battery stopped holding a charge. Now it pretty much must be plugged in to work. I've had it two years this month, so that is unacceptable. I will not buy another JBL speaker for this reason. Replacement battery(which gets mixed reviews) costs $30.00, and the speaker only cost $79.00 to begin with. Hardly worth it.",
      "rating": 1.0,
      "verified": true,
      "author": "Larry Brown",
      "helpful_votes": 0,
      "publication_date": 20181120
    },
    {
      "title": "Great value. Excellent performance",
      "text": "Great value. Excellent performance. Great base and treble. Easy recharge (don't know how long to recharge as it was charged when I received it and has yet to run down). Easy Bluetooth hook-up. HDMI if you want it (not sure why anyone would). And Standard quick delivery from Amazon. But the real deal is the sound. I've heard the Apple Beats Pill XL ($300 and recalled) and it is no better than the $100 JBL. The volume is as much as I can handle (and I like loud R&R) and the quality of the sound is as good as my $1k home system. I'm extremely satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "John S McSpadden",
      "helpful_votes": 0,
      "publication_date": 20160718
    },
    {
      "title": "Excellent speaker!",
      "text": "This speaker is excellent. It gives extremely well rounded sound. It has surprising bass response for a portable bluetooth speaker. I have not tested the water resistance capabilities, but it's good to know it's there. My only complaint is that the only thing that stops the speaker from rolling when it is set horizontally is a little rubber ring stand on the bottom which is far too thin. A slight bump of the speaker or table will send it rolling off. However, I would buy it again without hesitation and I highly suggest it!",
      "rating": 5.0,
      "verified": true,
      "author": "Caleb Stringer",
      "helpful_votes": 0,
      "publication_date": 20160906
    },
    {
      "title": "EVERYONE NEEDS THIS!",
      "text": "We use this thing ever where we go. I mean every where. My husband even puts it in his backpack when we are hiking and we all take turns logging into it to play our own tunes. It is compact, and holds a great charge. But, best of all is the sound quality. Totally worth it. Don't think twice at buying it.",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara B.",
      "helpful_votes": 0,
      "publication_date": 20170506
    },
    {
      "title": "Wonderfully simple interface",
      "text": "Unboxed it today and within minutes was paired and playing from an old ipod touch, as well as my Galaxy G5. Wonderfully simple interface. Solid sound as long as you are not expecting high end hi-fi. Impressive nonetheless. Sounds like real music with clarity, body and depth, not some cheap transistor radio. It also looks nice and feels like quality. So far I'm very pleased. Buy it.",
      "rating": 5.0,
      "verified": true,
      "author": "samuel goodman",
      "helpful_votes": 0,
      "publication_date": 20160528
    },
    {
      "title": "Buy it!",
      "text": "Pretty amazing sound from such a small sized speaker. The only reason it didn't get 5 stars is that it could use a little better high frequency response, but I've gotta tell you it's hard to beat for the size and price. I bought this and the TaoTronics unit to compare and keep the one I liked the best. The JBL has SO MUCH more bass response, whereas the TaoTronics had clearer and crisper highs, but overall the JBL won hands down!!!",
      "rating": 4.0,
      "verified": true,
      "author": "stevenlars",
      "helpful_votes": 0,
      "publication_date": 20161126
    },
    {
      "title": "Excellent product",
      "text": "This speaker worth every cent. Astonishing sound and excellent construction. I was really impressed about the low end that handles. Loud enough to blow you head. The connection with devices is smooth while it can connect to more than 1 device smoothly. The battery last more that what is declared and charges in reasonable period. If you drain your cellphone ore device battery the speaker allows you to charge it as fast as connected to the wall.",
      "rating": 5.0,
      "verified": true,
      "author": "diego",
      "helpful_votes": 0,
      "publication_date": 20160828
    },
    {
      "title": "Great sound for its size and built in charger!",
      "text": "I oridginally bought a cheaper speaker but I ended up upgrading and got the Charge 2, which sounds much MUCH better. Has great bass response for a small unit, still fits in bottle holder and a huge bonus...you can charge your phone using the Charge 2 so it doesn't die while you're out on your ride. Granted, the JBL is about twice the price(I paid $119, then it went down to $99 a few days later, lol) but it's well worth it for the sound quality and built in charger.",
      "rating": 5.0,
      "verified": true,
      "author": "kscruff",
      "helpful_votes": 0,
      "publication_date": 20160707
    },
    {
      "title": "You won’t be disappointed",
      "text": "I love this speaker. The battery last longer than my bose soundlink mini. It has more bass than the bose but the sound is not as clear which u can tel at higher volume. It’s a hundred bucks, it’s loud, it’s small, it’s waterproof, and great battery life. If not prepare to shell out some cash",
      "rating": 5.0,
      "verified": true,
      "author": "Jacob Brown",
      "helpful_votes": 0,
      "publication_date": 20180506
    },
    {
      "title": "Great item and fantastic sound",
      "text": "Great item and fantastic sound. You won't pay an arm and a leg for it. I put it in my bathroom when I get ready in the morning and am confident the moisture or stray drops from the shower won't ruin it. I'll also run it at my office when everyone is gone and I have to work late. I turn it up and it's like a little rave where I work. Excellent for creating background music while cleaning or hosting a party. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Richard Czerwonky",
      "helpful_votes": 0,
      "publication_date": 20160528
    },
    {
      "title": "I've got the nice Bose Soundlink which I pretty much leave in the ...",
      "text": "I've got the nice Bose Soundlink which I pretty much leave in the house, but I wanted something to take with me more often so I started looking around. Was leaning toward the Bose Mini, but it was quite a bit more money. The JBL fared well in the reviews I read so I thought I'd give it a try. So far, so good. I think Bose provides a little better... warmer sound, but this thing cranks and sounds good! It certainly does the job for my purposes... at about half the money.",
      "rating": 4.0,
      "verified": true,
      "author": "vulpro",
      "helpful_votes": 0,
      "publication_date": 20160824
    },
    {
      "title": "Amazing sound from a small speaker",
      "text": "This is exactly what i was looking for: a small portable bluetooth speaker for use in the kitchen or out by the grill. When placed near a wall or corner, it sounds like maybe there's a hidden subwoofer somewhere ;) You're not going to mistake it for your high end car audio or home theatre system, but the sound is great for casual, relatively low volume music. If you use it in a golf cart, however, you could annoy golfers anywhere within 150 yards.",
      "rating": 5.0,
      "verified": true,
      "author": "mwtravlr",
      "helpful_votes": 0,
      "publication_date": 20160714
    },
    {
      "title": "Huge Sound / Great Value",
      "text": "This is one of the best values. It really sounds great and fills a room. It is perfect playing alongside a gym while playing volleyball or basketball. It is great for the shower listening. The voices, mids, highs, and lows come in clear. Everyone that hears it is surprised that it is bluetooth. The battery life is great as I only have to charge every few weeks with moderate use.",
      "rating": 5.0,
      "verified": true,
      "author": "Buster Jones",
      "helpful_votes": 0,
      "publication_date": 20161202
    },
    {
      "title": "Works Good---Too Much Bass",
      "text": "Works good, but too much bass t(low frequency) hat results in perception of lacking a little crispness and hints at sounded muffled (how ever it is crisp, it just overpowered by bass). Can be helped if your music device has equalizer, and can decrease bass, or can choose a setting for clarity and/or treble.",
      "rating": 4.0,
      "verified": true,
      "author": "Rob",
      "helpful_votes": 0,
      "publication_date": 20171118
    },
    {
      "title": "A must-have for your yard or balcony",
      "text": "This little gem sounds great! What a great buy at this price. I got it so I could listen to music out in the yard without earbuds or headphones. I like it so well that after just a couple of days' use I bought another one for my son. It arrived with a full charge - yippee - and a full charge lasts a really, really long time. It paired effortlessly with my iPad and iPhone. I use it daily.",
      "rating": 5.0,
      "verified": true,
      "author": "elcue",
      "helpful_votes": 0,
      "publication_date": 20160907
    },
    {
      "title": "Great company",
      "text": "Great sound. Could be louder. Small and portable (about the size of a tall boy beer can). I started having problems with the charging port becoming too loose and the charging cord would literally just fall out. I emailed JBL and they quickly responded which ultimately led to me sending this one back and in return they sent me a brand new JBL Charge 3 because the 2+ was out of stock. I actually like the 3 way better although it's bigger it's also much louder and claims to be water proof. Solid company and they stand behind their products!",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170604
    },
    {
      "title": "Literally my favorite bluetooth speaker period",
      "text": "Literally my favorite bluetooth speaker period. It has a great frequency response, with a little bias towards bass, which is a GREAT problem to have in bluetooth speakers. This speaker has two dynamic bass drivers on either end of the tube that you can both see and feel rumble with every bass frequency. I bought it as a radio for myself in my hotel room, as I travel a lot for work. It has been a great addition to my pack.",
      "rating": 5.0,
      "verified": true,
      "author": "Ben Quiles",
      "helpful_votes": 0,
      "publication_date": 20171129
    },
    {
      "title": "Near perfect speaker at a very  competitive price!",
      "text": "Great sound with super long battery life, easy seamless bluetooth connection to any device, and an all around \"user friendly\" simple design. My only reason for 4 instead of 5 stars is slightly distortion of high end sound towards full volume though unless you would constantly keep this unit cranked as I do you may never notice it, and it does push out allot of great sound even at medium volume.",
      "rating": 4.0,
      "verified": true,
      "author": "Stuff Guru",
      "helpful_votes": 0,
      "publication_date": 20160509
    },
    {
      "title": "but it is awesome! It's very easy to set up and connects ...",
      "text": "I've only had this for a few weeks, but it is awesome! It's very easy to set up and connects to any blue tooth device. Bass is amazingly deep for such a small woofer, and the high/mid ranges are clear as a bell. I haven't used it at the beach yet, but will soon. I bought the Caseling case to keep it protected during travels. Hopefully it will last a long time. I've always loved JBL car audio speakers so I'm hoping the quality on the Charge 2 is the same.",
      "rating": 5.0,
      "verified": true,
      "author": "Angela",
      "helpful_votes": 0,
      "publication_date": 20160623
    },
    {
      "title": "Great quality speaker",
      "text": "Very nice speaker. Use at the pool and sounds great. Get lots of compliments",
      "rating": 5.0,
      "verified": true,
      "author": "Robyn Coffey",
      "helpful_votes": 0,
      "publication_date": 20200729
    },
    {
      "title": "Very easy to move from room-to-room in my house or to take outside.",
      "text": "I really like this unit, and the Bluetooth range is greater than a TV soundbar I've been using in our living room. Pros: small size, lightweight, very portable, great sound, choice of very pretty bright colors or plain black Cons: inability to adjust the bass and treble; would prefer that the black color came with a black cord and plug instead of bright orange",
      "rating": 5.0,
      "verified": true,
      "author": "Terry N",
      "helpful_votes": 0,
      "publication_date": 20160918
    },
    {
      "title": "Blown :-(",
      "text": "Loved it for 2 years. Not loud enough for me but portable, great sound and easy to use. However, after 2 years of use the speaker is blown, buzzing. It is beyond me how a self contained stereo system can blow out it's speakers. The speakers should be designed to handle the max output! Disappointed. I want to buy the JBL Xtreme to get the higher volume but I'm hesitant to buy JBL again after this experience.",
      "rating": 3.0,
      "verified": true,
      "author": "Joey R",
      "helpful_votes": 0,
      "publication_date": 20171222
    },
    {
      "title": "great bass,",
      "text": "i have only been able to connect 1-2 other people via bluetooth. JBL states there can be up to 5 people. this has always been issue from day one. The bass is pretty good. would i buy it again ? .. probably yes.",
      "rating": 3.0,
      "verified": true,
      "author": "Ingrid Mendez",
      "helpful_votes": 2,
      "publication_date": 20170413
    },
    {
      "title": "Overall, this is a great speaker.",
      "text": "Overall, this is a great speaker. The low-end is weak, as it is with all smaller speakers, but this one is more balanced than most. The range is full, the sound clear at high volumes. Long lasting battery, splash-proof. A very nice speaker. Save some money and get the factory refurbished unit. Mine looks and plays as new, and the firmware is the most recent one!",
      "rating": 4.0,
      "verified": true,
      "author": "Waikiki",
      "helpful_votes": 0,
      "publication_date": 20160920
    },
    {
      "title": "Seems to have better bass than my wife's Charge 3",
      "text": "Seems to have better bass than my wife's Charge 3. It's only water resistant compared to the 3's being water proof, but I like mine really well. A tad smaller, but oddly has better sound. Best bluetooth speaker I've ever seen in a package this small. Battery life is excellent too!",
      "rating": 5.0,
      "verified": true,
      "author": "R. Brashear",
      "helpful_votes": 0,
      "publication_date": 20171219
    },
    {
      "title": "Best bang for you money",
      "text": "I had a cheap Bluetooth speaker of similar size and the JBL just blew that one away. Haven't touched that old one since I bought the JBL. For a speaker of this small size, it has some surprisingly good bass that will leave you wanting more. Gets loud enough to fill my 2 bedroom apartment up with enough sound to host a small party. It sounds best when at least half way turned up or more but still has a nice clean sound regardless of volume level.",
      "rating": 5.0,
      "verified": true,
      "author": "Allen King",
      "helpful_votes": 0,
      "publication_date": 20171215
    },
    {
      "title": "A perfect companion for the bike water bottle cage",
      "text": "I purchased solely for the fact that it could fit in a standard water bottle cage on my road bike. This speaker work great for long road rides and has survived the trail with no issues whatsoever. Battery life has been great and the fact that I can also charge my other devices when needed was a plus. The sound output was perfect as well. Makes bike riding a bit more enjoyable when you can easily hear the music.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20171121
    },
    {
      "title": "The sound is great and I love the ease of carrying it to ...",
      "text": "I was on the fence for a bluetooth speaker. Based on reviews I went for the JBL Charge 2+ and wow. The sound is great and I love the ease of carrying it to any room I am in. Spending hours organizing the kids room, NPR is with me. Washing the car, my favorite Spotify playlist is with me. It connects to my phone with ease. I have used it extensively for several months now and think it is the best thing since my Sonos which honestly sounds better but is wired and less mobile.",
      "rating": 5.0,
      "verified": true,
      "author": "C Warren",
      "helpful_votes": 0,
      "publication_date": 20161122
    },
    {
      "title": "Great little speaker at a great price.",
      "text": "This is a great sounding little Bluetooth speaker. If you don't want to spend $200 on the Bose Mini Soudlink II than this is the next best thing I've heard. Its nice that its somewhat waterproof and also will charge your phone through a USB cable if you need it. Don't know how many hours it plays yet on a charge, JBL says 12. Range is good at over 40 feet.",
      "rating": 5.0,
      "verified": true,
      "author": "Phil D.",
      "helpful_votes": 0,
      "publication_date": 20161005
    },
    {
      "title": "For the size, it is an outstanding loudspeaker",
      "text": "I m very found of Hi Fi music with studio loudspeakers and hi-end amplifier. Often, I do not want to listen to these type of loudspeakers that destroy music in a kind of a distorted noise. But this JBL portable loudspeaker is very impressive for its size, the sound is clear with good bass. It fill out a sizeable room with music, not a cacophony.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike Wally",
      "helpful_votes": 0,
      "publication_date": 20160929
    },
    {
      "title": "I would recommed this speaker",
      "text": "The Charge 2+ is a great speaker for sound and water resistance. Keep in mind that it is not water proof but mine has held up in a light rain with no issues at all. My general use for this speaker is in a server room where it is pretty loud but it does sound great in a quiet room as well. Pairing the bluetooth is very straight forward and easy. This speaker has exceeded my expectations.",
      "rating": 5.0,
      "verified": true,
      "author": "Matt Tibbs",
      "helpful_votes": 0,
      "publication_date": 20160421
    },
    {
      "title": "JBL Love...",
      "text": "Just received unit so early feedback... Better overall quality of sound than other bluetooth speakers in the sub-$100 range used for years from 2 other major brands so 5 stars for initial impressions. Very good bass and sound will fill a living room for example. Build quality is great with splash proof controls and sealing of most areas. Water could enter the bass speaker cone so it's not totally submersible. Have another JBL product (sound bar for home) that is several nitches above in sound quality and durability as well. Very happy with purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Successful Living",
      "helpful_votes": 0,
      "publication_date": 20160804
    },
    {
      "title": "I can't say enough good things about this speaker",
      "text": "I can't say enough good things about this speaker. We love it. Sound quality is great, lightweight and holds a charge for a very long time. We liked it so much we purchased some as gifts for others as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Amy",
      "helpful_votes": 0,
      "publication_date": 20180822
    },
    {
      "title": "This is a great little speaker that allows you to charge your mobile ...",
      "text": "This is a great little speaker that allows you to charge your mobile needs on the go when you don't have a viable option. The sounds is awesome and loud if you set it so. Works with Bluetooth or a 3.5mm audio cable if you want to save some battery life on your mobile device and speaker. The play time is great I can go a day or two during my work days without having to charge it depending on use.",
      "rating": 5.0,
      "verified": true,
      "author": "Lord_Wicki",
      "helpful_votes": 2,
      "publication_date": 20160504
    },
    {
      "title": "Disappointed with battery life.",
      "text": "This is a decent little speaker, but after 2 1/2 years the battery won’t hold the charge as well as it used to. I was able to use it for several days with out rechargeing it. Now I’m lucky if I get to use it one day.",
      "rating": 1.0,
      "verified": true,
      "author": "Laura",
      "helpful_votes": 0,
      "publication_date": 20190318
    },
    {
      "title": "Died after 9 months",
      "text": "I’m glad I waited to write the review. This product worked GREAT for 9 months in my office. Excellent sound quality, fantastic battery life. Then one day the battery stopped working and I could only use it while connect to a power source. The following week it stopped audio play back from any source. A day after that it was never able to establish a successful Bluetooth connection. So sad, it would have been perfect.",
      "rating": 1.0,
      "verified": true,
      "author": "Amber Harden",
      "helpful_votes": 0,
      "publication_date": 20190420
    },
    {
      "title": "Best Bluetooth speaker hands down!",
      "text": "The built, the quality, the ease of connection and the sound is all beyond expectation from this small package. From first holding it in my hands I can tell very quality materials are used. Having an engineering background I can quickly tell this device will last a very long time. Connection using Bluetooth was easier than most connected devices I used. The group sharing connection feature easily allowed anyone to take over playing the music from our group without any trouble. The biggest surprise was how loud and great the sound quality was. Great product overall!",
      "rating": 5.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20160102
    },
    {
      "title": "Loud, quality sound & Waterproof/Durable",
      "text": "Great sound, loud, durable and waterproof. What does this bluetooth speaker not have? Using it for about 2 months now, I can confidently say this speaker will l last me a while. I haven't experienced any bugs, though I do wish the bluetooth signal could reach farther - it skips sometimes if I'm too far. But that's just a limitation on bluetooth technology.",
      "rating": 5.0,
      "verified": true,
      "author": "ExpertAmazoner",
      "helpful_votes": 0,
      "publication_date": 20160603
    },
    {
      "title": "Premium sound,quality,etc at a reasonable price.",
      "text": "This is my favorite Bluetooth speaker. I also have The DKnight MagicBox II which sounds good but I Love music and wanted a more premium listening experience. In my opinion they blow them away but also cost 3 times as much.I was also considering Bose,Harmon,etc but I am very happy with these for the price and sound quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20161211
    },
    {
      "title": "but everything was completely great. The packaging was A1",
      "text": "Was uneasy ordering an expensive product from a different company other than retail stores or JBL, but everything was completely great. The packaging was A1, came in box surrounded by protective wrapping and the JBL box with all the description just like in the store. The quality of the sound is amazing and was 100% okay with spending over $50 for a speaker. It has served me well so far and tie today, no problems. Great product and would recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "SeanyCarbs",
      "helpful_votes": 0,
      "publication_date": 20180125
    },
    {
      "title": "QC Issues",
      "text": "Nice speaker, and genuine JBL. It sounds great---its very substantial and well built. Our copy began failing within hours of its first use. Worked intermittently and eventually failed to take a charge. Return policy of Amazon is amazing, and the return & refund were easy to procure.",
      "rating": 2.0,
      "verified": true,
      "author": "J. Richter",
      "helpful_votes": 0,
      "publication_date": 20170223
    },
    {
      "title": "Douni A7 is way better and half price.",
      "text": "Not impressed. I have a Douni A7. It’s way better then the jbl charge 2 & flip 4. Have returned both jbl’s. Douni A7 is for the kitchen. Sony XB-30’s for the living room. Save yourself money and get the better Douni A7, or blow them away with the Sony XB30",
      "rating": 1.0,
      "verified": true,
      "author": "Paul",
      "helpful_votes": 0,
      "publication_date": 20171214
    },
    {
      "title": "It's like having a 100watt portable speaker",
      "text": "It's like having a 100watt portable speaker! I use mine indoors/outdoors, connected to my phone and tv! The sound for me is almost neck-in-neck with bose! I am going to purchase another one of these speakers replacing my current sound system. Feel free to ask me any questions you may have regarding this speaker and I'll answer them truthfully as a fan of listening to music with a very sensitive ear!",
      "rating": 5.0,
      "verified": true,
      "author": "joanie",
      "helpful_votes": 0,
      "publication_date": 20161028
    },
    {
      "title": "Did not last",
      "text": "I bought this and loved it. Great sound quality. I used it “lightly” for 1 year .It broke and will Will no longer pair or play music. It’s unfortunate. I can’t send it back because the warranty period expired.",
      "rating": 2.0,
      "verified": true,
      "author": "JJClark",
      "helpful_votes": 0,
      "publication_date": 20200801
    },
    {
      "title": "WOW!!! VERY IMPRESSED!!!",
      "text": "I DON'T WRITE REVIEWS OFTEN BUT WHEN I DO IT'S BECAUSE IT'S GOOD. THIS PRODUCT BY FAR AMAZING SOUND, LOVE THE FACT THAT THREE PEOPLE CAN ALTERNATE THEIR SONGS INSTANTLY, YOU ONLY HAVE TO PRESS PLAY ON ANY DEVICE IT WILL AUTOMATICALLY SWITCH. YOU GET TO CHARGE YOUR ☎ PHONE ON THE ACTUAL DEVICE IS PRICELESS. IT'S A MUST BUY.",
      "rating": 5.0,
      "verified": true,
      "author": "Manny",
      "helpful_votes": 0,
      "publication_date": 20161127
    },
    {
      "title": "Best sounding little speaker I've heard in a long time",
      "text": "Best sounding little speaker I've heard in a long time. Great feathers also. I could write about this thing all day long on how good it is but I don't need to. Just buy it and see for yourself. It won't disappoint, worth every penny! JBL made a great product on this one. PS. I'm a sound man and I know my stuff!",
      "rating": 5.0,
      "verified": true,
      "author": "R. F.",
      "helpful_votes": 0,
      "publication_date": 20160511
    },
    {
      "title": "its a beast",
      "text": "Hands down the best blue tooth speaker around. I previously own Bose mini 2 and with out a doubt the Bose sound was really good with crisp bass but the volume didn't get high enough. The jbl 2 has outstanding balance of sound and bass and the sound doesn't get distorted when the volume is high jbl 2 is and absolutely beast best bang for the buck. I Will recommend this in a heart beat..",
      "rating": 5.0,
      "verified": true,
      "author": "the ghost",
      "helpful_votes": 0,
      "publication_date": 20150906
    },
    {
      "title": "... dropped it and had a dent it still works great but I do notice that when the battery is ...",
      "text": "This works very well for what I need it for and my daughter actually dropped it and had a dent it still works great but I do notice that when the battery is dying of course the sound or volume goes down on the JBL speaker I would prefer it to be a little louder",
      "rating": 4.0,
      "verified": true,
      "author": "Theresa Morse",
      "helpful_votes": 0,
      "publication_date": 20171016
    },
    {
      "title": "great as a gift for a variety of music",
      "text": "purchased as a gift and they love it. tested this in store at Frys electronics before purchasing against other JBL and Bose Bluetooth models. this took the cake for a wide range of music from rap to metal and classical. didn't test country because .... country sucks! but i am sure it would work great.",
      "rating": 5.0,
      "verified": true,
      "author": "M5",
      "helpful_votes": 0,
      "publication_date": 20160303
    },
    {
      "title": "She liked mine so much she asked for one",
      "text": "I bought this for my granddaughter. She liked mine so much she asked for one, so this is the second one we have and can't say enough about it. Great bass response for such a small package . crystal clear sound reproduction. The package says 12 hr battery , believe it ! I tested it, and got close to 13 hrs. on a charge. Just an awesome little Bluetooth speaker.",
      "rating": 5.0,
      "verified": true,
      "author": "G. Brunelli",
      "helpful_votes": 0,
      "publication_date": 20151227
    },
    {
      "title": "Best bluetooth speaker I've heard.",
      "text": "Great sound. Kept trying to find an under-$50 bluetooth speaker that had good sound, but nothing else gets the lower bass like this does. Crisp and even throughout, well worth a hundred bucks. Battery lasts forever, and being able to charge your phone from it is a big plus.",
      "rating": 5.0,
      "verified": true,
      "author": "Peter K",
      "helpful_votes": 0,
      "publication_date": 20170621
    },
    {
      "title": "Recommended",
      "text": "This is an excellent option to some more expensive similar products. Good base for the size and the clarity is excellent. It pairs very well with my phone and laptop so no complaints. The only thought would be the bottom on which it stands is a little narrow and just a bump and off it goes rolling.",
      "rating": 5.0,
      "verified": true,
      "author": "Magna750",
      "helpful_votes": 0,
      "publication_date": 20170804
    },
    {
      "title": "Very good",
      "text": "Register this product and use only charger provided, JBL will give you a hard time for replacement if something should go wrong.",
      "rating": 5.0,
      "verified": true,
      "author": "KENROY ELLIS",
      "helpful_votes": 0,
      "publication_date": 20190806
    },
    {
      "title": "Good bluetooth speaker for a good price.",
      "text": "This speaker has good bass. Not room shaking bass but good bass sound. Does not have a pairing mode like the other JBL bluetooth speakers. Feels of good quality and has good weight to it. A little nerve racking to leave it on a shelf because its round and standing it on its side doesn't make me feel any better. Overall happy with this purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "Sheila Govers",
      "helpful_votes": 0,
      "publication_date": 20151206
    },
    {
      "title": "Defective and over priced",
      "text": "This product was defective, the charge lights were blinking to show that the device was charging, once I unplugged it would die within 5 mins. Also when music played the speaker would have a very loud static sound so I would constantly have to turn the device on and off. Also the quality of the sound was terrible, very low in terms of volume and bass. Save your money and purchase the jbl flip 3 or 4. This wasn’t worth 100 bucks !",
      "rating": 1.0,
      "verified": true,
      "author": "linda",
      "helpful_votes": 0,
      "publication_date": 20180730
    },
    {
      "title": "Battery life and sound",
      "text": "Battery lasted for about 4 hrs at a good volume when I first got the speaker. Now about 16 months later and using the speaker four days a week at work for about 7 hrs. I get about 1 hr before I need to plug the speaker in to charge because the volume is clipping. Not sure if this is the normal life expectancy or not",
      "rating": 3.0,
      "verified": true,
      "author": "James A. Smith",
      "helpful_votes": 0,
      "publication_date": 20190715
    },
    {
      "title": "No one makes speakers like JBL, and you will be pleased with these!",
      "text": "Excellent sound quality, balance, and long battery life! The only caveat is that I wish I could turn it up a little louder. Don't' get me wrong- it is fairly loud, but as a musician maybe my expectations are too high. After all, it is a \"portable\" device! :-) Great value though! definitely 5 stars overall!",
      "rating": 5.0,
      "verified": true,
      "author": "Jeffery M. Hendershot",
      "helpful_votes": 0,
      "publication_date": 20160824
    },
    {
      "title": "and on vacation and I'm very pleased with it",
      "text": "For me the JBL Charge 2+ exceeds my expectations. I've used it in the garage tinkering around, on the golf course, and on vacation and I'm very pleased with it. Holds a charge for a long time. The sound quality is above what I expected. There is a good amount of bass & treble without sounding distorted. I haven't had any issues with the range of the Bluetooth either. For the value and performance, I would definitely recommend this to others considering a Bluetooth speaker.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel M Ramsay",
      "helpful_votes": 0,
      "publication_date": 20160707
    },
    {
      "title": "Great sound for the money!",
      "text": "I absolutely love my JBL charge 2+! I was initially worried that at this price point I would have a disappointing paperweight but man was I wrong! This thing has a fantastic sound, and good low end for such a small package. Are there better out there? Yes, but not at this price level. Get it, you will not be disappointed!",
      "rating": 5.0,
      "verified": true,
      "author": "JRL91RS",
      "helpful_votes": 0,
      "publication_date": 20160627
    },
    {
      "title": "Great Speaker!",
      "text": "JBL is one of the best speaker companies out there. This speaker is great for having at the beach/pool, or even just hanging out with people. Its very loud and the sound quality is great. The speaker is very portable and not heavy at all, It fits into my backpack comfortably. Great speaker, well with your money.",
      "rating": 5.0,
      "verified": true,
      "author": "Lucy McFree",
      "helpful_votes": 0,
      "publication_date": 20170810
    },
    {
      "title": "Love this Charge 2+",
      "text": "I've owned a few high quality Bluetooth speakers, but this one is by far the best sounding speaker I've owned. The bass sounds loud and crisp. When people see where sound is coming from they are amazed on quality of sound. This one was the second one I bought as a gift.",
      "rating": 5.0,
      "verified": true,
      "author": "Omar",
      "helpful_votes": 0,
      "publication_date": 20170907
    },
    {
      "title": "It's good but if you're looking for something super loud",
      "text": "It's good but if you're looking for something super loud...this isn't loud. We use it for a pool party and once everyone is talking it gets drained out. Volume is not too great. Battery life is not bad. It's good for the bedroom but not anything louder than that.",
      "rating": 3.0,
      "verified": true,
      "author": "Jamie",
      "helpful_votes": 0,
      "publication_date": 20160720
    }
  ],
  "product_meta": {
    "title": "JBL Charge 2+ Splashproof Portable Bluetooth Speakers - Black",
    "description": "Color:BlackJBL Charge 3 Waterproof Portable Rechargeable Bluetooth Wireless Speaker with Echo Cancelling Speakerphone, Black",
    "rating": 4.5,
    "feature_bullets": [
      "Bluetooth - Wirelessly connect up to 3 smartphones or tablets to the speaker and take turns playing powerful stereo sound.",
      "Battery type : Lithium-ion Polymer (22.2Wh)2) 20 hours of playtime(varies by volume level and content)",
      "Take crystal clear calls from your speaker with the touch of a button thanks to the noise and echo-cancelling speakerphone.",
      "Build your own ecosystem by connecting multiple JBL Connect enabled speakers together to amplify the listening experience."
    ],
    "specifications": {
      "Product Dimensions": "8.5 x 4 x 6.8 inches",
      "Item Weight": "2.14 pounds",
      "Manufacturer": "HeroFiber",
      "ASIN": "B00Y3SD44E",
      "Item model number": "Charge 2+",
      "Batteries": "1 Lithium Metal batteries required.",
      "Customer Reviews": "4.5 out of 5 stars2,764 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#2,020 in Portable Bluetooth Speakers#15,281 in MP3 & MP4 Player Accessories",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "May 22, 2015"
    },
    "categories": [
      "Portable Audio & Video",
      "Portable Bluetooth Speakers",
      "Electronics",
      "Portable Speakers & Docks"
    ],
    "price": ""
  }
}