{
  "website_summaries": [
    {
      "verdict": "This is a no-frills headband magnifier that works just fine if you intend to use it in a well-lit area. If you don’t have the need for an LED light or multiple headband adjustment options, this might be the model for you.",
      "pros": [
        "Affordable",
        "Includes 4 magnification lenses: 1.5-, 2-",
        "2.5-, and 3.5-times",
        "Lightweight and sturdy headband frame",
        "Adjustable headband",
        "Affordable"
      ],
      "cons": [
        "The PHYHOO headband magnifier does not include a built-in light"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Acceptable for the price",
      "text": "This works pretty well. I'm using it for soldering SMD's. You should know that the working distance for higher magnification lenses is very tight, like 2-5 inches or so. It would be 4 stars for the price, but I need to constantly re-tighten the temple screws as they get loose when you flip the visor up and down. It's a minor annoyance that starts to grate after a couple of hours. I wish there was some midrange option between this and the $100's surgeons loupes, but I haven't found one yet, so this does the job.",
      "rating": 3.0,
      "verified": true,
      "author": "nick",
      "helpful_votes": 2,
      "publication_date": 20190115
    },
    {
      "title": "The build quality and lenses seemed decent. The lenses ...",
      "text": "The build quality and lenses seemed decent. The lenses were glass and magnification was crisp. The focal length was too short at any magnification level to make these practical for anything other than working inches from your face. I bought these to assist in soldering electronics but any benefit to my vision was at the expense of my neck and back. Going back to Amazon.",
      "rating": 3.0,
      "verified": true,
      "author": "Ely Age",
      "helpful_votes": 4,
      "publication_date": 20171029
    },
    {
      "title": "Optics are Fine the frame is Marginal",
      "text": "Optics are good ,but the pins that hold lens are cheap plastic tha are suppoed to hol by pressure fit they keep falling out they do give you some extra pins biu if you loose them good luck. Headband tightner seme to get loos but are easy to tighten. They all seem to be of the same design and price but are ok for the $ spent",
      "rating": 3.0,
      "verified": true,
      "author": "Craig Porter",
      "helpful_votes": 0,
      "publication_date": 20200509
    },
    {
      "title": "Okay for the price",
      "text": "El cheapo, but cheap! These function well enough for the price you pay. Comes with a few interchangeable lenses of different strengths, but they scratch easily so treat them gently. And of course they have a fixed focal length so you have to hold your head, or your work piece, a precise distance away or they'll be out of focal range, so know that going in. They work well enough for me when I'm doing detailed gunsmithing work.",
      "rating": 3.0,
      "verified": true,
      "author": "Atlanta Scott",
      "helpful_votes": 2,
      "publication_date": 20170515
    },
    {
      "title": "Great headband with interchangeable lenses",
      "text": "I needed to fix some small electronics and could not see the parts well. I purchased this headband and it is just what I needed. You get several interchangeable lenses for different focal distances. The build quality is good and it stays in place as you work and is very comfortable. I'm glad I didn't get a cheaper model as some of the reviews state that they don't stay in place and work as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170715
    },
    {
      "title": "Great idea, cheaply made",
      "text": "I bought 3 of these for myself, a friend and my sister as we were doing work that needed magnification. The lenses fell out and I had to super glue them in. It will suffice for now but for the price was very disappointed. I would look for a better made one next time.",
      "rating": 3.0,
      "verified": true,
      "author": "Terlacha",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "One very satified camper.",
      "text": "Thank you to whomever made this device. I wear glasses because I can't read tiny font. As of late my reading glasses are as useless as my eyes when it comes to small font. I found this device a little awkward to use at first but once I got it figured out it turned out to be a good investment. Thank you so much.",
      "rating": 5.0,
      "verified": true,
      "author": "Terresa Portal",
      "helpful_votes": 0,
      "publication_date": 20180407
    },
    {
      "title": "Good for price BUT...",
      "text": "Good for price but the fasteners that control the head size and tilt of the headpiece come loose very easily",
      "rating": 3.0,
      "verified": true,
      "author": "J. Stern",
      "helpful_votes": 3,
      "publication_date": 20170307
    },
    {
      "title": "Very Nice Product",
      "text": "I've taken on a new hobby that requires very close and exact work and this head mounted magnifier does the trick. I have not noticed any distortion of the objects being examined. The band holds the head piece securely and I've not experienced any discomfort while wearing it over an extended period of time.",
      "rating": 5.0,
      "verified": true,
      "author": "RayT",
      "helpful_votes": 0,
      "publication_date": 20180319
    },
    {
      "title": "Great stuff !!!!!",
      "text": "Item arrived on time and undamaged. I love this thing! Although it’s the not the highest priced one, it works great! The lenses are glass, the fit is adjustable and it is comfortable to wear. Magnification is perfect!",
      "rating": 5.0,
      "verified": true,
      "author": "Dutch",
      "helpful_votes": 0,
      "publication_date": 20181220
    },
    {
      "title": "Good quality, glass lens, good for seniors!",
      "text": "I bought this for my preschool daughter to catch lice on her head. But in the end, my mother-in-law who visited us loves it and took it away. Actually as a gift to my senior relatives, I bought additional three sets! So people they may have some good use in unexpected places",
      "rating": 5.0,
      "verified": true,
      "author": "A guy working hard",
      "helpful_votes": 0,
      "publication_date": 20180911
    },
    {
      "title": "No handyman should be without one.",
      "text": "I love these things. This one is as good as any. Use for: filing fingernails (really), removing splinters, repairing any number of small appliances with circuit boards, changing watch batteries, examining suspicious moles. Once you have one of these, you'll use it!",
      "rating": 5.0,
      "verified": true,
      "author": "breadrunner",
      "helpful_votes": 0,
      "publication_date": 20170407
    },
    {
      "title": "Ok value for the money.",
      "text": "The magnifying had glue was all over it, and one of the lence fell out right away. I glowed it back. It’s a good price so I don’t mind it. Once the lence is in place it’s great.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181111
    },
    {
      "title": "Very badly made - I returned it.",
      "text": "The attachment of the lenses to the frames is so primitive, so badly done, it's hard to understand how a product could be offered for sale like this. Some of the lenses simply fell out of the frames. Look for a different product.",
      "rating": 1.0,
      "verified": true,
      "author": "Jeff on the Cape",
      "helpful_votes": 0,
      "publication_date": 20181020
    },
    {
      "title": "the lenses are good, the device itself doesn't have much hold",
      "text": "the lenses are good, the device itself doesn't have much hold. it gets loose you have to adjust it frequently. the focus is very narrow. I'll keep it as an emergency tool in case my other magnifier breaks down",
      "rating": 3.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 2,
      "publication_date": 20170605
    },
    {
      "title": "It’s like having a third hand.",
      "text": "Too many times I have needed a third hand while doing a small project and this magnifier headband allows me to see what I’m doing and still use both hands.",
      "rating": 5.0,
      "verified": true,
      "author": "Diane Kolb",
      "helpful_votes": 0,
      "publication_date": 20200830
    },
    {
      "title": "The leather lining on the headstrape came out after two ...",
      "text": "The leather lining on the headstrape came out after two uses. Can't keep the drop down part in one place no matter how tight I adjust the screw.",
      "rating": 2.0,
      "verified": true,
      "author": "Chris M",
      "helpful_votes": 0,
      "publication_date": 20180405
    },
    {
      "title": "Comfortable & stays put",
      "text": "Comfortable, stays put. It's so comfortable I had it flipped up and forgot I was wearing it",
      "rating": 5.0,
      "verified": true,
      "author": "MSD",
      "helpful_votes": 0,
      "publication_date": 20170918
    },
    {
      "title": "Great tool for tiny items your working on",
      "text": "My husband uses these all the time for tiny things he needs to see up close",
      "rating": 5.0,
      "verified": true,
      "author": "cheryl Collier",
      "helpful_votes": 0,
      "publication_date": 20190512
    },
    {
      "title": "Love that I can change the magnification so easily",
      "text": "Adjusts to a wide variety of sizes. Love that I can change the magnification so easily.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen Brown",
      "helpful_votes": 4,
      "publication_date": 20170226
    },
    {
      "title": "Good deal",
      "text": "Works great and this model comes with 3 different magnification lenses. Some of the other magnifiers only come with one magnification. It’s a fairly cheap construction but for the price I really can’t complain.",
      "rating": 4.0,
      "verified": true,
      "author": "Dr. Manhattan",
      "helpful_votes": 0,
      "publication_date": 20171106
    },
    {
      "title": "Four Stars",
      "text": "I was expecting that it had an LED light. I might return it.",
      "rating": 4.0,
      "verified": true,
      "author": "Emily Munsen",
      "helpful_votes": 0,
      "publication_date": 20170905
    },
    {
      "title": "Muitple lens make it very useable",
      "text": "It is easy to use and easy to change the interchangeable lenses. No distortion with the magnification.",
      "rating": 5.0,
      "verified": true,
      "author": "SJdeC-C2",
      "helpful_votes": 0,
      "publication_date": 20200603
    },
    {
      "title": "As advertised",
      "text": "These are the best thing For seems small items. I use for crafting",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191001
    },
    {
      "title": "Great for close work",
      "text": "My sister love them. I have mine for twenty years ago these have interchangeable lens.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathleen Byrne",
      "helpful_votes": 0,
      "publication_date": 20180703
    },
    {
      "title": "Now I can do 14 count",
      "text": "With this new tool I am able to see the holes in 14 count Aida cloth and waste canvas. Wonderful ability to increase or decrease the amount of magnification.",
      "rating": 5.0,
      "verified": true,
      "author": "Illana",
      "helpful_votes": 0,
      "publication_date": 20181126
    },
    {
      "title": "Not great.....",
      "text": "Good lens assortment. Poor swivel action, it jams a lot.",
      "rating": 2.0,
      "verified": true,
      "author": "Simon",
      "helpful_votes": 0,
      "publication_date": 20181207
    },
    {
      "title": "Three Stars",
      "text": "Too heavy, didn't show magnfaction ,too hard d to change lenens.",
      "rating": 3.0,
      "verified": true,
      "author": "Bernard Goodin",
      "helpful_votes": 0,
      "publication_date": 20180416
    },
    {
      "title": "Up close and Personal.",
      "text": "This helps me to see things closer when I need to get a close look at small things like getting metal or splinters out of fingers.",
      "rating": 5.0,
      "verified": true,
      "author": "Stacey Gill",
      "helpful_votes": 0,
      "publication_date": 20170608
    },
    {
      "title": "I just used this item this morning to check the ...",
      "text": "I just used this item this morning to check the edges on my straight razors I used for shaving.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin",
      "helpful_votes": 0,
      "publication_date": 20180403
    },
    {
      "title": "these are not comfortable and the black strip of \"cushioning\" has already come ...",
      "text": "Ouchy, these are not comfortable and the black strip of \"cushioning\" has already come off.",
      "rating": 3.0,
      "verified": true,
      "author": "Dylan",
      "helpful_votes": 0,
      "publication_date": 20180101
    },
    {
      "title": "I'm 50 yrs old and a manicurist. Eye are ...",
      "text": "I'm 50 yrs old and a manicurist. Eye are not what they use to be. These help out a lot.",
      "rating": 5.0,
      "verified": true,
      "author": "Gloria",
      "helpful_votes": 0,
      "publication_date": 20170910
    },
    {
      "title": "It does the job and is affordable.",
      "text": "An inexpensive aid for working on very small stuff like tiny electronic parts.",
      "rating": 4.0,
      "verified": true,
      "author": "Tim Thompson",
      "helpful_votes": 0,
      "publication_date": 20170410
    },
    {
      "title": "Works ok for short period",
      "text": "Head band fit great. Only complaint is that the focal length is off for me. Any prolong use gives me a headache",
      "rating": 3.0,
      "verified": true,
      "author": "Randy R. Barker",
      "helpful_votes": 0,
      "publication_date": 20171011
    },
    {
      "title": "Great product, it allows me to do close up ...",
      "text": "Great product, it allows me to do close up sewing much easier than with just my glasses!",
      "rating": 5.0,
      "verified": true,
      "author": "sandy",
      "helpful_votes": 0,
      "publication_date": 20171103
    },
    {
      "title": "Convenient",
      "text": "My husband has retinopathy and uses them all of the time. It's very convenient. All he has to do is flip them up and back on top of his head when doesn't need them.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180328
    },
    {
      "title": "Okay",
      "text": "it is what it was said to be and to do",
      "rating": 4.0,
      "verified": true,
      "author": "Henry Blue Ridge",
      "helpful_votes": 0,
      "publication_date": 20180109
    },
    {
      "title": "Will not tighten or stay in place",
      "text": "Will not stay in place. Slips constantly even though I tighten the sides. Not comfortable. Very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Jan L.",
      "helpful_votes": 0,
      "publication_date": 20171211
    },
    {
      "title": "Perfect for eyelash extensions",
      "text": "I use this for doing eyelash extensions and also for extractions during facial treatments. Very light weight and comfortable. Easy to adjust and flips up out of the way when not in use.",
      "rating": 5.0,
      "verified": true,
      "author": "CarrieC",
      "helpful_votes": 7,
      "publication_date": 20160809
    },
    {
      "title": "Two Stars",
      "text": "Broke almost immediately while tightening around the head. Cheaply made.",
      "rating": 2.0,
      "verified": true,
      "author": "Katrina Gleason",
      "helpful_votes": 0,
      "publication_date": 20180117
    },
    {
      "title": "Good headband",
      "text": "I like how the lenses are interchangeable. I use the lowest magnification. Its easy to look closely at work and also items on work bench that are a little farther away. The side screws must be tight but no problems otherwise.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe",
      "helpful_votes": 3,
      "publication_date": 20161201
    },
    {
      "title": "Value and quality",
      "text": "Well made, perfect for post-nasal surgery period when regular glasses or reading glasses can't be worn. Comes with different interchangeable strengths up to 3 power. Recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "T.C.",
      "helpful_votes": 2,
      "publication_date": 20161220
    },
    {
      "title": "Just as good as the more expensive one that are on the ...",
      "text": "Just as good as the more expensive one that are on the market my husband says, and he's used both.",
      "rating": 5.0,
      "verified": true,
      "author": "Lausanne",
      "helpful_votes": 0,
      "publication_date": 20170113
    },
    {
      "title": "Five Stars",
      "text": "Same exact one as the more expensive ones. Works well!",
      "rating": 5.0,
      "verified": true,
      "author": "Ell",
      "helpful_votes": 2,
      "publication_date": 20160503
    }
  ],
  "product_meta": {
    "title": "PHYHOO Headband Magnifier Binocular Magnifying Glass Jewelry Magnifiers Head-mounted Double Lens Reading Jewelers Tools Head Wearing 4 Magnifications",
    "description": "PHYHOO Double Lens Head-mounted Headband Reading Magnifier Loupe Head Wearing 4 Magnifications.1.5X, 2X. 2.5X, 3.5X. If you have any problem,please don't hesitate to let me know.",
    "rating": 4.4,
    "feature_bullets": [
      "4 Replaceable/interconvertible magnification lens plates to meet different magnifying needs.",
      "Lens are ground and polished to precision ophthalmic standards.",
      "The shell frame is made of lightweight, durable and impact resistant materials.",
      "Adjustable head band for more comfortable and tight head wearing.",
      "Widely used in mechanical processing, electronic repair, jewelry appraisal, timepieces repair and miniature engraving, etc."
    ],
    "specifications": {
      "Manufacturer": "PHYHOO",
      "Brand": "PHYHOO",
      "Item Weight": "12.8 ounces",
      "Product Dimensions": "10.3 x 8.1 x 2.2 inches",
      "Item model number": "PHYHOO-322",
      "Is Discontinued By Manufacturer": "No",
      "Color": "Grey",
      "Size": "One Size",
      "Manufacturer Part Number": "PHYHOO-322",
      "ASIN": "B00YX72CZ2",
      "Customer Reviews": "4.4 out of 5 stars101 ratings4.4 out of 5 stars",
      "Best Sellers Rank": "#92,321 in Health & Household",
      "Date First Available": "June 5, 2015"
    },
    "categories": [
      "Magnifiers",
      "Visual Impairment Aids",
      "Medical Supplies & Equipment",
      "Office Products",
      "Mobility & Daily Living Aids",
      "Health & Household"
    ],
    "price": 22.98
  }
}