{
  "website_summaries": [
    {
      "verdict": "A colorful but distinctive look in cotton.",
      "pros": [
        "Comes in two sizes",
        "Offers a lot of color for a dull space",
        "Sturdy material with bright, vibrant colors",
        "Also works great as curtains or a throw"
      ],
      "cons": [
        "Cannot be machine washed",
        "Colors might be less vibrant than the online pictures"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great addition to any room",
      "text": "Using in place of curtains in my sun room for privacy as well as decor. It is light enough to allow air flow through screens as well as keeping direct sun from blinding us or cause the room to be to warm. When you open package there is a strong odor from dye chemicals used. I hung 4 panels and had to air out the room. But the odor has dissipated or I have become nose blind. I could wash them but wanted to decorate with them as soon as they arrived!",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa G.",
      "helpful_votes": 99,
      "publication_date": 20160218
    },
    {
      "title": "Beautiful and Well Made Tapestry",
      "text": "Beautiful 100% cotton tapestry. The colors do look brighter on screen, but I’m not unhappy. It’s still a beautiful piece. People saying it was small maybe ordered the wrong size? Mine is huge 85” x 80”. Can’t beat it for 15 bucks. The last photo is post washing in cold and drying on delicate. Colors held fast, and the measurements were taken after washing as well. It has a typical tapestry smell. If you’ve ever bought a legit cotton tapestry you know what I’m talking about. I’ll probably buy more. This is going camping with me and then on a wall. Would be great as a base layer for the beach. Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Geeja",
      "helpful_votes": 2,
      "publication_date": 20200803
    },
    {
      "title": "Good quality for the price.",
      "text": "The first photo shown is the advertised color. The second photo is the actual color. Though I was disappointed in the lack of vibrancy I was expecting I decided that they were still pretty so I kept them. I purchased three of the large size and used them on banquet sized tables as tablecloths for a Moroccan Community “Take-out” dinner. The fabric is light weight, the color is nicely saturated and the quality was good for the price. I read many reports about the cloth having an odor. These did not have an odor at all and could be used straight out of the packaging. I would purchase them again.",
      "rating": 5.0,
      "verified": true,
      "author": "french in time",
      "helpful_votes": 2,
      "publication_date": 20200802
    },
    {
      "title": "Nice fabric. Seems durable. Deep colors. Doesn't look like photo.",
      "text": "I had ordered a few wall hangings. This looks so different from the photo that I thought that they had mistakenly left one out of the order. It was my mistake. The orange doesn't cover as much of the material as it does in the photo, and the area in the middle takes up a lot more room on the garment. The fabric is really nice. Tightly woven, durable. Deep colors. I don't see this fading when washed. I only wish it resembled the photo with the orange color covering more territory.",
      "rating": 3.0,
      "verified": true,
      "author": "D",
      "helpful_votes": 0,
      "publication_date": 20200614
    },
    {
      "title": "Beautiful!!",
      "text": "I have a door-size window that connects my room to the sunroom in the back of our house. I couldn't handle the amount of light coming in without anything up, but I hated how dark and stuffy it felt with a black-out curtain. Given my profoundly hippie nature, I went looking for something to let just enough light in, while still ensuring my privacy and matching the appeal of my room. I couldn't be more pleased with how well this tapestry fills those needs! Absolutely gorgeous, and highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Thomas",
      "helpful_votes": 6,
      "publication_date": 20160815
    },
    {
      "title": "Beautiful colors. Nice size",
      "text": "Beautiful colors. Nice size. I have a king size bed and it is as big as my headboard. Fabric seems durable. Really enjoying this addition to my room!",
      "rating": 5.0,
      "verified": true,
      "author": "Heather Huddleston",
      "helpful_votes": 11,
      "publication_date": 20161118
    },
    {
      "title": "BITCHEN COOL!",
      "text": "Love, love, LOVE this pattern! I bought 2 to hang outdoors in my gazebo, along with some other patterned hangings, so I could bring back those 70’s vibes that are so popular now. The colors are bright & they really pop! I washed them in cold water, let them air dry outside; easy peasy, ready to hang. And they look really groovy, just like I had imagined. If you’re into the hippie/boho thang, get yourself a couple of these & see if you’re diggin’ them as much as I am!",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs. B.",
      "helpful_votes": 0,
      "publication_date": 20190521
    },
    {
      "title": "Color is dark not bright",
      "text": "I bought this three years ago, the one that I have received today. It’s extremely dull the colors are not vibrant at all they are very dark. They look nothing like the picture unfortunately. So if you’re going based on color I would not recommend this product. It is very very dark",
      "rating": 1.0,
      "verified": true,
      "author": "Queen Bunny",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "Colors and designs may vary from the photo listed on Amazon for this product.",
      "text": "The cloth is in good quality but the colors in my cloth I received are different than the photo on the Amazon listing. Colors and the width of each circle in the cloth just seem off or different than the one displayed on the listing online. I like the photo better than the actual product I received so I’m not as happy as I should have been with this purchase.",
      "rating": 3.0,
      "verified": true,
      "author": "S Hamilton",
      "helpful_votes": 0,
      "publication_date": 20200627
    },
    {
      "title": "Remember the old adage..?",
      "text": "I will start with the good first: the colours are vibrant, it is lightweight, true to size, and inexpensive. The old adage that you get what you pay for, is apropos. While the above is true, I expected that the fabric would be a little less coarse, and the colours would not seem as if they were bleeding together.",
      "rating": 2.0,
      "verified": true,
      "author": "BellaMorena36",
      "helpful_votes": 0,
      "publication_date": 20200128
    },
    {
      "title": "Pretty big but can hang by myself! LOVE this tapestry!",
      "text": "I LOVE this tapestry, I have two! I’ve used them in every dorm/house I’ve lived in since 2015! They are a great material, hand super well, and so pretty! They are pretty large but I’ve always been able to hang it up myself!",
      "rating": 5.0,
      "verified": true,
      "author": "Helena Jones",
      "helpful_votes": 0,
      "publication_date": 20191118
    },
    {
      "title": "It really does smell that bad",
      "text": "The smell is horrible! I tried to hang it in my house to air out, but it was too strong for the house. I put it on my back porch to air out, and the smell was still so strong that I couldn’t stand to be OUTSIDE with it. It’s now on my rarely used front porch. It’s been there for about a week. It still stinks. I’ve sprayed it multiple times with odor eliminating spray. I’m trying to decide if I’ll ever be able to hang it in my house. It’s a very musty smell. Like it’s been in someone’s mildewed basement for 20 years. So gross.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200321
    },
    {
      "title": "Exceeded my expectations",
      "text": "The quality and texture of the material was way more beautiful than I was expecting. Nice thick and easy to hang. I am using it for a pop up tent wall.",
      "rating": 5.0,
      "verified": true,
      "author": "Shirley Gauthier",
      "helpful_votes": 0,
      "publication_date": 20191010
    },
    {
      "title": "My daughter picked this out for one of her birthday ...",
      "text": "My daughter picked this out for one of her birthday presents. She said she likes the colors and design but I suspect she's using it to cover the escape tunnel she has been digging.",
      "rating": 5.0,
      "verified": true,
      "author": "nozama",
      "helpful_votes": 4,
      "publication_date": 20170417
    },
    {
      "title": "Not True to The Colors of the photos!!",
      "text": "The Colors Are NOTHING like the Photo! And It was Bought cause of the colors! This is very disappointing... The Smell is Awful! Its Pretty Yes But I wanted the Colors I ordered! Amazon seems to be getting worse everyday! So Sad!!",
      "rating": 2.0,
      "verified": true,
      "author": "Blondebritt24",
      "helpful_votes": 0,
      "publication_date": 20190924
    },
    {
      "title": "If you’re thinking about buying this DO IT!",
      "text": "5 stars all the way! I didn’t write a review sooner because I wanted to see how it would hold up, I’ve had this since 2015 and the colors are still vibrant and beautiful. It’s much bigger than I thought it would be, there was a smell when we opened the package but it’s looooong gone. It’s very well made and it’s something you’d see in earth bound or urban outfitters for about $50 or $60 so this was definitely worth it!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200607
    },
    {
      "title": "Colors are not as pictured, but still nice",
      "text": "This is definitely a product wherein you get what you paid for. This tapestry might not be high enough quality to use for multiple outdoor picnics, but it makes great home decor. My only issue is that the colors are much more muted than the product photo shows. All in all, it's a great product for the price. I just wish the seller was more transparent in its depictions of the product.",
      "rating": 3.0,
      "verified": true,
      "author": "kiana",
      "helpful_votes": 3,
      "publication_date": 20160806
    },
    {
      "title": "NOT TRUE TO COLOR SHOWN",
      "text": "I wish I had read reviews before purchasing this \"purple\" tapestry. It is definitely not the same coloring as what is shown in sellers pictures. As others stated it's not terrible, just not vibrant at all. There is also a very strong chemical odor.",
      "rating": 3.0,
      "verified": true,
      "author": "Sunshine Dinardo",
      "helpful_votes": 0,
      "publication_date": 20200828
    },
    {
      "title": "As beautiful as many of these Indian hangings are, I'm amazed at how cheap they are to buy.",
      "text": "Very nice design. Colorful but not dayglow. These Indian hangings are useful for many things. A big one like this passes as a bed cover, it makes a nice wall hanging, easy to put up temporarily for shade on the patio or while camping. I personally like the mandala pattern for focus meditation. I haven't had to wash this one yet so I don't know how it will stand up, but it looks like it will do okay if gentle washed and hung to air dry. As beautiful as many of these Indian hangings are, I'm amazed at how cheap they are to buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott B Gale",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "2nd purchase",
      "text": "I bought this for myself a couple years ago - my adult son asked me if he could have it to decorate his new apartment/ I told him no - and I bought him the exact one for his birthday - he was very surprised and happy - it's hard to please an adult child sometimes- this time, I did. This product is colorful bright, and light enough to hang on a wall/",
      "rating": 5.0,
      "verified": true,
      "author": "Gary Fitzgerald",
      "helpful_votes": 0,
      "publication_date": 20200304
    },
    {
      "title": "Deceptive advertising.",
      "text": "I have mine away the day it came. It was SO dark and looked nothing like the picture,which beautiful pictures.",
      "rating": 1.0,
      "verified": true,
      "author": "Michele Engel",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "Beautiful!  I love it!",
      "text": "Honestly, I haven't figured out what I'm going to do with this beauty yet. I actually bought the small one (because the price was so great) just to check quality. I am very happy with this piece and hope to return to buy the bigger pieces as soon as I figure out which ones I need.",
      "rating": 5.0,
      "verified": true,
      "author": "Plumfield",
      "helpful_votes": 0,
      "publication_date": 20201008
    },
    {
      "title": "Gorgeous!!",
      "text": "I had a Morrocan themed party and used this to sit on. Very thin material so we had to put mats underneath for comfort. Received so many compliments on it, many thought it was authentic. definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "LM",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "@ $7 u get what u pay 4",
      "text": "Just disappointed. Material is thin, smelly. Measurements are off. Colors are off. Design is off. I guess for $7, I got what I paid for. Still, I won't buy this again. I've never seen one this small.",
      "rating": 4.0,
      "verified": true,
      "author": "aMUSEd",
      "helpful_votes": 0,
      "publication_date": 20200216
    },
    {
      "title": "not square like the picture but rectangle and wildly different colors",
      "text": "not sure why people put pictures up that are not what is sold, this picture is gorgeous and huge. The actual tapestry is small, smaller than half the picture, not square like the picture but rectangle and wildly different colors. Upon opening I found it was dark, almost black and not bright at all. To bad the one in the picture doesn't exist I would love to have it!",
      "rating": 1.0,
      "verified": true,
      "author": "dan",
      "helpful_votes": 2,
      "publication_date": 20161022
    },
    {
      "title": "Great product, last delivery driver",
      "text": "The product is amazing, however the UPS driver delivered it with the box crushed and split wide open as if someone cut the security tape with a knife all the way. Driver didn’t even bother adding a strip of tape to seal the box back up. I have pictures of the box but it won’t let me upload.",
      "rating": 4.0,
      "verified": true,
      "author": "Celtic Hutcheson",
      "helpful_votes": 0,
      "publication_date": 20200409
    },
    {
      "title": "fantastic",
      "text": "I am so excited to hang this in my new house! I was looking for something bold to hang as a centerpiece but I'm thinking about ordering a few more and using them as curtains!",
      "rating": 5.0,
      "verified": true,
      "author": "tamerajryan",
      "helpful_votes": 0,
      "publication_date": 20201019
    },
    {
      "title": "Nice",
      "text": "Good tapestry. Easy to dry the wrinkles out, smells strong of plastic but I'm just hanging it up so it didnt bother me or overwhelm the small room. It was slightly smaller than expected but that's my bad.",
      "rating": 5.0,
      "verified": true,
      "author": "Sierra Allen",
      "helpful_votes": 0,
      "publication_date": 20200716
    },
    {
      "title": "Vivid colors",
      "text": "The colors are just beautiful in this tapestry. I bought two and use them for table cloths. Slightly fading colors after many washes. I am buying two more again!",
      "rating": 5.0,
      "verified": true,
      "author": "SellnMelln",
      "helpful_votes": 0,
      "publication_date": 20190916
    },
    {
      "title": "Good Quality for the money",
      "text": "This was the very first product I ever ordered from Amazon and I loved it. I first used it as decoration but grew out of it and ended up using as a blanket for the beach.",
      "rating": 5.0,
      "verified": true,
      "author": "Kimberly Ruiz",
      "helpful_votes": 0,
      "publication_date": 20200608
    },
    {
      "title": "Looks great, easily ripped",
      "text": "For the price it's about what I expected, the tapestry is lightweight and looks good! It is darker than the images but still looks great and is what I expected. Only issue is that I've had it on my wall about three weeks and it has already ripped through the pins three times, the fabric is thin and rips easily. Other than that I'm very happy with this purchase!",
      "rating": 4.0,
      "verified": true,
      "author": "D",
      "helpful_votes": 0,
      "publication_date": 20200917
    },
    {
      "title": "I love Mandala's.",
      "text": "I love Mandala's... use them in different ways all over my house... This is wrong, false advertiment!! Not as vibrant as the picture... it's actually darker and duller then others I have👎🏻👎🏻",
      "rating": 1.0,
      "verified": true,
      "author": "Kringlers",
      "helpful_votes": 4,
      "publication_date": 20161104
    },
    {
      "title": "Great Size, Great Fabric, Great Colors",
      "text": "Very beautiful boho couch cover, very large. I bought several different types. This one is by far the biggest size and best fabric. Very brilliant colors.",
      "rating": 5.0,
      "verified": true,
      "author": "J. S. Danielson",
      "helpful_votes": 0,
      "publication_date": 20190809
    },
    {
      "title": "Gorgeous!",
      "text": "Beautiful! Looks exactly like the picture, colors are vibrant and detailed! I made it into a curtain for our patio door and when I took it to the fabric store while it was on the measuring table all the ladies in the store were admiring it and asking where I found it. It is rather thin, so I ended up ordering another one to make a double sided curtain so the sun won't fade it as quickly. Also, both sides of the tapestry are very pretty.",
      "rating": 5.0,
      "verified": true,
      "author": "ColeyJonesTop Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20160224
    },
    {
      "title": "Lovely",
      "text": "I needed a little something to soften my meditation corner and this was perfect. The colors are beautiful and the quality is exactly as I hoped.",
      "rating": 5.0,
      "verified": true,
      "author": "Bluskyz",
      "helpful_votes": 0,
      "publication_date": 20200202
    },
    {
      "title": "Lovely colors and pattern",
      "text": "Very nice light tapestry, can be used as bedspread, table cover, picnic blanket, or on furniture for sunbathing",
      "rating": 5.0,
      "verified": true,
      "author": "Marilyn Sosna",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "Super cute",
      "text": "The colors are beautiful just kinda dark. Easy to put up, smells a little funky when you get it so I definitely recommend washing it first. Easy to fold up as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Raven Belle",
      "helpful_votes": 0,
      "publication_date": 20191009
    },
    {
      "title": "Festive and Unique",
      "text": "This item was too thin for my original purpose but turned out well as a tablecloth for an Arabian nights-themed party.",
      "rating": 5.0,
      "verified": true,
      "author": "MR19",
      "helpful_votes": 0,
      "publication_date": 20200809
    },
    {
      "title": "The colors were nothing at all like pictured, I think if the colors had at ...",
      "text": "very very thin, very very disappointing! The colors were nothing at all like pictured, I think if the colors had at least been true to what is shown I would have kept it despite it being so thin. I wouldn't recommend buying this item.",
      "rating": 1.0,
      "verified": true,
      "author": "dawnt",
      "helpful_votes": 3,
      "publication_date": 20160825
    },
    {
      "title": "Perfect",
      "text": "Exactly what I needed. Lightweight yet strudu enough. Colors off but beautiful all the same. It works for me. Good price. I would buy from this seller again",
      "rating": 5.0,
      "verified": true,
      "author": "Sunshine Daydreams 😎😉✌💕",
      "helpful_votes": 0,
      "publication_date": 20200309
    },
    {
      "title": "Rich colorful tapestry",
      "text": "Love the rich colors. This is the second time purchasing this tapestry I love it so much. Personally the colors are reflected fairly well.",
      "rating": 5.0,
      "verified": true,
      "author": "Anne & Steve",
      "helpful_votes": 0,
      "publication_date": 20190504
    },
    {
      "title": "love the look and bright colors",
      "text": "love the look and bright colors ... one star off just because it comes with a \"new\" smell that I do not like at all, and the other tapestries I bought at the same time don't smell bad at all but this on does ... sprayed it with febreez and it helped a little. Having to leave the window open and fan on in the winter of the freezing Colorado weather ... so, yes, that's annoying, but it's lovely nevertheless.",
      "rating": 4.0,
      "verified": true,
      "author": "PEY",
      "helpful_votes": 0,
      "publication_date": 20170119
    },
    {
      "title": "One Star",
      "text": "Completely misleading. Colors are different, half the size I expected from the advertisement and had a strange odor.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 9,
      "publication_date": 20160126
    },
    {
      "title": "I love it!",
      "text": "I’ve been looking for a pop of color to add to my room and this definitely did the trick! It’s so beautiful and helps me feel calm. It’s very thin which makes it easy to hang up. The only issue I came across was some loose strings on the edges but since I won’t be washing it too often, I am not concerned.",
      "rating": 5.0,
      "verified": true,
      "author": "Alyssandra Suddath",
      "helpful_votes": 0,
      "publication_date": 20201001
    },
    {
      "title": "Colors not good",
      "text": "Compared to the photo, this fabric was dull and muddy looking.",
      "rating": 3.0,
      "verified": true,
      "author": "buyer",
      "helpful_votes": 0,
      "publication_date": 20200904
    },
    {
      "title": "Beautiful, colorful fabric!",
      "text": "I ordered two of these tapestries and I love them! They're so colorful and pretty. I have them draped over a stairwell railing and they look great. Definitely a nice product for a reasonable price and would make a great gift.",
      "rating": 5.0,
      "verified": true,
      "author": "Jo",
      "helpful_votes": 0,
      "publication_date": 20200223
    },
    {
      "title": "STUNNING AND BEAUTIFUL",
      "text": "Omg this tapestry is so amazing!!! I just received it and the colors are so vibrant!! The design enhances any room in the most beautiful and artistic way. When hanging it up, some of the dye rubbed off onto my fingers but it was easily washable with warm water and soap. I would highly recommend !!!!",
      "rating": 5.0,
      "verified": true,
      "author": "ROSE",
      "helpful_votes": 0,
      "publication_date": 20200326
    },
    {
      "title": "Love it",
      "text": "Cool tapestry. Good material and worth the price. Love it",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan PB Feuer",
      "helpful_votes": 0,
      "publication_date": 20200818
    },
    {
      "title": "Trippy Hippy",
      "text": "This is one of the smaller style tapestry. It's perfect for a picnic, or to throw over a chair for decorative purposes. The description photo is more bright than the actual tapestry which is more dark colored unfortunately, but it's still nice looking. I would definitely purchase from this company again.",
      "rating": 5.0,
      "verified": true,
      "author": "mallisa",
      "helpful_votes": 0,
      "publication_date": 20161120
    },
    {
      "title": "Colors are not accurate",
      "text": "I agree with the other reviewers that said the colors are way off. In the picture it is vibrant and nicely contrasted. In reality, the colors are dark and nothing really pops out. The hem was not of good quality, either. I was happy that it did not have a bad smell.",
      "rating": 1.0,
      "verified": true,
      "author": "patsly",
      "helpful_votes": 3,
      "publication_date": 20161203
    },
    {
      "title": "Misleading photos, but overall okay",
      "text": "This tapestry is very thin, feels cheaply made. Then again, it wasn't very expensive, the price was great. As far as the colors, they matched the patterns in the picture, but the actual one I received is a lot darker. It is also only printed on one side, which makes the non printed side look very dull and dim. It's a nice size, and has held up well. I am content with it, wouldn't buy again, and probably wouldn't recommend to anyone",
      "rating": 3.0,
      "verified": true,
      "author": "Alex Reed White",
      "helpful_votes": 0,
      "publication_date": 20160930
    },
    {
      "title": "beautiful",
      "text": "i really love this! yes it is thin type material but not really what i would call cheap either. i mean how thick do you need to fabric? i have two different one like this bought on different occasion and they are the same quality. no issues. very beautiful. i actually use this as a cover for our gaming table.",
      "rating": 5.0,
      "verified": true,
      "author": "anjiestar",
      "helpful_votes": 0,
      "publication_date": 20160906
    },
    {
      "title": "Great Colors and Design",
      "text": "I used these to make a canopy over my Granddaughter’s Crib. The theme was Maharaji Indian Princess 👸🏽 🐘 it came out beautifully. I used 4 joined together around an oval hoop suspended from the ceiling to enclose the crib.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian Garrison",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "Gorgeous, completely transforms a room!",
      "text": "GORGEOUS tapestry, terrific colors and artistry, covers my daughter's entire bedroom wall and fills it with color. She loves it and so do I! Fantastic price for such a lovely piece of hanging art that can transform a room!",
      "rating": 5.0,
      "verified": true,
      "author": "TBS",
      "helpful_votes": 0,
      "publication_date": 20171029
    },
    {
      "title": "Beautiful",
      "text": "perfect for my wall and it looks much better than a headboard",
      "rating": 5.0,
      "verified": true,
      "author": "Zen Therapist",
      "helpful_votes": 0,
      "publication_date": 20200528
    },
    {
      "title": "Great for hanging at festivals.",
      "text": "Love this tapestry. Great to hang on canopy at festivals because the tapestry has an image on both side.",
      "rating": 5.0,
      "verified": true,
      "author": "Tinapcola",
      "helpful_votes": 0,
      "publication_date": 20200521
    },
    {
      "title": "Well",
      "text": "I felt like the picture made it look broght and vibrant. Well when i got it was very dull. Kind of disappointed. Is it even the same one?",
      "rating": 3.0,
      "verified": true,
      "author": "Melanin Berry 🍓",
      "helpful_votes": 0,
      "publication_date": 20190402
    },
    {
      "title": "Beautiful colors",
      "text": "It’s brightly colored and beautiful. As other reviewers have said, hem slightly uneven and there was a small spot that appeared to have some dirt on it but overall a great value.",
      "rating": 5.0,
      "verified": true,
      "author": "Haley D",
      "helpful_votes": 0,
      "publication_date": 20200602
    },
    {
      "title": "Longjevity",
      "text": "My couch is solid purple ... and velvet! This is a great cover . Second one I’ve had . First one faded but still looked good after 2 years . New one great but old one now designated for trips to the beach.",
      "rating": 5.0,
      "verified": true,
      "author": "Lee",
      "helpful_votes": 0,
      "publication_date": 20201001
    },
    {
      "title": "nice tapestry",
      "text": "great size and the colors are pretty. i think if the colors were more vintage or dulled down it would look even cooler but still a great tapestry.",
      "rating": 5.0,
      "verified": true,
      "author": "sadie repinski",
      "helpful_votes": 0,
      "publication_date": 20190725
    },
    {
      "title": "Great price fast delivery",
      "text": "Last of the tapestries for upstairs gives room special lightness and good vibe",
      "rating": 5.0,
      "verified": true,
      "author": "Shawna lamar",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Nice.  But dull colors",
      "text": "Very heavy 👍🏾 but the colors are dull still nice though",
      "rating": 4.0,
      "verified": true,
      "author": "Terriah Rogers",
      "helpful_votes": 0,
      "publication_date": 20200418
    },
    {
      "title": "Awesome Item!!!",
      "text": "This product was awesome! So glad I picked this item. It was not super thin and the fabric is gorgeous. It is also HUGE. Great value for the price! I purchased the queen size tapestry. I have a queen sized bed that I pinned it above. I am so in love with this item.",
      "rating": 5.0,
      "verified": true,
      "author": "BlackQueen92",
      "helpful_votes": 0,
      "publication_date": 20201017
    },
    {
      "title": "Nice print",
      "text": "Love the pattern rich in color and fun hung up over my stairs looks ggod",
      "rating": 5.0,
      "verified": true,
      "author": "lanae",
      "helpful_votes": 0,
      "publication_date": 20200206
    },
    {
      "title": "Pleasantly Surprised",
      "text": "Was pleasantly surprised by the quality of material. Could be used as a bed SHEET, or simply bed decor. Used mine as wall tapestry. Gotten several compliments. Washed on normal cycle with cool water; colors didn’t run. Withstood the wash and dryer. I like it. Would make a good gift.",
      "rating": 5.0,
      "verified": true,
      "author": "FredaBonita",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "beautiful colors",
      "text": "I bought it as a bedcover/ spread. It's a bit small and does not cover a twin bed completely- head to foot or down the sides.It is beautiful though. Vibrant colors purple,magenta,blue and gold. I'm sure it would make a nice wall decoration also. Not bad for the price.",
      "rating": 4.0,
      "verified": true,
      "author": "MD in NJ",
      "helpful_votes": 0,
      "publication_date": 20160119
    },
    {
      "title": "colors not as vibrant as advertised",
      "text": "The tapestry is ok. I would have loved for them to be thicker. The color of this one is not as advertised. even my picture makes it look much brighter than it really is.",
      "rating": 3.0,
      "verified": true,
      "author": "Amy",
      "helpful_votes": 0,
      "publication_date": 20191206
    },
    {
      "title": "Beautiful piece",
      "text": "Beautiful addition to my “Zen Den”. Allow a couple of days for it to air our prior to hanging. It arrives with a a strong smell.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Phillips",
      "helpful_votes": 0,
      "publication_date": 20200903
    },
    {
      "title": "For the price....wow",
      "text": "As described. Exactly what was needed to inspire the space. Great colors. Extremely happy. Ordering a second design. Well worth the $12.",
      "rating": 5.0,
      "verified": true,
      "author": "Leilani D Rasmussen",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "Pretty!",
      "text": "Note: As it says, this tapestry is twin sized. I missed that when I made my order, and it was too small for what I had intended to do with it. No worries, I have new plans for it now. It's beautiful and I love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Cindy Russell",
      "helpful_votes": 0,
      "publication_date": 20160718
    },
    {
      "title": "Beautiful piece, great value",
      "text": "This remind us of the beautiful tapestries we used to buy at Venice Beach, CA. Very nice",
      "rating": 5.0,
      "verified": true,
      "author": "Steven Funk, Ed.D.",
      "helpful_votes": 0,
      "publication_date": 20200827
    },
    {
      "title": "Perfect for Bohemian Summer",
      "text": "Building a canopy on my balcony and bought these. Who the quality and colors are outstanding! Great value for you money. I am going to buys a few more...",
      "rating": 5.0,
      "verified": true,
      "author": "H.B. Kaplan",
      "helpful_votes": 0,
      "publication_date": 20200415
    },
    {
      "title": "It is prettier than the picture. I love it!",
      "text": "The colors are vibrant and perfect. The quality is spot on. Iam using it for a table cloth and it is just the right size. It is very pretty and it is perfect for what I had in mind!",
      "rating": 5.0,
      "verified": true,
      "author": "Diane Tenbrook",
      "helpful_votes": 0,
      "publication_date": 20200814
    },
    {
      "title": "Just as described",
      "text": "Looks just like the photo. Great colors. Crisp, but softens as you wash it (I dry it in the dryer, too). Bought one for me, and now 2 more as gifts.",
      "rating": 5.0,
      "verified": true,
      "author": "Heather ",
      "helpful_votes": 0,
      "publication_date": 20200713
    },
    {
      "title": "Awesome Price!",
      "text": "I bought this originally for me, but I ended up giving it to my sister. She absolutely loves it and had it on her wall! very durable and the colours are vibrant.",
      "rating": 5.0,
      "verified": true,
      "author": "ereripancake",
      "helpful_votes": 0,
      "publication_date": 20180203
    },
    {
      "title": "Very good",
      "text": "Great decoration piece. Very light weight and material is all cotton.",
      "rating": 5.0,
      "verified": true,
      "author": "Sukhpreet",
      "helpful_votes": 0,
      "publication_date": 20191127
    },
    {
      "title": "Pretty but small and smelly",
      "text": "Much smaller than I thought. Smelled bad but is pretty",
      "rating": 2.0,
      "verified": true,
      "author": "Jody",
      "helpful_votes": 0,
      "publication_date": 20190430
    },
    {
      "title": "EXTREMELY MISLEADING!!!",
      "text": "I wouldn't even give this a one star. It isn't even half the size it states it is also it looks nothing like the picture. When I received it the smell was so strong it was making my head hurt. I would never buy this again or recommend it to anyone!",
      "rating": 1.0,
      "verified": true,
      "author": "Jonathan",
      "helpful_votes": 2,
      "publication_date": 20161008
    },
    {
      "title": "beautiful and love it!",
      "text": "Such a beautiful Tapestry. I had no idea that Amazon sold these and cannot wait to up my collection now I know what I'm going to be buying people for Christmas and birthday presents. It came very fast and actually came within two days and arrive exactly how I expected.",
      "rating": 5.0,
      "verified": true,
      "author": "Lani",
      "helpful_votes": 0,
      "publication_date": 20160822
    },
    {
      "title": "Love!",
      "text": "So pretty!!! Thin but not cheap. Colors Re vibrant. Quick shipping. I'll be back for more.",
      "rating": 5.0,
      "verified": true,
      "author": "Lindsay",
      "helpful_votes": 0,
      "publication_date": 20191002
    },
    {
      "title": "LOVE IT",
      "text": "I got a few to hang up in my cubby hole bedroom in my travel trailer",
      "rating": 5.0,
      "verified": true,
      "author": "Lorrie",
      "helpful_votes": 0,
      "publication_date": 20190612
    },
    {
      "title": "It looks great! Colors are beautiful",
      "text": "I'm an interior decorator and my teen client wanted one of these hung in place of a closet door. I was skeptical...thought it would look cheap. It looks great! Colors are beautiful, good quality, and really adds interest to the room.",
      "rating": 5.0,
      "verified": true,
      "author": "Annette Winsor",
      "helpful_votes": 0,
      "publication_date": 20160919
    },
    {
      "title": "Meh",
      "text": "It’s a nice tapestry but does not look quite like the picture it’s much darker and smaller than expected but over all still nice.",
      "rating": 3.0,
      "verified": true,
      "author": "Alicia Whitman",
      "helpful_votes": 0,
      "publication_date": 20200331
    },
    {
      "title": "Good price and beautiful",
      "text": "I used this for a table covering for a table at a festival. It was beautiful and I got so many compliments",
      "rating": 5.0,
      "verified": true,
      "author": "Pam",
      "helpful_votes": 0,
      "publication_date": 20200301
    },
    {
      "title": "I like it",
      "text": "The material is a bit thinner than I was expecting. Also there were some loose threads which clearly indicates lazy quality control. But all in all it's really cool. The two sides are similar. One side just has a darker color scheme.",
      "rating": 4.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 0,
      "publication_date": 20160615
    },
    {
      "title": "Different color than pictures.",
      "text": "I was looking for a bright colored back drop. This is cute, but WAY darker than what I wanted. Not to happy :(",
      "rating": 1.0,
      "verified": true,
      "author": "Reyna Flores",
      "helpful_votes": 0,
      "publication_date": 20191112
    },
    {
      "title": "dull",
      "text": "obviously the colors aren’t as vibrant as the pictures. bc the pictures they used are edited. but it’s the right size, and idk i don’t think it looks horrible. but definitely not as pretty as i thought. it’s a bit dull.",
      "rating": 4.0,
      "verified": true,
      "author": "katie taylor",
      "helpful_votes": 0,
      "publication_date": 20200828
    },
    {
      "title": "Great Product",
      "text": "I had read previous reviews saying that they were not happy or did not receive this product the way it looked, but I figured why not. It was a good price and the other ones looked cool as well. I have to say I do not regret buying this at all, it came in earlier than expected, and it came exactly like the picture! Very happy with this buy and would buy from them again!",
      "rating": 4.0,
      "verified": true,
      "author": "jibjab3040",
      "helpful_votes": 0,
      "publication_date": 20170103
    },
    {
      "title": "Beautiful",
      "text": "Just as described and looked in the photos! I bought 4 of them and they were all great light weight enough to hang on the ceiling of our basement... let them air out they do have a strong smell but other than that they are beautiful and a bargain at the price point!",
      "rating": 5.0,
      "verified": true,
      "author": "Brittany M.",
      "helpful_votes": 0,
      "publication_date": 20191112
    },
    {
      "title": "Great for gifts of all ages & multiple uses",
      "text": "Great for gifts of all ages & multiple uses. Be creative. Wash great on cold & I dried to set colors. Use to cover my wet clothes on hangers,draped over a rod. They've been colorfast after dryer.",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel Garten",
      "helpful_votes": 0,
      "publication_date": 20161210
    },
    {
      "title": "Beautiful colors",
      "text": "Love this tapestry its 2 sided. Same design a true tapestry. Not a silky material more cotton.",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy Wagner",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "Beautiful",
      "text": "I wasn’t expecting this to be as good quality as it is! It came bigger than I expected, and I love the colors so much! I recommend this!",
      "rating": 5.0,
      "verified": true,
      "author": "McKenzie W.",
      "helpful_votes": 0,
      "publication_date": 20200603
    },
    {
      "title": "This tapestry is so beautiful, and it looks perfect on my wall",
      "text": "This tapestry is so beautiful, and it looks perfect on my wall. The colors are slightly darker than the picture shows, but I don't mind. Will be buying more tapestries like this one. So happy with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Stefani",
      "helpful_votes": 0,
      "publication_date": 20160818
    },
    {
      "title": "Torn but using anyway.",
      "text": "Item was torn and had a gaping hole. Wasn't worth the returning to seller. I kept it and just used duct tape. I never got hold of the seller. I am sure things would have been made right. But I am not one of those consumers. One and done for me!! I liked the colors and print though!!",
      "rating": 2.0,
      "verified": true,
      "author": "Daniella",
      "helpful_votes": 0,
      "publication_date": 20160517
    },
    {
      "title": "beautiful",
      "text": "Arrived quickly, washed well and was a colorful.addition to our party decor.",
      "rating": 5.0,
      "verified": true,
      "author": "H.Holliday",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "... the picture that i would be getting a square like mandala, but it is not square it is ...",
      "text": "I was under the impression by the picture that i would be getting a square like mandala, but it is not square it is rectangular. Very long one way, Short the other way. Also smells old like an attic. Pretty coloring though and does the job.",
      "rating": 3.0,
      "verified": true,
      "author": "Alexis",
      "helpful_votes": 0,
      "publication_date": 20160108
    },
    {
      "title": "A few loose threads, but still worth it.",
      "text": "There are a few loose threads around the edge, and it seems like it got caught a little in the middle so there’s a loose thread there, but other then that it looks very nice. I can’t wait to give it as a Christmas present.",
      "rating": 4.0,
      "verified": true,
      "author": "Mica G",
      "helpful_votes": 0,
      "publication_date": 20191206
    },
    {
      "title": "Beautiful!",
      "text": "Love this tapestry. Its the perfect size to put over my window. The colors are a little bit darker then in the photos but still vibrant and the print is very clean. It is a thinner material which was perfect for letting natural light through my window but some may want to block light. If so this will be too thin for you.",
      "rating": 5.0,
      "verified": true,
      "author": "Haillee Montanez",
      "helpful_votes": 0,
      "publication_date": 20160813
    },
    {
      "title": "Wrong design",
      "text": "The design is not the same as what is pictured. very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "andrea fiala",
      "helpful_votes": 0,
      "publication_date": 20191011
    },
    {
      "title": "Fast delivery and as advertised",
      "text": "The colors are so vivid! This is lovely and looks great hanging as my headboard. Good size, and the cloth is light but durable.",
      "rating": 5.0,
      "verified": true,
      "author": "Ruthyn",
      "helpful_votes": 0,
      "publication_date": 20190429
    }
  ],
  "product_meta": {
    "title": "Marubhumi Hippy Mandala Bohemian Tapestries, Indian Dorm Decor, Psychedelic Tapestry Wall Hanging Ethnic Decorative Tapestry (85 x 55 Inches, Purple Multi)",
    "description": "Size:85x55 inch| Color:Purple MultiThis gorgeous piece of art can be used as Bedspread, Bed Cover, Table Cloth, Curtain and of course as a Tapestry or a Wall Hanging.This Tapestries are completely screen printed in traditional Indian method and takes around a week to complete. These tapestries are printed, not quilted or woven. Each tapestry has its unique imperfections. In some cases what printers would call registration errors are intentionally included on the screen print to simulate hand woodblock prints. Because of the unique and handmade nature the measurements above may differ a small bit from the real one. Actual colors may slightly vary from those shown due to the nature of photographing and monitor color settings.",
    "rating": 4.6,
    "feature_bullets": [
      "Fabric: 100% Cotton Fabric, Screen Printed Design.",
      "Perfect for Gift - A Beautiful Home Decor Piece, Makes a Great Gift, Beautiful Wall Hanging, Dorm Divider , Beach Cover Up , Bedsheet",
      "Single Twin size approx 54X85 inches",
      "CARE: Dry Cleaning Or Cold Water Wash",
      "100% cotton made Colorful screen printed cotton bed sheet, tapestry, throw or wall hanging"
    ],
    "specifications": {
      "Product Dimensions": "9.49 x 6.5 x 1.81 inches",
      "Item Weight": "12 ounces",
      "Manufacturer": "Marubhumi",
      "ASIN": "B00YXQ83II",
      "Item model number": "TTWT10003",
      "Customer Reviews": "4.6 out of 5 stars1,570 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#11,344 in Home & Kitchen",
      "Is Discontinued By Manufacturer": "No",
      "Batteries Required": "No",
      "Import Designation": "Imported"
    },
    "categories": [
      "Home & Kitchen",
      "Home Décor",
      "Tapestries"
    ],
    "price": 11.99
  }
}