{
  "website_summaries": [
    {
      "verdict": "A comprehensive whitening kit that has earned numerous happy customers for producing nice results. However, it may also cause teeth and gum discomfort for some users.",
      "pros": [
        "In addition to whitening gel and a tray, this whitening kit includes an LED light device that speeds the process for a brighter smile",
        "Built-in timer lets you know when each whitening session is complete"
      ],
      "cons": [
        "Despite the manufacturer's claims of gentle whitening, teeth sensitivity and gum irritation have occurred after use"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "I LOVE this product",
      "text": "I LOVE this product! I attached a picture to show my results after about seven days of using it. I am still using it and just ordered more of the whitening gel! Highly suggest getting this product!!",
      "rating": 5.0,
      "verified": true,
      "author": "Tatum",
      "helpful_votes": 0,
      "publication_date": 20180223
    },
    {
      "title": "I won’t lie, I didn’t notice a huge difference ...",
      "text": "I won’t lie, I didn’t notice a huge difference after the first use, BUT my teeth were noticeabley whiter after the 3rd use, and have continued to get whiter with every use since then. This is the only whitening product that has worked for me, and I will definitely continue to use it.",
      "rating": 5.0,
      "verified": true,
      "author": "Tom",
      "helpful_votes": 0,
      "publication_date": 20180505
    },
    {
      "title": "I am very pleased with this tool",
      "text": "I am very pleased with this tool. I purchase a unit from QVC that cost $179 for the Glo technology, & it quit working after the 2nd month. I returned it on the extended warranty. This tool works exactly the same way with the same good results & the only time it has quite working is when the battery needed to be changed because it got bumped \"on\" & discharged in the drawer. MUCH more successful than the Glo Pro, & every bit as effective.",
      "rating": 5.0,
      "verified": true,
      "author": "Eugenia Fredricksen",
      "helpful_votes": 755,
      "publication_date": 20180321
    },
    {
      "title": "Awesome !!",
      "text": "Very happy with the results !!! After only 3 treatments!!!",
      "rating": 5.0,
      "verified": true,
      "author": "ley",
      "helpful_votes": 0,
      "publication_date": 20170727
    },
    {
      "title": "So far, so good",
      "text": "So far, so good. It’s only been 4-5 days, but I am happy that this product does not cause tooth sensitivity. I usually have problems with the white strips because I can only handle using them every 3rd day or so. I am able to use this kit daily with no problem.",
      "rating": 4.0,
      "verified": true,
      "author": "mybad",
      "helpful_votes": 714,
      "publication_date": 20171029
    },
    {
      "title": "Burning sensation and white bubble in my gums on second use.",
      "text": "I used it for the first time and it was great, told everyone about it at work. Was looking forward to session 2. Next day when I set it up and put it on I feel my gums almost like a burning sensation. I move it around thinking I’m irritating it with the position of it and still nothing. I go to the bathroom and see if looks like if it was burning my gums. A white and a small purple dot appeared in my bottom gums. I rinsed and it was still there. Of course I packed this up and started the return of this item. So that’s that.",
      "rating": 1.0,
      "verified": true,
      "author": "Judit G",
      "helpful_votes": 269,
      "publication_date": 20190515
    },
    {
      "title": "GREAT GEL Unnecessary Kit",
      "text": "Heres the tea: Does it work? Yes. I noticed significant differences before and after a few treatments. HOWEVER, you don't need this whole system. The light is a placebo, so save yourself some money and just buy the gel without the light kit and then go buy 2.99 mouth guards at Walmart. I have used the gel with/without the light, and I noticed similar results (my dentist confirmed this). Also you need to be careful because sometimes if you use too much gel you will singe part of your gum and it really hurts!",
      "rating": 3.0,
      "verified": true,
      "author": "Abby",
      "helpful_votes": 0,
      "publication_date": 20180302
    },
    {
      "title": "OUCH",
      "text": "This product gave my teeth white spots and not only that but a INCREDIBLE amount of sensitivity in my teeth and burnt my lower gums. The pain is mostly in my teeth and won’t go away ever since using it. save your money",
      "rating": 1.0,
      "verified": true,
      "author": "Cassidy G.",
      "helpful_votes": 104,
      "publication_date": 20181206
    },
    {
      "title": "Waste of money and caused burns.",
      "text": "A complete waste of money as it does not work, and caused burn marks on the inside of my lips. It is impossible not to drool like crazy not even 15 mins in a treatment.n",
      "rating": 1.0,
      "verified": true,
      "author": "NWSteph83",
      "helpful_votes": 83,
      "publication_date": 20180807
    },
    {
      "title": "Mouth guard doesn’t hold the light",
      "text": "Garbage. The mouth guard supposedly has a fitting designed to hold the light. Instructions say to attach light to mouth guard before doing anything else. The fitting is actually terrible and it does not hold the light at all. Very inconvenient and poorly designed. Since the light is designed to be held by the mouth guard this makes it very difficult to hold it just with your lips. Extremely disappointed. What’s the point of the kit if I can’t even use the light?",
      "rating": 1.0,
      "verified": true,
      "author": "Matt C",
      "helpful_votes": 65,
      "publication_date": 20180910
    },
    {
      "title": "Burned gums immediately",
      "text": "I had it in my mouth for only a few minutes and ended up with white blisters on my gums. Rinsed my mouth out immediately and hours later my gums are still burning and blistered.",
      "rating": 1.0,
      "verified": true,
      "author": "Dena Jenkins",
      "helpful_votes": 64,
      "publication_date": 20180820
    },
    {
      "title": "Don't bother!",
      "text": "Used as instructed for 14 days. I saw no change in the color of my teeth. Sent it back to Amazon.",
      "rating": 1.0,
      "verified": true,
      "author": "Jules",
      "helpful_votes": 153,
      "publication_date": 20180603
    },
    {
      "title": "Smiling More in Baker City",
      "text": "My teeth were very yellow due to many years of drinking coffee and soda. I'm 60 years old and was looking to have laser treatment from dentist, which would cost over $900,. After seeing your add and reading the reviews I thought I'd give it a try... I'm Very impressed, it whitened my teeth considerably after the first treatment. I'm still have 3-4 more treatments to go and can't wait for even more results. Worth the price! I don't normally write reviews but I'm so impressed with my results I had to share!",
      "rating": 5.0,
      "verified": true,
      "author": "Baker Valley",
      "helpful_votes": 118,
      "publication_date": 20171113
    },
    {
      "title": "Dear GOD the DROOLING!!!",
      "text": "Ok... so let's be honest. This thing turns me into a drool factory. This in turns starts the gagging process. When all is said and done, there is zero way to keep this in your mouth the full 30 minutes. My mouth aches from being tired supporting the weight by the time I'm finished. Also, these lights should emit at approximately 400 or 410 nanometers. This part of the light spectrum is actually dangerous for viewing with the naked eye. I'm completely shocked that there is no warning about not looking at the light (I know this because I work in printed LEDs).",
      "rating": 3.0,
      "verified": true,
      "author": "Alexandra Hartman",
      "helpful_votes": 55,
      "publication_date": 20180622
    },
    {
      "title": "Best Over the Counter Teeth Whitener - Highly Reccomend",
      "text": "This works very well! After my first and second time using the AuraGlow kit, it’s definitely made a huge difference! The 35% Carbamide Peroxide gel used is nice, minty, and mild. I’ve used all sorts of teeth whitening products (i.e. Crest White Strips, Sensodine Whitening Toothpaste, and Activated Charcoal) and this takes the cake! I drink a lot of coffee and wine so trying to keep my teeth white is difficult but this is just amazing. I have recommended this product to my family and friends and they all have had amazing results as wel! So if you’re worried this is just a gimmick, DON’T! 😁",
      "rating": 5.0,
      "verified": true,
      "author": "JMelicor",
      "helpful_votes": 32,
      "publication_date": 20181225
    },
    {
      "title": "made poorly",
      "text": "I can not recommend this product. The mouth piece ( which is separate ) arrived warped so it did not fit in the holder and kept falling out. It took the seller forever to send me a replacement piece also. The whitening was no better than crest white strips so not worth the money or poor design.",
      "rating": 3.0,
      "verified": true,
      "author": "Maria",
      "helpful_votes": 30,
      "publication_date": 20190103
    },
    {
      "title": "Do NOT buy. Cheap quality.",
      "text": "The mouth piece they sent was deformed and light doesn’t fit in it properly. The light falls out of the mouth piece as soon as you put it in, which makes the light useless. I have to hold the light against my mouth for 30 straight minutes. They need to cut the whole in the mouth piece, where the light goes, so that it barely fits. Do not buy this item!!!! I would go for a more expensive option as you get what you pay for.",
      "rating": 1.0,
      "verified": true,
      "author": "Jdog",
      "helpful_votes": 29,
      "publication_date": 20190306
    },
    {
      "title": "It doesn't seem to make a very big difference. ...",
      "text": "It doesn't seem to make a very big difference. It works just as well as any other whitening strips. However these have left bleached white spots on my teeth after the third use. UPDATE *Auraglow has contacted me and notified me that the spots are normal and wash away after 24 hours. They will also even out after whitening more. I will continue to use the product and update my review.",
      "rating": 4.0,
      "verified": true,
      "author": "Tyler",
      "helpful_votes": 47,
      "publication_date": 20171109
    },
    {
      "title": "DO NOT DESTROY YOUR TEETH!!!",
      "text": "DO NOT BUY!! This system DESTROYED my front teeth. There’s not only calcification, but my enamel is destroyed and my previously beautiful smooth teeth now have significant damage and ridges that are continuing to get worse and hold stain because of the lack of enamel, stains I can’t whiten away (even the right way) because they’re too sensitive. I don’t just want my $ back; I want my teeth back. Save yourself the $5,500 that I’m about to spend on veneers and stick with what the dentist advises you to use for whitening.",
      "rating": 1.0,
      "verified": true,
      "author": "Cjk ",
      "helpful_votes": 0,
      "publication_date": 20190207
    },
    {
      "title": "So glad I ordered this and read the reviews",
      "text": "So glad I ordered this and read the reviews! After my first treatment, I noticed a slight difference. I also read the instructions where you could put the gel directly on your teeth (with a Q tip etc) and use the light. After I that, the results were incredible! I am on my 5th treatment. Will definitely be ordering more! Definitely recommend​!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 33,
      "publication_date": 20180416
    },
    {
      "title": "I was amazed to see a difference in 30 minutes on my ...",
      "text": "I was amazed to see a difference in 30 minutes on my first treatment! Definitely give this a try before spending thousands or even several hundred with expensive dentist teeth whitening programs. You will see a difference!",
      "rating": 5.0,
      "verified": true,
      "author": "Tyler durton",
      "helpful_votes": 39,
      "publication_date": 20171025
    },
    {
      "title": "i was worried the taste would be horrible and the rubber mold would not fit into my ...",
      "text": "Ill be honest, i was extremely iffy about this product, i was worried the taste would be horrible and the rubber mold would not fit into my mouth with out making me gag. I have a hyper senstative gag reflex. I will say i was extremely please with this product. After ONE use i noticed results and i only used it for 15 minutes instead of the reccommended 30. Tip: Keep paper towels near. I drooled quite a bit taking out the product. Over all, deff work the buy. 2 Syringes with multiple applications in each syringe.",
      "rating": 5.0,
      "verified": true,
      "author": "Lyss",
      "helpful_votes": 24,
      "publication_date": 20180122
    },
    {
      "title": "Good Value",
      "text": "Love it. I could tell a difference after my first use. I read reviews that said it should not create sensitivity, but I personally did experience this after the 3rd or 4th time. I should say that I have used other whitening strips before where the sensitivity was more painful. I had my husband use this as well. He noticed a difference after the third time. He said he experienced sensitivity as well. But overall, easy, I liked that I did not have to put the strips on my teeth and get it all over my hands. :) .",
      "rating": 4.0,
      "verified": true,
      "author": "Kristina D",
      "helpful_votes": 17,
      "publication_date": 20180402
    },
    {
      "title": "LED lights for your mouth.",
      "text": "Product shipped very quickly and the product is very easy to use. I also enjoy that it does not make my teeth sensitive like other whitening products. However, after using it for a week I saw no noticeable difference in the whiteness of my teeth even though it advertises you can see a difference after 1 day.",
      "rating": 3.0,
      "verified": true,
      "author": "Matt Hensley",
      "helpful_votes": 39,
      "publication_date": 20171103
    },
    {
      "title": "... whitening strips in the past before and never really enjoyed the experience or saw results",
      "text": "I have tried whitening strips in the past before and never really enjoyed the experience or saw results. I haven’t used aura glow long enough to notice substantial results yet, but the user experience already far exceeds white strips. It’s easy to use, doesn’t get messy, doesn’t make teeth sensitive. It does appear after 2 or 3 uses that my teeth are a bit whiter so I will keep using it for another few days and update my review if anything changes. I would’ve given it more stars but as I said, too soon to tell if the product is effective.",
      "rating": 3.0,
      "verified": true,
      "author": "Zoey Taylor",
      "helpful_votes": 18,
      "publication_date": 20180119
    },
    {
      "title": "Best whitener I’ve tried",
      "text": "I was so worried about using this product as I’ve dealt with major sensitivity from other white strips but these have been so awesome and painless. My teeth are noticeable whiter too!",
      "rating": 5.0,
      "verified": true,
      "author": "Lindsay",
      "helpful_votes": 15,
      "publication_date": 20180628
    },
    {
      "title": "Save your time... just go with the strips.",
      "text": "The mouthpiece wasn’t even close to fitting my teeth. I definitely have a “normal” sized bite, I’m not sure how this would be even close to fitting most people either. I still tried using, and so much saliva was forming, I didn’t know what to do with it. I definitely regret purchasing this and will stick to strips from now on. Also, when the package arrived, the box was scratched/beat up. Definitely not feasible for a $50 product.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 18,
      "publication_date": 20171229
    },
    {
      "title": "Did not work for me.",
      "text": "This did not work for me. I am not saying it won't work for some people. After 14 days I saw virtually no difference between when I began and when I ended. I have had much better luck with Crest White Strips rather than this. This may be because with this you spread a little amount of the whitening gel into the large \"tray\" and put it in your mouth where it gets diluted by saliva. Whereas with Crest White Strips you know you have direct contact between the strips and your teeth.",
      "rating": 1.0,
      "verified": true,
      "author": "Amy",
      "helpful_votes": 12,
      "publication_date": 20190307
    },
    {
      "title": "Cheap Teeth Whiting Product",
      "text": "I used this product for several nights (not in a row but over a few weeks span- due to sensitivity) and I found that the gel made the tips of my teeth hurt, making it unpleasant to use. The mouth guard fit fine and the light works great but I did not see a difference in whiteness and am not very satisfied with the product. I know it is normal to experience sensitivity but this product just didn't work out for me unfortunately.",
      "rating": 2.0,
      "verified": true,
      "author": "thues",
      "helpful_votes": 11,
      "publication_date": 20180924
    },
    {
      "title": "meh......",
      "text": "I thought the whitening would be more instant. Plus I didn't realize how long the process was. It was hard for me to keep the tray in my mouth for a half hour. My jaw honestly was hurting by the time I took out the tray. It does what it should though, because I have now used this product for a month and have been noticing my teeth getting whiter.",
      "rating": 3.0,
      "verified": true,
      "author": "Kjersti Baker",
      "helpful_votes": 11,
      "publication_date": 20181030
    },
    {
      "title": "So far, so good!",
      "text": "I’ve used the whitening kit three times now (30 minutes each time) and I’m very happy with the results so far. My teeth definitely look whiter. I knocked off one star from the rating b/c the tray that stays in the mouth during treatment is a bit large and awkward. I wish it was available in a smaller size.",
      "rating": 4.0,
      "verified": true,
      "author": "Courtney J.",
      "helpful_votes": 12,
      "publication_date": 20180227
    },
    {
      "title": "Not very well designed and not working for me",
      "text": "The mouth tray doesn't press up against my teeth so it's very hard to get the whitening gel on my teeth without pressing hard and using a lot of gel. Holding that for 30 minutes isn't fun. So I've pressed hard, gotten the gel on my teeth and after 3 days there's been absolutely no difference in my teeth. Pretty disappointed in the results.",
      "rating": 1.0,
      "verified": true,
      "author": "Alison B",
      "helpful_votes": 7,
      "publication_date": 20191018
    },
    {
      "title": "Not happy.",
      "text": "I just now opened the box to try this whitening system out. The box was sealed & stated that it included 2 five ml syringes. That was NOT the case! There was only one full syringe. The other one was half full. My window to return it has closed since I waited too long & didn’t inspect it when I received it. My bad. I’ll reconsider before ordering products through this seller in the future & wanted to warn others to check the box can contents immediately after it arrives.",
      "rating": 1.0,
      "verified": true,
      "author": "J. Hartley",
      "helpful_votes": 7,
      "publication_date": 20190401
    },
    {
      "title": "Great Product!",
      "text": "This is a great product. I've used whitestrips on and off for years and I loved the results, but they made my teeth very sensitive. I also felt that they didn't extend far enough back into my mouth and wanted something that would whiten past my first 6 teeth. This product solves both issues. The mouth guard covers farther back and I've had absolutely no tooth sensitivity after using 3 days in a row. I've also already seen a difference in color. Works great!",
      "rating": 5.0,
      "verified": true,
      "author": "Jerry C Maniscalco Jr",
      "helpful_votes": 13,
      "publication_date": 20170724
    },
    {
      "title": "Not worth the hype",
      "text": "Wanted to love this product because the crest whitening strips worked so well but my teeth were too sensitive to them. The auraglow doesn’t have any sensitivity which is great but I’ve used this for a week and saw no difference. During that week I also cut out coffee or anything that would stain my teeth but I saw no significant difference. Wasted $50.",
      "rating": 2.0,
      "verified": true,
      "author": "DCT",
      "helpful_votes": 7,
      "publication_date": 20190323
    },
    {
      "title": "Nothing special.",
      "text": "It does whiten, yes. But nothing superior or amazing compared to other teeth whiteners. The 5 LED thing is just a gimmick. Others are doing the same thing. Auraglow has nothing special or unique here. The thing that truly bothered me is that they included a ‘free whitening pen’ offer in the package. The catch was that you have to write a review. So they are basically tricking people into writing reviews before even using the product. The result is huge numbers of reviews, all good reviews, despite how the product truly performs. I found that very deceptive and disturbing.",
      "rating": 3.0,
      "verified": true,
      "author": "Shopping clubber 1",
      "helpful_votes": 6,
      "publication_date": 20200218
    },
    {
      "title": "I already had a whiting tray",
      "text": "There is no difference between using my whitening tray with this or without. It would be hard for anyone who does not already have a whitening kit to know if the light makes a difference or not. It does not. If you gave this 5 stars, I challenge you to do the same thing for 3 days without the light (take pictures) and see if you can tell.",
      "rating": 3.0,
      "verified": true,
      "author": "Ed Hammond",
      "helpful_votes": 7,
      "publication_date": 20190203
    },
    {
      "title": "works great!",
      "text": "I am new to this product. I have only used it 3 times so far. I was concerned it would affect my gums so I started out 15 mins, then 20 mins then 30 mins. I haven't had any sensitivity! It has whitened some but I'm looking forward to further whitening now that I know I can leave on 30 mins without a problem. I purchased the kit without the light fyi. However, I did just purchase this kit for my daughter with the light. I will review it again after she uses it.",
      "rating": 5.0,
      "verified": true,
      "author": "Lori Garcia",
      "helpful_votes": 6,
      "publication_date": 20180620
    },
    {
      "title": "Product did not work at all",
      "text": "I used it from August 3rd for 10 days. I did not smoke, drink coffee or wine or anything that stain and I did follow all the instructions. I also brushed my teeth after every single time I ate and it did not seem to whiten at all my teeth. I'm very disappointed with the product. Not sure if I had to do it then wothoith the mask for the teeth to get the gel to work directly on my teeth. I really feel like I lost my money.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20200815
    },
    {
      "title": "High reviews no results",
      "text": "The product is easy to use, 2 seringes and plastic mouth guard which includes the illuminated light piece which attaches to the mouth guard. For the first two weeks I injected the recommended amount of whiting inside the mouth piece, inserted into mouth for 30 minutes as instructed. After 2 weeks i did not see any improvement. Subsequently, during the next 2 weeks i applied the whiting directly to my teeth. After 2 weeks i still did not have any changes related to whiter teeth. I thought looking through these reviews and pictures that my chances were good but that wasn't the case. Would not recommend.",
      "rating": 1.0,
      "verified": true,
      "author": "DS",
      "helpful_votes": 5,
      "publication_date": 20191228
    },
    {
      "title": "Burned Gums",
      "text": "I actually love this and I think it works very well. The only downside, and it's a big one, is that it gave me chemical burns on my bottom gums that were extremely painful and took days to heal. I have VERY sensitive teeth and this did not hurt to use at all (other than on my gums). I ended up continuing use by applying the gel directly to my teeth without the tray and using a lip retractor. Next time, I will purchase a whitening pen because, apparently, my gums are more sensitive than I thought.",
      "rating": 3.0,
      "verified": true,
      "author": "Marianne R. Brown",
      "helpful_votes": 2,
      "publication_date": 20200908
    },
    {
      "title": "Light Stopped Working After One Use",
      "text": "I used this product one time, following the instructions. The next time I went to use it, the light doesn't work. It's not the battery, as you can hear it running and it will 'turn off' when the timer is finished... yet there is no light anymore. I bought a brand new battery and swapped it out, just to be sure, and still nothing. Can't comment on how well the teeth whitening works because it stopped working before I could see any results. Such a waste.",
      "rating": 1.0,
      "verified": true,
      "author": "Suzanne Trinkl",
      "helpful_votes": 4,
      "publication_date": 20200926
    },
    {
      "title": "This works exactly as the product says it would, ...",
      "text": "This works exactly as the product says it would, and you can see changes as quickly as after two 30 min uses. It does make your teeth a little sensitive, but that should be expected with any teeth whitening product. The one negative I would say is that the tray is too big for my teeth so the gel gets everywhere. So to get around this, I used my Invisilign retainer to put the gel in and put the light directly on that. For those that don't have Invisilign you might be able to find a tray online or at a pharmacy store that you put in the microwave to mold to the way your teeth are shaped.",
      "rating": 4.0,
      "verified": true,
      "author": "Abby",
      "helpful_votes": 5,
      "publication_date": 20180628
    },
    {
      "title": "No Pain with Gain",
      "text": "I'm using as a comparison Philips Zoom which I have used at home for many years. The AuraGlow device was surprisingly comfortable to wear in comparison to a custom mold that I had made for using Philips Zoom. My custom mold somehow caused an excessive production of saliva in my mouth. AuraGlow did not cause any excessive saliva production. I have not had any tooth pain. While using Zoom I *always* had temporary tooth pain. The downside of AuraGlow so far is that it takes longer for me to achieve the whiteness desired as compared to Philips Zoom. However with no pain and no excessive saliva production, I'm using AuraGlow from now on.",
      "rating": 4.0,
      "verified": true,
      "author": "One Careful Spender",
      "helpful_votes": 2,
      "publication_date": 20200212
    },
    {
      "title": "Tray fell apart after 4 uses...poor quality. AVOID",
      "text": "The whitening seemed to be working, not sure if it will have the actual advertised effects as the tray started falling apart after second use...completely destroyed after fourth use. Look at the pics.. Contacted customer service asking for a replacement and their response was I probably boiled it so it’s my fault...why would I randomly boil the tray? I wouldn’t...and didn’t. Would avoid this product.... and this company.",
      "rating": 1.0,
      "verified": true,
      "author": "Cerebralone",
      "helpful_votes": 4,
      "publication_date": 20190811
    },
    {
      "title": "One use results!!",
      "text": "I'm writing this as I'm doing my 2nd treatment. I cannot believe the results after one use. I smoke and drink coffee but use a lot of whitening toothpaste. So there not bad. Long story short, I started googling best whitening kits and saw this a few times. So I tried it and was shocked. Yes there is sensitivity points. But you deal with it. Some people get it some dont. Yes I drooled. Kinda comes with not swallowing your spit for 30 min. If you cant deal dont order. I am very happy with this so far!",
      "rating": 5.0,
      "verified": true,
      "author": "Whitney Manansala",
      "helpful_votes": 3,
      "publication_date": 20200417
    },
    {
      "title": "This product is a game changer!",
      "text": "While I'm not new to teeth whitening products, this one has grabbed my attention. First I tried the whitening pen and could see a difference in just two days, especially between the teeth! I just received the Home AuraGlow Teeth Whitening Kit and I love it. It's way easier than Crest Strips and most important it reached more teeth. A half hour is easy to manage. I will be a continuing customer. THERE IS NO HELP IN LINKING THIS REVIEW, I'M FEELING LIKE THIS WAS JUST A WAY TO GET A REVIEW. NOT THRILLED.....",
      "rating": 5.0,
      "verified": true,
      "author": "Gail",
      "helpful_votes": 2,
      "publication_date": 20200106
    },
    {
      "title": "Awful product",
      "text": "Awful poorly made product. The light is difficult to attach to the tray, and once in the weight of the light is too heavy to hold it securely in there. Why they don’t just have something that snaps in place I don’t know. I’ve used others that are much much easier and work more dependably.",
      "rating": 1.0,
      "verified": true,
      "author": "YSL",
      "helpful_votes": 68,
      "publication_date": 20180701
    },
    {
      "title": "Update***. The light doesn’t work",
      "text": "Update: 6/10: received new batteries and it still doesn’t work. Soooo frustrating, it’s not like it’s super cheap and for the main component not to work is crap. I just received my whitening kit and I was so excited to use it. Followed the instructions. Started the processes and the light kept beeping after seconds on and turned off. Tried again same thing. The batteries came dead! Ughhhh. Not happy. I’ll update later once I get new batteries on how this really works.",
      "rating": 1.0,
      "verified": true,
      "author": "S. LeBlanc",
      "helpful_votes": 2,
      "publication_date": 20200609
    },
    {
      "title": "It really works!",
      "text": "I saw a difference after just ONE treatment. I like how it beeps and shuts off every 10 minutes. That way it's easy to keep track of the suggested 30 minute total time. It is a learning curve when it comes to pushing out the gel out of the syringe. I probably used too much the first time. Also, when putting the gel into the retainer, place it in the FRONT part of the retainer (and not over the bottom part with the holes). I like this product.",
      "rating": 5.0,
      "verified": true,
      "author": "sanmiguel",
      "helpful_votes": 2,
      "publication_date": 20190916
    },
    {
      "title": "Great, effective, easy to use tooth whitening system.",
      "text": "This whitening system is very easy to use. It was simple to use the trays though I had to figure out to put the bleach on the edge/sidewall not the bottom of the tray for good coverage. The light isn’t blinding and can be used while watching tv etc. It definitely whitens your teeth and well enough that I ordered one for our daughter as well. I don’t like the refill price but it’s fine compared to having it done at a dentists office. I would HIGHLY recommend and buy again. This is actually one of my favorite things!",
      "rating": 5.0,
      "verified": true,
      "author": "Andres Rivera",
      "helpful_votes": 2,
      "publication_date": 20190228
    },
    {
      "title": "Five Stars",
      "text": "System is very easy to use...well designed. Effectiveness is still pending completion of cycle",
      "rating": 5.0,
      "verified": true,
      "author": "pittsburg grandma",
      "helpful_votes": 11,
      "publication_date": 20170901
    },
    {
      "title": "Bought as a XMAS gift. Worked only one time. No good.",
      "text": "I bought one for myself and my GF immediately wanted one, so I got a second for her for XMAS. Mine is still going strong, but I did have to replace the batteries already. But the one I got for her only worked once and then stopped. Would no longer light up and was making a high pitched noise (probably a high freq oscillator of some sort). This one's going back.",
      "rating": 1.0,
      "verified": true,
      "author": "the 1",
      "helpful_votes": 3,
      "publication_date": 20200102
    },
    {
      "title": "DO NOT BUY, LIGHT DOES NOT WORK!!",
      "text": "I bought this and the light wouldn't work. In t he package is a card that says email customer service if the light doesnt work. As if they knew it wouldnt. I contact them they take forever to respond and tell me to try pulling a plastic tab from in between the batteries. There wasnt any. I tried replacing them taking them in and out light just wont work. I emailed them again they just stopped replying came back to amazon and its now past the return date so I just wasted 30 something bucks for nothing... dont buy!",
      "rating": 1.0,
      "verified": true,
      "author": "Heather Scott",
      "helpful_votes": 2,
      "publication_date": 20200208
    },
    {
      "title": "Awesomeness!!🤗🤗⚡💥",
      "text": "Dude this is great. And fyi i got it never saw i had to write a great review. I took heed and i applied it with a Q-tip directly on my teeth. First i did get the cotton part wet And then squished it so the cotton wasn't all over. But ya directly on my teeth, then Bam💥 i put the mouth piece over. No sensitive gum vibe either. The one thing is you might drool bahaha! And another perspective, if you got kids you got an excuse not to talk to them when your doing your\"You time\". Which every parent deserves and should make a point to do. 🤗😁😉✌💜✨",
      "rating": 5.0,
      "verified": true,
      "author": "Brittany Guffy",
      "helpful_votes": 2,
      "publication_date": 20200815
    },
    {
      "title": "Extremely noticeable difference after the first use",
      "text": "I have always been somewhat skeptical of teeth whitening products and most of that has been due to dentist’s forms where you respond that you would like teeth whitening to be done and they ignore it all together. At a recommendation from a friend, I decided to take matters in my own hands and ordered the Home Dekuxe kit from AuraGlow. I was amazed and impressed how this product worked after the very first application. I am now on the fourthday and am exceedingly happy about the results. What I thought would be a lifetime of yellowish teeth has now been turned around with a product that does work. I am recommending it to all my friends.",
      "rating": 5.0,
      "verified": true,
      "author": "GRK_Astronomer",
      "helpful_votes": 0,
      "publication_date": 20200504
    },
    {
      "title": "Beware ! Gag and fitment !",
      "text": "Can’t use it ! If you have any gag reflex what so ever , not going to happen. Wish they would’ve stayed that on the box or directions as a warning. $50 down the drain. If your saliva makes the paste wet and gets down to your gums , fair warning , it’ll burn. The product requires 30 minutes. I couldn’t go longer than 2 minutes. The device somewhat restricts your tongue and doesn’t fit well so you need to push it back in against your teeth. What a waste.",
      "rating": 1.0,
      "verified": true,
      "author": "AC83",
      "helpful_votes": 2,
      "publication_date": 20200512
    },
    {
      "title": "it's a big no for me, returning after first use",
      "text": "I just used this once and it's going right back. I had the issue I see other reviewers have had where saliva rinses the gel away. The first application I put the gel in the tray as per the instructions and within a couple of minutes my saliva had rinsed the gel completely away. I tried again and put the gel directly on to my teeth but the tray does not sit close enough to your teeth to hold the gel next to them. I am going to get my money back from this and buy something with a closer fitting tray.",
      "rating": 1.0,
      "verified": true,
      "author": "jent",
      "helpful_votes": 2,
      "publication_date": 20191231
    },
    {
      "title": "Light wouldn't turn on",
      "text": "Don't bother. Followed instructions provided by manufacturer, set up tray, filled it, light wouldn't turn on. Contacted AuraGlow and they told me that the light sometimes needs a flat pen to push the button in to make it work. Tried that (holding for 2-3 seconds as they recommended), still didn't work. Now I have to package and send back, what basically amounts to garbage. Frustrating. They included a card that specifically mentions that the light might not work. Why ship a product that has an obvious history of a manufacturing defect?",
      "rating": 1.0,
      "verified": true,
      "author": "HW",
      "helpful_votes": 3,
      "publication_date": 20200120
    },
    {
      "title": "like a tire in your mouth",
      "text": "The gel flies out of the dispenser, thus is all gone in a few uses. can't control it when you push gently on the end it just flies out. Since the rubber tray isn't molded to YOUR teeth, it is impossible to have it evenly come in contact with all teeth.Thus some of the gel touches, some doesn't. And forget holding it in your mouth for 30 mins. Hurts biting down, mouth full of saliva running out and can't swallow for half hour. Buy some strips. This is another China joke!",
      "rating": 1.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 3,
      "publication_date": 20190517
    },
    {
      "title": "Doesn't whiten your teeth evenly",
      "text": "I haven't had problems that other reviews have had with my gums or anything, but the issue is that it only whitens my front 4 teeth. The tray that the gel goes in is so big and is not molded to your mouth that it doesn't keep the gel on any teeth except the very front ones, so now they're white and the further back are still yellow. Would not recommend!",
      "rating": 1.0,
      "verified": true,
      "author": "llamaphunk",
      "helpful_votes": 2,
      "publication_date": 20200909
    },
    {
      "title": "Stripped the Tooth Enamel = Gave Me Cavities",
      "text": "I don't know if the product was old, or just too strong, but it caused the enamel to wear away at the base of two teeth (ie. Gave me Cavities.) It was visible the day after the whitening, a light brown spot at the gumline of a tooth that wasn't there the day before. I even checked my \"before\" picture to check. I had to have these shallow cavities/weak spots repaired by the dentist, which wasn't free. Go for another brand, and check the use-by date. I don't know why this happened, but I hope it doesn't happen to you.",
      "rating": 1.0,
      "verified": true,
      "author": "AstorDragon",
      "helpful_votes": 5,
      "publication_date": 20180118
    },
    {
      "title": "daaaaannnggg !!!",
      "text": "Really, really nice quality! I paid extra for these and you know what? It is worth it. This works very, very well. 3 uses and my teeth were definitely looking better. I noticed a difference after using twice, but the third time kicked it up another level. Definitely will purchase again when I need more :) I still have over half left and I've done some good whitening up to now. Downsides: using this sucks. I really don't like it, 30 minutes feels like forever to be doing this. BUT, as stated above, worth it, but it isn't at all an enjoyable experience! :)",
      "rating": 5.0,
      "verified": true,
      "author": "Anita Kay",
      "helpful_votes": 0,
      "publication_date": 20200813
    },
    {
      "title": "Works great!!",
      "text": "This works great for whitening your teeth at home!! It’s such a better alternative to going and getting your teeth whitened. The kit comes with everything you need to whiten your teeth yourself. The timer on the light makes it simple to know how long it takes. And there’s plenty of whitening gel!! It’s lasted me a month already.",
      "rating": 5.0,
      "verified": true,
      "author": "Veronica Marie",
      "helpful_votes": 2,
      "publication_date": 20181122
    },
    {
      "title": "Consumers Really Need To Read and Follow Instructions",
      "text": "Currently on the first week of using this awesome product and already seeing results. Was a little hesitant to purchase this product because of some of the reviews, but after carefully reading and following the manufactures instructions, I found it simple to use and it works great. It is very unfortunate that a good product like this gets negative reviews because some people can't read and follow simple instructions. Each Syringe is FIVE milliliters and you use ONE-HALF milliliter per treatment. That gives you TEN treatments per syringe and a total of TWENTY treatments for the TWO syringes included with the kit.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20191030
    },
    {
      "title": "Not so much",
      "text": "I have to say that working at a dental office and knowledge of teeth whitening gels that this product is subpar. At first there was a little gel consistency when applying to trays but over time it was like squirting water into the trays :-( It filled my mouth with foamy spit and awful peroxide. The trays themselves are hard and not for small adult teeth or small mouth, glad I had my custom trays. I didn't really see a difference.",
      "rating": 2.0,
      "verified": true,
      "author": "Mrs Lyons",
      "helpful_votes": 2,
      "publication_date": 20200606
    },
    {
      "title": "It works! But..",
      "text": "I love this. It works so well! My teeth were yellow from coffee and years of stains. My teeth became a shade of white in only a few days! I noticed the difference after day 1! However, it’s hard not to swallow. Your saliva builds up in your mouth. Every time I swallowed, I could feel a little of the gel going down my throat. The treatment takes 30 minutes, and I could only make it 20 minutes without having to take it out and spit my saliva and put it back in my mouth. That affected the degree of my whitening. Other than that, I like it! It has a self timer so you don’t need to set one!",
      "rating": 4.0,
      "verified": true,
      "author": "Samantha",
      "helpful_votes": 0,
      "publication_date": 20201007
    },
    {
      "title": "nada",
      "text": "been using for a while now and had seen no change",
      "rating": 1.0,
      "verified": true,
      "author": "Ero",
      "helpful_votes": 74,
      "publication_date": 20180116
    },
    {
      "title": "Wow, my teeth are getting whiter!",
      "text": "I've always struggled with less than white teeth. I had my doubts that the AuraGlow process would actually work on my teeth. After the first treatment I was encouraged that maybe, just maybe, I'd found something that worked at a reasonable cost. I've been using the system for a week now and my teeth honestly are whiter and brighter!",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara Ross",
      "helpful_votes": 4,
      "publication_date": 20171109
    },
    {
      "title": "After just two sessions! Amazing!",
      "text": "I didn’t even realize my teeth weren’t white till my mom (of course!) said something... I’ve never whitened my teeth before and they aren’t sensitive, so I read a few reviews, read all the instructions and I applied the gel directly to my teeth (without the mouth guard piece), and here are the results after just TWO 30-min sessions!!! (Pics were taken same time of day, same room, same lighting). I’m totally stunned!! (First pic was taken w the gel already on the the teeth.) Amazing!!!",
      "rating": 5.0,
      "verified": true,
      "author": "boko",
      "helpful_votes": 2,
      "publication_date": 20200830
    },
    {
      "title": "Does NOT work",
      "text": "I tried this teeth whitening system exactly to the instructions for 2 weeks and it did not whiten my teeth one shade. My friend who purchased at the same time did not experience his teeth change shades either. How in the world can you sell this product and it not even make one slight difference in the whiteness of your teeth? Garbage. And I can't even get a refund back because it's past 30 days which the seller told me to wait at least 30 days to see if a change in teeth whiteness. Guess I'm buying Crest 3D White Strips now.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20190327
    },
    {
      "title": "Very impressive",
      "text": "I’m was skeptical, but this absolutely worked. I’m a cigar smoker who drinks coffee a couple times a day. In my late 30s, I’ve noticed my teeth have turn stightly yellow. This has turned my teeth white again after only four uses. Would recommend applying the gel directly to the teeth rather than the mouthpiece. Seemed to getter better results that way.",
      "rating": 5.0,
      "verified": true,
      "author": "mike ",
      "helpful_votes": 2,
      "publication_date": 20190302
    },
    {
      "title": "Very disappointed, light malfunctioned after 1 use",
      "text": "I'm extremely disappointed with this product. I had high hopes since there were so many good reviews but after just one use last night, the LED light doesn't stay on anymore. The device makes a sound and the light will blink once, but will shut off immediately and won't light up again. I'm upset that I spent $50 on something that didn't work for more than a day.",
      "rating": 1.0,
      "verified": true,
      "author": "Emily G",
      "helpful_votes": 2,
      "publication_date": 20200918
    },
    {
      "title": "Meh",
      "text": "I am not sure it is worth buying the whole kit for. It did lighten my teeth but the mouth piece is awkward and makes you drool terribly. So that was ditched. The light is nothing more than a blue LED which does nothing so that is garbage. I ended up using a custom mouth piece I had made specifically for whitening years ago and put the whitening gel in that. To me it doesn't really work any better or worse than anything else. I would buy just the syringes of gel and nothing else.",
      "rating": 3.0,
      "verified": true,
      "author": "Tina Thompson",
      "helpful_votes": 0,
      "publication_date": 20190520
    },
    {
      "title": "Super impressed!",
      "text": "TLDR; buy it. It works. I paid 10 times the price of this kit for whitening at my dentist office and take home custom made trays. Since then I moved and haven’t found a new dentist yet. My teeth had gradually started looking yellow so I gave this a try. It works every bit as well as the overpriced stuff from my dentist!! I actually think it works better because I’m seeing results after just a couple of treatments. Note- people showing pictures of inflamed gums need to not overfill the trays. You only need very little bleach. Any type of bleach in contact with your gum will cause that reaction.",
      "rating": 5.0,
      "verified": true,
      "author": "Logan",
      "helpful_votes": 0,
      "publication_date": 20201004
    },
    {
      "title": "White splotches",
      "text": "Had to stop using this cause it wasn't really whitening my teeth fully. I just had white splotches all over the front of my teeth. This may be more for people whose teeth aren't too bad to begin with. Also with the mouth gaurd I felt like I was choking. And I felt like the application wasn't really getting everywhere. I didn't really taste any flavoring. All in all I'm just really disappointed in this product",
      "rating": 1.0,
      "verified": true,
      "author": "Hannah Figueroa",
      "helpful_votes": 0,
      "publication_date": 20201019
    },
    {
      "title": "works as advertised, excellent product service",
      "text": "The first item arrived and was DoA out of the box. Wrote to the seller on Amazon and they immediately issued a replacement. The second arrived a few days later and works as advertised. Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20200927
    },
    {
      "title": "I'm very happy and impressed!",
      "text": "I'm 56 years old and I re-started to drink coffee last winter. My teeth became yellow that I've almost stopped smiling. I just made the first treatment with the gel and I see good results!! I'm sure that when I'll be done, my teeth are going to be white. It's easy to use and showing results after one try. I sincerely recommend this product because my teeth don't hurt at all. I used stripes 8 years ago and my teeth hurt a lot. Give this product a try if you have teeth sensitivity, it's gentle and you won't have any bad taste in the mouth.",
      "rating": 5.0,
      "verified": true,
      "author": "koodoo",
      "helpful_votes": 0,
      "publication_date": 20191223
    },
    {
      "title": "Super easy to use!",
      "text": "I love this whitening system! It’s so easy to use. It works wonderfully! I love the fact that the whitening gel has markings to let you know how much gel to insert in your trays. Ones I’ve used in the past seep out the sides with excess and end up blistering my gums if I’m not careful. AuraGlow’s product doesn’t do that. The timer counts down in ten minute intervals making it easy to track your time.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa Eagen",
      "helpful_votes": 0,
      "publication_date": 20201003
    },
    {
      "title": "Great for sensitive teeth",
      "text": "I’ve tried several other teeth whitening systems and my teeth were too sensitive for all of them. I read some of the reviews for AuraGlow about how people did not have a sensitivity issue, so I decided to give it a try, and it worked fantastic for me. My teeth were stained pretty bad from 50 years of coffee and tea, but after one tube of the AuraGlow (10 treatments), I’m already six shades whiter, with no sensitivity after the treatments. And while my teeth aren’t pearly white again, I’m no longer embarrassed about my smile. I’m excited to see how much whiter I can get my teeth on the next round of treatments.",
      "rating": 5.0,
      "verified": true,
      "author": "Ben Pumpiner",
      "helpful_votes": 0,
      "publication_date": 20200705
    },
    {
      "title": "Pray!",
      "text": "Hopefully this works I’m tired of looking at my girlfriends ugly ass teeth",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Swartz",
      "helpful_votes": 5,
      "publication_date": 20181212
    },
    {
      "title": "The inserts are very large and uncomfortable greatly diluting the gel.",
      "text": "I am torn as to how many stars this product deserves. The whitening gel DOES work well, but the trays are really large. They are uncomfortable, do not make contact with my teeth and fill up with saliva, diluting the whitening gel. I wish there were size options for the trays. This gel would be much more effective if it actually touched the teeth. I am using some old trays with much better results. I can still use the light by biting down on the piece that attached to the original tray.",
      "rating": 3.0,
      "verified": true,
      "author": "Sammy K.",
      "helpful_votes": 0,
      "publication_date": 20190317
    },
    {
      "title": "Did not whiten my teeth",
      "text": "After 2 months, my teeth are no whiter than when I started. I'm frankly exhausted from doing this every night with no results. I tried for 10 days with no results so I stopped for a few and started another 10 days and then another, and then another. I'm actually still trying. I'm going to keep trying until I'm out of the product but I doubt there will be any difference by the time I'm finished with it. I'm very disappointed. I've whitened my teeth in the past and developed some sensitivity but at least I got results.",
      "rating": 1.0,
      "verified": true,
      "author": "Christine",
      "helpful_votes": 2,
      "publication_date": 20200611
    },
    {
      "title": "It's okay...",
      "text": "I did a bit of research on teeth whitening products and came across this one with great video tutorials and reviews and a lot of them show great results even from just one try. Today i'm currently on my fourth try and I see a bare difference, close to none...I'm a little disappointed but nonetheless I will keep trying it out just in hopes for a better difference. It is super easy application and use , just wished it was as good as reviews had it online...",
      "rating": 3.0,
      "verified": true,
      "author": "Wendy Chen",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "Great product!",
      "text": "Really easy to use and you will see changes within the first application. The mouthpiece is a little odd, but once you manage to use it properly (it took me 3 applications), it will work smoothly. The UV light last 10 minutes per application, therefore, the instructions says 30 minutes so you will have to do run it 3 times per official application. No bad flavor, no aftertaste and no discomfort nor sensitivity after the application or the day after! Which is amazing how it works! I can't wait to get another round of the whitening gel in order to use it less often. Great product! Highly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "Yasser Marcos",
      "helpful_votes": 0,
      "publication_date": 20200602
    },
    {
      "title": "Overall great!",
      "text": "Pros- Easy to use - I could see a difference after 2nd use - did not hurt my sensitive teeth, I used 10 days in a row - easy to clean - well designed - the mouth guard blocks the not so great taste. Cons - was not as effective on edges of teeth/between teeth. I can see different shades when teeth touch each other. However I dont think the naked I could tell, I have to be up close in a mirror to see. I will purchase again. I am hoping they will make a mouth plate the fits the backside of teeth as they are translucent and I feel it would be wayyyy more effective.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Consumer",
      "helpful_votes": 0,
      "publication_date": 20200612
    },
    {
      "title": "I initially thought it was easy and effective...",
      "text": "Original review -- I was wary about home whitening kits, but the reviews were so good that I decided to invest in this instead of paying a ridiculous amount of money to my dentist. And it is working! I'll post pix when I finish the 10-day cycle. Revised review -- However, less than a week later, the lights quit working. It's not the battery because it still beeps. Oh well. I've contacted the seller and hope they will rectify the situation so I can post a positive review again.",
      "rating": 1.0,
      "verified": true,
      "author": "Leah Totten",
      "helpful_votes": 3,
      "publication_date": 20190320
    },
    {
      "title": "Not for sensitive teeth",
      "text": "I must have sensitive teeth I guess because this caused we to be super temperature sensitive for days after and caused welts on my gums. I just threw it away after trying for a shorter time a second time and caused the same thing. If there’s any chance you have sensitive teeth don’t get this. Not worth the risk. Didn’t notice any whitening difference from those two uses either but I wasnt expecting it to that quickly.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200418
    },
    {
      "title": "One tube turned from a gel to a liquid in a month!",
      "text": "Expensive, will update if it works. Only half the gel is useable! I waited a few weeks to use and noticed that one gel syringe turned to liquid, rendering it no good. Also, the mouth tray filled with the right amount of gel does not feel like it is touching my teeth. The tray feels very large. I will update, but so far I am not entirely happy.",
      "rating": 2.0,
      "verified": true,
      "author": "Kathy and Vince",
      "helpful_votes": 0,
      "publication_date": 20200323
    },
    {
      "title": "Really uncomfortable, no noticeable results.",
      "text": "I've used this 5 times now, and haven't seen anything noticeable. The mold doesn't fit to your teeth, and as a result is really ill-fitting and I never got the idea that the gel was applied to my teeth in a consistent way. At least with the ones that have fitted molds you know that the gel is forced against your teeth. Waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "Alanna Hill",
      "helpful_votes": 6,
      "publication_date": 20180806
    },
    {
      "title": "Barely any difference.",
      "text": "I used this product for 30 min a day exactly as instructed. It hardly made any difference. About 1/2 a shade whiter, and no one would notice. It was uncomfortable to use, messy. It rubs on the gums and hurts. Total waist of money and effort.",
      "rating": 1.0,
      "verified": true,
      "author": "b.rae",
      "helpful_votes": 2,
      "publication_date": 20200420
    },
    {
      "title": "Not the best for sensitive teeth",
      "text": "It’s definitely easy to use and easy cleanup also. The taste of the gel is kind of nasty so as soon as you take the tray out rinse quick to remove leftover gel. As a person with sensitive teeth all my life, this product definitely hurts if used for the full 30 mins as directed. I’m on day 2 and my teeth are achey. I recommend doing less at a time instead. I’ll be honest, Crest white strips for sensitive teeth with the LED light do not cause me any pain at all. The whitening power may not be the same but I’ll take that over pain.",
      "rating": 3.0,
      "verified": true,
      "author": "Anna Sposito",
      "helpful_votes": 0,
      "publication_date": 20201004
    },
    {
      "title": "It Does Work...",
      "text": "Totally works as far as whitening, took about 7 days to see results. My only complaint is the mouth piece - I had to buy a replacement because the one that came with the kit would not turn off randomly one day after a couple months of use and had a long beeping noise. I tried taking the batteries out and switching them and putting them back in but nothing works. I had to buy another one less than a month ago again and now that one did the same thing. So I've gone thru 3 mouth pieces in less than 4 months",
      "rating": 4.0,
      "verified": true,
      "author": "audean",
      "helpful_votes": 2,
      "publication_date": 20200713
    },
    {
      "title": "Easy to Use, Great Results!",
      "text": "I'm getting marries next January and my fiance and I thought we should begin to brighten up our smiles. I found this product on Amazon and thought it looked like it might work for our needs. It does! I have a tendency t o get tooth sensitivity with the strips but I have felt no sensitivity with this product and I started to notice a difference in my smile after the 2nd use. I'm getting lots of compliments on my smile lately and I'm sure it's because my teeth are so bright. I love this product!",
      "rating": 5.0,
      "verified": true,
      "author": "kelley jo stallings",
      "helpful_votes": 0,
      "publication_date": 20190214
    },
    {
      "title": "No pain, lots of gain. Impressive results after only a week.",
      "text": "I love this kit. I've been using it for a little under a week. Being a past smoker and a lover of coffee I have used almost every at home product on the market. Always with lots of pain and sensitivity thaI lasted days or sometimes weeks. This product has markedly whitened my teeth with no pain at all. Less than a week and my teeth are the whitest they have ever been.. And with the cost being almost the same as a box of whitening strips, I would definitely recommend this. Already worth every penny. Teeth are the first thing people see.",
      "rating": 5.0,
      "verified": true,
      "author": "warf_rat",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "Did not do anything",
      "text": "Used as directed for 11 days - no difference seen.",
      "rating": 1.0,
      "verified": true,
      "author": "SD00001",
      "helpful_votes": 7,
      "publication_date": 20181127
    },
    {
      "title": "It worked",
      "text": "I'm five days in and it definitely works. I'm only using it for 15-20 minutes at a time but it has worked well enough that I'm not going to us the second tube of whitening gel yet. There are a couple of steps in the process: putting the gel in the mouth tray and attaching the tray to the light, but neither is particularly complicated. I like it better than the strips and have not found any increased sensitivity.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Ranallo",
      "helpful_votes": 0,
      "publication_date": 20200609
    },
    {
      "title": "What a let down :-(",
      "text": "Complete let down. I bought this for my husband as he has been on a kick lately to whiten his teeth and as you can see from the photo above, there is zero results. Not sure if these positive reviews are real or if they’re being rewarded to write them; but this didn’t work for my husband at all. He followed directions and used both syringes and at the end of it all, his teeth are the same.",
      "rating": 1.0,
      "verified": true,
      "author": "Leah",
      "helpful_votes": 2,
      "publication_date": 20190228
    },
    {
      "title": "Too expensive and other products do the same job",
      "text": "This product is misleading - I was suckered into this by the ratings. I should have know better than to fall for the 'light whitening' category of products here. I am not sure how a standard white LED is to 'cure' or 'activate' any gel - you need UV light to do this! What was I thinking? These LEDs do NOT distribute Ultra Violet light. This product works no better than the 5 min gel I get at CVS - so back to CVS for me. Consider going to dentist if you truly want instant whitening with UV light.",
      "rating": 2.0,
      "verified": true,
      "author": "David A. Brown",
      "helpful_votes": 0,
      "publication_date": 20201007
    },
    {
      "title": "Great service",
      "text": "Revised 08/10/2018- Manufacturer contact me and is sending out a new kit with a moldable mouthpiece. I'll continue to update once the new kit is received. The one size fits all mouth tray is too large for my mouth. Had to return to Amazon for a refund. I’m now shopping for a mouth tray that’s moldable. I wish AuraGlow had the option of a moldable tray.",
      "rating": 1.0,
      "verified": true,
      "author": "GLX",
      "helpful_votes": 52,
      "publication_date": 20180807
    }
  ],
  "product_meta": {
    "title": "AuraGlow Teeth Whitening Kit, LED Light, 35% Carbamide Peroxide, (2) 5ml Gel Syringes, Tray and Case",
    "rating": 4.4,
    "feature_bullets": [
      "Teeth whitening kit includes accelerator light that speeds up the whitening process. LED light contains 5 bulbs for more power and has a built-in timer with beeper so you can easily keep track of your whitening session time.",
      "Kit includes (2) 5mL teeth whitening gel syringes, containing 35% carbamide peroxide and a total of 20+ whitening treatments. Gel is made in USA, gluten-free, kosher, safe for enamel and produces no tooth sensitivity.",
      "Mouth tray requires no molding or boiling, which means tray fits any mouth and allows you to whiten the top and bottom teeth at the same time comfortably.",
      "Use once a day for 30 minutes and remove stains from coffee, wine, soda, tea, smoking and more. See visible results and whiter teeth after just 1 teeth whitening treatment with this kit.",
      "Kit includes a tray case for storing the mouth tray and detailed instructions for proper use"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "6.4 x 6.8 x 1.8 inches; 5.6 Ounces",
      "Batteries": "2 Product Specific batteries required.",
      "Date First Available": "June 3, 2015",
      "Manufacturer": "AuraGlow",
      "ASIN": "B00YI5VJW6",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Oral Care",
      "Whitening Kits",
      "Beauty & Personal Care",
      "Health, Household & Baby Care",
      "Teeth Whitening"
    ],
    "price": 48.95
  }
}