{
  "website_summaries": [
    {
      "verdict": "Handsome and rugged stainless-steel chronograph. Water resistant at 100 meters (330 feet).",
      "pros": [
        "Features a chronograph, tachymeter, date, hour, minute, second",
        "Scratch-resistant sapphire dial",
        "Dressy yet robust stainless steel bracelet",
        "Distinctive and easy to read blue face with bright luminescence"
      ],
      "cons": [
        "42mm may seem small for this sort of watch"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "BEWARE FAKE WATCH!!!",
      "text": "I ordered this watch thinking it was an authentic Tissot quickster but saddly what I recived wasn't what I expected. As you can see on the pictures above, the dial is different from the original watch (the little rectangles on the hours aren't completely white) plus the box and every other accessory is feels cheap the packaging is nothing like the one you would get when buying an authentic Tissot quickster and the seral number doesn't match! This watch is obviously FAKE! DON'T BUY IT! I'm at the moment waiting for an answer to my refund request...",
      "rating": 1.0,
      "verified": true,
      "author": "André Neves",
      "helpful_votes": 17,
      "publication_date": 20190116
    },
    {
      "title": "Looks might be deceiving...",
      "text": "I love the looks of the watch and its weight gives a quality feel. But the watch started losing time almost immediately after I got it. When I saw other reviews on this forum as well as other internet forums showing lots of other people with similar problems, I decided to return it and get out while the gettin was good.",
      "rating": 2.0,
      "verified": true,
      "author": "scooby",
      "helpful_votes": 11,
      "publication_date": 20180629
    },
    {
      "title": "Super satisfied with this watch",
      "text": "Superb watch! Arrived in original, unopened packaging. Watch was completely protected with plastic film, it even covered the band and clasp. Solid links in band, had to remove two to fit it to my wrist. Seems 100% authentic. It is a little bigger and heavier than I thought it would be, but I am super satisfied with this watch.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Customer",
      "helpful_votes": 8,
      "publication_date": 20170304
    },
    {
      "title": "Its authentic or not?",
      "text": "I'm not 100% sure that it's an authentic Tissot Quickster (This one is from WatchSavings). The authentic one has an ETA G10.211 movement and this one has and ETA G10.212 movement similar to the Tissot V8 model that makes the cronometer go faster for the first minute. Someone with the same problem?",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 8,
      "publication_date": 20180228
    },
    {
      "title": "many complements about thiswatch. I wear this",
      "text": "Stylish , many complements about this watch . I wear this watch as a casual one as i rotate with my other chronograph watches. However with this one I prefer using when im flying my plane as the dials are easy to read when doing time turns and fuel tank switching and speed measurements.. Can't go wrong.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20160927
    },
    {
      "title": "Great watch",
      "text": "Had this watch for 7 months now and its a great watch. Like the large face that's clear and easy to read the time. The date is very small and difficult to read if you need glasses, would have been nice if there was a small magnify glass built in. The stop watch hands, when using do not always return back to zero, easy to correct but annoying. The watch is slightly thick, could have been thinner. Overall a great watch.",
      "rating": 4.0,
      "verified": true,
      "author": "Tambotie",
      "helpful_votes": 0,
      "publication_date": 20190125
    },
    {
      "title": "Good watch for both everyday casual and formal setting",
      "text": "The metal band has a perfect shine, not too flashy. A good everyday watch with a blue colored dial that matches well with both casual and dressed outfits. I liked it.",
      "rating": 5.0,
      "verified": true,
      "author": "Winshen Wu",
      "helpful_votes": 5,
      "publication_date": 20160414
    },
    {
      "title": "The watch is classy and nice with a quartz movement",
      "text": "The watch is classy and nice with a quartz movement. I have still to see the cells light up in the dark, but overall the watch feels nice, not to big not to small at 42 mm and sapphire crystal. Time is a little tough to read and take some getting used to. The chronograph flows nicely when activated and hands return to 12 o'clock position smoothly. This is a nice watch for the price.",
      "rating": 4.0,
      "verified": true,
      "author": "Luis Villeda",
      "helpful_votes": 2,
      "publication_date": 20180428
    },
    {
      "title": "Need instructions for my watch.",
      "text": "I dont like the fact that it has no instructions as to how to set it up to start working..right now i have a watch that is not working.",
      "rating": 5.0,
      "verified": true,
      "author": "Randall",
      "helpful_votes": 0,
      "publication_date": 20190626
    },
    {
      "title": "Excellent gift!",
      "text": "The watch arrived before the expected time. It is exactly as it appears in the picture, nice color and beautiful package. It was a gift for my boyfriend and he loved it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170108
    },
    {
      "title": "It looks even better in person",
      "text": "Showed up on time and advertised. It looks even better in person.",
      "rating": 5.0,
      "verified": true,
      "author": "Bill Monachino",
      "helpful_votes": 0,
      "publication_date": 20180507
    },
    {
      "title": "Quality and delivery are excellant",
      "text": "It is really fantastic and looks same as published and has been delivered in a very good pack. I got two even at different prices!",
      "rating": 5.0,
      "verified": true,
      "author": "Mohamed",
      "helpful_votes": 0,
      "publication_date": 20161220
    },
    {
      "title": "Five Stars",
      "text": "That's a good thing lots of fanction good name brand from many years ago",
      "rating": 5.0,
      "verified": true,
      "author": "abraham orfali",
      "helpful_votes": 0,
      "publication_date": 20180528
    },
    {
      "title": "Great service",
      "text": "Very quick shipping. Great price on an awesome watch. Will buy again soon.",
      "rating": 5.0,
      "verified": true,
      "author": "Jose Olmeda",
      "helpful_votes": 0,
      "publication_date": 20170608
    },
    {
      "title": "Worthless",
      "text": "The dial broke about 4 months after purchase. 10 months after purchase it altogether stopped ticking. Total waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "Edward B Pelkey",
      "helpful_votes": 0,
      "publication_date": 20200226
    },
    {
      "title": "Very good purchase and fast shipment",
      "text": "Watch arrived within 3 days of placing the order which was a nice surprise. Very gracious watch and suits well with business casual outfits. 42 mm dial sits well and doesn't seem big or out of proportion.",
      "rating": 5.0,
      "verified": true,
      "author": "Alex Kr ",
      "helpful_votes": 0,
      "publication_date": 20161226
    },
    {
      "title": "N/A",
      "text": "I hope it's not fake because watches don't come in with plástico rap",
      "rating": 5.0,
      "verified": true,
      "author": "Andres Angulo",
      "helpful_votes": 0,
      "publication_date": 20200822
    },
    {
      "title": "I purchased this watch and it ran well for 6 ...",
      "text": "I purchased this watch and it ran well for 6 months. It started losing time, a few minutes every day, so I sent it back via the Asurian warranty. Received the watch back after about 3 weeks. It worked for about 2 weeks, then lost 15 minutes a day. Asurian has it again. What a pain for a $300 watch.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170209
    },
    {
      "title": "Looks so very pretty, my husband is tall and it suits his ...",
      "text": "Looks so very pretty, my husband is tall and it suits his long hands. The dial is really dark deep blue, almost black blue.",
      "rating": 4.0,
      "verified": false,
      "author": "MS",
      "helpful_votes": 0,
      "publication_date": 20170519
    }
  ],
  "product_meta": {
    "title": "Tissot Men's T0954171104700 Quickster Blue Watch",
    "description": "The Tissot Quickster has been brought back into the sports collection combining sports and modernity whilst keeping a timeless design offering style, practicality and Swiss reliability.\n\n\n\n\nPRODUCT DETAILS\n * Is Discontinued By Manufacturer :No\n * Product Dimensions :3.94 x 3.94 x 5.91 inches; 5.08 Ounces\n * Item model number :T0954171104700\n * Department :Men\n * Batteries :1 C batteries required. (included)\n * Date First Available :July 15, 2015\n * Manufacturer :Tissot\n * ASIN :B00Y2BQ2WI\n\n * .zg_hrsr_item {list-style : none};\n * Amazon Best Sellers Rank: #1,098,425 in Clothing, Shoes & Jewelry (See Top 100 in Clothing, Shoes & Jewelry)  *  #8969 inMen's Wrist Watches \n    *  #375466 inMen's Shops \n   \n   \n\n * Customer Reviews:4.0 out of 5 stars78 ratings\n\nWARNING:\nCHOKING HAZARD -- Small parts. Not for children under 3 yrs. The Tissot Quickster has been brought back into the sports collection combining sports and modernity whilst keeping a timeless design offering style, practicality and Swiss reliability.",
    "rating": 4,
    "feature_bullets": [
      "Imported",
      "Case Size: 42.00 mm, Band Width: 19 mm, Case Thickness: 10.72 mm",
      "Swiss quartz movement, 316L stainless steel case, Index + Arabic dial type, Date",
      "Stainless steel bracelet, folding clasp with safety closure",
      "Water-resistant up to a pressure of 10 bar (100 m / 330 ft): suitable for short periods of recreational swimming and showering, but no diving or snorkeling."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "3.94 x 3.94 x 5.91 inches; 5.08 Ounces",
      "Item model number": "T0954171104700",
      "Department": "Men",
      "Batteries": "1 C batteries required. (included)",
      "Date First Available": "July 15, 2015",
      "Manufacturer": "Tissot",
      "ASIN": "B00Y2BQ2WI"
    },
    "categories": [
      "Wrist Watches",
      "Men",
      "Watches",
      "Clothing, Shoes & Jewelry"
    ],
    "price": 307.99
  }
}