{
  "website_summaries": [
    {
      "verdict": "A responsive Android-based 2-in-1 netbook that hits all the basic buttons yet comes in at a rock-bottom retail price.",
      "pros": [
        "Handles lighter multitasking well, and interfaces seamlessly with online Google applications",
        "Android Lollipop operating system runs smoothly",
        "Tolerates drops and regular wear and tear",
        "10.1-inch screen is adequate"
      ],
      "cons": [
        "System can lag after being idle for several minutes",
        "Input from keyboard can be frustratingly slow",
        "Heavier than expected for a tablet-keyboard combo",
        "Feels a bit flimsy"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "I don't think you can do any better.",
      "text": "I use this with a bluetooth mouse for taking notes in class and doing homework at home so I can get away from my desktop which I use for creative work. This is literally faster than the laptops provided at my college's computer lab. For the price, I don't think you can do any better.",
      "rating": 5.0,
      "verified": true,
      "author": "Mario Castellanos",
      "helpful_votes": 24,
      "publication_date": 20170214
    },
    {
      "title": "Love the camera & the tablet with keyboard",
      "text": "It seems to be a great tablet, I had the 7 inch, it sill works too, but I thought it would be nice to have the back camera function too & more memory. I didnt remember how to tell it to store my office documents on the SD memory chip, but I copied the Lost Directory to the new SD & now both have all my files. I downloaded some great scientific calculators on it & tell stories on the SD memory chip & I take a lot of pictures too.",
      "rating": 5.0,
      "verified": true,
      "author": "Lee G",
      "helpful_votes": 15,
      "publication_date": 20171110
    },
    {
      "title": "broke broke broke",
      "text": "Charger fell apart in my hand they had glued it. Power button came loose. Wouldnt hold a charge. Used it twice before stuff started falling apart.Rotate screen took forever to rotate. Sent back. Box said new but..dont say what do you expect for 118 $. I expect a product that at least takes 1 year before falling apart.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 29,
      "publication_date": 20170305
    },
    {
      "title": "THIS one is BY FAR the BEST I ever had",
      "text": "I've gone through more than half-a-dozen tablets in the last two years. THIS one is BY FAR the BEST I ever had. It's almost like a tablet/laptop hybrid. Highly recommend!!",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer (\"Jhen\") Kobran",
      "helpful_votes": 54,
      "publication_date": 20160314
    },
    {
      "title": "Since the shipping box was fine, I'm wondering how this was even shipped in the first place.",
      "text": "Was going to use this for a project I have to finish soon. So opening this up made me very annoyed, and that's saying it politely.",
      "rating": 1.0,
      "verified": true,
      "author": "Definitely Not Allison",
      "helpful_votes": 30,
      "publication_date": 20170623
    },
    {
      "title": "I am very happy with this",
      "text": "I purchased on a whim.... Was hoping to buy another tablet but this one was cheaper and refurbished. And I was like oh no.... But when I received it 2 days after purchase and came with no scratches no bumps no nothing wrong... Ran smoothly and plays my movies on Netflix perfect I am happy with my choice with it. Keyboard works amazing. I am very happy with my purchase and even more happy that I decided this device.",
      "rating": 5.0,
      "verified": true,
      "author": "Jamie from KS",
      "helpful_votes": 11,
      "publication_date": 20170203
    },
    {
      "title": "This thing is super fast everything works perfect I cannot see me going ...",
      "text": "Up until now I have always purchased the more expensive tablets. This thing is super fast everything works perfect I cannot see me going back to the four and $500 tablets again after owning this",
      "rating": 5.0,
      "verified": true,
      "author": "goose1127",
      "helpful_votes": 9,
      "publication_date": 20170801
    },
    {
      "title": "It's perfect for writing and working when I don't want to ...",
      "text": "I just go my package and so far I'm really enjoying it! It's perfect for writing and working when I don't want to use my large laptop, it is able to use Microsoft word which is something I haven't found in a lot of other tablets and what sets this one apart for me. So glad I purchased this item.",
      "rating": 5.0,
      "verified": true,
      "author": "Sierra",
      "helpful_votes": 11,
      "publication_date": 20170619
    },
    {
      "title": "Great little tablet and hold a good charge",
      "text": "Great little tablet and hold a good charge. You can set up 2 profiles so we can both use it, easy to download wifi printer. Does everything and more than my Chromebook. Price was excellent, so I can travel with it and not go nuts if something happens to it.",
      "rating": 4.0,
      "verified": true,
      "author": "louiza",
      "helpful_votes": 8,
      "publication_date": 20170607
    },
    {
      "title": "If all 3 came the same... But I got an old one.",
      "text": "So far we are very pleased with these tablets! They were bought for our children. They were on the cheaper side of things and the kids were between wanting a tablet and/or a laptop.. This made them happy. My one issue is that 1 of the tablets was manufactured 2015 while the other 2 were 2016. No big deal, except that the 2015 one has a few quirks.. Like certain games that work on the 2016s, say incompatible on the 2015. And while the 2016s are running Android 6.0, the 2015 is on Android 5.0 It's slightly frustrating, but not enough for me to scream about. As I said, so far - they work and the kids are happy.",
      "rating": 4.0,
      "verified": true,
      "author": "Jessica Figart",
      "helpful_votes": 13,
      "publication_date": 20170611
    },
    {
      "title": "A quick death",
      "text": "started out great, easy to use good picture quality, did what I needed. Battery life poor, but I expected that. Today, after owning it for 2 1/2 months it completely quit. Won't turn on, at all. Back to square one. Stay away! I should have!",
      "rating": 1.0,
      "verified": true,
      "author": "autie L",
      "helpful_votes": 12,
      "publication_date": 20170807
    },
    {
      "title": "Slightly Disappointed",
      "text": "Has Android6 - Unable to Write to External SD Card ... Luckily CAN Write to USB for Backups, etc. BUT not as Desirable as MicroSD because USB Protrudes Outside Tablet Edge. [Actually not RCA Fault but Android Developers BAD Decision] Other Slight Issues: Infrequent Performance \"Lags\" and Touch Screen Response Sometimes Requires Multiple Presses. Had Earlier (Android5) Version of Tablet (Lasted almost three years) which was happier with but Battery Died on it so decided to Replace instead of Repair. Overall though, this Model / Version is Satisfactory for intended usage {Games, Surfing Web, \"some\" Light Productivity}. Good Value for Price and Features!",
      "rating": 3.0,
      "verified": true,
      "author": "Dib",
      "helpful_votes": 0,
      "publication_date": 20190228
    },
    {
      "title": "Got the product today. Worth the buy.",
      "text": "7 days of use update I am a college student. This laptop fits my basic needs as: - web surfing & install android app - good docs / excel or powerpoint (get app WPS) - youtube - google assistant (work quite well) - light and portable & readable size Battery is around 6 hours normal use (reading PDF & slides) Camera is a weak point Sound is OK Need to familiarize with smaller than normal keyboard (not too hard) Highly recommend. Dont forget a case with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Kiet P.",
      "helpful_votes": 3,
      "publication_date": 20180809
    },
    {
      "title": "loving it so far!",
      "text": "had a 7 inch tablet previously that i was also happy with, but finding a 10 inch screen & the fact that this tablet already came with its own keyboard fabulous! camera is great, sound quality fine. wifi pick-up could be longer range, but still fine, and coming with like 32 gb of memory (plus more if you add a little card to the slot, which i did) is soooooo much better than just 8 gb like my first tablet had. so much more room for fun programs! :) would totally buy again. :)",
      "rating": 5.0,
      "verified": true,
      "author": "Customer",
      "helpful_votes": 5,
      "publication_date": 20171209
    },
    {
      "title": "Touch screen failure just out of warranty",
      "text": "Ordered at the end of July stopped working at the end of Sept. Almost half the touch screen stopped working and weeks out of warranty period....lightly used and only left the house twice so not beat up just stopped working.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 11,
      "publication_date": 20171003
    },
    {
      "title": "Awesome purchase!!!",
      "text": "I'm really pleased with my purchase thus far! It works great with my WiFi. The keyboard takes a little getting use to - gotta keep your wrists off of the pad or the cursor jumps. And I had to remember, it's also a touch-screen, no need to scroll with the arrow keys! LoL =-) ... After I've used this a while, I'll try to remember to come back and add to my review. But for now, I'm TOTALLY satisfied!",
      "rating": 5.0,
      "verified": true,
      "author": "Anne Elizabeth",
      "helpful_votes": 13,
      "publication_date": 20170610
    },
    {
      "title": "Not Happy",
      "text": "This tablet has a nice picture and the little key board is great, but that's about all that is good with it. The camera is junk, it gets hot fast and the battery is a joke, it only last for a few hours. Besides everything else that is wrong with the tables it is very heavy. I have another tablet that this was replacing and it is still better than the new one. Worst money I ever spent. Thought it would be a good table being RCA, I was wrong.",
      "rating": 3.0,
      "verified": true,
      "author": "Painting50",
      "helpful_votes": 2,
      "publication_date": 20180819
    },
    {
      "title": "Good quality for price point",
      "text": "Good quality for price point. Just have reasonable expectation for what you ask of this tablet. It's a bit limited in Ram so not great for multi tasking or heavy editing/gaming. But it's a solid build, good battery life nice keyboard. Awesome choice for internet surfing and light app use. Consideing price. Also like the expandable memory and HDMI out.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Hernandez",
      "helpful_votes": 4,
      "publication_date": 20180620
    },
    {
      "title": "Battery life is very short!",
      "text": "I waited to do my review to check battery life! I purchased this for my daughter who is cognitively 18 months old, but is a young adult. I work with her through out the day for 10 minutes at a time, total 1 1/2 hours of use. After we are finished there is 15% of battery life remaining. It takes 4-5 hours to fully charge the battery. UPDATE!! I sent it back to RCA to have the battery checked out. They returned it back to me right around Christmas. The tablet died! Not worth my money or time!! Don't buy this!!",
      "rating": 1.0,
      "verified": true,
      "author": "Louann Stanley",
      "helpful_votes": 0,
      "publication_date": 20191021
    },
    {
      "title": "Sweet",
      "text": "Fun little tablet for the money. Worked great right out of the box. Small enough to carry around and big enough to get quick jobs done. I'm glad I bought it.",
      "rating": 4.0,
      "verified": true,
      "author": "sherri",
      "helpful_votes": 8,
      "publication_date": 20161114
    },
    {
      "title": "Okay for money",
      "text": "The keyboard makes you keep typing things over. The lightning screen button does get the brightest. Over all, it's okay for the money. It does not connect to certain wifi.",
      "rating": 2.0,
      "verified": true,
      "author": "Yvonne Wilson",
      "helpful_votes": 6,
      "publication_date": 20170718
    },
    {
      "title": "l",
      "text": "I've had this tablet for eight or nine month, now. I use it daily, often all day and half the night. It's had enough use that for normal use, it would be several years! It's still as good as when I first got it! Long battery life and when it's finished charging, it has a smart charger that stops when the battery is full, so you can't over charge and hurt your battery. Plus, it charges fast. It's a wonderful, wonderful tablet!",
      "rating": 5.0,
      "verified": true,
      "author": "WillowsTop Contributor: Calligraphy",
      "helpful_votes": 36,
      "publication_date": 20161214
    },
    {
      "title": "Awesome",
      "text": "This is one of the Best Device I have ever Bought....I'm happy it has A USB port it makes it easy for me to Download pictures straight from my Camera...",
      "rating": 5.0,
      "verified": true,
      "author": "E.",
      "helpful_votes": 8,
      "publication_date": 20170223
    },
    {
      "title": "So much in a little package!",
      "text": "Overall, I'm very pleased with this RCA version! I had purchased an older version with significantly less memory but this is a VAST improvement. This computer combines what I love about using my phone. It has an Android basis, Google Play, responsive touch screen, vivid graphics, excellent sound quality, and so much memory. Also, I was able to purchase a MicroSD card and add it to its internal memory. I wish I'd bought this one sooner! This a great bargain and fast shipping.",
      "rating": 4.0,
      "verified": true,
      "author": "F. King",
      "helpful_votes": 0,
      "publication_date": 20190531
    },
    {
      "title": "What a nightmare",
      "text": "Product simply does not work. And will not even accept an sd card or external storage, so you cannot even use it as a writing tool. I cannot connect to the internet, so I cannot put any of my files on the cloud either. So basically, I just wrote an entire novel that is now lost. I will never buy another RCA product or a product from this company.",
      "rating": 1.0,
      "verified": true,
      "author": "Poster Fan",
      "helpful_votes": 0,
      "publication_date": 20200217
    },
    {
      "title": "Great little device with one major flaw",
      "text": "I really love this except for one major flaw. I'm used to using my right pinky to shift and this has the shift key way too far to the right. Should have eliminated the up and down keys and put the shift more in the position where it is on a full size keyboard. I love it as a tablet but I find it nearly impossible to type on.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20170822
    },
    {
      "title": "FUNCTIONAL",
      "text": "Useful as a tablet, but a slow processor. However, it will allow you to download apps such as Nook, where the Fire Tablets from Amazon will NOT allow you to load a direct competitor to its own Kindle. Their tablet is more efficient, responsive and has a faster processor but without the ability to load Barnes & Noble Nook. I had to return the Fire tablet for this one because it would not allow me to download Nook. Hope that is corrected!",
      "rating": 3.0,
      "verified": true,
      "author": "FNG",
      "helpful_votes": 0,
      "publication_date": 20190123
    },
    {
      "title": "Goodbye Heavy Songbooks!",
      "text": "I was pleasantly surprised to find that the operating system on the RCA RCT6303W87DK 10\" Tablet was chrome based as is my Chromebook. It syncs with my laptop automatically. The keyboard is nice, but the keys are a little small. Still, better than trying to type on the touchscreen. I use this almost exclusively for song lyrics as it's much easier to carry than multiple songbooks! It is very handy to have and I am enjoying it.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20180605
    },
    {
      "title": "Nice inexpensive tablet but slow.",
      "text": "Looks very nice out of the box. Slow speed. Nice display. Takes forever to open apps or web pages. I was just looking for basic functions, but just set it up and extremely disappointing prossessor speed . My adroid phone is much faster. Probably better for a kids first tablet. Going to research how to somehow speed it up.",
      "rating": 3.0,
      "verified": true,
      "author": "Carl P.",
      "helpful_votes": 2,
      "publication_date": 20180722
    },
    {
      "title": "The keyboard lasted around 4 months before it randomly just ...",
      "text": "The keyboard lasted around 4 months before it randomly just started inserted the letter 'e' whenever it wanted yet when I hit the 'e' button nothing happens. Guess I'll have to shell out more money now for a new keyboard? Just buy a real tablet.",
      "rating": 2.0,
      "verified": true,
      "author": "Sawbones the clown",
      "helpful_votes": 4,
      "publication_date": 20171110
    },
    {
      "title": "She is doing pretty good with it",
      "text": "Purchased as a gift for his mother, she is learning to use a computer for the first time at age 83. She is doing pretty good with it, easy to work with. The keyboard is an added plus, she has poor eyesight but she can see the screen pretty good. Feels like a real computer than a tablet/",
      "rating": 5.0,
      "verified": true,
      "author": "Sharon",
      "helpful_votes": 4,
      "publication_date": 20180421
    },
    {
      "title": "Great product..  Warrantee and customer service is not so good.",
      "text": "I bought two of them for my grandsons for Christmas. They love them. Very happy with them. However be careful with the square trade warrantee. Their both chargers broke. After going back and forth for 2 days on the phone, they said we would hear something in 2 to 3 days. A week went by and I called them only to find out the item was not covered. I told them Amazon customer service would never allow a customer to wait that long and never follow up as promised. Let alone it is not covered.",
      "rating": 5.0,
      "verified": true,
      "author": "Joan M. Ricci",
      "helpful_votes": 3,
      "publication_date": 20160507
    },
    {
      "title": "Love It!!",
      "text": "I purchased it as a gift for my son who teaches English as a second language. He Loves it. It meets all of his needs and allows him to have some form of technology away from his home computer. He didn't expect an expensive tablet to do so much.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Lesane",
      "helpful_votes": 4,
      "publication_date": 20170223
    },
    {
      "title": "Waste of money",
      "text": "Screen is finicky at times, connection to keypad cuts in and out. Micro USB port is for charging only even though it comes with another charger, and ads will pop up at random on the device that can't be skipped. This started happening before my first time connecting it to the internet, found out there were programmed in... nice... Overall its not terrible quality, its just that its not worth the amount they are asking.... which is saying something considering how cheap it is...",
      "rating": 2.0,
      "verified": true,
      "author": "Max Brown",
      "helpful_votes": 0,
      "publication_date": 20181230
    },
    {
      "title": "Highly recommended Light weight Tablet",
      "text": "We have fell in love with these tablets. They are light weight, easy to navigate, holds charge great and connection and capabilities are excellent. We purchased one and within two weeks purchased the second. Very satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan Tate",
      "helpful_votes": 5,
      "publication_date": 20170808
    },
    {
      "title": "This is junk",
      "text": "This is Junk. I purchased this as a tablet to watch a YouTube video and check email. I use this twice a month. It takes 5 min just to start up. The WiFi is so week. Whatever hardware is super cheap and undersized You have to be right next to the router. Offline the machine is just as slow. Apps won't run properly. I'm using Gmail and YouTube and they Won't run properly, and forget amazon video This is Fraud. It's not an inexpensive Google book, it's a garbage Google book. It can't even run Google on a Google book",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190604
    },
    {
      "title": "Decent Tablet For The Price",
      "text": "It's an okay tablet for the price. Nice big screen, fast enough for watching videos, skyping and browsing. If you don't want to spend more than a $100 on a tablet, this one is a good deal for you. I bought it only to browse social media pages on it and watch movies and TV shows on Kodi program.",
      "rating": 4.0,
      "verified": true,
      "author": "Kurdman",
      "helpful_votes": 2,
      "publication_date": 20171021
    },
    {
      "title": "Best Deal—Best product",
      "text": "This is the 3rd 2in1 I have owned and it’s the best $100.00 I have ever spent other than needing to have a louder speaker in my opinion I cannot find a single negative thing to say about it ! I feel it’s the best of both worlds!!!. I recommend it to new people looking and us older techies like me. Simple to use but still has everything you need THANKS RCA great product",
      "rating": 5.0,
      "verified": true,
      "author": "K Chapman",
      "helpful_votes": 0,
      "publication_date": 20181028
    },
    {
      "title": "Bought this as a birthday present for my daughter. ...",
      "text": "Bought this as a birthday present for my daughter. Would have given more stars, however the actual box it came in was extremely damaged and tablet didn't appear to be NEW as claimed whenever we opened it.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20170910
    },
    {
      "title": "RCA 10\" Tablet with keyboard",
      "text": "When I received this item the table would not work unless the keyboard was plugged in and even then it worked every now and then. I sent this item back",
      "rating": 2.0,
      "verified": true,
      "author": "CindyLouWho",
      "helpful_votes": 4,
      "publication_date": 20170721
    },
    {
      "title": "Three Stars",
      "text": "It works fine. Image quality isn't fantastic, but that's to be expected with this price tag. Great starter tablet. I've also come to notice that the touch response is a little delayed. in other words, it's slow.",
      "rating": 3.0,
      "verified": true,
      "author": "Jess",
      "helpful_votes": 4,
      "publication_date": 20170309
    },
    {
      "title": "Alright for price, breaks fast though.",
      "text": "Purchased this to use as a traveling tablet, but the machine broke within a few weeks of having it. Sent it in to be repaired, received it back but sadly the machine stopped working again after a few weeks. Spend the extra money and buy a nicer tablet, it's worth it in the long run.",
      "rating": 2.0,
      "verified": true,
      "author": "Brody",
      "helpful_votes": 0,
      "publication_date": 20180911
    },
    {
      "title": "it is useless.",
      "text": "The touch screen stopped working after 2 weeks, It is a piece of junk. I intend to send it back, it is useless.",
      "rating": 2.0,
      "verified": true,
      "author": "david l.",
      "helpful_votes": 4,
      "publication_date": 20180731
    },
    {
      "title": "Frustrated",
      "text": "Frustrating. Bought this to read newspapers and books; and read my emails, etc. While I have very fast wifi, this unit is frustratingly slow loading and moving around in publications.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 13,
      "publication_date": 20170329
    },
    {
      "title": "OK Value",
      "text": "It lasted about 2 years before the touchscreen failed to recognize commands made in the top portion of the screen. USB port failed, also. Factory rested did not bring back functionality. It didn't cost much, so the overall value was OK.",
      "rating": 2.0,
      "verified": true,
      "author": "Weimaranchand",
      "helpful_votes": 0,
      "publication_date": 20200220
    },
    {
      "title": "This is a great little tablet/keyboard combo for the price",
      "text": "This is a great little tablet/keyboard combo for the price. I have had it for over a month now and have no issues except even on the brightest setting it is very hard to use outside.",
      "rating": 4.0,
      "verified": true,
      "author": "Cheyanne Sanchez",
      "helpful_votes": 4,
      "publication_date": 20180125
    },
    {
      "title": "Not too shabby",
      "text": "This was one of those products that was cheap and underestimated because it fits every little need it's your night time go to streaming device I can play Netflix and high quality 720p they can play movies without stuttering judder and can play music and games and do plenty of browsing and the keyboard works just great with all the shortcuts it's a great system I would recommend it for the price and if you want something different I would recommend the RCA Windows 10 version also I would recommend this product to anybody I'll give it great reviews coming from Nexus 7 and other quality products it's cheaper alternative that everybody should own",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170905
    },
    {
      "title": "Great tablet.",
      "text": "My three sons love these and they do everything we need them to. They can write their essays on them and print to our wireless printer. They can their games and watch their favorite youtubers and Netflix. Just perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathy Byers",
      "helpful_votes": 5,
      "publication_date": 20170129
    },
    {
      "title": "Happy with purchase.  Does what we needed.",
      "text": "Time will tell but very pleased so far. Easy to set up and once you get used to navigating the Android system it is well worth the price. A bit heavy for someone who wants to tote it about. Happy that we made the purchase and would recommend for those who are not very demanding about use and versatility. Does the job for us.",
      "rating": 4.0,
      "verified": true,
      "author": "dms",
      "helpful_votes": 5,
      "publication_date": 20161024
    },
    {
      "title": "good deal over all",
      "text": "Decent tablet. Keyboard works well. Surface touch not as sensative as I would like, but good deal over all.",
      "rating": 4.0,
      "verified": true,
      "author": "Matt",
      "helpful_votes": 3,
      "publication_date": 20180117
    },
    {
      "title": "SUPER SLOW",
      "text": "I waited over a month to get this tablet and when I turned it on for the first time I already knew it was going to be an issue. EVERYTHING runs slowly I'm not tech savvy but I do know how to look up how to try and fix the problems and ask for help from tech nerds. They tell me it's the product itself. Returning it as soon as I can. I'm pissed I spent 100+ bucks on this thing for my daughters schoolwork and it works like a piece of junk. Cant do anything without getting frustrated!",
      "rating": 1.0,
      "verified": true,
      "author": "Kay",
      "helpful_votes": 0,
      "publication_date": 20200508
    },
    {
      "title": "Decent unit for the money",
      "text": "Had this tablet for a couple of days. I'm pleased with it overall. Speed is acceptable, apps load in a reasonable time. It seems sturdy enough to last with normal use. Graphics qualities are decent, not high definition by any means, but didn't expect that for the price. The only drawback I've found with it is: I can't get it to connect with my PC for file transfer using a USB to micro USB charging cable. I have to load files on a flash drive, & move them from there. Overall, for the price, it's worth buying.",
      "rating": 4.0,
      "verified": true,
      "author": "Duane Steele",
      "helpful_votes": 0,
      "publication_date": 20180811
    },
    {
      "title": "Horrible excuse for a tablet",
      "text": "Waste of money. Doesn't stay connected to internet and very slow memory. Bought to only watch Netflix and occasionally browse internet, but it cant even do that. I would light it on fire if Amazon wasn't going to let me return it.",
      "rating": 1.0,
      "verified": true,
      "author": "P K",
      "helpful_votes": 0,
      "publication_date": 20180610
    },
    {
      "title": "I took a chance purchasing a reconditioned Tablet instead of a new one to save some money.",
      "text": "The RCA 10\" VIKING PRO Tablet that I purchased was a reconditioned unit at a lower price. It's in like new condition. Works great! I use it with a Bluetooth mouse and speaker. I like that it has a full size USB Jack. Not all tablets have them. I was expecting it come with a battery charger with cable and original box and info sheet but it didn't. It came by itself wrapped in heavy thick bubble wrap. I'm still happy with it and the savings. For me, it was well worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20161215
    },
    {
      "title": "Operating system SO SLOW",
      "text": "The keyboard was nice and but not as strong magnet as I would have liked. The operating system was so slow that it took forever for apps to download and/or run over high-speed internet. It was a little heavy for a tablet - even without the keyboard.",
      "rating": 3.0,
      "verified": true,
      "author": "Phoebe Koelsch",
      "helpful_votes": 0,
      "publication_date": 20190611
    },
    {
      "title": "Great for Simple Tasks",
      "text": "Needed a portable laptop in a pinch and this worked great. It is slow but manageatasksIts great for things like surfing the internet, doing word docs and simple apps. Pros: portable, cheap, good for simple tasks, decent battery life Cons: slow, closes programs at randon, not a ton of storage",
      "rating": 4.0,
      "verified": true,
      "author": "Kalee Jackson",
      "helpful_votes": 0,
      "publication_date": 20170825
    },
    {
      "title": "Keyboard problems",
      "text": "I was stuck between a 2 and a 3 star review. I loved the tablet! It was fast the screen was nice and the battery life was great. As for the keyboard it just didn't work. I even contacted the manufacturer and had a different keyboard sent to me. It still didn't work so I had to return my little laptop.",
      "rating": 3.0,
      "verified": true,
      "author": "nicole",
      "helpful_votes": 0,
      "publication_date": 20181004
    },
    {
      "title": "So far so good, it's really an entry level tablet",
      "text": "So far so good, it's really an entry level tablet, , The sound isn't very realiable , All in all ,it gets the job done, not too bad for the price",
      "rating": 3.0,
      "verified": true,
      "author": "M. J",
      "helpful_votes": 2,
      "publication_date": 20180625
    },
    {
      "title": "the touch display is not as responsive as I would like it to be",
      "text": "For the price I'm still trying to find another tablet that match this one. Is a bit slow for my taste, the touch display is not as responsive as I would like it to be. The downloading of files and the way the tablet stores them is a nightmare.. Overall it is a great product for the price paid.",
      "rating": 4.0,
      "verified": true,
      "author": "Carlos",
      "helpful_votes": 0,
      "publication_date": 20180729
    },
    {
      "title": "Not for school or business work",
      "text": "My kids cannot do online schooling with this tablet. The cursor is a little wacky too like you go to point at something and it moves. This was a waste for us. For games and YouTube or other video streaming this would be ok.",
      "rating": 2.0,
      "verified": true,
      "author": "Letteria",
      "helpful_votes": 0,
      "publication_date": 20200416
    },
    {
      "title": "Worse tablet I ever purchased",
      "text": "Worse tablet I ever purchased, didn't load videos correctly, when auto rotate was off it be still rotated, other than the amount of storage on the device being somewhat efficient, nothing else worked as it originally said and I wouldn't recommend to anyone buying this device, spend a few extra dollars and buy a Kindle fire or another well known brand because I only had my tablet for 3 months and I feel like I was robbed and what replacement warranty I wasn't offered one and at time of purchase there were no offers of any kind,, this product Sucks!!!",
      "rating": 1.0,
      "verified": true,
      "author": "James McGovern ",
      "helpful_votes": 2,
      "publication_date": 20170905
    },
    {
      "title": "great little laptop/tablet",
      "text": "great little laptop/tablet. a little slow to browse internet but only a little",
      "rating": 5.0,
      "verified": true,
      "author": "MEG",
      "helpful_votes": 3,
      "publication_date": 20171127
    },
    {
      "title": "Not a Windows 10 OS",
      "text": "Says it runs on Windows 10 in the specs, but it runs on Android. I bought it exclusively to use a program that needs Windows 10. Not the fault of the product, but the listing should be cleaned up. I returned it and purchased an ACER One10 that does everything I need.",
      "rating": 1.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 8,
      "publication_date": 20180130
    },
    {
      "title": "No regrets so far",
      "text": "Nice tablet the cover is plastic i knew that going in.A hard case and screen protector is needed or just don't drop it. It takes a little work to get a usb device in the usb port it is kinda tight. Overall it is what i needed, i use it to gain remote access to my home computer desktop over wifi and mobile data using my phone as a mobile hotspot. It's both an android tablet and a windows tablet, depending on what i need it for.",
      "rating": 4.0,
      "verified": true,
      "author": "Larry Holmes",
      "helpful_votes": 3,
      "publication_date": 20160903
    },
    {
      "title": "Great little tablet",
      "text": "Great little tablet. I just started going back to school and its been quite handy for pdf reading, checking email, and reading books. I have a few games and they seem to run just fine. The one issue I have, which i assume will take some time to adjust to is that when I'm typing, ill occasionally touch the trackpad and it'll move the mouse and move where I was typing. Other than that, its a great little tablet!",
      "rating": 5.0,
      "verified": true,
      "author": "Cristopher Caez",
      "helpful_votes": 3,
      "publication_date": 20161222
    },
    {
      "title": "Ok for price",
      "text": "Not what I expected it only seems to pick up a 2g signal and I have 5g at my house but will check settings and see if it can be changed also did not like my Yahoo account to be added but that could be because of the 2g",
      "rating": 3.0,
      "verified": true,
      "author": "JeffWeisbaker",
      "helpful_votes": 0,
      "publication_date": 20190504
    },
    {
      "title": "Excellent Computer for a Novice",
      "text": "I picked this out for my friend who is not a computer wiz and just needed to Skype for her Dr.s appointment. She loves it and it is easy to use. Clear quality pictures",
      "rating": 5.0,
      "verified": true,
      "author": "Monica",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "Amazing tablet",
      "text": "This tablet is worth every penny it’s exactly what my Mom needed. It’s very easy to set up and learn how to use. It works great for her because the screen is big enough she can see it.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristen Murphy",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "Great PC for the Money",
      "text": "It a good unit to set by my chair, but has a slow OS. I very happy with the price I paid and use it all the time!",
      "rating": 4.0,
      "verified": true,
      "author": "Scott.",
      "helpful_votes": 2,
      "publication_date": 20180219
    },
    {
      "title": "this tablet has a regular push in charger which is great. i have had many tablets over the years ...",
      "text": "After 2 tablets with mini usb chargers, that do not work after several month, this tablet has a regular push in charger which is great. i have had many tablets over the years and this one so far is great and I love the detachable keyboard. Price was great too!",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole W.",
      "helpful_votes": 16,
      "publication_date": 20160728
    },
    {
      "title": "This tablet \"feels\" like it's not as well made as my Asus tablet ...",
      "text": "This tablet \"feels\" like it's not as well made as my Asus tablet but it works better. The touch screen on my Asus is cranky but the RCA is operationally superior. I have no complaints.",
      "rating": 4.0,
      "verified": true,
      "author": "bob morris",
      "helpful_votes": 5,
      "publication_date": 20160131
    },
    {
      "title": "Very disappointed.",
      "text": "It takes as long as 3 minutes for apps/programs to open. It freezes the page for several minutes before closing whatever you were attempting to do. I wish I could afford to buy something else. I am so sad. I had to save up for this since I'm on social security.",
      "rating": 2.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20181221
    },
    {
      "title": "Low quality piece of garbage....",
      "text": "Worked fine for about 2 weeks, then it would not hold a charge. I had to travel and could not take care of it right away. Came back contacted amazon, is 6 days past the one month return period, so they cannot help. Contacted RCA directly to see how they respond. So far tablet dead with 15-20 days of use. That is what I call low quality.",
      "rating": 1.0,
      "verified": true,
      "author": "Tammy O.",
      "helpful_votes": 8,
      "publication_date": 20170719
    },
    {
      "title": "Hey you may want to buy this if you want a steaming pile of crap!",
      "text": "Overall the screen quality what's poo poo quality it was made from the company of poo-poo doo-doo and that's putting it nicely",
      "rating": 2.0,
      "verified": true,
      "author": "William Martins",
      "helpful_votes": 0,
      "publication_date": 20200423
    },
    {
      "title": "Good tablet",
      "text": "Gift for my daughter and since she's had it she's used it a lot. No problems with this tablet and lasts for hours on battery. She doesn't have any complaints with it at this time and its been about a year give or take.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike G",
      "helpful_votes": 0,
      "publication_date": 20171023
    },
    {
      "title": "Nice little Tablet",
      "text": "I love this little tablet. I do a lot w it like order online, send email, d/l pics off my digital camera. I watch videos on YouTube w it. I have a laptop but I'm always using this RCA. I like the way its nice and light.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "Gift",
      "text": "it was a gift and I havent heard any complaints so its all good. As far as I know, everything is working fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Mario",
      "helpful_votes": 3,
      "publication_date": 20170505
    },
    {
      "title": "10\" Tablet",
      "text": "Purchased as a gift for our daughter, arrived on time, perfectly packaged. She loves it, would recommend to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "DJ Dev - AZ",
      "helpful_votes": 3,
      "publication_date": 20170414
    },
    {
      "title": "I AM SHOCKED !!!!!",
      "text": "Ok, Let me start by saying this is no IPAD or Samsung Tablet. But I have to say. It does what it has to do. It is very cool. So to say I am shocked. Means I am impressed by this RCA. Perfect for Grandma !",
      "rating": 5.0,
      "verified": true,
      "author": "JerseyBooch",
      "helpful_votes": 0,
      "publication_date": 20181011
    },
    {
      "title": "Died after just 14 months",
      "text": "I have had this just 14 months and the device just stopped working. I can't get anything to come up. And of course warranty is over.",
      "rating": 2.0,
      "verified": true,
      "author": "Dawn C.",
      "helpful_votes": 0,
      "publication_date": 20191119
    },
    {
      "title": "do not purchase",
      "text": "PURCHASED got in the mail and cannot log in. it asks me for a previously linked Google account which obviously I don't have. waited all week for this and now can't use it.",
      "rating": 2.0,
      "verified": true,
      "author": "Linds",
      "helpful_votes": 0,
      "publication_date": 20200229
    },
    {
      "title": "Impressed!!",
      "text": "At this price point this tablet is a steal!! It does everything I need it to do and then some. The USB port is a great bonus as I use it for my portable printer. This tablet is literally better than my HP mini IMHO.",
      "rating": 5.0,
      "verified": true,
      "author": "RobertP.",
      "helpful_votes": 0,
      "publication_date": 20180808
    },
    {
      "title": "I like the style and weight of this tablet",
      "text": "I like the style and weight of this tablet. I find it very slow in switching aps. The battery life is the real downfall. I have had one game ap open, a word game ap and in 2 hours he battery needs charging. Sure can't rally go somewhere to use unless I know I can recharge it.",
      "rating": 3.0,
      "verified": true,
      "author": "Seniorconsumer",
      "helpful_votes": 0,
      "publication_date": 20180210
    },
    {
      "title": "Out of the Country",
      "text": "The product appears to be okay, but trying to get tech support for issues that can't be fixed without their help is very difficult. The tablet appears to have been in South America and time zones and some other items makes it very hard to use. I would suggest that tech support have a phone number or some way of communicating with them so that the buyer can get on with life.",
      "rating": 3.0,
      "verified": true,
      "author": "Sandy Briggs",
      "helpful_votes": 0,
      "publication_date": 20161219
    },
    {
      "title": "Need help",
      "text": "Both 2 five months ago and one will not turn on or off and no details for a warranty.",
      "rating": 5.0,
      "verified": true,
      "author": "Jacqueline K Sedivy",
      "helpful_votes": 2,
      "publication_date": 20171202
    },
    {
      "title": "I love this tablet I get on Amazon every day with ...",
      "text": "I love this tablet I get on Amazon every day with it Very easy to use download games and everything excellent",
      "rating": 5.0,
      "verified": true,
      "author": "rosalie sims",
      "helpful_votes": 3,
      "publication_date": 20170413
    },
    {
      "title": "Keyboard malfunction and slow to WiFi",
      "text": "The screen is fine, but the keyboard came with some defects. The t button doesn't always press on the keyboard. It slow to reconnect to wifi after being left idle. So far that's been my only issue, and I can deal with that. I've already dropped it a few times and it hasn't lost any functions.",
      "rating": 4.0,
      "verified": true,
      "author": "Papyrus",
      "helpful_votes": 0,
      "publication_date": 20170812
    },
    {
      "title": "Not worth the “savings”",
      "text": "My daughter had it for about 2 weeks and it stopped working. It acts like it has a dead battery, but charging it never charges fully and never turns on after being plugged in for days on end. Very disappointed. I should have just thrown my money in the toilet.",
      "rating": 2.0,
      "verified": true,
      "author": "Ty",
      "helpful_votes": 0,
      "publication_date": 20181108
    },
    {
      "title": "Warranty worthless",
      "text": "Arrived we were excited we were only using it for bills but 3weeks in it broke we purchased a repair warranty on top of it for 2 years and NOBODY did anything and NOBODY cared",
      "rating": 3.0,
      "verified": true,
      "author": "Sarah Wilson",
      "helpful_votes": 0,
      "publication_date": 20190205
    },
    {
      "title": "Works well and is very reasonably priced.",
      "text": "Haven't used it much so far. Bought it for a decent size screen at the camp to check weather via my phone. Works like a champ and was very easy to set up. The best thing was the price, 100$, are you kidding me????",
      "rating": 5.0,
      "verified": true,
      "author": "NOJEEP",
      "helpful_votes": 2,
      "publication_date": 20160715
    },
    {
      "title": "it is so slow.",
      "text": "Can't stand to touch the screen and nothing happen. If I had known it would be so slow to process simple requests, I would have certainly looked for another tablet - even if it was more expensive.",
      "rating": 2.0,
      "verified": true,
      "author": "mart",
      "helpful_votes": 0,
      "publication_date": 20171103
    },
    {
      "title": "I really like this so far",
      "text": "I really like this so far. I can't seem to use any Amazon apps on it but it's my only complaint. They speakers are not great but ok enough for a tablet. I would give it a five star if Amazon worked on it. Also buy a case with it!!!",
      "rating": 4.0,
      "verified": true,
      "author": "Matthew Gillett",
      "helpful_votes": 0,
      "publication_date": 20171226
    },
    {
      "title": "Great buy",
      "text": "For the price this is one of the best tablet I have ever had. I have had no problems with it. Connect with WiFi great. This works as good as the ones you see for 100 more.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel",
      "helpful_votes": 0,
      "publication_date": 20181005
    },
    {
      "title": "Great Value for my needs",
      "text": "will more then get the job done .. I bought it for a travel tablet in the RV - will use it like a smart phone but without the bother of voice calls.",
      "rating": 4.0,
      "verified": true,
      "author": "Svlago",
      "helpful_votes": 2,
      "publication_date": 20170716
    },
    {
      "title": "Don’t buy this tablet.",
      "text": "This was not a good tablet. After a year 1/2 it quit working. This tablet was also very heavy and awkward. Battery life was awful.",
      "rating": 3.0,
      "verified": true,
      "author": "Lady Jeigh",
      "helpful_votes": 0,
      "publication_date": 20190324
    },
    {
      "title": "Three Stars",
      "text": "didn't last very long, stopped working after 4 or 5 months",
      "rating": 3.0,
      "verified": true,
      "author": "tim",
      "helpful_votes": 0,
      "publication_date": 20180920
    },
    {
      "title": "RCA Viking Pro",
      "text": "My low rating might be from a steep learning curve after 3 and a half years with my Kindle Fire. I have not found (so far) such normal things as an address book for E-mails. Can someone help me with this? And.......there are a number of other issues that hope to figure out eventually.",
      "rating": 2.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20170226
    },
    {
      "title": "Awesome sauce!",
      "text": "I love it. I didn't have a laptop or a tablet and now I have both...all in one.",
      "rating": 5.0,
      "verified": true,
      "author": "Casey",
      "helpful_votes": 2,
      "publication_date": 20170908
    },
    {
      "title": "I was hesitant to buy another tablet after a bad experience with another but I was pleasantly surprised",
      "text": "I was hesitant to buy another tablet after a bad experience with another but I was pleasantly surprised. For the price this 2 in 1 has worked very well and the battery life was pretty good.",
      "rating": 5.0,
      "verified": true,
      "author": "Shake",
      "helpful_votes": 2,
      "publication_date": 20161001
    },
    {
      "title": "Great tablet",
      "text": "Excellent tablet for the price. Haven't had any issues after a month of use. Would highly recommend buying this product to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Chuckle Monkey",
      "helpful_votes": 0,
      "publication_date": 20190207
    }
  ],
  "product_meta": {
    "title": "RCA Viking Pro 10\" 2-in-1 Tablet 32GB Quad Core Charcoal Laptop Computer with Touchscreen and Detachable Keyboard Google Android 6.0",
    "description": "Viking 10 Pro OS Tablet with Detachable Keyboard.Android 6 Marshmallow, 32 GB Storage, Plus Micro SD Expandable Slot, 10 Inches HD Display, 4 Core Processor, Battery life of up to 6 Hours, Dual Cameras, 1280 X 800 HD Display, Google Play Store and Bluetooth",
    "rating": 3.8,
    "feature_bullets": [
      "10.1\" touchscreen",
      "1.4GHz Quad-Core processor",
      "32GB of storage memory",
      "Google Android 5.0 (Lollipop) OS",
      "Webcams, WiFi and Bluetooth"
    ],
    "specifications": {
      "Standing screen display size": "10.1 Inches",
      "Screen Resolution": "1280 × 800",
      "Wireless Type": "802.11n, Bluetooth",
      "Number of USB 2.0 Ports": "1",
      "Average Battery Life (in hours)": "6 Hours",
      "Brand": "RCA",
      "Series": "Viking Pro",
      "Item model number": "MAIN-64135",
      "Hardware Platform": "Android",
      "Operating System": "Android 5.0 Lollipop",
      "Item Weight": "1.1 pounds",
      "Product Dimensions": "12 x 3 x 9 inches",
      "Item Dimensions  LxWxH": "12 x 3 x 9 inches",
      "Color": "Charcoal",
      "Rear Webcam Resolution": "2 MP",
      "Processor Brand": "Intel",
      "Processor Count": "50",
      "Computer Memory Type": "DDR DRAM",
      "Flash Memory Size": "32 GB",
      "Hard Drive Interface": "USB 2.0",
      "Power Source": "Battery",
      "Batteries": "1 Lithium Polymer batteries required.",
      "ASIN": "B00YB3CW6W",
      "Customer Reviews": "3.8 out of 5 stars1,052 ratings3.8 out of 5 stars",
      "Best Sellers Rank": "#29,246 in Electronics",
      "Date First Available": "October 21, 2017"
    },
    "categories": [
      "Computers & Accessories",
      "Electronics",
      "Computers & Tablets"
    ],
    "price": 119.0
  }
}