{
  "website_summaries": [
    {
      "verdict": "This roll-up liner has the extra support of an aluminum base.",
      "pros": [
        "A hard cover that rolls rather than folds",
        "Can secure to the front of the cab with straps",
        "Comes in three sizes",
        "Vinyl over aluminum gives you a smooth look on top",
        "Installation is fairly easy",
        "Keeps water out on the sides"
      ],
      "cons": [
        "Tends to leak a bit at the tailgate"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Just what I always wanted.",
      "text": "Easy to install. Looks great. Fits perfectly. I'm the only truck I've seen around here that has a cover that is inline with the bed rails. This thing does not stick up above the rails at all. The lines are so clean. I love that it keeps stuff secure. I wouldn't say it's waterproof, but there's very little water in my bed even after a heavy rain, or every after I wash it with the pressure washer. I'm so happy I got this cover.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Fowler",
      "helpful_votes": 9,
      "publication_date": 20180627
    },
    {
      "title": "Functionally it works, fit and finish could be better...",
      "text": "I am replacing a 2 year old G2 trifold. I like the concept of the revolver, roll up and doesn't block the rear view. You won't be concerned with the wind blowing and unsecured flap backwards driving down the road either. As for the fit and finish, well...you would think the trim work would look better than a raw edge for an $800 product. There was a nick in the paint and I've noticed several paint blemishes where specks were painted over. C'mon Bakflip!",
      "rating": 4.0,
      "verified": true,
      "author": "MitsuJones",
      "helpful_votes": 3,
      "publication_date": 20181203
    },
    {
      "title": "Poorly made product and even worse manufacturer support! Buyer beware...",
      "text": "Bak Industries products continue to get worse in my opinion. I had one of the original models of this cover and I LOVED it! This newer version is cheaply made. Poor adhesives, insufficient support of the top when it is rolled up, poor seal at the tailgate, and the manufacturer DOES NOT respond to attempts to contact them. I would caution anyone to think carefully before buying one of the Bak products. They tout a long warranty but it is useless if they do not respond to customers.",
      "rating": 2.0,
      "verified": true,
      "author": "JMer",
      "helpful_votes": 4,
      "publication_date": 20171030
    },
    {
      "title": "Buy it now, it's worth it!",
      "text": "I have owned a number of tonneau covers, most recently the Retrax. I purchased this one because I liked what I saw in the quality and installation. I think this is perhaps the best cover on the market especially for the price. Wow! Installation was a breeze, the quality is top notch and the design allows you to utilize almost the entire bed of the truck. I absolutely love this cover and cannot say enough positive things about Bak Industries. Great product!",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 2,
      "publication_date": 20180503
    },
    {
      "title": "Disappointing",
      "text": "I got this to replace my MX4 since this is compatible with ladder racks. Personally I feel the MX4 is a much better cover. The Revolver X4 does was much more difficult to align properly and continues to not lock properly if even one locking tooth is misaligned. Does not feel as secure as the MX4 and lets more water in near the tailgate than the MX4. Overall I’m disappointed with this cover but it does work with my Thule Tracrac SR ladder rack so I’ll continue to use it.",
      "rating": 2.0,
      "verified": true,
      "author": "JBisk",
      "helpful_votes": 0,
      "publication_date": 20190702
    },
    {
      "title": "Good fit, no issues.  Very please.",
      "text": "I installed this in about an hour. It fit very well. After several car washes and rain storms I can tell you that water does get into the truck bed near the tailgate. However, as other reviewers have mentioned, it's not enough to worry about and could be easily stopped by additional strips of weather stripping applied to the top of your end gate. Really like the look of this cover on my F-150! Looks clean and sharp. Recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "Brett Despain",
      "helpful_votes": 0,
      "publication_date": 20190801
    },
    {
      "title": "Simple, solid, beautiful.",
      "text": "Great quality, super easy to install. I did it by myself. It wasn't too heavy only uses 4 clamps total on either side of the bed. No drilling required at all. One handed operation as far as opening it. When you close it sometimes you have to walk to the other side to push it down but come on now. Can't be too lazy lol. Just installed it so will come back in a few months to update the review and see how it is in the long run.",
      "rating": 5.0,
      "verified": true,
      "author": "Zchosenjuan",
      "helpful_votes": 2,
      "publication_date": 20180907
    },
    {
      "title": "New problem.",
      "text": "Installed it mid january 2016 and it just separated in one of the channels. Also The leather is already cracking. The biggest problem is I really like the look and the strength and would like to keep recommending it, but if it fails after the minimal use I've put it through I will no longer recommend it.",
      "rating": 2.0,
      "verified": true,
      "author": "joseph denhalter",
      "helpful_votes": 15,
      "publication_date": 20160301
    },
    {
      "title": "Poor adhesive quality. UPDATE",
      "text": "Update: BAK was very responsive and will be replacing the cover! Kudos! I bought the X2 in June 2017. It went through 2 summers in N Texas and then the adhesive that holds the felt panels on the underside and the front weatherstrip let loose. The weatherstrip has curled up in the front and both panels have fallen off. I would not recommend any BAK products unless they have changed the grade of adhesive they use that will stand up to hot weather. I would imagine that any of these models that are being used anywhere in the Southern or Southwestern U.S have experience the same issue.",
      "rating": 5.0,
      "verified": true,
      "author": "OldVet71",
      "helpful_votes": 0,
      "publication_date": 20190928
    },
    {
      "title": "Good product, a bit too pricey",
      "text": "Bought this cover for a cross country move from Virginia to California. Kept my truck bed dry and secure through multiple hotel stays and rain storms. The latching seems a bit cheap to me and wish it was a little higher quality. Also, it doesn't latch properly due to the manufacturer not installing the hardware to be flush (See red arrow in picture). I do enjoy the roll-up of the cover, the cloth on the inside is nice as the metal gets very hot. Does it get the job done? Yes...Is it worth 1,000 dollars? Probably closer to 650 would be appropriate.",
      "rating": 4.0,
      "verified": true,
      "author": "Matt P.",
      "helpful_votes": 0,
      "publication_date": 20190709
    },
    {
      "title": "2018 F150 XLT",
      "text": "This cover is awesome! I installed on my 2018 F150 XLT. It took me approximately 45 min to install. I haven’t done the water test but looks like it’ll keep things somewhat dry. Overall, I love it!",
      "rating": 5.0,
      "verified": true,
      "author": "AQ",
      "helpful_votes": 4,
      "publication_date": 20180311
    },
    {
      "title": "Excellent build quality",
      "text": "I installed and adjusted this pretty easily. Not necessarily a handy guy the instructions were clear enough. We drove through a car wash and got only minimal water into the bed, very impressive. The locking mechanism is secure and I feel confident it is goin g to deter all but the most aggressive tweakers.",
      "rating": 5.0,
      "verified": true,
      "author": "Drew IC",
      "helpful_votes": 0,
      "publication_date": 20201019
    },
    {
      "title": "Great cover. Bought this for my 2018 Ford Raptor ...",
      "text": "Great cover. Bought this for my 2018 Ford Raptor Supercab and it fit perfectly. Had it installed in approx 30 mins. I would definitely recommend it to anyone thats looking for a bed cover that you can actually roll up and still see out of the back window.",
      "rating": 5.0,
      "verified": true,
      "author": "Terry",
      "helpful_votes": 3,
      "publication_date": 20180429
    },
    {
      "title": "super cover and works well with ladder racks",
      "text": "so far so far so good. installed in 40 minutes. keep your rails even and install will go well. also fine tune where the cover sits over tailgate while closed before tightening the 4 bolts and youll be good wish the latching mechanism was all metal, otherwise works well. works with ladder racks that utilize pocket stake bed rail holes. see pics* time will tell the over time durability.",
      "rating": 5.0,
      "verified": true,
      "author": "Ty K",
      "helpful_votes": 0,
      "publication_date": 20190412
    },
    {
      "title": "Almost water tight and greater security.",
      "text": "The rolling cover is great in that the top is very sturdy and water resistant. Too bad there is no means to only partially open the top for half bed exposure but accepting this for what it is I am quite satisfied with the top. Getting the top to lay both square on the bed and far enough from the cab to seal with the tailgate was the most difficult portion of the installation. A helper to assist in the installation is a good idea as well.",
      "rating": 5.0,
      "verified": true,
      "author": "David P. Dungan",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "The finish on the cut ends of the rails is where I was disappointed. They need to be filed and buffed",
      "text": "Installing the cover was very simple and it works well. The finish on the cut ends of the rails is where I was disappointed. They need to be filed and buffed.",
      "rating": 4.0,
      "verified": true,
      "author": "Black Jeep",
      "helpful_votes": 3,
      "publication_date": 20180528
    },
    {
      "title": "I'm a happy customer.",
      "text": "So far, so good. I really like the low profile and matte finish. We have had some pretty hard rain a few times and very little water has made its way into the bed. I'm sure some minor adjustments could stop most of what little managers it get in.",
      "rating": 5.0,
      "verified": true,
      "author": "RentMan",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "Looks sleek",
      "text": "I debated a long time over a bed cover, for me it will be down most of the time. I wanted Security, strength water proof and value. I didn’t want the cover to stick up or look like it didn’t belong. This cover met everything except waterproof, a small amount gets in along the rails. But it looks great and was easy to install.",
      "rating": 4.0,
      "verified": true,
      "author": "Stephen Jeu",
      "helpful_votes": 0,
      "publication_date": 20190627
    },
    {
      "title": "great quality and easy to install",
      "text": "I'm very happy. Nice quality but in the would of roll up but secure there is not much choice. I haul dirt bikes but like to leave equipment in the bed when out riding - now I know it is safe. I have 6.5 ft bed so my dirt bike fits fine I've heard with the 5.5ft bed you run out of space. I'm not giving 5 stars as I ordered the X4 but got an X2!",
      "rating": 3.0,
      "verified": true,
      "author": "Andy B",
      "helpful_votes": 0,
      "publication_date": 20190325
    },
    {
      "title": "The best cover for the money, hands down.",
      "text": "Very easy to install; I started at dusk and finished with a flashlight. No problems! The cover looks great, is the most water resistant cover I’ve ever used, and is very secure. I’m very happy with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert F. O'Bryan",
      "helpful_votes": 0,
      "publication_date": 20201014
    },
    {
      "title": "Awesome cover. A bit pricey but worth it",
      "text": "Awesome cover. A bit pricey but worth it. Was able to save a few $ though warehouse deals open box (turned out to be brand new). Install was about 30 minutes. Cover feels solid and looks sleek. You won't be disappointed. There was a tiny bit of water that came in from the rear corner but that doesn't bother me as I have a drop in liner and the water will just go down the grooves. I may have left a tiny gap in the seal during install.",
      "rating": 5.0,
      "verified": true,
      "author": "Easy E",
      "helpful_votes": 0,
      "publication_date": 20171023
    },
    {
      "title": "Bak industries makes great products. In the past ive had thier hard ...",
      "text": "Revolver x2 was just what i was looking for. Bak industries makes great products. In the past ive had thier hard folding covers but love this concept. Real easy to put togther if you have installed at least one tonneau cover before. Cover fits perfectly rolls up nice and easy. The only flaw i really see is the clip on the cover should be in a vertical position versus horizontal but thats minor in the grand scheme of things. Great product and I would reccommend this cover to anyone whos looking for that security and low profile design",
      "rating": 5.0,
      "verified": true,
      "author": "flav",
      "helpful_votes": 2,
      "publication_date": 20160828
    },
    {
      "title": "Requires time to align unit to vehicle.",
      "text": "Can’t believe I paid over $950 for this thing. Watched a video on how to install on my vehicle make and model. Most difficult part of install is alignment as it has to be perfect for locking mechanism to catch on both side of cover. Spent almost two hours trying to get it just right and now, every time I close the tailgate, the cover pops open. Need to spend more time to try and finesse the alignment of cover but shouldn’t have to if it was made better. Not happy with the price paid and item received.",
      "rating": 1.0,
      "verified": true,
      "author": "VinRan",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "Great cover, easy to install and safe and secure cover",
      "text": "It arrived on the scheduled day and the packaging was excellent. Some negative reviews mentioned shoddy packaging, but they must be competitors because the box and packing was fantastic. This Tonneau cover was easy to install by using the Youtube installation video. It only has two positions closed and fully rolled open. Wish the bars would lock in various stages of open. Very solid and secure on the bed, does NOT shift around. No leaks yet. It is exactly what I was looking for. Easy to unroll and secure.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephen Van Pelt",
      "helpful_votes": 0,
      "publication_date": 20180604
    },
    {
      "title": "Fit well. Little pricy for what u get. Good customer service.",
      "text": "So far so good. Easy to install. Looks good. Need to wait on durability; not sure about how it will age in sun but we shall see. Missing a few parts but customer service sent right away so all worked out.",
      "rating": 4.0,
      "verified": true,
      "author": "EEE",
      "helpful_votes": 0,
      "publication_date": 20190923
    },
    {
      "title": "I'm very happy with this.",
      "text": "Install: Relatively easy if you know how to install basic things. I think I might have to do some adjusting to keep it truly flat. Water Resistance: Had a little bit of water after a day of raining, but it really was minimal. Value: It's certainly not cheap, but I thought this was very well made. My family loves how easy it is to move out of the way and I think it looks super sharp on my truck.",
      "rating": 5.0,
      "verified": true,
      "author": "Myk",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "Easy to install and well made.",
      "text": "The cover is easy to install and is well made. I would purchase this product again. The price seems high to me, but nothing is for free in this world.",
      "rating": 5.0,
      "verified": true,
      "author": "Patrick Bumgardner",
      "helpful_votes": 0,
      "publication_date": 20200811
    },
    {
      "title": "Best cover and perfect fit for my F150",
      "text": "Cover install was very straight forward and easy to figure out. I watched the You Tube video before the install and that was a time saver. The cover fits perfect and adds to the great look of the F150. Live in Washington state and it rains often no leaks just follow the sealing instructions and its good to go. Bonus 5-7 miles to the gallon increase on the freeway.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191026
    },
    {
      "title": "Disappointed",
      "text": "The cover fits too tight at the tailgate of my 2017 F150 Super Crew cab truck and you can't close it with the cover in place. I followed all the instructions to the letter. I contacted the seller here and they told me I had to contact the manufacturer as they were just a dealer. I am disappointed to say the least.",
      "rating": 2.0,
      "verified": true,
      "author": "Kelly G.",
      "helpful_votes": 0,
      "publication_date": 20171213
    },
    {
      "title": "Great bed cover",
      "text": "I ordered an open box/returned bed cover and when it arrived it was in absolutely perfect condition and was obvious it had never been out of the box, put it on my F150 by myself with just a little difficulty in getting it lined up square but not too bad. This thing is great, easy to roll, easy to latch, and very secure. Would definitely recommend this to anyone looking for a bed cover.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20160702
    },
    {
      "title": "Overpriced and disappointed",
      "text": "The installation was easy enough, but the weather stripping started to peel up and the foam that was adhered to the trucks spray in bedliner started to peel away almost immediately. The soft top cover came slightly torn away from the aluminum roll up. Overall, slightly disappointed with a product that I paid good money for. If i were to buy another cover, I’d go for a trifold that is 1/4 the cost.",
      "rating": 4.0,
      "verified": true,
      "author": "Steve",
      "helpful_votes": 0,
      "publication_date": 20200608
    },
    {
      "title": "So Far So Good",
      "text": "I've had the Revolver X2 for a week now. I like it so far. Installation was straightforward - no problem -- though I do recommend watching a demonstration video before you try it yourself. I took it through the carwash to see if it kept water out. There was a bit of a drip down the inside of the tailgate, but not bad. I do like the security of the hard cover and the ready access to the bed with the cover rolled up.",
      "rating": 4.0,
      "verified": true,
      "author": "Rowland Reed",
      "helpful_votes": 0,
      "publication_date": 20190302
    },
    {
      "title": "Missing hardware",
      "text": "Box arrived opened & without any mounting hardware. Rails & cover seem to be of solid construction so if I am ever able to to it on, I will update my review. The low rating is directed more at Truck Hero for the poor packaging & delivery method.",
      "rating": 2.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20190308
    },
    {
      "title": "Nice Cover",
      "text": "Nice cover since this is the second truck I’ve put one on. The only issue I’ve had is the one for my 2020 truck the rubber seal on the side rails already are peeling back at the ends of the rails. I would have expected theses seals to be attached better then just an adhesive. Also, compared to all the options out there this cover is on the pricey side",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200219
    },
    {
      "title": "Clean looking and weather proof",
      "text": "Locks down nicely, can be a pain to install. Took me a while because I kept re-checking it. I've heard problems about them leaking when it rains, yet have yet to have mine leak yet. Looks real slick and keeps my bed clean. I have a 2016 F150 XLT with lineX spray liner in the bed.",
      "rating": 5.0,
      "verified": true,
      "author": "Andre Perez",
      "helpful_votes": 0,
      "publication_date": 20180612
    },
    {
      "title": "Looks and works great",
      "text": "This cover is perfect. Easy to roll up and secure. Can use the whole bed unlike the fold up covers. Looks really good as well.",
      "rating": 5.0,
      "verified": true,
      "author": "mark",
      "helpful_votes": 0,
      "publication_date": 20191002
    },
    {
      "title": "Can't handle the heat.",
      "text": "After having this cover for 1 1/2 years. The vinyl cover started cracking. It's been almost 2 years since I first installed it. The rubber is separating from the top that has splits all over. If you live in a hot area. It is not going to hold up.",
      "rating": 2.0,
      "verified": true,
      "author": "Charles Spicer",
      "helpful_votes": 0,
      "publication_date": 20200709
    },
    {
      "title": "Not a good product",
      "text": "The buckles on this product are terrible. The are not manufactured to handle the light stress of buckling and unbuckling the straps which hold the cover rolled up. The first buckle broke with the first attempt to unbuckle it, 5 minutes after installation. The customer support is unresponsive. What good is a warranty it you can’t get any one to respond. I would not recommend this product.",
      "rating": 1.0,
      "verified": true,
      "author": "S. Sarcona",
      "helpful_votes": 0,
      "publication_date": 20180606
    },
    {
      "title": "... of these (for different trucks) and both have been easy to install",
      "text": "I've purchased two of these (for different trucks) and both have been easy to install. They look great and people do ask what brand it is. I do like the fact that I can roll the cover up and it doesn't block the back window.",
      "rating": 5.0,
      "verified": true,
      "author": "JaBu",
      "helpful_votes": 0,
      "publication_date": 20180628
    },
    {
      "title": "Great design solution",
      "text": "Well made, high quality. perfect solution for my F150 bed. Easy to roll back. It really is waterproof.",
      "rating": 5.0,
      "verified": true,
      "author": "Garry Luterek",
      "helpful_votes": 0,
      "publication_date": 20190913
    },
    {
      "title": "Great truck bed cover, innovative design",
      "text": "I am very satisfied with this cover. It was chosen after extensive research. This BAK cover was easy to install and fit the 5.5' bed of my 2016 Ford F-150 perfectly. Overstock.com delivered it quickly at a good price. I would definitely buy it again.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert J. Patton, Esq.",
      "helpful_votes": 3,
      "publication_date": 20160720
    },
    {
      "title": "Best of Both Worlds",
      "text": "Best Tonneau money can buy best of both worlds. Secure like a hard tonneau and Rollable like a soft. Takes no room from the bed of the truck. have it installed on my 2015 F150 6.5' bed will update if any issues arise. took about 45 min to a hour to install by myself.",
      "rating": 5.0,
      "verified": true,
      "author": "bwoithe",
      "helpful_votes": 0,
      "publication_date": 20160607
    },
    {
      "title": "very easy to install by yourself!",
      "text": "Product is American made! I needed another bolt to complete installation and the service department was easy too contact and they sent the missing bolt overnight by fed ex. The cover looks amazing and it simple to use. Fits and looks great on my new 2020 F150....Very happy with purchase!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Jim Owens",
      "helpful_votes": 0,
      "publication_date": 20200918
    },
    {
      "title": "Gteat looking bed cover",
      "text": "Perfect fit and is exactly what we were looking for. This cover looks and works so much better than those that sit above the truck bed. The install was fairly simple and took less than an hour. I’d give 5 stars, but the latches that hold the cover when it’s rolled up are cheap and will most definitely need to be replaced at some point.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180818
    },
    {
      "title": "bad seals",
      "text": "it works good but the top side seals keep on coming off.. the glue is not strong enough.. I will be calling revolver to see if I can get a replacement seal.",
      "rating": 3.0,
      "verified": true,
      "author": "oscar gonzalez",
      "helpful_votes": 0,
      "publication_date": 20180517
    },
    {
      "title": "It fits and works",
      "text": "Fits pretty well. Rolls up as advertised. The rubber reins on the side have a little glue coming out so you can tell they are mfg quickly and not super high quality... does the job.",
      "rating": 4.0,
      "verified": true,
      "author": "Dannytexas",
      "helpful_votes": 0,
      "publication_date": 20181111
    },
    {
      "title": "Easily installed and adjusted to the bed",
      "text": "Easily installed and adjusted to the bed. Took approximately an hour from start to finish. So far the only option that I would like to see is a better design for the straps that hold the open cover from rolling back.",
      "rating": 5.0,
      "verified": true,
      "author": "Suryc",
      "helpful_votes": 3,
      "publication_date": 20150915
    },
    {
      "title": "Poor finishes",
      "text": "Similar to other comments, this has the potential to be a good top, but the attention to details by the manufacturer are poor. Some edging was crooked making for subpar seals, there was excess glue on the top and the ends of the seals were not glued down.",
      "rating": 2.0,
      "verified": true,
      "author": "it is awdpme",
      "helpful_votes": 0,
      "publication_date": 20180911
    },
    {
      "title": "The right cover for me",
      "text": "Installed it on 2012 F150. Not hard to install, just took a little time to make sure it was aligned properly. Looks good. Have had it on for a few tanks of gas. I seem to be getting an extra mile per gallon. Easy to roll up. It was the right cover for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Melinda Ryan",
      "helpful_votes": 0,
      "publication_date": 20200322
    },
    {
      "title": "Not good in hot climate",
      "text": "Product does not hold up in the arizona heat. The glue gets hot and the fabric starts to separate from the aluminum. It started coming apart within the first year with the rubberized foam weatherstripping to come off first and now the vinyl fabric is peeling off.",
      "rating": 2.0,
      "verified": true,
      "author": "J. Jenell",
      "helpful_votes": 0,
      "publication_date": 20190529
    },
    {
      "title": "Great cover",
      "text": "Bought two of thes for two different truck. Install is easy. Works great.",
      "rating": 5.0,
      "verified": true,
      "author": "MRC",
      "helpful_votes": 0,
      "publication_date": 20181215
    },
    {
      "title": "LEAKS!!",
      "text": "Overall the product quality is good. However, it leaks at the tailgate. I would explore other options prior to purchasing this product.",
      "rating": 2.0,
      "verified": true,
      "author": "Austin John",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "Fantastic Cover - 2018 Ford F150 Platinum Edition",
      "text": "Perfect cover for my new 2018 F150 Platinum edition. I love that it forms and almost complete seal but still makes my bed usable. Great product!",
      "rating": 5.0,
      "verified": true,
      "author": "IThinkMyFirstNameIsGermy",
      "helpful_votes": 0,
      "publication_date": 20180512
    },
    {
      "title": "Rubber seal in the sides that rest in the rails ...",
      "text": "Rubber seal in the sides that rest in the rails need to be longer and firmer. They buckle and water gets in. if you want a true seal then buy a hard cover that goes over the sides of the bed.",
      "rating": 3.0,
      "verified": true,
      "author": "Tester",
      "helpful_votes": 0,
      "publication_date": 20161210
    },
    {
      "title": "the quality of the product is great. the only thing I can possibly suggest to ...",
      "text": "the quality of the product is great. the only thing I can possibly suggest to make this better is to revise the instructions. some of the terms and sketches were probably clear to someone that lives and breathes truck covers, but i found it not so clear at times and had to rework a few sequences. but ... after it was done, i was very happy with it and still am happy after two months of having it.",
      "rating": 5.0,
      "verified": true,
      "author": "A Y Van Heugten",
      "helpful_votes": 0,
      "publication_date": 20160328
    },
    {
      "title": "very good product only minor problem when is too cold it ...",
      "text": "very good product only minor problem when is too cold it get stuck/frozen hard to open",
      "rating": 4.0,
      "verified": true,
      "author": "Raptor",
      "helpful_votes": 0,
      "publication_date": 20180205
    },
    {
      "title": "The bed cover is awesome. I have had at lot of compliments on ...",
      "text": "The bed cover is awesome. I have had at lot of compliments on how good it looks on my truck. I have went thru some pretty powerful car washes and have found no leaks. The only down side is when you roll it up and try to lock it in place the latches should have been placed vertical instead of horizontal. I have very large hands which makes it almost impossible to lock the straps into place.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20160321
    },
    {
      "title": "Product just as expected",
      "text": "Great compliment on my f150 and better alternative as opposed to a tool box",
      "rating": 5.0,
      "verified": true,
      "author": "Honest",
      "helpful_votes": 0,
      "publication_date": 20190609
    },
    {
      "title": "it works awesome to protect my cargo/tools and seems like it is ...",
      "text": "I waited way to long to get this for my truck. it works awesome to protect my cargo/tools and seems like it is very well built.",
      "rating": 5.0,
      "verified": true,
      "author": "ATW",
      "helpful_votes": 0,
      "publication_date": 20160416
    },
    {
      "title": "Three Stars",
      "text": "Good looking cover, but the finshed rail ends are sharp and exposed.",
      "rating": 3.0,
      "verified": true,
      "author": "Dana Pascoe",
      "helpful_votes": 2,
      "publication_date": 20180419
    },
    {
      "title": "Easy to install with one minor glitch",
      "text": "Easy to install with one minor glitch. Tail gate would not close but after discussions with customer service I removed the shims on the track and it fits perfectly. Some very tiny dribble leaks in the corners and tail gate but nothing to be concerned about. The other major plus for me is that it fits under the edge of the rails for my Trac Rac. My truck is a 2016 Ford F150 Super Crew short bed (6.5').",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170208
    },
    {
      "title": "Great bed cover",
      "text": "By far the best investment I have made in my.truck. An.amazing product.",
      "rating": 5.0,
      "verified": true,
      "author": "Gary Novy",
      "helpful_votes": 0,
      "publication_date": 20160323
    },
    {
      "title": "Does not work as intended.",
      "text": "This product did not secure as well oils have intended after hours of install. Product installed per directions and multiple videos... returned the item.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190313
    },
    {
      "title": "What's not to like. Great way to haul stuff without having to ...",
      "text": "What's not to like. Great way to haul stuff without having to mess with a topper. Just roll it up and it is out of the way if you need to haul larger items. We love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Georgeann Boerger",
      "helpful_votes": 0,
      "publication_date": 20171013
    },
    {
      "title": "Still looking for a good fit!",
      "text": "This is my second BAK cover, had one on 2012 F-150 with a great fit. After several adjustments, Still trying to get this one adjusted correctly for 2015 F-150. Still getting more water in bed when closed than with 2012 model.",
      "rating": 4.0,
      "verified": true,
      "author": "Anthony Grant",
      "helpful_votes": 0,
      "publication_date": 20160629
    },
    {
      "title": "Great product!!!",
      "text": "Installed on 2018 Ford F-150 XLT SPORT Great product, easy installation (took less than an hour) super fast shipping! Thank you will shop with again!",
      "rating": 5.0,
      "verified": true,
      "author": "CJ ",
      "helpful_votes": 0,
      "publication_date": 20180104
    },
    {
      "title": "Five Stars",
      "text": "Great product, easy to install. I have had it for a month. so far perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160308
    },
    {
      "title": "Good product, easy to install, despite the latching issue, I'm happy with it!",
      "text": "I've been driving through heavy rain and there is no water intrusion so far. The latching mechanism could use some improvement, I can only unlatch both sides properly if I pull the left side cable. Ex: if I pull the right side cable only, it unlatches the left side only.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170113
    },
    {
      "title": "Awesome tonneau cover",
      "text": "Awesome tonneau cover. Easy to install. I love the fact that when you roll up the tonneau cover it doesn't block my rear window.",
      "rating": 5.0,
      "verified": true,
      "author": "JR",
      "helpful_votes": 0,
      "publication_date": 20181011
    },
    {
      "title": "it looked great, then locking cable broke the first week it ...",
      "text": "Had to return the first one, was damaged in shipping. Received a second one, installed on truck, it looked great, then locking cable broke the first week it was installed!! Not a good product. For the price I expected better",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170422
    },
    {
      "title": "Drop in bed liner makes installation a bit trickey.",
      "text": "Great price, fast delivery, in excellent condition for a returned item. Took longer to install then advertised because of my drop in bed liner. After a few miner adjustments, worked out perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Tony",
      "helpful_votes": 0,
      "publication_date": 20161107
    },
    {
      "title": "The rails got a little bent in shipping but easy fix. Absolutely love this cover",
      "text": "Installed it in less than an hour. The rails got a little bent in shipping but easy fix. Absolutely love this cover!!",
      "rating": 5.0,
      "verified": true,
      "author": "chris",
      "helpful_votes": 0,
      "publication_date": 20170407
    },
    {
      "title": "Awesome, once I got all the parts",
      "text": "Awesome, once I got all the parts. BAK made it right but I have no idea how the reseller sold this without rails.",
      "rating": 5.0,
      "verified": true,
      "author": "JC",
      "helpful_votes": 0,
      "publication_date": 20160318
    },
    {
      "title": "Nice cover not as this as I was hoping and ...",
      "text": "Nice cover not as this as I was hoping and the end at the tailgate doesn't really have a seal. Some water will get in but not too bad",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161227
    },
    {
      "title": "Great Product (go BAK Industries website to learn more about ...",
      "text": "Great Product (go BAK Industries website to learn more about it). Lowest Price I could find and I am very happy with it",
      "rating": 5.0,
      "verified": true,
      "author": "Rick",
      "helpful_votes": 2,
      "publication_date": 20160317
    },
    {
      "title": "Awesome cover",
      "text": "Great cover for the bed. Easy to use and install. Leaks at the corners. Going to need to design something to add to prevent the leaking.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170617
    },
    {
      "title": "BAK Industries Truck Bed Cover",
      "text": "This bed cover is simple to install and offers a surprisingly good seal between the cover and bed. Cover has been exposed to heavy rainfall and no moisture is visible within the bed so it can be safe to presume that any contents placed within the bed would remain dry. Quality appears to be good and the only complaint that can be made is that it makes slight contact with the edge of the tailgate which inhibits the tailgate to lock and release as smoothly had there been no bed cover.",
      "rating": 4.0,
      "verified": true,
      "author": "Dan M.",
      "helpful_votes": 2,
      "publication_date": 20160611
    },
    {
      "title": "Great addition to my FX4",
      "text": "Fast delivery and amazing product. I use my truck bed so much more!! Heavy rain didn't leave a drop in the bed. Love my Revolver X2!!",
      "rating": 5.0,
      "verified": true,
      "author": "Scott B",
      "helpful_votes": 0,
      "publication_date": 20160505
    },
    {
      "title": "THE PERFECT TOP",
      "text": "45 min. to install. Very easy. Sturdy and no one is going to get into it. Everything it says it is and more. Very sharp looking sitting flush with the bed rails. Rolls up easy. Only comment is it does not roll up supper compact. Sometimes it is a bit oblong when rolled up. Just an observation. I would definetly put this on any truck I have. Did I mention it arrived in two days. That is crazy!",
      "rating": 5.0,
      "verified": true,
      "author": "D. Johnson",
      "helpful_votes": 0,
      "publication_date": 20160825
    },
    {
      "title": "It fits and works well and looks great.",
      "text": "It was everything I expected without any surprises. It fits and works well and looks great.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160330
    },
    {
      "title": "A truly versatile cover",
      "text": "A high-quality product I was very satisfied with the fit and finish",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20160616
    },
    {
      "title": "Great cover for a F-150 sport 4x4 trim and lifestyle.",
      "text": "The package came damaged (thanks Fedex) so it was not possible to install (it was purchased from a 3rd party seller not from Amazon) Luckily Amazon stepped in and helped to ease my losses. Also BAK Industry has a good support, they are a little bit slow (all units are made to order) but other than that it was OK. The Revolver X2 is an excellent 5 star product. The above rating has been given for the shopping experience.",
      "rating": 2.0,
      "verified": true,
      "author": "ProBravo",
      "helpful_votes": 0,
      "publication_date": 20160914
    }
  ],
  "product_meta": {
    "title": "BAK Revolver X2 Hard Rolling Truck Bed Tonneau Cover | 39327 | Fits 2015-20 Ford F150 6'6\" Bed",
    "description": "Size:6' 6\" Bed| Style:2015 - 2020| Color:Glossy FinishThe Revolver X2 aluminum hard rolling truck bed cover made with durable aluminum slats that sit flush with the truck bed for a stylish, low profile appearance. The Revolver X2 takes security to the next level with its patented rotational locking rails that secure the cover along the entire length of the truck bed. This cover also features cab and side rail seals to help protect cargo against inclement weather. To provide even more security, the RX2 is secured by locking your truck’s tailgate, giving you the convenience of a roll-up cover, with the security of a hard-fold cover. The Revolver X2 hard rolling tonneau opens at either side of the bed via a release cable underneath the cover and is operational with just one hand. The Revolver X2 rolls up tight against the cab without obstructing your rear-view window and is secured with an integrated buckle system. The RX2 offers an extra layer of convenience, featuring felt strips underneath the truck bed cover to protect your hand from the aluminum underbelly in extreme temperatures. The Revolver X2 is proudly made in the USA and backed by BAK’s US-based customer support team, as well as a 3-year guarantee.",
    "rating": 4,
    "feature_bullets": [
      "Fits 2015-20 Ford F150 6'6\" Bed",
      "UNRIVALED SECURITY – The Revolver X2 features patented rotational locking rails to secure the cover the entire length of the bed, cab & side-rail seals, as well as an integrated latching mechanism to lock the cover with the tailgate",
      "UNRIVALED DURABILITY – The RX2 hard rolling truck bed cover is constructed with a gloss vinyl material overlaying a sheet of durable aluminum slats capable of withstanding up to 400 lbs. of evenly distributed weight",
      "UNRIVALED CONVENIENCE – The RX2 releases with a hidden cable on either side of the truck bed. It rolls up tight against the cab and is secured by integrated buckles for full bed access, 3rd brake light visibility, & 5th wheel compatibility",
      "5.UNRIVALED SUPPORT –The BAK Revolver X2 hard rolling tonneau cover is proudly made in the USA. The RX2 is backed by a US-based customer support team and a 3-year guarantee"
    ],
    "specifications": {
      "Manufacturer": "Bak Industries",
      "Brand": "BAK",
      "Model": "39327",
      "Item Weight": "80 pounds",
      "Product Dimensions": "84 x 12 x 11 inches",
      "Item model number": "39327",
      "Is Discontinued By Manufacturer": "No",
      "Exterior": "Black",
      "Manufacturer Part Number": "39327",
      "OEM Part Number": "39327",
      "Folding": "No",
      "ASIN": "B00YVJ3850",
      "Customer Reviews": "4.0 out of 5 stars153 ratings4.0 out of 5 stars",
      "Best Sellers Rank": "#42,893 in Automotive",
      "Date First Available": "June 4, 2015"
    },
    "categories": [
      "Automotive Parts & Accessories",
      "Tonneau Covers",
      "Truck Bed & Tailgate Accessories",
      "Automotive",
      "Exterior Accessories"
    ],
    "price": 969.88
  }
}