{
  "website_summaries": [
    {
      "verdict": "This lightweight and easy to use model is powerful enough for average-sized bedrooms and living rooms, making it the most versatile model we considered.",
      "pros": [
        "10,000 BTUs is an impressive output for a air conditioner that is as portable as this one",
        "Has enough cooling power to handle a room up to 250 sq",
        "ft., which means it can cool all but the largest of bedrooms as well as many living room areas",
        "Three operating modes include a dry mode, which allows the unit to operate as a dehumidifier, removing up to 2.6 pints of moisture an hour",
        "Great for climates where the humidity climbs as high as the temperature in the summer months"
      ],
      "cons": [
        "This model runs louder than some models we considered"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Much better than a window unit I think",
      "text": "I used this machine all summer and it worked flawlessly. A bit noisy but that can be expected when the compressor is located inside. Much better than a window unit I think.",
      "rating": 5.0,
      "verified": true,
      "author": "Kunjae",
      "helpful_votes": 9,
      "publication_date": 20180625
    },
    {
      "title": "Delivered a repack product.",
      "text": "Very disappointed that I got a repack item. The bottom side of the box was missing but taped so I can see-through the item. Once I opened the box I saw the damaged plastic pipe so I didn't bother to check other parts of the item.",
      "rating": 1.0,
      "verified": true,
      "author": "Hana",
      "helpful_votes": 6,
      "publication_date": 20180821
    },
    {
      "title": "NO stars",
      "text": "This air conditioner is a piece of crap. In high humidity it runs only 2 hours before water needs to be emptied. There should be a rating for NO stars. I’m disgusted.",
      "rating": 1.0,
      "verified": true,
      "author": "Elizabeth",
      "helpful_votes": 7,
      "publication_date": 20180727
    },
    {
      "title": "Noisy air conditioner...",
      "text": "I really had no idea how noisy this machine ( air conditioner ) was going to be. Always have to have the television volume turned up to hear it clearly when the air conditioner is running. It does cool the room very well almost to the point of too cool. Very effective product.",
      "rating": 4.0,
      "verified": true,
      "author": "Albert P. Clark",
      "helpful_votes": 7,
      "publication_date": 20180805
    },
    {
      "title": "Highly recommended! Only problem we had is upon opening it",
      "text": "This has saved us many sleepless nights due to being overheated in Southern CA ! Highly recommended ! Only problem we had is upon opening it, one of the four wheels on the bottom was broken ... haven't called the company about it though, must've forgotten because of how good overall the product is ! ha",
      "rating": 5.0,
      "verified": true,
      "author": "Vanessa",
      "helpful_votes": 7,
      "publication_date": 20171123
    },
    {
      "title": "Powerful and easy to use.  Cools my whole apartment!",
      "text": "This thing is great! It effectively cools my 750 sq. foot apartment. Easy to set up and use and very powerful.",
      "rating": 5.0,
      "verified": true,
      "author": "Shannon Davis",
      "helpful_votes": 10,
      "publication_date": 20170829
    },
    {
      "title": "Works",
      "text": "the machine works great but customer service bites have been trying to get broken wheel replaced. I have 2 year warranty on machine but all i need is a new wheel but if i do not get one i will return whole machine which i think is very stupid just for a wheel.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20180901
    },
    {
      "title": "Like others have noted",
      "text": "Like others have noted, it's not quiet. and unfortunately for us our only window(s) are behind the couch - which is near the tv. Our apt is a little bigger than what it's supposed cool but it does the trick.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20170717
    },
    {
      "title": "Don’t waste your time",
      "text": "Didnt work right out of the box. I am extremely disappointed with LG products anymore. The hassle of returning this as well makes it all the worse.",
      "rating": 1.0,
      "verified": true,
      "author": "UAmazon Customer",
      "helpful_votes": 4,
      "publication_date": 20180802
    },
    {
      "title": "Meh",
      "text": "It's ok. Pretty loud. Cools down our living room just enough on hot days. Would be nice if it worked better, maybe more powerful. It seemed to struggle and never went lower than 78°",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20171119
    },
    {
      "title": "We love them and have them in our bedrooms and living ...",
      "text": "This is my 3rd one of these. We love them and have them in our bedrooms and living room.",
      "rating": 5.0,
      "verified": true,
      "author": "Kyle N.",
      "helpful_votes": 2,
      "publication_date": 20180621
    },
    {
      "title": "Unit needs to be drained often.",
      "text": "Unlike other units that condensation is evaporated internally, this unit needs to be drained regularly.",
      "rating": 3.0,
      "verified": true,
      "author": "Smitty",
      "helpful_votes": 2,
      "publication_date": 20190513
    },
    {
      "title": "Arrived broken. Like product but need good one right away.",
      "text": "Arrived broken. Like product but need to get a replacement sent right away. Returning and then getting a replacement takes to long. Need air conditioner right now.",
      "rating": 1.0,
      "verified": true,
      "author": "Judy Martin",
      "helpful_votes": 3,
      "publication_date": 20180722
    },
    {
      "title": "Great for single room or tiny home.",
      "text": "I bought this to cool my studio style cabin where I live. It keeps the house generally about 10 to 20 degree cooler than it is outside which is really sagging something in 100° weather. It's kind of noisy but was really easy to get used to. I like how easy it is to clean the filter and drain the condenser.",
      "rating": 4.0,
      "verified": true,
      "author": "Ian Barreto",
      "helpful_votes": 0,
      "publication_date": 20180919
    },
    {
      "title": "Five Stars",
      "text": "Took it camping and keep my pop up cool as a cucumber!!",
      "rating": 5.0,
      "verified": true,
      "author": "P & M G.",
      "helpful_votes": 3,
      "publication_date": 20180613
    },
    {
      "title": "Stopped working during second season",
      "text": "This unit had very little use considering we only used it a few months per year and only a few hours a day. It appears the compressor has gone bad so we will need to shop for a new one.",
      "rating": 1.0,
      "verified": true,
      "author": "Lynne",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "It's rather loud",
      "text": "This portable A/C will do the job of cooling down a room, but it is loud. It would be better if the \"low\" setting was significantly quieter than the high setting; there is no discernible audible difference. Also, if you have the unit on \"dry\" have something next to it in back to catch the water drips.",
      "rating": 4.0,
      "verified": true,
      "author": "Annie O",
      "helpful_votes": 0,
      "publication_date": 20180827
    },
    {
      "title": "Good Product",
      "text": "We use this in our very large bedroom and it really does the job cooling the room. The unit is very heavy but the set up is pretty easy. We just leave the unit in place and store the hose and window piece in storage for when we need it during heat waves. I would recommend this product. I know some people have complained about the noise but we haven't been bothered by the white noise.",
      "rating": 5.0,
      "verified": true,
      "author": "Elaine Schlegel",
      "helpful_votes": 0,
      "publication_date": 20190913
    },
    {
      "title": "It cools but really does not chill. It's also ...",
      "text": "It cools but really does not chill. It's also on the noisy side and rather large for a 10K BTU air conditioner. But, having said that, you get what you pay for and this one is very affordable and dehumidifies almost to a fault. If that's what you want, you can't beat the price.",
      "rating": 3.0,
      "verified": true,
      "author": "Kelenhegyi",
      "helpful_votes": 2,
      "publication_date": 20170916
    },
    {
      "title": "It just doesn’t work well",
      "text": "Just doesn’t cool even an average sized bedroom. Ugly hose out the window. Don’t forget the tiny clear plastic plug for the water reservoir or you’ll have a big puddle on your floor. Oh, don’t lose it in the carpet either.",
      "rating": 2.0,
      "verified": true,
      "author": "Peri A Chamis",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "it only work for fore hours",
      "text": "If i could i would send this back to you because this one only work for4 hour then it stop cooling now i will have to buy a next one because this one is no good so there go's my money",
      "rating": 1.0,
      "verified": true,
      "author": "oliver williams",
      "helpful_votes": 0,
      "publication_date": 20190612
    },
    {
      "title": "LG is most of my home devices...",
      "text": "Satisfy for the unit of this price... Cut down my electricity bill but we still have our master bedroom nicely cool on hot days...",
      "rating": 5.0,
      "verified": true,
      "author": "Lamson B.",
      "helpful_votes": 2,
      "publication_date": 20190523
    },
    {
      "title": "Great Purchase For Me",
      "text": "My AC wasn't keeping my house cool in the hot days. Bought this to keep the bedroom areas where I want them. Great investment. It's not quite as portable as I thought, but a great purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "Richard Robinson",
      "helpful_votes": 0,
      "publication_date": 20181016
    },
    {
      "title": "Works like magic",
      "text": "Love it! Keeps my room nice and cool. It’s a little loud but that’s the only con and i think they’re all loud so just get this one because it has changed my life! I can finally get a good nights sleep in this 100 degree heat wave. Good stuff",
      "rating": 5.0,
      "verified": true,
      "author": "talina",
      "helpful_votes": 0,
      "publication_date": 20180724
    },
    {
      "title": "Better sleep",
      "text": "It cools the bedroom very nicely and makes sleeping more comfortable",
      "rating": 5.0,
      "verified": true,
      "author": "R. Boyd",
      "helpful_votes": 3,
      "publication_date": 20170809
    },
    {
      "title": "Not worth the money.",
      "text": "Not happy at all! This unit is loud and takes too long to cook off a small room. Will not buy again",
      "rating": 1.0,
      "verified": true,
      "author": "Merrridith Larsen",
      "helpful_votes": 0,
      "publication_date": 20190727
    },
    {
      "title": "Much needed relief",
      "text": "Used it in an extremely hot kitchen. Not cold by any means, but brought the temperature down about 20 degrees.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20170817
    },
    {
      "title": "I purchased this unit to cool my bedroom only",
      "text": "I live in a one bedroom apartment that is almost the size of an efficiency apartment. I purchased this unit to cool my bedroom only. It is very loud when it runs and it was unable to effectively cool my room to even 80 degrees. Furthermore, the device became so hot after running I became afraid to use it. I actually knew someone who purchased this same model and stated the same issues. I am disappointed with LG on this one.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20180726
    },
    {
      "title": "Keeps me cool in 100's deg weather",
      "text": "it is exactly what I wanted for a small office. Keeps me cool in 100's deg weather. The price was right also.",
      "rating": 5.0,
      "verified": true,
      "author": "John Witkowicki",
      "helpful_votes": 0,
      "publication_date": 20180816
    },
    {
      "title": "Works well for medium room.",
      "text": "Works very well for medium sized bedroom. Easy to install and setup. You will need to drain water buildup ocassionally from the unit. Be prepared for that.",
      "rating": 5.0,
      "verified": true,
      "author": "Mario Flores",
      "helpful_votes": 0,
      "publication_date": 20180809
    },
    {
      "title": "Awesome portable a/c !  LG..Exceeded my expectations!",
      "text": "I live in Fl. and use A/C almost all year!! I have had central air and window units! I read reviews and researched portables! I am so very impressed with this lg portable! It blows cold, cold air ! You wouldn't know it was on! Planning on buying another ! Comes with remote! If you want an awesome portable a/c lg is one to strongly consider!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20180619
    },
    {
      "title": "Nice cold air",
      "text": "Air conditioner works really well, keeps bedroom nice and cool. Set up was quick and easy. Timer function is a nice addition.",
      "rating": 4.0,
      "verified": true,
      "author": "ken wiggins",
      "helpful_votes": 0,
      "publication_date": 20190804
    },
    {
      "title": "Works Well",
      "text": "Works well, best of my 3 AC units so far.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180716
    },
    {
      "title": "Five Stars",
      "text": "very nice has noise but all fans do. easy to use",
      "rating": 5.0,
      "verified": true,
      "author": "Marty mcfly",
      "helpful_votes": 0,
      "publication_date": 20171202
    },
    {
      "title": "I love my LG portable air conditioner.",
      "text": "I love it! I wish it was a little quieter though.",
      "rating": 5.0,
      "verified": true,
      "author": "Kim J. Savela",
      "helpful_votes": 0,
      "publication_date": 20180923
    },
    {
      "title": "Great unit!",
      "text": "The unit works great! You have to empty the tray occasionally, but my son has it in the garage/bedroom and it keeps it really cool!",
      "rating": 4.0,
      "verified": true,
      "author": "Valarie",
      "helpful_votes": 0,
      "publication_date": 20170816
    },
    {
      "title": "Defective and hazardous product",
      "text": "This item is completely defective and hazardous. I went to use it for the first time and water is literally pouring out of a hole in the middle back part of the unit after about 15 minutes of usage. I'm not using this on dry mode so there shouldn't any issues like this. The water isn't even coming from the location where the drain is supposed to be.",
      "rating": 1.0,
      "verified": true,
      "author": "AmazonCustomer",
      "helpful_votes": 5,
      "publication_date": 20170924
    },
    {
      "title": "solid portable AC for the price",
      "text": "Pros: It cools the air, and does it pretty well. The included window adapter and weatherstripping work fine. Cons: Noisy! Most people would be unable to sleep in the same room. No oscillating louvers. The fan is always on, even when it is not cooling.",
      "rating": 4.0,
      "verified": true,
      "author": "Jonathan G Nicol",
      "helpful_votes": 4,
      "publication_date": 20170810
    },
    {
      "title": "Dont buy this! Runs like a TRUCK!",
      "text": "Terrible Product! Runs like a Truck! Too Noisy! What is more ridiculous is that even with the A/c off, just the FAN mode, it makes so much noise. This may be meant for Garages, definitely not for homes.",
      "rating": 1.0,
      "verified": true,
      "author": "Phani9",
      "helpful_votes": 4,
      "publication_date": 20170807
    },
    {
      "title": "Looks great and works great for apartment",
      "text": "Perfect for an apartment. The cats love to lounge infront to enjoy the cool air too! Looks great and works great. Installation was no problem.",
      "rating": 5.0,
      "verified": true,
      "author": "Sally_L",
      "helpful_votes": 2,
      "publication_date": 20170915
    },
    {
      "title": "Broken",
      "text": "‘self evaporating’ feature doesn’t work, leading me to empty out the water basin every 2 hours. It also arrived a day late, and to someone elses house. So, if you want to get a random person on your street a broken air conditioner, this product is for you!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180730
    },
    {
      "title": "Sucks this product sucks.",
      "text": "I am so disappointed with this purchase these units are not as good as window units. They are not quiet they never shut off even when it gets to the temperature you set it on it keeps running. It does not even cool my Living Room which is only a 12 by 20. Set It for 72 and a few hours later it was 80 in here. I will be returning this unit and going back to window units.",
      "rating": 1.0,
      "verified": true,
      "author": "Terry Beaver",
      "helpful_votes": 4,
      "publication_date": 20180513
    },
    {
      "title": "Had better ones",
      "text": "Had one similar years ago. However, this one needed to be emptied after 2 hours of use. Product returned.",
      "rating": 1.0,
      "verified": true,
      "author": "J. S.",
      "helpful_votes": 3,
      "publication_date": 20170814
    },
    {
      "title": "It is a waste of time and money",
      "text": "Don't buy this. It is a waste of time and money. Very loud, and did not cool room past 74 degrees, oh yeah did I mention how loud it is.",
      "rating": 1.0,
      "verified": true,
      "author": "Melissa G.",
      "helpful_votes": 0,
      "publication_date": 20170816
    },
    {
      "title": "Empty Often, Yet Works",
      "text": "The water reseviour fills up quickly. Within 2 solid days of the machine running at full blast, it shut off and needed to be emptied. The highs were at or just above 100 degrees. Due to the reseviour filling up quickly, I gave it 4 stars. Otherwise, it works as described. Easy set up, moves easily. I have a DeLonghi portable air conditioner (from Costco)in another room that is slightly quieter and has not needed to be emptied. It has been running for at least two weeks.",
      "rating": 4.0,
      "verified": true,
      "author": "T. Carlson",
      "helpful_votes": 4,
      "publication_date": 20170626
    },
    {
      "title": "Very poor quality",
      "text": "This item worked for a few days, it is no longer functioning. Huge waste of money, terrible quality.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20170725
    },
    {
      "title": "Do NOT use this in a bedroom if you expect to sleep!",
      "text": "We bought this as an emergency because our air conditioner had died and we're in the middle of an awful heat wave. We installed it as soon as it arrived yesterday. Not the most attractive set-up but that's okay. The noise level is horrendous. It kept us both awake for most of the night. Our room is a bit more than half the size it says it cools and it still hasn't hit the 70 degree mark we set it for. This is definitely not worth the money. We will get rid of it before next season and find one that will allow us to sleep!",
      "rating": 1.0,
      "verified": true,
      "author": "Bobbi ",
      "helpful_votes": 2,
      "publication_date": 20180906
    },
    {
      "title": "DON\"T BUY IT!",
      "text": "Update!! This unit leaked water throughout my son's room and now we have to have it professionally cleaned, if not replaced! The smell of mildew has already started in his room. This is my 3rd one like this and I'm done with this brand and model! Also, This product is SO loud not even earplugs work! In addition,10,000 BTU is not powerful enough. It takes 5+ hours to cool down my 250 sqft room!",
      "rating": 1.0,
      "verified": true,
      "author": "RT",
      "helpful_votes": 2,
      "publication_date": 20180725
    },
    {
      "title": "Poor",
      "text": "Struggles to cool a small room, window units work better in my experience. I live in a high humidity environment but never have to empty the water so that's the pro of this machine. Also not as efficient as window units, rarely get to temperature even on higher temps. Edit 7/23/18 It's mid summer so days are 90F and above, the unit can't handle it. it doesn't even cool to 80F degrees. This is the worst big purchase i've made. Completely worthless in comparison to the window units I have tried in the past.",
      "rating": 2.0,
      "verified": true,
      "author": "Michael Murphy ",
      "helpful_votes": 7,
      "publication_date": 20180607
    },
    {
      "title": "Lg air",
      "text": "To noisy. Plus you have to drain every day if you are using constantly.",
      "rating": 3.0,
      "verified": true,
      "author": "Alfonso",
      "helpful_votes": 8,
      "publication_date": 20170812
    },
    {
      "title": "Attractive, functional and easy to install",
      "text": "It has been a hot summer in Los Angeles, and we bit the bullet for a portable air conditioner to cool down our master bedroom. Using the provided parts place the outlet vent in a vertical window took only a few minutes. On turning on the unit, we noticed the cooling air immediately and found the noise level to be very acceptable. On a moderately hot afternoon, the room quickly became chilly. Our initial impressions are very favorable.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew Shaddock",
      "helpful_votes": 0,
      "publication_date": 20180826
    },
    {
      "title": "DO NOT BUY WILL NOT COOLS YOUR SPACE",
      "text": "Do NOT buy this unit. Paying a premium price DOES NOT mean you’ll get a good product. This does not cool a space. I was using it for a space exactly the size as recommended and while the air blowing out may feel slightly cool it’ll run for hours and the thermostats don’t drop. I work in construction and know these installs and machines well and I am not incorrectly using it nor am I incorrectly reading the temp. This is juts a piece of crap and I’m kicking myself for not testing it before the return date",
      "rating": 1.0,
      "verified": true,
      "author": "Stephanie",
      "helpful_votes": 0,
      "publication_date": 20190803
    },
    {
      "title": "The BEST!",
      "text": "These air conditioners are the best! I absolutely love them! I can have my setting low (( which I love)) and it keeps the entire room at whatever temp I choose. If I change my mind, the remote control works fine! These are my favourite. We got them when our central air died. We got a famous brand installed but I still have my unit in my room as I love how cool it keeps my room! Very easy to install and very easy to operate. Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "Trecia Stewart",
      "helpful_votes": 0,
      "publication_date": 20190402
    },
    {
      "title": "wouldn't cool a large space",
      "text": "I have had the unit for about two weeks and haven't had any problems! I bought this for a small bedroom, wouldn't cool a large space , but works for indiviual use.",
      "rating": 5.0,
      "verified": true,
      "author": "Laceydanielle",
      "helpful_votes": 3,
      "publication_date": 20170706
    },
    {
      "title": "Cold",
      "text": "This is my second one and it works great and the auto on and off is good to have, it helps me sleep better at night",
      "rating": 5.0,
      "verified": true,
      "author": "Larry Turner",
      "helpful_votes": 0,
      "publication_date": 20190411
    },
    {
      "title": "Works well, very loud, added $200 to monthly electric bill",
      "text": "It's a nice AC unit and keeps a 12 x 15 room cool BUT it is very loud and added over $200 to our monthly electric bill (we left in on all month). If you have an old dog, this thing really provides a lot of comfort on hot days and nights. If you hook the hose up to a window it is very quiet outside and won't bother neighbors.",
      "rating": 4.0,
      "verified": true,
      "author": "Norman E. Basham Jr.",
      "helpful_votes": 0,
      "publication_date": 20180905
    },
    {
      "title": "I recommend purchasing this instore somewhere to avoid this problem",
      "text": "My product cools the room off well. In fact, this is my second purchase of this exact unit. The other one didn't fail, by the way. I had to give it away when I moved across the country. My first one I purchased at home depot. This time around, home depot didn't have them in stock due to them being a seasonal item. I opted to order from Amazon. It appears to be just as effective. The only concern is that it leaks! I am guessing it has to do with shipping. It would be difficult to ensure UPS/Fedex handles such a product properly. I recommend purchasing this instore somewhere to avoid this problem.",
      "rating": 4.0,
      "verified": true,
      "author": "stephanie currier",
      "helpful_votes": 4,
      "publication_date": 20171127
    },
    {
      "title": "Good room A/C unit  UPDATED",
      "text": "Good unit that cools a medium size bedroom well. PROS Complete installation kit Full function remote control Good control panel features, including start/stop/delay timer functions and self diagnostic error code display Cools room quickly Good instruction manual CONS Larger and nosier than unit it replaced Remote control switch labels are very small font, poor contrast, nearly impossible to read Outflow director only adjustable up and down, no side to side adjustment UPDATE - after two summers' use, the unit still works well.",
      "rating": 4.0,
      "verified": true,
      "author": "Jim Schmidt",
      "helpful_votes": 13,
      "publication_date": 20170715
    },
    {
      "title": "Good value for price.",
      "text": "Great air conditioner. A little loud but it doesn’t prevent me from falling asleep, if anything it provides nice white noise to sleep to. Air is cold and the dry setting also cools down the room which I did not expect (our dehumidifier that we keep in the basement makes it very hot). Bought this ac unit because we have casement windows and cannot use a window unit. Very happy with the unit",
      "rating": 4.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 0,
      "publication_date": 20180717
    },
    {
      "title": "Works great...but you'll definitely pay for it",
      "text": "This is right near my bed, but also works very well for the whole room. I can't seem to find a filter to clean, however. Where is it? While this machine works well, your electric bill will double, perhaps even triple. That, you will not like.",
      "rating": 4.0,
      "verified": true,
      "author": "Damon Devine",
      "helpful_votes": 0,
      "publication_date": 20180927
    },
    {
      "title": "Right price and we have three. Different years old too.",
      "text": "We now have three of these. I know it works like it suppost to do no need to purchase another brand. This price fit our budget.",
      "rating": 5.0,
      "verified": true,
      "author": "Judy Barn mom",
      "helpful_votes": 0,
      "publication_date": 20190203
    },
    {
      "title": "does what it's supposed to do",
      "text": "Thi is your typical portable A/C. If you plan on getting multiple ones, single remote can controll all of them.",
      "rating": 4.0,
      "verified": true,
      "author": "S",
      "helpful_votes": 0,
      "publication_date": 20180615
    },
    {
      "title": "LG not making good on one year old $350 air conditioner.",
      "text": "I gave this product below star schoolers because LG is doing nothing about this air-conditioner we purchased. It stopped working just over a year after we purchased.",
      "rating": 1.0,
      "verified": true,
      "author": "Jennifer",
      "helpful_votes": 0,
      "publication_date": 20190723
    },
    {
      "title": "nice but loud.",
      "text": "Keeps the house very cool during the summer months, but wish it wasn't so loud.",
      "rating": 5.0,
      "verified": true,
      "author": "she77brw!",
      "helpful_votes": 0,
      "publication_date": 20180918
    },
    {
      "title": "Smart buy for the savvy, energy conscious consumer.",
      "text": "Set it up in the room you spend the most time in and you can save a lot of money on your air conditioning bill.",
      "rating": 5.0,
      "verified": true,
      "author": "jack arnest",
      "helpful_votes": 0,
      "publication_date": 20180127
    },
    {
      "title": "Cold great",
      "text": "So far so good upon test. Bought it for another power failure during a hurricane but have not had one yet thank God.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171006
    },
    {
      "title": "Five Stars",
      "text": "Really like it. A little noise but it is more like white noise sound. Love it.",
      "rating": 5.0,
      "verified": true,
      "author": "zingaro",
      "helpful_votes": 0,
      "publication_date": 20171028
    },
    {
      "title": "Kept our 1500 sq ft home comfortable. 92 degree heat didn't add much to our ...",
      "text": "Kept our 1500 sq ft home comfortable. 92 degree heat didn't add much to our electric bill. Bought one for your son.",
      "rating": 5.0,
      "verified": true,
      "author": "Murna Louise",
      "helpful_votes": 0,
      "publication_date": 20171003
    },
    {
      "title": "Cooler Nights!",
      "text": "Cools our bedroom only but the only reason we bought it is so we could sleep during the few hot nights in the summer. Not for cooling large ares but we're satisfied with the performance.",
      "rating": 4.0,
      "verified": true,
      "author": "CZ Foxx",
      "helpful_votes": 2,
      "publication_date": 20170820
    },
    {
      "title": "Five Stars",
      "text": "Works beautifully and keeps our living room nice and cool. Love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Kirsten",
      "helpful_votes": 0,
      "publication_date": 20170708
    },
    {
      "title": "My son is using this at his room. He ...",
      "text": "My son is using this at his room. He is complaining of loud noise of the unit but get used to it.",
      "rating": 5.0,
      "verified": true,
      "author": "Jess Ysalina",
      "helpful_votes": 8,
      "publication_date": 20161226
    },
    {
      "title": "Great unit / 2nd Purchase / Recommend",
      "text": "This is the 2nd time we purchased this unit, it has worked so great for us. One in the bedroom and the new one for our living room. It’s a small price to pay for cool, sweet comfort. And my husband said that the electric bill is only about $20 dollars more month. Installs easy and works like a charm! Definitely recommend- we live in Calif, so using the dehumidifier function never came up, but the cooling system is fantastic.",
      "rating": 5.0,
      "verified": true,
      "author": "RG in CM",
      "helpful_votes": 2,
      "publication_date": 20180718
    },
    {
      "title": "Showed up plugged in and made a loud noise, ...",
      "text": "Showed up plugged in and made a loud noise, had to fix it myself, was a piece of copper tubing hitting the inside wall, did not want to send it back because it was too darn hot out and I really needed it.",
      "rating": 1.0,
      "verified": true,
      "author": "Mark D Kreifels",
      "helpful_votes": 0,
      "publication_date": 20170807
    },
    {
      "title": "Five Stars",
      "text": "Works great! It sucked that it didn't have the window kit, but we needed an air conditioner for my son's room and this was a pretty good deal. His bedroom is pretty large and has an attached bath. This unit has no problem keeping it cool for the boy who obviously came from the North Pole!",
      "rating": 5.0,
      "verified": true,
      "author": "Stomkat",
      "helpful_votes": 11,
      "publication_date": 20160325
    }
  ],
  "product_meta": {
    "title": "LG LP1015WNR 115V Portable Air Conditioner with Remote Control in White for Rooms up to 250-Sq. Ft.",
    "description": "Room to room, house to house or home to work, LG’s portable air conditioner is the ideal climate-control solution for when you’re on the go. With a sleek contemporary design, this free-standing portable unit blends in with any room decor. The auto evaporation system allows for continuous use and with the programmable 24-hour on/off timer, you can control the temperature even when you’re not there.\n\nIn addition to cool and fan only modes, this versatile unit also has Dry mode to remove excess humidity from the room without additional cooling.\n\nIn October 2017, the Department of Energy implemented a new test procedure to determine the BTU rating of portable air conditioners. The procedural change has adjusted the amount of BTUs allowed to be claimed downward by as much as 50%. There have been no internal changes to these units, and the functionality remains the same. Please refer to room size guidelines to find the portable air conditioner that best meets your needs.Dry Air Flow (CFM):200cooling power:10000",
    "rating": 3.8,
    "feature_bullets": [
      "Portable air conditioner for a room up to 250 sq. ft.",
      "10000 BTU (ASHRAE-128 Standard) / 6500 BTU (DOE 2017 Standard)",
      "Uses a standard 115-volt/15 amp electrical outlet (6-ft. long power cord)",
      "Operating modes include cool, fan only, and dry",
      "Dry mode removes up to 2.6 pints of moisture per hour. Cooling power: 10000 btus"
    ],
    "specifications": {
      "Product Dimensions": "11.81 x 17.03 x 31.28 inches",
      "Item Weight": "55 pounds",
      "Manufacturer": "LG",
      "ASIN": "B00ZUX6FX8",
      "Item model number": "LP1015WNR",
      "Customer Reviews": "3.8 out of 5 stars156 ratings3.8 out of 5 stars",
      "Best Sellers Rank": "#767,025 in Home & Kitchen",
      "Is Discontinued By Manufacturer": "No",
      "Is Assembly Required?": "No",
      "Warranty Description": "1 year limited parts and labor.",
      "Batteries Required": "Yes",
      "Included Components": "Portable air conditioner, remote control, mesh filters, installation kit, manual, warranty",
      "Import Designation": "Imported"
    },
    "categories": [
      "Home & Kitchen",
      "Portable",
      "Heating, Cooling & Air Quality",
      "Air Conditioners"
    ],
    "price": ""
  }
}