{
  "website_summaries": [
    {
      "verdict": "Nice additions to your gel color collection, but the curing light and other necessary items must be purchased separately.",
      "pros": [
        "A collection of gel polishes that offer pretty colors and hold up fairly well",
        "A 6-piece set that features subtle, pastel colors",
        "Finished results create glossy shine when used with base and top coats",
        "Polish has been known to wear for up to 2 weeks when applied properly"
      ],
      "cons": [
        "Polish consistency is fairly thick",
        "Doesn't include a UV LED light or base and top coats",
        "Some customers received the wrong colors"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Best gel nail polish [and I have tried a lot!]",
      "text": "I always thought that writing reviews about nail polish was kind of silly. However, I decided to take the time to write a review about this brand because of its quality. I have been doing my own manicure with gel nail polish since 2011. I have tried all brands, expensive and inexpensive and then I found Gellen. This brand is extremely inexpensive, great quality, keeps the shine and of course, does not chip. The picture taken is a manicure that I did almost three weeks ago. As you can see still looks good even though the color is dark. I have bought more colors and if I need more I will buy this brand for sure. Highly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "Rosa Maria Share",
      "helpful_votes": 277,
      "publication_date": 20181216
    },
    {
      "title": "Very satisfied",
      "text": "I love Gellen gel polish! I’ve been doing my own gel nails from home since June and have tried several brands of gel polish. Recently, I purchased two, 6 polish bottles and love every. single. color. So far, I’ve used three of the 12 colors and noticed they mostly require three coats of polish to completely cover the nail. But that’s not a bad thing! I prefer it, as it seems to make the nail stronger and more chip resistant. I will definitely be purchasing more sets in the future. I already have a few picked out.",
      "rating": 5.0,
      "verified": true,
      "author": "Leah Villagomez",
      "helpful_votes": 248,
      "publication_date": 20191023
    },
    {
      "title": "Pro Results: Quick, Easy, & Affordable!",
      "text": "I LOVE this brand and the color varieties of gel polishes. I have tried other brands and they have started peeling off by day two. I have had my polish on for a week and still look great! Obviously I'm not a pro at applying the gel but for it being my first time I must say it's quite simple and you definitely save yourself major bucks than getting them done. Similar results for less, I won't complain!",
      "rating": 5.0,
      "verified": true,
      "author": "C.C",
      "helpful_votes": 244,
      "publication_date": 20190919
    },
    {
      "title": "Great quality and price",
      "text": "I love this nail polish. Super easy to apply and it is great for my girls who often smudge their polish right after I paint their nails. Great polish colors and easy soak off removal. Make sure you use the base coat first before hand so it lasts super long.",
      "rating": 5.0,
      "verified": true,
      "author": "Molly",
      "helpful_votes": 225,
      "publication_date": 20191014
    },
    {
      "title": "I love gellen",
      "text": "Love gellen nails. I’ve bought so many colors and I’ve never been disappointed. They are always long lasting and easy to apply. I’m so excited to try my new ones in more natural light colors with the glitter. I have to wait for my nails to grow out more, this photo I have taken is already 10 days and my nails still look amazing and new with gellen nails. In the color 025",
      "rating": 5.0,
      "verified": true,
      "author": "Mara9",
      "helpful_votes": 226,
      "publication_date": 20190915
    },
    {
      "title": "The Best!",
      "text": "Never going to a nail salon again!!! I absolutely love these polishes and love how easy it is to use them. I get compliments on my nails all the time and they last a good 2 weeks on me and still look like I just did them!",
      "rating": 5.0,
      "verified": true,
      "author": "KimberlyF",
      "helpful_votes": 220,
      "publication_date": 20190902
    },
    {
      "title": "I love it.",
      "text": "I really love this product, it last a month with a good care. I use gloves for doing my dishes or any cleaning I have to do in my house. I month its pretty good.",
      "rating": 5.0,
      "verified": true,
      "author": "Ing.",
      "helpful_votes": 218,
      "publication_date": 20191117
    },
    {
      "title": "Smile girls polish set",
      "text": "Includes colors number: 300, 229, 055, 054, 053, 207 (L to R in photo) I have used Gellen polish in the past and it’s of a great quality. The odor is relatively low. He packages of this are glass with small windows to see the color. 207 is a pinky peach opalescent",
      "rating": 5.0,
      "verified": true,
      "author": "NinjaCupcake",
      "helpful_votes": 244,
      "publication_date": 20180411
    },
    {
      "title": "This polish makes gel nails from home so easy!",
      "text": "I have gone to salons to get gel nails, but using this product is so easy that I don't need to pay more money for salon visits, when I can just do my nails myself at home. The longevity is great. I garden, do dishes, and lots of other activities and my nails have not chipped and they are still glossy and pretty.",
      "rating": 5.0,
      "verified": true,
      "author": "Brook Cox",
      "helpful_votes": 217,
      "publication_date": 20190928
    },
    {
      "title": "Color variety",
      "text": "I love these colors! They worked really well for me. I have used them on both my fingers and toes.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristina",
      "helpful_votes": 110,
      "publication_date": 20190919
    },
    {
      "title": "Great product and easy to do",
      "text": "Just what I have been looking for. Nail polish that lasts longer. For me this product lasted a week, but that is due to heavy use of hands without gloves, such as pulling weeded etc. The polish went on smooth and I was even able to do it all by myself on my non-dominant hand without being messy. Recommend this product for a GREAT at home gel experience without the cost and time of going to a nail salon.",
      "rating": 5.0,
      "verified": true,
      "author": "Cindy C",
      "helpful_votes": 219,
      "publication_date": 20190722
    },
    {
      "title": "Great quality for price",
      "text": "This was my gel polish so I don't really have anything else to compare it to. I thought it went on easy and the colors look nice. I used the grey on 4 nails & the grey sparkles on 1. I did 3 coats and cured with my UV/LED light for 1 minute each coat. I also used Gellish base & top coat along with the pH bond & cuticle oil. As a mom of 2 and working full-time, I'm curious to see how long it'll last. I ordered another set (Grey's/Greenish Blue's) and can't wait to try those colors!",
      "rating": 5.0,
      "verified": true,
      "author": "Ambers0709",
      "helpful_votes": 228,
      "publication_date": 20171119
    },
    {
      "title": "i have tried countless times to love this product but unfortunately i cant",
      "text": "this product kept on peeling off my nails after a couple of days i had no idea why, i have tried countless times to love this product but unfortunately i cant",
      "rating": 1.0,
      "verified": true,
      "author": "chywalaks",
      "helpful_votes": 21,
      "publication_date": 20180828
    },
    {
      "title": "Not what it used to be.",
      "text": "Been using this product line for a couple of years without any problems. The last 2 kits I purchased arrives with very very thick polish, far too thick to apply the necessary thin coats. I gave them a try anyways. Within 2 days it peeled off every single one of my nails! Very disappointed since it took me going thru a lot of duds to find a good product. Now it's back to the drawing board. I never received a reply to the email I sent the company either.",
      "rating": 1.0,
      "verified": true,
      "author": "Gloria B.",
      "helpful_votes": 3,
      "publication_date": 20200708
    },
    {
      "title": "Not worth the money...",
      "text": "The bottle is SUPER SMALL. I would be surprised if you can get more than 3 uses out of the bottle- that’s how small it is! Aside from the misrepresentation of its size- the colors are kinda sheer, so you’ll need to apply 2-3 coats. Really disappointed in this buy...",
      "rating": 2.0,
      "verified": true,
      "author": "Melissa",
      "helpful_votes": 9,
      "publication_date": 20180816
    },
    {
      "title": "Worst nail polish ever",
      "text": "Worst decision I've ever made. I have been doing nails for a few years now and have never had such a terrible experience. I just whipped out my NEW set of Gelen nail polish and had a difficult time from start to finish. It was very thick and stringy and was hard to spread over the nails. The nail polish would not cure whatsoever, and every layer would wrinkle up. It stayed sticky even after cleansing the nails, and immediately came off my nails by layers after finishing. I want a refund immediately.",
      "rating": 1.0,
      "verified": true,
      "author": "Katherine Lundien",
      "helpful_votes": 3,
      "publication_date": 20200501
    },
    {
      "title": "Good for price",
      "text": "I have only tried Elite99 before and I can say my experience with Gellen has been much better. Five days in and no chipping. Two stars off only because the polish is streaky and the colors are much different than samples so I can only really use two of the kit. Will update as I buy and use more",
      "rating": 3.0,
      "verified": true,
      "author": "Tonya",
      "helpful_votes": 5,
      "publication_date": 20181226
    },
    {
      "title": "Love this!",
      "text": "Great colors, stay on your nails for at least 3 weeks and you’ll get a lot of compliments on the beautiful colors!",
      "rating": 5.0,
      "verified": true,
      "author": "Olgie",
      "helpful_votes": 132,
      "publication_date": 20190531
    },
    {
      "title": "So Disappointed",
      "text": "I purchased the crayon color series. Not fond of the beige tones as they all look very similar. The biggest issue though is I cannot cure the polish. I use a 48 watt LED UV light and have attempted to dry, for as long as 6 minutes, and still ended up with a gummy and very dull finish. Even with only one coat. Small bottles and poor result don't equal the price.",
      "rating": 1.0,
      "verified": true,
      "author": "Elizabeth S.",
      "helpful_votes": 3,
      "publication_date": 20190618
    },
    {
      "title": "Colors were off",
      "text": "Colors were terribly inaccurate and very gloppy. Seemed like old thick nail polish.",
      "rating": 1.0,
      "verified": true,
      "author": "nikki dover",
      "helpful_votes": 7,
      "publication_date": 20190102
    },
    {
      "title": "Just ok...",
      "text": "—Feel free to ask me any questions about my review!— I Purchased this as part of a larger purchase to be able to do gel nails myself during quarantine. It does work but if you’re bad at doing your own nails, this only amplifies it. The paint does pool at the sides of your fingers and being a gel polish it only makes it harder to get off. Also, it took me three coats of the light pink to get it so it wasn’t streaky or transparent. I hope my description was of use to you! —Follow @CassandraMercedes on Instagram for more amazing Amazon finds!—",
      "rating": 3.0,
      "verified": true,
      "author": "Cassandra Mercedes Hanes",
      "helpful_votes": 0,
      "publication_date": 20200521
    },
    {
      "title": "My new fav, GELLEN!!!",
      "text": "Photo attached is 5 days. Washing dishes with no gloves. I normally purchase gelish brand or the dnd but I think I found an awesome new alternative. 6 colors for the price of 1 gelish mini. All colors are beautiful in this particular set. I thought this would be a bit more purple but I'm not disappointed. Cant wait to try the other colors. I think i will for sure get at least 2 weeks, more than the gelish brand. The bottles are glass and the polish itself is thick. I used 3 coats for this color. I think you can get by with 2.",
      "rating": 5.0,
      "verified": true,
      "author": "brandy blacklock",
      "helpful_votes": 19,
      "publication_date": 20190424
    },
    {
      "title": "Great Polish, lasts about 3 weeks!",
      "text": "This polish is just fabulous. It is my first time attempting gel polish on my own and this polish goes on evenly and lasts for several weeks. The ONLY issue I have with this company is that each polish had a hair on the brush that stuck out and had to be cut in order to not have any issues with application. Great polish at a great price.",
      "rating": 5.0,
      "verified": true,
      "author": "vcraig",
      "helpful_votes": 19,
      "publication_date": 20180819
    },
    {
      "title": "Great quality. Nice colors.",
      "text": "I ordered the Caramel Color set along with an LED light and the Gelish Brand base and top coat. I've only used this twice so far, but I love the colors and the quality. I have an issue with my gel polish chipping after 2 days when I get it done at the salon. I decided to give this a try and I'm glad I did! I was finally able to go a week without any chips! The colors from the Carmel set are all beautiful and seem to be good quality. As others mentioned, the key is to apply thin coats of polish.",
      "rating": 5.0,
      "verified": true,
      "author": "Osborn",
      "helpful_votes": 2,
      "publication_date": 20190226
    },
    {
      "title": "It is long last one to two weeks",
      "text": "It is very cute small bottles all colors are good I like it",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 19,
      "publication_date": 20191022
    },
    {
      "title": "beautiful",
      "text": "The colors are beautiful. They're easy to use and last very well. It isn't easy to remove, but gel polish sort of isn't so it's to be expected.",
      "rating": 5.0,
      "verified": true,
      "author": "starsx801",
      "helpful_votes": 18,
      "publication_date": 20190924
    },
    {
      "title": "Don't waste your money",
      "text": "Bought this because of the price and raving reviews it has. This nail polish is HORRIBLE. Never dries and is hard to apply. Very dissatisfied and even more disappointed I can't return this nail polish and get my money back.",
      "rating": 1.0,
      "verified": true,
      "author": "MMV",
      "helpful_votes": 2,
      "publication_date": 20200525
    },
    {
      "title": "Long wear - no chips!",
      "text": "I usually pay $40 for one gel manicure at a nail salon and finally decided to get everything to do my own at home. I’ve had my manicure for a full week, so far, and there’s no chipping, lifting, nothing. I constantly wash my hands so the longevity of this gel polish brand is superb! Can’t wait to try the other color collections.",
      "rating": 5.0,
      "verified": true,
      "author": "Danielle Prado",
      "helpful_votes": 2,
      "publication_date": 20190901
    },
    {
      "title": "Long last",
      "text": "I like all these colors. It last for about 2 weeks. Nice quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Aleksandr Sribnyi",
      "helpful_votes": 19,
      "publication_date": 20190706
    },
    {
      "title": "Quite Sheer, not Opaque enough",
      "text": "Have used 3 times, and each of the colors is quite sheer . . . to make opaque, many coats are needed; usually 4 thin coats or 3 thicker coats. The obvious problem being that if you like your nails not to be bulky or thick, you'll have to work at it. The colors are very pretty and understated. I have not yet used the white all by itself, but it does not seem to be a very \"bright\" white. It was a good \"starter\" set while I learned how to do my own gels; works well over builder base. Bottles are very small, good for several uses per bottle. Glitter colors are quite pretty.",
      "rating": 4.0,
      "verified": true,
      "author": "LCKV",
      "helpful_votes": 0,
      "publication_date": 20200726
    },
    {
      "title": "Yes! I want all the colors!!",
      "text": "I love these gel polishes! In a fairness they are the only gel polish I’ve tried lol but I’m not motivated to switch. I will say they do not last long but I think that’s my fault being a former nail biter I pick at the edges near cuticles until I mess them up so badly I need to change. But also I get bored so after 4 days I’m ready to change colors. I’ve had the polish stay on nice looking for up to 8 days but that only happened once. The bottles are small but this price point is usually the cost for one bottle of gel polish (OPI). The colors are fantastic",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth A. Long",
      "helpful_votes": 0,
      "publication_date": 20200402
    },
    {
      "title": "Great Colors!",
      "text": "Great nail polish! However, when buying it it was so frustrating to not see the nail polish color product description. I bought the pack of baby pinks. It includes 2 glitter polishes (one silver and one purple), a solid white, a solid light baby pink, a pink that’s one step darker (like bubblegum) and a pink that’s a little darker than that. Great polish but bottles were smaller than I thought...but still very happy with this purchase!",
      "rating": 4.0,
      "verified": true,
      "author": "Amy ",
      "helpful_votes": 0,
      "publication_date": 20200407
    },
    {
      "title": "Application is easy, great for beginners and advanced.",
      "text": "I really love all of these colors! I’ve used two of them and they apply beautifully. Product consistency is fantastic i wish all products were this easy to work with. Honestly like it better than the professional products I can buy with a beauty license. I wish I could buy them separate in full size bottles because I know these will be gone quick seeing as I’m using them over enhancements as a licensed nail tech but 100% LOVE these.",
      "rating": 5.0,
      "verified": true,
      "author": "Rae",
      "helpful_votes": 3,
      "publication_date": 20181122
    },
    {
      "title": "Didn’t get what I ordered",
      "text": "I ordered the “sweet roses” color collection and received what may be a “Christmas collection”? I received a glitter red and green and a taupe brown color. As far as longevity, I am basing that on use of Gellen at a salon. Lasted about a week before starting to chip, which is better than regular polish but no where near OPI gel, which lasts 2+weeks on me. This is going back as I do not like the 3(out of 6) polishes that we’re not supposed be in this collection.",
      "rating": 3.0,
      "verified": true,
      "author": "Annemarie",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "NOT THE COLOR AS PICTURED- MORE NEON THAN MUTED",
      "text": "When I received this set, I opened them to see the colors. The colors in the bottles look brighter/more neon than what is pictured here. For instance the peach color (pictured on the far left) looks like a muted spring peach. In reality, the color is very bright NEON peach. A trashy color for a lady's nails. If your under 25 or don't have a serious job than this color might be for you. Also, the bottles are SUPER TINY.",
      "rating": 1.0,
      "verified": true,
      "author": "Lisa E.",
      "helpful_votes": 4,
      "publication_date": 20180523
    },
    {
      "title": "Just like the salon!",
      "text": "This nails polish was amazing! Went on well and quickly cured under the light... I think I was done in like 10mins max! It took me longer to cut my cuticles and prep my nails! It reminds me exactly of the gel manicures at the salon, I’m a week into wearing it with no chips! I also use my hands constantly and they get wet all the time too, so far so good! Much better value than the $40 bucks you spend at the nail salon!",
      "rating": 5.0,
      "verified": true,
      "author": "Don",
      "helpful_votes": 4,
      "publication_date": 20180714
    },
    {
      "title": "love it...",
      "text": "love this gel nail polish great product ,pigmented colors will buy again, will highly recommend to everyone...",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 18,
      "publication_date": 20191018
    },
    {
      "title": "Great price!!",
      "text": "Perfect gel polish! Love the colors! Works well with my uv lamp!",
      "rating": 5.0,
      "verified": true,
      "author": "jeannette",
      "helpful_votes": 19,
      "publication_date": 20190304
    },
    {
      "title": "Must have",
      "text": "I love these! Long lasting color. I will definitely get these again. I will admit the bottle sizes are small but it works better if you use a thin layer and then cure under UV/Led lamp for 30 seconds in between coats until you get desired color. DO NOT add thick layers. It will result in cracking and pulling of polish.",
      "rating": 5.0,
      "verified": true,
      "author": "Rechinda Sampson",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Pretty good",
      "text": "Pretty decent, I use this brand for all of my gel nails and over all the consistency and longevity are what you might expect out of a gel manicure. The main thing is I wish that there was a better way for them to show you the colors because I felt like some of them were a little duller and some of them were a little lighter, and I really bought this set mainly to add to my color repertoire. So I guess if you are just looking for more colors this is a great set but if looking for specifics then maybe it's a toss up",
      "rating": 4.0,
      "verified": true,
      "author": "nat_jax",
      "helpful_votes": 0,
      "publication_date": 20190612
    },
    {
      "title": "Really nice for first time user who is new to gel nails",
      "text": "I've used 2 of the colors. They work well and are easy to apply. There was some bubbling and chipping of the polish but that is more to do with me being new to doing gel nails at home. The first time I used too thick of coats and didn't cap the nails. 2nd try went much smoother. I really like the colors and the holo in the glitter colors are super pretty. Bottles are small but more than enough for several uses.",
      "rating": 5.0,
      "verified": true,
      "author": "MeowuiRose",
      "helpful_votes": 0,
      "publication_date": 20200324
    },
    {
      "title": "Great Product",
      "text": "I purchased the Gellen top and base coat and the Gellen Gel Polish Set Caramel Colors Series. The color set is a nice variety of shiny colors that are very appropriate for the Fall Season. Both the top and base coats and the color set appear to be professional quality products and so far they are lasting and staying on nicely. Shipping was fast and the product was packaged safely in bubble wrap inside a sturdy cardboard box. I recommend these products, they are a good value and quality.",
      "rating": 5.0,
      "verified": true,
      "author": "G&E",
      "helpful_votes": 0,
      "publication_date": 20191029
    },
    {
      "title": "Hmmm...not what I expected out of a Gellen product.",
      "text": "Out of all the magnets, only 2 of them work. One of them didn't have a magnet attached! Extremely easy to use. I had trouble with both the wine colored ones. Barely can see any effect on it, so I used some Halo Taco and made it shiny! It arrived as promised, and I will say very fast . Was really disappointed since this is Gellen. I use their products often....buy at your own risk.",
      "rating": 3.0,
      "verified": true,
      "author": "DW",
      "helpful_votes": 0,
      "publication_date": 20200610
    },
    {
      "title": "Good product. Saves me from going to the nail shop.",
      "text": "I was initially hesitant when I opened the package. At first I thought these were the wrong color. They all look beige in the bottle so I was upset. But when I tried them on, they are true to the picture. I ordered the “pink sheers” set. They are tiny bottles but they seem worth the price. Not sure how long it will last but so far it seems good. I like.",
      "rating": 4.0,
      "verified": true,
      "author": "Crystal Bennett",
      "helpful_votes": 0,
      "publication_date": 20200930
    },
    {
      "title": "We love",
      "text": "If it tells you anything this is the 3rd set I have bought I just feel like they're fun colors for the price and the nudes are beautiful and my daughter loves the dark or bright colors we will buy again. The only area for opportunity would be that they give the color and name instead of a number I don't think you can re order based off of the number you have to buy the kits but still fun if You're someone that isn't dedicated to a color",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190908
    },
    {
      "title": "Literally peels off within hours",
      "text": "This stuff comes off your nails within hours of applying. Idk if it's the top coat or the black polish itself in this kit, but the past two times I've used the black polish from here, the manicure hasn't lasted even a day.... I used gellen lamps, Gellen top coat, gellen base coat--there's no reason it should peel. It's so annoying. it's like the polish doesn't even cure under the lamp or something. I even did it for 90 seconds with really thin coats, and it's still coming off.",
      "rating": 1.0,
      "verified": true,
      "author": "Eren S.",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "Very difficult to remove gel polish",
      "text": "Unfortunately had to rate this one star. The colors are pretty and the product itself is great as it last with no chipping and does not loses its shine. Looks like a fresh manicure after a week. Unfortunately the big negative is that the gel polish is very difficult to remove. I’ve soaked for over an hour and still had to scrape off polish and re-soak.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20180930
    },
    {
      "title": "Love the colors!",
      "text": "Pretty please with the results. I am not perfect at doing gel nails but this definitely beats paying for gel nails every 2 weeks. Colors are accurate and I love the variety which allows the glitter to be layered onto a solid color. I used a different brand for the base and top coat and it worked perfectly.",
      "rating": 4.0,
      "verified": true,
      "author": "Roxanne Vanessa",
      "helpful_votes": 0,
      "publication_date": 20190922
    },
    {
      "title": "Love the colors!",
      "text": "Nice colors and they are not too loud. They're great contrasting colors when matching with others. I'm very satisfied with my purchase and will be buying more in the future.",
      "rating": 5.0,
      "verified": true,
      "author": "YasTop Contributor: Makeup",
      "helpful_votes": 18,
      "publication_date": 20180616
    },
    {
      "title": "Not what they pictured",
      "text": "Not very happy. I ordered the sweet roses gel polish set and what I got said sweet roses but there is a green glitter polish in it. I’ve never had issues with Gellen before and I’ll keep it this time simply because I needed one of the colors in the set. But I AM disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Kim K",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "Definitely must buy you love doing your nails at home",
      "text": "Totally obsessed with these polishes. It last 3 weeks on my nails. Totally love these colors for the fall season! I would totally get the other colors in the future. The only down fall is the polish itself it’s not too opaque. I had to use like 3 layers to get the color intensity I wanted. Other than that, the colors are beautiful. To me that’s not a problem, because for $20 it definitely save me a lot of money. Usually I get my gel nails manicure and pedicure for $60 including tips. For this set I can do as many times as it last. So, I’m very happy with this kit!",
      "rating": 5.0,
      "verified": true,
      "author": "Mandy Yu",
      "helpful_votes": 0,
      "publication_date": 20191117
    },
    {
      "title": "Great for the price",
      "text": "I finally decided to buy my own gel nail set due to Covid-19 and not wanting to go out to the salons. I’m pretty new to this. It took me a couple of tries to start making my nails look professional, but I’m getting better each time. From my experience this polish looks best the first week. It usually doesn’t last much longer than that for me. I really like these colors too.",
      "rating": 5.0,
      "verified": true,
      "author": "Merranda Michels",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "Do not recommend",
      "text": "Extremely hard to tell the difference between the pink colors. They have different numbers but I’m not entirely sure they are different colors. The polish is thicker than I’ve had in other gel polish. My manicure ended up peeling within a few hours of applying. I’ve never had that issue with any other gel I’ve used. I would not buy again!",
      "rating": 1.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 0,
      "publication_date": 20200214
    },
    {
      "title": "Not what I expected",
      "text": "Glitter is not like the pictures! Posted a photo of mine. Other than that the bottles were way small than I imagined. They worked well those next time wash off the bottles the case they come in leave little black felt dizzies everywhere and it go into my nail polished nails!!! I'm to lazy to take off and redo just a head up. I don't think I'd buy again",
      "rating": 3.0,
      "verified": true,
      "author": "Alley & Jay",
      "helpful_votes": 0,
      "publication_date": 20190720
    },
    {
      "title": "I love it",
      "text": "I am going to get this five stars. You can definitely get a salon quality nails the only thing that I want to put out is make sure you wipe your nails with alcohol if you want this to last. The color looks very similar and I wasn’t expecting that at all but they’re all good. It does come off easily- you can peel it off but I feel like some part of my nail is coming off.",
      "rating": 5.0,
      "verified": true,
      "author": "Eske",
      "helpful_votes": 0,
      "publication_date": 20200517
    },
    {
      "title": "Love the colors, easy to apply, last a reasonable time",
      "text": "I enjoyed this set. How long these last depends on how you do your nails and how you prep them. Also if you pick at them obviously they’ll last less. For me they last about 5-7 days but I am a picker and I don’t sand my nails down before I apply the polishes. Love the colors too. Two coats and it’s solid. Easy to apply too.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve and Kristina",
      "helpful_votes": 0,
      "publication_date": 20181113
    },
    {
      "title": "Not the colors that were pictured",
      "text": "These nail polish are good. They are thicker than what I've used before. But if you are looking for these specific colors.... do not buy these. I was super excited for the bright pink, and that isn't even in this set. I read other reviews that said they didn't get the colors picture either and I wish I would have looked for other gel nail polish and just passed these up.",
      "rating": 1.0,
      "verified": true,
      "author": "Ashley Williams",
      "helpful_votes": 0,
      "publication_date": 20190716
    },
    {
      "title": "Good Quality, Pretty Colors",
      "text": "Love the colors, good quality of gel polish! Did my mother in law’s nails with #317 (dusty pink) and only 2 coats.",
      "rating": 5.0,
      "verified": true,
      "author": "Tiffany Shin",
      "helpful_votes": 18,
      "publication_date": 20180824
    },
    {
      "title": "Inexpensive Gel Polish",
      "text": "If you’re looking for inexpensive gel polish these are great. I use Gelish normally, and gave this brand a shot after seeing the reviews. So far so good! Only thought it the color packs all seem to have a few colors that are very similar which is unfortunate if you’re looking to buy multiple packs.",
      "rating": 4.0,
      "verified": true,
      "author": "Juli Anne Gibson",
      "helpful_votes": 0,
      "publication_date": 20200522
    },
    {
      "title": "Not worth for an adult",
      "text": "Overall I loved this kit the colors are pretty and it was easy to apply. The nails looked great when I first did them but after a couple hours I was able to just peel most of them off and by today which is 24 hours the rest came off so maybe this will be cute for a kid or something but don’t expect to have that salon quality and last because this will not so it",
      "rating": 1.0,
      "verified": true,
      "author": "Brandi B",
      "helpful_votes": 0,
      "publication_date": 20200520
    },
    {
      "title": "The colors are so beautiful  😍😍😍",
      "text": "When I say I am in love, I am in love with these tiny babies. It's my first time using gel polish and after reading brand reviews I decided to buy these Gellen nail polishes. They are small and worked perfectly with the LED LIGHTS. Just cure each layer until it's dry before you do another coat. My favorites are the pink glitter, black and red ones. The white isn't very opaque and takes a few more coats to make it look even. But overall my nails are looking fire and I keep getting compliments. Thank you 😊😊😊",
      "rating": 5.0,
      "verified": true,
      "author": "Lixandra S.",
      "helpful_votes": 0,
      "publication_date": 20190702
    },
    {
      "title": "Great set!",
      "text": "Great set! The price can’t be beat for so many colors and they are beautiful in person. I got the shades of light pink and they’re just like the photos online. It was easy to apply and lasted well over a week! Usually gel polish falls off my nails after a few days but this lasted much longer. I put one layer of light pink under the sparkle and it made it pop even more, so I suggest doing that when using the sparkle polish. So happy with my purchase and will buy more!",
      "rating": 5.0,
      "verified": true,
      "author": "DSARM",
      "helpful_votes": 0,
      "publication_date": 20200224
    },
    {
      "title": "Love this polish!",
      "text": "I ordered this gel polish to use with my light. It’s one of the most durable I have used so far, I love the colors. It goes on smooth and it’s easy to do. I’m too cheap to get my nails done especially since I’m hard on my hands and it usually only lasts me a few good days. This way I am able to do them myself for just a small portion of the costs and it’s just as good as the salon! Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Meg",
      "helpful_votes": 0,
      "publication_date": 20190127
    },
    {
      "title": "Happy W Purchase",
      "text": "I’m beyond happy with this set. I’m a newbie to doing my own gel nails and may not return to nail salons after stay home orders from covid-19 release! The bottles are small which I like so I don’t have to over commit to a color given the polish does last me 2 full weeks when properly applied.",
      "rating": 5.0,
      "verified": true,
      "author": "H. Roberts",
      "helpful_votes": 0,
      "publication_date": 20200426
    },
    {
      "title": "Don’t waste your money on these",
      "text": "It just wont last. I tried all the colors, more than once and with OPI base and top coat. Two layers, 3 layers, thin, thick... it doesn’t last more than 7 days which is not expected for gel polishes. Better spend more in OPIs than throwing your money in the trash with these.",
      "rating": 1.0,
      "verified": true,
      "author": "Fernanda H.",
      "helpful_votes": 0,
      "publication_date": 20200517
    },
    {
      "title": "Disappointed",
      "text": "I have two other gellen sets that paint just fine. So far I have used to colors of this set and both colors pull away from the edge of the nail. I don’t know if the formula is separating or what, but I paint my nail and barely have enough time to finish my hand before I have to cure it so that the color doesn’t pull away. It’s like it won’t atick to my base coat. The coat won’t stay thin, it bunches up. I don’t know another way to describe it but I included a picture of the uncovered edge of my nail. I’m sad, I love these colors.",
      "rating": 2.0,
      "verified": true,
      "author": "justine",
      "helpful_votes": 0,
      "publication_date": 20180924
    },
    {
      "title": "Quality !",
      "text": "I was scared to try the polish at first because I have always used gelish polish. The polish turned out to be perfect and it lasted longer than I expected. It actually lasted longer than my gelish polish and the price for the set beats the price of gelish brand in which the price range for gelish sets is around 30 dollars. Overall great product and I would recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "jabria walker",
      "helpful_votes": 18,
      "publication_date": 20180804
    },
    {
      "title": "Low quality gel polish",
      "text": "You get what you pay for! I wondered why this 6 pack was the same price as one Gelish bottle of gel polish. The quality of this polish is not very high. It doesn’t cover well. The 3 solid pinks all look the same, and it does not stay on well at all!",
      "rating": 3.0,
      "verified": true,
      "author": "Kellie",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "Perfect for at home manicures",
      "text": "Bottles are fairly small but are very opaque and easy to work with. The polish does tend to peel after about a week but it's probably because I've been washing dishes/ doing housework so often. Other than that, the polishes are also not super thick and are easy to layer. Base coast, 3 layers of one of these polishes, cured in between each layer and a top coat will certainly get the job done.",
      "rating": 5.0,
      "verified": true,
      "author": "Valerie Zetino",
      "helpful_votes": 0,
      "publication_date": 20200420
    },
    {
      "title": "Great BUT has flaws",
      "text": "I love all the colors, they last very well but i did notice two out of the pack would always bubble up on my finger after uv lighting my nails. i thought maybe it was just how i did it that day or something but then i did. my moms nails and it did the exact thing to her ( weeks apart when i did my nails ) not sure if its because its a dark shade? or a defect... iit would be wet and peel right off and it was only 2 coats of polish. the other colors were fine!",
      "rating": 3.0,
      "verified": true,
      "author": "sarah",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "It’s ok",
      "text": "You know, they really don’t last 2 weeks, with that being said I can get about 7 days(some minor chipping) with this gellen polish(their top and base coat included). I am pretty rough with my hands at home and at work. So it’s really not a huge deal for me seeing as I’m just thankful for fast drying nails and longer lasting polish. Doesn’t take much to impress. Colors are fairly similar to photo. All in all not bad.",
      "rating": 3.0,
      "verified": true,
      "author": "Kevin&Kristen",
      "helpful_votes": 0,
      "publication_date": 20190319
    },
    {
      "title": "Nice Gel Colors, Easy Application",
      "text": "Not to shabby for a home manicure. Colors were very nice and went on smoothly for the most part. I’m sure had this been professionally done it would look much better, but considering we’re under a stay at home order and nail salons are closed it looks pretty nice !!!",
      "rating": 5.0,
      "verified": true,
      "author": "Carmen",
      "helpful_votes": 0,
      "publication_date": 20200504
    },
    {
      "title": "Beautiful polish",
      "text": "This product is Beautiful on your nails. My daughter and I have our cat eye nails done. We used polygel then applied base coat then 2 coats of the Gellen cat eye polish, following the detailed instructions will give you Beautiful nails.",
      "rating": 5.0,
      "verified": true,
      "author": "SM",
      "helpful_votes": 0,
      "publication_date": 20200622
    },
    {
      "title": "Not happy with my latest purchase",
      "text": "I have purchased some of this polish before and was very happy with it, so of course I wanted more colors. This last set I received soaks of for sure in hot water even. First time I thought maybe I didn’t pre my nails well enough so tried again with even different colors and same thing, as soon as I got out of the shower it was all bubbles and peeling again. I do not think I will spend more money if I need to do my nails every night. And yes I have an led light and it worked great with 1st set of colors I purchased.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20181030
    },
    {
      "title": "Good value, good product",
      "text": "Gellen is a good product at a reasonable price for gel nail polish. I liked this set because I do my own nails and will not use large bottles of every color. I can try several colors and buy large bottles of my favorites. I only use quality gel products, so Gellen qualifies.",
      "rating": 5.0,
      "verified": true,
      "author": "EC Rabe",
      "helpful_votes": 0,
      "publication_date": 20190910
    },
    {
      "title": "Beautiful colors",
      "text": "These colors were the second time I've ordered these. I love all the colors I've received. I love the set I received. I had a spa night scheduled for last night and it arrived in the morning. One of my friends picked the green color for her nails and it was beautiful. I do plan on ordering another set soon.",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley T of Just Bein' Mommy",
      "helpful_votes": 0,
      "publication_date": 20200226
    },
    {
      "title": "Colors are amazing",
      "text": "Wow! the colors are exactly like promoted. They are long lasting and these were super easy to use. I didn't require a lot of coats. Its was great. So glad I purchased them and I'll definitely be ordering this brand again",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200514
    },
    {
      "title": "Tacky.",
      "text": "Disappointed in quality, tacky texture, did not go on nail smooth.",
      "rating": 2.0,
      "verified": true,
      "author": "Mari",
      "helpful_votes": 2,
      "publication_date": 20190618
    },
    {
      "title": "beautiful colors. Applys well.",
      "text": "I love the colors and its pretty easy to use. I just got them today. The manicure it self was great! Everything set well and I have that smooth glossy finish that you get with this type of manicure. I will have to see how long it lasts but it feels solid. So far so good!",
      "rating": 5.0,
      "verified": true,
      "author": "Erin",
      "helpful_votes": 0,
      "publication_date": 20200613
    },
    {
      "title": "Good value for gel nail polish",
      "text": "These gel nail polish are good for their price. They do take forever to dry off even with a UV light. They last for 1-2 weeks depending what kind of job you do and how often you use your hands . The colors are cute. Good value for the money.",
      "rating": 3.0,
      "verified": true,
      "author": "Ajola",
      "helpful_votes": 0,
      "publication_date": 20200121
    },
    {
      "title": "Peels in just a few days",
      "text": "Polish peels in days not so happy with this product",
      "rating": 3.0,
      "verified": true,
      "author": "ronald bogle",
      "helpful_votes": 2,
      "publication_date": 20190616
    },
    {
      "title": "Pretty colors....",
      "text": "I love this brand of gel polish. I used the blue, the grey and the glitter. The blue needs about 3-4 thin coats to be solid enough but I still see a shadow where it’s a bit thin. On my toes I used white as a base and I still had to do 3-4 coats to make it look good. It was better with the white as a base.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200522
    },
    {
      "title": "Successful",
      "text": "I jumped on the bandwagon of doing my own gel due to covid. I’m a healthcare worker so wash my hands a lot. After ordering a few brands this is my go too. Nothing but success. I recommend this brand to all my coworkers.",
      "rating": 5.0,
      "verified": true,
      "author": "RadTech",
      "helpful_votes": 0,
      "publication_date": 20200510
    },
    {
      "title": "Very satisfied. 2 coats.",
      "text": "I am so pleasantly surprised with this product. I have used gelish for years. Wanted to find something cheaper if possible. Ran across this brand with its beautiful pallets. Bought 2 boxes of 6 for less than 2 bottles of gelish. This color went on in 2 coats! Gelish was 3 or 4. Very satisfied and happy to have found a cheaper brand with better quality!",
      "rating": 5.0,
      "verified": true,
      "author": "Brandi Scott",
      "helpful_votes": 0,
      "publication_date": 20181222
    },
    {
      "title": "Great!",
      "text": "I’m absolutely obsessed with the colors ! I got the sweet rose set. The two glitter colors are weird and honestly I probably would never use them but the actual colors are SUPER cute. One is a light pink, one was this super cute coral color, another is a hot pink, lastly there’s a more of a darker purplish pink. They aren’t in the biggest containers but honestly it’s more than enough if you’re ordering for just one person. Overall If you’re looking for a few nice pinks, I DEFINITELY RECOMMEND.",
      "rating": 5.0,
      "verified": true,
      "author": "Mania",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "Great polish",
      "text": "Beautiful colors! I have used the polish before love the wear factor that I receive from this polish! I also do my nails every 15 to 18 days because my nails grow fast. The colors are super vibrant!",
      "rating": 5.0,
      "verified": true,
      "author": "BeachLovers",
      "helpful_votes": 0,
      "publication_date": 20200417
    },
    {
      "title": "Pretty",
      "text": "Pretty colors but not exactly what’s depicted in the photo. Was hoping for the lighter colors to be “lighter” and more pinky nude. Honestly, I feel like I received the wrong color/shade group. But pretty nonetheless.",
      "rating": 4.0,
      "verified": true,
      "author": "Trixie",
      "helpful_votes": 0,
      "publication_date": 20200913
    },
    {
      "title": "Beautiful colors",
      "text": "Very pleased with my purchase. Once I got the hang of it they turned out great! Beautiful colors, I had to use 3 coats to make it a solid finish. Overall super impressed, already ordered more colors!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200414
    },
    {
      "title": "Pretty colors",
      "text": "Don't let me second toe that's longer than my big toe distract you from purchasing this polish. It's okay, ive embraced it. The colors are nice. The bottles are on the small side. Colors run a little thin, 3 or more coats needed. I used 2 coats.",
      "rating": 4.0,
      "verified": true,
      "author": "rebecca Richards",
      "helpful_votes": 0,
      "publication_date": 20200616
    },
    {
      "title": "Great value!!",
      "text": "Love this nail polish set! It’s very comparable to Gelish or other more expensive brands. I usually double cure the base and top coat and I get about 2 weeks of wear before they start to peel. The pinks and white are so pretty!",
      "rating": 5.0,
      "verified": true,
      "author": "Brittany",
      "helpful_votes": 0,
      "publication_date": 20200902
    },
    {
      "title": "Didn’t get colors advertised",
      "text": "I am super disappointed because I didn’t get the colors advertised. Beware. I have a green glitter and some different pinks. I wouldn’t have bought this one if I knew it was those colors.",
      "rating": 1.0,
      "verified": true,
      "author": "Katie G. ",
      "helpful_votes": 0,
      "publication_date": 20200325
    },
    {
      "title": "Great for the at-home manicurist!",
      "text": "This is my first ever attempt at doing my own gel nails and they turned out great! As other reviewers had mentioned, this is a thicker polish so always err on the side of thinner layers you can build up. The colors are accurate to the photos and I’m really pleased with the quality for the price. Definitely recommend for someone looking to do their own nails at home.",
      "rating": 5.0,
      "verified": true,
      "author": "Madeline L.",
      "helpful_votes": 0,
      "publication_date": 20200525
    },
    {
      "title": "So awesome!",
      "text": "I love this brand. I used to use Gelish but decided to order this brand. I am not disappointed. It’s so good, I’ve ordered a few sets. The bottles are small but in my opinion that’s better because I found that the large bottles of Gelish would get old before I could use it all. This works just as well as more expensive brands.",
      "rating": 5.0,
      "verified": true,
      "author": "Leandra Kay",
      "helpful_votes": 0,
      "publication_date": 20200201
    },
    {
      "title": "Tiny tiny bottles",
      "text": "The polish is good works great with light. My issue is the size. These are just tiny like sample bottles that gelish use. The ad is deceiving and that's why I won't re order sadly.",
      "rating": 3.0,
      "verified": true,
      "author": "Kat",
      "helpful_votes": 0,
      "publication_date": 20200924
    },
    {
      "title": "Goodbye nail salon!",
      "text": "These were so easy to use, and the colors are super pigmented! Do not sleep on these, you’ll never have to go to the salon again!",
      "rating": 5.0,
      "verified": true,
      "author": "Julie McCann",
      "helpful_votes": 0,
      "publication_date": 20190926
    },
    {
      "title": "Good variety for a good price",
      "text": "I put the white gel under the glitter ones in this bundle of polishes and they came out very vibrant. The glitter is holo and pretty. I'm a newbie and I found the consistency pretty easy to work with. It's only been about 4 days but still looking good. I like the amount of different colors you get, even though the bottles are little, for the price. Ideal for some just starting out with gel.",
      "rating": 5.0,
      "verified": true,
      "author": "Samantha M.",
      "helpful_votes": 0,
      "publication_date": 20200211
    },
    {
      "title": "Do Not Waste Your money",
      "text": "Absolute junk! You can see right though the colors even after 4 coats! Then the junky nail polish chipped off after two seconds. This is complete junk and I wish they would take it back! Absolute Crap",
      "rating": 1.0,
      "verified": true,
      "author": "Skportsmouth",
      "helpful_votes": 0,
      "publication_date": 20200403
    },
    {
      "title": "Very thick formula",
      "text": "First time using today. I expected the pink to look a little different, it is a very bubble gum / Barbie pink. The formula is very thick, and the applicator brush is quite wide. This formula makes application a bit challenging.",
      "rating": 3.0,
      "verified": true,
      "author": "LuMo",
      "helpful_votes": 0,
      "publication_date": 20200530
    },
    {
      "title": "Doesn't come out smooth",
      "text": "The nail polish comes out very uneven. It does not have a smooth finish. I don't like it. Not worth the money.",
      "rating": 2.0,
      "verified": true,
      "author": "Nicole",
      "helpful_votes": 0,
      "publication_date": 20200409
    },
    {
      "title": "Very thick, not very true to color pictured",
      "text": "The polish is very thick so it requires you to put on several thin coats to get a full color coverage and not have thick spots on the edges of your nails. I'm disappointed with the representation of the colors. The pale pink is almost white and the peach is really a pale orange. Not quite the nude look I was hoping for.",
      "rating": 2.0,
      "verified": true,
      "author": "TheFeline",
      "helpful_votes": 0,
      "publication_date": 20191031
    }
  ],
  "product_meta": {
    "title": "Gellen Crayon Series Gel Nail Polish Set - Classic Pastel Shade 6 Colors Collection Soak Off Nail Art Home Nail Gel Pedicure Manicure Kit",
    "rating": 4.1,
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "6.5 x 4.5 x 1.3 inches; 9.6 Ounces",
      "Manufacturer": "Guangzhou Himatt Network Technology Co., Ltd.",
      "ASIN": "B00ZOTR4RY",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Nail Art & Polish",
      "Nail Polish",
      "Beauty & Personal Care",
      "Foot, Hand & Nail Care"
    ],
    "price": 15.99
  }
}