{
  "website_summaries": [
    {
      "verdict": "The Vasque Inhaler II GTX proved that in terms of traction, comfort, and breathability, it is a boot that hikers can count on the trails. However, its imprecise fit did not appease the others. All in all, the Vasque Inhaler II GTX is an averagely priced light hiker that has qualities to look out for. Those with a wider foot, however, must look somewhere else.",
      "pros": [
        "Based on a handful of expert reviews, the Vasque Inhaler II GTX was indeed a lightweight hiking boot",
        "Its little-to-no break-in time was appreciated by a small group of gear testers",
        "Some users acknowledged how the Inhaler II GTX kept their foot dry after wet encounters",
        "Its breathability was superb, according to a lot of hikers",
        "A considerable number of users adored its great grip on wet surfaces"
      ],
      "cons": [
        "A couple of wearers were frustrated with its narrow fit",
        "An expert found the Inhaler II GTX from Vasque slightly expensive",
        "Some owners were annoyed when they experienced slippage inside the boot"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": 8.9,
      "source": "runrepeat"
    }
  ],
  "customer_reviews": [
    {
      "title": "Sizing is a challenge",
      "text": "This seems like a great shoe with good tread, but the sizing is a challenge. I typically wear a size 6.5 or 7, but ordered a 7.5 based upon the reviews. The 7.5 is so short, I feel my toes touching the front of the shoe. I can only imagine how small the shoes would feel during or after a hike. Unfortunately, the next size up is about twice as expensive as the size I bought, and outside my price range. I imagine these would make a solid hiking tool for someone who could find the correct size in a suitable price.",
      "rating": 4.0,
      "verified": true,
      "author": "SweetCaroline03",
      "helpful_votes": 0,
      "publication_date": 20190821
    },
    {
      "title": "Very comfortable and light weight",
      "text": "Very comfortable and light weight. I sized up by 1/2 size which gives me wiggle room and extra space for socks. The height gives me good ankle support and I can wear them tighter or looser with the easy lacing system.",
      "rating": 5.0,
      "verified": true,
      "author": "Retired",
      "helpful_votes": 10,
      "publication_date": 20160526
    },
    {
      "title": "Love these hikers",
      "text": "Love these hikers. Great multi-purpose boot. Like the ankle support--also, higher shaft keeps rocks out, too. Lightweight. Felt a little snug across the front of the foot, but now they've loosened up a bit with wear. I wear a size 9 typically in \"regular\" shoes, a 10 in running shoes. Went with the 10 and like having that room for swelling.",
      "rating": 5.0,
      "verified": true,
      "author": "Boot girl",
      "helpful_votes": 4,
      "publication_date": 20170627
    },
    {
      "title": "Light and Airy!",
      "text": "These hiking boots feel like my comfy running shoes. I was out to find a pair that were light in weight, yet supportive. This is it! My feet are happy and my legs aren't weighed down. I do, however, put Powersteps in these to give me more arch support, but I do that in all my shoes. I'd highly recommend these boots for all kinds of hiking.",
      "rating": 5.0,
      "verified": true,
      "author": "June H.",
      "helpful_votes": 2,
      "publication_date": 20170623
    },
    {
      "title": "Great boots for hiking and every day!",
      "text": "These are now my favorite boots. They're not made for the cold or anything like that, but they are definitely comfortable and solidly made. I have been wearing them almost everyday and they have become my go-to boots, even when it's cold. Only below freezing temps force me into my winter boots. They have good ankle support, they lace up super fast, and they have not let any water in so far. I'm a happy customer!",
      "rating": 5.0,
      "verified": true,
      "author": "Eubie M. Toro",
      "helpful_votes": 0,
      "publication_date": 20170213
    },
    {
      "title": "I have heard nothing but great things about these boots",
      "text": "I can't really give a review on this product. I had to return them because they were too short. ORDER A HALF SIZE LARGER. I ordered my usual size and my toes were at the very end of the boot. Unfortunately Amazon didn't have the size I need in order to reorder give a full review. I have heard nothing but great things about these boots, so I am looking forward to getting them and trying them out.",
      "rating": 3.0,
      "verified": true,
      "author": "Melissa N. Macdonald",
      "helpful_votes": 2,
      "publication_date": 20170309
    },
    {
      "title": "Odd Sizing",
      "text": "I got this a whole size up (I wear a 7 1/2, so I ordered an 8 1/2) based on reviews, and it was still too short in the toe. The toe area is an odd \"pointy\" shape, which made them uncomfortable. Had to return.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20170107
    },
    {
      "title": "Great shoes",
      "text": "Very comfortable. I took them out for a 3 hour hike. I didn't even have to break them in. Light weight and look good. I ordered a half size up 7 1/2(I wear a 7) like the other reviews suggested. They were right they fit perfect. The only reason I didn't give them 5 stars is because I didn't test the water proof",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170401
    },
    {
      "title": "Weird painful tongue",
      "text": "The tongue fit weird. It cut into the top of my foot and hurt. I must have retied and repositioned it a hundred times to no avail. Had to return",
      "rating": 1.0,
      "verified": true,
      "author": "S. H. Johnson",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "Great boots but they run a whole size too small",
      "text": "Great boots but they run a whole size too small. I’m a 7.5 but ordered an 8 and it was still too small. Sending back for 81/2",
      "rating": 4.0,
      "verified": true,
      "author": "Shawna",
      "helpful_votes": 0,
      "publication_date": 20180707
    },
    {
      "title": "These boots are so comfortable. They give great support to my arch",
      "text": "These boots are so comfortable. They give great support to my arch, are lightweight and I highly recommend them. I do wear an 8 1/2 in most of my shoes, so going by what others said I ordered the 9 and glad I did. They have room for my toes and they are the perfect length. I hope you like them as much as me!",
      "rating": 5.0,
      "verified": true,
      "author": "Sherri Masterson",
      "helpful_votes": 0,
      "publication_date": 20180113
    },
    {
      "title": "the best high top training shoes",
      "text": "these shoes si for hiking? i use it for trail running, training, cardio training. the best high top training shoes. feather light, breathable. i own 5 pair of this. i highly recommend these shoes!",
      "rating": 5.0,
      "verified": true,
      "author": "happywife8",
      "helpful_votes": 0,
      "publication_date": 20190519
    },
    {
      "title": "Great hiking boot for no break in time",
      "text": "Shoe fit great and worked amazing for me while hiking the Grand Canyon. I didn’t have time to break in new boots but these were the perfect fit for what I needed.",
      "rating": 5.0,
      "verified": true,
      "author": "Abby",
      "helpful_votes": 0,
      "publication_date": 20190916
    },
    {
      "title": "Rubbing",
      "text": "Not sure what the problem was , the side was rubbing so bad had to send them back may have been defect or my foot.",
      "rating": 2.0,
      "verified": true,
      "author": "Sam",
      "helpful_votes": 0,
      "publication_date": 20190911
    },
    {
      "title": "Highly recommend!",
      "text": "I was looking for new boots to accommodate a healing broken foot. These boots are super comfortable. I wore them straight from the box for 5 hours at work in great comfort. They are lightweight, yet supportive. So good looking that 2 people who saw them that day decided to order themselves a pair. Guess I can't say enough! I haven't tested their waterproofing yet though.",
      "rating": 5.0,
      "verified": true,
      "author": "Jan",
      "helpful_votes": 0,
      "publication_date": 20170212
    },
    {
      "title": "Great boot at a great price",
      "text": "First time I ordered without trying on first! It was perfect in every way. I look forward to getting a lot of miles on these boots. I love them.",
      "rating": 5.0,
      "verified": true,
      "author": "pamela sharp",
      "helpful_votes": 0,
      "publication_date": 20201025
    },
    {
      "title": "Great hiking boots!",
      "text": "Great for hiking. I know Vasque's typically run narrow and a little short, so I just ordered a 1/2 size up and it's perfect!",
      "rating": 5.0,
      "verified": true,
      "author": "kathi sullivan",
      "helpful_votes": 0,
      "publication_date": 20170228
    },
    {
      "title": "Elated with purchase.",
      "text": "Superior hiking shoes and the style is a bonus. Aside from the brick house construction, the shoe design is feminine and subtle.",
      "rating": 4.0,
      "verified": true,
      "author": "Michaela",
      "helpful_votes": 0,
      "publication_date": 20170120
    },
    {
      "title": "Don’t order big",
      "text": "I ordered a 1/2 size up because of reviews. Mistake! These r true to Vasque sizes. I missed my return window 😩",
      "rating": 3.0,
      "verified": true,
      "author": "Rachelle Kepler",
      "helpful_votes": 0,
      "publication_date": 20190719
    },
    {
      "title": "Five Stars",
      "text": "Love the color - perfect for hiking or wearing in the cold.",
      "rating": 5.0,
      "verified": true,
      "author": "Sheri",
      "helpful_votes": 0,
      "publication_date": 20180405
    },
    {
      "title": "love it",
      "text": "These shoes are great for treking and for casual use! I get complemts on them all the time and the colors match my pack!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170208
    },
    {
      "title": "Love them!",
      "text": "I bought this 2nd pair half size larger than what I usually buy and they fit fine! Used them last weekend and they are terrific, I live them! Have a lot of toe space and very good grab on the surface.",
      "rating": 5.0,
      "verified": true,
      "author": "C Abella",
      "helpful_votes": 0,
      "publication_date": 20161003
    },
    {
      "title": "Ankle support!",
      "text": "I love them! Super comfortable but also extremely supportive of your ankles.",
      "rating": 5.0,
      "verified": true,
      "author": "Alicia C. Baladi",
      "helpful_votes": 0,
      "publication_date": 20170108
    },
    {
      "title": "Five Stars",
      "text": "I love the mesh lining. Keeps feet cooler and very comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Kayhik",
      "helpful_votes": 0,
      "publication_date": 20180617
    },
    {
      "title": "Great fitting boots",
      "text": "These boots are awesome. I wear a size 8-81/2 shoe. Ordered an 81/2 and they fit great. Very lightweight and comfortable. Will be wearing for moderate hiking, snowshoeing... can't wait",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160808
    },
    {
      "title": "Five Stars",
      "text": "Just buy one half size larger than you would normally.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20160418
    },
    {
      "title": "My favorite shoe, for hiking and everything",
      "text": "These hiking boots are so comfortable, I'd rather wear them than tennis shoes for everyday use. For hiking, they stay very dry for the amount of mesh, are super lightweight, and have good traction and ankle support. I bought half a size up because I prefer to wear thicker wool socks while hiking. I noticed a little rubbing when I wore thinner socks, but with breaking in that should go away. These are my favorite pair of shoes - I've hiked in the rain through puddles and running water and in the city. Will try to update review after some mountain and beach hiking later this year.",
      "rating": 5.0,
      "verified": false,
      "author": "Esther H",
      "helpful_votes": 0,
      "publication_date": 20170625
    },
    {
      "title": "Perfect",
      "text": "Very lightweight and comfortable. Perfect for summer hiking. True to size. Unfortunately I ordered these on prime day after reading reviews I sized up. I wear 8 in street shoes and 8.5 in hiking most of the time. Ordered 9 and they were to big. Wish I got my size. My friend was more then happy to have it for the price and I lost my window of opportunity Now the price is back to normal. 😕",
      "rating": 5.0,
      "verified": false,
      "author": "Ewa Nietupska",
      "helpful_votes": 0,
      "publication_date": 20160926
    },
    {
      "title": "Love these!",
      "text": "I love these boots!! Took them on vacation this summer and they smoked my husband's Columbia boots! While he was slipping in some places I never slipped once! And they're adorable.",
      "rating": 5.0,
      "verified": false,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170106
    }
  ],
  "product_meta": {
    "title": "Vasque Womens Inhaler II GTX-W Inhaler Ii GTX",
    "description": "The lightweight yet durable construction, waterproof protection, and reliable traction of the Vasque® Inhaler II GTX hiking shoe will have you breathing easy on any trail. 1.6 mm PU coated leather and abrasion-resistant 3-D mesh upper provide excellent durability as well as a high level of breathability. Style is ideal for hot weather hiking. GORE-TEX® waterproof, breathable liner with Extended Comfort Technology sets the bar for breathable waterproof protection. Ample ventilation through the mesh uppers pushes heat out and welcomes fresh air in. Molded TPR toe and heel counters are perforated for additional breathability. Dual density EVA footbed for all-day comfort. A lightweight, low-profile EVA midsole with TPU instep shank is a performance-cushioning platform with just the right amount of stability for moving fast on the trail. Vibram® Pneumatic sole is designed with an aggressive lug pattern and molded in Megagrip rubber compound for outstanding trail traction. Last: Equalizer Imported. Measurements: Weight: 15 oz Product measurements were taken using size 9, width M. Please note that measurements may vary by size. Weight of footwear is based on a single item, not a pair.",
    "rating": 4,
    "feature_bullets": [
      "Waterproof",
      "Gore-tex with extended comfort technology",
      "Outer Material: Leather",
      "Sole: Gum Rubber",
      "Closure: Lace-Up",
      "Heel Type: no-heel",
      "Shoe Width: M womens_us",
      "Toe and ventilation ports",
      "1.6mm waterproof leather",
      "Dual density ethylene vinyl acetate footbed"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "35.56 x 27.94 x 12.7 cm; 426.38 Grams",
      "Date First Available": "8 April 2015",
      "Manufacturer": "Vasque",
      "ASIN": "B01N3TZGBQ",
      "Item model number": "INHALER II GTX-W",
      "Department": "Women’s"
    },
    "categories": [
      "Trekking & Hiking Boots",
      "Fashion & Athletic Trainers",
      "Shoes",
      "Sports & Outdoor Shoes",
      "Women's Shoes",
      "Trekking & Hiking Footwear",
      "Shoes & Bags"
    ],
    "price": 351.52
  }
}