{
  "website_summaries": [
    {
      "verdict": "A premium organic mouthwash that delivers a great combination of affordability and quality.",
      "pros": [
        "Consists of a distinct mixture of food-grade peroxide, water, organic oregano oil, organic tea tree oil, and organic peppermint oil",
        "Helps treat gum disease, inflammation, and bleeding",
        "Removes stain buildup on the teeth",
        "Reduces bad breath"
      ],
      "cons": [
        "Sold in a small bottle",
        "Not as strong as other organic mouthwashes"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great natural mouthwash!",
      "text": "I bought this product since it contains food grade hydrogen peroxide, and is not tested on animals, but on friends and neighbors. It has a subtle yet refreshing minty taste, and I have noticed that it seems to have reduced any gum inflammation that I had before. It is somewhat expensive for a mouthwash, but I must say, it is worth it. It is best to order 3 or more bottles at a time, to get the best price. I hope that as this company has success, that they will continually lower the price more, and that way more customers can enjoy it. I advise you to try it, as I am sure you will like it.",
      "rating": 5.0,
      "verified": true,
      "author": "Steven L. Simmons",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "I really felt my receding gum line was improving with ...",
      "text": "I really felt my receding gum line was improving with the mouthwash and toothpaste. As soon as I stopped using it the pain in my gums came back and my gums were reverting back, so I'm going to buy more and see if it helps. It's a small bottle and doesn't last long.",
      "rating": 5.0,
      "verified": true,
      "author": "Criola",
      "helpful_votes": 8,
      "publication_date": 20170727
    },
    {
      "title": "Great!",
      "text": "A cap full from the bottle should suffice, it did for me. It doesn’t feel as abrasive as chemically filled mouthwash, but you can still “feel” it working. The after taste isn’t the best but that dissipates fairly quickly. It’s such a minor thing and it’s worth it since this is all organic!",
      "rating": 5.0,
      "verified": true,
      "author": "Maxx",
      "helpful_votes": 2,
      "publication_date": 20181208
    },
    {
      "title": "love this mouth wash",
      "text": "love this mouth wash. gum disease and tooth decay are hereditary in my family. i have been following the fluoride trend for my whole life and yet it always seemed to land me back in the dentist office more often than not. I have been through one container of this mouthwash along with the original tooth paste and have seen noticeable improvements in teeth regeneration, whiting, breath, and my gums are less swollen and lighter pink. i i use the tooth paste twice a day and one cap full of the mouth wash three times a day along with flossing once a day. love it and cannot wait to see further improvement.",
      "rating": 5.0,
      "verified": true,
      "author": "Breedowler34",
      "helpful_votes": 9,
      "publication_date": 20160229
    },
    {
      "title": "Great product",
      "text": "I've only used this for a couple of days so I can't attest to its long-term effects, but so far I love it. The company was wonderful to deal with - my order arrived quickly, was packaged well to insure no leakage, and even came with a sample of their toothpaste. I love that the mouthwash is organic and does not contain things I'm trying to avoid (gluten, fluoride, and other nasty chemicals). It seems like it's really good for your mouth and the taste is pleasant - not too strong. Yes, it's pricey, but you don't use that much at a time and it's worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "happy girl",
      "helpful_votes": 2,
      "publication_date": 20161104
    },
    {
      "title": "Love this stuff.",
      "text": "At first I was thinking it was small when I got it. But it goes a long way and has helped my teeth so much. I will only use this from now on. As long as they don't change how they make it.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert",
      "helpful_votes": 0,
      "publication_date": 20200123
    },
    {
      "title": "AWESOME!",
      "text": "I really love this mouthwash! It makes my mouth feel so clean and I've noticed improvement with my gums in a short period of time. I haven't had any bleeding gums since I started using this. It leaves your mouth feeling clean and fresh without an overpowering taste. It's got a great blend of ingredients too!",
      "rating": 5.0,
      "verified": true,
      "author": "Victoria E.",
      "helpful_votes": 0,
      "publication_date": 20160122
    },
    {
      "title": "A little pricey",
      "text": "Freshened my breath but didn't whiten my teeth. I thought it was a little pricey. I'll buy Tom's next time.",
      "rating": 3.0,
      "verified": true,
      "author": "R. SineTop Contributor: Pets",
      "helpful_votes": 2,
      "publication_date": 20170419
    },
    {
      "title": "Favorite non-toxic mouthwash",
      "text": "Could not be happier to be using this mouthwash! This is non-toxic and so much better than the brand names out there! Will be repurchasing this for me and my family",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180516
    },
    {
      "title": "Very good mouth rinse",
      "text": "Very tasty and good for your teeth. It has a minty flavor with the consistency of plain water. Keeps your mouth feeling fresh most of the day. The hydrogen peroxide whitens your teeth and kills the bacteria.Great product!",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Ferrari",
      "helpful_votes": 0,
      "publication_date": 20160201
    },
    {
      "title": "PLUS WHITENING is a separate item",
      "text": "The \"PLUS WHITENING\" of the Lucky Teeth Organic Mouth Wash - PLUS WHITENING isn't in this product - it's a separate container, so it's another step in your morning or evening hygiene. I really wish they would improve the seal on the lid of the Whitening because it leaked all inside the packaging. The same leakage occurred with the toothpastes. But still a wonderful product!",
      "rating": 5.0,
      "verified": true,
      "author": "Valya Karcher",
      "helpful_votes": 0,
      "publication_date": 20160608
    },
    {
      "title": "Excellent product!",
      "text": "This makes my teeth feel like I have just had a cleaning at the dentist. I only use about 4 drops and swish it around. I love it. It has no harmful chemicals and really tastes good too.",
      "rating": 5.0,
      "verified": true,
      "author": "Peggy",
      "helpful_votes": 0,
      "publication_date": 20151121
    },
    {
      "title": "5 Stars!",
      "text": "I liked this mouthwash because it had the food grade hydrogen peroxide. I've noticed my teeth are getting whiter and whiter. I do coffee and green tea everyday. On my 2nd bottle Would order again.",
      "rating": 5.0,
      "verified": true,
      "author": "cautionflag",
      "helpful_votes": 0,
      "publication_date": 20160603
    },
    {
      "title": "Flavor",
      "text": "Like how it did not taste like listerine but more natural",
      "rating": 5.0,
      "verified": true,
      "author": "Patricia Zoltowski",
      "helpful_votes": 0,
      "publication_date": 20200406
    },
    {
      "title": "So far very pleased with the product",
      "text": "So far very pleased with the product. Can't wait to see if my dentist sees a difference. I did order another bottle.",
      "rating": 4.0,
      "verified": true,
      "author": "Vickie L. Loucks",
      "helpful_votes": 0,
      "publication_date": 20170724
    },
    {
      "title": "Nice organic mouth wash.",
      "text": "Really does help your breath!!! Haven't noticed any whitening difference, but really notice the fresher breath for longer.",
      "rating": 4.0,
      "verified": true,
      "author": "GilbertAK",
      "helpful_votes": 0,
      "publication_date": 20151103
    },
    {
      "title": "Four Stars",
      "text": "It's good and it works. I thought the organic oils listed might be a little stronger.",
      "rating": 4.0,
      "verified": true,
      "author": "Happy in Hawaii",
      "helpful_votes": 0,
      "publication_date": 20180130
    },
    {
      "title": "Yum for the Gums",
      "text": "I enjoy the clean feel, and if it does what it's meant to then we got ourselves a deal! Thanks for the freebie!",
      "rating": 5.0,
      "verified": true,
      "author": "P. Jesus",
      "helpful_votes": 0,
      "publication_date": 20170402
    },
    {
      "title": "This product works!!",
      "text": "I really love this product! My mouth feels great after using it and I can notice a difference in the whiteness of my teeth. Love that it is natural/organic",
      "rating": 5.0,
      "verified": true,
      "author": "Joseph C. Lococo",
      "helpful_votes": 0,
      "publication_date": 20180210
    },
    {
      "title": "Four Stars",
      "text": "Noticeable difference as I use this with lucky charcoal toothpaste. It is simply peroxide",
      "rating": 4.0,
      "verified": true,
      "author": "sandy",
      "helpful_votes": 0,
      "publication_date": 20160229
    },
    {
      "title": "Four Stars",
      "text": "A little pricey for the amount you get, but works okay.",
      "rating": 4.0,
      "verified": true,
      "author": "Angie Shadrick",
      "helpful_votes": 0,
      "publication_date": 20160515
    },
    {
      "title": "I love Lucky Teeth!",
      "text": "I love Lucky Teeth! It makes my mouth feel good!",
      "rating": 5.0,
      "verified": true,
      "author": "lynda",
      "helpful_votes": 0,
      "publication_date": 20160725
    },
    {
      "title": "One Star",
      "text": "This bottle is smaller than a can of soda. For $12.99. What a rip off",
      "rating": 1.0,
      "verified": true,
      "author": "JM",
      "helpful_votes": 0,
      "publication_date": 20180305
    },
    {
      "title": "Very expensive for from Hydrogen Peroxide with Oils in it",
      "text": "You could recreate this mouthwash for about 75 cents if you already have the ingredients. It's about 10% Hydrogen Peroxide, a few drops of peppermint and spearmint essential oils, and water. I like the paste even though it doesn't want to stay in it's container and bleeds all over but it does work.",
      "rating": 2.0,
      "verified": true,
      "author": "Luke",
      "helpful_votes": 0,
      "publication_date": 20190311
    },
    {
      "title": "Great mouthwash. Way overpriced.",
      "text": "Great mouthwash. Decent ingredients, light and pleasant taste/scent. Two stars deducted for value. This bottle is tiny, the capfuls are tiny and it's extremely expensive if you plan on using this daily. There are other 'natural' alternatives out there.",
      "rating": 3.0,
      "verified": true,
      "author": "JY",
      "helpful_votes": 5,
      "publication_date": 20160730
    },
    {
      "title": "Obsessed",
      "text": "Love this mouthwash so much! The ingredients are great and my mouth feels cleaner even the next morning. As a bonus, the label says if you have a sore throats to gargle with it and it's given me instant relief. I would buy it just for that purpose. It's small but lasted me a decent amount of time.",
      "rating": 5.0,
      "verified": true,
      "author": "AlaskaGrown",
      "helpful_votes": 0,
      "publication_date": 20170131
    },
    {
      "title": "Awesome, and natural",
      "text": "most refreshing mouthwash I've ever tried, plus the bonus of the whitening paste is awesome, love this stuff, WISH THEY OFFERED BIGGER BOTTLES.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris in Pennsylvania",
      "helpful_votes": 2,
      "publication_date": 20170414
    },
    {
      "title": "Best mouthwash!!!",
      "text": "Best mouthwash I've ever used! My teeth and gums seemed to ache every now and then before using this toothpaste / mouthwash. (I bought both so not sure which one worked best) but, now, my mouth feels healthy and fresh! My teeth are noticeably whiter. I will be a lifetime customer!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170703
    },
    {
      "title": "Best natural mouthwash!",
      "text": "Amazing natural mouthwash! No aftertaste, great quality and keeps the teeth and gums healthy.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Express",
      "helpful_votes": 0,
      "publication_date": 20190517
    },
    {
      "title": "Loved it",
      "text": "I had mixed feelings about it really actually working knowing it’s organic and all and well I loved it!!!! It works and really leaves your mouth feeling fresh",
      "rating": 5.0,
      "verified": true,
      "author": "Juana Bautista",
      "helpful_votes": 0,
      "publication_date": 20180108
    },
    {
      "title": "Way better than the typical store bought brands",
      "text": "Leaves my mouth very fresh! Way better than the typical store bought brands.",
      "rating": 5.0,
      "verified": true,
      "author": "Angela HarrisTop Contributor: Makeup",
      "helpful_votes": 0,
      "publication_date": 20160611
    },
    {
      "title": "... your teeth and mouth feel amazing) I use the recommended mouthwash. My mouth feels clean and fresh for ...",
      "text": "After brushing my teeth with Lucky toothpaste (which by the way makes your teeth and mouth feel amazing) I use the recommended mouthwash. My mouth feels clean and fresh for hours, unlike store brands. I like using all natural and it being floride free.",
      "rating": 5.0,
      "verified": true,
      "author": "Jolene Furl",
      "helpful_votes": 0,
      "publication_date": 20170125
    },
    {
      "title": "Good stuff",
      "text": "I think it works pretty well. Natural ingredients are always my first choice. however they get 4 stars for packaging, i wish I'd taken a picture of the bag with a fourth of the mouthwash in it. Someone didn't close the bottle properly and I'm surprised it didn't come with a seal. So much wasted product!",
      "rating": 4.0,
      "verified": false,
      "author": "ShortiiDoWop",
      "helpful_votes": 0,
      "publication_date": 20160725
    },
    {
      "title": "Fresh mouth, healthy mouth",
      "text": "Tea tree oil does amazing things for my gums and breath. Aftertaste is great. No alcohol or other scary ingredients All NATURAL in love try it you would love it too.",
      "rating": 5.0,
      "verified": false,
      "author": "Daisy Eliana",
      "helpful_votes": 0,
      "publication_date": 20150708
    },
    {
      "title": "love this mouthwash",
      "text": "whitens your teeth! love this mouthwash, I am fine with tasteless! its safer anyhow! love it",
      "rating": 5.0,
      "verified": false,
      "author": "Paulette Urrutia",
      "helpful_votes": 0,
      "publication_date": 20160302
    },
    {
      "title": "Quality product - Highly Recommend",
      "text": "Such a great mouthwash, no burning like many other products out there while leaving you with a very fresh feel. I have been using Lucky Teeth for over a year now. Very happy they are a company focused on quality and natural ingredients.",
      "rating": 5.0,
      "verified": false,
      "author": "kevin",
      "helpful_votes": 2,
      "publication_date": 20150627
    },
    {
      "title": "This is a great mouth wash I know that I'm using something natural ...",
      "text": "This is a great mouth wash I know that I'm using something natural that is actually giving nutrition to my teeth and not being so worried about how the chemical that I can find on the regular washes, but still having the same result. My teeth are clean and fresh, Love it!!!!! -Mary",
      "rating": 5.0,
      "verified": false,
      "author": "maryluz garces",
      "helpful_votes": 0,
      "publication_date": 20150630
    },
    {
      "title": "Works great!",
      "text": "Works great! I am happy I gave it a try.",
      "rating": 5.0,
      "verified": false,
      "author": "Annette Fleming",
      "helpful_votes": 0,
      "publication_date": 20150718
    }
  ],
  "product_meta": {
    "title": "Lucky Teeth Organic Food Grade Peroxide MouthWash - Plus WHITENING - Whitens, Refreshes. Food Grade Peroxide + Essential Oils. 12 OZ (1 (12 OZ))",
    "rating": 4.4,
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "5.75 x 2.75 x 5.75 inches; 10.08 Ounces",
      "UPC": "636160246950 072632407106",
      "Manufacturer": "Lucky Teeth",
      "ASIN": "B00ZV8Y4D0",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Oral Care",
      "Teeth Whitening",
      "Beauty & Personal Care"
    ],
    "price": 14.99
  }
}