{
  "website_summaries": [
    {
      "verdict": "The Alcatel One Touch Idol 3 4.7 is an affordable and compact unlocked smartphone that punches above its weight on performance, but it's still hard to recommend over the Moto G.",
      "pros": [
        "Wallet-friendly price",
        "Attractive design",
        "Solid build quality",
        "Crisp display",
        "4G LTE connectivity",
        "Loud speakers"
      ],
      "cons": [
        "Camera struggles in low light",
        "Limited RAM for multitasking",
        "Small battery"
      ],
      "aspects": {},
      "publication_date": 20150909,
      "rating": 8.0,
      "source": "pcmag"
    }
  ],
  "customer_reviews": [
    {
      "title": "Caution, only 8gb Internal Storage!",
      "text": "This version of the phone has only 8gb of internal storage, there is a micro SD slot but only a few apps are movable to this. Every time I wanted to download a new app there was not enough internal storage left so I had to delete something else to make room. It's a nice little phone if you only use a few apps, but it wasn't good for my needs so I returned it and bought the 5.5\" version, this has 16gb so much better. I cannot speak highly enough of Amazon's returns procedure though, they could not have made it much easier for me.",
      "rating": 3.0,
      "verified": true,
      "author": "M. Hall",
      "helpful_votes": 0,
      "publication_date": 20160425
    },
    {
      "title": "Worked well for a while...",
      "text": "After about a year, volume buttons started to give out, power button is 50/50 and the battery can barely keep it's charge steady whilst plugged into a USB port and browsing the internet, continues to deplete if watching video content regardless of being plugged in. Best not to give in to unknown brands to save a bit of money, it'll just give your problems in the long run.",
      "rating": 2.0,
      "verified": true,
      "author": "Andrew",
      "helpful_votes": 0,
      "publication_date": 20181221
    },
    {
      "title": "Excellent value for the price",
      "text": "Wonderful phone, fast, light, stylish. Plays the latest games and apps, never noticed any lags or slow downs, even after having it on for several days. The speakers are simply amazing, they are better and louder than my laptops one. Truly recommend for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Alex Marmo",
      "helpful_votes": 2,
      "publication_date": 20151009
    },
    {
      "title": "Great Little phone",
      "text": "A great little phone, and what I like it has two speakers which are a great help as I am quite deaf. would recommend this phone to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Pen set",
      "helpful_votes": 0,
      "publication_date": 20170514
    },
    {
      "title": "Good phone but some bugs.",
      "text": "Bought it as a present. Took it out of the box to see if maybe I want one for myself too. Tried to watch some youtube video in fullscreen and landscape and then half of the screen started to flicker with blue in every 5 seconds or so. Unacceptable. What else would come out if I would use it more? I sent it back. Otherwise seemed like a nice phone. Would have bought one for myself too.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160523
    },
    {
      "title": "Four Stars",
      "text": "excellent value for cost. Use for phone, text, WWW, email, facebook, whatsapp, camera",
      "rating": 4.0,
      "verified": true,
      "author": "orkfay",
      "helpful_votes": 0,
      "publication_date": 20170601
    },
    {
      "title": "Great product. Deliveered super quick",
      "text": "Great product. Deliveered super quick. Second one I have bought. The first was for my daughter and because it was so good i bought one. That didn't go down well with her street cred but mine went up.",
      "rating": 5.0,
      "verified": true,
      "author": "CG",
      "helpful_votes": 0,
      "publication_date": 20160420
    },
    {
      "title": "Very nice product at a good price.",
      "text": "Update: I've had this phone for some time now and am reasonably happy with it. There is however a problem with videos. When recording only approx. 95% of the viewed area is recorded. This is not the case with stills which are full area. I will be taking this up with Alcatel since I have not noticed this with other smart phones.",
      "rating": 4.0,
      "verified": true,
      "author": "wizard60",
      "helpful_votes": 0,
      "publication_date": 20160229
    },
    {
      "title": "Great",
      "text": "I got this to replace the more expensive Z3 Compact and prefer this. Lovely in the hand, simple design, loud, and the flip screen trick is nice (although would be better if it physical buttons were on both ends).",
      "rating": 5.0,
      "verified": true,
      "author": "Eugene",
      "helpful_votes": 2,
      "publication_date": 20150803
    },
    {
      "title": "One Star",
      "text": "The first time it fell on the ground, the screen was shattered to million pieces",
      "rating": 1.0,
      "verified": true,
      "author": "Frank087234",
      "helpful_votes": 0,
      "publication_date": 20170617
    },
    {
      "title": "Excellent for entry-level or moderate smartphone user",
      "text": "Excellent phone. Not a connoisseur of smartphones, it may fall short of others' desires, but for me it's perfect. Responsive and high-definition touchscreen, can handle a moderate number of apps with ease, good camera (apparently not as good as other devices, but I don't really care) and a micros card slot. Couldn't ask for more.",
      "rating": 5.0,
      "verified": true,
      "author": "Cecil3000",
      "helpful_votes": 0,
      "publication_date": 20161018
    },
    {
      "title": "Really nice, slim phone that worked brilliantly",
      "text": "Really nice, slim phone that worked brilliantly ... till it didn't. I don't like that you can't open it up or take the battery out, but one day it just wouldn't switch on any more. Tried everything but it was just dead. This was about 5 months after getting it. It's a shame, because it was great up till then - decent camera, very sleek, quick. Then a paperweight, for no reason.",
      "rating": 3.0,
      "verified": true,
      "author": "Tim",
      "helpful_votes": 0,
      "publication_date": 20161104
    },
    {
      "title": "Excellent phone, such a lot for your money",
      "text": "Excellent phone, such a lot for your money, it will be interesting to see how it performs over a long period. A couple of concerns, 1) it has happened couple of times now, when I have finished a call and put it to sleep for some reason it dialled a number completely randomly. 2) it says it has 4G capability but it does not detect my 4G Router at all, no matter where I place it. Also does it have a SD Card facility??",
      "rating": 4.0,
      "verified": true,
      "author": "Maz3755",
      "helpful_votes": 0,
      "publication_date": 20151125
    },
    {
      "title": "OK Phone - low enough specs",
      "text": "only 8gb storage and cant upgrade to Android 7 - fairly run of the mill",
      "rating": 3.0,
      "verified": true,
      "author": "Gerry Fahy",
      "helpful_votes": 0,
      "publication_date": 20180221
    },
    {
      "title": "Alcatel 4.7 Phone",
      "text": "As with all other Alcatel phones purchased I am not disappointed",
      "rating": 5.0,
      "verified": true,
      "author": "Scoobie",
      "helpful_votes": 0,
      "publication_date": 20170217
    },
    {
      "title": "One Star",
      "text": "Broke after a few months, would stay clear! Amazon refunded me thankfully!",
      "rating": 1.0,
      "verified": true,
      "author": "Moose",
      "helpful_votes": 0,
      "publication_date": 20160506
    },
    {
      "title": "Five Stars",
      "text": "Love this little phone, so responsive, lovely crisp screen, photos are great, and sound is good enough.",
      "rating": 5.0,
      "verified": true,
      "author": "Jilly",
      "helpful_votes": 0,
      "publication_date": 20170226
    },
    {
      "title": "Nice product, a bargain for that price (99£)",
      "text": "Fast delivery! Nice product, a bargain for that price (99£) :)",
      "rating": 4.0,
      "verified": true,
      "author": "Santiago Casas",
      "helpful_votes": 0,
      "publication_date": 20160413
    },
    {
      "title": "Very good phone for the price",
      "text": "Very good phone for the price and have been impressed by the performance. The only downside is the internal memory which is approximately 4.8 GB, but adding an micro SD card could fix this...",
      "rating": 5.0,
      "verified": true,
      "author": "Imi Bhatti",
      "helpful_votes": 0,
      "publication_date": 20151115
    },
    {
      "title": "my dad is very happy with it",
      "text": "Bought as a present, my dad is very happy with it. Excellent quality, beautiful design. Thin and light.",
      "rating": 5.0,
      "verified": true,
      "author": "Nikolett F.",
      "helpful_votes": 0,
      "publication_date": 20160507
    },
    {
      "title": "Good price Great Phone!",
      "text": "Great introduction to smart phone technology with a 13 mega pixel camera and the potential to store picture and music libraries its a mobile entertainment center.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Dinwoodie",
      "helpful_votes": 0,
      "publication_date": 20160324
    },
    {
      "title": "BRILLIANT PHONE, I HAVE HAD SONY SAMSUNG I PHONES ...",
      "text": "BRILLIANT PHONE,I HAVE HAD SONY SAMSUNG I PHONES ETC .BUT THIS PHONE IS A LOT BETTER THAN THEM THE PICTURE QUALITY THE SOUND AND SPEED IS FAST ,THE BEST EVER",
      "rating": 5.0,
      "verified": true,
      "author": "MR P HEWITT",
      "helpful_votes": 0,
      "publication_date": 20170328
    },
    {
      "title": "I've had iPhone 4 and 5 also Samsung s6 which ...",
      "text": "I've had iPhone 4 and 5 also Samsung s6 which was stolen was hesitant buying this phone I got the black Friday deal this phone and watch both £100 am impressed it has jbl speakers Sony camera and Internet is quite fast cash complain paying £50 for the phone plus is unlocked to all networks",
      "rating": 4.0,
      "verified": false,
      "author": "Harvinder",
      "helpful_votes": 0,
      "publication_date": 20160111
    },
    {
      "title": "Alcatel OneTouch Idol 3.",
      "text": "This is an effective and reasonably priced smartphone, that can do everything it's more expensive counterparts do, at an acceptable price point. The only (minor) niggle that I have with this phone is that the battery life is not as extensive as I hoped it would be. It falls between the iPhone (poor) & the Windows Lumia (excellent). Having said that, I certainly have no hesitation in recommending this neat & rather nifty phone .",
      "rating": 4.0,
      "verified": false,
      "author": "catherine",
      "helpful_votes": 0,
      "publication_date": 20150919
    }
  ],
  "product_meta": {
    "title": "Alcatel ONETOUCH IDOL 3 (4.7) SIM-Free Smartphone – Dark Grey",
    "description": "With a crisp 1.7\" screen, the Alcatel Idol 3 is a perfect smartphone for on the move\n\nBOX CONTAINS\nAlcatel Onetouch Smartphone\nUser Guide\nMains Charger",
    "rating": 3.5,
    "feature_bullets": [
      "4.7” HD IPS Display",
      "13 mega-pixel main camera, and 8 mega-pixel front camera",
      "Android 5.0 Lollipop operating system",
      "Micro SD slot supporting up to 128GB",
      "Unique, 100% reversible experience"
    ],
    "specifications": {
      "Batteries": "1 Lithium ion batteries required. (included)",
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "0.7 x 7.5 x 15.3 cm; 110 Grams",
      "Date First Available": "22 Jun. 2015",
      "Manufacturer": "Alcatel",
      "ASIN": "B00Z06R9MG",
      "Item model number": "6039Y-2AALGB7",
      "Delivery information:": "We cannot deliver certain products outside mainland UK ( ). We will only be able to confirm if this product can be delivered to your chosen address when you enter your delivery address at checkout.",
      "Customer reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "SIM-Free & Unlocked Mobile Phones",
      "Electronics & Photo",
      "Mobile Phones & Smartphones",
      "Mobile Phones & Communication"
    ],
    "price": 105.07
  }
}