{
  "website_summaries": [
    {
      "verdict": "Transformers: Devastation plays it safe when compared with other Platinum Games titles. It borrows and streamlines gameplay mechanics from other games, but makes the experience satisfying nonetheless.",
      "pros": [
        "Fast and responsive combat",
        "Robust crafting system encourages experimentation",
        "Varied difficulty levels and challenges offer great replay value",
        "Fantastic visual style captures the charm of the original Transformers cartoon"
      ],
      "cons": [
        "Cityscape levels are bloated and irritating to navigate",
        "Combo system is flashy, but overly simplistic",
        "Some missions deviate from the melee-oriented norm and are annoying to play"
      ],
      "aspects": {},
      "publication_date": 20151028,
      "rating": 7.0,
      "source": "pcmag"
    }
  ],
  "customer_reviews": [
    {
      "title": "Better than expected",
      "text": "Originally got this game when it was free on PSN a few years ago. Enjoyed it more than I thought I would so decided to buy it on disc so that I could add to my physical collection. It doesn't deviate too much from PlatinumGames usual formula, although the combat isn't as deep as some of their other games i.e. Bayonetta. The campaign is fairly short but that kind of works in its favour seeing as though it is fairly repetitive. Fun game all the same though.",
      "rating": 4.0,
      "verified": true,
      "author": "Delroy",
      "helpful_votes": 0,
      "publication_date": 20181104
    },
    {
      "title": "Excellent game",
      "text": "An almost perfect transformers game that all fans of the franchise should experience. Only downsides were the longevity of the campaign and the lack of coop play, which could have been cool. Also would have been great to play as the decepticons at least once. Despite these minor grumbles I had a lot of fun with it. Will keep it only to play on harder difficulty and to complete the challenges which are pretty tough when you first start.",
      "rating": 4.0,
      "verified": true,
      "author": "Garry Hunt",
      "helpful_votes": 0,
      "publication_date": 20151216
    },
    {
      "title": "Great game that is worthy of anyone's collection",
      "text": "Great game and a bit of a sleeper that went under a lot of people's radar. Made byou platninum games, it's great fun and captures the feel of G1 Transformers marvellously. If you like fast paced action, transformers or are just into good video games Id suggest getting hold of a copy, you won't be disappointed.",
      "rating": 4.0,
      "verified": true,
      "author": "Diggadeydaz",
      "helpful_votes": 0,
      "publication_date": 20160827
    },
    {
      "title": "Nostalgia trip.",
      "text": "It's a bit repetitive and a little tricky in places but once you get into the swing of things it's a blast. The music is fantastic and the voice actors are legendary (I adore how they got a bunch of the original cast). The main story is not particularly long but the experience is beyond fun.",
      "rating": 4.0,
      "verified": true,
      "author": "HazeAPF",
      "helpful_votes": 0,
      "publication_date": 20170202
    },
    {
      "title": "Looks Incredible.",
      "text": "This is an incredible looking game. Gameplay is brilliant and is a really fun game to play. My 6 year old absolutely loves. It looks great and plays well.",
      "rating": 5.0,
      "verified": true,
      "author": "WENDY BENNETT",
      "helpful_votes": 0,
      "publication_date": 20200628
    },
    {
      "title": "Transform.......into more!",
      "text": "I really wanted to love this game but unfortunately I don't. The game looks amazing but sadly that's the only good thing about it. It is repetitive and doesn't off much. It could of been so much more. I give it 3 stars because it is fun at first.",
      "rating": 3.0,
      "verified": true,
      "author": "Mr. Ian P Lock",
      "helpful_votes": 0,
      "publication_date": 20151112
    },
    {
      "title": "Great service",
      "text": "Great game. My son loves it. Responsive service from the supplier. Thanks.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. S. Davidson",
      "helpful_votes": 0,
      "publication_date": 20181226
    },
    {
      "title": "Great service",
      "text": "Great game , my daughter loves it. Great price from a great seller, recommend ++",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. R. Gibson",
      "helpful_votes": 0,
      "publication_date": 20180913
    },
    {
      "title": "Five Stars",
      "text": "Great product. Very happy with purchase. Highly recommended. Arrived quickly and well packaged.",
      "rating": 5.0,
      "verified": true,
      "author": "Lee S. Bennett",
      "helpful_votes": 0,
      "publication_date": 20180314
    },
    {
      "title": "Great fun, awesome combat and visual",
      "text": "Great fun, awesome combat and visual, very evocative of the original 80's series but quickly becomes repetitive and doesn't really feel like a whole game",
      "rating": 3.0,
      "verified": true,
      "author": "Mr. R. Brazier",
      "helpful_votes": 2,
      "publication_date": 20160201
    },
    {
      "title": "It's worth remembering that, though the characters in this ...",
      "text": "It's worth remembering that, though the characters in this game seem angry and violent, they can't escape from their tv prison to hurt me and you. They'll probably never get out, but if they do god help us all.",
      "rating": 5.0,
      "verified": true,
      "author": "Greedwell",
      "helpful_votes": 0,
      "publication_date": 20161118
    },
    {
      "title": "Great game for transformer lovers!!!",
      "text": "Me 9-year old son loved this game so much!! When he was done playing all the’chapters’to the game he said he wanted to play it again!",
      "rating": 5.0,
      "verified": true,
      "author": "Orathai  thammachot",
      "helpful_votes": 0,
      "publication_date": 20190102
    },
    {
      "title": "True to the original Cartoon - Super Game!",
      "text": "Loved the Transformers when I was younger - this is perfect! features all the classic characters like Megatron, Soundwave, Shockwave etc",
      "rating": 5.0,
      "verified": true,
      "author": "Lee",
      "helpful_votes": 0,
      "publication_date": 20161229
    },
    {
      "title": "My favourite game of all time",
      "text": "I love this game I’d even go as far as say transformers devastation is my favourite game of all time because it’s fun and it’s plot is simple enough that I can jump in at any time and know what’s going on unlike most games so pick it up if you can.",
      "rating": 5.0,
      "verified": true,
      "author": "Nex1436",
      "helpful_votes": 0,
      "publication_date": 20190101
    },
    {
      "title": "very good graphics",
      "text": "For the price its a blast from the past ... original voice actors , very good graphics",
      "rating": 5.0,
      "verified": true,
      "author": "DANO",
      "helpful_votes": 2,
      "publication_date": 20160407
    },
    {
      "title": "Good value, lots of metal to smash...",
      "text": "Very good for my kids! They play for hours. Downside is that it is a bit repetitive after a while and the crooks will not be 'smashed' even when they are smashed sometimes (words from my kids). Well worth the money and recommended!",
      "rating": 4.0,
      "verified": true,
      "author": "Göran Sahlén",
      "helpful_votes": 0,
      "publication_date": 20170109
    },
    {
      "title": "a good buy for sony playstation 4 console",
      "text": "graphically gorgeous and fun game to play there are other transformer games out there besides this",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas Kevin Phillips",
      "helpful_votes": 0,
      "publication_date": 20170207
    },
    {
      "title": "PERFECT!!!!!!!!!",
      "text": "Absolutely brilliant! This game is worth more than what it's going for. Great 80s nostalgia. A great love letter game to the first and true transformers of the first generation. Everything about the game is right....I really want a Transformers Devastation 2!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170210
    },
    {
      "title": "a slightly better camera, but that's it really",
      "text": "It's just Bayonetta with big transforming robots. What more could you ask for? Well, a slightly better camera, but that's it really.",
      "rating": 4.0,
      "verified": true,
      "author": "Josh",
      "helpful_votes": 0,
      "publication_date": 20151207
    },
    {
      "title": "vanquish) I would highly recommend this game",
      "text": "As a fan of the original generation 1 transformers cartoons and a fan of platinum games fast paced action titles (Bayonetta,metal gear rising,vanquish) I would highly recommend this game.",
      "rating": 4.0,
      "verified": true,
      "author": "Joyce Rennie",
      "helpful_votes": 2,
      "publication_date": 20151103
    },
    {
      "title": "Five Stars",
      "text": "A game developed by platinum games, very satisfying and challenging combat especially in higher settings/difficulty.",
      "rating": 5.0,
      "verified": true,
      "author": "RM",
      "helpful_votes": 0,
      "publication_date": 20151127
    },
    {
      "title": "Back to the 80's",
      "text": "Can be repetitive... But the animation keeps you interested. Loads of reply value!",
      "rating": 5.0,
      "verified": true,
      "author": "J Man",
      "helpful_votes": 0,
      "publication_date": 20151114
    },
    {
      "title": "Five Stars",
      "text": "A chance to relive my childhood years with my children :)",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160415
    },
    {
      "title": "A fast paced action packed fun game with transformers as they were before Michael Bay ...",
      "text": "A fast paced action packed fun game with transformers as they were before Michael Bay got his grubby little hands on the franchise.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160125
    },
    {
      "title": "Five Stars",
      "text": "very happy with game and was deliverd on time son loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "victoria mcallister",
      "helpful_votes": 0,
      "publication_date": 20151230
    },
    {
      "title": "Retro fun at its absolute best!",
      "text": "If you love action games or the original 80s Transformers you'll love this game. If like me you love both then you need this game. Intuitive, easy to pick up and super responsive. Well balanced learning curve which only suffers from a repetitive feeling after a while however when you have a grin on your face from the overdose of nostalgia, that criticism soon fades away.",
      "rating": 4.0,
      "verified": true,
      "author": "Nigel Powell",
      "helpful_votes": 3,
      "publication_date": 20160404
    },
    {
      "title": "Four Stars",
      "text": "Great game not as combo heavy as other platinum games, very faithful to gen1 transformers",
      "rating": 4.0,
      "verified": true,
      "author": "1/6 Collector",
      "helpful_votes": 0,
      "publication_date": 20151116
    },
    {
      "title": "I enjoyed this",
      "text": "I think it's meant for children. But as a mid 30s grown up, I really got quite into it. Some of the controls are clunky, gameplay is nothing special, plot is dull and the graphics are limited (but in line with the 80s cartoon). That said, it's simple, easy to just pick up and do a mission or 2. Plus every level, there's another character from the series. I won't spoil the surprises, but there's no shortage of Transformers. All in, I'd say, don't pay a lot for this and just enjoy it. If you remember the TV series, you'll love this, if you just want to blow stuff up, but Mass Effect or something.",
      "rating": 4.0,
      "verified": true,
      "author": "Andy in Hampshire",
      "helpful_votes": 0,
      "publication_date": 20170728
    },
    {
      "title": "takes me back to my youth,",
      "text": "really simple great game with gorgeous graphics and great gameplay, you can button mash your way through it if you wish and love the way the game plays out. it does get a bit \"same-y\" after a while, but i really enjoyed it. it takes you back to the 80- early 90's hayday of gaming, where you can just sit back, switch off and enjoy.",
      "rating": 4.0,
      "verified": true,
      "author": "B. Gristwood",
      "helpful_votes": 0,
      "publication_date": 20170224
    },
    {
      "title": "Great game!",
      "text": "If you loved the original 80's cartoon then you'll love this game and at a good price too.",
      "rating": 5.0,
      "verified": true,
      "author": "Dr. Zoidberg",
      "helpful_votes": 3,
      "publication_date": 20160209
    },
    {
      "title": "Bought for bf, he loves it! I don't ...",
      "text": "Bought for bf, he loves it! I don't know a lot of things about games, but it does remind me some younger time when seeing different characters show up lol",
      "rating": 5.0,
      "verified": true,
      "author": "ReiKo",
      "helpful_votes": 0,
      "publication_date": 20170413
    },
    {
      "title": "Five Stars",
      "text": "Great product, price and delivery. Excellent service all round A+++++",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew Clifton",
      "helpful_votes": 0,
      "publication_date": 20170328
    },
    {
      "title": "Excellent!",
      "text": "My 3 year old has almost completed this game. He absolutely loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "Janine",
      "helpful_votes": 0,
      "publication_date": 20170923
    },
    {
      "title": "Excellent game",
      "text": "Excellent game have not stopped playing all weekend, excellent, think there is a part 2, hopefully",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. Sunil Sharma",
      "helpful_votes": 0,
      "publication_date": 20151011
    },
    {
      "title": "Two Stars",
      "text": "Nostalgic fun for roughly 5 minutes, then repetitive and bland after that! Disappointing!",
      "rating": 2.0,
      "verified": true,
      "author": "Scott Proudman",
      "helpful_votes": 0,
      "publication_date": 20160210
    },
    {
      "title": "Too busy",
      "text": "So much going on in this game, as a G1 fan I wanted to like it but I'd avoid.",
      "rating": 1.0,
      "verified": true,
      "author": "Lee Peterson",
      "helpful_votes": 0,
      "publication_date": 20160102
    }
  ],
  "product_meta": {
    "title": "Transformers Devastation (PS4)",
    "description": "Platform:PlayStation 4Transformers\n\nBOX CONTAINS\nGame disk",
    "rating": 4.4,
    "feature_bullets": [
      "Transformers"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Rated": "Ages 12 and Over",
      "Product Dimensions": "19 x 13.5 x 3 cm; 100 Grams",
      "Release date": "9 Oct. 2015",
      "ASIN": "B00ZU7WQW8",
      "Item model number": "77116EN",
      "Customer reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Games",
      "PlayStation 4",
      "PC & Video Games"
    ],
    "price": 50.38
  }
}