{
  "website_summaries": [
    {
      "verdict": "An all-in-one sleep, play, and scratch solution. Great value for money, but it might not last as long as others on our list.",
      "pros": [
        "Tower includes condo with padded base, sisal scratch surface, hammock, and 2 hanging toys",
        "Hammock is soft and comfortable",
        "Folds for storage or on the go use",
        "Dual levels accommodate 2 kitties",
        "Affordable"
      ],
      "cons": [
        "Lightweight construction may show signs of strain at the paws of frisky felines"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Stapled together--poorly!",
      "text": "The scratch pad is functional, but that's about the only positive thing I can say about this product! For one, it's constructed with cheap wood that weighs nothing, so it moves around. The whole thing doesn't weigh enough to stay in place when my cat (a small cat) is playing. More importantly, it has VERY poor quality and construction. The fabric pieces are stapled in place, and not well. As soon as I opened the package, many of the staples were already falling off, causing the fabric pieces to come unattached. (See pictures)",
      "rating": 1.0,
      "verified": true,
      "author": "Sarah Bri",
      "helpful_votes": 54,
      "publication_date": 20180619
    },
    {
      "title": "Nice little cat tree that my big 16 lb cat ...",
      "text": "Nice little cat tree that my big 16 lb cat likes to sleep on. We put it right next to the desk so that the big guy has somewhere to lay that is not on or right in front of the keyboard. The top hammock is right on desk level so he seems to be ok with the change. He also loves the balls hanging from the side. neither of the cats usually go for the little toys hanging but he is in love with this tree. I will say that one of the balls fell off on the first day, but that hasn't stopped the cats from playing with it. It fits our style",
      "rating": 5.0,
      "verified": true,
      "author": "Marilyn",
      "helpful_votes": 91,
      "publication_date": 20150923
    },
    {
      "title": "You Get What You Pay For",
      "text": "Really cheap quality, my cat got hurt and now won't use it. And they have no option to get your money back without sending it back, and if you threw away the box, it would cost more to send it back than the refund would be worth. Disappointing. I can't reach anyone at the company either, no one will contact me back. There was a staple loose that was sharp (see picture). Also the hammock top isn't sturdy, cat's too afraid to jump on it. It's on there crooked too and the fabric is cheap quality. Very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Silas",
      "helpful_votes": 25,
      "publication_date": 20190227
    },
    {
      "title": "Terrible Quality",
      "text": "Most of the reviews were positive and the price was right but this product seriously lacks in quality. Two hours after I took it out of the box, my TWO MONTH old tiny kitten had already taken the toy balls off of the strings. Only a month later and this product is shedding all over my living room floor. What a waste of money! Too bad I’m two weeks too late to return the product. The only thing I can do now Is let everyone know not to purchase this.",
      "rating": 1.0,
      "verified": true,
      "author": "LJohnson",
      "helpful_votes": 28,
      "publication_date": 20180729
    },
    {
      "title": "Good for her, good for me!",
      "text": "I like it because it doesn't take up a lot of space and I can easily move it to clean around. But it isn't about ME is it?! SHE loves it because she can climb all over it. Drape herself over the side and play with the hanging toys. Hide in the cubby and dart out a me. Some say the hole is too small for big cats. Then either slice it or use it for toy storage. RAWR TOYS! I don't see this as an issue ever. Don't let that stop you. Well made, no assembly. Hours of fun and a place to nap betweens rounds.",
      "rating": 5.0,
      "verified": true,
      "author": "EllenTop Contributor: Coloring",
      "helpful_votes": 29,
      "publication_date": 20160507
    },
    {
      "title": "Seriously the best.",
      "text": "Seriously. I live in a one-bedroom apartment and this guy is a game-changer. It’s not an eye sore, there’s little/no assembly (I don’t even remember if there was assembly, and I’m a big complainer about assembly, so I feel like I’d remember), and I can store it under our couch when we have people over and I don’t want them to think I’m clutter-y. Oh yeah and my cat really likes it. If your cat is a monster like mine, though, don’t count on the hanging things to stick around past day one.",
      "rating": 5.0,
      "verified": true,
      "author": "Casey D",
      "helpful_votes": 0,
      "publication_date": 20191027
    },
    {
      "title": "Super awesome fun times",
      "text": "I absolutely love this!! I have a larger cat tree for our cats and always thought little things like this weren’t worth the money, but I decided to give it a shot to give our cats more places to play and scratch, and one of them ended up loving it soooo much, she scratches the side, plays in the bottom, and sleeps in the hammock on a regular basis. It folds up really easy and doesn’t take up much space, it does occasionally tip over if she’s playing really wildly just because it’s lighter, but if stood against a door or wall it’s usually fine!",
      "rating": 5.0,
      "verified": true,
      "author": "Brooke",
      "helpful_votes": 0,
      "publication_date": 20201003
    },
    {
      "title": "Easily knocked over",
      "text": "My cat loved it - at first. She went in the bottom little room and I thought this was a winner. Then every time she tried to jump on the top it fell over. She was a rescue a few years ago - I adopted her after she was starved by some person who needs remedial training on being a human - so she's never grown as she probably could have. I would hesitate to buy this for a full grown cat. Actually, I'd hesitate to buy it at all unless you can prop it up - I put it between a chair and ottoman and then it stays up. Not worth buying.",
      "rating": 1.0,
      "verified": true,
      "author": "grammaj",
      "helpful_votes": 0,
      "publication_date": 20201003
    },
    {
      "title": "The Cats Love It and Use It",
      "text": "As a cat person for about forty years, I've been through more scratching posts than I'd care to even contemplate. One of my current cats has always preferred furniture and rugs over scratching posts, so I had my doubts. When Ernie immediately switched to this tower and forsook all other scratching spots, I ell in love. Both cats love the scratching component. The finicky one also loves the hanging balls and sleeps both in the bottom part (although he does hang out a bit, since he's a very large cat) and hangs out on the top to be petted.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan R. Meyer",
      "helpful_votes": 0,
      "publication_date": 20191125
    },
    {
      "title": "LOVE IT!!!  Wonderful product.",
      "text": "So surprised at how wonderful this item turned out to be! You take it out of the box and unfold it (much like a simple folding chair) and voila! it’s done. It’s very well made with seemingly quality materials. My 2 kittens immediately started jumping all over it and love it. It is not super heavy so it can be moved around the room(s) easily, placed wherever, when necessary. It clearly is not intended for heavy, mature cats due to it being a lightweight design, but I see this working perfectly for my 2 cats for several years. If your cat is grown but smaller it would most certainly work for them too.",
      "rating": 5.0,
      "verified": true,
      "author": "SuziB686",
      "helpful_votes": 0,
      "publication_date": 20190529
    },
    {
      "title": "Versatile, portable, and loved by my felines!",
      "text": "I've now owned two of these. One was given to me, and when that wore out I purchased another. I also ordered yet another for a girlfriend. They are super convenient, as they're portable, not too large, and very versatile. I have traveled with these. I have four cats ranging from 8 to 13 lb. Each fits well both in the hammock and cubbyhole. One of my dogs is known to sneak in the cubbyhole as well. They hold up well to a lot of use and the small size is easy to tuck away without being too obtrusive. When my current one wears out I will buy yet another. These are a huge win in my book!",
      "rating": 5.0,
      "verified": true,
      "author": "Morgan",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "Cheaply made/ held together",
      "text": "I received this product today, my 7 pound, 18 month old cat has only played with it for 10 minutes, and it is already falling apart (pics included) One of the haging toys came off altogether, the other, the furry covering came off the plastic ball Overall, not a terrible product, but definitely not worth the $45 i spent on it, maybe a good deal for $20 since you will have to replace inferior parts.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20181022
    },
    {
      "title": "hazard to cat, please be careful",
      "text": "i love it and its very easy to assemble. the balls on a string that hang are hazardous tho. i noticed my cats paw would get caught in the string because of the way the ball would wrap and get stuck around the string. today i came home to my cat screeching in pain and found her dangling from with her front paw caught because the rope wrapped around it and the ball was stuck. she has a bad limp and i’ll be taking her to the vet tomorrow, i’m just sawing this so y’all will know and to keep an eye on your pets to make sure this doesn’t happen again and no other pets get hurt",
      "rating": 3.0,
      "verified": true,
      "author": "zoe carmichael",
      "helpful_votes": 0,
      "publication_date": 20190719
    },
    {
      "title": "Good cat fun",
      "text": "My cats LOVE playing with/on this collapsible feline \"playpen.\" The hanging fuzzy balls generate a lot of play, and the cats covet sleeping in the hammock. The light grey and beige fabric is very neutral, and it conveniently folds and slides under the sofa when company visits. My only nit is that when the cats play a little too vigorously, the whole thing falls over or collapses; I've weighted the bottom, which has helped a little, but I still need to figure out how to wedge the arms to stabilize it during strenuous play sessions. Otherwise, we all love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Dale",
      "helpful_votes": 0,
      "publication_date": 20200523
    },
    {
      "title": "Good design, poor construction...falls apart quickly",
      "text": "First one arrived with a hole in it. Second one got a hole after 10 days and continues to falls apart. Waiting for a replacement so I can return this one. Giving it one more try...only because my cat likes it. If the third one is a poorly constructed...I'll give up. The design is good, but with poor construction that doesn't mean much. Disappointed Update: the third one never arrived. I guess they realized their design is faulty. To improve the product; replacing the flimsy fabric would probably solve the problem. Never received my refund either.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190729
    },
    {
      "title": "Cute for the Price",
      "text": "This is a great little structure for a small cat to play on. It doesn't look cheap, but the fabric does feel a bit cheap and I wouldn't expect it to hold up over time. My kitten loves playing on this structure. She runs up to the top and back down over and over, and will seriously swat at the hanging puff balls for 30 minutes at a time. After 1 week of use, one of the strings holding a ball came detached, but it was easy enough to tie back on.",
      "rating": 4.0,
      "verified": true,
      "author": "coloradobound",
      "helpful_votes": 0,
      "publication_date": 20201016
    },
    {
      "title": "Not a hit",
      "text": "My 10 lb 12yo cat wants nothing to do with it. I tried placing him on the top.. idk if it's too small or too unstable for him but he hops right off. I've tried putting treats up there.. nope. I put treats in the hole on the bottom too. He stuck his head in, ate them up, and backed right out. He hasn't even looked at the dangling puff balls or scratcher side. I'm hoping the kitten I'm getting enjoys it better. But my senior cat says no bueno. Update: my kitten will sit up top and swat at the balls. Within a day 1 ripped off",
      "rating": 1.0,
      "verified": true,
      "author": "Jason J Durham",
      "helpful_votes": 0,
      "publication_date": 20190609
    },
    {
      "title": "Not made well. Shouldn’t be $45 for this quality",
      "text": "The reason I’m giving 3 stars is because for paying $45 you should think the product would be pretty good and last a good amount of time. This product arrived ripped (see attached photos) and honestly just keenly made. Yes it’s easy to store away and looks really cute but I should not have to be fixing anything in a product that’s almost $50 so it’s a bit annoying. But on the bright side my kitten seems to enjoy it although I’m not pleased.",
      "rating": 3.0,
      "verified": true,
      "author": "Marisa",
      "helpful_votes": 0,
      "publication_date": 20200920
    },
    {
      "title": "Kitty LOVES it!!!",
      "text": "My Princess loves her cat tree! She rarely uses the scratch pad but she loves the hammock and the balls! She would never sleep through the night but since I've bought this she sleeps ALL night in the hammock! I love that it can easily be folded away and does not take up a lot of room. Only thing I worry about when she goes crazy playing that'll it might flip if she goes too wild, hasn't happened yet but it wiggles like it will. Otherwise, Pricess approves!",
      "rating": 5.0,
      "verified": true,
      "author": "BiaBia",
      "helpful_votes": 0,
      "publication_date": 20200522
    },
    {
      "title": "Kittens love it.",
      "text": "No assembly required. This opens up ready to use right out of the box. Doesn’t seem real sturdy but adult cats seem to enjoy laying on the top hammock alsoand none have tipped it over. Kittens run up and down, in and out of it constantly. Good starter condo at a reasonable price.",
      "rating": 5.0,
      "verified": true,
      "author": "egaildee",
      "helpful_votes": 0,
      "publication_date": 20200802
    },
    {
      "title": "My cat thought this was a great new toy",
      "text": "She likes the little place on the bottom because she can run through it. She pulled the little blanket out and throws it all over the room. So far she has not used the top because when she tried to jump up there, it fell over, so she is afraid to try again. The little hanging balls didn't last long, but all in all I'm happy with it.",
      "rating": 4.0,
      "verified": true,
      "author": "Lacey0ne",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "My cat loves it!",
      "text": "This cat play house is super cute!! My only complaint is the material used... It's not glued onto the wood very well. As soon as I opened it my cat was in love. She was playing with the dangling balls and within minutes the fabric covering came off them. I took a picture to show it. Also, along the edges the fabric isn't very secure either. I took some super glue and glued it to secure it better. But it's only in certain spots. It's not the whole thing. However, it is super soft. It is very sturdy and my cat loves it!! She likes sleeping in the hammock. If it weren't for the fabric I'd have given 5 stars.",
      "rating": 3.0,
      "verified": true,
      "author": "Chelsea W.",
      "helpful_votes": 0,
      "publication_date": 20190302
    },
    {
      "title": "AMAZING",
      "text": "This is the first thing I've ever bought for my cat that she's taken to right away. It's literally become her favorite spot in the house. It's really soft and I didn't have to assemble anything which is great! There are a few random threads on the tent part, but thankfully my cat hasn't shown any interest in them so I'm not too worried about her chewing or choking on them, and of course they can just be trimmed if need be. I'm still working on encouraging her to use the scratch board instead of the couch - fingers crossed!",
      "rating": 4.0,
      "verified": true,
      "author": "Allie",
      "helpful_votes": 0,
      "publication_date": 20200612
    },
    {
      "title": "Wish she loved it as much as me",
      "text": "Nothing wrong with the product at all, it's great. I've seen other cats use all attributes of it in videos. Unfortunately my cat only uses the scratch board. She doesn't like using the top I'm guessing she's scared of the instability and she doesn't go in the bottom part either no matter how I try to coax her, she is such a brat. It's such a cute and quality cat furniture I wish she thought so too so I wouldn't feel I threw away my money",
      "rating": 4.0,
      "verified": true,
      "author": "Rena-Rochelle Salvador",
      "helpful_votes": 0,
      "publication_date": 20191109
    },
    {
      "title": "Keeps kitties happy",
      "text": "My 2 cats love this! The side where they can scatch is a big hit. Someone is always batting the 2 small balls around and sleeping in the hammock. My 8lb fits on the hammock but 13lb cat is too big. She stays in the bottom cubby hole. The only thing that isn't perfect about this is that it slides on a hard floor when the cats jump on/off or scratch the side. I put rug grip on the bottom and it stays put.",
      "rating": 5.0,
      "verified": true,
      "author": "T & L Furche",
      "helpful_votes": 0,
      "publication_date": 20200228
    },
    {
      "title": "Bengal cat approved!",
      "text": "Got one of these for my Bengal's 3rd birthday. When I set it up for him, I thought to myself, there was no way he was going to fit inside the bottom area. Easy to forget a cat can compress itself. That night he was sleeping it. It slides around on the wood floor, but that's expected. Scratch pad isn't what I'd call \"nice\" quality, but he doesn't seem to mind, and that's what matters most. Overall, between the price, quality, and my cat's approval, I'm satisfied!",
      "rating": 4.0,
      "verified": true,
      "author": "ZapixTop Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20190729
    },
    {
      "title": "Put it where they like to hang out!",
      "text": "I bought this for my cat and she showed 0 interest in it. She loves sleeping under my bed and being beside me when I’m on the computer so I thought hey why not put it there. I now never see her leave the top part lol. She wakes up and uses the scratching post rather than the bed post, uses the hole underneath to travel under the bed or simply sleep, doesn’t seem interested in the hanging balls but loves the thing all the same. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Rawra",
      "helpful_votes": 0,
      "publication_date": 20200211
    },
    {
      "title": "The quality is not great",
      "text": "We purchased this for out new kitty we adopted who is extremely playful, sweet and loves to scratch. She really took a liking to the tower, but it only took a week before she tore the tethered balls off, shredded the fabric encapsulating the plastic ball, and it on the verge of tearing the top hammock apart. The blanket inside is nothing more than shredded fabric now. Our kitten is 5 lbs of playful fury, but I cannot comprehend how such a tiny thing could destroy the scratching tower so easily.",
      "rating": 3.0,
      "verified": true,
      "author": "L. J. Furman ",
      "helpful_votes": 0,
      "publication_date": 20190218
    },
    {
      "title": "My new kitten loves this.",
      "text": "I bought this for my new kitten so she would have a place to play and it worked wonderful. The only thing that was a dangerous bit was when she was tiny and she would bat the hanging balls and it wrapped around her paw where she was stuck. She didn't have her mew yet so I found her and had to untangle her paw. She remedied that by chewing off the string that was holding the balls.",
      "rating": 5.0,
      "verified": true,
      "author": "Julie Light-Copper",
      "helpful_votes": 0,
      "publication_date": 20200921
    },
    {
      "title": "High Energy Cat?",
      "text": "We have an 8 week kitten with bursts of energy throughout the day. She scales the sides, rests on the top, and plays with the balls for hours. The lower compartment, stuffed with a blanket, makes a perfect hideaway for a nap. Our older cat would care less about this tower, but the little one tears it up. I'm surprised the balls are still in tact. If this thing ever falls apart, we will get another.",
      "rating": 5.0,
      "verified": true,
      "author": "Billbo",
      "helpful_votes": 0,
      "publication_date": 20200521
    },
    {
      "title": "Better than I thought!",
      "text": "This is the perfect smaller cat play item I've seen in a long time. If you don't want the big tower in your living room, this is keeping my younger cats happy for hours a day. They like climbing in and of the bed/tunnel area, batting the hanging balls and just resting on the top. Even my senior kitty was found snuggling in the tunnel. It's a little more money than I wanted to spend but opened the box and it was ready to go. Cats like new things so we'll see in a few months if they still play on it but for now this is a great cat play area and it's not intrusive in a room.",
      "rating": 5.0,
      "verified": true,
      "author": "Kids Mom",
      "helpful_votes": 0,
      "publication_date": 20190215
    },
    {
      "title": "pretty good - worth it for the kitties",
      "text": "not the most sturdy design ever however it is cozy and both my cats seem to take turns using the top and the lower pocket areas. the inner part has not just a front hole the hole is on either side so i have it to a wall where the cats wont feel as if our dog will sneak behind them while they rest inside and this helps stabilize it. were it not on the wall to block one hole side i feel it may topple over when they jump up on it. the scratching part is ONLY ONE side .....the side on the sample image where there is not a cat, is not a scratcher.",
      "rating": 4.0,
      "verified": true,
      "author": "snazzy",
      "helpful_votes": 0,
      "publication_date": 20180922
    },
    {
      "title": "Great value for your money",
      "text": "Our little guy Neko (boy kitten) loves this cat house. He loves to climb on the scratcher side and loves playing with the hanging toys. He also loves napping inside the rest area. I love that it folds so I can bring it with me if I need to travel with our little guy. It also doesn’t take much space and the color is very neutral so it looks good in any room in our house.",
      "rating": 5.0,
      "verified": true,
      "author": "Sandra Pleites",
      "helpful_votes": 0,
      "publication_date": 20200430
    },
    {
      "title": "Not well built.",
      "text": "I received this cat tower February 2nd. As of February 9, my cat managed to rip the fur off one of the hanging balls. Obviously not a structural issue but there’s a cheap plastic ball hanging from the tower. Now as of February 19, that ball and string has been completely ripped off the tower. You’d think a company making something for a cat to play with would ensure that it wasn’t easily destroyed by a cat. We only have one cat and she’s only 3 months so technically still a kitten. Not impressed. The tower is sturdy, and my cat obviously likes it, but could be much better built.",
      "rating": 2.0,
      "verified": true,
      "author": "Angela E",
      "helpful_votes": 0,
      "publication_date": 20200220
    },
    {
      "title": "small and lightweight",
      "text": "My cats lose interest in things quickly, so now a couple of months later it is mostly neglected. However for awhile they were into the scratching part. It doesn't look like a big ugly carpet cat tree which is great. However because it is so lightweight, I had to put a cinder block in the bottom part to keep it from scooting all over the place whenever the cats would interact with it. They don't like to be on the hammock part at all.",
      "rating": 4.0,
      "verified": true,
      "author": "ExLxMx",
      "helpful_votes": 0,
      "publication_date": 20190625
    },
    {
      "title": "3 stars",
      "text": "One of the balls broke off within hours of having it which was a little disappointing because my cat loves playing with them. Then had an incident where he was hanging by his arm because he got the string from the ball wrapped around his paw, which isn’t a product flaw because this could happen with any toy that has a string attached, so pet owners be cautious of leaving your fur babies unsupervised with toys that they could tangle themselves in. Other than that I’m happy with the product. It’s the perfect size and my Salem loves it!",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190120
    },
    {
      "title": "Please read this.  Includes positive and negatives.",
      "text": "Caution! Strings that hold ball is too long and thin. My cat got her paw wrapped in the string and we had to assist unwinding it off her paw. It was wrapped 3x. Had we not been home it may have injured her for sure! I just shortened the strings and they are fine now. That being said, my cat loves it and is so entertained. We live in motorcoach and this is great for small spaces as well. We put it on the dash and she can sleep with a view and entertain others as well.",
      "rating": 3.0,
      "verified": true,
      "author": "Mattandsandy",
      "helpful_votes": 0,
      "publication_date": 20190709
    },
    {
      "title": "Kittens love it!",
      "text": "New mom of 2 baby kittens, and they absolutely love this thing! The only problems I’ve had is one of the balls keeps falling off and I have to keep reattaching. Kind of annoying but not that big of a deal. 2nd is it sheds very easily and I find myself having to vacuum it and the floor around it. Suuuuper annoying but my kitties love it so I’ll deal with it!",
      "rating": 4.0,
      "verified": true,
      "author": "laceyloo92584",
      "helpful_votes": 0,
      "publication_date": 20200501
    },
    {
      "title": "Ugh and Dangerous",
      "text": "UPDATE - after returning this item, tracking shows it was recieved on May 8,2020 - i still do not have my refund. So the first ball was torn off in 5 minutes...the second lost it's cover soon after. The \"tower\" is not stable...too tall, top heavy and not wide enough at the botton to be stable. We have to fold it up when we are not supervising, or else our cat could get its arms or body caught in it and tip it over. Not a great product. Maybe ok for a kitten but not an adult cat.",
      "rating": 1.0,
      "verified": true,
      "author": "Fester2",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "Really cute as advertised",
      "text": "Love this product and so does my furbaby. Only issues are that the cushion in the hide-away hole is very light and does not stay put. Kitty scrunches it up and gets under it. Also he scratches the carpet part of it and it's now shedding on the floor; just a little a and enough to sweep up. Very nice for kitty and the dangling balls are wearing him out. He can't help but attack them until he's just dog on too tired and has to rest!",
      "rating": 4.0,
      "verified": true,
      "author": "Kimbee Shopper",
      "helpful_votes": 0,
      "publication_date": 20191004
    },
    {
      "title": "My 4 cats love this! Mostly the 2 young ones (under 8 mos)",
      "text": "My 2 adult cats (2 yo) are a little big for the hammock portion, but will happily use the scratching post or lay inside. Kittens love to lay up top! The kittens play a little rough though and managed to rip the balls off the strings, not so durable. It sheds a little too, so I have had to vacuum around it every so often. All in all its worth the money, my cats enjoy it.",
      "rating": 5.0,
      "verified": true,
      "author": "Ladywrx",
      "helpful_votes": 0,
      "publication_date": 20191110
    },
    {
      "title": "My cats love it.",
      "text": "The ability to fold it up and store it is very convenient. My cat loves the hammock part. One of the string balls was easy ripped off but I was able to attack another toy to the string for the cats to play with.",
      "rating": 5.0,
      "verified": true,
      "author": "Erin Price",
      "helpful_votes": 0,
      "publication_date": 20200316
    },
    {
      "title": "Sturdy. but messy",
      "text": "Got this for our new kitten to sleep, play and scratch. She loves it. Super easy to assemble, sturdy. She runs up it, jumps on it, hangs off the side, jumps off, hasn't fallen yet. Have had 2 months now and still in pretty good shape. The downfall; she scratches the legs of the tower which is cover in a very soft fine material that sheds horribly and looks like snow all around the tower. So we just vacuum often. Would recommend.",
      "rating": 4.0,
      "verified": true,
      "author": "Amanda Kubin",
      "helpful_votes": 0,
      "publication_date": 20190927
    },
    {
      "title": "It sheds carpet fibers.",
      "text": "My kitty loves it! She was 2 1/2 months old when I got it for her. But within a week she had pulled both of the balls right off the strings. They weren’t very secure. And it “sheds”. Little fibers of the carpet come out, all over the place. If those two things were fixed, it would’ve been five stars. Overall it’s still worth the money. She loves it!!!",
      "rating": 3.0,
      "verified": true,
      "author": "E. Lambert",
      "helpful_votes": 0,
      "publication_date": 20200729
    },
    {
      "title": "Easy but maybe not the sturdiest",
      "text": "Of all the cat towers we've ordered this was by far the easiest to assemble. Slide out of box, open to extend the hammock, and you're done! Our two kittens love it so far (4-6lbs each), but they've already ripped off the ball toys! We didn't notice right away and it looks like one of them may have chewed off a piece of the thick elastic that attaches them. We're monitoring for any symptoms, but still... scary that the elastic detached in only a few hours of use. This piece is fun for now, but I guess may not be as sturdy as we were hoping.",
      "rating": 3.0,
      "verified": true,
      "author": "Samantha OConnor",
      "helpful_votes": 0,
      "publication_date": 20190825
    },
    {
      "title": "Could be a little more durable.",
      "text": "The hanging balls kept falling off till the fuzzy covers came off. By the time I had sewn it together again I noticed he doesn't use the scratching post on the side he used the legs....bare wood! He's only gone into the hole once since I got it. And the screws came out several times. And the screws Could be more tight so they don't fall off, and use some glue to keep the balls from losing the fuzzy cover.",
      "rating": 3.0,
      "verified": true,
      "author": "Alexandria maguire",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "Great size for lots of fun",
      "text": "My kitten took a minute to warm up to this but now it's her own personal jungle gym. She likes to kick the cushion liner out from the hidey bed and then pull it back in. It's very snuggly and looks fine in the living room. One of the dangly balls fell off very quickly though so I rigged something else up there. That's been the only downside so far.",
      "rating": 4.0,
      "verified": true,
      "author": "RebeccaTop Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20200712
    },
    {
      "title": "First purchase I loved, recent purchase arrived broken",
      "text": "I purchased this once 3 years ago and we loved it. No problems for the 3 years and I took this with on roadtrips too. Super convenient. Then my apartment building caught fire and I needed to replace it. I don't know if I just got a dud this time or if the quality has gone down. The inside part on the bottom had several loose staples in it. The top hammock part was coming off and staples were exposed. When I tried to staple it back down I could feel that the wood was cracked where that part was needing to be stapled down.",
      "rating": 3.0,
      "verified": true,
      "author": "Rachel",
      "helpful_votes": 0,
      "publication_date": 20180805
    },
    {
      "title": "Quality could be better",
      "text": "I choose this because I live in a apartment and I don't have a lot of space. The two balls that hang is not sturdy, it can be pulled easily. Also, the bedding on the bottom always comes off. I expected better quality especially because of the price. The glue and/or sewing of the material is not even. I had to replace the first one because it looked used.",
      "rating": 3.0,
      "verified": true,
      "author": "Luvblue28",
      "helpful_votes": 0,
      "publication_date": 20200610
    },
    {
      "title": "Good value for the money. Kittens love it!",
      "text": "The kittens love this. So much for them to do. They can scratch,play, hide, and sleep. I think this is great and they really enjoy it. The small little pieces on my floor in pic is from it shedding. I do have to vacuum them up often. I don’t think this will last forever but for the money I’m sure it will last long enough. Can fold flat if need to store or save some space.",
      "rating": 4.0,
      "verified": true,
      "author": "Diedre D. Rice",
      "helpful_votes": 0,
      "publication_date": 20200522
    },
    {
      "title": "Could be better",
      "text": "Delivery-great gotta love prime Setup-great pull out of the box and unfold Quality-not so great hence the 3 stars Not even 5 mins of my little guy (2 months old) playing with this the covering of the ball came off. I know I can return it but he does like it. I guess I’ll have to figure out a way to put the covering back on.",
      "rating": 3.0,
      "verified": true,
      "author": "jlu_express",
      "helpful_votes": 0,
      "publication_date": 20190301
    },
    {
      "title": "Well loved by our kitty!",
      "text": "Our cat absolutely loves this! She sleeps in the hammock all the time. And, if the dog is bothering her, she climbs into the little cubby below. She’s very playful, so the attached play fur balls are a hit. She doesn’t use the scratch pad much, but she has. She just really loves the hammock. I love how easy it is to deal with...how quickly it can be folded up and stored away.",
      "rating": 5.0,
      "verified": true,
      "author": "Tracy Feightner",
      "helpful_votes": 0,
      "publication_date": 20200321
    },
    {
      "title": "Horrible and injure your animal.",
      "text": "This is the absolute worst cat tree I have ever purchased. My kitten ended up getting hung up all the balls by her back leg. I dont even know how long she was that because I found her limp when I got home. Thankfully she is fine. The fabric sheds everywhere and now the hammock is breaking. I have had it for about 6 wks. The kitten is only 2lbs. So disappointed. Do not order this. Spend an extra 10 or 20 dollars on something that is worth it. As soon as all this happened it was too late to return. 👎👎👎",
      "rating": 1.0,
      "verified": true,
      "author": "E.H.",
      "helpful_votes": 0,
      "publication_date": 20190714
    },
    {
      "title": "absolutely perfect for kittens",
      "text": "I am beyond glad that I found this tower! Our old cat is not a fan, but our kitten loves it so much. She has only used the hammock a few times; she's more a fan of swinging around a hammock support like a monkey, or napping just underneath the hammock on the slanted surface. Bonus: the inside area on the bottom makes it easier to keep her free feed bowl safe from the dog.",
      "rating": 5.0,
      "verified": true,
      "author": "Brenna Forrey",
      "helpful_votes": 0,
      "publication_date": 20191206
    },
    {
      "title": "Yep, buy it.",
      "text": "Peppa & George LOVE this thing... it provides not only the endless challenge of catching the fuzzy balls, but a comfy resting spot as well... with a scratch pad to boot. The deadly duo highly recommend. Plus, practically ZERO assembly required which is my kind of product. Just, like... unfold it from the box and you're ready to go.",
      "rating": 5.0,
      "verified": true,
      "author": "Angeline",
      "helpful_votes": 0,
      "publication_date": 20200601
    },
    {
      "title": "Cheap price; cheaply made..",
      "text": "The concept of this tree is great, but the materials are not. The fabric is cheap and the kittens have shredded one of the sides where there is an opening and there are now several openings... The inside “liner” on the top hammock and the pad for the bottom is like styrofoam and small pieces of it are EVERYWHERE. I’m constantly cleaning up the area around this - it’s a nightmare. It’s cheap, and you get what you pay for, but I’m very disappointed that this only lasted a short few months.",
      "rating": 2.0,
      "verified": true,
      "author": "Sonilia",
      "helpful_votes": 0,
      "publication_date": 20180827
    },
    {
      "title": "Cannot believe all the good reviews--fell apart rapidly",
      "text": "I wanted to love this thing and my kittens did love it--until it quickly fell apart. The balls on strings were gone in a week. The side of the triangle opposite the scratching area is soft and flexible, and the cats tore a hole through it in less than a month. The rest of the holes all over appeared in less than 2 months. Liked the idea of a collapsible product and the design is ok, but the construction materials are severely lacking. A real shame I paid over forty for this. Expected far better quality & durability.",
      "rating": 2.0,
      "verified": true,
      "author": "mom24",
      "helpful_votes": 2,
      "publication_date": 20171128
    },
    {
      "title": "My cats are roommates in this kitty condo.",
      "text": "This thing is so great. It fulfilled all of my dreams and expectations. I put it in front of the window and if a cat is on top they can gaze longingly out at the adventures they will never have. If they go in the bottom hidey-hole they can nap in there all cozy. And the scratching area is great too. The balls only lasted a few weeks but now the cats play with the cords that the balls used to hang from.",
      "rating": 5.0,
      "verified": true,
      "author": "Gretchen",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "Cats like it, but it sheds fluff and isn’t  durable",
      "text": "I got this for my cats because I wanted to give them a scratching post and a place to hang out and hide in. It does the job, but it won’t for very long. In less than a month, the whole thing looks pretty shoddy. The toys are gone (there’s no way to put them back on) and the fabric is coming apart in places. The jute is separating from the frame, and the fabric, while soft, sheds like crazy. It’s ok, but I don’t expect it to last much longer and I won’t repurchase.",
      "rating": 3.0,
      "verified": true,
      "author": "Tasha",
      "helpful_votes": 0,
      "publication_date": 20181111
    },
    {
      "title": "Exercise and nap station in one!",
      "text": "My kitty loves this! She doesn't use the house part of it often but she gets pretty crazy batting the balls around and climbing all over it. She usually ends the night watching cat videos on youtube. She was unsure about it at first but I put her on top of it and she realized it was pretty comfy and it's now her favorite place to sleep!",
      "rating": 5.0,
      "verified": true,
      "author": "Halley",
      "helpful_votes": 0,
      "publication_date": 20200514
    },
    {
      "title": "Great simple product for the price",
      "text": "Only had this for a couple hours, but it's great. Super excited that there was absolutely no assembly. It just slides out of the box and you pop it open. Stores super easy too if you need to fold it up and put it away. And both the 3mo kitten and 10yo cat took to playing with it immediately. Great product so far, and absolutely for the price",
      "rating": 5.0,
      "verified": true,
      "author": "Paul A. Robertson",
      "helpful_votes": 0,
      "publication_date": 20200523
    },
    {
      "title": "Cats love it..but could be made a bit better.",
      "text": "My cats have enjoyed sitting on this little bench, they never use the scratching post part but do use the little balls to play with. They love bird watching in front of the window and take naps on it. I do wish it was maybe nailed vs being stapled though. Multiple staples have came out and the seat part is coming off. We're going to have to try to nail it back down. Also the little balls have both came off. Ive had to tie them back on several Times. Other than that we're happy with it.",
      "rating": 4.0,
      "verified": true,
      "author": "spring Disney",
      "helpful_votes": 0,
      "publication_date": 20181112
    },
    {
      "title": "LOVE THIS!!!!",
      "text": "I have a two year old blind cat who is very cautious about new tunnels, tents, etc... that being said, he is a very active fella and climbs anything and everything once it has been inspected and found to meet his standards. He was in this tent in less than 5 seconds. He loves the balls hanging above the scratching post, and he loves that he can play with his siblings without the risk of a tunnel or flimsy tent collapsing in on him. Marvel, Flex, and their momma give this 5 stars all the way!!! @sirgordonmarvel",
      "rating": 5.0,
      "verified": true,
      "author": "Mandy Mills",
      "helpful_votes": 0,
      "publication_date": 20200220
    },
    {
      "title": "Not well made, but kitten likes it",
      "text": "This cat tower is not particularly well made. A staple came out of the fabric on the top soon after our kitten started using it, making the fabric loose on top, and the dangling balls came off their strings very soon after. That said, our kitten likes it. She uses it daily for scratching and lounging. But, then again, she would still rather scratch our furniture. So - a mixed review.",
      "rating": 3.0,
      "verified": true,
      "author": "Patricia fentriss",
      "helpful_votes": 0,
      "publication_date": 20190323
    },
    {
      "title": "Great!",
      "text": "My cat loves this! He will usually sit there and look out the window most days. One thing is that the balls come off easily but they can be reattached. Another thing is that he’s only 4 months old right now and it already wobbles. I fear that he will start tipping it over soon. Otherwise it had been great for his nails, a sleeping place, and a playing tool. Great product! update: he is now a year old and still loves it! It hasn't collapsed and is still strong!",
      "rating": 4.0,
      "verified": true,
      "author": "Hailey",
      "helpful_votes": 0,
      "publication_date": 20181106
    },
    {
      "title": "100% would buy again",
      "text": "I have two cats in a two bedroom apartment and this was perfect to put in my bedroom for them! Small and easy to move to vacuum underneath, but the cats are more than happy with it! They are able to knock it over when they play too rough, they have pulled off one of the balls, and they have started to rip off some of the soft covering around the wooden arms, BUT they play very rough and it is more than worth what I paid for it! None of the damage can’t be fixed by hot glue lol.",
      "rating": 5.0,
      "verified": true,
      "author": "Krystal Cole",
      "helpful_votes": 0,
      "publication_date": 20200625
    },
    {
      "title": "DO NOT PURCHASE! HAZARDOUS!!",
      "text": "*****UPDATE on 5/29: My cat began chewing at the top. We realized he was pulling out STAPLES. The top is secured with STAPLES THAT ARE EASY TO REMOVE. If your pet swallows the staples it could result in SERIOUS INJURY OR WORSE! DO NOT PURCHASE THIS CAT PERCH. We are immediately removing ours from our home. ******* The cloths came off of both Pom poms in less than 24 hours. I’m hoping the rest of it holds up better than that. Pros; you don’t have to assemble it and my cat seems to like it so far.",
      "rating": 1.0,
      "verified": true,
      "author": "jackie",
      "helpful_votes": 0,
      "publication_date": 20190317
    },
    {
      "title": "This is a great product",
      "text": "This is very well built and nice to look at as well. Didn't need to assemble anything and arrived in great shape. I know it holds its own because the cat that took the most liking to it is my 18lb kitty. He's a big boy and LOVES this thing. Sleeps on it every day :-)",
      "rating": 5.0,
      "verified": true,
      "author": "Ktkt108",
      "helpful_votes": 7,
      "publication_date": 20160617
    },
    {
      "title": "Our cats LOVE this!",
      "text": "The two cats fight over it as they are now getting full grown so we'll have to get another one! They LOVE this what we call their \"sling chair\" they like to lounge in the sling chair part and watch tv. And they USE the cat scratching part which saves our sofas in the living room! The only thing is that the balls come off a lot so we keep tying them back on. Gotta figure out a knot that really works. LOL",
      "rating": 5.0,
      "verified": true,
      "author": "Amti",
      "helpful_votes": 0,
      "publication_date": 20200820
    },
    {
      "title": "Nice!",
      "text": "This little cat \"tree\" thing has definitely fulfilled it's purpose. I foster kittens, and they love it! They play and climb all over it, sleep in the hammock on top, and snuggle in the little cubby on the bottom. It can also be folded up and put away when I don't have any baby cats. It's mostly survived, having two litters (7 babies total) so far. The front did get a little tore up, but really, 7 wild kittens might be above \"normal\" use. I actually ended up just cutting off the part that became frayed and it's fine. I would definitely purchase again, and I definitely wouldn't want to be without it.",
      "rating": 5.0,
      "verified": true,
      "author": "Krista Drew",
      "helpful_votes": 0,
      "publication_date": 20181115
    },
    {
      "title": "Lots of entertainment",
      "text": "My cats love this thing. It's easily transportable, so we move it around. They made short work of the balls, but had a blast with them until they detached. I didn't expect the balls to last long, but it would be awesome if you could find a way to attach them in a more durable way.",
      "rating": 4.0,
      "verified": true,
      "author": "Deal Finder",
      "helpful_votes": 0,
      "publication_date": 20200420
    },
    {
      "title": "My cat's new place to perch",
      "text": "I got this so my cat had a place to sit when I travel. It folds up fairly flat and is reasonably stable for being lightweight. My cat wasn't sure of it at first but putting it by a window and a little catnip it has become a favorite place for her to lay in the hammock and watch birds.",
      "rating": 5.0,
      "verified": true,
      "author": "R",
      "helpful_votes": 0,
      "publication_date": 20200201
    },
    {
      "title": "This is our cats absolute FAVORITE thing",
      "text": "We adopted kittens about 5 months ago. We even had a \"kitten shower\" for them with our friends and family. They got TONS OF GIFTS. But there's nothing they like more than this. Can't recommend it enough!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "Good for kitten",
      "text": "We allowed our 13 year old to adopt a kitty for her bday. In order to insure her ability to care for a kitty, we had her buy everything with her own funds. As far as a tree goes, this is all she could afford. It works as it should, easy to fold out and ready for use right out of the box. Kitty Kastila likes it just fine. Definitely not for long-term use. Will definitely need a larger one as she grows.",
      "rating": 4.0,
      "verified": true,
      "author": "Brittany",
      "helpful_votes": 0,
      "publication_date": 20190417
    },
    {
      "title": "The cat seems satisfied",
      "text": "Took a while for my cat to finally decide to enter the ten enclosure at the bottom of the device. Has not learned yet to experiment with the scratch ramp but will continue encouragement. Also, the upper hammock is a bit unsteady so encouragement will continue with that feature. Overall, the item is well built and I am pleased with the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Bryan G.",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "Not Sturdy",
      "text": "My cat is almost a year old, probably about 5 or 6 pounds. This product falls over almost every time he jumps on it. I tried pushing it against the wall to help with it but it still just falls over. Hes now too scared to even go on it. Very disappointing.",
      "rating": 1.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 3,
      "publication_date": 20180921
    },
    {
      "title": "Great product, but quality could be a little better",
      "text": "This product has the perfect color that is easy on the eye, and is perfectly suited for cat owners who do not have too much space. My cat sunbathes, naps, plays, and uses her scratching post all in one highly portable unit thanks to this product. My cat is not very destructive, so I haven’t seen any problem with the product’s quality yet (she’s been using it for about 3 weeks now). However, I do think one downside is that the product is not made with very sturdy materials. Probably not the best for very large or aggressive cats. But it works so well for my small gentle one!",
      "rating": 5.0,
      "verified": true,
      "author": "Ohanna Mohammad",
      "helpful_votes": 0,
      "publication_date": 20200529
    },
    {
      "title": "Not weighted properly",
      "text": "I loved this product in theory but two things struck me upon it arriving. 1. It looks like a kitten in the pic, which accurately shows it relative size, and 2. It needed to have more weight on the bottom. My cat is not large. She jumped up onto the 'loungy' part on the top and it immediately over fell over. I put her on there myself and her just jumping off caused the same reaction.",
      "rating": 1.0,
      "verified": true,
      "author": "Charles D Zvirman",
      "helpful_votes": 0,
      "publication_date": 20190911
    },
    {
      "title": "No assembly and easy to fold away",
      "text": "Open the box and unfold, it's ready! Love these kind of cat trees. I gave this a 5 star review originally but changed it because the scratch pad portion of the tree, material surrounding it is already coming off. It appears to be glued around the edge? I will try to staple it back down. My cats do LOVE it though so I hope it holds up a while longer!",
      "rating": 4.0,
      "verified": true,
      "author": "L. Boileau",
      "helpful_votes": 0,
      "publication_date": 20190914
    },
    {
      "title": "Very nice",
      "text": "I loved how it just folds open, and is very good quality. However, it’s slippery because the bottom is that same material so it doesn’t work in my car area that is hardwood flooring I will have to put it in a carpeted room or modify the bottom with some kind of stop non slip.",
      "rating": 4.0,
      "verified": true,
      "author": "Dianellys ",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "Good looking, sturdy & easy to assemble",
      "text": "Ridiculously easy to assemble: open X, insert pillow. Our kitty immediately found the bottom hideout. She hasn’t used the hammock but she is cat and will do so if she chooses. We ordered the grey version- it is nice enough to put next to good living room furniture.",
      "rating": 5.0,
      "verified": true,
      "author": "greyhoundmamma",
      "helpful_votes": 0,
      "publication_date": 20200411
    },
    {
      "title": "Strong and very entertaining",
      "text": "My cats LOVE this! I might have to get another because they argue over who gets the top hammock. It came assembled and is very strong material and super soft. They love the scratchy part and especially playing with the pompoms. I have kittens and teanagers and fatty fat adult cats and they all love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Gloria",
      "helpful_votes": 0,
      "publication_date": 20190914
    },
    {
      "title": "Cozy, cute, practical :)",
      "text": "I love this! This piece comes folded & preassembled. All you have to do out of box is unfold and you’re done. I did tighten one screw that was a little loose but no big deal! & even though I won’t be storing mine, it is easy to store away by folding it back up if someone needed to. The bottom triangle “hideout” comes with a soft cover to put inside on the bottom so kitty will be nice and comfy. Fast with the prime shipping, soft material, good price for a sweet and fun & cozy piece of kitty furniture!!",
      "rating": 5.0,
      "verified": true,
      "author": "Steve21",
      "helpful_votes": 0,
      "publication_date": 20180530
    },
    {
      "title": "Great purchase!",
      "text": "My cat ripped the balls off within a week or so. But then they became additional toys for her. Lol Overall great buy! Especially for the price! Super Cute! She loves to nap at the top. We store her toys in the bottom opening. And she goes to town scratching her nails on the side! 😸",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie Henry",
      "helpful_votes": 0,
      "publication_date": 20200509
    },
    {
      "title": "Good quality, great price; Also suitable for toddlers",
      "text": "Comes assembled, just unfold to open. Super sturdy, my 5 yr old uses the hammock as a seat. Super cozy hammock, not too stretchy though. The little tent on the bottom is a great nap spot, can’t even tell the cats are in there. Though my tiny 3 yr old contorts her body to make it a (not so great) hiding spot. Size is perfect and design/materials are nice enough to not be an eyesore in the living room. Not sure if it’s just my destructive lady cat, but the dangly pom-poms didn’t last 48 hours.",
      "rating": 5.0,
      "verified": true,
      "author": "K. McGary",
      "helpful_votes": 0,
      "publication_date": 20191223
    },
    {
      "title": "Great for Feisty Little Kitten",
      "text": "My extremely feisty 3-4 month old tiny kitten LOVES this thing! Literally the only downside we've noticed, is that the hanging balls come off. Not a problem when the string unties, you can just retie it to the loop, but half a week in, the cream colored ball (lighter one that makes a rattle noise) came off of it's string! We found a way to reattach it, but it may be a problem when our kitten gets a bit bigger. Just be wary of that if your cat's above 3-5 lbs. Otherwise, awesome product!!",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200527
    },
    {
      "title": "Perfect for a kitten to grow into.",
      "text": "My sisters kitty cat loves this product. He is a kitten so it is a bit big for him to climb to the top yet. However, I was super impressed with the quality. He loves going inside of the bed area. Perfect for a kitten to grow into. He love the scratching area so that’s great for her furniture.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica G",
      "helpful_votes": 0,
      "publication_date": 20200626
    },
    {
      "title": "5 Star Product",
      "text": "This is my favorite item I’ve ordered for my kitten! There was no assembly, and my kitten jumps all over it and it doesn’t topple. I love the design and colors, and my kitty loves the ball and string attachments. So much so that he managed to tear off one of the balls, but he was really attacking it. The other one is still intact. I still highly recommend this tower!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200910
    },
    {
      "title": "My cat immediately went crazy for this.",
      "text": "Kitten, 12 weeks old, goes crazy for the dangling balls. She pulled one of them off within 30 minutes. Now that ball is a floor toy, which she loves. The other dangling ball, a week later, is still attached. Kitten is getting lots of exercise, likes the scratching pad and sleeps in the hammock.",
      "rating": 4.0,
      "verified": true,
      "author": "DebD",
      "helpful_votes": 0,
      "publication_date": 20190911
    },
    {
      "title": "Lots of fun - mostly well built.",
      "text": "She loves it - straight out of the box. Climbs all over it like a monkey! The 2 fabric covered balls that hang from it? The fabric comes off easily, and it is filled with fluff that is messy an probably not great for my cat. BUT - under that are hard balls with rattles. Those are great. Take the fabric off before the mess happens.",
      "rating": 4.0,
      "verified": true,
      "author": "M. Mohamed",
      "helpful_votes": 0,
      "publication_date": 20190326
    },
    {
      "title": "Fav spot to chill",
      "text": "My cat loves it!! She was iffy about the hammock at first and was worried she wouldn’t use it, but she finally figured out its purpose after a few days and spends her days (and nights) relaxing on it. She also loves the little hideout below. I took 2 star off because one of the little dangling balls already fell off after a few days, but overall a good purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "Kris",
      "helpful_votes": 0,
      "publication_date": 20190310
    },
    {
      "title": "Flints favorite item in the office",
      "text": "When I converted to working at home due to the Rona my feline Flint always felt left out. She had no place other than the bookcase to perch in that room. I got this to put next to my desk. She spends hours in, on, or scratching this portable station.",
      "rating": 5.0,
      "verified": true,
      "author": "Nth",
      "helpful_votes": 0,
      "publication_date": 20200913
    },
    {
      "title": "Amazing! Perfect for cats on vacay",
      "text": "My kitty loves this! So easy to set up. Comes already assembled. Plus it’s super sturdy. She jumps all over it and it never falls. Five stars for sure! Bought this to take on our vacation so we can just throw it in the car and she will have something to climb on in the house. Would definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Maci L.",
      "helpful_votes": 0,
      "publication_date": 20200716
    },
    {
      "title": "great for lounging",
      "text": "My cat loves to lounge in the top hammock. she will not go into the bottom cubby ( not sure what to call it) so i use that space to put her toys in so they are not all over the place. I think its great if you have a cat who is calm and likes to just lay around. Maybe not for a super playful cat. When my cat is hyper and jumps on and off this, it rocks back and forth a lot and it has fallen on her once already. I am going to buy a bigger cat tree for that reason.",
      "rating": 5.0,
      "verified": true,
      "author": "Erika Garcia",
      "helpful_votes": 0,
      "publication_date": 20190106
    },
    {
      "title": "Best Purchase!!!",
      "text": "My newly adopted cats LOVE this little tree. Shy mama hides in the bottom compartment and her kitten sleeps up top! The balls/stings do fall off very quickly, but anyone with a needle and thread and re-sew them and it’s PERFECT. The scratching post feature is also very nice :) this item is the best purchase I made for our two girls, highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Marianne",
      "helpful_votes": 0,
      "publication_date": 20200614
    },
    {
      "title": "Some Cats Might Like It...Mine Don't",
      "text": "My cats basically ignore this thing lol. Props--the scratching pad is at a perfect angle for stretchy scratching. It is small and unobtrusive where we've placed it in a high traffic area. Cons--the top level is too unstable/droopy and has no support for a cat to successfully hop onto it and the dangly poofs are too easily destroyed. I don't think my cats find it entertaining or comfortable.",
      "rating": 3.0,
      "verified": true,
      "author": "CSkwee",
      "helpful_votes": 0,
      "publication_date": 20200422
    },
    {
      "title": "Entertained by two kittens with two caveats..",
      "text": "I have two kittens a little over three months. They loved playing with this tower and also enjoy lounging in it. However, on day one, one of my kittens got his paw wrapped around the hanging string and was yelping/hissing because he was stuck. So i wouldn't recommend leaving your cats to play unattended. Also, they don't ever use the scratching area. Could just be them or perhaps its not a good scratching area. Still would recommend and happy with the purchase. I agree with the other reviewer who noted you may be best to remove the hanging balls.",
      "rating": 4.0,
      "verified": true,
      "author": "Lindsay",
      "helpful_votes": 0,
      "publication_date": 20181202
    },
    {
      "title": "My cat is obsessed",
      "text": "This was a good purchase. Easy to use. My cat loves it. I would recommend this and I will buy this again, because my cat (one year old), tore it to bits. It's better than a simple bed and a simple scratch post and this item is priced competitively.",
      "rating": 5.0,
      "verified": true,
      "author": "moviebuff",
      "helpful_votes": 0,
      "publication_date": 20200506
    },
    {
      "title": "The Hammock Alone is Worth It",
      "text": "Bought this for my cat Sinbad, and he loved it! The hammock up top quickly replaced our basket of blankets as his favorite napping spot, much to my fiancée's delight. Now he spends hours laying in the hammock and napping or watching us or the neighbors. He also uses the scratch board a lot, and every now and then he'll play with the balls. He only goes in the tent when we have visitors and he wants to hide.",
      "rating": 5.0,
      "verified": true,
      "author": "Person",
      "helpful_votes": 0,
      "publication_date": 20190324
    },
    {
      "title": "Great value!",
      "text": "I love this little cat tower. I have a young kitten and I didn't want to get something too tall for him to climb. I love how it folds up and that I can wash the bedding inside the bottom half. My cat loves climbing all over it, and it's super stable so I don't have to worry about it collapsing on him. Even the little toys hanging from the top rattle and make noise! Eventually I'll get my cat an actual tree when he grows a bit more but I'll be keeping this one around for sure!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190511
    }
  ],
  "product_meta": {
    "title": "Trixie Miguel Fold and Store Cat Tower",
    "description": "Size:20.25 x 13.75 x 25.5 inchesThe unique design of our Miguel Fold and Store Cat Tower make it ideal for small spaces. Simply fold shut for quick and easy storage. While in use, it will provide endless opportunities for cats to play, explore, scratch or just relax. Felines can sharpen their claws on the durable sisal scratching surface instead of on your furniture or carpet, giving them a healthy outlet for their scratching instincts. Spunky cats can jump, climb or perch in the plush hammock and lie in wait for unsuspecting prey or just relax and enjoy the view. For a cozy retreat, they can crawl inside the soft sided condo with a plush insert. Suitable for cats of all ages and activity levels. One year warranty. Color: gray/light gray. Dimensions 20.25 L x 13.75 W x 25.5 H inches. Scratching pad: 16 x 10 inches. Condo opening: 7 inches in diameter. Weight: 11 pounds.",
    "rating": 4.4,
    "feature_bullets": [
      "Ideal for small spaces",
      "Simply fold shut for quick and easy storage",
      "Condo and toy lying hammock wrapped in soft plush",
      "Natural sisal scratching surface",
      "Removable cushion: hand wash"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "20.25 x 13.75 x 25.5 inches; 4.82 Pounds",
      "Item model number": "44771",
      "Date First Available": "June 1, 2015",
      "Manufacturer": "Trixie Pet Products",
      "ASIN": "B00ZUC8B2M",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Cat Trees & Condos",
      "Pet Supplies",
      "Beds & Furniture",
      "Cat Houses & Condos",
      "Cats"
    ],
    "price": 53.99
  }
}