{
  "website_summaries": [
    {
      "verdict": "Certified military-grade materials and dual-layer protection provide added peace of mind.",
      "pros": [
        "Ultra-tough construction and sleek design",
        "Raised lips and camera cutout",
        "Easy-feel button indents",
        "Logo cutout is a nice touch and improves grip"
      ],
      "cons": [
        "Scratches and scuffs to the case are easily visible",
        "Sharp edges can be uncomfortable to hold"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "The case did not protect the phone. Dropped it ...",
      "text": "The case did not protect the phone. Dropped it once inside on kitchen floor and my whole screen shattered.",
      "rating": 1.0,
      "verified": true,
      "author": "aza P",
      "helpful_votes": 39,
      "publication_date": 20180201
    },
    {
      "title": "Survived a bike wreck at almost 50mph. These cases really are tough!",
      "text": "I bought a Spigen case for my iPhone 5s a while back and I really liked it. I flipped my bike on the freeway and it was in my back pocket. Needless to say, the phone survived! It actually imprinted the shape of the phone into the skin on my backside (the screen was facing my body). But the phone survived! I was shocked and amazed. I broke my shoulder and destroyed my bike, but the phone was intact. Needless to say, I only buy Spigen cases now.",
      "rating": 5.0,
      "verified": true,
      "author": "leno2002",
      "helpful_votes": 33,
      "publication_date": 20170928
    },
    {
      "title": "Combine with screen protector and you're golden.",
      "text": "I used to use a otterbox type case for my phone but got tired of how the screen felt on touch screen detection so I switched to a tempered glass cover and a low profile case for the back of my phone. Originally did this for my 5s and that case is still going on 3+ years so I when I got my 5s, I already knew to go back to Spigen and its just as rock solid as the 5s one. Can't beat this quality for this price.",
      "rating": 5.0,
      "verified": true,
      "author": "Garet Helmken",
      "helpful_votes": 11,
      "publication_date": 20180807
    },
    {
      "title": "Great case!",
      "text": "Great case! Replaced an Otter Box \"Commuter\" case for an iPhone 6S because the plastic corner chipped after being dropped (this has happened with numerous Otter Box \"Commuter\" cases on varying iPhone models I've had, so it got annoying paying for a new case regularly). The great thing about this Spigen case is that the corners are part of the hard rubber-type compound that encases the phone, rather than being hard plastic like the outer shell. So, it doesn't seem like the corners will chip/crack like the Otter Box. Most important, the price is great for a quality case!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20180726
    },
    {
      "title": "Great value for the money",
      "text": "I've used OtterBox for years and my last protector broke after a nasty drop (I had the case for 1.5 years), this time I've decided to try a less pricey option, and after looking through many reviews came to this one. I have a iPhone 6S and this case fits great, already had the kids knock it off the table once or twice and it seems to be pretty sturdy. For the money it's a good buy, my biggest gripe are the open sockets/ports on the bottom, I would have much preferred if they were covered if at least a bit, lots of dust/dirt will get into uncovered ports.",
      "rating": 4.0,
      "verified": true,
      "author": "WASTELAND RAVENTop Contributor: Board Games",
      "helpful_votes": 4,
      "publication_date": 20180312
    },
    {
      "title": "Looks amazing and fits perfectly on an iPhone 6s",
      "text": "I just got it and immediately put it on. It fits like a glove. It is tight as it should and seems to provide great protection to my new iPhone 6s. I bought a Spigen case for my iPhone 5 a long time ago and I still have it on that phone. It looks good. Not too thick. Remember, this is a case for small drops and pumps such as when you get off your car and it falls... Not when you drop it from a two story floor. I recommend it!",
      "rating": 5.0,
      "verified": true,
      "author": "EnrikeTop Contributor: Cycling",
      "helpful_votes": 13,
      "publication_date": 20151029
    },
    {
      "title": "Nearly Perfect",
      "text": "This case is much better than the original Moshi case I purchased with my iPhone at Sprint. Easier to grip and the corners are rubbery to absorb impact and wear. (The finish completely wore off the corners of my old Moshi case.) I also like that it protects the side buttons and does not cover the Apple icon on the back of the phone. The only improvement I would suggest would be to add covers for the phone's bottom input jacks so pocket lint and kibble from dog walking don't foul the connections. Good value.",
      "rating": 4.0,
      "verified": true,
      "author": "fiddler",
      "helpful_votes": 2,
      "publication_date": 20190108
    },
    {
      "title": "Tough enough to do the job",
      "text": "My husband is hard on phones. He's killed several mil-spec grade ones so when he said he was getting an IPhone I was concerned. They're not particularly known for durability! So far this case has help his new phone survive working cows, baling hay, working on the tractor and assorted farm equipment, fencing, etc. The phone is still operational, and the case isn't showing any signs of wear. I'm impressed. The only (slight) negative is it does impact the reception in the house, but he spends most of his time outside anyway, so that's not a huge drawback.",
      "rating": 5.0,
      "verified": true,
      "author": "SunnySD",
      "helpful_votes": 0,
      "publication_date": 20190703
    },
    {
      "title": "Looks really tough",
      "text": "I replaced another brand of iPhone case with this. This will exceed any situation I can see. Button access looks well thought out. Much more so than the last one. I took off one star because the lightening access port on the bottom is too deep. I use the charging dock, placing this on the charger does zip. I tried a regular charging cable and it fits and works fine. I like this so well, I’ll just change my charging method.",
      "rating": 4.0,
      "verified": true,
      "author": "SilverGhost",
      "helpful_votes": 3,
      "publication_date": 20171212
    },
    {
      "title": "True to word",
      "text": "This case is tough. It was bought for my teen daughter who is rough on phones. I have seen the phone dropped several times with the case on it, and there has been no damage to the phone (and we are talking blacktop, wood, in stores, etc.). I am a Prime Member, and we have tried several cases, and she likes this one by far the best. And, they make it in a color that actually matches her phone! That is a bonus she wasn't expecting.",
      "rating": 4.0,
      "verified": true,
      "author": "BusyMom",
      "helpful_votes": 3,
      "publication_date": 20161203
    },
    {
      "title": "Best case ever!",
      "text": "I had one of these on my iPhone 5S for three years and nothing ever happened to it. After having it on my phone on a daily basis from the start until I upgraded my phone, it was just amazing. My phone never got a scratch. I purchased an iPhone 6S last year and of course I still had to have this same case! It's slim, I love the color, and most importantly it's VERY durable. When I upgrade my phone again I will be purchasing another one to go with it. I cannot sing it's praises enough. It's the best phone case ever!",
      "rating": 5.0,
      "verified": true,
      "author": "Effie KV",
      "helpful_votes": 0,
      "publication_date": 20200503
    },
    {
      "title": "Great case legit reviews",
      "text": "I really like this case!!! Good reviews were right, thx much for that. I’m on my 3 otter box now on my 8+ very good case but very bulky. This is on my 6+ backup phone, very nice case and very durable and protective. Only suggestion from me would be and it may not matter to anyone else is , I like to use gps while driving and the back is a little slippery. I leave on my leg which I do know I could just buy a mount. Great case slim line not not huge and bulky, truly really really like this case with legitimate reviews.",
      "rating": 5.0,
      "verified": true,
      "author": "earl",
      "helpful_votes": 0,
      "publication_date": 20190515
    },
    {
      "title": "Decent",
      "text": "I'd give this five stars, but all the buttons are pretty difficult to both find by feel, and press. Why? Well, because its a TOUGH case! So, the toughness and ruggedness is good. Its just more difficult to control the side buttons as a result. Tradeoff I guess.... but somehow I think a little extra effort could have been made to make the buttons push a bit easier, and have a better tactile feel so I could actually find the buttons without looking at it.",
      "rating": 4.0,
      "verified": true,
      "author": "IncredibleHat",
      "helpful_votes": 0,
      "publication_date": 20190819
    },
    {
      "title": "Made with the klutz in mind",
      "text": "I have had this protector for over a year now and it has saved my phone from having to be replaced multiple times. I can't tell you how many times I've dropped this phone. It's dropped on the corners, back and most recently right on the face (in that case my screen protector took the brunt of the fall). In each case it has done it's job and kept my phone safe. It's scratched from the multiple falls, but still looks great and does it's job.",
      "rating": 5.0,
      "verified": true,
      "author": "Happy Grammy of 5",
      "helpful_votes": 0,
      "publication_date": 20190915
    },
    {
      "title": "Surprisingly tough case! Worth every penny!!!",
      "text": "Had this case about 6 mos & really impressed. Phone has survived multiple scary drops from waist height. Most impressively it survived being thrown at a moving car and landing across the street. No even a small crack in the screen saver although there is a small piece of case that came off by the power button. I would not recommend throwing your phone at a moving car but I would highly recommend this case to everyone.",
      "rating": 5.0,
      "verified": true,
      "author": "jandwd",
      "helpful_votes": 0,
      "publication_date": 20191026
    },
    {
      "title": "Love it, except for the sharp edges.",
      "text": "I'm a big Spigen fan. I've had their cases on all my phones and I find them the perfect balance of form and function. They're not too bulky, yet offer excellent protection. My only quibble with this case is that the molded, black edges are sharp. They press uncomfortably against my fingers when I'm holding my phone. I have the same model case on my iPad and those edges are not sharp. I do believe they'll wear down with use, so it's not a deal-breaker, but if you don't want to wait, I'd suggest you file them down a bit prior to installation.",
      "rating": 4.0,
      "verified": true,
      "author": "Kate J.",
      "helpful_votes": 6,
      "publication_date": 20160506
    },
    {
      "title": "Silicone case with a rigid metal panel. Fits snug ...",
      "text": "Silicone case with a rigid metal panel. Fits snug on the phone, but gives it rigidity in my pocket and for the inevitable drops of an iphone. UPDATE: 2 years in and the case has saved my phone countless times. The finish has worn off of the rigid back along the edges, so it isnt a uniform color anymore, but my IPhone is still safe and sound inside.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeremy",
      "helpful_votes": 4,
      "publication_date": 20171220
    },
    {
      "title": "Freak accident or design flaw?",
      "text": "I’ve had and used this case for a few months and I was quite happy with its comfort and durability there were slight spots of wear but I’m usually pretty hard on my cases because that’s what they are for, taking the brunt of the damage. I put my phone, wallet, and sunscreen in my backpack while visiting an amusement park (foreshadowing) only to find midday that the spray on sunscreen had opened up in my bag and sprayed all over the contents. I understand this is my fault but who in the world would think that SUNSCREEN! of all things the stuff you put on your SKIN would dissolve and peel the color coating off of your phone case?",
      "rating": 1.0,
      "verified": true,
      "author": "Carol",
      "helpful_votes": 0,
      "publication_date": 20190701
    },
    {
      "title": "Not for me",
      "text": "I just got this about a week ago. The back already has 3 scratches on the gunmetal portion of the case for sliding in and out of my pocket and laying it on counters at work. It doesn't slide in and out of my pocket very easy. The edges on the case are EXTREMELY uncomfortable and sucks holding the phone for long periods of time. This case was suggested to me by a coworker and I told him he was an idiot. Cant say how it would hold up to a drop but judging how hard the sides are, I would say pretty decent. I'm already back on here to order another case.",
      "rating": 2.0,
      "verified": true,
      "author": "GATx3",
      "helpful_votes": 2,
      "publication_date": 20190927
    },
    {
      "title": "Great product for a reasonable price!",
      "text": "This is the second one we have purchased, we have 2 iPhones and the cases are terrific! Very solid construction. We have on occasion, accidentally dropped our phones and the case is an excellent protector. Since it surrounds the phone and has a bit of a slight lip over the screen, the protection it offers is complete! Unless you drop your phone on a rock that hits the middle of the screen, you are good to go. We feel this is a fabulous product and the price is reasonable. Thank you for a quality product!",
      "rating": 5.0,
      "verified": true,
      "author": "sandb365",
      "helpful_votes": 0,
      "publication_date": 20181227
    },
    {
      "title": "The good: Very sturdy",
      "text": "The good: Very sturdy, perfect fit and great value for the money. The bad: The black rubber trim that surrounds the screen is the same height as the screen itself, so it offers virtually no protection to the screen. This would be a perfect case if they simply added to the height of the black rubber trim so it created a 1mm recess for screen. If you drop your phone and it lands screen down...its going to be damaged...and that's the whole point of the case in my view, protect the screen.Also, as others have said, the beveled edges are sharp and very hard...improvement would be to round the edges.",
      "rating": 3.0,
      "verified": true,
      "author": "Roi Soleil",
      "helpful_votes": 3,
      "publication_date": 20170201
    },
    {
      "title": "Not tempered glass friendly",
      "text": "I typically use your rugged armor. I purchased the tough armor this time because I could not find a coresponding 3rd party holster clip for the iPhone 6s rugged armor. When I installed a tempered glass screen protector it is almost flush with the raised lip. This negates the drop protection of the raised lip. Very disappointed.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20180821
    },
    {
      "title": "Excellent case!! Unintenionally tested multiple times!! Whoops!!",
      "text": "I have to believe my S6 would be dead at this point in time by my clumsiness, but this case has prolonged its life. Buttons are amazing as well, not too hard or soft, almost feels like they're part of the phone! However, the screen is still prone to cracking if it face-plants cement or concrete, so I would still recommend a decent glass screen protector as well. Back of the case is prone to oily stains from fingers and some surface scratching from sliding, but it's not a big deal since I'm not constantly staring at the back of my phone anyways! Would definitely buy again to upgrade it cosmetically.",
      "rating": 5.0,
      "verified": true,
      "author": "Eddy",
      "helpful_votes": 0,
      "publication_date": 20200619
    },
    {
      "title": "Sleek and Thin.",
      "text": "Loving this case. Perfect fit. Easy to install in the phone. Seems very sturdy and like it’ll protect the phone in the event of it being dropped. It has a very nice and thin profile which keeps the phone looking and feeling light and not bulky. Originally had the Otterbox Defender, then the Unicorn Beetle, and now this one. So far I’m liking this one better out of the three. Biggest difference between this one and the other two of course, this one doesn’t cover the front of the phone. Based on its design it’s supposed to protect the screen in case of a drop. I decided to pair up this case with the OtterBox Alpha Glass screen protector.",
      "rating": 5.0,
      "verified": true,
      "author": "JM",
      "helpful_votes": 0,
      "publication_date": 20180313
    },
    {
      "title": "Great protection for the iPhone 6 (even kids)!",
      "text": "Bought two of these for my kids’ iPhone 6, they are hard on stuff. Super durable, great lip to protect the screen. I did my research and after 7 months now I can safely say they earned their reputation and a 5 star rating...lots of drops and no broken phones. Make sure you get some glass screen protectors too, I like Tech Armor.",
      "rating": 5.0,
      "verified": true,
      "author": "Nate EP",
      "helpful_votes": 0,
      "publication_date": 20200206
    },
    {
      "title": "Not durable. Metal scratched",
      "text": "Flimsy. I suggest Otterbox Defender if you don’t mind the bulk, the durability is worth it. Lifeproof, same company, is not durable. Don’t recommend. XDoria w aluminum bumper is excellent. Imagine the iphone 5.....a good design that worked too well. Anker made excellent cases.... briefly.",
      "rating": 2.0,
      "verified": true,
      "author": "Office Drone",
      "helpful_votes": 0,
      "publication_date": 20191213
    },
    {
      "title": "Awesome phone cover- durable, strong, well made, not too thick",
      "text": "Love this phone cover. Way better than those flimsy plastic ones. Much stronger and more secure. You feel like if you drop your phone it will actually protect your phone. Still, not too large, which is nice; and the sides are rubber so it has some stickiness/ grip. Only downside is the volume buttons and lock button are a bit hard to use, because the cover covers them and again its strong rubber on the sides so you have to push down hard. But this is a great cover for keeping your phone safe and sound.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris D. Leister",
      "helpful_votes": 0,
      "publication_date": 20181220
    },
    {
      "title": "Don’t do it!",
      "text": "Sure it looks nice but DO NOT TRUST THE CALIMS. Video shows it dropping off bridges and the phone being fine. My phone dropped off the kitchen counter today and my screen shattered. I can not afford a new phone so I am hoping a screen replacement isn’t too much money and will be going back to Otterbox cases.",
      "rating": 1.0,
      "verified": true,
      "author": "Kristen",
      "helpful_votes": 2,
      "publication_date": 20190312
    },
    {
      "title": "It's a nice hard backing to protect the enclosure of your phone ...",
      "text": "It's ok. It's a nice hard backing to protect the enclosure of your phone and the rubber lips up above the screen to protect it from cracks. The rubber is a little too hard though and so it doesn't absorb impact very well, might as well be hard plastic. So even though my phone fell flat on the ground the screen shattered into pieces.. I have since gotten a new case that has a softer rubber lip; I have dropped it multiple times from a higher height and have not cracked the phone once. (knocks on wood)",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20170418
    },
    {
      "title": "Perfect case, very sturdy.",
      "text": "Not much to say here. The case is very solid, and I have no complaints whatsoever. I've had the case for almost a year and its shown barely any wear and no reduction in function. People may worry about ports and buttons being inaccessible or blocked. Worry not, as this case fits perfectly around buttons and leaves ports unobstructed, which is something I havent seen in other cases. It felt less like a case and more like an extension of the phone. Would highly recommend to anyone looking for a high quality basic case. Addendum: Note that this isn't waterproof, so if you live underwater, this case isn't for you.",
      "rating": 5.0,
      "verified": true,
      "author": "Tristan Rayner",
      "helpful_votes": 2,
      "publication_date": 20180114
    },
    {
      "title": "Amazing cover",
      "text": "Despite the fact that this case for some reason makes it very difficult to find my phone in my purse (maybe it's the sleek design), it's a wonderful case that looks great and has kept my phone safe since I bought it. I'm a bit of a klutz, so I drop my phone all the time, and this case has protected it every time it hit the ground. I think in the future I'll trust Spigen cases to protect my new phones because while the other cases have protected my phones, they haven't lasted as long.",
      "rating": 5.0,
      "verified": true,
      "author": "Kira",
      "helpful_votes": 0,
      "publication_date": 20190428
    },
    {
      "title": "Protection",
      "text": "I love this case. For the first time I can have bulky protection in a slimline case. I am actually enjoying holding and carrying a slim good looking case. I bought the gold. Beautiful! Worth the extra dollars. I left my phone on top of the car the other day. You guessed it. I drove down the road. When I finally recovered the phone, the damage was MINIMAL! The screen protector was not cracked. The damage to the case itself was two deep scratches on one side. Not that noticeable. I highly recommend this fantastically thinking case.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen Seeley",
      "helpful_votes": 0,
      "publication_date": 20190417
    },
    {
      "title": "But outside cosmetically it looks fine not a single scratch so overall I give the case four stars!",
      "text": "I bought this for my iPhone 6s overall pretty good case can’t complain I’ve had it on my phone along with a mr. shield tempered glass screen for About six months and my phone is still in new condition no cracks bumps bruises scrapes etc.. the phone itself is still brand new when I take it out of the case Although I don’t know how well the hardware on the inside Has held up from hard hits to the ground but I’d say pretty good cause I haven’t had any technical issues, But outside cosmetically it looks fine not a single scratch so overall I give the case four stars!",
      "rating": 4.0,
      "verified": true,
      "author": "Matthew Martin",
      "helpful_votes": 0,
      "publication_date": 20200319
    },
    {
      "title": "Fab Just Fab!",
      "text": "I love it. I don't like bulky cases but I need protection and I believe this is it. The case is a two piece, rubber and hard back. The rubber is thick and snugs well over the phone and it gives me confindence it'll protect it well. I bought the rose gold for my silver iPhone because it's the color I originally wanted but wasn't available. The rose gold is beautiful and it looks fantastic with the black. Even with the little silver that appears in the back with the apple symbol. Overall it's perfect, slick and super stylish. I'm picky so this met my wants.",
      "rating": 5.0,
      "verified": true,
      "author": "Elle",
      "helpful_votes": 3,
      "publication_date": 20160926
    },
    {
      "title": "I love this case!",
      "text": "This case is so amazing and strong! I have butter fingers and I’m always dropping my phone, but this case has saved me so many times! The case is slightly lifted so when I drop my phone, the ground doesn’t crack my screen. It’s light and fits well in my hand also!",
      "rating": 5.0,
      "verified": true,
      "author": "cheyenne locke",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "Great Spigen product as always",
      "text": "Great Spigen product as always. I have owned many of their cases and recommended them to my friends and to date no issues have arisen. Personally bought this to replace my near 5 year old spigen tough armor case to put a pop socket on and it worked great after roughing up the spot to attach it. Still sticking strong.",
      "rating": 5.0,
      "verified": true,
      "author": "Sidney L.",
      "helpful_votes": 0,
      "publication_date": 20190813
    },
    {
      "title": "Protects Phone Well, Eventually Broke",
      "text": "I've had this case for more than a year and have been happy with it. It has protected my phone in multiple drops and is nice to the touch. Last night most of the right side that covers the top of the phone fell to the floor while I was holding it. I suppose it broke in one of the several falls. I don't fault the product for this and have ordered another.",
      "rating": 4.0,
      "verified": true,
      "author": "Dallas Denny",
      "helpful_votes": 0,
      "publication_date": 20200926
    },
    {
      "title": "Solid case 5 yrs on",
      "text": "I’ve had the same exact case on my iPhone for about 5 years now, and my phone is still perfect, I think the rubber covering the edges of the screen help make it a little more water tight because my phone was sitting in a ziplock bag full of water from a kayaking incident and I replaced the aux port and charge port and it was good to go. Just bought the same case again because after 5 years the rubber split by the volume buttons. Well worth the money",
      "rating": 5.0,
      "verified": true,
      "author": "jamie",
      "helpful_votes": 0,
      "publication_date": 20200216
    },
    {
      "title": "Sturdy case with premium material",
      "text": "Very good protection for the phone. Case is made out of pretty sturdy material. The material hugging the phone is lifted relative to the screen, so the screen does not make contact with the surface if you set the phone down with the screen facing down. One downside is that the button parts of the case is poorly built because the buttons are kind of hard to press. It is not that bad but it could be much better with a more well-thought design. I would say that's pretty much the only flaw though. Satisfied with the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Nejat Can",
      "helpful_votes": 0,
      "publication_date": 20181117
    },
    {
      "title": "I like it, with one small caveat.",
      "text": "This is nice and sturdy. I had an otter box before and it just didn't work well for my phone 6S. I'd had an otter box for an older phone and it was great, but didn't work well on the newer model. My issue with this one is that for some reason the buttons are hard to press. I have to squeeze the power and volume buttons a few times to get them to work. I do like the look of it. It feels a less cheap than the otter box.",
      "rating": 4.0,
      "verified": true,
      "author": "Lars West",
      "helpful_votes": 0,
      "publication_date": 20200807
    },
    {
      "title": "Sturdy, durable, and sleek",
      "text": "I had this case years ago for my iPhone 5s. It was durable, sturdy, and sleek - it protected my phone without making it super thick. Tried an Otterbox for a few years in between. It was fine, but when it broke, I ordered another Spigen case. I’m happy to see that the quality has not changed! Also, the rose gold color is very pretty.",
      "rating": 5.0,
      "verified": true,
      "author": "Emily Song",
      "helpful_votes": 0,
      "publication_date": 20190423
    },
    {
      "title": "Back of case scratches too easily",
      "text": "Overall, it holds its own, from a protective standpoint. Where I am upset about this product, is the back metal part of the phone has scratched up way too easily (within a day of having the case on), it looks rather unpleasing. Additionally, the metal on the sides make it slightly an uncomfortable hold. Might have to switch back to otterbox, and pay the extra few bucks.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190910
    },
    {
      "title": "Spigen cases are the way to go",
      "text": "We have a family full of iPhone users and always purchase the spigen tough armor cases. The kids are rough on their phones (think skateboarding with the phone in their pockets, etc.) and we’ve never had an issue with these cases and they’ve always offered superior protection at a great price. Pair with the JetTech glass screen protectors and your phone is pretty safe, even with active teenagers.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 0,
      "publication_date": 20181211
    },
    {
      "title": "Our whole family has this brand",
      "text": "My dad had a spigen and so I ended up ordering one for my husband. They both loved them so much I got one for myself. We all love them. They are incredibly durable and keep your phone safe!!! My kids have dropped mine countless times and it has fallen out of bags and there may be a nick or or two but phone is in perfect condition. They are thin and sleek. Some are heavier than others depending on material. It has been a few years since we have had them and the are amazing cases.",
      "rating": 5.0,
      "verified": true,
      "author": "Liz",
      "helpful_votes": 0,
      "publication_date": 20181212
    },
    {
      "title": "Amazing even 3 years later!!",
      "text": "This is my old case and the new one I just recieved the old one is 3 years old almost 4 ! And it was only replaced because it looks old. It is still just as strong and just as good as new. I am a waiter and a server with my phone bumping around all day in my pocket or backpack. I have 2 jobs and ride the bus so there have been a ton of bumps and drops. This case is AMAZING!! I would highly recommend it to amyone who comes accross it! You will NOT regret your purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Alejandra",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "Amazing Product, Pleased Yet Again.",
      "text": "Amazing, I have the IPhone 11 version for myself, my grandfather got a new to him phone, and I bought him this case cause he didn’t buy one yet (for once, he’s usually ontop of that and telling other people to take care of their stuff) so I bought this one for him. The case is thick around the edges which is perfect for grip and drop protection. The case is also sleek and slim and looks good on the phone making it comfortable to hold, and nice to look at, not like the bulky but nice otterbox cases that make a phone look like an item that belongs in a utility belt.",
      "rating": 5.0,
      "verified": true,
      "author": "Jordan",
      "helpful_votes": 0,
      "publication_date": 20201001
    },
    {
      "title": "Excellent quality",
      "text": "Attractive looking case, and very sturdy hardware. I love the double-layer cases because they do a much better job at preventing damage from drops. I also love that the front extends maybe 1-2mm above the face of the phone to prevent drops cracking the screen...it could extend a little further IMO, because having a glass screen protector on it basically removes the benefit of the 1-2mm lip. Otherwise, I'm very happy with this, and has already saved my phone twice!",
      "rating": 5.0,
      "verified": true,
      "author": "Jackie",
      "helpful_votes": 0,
      "publication_date": 20180306
    },
    {
      "title": "Looks good and is strong, but scratches easily",
      "text": "It’s been great so far. It has taken various impacts, I always drop it, and there hasn’t been any structural damage to it or the phone. But the case has lost some paint from scratches.",
      "rating": 5.0,
      "verified": true,
      "author": "Mario",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "Great phone case!",
      "text": "This is a great phone case I used it for months and dropped my phone many times and no damage. The only reason it isn’t five stars is because I felt the volume button sometimes held down a little longer after I let off of it... was mildly annoying but not that big of a deal. After awhile I changed my case out and my dog actually chewed it up so I lost it. I just ordered another so I would consider it greater than many cases I’ve tried especially for the price on top of that I get to see the pretty rose gold I picked out at the store.",
      "rating": 4.0,
      "verified": true,
      "author": "jocelyn",
      "helpful_votes": 0,
      "publication_date": 20180523
    },
    {
      "title": "Protective and Sleek",
      "text": "This replaced my Otterbox Defender case (I loved otterbox for protecting my phone but the case was way too clunky). I love how sleek this one is and it's held up well. I mean I haven't dropped it on concrete yet and am not willing to test my phone on the pavement but for regular drops it's done a great job. I'm glad the case itself has held up - resisted all scratches and still has the same finish as when I got it. Would definitely buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Sand",
      "helpful_votes": 0,
      "publication_date": 20180423
    },
    {
      "title": "If you’re looking for something to protect your phone, this is it!",
      "text": "I’ve owned this case for about 3 or 4 years now and out of the hundred times I’ve dropped my iPhone (literally), not a single time my phone screen broke or cracked.. This is literally the best $17-18 I ever spent! At this point my case is all beat up and scratched and still strongly holding together while taking well care of my iPhone. If you’re looking for something to protect against frequent drops, this.. is.. the.. best.. choice.",
      "rating": 5.0,
      "verified": true,
      "author": "Frank",
      "helpful_votes": 0,
      "publication_date": 20190416
    },
    {
      "title": "AMAZING",
      "text": "Ive had this phone case for over two years now and its the best case I've every had! My phone has not gotten a scratch on it and I drop it a lot more than I should be. This is also the first phone I have every had for more than a year and I am 100% contributing that to the case. This case doesn't make it too bulky and doesn't limit the head phones or charger jacks like some cases. I will be buying another for my next phone.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelsey Meyer",
      "helpful_votes": 0,
      "publication_date": 20181206
    },
    {
      "title": "The best phone case ever!!!",
      "text": "I bought this case like almost 3 or 4 years ago and it is still the only case I have. My phone is in perfect condition. It has been dropped 1000 times either from me or from my son. It’s been thrown across the room(from my son) and not once has my phone been affected. I wish I could give this more than 5 stars because it’s the best phone case I have ever had in my life.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181229
    },
    {
      "title": "well made",
      "text": "This has lasted for quite a while. It is tough, not too big (what's the purpose of having a super thin phone when you cover it in a tank, right?) and has provided good protection when I've dropped my phone. I recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Reed",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Best case for phone droppers, period.",
      "text": "I will never buy a different case for my iPhone. I got this after my screen shattered when I dropped it flat on its face in another case. With this case I’ve dropped my phone numerous times—bounced it off an edge, landed it flat on its screen on cement—and my phone remains pristine. I really have put this thing through its paces (not on purpose!) and it keeps saving my clumsy butt.",
      "rating": 5.0,
      "verified": true,
      "author": "Midwest Best",
      "helpful_votes": 2,
      "publication_date": 20171111
    },
    {
      "title": "it provides excellent protection from most falls",
      "text": "This case has saved my phone on many occasion. It's not as bomb proof as an otterbox but it's also not as bulky. So there's a trade off. It is technically possible to crack your screen in this case but difficult to do. And given the sleek design, it provides excellent protection from most falls. Far and away better than cases I've used from Incipio and other brands.",
      "rating": 5.0,
      "verified": true,
      "author": "EPR",
      "helpful_votes": 0,
      "publication_date": 20181106
    },
    {
      "title": "Protective, attractive, good value",
      "text": "Sturdy and protective without being bulky. Easy to put on and take off, as long as you apply or remove the two parts (rubbery TPU and metal-feel polycarbonate) individually. Check YouTube videos for how to do this. After two months, doesn't show any signs of scratches or wear, despite rattling around in my purse next to my keys, pens,.... I like the look, I like the feel, I like the price, I like how it functions--an excellent buy, highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Robertson",
      "helpful_votes": 0,
      "publication_date": 20200515
    },
    {
      "title": "Spigens are the best for the money.",
      "text": "Spigen makes the best low-profile cases. Every phone seems like it's made to be as slippery as possible and the iphone 6s is no exception. The Spigen Tough armor case is rubberized so that it doesn't slip out of your hand, but also isn't so rubbery that it won't slip easily into your pocket. It's the perfect combination. Also, I haven't dropped my 6s yet, but I used to drop my Samsung Galaxy all the time, even once when I was biking and the thing bounced probably ten times before coming to a stop at the curb. No damage whatsoever. These are great cases for the money.",
      "rating": 4.0,
      "verified": true,
      "author": "Cowboythecat",
      "helpful_votes": 0,
      "publication_date": 20170123
    },
    {
      "title": "Spigen phone cases have been protecting phones our family has ...",
      "text": "Spigen phone cases have been protecting phones our family has owned for a few years now. Our phones have fallen down stairs, dropped onto the pavement and also from tall dressers onto tiled floors but nothing has happened to our phone screens so far. While the case can be a bit bulky and make your phone feel less sleek than it would without the cover, it is worth having this case to save you from any potentially expensive screen replacements down the line.",
      "rating": 5.0,
      "verified": true,
      "author": "Amrapali",
      "helpful_votes": 0,
      "publication_date": 20180106
    },
    {
      "title": "Classy and sturdy",
      "text": "Gave as a gift to my husband this Christmas. He loves it! Says he really likes how sturdy it is and how it feels in his hands. He also likes the gunmetal color. Says it has more of a classy look than the plain black that he’s had in the past.",
      "rating": 5.0,
      "verified": true,
      "author": "Aces",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "Great Quality for the Price",
      "text": "Slightly less comfortable than other products I’ve used as it has more angular edges as opposed to rounded edges. But can’t beat the quality relative to the price.",
      "rating": 4.0,
      "verified": true,
      "author": "Adam S",
      "helpful_votes": 0,
      "publication_date": 20200420
    },
    {
      "title": "Good Quality",
      "text": "I have had this case for while now and I am a fan of Spigen products. It is tough to get the case off so I don't bother with it. Plus, i don't really have a reson to take it off. My screen was already cracked when i purhcased the case being the reasson i needed a high quality case and i'm glad i got this one. I reccommend Spigen tough armour products. My boyfriend has a spigen tough armour for his samsung galaxy and he really likes his as well.",
      "rating": 5.0,
      "verified": true,
      "author": "A.Flo.01",
      "helpful_votes": 0,
      "publication_date": 20180926
    },
    {
      "title": "Outlived my phone",
      "text": "Unfortunately not waterproof, so I did eventually break my phone when I dropped it in the toilet. But up until then, it survived multiple drops onto the tile/pavement from various heights. I can't help but be clumsy, so having this was essential to my peace of mind.",
      "rating": 5.0,
      "verified": true,
      "author": "bzbee",
      "helpful_votes": 0,
      "publication_date": 20190607
    },
    {
      "title": "She has been very happy with it and she likes it much better than ...",
      "text": "This was a gift for the wife. She has been very happy with it and she likes it much better than her Otterbox. The issue with the Otterbox was that you have to take the case off of it to charge your phone. The Spigen does a great job on design. The charger port is open, the power and up/down buttons are sturdy and responsive. Give Spigen a try and I think you will be as happy as we are with this. Great case.",
      "rating": 5.0,
      "verified": true,
      "author": "J.Marzetti",
      "helpful_votes": 2,
      "publication_date": 20170716
    },
    {
      "title": "good case with some sharp edges",
      "text": "This case seems to be a durable case. Real metal over rubber. My only issue with it is that edges around all the port openings are kind of sharp and uncomfortable if you are like me and let the bottom of your phone rest on your pinky. lol i just dropped my phone while writing this. It was only a couple feet but all is well!",
      "rating": 4.0,
      "verified": true,
      "author": "rev",
      "helpful_votes": 0,
      "publication_date": 20181209
    },
    {
      "title": "So far so good!",
      "text": "I haven't had it long enough to say how it holds up which is why I'm only giving it 4 stars right now but so far so good! It's true to color, classy rose gold. Doesn't add too much thickness to my phone. The only thing I didn't like was on the bottom of the case where the port openings are it has some sharp edges that I hit with my pinky every so often. But I just gently filed them with a nail filer ahah!",
      "rating": 4.0,
      "verified": true,
      "author": "Amanda ",
      "helpful_votes": 2,
      "publication_date": 20170727
    },
    {
      "title": "This product comes from China",
      "text": "This product claims to be tough and with a screen protector, I bought this tp protect the new iPhone I bought for my daughter and with one drop, I was out $900. I cant even return this product as it arrives way past the return date. It took 2 months to get this phone case and when I got it, it was nothing like advertised. I really want to return this phone case and get my amonye back, but it is past the return date. At least it was not an expensive lesson.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20180827
    },
    {
      "title": "The quality you'd expect from Spigen",
      "text": "Went thru a ton of crappy phone cases before I got a tough armor for my 5s. That one literally lasted over 4 years and many many drops. My 5s is still in perfect condition. Got this case for my mom because it held up so well and she's less than careful with her phone. That being said there’s a tough armor case on my iPhone x, my iPad, and my mom and dads iphones. Never had a iPhone break in these and aside from a few tiny scratches it’s in the exact same condition as when I bought it.",
      "rating": 5.0,
      "verified": true,
      "author": "LAZZZERS",
      "helpful_votes": 0,
      "publication_date": 20171105
    },
    {
      "title": "Great cost friendly case",
      "text": "I’ve been using this case for about a month. It came packaged nicely and for my iPhone 6s perfectly. The black looks sleek. I was worried that it may be slippery to grab with the plastic, but don’t fret! There are rubber grips on all of the edges that helps it to stick and not fall when handling. I drop my phone all the time and have an 11 month at home who constantly plays with my phone, and it’s stood up very well so far!",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole",
      "helpful_votes": 0,
      "publication_date": 20180719
    },
    {
      "title": "3 problems I have with this case",
      "text": "It fits the phone well, protects it, feels good in your hand, but here are some problems with. First (and biggest to me), it overheats your phone. There is no breathable room for the phone. My phone would start to malfunction bc it got so overheated when using the screen for an extended period of time (watching a movie or videos). Second, the when using the speaker if you covered the port, the volume is decreased significantly. Third, when trying to lock the phone it would instead hit the volume buttons. The last one sounds like a me problem but I have not had it with previous cases.",
      "rating": 2.0,
      "verified": true,
      "author": "Samuel",
      "helpful_votes": 0,
      "publication_date": 20190802
    },
    {
      "title": "Super Durable!!",
      "text": "This is the best iPhone case I have ever bought. I have previously bought all major brands such as Trident, Armor, Otterbox, etc. all have broken by dropping or tugging. I have had many silicon cases tear and plastics break. This two shell case is perfect. It doesn't come apart so you cannot separate the two shells. It makes it easier to put on the phone and stays snug. It doesn't move at all and is very protective. I had dropped it many times and have had it for over a year.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180904
    },
    {
      "title": "Great Protection. Great Price.",
      "text": "Spigen Tough Armor cases are the only cases I’ve been using for the last 4 years. I’ve bought several extras because I end up giving mine to friends that don’t have one. These cases offer fantastic protection for a very reasonable price. Headphone jack cutout is plenty big for any style jack. Case does add some size to your phone, which I really liked on my 5s and 6s. Not sure I would like it on a plus-size model. Only issue I’ve noticed is that the case seems to scoop up pocket lint over time. Recommend checking/cleaning the case and phone every other month. A can of air duster does the trick 👍🏼.",
      "rating": 4.0,
      "verified": true,
      "author": "Evan Johnston",
      "helpful_votes": 0,
      "publication_date": 20190129
    },
    {
      "title": "Did NOT protect my phone! My screen shattered",
      "text": "My screen shattered only 10 days after putting it on my new iphone 6s. And YES, I also had a screen protector on the screen.",
      "rating": 1.0,
      "verified": true,
      "author": "ElmerHarkness",
      "helpful_votes": 2,
      "publication_date": 20190624
    },
    {
      "title": "It's stylish and doesn't add too much bulk so my phone still fits in my back pocket easily. IT also has a good grip to it",
      "text": "I've dropped my phone face down on concrete and it literally didn't even get scratched (and I don't have a screen cover, either). I've actually dropped my phone a ton of times over the years on different hard surfaces (inside and outside), but I don't even worry about my phone getting damaged anymore because with this case on it nothing ever happens to it. It's stylish and doesn't add too much bulk so my phone still fits in my back pocket easily. IT also has a good grip to it. I've had the Spigen Tough Armor case both on my current 6S and my previous iPhones, and it's the only case I'll ever buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Christie",
      "helpful_votes": 0,
      "publication_date": 20180623
    },
    {
      "title": "Held up perfect for 4 years!!",
      "text": "This phone case has done its job very well! I’ve dropped my phone... a lot! My kids have dropped my phone. I’ve had it for over 4 years & I am just now ordering another one because it’s starting to crack. I’m shocked it’s held up so well to all the abuse my phone takes.",
      "rating": 5.0,
      "verified": true,
      "author": "Heidi",
      "helpful_votes": 0,
      "publication_date": 20200805
    },
    {
      "title": "Highly Recommend! Survived a drop of 2 stories.",
      "text": "Well, this phone case deserves more than a 5 star! My 11 month old loves throwing stuff and decided to drop my phone from the second story and let me tell you that my phone survived this fall. Not a single scratch. Phone was just how it was before she dropped it. So if it can survive the fall of a two story it can survive anything.",
      "rating": 5.0,
      "verified": true,
      "author": "Angeles",
      "helpful_votes": 0,
      "publication_date": 20190701
    },
    {
      "title": "Sturdiness?",
      "text": "Going by numerous recommendations, I purchased this case. The one and only time I dropped my phone with this case on it from about 3 feet onto pavement, half the screen was damaged. It didn't crack, but there were vertical lines running through it which made the touch screen inoperable. I was looking for a durable case that wasn't too bulky (i.e. Otter Box), but it seems that you can't have both. Maybe this was an exception to what others have experienced, but I can't take that chance again and will look for something else.",
      "rating": 1.0,
      "verified": true,
      "author": "Christopher Barlow",
      "helpful_votes": 0,
      "publication_date": 20190709
    },
    {
      "title": "pretty and protective",
      "text": "I had this case almost 3 years. It’s awesome. It definitely saved my phone from a lot of falls. I tend to drop my phone quite a bit so the case did it’s job. Eventually a small piece broke off the case which is why I stopped using it but it was more so for cosmetic purposes because it still was very protective. Pretty color too. I got the rose gold.",
      "rating": 5.0,
      "verified": true,
      "author": "Becky G",
      "helpful_votes": 0,
      "publication_date": 20190713
    },
    {
      "title": "Very nice case",
      "text": "I was looking for a clear case for showing off the phone. However, after reading some reviews, I decided to purchase this product. So far so good. I have only had the case for less than 1 week. The color matches the phone exactly and it fits well. I like to keep my phone in my front jeans pocket and this case slides in and out easily. All the buttons on the phone matched the case exactly and I haven't had any problems with operation. I'm sure it will protect the phone, too, if I every drop it. I bought a tempered glass screen protector to go with this. I recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Kim S.",
      "helpful_votes": 0,
      "publication_date": 20161015
    },
    {
      "title": "Cost effective protection",
      "text": "I have dropped my phone more times than I can count. I was scared to not have the a life proof case anymore, but I was tired of not being able to hear people talk and was not happy with the clunkiness of it. So I read the reviews for this case, found the same color as my phone and decided to take a chance. I love this case! It's saved my phone quite a few times from destruction! Not water proof, but I love the design and the protection. Very cost effective! Recommended for those who want protection while not paying a ton.",
      "rating": 5.0,
      "verified": true,
      "author": "SKE",
      "helpful_votes": 0,
      "publication_date": 20170101
    },
    {
      "title": "Disappointingly not durable",
      "text": "I liked the look and feel of this case. However, my phone lives in my front pocket and the \"triple-layers\" were what ultimately caused this case to fall apart, after a little more than a year, as the layers peeled apart from each other. The backing fell off, after about 14 months, and the rest of the case became completely unusable, 4-5 months later.",
      "rating": 3.0,
      "verified": true,
      "author": "Campbell",
      "helpful_votes": 0,
      "publication_date": 20200522
    },
    {
      "title": "Buy on line, well worth money",
      "text": "Thin, not bulky, suggest getting protective screens, well worth it, have on iPhone 7,5 and 6, not bulky, suggest nite ize , phone case, mili spec, never.comes loose",
      "rating": 5.0,
      "verified": true,
      "author": "tonygreco",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Amazing",
      "text": "It has been 3 months since I bought this phone case and I love it! I've dropped it a million times and still no damage to the phone or the case itself (in use with a screen protector). It's not bulky, has a great feel to it, and looks really nice. The buttons also work really well; I have never had a problem with the power or volume buttons. I wish I found this case sooner!",
      "rating": 5.0,
      "verified": true,
      "author": "Josh M",
      "helpful_votes": 2,
      "publication_date": 20170603
    },
    {
      "title": "Only case I'll ever use",
      "text": "Trust this case! When I drop my phone it bounces! Have owned otter box and life proof, and I was not impressed more than with this case for protection! It's slim and doesn't add a lot of bulk. No shattered screens even without the screen protector! Only case our household uses! Update: I’ve now had this case over two years and my phone is still in perfect condition. I have dropped it a LOT! I did break a small chip on the case but phone perfectly intact!!! The only case ill ever use!",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer D Booth",
      "helpful_votes": 2,
      "publication_date": 20160610
    },
    {
      "title": "Tough, indeed!",
      "text": "The Spigen Tough Armor is indeed that. I have dropped my phone numerous times and it only shows a few small nicks. The openings are perfectly aligned and the buttons work well. One recommendation - it would be nice if they figured out a way to make the rubber match the color of the case. From the front you can only see the black rubber frame.",
      "rating": 4.0,
      "verified": true,
      "author": "K. Corpora",
      "helpful_votes": 0,
      "publication_date": 20190727
    },
    {
      "title": "Fits great and seems solid",
      "text": "I bought this for my daughter's new iPhone 6s that she got last week. It fits great. Easy to put on...seems like it would be very hard to take off. I ended up getting a tempered glass screen protector and I was going to take off the case before putting it on. Seemed like more trouble than it was worth so I put the screen protector on with the case on already. Had no problems. I like that it fits snug and feels like a quality case. Complements the space grey phone perfectly. The buttons work fine and it's not too bulky.",
      "rating": 5.0,
      "verified": true,
      "author": "Scot W.",
      "helpful_votes": 0,
      "publication_date": 20161107
    },
    {
      "title": "Very nice case",
      "text": "Great protection, and it also very attractive. Easy to install phone in it, but it holds it very firmly. It is very sleek compared to some of the other heavy duty cases I looked at. I feel confident that my phone is well protected. I was looking for a good case since I recently dropped my phone and cracked the protective BodyGuadrz cover on it (while using a different case). The BodyGuardz did its job, but I felt like if I had had a better case, I would not have cracked it. Glad I bought it!!",
      "rating": 5.0,
      "verified": true,
      "author": "bm",
      "helpful_votes": 2,
      "publication_date": 20160521
    },
    {
      "title": "One year in: good as new",
      "text": "Case just a year old now. Still looks super & has protected phone well. The slim fit of it is nice for pockets and for using with a magnetic mount.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon User",
      "helpful_votes": 0,
      "publication_date": 20191221
    },
    {
      "title": "Sleek and Protective",
      "text": "I have used a Spigen air cushion case on my last iPhone, a 5. When I purchased the 6 I immediately decided to get the same case because it has served me well. The front of the case wraps around the glass and protrudes far enough to keep the glass from contacting the surface of whatever you've dropped it on. I have already dropped this one several times without damaging my phone. The case is protective but not so bulky that it's unattractive. I like it a lot and recommend it to all fellow \"clumsies.\" As it comes in a variety of colors.",
      "rating": 5.0,
      "verified": true,
      "author": "Triedit.online",
      "helpful_votes": 2,
      "publication_date": 20160222
    },
    {
      "title": "Attractive, Sturdy iPhone Cover",
      "text": "This is a very sturdy iPhone cover. It is a sleek black and suits my son well because he just wanted something simple to protect his phone. It has worked out well for him.",
      "rating": 5.0,
      "verified": true,
      "author": "Brenda J.",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "I really like it",
      "text": "Pretty nice case. It held up to a couple of drops and there was no damage to my phone. I originally purchase for my son and then went back and bought one for me and my other son. We all like the design and the feel.",
      "rating": 5.0,
      "verified": true,
      "author": "Drew",
      "helpful_votes": 0,
      "publication_date": 20190619
    },
    {
      "title": "Love My Spigen!!",
      "text": "My second purchase of this item. Went from iPhone 5s to 6s. Still the same great construction and matches beautifully! At least one design change that I love... Little elevation nubs have been added to the corners both front and back. This means when set on a flat surface, the case is slightly raised giving it more protection from being scratched. I hardly ever drop my phone then in one week dropped it 4 times!! Twice on our bricked patio! The case stayed on and did it's job like a champ!",
      "rating": 5.0,
      "verified": true,
      "author": "BassinGal",
      "helpful_votes": 2,
      "publication_date": 20160421
    },
    {
      "title": "Slippery, uncomfortable",
      "text": "I rely on reviews for purchases, so when I saw all the positive reviews, I didn't hesitate to buy this case. I was really disappointed. The case seems very durable but slippery. I dropped my phone the first day I used the case. Thankfully, my phone survived the drop but I want a case that has better grip. It's not comfortable when you hold it. It has rough edges and the grip is annoying. No problems with ordering and shipping was fast and easy. There are more comfortable cases out there, and I had to return this one.",
      "rating": 2.0,
      "verified": true,
      "author": "Mary Smith",
      "helpful_votes": 2,
      "publication_date": 20180716
    },
    {
      "title": "It doesn’t fit",
      "text": "It’s to little for my daughters phone. The case was for a 6s/6 and my daughters phone is a 6s plus.",
      "rating": 1.0,
      "verified": true,
      "author": "Misty Baragar",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "Exccellent caser at attractive price.",
      "text": "Great fitting case. Love the actual integrated buttons on the case. Makes it much easier than the imbedded rubber type. Fits tightly in the case. Attractive. I have dropped it a few times on a cement floor. No damage to the case, glass, or phone!",
      "rating": 5.0,
      "verified": true,
      "author": "kenman",
      "helpful_votes": 0,
      "publication_date": 20191111
    },
    {
      "title": "Better than OtterBox Commuter",
      "text": "I like this case WAAAY better than my girlfriend's comparable otterbox. I like how slim the design is, it keeps my iPhone low-profile. I also like that the back of the case is hard plastic, rather than rubber, because it makes it easier to slide it in and out of my pocket. I also feel very confident in the protection that this affords my phone. The rubber is thick, and the buttons are easy to press, easier than an otterbox. I've dropped my phone dozens of times since I got this case and I'm not sweating it anytime soon. Highly recommended!",
      "rating": 4.0,
      "verified": true,
      "author": "Ben Goza",
      "helpful_votes": 0,
      "publication_date": 20160618
    },
    {
      "title": "Works for about 6 months",
      "text": "We have two of these cases. My wife’s case has very stiff buttons that have never softened to make control easier. My case is great except the backing on it is scuffing off. It is the only thing in my pocket so nothing is scuffing it. I am also very careful with my phone, so I don’t know why the backing feels like it is falling off.",
      "rating": 4.0,
      "verified": true,
      "author": "Schecter",
      "helpful_votes": 2,
      "publication_date": 20171014
    },
    {
      "title": "Beautiful, protective case!",
      "text": "I was looking for a case to compliment my rose gold I-phone but was also sleek and professional. This case definitely fits that criteria. I love it. It also seem to provide the protection needed for my cell phone. Unfortunately I have dropped my phone several times with this case on it and my phone remains unscratched. I would recommend this case.",
      "rating": 5.0,
      "verified": true,
      "author": "smilembs",
      "helpful_votes": 0,
      "publication_date": 20180307
    },
    {
      "title": "Good case to keep my phone safe!",
      "text": "Perfect for my new phone. All of the buttons line up and I don't feel like I need to worry when I accidentally drop my phone. The one complaint I have, is that it's difficult to put an AUX cable into the jack when the case is on. It's a little too thick to accommodate a fully seated cable, so I'll have to make a work around for that issue.",
      "rating": 4.0,
      "verified": true,
      "author": "Mo D.",
      "helpful_votes": 0,
      "publication_date": 20180408
    },
    {
      "title": "Protective but not bulky!",
      "text": "This case is a real steal for the price. 1. Very nice looking, matches my rose gold 6S. Many people compliment me on the case. 2. Has 4 raised ridges on the sides that keep the camera from hitting or dragging on tables or surfaces without ruining the balance of the phone 3. Very, very protective but not as bulky as Otter Boxes. I drop my phone quite a lot (clumsy), but not one scratch on the phone and no damage. 4. Sturdy with lip to protect the screen Will buy this case again for the next phone I get!",
      "rating": 5.0,
      "verified": true,
      "author": "Swaksha",
      "helpful_votes": 0,
      "publication_date": 20171121
    }
  ],
  "product_meta": {
    "title": "Spigen Tough Armor Designed for Apple iPhone 6S Case (2015) - Gunmetal",
    "description": "Color:Gunmetal| Style:SingleWhen the going gets tough on your phone, give it the protection it deserves. Our Tough Armor case for the iPhone 6s offers MIL-STD 810G 516.6 level security with Air Cushion Technology for protection against drops. On top of it all, the Tough Armor case gives your phone extra style.",
    "rating": 4.6,
    "feature_bullets": [
      "Certified MIL-STD 810G 516.6 protection with Air Cushion Technology for intense fortification against drops",
      "Two-part construction of shock-absorbing TPU and durable hard polycarbonate",
      "Defined buttons and raised lip offer button and screen protection",
      "Large cutouts fit most cables while protecting the phone and camera",
      "iPhone 6s Case Compatible with Apple iPhone 6s (2015) / iPhone 6 (2014)"
    ],
    "specifications": {
      "Product Dimensions": "5.7 x 2.9 x 0.4 inches",
      "Item Weight": "1.3 ounces",
      "ASIN": "B010MVIPA8",
      "Item model number": "SGP11612",
      "Customer Reviews": "4.6 out of 5 stars14,424 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#2,339 in Cell Phones & Accessories",
      "Is Discontinued By Manufacturer": "No",
      "Other display features": "Wireless",
      "Form Factor": "Bumper",
      "Colour": "Gunmetal",
      "Included Components": "IPhone",
      "Department": "Cell Phones & Accessories",
      "Manufacturer": "Spigen",
      "Date First Available": "June 29, 2015"
    },
    "categories": [
      "Cell Phones & Accessories",
      "Basic Cases",
      "Cases, Holsters & Sleeves",
      "All Departments"
    ],
    "price": 14.0
  }
}