{
  "website_summaries": [
    {
      "verdict": "This is a good-looking gas range with the power of convection. However, other options on our list offer more in terms of value and reliability.",
      "pros": [
        "A stainless steel gas range with convection cooking",
        "Oven and burners cook evenly",
        "4.2 cu",
        "ft. size isn't too large or too small",
        "Has a sturdy build"
      ],
      "cons": [
        "Customer service may not be helpful if you run into issues",
        "A few reports of damage upon delivery, and of ranges that turned out to be lemons",
        "Pricey"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "AMAZING!!!  Worth every penny.",
      "text": "I almost never write reviews but I had to for this purchase. I'm one of those people who takes forever to make a purchase because I research the hell out of things before I commit. Absolutely LOVE this oven. I cook and bake everyday and this baby is heaven sent plus it looks amazing in my kitchen. The convection oven browns everything perfectly even, the burners bring water to a boil quickly and have even distribution, and the broiler heats quickly and once again, cooks evenly. Love the heavy duty grates and professional look. Easy to clean. Installation was a breeze and it sits flush against the wall. I've had it for about 6 months now and couldn't be happier.",
      "rating": 5.0,
      "verified": true,
      "author": "F M",
      "helpful_votes": 152,
      "publication_date": 20170201
    },
    {
      "title": "Oven does NOT work.",
      "text": "We just got our new Thor stove model HRG3080U, had it professionally installed, and everything works except the oven. Apparently, the igniter doesn't seem to work. I followed the warranty work instructions and called the number but was on hold for so long, I left a message for them to call and gice me their authorized service people.",
      "rating": 1.0,
      "verified": true,
      "author": "Ray Maramara",
      "helpful_votes": 41,
      "publication_date": 20171124
    },
    {
      "title": "Thor Kitchen HRG3080u 30\"",
      "text": "We really love the look of this stove. However the oven has stopped working three times since we installed it. Very frustrating. Thor has sent repair people out and mentioned they are having problems with this oven. Hoping they will either get it corrected or refund the purchase.",
      "rating": 1.0,
      "verified": true,
      "author": "Anastasia Phillips",
      "helpful_votes": 20,
      "publication_date": 20180610
    },
    {
      "title": "DO NOT BUY!!!!",
      "text": "Bought this stove in May 2017. First problem was it was NOT 30” it was 30 1/16” so it would not fit in our newly remodeled countertops. Never seen that in 20 years in construction work. Second with in months the main front right burner stopped working correctly. Made several phone calls NO customer service. Months later the part was not available and still is not. We have been “living without” that burner. Today the oven will not come on. I’m done with this oven, going to the junk pile. DO NOT BUY this or any Thor oven!",
      "rating": 1.0,
      "verified": true,
      "author": "W. Fontaine Jr.",
      "helpful_votes": 6,
      "publication_date": 20200221
    },
    {
      "title": "Good Range but there are a few small issues",
      "text": "Range is good, Super powerful burners! All burners are large and small pans dont work that well since flames will go up the sides. Very happy but had to get a flat extension cord for plug becaue it pushed the range almost two inches from the wall. Amazon's delivery was just set it down in the street! Was told that my delivery was a \"Haul and Dump\" delivery from the person calling the day prior. Make sure you have help to get this heavy range into your home.",
      "rating": 4.0,
      "verified": true,
      "author": "David Renfro",
      "helpful_votes": 58,
      "publication_date": 20170102
    },
    {
      "title": "SO WONDERFUL!",
      "text": "This stove is spectacular. Not only does it look great, the heat output of the burners is awesome! My fiance is very picky about his BTU's and this stove is exceeding his expectations! This is very hard to do, as he worked in kitchen's for a long time. This stove was the closest he could get to a commercial stove, without actually getting one (our insurance wouldn't let us - we asked). The oven door is heavy and heats quickly and evenly. Excellent purchase! Ours came on a pallet and is heavy, but not too heavy that two people couldn't lift it to move it in the house. Great shipping and wonderful product!",
      "rating": 5.0,
      "verified": true,
      "author": "nforbes",
      "helpful_votes": 8,
      "publication_date": 20170901
    },
    {
      "title": "Worthless warranty + Horrible quality",
      "text": "Pray that nothing goes wrong. The warranty is worthless. Just paid $150 for someone to come out and fix a malfunctioning burner. (that was in 2017) Fast forward to 2020, the appliance is falling apart, coating is coming off the buttons, 1 burner ceased to work and the oven is dead. No one will work on these and Thor Appliances does not respond to request for support. That's $1,500 (plus shipping) down the drain. Stay away.",
      "rating": 1.0,
      "verified": true,
      "author": "Richard S Ellert",
      "helpful_votes": 8,
      "publication_date": 20180502
    },
    {
      "title": "Very Nice Range!",
      "text": "The simplicity of the design is fantastic. All the controls are on the front. The absence of a tall control panel in back makes for a surprising increase in the cooktop space. And I'm happy not to have to pay for a self-cleaning feature. The burners are far more powerful than on my old range. Only two reasons not to give it a 5-star review: the plug on the electrical cord is not a flat one causing a 3\" gap behind the range unless a workaround is used and while I haven't had problems with the knobs, they feel a bit insubstantial. Some solid ones would be nice.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 7,
      "publication_date": 20180227
    },
    {
      "title": "A bit disappointed",
      "text": "When it is working I love it because the range cooking and the convection oven cook really evenly. However, it has had electrical issues with the convection fan and the oven igniter. There are also not service people in our area so the first time with the convection fan response time on repair was at least 6 weeks. At least I could still use the oven without the convection. Now for this second one I only have a range. There are not many electrical parts here, get them right. The service contact people have been helpful though.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20190124
    },
    {
      "title": "I would like to give this oven zero stars",
      "text": "After only 2 years of owning this oven, the ignition for the oven has broken twice. We have had to replace the front panel of the oven entirely as the numbers melted as did the knobs with daily use. We have called customer service repeatedly with these issues and their solution to what is clearly a defective product is to replace and provide service until we are out of warranty entirely. We clearly have purchased a lemon and there is zero recourse. This is by far the worst product with the worst customer service we have ever purchased.",
      "rating": 1.0,
      "verified": true,
      "author": "PETER W LENZEN",
      "helpful_votes": 3,
      "publication_date": 20200116
    },
    {
      "title": "After 1, 5 year the burner handles melted on ...",
      "text": "After 1,5 year the burner handles melted on top and the over handle started glitching and turning on it’s own!! Has anyone else experienced this?!!",
      "rating": 1.0,
      "verified": true,
      "author": "Iuliana Ciorba",
      "helpful_votes": 10,
      "publication_date": 20180519
    },
    {
      "title": "Fantastic. Though my basis for comparison was a simple ...",
      "text": "Fantastic. Though my basis for comparison was a simple Kenmore unit we got at a local store, the upgrade is absolutely worth the price, and then some. Takes a little getting used to as the cast iron grates make a big difference, as do the much stronger burners. Oven holds temperatures very well. I do miss the drawer underneath the oven that my old one had, but not enough to cause any regrets overall.",
      "rating": 5.0,
      "verified": true,
      "author": "drjohn1963",
      "helpful_votes": 5,
      "publication_date": 20170905
    },
    {
      "title": "Excellent Range for Price.",
      "text": "Researched heavily and decided this was a good value. Not disappointed. Range seems well built and free of bells and whistles that break over time. Well packed for shipment. My husband did the Natural to LP gas conversion...suggest you pay someone else to do it for you. Not technically difficult, but still a pain in the a@#. Burners are very high power and oven holds a temp very well. Get an in-oven thermometer since oven dial seems to be off about 25 degrees. We've had it about two months. Would make purchase again.",
      "rating": 5.0,
      "verified": true,
      "author": "Debbi Tannock",
      "helpful_votes": 12,
      "publication_date": 20171125
    },
    {
      "title": "Don’t waste your $",
      "text": "I have had this range for two years now the igniter has gone out. I am having problems finding a company that will work on it because it is called a professional oven. when I first installed the range I opened the oven door and the heat melted the knobs I called Thor and they replaced them. Now they have melted again from the oven and I’ve been very careful not to let the oven door sit open when it’s really hot. I have tried to get new knobs again even offering to buy them since it is now out of warranty. I’ve had nothing but problems with the customer service department.",
      "rating": 1.0,
      "verified": true,
      "author": "Cindy Crump",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "... to many of these reviews but this stove is amazing. we got it three days before thanksgiving and ...",
      "text": "i don't write to many of these reviews but this stove is amazing . we got it three days before thanksgiving and had 22 people for that day and 20 more for christmas and it has been stunning. the burner btu rating are high and the simmer setting is great. fit and finish of the stainless is exceptional. i would highly recommend this range. make sure to print out the instructions for LP conversion before your gas guy comes over. it will be very helpful to him (or her).",
      "rating": 5.0,
      "verified": true,
      "author": "Marc Bussiere",
      "helpful_votes": 5,
      "publication_date": 20180112
    },
    {
      "title": "Perfect!",
      "text": "Got it quicker than I thought, everything is in perfect condition. Knobs using special coating, no way it can be melted like other reviews stated. It fits great for my kitchen. Going to also try their drawer refrigerator next. Great buy !",
      "rating": 5.0,
      "verified": true,
      "author": "Jonathan Chen",
      "helpful_votes": 2,
      "publication_date": 20200217
    },
    {
      "title": "Five Stars",
      "text": "Not good ! If you cook everyday... DON’T BUY IT !",
      "rating": 1.0,
      "verified": true,
      "author": "marinez santos",
      "helpful_votes": 7,
      "publication_date": 20180209
    },
    {
      "title": "Gorgeous!",
      "text": "We’ve been using this for about a week now. I adore it for its style factor and for the lack of digital annoyances. Our igniters all work perfectly and the oven cooks evenly! The only annoying thing is lining up the knob with the temperature lines when setting the oven temp. This is a no-frills pro style range that you will LOVE as long as you’re not expecting timers and extra gadgetry!",
      "rating": 5.0,
      "verified": true,
      "author": "Rebecca B",
      "helpful_votes": 2,
      "publication_date": 20180624
    },
    {
      "title": "Nice to be able to buy an oven at a ...",
      "text": "Nice to be able to buy an oven at a normal price hat is focused on delivering heat where it is supposed to go instead of just looking pretty. This oven is engineered around the burners which are superb. One turns a knob and gets beautiful blue bundles of burning gas. Another knob turn and the stove turns on. Want convection - rock the convection switch to on. If you want to cook - get this range. If you want to sit around and tell people how you can program your oven to come on when you are not home - well - get something else.",
      "rating": 5.0,
      "verified": true,
      "author": "educatedconsumer",
      "helpful_votes": 13,
      "publication_date": 20171027
    },
    {
      "title": "Works perfectly and looks $$$ :-)",
      "text": "Works great, and looks fantastic. I was very hesitant to buy because of all the negative reviews and people saying that it didn’t totally work when first installed. I got lucky, or they fixed those issues! Mine was perfect right out of the box. I’m getting ready to sell my house, and it looks soooo pretty. So glad I got it, may get another one at my new house!",
      "rating": 5.0,
      "verified": true,
      "author": "Anna Soman",
      "helpful_votes": 2,
      "publication_date": 20180313
    },
    {
      "title": "Knobs are melting....",
      "text": "Very handsome range and gets very hot as expected but knobs are covered in a synthetic coating that has shrunk and looks terrible. The front simmer burner stopped working after the first few months. The blue porcelain interior is easy to clean and I love that. Can I get replacement knobs? I’m pretty sure it’s still under warranty but just be aware of this problem",
      "rating": 3.0,
      "verified": true,
      "author": "Mom-o-six",
      "helpful_votes": 0,
      "publication_date": 20190418
    },
    {
      "title": "arrived broken... twice. and XPO refused ...",
      "text": "arrived broken...twice. and XPO refused to haul away the other broken units.",
      "rating": 1.0,
      "verified": true,
      "author": "Robert F. Brassell II",
      "helpful_votes": 3,
      "publication_date": 20180917
    },
    {
      "title": "The first stove was damaged in shipping but Amazon did a great job getting the damaged stove picked up and new ...",
      "text": "Did some big time research! Did not want a Box Store stove and this one hit it out of the park!! I do scratch cooking all in old cast iron and this makes food taste even more incredible!! The first stove was damaged in shipping but Amazon did a great job getting the damaged stove picked up and new one delivered! Very satisfied with everything and quite a savings!!",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin Kenneally",
      "helpful_votes": 0,
      "publication_date": 20180722
    },
    {
      "title": "Timeless and simple",
      "text": "Very cool stove. I love the simplicity and minimalistic feel of this stove...like five knobs...that's it. Very high quality. No messing around. I'd buy it again.",
      "rating": 5.0,
      "verified": true,
      "author": "Vick",
      "helpful_votes": 0,
      "publication_date": 20190822
    },
    {
      "title": "Terrible company. Do not buy",
      "text": "This product came to me broke. No one wants to service a product under warranty. This is going on for 3 months. Product had a issue and still sent it out. it has been a night mare",
      "rating": 1.0,
      "verified": true,
      "author": "Pamela E.",
      "helpful_votes": 0,
      "publication_date": 20191202
    },
    {
      "title": "The most beautiful pro like gas range",
      "text": "I have used this beautiful range for two weeks and cannot begin to tell you how happy I am with my purchase. Have baked buns every morning, tried out every burner, even the 18,000 BTU one which proved to be fantastic for stir fry. I still haven't made use of the broiler feature or the convection part, but it won't be long. Highly recommended - not only does it look great but it actually works beautifully.",
      "rating": 5.0,
      "verified": true,
      "author": "DD",
      "helpful_votes": 8,
      "publication_date": 20170308
    },
    {
      "title": "Five Stars",
      "text": "Solid, even heating, no fancy electronics to break. Exactly what I needed and expected.",
      "rating": 5.0,
      "verified": true,
      "author": "Zeb Bufus",
      "helpful_votes": 2,
      "publication_date": 20180101
    },
    {
      "title": "Stay away has many quality issues.",
      "text": "Low quality product that doesn’t last. The oven stopped working after 18 months (faulty igniter), cooktop makes noise, and the knobs fall apart. Just stay away.",
      "rating": 2.0,
      "verified": true,
      "author": "Berkeley",
      "helpful_votes": 0,
      "publication_date": 20201011
    },
    {
      "title": "Kinda Disappointed",
      "text": "I love the way it Cooks ! BUT I've only owned mine for a few months and I have multiple issues kind of minor but for the price I expected more ( Door Hinge already broke , knobs print is wearing off already , and the simmer setting is Makeing a popping gas bubble type noise , Scratches too Easy ) but for the price and what thought I was buying I feel like I should of bought something less expensive , Very Pricey and expected a better Built stove , I feel like my old one (a average kenmore 500 dollar type stove lasted longer ) Feel like I wasted some money",
      "rating": 3.0,
      "verified": true,
      "author": "Iuso",
      "helpful_votes": 6,
      "publication_date": 20180212
    },
    {
      "title": "so far its very nice",
      "text": "the only complaint I have is that the oven racks could be more substantial with a better design to keep them from cocking out of square and binding. other than that this is a great stove so far. I have been using it for a month.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180929
    },
    {
      "title": "Great product, well made and performs perfectly",
      "text": "Great product, well made and performs perfectly. I wanted a gas stove that had no electronics and strong burners. This stove is sleek and easy to clean and use. Customer Service was outstanding. I found a small defect in the bottom of the stove and they immediately responded and sent our a replacement part.",
      "rating": 5.0,
      "verified": true,
      "author": "EBW",
      "helpful_votes": 4,
      "publication_date": 20171212
    },
    {
      "title": "Nice professional stove",
      "text": "I got this stove as a first delivery and the service was excellent. The burners are high quality. I like that this is a professional stove with a 30 inch width. The oven looks nice with the blue porcelain. I found out from the booklet that the oven is easy to keep clean and wipe off any spills.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 3,
      "publication_date": 20171107
    },
    {
      "title": "Five Stars",
      "text": "Great looking & very happy cooking with it! Delivered as scheduled & great packing with no damage!",
      "rating": 5.0,
      "verified": true,
      "author": "Curt Herron",
      "helpful_votes": 0,
      "publication_date": 20180313
    },
    {
      "title": "Five Stars",
      "text": "I love the look ! The burners are awesome! It looks and feels quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180423
    },
    {
      "title": "This stove looks great and functions beautifully",
      "text": "This stove looks great and functions beautifully. Love the professional look. Loved the price and that it is not loaded with a bunch of computerized accessories that will break down and that I don't need. Burners are easy to use and control the heat! Also love the bright blue oven interior.",
      "rating": 5.0,
      "verified": true,
      "author": "Peggy L.",
      "helpful_votes": 15,
      "publication_date": 20161229
    },
    {
      "title": "After a month, pleased & working as expected",
      "text": "I've had it for a month and am pleased with it. It looks good and the oven and stove work well - as expected. No bells and whistles which is what I wanted as my prior unit's electrical board went out, and it wasn't worth the cost to fix (what a waste). Seems to be solidly made. What's keeping me from rating 5 stars is that it is not easily apparent when the oven is fully pre-heated. A bell or ding would be nice to have.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 32,
      "publication_date": 20160909
    },
    {
      "title": "... run this oven for about 2 months and I LOVE it. After a failure of my last range ...",
      "text": "Have now run this oven for about 2 months and I LOVE it. After a failure of my last range from electronic brain damage, I wanted an all mechanical oven with just knobs and switches and that is exactly what you get. Other than a small snafu with the burner ignitors which turned out to be an improperly wired outlet, it has worked beautifully. It has excellent temp control and the highest burner settings are high enough to do some serious water boilage in rapid order. The little mini simmer burner is actually useful. Grates are holding up fine as is the finish. Can't beat it for the money.",
      "rating": 4.0,
      "verified": true,
      "author": "Kevin Enderle",
      "helpful_votes": 16,
      "publication_date": 20161215
    },
    {
      "title": "beautiful stove but no service or parts availablity",
      "text": "I installed this stove in a very nice rental so the experience is not really first hand. But the tenant loves it and says to cooks excellent. The after a year some burners will not light, service companies we called said they could not get parts. So we have to light with a match. Several repair companies have been called and all say parts are not available.",
      "rating": 2.0,
      "verified": true,
      "author": "G. Reed",
      "helpful_votes": 9,
      "publication_date": 20160909
    },
    {
      "title": "Very nice Stove",
      "text": "Stove arrived LTL with lift gate. After opening the packaging it arrived in perfect condition. This is quality stove priced within reason. After installing I could not be happier. Just a simple classy, well made, good cooking stove. No bells and whistles just a great cooking tool. You will not be disappointed with this stove.",
      "rating": 5.0,
      "verified": true,
      "author": "Happy with Vortex",
      "helpful_votes": 19,
      "publication_date": 20161021
    },
    {
      "title": "Four Stars",
      "text": "Good only problem no warning when the oven is already in right temperature!",
      "rating": 4.0,
      "verified": true,
      "author": "Adelina G.",
      "helpful_votes": 2,
      "publication_date": 20180318
    },
    {
      "title": "Great unit at this price point. LP kit is a chore to install.",
      "text": "So far so good. This is a affordable unit that is exceptionally powerful. Please note that the LP kit is a bear to install.",
      "rating": 5.0,
      "verified": true,
      "author": "Bruce Bryant",
      "helpful_votes": 5,
      "publication_date": 20170120
    },
    {
      "title": "The 5stars us for Elite Home Appliances! I had ...",
      "text": "The 5stars us for Elite Home Appliances! I had a little trouble with the oven and thor customer service was so so....but elite really stepped up. I would buy from elite appliance!",
      "rating": 5.0,
      "verified": true,
      "author": "M. Song",
      "helpful_votes": 2,
      "publication_date": 20171111
    },
    {
      "title": "... of weeks and bottom line is we are very happy with it",
      "text": "Had it a couple of weeks and bottom line is we are very happy with it. Delivery was a little fraught: 7 days prior to delivery, I had to change the delivery time due to a conflict and, altghough amazon helpdesk individual (Sai Krishna) assured me the message would be passed to the delivery company, this apparently never happened, with the ensuing confusion, wasted time, etc... The cooker is solid, the burners work very well, the knobs are solidly built and turn smoothly to give smooth flame control, oven is about 25F off, but one can easily compensate for that. For the money, I really couldn't be happier.",
      "rating": 5.0,
      "verified": true,
      "author": "Nikla+Matt",
      "helpful_votes": 18,
      "publication_date": 20160807
    },
    {
      "title": "... that has had it for awhile if they still love it. Any feedback would be greatly appreciated",
      "text": "I am considering buying this range and I want to ask everyone that has had it for awhile if they still love it. Any feedback would be greatly appreciated!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Tina Thompson",
      "helpful_votes": 0,
      "publication_date": 20161027
    },
    {
      "title": "Disaster",
      "text": "Total junk. It barely works. Terrible customer service at Thor whenever we call. No one will help us. It just doesn't work.",
      "rating": 1.0,
      "verified": true,
      "author": "rebecca becker",
      "helpful_votes": 23,
      "publication_date": 20161008
    }
  ],
  "product_meta": {
    "title": "Thor Kitchen HRG3080U 30\" Freestanding Professional Style Gas Range with 4.2 cu. ft. Oven, 4 Burners, Convection Fan, Cast Iron Grates, and Blue Porcelain Oven Interior, in Stainless Steel",
    "description": "HRG3080U Features: -15,000 BTU burner with 650 BTU simmer function. -18,000 BTU burner for high heat searing. -Manufacture provides 2 year warranty on parts and labor. -4.2 cu. ft. oven capacity for cooking multiple dishes. -Durable heavy duty cast-iron cooking grates. -Electronic Ignition with Auto Re-ignition feature. Product Type: -Free-standing. Control Type: -Knobs. Finish: -Stainless steel. Stove Top Material: -Metal. Number of Ovens: -Single oven. Fuel Type: -Gas. Convection Oven: -Yes. Cooktop Surface: -Grate. Number of Burners: -4. Primary Material: -Steel. Oven Capacity: -4.2 Cubic Feet. Dimensions: Overall Height - Top to Bottom: -39.75\". Overall Width - Side to Side: -30\". Overall Depth - Front to Back: -27.5\". Overall Product Weight: -195 lbs.",
    "rating": 3,
    "feature_bullets": [
      "4.2 cu. ft. oven capacity for cooking multiple dishes",
      "High powered 22,000 BTU convection oven",
      "Features 4 burners: 18,000 BTU, 15,000 BTU and twin 12,000 BTU burners",
      "Modern stainless steel surface is easy to clean and looks great",
      "2 year warranty on parts and labor"
    ],
    "specifications": {
      "Brand Name": "Thor Kitchen",
      "Model Info": "HRG-3080U",
      "Item Weight": "172 pounds",
      "Product Dimensions": "27.5 x 30 x 39.75 inches",
      "Item model number": "HRG-3080U",
      "Is Discontinued By Manufacturer": "No",
      "Capacity": "4.2 Cubic Feet",
      "Installation Type": "Free standing",
      "Part Number": "HRG-3080U",
      "Form Factor": "Freestanding",
      "Special Features": "13,000 BTU Broiler for grilling and browning food., Stylish stainless metal finish control knobs, High powered 22,000 BTU Convection Oven, Twin Halogen Oven Lights, 2 Year Warranty on parts and labor, Durable heavy duty cast-iron cooking grates, Electronic Ignition with Auto Re-ignition feature, Extra-large oven window to easily monitor the progress of your cooking",
      "Heating Elements": "4",
      "Color": "Stainless Steel",
      "Voltage": "120 Volts",
      "Fuel type": "Natural Gas",
      "Material Type": "Grate",
      "Included Components": "None",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "ASIN": "B0100A3H54",
      "Customer Reviews": "3.0 out of 5 stars97 ratings3.0 out of 5 stars",
      "Best Sellers Rank": "#800 in Appliances",
      "Date First Available": "June 19, 2015"
    },
    "categories": [
      "Appliances",
      "Ranges, Ovens & Cooktops",
      "Ranges",
      "Freestanding Ranges"
    ],
    "price": 1999.0
  }
}