{
  "website_summaries": [
    {
      "verdict": "The entry-level Dell Inspiron 11 3000 Series 2-in-1 (3147) proves that you don't have to compromise if you want a convertible-hybrid laptop that lasts all day and fully utilizes its touch screen.",
      "pros": [
        "More than 8 hours of battery life",
        "Thin and compact",
        "Feels sturdy",
        "Comfortable to hold",
        "Full-size HDMI port and three USB ports"
      ],
      "cons": [
        "Aggressive screen dimming",
        "Has a little keyboard flex",
        "USB 3.0 ports are same color as USB 2.0 ports"
      ],
      "aspects": {},
      "publication_date": 20150320,
      "rating": 8.0,
      "source": "pcmag"
    }
  ],
  "customer_reviews": [
    {
      "title": "Still a great laptop",
      "text": "I bought this computer on September of 2015. I have taken this laptop with me just about everywhere I have traveled. It has stood the test of time. It is a well built and durable unit. I just upgraded the ram and put in an SSD hardrive. It is a little faster now than it was when I bought it over 3 years ago. Battery life is not as good (expected with an over 3 year old battery) so I will put in a fresh one soon. This is not a powerhouse computer, but will do all of the computer basics without a hitch. Just wanted to give a long term review of a great little Dell laptop.",
      "rating": 5.0,
      "verified": true,
      "author": "TAW",
      "helpful_votes": 4,
      "publication_date": 20190127
    },
    {
      "title": "Worked great for 5 months",
      "text": "Six months into owning this laptop, I am having various issues. the left cursor sticks, so it's hard to write a sentence with the physical keyboard (the cursor automatically moves into the middle of previous words or sentences even as I type), so I work around by using the on-screen tablet keyboard. (It also does this during video playback, so the video starts going backwards... and not in any entertaining way.) The touchpad cursor frequently stops working, and I have to reboot to get it back. There are workarounds, but I find myself awfully frustrated for a machine that's only 6 months old.",
      "rating": 2.0,
      "verified": true,
      "author": "Amy Watson",
      "helpful_votes": 6,
      "publication_date": 20170616
    },
    {
      "title": "Great size and weight",
      "text": "I really like this little laptop for travel as it's light and small but big enough to work on. I've had it for 3 years and all of a sudden some of the keys don't work. Took the stuck ones out to clean underneath but it didn't help so ordered a new keyboard which will take 3 weeks to get here. The only way I can type is in tablet mode which is very slow! Will try a wireless external keyboard to get me through until the replacement arrives. I had a cheap little Acer before and never had a key issue so don't know if this is common with Dells or not.",
      "rating": 3.0,
      "verified": true,
      "author": "JWM",
      "helpful_votes": 0,
      "publication_date": 20190107
    },
    {
      "title": "Worked for five months before battery died",
      "text": "Worked for five months before battery died. It's a not that cheap laptop, but I expected it to last at least a year! I've ordered a replacement battery from Amazon. Search for GK5KY.",
      "rating": 1.0,
      "verified": true,
      "author": "C. Owenby",
      "helpful_votes": 7,
      "publication_date": 20160719
    },
    {
      "title": "Not what I had hoped for.",
      "text": "Slow. Cumbersome. Not what I thought I was buying. No way to upgrade the memory!?! Disappointed in not being able to add memory to increase the speed. This is a waste of money if you're trying to use it regularly.",
      "rating": 2.0,
      "verified": true,
      "author": "Bb",
      "helpful_votes": 3,
      "publication_date": 20160624
    },
    {
      "title": "Not too bad for an entry level laptop 2-1",
      "text": "This laptop had a bunch of weird issues when i first got it. Touch pad non functional - driver issue resolved Random black screen - open close to fix random close of applications - no fix until some Microsoft updates 3 weeks later. This laptop can get quite hot and is louder than i would like SSD would be best bet for noise reduction. Overall good for the money i paid $280.",
      "rating": 3.0,
      "verified": true,
      "author": "Andrew",
      "helpful_votes": 2,
      "publication_date": 20160125
    },
    {
      "title": "Not as your main device",
      "text": "Great features , but , it is pretty slow. Id recommend a solid state hard drive or buy a PC that comes with one.I mostly use my Chromebook and 3 tablets so , the speed of this PC isn't the problem that it could be.",
      "rating": 3.0,
      "verified": true,
      "author": "Xeromancer",
      "helpful_votes": 2,
      "publication_date": 20170809
    },
    {
      "title": "Slow, freezes a lot, very finicky, lots ...",
      "text": "Slow, freezes a lot, very finicky, lots of glitches (touchpad randomly activates in tablet mode, screen fails to rotate automatically, etc). FWIW, most of these appeared after about 4 weeks of mild use as a dev test target. Cygwin, no games, little internet usage.",
      "rating": 2.0,
      "verified": true,
      "author": "_M_v",
      "helpful_votes": 5,
      "publication_date": 20160427
    },
    {
      "title": "This is a very nice laptop but it will only connect to our 2",
      "text": "This is a very nice laptop but it will only connect to our 2.8 GHZ wireless connection and for some reason can' t see our 5.0 GHZ connection!! This is a bit unusual for a new up to date laptop.",
      "rating": 4.0,
      "verified": true,
      "author": "Bob Burnett",
      "helpful_votes": 5,
      "publication_date": 20160127
    },
    {
      "title": "It broke before the warranty ran out. However, ...",
      "text": "It broke before the warranty ran out. However, I called a week after the warranty was up and Dell refused to help me. Will never buy another Dell product again.",
      "rating": 1.0,
      "verified": true,
      "author": "Lisa Manzo",
      "helpful_votes": 2,
      "publication_date": 20170913
    },
    {
      "title": "We purchased this computer a little over a year ago ...",
      "text": "We purchased this computer a little over a year ago and we're having problems with the power. The computer will not charge and will only work when plugged in. So frustrating that this computer only lasted one year. I should have stuck with HP. We have two HP laptops that have lasted over 5 years.",
      "rating": 1.0,
      "verified": true,
      "author": "Shari Mac",
      "helpful_votes": 3,
      "publication_date": 20170913
    },
    {
      "title": "He likes playing his games on this TV and now ...",
      "text": "He likes playing his games on this TV and now they have an entire game room just for him and his friends to play. And we got him another one this year for his bedroom just for watching movies.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170104
    },
    {
      "title": "Sweet notebook.",
      "text": "Great computer. I bought this for my sister to replace a failed laptop. Her grandson loves to use it as a pad. SWEET NOTEBOOK.",
      "rating": 5.0,
      "verified": true,
      "author": "dayvcrocket",
      "helpful_votes": 0,
      "publication_date": 20160129
    },
    {
      "title": "Great little netbook.",
      "text": "Very easy to upgrade. I replaced the battery and hdd. Check it out in the links below. [...] [...] Also it is the heart and soul of my Car Automation System: [...]",
      "rating": 5.0,
      "verified": true,
      "author": "michael",
      "helpful_votes": 2,
      "publication_date": 20160131
    },
    {
      "title": "Well worth it!",
      "text": "Everything advertised was more than I expected. Highly recommend to students and people that work on the go.",
      "rating": 4.0,
      "verified": true,
      "author": "Sir Luis",
      "helpful_votes": 3,
      "publication_date": 20160915
    },
    {
      "title": "Pretty good computer",
      "text": "So far, this has been a pretty good computer. The touchpad doesn't work for a few seconds sometimes, maybe because the wireless Bluetooth mouse is plugged in and turned on. It's easy to use, lightweight, and capable of doing everything I need. Just a few glitches with the touchpad.",
      "rating": 4.0,
      "verified": true,
      "author": "Rob Schneider",
      "helpful_votes": 0,
      "publication_date": 20150912
    },
    {
      "title": "Received a non working laptop",
      "text": "Great looking laptop. Couldn't even get through the setup as the screen would go black or just think for over an hour. Returning.",
      "rating": 1.0,
      "verified": true,
      "author": "robandoof",
      "helpful_votes": 3,
      "publication_date": 20160507
    },
    {
      "title": "Average",
      "text": "Nice 2 in 1 but I have a problem with the mouse as it hangs most times. The keyboard also seizes. Apart from that am good with it",
      "rating": 3.0,
      "verified": true,
      "author": "Ifyco",
      "helpful_votes": 0,
      "publication_date": 20151203
    },
    {
      "title": "Good computer",
      "text": "Seems to be a nice computer. Not screaming fast but does what I need like financial software, word processing, email and internet. Price is good too.",
      "rating": 4.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20160525
    },
    {
      "title": "Solid little laptop/tablet - my daughter is taking it overseas ...",
      "text": "Solid little laptop/tablet - my daughter is taking it overseas this year will see how it holds up to teenage travel!",
      "rating": 5.0,
      "verified": true,
      "author": "SB",
      "helpful_votes": 0,
      "publication_date": 20160225
    },
    {
      "title": "And did I mention its fast!!!!!",
      "text": "Read all the reviews on this and have had no problems with anything. It's fast and being able to use it as a laptop or table is great!",
      "rating": 5.0,
      "verified": true,
      "author": "Maxiej",
      "helpful_votes": 0,
      "publication_date": 20160229
    },
    {
      "title": "This laptop is good for day to day basic usage",
      "text": "This laptop is good for day to day basic usage..I felt display is not that great..but for this price it is doing what supposed to do..I am satisfied with the purchase.",
      "rating": 3.0,
      "verified": true,
      "author": "Prabha",
      "helpful_votes": 0,
      "publication_date": 20150925
    },
    {
      "title": "Okay",
      "text": "The first one we ordered had to be sent back it kept freezing but we got a quick replacement. It's working fine and is very portable. It's fast and so far no other problems",
      "rating": 4.0,
      "verified": true,
      "author": "Angela",
      "helpful_votes": 0,
      "publication_date": 20150926
    },
    {
      "title": "Five Stars",
      "text": "I love my little computer, so easy to tote around and the touchscreen works really well.",
      "rating": 5.0,
      "verified": true,
      "author": "Shamama",
      "helpful_votes": 0,
      "publication_date": 20160601
    },
    {
      "title": "One Star",
      "text": "Eight keys did not work at all, and the touch pad was slow and imprecise.",
      "rating": 1.0,
      "verified": true,
      "author": "Elizabeth Wilson",
      "helpful_votes": 2,
      "publication_date": 20160523
    },
    {
      "title": "Four Stars",
      "text": "sometimes freaks out and switches to tablet mode when in desktop mode",
      "rating": 4.0,
      "verified": true,
      "author": "Aaronish",
      "helpful_votes": 0,
      "publication_date": 20160611
    },
    {
      "title": "I really love how lightweight this laptop is",
      "text": "I really love how lightweight this laptop is, as well as the visual quality. The one adjustment I'm struggling with is how sensitive the touchscreen is, and how frequently it switches between tablet and laptop mode. Overall, my picky husband is impressed by this little machine and I love it!",
      "rating": 4.0,
      "verified": true,
      "author": "Kate",
      "helpful_votes": 3,
      "publication_date": 20151015
    },
    {
      "title": "Only con is battery life",
      "text": "I bought a used one, so if holds the battery not so long. But overall laptop is pretty good!!!",
      "rating": 4.0,
      "verified": true,
      "author": "Tima Nagmetulla ",
      "helpful_votes": 0,
      "publication_date": 20180826
    },
    {
      "title": "Good, and well priced, computer",
      "text": "Good little laptop. Very fast and no problems with it so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Don M",
      "helpful_votes": 0,
      "publication_date": 20151201
    },
    {
      "title": "Sturdy",
      "text": "I've dropped it a lot. Still works to this date.",
      "rating": 5.0,
      "verified": true,
      "author": "Bryan Evert",
      "helpful_votes": 0,
      "publication_date": 20170109
    },
    {
      "title": "Small and handy, will great features.",
      "text": "Always liked Dell products, found good deal with Amazon and bought one. Packaging was good and arrived on time. -About the product: The processor is a decent one with required power for the daily applications like browsing, Office tools -word,excel, ppt. watching movies and listening to songs. Clarity and touch is as expected with Dell systems -Excellent. Flexibility is great but I doubt we may not use this feature(folding the screen to 180 degrees) over all this is good daily usage laptop. I would recommend better processor for gaming and video editing tools.",
      "rating": 5.0,
      "verified": true,
      "author": "Hemant",
      "helpful_votes": 0,
      "publication_date": 20151101
    },
    {
      "title": "Nice computer.",
      "text": "I have this for a little while now and I really like it. I don't usually buy Dell as I find them over priced but on Amazon it seemed like a good deal. But don't you know a day or so later it was running with a $50 off incentive. Always happens. :) I likely won't use it for anything very powerful (as in programs) but so far it is great at cruising the Internet and MS Office document writing, editing, etc. Windows 10 is easy to use and generally I like it as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Notman",
      "helpful_votes": 0,
      "publication_date": 20151017
    },
    {
      "title": "Good casual laptop",
      "text": "Really good laptop for casual web browsing, email, Facebook, and streaming, not the greatest for game play, the computer will get pretty hot and the fan will get loud, but that's not what I got it for. Overall great buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Kyle S.",
      "helpful_votes": 4,
      "publication_date": 20151126
    },
    {
      "title": "Good budget 2 in 1",
      "text": "The computer is pretty good for the money. Processor will handle most basic tasks but if too much is running at once it will lag. I do like the fact that you can rotate 360deg to tablet mode but find myself mostly using it as a laptop simply for email and web browsing. When the screen text is adjusted larger it will mess up the format of the windows and make some items go outside the screen border unable to click them. Overall I would say this is worth the money to buy and use a year or two then get the next faster model when it comes out.",
      "rating": 3.0,
      "verified": true,
      "author": "Anthony",
      "helpful_votes": 0,
      "publication_date": 20160218
    },
    {
      "title": "Great Deal on Amazon compare to other online prices",
      "text": "This has to be the best laptop in this price, very convenient to use and carry. Although amazon took 10 days for shipment but the laptop is worth waiting.",
      "rating": 4.0,
      "verified": true,
      "author": "Salman",
      "helpful_votes": 0,
      "publication_date": 20160207
    },
    {
      "title": "Three Stars",
      "text": "Should have bought a larger screen. Too small to read",
      "rating": 3.0,
      "verified": true,
      "author": "paul russo",
      "helpful_votes": 0,
      "publication_date": 20160714
    },
    {
      "title": "Good Computer - Great for Schoolwork",
      "text": "I bought this for my wife, who was returning to school and wanted a new laptop that was very portable. She enjoys it - and has no complaints at all. It comes with Windows 10, so that took a bit of learning, but it's not too bad. I only gave it 4 stars because it isn't the most beefed up computer, so it works fine for what she needs it to do, but if you're looking for something a little more than just typing papers and surfing the internet, you may not be as satisfied with this product - but for the price, you can't beat it!",
      "rating": 4.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20161008
    },
    {
      "title": "Good Performance and Easy Driver Updates",
      "text": "I'm accustomed to a fast computer so this seems slowish, but the performance is really good for the specs. Dell has also made it very easy to check if your drivers are up to date using their webpage so that is really convenient. You don't have to download and install every driver, only the ones that you need, and you don't have to wonder if all the drivers are installed.",
      "rating": 4.0,
      "verified": true,
      "author": "Ryan",
      "helpful_votes": 4,
      "publication_date": 20151109
    },
    {
      "title": "Nice tablet with keyboard",
      "text": "Nice tablet with keyboard. I've experienced several glitches when switching between tablet and keyboard mode. System-wise, it is very basic. I use it for email, websurfing, storing/uploading pictures, and reading. There are not a lot of options to customize. It uses Windows Live and you must download apps, like other tablets. Sound/video suited me fine... Takes a while to start-up sometimes... If youre not a slave to the computer, and just need some basic technology, this will work. (lol)",
      "rating": 3.0,
      "verified": true,
      "author": "d0ubl3ra1nb0w",
      "helpful_votes": 0,
      "publication_date": 20161008
    },
    {
      "title": "Four Stars",
      "text": "The S key came off after a few months of use i had to use a glue",
      "rating": 4.0,
      "verified": true,
      "author": "jeremy",
      "helpful_votes": 0,
      "publication_date": 20150922
    },
    {
      "title": "Great laptop",
      "text": "Great laptop, very useful and compact. I'm very happy with the cost.",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle",
      "helpful_votes": 0,
      "publication_date": 20151119
    },
    {
      "title": "Keyboard problems",
      "text": "I bought this laptop on December, today the keyboard stopped working. I don't know why, but I'm extremely disappointed!! I hoped it would last at least 2 years.",
      "rating": 1.0,
      "verified": true,
      "author": "jmaturana",
      "helpful_votes": 0,
      "publication_date": 20160814
    },
    {
      "title": "A good all-in-one system",
      "text": "A good all-in-one system. Great display. I like being able to adjust the screen at any angle. With Windows 10 it switches between tablet and laptop mode intuitively. The primary inconvenience for me is that the keyboard has no illumination, Also, some programs would be easier to use if there was a stylus with a narrow tip that would work with this screen. Have looked but have not located one for under $50 that might work.",
      "rating": 3.0,
      "verified": true,
      "author": "Dan S. ",
      "helpful_votes": 2,
      "publication_date": 20160313
    },
    {
      "title": "Great laptop computer",
      "text": "This is the ideal laptop 4 me. Im enjoying it every second",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160518
    },
    {
      "title": "is a good computer, has everything I need",
      "text": "is a good computer, has everything I need, which is pretty basic. Is very light, the battery life is good, and I love how it looks. Then only thing is the sound, no matter how much I adjust the microphone, people always seems to get a low volume from my side when using skype or any video call, and sometimes the volume fluctuates unexpectedly when listening to music or watching a movie.",
      "rating": 4.0,
      "verified": true,
      "author": "Mabel",
      "helpful_votes": 3,
      "publication_date": 20151120
    },
    {
      "title": "This laptop is a complete piece of crap - feels cheap",
      "text": "If I could leave zero stars I would. This laptop is a complete piece of crap - feels cheap. Has been in disrepair more than it has not, from the first month since we gave it to my daughter for Christmas. It stopped charging - had to send it back for a replacement. Then the keyboard started to fall apart - letters literally started falling off. Had to send it back again. Now...guess what? The charging port is broken, computer won't take a charge, and needs to be replaced. STAY AWAY FROM THIS COMPUTER. EVEN THE NEWER MODEL.",
      "rating": 1.0,
      "verified": true,
      "author": "Lisa",
      "helpful_votes": 2,
      "publication_date": 20170503
    },
    {
      "title": "By far the best laptop for the price",
      "text": "By far the best laptop for the price. It takes a little bit to get used to, especially since i have previously only used macs. It is very fast, customizable, reliable, and well built. UPDATE Now that I have been using this for a few weeks, I have absolutely fallen in love with this computer. It is very quick starting up and the tablet feature is incredibly useful. I am a full-time college student and I would recommend this laptop to any college student who is serious about functionality and productivity.",
      "rating": 5.0,
      "verified": true,
      "author": "Bill M.",
      "helpful_votes": 3,
      "publication_date": 20151103
    },
    {
      "title": "About two weeks after I received the laptop the speakers ...",
      "text": "About two weeks after I received the laptop the speakers began to fade out and have problems, as the laptop gets older it is begginning to have more speaker issues. Also the screen is beginning to freeze more and the touch pad is unresponsive some days, imagine having to write a paper using only touchscreen. It is usable but has its problems. The company has not responded to me yet and it has been two weeks since I filed my complaint.",
      "rating": 2.0,
      "verified": true,
      "author": "Nikki637",
      "helpful_votes": 0,
      "publication_date": 20160427
    },
    {
      "title": "Light and easy to use",
      "text": "Light and easy to use . Love that it can be used as a laptop and a tablet. Windows 10 is taking some time to learn but it's help icon is very user friendly . Only thing I don't love is every time you restart the computer the narrator turns itself back on and you have to go though settings to turn it off . They should make it the other way around and it should stay turned off until you choose to turn it on again.",
      "rating": 4.0,
      "verified": true,
      "author": "KSP",
      "helpful_votes": 0,
      "publication_date": 20160221
    },
    {
      "title": "... this laptop for doing schoolwork and it's been working great for the last year",
      "text": "I got this laptop for doing schoolwork and it's been working great for the last year. I carry it around with me, take it to work to do homework on my lunch breaks, and haven't had any issues with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica S.",
      "helpful_votes": 2,
      "publication_date": 20161213
    },
    {
      "title": "Also has nice screen resolution",
      "text": "It's an okay product. It's light, slim and portable. Also has nice screen resolution. Speakers are a little shaky but gives nice sound. I've had difficulty connecting to wifi, I always have to restart before it connects coz it keeps giving a limited connection. Also it kept crashing on instalation of other anti virus programs apart from the one that came with it.",
      "rating": 3.0,
      "verified": true,
      "author": "Nimi B.",
      "helpful_votes": 2,
      "publication_date": 20161205
    },
    {
      "title": "Needs more RAM or fewer background processes",
      "text": "It's a cute little laptop, but it skips south so many processes that run on the background! When it arrived, the background stuff literally used 100% of the RAM, and made out pretty much useless. I had to go through and delete a lot of stuff, and still had issues with RAM. I am still trying to figure it out.",
      "rating": 3.0,
      "verified": true,
      "author": "Marietta",
      "helpful_votes": 0,
      "publication_date": 20161223
    },
    {
      "title": "I am so frustrated right now. I brought this ...",
      "text": "I am so frustrated right now. I brought this laptop and all this keys / taps do not work. Iam returning this. Excuse thmis grammar, misspelling and pucuation m The computer wont let me backspace, I have to hit space really hard to try to get a space. aRROws not working, I want my moneybackNOW! Hardtocorrect, etc.",
      "rating": 1.0,
      "verified": true,
      "author": "AW",
      "helpful_votes": 4,
      "publication_date": 20160129
    },
    {
      "title": "nice size - good value",
      "text": "opened my new office...and this is my computer. Coupled with a 24\" monitor...it's all the computer I need and at a great price. I don't like windows 10 very much at all...but I'm working with that.",
      "rating": 5.0,
      "verified": true,
      "author": "solocanoe",
      "helpful_votes": 0,
      "publication_date": 20160418
    },
    {
      "title": "Great 2 n 1",
      "text": "I love this computer especially in tablet mode. I thought windows 10 would be hard to get use to but it was a breeze. The only little quirk is the mouse pad is slick or It just takes some getting use too also.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Branum",
      "helpful_votes": 0,
      "publication_date": 20160214
    },
    {
      "title": "Miserably slow.",
      "text": "I bought it for very simple usage... to use word documents and spreadsheets for personal finances, etc, on a PC rather than an ipad, when I didn't want to use my work laptop. Takes minutes to start up, and even when I am just using the browser to check e-mail, I hear the hard-drive thinking in the background. Lastly, they REALLY want you to buy macafee virus protection. Full screen pop-ups every time you use it.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20160204
    },
    {
      "title": "What made this worse is that the Dell support-line and problem resolution process ...",
      "text": "Several problems - hard-drive, power port, sound (speakers stopped working), slow, etc. What made this worse is that the Dell support-line and problem resolution process seemed to be in place to deny responsibility, instead of retaining customers. Last Dell I will ever buy !!",
      "rating": 1.0,
      "verified": true,
      "author": "MikeLH",
      "helpful_votes": 0,
      "publication_date": 20170723
    },
    {
      "title": "It would not be a good choice for gaming",
      "text": "Bought this for my wife.Overall works really well. It would not be a good choice for gaming, but it works great for general use. We really like the fact that it can be used as a laptop or tablet. The keyboard is a bit snug for my hands, so I hope to find something similar but larger in the near future.",
      "rating": 5.0,
      "verified": true,
      "author": "Caleb",
      "helpful_votes": 0,
      "publication_date": 20160818
    },
    {
      "title": "Less than a month before needing repair.  Disappointing.",
      "text": "After a software update, it would not boot up. I ha the computer less than a month and did not use it everyday. I had to send it to Dell for repair after an hour long phone call with Dell. When it was working it was slow.",
      "rating": 1.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20160319
    },
    {
      "title": "AWESOME BUY!",
      "text": "I've had this laptop a few months now and I honestly love it so much. I'm a graphic designer and have the Adobe creative cloud software installed and it runs just fine with 4 apps installed. I lov how easy it is to take with you anywhere as well. Also runs great with playing videos and Netflix.",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley",
      "helpful_votes": 3,
      "publication_date": 20160326
    },
    {
      "title": "Dont buy a 2 in 1 laptop",
      "text": "This laptop is horrible. Every time I power it on I have to restart the computer because the WiFi wont conect. It says 4Gbs of Ram but literally feels like it has 1Gb. Its insanely slow. The touch pad will randomly just stop working while in use. it would be a fine deal for $200 but $400 is a rip off. Im selling this and buying a regular laptop",
      "rating": 2.0,
      "verified": true,
      "author": "Justin",
      "helpful_votes": 0,
      "publication_date": 20150926
    },
    {
      "title": "Nice Laptop",
      "text": "I like the computer, however very displeased with Dell and delivery service. I got this is as a gift. Supposedly \"new\", there are cracks on the edges. Either wise it started up fine and seem like a sturdy computer.",
      "rating": 3.0,
      "verified": true,
      "author": "Hale Hernandez",
      "helpful_votes": 0,
      "publication_date": 20160602
    },
    {
      "title": "It's a nice looking laptop",
      "text": "If it had worked properly when I got it, I would've given it four stars. The keyboard and touchpad turned on and off intermittently for some reason. It seemed to be often confused whether it was in tablet or laptop mode. It's a nice looking laptop, and worked pretty well besides the quirks. I would get another one to replace it. I like that it is a 2-in-1 but still upgradable to 8gb ram and SSD.",
      "rating": 3.0,
      "verified": true,
      "author": "Christopher Yoakum",
      "helpful_votes": 0,
      "publication_date": 20151114
    },
    {
      "title": "Compact and Light",
      "text": "I've had this laptop for at least 5 years now and it's still going strong. Love the slim design and light enough to carry around.",
      "rating": 5.0,
      "verified": true,
      "author": "Sunshine",
      "helpful_votes": 0,
      "publication_date": 20170807
    },
    {
      "title": "Run Forrest Run!",
      "text": "I tried to like this POC. The touchpad is horrible. I NEVER right reviews but I'm blown away at what horrible job Dell did with this product. I'm an IT professional and have used Dell business line PCs, Laptops, and servers for years. This should be an embarrassment. Hopefully I can unload this cr*p on eBay.",
      "rating": 1.0,
      "verified": true,
      "author": "Dennis H Peterson",
      "helpful_votes": 0,
      "publication_date": 20160919
    },
    {
      "title": "So far so good..",
      "text": "So far so good...just got this 4 days ago and haven't used it a great deal but seems sturdy and fast...everything I expected",
      "rating": 5.0,
      "verified": true,
      "author": "Alice",
      "helpful_votes": 0,
      "publication_date": 20160106
    },
    {
      "title": "Worst laptop I have ever owned",
      "text": "Worst laptop I have ever owned. It has been slow from day one -- slow to startup and slow to open programs. The battery gets so hot you can't have it in your lap. Next time I will look at other options besides Dell. They just don't seem to make a good home laptop.",
      "rating": 1.0,
      "verified": true,
      "author": "Kathi Halvorson",
      "helpful_votes": 0,
      "publication_date": 20160914
    },
    {
      "title": "What a great gift...love it...",
      "text": "this is such a great gift..so nice and easy to use. I like the different modes and the touchscreen.",
      "rating": 5.0,
      "verified": true,
      "author": "Joan M.",
      "helpful_votes": 0,
      "publication_date": 20151229
    },
    {
      "title": "DON'T BUY!",
      "text": "Had computer for less then a month. I take care of my stuff but this computer after less then 30 days just stopped working. Cannot get the screen to come on and downloaded some Drone videos of my family and our trip we had 2 weeks ago from Hawaii. Now afraid videos are lost unless I pay $150 to Best Buy to extract. I do not recommend this computer.",
      "rating": 1.0,
      "verified": true,
      "author": "Erndog",
      "helpful_votes": 0,
      "publication_date": 20170331
    },
    {
      "title": "Looks nice",
      "text": "Arrived a day early which was good. Some keys don't work all the time and require several taps to work. Looks nice though and...yeah that...",
      "rating": 2.0,
      "verified": true,
      "author": "Donsolo",
      "helpful_votes": 0,
      "publication_date": 20151201
    },
    {
      "title": "Will not boot up - get black screen of death",
      "text": "Just tried to boot up computer for the first time - ended up with a black screen where only the cursor can move. Called Dell support - they were worthless, after 30 min and three transfers, gave up and looking for other options",
      "rating": 1.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 2,
      "publication_date": 20160514
    },
    {
      "title": "Five Stars",
      "text": "Great laptop, kind of small but its perfect for travel.",
      "rating": 5.0,
      "verified": true,
      "author": "justin",
      "helpful_votes": 0,
      "publication_date": 20151206
    },
    {
      "title": "By no means high quality!",
      "text": "Screen is a lot smaller than expected due to black border. Keyboard has too much play in it. By the feel of the plastic casing I would not expect it to be very durable. I bought this computer because a lot of websites rated it one the best for under $500. I guess at the end of the day you get what you pay for.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160412
    },
    {
      "title": "A good 2 in 1 laptop that runs smoothly on Windows",
      "text": "Does exactly as said. A good 2 in 1 laptop that runs smoothly on Windows 10",
      "rating": 5.0,
      "verified": true,
      "author": "Rich",
      "helpful_votes": 0,
      "publication_date": 20151206
    },
    {
      "title": "Faulty Device, will stop working after a month.",
      "text": "this POS device was just purchased less than 2 months ago. The keyboard stopped working randomly. I hate windows soo much. Dont be fooled by the \"cool touch screen\" and or sleek design. This product is certified Grade A trash. Shame on Amazon for selling these defective faulty devices",
      "rating": 1.0,
      "verified": true,
      "author": "Looking For Trustworthy Seller",
      "helpful_votes": 0,
      "publication_date": 20160601
    },
    {
      "title": "The WiFi keeps turning off and will only work once ...",
      "text": "The WiFi keeps turning off and will only work once you restart the whole laptop. Very slow to turn on and slow processing. Not worth the money, frustrated that we are now stuck with this.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160217
    },
    {
      "title": "very happy!",
      "text": "I needed a new laptop for school so shopped around and found this to be the best deal for me. I was worried about windows 10 because I tried windows 8 once and it was impossible to use. Luckily my gamble paid off! 10 is great and very familiar, feels like a cross between Vista and XP.it runs well and the laptop is perfect sized. Not too small but great size for travel. its very light and seems to have fair battery life. very happy with this purchase and I actually like this pc over my $1500 MacBook pro!",
      "rating": 5.0,
      "verified": true,
      "author": "c",
      "helpful_votes": 75,
      "publication_date": 20150812
    },
    {
      "title": "It is NOT true",
      "text": "It is described as \"Intel Pentium N3540\" processor but I receive \"Intel Celeron N2840\" one. I stay in US only 3 weeks so I do not have time to return and refund. Disappointed!",
      "rating": 1.0,
      "verified": true,
      "author": "Tran N.",
      "helpful_votes": 0,
      "publication_date": 20160727
    },
    {
      "title": "Nice look, it's working perfect for my needs",
      "text": "Nice look, it's working perfect for my needs, really bright screen, easy to set up, little bit overheating while charging. But I think it's a good (and cheap ) option for travelers .",
      "rating": 4.0,
      "verified": true,
      "author": "davide daffre",
      "helpful_votes": 0,
      "publication_date": 20160423
    },
    {
      "title": "Very bad. Sold without testing",
      "text": "I opened and found it to be broken. Very bad. Sold without testing.",
      "rating": 1.0,
      "verified": true,
      "author": "nj",
      "helpful_votes": 2,
      "publication_date": 20160209
    },
    {
      "title": "I should know better..",
      "text": "I should know better...you get what you pay for. Pretty gutless if more than one application is running at a time. When McAfee is doing a scan, it's almost impossible to do anything on the internet, especially on pages with alot of auto loading videos/audio.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20151102
    },
    {
      "title": "don't buy it",
      "text": "i am not suggest this model it is too worst mainly the battery dry quickly and over heated with in a minutes finally it have no strength to receive wifi signals very poor one",
      "rating": 1.0,
      "verified": true,
      "author": "kolla balaji",
      "helpful_votes": 0,
      "publication_date": 20150917
    },
    {
      "title": "Don't get this either Dell sucks or Amazon sent me a broken laptop",
      "text": "Looked amazing when I opened it and then as I started and set it up the wifi didn't work!! Wouldn't connect unless your 5 feet away from the router... Soo disappointed have to get a replacement or a refund now called Dell for 2 hours and all they could say was return it to Amazon or send it to us for 2 weeks",
      "rating": 1.0,
      "verified": true,
      "author": "sami khalid",
      "helpful_votes": 6,
      "publication_date": 20150829
    },
    {
      "title": "It is a total waste of money and time",
      "text": "Don't buy it. The hinge broke within 6 month and the physical damage is not covered even it is the quality issue. And they asked me to ship them the laptop only to deny the warranty. If all physical damage is not coveres why even asked me to ship the laptop? It is a total waste of money and time.",
      "rating": 1.0,
      "verified": true,
      "author": "Ming Ye",
      "helpful_votes": 13,
      "publication_date": 20160611
    },
    {
      "title": "Overall its a nice device kind of meet my",
      "text": "Touchpad is very loose making that kind of noise every time I touch it . Overall its a nice device kind of meet my expectation",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160207
    },
    {
      "title": "Alright so far except it is not set up for ...",
      "text": "Alright so far except it is not set up for 5G wireless. Even my very old computers and tablets are. I was also a little upset when the price WAS LOWERED $50 dollars the day after I ordered mine.",
      "rating": 3.0,
      "verified": true,
      "author": "Patricia C. Curley",
      "helpful_votes": 6,
      "publication_date": 20150812
    },
    {
      "title": "iT WAS USED",
      "text": "I didn't order a used Dell laptop but I got a used one. The users guide was in a foreign language so I couldn't read it. Someone else picture and password was keeping it locked. Why would you try to pass this off as a new Dell???????? Why would you waste my time trying to start the laptop when someone else kept it locked?????????? Marion Iori",
      "rating": 1.0,
      "verified": true,
      "author": "Marion Iori",
      "helpful_votes": 13,
      "publication_date": 20150825
    }
  ],
  "product_meta": {
    "title": "Dell Inspiron 11 3000 Series 2-in-1 11.6 Inch Laptop (Intel Pentium N3540, 4 GB RAM, 500 GB HDD, Silver) Integrated Intel HD Graphics",
    "description": "The performance of a laptop and the convenience of a tablet in one device.\n\nAMAZON.COM",
    "rating": 3.5,
    "feature_bullets": [
      "Intel Pentium N3540 2.16 GHz Processor",
      "4 GB DDR3L SDRAM; Integrated Intel HD Graphics",
      "500 GB HDD Storage; No Optical Drive",
      "11.6 Inch WXGA (1366x768) LED-lit Screen",
      "Windows 10 Operating System; Silver Chassis"
    ],
    "specifications": {
      "Standing screen display size": "11.6 Inches",
      "Max Screen Resolution": "1366 x 768 Pixels",
      "Memory Speed": "1600 MHz",
      "Graphics Coprocessor": "Intel HD Graphics",
      "Chipset Brand": "Intel",
      "Card Description": "Integrated",
      "Wireless Type": "802.11bgn",
      "Number of USB 2.0 Ports": "2",
      "Number of USB 3.0 Ports": "1",
      "Brand": "Dell",
      "Series": "Inspiron 11 3000 Series 2-in-1",
      "Item model number": "i3147-10000sLV",
      "Hardware Platform": "PC",
      "Operating System": "Windows 10",
      "Item Weight": "3.07 pounds",
      "Product Dimensions": "7.9 x 11.81 x 0.76 inches",
      "Item Dimensions  LxWxH": "7.9 x 11.81 x 0.76 inches",
      "Color": "Moonlight Silver",
      "Processor Brand": "Intel",
      "Processor Count": "4",
      "Computer Memory Type": "DDR3 SDRAM",
      "Flash Memory Size": "500 GB",
      "Hard Drive Interface": "Ultra-Wide SCSI",
      "Hard Drive Rotational Speed": "5400 RPM",
      "Voltage": "11.4 Volts",
      "Batteries": "1 Lithium Metal batteries required.",
      "ASIN": "B010DODAWM",
      "Customer Reviews": "3.5 out of 5 stars202 ratings3.5 out of 5 stars",
      "Best Sellers Rank": "#40,019 in Computers & Accessories",
      "Date First Available": "July 29, 2015"
    },
    "categories": [
      "Computers & Accessories",
      "2 in 1 Laptops",
      "Laptops",
      "Electronics",
      "Computers & Tablets"
    ],
    "price": ""
  }
}