{
  "website_summaries": [
    {
      "verdict": "A fast paced, tension-filled card game with cute and quirky illustrations.",
      "pros": [
        "Can be played with two to five players and is easy to learn",
        "Once everyone knows the rules, play goes quickly",
        "A nice mix of strategy and luck in tandem with adorable card illustrations",
        "For adults, there's also a NSFW version available"
      ],
      "cons": [
        "The cards wear out quickly"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Vulgar, Not Family Friendly In My Opinion",
      "text": "If you call cards like, \"See the future, Crawl Inside a Goat Butt and See Many Wondrous Things,\" with a picture of someone's head looking out a goat's anus\" family friendly, then you might be happy with this game. I am returning, it, because I consider this false advertising. There is nothing sexually offense here, but a number of vulgar cards, the one cited being the worst.",
      "rating": 1.0,
      "verified": true,
      "author": "Edward J. Vasicek",
      "helpful_votes": 734,
      "publication_date": 20181218
    },
    {
      "title": "Incompatible with newer expansions, different card backs, and now loot bags...",
      "text": "They keep releasing new cards with different card backs. Most recently they've released blind bags that include a cheap plastic molded toy and a card that's intended to be used with this game, but the back is different so you can't use it without putting every single card into card sleeves. They keep doing this too, I think there are at least 3 different card backs currently... There's absolutely no reason for this other than a money grabbing scheme. This game had potential but they've ruined it completely with greed.",
      "rating": 1.0,
      "verified": true,
      "author": "Joe Bartlett",
      "helpful_votes": 278,
      "publication_date": 20180126
    },
    {
      "title": "Way overpriced. Shopper beware, this isn't much of a game.",
      "text": "It's ok from the fun point of view but in no way is worth 20 dollars. This is about a 5.99 product ridiculously overpriced. It's not even well made enough to stand the test of time much less a good party. Kickstarter must mean \"too overcharge\". We will not be purchasing any add-ons, they got us once and that will be enough.",
      "rating": 1.0,
      "verified": true,
      "author": "JMS",
      "helpful_votes": 62,
      "publication_date": 20180909
    },
    {
      "title": "One Star",
      "text": "Very repetitive game with boring rules. No strategy/thinking required whatsoever.",
      "rating": 1.0,
      "verified": true,
      "author": "Jason Z.",
      "helpful_votes": 50,
      "publication_date": 20180702
    },
    {
      "title": "oh oh! another color...",
      "text": "These cards are hilarious! we enjoy them a lot!! but the expansion pack has a different kind of red... so while you are playing you can notice who has new or old cards... which kind of kills a game... are you replacing them? thanks!",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 69,
      "publication_date": 20170509
    },
    {
      "title": "Meh.  Not that fun.",
      "text": "The cards were weird funny as expected, but the game was lacking. Quick moving, but not that exciting.",
      "rating": 1.0,
      "verified": true,
      "author": "Raina",
      "helpful_votes": 39,
      "publication_date": 20180109
    },
    {
      "title": "Don't get the rave reviews",
      "text": "Halfway through this game everyone was wondering why I wasted my money. We were so confused and couldn't wait for it to be over. We thought it made no sense to keep putting the exploding kittens back in the pile. At the end, the only cards left were exploding kittens. Very juvenile game. Save your money.",
      "rating": 1.0,
      "verified": true,
      "author": "Stacey K.",
      "helpful_votes": 26,
      "publication_date": 20181218
    },
    {
      "title": "Exploding Kittens team does it again.",
      "text": "I boughtas a Kickstarter backer and was thrilled with it. Then I boughtand was thrilled with it, and now I've bought Streaking Kittens and again I'm thrilled with it. There are several completely new cards which I won't spoil, but they are really game changing! and there are also some enhanced versions of old cards like see the future 5x instead of 3x which is nice to get something new rather than just more of a duplicate which wouldn't feel like it's adding anything. The art is still very amusing. Overall I highly recommend the expansion to anyone with the base game the new cards really change it up and will take your games to another level.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim Parker",
      "helpful_votes": 24,
      "publication_date": 20181008
    },
    {
      "title": "Don't get the hype...",
      "text": "We were not fans. I was excited to order this after so many great reviews. But we were confused what the point was to it. And once people got out by exploding, they quickly lost interest in sitting around. Would not buy again.",
      "rating": 1.0,
      "verified": true,
      "author": "jjrrks",
      "helpful_votes": 23,
      "publication_date": 20181128
    },
    {
      "title": "What is the point again?",
      "text": "What is the point again? This game is so boring we didn’t even finish it. Since there isn’t much to it, you find yourself working in circles and nothing interesting happens after you’ve read all the cards. I cannot understand all the positive reviews for this game.",
      "rating": 1.0,
      "verified": true,
      "author": "TB",
      "helpful_votes": 22,
      "publication_date": 20181202
    },
    {
      "title": "I'm excited but....",
      "text": "I was excited to get this game. I am however disappointed as I bought the streaking kittens expansion but cannot use it as they have different game backs. What do I do with it now. Its opened and I cannot use it! Don't buy expansions if you purchase this game. Sad I wanted to give it 5 stars!",
      "rating": 2.0,
      "verified": true,
      "author": "Tanya Payne",
      "helpful_votes": 20,
      "publication_date": 20181127
    },
    {
      "title": "Significantly improves the base game",
      "text": "I liked, but didn't love, Exploding Kittens. Especially true since I mostly play 2 or 3 player games, The Imploding Kitten from the first expansion helped, but this second expansion has completely transformed the game into a MUST PLAY for us. Being able to safely hold a kitten while also throwing another in the deck, it adds to the tension and fun so much. The added actions also offer much more variety and speed games up. Get this, seriously.",
      "rating": 5.0,
      "verified": true,
      "author": "Frank Provo",
      "helpful_votes": 20,
      "publication_date": 20181021
    },
    {
      "title": "Our family voted ‘No’ for this one",
      "text": "It takes quite awhile to get the hang of this game and while my husband and I have a long enough attention span - okay well I do anyway - our 9 and 5 (almost 6) year olds were not at all impressed. Even when we all understood the game and played a couple times, it just wasn’t fun. We’d much rather play uno or any other game really. No fans of exploding kittens in this house.",
      "rating": 1.0,
      "verified": true,
      "author": "CGK",
      "helpful_votes": 17,
      "publication_date": 20190307
    },
    {
      "title": "Great expansion, different color cards.",
      "text": "Great expansion, but the backs of the cards didn't match the backs of the original game. I contacted their customer support, who was awesome and sent me another deck of Imploding Kittens. The backs were closer in color, but were unfortunately still noticeably different (smooth vs. textured cards). I ended up sleeving the cards, and by taking out the insert, the sleeved core deck and expansion still fight in the original box. The expansion itself is great, and I highly recommend getting it if you're a fan of the base game. It adds some really fun cards.",
      "rating": 3.0,
      "verified": true,
      "author": "Jacob",
      "helpful_votes": 20,
      "publication_date": 20170821
    },
    {
      "title": "Fun gameplay, but overpriced and not durable",
      "text": "There have already been enough reviews about the gameplay itself, so I'll keep it brief - it's super fun (and quick!) and my 10 and 11 year old step-kids love it (as do the adults). Knocking my review down to 3 stars because: 1. The game consists of nothing more than a deck of cards. $20 is *way* overpriced. 2. After playing maybe 20 games, some of the cards are already starting to 'peel' at the corners - including one of our exploding kitten cards (knowing that a card is an exploding kitten more or less ruins the game).",
      "rating": 3.0,
      "verified": true,
      "author": "Penny M.",
      "helpful_votes": 19,
      "publication_date": 20170824
    },
    {
      "title": "Assumed it would be a party pack of the original but it is completely different",
      "text": "The backs of these cards are different than the original and do not work with the expansions. This is a set of its own cards from all the expansions and original so if your looking to get a \"bigger\" deck just buy two originals.",
      "rating": 1.0,
      "verified": true,
      "author": "cyu4322",
      "helpful_votes": 15,
      "publication_date": 20181212
    },
    {
      "title": "Expansion Pack Different Color Than Game Cards - Ruins Game.",
      "text": "Our family enjoyed the Exploding Kittens game, it's fun to play, but limited to 2-5 players. We bought the expansion kit to allow more players. Unfortunately, the expansion kit cards are a darker red than the exploding kitten cards (see photograph). This ruins the game because you can tell which cards to draw and which cards to avoid without seeing them. Thinking this was a fluke, we ordered a second card game and expansion pack, but the result was the same (see photo). The manufacturing quality assurance process is not good, hopefully the company will fix this problem. shortly. [ASIN:B01HSIIFQ2 Imploding Kittens: This is the First Expansion of Exploding Kittens]",
      "rating": 1.0,
      "verified": true,
      "author": "Ron",
      "helpful_votes": 12,
      "publication_date": 20180711
    },
    {
      "title": "This game is fun!",
      "text": "Pros: Easy to learn basic game play even for smaller kids; the cards are unique and funny; it is different in that you don't necessarily have to wait your turn to play (nope cards are fun!) Cons: You absolutely need to buy the 10 player party pack. I don't know why they even make the basic pack because it is not enough cards for even 4 players. Not sure which column this goes in: for the more competitive game player, the game does offer a good deal of strategy on how and when you play your cards. If you like hearts or spades this would fall in that category.",
      "rating": 5.0,
      "verified": true,
      "author": "NickE",
      "helpful_votes": 9,
      "publication_date": 20190228
    },
    {
      "title": "They fixed the card backs so they match!",
      "text": "Ok everyone I have some good news! I just received this party pack on 9/18/19 and they fixed the issue of the back of the cards. They now match all expansions! Also the imploding kittens expansion is NO LONGER in this deck! So here I what I did... I bought the party pack, imploding kittens expansion, streaking kittens expansion, AND the NSFW edition. ALL of the cards go together now and match perfectly! Make sure to order direct from amazon to ensure you are getting the new set. Attached is a photo of the back (which is different from one currently pictured as it no longer includes the expansion imploding kittens.)",
      "rating": 5.0,
      "verified": true,
      "author": "AmazonAddict702",
      "helpful_votes": 6,
      "publication_date": 20190918
    },
    {
      "title": "The box came with two sets of same dock as ...",
      "text": "The box came with two sets of same dock as opposed to two different docks. Many types of cards were missing and it contained more of some types than supposed. On the night I had people invited in - night before Christmas - we could not play this because it was not a complete set of game.",
      "rating": 1.0,
      "verified": true,
      "author": "Enoch Kwon",
      "helpful_votes": 16,
      "publication_date": 20171231
    },
    {
      "title": "Hysterical Fun",
      "text": "Great fun game. Can play with just 2 people. Goes fast so can easily play just a game or two with limited amount of time.",
      "rating": 5.0,
      "verified": true,
      "author": "Carri",
      "helpful_votes": 12,
      "publication_date": 20181106
    },
    {
      "title": "Rules were poorly thought out, so you NEED the \"first expansion pack\"",
      "text": "Game play with the default deck is REALLY boring -- you make pairs with cat cards but all that pairing does it let you steal a card (unseen and therefore random) from another player. There is no reversing the direction of play. There is a card to _see_ the future cards in the pickup deck, but no card to _arrange_ in the pickup deck. You will need to make some serious home rules, like a pair of taco cats lets you steal a card from another player OR, for example, reverse direction of play OR peek at another player's hand or part of their hand, etc. To a large degree, the \"first expansion pack\" solves many of these issues.",
      "rating": 1.0,
      "verified": true,
      "author": "Dewey",
      "helpful_votes": 5,
      "publication_date": 20190619
    },
    {
      "title": "So boring",
      "text": "Game summary: Shuffle decks. Deal cards. Draw cards. Shuffle cards. That's basically it. Super boring for adults and kids. Cards try to be funny but the message on the card has nothing to do with game play so most of the time no one reads the silly parts. Might be fun if you made it into a drinking game but as is... Nope.",
      "rating": 1.0,
      "verified": true,
      "author": "kaotik",
      "helpful_votes": 8,
      "publication_date": 20190121
    },
    {
      "title": "GOOD STUFF",
      "text": "Fun game to play, easy to teach. I am an International Student and I could teach all my friends from different countries easily because the rule is wild. I’d love to recommend this for a big party from 8-10 people",
      "rating": 5.0,
      "verified": true,
      "author": "Anh Duc",
      "helpful_votes": 11,
      "publication_date": 20181114
    },
    {
      "title": "Fun game on awful quality cards",
      "text": "The game itself is a ton of fun for adults and kids but for $20 it's a joke that the cards themselves are so cheaply made. After a few days of careful play involving adults the cards are toast",
      "rating": 1.0,
      "verified": true,
      "author": "Megan F Sullivan",
      "helpful_votes": 18,
      "publication_date": 20170804
    },
    {
      "title": "some nice freshening up for the original game",
      "text": "while the original nsfw version of the game was quick enough to pick up and play, it definitely gets a bit stale after a while, particularly after you've seen all the cards. while this isn't cheap by any means (seems like it's usually around the price of the base game itself), and it comes in a weirdly large package that is easily squished but fortunately did not arrive that way despite being in a box with multiple items, it's a breath of fresh air. still expensive for what you get when you think \"oh it's just some paper cards,\" but who hasn't heard of an alpha or beta black lotus going for a pretty penny, right?",
      "rating": 4.0,
      "verified": true,
      "author": "Paul D.",
      "helpful_votes": 2,
      "publication_date": 20200407
    },
    {
      "title": "Overpriced and you really need 2 decks for more than 4 players",
      "text": "We got this game based on the overwhelmingly positive reviews. After playing this a few times, this is definitely NOT worth the high price tag. It's a deck of cards. In addition, I wouldn't consider playing over 4 people. With 5, there are so few draw cards left that the game is over within minutes. That means, for parties you need to spend $40 on something that is essentially a rip off of Uno. If you want this to play with the kids, maybe give it a shot. For parties or large groups, I'd look elsewhere.",
      "rating": 2.0,
      "verified": true,
      "author": "Wo kommst du",
      "helpful_votes": 4,
      "publication_date": 20181209
    },
    {
      "title": "Super fun for 2-10 players of all ages!",
      "text": "This is great for small or larger groups. Kids and adults can play it together. Younger kids (7 and down) usually tram up with an adult so they can explain the cards to them and it works great. My husband and I can play it and have fun by ourselves. It’s a pretty fast game once you get the hang of it, and it is easy to learn. It usually takes one round and everyone is on board. People request it a lot on game nights and it’s really easy to take with us on trips or to parties where games are encouraged. And of course the artwork is hilarious and fun! :)",
      "rating": 5.0,
      "verified": true,
      "author": "S. LeeTop Contributor: Pets",
      "helpful_votes": 2,
      "publication_date": 20190607
    },
    {
      "title": "Waste of money and paper",
      "text": "These 5 star reviews have to be bought by this company. This is the worst game our family, friends and enemies have ever played. Boring, unexplainable, dumb. The concept is not clear. The explanation is totally useless. The poor use of the paper. Spend your money someplace else. The absolute worst idea was to buy this asinine game if you can call it that. Not for children. Never was. These cards should be bought back from the makers of this game. Ever see the dumb waste of film called the Family Fang. This is its sibling. Waste of time effort and resources. Makers should be ashamed they take people’s money for this slop.",
      "rating": 3.0,
      "verified": true,
      "author": "Consumer ",
      "helpful_votes": 0,
      "publication_date": 20191105
    },
    {
      "title": "Wish the Cards Were More Waterproof",
      "text": "I am a big fan of this artist, and the presentation of the game is fantastic. The box has a nice little surprise when you open it. The problem is, my friends and I played this for the first time at a party--while people were drinking various beverages. If anyone touched the cards with even slightly damp fingers they started to deteriorate. I wish the cards were coated more like old-school playing cards, but they're not. They are more like regular paper, which is not what I expected for $30. I think the problem is specifically the cut edges. As can be seen by the attached photo, the edges are fraying and whitish after just one round of the game.",
      "rating": 2.0,
      "verified": true,
      "author": "TravellinJack",
      "helpful_votes": 0,
      "publication_date": 20190908
    },
    {
      "title": "Meh",
      "text": "This game isn’t as fun as I imagined. Maybe I imagined too much, but there you have it. Once the novelty wears off, you have a card game that is just like most. Nothing new here.",
      "rating": 3.0,
      "verified": true,
      "author": "N. Bell",
      "helpful_votes": 9,
      "publication_date": 20171121
    },
    {
      "title": "The expansion set doesn't match the original! Huge mistake.",
      "text": "Unfortunately, there was a huge error made in the manufacturing of this expansion set. When I combined the new cards with the original Exploding Kittens set, I quickly realized the color and texture difference between the two sets of cards made playing the combined game a total dud. Even my young children quickly caught on to the fact that they could tell if other players had imploding cards in their hands. Total dud!! I wish I could request a refund, but because we don't play very often, the return eligibility on this product had expired before I realized the problem.",
      "rating": 1.0,
      "verified": true,
      "author": "Alisa Ringger",
      "helpful_votes": 4,
      "publication_date": 20181201
    },
    {
      "title": "Fun for all ages.  Strategy needed",
      "text": "My extended family likes to play Euchre, but I struggled with memory issues. They bought this game to play with the kids, but we figured out it's fun for just us adults too! It's silly. It's different than any other game I've played. It works for all ages that can read, including my special needs family member. It takes strategy and luck. It comes with packs specific to different sized groups, so fun no matter how many play. Cons: the print is tiny. Some of us old folk (45+ lol) have to wear our reading glasses. I've heard the \"imploding kitten\" card is fun in the expansion deck you can buy separately, so I'm highly considering getting that also.",
      "rating": 5.0,
      "verified": true,
      "author": "L8rGatorTop Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "OK game that you'll play a couple times and never again",
      "text": "Pros: - It's easily to play. - Games are quick and don't take much time to setup and get started. Cons: - It's a game that will entertain you once or twice, but there's not much keeping you coming back.",
      "rating": 3.0,
      "verified": true,
      "author": "Thomas & Jessii",
      "helpful_votes": 3,
      "publication_date": 20200117
    },
    {
      "title": "Best Game of the Quarantine!",
      "text": "We played this game a couple of years ago with my cousin and my daughter liked it so much she bought one for her brother for his birthday back in May! Since we were under quarantine it quickly became our go-to game! And five months later we are still playing it 2-3 times a week! Now, it is our go-to high school graduation gift! Everyone seems to love it and is now playing it with their families. It is like a cross between go-fish and uno!",
      "rating": 5.0,
      "verified": true,
      "author": "Momof3",
      "helpful_votes": 0,
      "publication_date": 20200629
    },
    {
      "title": "A fun addition to Exploding Kittens...",
      "text": "As of this holiday season, we now have all the expansion packs available. Streaking and Imploding. These expansion packs are a fun addition once you have the knack of paying the game. Exploding kittens is easy to learn and fun to play. We really like the card games put out by this company and are getting more this holiday. Looking forward to playing Bears vs Babies and TRex. Ages in our family range from 40's to 12, but we've had exploding kittens for a couple of years now. Very playable for a broad age range.",
      "rating": 4.0,
      "verified": true,
      "author": "GIJane",
      "helpful_votes": 0,
      "publication_date": 20191214
    },
    {
      "title": "A great addition",
      "text": "This expansion adds just the right flavor to the kittens game. It can be used without the first expansion, imploding kittens, if needed. The addition of new action cards and the Streaking Kitten are excellent. We already had a situation where one of my kids was holding the streaking and an exploding kitten and the other placed taco cats to take a card...he of course pulled the exploder from his hand, luckily he could defuse it!",
      "rating": 5.0,
      "verified": true,
      "author": "Evan Baschnagel",
      "helpful_votes": 3,
      "publication_date": 20181017
    },
    {
      "title": "Adds to the fun and strategy",
      "text": "This 15 card expansion does an excellent job of adding to the fun of the game without breaking it. Also, with cards such as \"Streaking Kitten\" and \"Catomic Bomb\" new strategic opportunities are presented to the players. Having the additional strategy in the game allows the players to win based on their decisions more so than luck.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert",
      "helpful_votes": 5,
      "publication_date": 20181010
    },
    {
      "title": "Fantastic new card game",
      "text": "Very easy to learn and a pretty quick game! My youth group played this game on a retreat. There was a line of people waiting to join the game once it ended. Pros: - Fun! - Easy to learn (can watch one game and be ready to play in the next game). - 2 to 5 players can play at a time. - Good cardboard storage container. - Instructions were clear and the online video instructions are even better! Cons: - Hard to read some of the descriptions on the card due to their size. I would recommend this game to everyone who wants to have a fun new card game to play with friends and family!",
      "rating": 5.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 0,
      "publication_date": 20200302
    },
    {
      "title": "Just doesnt feel like a finished product",
      "text": "Wow. We love family game night. Super excited for this game. Its dumb. The instructions are stupidly long. Everyone has to read them prior to playing and there are loop holes where you will have to decide a rule as a family. We played 90% of a round. Kind of felt like we should of just played Uno. The type size on the cards is like insanely small which doesnt make since if you have to place faceup for people to read/see on discard pile. Really feels like creators put about 75/80% go (thought) into this and you are stuck coming up with the rest of the thought. The nope cards are fun. Thats about it.",
      "rating": 1.0,
      "verified": true,
      "author": "Avid Reader",
      "helpful_votes": 0,
      "publication_date": 20200324
    },
    {
      "title": "Quick paced game",
      "text": "My son and I love this game. He's 17. The cards are cute and funny, we like that each one is different. We learned the game pretty quickly. The cards state right on them how they're used. However, we took this game to family party and the older crowd (65+) struggled with the different cards and \"quirky\" nature of the game. The 12 year old did ok. We did a practice round where we helped each player lay their hand. If your family already plays more \"modern\" games they'll catch on fine (killer bunnies, ticket to Ride, Catan etc) This is a quick game! With just two players each game lasted about 20 minutes. Those exploding kittens get you fast.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Winter",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Takes a bit of time to get the strategy",
      "text": "I bought this card game for our competitive grandsons, 7 & 9. UNO is fun, but we needed more... They LOVE it. It took us a while to figure out that there really is a strategy, and we had to help the 7 year old read the cards. It is a fun and crazy game, we all enjoyed playing and we have ordered more card games in this series. The print is pretty small on the cards, so grandparents will need their reading glasses! Fun for the whole family.",
      "rating": 5.0,
      "verified": true,
      "author": "Pamela Van Cleave",
      "helpful_votes": 0,
      "publication_date": 20191221
    },
    {
      "title": "Very boring",
      "text": "Why do so many people rave about this game? It is slightly more exciting than Go Fish. The drawings on the cards are amusing but that is the most interesting thing about the game. I seriously don't get how it has all these good reviews. I feel like it is a version of The Emperor's New Clothes. Everyone is praising it and I am over here like but he's naked. Also, it's expensive for a flimsy deck of cards. If you want a fun game get Unstable Unicorns instead.",
      "rating": 1.0,
      "verified": true,
      "author": "Rebecca",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "Nice addition, but different colored cards",
      "text": "Cards are fine, add more fun to the game. But we bought the initial game and this expansion at the same time, and the colors of the backs of the cards do not match between the sets. Due to the fact that I bought and opened them at the same time I can confirm it's not from fading or use. This is important as a person can tell if the other players have hands made up of new or old cards quite easily if you care to look.",
      "rating": 3.0,
      "verified": true,
      "author": "McGuirk",
      "helpful_votes": 2,
      "publication_date": 20190319
    },
    {
      "title": "Fun for family gatherings",
      "text": "Simple to learn with unpredictable gameplay that keeps it fun and interesting. The larger the group the better for this game but we've played with only 4 people and it's still a lot of fun. Retail outlets seem to market this alongside \"cards against humanity\" but don't let that dissuade you from buying this game (nothing against CAH - I love it but it's not for everyone). This game is safe for children. Games are generally pretty quick so it's a great game for family gatherings where people may come and go between rounds.",
      "rating": 5.0,
      "verified": true,
      "author": "Roger G",
      "helpful_votes": 3,
      "publication_date": 20171125
    },
    {
      "title": "No ACTUAL Exploding Kittens (minus 1 star)",
      "text": "This game is fun and easy to learn and play. There is both strategy and luck in the game play. The cards are hilarious. It only takes 15 minutes to play so it's perfect if you have anyone in your group with a short attention span (like kids); however, you'll want to play it a few times when you do play so you can easily play it for hours. The only draw back is that there are some duplicate cards...it would be better if EVERY card has something different on it as reading the cards is some of the fun! GREAT GAME THOUGH.",
      "rating": 4.0,
      "verified": true,
      "author": "Smarler",
      "helpful_votes": 2,
      "publication_date": 20181226
    },
    {
      "title": "Fun Game, Quick to Learn",
      "text": "With shelter in place still in effect, our household has been busy trying to find things to do during our many MANY hours at home. Exploding Kittens is a fun quick game to learn and the kids enjoyed the silly meme-ish cards and silly attacks/NOPEs. The game takes about 15 minutes to play and our family was able to pick up the game quickly after going through the instructions. It has pretty good play over value and is compact enough to take on the go. If you’re looking for a quick card game to play with meme obsessed kids, this is fun game to consider.",
      "rating": 4.0,
      "verified": true,
      "author": "K. Chan",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "Great, family game that is hilarious!",
      "text": "This game is now one my family’s favorite card games! We bought it on a whim going into the COVID-19 pandemic, knowing we needed non-technology entertainment. This game definitely provided it. It is well packaged, easy to understand, and has a great instruction pamphlet. Each card has a hilarious illustration on it that keeps the game entertaining as you get new cards. However, the coolest feature is their instruction video. It definitely makes jumping in really easy. Get this game and all of its expansion packs! You will have hours of hilarious fun.",
      "rating": 5.0,
      "verified": true,
      "author": "Caleb Fritz",
      "helpful_votes": 0,
      "publication_date": 20200525
    },
    {
      "title": "Fun game, always a good time.",
      "text": "Although I've received different reviews from other players, for my money, this is about as good as it gets. The Imploding Kittens expansion is a MUST HAVE to really take this game to the next level. There is some strategy, but it usually takes a while for that to come into play, as the first part of the game feels more like a time waster to really get to the good stuff. Of course that time \"wasted\" is used to build up a solid hand. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "dj walker",
      "helpful_votes": 0,
      "publication_date": 20191205
    },
    {
      "title": "Great Expansion!",
      "text": "When we got the previous expansion (Imploding Kittens), it felt like the Exploding Kitten suddenly became irrelevant. Most games were won with implosion. This new expansion, Streaking Kittens, definitely levels up the game play. There's more strategy required, the Exploding Kitten matters again (and can even be held/hidden, which makes for an interesting game!), and the new cards offer unique interactions that can really take an opponent off-guard. We are loving this expansion, and along with Imploding Kittens, provides quite a diverse range of game plays.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Cade",
      "helpful_votes": 0,
      "publication_date": 20190108
    },
    {
      "title": "Surprisingly fun",
      "text": "Most of these games for kids seem to drag on, with too many rules and are just so beyond boring that I'd rather eat rocks. But this one is actually quick to learn, the rounds themselves are quick and always have a definitive winner. You can get sneaky if you want, you can randomize the exploder cards, there are options for a couple different types of play, as well. We've already played about 12 rounds since Christmas, and it's still fun. Each card has a funny little saying on it as well. 10yo & 13yo play it, there's nothing inappropriate on the cards for those ages. All in all, super pleased with the purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "TangoBravo",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Fun ADULT party game!  NOT KID APPROPRIATE!",
      "text": "Great ADULT game! Lots of fun. However, this is definitely NOT a game I would think most parents would want their children playing. We played it the other day in the lobby of a kid-themed escape room and my kids (7 and 9) were reading all of the blurbs on the cards. Most are DEFINITELY not kid appropriate. Especially when my very sweet 7 year old daughter calmly read, “I said nope, motherf$&ker”. After the initial shock, I think most of us adults were laughing so hard that we had tears, however, it’s taking some time to delete that phrase from her vocabulary now.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeffrey D",
      "helpful_votes": 3,
      "publication_date": 20190310
    },
    {
      "title": "Light-hearted game with it's own sense of humor, but not enough strategy.",
      "text": "It's funny and clever in its own way, at least the first couple times you play it. But it's lame for people who get kicked out of the game early-on and are forced to sit out the rest of the game and politely sit through the game's novel sense of humor. There is not much strategy involved, which, along with the novelty of the game, could make it a great warm-up / cool-down game or kids' game. But it's also too easy to protect other players (or target them), which leaves the game feeling a bit personal, especially, again, when you are kicked out of the game.",
      "rating": 3.0,
      "verified": true,
      "author": "Collin",
      "helpful_votes": 2,
      "publication_date": 20180404
    },
    {
      "title": "Aboslute entertainer for kids and adults alike",
      "text": "Wow... i have 2 girls 7 and 13 and got this game as they played it once at their friends home and were nagging me to buy it. It was bit expensive for a card game but the girls are throughly njoying it. Even me and my wife are now hooked onto this and this game is now on top of our board games during this covid lockdown situation when the kids are at home. The only reason for me docking a star is for the quality of the cards.... it could be slightly better/sturdy for the price being paid but it is worth for the hours of entertainment it provides.",
      "rating": 4.0,
      "verified": true,
      "author": "Sheik Sajith",
      "helpful_votes": 0,
      "publication_date": 20200724
    },
    {
      "title": "This expansion pack is a MUST",
      "text": "This expansion pack add so much to the Exploding Kittens game, that I seriously feel like it needs to be part of the original set. There are a few new card functions, and it is nice to add in playability for more players. But the real winner is the Cone of Shame. Anyone who asks “Whose turn is it?” has to wear the Cone of Shame. We feel that ALL games should include a Cone of Shame. My kids are ages 6 to 15 and ALL of them enjoy this game, but the 6 & 9 & 12 year olds enjoy it most for the butt & fart jokes. 🤷🏻‍♀️",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 2,
      "publication_date": 20180603
    },
    {
      "title": "Unique but not for everyone",
      "text": "I was intrigued to buy this as it was on an Amazon Deal. The reviews were good, and I was curious to see more. I ordered and it arrived promptly in new condition. We soon read the instructions and decided to play a few rounds. Honestly, the gameplay was lackluster and not anything that held our attention or compelled us to \"play again and again\". The title is catchy and may be the \"clickbait\" they hoped for in a game title. Overall, the game is average. We ended up gifting this to a friend, and no feedback from them on if they like it or not.",
      "rating": 4.0,
      "verified": true,
      "author": "Kory",
      "helpful_votes": 0,
      "publication_date": 20200122
    },
    {
      "title": "Great game",
      "text": "I could play the 5 player version of this game for days on days... I got the party pack to play with even more people but it feels almost like it's missing a few cards. When you start getting above 8 players, it feels like an exploding kitten comes up every other card right from the start. Still very fun just wish there were a few more non-exploding kitten cards. The party pack does have options for smaller games where certain cards are removed making the 3-7 player games feel just as balanced as the original 5 player version.",
      "rating": 4.0,
      "verified": true,
      "author": "Jacob Winden",
      "helpful_votes": 0,
      "publication_date": 20191001
    },
    {
      "title": "What are you waiting for?!",
      "text": "Have you played this game yet? If not, click order now! Fun, entertainment, thats easy to learn & play for most any age. Its kind of a ridiculous concept, to be totally honest, but its so easy to learn (hop on Youtube for the quick 3 min video) and you're off to the races. I've gifted twice now and both times were VERY well received. You can't go wrong with a simple, entertaining card game like this! Good for anywhere between 2 - 5 players, and can keep you going for hours or for just one game.",
      "rating": 5.0,
      "verified": true,
      "author": "Brandon Lord",
      "helpful_votes": 0,
      "publication_date": 20200605
    },
    {
      "title": "BORING",
      "text": "I have to say this is one of the most boring games i have ever played. I was so excited to get it because it had been hyped up so much and the concept of it sounded exciting and right up my nerd alley. we played the game for all of maybe two rounds before we got out cards against humanity and threw this in the trash. The only thing positive i have to say about it is the cards are cute. that's it. SOOOOOOO BORING even the younger kids got bored with it and thought it was just stupid",
      "rating": 1.0,
      "verified": true,
      "author": "RG3829",
      "helpful_votes": 0,
      "publication_date": 20201001
    },
    {
      "title": "Not very fun",
      "text": "Read a review about this game and it made me think of Sleeping Queens, which is an awesome card game that we played with our kids when they were 5-12 years old (and just rediscovered after Exploding Kittens - even though they are in high school - Sleeping Queens is still fun). So, Exploding Kittens came in time for the extended holiday at the beach and we were all looking forward to it - but it is not nearly as fun as the directions suggest. With four players, you finish before you ever get a chance to play any of the clever strategies described. After giving it 4-5 tries, we returned the game.",
      "rating": 2.0,
      "verified": true,
      "author": "N. Davenport",
      "helpful_votes": 6,
      "publication_date": 20160301
    },
    {
      "title": "Not the same color red as originals on card backs!!",
      "text": "We love this game and we were keen to get this expansion. We already had the imploding kittens add-on. The added rules are all fun and in the same vibe as the original game. Our biggest gripe is that the back of the cards are a lighter color red than the originals and therefore can be easily picked out when swapping/drawing cards. As they are all ‘good’ cards, it spoils the fun of the game.",
      "rating": 3.0,
      "verified": true,
      "author": "NikNak",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "Super Easy and Fun Game",
      "text": "I've been playing this with a 7 and 10-year-old. They think it's hilarious. The cards and actions are quite quirky, but it does take a little getting used to. I've found that, for right now, it's easier to have all the players lay their cards out in front of them- at least while the kids are still getting the hang of all the meanings. It also tends to carry on longer than attention spans, so we've been throwing in extra exploding kittens to make the game go faster. Other than that. it's been great. The kids like it so much they want the app.",
      "rating": 5.0,
      "verified": true,
      "author": "Jen S.",
      "helpful_votes": 0,
      "publication_date": 20181230
    },
    {
      "title": "Easy to learn & lots of laughs",
      "text": "We played with two adults and two kids (10 and 15) and we understood the game quickly. If you’re familiar with Exploding Kittens, you can be playing confidently with the new cards in a matter of minutes. I didn’t tell the kids that the Cone of Shame existed, meaning when the first of them earned it there was a lot of laughter. It was fun the first couple of games but then it got old. One potential downside is the cost, which does seem quite a lot for what is essentially just 20 cards. However, if you’re likely to play the game often as we do, then it’s worth the cost in the long term.",
      "rating": 5.0,
      "verified": true,
      "author": "Gary",
      "helpful_votes": 0,
      "publication_date": 20200709
    },
    {
      "title": "Greatly increases game time for four players.",
      "text": "We are big fans of Exploding Kittens. Before ever buying any expansions packs a typical game lasted 15-20 minutes. This Christmas we added both expansions pack. Game play is now 40-60 minutes. I love the game but it would be great if there was some card swapping suggestions to reduce game time while still getting to use new cards. Something like: For four players with both expansion packs that want a 15 minute game, remove one diffuse card, two see the futures, etc. Otherwise great expansion deck with some fun cards.",
      "rating": 5.0,
      "verified": true,
      "author": "JoeHatesCoffee",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Lots of giggles and laughter!",
      "text": "I had been interested in this game for some time, but as others stated, not crazy about the price point. Amazon had a sale so I decided to purchase and I'm so glad I did. The cards have cute pictures and silly phrases. The instruction seem complicated at first, but directions are written on each card if you forget what to do. Once you start playing it's easy to catch on. My 11yr old and I played several games upon arrival and many laughs and giggles ensued. The more people playing, the more fun it becomes. Such a fun game!",
      "rating": 5.0,
      "verified": true,
      "author": "Irishminx",
      "helpful_votes": 0,
      "publication_date": 20200328
    },
    {
      "title": "I don't know why games have such  horrible titles!",
      "text": "I returned this item because I was offended by the name of the game.",
      "rating": 1.0,
      "verified": true,
      "author": "greg g",
      "helpful_votes": 5,
      "publication_date": 20190828
    },
    {
      "title": "Best family game I have found.",
      "text": "I was skeptical at first of this game, but then some friends invited me to play and I was amazed at how fun it is. Normally, when I find games that my 7 year old can enjoy, they are not nearly as fun for us parents, but this is completely different. The rules were simple enough that my son picked it up after one game, it kept everyone's attention (each round is fairly short), and the game was full of laughter from everyone! I have played it with 3-5 players, and with every group size it has been a blast. This really is a must have for any family that likes playing games",
      "rating": 5.0,
      "verified": true,
      "author": "Seth D Kravetz",
      "helpful_votes": 2,
      "publication_date": 20180709
    },
    {
      "title": "Not fun",
      "text": "This game sucks. I played it once and now it's sitting in the Goodwill box",
      "rating": 1.0,
      "verified": true,
      "author": "Just some guy",
      "helpful_votes": 4,
      "publication_date": 20190811
    },
    {
      "title": "Meow this is what I am talking about!",
      "text": "I am a proud owner of Exploding Kittens: First Edition, NSFW Edition, the Imploding Kittens Expansion, and now the Streaking Kittens expansion. This has been a great expansion to the decks so far. The streaking kitten itself adds a wonderful dynamic to the play of the game, and really makes things exciting. The only critic I have of the Streaking Kitten is if you know an Exploding Kitten is imminent, you can really mess up someone's hiding of the Streaking Kitten. Otherwise, a wonderful addition to the game overall.",
      "rating": 5.0,
      "verified": true,
      "author": "Utahcon",
      "helpful_votes": 0,
      "publication_date": 20181203
    },
    {
      "title": "I don't just like this game, I love it",
      "text": "After a little convincing I managed to get my whole family to play this game and I really did discover new sides of them I never knew existed. My grandma is a con-artist and will blow you up just as easily as she'll help you. My mother doesn't have the heart to betray anyone and she never wins. If you have the courage to blow up your own grandpa you can be the winner of the evening, and lose everyone's trust. Whether for better or for worse, this game will definitely leave an impact on your life.",
      "rating": 5.0,
      "verified": true,
      "author": "Jude",
      "helpful_votes": 0,
      "publication_date": 20200925
    },
    {
      "title": "Fast paced chaos, some confusion, lots of fun!",
      "text": "Fun entertaining game where the point isn't to win, it's to not lose. Best played with people you are close enough to that you don't mind screwing them over in good fun (or with drunk people). We play this game at dinner parties at my house, and the drunker we get the more fun it is. Not a game for kids, but your teens and adult friends would probably enjoy it.",
      "rating": 5.0,
      "verified": true,
      "author": "Henry W.",
      "helpful_votes": 4,
      "publication_date": 20171126
    },
    {
      "title": "Low Quality Cards",
      "text": "So, the game is good.. but the quality of cards is terrible. If you are going to play the game a couple of times a year there will be no problem. We play multiple times per week, and after a month the cards were shot. Edges wear and bend to the point that others know what sits in your hand. After contacting them, the company requested proof of purchase for replacement cards insisting their card manufacturer is top notch. When you can buy top of the line Bicycle cards for less than 3 dollars, it's frustrating to be out 50 bucks for this and all the add-ons.",
      "rating": 1.0,
      "verified": true,
      "author": "DB BluBlock Productions",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "Boring... just boring.",
      "text": "The best thing about this \"game\" is the artwork and captions... they're funny and cute-ish, kinda kitschy. The game is boring and has no flow to it. We were hard pressed to finish the game before moving on to something else for game night. Super boring game, don't think the expansion packs would help.",
      "rating": 2.0,
      "verified": true,
      "author": "AmazonMags",
      "helpful_votes": 3,
      "publication_date": 20181121
    },
    {
      "title": "It is actually a fun game even if you're not drunk",
      "text": "I am surprised to say that this is a fun game and with a good sense of humor about cats, you'll love playing it. A bonus to this is that it is age-appropriate (whatever that means). Young children can play this as well as adults who appreciate this humor and fun and do not require crudities unlike those who lack imagination and appreciation of well-designed humor. Anyway, buying this with the expansion packs adds a load of fun with or without alcohol. You need to get the expansion packs, too. It adds more depth to the game.",
      "rating": 5.0,
      "verified": true,
      "author": "Camelot",
      "helpful_votes": 0,
      "publication_date": 20191123
    },
    {
      "title": "Poor quality materials",
      "text": "Got it yesterday and played it with my 16 y/o granddaughter. Game is fun and easy to learn. Unfortunately, the cards are starting to fray or separate on the edges! For the price of over $30.00, I expected better quality cards! Would not recommend this game to anyone else!",
      "rating": 1.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "Non-interactive Coin Flipping Game",
      "text": "This \"game\" has extremely high variance and very, very little interaction. I'd say it's like 95% luck/5% skill. There is close to nothing you can do to meaningfully interact with the game. Basically, you just mindlessly sit there while hoping you draw cards in the right order, which will determine the entire outcome of the game. In other words, this \"game\" is no more than a sequence of coin flips. If you're the kind of person who likes to shout and giggle at uncontrollable, random events - by all means. But otherwise, do not waste your money on this crap.",
      "rating": 1.0,
      "verified": true,
      "author": "luxthunder",
      "helpful_votes": 0,
      "publication_date": 20190412
    },
    {
      "title": "Great game! Flimsy card material...",
      "text": "This is an update on my previous review. We LOVE this game, however the cards are super flimsy and several of our important cards have creases in them (we have been very careful with them to try to avoid this from happening but it still happened despite our efforts) which makes cheating very easy as they can now be identified from the backside. Would be a perfect review if the cards were made to be more durable. 😕",
      "rating": 4.0,
      "verified": true,
      "author": "M",
      "helpful_votes": 5,
      "publication_date": 20170729
    },
    {
      "title": "Mean game",
      "text": "I really tried to learn this game and see why it had 25K 5 star ratings. I really question that it does. I watched the videos, had our 7-year-old grandson watch too. His opinion was that it is a \"mean game\". Mine too. I don't see how it got good reviews at all! It is nasty.",
      "rating": 1.0,
      "verified": true,
      "author": "Patcake",
      "helpful_votes": 0,
      "publication_date": 20200707
    },
    {
      "title": "The red on the card doesn’t match the other cards in the deck..... hiss!!!!!",
      "text": "We love this game but the new dreaming kitten expansion pack is a different red so we will always know when we draw a new streaking kittens card in our deck. The red on this deck does not match our imploding or exploding kittens cards. See images. It money was no object I would spend my extra cash on new cards for all 3 decks to match, but with my luck they wouldn't match. We would of given 5 stars, cause the game is amazing and lots of fun for family game night with while on back packing trips! Merry Christmas!",
      "rating": 1.0,
      "verified": true,
      "author": "photomom",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "So much fun!",
      "text": "We have been playing exploding kittens a bunch and this made it so much more fun. There is a cat atomic bomb card where you can place all exploding kittens on top and screw over the next couple players right away. Luckily next player had a shuffle. Lol. There are cards similar to original deck but with a cool twist. Even a card that allows you to secretly keep an exploding kitten in your hand without dying.",
      "rating": 5.0,
      "verified": true,
      "author": "KonaLuv",
      "helpful_votes": 0,
      "publication_date": 20200908
    },
    {
      "title": "Doesn’t live up to the hype AT ALL",
      "text": "Im sorry, I have over 50 games in my collection and this is just a bad one. I honestly don’t know what other people see in it. I’ll say the art is funny and if you have ABSOLUTELY NOTHING else to entertain a small group of people, you can use this, but honestly you’re better off buying a game like cockroach poker. I wouldn’t even gift this game unless the recipient is a cat lover. I wish the developer luck and hope they make better games in the future",
      "rating": 2.0,
      "verified": true,
      "author": "Honestreview",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "We Love This Expansion Pack",
      "text": "We preordered this expansion pack because we are obsessed with this game. We love playing intensely with our adult friends and we also play lightheartedly with our 7 year old son. We have the Exploding Kittens party pack and when we got this expansion pack the backs of the cards didn't match. We emailed customer support and they sent out the proper cards to us immediately!",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel Handing",
      "helpful_votes": 3,
      "publication_date": 20181116
    },
    {
      "title": "Disappointing. Doesn't live up to the hype.",
      "text": "I ordered this to play with my three elementary school age boys because of the great reviews. How could so many 5-star reviews be wrong? Unfortunately, the excitement was over once they'd read all the funny blurbs on the cards. They had no interest in playing the game, which actually has very little action or variation to it. I can see why they had to create extension packs just to make it more interesting. It's like a movie trailer where they use all the funny parts to suck you in, but when you watch the movie, you find out that's all there is. In the end, we played it once and will probably never play it again.",
      "rating": 2.0,
      "verified": true,
      "author": "Megan",
      "helpful_votes": 0,
      "publication_date": 20200508
    },
    {
      "title": "BEST!!! BUY!",
      "text": "My 8 year old son is obsessed with playing this game over and over.... this says A LOT because is one of those no I want my iPad/Xbox etc! The sayings on the card are funny but he just tries to kill me with blowup kitty card lol. Does laugh at the pics. My 6 year old girl this is too advanced but with my guidance she plays along at times too! Best Buy of game in forever & so cheap!!! Reviews are 100% on this game being amazing!!",
      "rating": 5.0,
      "verified": true,
      "author": "H. N. Lombard",
      "helpful_votes": 0,
      "publication_date": 20200221
    },
    {
      "title": "My 11 year Old Loves This",
      "text": "We are always looking for things to do when screen (computer and iPad) time is finished. My 11 year old heard friends talk about this on a class trip. We bought it and he loves it. He loves strategy. I love games that don't require too much thought or concentration. It works for both of us. We've been playing with just two players and it's entertaining enough. I think it would be more fun with a few more players.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200620
    },
    {
      "title": "Easy Fast Addictive",
      "text": "We went on a family trip with my siblings and we had a blast playing this game! It is easy to learn, each game round is so fast, but it's so addictive I dont think anyone will play just one round. We always went for \"la revancha\" -- another round to see if we could beat the winner. I think it is a genius game because it is so simple YET you quickly learn that there is strategy involved. I often see it in Amazon's deal of the day and I when I do, I buy it because it makes a great birthday gift.",
      "rating": 5.0,
      "verified": true,
      "author": "pcpf",
      "helpful_votes": 2,
      "publication_date": 20171002
    },
    {
      "title": "Fun and funny game",
      "text": "Family of four here with the two kids being ages 11 and 8. We bought this game as a recommendation from friends. It is a game that is easy to learn and has a lot of funny components. We all love the silly card illustrations and descriptions as well as the actions we can make that keep the game interesting. It is highly portable and good fun for all. Absolutely recommend this game.",
      "rating": 5.0,
      "verified": true,
      "author": "DJ",
      "helpful_votes": 0,
      "publication_date": 20200523
    },
    {
      "title": "Worth it!",
      "text": "Really like the expansion! Introduces several new card types which add different variations to the game. It is definitely a good choice for experienced players, but I would reccomend playing a round or two of the original game before adding in new cards. The cone of shame is hilarious and adds a fun new element to the game, but its rather large and not compact enough to justify using every game. I would encourage other customers to wait and purchase during a sale or black friday.",
      "rating": 5.0,
      "verified": true,
      "author": "Awesome Customer",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Kids LOVE this bizarre game",
      "text": "My 10 year daughter absolutely LOVES this game. She played it first on vacation with our extended family. I thought it was weird! Really weird! And it took me a game or two to get the hang of it but my daughter got it right away. What I thought was weird, she fell in love with, the bizarre but adorable cats in this game. There is taco cat, hair potato cat, and even a rainbow ralphing cat. I’ve purchased this to keep her busy over the summer and off her laptop and indeed this game doesn’t disappoint. She can play it over and over. We find it fun for just two players or the whole family.",
      "rating": 4.0,
      "verified": true,
      "author": "MK",
      "helpful_votes": 0,
      "publication_date": 20190808
    },
    {
      "title": "So Much Fun!",
      "text": "This definitely makes the game more interesting. I loved the new cards, and all the things you get to do because of them. Even the imploding kitten gave a new level of intensity to the game. Especially since it's just me and my husband playing most of the time, you get this real build of anticipation. The cone of shame thing is a bit ridiculous, and we didn't use it. Though with it just being 2 then there wasn't much point, but it would also make it really hard for you to see your own cards. But it isn't really a part of the game, so no big deal. Altogether a great expansion.",
      "rating": 5.0,
      "verified": true,
      "author": "RayGun",
      "helpful_votes": 0,
      "publication_date": 20180203
    },
    {
      "title": "... adds a lot of extra moves to an already fun game, but I wish the cards backs had ...",
      "text": "The expansion adds a lot of extra moves to an already fun game, but I wish the cards backs had the exact same shade of red as the original deck. With these new cards being a bit darker it's too easy to snatch one of them from another person as you know that all of them are worthy of it, so it's kinda breaks the game. How hard could it be to make the colors match?",
      "rating": 3.0,
      "verified": true,
      "author": "D. & E.",
      "helpful_votes": 3,
      "publication_date": 20180110
    },
    {
      "title": "We LOVE THIS GAME!!",
      "text": "Its seriously so much freaking fun. Our kids play too (ages 6 & 9). FYI the party packs have 2 different backs. Our original one we have has an elaborate pattern on the back of the cards. this one (purchased as a gift) has a simple back, maroon with the Exploding Kittens logo only. We tried to get the 2 expansion packs but neither of them match our deck. However we wrote the company and theyre sending cards to match ours! Such an incredible company. So super pleased with this product.",
      "rating": 5.0,
      "verified": true,
      "author": "sarahsvb",
      "helpful_votes": 0,
      "publication_date": 20190903
    },
    {
      "title": "Awesome game but flimsy cards!",
      "text": "This game is awesome!! I got it for the first time last Christmas and we all still love playing it. The reason why I am just giving 4 stars is that the cards bend so easily. They are too thin. The problem with that is after awhile you know which are the exploding kitten cards...which totally ruins the game. We've had to buy this game 3x which may be the reason the company is not fixing this. Please Exploding Kittens peeps. Make the cards thicker and more durable!",
      "rating": 4.0,
      "verified": true,
      "author": "Allinyc",
      "helpful_votes": 2,
      "publication_date": 20171204
    },
    {
      "title": "Expansion cards different than Originals, Easy to tell apart when in hand....",
      "text": "(This is also an issue with the Streaking Kittens set as well) Ordered & just got the 2 expansion sets (Imploding & Streaking) & the embossing on the expansions is reversed from the original set, so you can tell the cards apart when in hand. The original set has the embossed pattern on the face, with a smooth back, while the expansions are reversed. Do I just have an older original set? Was planning on exchanging the expansions BUT which set is actually correct? DRATS!!!! Update: Changed from 3 to 5 stars. Exchanged the old set for a new one- problem solved. Great game!",
      "rating": 5.0,
      "verified": true,
      "author": "BigStick",
      "helpful_votes": 0,
      "publication_date": 20190801
    },
    {
      "title": "Does not fit in my ear",
      "text": "I tried all the sizes, but the unit will not fit in my ear to produce a good sound. They constantly fall off of my ear.",
      "rating": 1.0,
      "verified": true,
      "author": "MemnochTheRed",
      "helpful_votes": 4,
      "publication_date": 20190104
    },
    {
      "title": "fun game but BAD QUALITY of cards",
      "text": "very clever game but the other people that complained about the poor quality of the cards was not an exaggeration. we played with older kids and adults so they were not abused or used roughly but only after a single game the corners were already falling apart. I dont anticipate the cards lasting for more than a few games. If the card quality was better id give it 5 stars because we were having a good time playing it. Its a shame because i would invest in more expansion packs and buy more of their products if they would last but i wont be wasting my money.",
      "rating": 2.0,
      "verified": true,
      "author": "joellen r cherko",
      "helpful_votes": 0,
      "publication_date": 20190103
    },
    {
      "title": "STOP! Don't waste your money!",
      "text": "The cards are falling apart! The concept of the game is great but we played only once and the cards are of such poor quality that by the second game players were able to recognize damaged cards which ruined the game completely. I expected better quality cards from a $30 game. (I purchased the party pack) I had hoped this would be a fun game we could play with family visiting for the holidays and now it's unplayable. I can't even begin to describe how disappointed I am. Will never recommend.",
      "rating": 1.0,
      "verified": true,
      "author": "N.A.",
      "helpful_votes": 0,
      "publication_date": 20191223
    },
    {
      "title": "Fun, but has a learning curve if no one has played before",
      "text": "With a group getting Together to play cards after not seeing each other for a while- this isn’t a game you can just pick up and play. It’s something that you have to concentrate on for the first two or three games. I say it’s difficult to learn because you have to concentrate and can’t be chatting with others. However, if one of us had already played the game or had watched a video it might have been better.",
      "rating": 3.0,
      "verified": true,
      "author": "J McConnell",
      "helpful_votes": 0,
      "publication_date": 20200616
    },
    {
      "title": "Expansion cards different than Originals, Easy to tell apart when in hand....",
      "text": "Really enjoy playing the original set with the kids. Ordered & just got the 2 expansion sets (Imploding & Streaking) & the embossing on the expansions is reversed from the original set, so you can tell the cards apart when in hand. The original set has the embossed pattern on the face, with a smooth back, while the expansions are reversed. Do I just have an older original set? Was planning on exchanging the expansions BUT which set is actually correct? DRATS!!!! Update: Changed from 3 to 5 stars. Exchanged the old set for a new one- problem solved. Great game!",
      "rating": 5.0,
      "verified": true,
      "author": "BigStick",
      "helpful_votes": 0,
      "publication_date": 20190801
    },
    {
      "title": "Fun Addition!",
      "text": "Adding this to Exploding Kittens has been fantastic. There's several new cards, some similar ones (like a \"Targeted Attack\"), and of course the Imploding Kitten. The only criticism I have is that by adding the Imploding Kitten, generally, the Exploding Kitten (and Defuses) have less impact on the game. Maybe 1 in 10 games is determined by an Explosion... most games end by Implosion. Still, it's super-fun and that little nuance never stops us from playing. In fact, it's almost like bragging rights when somebody loses to an Exploding Kitten now because it's so rare.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Cade",
      "helpful_votes": 0,
      "publication_date": 20181105
    }
  ],
  "product_meta": {
    "title": "Exploding Kittens Card Game - Family-Friendly Party Games - Card Games For Adults, Teens & Kids",
    "rating": 4.6,
    "feature_bullets": [
      "Exploding Kittens is the perfect board game for adults who are into kittens and explosions and laser beams and sometimes goats.",
      "More than 9 million copies sold, breaking records in games for kids, games for adults, and everything in-between.",
      "A highly strategic, kitty-powered version of Russian Roulette. Basically, if you draw an Exploding Kitten, you lose and you are full of loser sad-sauce. If you don’t explode, YOU WIN! Congratulations, you are full of greatness!",
      "This “Game of the Year” award winner is the perfect holiday gift if you’re looking for board games for adults but want to be able to play fun games with your kids as well.",
      "'It's like UNO, except there are goats, magical enchiladas and kittens that can kill you.\" -CNN",
      "This gift favorite takes 5 minutes to learn, 15 minutes to play, is for 2-5 players (ages 7+) and includes 56 cards, box and instructions."
    ],
    "specifications": {
      "Product Dimensions": "11.2 x 16.21 x 3.81 cm; 180 Grams",
      "Manufacturer recommended age": "6 months - 7 years",
      "Item model number": "EKG-ORG1-1",
      "Language:": "English",
      "Number of Game Players": "5",
      "Number of Puzzle Pieces": "48",
      "Assembly Required": "No",
      "Batteries Required?": "No",
      "Batteries Included?": "No",
      "Material Type(s)": "Karton",
      "Material Composition": "Karton",
      "Remote Control Included?": "No",
      "Color": "Multicoloured",
      "Mfg Recommended age": "6 months - 7 years",
      "ASIN": "B010TQY7A8",
      "Customer Reviews": "4.6 out of 5 stars32,372 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "16 in Toys & Games",
      "Date First Available": "27 Aug. 2015"
    },
    "categories": [
      "Toys & Games",
      "Games & Accessories",
      "Dedicated Deck Card Games",
      "Card Games"
    ],
    "price": 21.4
  }
}