{
  "website_summaries": [
    {
      "verdict": "Buying these in bulk makes good financial sense. No need to find long or short bolts elsewhere.",
      "pros": [
        "Contains both short and long screws for installation",
        "Solid, high-quality construction",
        "Brushed nickel finish is attractive and easy to clean"
      ],
      "cons": [
        "Individual pulls in set may not match",
        "Some holes not drilled from center",
        "Screw size doesn't always match product description"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Classy!",
      "text": "These are amazing! Look so good! They are heavy and not cheap at all. My dad just got his kitchen redone and they were going to charge him 9.50 for each one of these. This is the best price you will find for the quality!",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa T.",
      "helpful_votes": 27,
      "publication_date": 20160318
    },
    {
      "title": "Superior quality... Better than I expected!",
      "text": "Do not hesitate on purchasing these. My husband has a contracting business and was doing a remodel project for a customer on a budget. Well, there is nothing budget about the quality and finish of these. You can feel the weight of its solid construction. They are not hollow like most you find at big box stores. Well worth the money and more. I would say the price point at a store would be about $5 or $6 each! The finish is a nice brushed nickel and unlike other reviewers none of them were defective. They are also individually wrapped. I would definitely order again.",
      "rating": 5.0,
      "verified": true,
      "author": "Steph",
      "helpful_votes": 7,
      "publication_date": 20160407
    },
    {
      "title": "An Excellent Buy",
      "text": "I am always worried about buying something like this. My first clue that it was good was that our mail carrier struggled w/ the weight of it. I didn't want something lightweight. I wanted something w/ substance. The guy who put it in was impressed...he does kitchen remodels. He said a lot of times people buy these and the mounting screws have different sizes. Local businesses wanted 3 X what we paid.",
      "rating": 5.0,
      "verified": true,
      "author": "Frisco Joy",
      "helpful_votes": 2,
      "publication_date": 20170616
    },
    {
      "title": "Perfect finish to cabinet doors",
      "text": "I used on my kitchen cabinet doors (used cup drawer handles on drawers) in my new house. I get so many compliments. These are great quality (come with 2 sizes of installation screws) and give me the exact look I want. Note the length of these before ordering: They are not really long, but they are exactly what I wanted. I definitely recommend the quality of the product. My perfectionist son installed these (without any trouble), and they add so much to the finished look of the kitchen. Now I know from which side to open each cabinet door! I could not be happier!",
      "rating": 5.0,
      "verified": true,
      "author": "countrygal",
      "helpful_votes": 0,
      "publication_date": 20170701
    },
    {
      "title": "Some are crooked/misaligned and measurements are not standardized",
      "text": "I agree with the other reviews - these look great but some of them are not perfectly level or aligned. Not noticeable right away until you mount them on the cabinets - then you'll see that the holes don't line up or they are slightly crooked. Beware if you're using one of them as a template for drilling holes on the cabinets. You may be disappointed to find out that they are not standardized.",
      "rating": 3.0,
      "verified": true,
      "author": "neworchid",
      "helpful_votes": 0,
      "publication_date": 20170826
    },
    {
      "title": "Look great- you may have to buy different length screws though",
      "text": "These did a lot to make our cabinets look more updated. Really great price and they look high end. I didn't have any defective ones in the two packages I ordered. However, I had to buy different length screws as the ones provided were either too long or too short for my cabinet doors (though the longer ones did work for the drawers). Size 8-32 x 1 1/4 in long pan head machine screws did the job for the doors. I'd also suggest buying a template to make it easier, because if you're even a little off you can tell with these bars. I bought Laureys \" perfect mount\" and that worked well for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Katja",
      "helpful_votes": 2,
      "publication_date": 20170507
    },
    {
      "title": "Simple, cheap, get what you pay for",
      "text": "These are simple and cheap. You get what you pay for - mine were a little scuffed up and loosely screwed together. Went through them all with some thread locker and installed just fine. They came with two sets of screws, which might be nice if you have cabinets with thicker doors.",
      "rating": 4.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 5,
      "publication_date": 20170426
    },
    {
      "title": "Great Quality at an Unbelievably Low Price.",
      "text": "Bought 35 of these handles. High quality at about 25% of the cost at Lowes or Home Depot. My order included both the standard 1 inch and longer 1.75 inch screws which I needed for my cabinet drawers. I wouldn't hesitate to buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "FCD",
      "helpful_votes": 5,
      "publication_date": 20161003
    },
    {
      "title": "You may or may not get the ones.",
      "text": "Buyer beware as the first set was great. The second set not so much. See pic.",
      "rating": 1.0,
      "verified": true,
      "author": "Kenneth Stump",
      "helpful_votes": 22,
      "publication_date": 20161127
    },
    {
      "title": "Great quality and weight",
      "text": "Unbelievable is all I can say about these. The quality is top notch and they were easy to install. They feel solid and look as good as those selling for triple the price. Don't hesitate for a minute to buy, you'll be very pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "Jean M.",
      "helpful_votes": 3,
      "publication_date": 20170417
    },
    {
      "title": "Sturdy and Look Great",
      "text": "This is my 4th order of these handles. They match all the other handles perfectly. From different companies. The company I used to buy them from was charging 3x more than the last set. I used these handles in the kitchen, in my bathroom, in my garage, in my lanai, my sun room....everywhere. Now I am doing furniture updates for my bedroom and you guessed it, handles that match. Sturdy and they look nice.",
      "rating": 5.0,
      "verified": true,
      "author": "JanJohnson",
      "helpful_votes": 0,
      "publication_date": 20170926
    },
    {
      "title": "Value buy",
      "text": "Nice design, clean lines, but the plating is a little inconsistent on some. These are heavy duty and machined well within tolerance - you couldn't even buy the material here in the US, alone from machining them for this price. You'll notice some slight impurities under close inspection, but after the living hell of painting/re-modeling your kitchen cabinets these offer nice value. Measure twice, drill once!!",
      "rating": 4.0,
      "verified": true,
      "author": "Speegee",
      "helpful_votes": 0,
      "publication_date": 20170814
    },
    {
      "title": "I was concerned the quality would be poor for this amazing price",
      "text": "I was concerned the quality would be poor for this amazing price, but these handles are great and very heavy, I'm very impressed by the quality and they were quite easy to install. However I would recommend purchasing a template to mark your holes.",
      "rating": 5.0,
      "verified": true,
      "author": "E. Ibarra",
      "helpful_votes": 0,
      "publication_date": 20170730
    },
    {
      "title": "These look amazing in my kitchen",
      "text": "These look amazing in my kitchen. Easy to install and my package came with both small screws and long screws (for each handle) for varying cabinet thickness. The handles are thick, heavy duty and so worth it for the price. Home Depot and Lowes had the same look for much more money.",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel.w212",
      "helpful_votes": 0,
      "publication_date": 20170831
    },
    {
      "title": "Highly recommend!",
      "text": "I can not believe these handles are so nice and such good quality!! We purchased for a home we plan to flip but have now decided to buy for our own home remodel! Great product especially for the price!!",
      "rating": 5.0,
      "verified": true,
      "author": "Jazzitoff",
      "helpful_votes": 2,
      "publication_date": 20170320
    },
    {
      "title": "These are completely amazing! My sisters and I had planned a long ...",
      "text": "These are completely amazing! My sisters and I had planned a long weekend where we were going to redo my kitchen, and I had ordered a much more expensive product from Home Depot that didn't come in time, so I had to order these instead and pay for same day shipping. They have a nice, heavy feel, two different sized screws, looked great, and saved me a ton of money. I am so happy with my purchase! They saved our weekend!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170612
    },
    {
      "title": "These are really good quality. I was expecting something less",
      "text": "These are really good quality. I was expecting something less. We bought these to update a rental property and were quite pleased that they were so nice. They are really heavy and we just love them.",
      "rating": 5.0,
      "verified": true,
      "author": "Sofia R",
      "helpful_votes": 0,
      "publication_date": 20161104
    },
    {
      "title": "Quality could be better",
      "text": "Overall they are heavy and look good at a distance. However I got one (in my 25 pack) that was totally crooked (see photo). When you get up close the tolerances where the posts connect to the pull bar aren't very good.",
      "rating": 3.0,
      "verified": true,
      "author": "Jason",
      "helpful_votes": 2,
      "publication_date": 20170506
    },
    {
      "title": "Great price and good quality",
      "text": "Great price and good quality. I was able to install this on my kitchen cabinets with the help of marking tool i bought from home depot for less than $5. Me and my husband was able to fix the handles on all our kitchen cabinets. Quality is really good and the same thing is sold for more in Home Depot. Planning to buy more for my bathroom cabinets. 5 star from me.",
      "rating": 5.0,
      "verified": true,
      "author": "Sky Tsetan",
      "helpful_votes": 0,
      "publication_date": 20170118
    },
    {
      "title": "Very impressed.",
      "text": "These handles far exceeded my expectation. They are of the quality you would only expect from a much more expensive product. I would recommend them to anyone, in fact I bought the 25 pack and am now going to order another one for the bathroom and laundry room. Very impressed.",
      "rating": 5.0,
      "verified": true,
      "author": "L. Hoffman",
      "helpful_votes": 0,
      "publication_date": 20161106
    },
    {
      "title": "These handles are great. Just redid my kitchen and went to the ...",
      "text": "These handles are great. Just redid my kitchen and went to the local big box stores to look for handles for cabinets. Had I bought them there, they would have been $6.00 each. These come in at about $1.09 each and are exactly the same thing. Very durable and look great.",
      "rating": 5.0,
      "verified": true,
      "author": "Rick Valente",
      "helpful_votes": 0,
      "publication_date": 20160413
    },
    {
      "title": "Excellent product!",
      "text": "Impeccably packaged so they arrived in perfect condition. I really appreciate the two different sizes of screws included -- it made installation a breeze! This hardware looks fantastic on cupboards and gives them a modern, minimalist look. I couldn't be happier.",
      "rating": 5.0,
      "verified": true,
      "author": "Ms. Bea Haven",
      "helpful_votes": 0,
      "publication_date": 20170529
    },
    {
      "title": "Really nice quality",
      "text": "These handles are heavy, very nice and seem like a good quality. They were much cheaper than the big box stores. They look beautiful on my kitchen cabinets. I recommend these for a nice upgrade to your cabinets.",
      "rating": 5.0,
      "verified": true,
      "author": "Happy Tails",
      "helpful_votes": 2,
      "publication_date": 20160424
    },
    {
      "title": "Good considering the price",
      "text": "If you're looking for super high end hardware look elsewhere. QC isn't perfect as other reviewers have mentioned. I had 1 of 25 with the end of beveled. For the price I'm not complaining. I bought them for cabinets in our laundry room. No issues with the screws. As long as you know what you're getting for the price, I would definitely recommend.",
      "rating": 4.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20170225
    },
    {
      "title": "Excellent value and quality",
      "text": "I bought a single equivalent one of these at HD just to see how it looked on the kitchen cabinet doors, then I ordered these from Amazon for a great savings, even with shipping. The shipping was very fast ( 3-4 days) and I can't wait to get them installed. Heavy, solid construction and a modern look. Couldn't be happier!",
      "rating": 5.0,
      "verified": true,
      "author": "Amy R. Smith",
      "helpful_votes": 2,
      "publication_date": 20160419
    },
    {
      "title": "Five Stars",
      "text": "Great product for the price, can't tell the difference between these and the pricey ones at homedepot.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180121
    },
    {
      "title": "This cabinet hardware is excellent quality! They look amazing in the kitchen",
      "text": "This cabinet hardware is excellent quality! They look amazing in the kitchen. I already have people asking where we got them so they can order them. Excellent quality and great price. Includes 1\" and 2\" screws! Great product!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170417
    },
    {
      "title": "Look great! I had these in my other house that ...",
      "text": "Look great! I had these in my other house that I just sold and bought them at one of the big box stores - these were not nearly as expensive. Thank you! Would buy again!!",
      "rating": 5.0,
      "verified": true,
      "author": "Cyndi Froehlich",
      "helpful_votes": 0,
      "publication_date": 20161126
    },
    {
      "title": "Most good, some issues with alignment",
      "text": "Most were very good! Had several in the pack that were bent and not straight. Would love if supplier could supply new ones to replace the bent ones. I do have pictures showing the issue! 5 stars if they provide support and replace the bad handles!",
      "rating": 3.0,
      "verified": true,
      "author": "Dan",
      "helpful_votes": 0,
      "publication_date": 20180606
    },
    {
      "title": "great-quality",
      "text": "Very heavy duty and beautifully made hardware. Came with two different sizes of screws for cabinets as well as drawers . Wonderful update to help modernize my kitchen cabinets. I'm very pleased with the purchase and certain they will last us for years.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20170604
    },
    {
      "title": "Five Stars",
      "text": "Every single one was perfect. They are wrapped individually and look brilliant in my kitchen!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161101
    },
    {
      "title": "Beautiful!!!!",
      "text": "Beautiful!!! This is the exactly what I wanted to refresh my kitchen. These are not lite weight they are nice and heavy. I Will buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Cathryn Marroquin",
      "helpful_votes": 0,
      "publication_date": 20160914
    },
    {
      "title": "Nice handles",
      "text": "Nice handles! The only issue I had was that not all of the screws were the correct size. The handles come with 2 different size screws, but again some of those screws were different sizes.",
      "rating": 4.0,
      "verified": true,
      "author": "Indiana sports parent ",
      "helpful_votes": 0,
      "publication_date": 20170506
    },
    {
      "title": "Instant update for cupboards!",
      "text": "These are of great quality and look amazing on the cupboards. I replaced old brass (single) knobs and these gave the cupboards an instant updated look!",
      "rating": 5.0,
      "verified": true,
      "author": "WI Gal",
      "helpful_votes": 0,
      "publication_date": 20161231
    },
    {
      "title": "... for my kitchen cabinets and my wife and I love the new look they bring to our cabinets",
      "text": "Bought these for my kitchen cabinets and my wife and I love the new look they bring to our cabinets, very amazing combination:)",
      "rating": 5.0,
      "verified": true,
      "author": "David Quezada",
      "helpful_votes": 0,
      "publication_date": 20161221
    },
    {
      "title": "Love the handles",
      "text": "Love the handles! They are sturdy and made very well. They arrived very quickly and are a perfect addition to our kitchen renovation.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve",
      "helpful_votes": 0,
      "publication_date": 20170424
    },
    {
      "title": "Good value for the price",
      "text": "Easy to install. Good quality. Instant update and new look to my kitchen.",
      "rating": 4.0,
      "verified": true,
      "author": "J",
      "helpful_votes": 0,
      "publication_date": 20170628
    },
    {
      "title": "Fantastic for the price.",
      "text": "Same quality as you'll find in Home Depot/Lowes, but much better price. Overall consistent from one handle to the next, which is what I was worried about.",
      "rating": 5.0,
      "verified": true,
      "author": "MarkW",
      "helpful_votes": 0,
      "publication_date": 20170628
    },
    {
      "title": "Better than expected - Nice heavy duty but sleek design",
      "text": "Very heavy - nice design - better than expected; more heavy and sleek than I expected - much better than those in the store I have compared them to. I highly recommend -",
      "rating": 5.0,
      "verified": true,
      "author": "Tammy S.",
      "helpful_votes": 0,
      "publication_date": 20171017
    },
    {
      "title": "Would definitely recommend.",
      "text": "Made a huge difference in our kitchen. They were so much cheaper than in the store, and are made well. I acticipate no problems. Would definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Drew V",
      "helpful_votes": 0,
      "publication_date": 20161101
    },
    {
      "title": "Just painted my cabinets white and these handles go great with my stainless steel appliances",
      "text": "Just painted my cabinets white and these handles go great with my stainless steel appliances!!!! AND, they also send 2\" long bolts in case you install them in a drawer with a thicker backing than cabinets. Definitely worth the price and quality is great!",
      "rating": 5.0,
      "verified": true,
      "author": "GMoney",
      "helpful_votes": 0,
      "publication_date": 20160822
    },
    {
      "title": "Perfect for our new kitchen cabinets!",
      "text": "These are great! Perfect for our new kitchen cabinets. I love the look. They are nice and solid. Great quality and much better deal than buying from the big box hardware stores.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr&MrsCarr",
      "helpful_votes": 0,
      "publication_date": 20170725
    },
    {
      "title": "Good looking and sturdy",
      "text": "We’ll be buying more of these. They look great and are sturdy.",
      "rating": 5.0,
      "verified": true,
      "author": "Ky",
      "helpful_votes": 0,
      "publication_date": 20180317
    },
    {
      "title": "Extremely nice handles. Heavy and not cheap feeling whatsoever",
      "text": "Extremely nice handles. Heavy and not cheap feeling whatsoever. I had to modify a few of my cabinets to get some to fit, but 90% of the handles/screws worked already. Very Highly Recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "Capri0190",
      "helpful_votes": 0,
      "publication_date": 20160715
    },
    {
      "title": "great",
      "text": "Fantastic. All very heavy duty and all fit very well. Better then any I saw in the box stores and about half the price",
      "rating": 5.0,
      "verified": true,
      "author": "einstein2821",
      "helpful_votes": 0,
      "publication_date": 20160806
    },
    {
      "title": "Sturdy cabinet pulls",
      "text": "Love these pulls. They look great on our cabinets. They were much cheaper in the multipack than purchasing at one of the big box home improvement stores & they're the same thing.",
      "rating": 5.0,
      "verified": true,
      "author": "Amelia Gibson",
      "helpful_votes": 0,
      "publication_date": 20180320
    },
    {
      "title": "Great size. A stand out addition to the new ...",
      "text": "Outstanding quality. Great size. A stand out addition to the new 42\" cabinets we just installed for a customer.",
      "rating": 5.0,
      "verified": true,
      "author": "Presswick10",
      "helpful_votes": 0,
      "publication_date": 20160915
    },
    {
      "title": "Very good quality and stylish handles",
      "text": "Very good quality and stylish handles. Not those cheaply made \"metal looking\" handles, they are real metal, very solid and you can feel the weight. Bought 50 of these to replace all my kitchen cabinet handles.",
      "rating": 5.0,
      "verified": true,
      "author": "Corona",
      "helpful_votes": 0,
      "publication_date": 20160926
    },
    {
      "title": "Good Looking cabinet door pulls",
      "text": "Great look--great finish--exact fit for modernizing my older cabinets--and they match stainless stell appliances.",
      "rating": 5.0,
      "verified": true,
      "author": "Roddy Moody",
      "helpful_votes": 0,
      "publication_date": 20170130
    },
    {
      "title": "These handles worked out perfect for my newly remodeled cabinets",
      "text": "These handles worked out perfect for my newly remodeled cabinets. They are a little off square but with the 25 pack I was able to mix and match to find the handles that lined up together.",
      "rating": 4.0,
      "verified": true,
      "author": "PCPowman",
      "helpful_votes": 0,
      "publication_date": 20161216
    },
    {
      "title": "Looks great with new cabinets!",
      "text": "Same day shipping looks great with my new cabinets! They are $3.00 pc at Home Depot!",
      "rating": 5.0,
      "verified": true,
      "author": "Mystic480",
      "helpful_votes": 0,
      "publication_date": 20161008
    },
    {
      "title": "Nice quality",
      "text": "They are really good quality. Heavy and look nicely finished. The price ($31) is very good for a 25 pack of this quality hardware. Very happy",
      "rating": 5.0,
      "verified": true,
      "author": "Isabel M. Falcon",
      "helpful_votes": 0,
      "publication_date": 20161102
    },
    {
      "title": "WIFE PLEASED",
      "text": "it was as nice as the 5.69 one two sizes of screws .Wife was happy",
      "rating": 5.0,
      "verified": true,
      "author": "gff42",
      "helpful_votes": 0,
      "publication_date": 20161113
    },
    {
      "title": "Great quality!",
      "text": "They come with two screw sizes. Look amazing on my white kitchen cabinets.",
      "rating": 5.0,
      "verified": true,
      "author": "T. A.",
      "helpful_votes": 0,
      "publication_date": 20180227
    },
    {
      "title": "Excellent",
      "text": "This hardware is exactly what I was looking for. Honestly, I believe they are a better quality than the ones I saw in the large home improvement stores. And the price was much less. I am very happy with this purchase and would definitely recommend it to anyone looking for this style.",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara A Cooper",
      "helpful_votes": 0,
      "publication_date": 20170720
    },
    {
      "title": "Five Stars",
      "text": "Absolutely loved these! Adds such character, great way to update your cabinets to a more modern feel!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171111
    },
    {
      "title": "Love love lovr",
      "text": "Stylish, easy to install, perfect fit to my new kitchen...",
      "rating": 5.0,
      "verified": true,
      "author": "Marc Albin",
      "helpful_votes": 0,
      "publication_date": 20170105
    },
    {
      "title": "Kitchen door handles",
      "text": "Looks great and very sturdy. Some accompanying screws do not fit. Price was terrific for 25!",
      "rating": 5.0,
      "verified": true,
      "author": "JaneD",
      "helpful_votes": 0,
      "publication_date": 20170523
    },
    {
      "title": "Highly recommend. I'm very satisfied",
      "text": "Solid and heavy weight. No problen with screws as others mentioned. Highly recommend. I'm very satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "Dennis W.",
      "helpful_votes": 0,
      "publication_date": 20160912
    },
    {
      "title": "Five Stars",
      "text": "Great value for same item that cost an arm and leg at Home depot!",
      "rating": 5.0,
      "verified": true,
      "author": "Tyanna N Blanchard",
      "helpful_votes": 0,
      "publication_date": 20180405
    },
    {
      "title": "Very nice",
      "text": "just what i was looking for! Simple modern and clean",
      "rating": 5.0,
      "verified": true,
      "author": "Penny",
      "helpful_votes": 0,
      "publication_date": 20161202
    },
    {
      "title": "Very nice!",
      "text": "These handles are very nice. Amazon has the best prices.",
      "rating": 5.0,
      "verified": true,
      "author": "Happy!",
      "helpful_votes": 0,
      "publication_date": 20171007
    },
    {
      "title": "Five Stars",
      "text": "Used these for all my needs for my office. Nothing to complain about.",
      "rating": 5.0,
      "verified": true,
      "author": "HP",
      "helpful_votes": 0,
      "publication_date": 20170515
    },
    {
      "title": "Great value and quality",
      "text": "The exact item I found at a home improvement store. These were a quarter of the price. Arrived on time and look amazing. Very pleased with this item and company",
      "rating": 5.0,
      "verified": true,
      "author": "Kathryn Deprospero",
      "helpful_votes": 0,
      "publication_date": 20161203
    },
    {
      "title": "Five Stars",
      "text": "Perfect! Heavy, high quality and even the hardware was great. We'll buy more for the bathrooms.",
      "rating": 5.0,
      "verified": true,
      "author": "Neko",
      "helpful_votes": 0,
      "publication_date": 20160920
    },
    {
      "title": "Five Stars",
      "text": "These are NOT the plasticy handles. These are the real deal.",
      "rating": 5.0,
      "verified": true,
      "author": "Mario Estevez",
      "helpful_votes": 0,
      "publication_date": 20180511
    },
    {
      "title": "Great for the price!",
      "text": "I just installed these on my kitchen cabinets and they look amazing! They have a nice weight to them as well. So far, so good!",
      "rating": 5.0,
      "verified": true,
      "author": "Crystal",
      "helpful_votes": 0,
      "publication_date": 20161112
    },
    {
      "title": "Nice!",
      "text": "They are nice, and a lot in a pack for the price! Added a lot to an older kitchen with painted cabinets.",
      "rating": 5.0,
      "verified": true,
      "author": "golfer mom",
      "helpful_votes": 0,
      "publication_date": 20160907
    },
    {
      "title": "Nice product",
      "text": "These handles look great on our brand new kitchen cabinets. The size is perfect for our hands. I'm very pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "Henriette Ehlers",
      "helpful_votes": 0,
      "publication_date": 20170217
    },
    {
      "title": "Good value.",
      "text": "As good as the bulk packs in the big box stores but so much cheaper! A good product at a good price.",
      "rating": 5.0,
      "verified": true,
      "author": "Pete",
      "helpful_votes": 0,
      "publication_date": 20160423
    },
    {
      "title": "Great Hardware",
      "text": "Great handles for cabinets. The kitchen looks amazing! They were easy to install and dressed up the cabinets. I would definitely recommend them.",
      "rating": 5.0,
      "verified": true,
      "author": "Sherry Yates",
      "helpful_votes": 0,
      "publication_date": 20181031
    },
    {
      "title": "Five Stars",
      "text": "I love it, it looks very nice made a huge difference for my kitchen cabinets.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170323
    },
    {
      "title": "Five Stars",
      "text": "Amazing and heavy duty! LOVE the quality and the price!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Dale",
      "helpful_votes": 0,
      "publication_date": 20170717
    },
    {
      "title": "Solid quality and value!",
      "text": "These cabinet pulls are the real deal. High-quality, solid construction and perfect compliment to our newly painted kitchen.",
      "rating": 5.0,
      "verified": true,
      "author": "Jonathan Greiner",
      "helpful_votes": 0,
      "publication_date": 20180629
    },
    {
      "title": "Beautiful Upgraded Look!",
      "text": "Amazing product!! Great quality and smooth fit! I would encourage anyone to feel comfortable with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "PiscesQueen",
      "helpful_votes": 0,
      "publication_date": 20161108
    },
    {
      "title": "These are amazing and look so good",
      "text": "These are amazing and look so good! They are heavy weight and not cheap at all. Great investment, updated my kitchen!",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa T.",
      "helpful_votes": 0,
      "publication_date": 20160504
    },
    {
      "title": "Five Stars",
      "text": "Well made and beautiful! Just what I was hoping for",
      "rating": 5.0,
      "verified": true,
      "author": "J. Smith",
      "helpful_votes": 0,
      "publication_date": 20170314
    },
    {
      "title": "Great pulls, quality item.",
      "text": "Very nice pulls. Quality item. Made a big difference in my kitchen.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarita",
      "helpful_votes": 0,
      "publication_date": 20170131
    },
    {
      "title": "It also came with long and short screws which is really nice, although all my cabinets used the long screws",
      "text": "I bought 3 packs of 25(75 total) and used 47 handles for the kitchen and 24 for my bathroom cabinets/drawers. It also came with long and short screws which is really nice, although all my cabinets used the long screws. Very happy with it considering out of the 75, there were maybe 2 or 3 which gave me problems. The only drawback I see is the high projection. It could hurt you if your legs happen to hit it. Most similar products on Amazon have the same projection. I had to purchase 2 handles(much more expensive) from another company that have a lower projection to be able to make 2 drawers usable to avoid hitting each other.",
      "rating": 5.0,
      "verified": true,
      "author": "mi_customer",
      "helpful_votes": 3,
      "publication_date": 20161011
    },
    {
      "title": "Beautiful",
      "text": "Gorgeous! High quality product. Shipped quick. Heavy duty, solid metal.",
      "rating": 5.0,
      "verified": true,
      "author": "Sunday McMichael",
      "helpful_votes": 0,
      "publication_date": 20160727
    },
    {
      "title": "Nice hinges but wrong size",
      "text": "Nice hinges but wrong size. Took more than the 2 day shipping alittle upset about that because I needed them by a certain date. Otherwise OK",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180522
    },
    {
      "title": "Good",
      "text": "They look very good and the quality is very great for the price",
      "rating": 4.0,
      "verified": true,
      "author": "Rebeca Colon",
      "helpful_votes": 0,
      "publication_date": 20181002
    },
    {
      "title": "These are really heavy duty & look great in my remodeled kitchen",
      "text": "These are really heavy duty & look great in my remodeled kitchen. Great purchase & much less expensive than at home improvement stores.",
      "rating": 5.0,
      "verified": true,
      "author": "Beach girl",
      "helpful_votes": 0,
      "publication_date": 20170526
    },
    {
      "title": "Terrific quality",
      "text": "These handles are just as nice as the ones at Home Depot that cost 3 times as much. They feel solid and look great.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian MH",
      "helpful_votes": 0,
      "publication_date": 20170503
    },
    {
      "title": "Sturdy and easy to lean",
      "text": "Just what I was looking for. Sturdy and easy to lean. Nice clean lines",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170805
    },
    {
      "title": "Five Stars",
      "text": "Exactly what I was looking for at a good price.",
      "rating": 5.0,
      "verified": true,
      "author": "Vince",
      "helpful_votes": 0,
      "publication_date": 20170820
    },
    {
      "title": "Five Stars",
      "text": "Love the look! But love the price even more. Compare to Lowes or Home Depot. This is a steal",
      "rating": 5.0,
      "verified": true,
      "author": "Brandon",
      "helpful_votes": 0,
      "publication_date": 20170517
    },
    {
      "title": "These cabinet pulls were satin nickel like the drawer bin cups I ordered and gave a ...",
      "text": "These cabinet pulls were satin nickel like the drawer bin cups I ordered and gave a great overall look to my Annapolis blue cabinets. Thank so much!",
      "rating": 5.0,
      "verified": true,
      "author": "Stella M. Smith",
      "helpful_votes": 0,
      "publication_date": 20171025
    },
    {
      "title": "Would highly recommend",
      "text": "I'm so impressed with these handlebars they have such nice quality for how reasonable the price is! Easy to esemble.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160911
    },
    {
      "title": "Super cheap in comparison to the $9 a pop they ...",
      "text": "Super cheap in comparison to the $9 a pop they were asking for at Home Depot. They seem to be weighted and durable, would highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Krystal P.",
      "helpful_votes": 0,
      "publication_date": 20161101
    },
    {
      "title": "Great product for the price.",
      "text": "Excellent quality for the price. Highly recommend these knobs. They are a quarter of the price of the ones in the stores and are of the same quality. Very sturdy and I love that they came with two different size screws.",
      "rating": 5.0,
      "verified": true,
      "author": "Amy",
      "helpful_votes": 0,
      "publication_date": 20161130
    },
    {
      "title": "It's awesome. Heavy duty",
      "text": "It's awesome. Heavy duty, nice finish, easy installation. Classy and modern. I bought 35 for my kitchen upgrade project.",
      "rating": 5.0,
      "verified": true,
      "author": "blackspiral",
      "helpful_votes": 0,
      "publication_date": 20160328
    },
    {
      "title": "good quality",
      "text": "Solid, good quality handles. This is the second time we purchased them.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181024
    },
    {
      "title": "Great!",
      "text": "Nice way to update my painted kitchen cabinets-very good price-quick delivery",
      "rating": 5.0,
      "verified": true,
      "author": "cwylie",
      "helpful_votes": 0,
      "publication_date": 20160426
    },
    {
      "title": "Five Stars",
      "text": "Absolutely love these handles! They are a great buy at this price. I would definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Ash",
      "helpful_votes": 0,
      "publication_date": 20170405
    },
    {
      "title": "Very nice looking high quality handles and so happy to get ...",
      "text": "Very nice looking high quality handles and so happy to get them for the price I paid. Looks very modern and has an expensive after installed.",
      "rating": 5.0,
      "verified": true,
      "author": "Chicago",
      "helpful_votes": 0,
      "publication_date": 20160424
    },
    {
      "title": "Great price- Excellent Product",
      "text": "What a great price for these! 1/4 the price at local store",
      "rating": 5.0,
      "verified": true,
      "author": "Nao mi Cjoe Grk",
      "helpful_votes": 0,
      "publication_date": 20161114
    },
    {
      "title": "Five Stars",
      "text": "These look great in my kitchen. They match the Ikea ones well",
      "rating": 5.0,
      "verified": true,
      "author": "Hope R.",
      "helpful_votes": 0,
      "publication_date": 20161212
    },
    {
      "title": "Great, high quality and they look awesome",
      "text": "Great, high quality and they look awesome. Good price, comparable to the $5 (each ) ones at the hardware store except here you get way more for your buck. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160429
    },
    {
      "title": "Five Stars",
      "text": "Received in a timely fashion and they look great in our therapy clinic.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160122
    }
  ],
  "product_meta": {
    "title": "South Main Hardware 25-Pack, SH503-SN-25 Modern Straight Bar Handle Pull - Satin Nickel Finish 3\" Hole Centers",
    "description": "Style:25 PackOur straight satin nickel handle pull is an excellent cabinet accessory for any room. Each unit contains 25 total pull handles as well as individually bagged 1\" mounting screws. South Main is the ideal hardware for redesigning your home, kitchen and bath. We offer high quality hardware accessories at the lowest possible price. With South Main Hardware, you cannot go wrong.",
    "rating": 4.7,
    "feature_bullets": [
      "Length: 5-3/8 inch width: 1/2 inch",
      "Hole center to center: 3 inch",
      "Includes 1 inch mounting screws",
      "Simple cabinet upgrade",
      "Decorative drawer pull"
    ],
    "specifications": {
      "Manufacturer": "HaoPingAn",
      "Part Number": "SH503-SN-25",
      "Item Weight": "8 pounds",
      "Product Dimensions": "5.38 x 0.5 x 1.4 inches",
      "Item model number": "SH503-SN-25",
      "Is Discontinued By Manufacturer": "No",
      "Size": "25",
      "Color": "Satin Nickel",
      "Style": "25 Pack",
      "Finish": "Satin Nickel",
      "Material": "Metal",
      "Shape": "Straight",
      "Installation Method": "Screws",
      "Item Package Quantity": "1",
      "Head Style": "Philips",
      "Handle/Lever Placement": "Horizontal",
      "Included Components": "Instruction Manual",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "ASIN": "B0103230GK",
      "Customer Reviews": "4.7 out of 5 stars416 ratings4.7 out of 5 stars",
      "Best Sellers Rank": "#277,680 in Tools & Home Improvement",
      "Date First Available": "June 19, 2015"
    },
    "categories": [
      "Pulls",
      "Cabinet Hardware",
      "Tools & Home Improvement",
      "Hardware"
    ],
    "price": 32.07
  }
}