{
  "website_summaries": [
    {
      "verdict": "The moderately priced Acer Aspire E5-573G-7034 is a desktop-replacement laptop that offers lots of storage and memory, as well as a solid feature set.",
      "pros": [
        "Good price",
        "Attractive design",
        "Plenty of storage",
        "Full numeric keypad",
        "Strong all-around performance in testing"
      ],
      "cons": [
        "Case feels flimsy",
        "Mediocre display, with narrow viewing angles",
        "No keyboard backlight"
      ],
      "aspects": {},
      "publication_date": 20151120,
      "rating": 8.0,
      "source": "pcmag"
    }
  ],
  "customer_reviews": [
    {
      "title": "I think it is fantastic for the price",
      "text": "I've had this laptop for over a year and a half and I have no complaints. I think it is fantastic for the price! It plays the games I like with no problem, although the more graphics-intensive games need to have some settings turned down to allow for better performance. But I wasn't in the market for a gaming laptop so I wasn't expecting it to perform like one :)",
      "rating": 5.0,
      "verified": true,
      "author": "Tessa",
      "helpful_votes": 2,
      "publication_date": 20170325
    },
    {
      "title": "Worked for awhile.",
      "text": "Used it for college. Lasted just shy of 4 years before the hard drive crapped out and it crashed altogether. That wasn't before I began having issues with it having clicking noises, freezing up, lagging, and the battery only lasting an hour on a full charge, and getting very hot despite being on a cool hard surface. Worked well up until that point though.",
      "rating": 2.0,
      "verified": true,
      "author": "Kriss W",
      "helpful_votes": 0,
      "publication_date": 20200415
    },
    {
      "title": "Lucky to get this one before it ran out!",
      "text": "Out of the 10052 laptops I've ever had, this is the one for me. Acer wins in quality, price, and longevity. The only issue with any computer you buy that you run into is bloatware, which is an easy fix for anyone with some expertise. I continue to buy Acer because in comparison an Asus or comparable name is often up to 30% more for the same parts! I hope that Acer continues to offer premium products for less than the more established brands. The reason I chose this one is because it has a very solid dedicated graphics card and RAM.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. Cinco",
      "helpful_votes": 0,
      "publication_date": 20150828
    },
    {
      "title": "Amazing laptop for gaming",
      "text": "Just arrived today, the startup time is insanely fast. Had to delete quite a bit of bloat ware installed on the laptop. Also if your router does not support 802.11ac , you can expect extremely slow internet speeds as my router was not 802.11ac although I temporally solved the problem by using a Ethernet cable instead of wifi. Now for gaming, this runs incredibly well, being able to run Highest settings in several games such as Warframe,BL2,TF2. Have not tested in AAA games",
      "rating": 5.0,
      "verified": true,
      "author": "Kratos Heart",
      "helpful_votes": 0,
      "publication_date": 20150828
    },
    {
      "title": "Great laptop. I bought it maybe two years ago ...",
      "text": "Great laptop. I bought it maybe two years ago now and it is still in fantastic condition, even after much dropping. The white inside actually had me worried it would discolor or stain over time but after two years of use there's barely any noticeable discoloration on it, even where my wrist often rubbed against it from typing and using the touch pad.",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa J",
      "helpful_votes": 0,
      "publication_date": 20170307
    },
    {
      "title": "Great computer for the price",
      "text": "I am a software engineer with a long history of using (and abusing) my computers, and I've been very pleased with this one. Nice specs, handsome aesthetics, good price. Monitor is a little disappointing, but really can't complain in light of the specs for this machine. Upgrading the memory is also a bit of a pain, but most people wouldn't need to do that anyway. Still, really good buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160218
    },
    {
      "title": "Love this laptop",
      "text": "Love this laptop. Can play games on it for the people asking, it does take awhile to log in sometimes. Juse wish it had a back-lit keyboard.",
      "rating": 5.0,
      "verified": true,
      "author": "Miranda",
      "helpful_votes": 0,
      "publication_date": 20161106
    },
    {
      "title": "but a great laptop. Responsive",
      "text": "Bigger than I thought, but a great laptop. Responsive, great size screen, nice look, and overall lightweight laptop.",
      "rating": 5.0,
      "verified": true,
      "author": "Julie Kaye",
      "helpful_votes": 0,
      "publication_date": 20150901
    },
    {
      "title": "good laptop,best performance,for the price it is worth it",
      "text": "This laptop is awsome.Good performance never stucks. For the money i got it, this is definitely worth it.i definitely recommend it ,only problem is low resolution, the low resolution doesnt let you see the screen good,it was the best if it was full-HD The screen is small compared to the size of laptop.",
      "rating": 5.0,
      "verified": true,
      "author": "Anton Pepkolaj",
      "helpful_votes": 0,
      "publication_date": 20151112
    },
    {
      "title": "Five Stars",
      "text": "beautiful and a bang for the buck laptop that is powerful and well worth the money",
      "rating": 5.0,
      "verified": true,
      "author": "nick t",
      "helpful_votes": 0,
      "publication_date": 20150808
    },
    {
      "title": "It's good. Not amazing",
      "text": "It's good. Not amazing, but it is good. I thought the HDMI plug was an output, allowing me to play my PS4 on it, but its an input. That was kind of lame, but the laptop itself is fast and effective. Terrible mouse pad, though. Definitely buy a mouse with the laptop.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20151008
    },
    {
      "title": "Five Stars",
      "text": "Great laptop, runs new batman and far cry perfectly after i installed ssd.",
      "rating": 5.0,
      "verified": true,
      "author": "Demi",
      "helpful_votes": 0,
      "publication_date": 20151026
    },
    {
      "title": "Five Stars",
      "text": "It's a great laptop that runs games smoothly. In my opinion the best gaming laptop for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Ian Lopez Chavez",
      "helpful_votes": 0,
      "publication_date": 20150911
    },
    {
      "title": "Great Laptop for the Money!",
      "text": "Lots of ad on software that has to be weeded through. Does come with a Windows 10 free upgrade. Very fast and sleek machine. Very lite and thin. Overall very satisfied with this laptop!",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew Phillips",
      "helpful_votes": 0,
      "publication_date": 20150910
    },
    {
      "title": "Would have been 5 but...",
      "text": "It is a great laptop that has handled anything I have thrown at it without getting too hot. The speakers arn't the best but are acceptable. It also doesn't come with a disk drive whitch I would have liked but the pros definitely out way the cons",
      "rating": 4.0,
      "verified": true,
      "author": "Sandra Terry",
      "helpful_votes": 0,
      "publication_date": 20150901
    },
    {
      "title": "Really happy I decided to buy this",
      "text": "A really good product. For the price, I doubt you can get anything better. And it looks amazing!",
      "rating": 5.0,
      "verified": true,
      "author": "Kunal Kapoor",
      "helpful_votes": 0,
      "publication_date": 20150916
    },
    {
      "title": "Great laptop for the",
      "text": "Right what I was expected. Great laptop for the price",
      "rating": 5.0,
      "verified": true,
      "author": "Ian",
      "helpful_votes": 0,
      "publication_date": 20150824
    },
    {
      "title": "Great laptop for the price!!",
      "text": "I was initially not impressed due to the slow loading on wifi for this laptop, but now I'm changing my review. I had to contact MS Support and was even elevated to a Level 2 tech because my browser would not load https websites and wifi was generally slow and choppy. After upgrading the Wireless adapter (Qualcomm released an updated driver for Windows 10 64-bit on 8/25/15) this thing is flying through the \"internets\" with the greatest of ease.",
      "rating": 4.0,
      "verified": true,
      "author": "David Byrnes",
      "helpful_votes": 0,
      "publication_date": 20150824
    },
    {
      "title": "GET it if you looking for a average gamer,",
      "text": "I like it but sometimes when gaming it gives my lag spikes, but that is a little rare. I was also very disappointed to hear this is a INTEL graphics card, the prosseser it Nvidia , and you have to keep in mind the 8 Gb storage, but I cant really say anything because when I got it is was just $500. Oh yeah also the look to this computer is SWEET",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20151129
    },
    {
      "title": "Great purchase",
      "text": "Great dealand very fast. I bought two.My husband uses his at work and my son uses his at school. Very happy",
      "rating": 5.0,
      "verified": true,
      "author": "Pamela A. Michael",
      "helpful_votes": 0,
      "publication_date": 20150922
    },
    {
      "title": "Not bad",
      "text": "Don't expect Minecraft to run well on this laptop unless you use the integrated GPU.",
      "rating": 4.0,
      "verified": true,
      "author": "Ivonmorr ",
      "helpful_votes": 0,
      "publication_date": 20150830
    },
    {
      "title": "Not a good investment",
      "text": "This laptop is a waste of money. The moment I went to go set everything up, it crashed and rebooted. At first, I set that aside as a fluke, because the graphics for the game I play were wonderful and it was running fast. However, as time passed, it only got worse. Programs and apps constantly freeze and close, refuse to open, won't install or uninstall, and it's already slowed down a ton. Windows 8 is a useless operating system, as well. Please spend your money on something more worthwhile.",
      "rating": 2.0,
      "verified": true,
      "author": "Samantha",
      "helpful_votes": 0,
      "publication_date": 20160121
    },
    {
      "title": "fast computer but",
      "text": "The computer is well made and fast but within the first day I had it ive had graphics card issues. The screen flashes black and then comes back and says graphics driver crashed and has recovered. This is very annoying as whatever you are doing is interrupted until its done recovering. computer freezes often, having to hold the power button until it shuts off. do not buy this computer",
      "rating": 1.0,
      "verified": true,
      "author": "Otto Ward",
      "helpful_votes": 0,
      "publication_date": 20150903
    },
    {
      "title": "Absolute trash",
      "text": "I bought this hoping it could connect to the internet however that is not the case. At first I thought this was a good deal for a good product but I was met with the worst internet connectivity, very poor ventilation, and probably the worst screen glare I've ever experienced. Horrible product.",
      "rating": 1.0,
      "verified": true,
      "author": "Max Hodson",
      "helpful_votes": 0,
      "publication_date": 20160107
    },
    {
      "title": "Blatant false advertising",
      "text": "The computer is actually ok but the specs are false advertising. Just so you know, if you are thinking of buying this one because of the ssd know that there isn't one. All they did was partition the 1tb hdd.",
      "rating": 3.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20151003
    },
    {
      "title": "Warning! Huge laptop issue.",
      "text": "Don't purchase this laptop unless you have a router that can work with AC 5ghz. I have a brand new verizon fios router and it is not compability with this laptop. Because of this the download speed is 5 Mbps instead of 60. Do yourself a favor and don't buy it unless you're sure your router can support it. Cheers.",
      "rating": 1.0,
      "verified": true,
      "author": "Jasmin Kasumovic",
      "helpful_votes": 4,
      "publication_date": 20150813
    }
  ],
  "product_meta": {
    "title": "Acer Aspire E5-573G-59C3 15.6\" Laptop Intel Core i5 5200U (2.20GHz) 8GB Memory 1TB HDD 8GB SSD NVIDIA GeForce 940M 2GB Bluetooth4.0 Windows 8.1",
    "description": "Acer Aspire E5-573G-59C3 15.6\" Laptop Intel Core i5 5200U (2.20GHz) 8GB Memory 1TB HDD 8GB SSD NVIDIA GeForce 940M 2GB B",
    "rating": 3.8,
    "feature_bullets": [
      "Acer Aspire i5 8GB 1TB 15.6\" dedicated graphics"
    ],
    "specifications": {
      "Standing screen display size": "15.6 Inches",
      "Max Screen Resolution": "1366 x 768",
      "Memory Speed": "2.2 GHz",
      "Graphics Coprocessor": "NVIDIA GeForce 940M",
      "Chipset Brand": "Nvidia",
      "Card Description": "Dedicated",
      "Wireless Type": "Bluetooth",
      "Average Battery Life (in hours)": "5 Hours",
      "Brand": "Acer",
      "Series": "Acer Aspire",
      "Item model number": "E5-573G-59C3",
      "Operating System": "Windows 8",
      "Item Weight": "5.29 pounds",
      "Product Dimensions": "15.02 x 10.08 x 1 inches",
      "Item Dimensions  LxWxH": "15.02 x 10.08 x 1 inches",
      "Color": "White, Black",
      "Processor Brand": "Intel",
      "Processor Count": "2",
      "Computer Memory Type": "DDR3 SDRAM",
      "ASIN": "B0105JD1HE",
      "Customer Reviews": "3.8 out of 5 stars63 ratings3.8 out of 5 stars",
      "Best Sellers Rank": "#67,868 in Computers & Accessories",
      "Date First Available": "June 22, 2015"
    },
    "categories": [
      "Computers & Accessories",
      "Laptops",
      "Electronics",
      "Traditional Laptops",
      "Computers & Tablets"
    ],
    "price": ""
  }
}