{
  "website_summaries": [
    {
      "verdict": "Hush Puppies is known for creating and delivering quality shoes for men and women, and the low-top Hanston Roadside is among them. Great for everyday use, this shoe is what you can wear from day to night. It offers style and versatility without compromising comfort.From a dress-up to a casual look, the Hush Puppies Hanston Roadside is among the men’s favorite pair. With a fashion-forward silhouette, it truly has an eye-catching appeal that solicits praise from others.",
      "pros": [
        "Most customers expressed their admirations on the fashionable and neat style of the Hush Puppies Hanston Roadside",
        "It is among the Hush Puppies sneakers that offer great comfort, according to a significant number of users",
        "This leather-textured sneaker makes a perfect match for both casual and business attire, noted by many reviewers",
        "Several buyers testified that it has excellent quality",
        "This shoe fits like a glove, mentioned by many",
        "A couple of wearers said that the low-top Hanston Roadside is lightweight",
        "It has shoe sizes that can accommodate people with wide feet, noted by some",
        "A few said that they receive compliments whenever they wear it"
      ],
      "cons": [
        "Those with average sized feet thought that the regular width shoes felt bigger than expected",
        "While the low-top Hush Puppies Hanston Roadside is available in wide width, several wide-footed individuals said that these still fit a bit snug",
        "A couple of users perceived that this shoe lacks cushioning"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": 8.2,
      "source": "runrepeat"
    }
  ],
  "customer_reviews": [
    {
      "title": "Nice Looking Shoe",
      "text": "Husband had narrower feet and these fit him comfortably. He's a pronator and the arch support is sufficient. He typically wears a size 12, but based on others' reviews, I ordered the size 11.5 for him and it fits well. Love the style, looks nice with jeans, gives him a more updated look (within his comfort zone lol) - better than traditional running shoes that he'd typically wear.",
      "rating": 5.0,
      "verified": true,
      "author": "Tango",
      "helpful_votes": 2,
      "publication_date": 20190702
    },
    {
      "title": "Lack of cushioning and arch support.",
      "text": "I may not be a fair judge about these sneakers because I have really flat feet. I am 6'3\" and weigh 240 lbs. When these arrived I was pleased with the quality and appearance of the shoe however, when I put them on and walked around the house a bit, the lack of cushioning and sole support was disappointing. The overall size was fine and as expected. I hesitate to recommend these sneakers.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180201
    },
    {
      "title": "I will say they are extremely comfortable right out of the box but don't last worth ...",
      "text": "I bought these shoes in September.... it's now December and the sole is separating on one shoe. I will say they are extremely comfortable right out of the box but don't last worth beans. Not even used for work shoes, only worn out and about.",
      "rating": 1.0,
      "verified": true,
      "author": "Efandahl",
      "helpful_votes": 5,
      "publication_date": 20161215
    },
    {
      "title": "I'm disappointed in these a bit",
      "text": "I'm disappointed in these a bit. They're a good looking shoe, but my husband said they were a snug fit and not very comfortable. He also said they were narrow and he really doesn't have that big of a foot. It's hard buying shoes online! :/",
      "rating": 3.0,
      "verified": true,
      "author": "Deanna Lancaster",
      "helpful_votes": 3,
      "publication_date": 20171204
    },
    {
      "title": "Just fit enough",
      "text": "The shoes fit me well but I feel a little hard for what I expected. But they are pretty!",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20190223
    },
    {
      "title": "Great Quality Leather",
      "text": "HushPuppies is known for making quality shoes, so that's what I expected, and I am happy to report these are some pretty great shoes. The leather used for the uppers is thick and good quality and I like the texture...not suede, but a soft matte finish. The soles seem durable too. Update: It's now going on 2 years of almost everyday use and these shoes are still going strong, other than the inside heel fabric wearing out....which is a bit annoying, but overall they've been well worth it!",
      "rating": 5.0,
      "verified": true,
      "author": "Michaelman Merchandise",
      "helpful_votes": 0,
      "publication_date": 20170201
    },
    {
      "title": "Good for people with wide feet",
      "text": "Bought these for my husband and he loves them. It's always tough finding shoes for him since he has such a wide foot but and the shoes he buys always hurt him, but he says these are very comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "DeuxEpees",
      "helpful_votes": 6,
      "publication_date": 20160317
    },
    {
      "title": "I've gotten a few compliments on these shoes. You ...",
      "text": "I've gotten a few compliments on these shoes. You don't see many leather sneakers these days so I guess they stand out. The leather is high quality. It is very soft and durable. They run a little big so beware. I should've bought a half size down.",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan",
      "helpful_votes": 2,
      "publication_date": 20161222
    },
    {
      "title": "Made for elves feet",
      "text": "I like everything about these shoes except the shape. I'm pretty sure they used elves' feet to design these shoes. The shoes as very long and narrow. I bought the \"wide\" version and they are still very skinny.",
      "rating": 3.0,
      "verified": true,
      "author": "Mattop",
      "helpful_votes": 3,
      "publication_date": 20161230
    },
    {
      "title": "We like the shoes but...",
      "text": "These shoes look great. I bought them for my husband. He wears a size 8 in Vanns, but these size 8's were too large for him, about 1/2 longer than the Vanns. If you can get the sizing right, you'll have a nice pair of shoes.",
      "rating": 4.0,
      "verified": true,
      "author": "Wren",
      "helpful_votes": 2,
      "publication_date": 20170118
    },
    {
      "title": "Four Stars",
      "text": "Fits as expected I need a wide shoes and fit well.",
      "rating": 4.0,
      "verified": true,
      "author": "Stephan Dechert",
      "helpful_votes": 2,
      "publication_date": 20161224
    },
    {
      "title": "Great Looking pair, feels small and uncomfortable.",
      "text": "Looks great feels horrible and small, not a comfortable fit at all. Hush Puppies aren't what they used to be.",
      "rating": 2.0,
      "verified": true,
      "author": "David Beltran",
      "helpful_votes": 0,
      "publication_date": 20170830
    },
    {
      "title": "Slick kicks",
      "text": "Love these shoes. Perfect for the office or shorts and a tee. Ordered on whole size smaller than my Nike or Asics. Comfortable for all day wear.",
      "rating": 5.0,
      "verified": true,
      "author": "amazonjunkie",
      "helpful_votes": 0,
      "publication_date": 20170911
    },
    {
      "title": "Gorgeous casual leather sneaker",
      "text": "Very nice shoes. So happy they are available in wide. Leather is nice and the orange accent stiching give them an updated look.",
      "rating": 5.0,
      "verified": true,
      "author": "Teddy",
      "helpful_votes": 2,
      "publication_date": 20170304
    },
    {
      "title": "Comfortable and a perfect fit.",
      "text": "I have giant wide skis for feet and these shoes fit perfectly. Comfortable as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Wolverine331",
      "helpful_votes": 0,
      "publication_date": 20180416
    },
    {
      "title": "A great shoe!",
      "text": "Very comfortable shoe that can dress up or keep casual. The fit was excellent and there is decent support in the arch.",
      "rating": 5.0,
      "verified": true,
      "author": "OwlCapone",
      "helpful_votes": 0,
      "publication_date": 20181007
    },
    {
      "title": "Comfortable",
      "text": "Second pair, great shoe, comfortable and an excellent fit. After a year some threads on the first pair came loose but it looks like any easy shoe repair.",
      "rating": 5.0,
      "verified": true,
      "author": "Frank J",
      "helpful_votes": 0,
      "publication_date": 20180118
    },
    {
      "title": "Hush Puppy can (and has in the past) do better.",
      "text": "The ad shows these coming in 2E width. When they arrive they are noted as W width. In this case, W is nowhere near the same as 2E. The W width in this shoe is really the same as most other reputable shoe company's C/D, not 2E. Hush Puppy can (and has in the past) do better.",
      "rating": 1.0,
      "verified": true,
      "author": "Finith Jernigan II",
      "helpful_votes": 2,
      "publication_date": 20171004
    },
    {
      "title": "Good quality shoes",
      "text": "my uncle love this shoes and was pleased to get them,it is exactly what he wants",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191206
    },
    {
      "title": "Shoes were extremely irregular. Left shoe differed from right ...",
      "text": "Shoes were extremely irregular. Left shoe differed from right significantly both in width and look. Quality control is lacking",
      "rating": 2.0,
      "verified": true,
      "author": "Joe",
      "helpful_votes": 0,
      "publication_date": 20170920
    },
    {
      "title": "Happy, Haaaappy Day",
      "text": "Nice shoe, nice price...goes great with new shorts (British Khaki)",
      "rating": 5.0,
      "verified": true,
      "author": "Jack G Hardy",
      "helpful_votes": 0,
      "publication_date": 20180215
    },
    {
      "title": "They fit as expected and look nice. I often have trouble with sneakers being not ...",
      "text": "They fit as expected and look nice. I often have trouble with sneakers being not wide enough but these are my second pair of Hush Puppies and they are comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "UncleHankins",
      "helpful_votes": 0,
      "publication_date": 20170101
    },
    {
      "title": "great looking shoes",
      "text": "I would say a bit narrow fit, great looking shoes",
      "rating": 5.0,
      "verified": true,
      "author": "Julia P.",
      "helpful_votes": 0,
      "publication_date": 20180201
    },
    {
      "title": "Great summer sneaker",
      "text": "Comfortable and a step up from the typical tennis shoe.",
      "rating": 5.0,
      "verified": true,
      "author": "dskingsley",
      "helpful_votes": 0,
      "publication_date": 20170423
    },
    {
      "title": "One Star",
      "text": "These shoes were rated as wide width and they were not.",
      "rating": 1.0,
      "verified": true,
      "author": "Gary Inglehart",
      "helpful_votes": 0,
      "publication_date": 20180709
    },
    {
      "title": "Great quality shoe",
      "text": "Excellent quality and fit (wide fit was perfect) and a great price.",
      "rating": 5.0,
      "verified": true,
      "author": "MDavid",
      "helpful_votes": 0,
      "publication_date": 20170116
    },
    {
      "title": "The plastic stuff supporting the heels was broken after one ...",
      "text": "The plastic stuff supporting the heels was broken after one week using the shoes. Now the plastic is hurting my left foot. Definitely a very fragile shoe.",
      "rating": 1.0,
      "verified": true,
      "author": "Just Me",
      "helpful_votes": 0,
      "publication_date": 20170427
    },
    {
      "title": "Nice but run Small",
      "text": "Bought the shoes for my brother their to narrow He likes but they wearing blisters on the heels",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161223
    },
    {
      "title": "returned this item because it was a small fit",
      "text": "returned this item because it was a small fit, i wear a 9.5 wide 3-4e, i thought this would be a good fit but it was just small.",
      "rating": 2.0,
      "verified": true,
      "author": "S. Faria",
      "helpful_votes": 0,
      "publication_date": 20170503
    },
    {
      "title": "Finally, NICE wide shoes!",
      "text": "Width is PERFECT. Finally nice shoes that are made in a wide. Little room in the toes, but these shoes are amazing!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20160516
    }
  ],
  "product_meta": {
    "title": "men hanston roadside leather",
    "description": "The Hanston Roadside is a refined leather sneaker you can take from work day to date night. HPO2Flex construction provides a flexible fit, and you'll appreciate how versatile it is within your wardrobe.",
    "rating": 4.2,
    "feature_bullets": [
      "HPO2Flex: Cushioned triangle footbed pattern conforms to the way you walk, providing air circulation, flexibility and superior support",
      "Soft textured leather uppers",
      "Fastening: Lace-Up",
      "Hanston Roadside",
      "Hanston Roadside",
      "Distressed trim linings and unlined forepart; Strobel construction",
      "HPO2Flex footbed with Ethylene vinyl acetate heel cup provides exceptional cushioning and comfort",
      "Cupsole outsole with sawtooth tread design element"
    ],
    "specifications": {
      "Item Weight": "589.67 Grams",
      "Date First Available": "21 Oct. 2010",
      "Manufacturer": "Hush Puppies",
      "Item model number": "Hanston Roadside",
      "ASIN": "B01N1H20BB",
      "Department": "Men’s"
    },
    "categories": [
      "Fashion & Athletic Trainers",
      "Shoes",
      "Fashion Trainers",
      "Men's Shoes",
      "Shoes & Bags"
    ],
    "price": 126.7
  }
}