{
  "website_summaries": [
    {
      "verdict": "While they have some nice features, they also come with some reported quality concerns that users indicate aren't typical for the Morphe brand.",
      "pros": [
        "An 11-piece pro set made with soft, natural bristles",
        "Comes with a case that keeps brushes organized and folds up nicely for makeup application on the go"
      ],
      "cons": [
        "Some brushes in the set seem more durable than others",
        "A few shed bristles, while others don't",
        "Some don't seem firm enough for certain applications"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Very disappointed. Not one single brush is labeled",
      "text": "These brushes are not the real Morphe brushes in which I was under the impression they were. Very disappointed. Not one single brush is labeled.....as Morphe brushes are.",
      "rating": 1.0,
      "verified": true,
      "author": "Julie Lynn Rich",
      "helpful_votes": 5,
      "publication_date": 20160316
    },
    {
      "title": "I was very disappointed to the product I recieved",
      "text": "It don’t normally write reviews and for this product I would give it zero stars! I was very disappointed to the product I recieved. I paid over $80 for this product to receive it packaged in plastic; and not in a nicely prepared Morphe box. The brushes seemed cheap like knockoffs and immediately determined they were knockoffs after pulling one out of the the plastic sleeve and the handle coming unglued from metal base of brush! I was so disappointed!!!",
      "rating": 1.0,
      "verified": true,
      "author": "OutdoorGirl32",
      "helpful_votes": 0,
      "publication_date": 20171219
    },
    {
      "title": "My favorite brush set",
      "text": "Purchased this set of brushes to compare with my Sephora more expensive brush set. I am highly impressed that this is such a large set for a great price. I have used the brushes for a week and I have had less fallout with the brushes. I love the roll up case. The stippling brush is amazing. These brushes have been a welcome addition to my collection. I will purchase more Morphe brushes in the future.",
      "rating": 5.0,
      "verified": true,
      "author": "angela hanna",
      "helpful_votes": 0,
      "publication_date": 20160829
    },
    {
      "title": "Great for a gift",
      "text": "I use these brushes faithfully. They are very soft and the get clean very easily. I'm thinking about ordering another set. My strap to my pouch did break the second week of having this set, I still Love these brushes.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah Brooks",
      "helpful_votes": 0,
      "publication_date": 20170105
    },
    {
      "title": "I hated to have to return these brushes",
      "text": "I hated to have to return these brushes. Half of them were amazing and everything I needed while the other half fell apart after first use or after first pulling out of the pouch. I probably would have kept it if it wasn't for the main powder brush losing all its bristles and the other large brush handle just broke right off as soon as I opened it.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160609
    },
    {
      "title": "Are they original?",
      "text": "Are these brushes original? Because they arrived with no numbers on the brushes, they were feathering and had a plastic feel to them. The bag also didn't have the brand's name on it. Please do reply.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 9,
      "publication_date": 20151111
    },
    {
      "title": "does not have brush # on handle like real morphe brushes do",
      "text": "Not real, does not have brush # on handle like real morphe brushes do.",
      "rating": 1.0,
      "verified": true,
      "author": "Alexandra O'Rorke",
      "helpful_votes": 6,
      "publication_date": 20151216
    },
    {
      "title": "Okay",
      "text": "Love everything in this set except the stipple brush. Not firm enough.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160509
    },
    {
      "title": "Not Real",
      "text": "Not real Morphe brushes. Very disappointed. Save your money and do not buy these.",
      "rating": 1.0,
      "verified": false,
      "author": "Brandi",
      "helpful_votes": 0,
      "publication_date": 20160808
    },
    {
      "title": "Disappointed",
      "text": "I ordered these brushes from the morphe website and was so disappointed, since the eye shadows are Amazing! This particular set, although it says pro, doesn't have the type/ # of the brush stamped on the handle. When I got the set, the bag and brushes had a very strong glue or spray paint odor. I let them air out a few days then washed them with my beauty blender soap. They were bleeding a black color, even after 3 washes. :(",
      "rating": 1.0,
      "verified": false,
      "author": "Brandi",
      "helpful_votes": 2,
      "publication_date": 20160327
    }
  ],
  "product_meta": {
    "title": "Morphe Brushes 11 Piece Pro Sable Brush Set - Set 682",
    "description": "11 piece PROFESSIONAL brush set. These brushes consist of natural brushes for powder application and some synthetic brushes for your creams and liquids. This set was built with a PRO in mind, it provides you with a little bit of everything. Set includes: 1.Pointed Liner Bristles ¼” Full Length 6 5/8” Bristle Type: Synthetic 2.Angle Liner Bristles ¼” Full Length 6 ½” Bristle Type: Synthetic 3.Concealer Brush Bristles 5/8” Full Length 7 1/8” Bristle Type: Goat 4.Pencil Brush Bristles 5/8” Full Length 7 1/8” Bristle Type: Sable 5 Tapered Blender Bristles ½” Full Length 7 1/8” Bristle Type: Synthetic 6.Round Blender Bristles ½” Full Length 7 1/8” Bristle Type: Goat 7.Angle Blush/Contour Bristles 1 ¼” Full Length 7” Bristle Type: Synthetic 8.Foundation Brush Bristles 1 ¼” Full Length 7 ¼” Bristle Type: Goat 9.Bronzer Brush Bristles 1 5/8” Full Length 7” Bristle Type: Syn/Sable 10.Duo Foundation Brush Bristles 1 ½” Full Length 7 1/8” Bristle Type: Sable 11.Powder Brush Bristles 1 ¾” Full Length 7 3/8” Bristle Type: Sable",
    "rating": 2.7,
    "feature_bullets": [
      "11 Piece PROFESSIONAL Brush Set",
      "Case Dimensions: Close 9” x 4 1/8” Open 14” x 9’”",
      "Case: Faux Leather (Not an animal product)"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "9.2 x 4.2 x 2.2 inches; 10.4 Ounces",
      "UPC": "683203884273",
      "ASIN": "B0106QUXBI",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Tools & Accessories",
      "Brush Sets",
      "Makeup Brushes & Tools",
      "Beauty & Personal Care"
    ],
    "price": ""
  }
}