{
  "website_summaries": [
    {
      "verdict": "Offers precise adjustment of the pitch of the whistle, as well as long distance usage.",
      "pros": [
        "This whistle carries the sound over a few hundred feet",
        "Allows use of multiple, precise frequencies for issuing different commands",
        "Uses a brass construction with a nickel plating for a long-lasting design",
        "Small size so it's easy to carry with you anywhere",
        "Made for experienced handlers"
      ],
      "cons": [
        "Expensive",
        "Will make a noise that's audible to humans at certain frequencies"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "My dog really isn't deaf!",
      "text": "Our dog recently became \"deaf\", probably due to old age. She doesn't hear what anyone is saying. I take her for a walk on a dirt road (i.e. not heavily traveled) without a leash everyday, and was concerned that if a car did come, she wouldn't hear it. So I tried this dog whistle at a high pitched frequency, and she can hear it! She has now learned when she hears the whistle to come. So, she really isn't totally deaf.",
      "rating": 5.0,
      "verified": true,
      "author": "Stan",
      "helpful_votes": 15,
      "publication_date": 20180322
    },
    {
      "title": "Doesn't function as instructions advertise.",
      "text": "Well... what can I say about the ACME Specialist Silent Dog Whistle? * The pitch is adjustable as advertised by turning the adjustable sleeve. *The provided instructions show a stop screw that is supposed to allow the user to \"lock\" the selected frequency. While you can actually turn the screw, it doesn't stop anything. Its just a screw that you can turn. The user turns the adjustable sleeve to change pitch or frequency. Contrary to their instructions provided with the model 535. You can't lock the position of the sleeve. Unless someone can show or explain to me otherwise, I will be returning this back. Does anyone out there have experience with this that can help?",
      "rating": 1.0,
      "verified": true,
      "author": "Willi",
      "helpful_votes": 4,
      "publication_date": 20200515
    },
    {
      "title": "Well made; durable construction.  Good for shutting up my cat!",
      "text": "My cat was waking us up at night by walking around the house yowling. So I bought this silent dog whistle. When the cat starts caterwauling, I blow the silent whistle. It shuts up the cat and doesn't wake up my wife!",
      "rating": 5.0,
      "verified": true,
      "author": "Doonerak",
      "helpful_votes": 8,
      "publication_date": 20181014
    },
    {
      "title": "The best thing I purchased",
      "text": "It took my dog three days to get used to it and comes immediately and I give him a treat. No matter in the house or in the 1/2 acre yard, he comes with no trouble. The best thing I purchased.",
      "rating": 5.0,
      "verified": true,
      "author": "Young at Heart",
      "helpful_votes": 9,
      "publication_date": 20180228
    },
    {
      "title": "It’s works fine if you are within 10 foot of your dog.",
      "text": "My vet recommended a dog whistle for my dog with limited hearing. I bought what I thought was the best. I trained both of my dogs to respond to the whistle inside. Each time I blew the whistle I would either feed them or give them a treat. It worked great in the house. Outside even the dog with good hearing would not respond unless he was within 10 foot of me. Looks like this is one more thing to throw in a drawer until I decide to pitch it out the window.",
      "rating": 1.0,
      "verified": true,
      "author": "R. English",
      "helpful_votes": 2,
      "publication_date": 20200421
    },
    {
      "title": "Great for training",
      "text": "Great whistle! I work at a zoo and all of the keepers here use these whistles for training the animals. It's nice that you can adjust the whistle to change the pitch, depending on the hearing sensitivity of which animals you are working with!",
      "rating": 5.0,
      "verified": true,
      "author": "Lauren",
      "helpful_votes": 6,
      "publication_date": 20190224
    },
    {
      "title": "It's nice but...",
      "text": "For some reason, my small dogs can't hear it unless it's audible to me but the large dog will react to the silent mode from a good distance away. Note though, that unlike others, this one actually is silent but you can change the pitch so that it's audible",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 11,
      "publication_date": 20170507
    },
    {
      "title": "Old School Quality",
      "text": "This is the kind of thing you'd expect your grandfather to be wearing in the field with his dogs. Old school quality and feel. A very nice item, and of course works very well. My younger dogs have quickly learned to respond to it, while my older dogs ignore it as much as they ignored me before. Joking a bit on that - clearly the dogs can hear me \"calling\" better and I think they can find me faster on a return. Certainly better than my yelling like a fool.",
      "rating": 5.0,
      "verified": true,
      "author": "Liondog",
      "helpful_votes": 0,
      "publication_date": 20191112
    },
    {
      "title": "No Way to Tighten this setting!",
      "text": "Beautifully whistle that is totally useless because it takes the strength of Samson to tighten the gizmo that adjusts the volume/loudness of the whistle. Impossible!! Sooooo disappointed in a truly classy piece of equipment.",
      "rating": 1.0,
      "verified": true,
      "author": "BeeJay",
      "helpful_votes": 0,
      "publication_date": 20200709
    },
    {
      "title": "Great recall tool with training",
      "text": "9 Mo old Australian Shepherd pups run very fast and love to try to herd deer. They learned after only 2 training sessions to respond. Was able to call them back successfully from a longer distance.",
      "rating": 5.0,
      "verified": true,
      "author": "PM",
      "helpful_votes": 4,
      "publication_date": 20190223
    },
    {
      "title": "It really works",
      "text": "I have never used a silent whistle for training. I have a 13 week old English Setter, and he some exuberantly, when I call him using the whistle. I mean like a freight train! Very simple to associate the whistle to the command Come. He got it after a few tries. The product is built very well. Had to crimp down the cover a little with a pliers, to get the cover to stay on securely. This was not a big deal at all.",
      "rating": 5.0,
      "verified": true,
      "author": "Morningguy",
      "helpful_votes": 0,
      "publication_date": 20200811
    },
    {
      "title": "Works Great, Set Screw is a fail.",
      "text": "The whistle appears to be built to last and works as described. My puppy is now 16 weeks old and has taken well to the sit and come commands using only the whistle. We have only tried this in close confines so I am not sure how it will work at a distance. My one issue with this product is the set screw does not set anything. If I screw it down all the way it does not go in far enough to lock the pitch, so I constantly have to check to make sure the whistle is set where I want it.",
      "rating": 4.0,
      "verified": true,
      "author": "tyler",
      "helpful_votes": 0,
      "publication_date": 20191209
    },
    {
      "title": "Good product",
      "text": "Good, strong material. Works well. Even has a whistle and training instruction booklet! Very helpful! Good quality product! (Unfortunately, at this point, my dog just stares at me and barks back when I blow it... but that's probably operator error at this stage, definitely not the whistles fault... wish me luck!)",
      "rating": 5.0,
      "verified": true,
      "author": "Matt O.",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "Perfect for discipline!",
      "text": "Wish I had bought this when I first got my pup. Athena is my 2 yr old German Shepherd pup and I had a hard time with her when joggers and bicycles would come by on our walks. First day out with this whistle and her attention is back on me and I have control. Great purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Gary",
      "helpful_votes": 0,
      "publication_date": 20200919
    },
    {
      "title": "Easily adjustable for freq",
      "text": "Whistle works as advertised. My dog is much more responsive to this whistle then others I have tried (cheaper brands bought at local pet shop). Construction is solid and will last for many years. Easily adjustable for freq. changes. Love this whistle.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 11,
      "publication_date": 20160530
    },
    {
      "title": "This is NOT a Silent Dog Whistle...",
      "text": "This may be a great whistle for training your animals.... HOWEVER... IT IS SUPPOSE TO BE A SILENT DOG WHISTLE... My 60 year old ears had no trouble hearing it throughout its entire range of frequencies. It seems to be a quality built whistle if you don't mind that it's not silent.",
      "rating": 1.0,
      "verified": true,
      "author": "Rialb Sirrah",
      "helpful_votes": 0,
      "publication_date": 20190822
    },
    {
      "title": "Confusing",
      "text": "Unable to tell if this works since I’m able to hear a part of the whistle.",
      "rating": 3.0,
      "verified": true,
      "author": "ShaynaMadel",
      "helpful_votes": 0,
      "publication_date": 20190611
    },
    {
      "title": "Works as advertised",
      "text": "This is a well made dog whistle and easy to use.",
      "rating": 4.0,
      "verified": true,
      "author": "MM Colorado",
      "helpful_votes": 0,
      "publication_date": 20190719
    },
    {
      "title": "Over Priced / Subpar Build",
      "text": "Either I have super human hearing, or this whistle is not silent, no matter what the setting. The top cap does not close at all, no matter how hard I try, so thats garbage. I paid the high price for the name, but was really disappointed.",
      "rating": 2.0,
      "verified": true,
      "author": "Jim C.",
      "helpful_votes": 0,
      "publication_date": 20191224
    },
    {
      "title": "You have to train your dog to respond to this whistle",
      "text": "This whistle is easy to use and my dog reacted to it with just a little practice. I use it with him a lot",
      "rating": 5.0,
      "verified": true,
      "author": "ch",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "Two thumbs up!",
      "text": "Product came with detailed instructions on how to use product. Great bargain!",
      "rating": 5.0,
      "verified": true,
      "author": "Tabitha",
      "helpful_votes": 0,
      "publication_date": 20200730
    },
    {
      "title": "Disappointed.",
      "text": "At first, my dog looked at the source of the whistle's sound, but now she totally ignores it. $40 thrown away.",
      "rating": 3.0,
      "verified": true,
      "author": "Fred G",
      "helpful_votes": 0,
      "publication_date": 20190322
    },
    {
      "title": "Craftsmanship and Performance",
      "text": "This item is used by professional trainers. The different pitch settings allow the user to train the dog for different commands. Well worth the cost. Shipping from manufacture. Quality craftsmanship. Recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "WAYNE LUNDGREN",
      "helpful_votes": 0,
      "publication_date": 20200212
    },
    {
      "title": "It is truly silent the dog and cat come running ...",
      "text": "It is truly silent the dog and cat come running and I need to unscrew 5 turns for me to hear it",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20170930
    },
    {
      "title": "Nice while it lasted.",
      "text": "Very nice whistle. Only had it a week before my grandkids came over. Now its missing. Unsure how it got off its lanyard... Pretty sure I will not reorder.",
      "rating": 5.0,
      "verified": true,
      "author": "John Reynolds",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "Far from pleased",
      "text": "Instructions for adjusting the whistle suck!!! But hey, my dog responds to it.",
      "rating": 3.0,
      "verified": true,
      "author": "Michael Vaughn",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "Not effective.",
      "text": "The whistle has not been at all effective with our dog. Even in the same room he does not respond to it. However, he is 13 1/2 yrs old.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200820
    },
    {
      "title": "Four Stars",
      "text": "I like the whistle, but it's not silent uness I'm doing something wrong. It does work.",
      "rating": 4.0,
      "verified": true,
      "author": "chindi",
      "helpful_votes": 0,
      "publication_date": 20170302
    },
    {
      "title": "Not magic",
      "text": "If you think this will shut a dog up your wrong this is a training device",
      "rating": 5.0,
      "verified": true,
      "author": "J. Einhorn",
      "helpful_votes": 0,
      "publication_date": 20191013
    },
    {
      "title": ":)",
      "text": "Works perfect, also got some dogs to stop and stair at me xD",
      "rating": 5.0,
      "verified": true,
      "author": "David Alexander Evon",
      "helpful_votes": 0,
      "publication_date": 20160413
    },
    {
      "title": "works well",
      "text": "This whistle works great in helping with a nearby, but not next-door, barking dog.",
      "rating": 5.0,
      "verified": true,
      "author": "Ann L.",
      "helpful_votes": 0,
      "publication_date": 20191019
    },
    {
      "title": "Pretty close to magic!",
      "text": "With proper training, my dog comes running to this whistle. It is audible to human ears and dog ears. When my dog is sniffing something, he can’t hear my voice calling him. But, he always hears this whistle. I’m impressed! Don’t forget, positive reinforcement training is necessary develop the recall!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201213
    },
    {
      "title": "Love it",
      "text": "My pup hears it well. I can hear it too but I can see how it would be silent for some. The sound is so high my dad cannot hear this octave. I put in on a necklace and use it to call my puppy to me from anywhere in our yard",
      "rating": 5.0,
      "verified": true,
      "author": "Danika Bueno",
      "helpful_votes": 0,
      "publication_date": 20201114
    },
    {
      "title": "Nix Dog Whistle, Use For Own Personal Safety",
      "text": "Bought as distraction when dog barks. While all of the four whistle levels initially caught our dog's attention, repeated whistles weren't effective. Thus the low value for money rating. In any case, can always use as a personal safety whistle since it's lightweight & can be hung from a lanyard.",
      "rating": 2.0,
      "verified": true,
      "author": "#TryAnythingOnce",
      "helpful_votes": 0,
      "publication_date": 20201127
    },
    {
      "title": "Great quality",
      "text": "This is a great whistle and very effective when done right in conjunction with training. I live in a busy neighborhood with a lot of dogs and love that I can use this without turning peoples heads.",
      "rating": 5.0,
      "verified": true,
      "author": "peter goldman",
      "helpful_votes": 0,
      "publication_date": 20201027
    },
    {
      "title": "I thought I was buying the best and it would be lasting 👎",
      "text": "Bought whistle used on one occasion reinserted the whistle portion in the case and am unable to now separate the two. Tried everything but they are firmly wedged together. It doesn't make sense because the case has two slots for expansion and contraction. I thought I was buying the best and it would be lasting 👎",
      "rating": 1.0,
      "verified": false,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20171217
    },
    {
      "title": "One Star",
      "text": "ok do not know if it works since only dogs can hear it!",
      "rating": 1.0,
      "verified": false,
      "author": "AEL",
      "helpful_votes": 0,
      "publication_date": 20160727
    }
  ],
  "product_meta": {
    "title": "Acme Dog Whistle 535 - Silent",
    "description": "They say every dog will respond to this whistle with adjustable frequency to enable teaching of a variety of commands. Invented by Acme in 1935. The Modern, improved whistle is the perfect dog training whistle for Town or Country, close or distance work. Adjustable frequency range Tuned to your dog's hearing.|n||n|Many animals react differently to different whistles, each has different hearing abilities, but most animals hear quite clearly frequencies that defeat the human ear. The Acme Silent Dog Whistle produces ultra high frequencies in the range of 5800Hz. to 12400Hz. Used for training dolphins and killer whales at Sea World it is also famous for its effects on cats, horses, mice and even bats! Place your pet within the vicinity of your computer speakers and click on the small maroon button(on the top of this text). Yes, you can't hear very much, but how is your pet responding?|n||n|The whistle is effective up to two miles (3 Km) subject to weather|n|conditions, and the abilities of the dog and the trainer. \n\n HISTORY Up until the 1930s, dog whistles had been non-specialist whistles - almost anything that made a sound was used. But in 1935 the invention of the Acme Silent Dog Whistle, another world first, with it's highly tuned and adjustable frequency range (from 5400Hz. to 12800Hz) armed the world's dog trainers with what still remains their most effective way of communicating with their dogs.|n||n|Medium sized. Ultra sonic tone.|n|The picture shows the whistle on one end of the chain and the whistle cover on the other end. \n\n Approx. Dimensions 3\" long and 1/4\" diameter.",
    "rating": 4,
    "feature_bullets": [
      "Acme Dog Whistle 535 - Silent",
      "Adjustable frequency range tuned to your pet's hearing",
      "Silent Dog Whistle Ultra High Tone - approx. 3\" long and 1/4\" diameter",
      "Effective up to 2 miles (3 Km) subject to weather conditions and abilities of dog and trainer",
      "The picture shows the whistle on one end of the chain and the whistle cover on the other end"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "4 x 2 x 1 inches; 0.81 Ounces",
      "Date First Available": "June 30, 2015",
      "Manufacturer": "Acme Whistles",
      "ASIN": "B010O0B3N8",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Dogs",
      "Dog Whistles",
      "Sports & Outdoors",
      "Pet Supplies",
      "Training & Behavior Aids"
    ],
    "price": 25.72
  }
}