{
  "website_summaries": [
    {
      "verdict": "Easy-to-operate boot dryer with four posts, but it has an expensive price tag.",
      "pros": [
        "Effective boot dryer that ships with four drying posts to handle multiple garments at once",
        "Also has extension tubes for taller items",
        "Runs quieter than you'd expect for such a large unit",
        "Very easy to operate with a dial",
        "Can run with or without heat added"
      ],
      "cons": [
        "Takes up a lot of floor space",
        "Would be nice if it ran a little hotter"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "DRIES it ALL",
      "text": "Great Value, heat or no heat at a flip of a switch. Temperature is limited to prevent damage to leather or synthetic fabrics and preventing damage to the heater itself (which is what happened to my last two boot dryers) The timer is as simple as a twist of a dial. The 4 posts can accommodate two pairs of boots or gloves, even a helmet! Loving it and using it for hiking, work boots, football gear, snowboarding/snowshoeing... Etc. Great buy, no negatives yet!",
      "rating": 5.0,
      "verified": true,
      "author": "Greg Robins",
      "helpful_votes": 73,
      "publication_date": 20161211
    },
    {
      "title": "Love this!",
      "text": "Love this!!! Completely worth every penny. My husband work outside all day long in Michigan so the spring and fall rains and the snowy winters are rough on his shoes and boots. Going to work with wet boots or trying to hurry and blow dry in the morning was just not working. This dries his shoes and boots within 30min and I LOVE the auto shut off feature! He turns it on real quick in the mornings to get them warm. He has used this every day for the past month. It’s perfect!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Kara Bowers",
      "helpful_votes": 30,
      "publication_date": 20180129
    },
    {
      "title": "Doesn't dry - which is its only job!",
      "text": "Simply put it doesn't work well. I've had wet bike shoes that required 4 entire timer cycles on this thing, even with the \"heat\" on (the heat does virtually nothing). They probably would have dried as fast without this thing. I also own a Peet boot dryer which works extremely well - one cycle and the shoes are dry. Forget this thing - it's just a cheap piece of plastic with a weak blower/heater and spend the extra $20 on the Peet. You won't regret it.",
      "rating": 1.0,
      "verified": true,
      "author": "Richard Bullotta",
      "helpful_votes": 16,
      "publication_date": 20190104
    },
    {
      "title": "Don’t waste your time or money!",
      "text": "Does not compare to the Peet boot dryer! This one shuts off completely when timer runs out! A better design in my opinion, would give the option of at least keeping the fan on after the heat turns off automatically. This does not dry saturated work boots in the longest setting which is 3 hours. And it’s incredibly NOISY! My husband kept turning the volume of the tv up to compete with the noise fro This machine. Don’t bother with this boot dryer! Stick with a Peet!",
      "rating": 1.0,
      "verified": true,
      "author": "A. Head",
      "helpful_votes": 7,
      "publication_date": 20190219
    },
    {
      "title": "Not for heavy duty boots",
      "text": "My husband is a mechanic, i ordered this based off of all the great reviews. I have to say i was highly disappointed in its lack of ability to dry anything other then gloves. It waa nicely packed and all the pieces were there. Shipping arrived on time.",
      "rating": 2.0,
      "verified": true,
      "author": "jared",
      "helpful_votes": 12,
      "publication_date": 20180206
    },
    {
      "title": "Boy am i glad i bought this!",
      "text": "Super happy with this dryer. I have it plugged in right by the door so as soon as I come in, i can put my boots on it. I've been using it daily for my work and winter boots. Both are waterproof, meaning all my foot sweat gets trapped inside. Super gross but now I have the solution! Works great and I'd recommend it. My only complaint is the dial is a bit difficult to turn (perhaps by design) my 5yr old likes to put his boots on it too, but can't work the dial.",
      "rating": 4.0,
      "verified": true,
      "author": "Jimmy pop",
      "helpful_votes": 10,
      "publication_date": 20180203
    },
    {
      "title": "Wouldn't be without it.",
      "text": "We live in the pacific northwest, and this DryGuy is like a member of our family. I'd be lost without it! We use it for so many things: boots, shoes, gloves, fabric bags... the list goes on. Living here, it seems like everything is wet from the months of November to April. Wet shoes after a rainy run go directly to the dryer. Half the time we go skiing it's raining - wet gloves and boot insulation go on the dryer after a wet day. My kids use fabric lunchboxes and I wash them every so often - and dry them on this dryer. Anything \"weird' shaped that's wet can go on this dryer. I love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Trista O",
      "helpful_votes": 7,
      "publication_date": 20180623
    },
    {
      "title": "I've used the DryGuy DX to dry boots, bike ...",
      "text": "Update January 2019: I'm going into my fourth year of owning this dryer and it has been a little work-horse. It is so convenient and still works very well. If it ever stops working or if I manage to break it I will absolutely be getting another one! I've used the DryGuy DX to dry boots, bike shoes and gloves so far and it has worked very well. It is far more convenient than trying to use a hair dryer and more effective and efficient than a clothes dryer. It seems well built and I hope to get many years of occasional use out of it.",
      "rating": 5.0,
      "verified": true,
      "author": "W. MitchellTop Contributor: Pets",
      "helpful_votes": 13,
      "publication_date": 20160713
    },
    {
      "title": "Almost zero airflow or heat",
      "text": "Does a really poor job of drying anything. There is almost zero airflow coming from this thing and the heat setting is a joke. I tried to dry my kids damp shoes (from morning dew playing soccer) and a full cycle didn't do anything. I even covered up on pair of the dryer stacks to try and get more airflow out of the other two and it was barely noticeable. A waste of money and poor product design/engineering, returning it ASAP.",
      "rating": 1.0,
      "verified": true,
      "author": "Renata M",
      "helpful_votes": 3,
      "publication_date": 20200919
    },
    {
      "title": "Nice dryer, but noisier than expected.",
      "text": "Not as quiet as it is stated to be, but has worked great. The timer dial is really stiff and difficult to turn, but once on, it does dry out my boots and gloves within the hour. Great multiday ski trips. Before this, I would always tend to have damp boots and gloves the next morning. Now I put them on this for a few minutes before putting them on and you have nice warm boots and gloves.",
      "rating": 4.0,
      "verified": true,
      "author": "KevinTop Contributor: Snowboarding",
      "helpful_votes": 7,
      "publication_date": 20180124
    },
    {
      "title": "Absolutely Terrible/Update",
      "text": "Absolutely terrible, 30 day return is a joke unless you plan to use it all the time. Went to actually use it besides the test run I did when I bought it, won't turn on.. nothing, feels like the dial is broke. Update. Contacted the company about issue, comes with 1 year factory warranty. Company asked a few questions and replaced the unit, thank you.",
      "rating": 4.0,
      "verified": true,
      "author": "Fitty",
      "helpful_votes": 2,
      "publication_date": 20201005
    },
    {
      "title": "Highly recommend!",
      "text": "Love, love, love this boot dryer! I was hesitant to spend this much for a boot dryer but I needed it for my daughters hockey equipment and really needed something heavy duty and needed the timer function. I am SO glad that I spent the money on this, it has been wonderful. I use it almost daily and it dries everything really well, no smells and I love that I don't have to remember to take things off the dryer. The timer will automatically shut off and I don't have to worry about taking things off right away or remembering to turn it off. I would highly recommend this dryer!",
      "rating": 5.0,
      "verified": true,
      "author": "Anna",
      "helpful_votes": 2,
      "publication_date": 20181212
    },
    {
      "title": "Worth the money",
      "text": "I have had several boot dryers over the years. None seem to really last or dry quickly. This one however is great. I see why it was $80. Because it works well and fast. I wear Redwing logger boots for work. Thick leather and soles. I work outside a lot, in rain and snow. The dryer got them dry within an hour from being completely soaked with the heater on. Heater off, took about 2 hours. Either way. This thing is well worth the money. Buy it. You will NOT be disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "Ben",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "5 months of use and the heat is out...still blows cold air",
      "text": "The heat function was the desirable feature , but the durability apparently there because after 5 months of use the heat is out. I took a infrared thermometer reading on it after 8 min.; stone cold air blowing 55 degrees. I'm going to call the company and I will write back on how that goes.",
      "rating": 1.0,
      "verified": true,
      "author": "Leo Juarez",
      "helpful_votes": 6,
      "publication_date": 20181109
    },
    {
      "title": "Can't live without it during ski season",
      "text": "This is a great dryer for just about anyone who has to deal with wet boots, shoes, and gloves, whether from sweat or inclement weather. I have found myself using this year round- for drying ski boots and ski gloves in the winter and for drying sweaty moto boots and gloves in the warmer months. Moves a lot of air and the heat function is a nice bonus if you need to dry quickly. The timer means just turn on and forget about it. It's very compact and very light, which means you can find a home for it wherever, so it doesn't need to be relegated to a garage or laundry room. Well worth the price point of $70.",
      "rating": 5.0,
      "verified": true,
      "author": "Van",
      "helpful_votes": 0,
      "publication_date": 20200203
    },
    {
      "title": "Can't Live Without This",
      "text": "Wet Footwear/Gloves = Cold Feet/Hands = No Fun. This is an essential tool to keep gloves and footwear dry when you will be recreating in the cold for multiple days. I have a big family and require two hotel rooms, I have one if these for each room. It easily dries the wettest items in 90 mins. It is a must especially for young children to keep their hands and feet as warm as possible. For home use I put one in the garage and pop the Mucks or Sorels on them occasionally just to keep the moisture out of the boots. It is compact and light...I love this product.",
      "rating": 5.0,
      "verified": true,
      "author": "IowaDrifter",
      "helpful_votes": 0,
      "publication_date": 20200331
    },
    {
      "title": "Get Shoes or Boots DRY in 3 Hours or LESS!",
      "text": "I had checked out numerous other shoe/boot dryers and decided on this one. It's BETTER than the description says. Your boots and shoes can be DRY in 3 hours or less. It's a great thing particularly here in Los Angeles where we don't have clothing that is really suited for rain. I had waterproof shoes and boots that were not 100% waterproof and this dryer got them DRY. My husband loves this machine because he gardens a lot and now he can have his shoes 100% dry the same day. PLUS this machine is *really* quiet.",
      "rating": 5.0,
      "verified": true,
      "author": "Stevie Wilson",
      "helpful_votes": 0,
      "publication_date": 20190307
    },
    {
      "title": "Great winter investment",
      "text": "This is one of the best purchases you can make if you live in a wet/snowy area. I do alot a exercise outside in winter conditions,.so alot of wet shoes, sweaty gloves and hats that need to dry out so I can use them again. The ability to set a timer,.so I am not worried about this just running and starting a fire is awesome. I have used it with and without heat and depending what your drying they both work great. Since it has 4 posts I can dry to things at once. I may have to purchase another one since I keep finding my husband drying his stuff.",
      "rating": 5.0,
      "verified": true,
      "author": "Prime addict",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "2 years and still love it.",
      "text": "We’ve used this for two years now and wouldn’t be without it. We initially got it because we had a similar boot dryer at one of the ambulance station where I worked and I wanted to have one so I could dry my sweat filled boots after work no matter which station I worked. My kids instantly took a love for having their shoes on the dryer and my then 4 year old quickly learned how to operate this boot dryer. It’s not uncommon for my kids to be using this anytime it is wet outside and I’m now considering a second so I have one for traveling with my new position.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 0,
      "publication_date": 20200426
    },
    {
      "title": "Blind buy",
      "text": "You hear all about people going on blind dates and meeting the love of their life. Well, this product was a blind buy, and I fell in love immediately. I saw this product on the main page and felt intrigued by the other reviews and description about it, so I decided, \"why not give it a try\" and boy, there's no looking back. I have been nothing short of satisfied and so have my boots and garments! This thing is a life saver! I love it!",
      "rating": 4.0,
      "verified": true,
      "author": "Tom",
      "helpful_votes": 0,
      "publication_date": 20190604
    },
    {
      "title": "Awesome solution to dry my shoes",
      "text": "Awesome solution to dry my shoes. I run my running and tennis shoes through the washer now and then to cleans them up. My dryer was not a good solution with the shoes tumbeling about and causing it to stop drying because of the imbalance inside so this little dryer is a great solution. Takes two cycles of 3 hours and about an additional 1-2 hours to fully dry a really wet shoe but the wind up timer is set it and forget it. I wish they had a timer that lasted for 6 hours so I could just let it go overnight when my shoes are super wet. It does get the job done neverthless. Recomend it",
      "rating": 5.0,
      "verified": true,
      "author": "Online Purchaser",
      "helpful_votes": 0,
      "publication_date": 20180629
    },
    {
      "title": "and powders may help mask the stink to a certain extent the only way to make sure that your gloves stay fresh all the time is to",
      "text": "I use it for my boxing gloves and I must say that I am the only person in my boxing gym whose gloves don't stink. Although sprays, glove dogs, and powders may help mask the stink to a certain extent the only way to make sure that your gloves stay fresh all the time is to dry them out with this bad boy after every use. Convenient timer is the cherry on top. If you use athletic gloves (boxing, MMA, muy thai, skiing, hockey, etc...) this product is a must!",
      "rating": 5.0,
      "verified": true,
      "author": "Gibby",
      "helpful_votes": 4,
      "publication_date": 20170419
    },
    {
      "title": "Solid build and easy to use",
      "text": "I went too long without a boot dryer that I may be biased in my review, but I have no serious complaints about this. The true test is that my wife complains far less about the smell of my feet. I call that a win. My only critique is that the boot arms could either clip on or fit tighter to the base--they fall off often when removing my boots but is, by no means, a deterrent from recommendation. Overall, it does what it promises and is an overall good product",
      "rating": 5.0,
      "verified": true,
      "author": "S.M. Weiss",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "Dry Guy Forced Air Boot Dryer, Used/very good from Amazon Warehouse",
      "text": "Bought this to dry my True hockey skates. Completely dry without heat and with a very quiet fan in 1-3 hours. A man's size skate fits over 2 air columns at once so it is really efficient drying one pair of skates at a time. There is a heat setting, but it wasn't necessary. Beats the old shoe tree style boot dryer I used for my ski boots on the past didn't work overnight.",
      "rating": 5.0,
      "verified": true,
      "author": "Snowstorm",
      "helpful_votes": 0,
      "publication_date": 20201011
    },
    {
      "title": "More Useful Than Expected",
      "text": "Several months ago I got this boot dryer for my husband's big, heavy work boots because they were always getting wet and were slow to dry. He thought it was a good idea, but wasn't sure if he'd really want to use it. Turns out he loves it! He puts his boots on it every time they're damp and loves putting on nice dry boots. Even if they're sopping wet, the dryer gets them totally dry in one treatment. His boots are high quality leather and he wasn't sure that all the drying would be good for the leather, but the dryer is gentle and isn't over-drying it at all. This was a great purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190402
    },
    {
      "title": "Does not dry boots",
      "text": "This dryer does not dry my boots at all. Not even the slightest bit. I will run the dryer for a full 180 minute cycle, with heat, and the boots will still be as wet as they were before being put on the dryer. There is no difference between using this dryer and simply letting the boots air dry. Unfortunately, I tried giving it the benefit of the doubt for about a month too long and I went past the return window. I wouldn’t recommend this dryer to anyone.",
      "rating": 1.0,
      "verified": true,
      "author": "Brian Alden",
      "helpful_votes": 0,
      "publication_date": 20200412
    },
    {
      "title": "Reasonably quiet, and it works",
      "text": "I previously had an Iris-brand shoe/boot dryer that worked, but it developed a loud screech that I could not fix, so I ditched it. This DryGuy DX works very well, holding both my boots and gloves, and, while not silent, is not overly noisy. The heat is gentle but it is there and the items dry out and are pleasantly warm after a while. The timer knob is easy to use. I like the extensions for boots with the \"anvil\" that fits into the toe of shoes/boots to hold them properly.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Lionel",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "Hazardous toxic unsafe fumes released. Heated plastic is not good. Cheap chinese toxic garbage.",
      "text": "Warning!!!! When you turn it on it releases a horrible toxic odor. Almost unusable. If you have a dryer in your home, you would be better off throwing your shoes in the home laundry dryer rather than buying this toxic machine which heats up plastic and other toxic volatile compounds. I have a headache from just a few seconds of breathing in these terrible fumes. This should be banned from sale for health hazard reasons. Amazon. Take this item off for safety reasons.",
      "rating": 1.0,
      "verified": true,
      "author": "F.",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "-Dries my wader boots and waders nicely Cons: -Hmmm",
      "text": "Pros: -Dries my wader boots and waders nicely Cons: -Hmmm....had to think. Maybe the controls on top for easier visibility when I have boots and waders but this is nit picking. This is a great tool and we use it to dry our boots, wading boots, wader, and gloves from fly fishing, hunting, and playing. Overall: -Fantastic product that I wish I had many years ago. Well worth the purchase. Misc: -I wear size 14 boots, my wife size 6, and my son is a toddler. It accommodates all. Great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20170106
    },
    {
      "title": "Hockey moms/wives you need this!!",
      "text": "This thing is fantastic! My husband’s hockey equipment is gross! We keep it in the garage so in the summer it’s humid and in the winter it’s cold so getting things dry is a challenge. Since we have bought this his glives and skates get fully dry in 1 or 2 cycles. At first the garage smelled awful while it was in use but the more he uses it, the less it smells. I think it is slowing bacterial growth because it fully dry! Wish we had this years ago!!",
      "rating": 5.0,
      "verified": true,
      "author": "Jen B",
      "helpful_votes": 0,
      "publication_date": 20200328
    },
    {
      "title": "Game changer for sport parents",
      "text": "I keep asking myself, \"Why did I not know about this product sooner?\". Perfect for wet sneakers and soccer cleats. This model has 4 shoe posts and can be run with the heater on or off. There is a timer dial that allows it to run up to 180 minutes. I would recommend not running it in the house if your shoes already have that soccer cleat stink to them. I have used it on freshly washed sneakers and with the heat function on were dried in one 180 minute cycle. Damp soccer cleats took about an hour. Highly recommend for outdoor sports people.",
      "rating": 5.0,
      "verified": true,
      "author": "CarmelbytheCornfield",
      "helpful_votes": 0,
      "publication_date": 20190720
    },
    {
      "title": "Great ptoduct",
      "text": "This product has been a life saver... or should I say nose saver... possibly even a sanity saver. My husband has the most rancid smelling work boots. This thing not only has forced him to remove his stank boots in the garage to place them on the dryer where it is screwed into the wall... but it’s also improved the smell of his feet because it’s helped with the stank boot issue.",
      "rating": 5.0,
      "verified": true,
      "author": "kaitlynn",
      "helpful_votes": 0,
      "publication_date": 20200721
    },
    {
      "title": "Grateful",
      "text": "My husband requested this specifically for a Christmas gift- I was skeptical but got it to make him happy. He works 12-16 hours per shift (no lie) six days a week all while wearing leather police boots. For years he has come home with sweaty, stinky, and pruny-skinned feet. He works so much that the boots could never get dry. Almost giving up hope of ever having normal feet and dry boots, he stumbled across this miracle device online. This dryer WORKS. He just told me tonight that because of this dryer he doesn’t have to spray his shoes with odor remover every night. Thank you to whoever invented this- my husband can feel normal and comfortable again!",
      "rating": 5.0,
      "verified": true,
      "author": "Sara in Texas",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "Fantastic!",
      "text": "OMG! I wish I had bought this sooner! We live in Michigan and have 2 small boys. Mittens, gloves, boots... always wet after playing in the snow. I used to spend so much time washing and drying mittens and gloves inside out to get rid of the smell (boys are stinky) and then trying to get them turned right side out again - such a pain! Now we come in and throw everything on the dryer - its FANTASTIC!!!!!! I wasn't crazy about spending $48 on a glove dryer, but now knowing how awesome and convenient it is I am recommending it to everyone!",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly G",
      "helpful_votes": 0,
      "publication_date": 20180211
    },
    {
      "title": "Works good for surf booties/gloves",
      "text": "I bought this to dry out my surf booties and gloves in my garage. It definitely does the job but it takes a while, usually I have to run it for 4-6 hours with the heat on to fully dry them. That’s usually after I let them drip dry for 8-12 hours. I wish the fan was a little more powerful, then it would probably dry a lot faster. Overall, this is a good product and it keeps my gloves and booties from stinking up the house, which my wife certainly appreciates :)",
      "rating": 4.0,
      "verified": true,
      "author": "Adam Dude",
      "helpful_votes": 2,
      "publication_date": 20180402
    },
    {
      "title": "Love the forced air + timer",
      "text": "Biggest complaint I've had about boot driers is that the push of air is \"meh\"-at-best and I have to remember to turn them off (which I normally forget). This boot drier made up for all those shortfalls plus more! We've used this dryer about 5x times this season along with our other boot / glove driers and this one is by far our favorite. The fact that I can cool two pairs vs one on our other driers increases my appreciation of this exponentially! Needless to say, I am looking to purchase another to replace our existing dryers.",
      "rating": 5.0,
      "verified": true,
      "author": "Minneapolis Jon",
      "helpful_votes": 0,
      "publication_date": 20190205
    },
    {
      "title": "Not just for boots!",
      "text": "We use this DryGuy for several things! Ski boots, soccer cleats, wet sneakers, but mainly hockey skates and hockey gloves! After every practice my kid sticks her gloves and skates on the posts, turns the dial and that's it! (We only use the heat function on ski boots liners). The room temp dry is good enough to keep her gloves and my husband's hockey gloves from smelling horrendous. I can't give a review as to the longevity yet, but I'll follow up.",
      "rating": 5.0,
      "verified": true,
      "author": "K.A.",
      "helpful_votes": 0,
      "publication_date": 20190929
    },
    {
      "title": "I like the design but they won’t work",
      "text": "This is the second one of these I’ve purchased. Used a couple weeks and then it won’t turn on. I like the design but they won’t work",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 8,
      "publication_date": 20180216
    },
    {
      "title": "Great for drying your boots or shoes",
      "text": "Bought this for my sister husband for the winter. His work boots were wet and they were looking for something to dry his boots. My sister husband, loves it and it dries his work boots and his work boots are dry and ready for the next day. This is also great for kids shoes too. If you have kids that love to play in the puddle with their shoes, comes in handy to dry their shoes too.",
      "rating": 5.0,
      "verified": true,
      "author": "Alaskan Girl",
      "helpful_votes": 0,
      "publication_date": 20200501
    },
    {
      "title": "Skiers and snowboarders may not love this, but it works well.",
      "text": "This dryer works well and consistently. Timer works as well. I'm giving it 3 stars because your have to buy the extensions separately, and with all 4 extensions on you cannot put 4 ski boots on the dryer, they're simply not spaced out enough. You have to take the liners out of all 4 boots and just dry the liners. This is ok my realistically a lot of us are lazy, or just don't care to remove liners. 4 snowboard boots fit but it feels like the dryer is going to crack and break. Other than that one complaint I would recommend this dryer.",
      "rating": 3.0,
      "verified": true,
      "author": "Blake Miller",
      "helpful_votes": 0,
      "publication_date": 20190516
    },
    {
      "title": "No idea how this got 4.5 stars. It's BAD",
      "text": "No idea how this got 4.5 stars. Literally the cheapest crappiest thing I have ever bought. If I bothered to keep it longer then I did I'm sure the cheap plastic would break. The blowers never get warm. The blowers BARELY trickle any air out. Is super loud for a product that does literally next to nothing. Shoes not dry after 120 min timer shut off. Don't buy this product.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200208
    },
    {
      "title": "Exactly same as Little Hotties product",
      "text": "I bought this Dry Guy product and the competitive Little Hotties product (from Costco) at the exact same time, set them up at the exact same time, and I am here to report to you that they are exactly the same product. Just different colors. Even the instruction manuals read nearly identical language. And the little hotties product cost less than half as much at Costco. Just FYI",
      "rating": 4.0,
      "verified": true,
      "author": "Kite Mom",
      "helpful_votes": 0,
      "publication_date": 20191213
    },
    {
      "title": "doesn't seem to work",
      "text": "Hardly blows any air and certainly doesn't get to advertised 105* I would say it doesn't even get warm. Most likely returning.",
      "rating": 1.0,
      "verified": true,
      "author": "mamahoney",
      "helpful_votes": 3,
      "publication_date": 20190120
    },
    {
      "title": "Tips over with ski boots",
      "text": "I wish the timer was either longer or a chosen option. I used this skiing for the winter and on really wet/snowy days, I needed more than 3 hours to completely dry my boots and mittens out. I also wish the base was heavier, because my ski boots usually tip it over. I just prop it against the wall instead. I love throwing my boxing gloves on there though! Keep in mind, it is pretty loud, so I usually shut mine in my closet.",
      "rating": 4.0,
      "verified": true,
      "author": "KS",
      "helpful_votes": 0,
      "publication_date": 20190505
    },
    {
      "title": "Great boot & glove dryer",
      "text": "I bought this after a review in Dirt Rag mountain bike magazine. With all of the wet snow on the East Coast this thing has been invaluable. Just put on boots & gloves, turn the timer and come back for them the next day. It's solid enough to take a pair of Muck Boots over both the boot & glove dryer posts, really happy with this!",
      "rating": 5.0,
      "verified": true,
      "author": "CalDrummer",
      "helpful_votes": 2,
      "publication_date": 20180308
    },
    {
      "title": "Doesn't Work",
      "text": "This Boot warmer gets great reviews, so I am hoping it is just a defective one. I am returning it for another. There was no heat. Gloves were left on it overnight and were ice cold and damp the next day. Feels more like an air conditioner than heater. The return process is super easy. Hopefully once the new one arrives we can update our rating to more stars! ** Update- second one was slightly warmer, but not warm enough to actually dry boots or gloves from a wet, New England snow storm. Returning the second one as well.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Love my dryguy foot and glove station.",
      "text": "Love my dryguy foot and glove station. Perfect when I go skiing I can dry both my boots and gloves. This “forced air” dryer is smaller than the original plug in but stated that it dries twice as fast for 3 hours instead of the 6-8 hours. It does crest noise, about the same as an efficient small personal space heater. I was skeptical with my gloves getting all the way dry in 3 hours but it’s worked eveytime so far.",
      "rating": 4.0,
      "verified": true,
      "author": "Polar Queen",
      "helpful_votes": 0,
      "publication_date": 20190302
    },
    {
      "title": "Awesome for ski boots and mittens",
      "text": "This is our second purchase of a Dry Guy. The first one we ordered is still going strong, but we needed a second one so everyone's boots and mitts can get dry after a day on the slopes. In the summer we use it for neoprene kayaking booties, and it's even better for that than for ski boots. By the time we get home from paddling the sun has usually set and the neoprene doesn't dry overnight. Great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Daisy",
      "helpful_votes": 0,
      "publication_date": 20190405
    },
    {
      "title": "Needs to be outside on porch",
      "text": "Works as expected but needs to be on porch it does stink up a room with sweaty boots in summer and also heats up room.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael ",
      "helpful_votes": 0,
      "publication_date": 20200924
    },
    {
      "title": "Timer makes this dryer safe and effective - excellent for boots or boxing gloves",
      "text": "This dryer is excellent for boots or sneakers but I use mine for my boxing gloves and Martial Arts equipment to keep it fresh and not smelling. It is perfect because of the timer. This makes it same so that it shuts off after a certain period of time. No worries about fire hazard. Worth the purchase for boots, sneakers or boxing equipment!",
      "rating": 5.0,
      "verified": true,
      "author": "Mmagirl ",
      "helpful_votes": 0,
      "publication_date": 20191110
    },
    {
      "title": "Works well",
      "text": "Works well. It is being used to dry figure skates between uses. I like it's options for heat and time. It has more options than other brands. I hate the smell, but I'm pretty sure that's due to the figure skates themselves. If you're using it for sports equipment, put it somewhere that you won't have to smell it, especially 4 months into the season.",
      "rating": 4.0,
      "verified": true,
      "author": "J. L. Fitch",
      "helpful_votes": 0,
      "publication_date": 20180715
    },
    {
      "title": "Great Dryer",
      "text": "Every day, my kids would return home from school with soaking wet mittens/gloves. They would still be wet the next day. Conventional clothes dryers don't do a great job drying the inside. Enter the Dry Guy Dryer. We use it every day in the winter and it works great. Gloves dry in about 45-60 minutes. We have recommended it to several friends.",
      "rating": 5.0,
      "verified": true,
      "author": "jfuerst",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "Dries your shoes and 2 prs at that!",
      "text": "You can choose heat or no heat, up to 180 minutes at a time, knob to turn for timer is kinda hard to turn, but all else is good to go for drying your shoes! its a bit noisy but it IS forced air. Ours is stashed away in the laundry room (because of the noise it makes). I've put other shoe dryers out in the garage where temps get very cold and it makes the dryers break down sooner...will be keeping this one IN the house",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190607
    },
    {
      "title": "Worth it!",
      "text": "It works! My husband works in all the weather and is an avid outdoorsman so his boots often came home soaked. This thing is awesome and easy to use you just set the shoes boots or whatever (we’ve used it on regular tennis shoes, work boots and mucks) turn the dial and walk away. We have not had to dry anything twice yet so far the 3 hour setting takes care of it.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 2,
      "publication_date": 20180107
    },
    {
      "title": "Should have bought one years ago!",
      "text": "This boot/shoe dryer is awesome. So far, I have used it for running shoes, cycling shoes, and wetsuit boots. I set the timer to 3 hours and the foot wear is completely dry! I should have bought one years ago. I look forward to using it this winter with winter boots and mittens. The dryer is a pretty compact size and it's fairly quiet.",
      "rating": 5.0,
      "verified": true,
      "author": "Sherry",
      "helpful_votes": 0,
      "publication_date": 20190926
    },
    {
      "title": "Dries SCUBA gear Quickly",
      "text": "Dried my scuba gloves and boots quickly. After 2 days of letting my gear dry in my living room to no avail. This device dried my gear in a couple of hours. The Heat/no-heat setting was great. It has an timed dry function. Now, my gear will not smell nasty anymore.",
      "rating": 5.0,
      "verified": true,
      "author": "Diving Nut",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "The most important thing is to take away the smell of the wet feet",
      "text": "I bought this for my husband for a present for his boots shoes gloves works wonderful I don't know how we lived without it doesn't make the feet stink anymore very sturdy very easy to use recommend anybody that has what shoes and a regular basis or gloves or even just once in a while to try it",
      "rating": 5.0,
      "verified": true,
      "author": "cara",
      "helpful_votes": 0,
      "publication_date": 20200428
    },
    {
      "title": "works ok",
      "text": "my peet dryer finally died and I was looking for a replacement...this one was $38 cheaper , so I thought I would try it....doesn't dry as well as the PEET does... I should have spent the extra money on the PEET",
      "rating": 3.0,
      "verified": true,
      "author": "vchateau",
      "helpful_votes": 0,
      "publication_date": 20190909
    },
    {
      "title": "Great for Kickboxing Gloves",
      "text": "Bought this to dry my kickboxing gloves. I've been through two pairs already- I'm on #3 and #4 - bought two to alternate. I have this boot dryer hooked up next to my door. I put my sweaty gloves on it when I get home and turn it on (loveee that it turns off automatically). It's eliminated the odor issues I was having. I sprayed an older pair with Lysol and stuck them on here. It helped, but they couldn't be saved. Can't wait to use it on my wet boots & gloves next winter too. Multipurpose!",
      "rating": 5.0,
      "verified": true,
      "author": "Dianna",
      "helpful_votes": 0,
      "publication_date": 20180505
    },
    {
      "title": "Great product",
      "text": "Man this thing is great! I washed some shoes (Salomon Speed Assaults) and put them on this and they dried in a few hours. There was no waiting for air drying (day or more depending on conditions), or putting CN them in the cloths dryer (risking the glue delaminating). I will updated when I use them to dry my structure boots (old warington pros)",
      "rating": 5.0,
      "verified": true,
      "author": "David McPartland",
      "helpful_votes": 0,
      "publication_date": 20200522
    },
    {
      "title": "Works efficiently",
      "text": "This boot dryer works well to dry boots, shoes, socks and gloves or mittens. The timer function is great, it shuts off at the time you set. Regularly drying boots and shoes keeps them from getting odiferous so this is good year round, especially if you’re active and since feet sweat. It has a sound but it’s not loud or irritating, imo. I highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "LindySu",
      "helpful_votes": 0,
      "publication_date": 20190427
    },
    {
      "title": "Best purchase ever!!",
      "text": "We live in the woods with two young boys, every time they come in something is wet, sneakers, boots, gloves, hats. I have even washed muddy snow boots in the sink and put them on this thing to dry. It works fast, faster than leaving things next to a wood stove! I wish I had discovered this dryer years ago.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Orrall",
      "helpful_votes": 2,
      "publication_date": 20180116
    },
    {
      "title": "A must for skiers/snowboarders, good value",
      "text": "Have used this 3 times for my son's gear after Friday night school ski trips. It did take several hours to completely dry snowboarding boots and ski gloves but I used it without the heat function. It is great to be able to start actively drying the boots and gloves as soon as he gets home. Runs quietly. Highly recommend",
      "rating": 5.0,
      "verified": true,
      "author": "SMK",
      "helpful_votes": 0,
      "publication_date": 20200122
    },
    {
      "title": "Very handy drying tool",
      "text": "Great use for when the grandkids come over . They enjoy being outdoors so that means damp boots and gloves at times. Very handy tool to dry these items. Never liked using my clothes dryer for this anyway. Also used this to pre warm boots before going outside. Don’t know why we didn’t have one before this . I would recommend getting one if you like dry boots and gloves",
      "rating": 5.0,
      "verified": true,
      "author": "Stacy L",
      "helpful_votes": 0,
      "publication_date": 20200311
    },
    {
      "title": "Awesome",
      "text": "I live in northern Minnesota, so it snows a lot. I bought this for my husband who works outside every day. He LOVES it. He’s had it a week now and I swear he says something every day he uses it. It dries our boots and mittens so quickly! It’s not as big and bulky as I thought it would be either. We live in 750sqft so we are picky with “big” items we buy. This is a keeper! Do yourself a favor and get one.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah C.",
      "helpful_votes": 0,
      "publication_date": 20181223
    },
    {
      "title": "Does not dry gloves well.",
      "text": "I was really hopefully about this dryer as my son comes home with wet gloves every day from school. We put these on the dryer and turn on the three hour timer with heat. Unfortunately the fingertips of the gloves remain wet and I have to do this cycle at least two or three times before they are semi dry. Was not the fix for wet gloves that I was hoping for. Quite disappointed, especially with the price of the unit.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200125
    },
    {
      "title": "Worth every penny, we love ours",
      "text": "I wear my boots quite a few hours a day, and wether they get wet, or get sweaty this thing has held up nice and still works after running it nightly for a full timers worth. Very happy with this purchase. We run a rescue, I’m a hunter, so this gets a lot of use around our farm.",
      "rating": 5.0,
      "verified": true,
      "author": "Ojyllek",
      "helpful_votes": 0,
      "publication_date": 20200420
    },
    {
      "title": "Great dryer - let’s you play more",
      "text": "Super impressed by this product. Went biking this morning and got soaked! Shoes dripping and same with my gloves. Put it on this - for two cycles- and they are completely dry. Last time it took about a week to dry out. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Scooter",
      "helpful_votes": 0,
      "publication_date": 20200717
    },
    {
      "title": "Dryer for gloves and hats",
      "text": "This dryer works great for gloves and hats. Thinsulate (sp) gloves are hard to dry and this makes it easier. Able to dry gloves at night and used again the next day. Also, can be used to warm the gloves and shoes too. Very quiet machine.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Reed",
      "helpful_votes": 0,
      "publication_date": 20190409
    },
    {
      "title": "Not robust, timer broke after 3 uses!",
      "text": "Was a fan for the first 3 uses, the time stopped working so it cannot be left alone and has to be manually turned off now. Obviously not a robustly build unit (made in china), although the price point should provide a more robust design. Look elsewhere.",
      "rating": 2.0,
      "verified": true,
      "author": "David S.",
      "helpful_votes": 3,
      "publication_date": 20171024
    },
    {
      "title": "Drys my boots",
      "text": "This is great- has heat and a timer- (I wish it was just a button to push and set on instead of an old wind up timer) But- this baby does the job- I added something weighted on the bottom to stabilize it.",
      "rating": 5.0,
      "verified": true,
      "author": "RB",
      "helpful_votes": 0,
      "publication_date": 20201017
    },
    {
      "title": "Yes for drying... no for heating",
      "text": "Not a terrible product. I misunderstood boot dryer to, in effect, mean boot warmer, but it does not warm at all. I do feel it dries we’ll, no issues with smell or noise. You can definitely hear the fan running but it’s a soft sound that fades into the background. Works on dish gloves too.",
      "rating": 3.0,
      "verified": true,
      "author": "Rebecca Medicine Eagle",
      "helpful_votes": 0,
      "publication_date": 20200216
    },
    {
      "title": "Works Great!",
      "text": "This is a must for a snowboarder who isn’t looking for his boots to be smelling like Hot Garbage by the mid season. Works great using just the right amount of heat versus air. Drys my boots easily along with my gloves too and timer is great addition. Set it and walk away, come and pick up your dry boots later. Worth the investment!! I even picked up the helmet attachment and again works great. If you’re looking for portable this isn’t it. But it’s small enough that it doesn’t take up too much space either. Great buy and great dryer!",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan R.",
      "helpful_votes": 0,
      "publication_date": 20190127
    },
    {
      "title": "The Heat Feature Works Fast",
      "text": "I did purchase an additional pair of extender poles to be able to dry 2 pair of below the knee boots together and it works great. It’s also great on cold mornings to heat shoes up before putting them on to take the chill off your feet. Dries boots and shoes quickly,.",
      "rating": 5.0,
      "verified": true,
      "author": "Tallgirl",
      "helpful_votes": 0,
      "publication_date": 20200219
    },
    {
      "title": "Owned 2 Years - Heavy Use",
      "text": "I never write reviews, but this time I have to. I've been putting my boys' gloves in this every winter night for two and a half years. I LOVE this dryer! The timer goes to 3 hours, which is long enough to completely dry gloves 95%of the time. We use it every day in the winter, usually over night, and I've never had one problem. So many products these days are barely good enough, this dryer is actually a quality item.",
      "rating": 5.0,
      "verified": true,
      "author": "Cloudybrewer",
      "helpful_votes": 0,
      "publication_date": 20200515
    },
    {
      "title": "Nice dryer",
      "text": "I like this dryer a lot, I wear logger style boots for work and it is nice having the extra tall sleeves that you can use on two of the dryers. It isn't very loud, just sounds like a small exhaust fan or something when it is running. Does a great job of drying boots and gloves, and the option of having heat while you are drying is a nice feature to have.",
      "rating": 5.0,
      "verified": true,
      "author": "Honeybadger",
      "helpful_votes": 0,
      "publication_date": 20190318
    },
    {
      "title": "Not too bulky and works well",
      "text": "It is very convenient to be able to dry 2 pairs at a time and that it has a timer. As far as the heat goes its not very warm.",
      "rating": 3.0,
      "verified": true,
      "author": "Elena C.",
      "helpful_votes": 0,
      "publication_date": 20200908
    },
    {
      "title": "Does a good job of drying.",
      "text": "I have used this several times now, and I like it. It does a fairly good job of drying my gloves, but it does take quite a while. I haven't actually timed it, but it probably takes about an hour. The fan is pretty noisy. I first used the unit in the kitchen but had to take it downstairs because the sound bothered my wife while she was trying to watch TV in the living room. (There is no wall separating our kitchen and living room.) I do think that it is somewhat overpriced which is why I gave it only 4 stars. All things considered, I would buy it again.",
      "rating": 4.0,
      "verified": true,
      "author": "New Jersey",
      "helpful_votes": 0,
      "publication_date": 20180219
    },
    {
      "title": "If you’re on the fence Just buy it",
      "text": "I have water boots, and regular Georgia boot chemical boots that get wet sometimes. This thing dries them right out with the 3 hour timer. Even dries my gloves. Never have to go past 3 hours but do just to warm up the boots before I put my feet in for another day/night of work. You won’t be disappointed, I’d even consider having 2!",
      "rating": 5.0,
      "verified": true,
      "author": "EvilRooster",
      "helpful_votes": 0,
      "publication_date": 20190522
    },
    {
      "title": "Works great",
      "text": "This dryer works to keep boots dry. My husband is a meter reader and walks many miles a day in all weather. He absolutely loves that his shoes and boots can be dry each day. No more athletes foot for him 😃. I hope this dryer lasts a long time. We use it daily.",
      "rating": 5.0,
      "verified": true,
      "author": "Meri Bea",
      "helpful_votes": 0,
      "publication_date": 20200211
    },
    {
      "title": "Timer broke on the first use",
      "text": "I turned the timer on as instruction said and it broke on the first use. The unit still works but the timer dial no longer walks back to 0 mark by itself (the unit still auto shutoff but the plastic dial is stuck at the set time.) Unfortunately i am over the 30-day return window. Not sure why there are so many 5-star rating on this.",
      "rating": 1.0,
      "verified": true,
      "author": "Chun-Tao Li",
      "helpful_votes": 0,
      "publication_date": 20200829
    },
    {
      "title": "Does the job.",
      "text": "This thing works surprisingly well! i am a cyclist, and used this all winter long to dry out my gloves and boots after fat biking. It doesn't move much air, but it does the job. The attachments for it (notably the helmet) are somewhat useless, so don't bother, but as it is it's great for drying out your boots/gloves or just warming them up before heading out to shovel.",
      "rating": 4.0,
      "verified": true,
      "author": "Seventh-777Top Contributor: Cycling",
      "helpful_votes": 2,
      "publication_date": 20170410
    },
    {
      "title": "Pretty Quiet",
      "text": "Lots of boot dryers get reviews that they are super loud...this one is not bad. We have in our living room. My husband's work boots get fairly soaked during bad weather, being on construction sites. This dryer works efficiently and actually kind of warms up the room around it. I like how it has 4 posts so you can either do 2 pairs of shoes or gloves at a time. Not sure why \"scent\" is included in the rating, it does smell like new plastic when you first use but nothing weird or chemical-y.",
      "rating": 5.0,
      "verified": true,
      "author": "Joanna Cahn",
      "helpful_votes": 0,
      "publication_date": 20200129
    },
    {
      "title": "Great for drying and smell",
      "text": "Purchased for my husbands work boots because they seemed to stay wet and stinky. Love this model because It has a timer and can use hot or cold air. I also love the ability to have extensions for larger boots. It has dried and eliminated odor in the set timer just fine when used daily. I put some old sneakers on it and sure enough after a few days no more smell.",
      "rating": 5.0,
      "verified": true,
      "author": "Moriko",
      "helpful_votes": 0,
      "publication_date": 20190114
    },
    {
      "title": "It's Worth It!",
      "text": "I was going to make my own dryer when I came across this. I use it for my wetsuit gloves and boots. I wish I had this years ago. It takes about 2 1/2 to 3 hours to dry the boots and gloves after I rinse them and let drip for about 20 minutes. This is compared to days trying to get them to dry by hanging them upside down. Note: The inside will be dry before the outside.",
      "rating": 5.0,
      "verified": true,
      "author": "Rick",
      "helpful_votes": 0,
      "publication_date": 20180105
    },
    {
      "title": "How did I live without one",
      "text": "Great product for a Minnesota winter with 2 kids! My kids always come home from school with wet boots and gloves. I have used this daily since it arrived. Dries quickly damp boots about an hour, soaked around 3 hours. Unit is pretty quiet too. Definitely recommend for anyone with kids",
      "rating": 5.0,
      "verified": true,
      "author": "mblackwell",
      "helpful_votes": 0,
      "publication_date": 20191210
    },
    {
      "title": "What sure about this purchase...but WOW!",
      "text": "This thing is just as stated! Our daughter plays soccer and the wet cleats and goalie gloves were rank!! This dryer did the trick! We do not use the heat just the air and the timer is great! Small footprint! We even thought about gifting one of these to a friend of ours with twins who play soccer!",
      "rating": 5.0,
      "verified": true,
      "author": "Terry Mullican",
      "helpful_votes": 0,
      "publication_date": 20191013
    },
    {
      "title": "No more wet shoes!",
      "text": "My girlfriend and I work outdoors. The DryGuy makes sure everything is dry by the next work day. Construction workers, letter carriers, or anyone running around when it’s wet out can’t go wrong here. The hot air option helps dry shoes quicker, but the device never feels hot. I never felt unsafe about leaving it running while I slept. Great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Jonathan",
      "helpful_votes": 0,
      "publication_date": 20190207
    },
    {
      "title": "Happy so far",
      "text": "Have had a week. Using for hockey equipment. It has helped reduce odors. Wish I had thought to buy one years ago. Slightly loud, but I don't care - I care that it dries out the equipment, and it does that. The timer is nice to have. Haven't used the heater part of it (except once accidentally). I'd recommend a boot dryer for any hockey player, and I'm quite happy with this one so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190615
    },
    {
      "title": "Works..",
      "text": "It is doing the job of drying my work boots. I have noticed you must put something on all the \"tubes\" or little air will circulate in the items on only two \"tubes\". You should be able to adjust this, in my opinion.",
      "rating": 4.0,
      "verified": true,
      "author": "Hemmi06",
      "helpful_votes": 2,
      "publication_date": 20180416
    },
    {
      "title": "No more smelly shoes and sneakers - all athletes/recreationalists with stinky footwear should get this product",
      "text": "Can not believe I have lived without this until now. It dries my running shoes so quickly. My shoes don't give off a musty or mildew damp smell and shoes seem to last longer because they don't stay soggy. This has cut the turnaround time to wearing shoes after a very rainy or snowy day. Does not use much electricity to operate and is small enough to fit in a closet, under a sink or in a larger size drawer. This is such a great idea. I am only asking myself why I didn't get one sooner.",
      "rating": 5.0,
      "verified": true,
      "author": "Miranda H.",
      "helpful_votes": 0,
      "publication_date": 20170127
    },
    {
      "title": "I really like the fact that this has a timer on it",
      "text": "I really like the fact that this has a timer on it. I have a different brand that doesn't dry anywhere close to the level this thing does. It is big enough for all my hunting gear and small enough for the kids ski boots and gloves. Having the timer on it means I can leave it on and walk away knowing it will shut off and not burn anything up while I am away. I would recommend this product to anyone looking for a convenient way of drying bots and or gloves.",
      "rating": 5.0,
      "verified": true,
      "author": "Lee",
      "helpful_votes": 0,
      "publication_date": 20161227
    },
    {
      "title": "great for shoes & gloves",
      "text": "Originally bought for wet golf shoes, however we use it much more for my son's cleats & goalie gloves, since he has practice every day. This is an essential if you live in a rainy climate, especially if you have any kids involved in outdoor sports getting wet (baseball, soccer, golf, lacrosse, football, etc)",
      "rating": 5.0,
      "verified": true,
      "author": "Kitrina K.",
      "helpful_votes": 0,
      "publication_date": 20190608
    },
    {
      "title": "Works Great, Not loud!",
      "text": "Bought this for my husband's work boots, gloves, etc. It is perfect. Researched lots of different options and the reviews were good and we like that this dryer uses forced air. It dries completely, it is not loud. It takes up little space. We have very pleased, so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Amy Fenton",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "Does not get as warm as I had hoped",
      "text": "Does not get very warm. After the the timer has shut the unit off my leather snow boots still feel damp on the outside. Also the dial is difficult for me to turn when my hands are cold and wet from being outside in the snow. I find this dryer just okay. I bought it because it had good ratings and because it also dries your gloves at the same time.",
      "rating": 3.0,
      "verified": true,
      "author": "E. Comella",
      "helpful_votes": 0,
      "publication_date": 20190110
    },
    {
      "title": "It really works",
      "text": "Living in Maine with a son that spends more time outside than in, a gloves and boots dryer is a necessity. This is easy to use and effective. Blows warm air inside gloves and shoes/boots. The timer is handy so no worries about leaving it on all night",
      "rating": 5.0,
      "verified": true,
      "author": "Rose",
      "helpful_votes": 0,
      "publication_date": 20181126
    },
    {
      "title": "No pieces to put boots on, defeats the purpose",
      "text": "Not sure if i was supposed to order the pieces for boots to go on seperate..... mine didnt come with them, so what good is a boot dryer without the pieces for the boots. I opened it up today for first time and am disappointed to say the least. A boot dryer I can't dry boots on. Came with the extending rods but no pieces for the boots to go on.",
      "rating": 1.0,
      "verified": true,
      "author": "brad",
      "helpful_votes": 0,
      "publication_date": 20190107
    },
    {
      "title": "I love how this works",
      "text": "It works as it should for what I need it to dry. it's not something that I would leave alone in a room running on a timer. However, it's definitely something that will soon be tested during winter.",
      "rating": 5.0,
      "verified": true,
      "author": "SpaceMonkey27Sirmud",
      "helpful_votes": 0,
      "publication_date": 20201008
    },
    {
      "title": "Works OK",
      "text": "I am a bit disappointed with this dryer. I was really looking forward to it drying my kids boots and gloves. It will dry the immediate area but not the tips of the gloves or the toes of the boots. I’m not sure that I will be keeping this.",
      "rating": 3.0,
      "verified": true,
      "author": "Courtney",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "Worth it",
      "text": "Use this and the extension kit to dry my waders boots shoes etc. works great. This is my second one. Gave my first one to my brother and needed another one. First one is years old, used every day and still works great.",
      "rating": 5.0,
      "verified": true,
      "author": "CC",
      "helpful_votes": 0,
      "publication_date": 20201015
    }
  ],
  "product_meta": {
    "title": "DryGuy DX Forced Air Boot Dryer and Garment Dryer",
    "description": "The DryGuy DX Forced Air Boot Dryer and Garment Dryer can dry two pairs of boots, shoes, or gloves in 1 to 2 hours. From rain soaked soccer cleats to sweaty ski or hunting boots to soggy gloves filled with melting snow, the DryGuy DX dries a variety of garments so you can start the day with dry, comfortable hands and feet. The DryGuy DX Forced Air Boot Dryer and Garment Dryer utilizes gentle forced air and 105-degree heat to quickly remove moisture and help prevent the growth of fungus and bacteria that cause odors and deteriorates footwear over time. It includes two removable extension tubes for drying boots up to 16 inches tall. The DryGuy DX Forced Air Boot Dryer and Garment Dryer is completely safe to use and will not shrink, warp, or otherwise harm delicate garments and custom fit liners. Dimensions: 12 inches deep x 7.5 inches high x 15 inches wide; 6-foot power cord; 1 year warranty",
    "rating": 4.6,
    "feature_bullets": [
      "Forced-air boot, glove, and garment dryer works on four garments simultaneously",
      "Includes two removable extension tubes for use with boots up to 16 inches tall; whisper-quiet rotary blower; 3 hour timer; heat or no-heat switch",
      "Heats to 105-degrees F. (40.5-degrees C.); safe for liners, clothes, and boots; includes two removable extension tubes for use with boots up to 16 inches tall",
      "Helps eliminate odors and reduce the growth of bacteria and mold; dries most clothes in 1-2 hours; Power - 120 Volt AC Household Outlet",
      "Dimensions: 12 inches deep x 7.5 inches high x 15 inches wide; 6-foot power cord; 1 year warranty"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "18 x 12 x 12 inches; 5 Pounds",
      "Item model number": "2129",
      "Department": "Womens",
      "Date First Available": "June 23, 2015",
      "Manufacturer": "DryGuy",
      "ASIN": "B010A5J5FU",
      "Domestic Shipping": "Item can be shipped within U.S.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S.",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Shoe Care & Accessories",
      "Shoe Dryers",
      "Sports & Outdoors",
      "Shoe, Jewelry & Watch Accessories",
      "Clothing, Shoes & Jewelry"
    ],
    "price": 54.0
  }
}