{
  "website_summaries": [
    {
      "verdict": "A good basic lock that is inexpensive and designed to fit nearly any firearm.",
      "pros": [
        "Meets some state safety code requirements",
        "15-inch cable",
        "Solid and strong quality",
        "Simple and easier to use than trigger locks",
        "Available for purchase in a 3-pack, keyed alike",
        "A good value on an effective gun lock"
      ],
      "cons": [
        "This lock is not weatherproof and should not be used outside for an extended period of time"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great for motorcycle helmet lock.",
      "text": "I personally do not like to leave my possessions unattended for public to potentially tamper with or take. My motorcycle compartment is very tiny so I needed something small but dependable. I’ve looked for helmet locks and nothing quite fit what I was looking. This gun lock does the job perfectly. It tucks away nicely and when needed I loop through the rear peg set and the helmet. I know it’s not fullproof but it’s definitely better then leaving just sitting there or having to carry it everywhere.",
      "rating": 5.0,
      "verified": true,
      "author": "Dan Gona",
      "helpful_votes": 10,
      "publication_date": 20190617
    },
    {
      "title": "It's a great product for Cali folk",
      "text": "These are great for locking up your firearm while transferring it from range to home or anywhere else. It can lock up pistols, semi-auto rifles, lever action rifles, and bolt-action rifles. Not only are these cheap and sturdy locks but they are also California DOJ approved. That last part really only pertains to Becerra's fantasy on how to run things in California, but hey when you're a man working for the CA DOJ I'm sure it takes a lot to get you off. But anyway I really like this product and I will recommend this to any of my buddies that are looking to stay safe with their firearms!",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew Sullivan",
      "helpful_votes": 5,
      "publication_date": 20200223
    },
    {
      "title": "This is perfect for locking the handles of the cabinet in my ...",
      "text": "This is perfect for locking the handles of the cabinet in my classroom so that I can carry personal items such as my purse and prescription medicine into school. I originally ordered a shorter version not realizing that the cable isn't as long as I thought (the part that goes into the lock is included in the length), and while they refunded my money, Amazon did not require me to send it back. I'm not sure what I'm going to do with the short extra cable, but I'm sure I can find some use for it.",
      "rating": 5.0,
      "verified": true,
      "author": "centrefrenchie",
      "helpful_votes": 14,
      "publication_date": 20170606
    },
    {
      "title": "French door lock",
      "text": "I did not buy the gun lock to lock a gun. I purchased it to lock my French door. The lock on my door is too difficult for me to turn. Therefore, I was not locking the door. This cable gun lock goes around both handles without a lot of slack. With some practice, I will be able to lock the door faster.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Kovalcin",
      "helpful_votes": 6,
      "publication_date": 20190711
    },
    {
      "title": "Nice product. Used as Motorcycle helmet lock.",
      "text": "I use this a motorcycle helmet lock. I loop it through my facemask and strap it to my passenger peg. Works great! Its not going to prevent anyone with a small bolt cutter but will definitely stop someone with bare hands trying to snatch my Helmet. As for its main purpose for a gun lock my guess is it would definitely do the job. Not the highest quality but will get it done!",
      "rating": 5.0,
      "verified": true,
      "author": "Ragz",
      "helpful_votes": 6,
      "publication_date": 20180530
    },
    {
      "title": "Different Keys Will Open",
      "text": "I bought this because it is California compliant, so hopefully not as easy to force open. The 15\" cable makes it easy to fit my shotgun. I would have given 5 stars, but I tried the keys that came with the lock that shipped with one of my other shotguns and it opened this lock. This keys for this lock would not open my other lock where the other keys came from. I'm not sure what to think other than this might be a little to easy to open with any cable lock key.",
      "rating": 4.0,
      "verified": true,
      "author": "ReviewLP",
      "helpful_votes": 2,
      "publication_date": 20200223
    },
    {
      "title": "but it was a great value and I needed one to purchase a used ...",
      "text": "Honestly haven't really used this to lock up my rifle much, but it was a great value and I needed one to purchase a used rifle that didn't have one included (damn California laws). My rifle is in my gun safe with others, but didn't want to go thru the hassle of proving I had a safe at home so just brought this in with a receipt and was good to go! Seems decent quality (equal to most other locks that come standard from factory). For the price, no complaints. Just a basic cheap lock that hits the standard for CA DOJ approval.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Walery",
      "helpful_votes": 4,
      "publication_date": 20170809
    },
    {
      "title": "As advertised",
      "text": "Works great for my application. Needed a way to lock the pins on my adjustable hitch and this fit the bill nicely. Had to ever so slightly enlarge the holes in the pins but then it worked perfect. Would have been a little better without the plastic coating on the cable as it want to shred during install and removal. Other than that it's very nice and easy to lock and unlock too.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20190929
    },
    {
      "title": "Great Cable Lock!",
      "text": "Love that these are California compliant!!! Good to use with just about any handgun, revolver, and shotgun. It also fists most AR's as well. It is strong and solid quality.",
      "rating": 5.0,
      "verified": true,
      "author": "fenderguy91r",
      "helpful_votes": 5,
      "publication_date": 20180201
    },
    {
      "title": "Junk. Very flimsy, key often jams, flimsy & finicky locking mechanism.",
      "text": "I wanted to like this. But it is very, very poorly, cheaply made. Very flimsy, the locking mechanism is extremely finicky and key often jams and doesnt reliably open it and it doesnt lock reliably. Spent minutes trying to get it to open or lock sometimes, so its useless and totally a waste of money, time and trust. Better off just buying a padlock and small metal chain or something from hardware store.",
      "rating": 1.0,
      "verified": true,
      "author": "A user",
      "helpful_votes": 0,
      "publication_date": 20200512
    },
    {
      "title": "Great Versatile Lock",
      "text": "Used it to lock cabinets in my classroom and plan on using it for it's original purpose during the summer. Will update on the latter then, but for now it works for what I needed it for. The locking it is not the easiest but definitely not hard just worth mentioning, maybe it will get easier the longer I use it. Definitely recommend, especially at the price.",
      "rating": 4.0,
      "verified": true,
      "author": "texlady88",
      "helpful_votes": 0,
      "publication_date": 20200204
    },
    {
      "title": "Required by law, works as advertised.",
      "text": "Not much to say other than the fact that this is a must have if you're trying to add an extra layer of security to your firearms from unwanted users. It's also required by CA law for transport. They work and are relatively low cost enough that it's worth having one for every firearm you own. Has a protective sleeve on the cable that keeps it from marring/damaging your guns.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda & Farzad",
      "helpful_votes": 0,
      "publication_date": 20200427
    },
    {
      "title": "Great lock for keeping guns secure!",
      "text": "Bought this to prevent my roommates from messing with my guns. Works great! The construction seems sturdy enough to prevent someone from messing with it, but I'm sure they could remove the lock if they tried hard enough. Works well enough to be a great deterrent though. Would recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "BFunPhoto",
      "helpful_votes": 0,
      "publication_date": 20190910
    },
    {
      "title": "Used As Helmet Lock",
      "text": "I used this to lock my motorcycle helmet to my passenger pegs. It doesn't seem very durable but it does the job just fine. As most people will say, it keeps honest people honest but if someone REALLY wanted my sweaty used helmet, they can destroy the lock with minimal effort and walk off with it. For my needs though, it works fine",
      "rating": 4.0,
      "verified": true,
      "author": "Jeff.M",
      "helpful_votes": 0,
      "publication_date": 20191103
    },
    {
      "title": "Tricky to use the key.",
      "text": "The key sticks and is hard to operate the lock. There's a trick, which getting it to the right spot and pushing it in. Still, I was annoyed to be fighting the lock (again) out on the shooting range. I would not recommend it.",
      "rating": 3.0,
      "verified": true,
      "author": "Becky D Mc",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "Great for keeping unwanted guests out of the pool!",
      "text": "I purchased these for the gate around our above ground pool we installed. I placed one lock at the top and one at the bottom of the gate, and they work great for my purpose! Easy to unlock, and hold up well outside all summer long!",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew Reynolds",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "Great Lock w/ 2 keys",
      "text": "I actually use this lock to hold my motorcycle helmet onto the railing of the back seat of my motorcycle. I like that the lock is small enough to fit in my motorcycle jacket pocket but long enough to fit through the chin part of my motorcycle helmet and still be secured to my motorcycle.",
      "rating": 5.0,
      "verified": true,
      "author": "Collins",
      "helpful_votes": 0,
      "publication_date": 20190605
    },
    {
      "title": "I like it",
      "text": "I have had this briefcase for just over a year, everything is holding up perfectly. This briefcase has the pockets I need, and space for my laptop as well. I've spilled coffee in it and it cleaned up fine, plus it seems to be fairly waterproof. I would recommend this case.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191116
    },
    {
      "title": "Helmet Lock",
      "text": "Works well to secure my helmet to my bike. 2 keys are provided, the locking mechanism doesn't allow you to insert the cable in without having the key in the unlocked position, would've been nice.",
      "rating": 5.0,
      "verified": true,
      "author": "Ernest",
      "helpful_votes": 0,
      "publication_date": 20200223
    },
    {
      "title": "Good for the price",
      "text": "Let's be real. Almost no one uses these things, but all handguns that are sold by dealers...even used ones...are required by law to have a lock with them. These are great for that. They're inexpensive. They do work. They're secure. Perfect for staying in compliance with the law.",
      "rating": 5.0,
      "verified": true,
      "author": "Some Guy",
      "helpful_votes": 0,
      "publication_date": 20190820
    },
    {
      "title": "It's a gun lock.",
      "text": "I took it out of the package and it didn't fall apart. So I guess that's a plus. I noticed no major defects during the two minutes it took me to remove from the package, install on a 10/22 and put away. I didn't give it a yank or anything but felt solid enough.",
      "rating": 5.0,
      "verified": true,
      "author": "Sean Jones",
      "helpful_votes": 0,
      "publication_date": 20181127
    },
    {
      "title": "Lock",
      "text": "I finally just used this product for vacation in the Caribbean to lock the closet door!!!! It is a little difficult to turn the key but overall very happy with the piece of mind it gave us ! So much we recommended it to everyone traveling over seas",
      "rating": 5.0,
      "verified": true,
      "author": "L",
      "helpful_votes": 0,
      "publication_date": 20191021
    },
    {
      "title": "WORKED GREAT, GREAT VALUE",
      "text": "USED IT FOR A SKI LOCK ON A POST CHRISTMAS TRIP. HAD IT DROP SHIPPED TO THE FIRST PLACE I STAYED. Have a safe for all my guns so I didn't need it for my guns.",
      "rating": 5.0,
      "verified": true,
      "author": "SUNnFUN",
      "helpful_votes": 0,
      "publication_date": 20200202
    },
    {
      "title": "Safety first",
      "text": "Like that it looks and fits my 9mm P320 well. Sturdy. Only complaint if I have one is that you have to leave the key in to lock and unlock. I would still highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Brent Bowser",
      "helpful_votes": 0,
      "publication_date": 20200615
    },
    {
      "title": "Kinda cheap and crappy",
      "text": "I am not impressed with this. I know it was cheap so you get what you pay for but when securing a $200 helmet to my bike, I need something better. I'll probably go with the $20 one. The lock and key to this one is really cheap. It's not easy to lock or unlock and really just sucks overall.",
      "rating": 2.0,
      "verified": true,
      "author": "LJ",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "Works as described",
      "text": "Came as described. Cost was reasonable. Not to sure at how well cables will hold up to someone that really wants to use the weapon.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181223
    },
    {
      "title": "Gun Locks - buy them and use them",
      "text": "They secure the upper and lower of my AR-15 assembled. They work with my Mossberg 500. My state doesn't require them, but they're cheap. If you don't have a safe (or one nobody else knows the combo for) shouldn't you be using them?",
      "rating": 5.0,
      "verified": true,
      "author": "Todd Fulkerson",
      "helpful_votes": 0,
      "publication_date": 20180407
    },
    {
      "title": "Great Product - Its A LOCK",
      "text": "Great Product - Its A LOCK... Use It For A Handgun Case - Please Note : DO NOT USE THIS AS THE ONLY FORM OF SECURITY! This Lock Is Just To Lock The Case - Then I Have Another Lock On The Handgun & Stored In Safe Especially Around A Family & Kids",
      "rating": 5.0,
      "verified": true,
      "author": "Muzza",
      "helpful_votes": 0,
      "publication_date": 20170529
    },
    {
      "title": "Great for train travel",
      "text": "I just came back from Europe and used the train quite a lot. This came in handy. I felt a lot safer locking my luggage to the storage rack.",
      "rating": 4.0,
      "verified": true,
      "author": "Rod Lee",
      "helpful_votes": 0,
      "publication_date": 20190705
    },
    {
      "title": "Does the Trick!",
      "text": "Used on our refrigerator to keep person with special needs from eating everything in it overnight. Key can be somewhat tricky but it works well.",
      "rating": 4.0,
      "verified": true,
      "author": "Trudy Diane",
      "helpful_votes": 0,
      "publication_date": 20190220
    },
    {
      "title": "Quality product",
      "text": "An alternative to the traditional trigger locks these are simple to use and some say more effective than the traditional trigger locks. Quality constructed and works great on pistols and rifles.",
      "rating": 5.0,
      "verified": true,
      "author": "David S.",
      "helpful_votes": 0,
      "publication_date": 20180815
    },
    {
      "title": "VERY BAD",
      "text": "Just as the reviews said, it worked twice then could not get key in, then could not get out. Not worth even returning, just threw it away.",
      "rating": 1.0,
      "verified": true,
      "author": "Harry S.",
      "helpful_votes": 3,
      "publication_date": 20161001
    },
    {
      "title": "Good quick flexible lock",
      "text": "Lock works as intended. Perfect for locking your bike, cabinets etc. Easy to us and it comes with an extra key which i like. Great price too!",
      "rating": 5.0,
      "verified": true,
      "author": "The Pyners",
      "helpful_votes": 0,
      "publication_date": 20200229
    },
    {
      "title": "Multi purpose",
      "text": "Great alternative for a helmet lock on my motorcycle. It doubles as extra security when installed into the ABS disk holes and frame.",
      "rating": 5.0,
      "verified": true,
      "author": "Joel M.",
      "helpful_votes": 0,
      "publication_date": 20190506
    },
    {
      "title": "Works Great as a Lock for Anything!!",
      "text": "I don’t use this for a gun but for a lock on a cabinet that’s cabinet handles are spaced too far apart for a traditional lock to fit around. It works great. This is the second one I’ve purchased.",
      "rating": 5.0,
      "verified": true,
      "author": "Randa ",
      "helpful_votes": 0,
      "publication_date": 20200201
    },
    {
      "title": "Cheaply made & didn't work",
      "text": "This is so flimsy the key won't turn the lock without bending! Couldn't even get the lock open. Do not buy!",
      "rating": 1.0,
      "verified": true,
      "author": "Kathleen",
      "helpful_votes": 0,
      "publication_date": 20200829
    },
    {
      "title": "Perfect",
      "text": "Really like these. Would be nice if keyed-alike option existed for multiple item purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Buyer",
      "helpful_votes": 0,
      "publication_date": 20180712
    },
    {
      "title": "Fridge lock to keep teens from night snacking!",
      "text": "Perfect lock to keep my teenager out of the fridge in the middle of the night!",
      "rating": 5.0,
      "verified": true,
      "author": "Scott",
      "helpful_votes": 0,
      "publication_date": 20190615
    },
    {
      "title": "Perfect size for helmet",
      "text": "Bought this to lock my bike helmet and it's perfect. Recommend 👍",
      "rating": 5.0,
      "verified": true,
      "author": "Adam",
      "helpful_votes": 0,
      "publication_date": 20200224
    },
    {
      "title": "Great Helmet Lock",
      "text": "Using it to lock 2 helmets to a luggage rack on a motorcycle. Won't stop a determined thief but will definitely discourage the casual bad guy from swiping your gear",
      "rating": 5.0,
      "verified": true,
      "author": "Shady Esperanto",
      "helpful_votes": 0,
      "publication_date": 20190401
    },
    {
      "title": "Should have bought the 3 pack",
      "text": "I'm only giving this 4 stars because I should have bought the three pack that can all use the same key. If so, would have been 5 stars. I know, very picky.",
      "rating": 4.0,
      "verified": true,
      "author": "Eric",
      "helpful_votes": 0,
      "publication_date": 20180817
    },
    {
      "title": "It works.",
      "text": "Feel a whole lot better knowing that my Sig is safely guarded and stowed away. Gives me a piece of mind knowing my little one wont be able to accidentally discharge it.",
      "rating": 5.0,
      "verified": true,
      "author": "Don H",
      "helpful_votes": 0,
      "publication_date": 20181118
    },
    {
      "title": "Used for different prurpose",
      "text": "I actually ordered this to secure my truck racheting cargo bar.",
      "rating": 5.0,
      "verified": true,
      "author": "Vinny",
      "helpful_votes": 0,
      "publication_date": 20191031
    },
    {
      "title": "Good price and good locl",
      "text": "Good lock for the price. I use it to lock my helmet to my motorcycle.",
      "rating": 5.0,
      "verified": true,
      "author": "Bob M",
      "helpful_votes": 0,
      "publication_date": 20180429
    },
    {
      "title": "Good for two door closet",
      "text": "I use it for a two door closet. It’s a perfect fit for a six inch gap between two handles.",
      "rating": 5.0,
      "verified": true,
      "author": "Abhinav L.",
      "helpful_votes": 0,
      "publication_date": 20191130
    },
    {
      "title": "Good cheap lock.",
      "text": "Your typical cheap gun lock. does the job for my snub nose. Just waiting for my Pelican case to get here so I can see if it works great for the case. One thing I don't like is that the vinyl covering the cable is weak, my gun cut it up a little. not bad.",
      "rating": 5.0,
      "verified": true,
      "author": "Lunchbox005",
      "helpful_votes": 0,
      "publication_date": 20170402
    },
    {
      "title": "Great protection",
      "text": "Works good! I kinda wish the coating on the cable was a little stronger as there are some scuffs from putting it into and double wrapping it through the action. Still works as I wanted just to protect from anyone getting into it while traveling.",
      "rating": 5.0,
      "verified": true,
      "author": "bbo44",
      "helpful_votes": 0,
      "publication_date": 20170525
    },
    {
      "title": "very thin and cheap",
      "text": "you can cut through this with a small pair of wirecutters",
      "rating": 2.0,
      "verified": true,
      "author": "Alistair Zebulon",
      "helpful_votes": 0,
      "publication_date": 20190810
    },
    {
      "title": "Nice and secure!",
      "text": "I actually use this as an added lock for the French doors leading to my backyard when I go out of town.",
      "rating": 5.0,
      "verified": true,
      "author": "Banjo Rat",
      "helpful_votes": 0,
      "publication_date": 20200130
    },
    {
      "title": "Locked up!",
      "text": "Standard Lock that hooks up perfectly. All keys worked as designed.",
      "rating": 5.0,
      "verified": true,
      "author": "Ed",
      "helpful_votes": 0,
      "publication_date": 20200406
    },
    {
      "title": "Its alright",
      "text": "It's not as flexible as I would have hoped, not using it to lock firearms, though, I am using it to lock some wardrobe doors in my dorm room.",
      "rating": 4.0,
      "verified": true,
      "author": "Jamie",
      "helpful_votes": 0,
      "publication_date": 20180227
    },
    {
      "title": "Sturdy lock, smooth mechanism",
      "text": "Nice little lock, the cabling was stiffer than I’m accustomed to which made it a little harder to weave through but it seems sturdy and well built",
      "rating": 4.0,
      "verified": true,
      "author": "HiGravity",
      "helpful_votes": 0,
      "publication_date": 20180402
    },
    {
      "title": "CAN NOT OPEN IT",
      "text": "The item looks like a second-hand stuff, I tried so many times and can not open the lock, so disappointment.",
      "rating": 1.0,
      "verified": true,
      "author": "Ufish",
      "helpful_votes": 0,
      "publication_date": 20180818
    },
    {
      "title": "Long enough to lock up MTM ammo boxes. I'd ...",
      "text": "Long enough to lock up MTM ammo boxes. I'd wish they had thicker cables but to keep kids away they serve their purpose.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike Hunt",
      "helpful_votes": 0,
      "publication_date": 20171022
    },
    {
      "title": "Great lock!",
      "text": "Works perfectly, feels strong. I'd reccomend to anyone looking for a simple gun lock",
      "rating": 5.0,
      "verified": true,
      "author": "Matt",
      "helpful_votes": 0,
      "publication_date": 20180713
    },
    {
      "title": "Damn kids",
      "text": "Laugh all ya want this I used to lock my fridge cuz my kids are heathens",
      "rating": 5.0,
      "verified": true,
      "author": "chukroc",
      "helpful_votes": 0,
      "publication_date": 20181024
    },
    {
      "title": "As expected",
      "text": "Bought this to replace the one that came with the gun.",
      "rating": 5.0,
      "verified": true,
      "author": "Retrievers Rock",
      "helpful_votes": 0,
      "publication_date": 20181117
    },
    {
      "title": "Works ok.",
      "text": "The lock is difficult to operate sometimes. Not a smooth action on it. I used it to secure my helmet to my motorcycle.",
      "rating": 2.0,
      "verified": true,
      "author": "Seth G.",
      "helpful_votes": 0,
      "publication_date": 20180808
    },
    {
      "title": "Cheap but works",
      "text": "Cheap but works. Mine came with the plastic cover coating meled in a spot of the logo. And the keys are not very sophisticated or smooth. But keeps guns safe enought and legal.",
      "rating": 3.0,
      "verified": true,
      "author": "Sonny Cunningham",
      "helpful_votes": 0,
      "publication_date": 20200530
    },
    {
      "title": "Works.",
      "text": "Worked great to lock the action of my rifle and shotgun.",
      "rating": 5.0,
      "verified": true,
      "author": "Matt Durkin",
      "helpful_votes": 0,
      "publication_date": 20190215
    },
    {
      "title": "Secured lock that work great with Glock 19",
      "text": "Nice product. Lock very well and secured. I'm glad it's in black color not red.",
      "rating": 5.0,
      "verified": true,
      "author": "Bungheng",
      "helpful_votes": 0,
      "publication_date": 20180516
    },
    {
      "title": "Great look",
      "text": "I use it on my fridge in the garage. It keeps my teenage kids a way from it.",
      "rating": 5.0,
      "verified": true,
      "author": "MagMaciu",
      "helpful_votes": 0,
      "publication_date": 20190113
    },
    {
      "title": "Works well",
      "text": "Does exactly what it's supposed to. I have used it to lock an M4 carbine and it reaches through the chamber and magazine well with some slack to spare.",
      "rating": 5.0,
      "verified": true,
      "author": "B J",
      "helpful_votes": 0,
      "publication_date": 20160822
    },
    {
      "title": "The lock works great! The key turns smoothly",
      "text": "I did not actually purchase this for use as a gun lock. I am using it to secure a cabinet. The lock works great! The key turns smoothly. I am very pleased with the purchase and the price!",
      "rating": 5.0,
      "verified": true,
      "author": "Nikki Anderson",
      "helpful_votes": 0,
      "publication_date": 20160716
    },
    {
      "title": "Love!",
      "text": "These are perfect! They fit well around my cases and are long enough to wrap twice. Great material as well. Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "Faith Smith",
      "helpful_votes": 0,
      "publication_date": 20171101
    },
    {
      "title": "As advertised",
      "text": "As advertised. Someone could break this lock if they were determined enough, but works well as it was intended- as a deterrent.",
      "rating": 5.0,
      "verified": true,
      "author": "B. Rogers",
      "helpful_votes": 0,
      "publication_date": 20191012
    },
    {
      "title": "Low quality",
      "text": "Quality no good cable sticks on both of them. Would not recommend buying",
      "rating": 2.0,
      "verified": true,
      "author": "Amazing Customer",
      "helpful_votes": 0,
      "publication_date": 20180820
    },
    {
      "title": "Good product, decent build quality",
      "text": "Used this to mount something to a hitch and it's still there.",
      "rating": 5.0,
      "verified": true,
      "author": "Brock Schroeder",
      "helpful_votes": 0,
      "publication_date": 20190118
    },
    {
      "title": "Great lock!",
      "text": "This lock is perfect for putting through the handles of a storage cabinet. Easy to use and very sturdy. Solved my problem perfectly!",
      "rating": 5.0,
      "verified": true,
      "author": "Kathy Carlstrom",
      "helpful_votes": 0,
      "publication_date": 20190824
    },
    {
      "title": "Inexpensive but effective lock for basic protection",
      "text": "This is exactly what I needed - inexpensive but effective. Works flawlessly, no complaints! I would buy this model again in a heartbeat.",
      "rating": 5.0,
      "verified": true,
      "author": "Corey Ruth",
      "helpful_votes": 0,
      "publication_date": 20171103
    },
    {
      "title": "Motorcycle Helmet Lock",
      "text": "Perfect length for locking my full face helmet to the luggage rack on the back of my motorcycle.",
      "rating": 5.0,
      "verified": true,
      "author": "Kareem",
      "helpful_votes": 0,
      "publication_date": 20180921
    },
    {
      "title": "Great lock",
      "text": "This lock was just what I needed. Good value for the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190819
    },
    {
      "title": "Strong",
      "text": "Very sturdy and strong. Great for the price and would recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Trenton S.",
      "helpful_votes": 0,
      "publication_date": 20180312
    },
    {
      "title": "Nice lock",
      "text": "Worked as expected. The cable is plastic coated to provide ur firearm but the lock is a bit cheap. U have to turn the key to insert the cable which makes it a little hard while holding ur firearm.",
      "rating": 5.0,
      "verified": true,
      "author": "todd T",
      "helpful_votes": 0,
      "publication_date": 20170309
    },
    {
      "title": "Difficult to open",
      "text": "Very very hard to open. Key turn but lock won’t open. Threw it away",
      "rating": 1.0,
      "verified": true,
      "author": "Tyler H.",
      "helpful_votes": 0,
      "publication_date": 20180812
    },
    {
      "title": "Perfect for my Motorcycle Helmet",
      "text": "Perfect for my Motorcycle Helmet! 15\" is plenty, with room to spare.",
      "rating": 5.0,
      "verified": true,
      "author": "Ih8shopping",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "It works",
      "text": "Decent. Notice plastic coating around the cable starting to fray.",
      "rating": 4.0,
      "verified": true,
      "author": "J.J.",
      "helpful_votes": 0,
      "publication_date": 20160709
    },
    {
      "title": "Does what it needs to do",
      "text": "It works for CA gun owners. Other than that its meh..",
      "rating": 3.0,
      "verified": true,
      "author": "Jay Y.",
      "helpful_votes": 0,
      "publication_date": 20170927
    },
    {
      "title": "Five Stars",
      "text": "Sturdy gun lock for a pistol. Comes with two keys and is CA compliant.",
      "rating": 5.0,
      "verified": true,
      "author": "Jordan",
      "helpful_votes": 0,
      "publication_date": 20180213
    },
    {
      "title": "Five Stars",
      "text": "I bought 2 of these works great as motorcycle helmet locks.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe lehecka",
      "helpful_votes": 0,
      "publication_date": 20170821
    },
    {
      "title": "overall good",
      "text": "this is overall a good product. value for the money paid.",
      "rating": 4.0,
      "verified": true,
      "author": "Darshan",
      "helpful_votes": 0,
      "publication_date": 20190604
    },
    {
      "title": "Too short in length",
      "text": "Needs to be a little more generous on the length wise.",
      "rating": 1.0,
      "verified": true,
      "author": "C",
      "helpful_votes": 0,
      "publication_date": 20200530
    },
    {
      "title": "Works",
      "text": "Allowed me to leave scope on rifle and lock. Works like it should",
      "rating": 5.0,
      "verified": true,
      "author": "mat",
      "helpful_votes": 0,
      "publication_date": 20190607
    },
    {
      "title": "Keeping things safe",
      "text": "Keeping things safe since I bought it. No real bells and whistles. Keys, opens, locks. 👌🏽",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa",
      "helpful_votes": 0,
      "publication_date": 20170712
    },
    {
      "title": "Great to Lock Motorcycle Helmets",
      "text": "I use it to lock Helmet on my Motorcycle , its a Good lock for $6.88",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190724
    },
    {
      "title": "Five Stars",
      "text": "I bought it to lock our two door's bridge. Works very well",
      "rating": 5.0,
      "verified": true,
      "author": "Dorval Diva",
      "helpful_votes": 0,
      "publication_date": 20180508
    },
    {
      "title": "Cheap, safe, effective. No problems with the ...",
      "text": "Cheap, safe, effective. No problems with the lock yet. Rating 3 instead of 5 because it comes in that damn clam-shell space-devil packaging.",
      "rating": 3.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20170227
    },
    {
      "title": "Perfect For Safety!",
      "text": "This is perfect for my needs. I wanted to put the lock through my firearm inside my double locked case for when I fly out for the Christmas holiday. I will be staying with my son and have 3 grandsons there and I just want to be very safe (even though they have ALL taken safe gun classes). The price was right, shipping was fast and it was exactly as described. Highly recommend",
      "rating": 5.0,
      "verified": true,
      "author": "OzarkNana",
      "helpful_votes": 0,
      "publication_date": 20171212
    },
    {
      "title": "Good lock",
      "text": "Works great for its purpose. Some things to be aware of are that each lock is keyed differently (which is a good thing), so you might want some kind of marking or tagging system if you buy several. Additionally, if you have a firearm without the kind of mechanism that you can thread this lock through (e.g., an M1 Garand) you'll need a different kind of lock.",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew M. Springer",
      "helpful_votes": 0,
      "publication_date": 20160731
    },
    {
      "title": "Worst lock ever",
      "text": "Had a hard time opening the first time, then it wouldn't open a second time. Worst lock ever.",
      "rating": 1.0,
      "verified": true,
      "author": "jedimaster",
      "helpful_votes": 2,
      "publication_date": 20170104
    },
    {
      "title": "... the product looks strong and the quality appears to awesome, I had to request a return",
      "text": "While I the product looks strong and the quality appears to awesome, I had to request a return. With all of the cancer surfacing with no explanations, I did not want to take a chance on these chemicals. I appreciate the company's warning",
      "rating": 3.0,
      "verified": true,
      "author": "Excited",
      "helpful_votes": 2,
      "publication_date": 20180527
    },
    {
      "title": "Simple, necessary",
      "text": "Easy to use, nice and sturdy. It's not only good for a gun but also for a jack, good value for the money",
      "rating": 5.0,
      "verified": true,
      "author": "Zach Lee",
      "helpful_votes": 0,
      "publication_date": 20190824
    },
    {
      "title": "Cable is not thick..",
      "text": "It's not thick enough cable is in the tiny side compared to others. I won't use this on a 45. don't get me wrong it will work for any type of handgun but I like my cables thick. This is going to be perfect for my phoneix arms hp22..",
      "rating": 3.0,
      "verified": true,
      "author": "Virgil",
      "helpful_votes": 0,
      "publication_date": 20190427
    },
    {
      "title": "Good Pistol Lock",
      "text": "Not the best for a shotgun, but a sturdy lock while transporting my pistol.",
      "rating": 4.0,
      "verified": true,
      "author": "Robert",
      "helpful_votes": 0,
      "publication_date": 20190512
    }
  ],
  "product_meta": {
    "title": "FSDC-CL1020RKD 15\" California DOJ-Approved Keyed Cable Gun Lock",
    "description": "FSDC-CL1020RKD 15\" Firearm Safety Cable Gun Lock. Useful for pistols, handguns, rifles, shotguns & Modern Sporting Rifles. Black cable cover and body with FSDC logo on both sides. Package includes two keys and an English/Spanish/French instruction sheet. This lock is a California-approved firearm safety device that meets the requirements of Penal Code section 23655 and the regulations issued thereunder. This lock has been approved by the Colonel of the Massachusetts Department of State Police in accordance with the provisions of M.G.L. c. 140, § 131K",
    "rating": 4.6,
    "feature_bullets": [
      "Prevents accidents and unauthorized use",
      "Fits most pistols, handguns, rifles, shotguns & Modern Sporting Rifles",
      ".210\" diameter wear resistant cable cover",
      "California DOJ and Massachusetts Department of State Police-Approved. WARNING: This product can expose you to chemicals including lead, which is known to the State of California to cause cancer and birth defects or other reproductive harm. For more information, go to www.P65Warnings.ca.gov. Use of this product, including its use after discharging firearms in poorly ventilated areas, cleaning firearms, or handling ammunition may result in exposure to lead. Have adequate ventilation at all time",
      "Also available in a convenient keyed alike 3 pack - https://www.amazon.com/dp/B01KGRKAFG"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "7.6 x 4.7 x 1.1 inches; 4.8 Ounces",
      "Department": "Unisex-adult",
      "Date First Available": "July 1, 2015",
      "Manufacturer": "Firearm Safety Devices Corporation",
      "ASIN": "B010IBDS04",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Shooting",
      "Locks",
      "Sports & Outdoors",
      "Sports & Fitness",
      "Gun Accessories, Maintenance & Storage",
      "Gun Parts & Accessories",
      "Hunting & Fishing"
    ],
    "price": 7.09
  }
}