{
  "website_summaries": [
    {
      "verdict": "This is the best smart thermostat for keeping your heating bill under control and warming your home exactly when you need it the most.",
      "pros": [
        "Straightforward installation",
        "Easy to schedule",
        "Actively protects pipes from freezing",
        "Uncomplicated companion app",
        "Great for saving money on heating"
      ],
      "cons": [
        "A pricey upfront investment"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Paying for instillation a huge con.",
      "text": "Called up British Gas after paying the extra for them to fit this device. They’re booked up for the next 5 weeks....not ideal, but ok let’s get it booked in for 5 weeks time... ‘Oh, we can’t book you in so far in advance’ So despite having already paid for instillation, they won’t do it. Now have a hive as a paper weight. Biggest racket in the smart thermostat game.",
      "rating": 1.0,
      "verified": true,
      "author": "MR M KNIGHT",
      "helpful_votes": 28,
      "publication_date": 20181102
    },
    {
      "title": "EVERYONE GOOGLE HIVE TEMPERATURE OVERSHOOT BEFORE BUYING THIS GAS GUZZLER",
      "text": "Warning. Fitted it myself 5 days ago. Easy as wiring a plug and pairing to hub. Set temp to room temp 20 degrees in same place as old thermostat. Works brill but boiler will stay fired up till temp is reached (unlike your old thermostat that has TPI technology in it) then when it goes off there is enough residual heat in the radiators to go up to 25 degrees. Too hot. Then when drops back to to 20 or what ever you set it to it comes on again and heats up to 5 degrees over what you need. Cleaver British gas. Who owns hive. Re fitted old one back on now. Be warned and Google it.",
      "rating": 1.0,
      "verified": true,
      "author": "Luke Davison",
      "helpful_votes": 14,
      "publication_date": 20181128
    },
    {
      "title": "Easy to install, easy to use",
      "text": "I bought the version without professional installation. I'm not a DIY expert but I do enjoy doing the odd bit here and there. The Hive was easy to install - it took me around 15 minutes, the majority of which was waiting for the Hub to connect and update its firmware. My boiler is fairly modern (Vokera 29 Compact) and it only needed 4 wires connecting to the control unit. The app is intuitive and easy to use, as is the physical thermostat. If you're not mounting it to a wall though, I'd recommend buying a stand; the base of the thermostat has a tab to remove the battery cover and it means it doesn't stand on it's own.",
      "rating": 5.0,
      "verified": true,
      "author": "NA",
      "helpful_votes": 10,
      "publication_date": 20181126
    },
    {
      "title": "No one is available to install i..",
      "text": "It's been sitting uselessly on the side since November because I bought it with installation included but no one is available to install it until the end of January. They should stop selling installation if they can't provide it.",
      "rating": 1.0,
      "verified": true,
      "author": "BeckyS",
      "helpful_votes": 22,
      "publication_date": 20171219
    },
    {
      "title": "Poor installation booking service",
      "text": "The contact number and website given in the leaflet no longer works. After much searching online, found an online chat to book the installation. Waiting the whole afternoon at home for the installation, no one came. Had to rebook the installation again! Another annual leave required. Extremely disappointment with the service for the installation booking. This needs improvement. Haven’t even had a chance to start using the product yet",
      "rating": 1.0,
      "verified": true,
      "author": "Mary",
      "helpful_votes": 9,
      "publication_date": 20181022
    },
    {
      "title": "Easy and quick install - great product",
      "text": "Bought on sale in July knowing it'd be much easier to get it installed in summer as most negative reviews on installation were in peak winter. Not disappointed - booked online on Friday (instructions and code in the box) and got an appointment for Tuesday. Product works and professional installation is always recommended for anything to do with the boilers, and our installer from British Gas did a great job of it. Overall - great product - really makes sense.",
      "rating": 5.0,
      "verified": true,
      "author": "JSS",
      "helpful_votes": 11,
      "publication_date": 20170723
    },
    {
      "title": "Couldn't do without it",
      "text": "I bought this Hive heating and hot water thermostat on Black Friday and thought it was a good price for £140. Our usual electrician fitted it within 30 minutes and has been a doddle to use. We use the phone app to schedule the on/off times and it has the added advantage of being able to be accessed when out of the house. You can move it around the house although you will need a stand. I found the stand made by Hive cheaper at Screwfix a saving of £12. However you intend to use it, you will find it money well spent.",
      "rating": 5.0,
      "verified": true,
      "author": "firstmovieperson",
      "helpful_votes": 4,
      "publication_date": 20190109
    },
    {
      "title": "Much better than the Nest in my opinion",
      "text": "Much better than the Nest in my opinion, purely for its portability; I bought both and settled on this. Most people I know who have Nest have actually turned the learning feature off which I think is a key selling point for that product. The Hive is easy to use and set up, and although I've had connection problems with the app in the past, that too is also easy to navigate and change all the thermostat options on the fly, as well as keep track of the home's temperature.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr Aaron Di Fante",
      "helpful_votes": 5,
      "publication_date": 20180529
    },
    {
      "title": "Very disappointed. Have to wait for months for appointments too",
      "text": "Came with an already scratched code. Called Hive to book an appointment and they said the code is already in use. Very disappointed. Have to wait for months for appointments too.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 12,
      "publication_date": 20171228
    },
    {
      "title": "DON'T GET INSTALLATION AS THEY DON'T TURN UP",
      "text": "Took the day off work at great expense to get this installed. The British gas installer just pushed a button around 5.30 to say he called and i was not in. In truth i took the whole day off work and left me front door open so this would not happen. Disgusting i just got fobbed off - 4 times trying to call british gas. Please amazon stop offering installation as they cant do this at all.",
      "rating": 1.0,
      "verified": true,
      "author": "Rik Real",
      "helpful_votes": 5,
      "publication_date": 20181203
    },
    {
      "title": "Awful appointment booking department (will update when, or even if, this product gets installed)",
      "text": "Purchased product with installation and had an appointment set for today (19/12/2019) for a 12 pm to 6 pm appointment. So I stayed home and waited. At 2:35 pm received a call to say they had to cancel the appointment. Why not tell me before the appointment so I did not need to arrange to stay home? Why wait till the day AND middle of the appointment slot to tell me? AND THEN to top it off, the next promised appointment is booked for 31st of January 2020 - 6 weeks from now... such an inane thought process and result.",
      "rating": 1.0,
      "verified": true,
      "author": "Mr S Gillani",
      "helpful_votes": 3,
      "publication_date": 20191219
    },
    {
      "title": "Might be a great product... If I ever get it fitted",
      "text": "I bought this 22nd Nov including fitting by British Gas. Once I'd bought it I was told the earliest they could fit it was 20th Jan 20. Today I've received an email from Hive saying that \"my camera pack installation\"?? has now been postponed to February 2020 because of circumstances beyond their control. Essentially I've paid nearly £200 for something that I've had sat in the box for a month and won't be able to use for another 2. Not happy!!",
      "rating": 1.0,
      "verified": true,
      "author": "Pilky",
      "helpful_votes": 4,
      "publication_date": 20191217
    },
    {
      "title": "A JOKE",
      "text": "Bought with installation. They fitted the \"wrong\" thermostat. Then they wanted £220 (more than the entire price of the device) to come fix a 4 week old system thats never worked. THEN... I make a written complaint (obviously) and I received a message saying \"were too busy to respond see the FAQ for details\" Literally the worst customer service ive ever received. DO NOT BUY! -- get a nest instead, they work better anyway by all accounts.",
      "rating": 1.0,
      "verified": true,
      "author": "Richie",
      "helpful_votes": 2,
      "publication_date": 20190912
    },
    {
      "title": "Looks the part",
      "text": "Brought during the Prime Day sale, got it for £95, and fitted it myself, quite straight forward, if you have a good electrical understanding. Bough Gray surround, A’s the white standard one looks cheap and nasty. Works well with Alexa, once you remember the correct words to use when speaking to Alexa. Also have the Hive app on my phone which is really handy.",
      "rating": 4.0,
      "verified": true,
      "author": "Mitch",
      "helpful_votes": 5,
      "publication_date": 20190813
    },
    {
      "title": "Nest it is then.",
      "text": "So, unit arrives from Amazon, no issue. I do as instructed and try to book installation. Voucher code is accepted, but then all it does is add another unit into a checkout basket. After 4 attempts I finally try online chat. After half an hour I'm being asked \"Have I contacted Amazon about this?\" When I responded with the question as to why I would contact Amazon about installation when it was carried out by Hive/British Gas, I was asked more inane questions, by which point I was 40 minutes in. The product may be great, but if the customer service is this poor, I'll pay more and have a Nest thanks.",
      "rating": 1.0,
      "verified": true,
      "author": "Tim Haughton",
      "helpful_votes": 0,
      "publication_date": 20191125
    },
    {
      "title": "Unacceptable service",
      "text": "Booked 10 days later for British Gas Engineer to come. He didn't. Rang twice. Apparently arrived but no one answered. This is a lie, we was waiting all day here. They didn't even leave a card. Wasted our entire day. Had to call their Office and the next installation is 2 months later in January? Highly not recommend at all. I can't even install this myself or a local tradesman because the British Gas Engineer has the other half of the hive to install!",
      "rating": 1.0,
      "verified": true,
      "author": "Lammy",
      "helpful_votes": 0,
      "publication_date": 20191127
    },
    {
      "title": "Amazing",
      "text": "Once installed exceptionally easy to use Been using for quite a while now and its been easy to use and reliable Alexa integration is great with no issues around voice control There are a few criticisms 1. If you work shifts then not enough daily slots but if you work 9 to 5 then plenty of time slots 2. Integration with Alexa & Life360 is great for turning heating off when everyone in house leaves BUT it turns settings to off rather than to schedule mode. This means heating won't come on at scheduled time later in day....you have to manually turn it back to schedule Really impressed with product overall and would highly recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Ollossk",
      "helpful_votes": 0,
      "publication_date": 20191203
    },
    {
      "title": "Great piece of kit",
      "text": "I bought this Hive Thermostat including installation. It's worth keeping an eye open because with Prime membership you can buy it much cheaper and the sale price alters quite regularly. I paid £149.99. It works faultlessly via touch controls on the unit or using the app. I have a smart meter installed and I notice the gas usage reducing quite a lot by a bit of smart scheduling the heating. Fitting doesn't take very long and I guess this is dependant on your boiler. My boiler isn't very old and was told it was very straightforward. Personally I wouldn't like to attempt self insulation. Leave it to British gas. Really pleased with my Hive.",
      "rating": 5.0,
      "verified": true,
      "author": "Rob - Newcastle-u-lyme",
      "helpful_votes": 0,
      "publication_date": 20190503
    },
    {
      "title": "A straightforward replacement - so long as you have a basic control system already",
      "text": "Installed the Hive in my son's flat and he reports he is very happy with the functionality of the device. Installation was relatively straightforward, locating the receiver unit close to the boiler, cabling in the mains and the thermostat wiring without problem. The wifi connection didn't work first time but after a couple of reboots we got it going and it now works fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Cheviot Dave",
      "helpful_votes": 5,
      "publication_date": 20180122
    },
    {
      "title": "5 + weeks until installation!",
      "text": "The Hive has arrived, we bought this because our daughter works strange shifts and we need to change the times the heating comes on in the morning from day to day. I’ve just tried to book the installation, I expected some delay because of the offers and Christmas. But nearly 6 weeks is unacceptable in my opinion. If Hive intended to run a major promotion on these, they should have had the back up in place to install them.",
      "rating": 1.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20191205
    },
    {
      "title": "Excellent Product",
      "text": "Thought it was dodgy when first fitted as nothing worked, but it is early autumn and the heating hasn’t been on for months. Bottom line, the three way valve had stuck. After freeing up the guilty player, everything works fine; including using it with Alexa. This review is updated since finding out the real problem.",
      "rating": 5.0,
      "verified": true,
      "author": "Rik",
      "helpful_votes": 3,
      "publication_date": 20180924
    },
    {
      "title": "Wish I hadn't bothered! \"oops something went wrong\" or \"updating\"",
      "text": "Seriously I wish I hadn't bothered with this smart thermostat! I'm always concerned whether this will work or not! Constantly getting issues within the application! It constantly says \"updating\" and often says it hasn't updated for 7 hours or so! Or.it says in red \"oops something went wrong\" yet all the devices within the manage section say online etc! Tech support on the forums is pointless. The thermostat is chunky and doesnt have a sensor which picks up your in front of it (would be useful to walk past and it wakes up and tells you the room temperature) I wish I could return this, but I've had it installed on my combi boiler so its staying.",
      "rating": 1.0,
      "verified": true,
      "author": "JdotR",
      "helpful_votes": 0,
      "publication_date": 20200925
    },
    {
      "title": "DONT BUY FROM AMAZON",
      "text": "I know this product is great and works very well. However, do not buy through amazon. You get the product and I side is a eaglet with a code you use to order installation. After doing so British Gas put you at the bottom of the day list you ask to be sheduled and it never happens. Having bought Hive direct from British Gas for another property it all works like clockwork. DON’T BUY THROUGH AMAZON",
      "rating": 1.0,
      "verified": true,
      "author": "Nobleman",
      "helpful_votes": 3,
      "publication_date": 20181203
    },
    {
      "title": "Very convenient",
      "text": "Bought without installation and booked my heating engineer to install. Took him 15 mins. Works great. AlexaSkill 1. Heating Boost: Alexa ask Hive to boost heating at 22 degrees. 2. Heating Pause: Alexa ask Hive to boost heating at 10 degrees. AppleWatch Display Hive Quick Actions IOS Display Hive Quick Actions in Today View HiveInstall note: Switch the receiver off-on. Blinks Amber. Switch Hub off-on, if still no amber, go to the app* > Menu > Install Devices. Install Hub. Blinks Amber. Add batteries to Thermostat: Searches and pairs with Receiver & Hub. Sorted! *Set up a Hive Account First!",
      "rating": 5.0,
      "verified": true,
      "author": "SilverWave",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "Set up in 30 minutes on an oil boiler ... basic knowledge requried to self-install",
      "text": "Took the self-install option - installed in 30 minutes. It's a multi-zone oil fired system, simple replacement of the timer as its standard fittings and isolated the existing thermostat. Only thing to be mindful of is that it is wireless, we have thick walls and its a distance to the boiler room from where the Hive hub / thermostat is located - positioning is important. Failing that i see they also sell a booster if required. Had no real preference towards Hive / Nest - Hive was a blackfriday deal so also purchased some smart light + sockets.",
      "rating": 5.0,
      "verified": true,
      "author": "some feedback",
      "helpful_votes": 4,
      "publication_date": 20161129
    },
    {
      "title": "Can't sync to phone as hub not registered.",
      "text": "Whilst it works OK in terms of settings etc, occasionally it disconnects and it is really difficult to reset. This is possibly partly due to the fact that the Hub we got with it is not a registered one, so it is not recognised and I can't sync it with my phone. So I have to adjust it manually on the thermostat and can't do it remotely - which was kind of the point of getting it. If the seller reads this please could you confirm why the hub is not registered and what I can do about it?",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191204
    },
    {
      "title": "Hmmm.....failed installation, great Amazon service",
      "text": "Well, the \"Professional Installation\" gets a big 0 from me! Fella took but 5 minutes to declare he could not install to replace our Honeywell ST7100 controller: we have 6 wires, he could only deal with 4. Spent a disappointing afternoon trying to get Hive to respond to things (phone/email/twitter) before their chat facility finally appeared. Person confirmed they could re-book appt.....but the electrical issues would need sorting first. Since I have no idea what that issue resolution would look like (hey, that's why I PAID for Professional Installation!), I've given up there! So a hopeless waste of a day to get it installed. At least Amazon stepped up with an instant refund - 5* for them!",
      "rating": 3.0,
      "verified": true,
      "author": "MikeIOW",
      "helpful_votes": 0,
      "publication_date": 20200303
    },
    {
      "title": "Very easy to use",
      "text": "Since buying this and having the installation from British Gas I have been delighted with the increased level of control and temperature accuracy that we have experienced when compared with our old analogue thermostat and boiler controller. We currently have the thermostat \"free-standing\", i.e not wall-mounted or even an a stand, but this does not seem to in any way detract from its operation. Making changes to the off-on schedule and/or temperature, either via this unit or, more often via the phone app is extremely simple and straightforward. All in all, an excellent purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "emmrecs",
      "helpful_votes": 0,
      "publication_date": 20191221
    },
    {
      "title": "Not that easy to install!",
      "text": "No option to include fitting in the price. That's a shame. I bought one and consider myself a good all round DIY'er. Other reviews said you need to check your old wiring layout and then copy it onto the hive. This doesn't work with a worcester greenstar 38cdi. So I went online with limited success. Called hive, no help. Shame because it looks great. Now I need to find a sparks who will charge me £50 for a 5 minute job and when I see how he's wired it I will kick myself :)",
      "rating": 2.0,
      "verified": true,
      "author": "Jon",
      "helpful_votes": 3,
      "publication_date": 20180129
    },
    {
      "title": "Great product, simple instructions and easy to install",
      "text": "Followed the instructions and was up and running in less than an hour. Replaced my Lifestyle LP241 programmer and wiring matched exactly, I did replace the old backing plate as not a perfect snug fit. Connected the wires together for the old thermostat and fit new wireless one in same spot on the wall. Straight forward process, looks good and its easy to program using the app (and even easier on the thermostat itself) and even connects to Alexa. Looking forward to having more control during the colder months and hopefully saving some energy.",
      "rating": 5.0,
      "verified": true,
      "author": "GSC",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "It's good but very annoying that software needs updating",
      "text": "So in order for this item to stay under warranty you need an engineer but the real annoying thing is it needs to be updated for it to work, this took 4Hours! (And I have virgin 108) When we called Tec support they said to call back in the morning as the download may take longer. luckily I had my own gas engineer that was flexible and have me a fixed price. it would be more helpful to know you have to update the hub first and that an installation should be done in the morning based on that information. Having said all that he next day Tec support had it up and running in minutes",
      "rating": 4.0,
      "verified": true,
      "author": "bella",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "It works fine sometimes.",
      "text": "After a long 6 hour professional installation. It finally worked. Had to call back the installation company twice to repair the damaged caused by the installation engineer to the compensation pump. It now works OK and does what I wanted it to. Namely control the heating whilst we are away. Sometimes it doesn't update the settings for days. A reset of the phone is necessary.",
      "rating": 4.0,
      "verified": true,
      "author": "John Crossthwaite",
      "helpful_votes": 2,
      "publication_date": 20190712
    },
    {
      "title": "FIFTY-FIVE day wait for installation !!",
      "text": "Cannot write a review on the product itself as it hasn't been installed yet. Couldn't book installation online via the Hive website as there were \"no installation appointments available\" ! When I phoned to get an appointment I was given a date at the end of January 2020 .... 55 days later. This is an absolute joke !! I would advise anyone buying this product to do so WITHOUT INSTALLATION and make your own arrangements with a qualified electrician to do the installation.",
      "rating": 1.0,
      "verified": true,
      "author": "Rusty",
      "helpful_votes": 0,
      "publication_date": 20191129
    },
    {
      "title": "Great purchase",
      "text": "This replaced a standard LCD programmable thermostat, and I'm so glad I did, it offers so much more control, the boiler fires up less I think but still maintains a good level of warmth in the house. Using your voice with the echo to control is lazy I know but it's great, and the ability to control the heat when away from home is another good feature. Bought this earlier in the year so had to wait till now to review. Wanted to add, I installed this myself with the help of a YouTube video, if the thought doesn't frighten you I recommend self install",
      "rating": 5.0,
      "verified": true,
      "author": "Darren T",
      "helpful_votes": 0,
      "publication_date": 20191125
    },
    {
      "title": "Dont be in a rush to have this installed",
      "text": "Having received my active heating, I followed the instructions within the packaging to book my installation. I followed the instructions to the letter, and encountered a \"sorry but no appointments are available\" msg, followed by a tel no to ring to book my appointment. After a farcical discussion, I find out that I have to wait 8-10 weeks for an installation appointment! - pointless in selling Hive with installation if you have to wait this long for it to be installed! - I will be returning the item",
      "rating": 1.0,
      "verified": true,
      "author": "Rob Ellerton",
      "helpful_votes": 2,
      "publication_date": 20191126
    },
    {
      "title": "Looks good and works well",
      "text": "Looks great: unlike the previous white plastic thermostat I had up in the hall. Does the job efficiently and enables me to schedule my heating and hot water around my very varied daily routines. Previous control expected that I needed same routine Monday to Friday and at weekend. Had gas safe engineer set it up. Took about half an hour to install and check. I loaded the Hive app and even though I’m not that tech savvy I set up the schedule easily. Didn’t need the guide as the app so straight forward. Am very happy with this. Have not linked it with Alexa yet but will get round to it.",
      "rating": 5.0,
      "verified": true,
      "author": "Su",
      "helpful_votes": 0,
      "publication_date": 20200125
    },
    {
      "title": "Easy install, works well, can program in Python",
      "text": "Took 2 hours reading the instructions, watching Youtube videos, poring over blogs to conclude that the boiler wiring part was a direct replacement of my previous central heating programmer (Y plan), so a 5 minute install. Everything else was switched on and it all worked, including the mobile app. A few hours later, I had a Python program running on a Raspberry Pi, acquiring Hive data, producing daily/weekly/monthly/annual graphs and putting on a web site; great fun. Mrs C simply likes the idea that we can put the heating on before returning from holiday but thinks the hall wall-mounted unit is overly large.",
      "rating": 4.0,
      "verified": true,
      "author": "Chiny",
      "helpful_votes": 0,
      "publication_date": 20190821
    },
    {
      "title": "Arrange your own installation.",
      "text": "Took 7 engineer visits across 8 days to install and the engineers left my heating system not working properly. 8 months later still not repaired. I was left without any heating for several days. Engineers cancelled appointments and at didn’t turn up for other appointments. Complained to ombudsman. They weren’t interested.",
      "rating": 1.0,
      "verified": true,
      "author": "Chris Todd",
      "helpful_votes": 6,
      "publication_date": 20180701
    },
    {
      "title": "Excellent purchase",
      "text": "I paid for the installation as well, only had to wait a week, considering it was the week of Black Friday I was impressed. Really impressed with the Hive and how easy it is to control it. The British Gas Engineer was brilliant, so thorough, explained everything, called back the following day to check it was still connected to the internet and it was all working well.",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs HM Davies",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "Makes life easier!",
      "text": "I had previously been using a manual thermostat dial, so to go from that to this has been amazing! Was easy to install (other half is an electrician) but it did take a while to sync and register with my phone app. I recommend resetting the box and turning phone on and off- it will register eventually. I never thought I would find it so handy to be able to change the temperature remotely but I have used this feature a lot. It also means I can change the water and heating schedule without having to figure out how on earth to do this from the indecipherable old ancient box (which I never did actually figure out!).",
      "rating": 5.0,
      "verified": true,
      "author": "Greenwood",
      "helpful_votes": 0,
      "publication_date": 20200519
    },
    {
      "title": "Easy enough to install you just need to think or look online",
      "text": "I bought this during prime day, the heating only version didn't have an option to buy with the instal by British gas so I took a gamble as I'm an engineer with electrical knowledge. When it arrived and I went to install the receiver I noticed that my current wiring wasnt the same as what was needed ((only 3 wires (neutral live and switchlive) and a link wire)) after wrapping my head for half hour I managed to figure out that the link in my old receiver was a link between live and common. I fitted the hive receiver with this arrangement and it works fine, cant wait to use it when winter comes and the temp drops",
      "rating": 5.0,
      "verified": true,
      "author": "Nathan Walker",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "Have been perfectly happy with the installation",
      "text": "Bough together Multizone and Hive, phoned up British gas, engineer came out and installed both. Have been perfectly happy with the installation. I can now change the heating remotely and can have different schedules and more importantly, different temperatures for each schedule, both upstairs and downstairs. (For example no point heating downstairs when you're in bed upstairs!)",
      "rating": 5.0,
      "verified": true,
      "author": "JC",
      "helpful_votes": 4,
      "publication_date": 20170715
    },
    {
      "title": "Terrible quality product - Screen died after 5 weeks",
      "text": "Initially I was so excited and happy with this product, but the screen died after 5 weeks. The system was left alone, barely ever touched. All interactions were via the web app. Today the heating wouldn't turn on. I noticed the screen was blank. No amount of reseating fixed it, it looked like the screen had failed. This in my opinion was absolutely terrible. 5 weeks, in the middle of winter and needing to wait 2 days for a replacement. I am returning this product and buying something else.",
      "rating": 1.0,
      "verified": true,
      "author": "WeegieReviewer",
      "helpful_votes": 0,
      "publication_date": 20190209
    },
    {
      "title": "One Star",
      "text": "Worked well for about a year, but now it seems to drain the AA batteries within a few weeks",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 7,
      "publication_date": 20180215
    },
    {
      "title": "Bodge and scarper",
      "text": "Booked for British Gas to install, they cancelled had to wait for a 2nd appointment. Then told me the day before it was a 8-6 appointment when already booked for 12-6, they started arguing the point. Fitted the Hive, didn't test, tried testing, didn't work, called the support, went though with them. Needed a update, next day, still not working. The boiler requires to have the clock removed, as the internal clock is still taking priority. Have contacted the complaints, no come back 72 hours later.",
      "rating": 1.0,
      "verified": true,
      "author": "ghosthunter",
      "helpful_votes": 0,
      "publication_date": 20200219
    },
    {
      "title": "Don’t buy professional installation by British Gas!",
      "text": "Don’t buy the professional installation option. Buy the full unit and get it fitted yourself. The professional installation option comes with a scratch card with a code to book your installation. Mine was faulty (silver coating couldn’t be scratched off). Amazon support arranged with British Gas to call me for installation, but they never called (to be honest, if I’d known British Gas were the installers I wouldn’t have bought the included installation ... and I’d have been right! They’re hopeless). Product returned",
      "rating": 1.0,
      "verified": true,
      "author": "GeorgeBR",
      "helpful_votes": 0,
      "publication_date": 20191207
    },
    {
      "title": "Excellent Controller",
      "text": "Simple to set up.East to wire in as long as you note your existing wiring. I bought this to replace my EPH controller which I had problems programming. The Hive is excellent. Easy to install and a doddle to programme. In fact, I expected it to be more difficult than it was. So, I’m not happy that I had to replace my 6 month old EPH system however I now have a system which is easy to programme and reprogramme. Very pleased with my Hive. One gripe. It doesn’t come with any kind of stand for the thermostat which is pennypinching.",
      "rating": 5.0,
      "verified": true,
      "author": "Ken",
      "helpful_votes": 0,
      "publication_date": 20200403
    },
    {
      "title": "Old receiver sent. Be careful",
      "text": "We purchased this to be installed by our electricians following a house rewire. Initially it seemed to work OK but we haven't had the heating on due to the weather in the UK. The last few weeks the heating has intermittently been failing to come on. British gas came and found the hive receiver to be from a hive 1 system and not hive 2. They replaced with the correct receiver and all is well. This has cost us a £99 call out fee so I am not impressed. Be careful what you get in the box!!!",
      "rating": 2.0,
      "verified": true,
      "author": "Mr. J. I. A. N",
      "helpful_votes": 0,
      "publication_date": 20180927
    },
    {
      "title": "Great item, v 3 will be 5 star",
      "text": "Much better results than Nest. Firstly connections are robust, unlike the Nest. I had some issues with wireless coverage which meant a call to Hive support. They sent me a free zigbee extender, plus did some repositiong which helped. The app seems to work fine and doesn't do stupid stuff like a Nest. I'd recommend this for older properties and boilers too. The start is good. Shame it does not have proximity detect like Nest but I'll take batteries lasting. I personally wish this did WiFi tether rather than relying on the hive hubs Lan connection but that's their design. Integrates fine with Alexa or Google Assistant if that's your bag",
      "rating": 4.0,
      "verified": true,
      "author": "Ids",
      "helpful_votes": 0,
      "publication_date": 20190207
    },
    {
      "title": ">3 month wait for installation!",
      "text": "I bought this in November with installation. Tried to book installation and there were no available dates to book until mid-January! So booked a date because we had no choice. I get a call today saying they’ve changed my installation date to 10th February due to engineer availability. Poor service. I’m left with an expensive paper weight which I’m probably going to return now",
      "rating": 1.0,
      "verified": true,
      "author": "Ishan Pankhania",
      "helpful_votes": 2,
      "publication_date": 20191216
    },
    {
      "title": "Useless product, useless warranty",
      "text": "The thermostat stopped working after a few months. Support have been completely useless and are not willing to help. Apparently the installer was supposed to install or leave a receiver with the thermostat but that was never left so must have stolen it. Hive do not want to know as they they say that the installation was done by British Gas and they are a separate company!",
      "rating": 1.0,
      "verified": true,
      "author": "AS64",
      "helpful_votes": 0,
      "publication_date": 20191017
    },
    {
      "title": "Home Installation: The easiest active temperature controller to install",
      "text": "Replaced a Neomitis RF temperature controller on a Worcester Bosch Boiler. Easiest of installation ever as Neomitis base is virtually the same as the HIVE. Worth running through ALL of the instructions and carrying the complete installation process as described in the instruction leaflet once everything is in place. Took about 60 minutes for full installation and registration to be up and running. Note: You do not have to subscribe to HIVE additional subscription to use ALL of the features of this product. Ease of use: Excellent Ease of Installation: Easy for the average DIYer Features: Excellent",
      "rating": 5.0,
      "verified": true,
      "author": "ianr007",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "Easy schedule to aid energy saving",
      "text": "Now can control heating and water from anywhere and be notified if heating left on etc. When not on the schedule keeps an eye on the temperature and will turn heating on if in danger of frost damage for piece of mind I think so far the biggest impact for us is the easy access to the schedule which we can monitor and change with minimal effort. The old timer was a clunky old digital one which was setup 10 years ago before kids etc and we didn’t even bother to change daylight saving times etc. Now we have things set to the bare minimal with added use of boost for heating/ water when in extra over Christmas etc.",
      "rating": 5.0,
      "verified": true,
      "author": "Lee S.",
      "helpful_votes": 0,
      "publication_date": 20181228
    },
    {
      "title": "Impressive",
      "text": "Upgraded our heating to smart. Got a nice deal via Amazon, including an Echo Dot. Installation is via on-line, using the code in the Hive pack. Engineer came and installed everything in around 1.5hrs. The thermostat is a tidy bit of kit and the app is simple to use. We've had for a month now and no issues whatsoever as we have excellent wifi throughout the house. Minor quibble is the app very occasionally freezes and transferring a day schedule across to other days can't be done (unless I've missed something). In all, excellent so far. UPDATE: turns out I have missed something regarding schedule copying. It can be done!",
      "rating": 5.0,
      "verified": true,
      "author": "Piece",
      "helpful_votes": 0,
      "publication_date": 20181204
    },
    {
      "title": "Good system but arrived cracked",
      "text": "Had it installed and then noticed a crack on the thermostat. Amazon wanted the whole thing returning which is not practical as the receiver was wired to the boiler. So I contacted Hive who have so far been less than helpful. They described the crack as cosmetic and refused to change it. Not good. I am still persuing them but not very hopeful. System works well",
      "rating": 3.0,
      "verified": true,
      "author": "paul",
      "helpful_votes": 2,
      "publication_date": 20180923
    },
    {
      "title": "Fantastic item",
      "text": "This is the best thing I have ever bought for my house. We had an old thermostat that either froze you or cooked you. This was professionally installed by British Gas and integrated with my Alexa. Now I can control my heating seamlessly and I think I’m gonna make a lot of savings on gas. Its stylish and smart. Thing is as well, you can program it easily for times of the day so your never heating an empty house. I would highly recommend this item to anyone who wants to try and save a bit of money on fuel !",
      "rating": 5.0,
      "verified": true,
      "author": "James Hession",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "Wonderful product & service",
      "text": "Excellent product & service from Gas installer. I am very pleased that I purchased this Hive thermostat with Professional Installation from Amazon. Every step was clearly notified & the installation was trouble free. I cannot believe how much I have used the Hive app on my phone & it is so easy to control hence saving money by turning the heating up or down or on & off as required. I also have a dimmable Hive bulb which I can fully control on the app. I haven't yet connected it to Alexa but have no doubt that this would be useful too. I never want to be without Hive & would highly recommend it to all.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200123
    },
    {
      "title": "Unacceptable 2 month delay in installation",
      "text": "Having bought this device with installation via Amazon Prime and taken delivery next day, I immediately rang to book the installation appointment using the voucher code included with the device. The earliest appointment available was 8 weeks later. That means that, by the time the installation takes place, the main reason for buying it will mostly have passed as winter (and most of spring) will have ended. Amazon sells the installation, Hive rely on British Gas engineers for installation but clearly it is not a priority. Amazon should apply leverage to ensure it's customers have thier orders (contractually placed with Amazon) fulfilled. Perhaps it should organise alternative installers.",
      "rating": 1.0,
      "verified": true,
      "author": "Johnr Saville",
      "helpful_votes": 0,
      "publication_date": 20200303
    },
    {
      "title": "EXCELLENT CONTROL",
      "text": "my old controller worked on a 2 degree difference ie you set for 21 it wouldn't kick in till it was 19 degrees and switch off at 23. This you had a min of 4 degrees difference . this is approx. !/2 to 1 degree difference and keeps the temperature stable. With the hive app you can control this away from home . A friend uses this for his parents that have dementia . He can ensure that the house stays warm even if they turn the system down. You can get notifications if the temp drops or rises above a set temp. excellent piece of equipment. My only complaint is it needs a stand unless lying flat.",
      "rating": 5.0,
      "verified": true,
      "author": "Davidc51",
      "helpful_votes": 0,
      "publication_date": 20181205
    },
    {
      "title": "Changed my life",
      "text": "I can’t comment on whether or not this has saved me money, but it has definitely made life more convenient. I had a plumber install this at the time of fitting my new boiler - didn’t buy the installation package. Simple to use app (easier to use than the actual thermostat, which is a bit clunky). It’s nice coming home to a warm house, having activated the heating ‘boost’ function 20 mins before I get home. The app can crash sometimes, but works again pretty quickly after restarting it. Highly recommend",
      "rating": 5.0,
      "verified": true,
      "author": "bright_sales",
      "helpful_votes": 0,
      "publication_date": 20200206
    },
    {
      "title": "Do not buy - get something like Neo HeatMister",
      "text": "Over hyped and pathetic product. Ours now works in a stand-alone mode or like any £30 thermostat with no access over WiFi or app. Done everything possible to get it to work using the app but no luck. Tech support is laughable - called twice each with 50 minute wait so hung up. I am quite tech savvy and this is the worst home automation product ever. We have HeatMister for the downstairs underfloor heating. Admittedly the app is not slick like Hive but IT BLOODY WORKS!!! Hive is not supported by Apple HomeKit either.",
      "rating": 1.0,
      "verified": true,
      "author": "BookMan",
      "helpful_votes": 0,
      "publication_date": 20191111
    },
    {
      "title": "Delighted",
      "text": "Ummed and Ahhed over this vs Nest for ages, but decided I didn't want the faff of Nest learning what I want, I'd just tell Hive, and it's cheaper. Doddle to install if you have basic electrics and there's an existing boiler controller. Sorted itself with WIFI immediately. Does what it's told, whether in the house or over the internet when away from home. Seems accurate and sensitive to temperature, switches immediately. Delighted with this unit.",
      "rating": 5.0,
      "verified": true,
      "author": "insta: david_williams_stonework",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "21st century smart heating.",
      "text": "I live the control and ease of use with these. Now they have the added feature of warmup time so the heating comes on and warms up the house in anticipation of you getting up not turn on for the time you programme. They are very simple to wire up providing you have basic knowledge of electrics. They need power and switch live, simple on/off command. Probably easier in a new build setup. Please don’t attempt otherwise but there are many instructional on the web. I am an ex electrician it took me 1hr to wire in dual zone.",
      "rating": 5.0,
      "verified": true,
      "author": "Dr. Longbottom",
      "helpful_votes": 0,
      "publication_date": 20200923
    },
    {
      "title": "No appointments for professional fitting so avoid",
      "text": "Just bought this with professional installation and emailed hive because its impossible to get through to customer services and they've said you can't book for 55+ days because they have no appointments WOW",
      "rating": 1.0,
      "verified": true,
      "author": "Mr Dean A Chapman",
      "helpful_votes": 2,
      "publication_date": 20191124
    },
    {
      "title": "Purchased with Professional installation but no valid voucher code present.",
      "text": "Tried to organise professional installation of unit as purchased with British Gas, in the enclosed welcome pack gave instructions to organise your installation by scratching off a silver panel and discovering your voucher code for the installation, when removed no voucher code present under the silver panel. Confirmed with British Gas they would not arrange installation without valid code even after offering proof of purchase from Amazon Prime the day before. Returned whole unit for full refund, would not try and obtain valid code through seller sepertely as this should not have occurred in the first place.",
      "rating": 1.0,
      "verified": true,
      "author": "B. M. Clark",
      "helpful_votes": 0,
      "publication_date": 20181126
    },
    {
      "title": "Poor customer experience from Hive",
      "text": "This product was sold with installation. I am now having to wait 55 days as Hive are not able to provide anyone to install the device in my postcode area for 2 months. This is extremely poor, especially given the cost of the device.",
      "rating": 1.0,
      "verified": true,
      "author": "Wibble",
      "helpful_votes": 3,
      "publication_date": 20191124
    },
    {
      "title": "BIGGEST SCAM EVER - The product was not complete and I can not return",
      "text": "I bought this product in Oct 2019. British gas couldnt send me an installation engineer until the end of January. So I tried to send it back. But I cant send it back because the return window had closed. So now I am stuck with a product, that I can not use or sell on, because the engineer brings a part with them to install and it is not complete. This has got to be the biggest con I have ever experienced, and would expect a lot better from British Gas and Amazon.",
      "rating": 1.0,
      "verified": true,
      "author": "MS  noname",
      "helpful_votes": 0,
      "publication_date": 20200611
    },
    {
      "title": "Easy to do than expected (self install)",
      "text": "Drop in replacement for existing room stat, turned out to be much easier than I expected to install and set up. I had anticipated problems with the \"WiFi\" as my router has MAC address enabled. However, the Hive system is completely independent from your home WiFi, that's why you plug one box in to router via a cable, it uses its own radio system to connect to the boiler and room stat. Control of time and temperature settings is so much easier from PC or phone than it was with my old system's tiny LCD. Override options good too.",
      "rating": 5.0,
      "verified": true,
      "author": "D B HUMPHRIES",
      "helpful_votes": 0,
      "publication_date": 20191106
    },
    {
      "title": "Would love to one day use it! Don’t get this product",
      "text": "Would love to write a review on the product however it is still in its box where I expect it to stay for the foreseeable. DO NOT GET INSTALLATION! Purchased the thermostat and installation from amazon. Comes with a code in the box to get installation and the engineer. This code did not work however Hive say it’s amazons fault and amazon say it’s Hives fault. Both customer service departments are non existent.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20191217
    },
    {
      "title": "No installation for oil boilers, no proper geofencing",
      "text": "We sent this back after we realised the installation option is not valid for oil boilers. In theory it will work with an oil boiler, but you will have to install it or arrange the installation yourself. The marketing talks about geofencing functionality, but all it can do is notify you if you go outside a certain range and the heating is on - it does not automatically turn the heating off. You might be able to do this more properly with IFTTT or a similar setup, but not with the app as-is.",
      "rating": 2.0,
      "verified": true,
      "author": "N",
      "helpful_votes": 0,
      "publication_date": 20190308
    },
    {
      "title": "Does NOT work with district central heating systems",
      "text": "Product itself looks to be solid with good build quality. You also get the Hive hub in this kit which means that you can link to Alexa once the system is set up. However, tech/service support is a joke. Two different British Gas/Hive reps insisted that this can be installed with district central heating. Trust me, it cannot!!! Amazon were fantastic in processing refund straightaway.",
      "rating": 2.0,
      "verified": true,
      "author": "JEMD",
      "helpful_votes": 0,
      "publication_date": 20190824
    },
    {
      "title": "Not for modern Combi boiler",
      "text": "Bought to use with my modern Combi boiler. Should have got the heating only one. Made this one work by wiring it up to my boiler's 240v switching circuitry. Unfortunately only after I'd already fried the boiler's lower voltage circuit... 3 stars is being pretty kind to it. It works ok most of the time, but the hub regularly goes offline. So much so that I've invested in a smart plug to plug it into. When the hub drops offline I can remotely reboot it by controlling the smart plug. Shouldn't have to do this imho.",
      "rating": 2.0,
      "verified": true,
      "author": "Richard",
      "helpful_votes": 0,
      "publication_date": 20190204
    },
    {
      "title": "Thermostat very inaccurate",
      "text": "Ive left it a while to review this produce so to give a good honnest opinion. At first this was amasing and loved all the alexia features and smart phone control. Since then i have had a baby. Only now has it became apparent that the thermostat is very inaccurate since i have needed it to keep the room at a certain temperature. It always says the room is warmer than it actually is so after a day out and the evening draws in im finding im comming home to a cold house rather than the temp we have set at.",
      "rating": 2.0,
      "verified": true,
      "author": "Daniel fraser",
      "helpful_votes": 0,
      "publication_date": 20190420
    },
    {
      "title": "Poor system design.",
      "text": "Constantly loses connection between Hub and receiver (red LED on receiver), every time I have to spend 10-min resetting the whole system , not nice waking up to a freezing cold house because the hub has gone off-line in the middle of the night. In my view there seems to be design issues if you add hive lights, any glitch, power-cut, light turned off can cause the receiver to lose connection until you can perform a full reset of the system. I don't have to go round turning off all my laptops and mobiles if my WiFi temporarily loses connection, so why do I have do it with Hive equipment.",
      "rating": 1.0,
      "verified": true,
      "author": "Wadders",
      "helpful_votes": 0,
      "publication_date": 20191008
    },
    {
      "title": "FAULTY GOODS",
      "text": "i brought a Hive Active Heating and Hot Water... last may and the first lot of batteries lasted a year now im changing them every week what this product is not fit for purpose and under the sales of goods act 2015 i have to prove its the fault of the item and the fact that there of 100s of the exact same issue being reported points that there must be a component level fault with some of these hives. i demand a replacement",
      "rating": 1.0,
      "verified": true,
      "author": "Glenn Andrews",
      "helpful_votes": 0,
      "publication_date": 20200815
    },
    {
      "title": "Easy heating automation",
      "text": "I bought this to replace an ageing Honeywell remote thermostat with a failing LCD display. Not much more expensive than an equivalent remote thermostat replacement, but with the added bonus of a colour display, remote access, much easier programming and Alexa integration. I also wired the boiler receiver myself with the help of a bit of Googling, even though the original installer hadn't bothered labelling the wires connecting to the old receiver :( All-in-all, I have no complaints. Installation was relatively straightforward. Just need to be reasonably competent and follow the instructions. Alexa integration also works well.",
      "rating": 5.0,
      "verified": true,
      "author": "PM Russell",
      "helpful_votes": 0,
      "publication_date": 20200330
    },
    {
      "title": "Not suitable for oil fired systems",
      "text": "Although this is compatible with oil fired boilers, the British Gas installation is not. Spent 45 mins on phone with Amazon customer services. Unable to exchange for product without installation at Black Friday price. Is now twice the cost. British Gas also bring the Hive hub (essential component) when they install, so I can't even cut my losses and get it installed by an independent plumber. Feel slightly held to ransom by this aspect. Customer services, despite usually being great, were poor and required 3 different people to understand the issue.",
      "rating": 1.0,
      "verified": true,
      "author": "Dr. D. A. Wright",
      "helpful_votes": 0,
      "publication_date": 20181201
    },
    {
      "title": "Wouldn’t recommend",
      "text": "When I ordered this and booked my appointment the Closest one was in a months time. A matter of days before that date I got an email saying that my appointment had been moved to almost a further 6 weeks after that date, not impressed in the slightest. Wouldn’t recommend.",
      "rating": 1.0,
      "verified": true,
      "author": "Adam",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Does what its supposed to do",
      "text": "This is a good device, easy to install and set up. I will say that its not as pretty as a NEST system but it was considerably cheaper. Be aware that you MUST have a HIVE hub to conect too and that each hub will only support a limited number of devices, ie plugs and bulbs- i think the limt is 5. Works well from the app on phone, i cannot comment on the ALEXA side of things as ive not set that up!",
      "rating": 5.0,
      "verified": true,
      "author": "Shaun Porter",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "Amazing! So happy with it!",
      "text": "Absolutely brilliant! Hardest part was trying to install the receiver in the end I had to pay someone to do that bit but I did the rest myself (hub... thermostat.. programming) this was really easy and straightforward I'm really happy with the ease of use and control I now have over my heating, I would definitely recommend!! 👍",
      "rating": 5.0,
      "verified": true,
      "author": "doormanjoel",
      "helpful_votes": 0,
      "publication_date": 20190501
    },
    {
      "title": "A poor showing from British gas",
      "text": "It's a pretty poor and annoying product. Schedule setting is counter intuitive and have to struggle to setup periods that cross midnight. There is no way to manually adjust time or timezone setting (in 2019, really???) No geo fencing, you'd expect that from something connected to a mobile app. Poor Google home integration. Can't ask for current temperature and for the life of me I can't get it to update schedule. You have to be very specific when asking to change temperature.",
      "rating": 1.0,
      "verified": true,
      "author": "Andrei Dascalu ",
      "helpful_votes": 0,
      "publication_date": 20190122
    },
    {
      "title": "Doesn't work or connect to my phone",
      "text": "Very unhappy with Hive service. Didnt turn up to install. When they finally turned up over 8 weeks after buying the hive thermostat doesn't work and won't connect. It's been over four days now. I live in a small house and it won't connect without a booster. Way more hassle than its worth and it doesn't even work still",
      "rating": 1.0,
      "verified": true,
      "author": "Melissa ",
      "helpful_votes": 0,
      "publication_date": 20181220
    },
    {
      "title": "Only suitable for a Combi boiler with no Hot water tank",
      "text": "Amazon have twice delivered the version suitable for a combi boiler. I have a conventional boiler with hot water tank. So I have returned both. There is no mention of this in the product description here. Have to source the product direct from Hive.",
      "rating": 1.0,
      "verified": true,
      "author": "Andrewmt",
      "helpful_votes": 6,
      "publication_date": 20180910
    },
    {
      "title": "Very good piece of kit!",
      "text": "I have a Worcester Bosch Greenstar Sri 30 and was quite concerned about compatibility, but no problems! My existing thermostat was a WB RF controlling the built-in programmer (awkward to change). The WB thermostat was very approximate +/- 1C always having to readjust it. The Hive is accurate to 0.2C very sensitive and required us to have faith in the displayed temperature. Very impressed with the programme options, have now been able to set time periods and temperatures to suit our daily routine. Ability to manage via website is great making our readjustment of the programme so easy. BG installation easy to organise and efficient.",
      "rating": 5.0,
      "verified": true,
      "author": "TeeKay",
      "helpful_votes": 0,
      "publication_date": 20171215
    },
    {
      "title": "Don’t buy the installation, it would seem it never happens",
      "text": "No idea how it works as it won’t be fitted for almost 2 months after booking installation. And to rub it further they have just called to say they have emergency appointments and have to reschedule??? How can you have an emergency in 7 weeks time?? That’s not an emergency, that’s just scheduled work and double booking. DONT BUY THE INSTALLATION!!! You won’t never have all the kit you need to install it yourself once you get frustrated with booking it. Utter rubbish customer services on the phone too.",
      "rating": 1.0,
      "verified": true,
      "author": "DAVE!!!",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "DO NOT BUY USED!",
      "text": "Ordered a grade b hive heating off Amazon. Wired it up, spent an age trying to pair it but to no avail. After much scouring of the Internet, it became apparent that once the hive hub has been registered to a user, it can never be reassigned to new ownership. Second hand, All its good for is the bin. I'm going to order myself a nest.",
      "rating": 1.0,
      "verified": true,
      "author": "Lee G.",
      "helpful_votes": 3,
      "publication_date": 20190206
    },
    {
      "title": "Hive, worth it or not",
      "text": "Tricky to setup, but once done works quite well, temperature is out by a couple of degrees, not bad on the whole and updated a fairly tired restrictive system, so I found it worth the minimal investment.",
      "rating": 3.0,
      "verified": true,
      "author": "ann marie bohm",
      "helpful_votes": 2,
      "publication_date": 20190916
    },
    {
      "title": "Works great with Alexa",
      "text": "Love this product! Love being able to set the temperature of the house via Alexa. The boost setting is great aswell meaning we can have the heating on for a set length of time and it turns itself off without us having to do it hence saving money as I’d usually forget! The literal only downside to this product is I’m moving house, and if I want it in the new house I have to buy a new one rather than take it and arrange an engineer visit. So ended up costing a lot of money!",
      "rating": 4.0,
      "verified": true,
      "author": "S Marshall",
      "helpful_votes": 0,
      "publication_date": 20191020
    },
    {
      "title": "Good Value when on Offer",
      "text": "I have installed a couple of these now and needed hours of support for my own which, it turns out, needed a repeater to get the hub communicating with the thermostat. The personal tech support is very good; very patient and knowledgeable support people. (I’ve been on the other end of the phone many a time). I have now been tempted, and bought, several of their lamps and plugs for when we are away.",
      "rating": 5.0,
      "verified": true,
      "author": "Inspectorgadget",
      "helpful_votes": 0,
      "publication_date": 20190826
    },
    {
      "title": "What A Fantastic Difference a Thermostat Makes",
      "text": "A British Gas appointed electrician fitted my new HIVE thermostat yesterday, and it was all done within 40 minutes. I can now control my hot water and heating via my tablet, the actual portable thermostat, or ask Alexa to do it. I even set it whilst on the bus on my way home. The boost feature is most welcome and the unit itself looks great too. No more arriving home to a cold house, or wasting energy if I am running late. High five (stars!) to HIVE!",
      "rating": 5.0,
      "verified": true,
      "author": "Vernal Scott",
      "helpful_votes": 0,
      "publication_date": 20200125
    },
    {
      "title": "Tech support - not what you expect.",
      "text": "Working fine apart of the hub. I am still trying to connect it to my app. I have chat it through with the technical support team. All the time the chat was going off. They told me that they will call back but nothing and all the time i should explaining again and again the ‘problem’. Still showing offline on the app, i just need maybe a few hours to stay on the phone and hopefully i will sort it out.... If i could go back I wouldn’t buy it.",
      "rating": 5.0,
      "verified": true,
      "author": "Laurentiu",
      "helpful_votes": 0,
      "publication_date": 20191208
    },
    {
      "title": "excellent",
      "text": "one handy tip for self install, plug the hub into the network before you begin, it takes some time to auto upgrade. really plesed with it. i purchased the hot water & heating version - even though I have a combi boiler. The heating channel is now wired up to the outside lights, so I now have a sechudle and can remote control by outside lights.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20171213
    },
    {
      "title": "Savings are obvious.",
      "text": "Love this product, it easy to see how savings are possible. Able to control from anywhere, gives flexibility (can switch heating on when I convenient e.g. when I'm ordering my last pint, house is lovely and warm when we get home). Equally, often we go out for the day and I've forgotten to switch heating off, no issue anymore, just switch off from my phone. PS. We are not young \"tec'y\" people, we are retired, so it's certainly not difficult to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Phil Harris",
      "helpful_votes": 0,
      "publication_date": 20190213
    },
    {
      "title": "Brilliant",
      "text": "I’m writing this review after a full year of use and I can say I have absolutely no regrets about buying the Hive system. It has 4 separate components that all work flawlessly together, the thermostat which works and looks great, the boiler control unit, the wifi hub and the app which allows you to easily control your heating and hot water either manually or set schedules. The boost buttons on the app and on the thermostat itself are great and we use the heating one all the time. I haven’t had any of the problems that others have had on previous reviews and it has been one of the best purchases I’ve made on Amazon.",
      "rating": 5.0,
      "verified": true,
      "author": "Lauren",
      "helpful_votes": 0,
      "publication_date": 20201007
    },
    {
      "title": "Worked fine for a few months - Now it's terrible",
      "text": "All worked fine for a few months. All of a sudden it became unusable. * Thermostat has incorrect time, constantly, so schedules do not work. * Hive Thermostat does not turn off the boiler if the temp goes above 22° - This means if you're out of the house the temp can go through the roof (above 30°) - only way to stop it is to turn off the boiler and re-set the Hive. I am going to try and return the product and get something different.",
      "rating": 1.0,
      "verified": true,
      "author": "Mark Wood",
      "helpful_votes": 0,
      "publication_date": 20191204
    },
    {
      "title": "HIve -Superb!",
      "text": "I was reluctant to 'tech' up our house but absolutely love this bit of kit! We had a new boiler fitted so decided we would get one of these, so glad we did, so easy to control the heating o my phone using 'Google Home', if it gets really cold I can even turn the heating on from work to keep the cats warm and to warm the house up before we get home. Same with the hot water, totally easy to 'boost' it and turn it on or off. Highly recommend this. We have also purchased the sockets so our lamps are connected to the hive and are voice activated through Google Home.",
      "rating": 5.0,
      "verified": true,
      "author": "hellzbellz",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "Hive + Google Home = perfect combo",
      "text": "Bought it to help with my laziness of changing the schedule on my old school thermostat. In a couple of days after ordering the Hive, a British Gas engineer came to install it and in under 45 minutes it was up and running. I’m using Hive with Google Assistant and Home, the engineer did a demo for me as well as he has his whole house full of Hive products paired with Google, and it works without a hitch.",
      "rating": 5.0,
      "verified": true,
      "author": "Alplha13Sierra",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "Unable to use.",
      "text": "What a waste of about 20hrs of my life! Followed the hive instructions regarding the hub/reciever and boiler control, despite many attempts, including removing everything ans starting from scratch twice it will not work, hive customer service is appalling, have to download apps etc just to get onto a user forum, unable to speak to hive to resolve the issues.",
      "rating": 3.0,
      "verified": true,
      "author": "Steven Craigie",
      "helpful_votes": 0,
      "publication_date": 20200130
    },
    {
      "title": "Time wasters",
      "text": "What is the point of this if British Gas don't install it for two months after it has been purchased? I wonder if I will still get a money back guarantee if you keep pushing the installation date forward and it ends up not working? If it said it would be installed 2 months after purchase, I would not have bought it.",
      "rating": 1.0,
      "verified": true,
      "author": "R. GOLAH-EBUE",
      "helpful_votes": 2,
      "publication_date": 20191231
    },
    {
      "title": "Easy to install, easy to use",
      "text": "I'd read a lot of mixed reviews. Fortunately I am capable of a bit of wiring here and there. Checked out the images and looked at my own ancient heating system. Had this all set up and running within the hour. Sensor picked up WIFI easy enough, this was one concern as we are in a stone cottage and WIFI tends to break / stops at the kitchen, this is where the controller is. Personally, great when you're out on the hills all day and come home late to be able to adjust the heating for the arrival.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191126
    }
  ],
  "product_meta": {
    "title": "Hive Active Heating and Hot Water Thermostat Without Professional Installation-Works with Amazon Alexa",
    "description": "Style Name:Heating and Hot Water| Configuration:Without Installation\n\nTake control of your heating anytime, anywhere. Hive makes controlling your heating and easy from your mobile, tablet or laptop. The next generation Hive brings you beautiful design, intuitive control and easy to use features. Hive works no matter who supplies your energy and will work with your existing heating system. With Hive you’ll never need to heat an empty home again so you could save up to £130 a year on your heating bills. You can easily keep track of how you’re using your heating through the temperature graphs on the Hive app and receive heating alerts when you leave or return home. The Wireless Thermostat lets you control your heating when you’re at home, the Hub plugs into your broadband router so you can control your thermostat remotely and the receiver enables your thermostat and hub to communicate with your boiler. If you have a tank, you can easily control your too.\n\nPlease note that Hive Active Heating must be installed by a qualified professional. If you are buying Hive with no installation and have a hot water tank (conventional boiler) then Hive Active Heating and Hot Water is right for you. If you do not have a hot water tank (combi boiler) then Hive Active Heating is right for you.\n\n\n\nBOX CONTAINS\n\n\n * 1 x Hive thermostat\n * 1 x Hub\n * 1 x Single Channel Receiver\n * 1 x User guide and installation guide",
    "rating": 4.3,
    "feature_bullets": [
      "Heating Boost - For up to six hours",
      "Heating - Set up to 6 daily time slots",
      "Automatic Frost Protection - Helps prevent frozen pipes",
      "Holiday Mode - Tell Hive your holiday dates and come back to a warm home",
      "Text Control - Send your command to Hive via text",
      "Smart Home Hub required: Included in purchase"
    ],
    "specifications": {
      "Manufacturer": "Hive",
      "Part Number": "HAH2KitHeat&HWAmz-01",
      "Product Dimensions": "10.4 x 4.8 x 10 cm; 212 Grams",
      "Batteries": "4 AA batteries required.",
      "Item model number": "HAH2KitHeat&HWAmz-01",
      "Size": "No Installation",
      "Style": "Heating and Hot Water",
      "Item Package Quantity": "1",
      "Included Components": "Hive",
      "Batteries Included?": "Yes",
      "Batteries Required?": "Yes",
      "Battery Cell Type": "Alkaline",
      "Item Weight": "212 g",
      "ASIN": "B011B3J6B8",
      "Customer Reviews": "4.3 out of 5 stars3,957 ratings4.3 out of 5 stars",
      "Best Sellers Rank": "561 in DIY & Tools",
      "Date First Available": "1 Jan. 2010"
    },
    "categories": [
      "Heating & Cooling",
      "Thermostats",
      "Building Supplies",
      "Thermostats & Accessories",
      "DIY & Tools"
    ],
    "price": 175.56
  }
}