{
  "website_summaries": [
    {
      "verdict": "Includes multiple straps, buckles, and pockets so you can keep your gear organized.",
      "pros": [
        "Top has 14 dividers to keep  clubs organized",
        "Offered in 4 different color combinations",
        "Low price point versus many other golf bags",
        "Includes several storage pockets, including one with fur lining to protect valuables"
      ],
      "cons": [
        "Not the most durable golf bag, meaning it won't last in rough conditions"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Worth the money!!",
      "text": "There is literally nothing bad I can say about this golf bag. My husband loves it. It’s light weight, easy to carry with its good size strap and stands straight. The pockets are really deep. It even has a little cooler pocket for a snack or drink which is pretty cool too. Definitely worth the money and the best part is it’s much less than if purchased in a sports store.",
      "rating": 5.0,
      "verified": true,
      "author": "Janine",
      "helpful_votes": 20,
      "publication_date": 20190518
    },
    {
      "title": "Pretty good bag",
      "text": "Pretty good bag. Just got it today and put all my clubs in. Seems like enough pockets for everything, I like the putter holder so far, I'll see how I like it when I play this week. I give it 4 stars ONLY because it is NOT 14 full length dividers. There are 4 full length dividers, In each \"compartment\" the handles of the clubs still get all tangled and messy, which always bothered me. I don't want to return it and get a more expensive bag that has actual 14 full length individual pockets for each club, so I'll just deal with it. I'll update later after a few rounds and see how it holds up.",
      "rating": 4.0,
      "verified": true,
      "author": "CKFlyboy",
      "helpful_votes": 25,
      "publication_date": 20170408
    },
    {
      "title": "Price and Quality",
      "text": "I used these to give away as golf event awards for my golf group. They were a big hit and this is to people who know their golf stuff. Price was very reasonable and quality excellent. I only wish I had the means of including a logo via embroidery. It’s an annual event so I will order again.",
      "rating": 4.0,
      "verified": true,
      "author": "TruthbKnown",
      "helpful_votes": 13,
      "publication_date": 20190103
    },
    {
      "title": "Works well, and is better than more expensive models.",
      "text": "There is no perfect bag as everyone has different needs, however, it replaced a more expensive and worn out bag, and is working just fine. Some complain about the putter tube being blocked by the cart strap, but as another user mentioned, just put the strap under it, and its fine. Great bag for the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Edward P.",
      "helpful_votes": 17,
      "publication_date": 20170425
    },
    {
      "title": "Good value",
      "text": "Nice bag for the price. Very nice color and adequate pockets for all your stuff. Bag is constructed of fairly light weight materials so it probably will not last very long but for the casual golfer it is fine. Only one thing bothered me. The strap interferes with the putter pocket when strapped to a golf cart.",
      "rating": 3.0,
      "verified": true,
      "author": "Christopher Gilcreast",
      "helpful_votes": 18,
      "publication_date": 20160901
    },
    {
      "title": "Too bad",
      "text": "After 4 outings, it's already starting to fray really poor workmanship",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 7,
      "publication_date": 20190806
    },
    {
      "title": "Great bag!",
      "text": "My husband and I unwrapped this golf bag when it was delivered! We were both impressed by the size, look and construction of it. It has individual club \"slots\" for all of my clubs. it also has sufficient pockets for tees, balls, sunscreen, and additional extras- including an insulated pocket for a cold beverage! I ordered the black and white bag and it is very good-looking. I would absolutely order this bag again and am very impressed by the quality for the money. It was shipped and arrived as promised in brand new condition.",
      "rating": 5.0,
      "verified": true,
      "author": "Tracy",
      "helpful_votes": 3,
      "publication_date": 20180730
    },
    {
      "title": "Great golf bag!",
      "text": "I try to read a lot of reviews before I purchase something on Amazon or anywhere else by mail. The ratings were good so I bought it. I've used it for several weeks this summer. Absolutely no complaints. Many bags that I looked at were $300 plus. The guys I golf with have Ping and Callaway bags and they commented on what a nice bag it is. I don't care about brand names as long as the product performs well. I would recommend this bag to everyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Trailer Park Boy",
      "helpful_votes": 0,
      "publication_date": 20191121
    },
    {
      "title": "Great value",
      "text": "Compared with other comparable golf bags, this is the best value. It's as large as any cart bag and has large and small pockets for everything you need to tote around the golf course. I use it with my electric push cart and it works well for that. On the wish list would be at least one ring to hang things on. Other than that, why pay twice as much for the same thing with a big-name brand name on it that your paying extra to advertise for them?",
      "rating": 5.0,
      "verified": true,
      "author": "JR_azon",
      "helpful_votes": 0,
      "publication_date": 20190701
    },
    {
      "title": "A Great Deal for the Price",
      "text": "Seems to be a great deal for the price and weight. Plenty of room for the clubs and all of my gear. The insulated pocket is large enough for a big Gatorade bottle. The issue of the cart strap interfering with the putter tube was solved by slipping the strap between the tube and the bag.It takes a second longer but saves a lot of frustration when pulling out the putter. If I had to redesign anything it would be the fastening system for the umbrella. It tends to come loose when transferring bag from car to cart. Small problem for a great bag.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20161018
    },
    {
      "title": "Nice looking bag but needs more grip room",
      "text": "The Prosimmon Tour 14 Way Cart Bag is a nice looking but, could be a little sturdier as it tends to bend if too much pressure is put on the top of it. I have mid-size grips on my woods, hybrids, and irons. With a senior grip on the putter it's mandatory to use the outside tube. The slots just barely accommodate the grips and they seem to get tangled up and not let some clubs go all the way to the bottom of the bag. I would think a bag like this would have had a sleeve for the umbrella and not just an adjustable rope loop which does not stay tight.",
      "rating": 4.0,
      "verified": true,
      "author": "boyduffer",
      "helpful_votes": 0,
      "publication_date": 20170827
    },
    {
      "title": "A very good buy.",
      "text": "Unfortunately the wrong item was shipped initially but a replacement arrived within 2 days or me re-ordering it. The seller was very prompt at addressing and fixing the error. The bag is very sturdy & of a good quality for the price. The only, slight, fault is that the carrying handle at the front constricts the access to the wedges a little. Apart from that it's perfect. Love the 'cool bag' pocket at the front, perfect for containing a cool drink when walking the course.",
      "rating": 4.0,
      "verified": true,
      "author": "M Greenwood",
      "helpful_votes": 0,
      "publication_date": 20180110
    },
    {
      "title": "Budget bag good for new golfers.",
      "text": "About as expected for the price. This bag works perfectly for the back of the cart. The materials feel a bit thin and cheap, but overall pretty decent. If you care about how expensive your bag looks, I would get something MORE EXPENSIVE. There is plenty of pocket space plus the drink pocket holds about 3 cans of beer with a little ice. The dividers are not bad either. Holds a full set of clubs no problem. This is perfect for new budget minded golfers. I will use this bag until I can't anymore the will get a nicer bag next time.",
      "rating": 4.0,
      "verified": true,
      "author": "J. Spoon",
      "helpful_votes": 3,
      "publication_date": 20170716
    },
    {
      "title": "Great Bag",
      "text": "Some great features. Looks really sharp and fairly well designed. Miss having external holder for extra balls but not too big of a deal. Cooler pouch is handy and well located. Hand hold near top of bag is a bit high for clubs but again, not a big issue. I since the bag will 'expire' sooner than previous ones I've had but would definitely consider buying another in a couple of years if I need to.",
      "rating": 5.0,
      "verified": true,
      "author": "AEM",
      "helpful_votes": 0,
      "publication_date": 20190506
    },
    {
      "title": "This bag is of poor quality and design.",
      "text": "Terrible bag. Yes, it was light weight and it was pretty. BUT, quality was horrid. Within a few weeks three zippers were useless leaving three compartments wide open. Also, the putter sleeve was position such that the golf cart strap would go right over the putter shaft, terrible design. This bag is going into the junk pile and replaced by anything but a Prosimmon.",
      "rating": 1.0,
      "verified": true,
      "author": "john slocum",
      "helpful_votes": 2,
      "publication_date": 20190430
    },
    {
      "title": "You Need This Golf Bag!",
      "text": "This is an awesome lightweight, but sturdy bag! I bought it for my grandson and he will not trade me for my name brand bag, which is much heavier. It also has a built-in cooler for a single beverage. This is the best bag I have ever encountered and much cheaper than all the others. I wish I found this before I bought the one I own.",
      "rating": 5.0,
      "verified": true,
      "author": "plot",
      "helpful_votes": 0,
      "publication_date": 20200719
    },
    {
      "title": "It's too small, and cheaply made",
      "text": "This bag didn't meet the requirements to be a cart bag. It's too small, smaller than my carry bag, the pockets aren't big enough to hold my gear. It is also cheaply made and very fragile. I returned it the same day I got it. Buy if you must. I myself do not recommend it. Thank you for reading..",
      "rating": 1.0,
      "verified": true,
      "author": "J. A. ",
      "helpful_votes": 0,
      "publication_date": 20200927
    },
    {
      "title": "Watch out for the putter tube",
      "text": "Decent bag; HOWEVER, after only 2 rounds, the bottom of the putter tube broke and my putter fell through. No, I did not slam the putter into the tube. Should you buy this bag, take a look at the bottom of the putter tube; you will notice how thin it is (not like the bottom of the main compartment. My recommendation is that you reinforce the bottom of the putter tube with Gorilla tape prior to use.",
      "rating": 2.0,
      "verified": true,
      "author": "GC",
      "helpful_votes": 0,
      "publication_date": 20200812
    },
    {
      "title": "Very nice, reasonably-priced bag",
      "text": "Very nice, reasonably-priced bag. It's replacing a Taylor Made bag, which was way too big, and starting to have issues with getting the clubs in and out easily. New bag a decent, manageable size, and very attractive. Colorful in a nice, low-key way.",
      "rating": 5.0,
      "verified": true,
      "author": "AC",
      "helpful_votes": 2,
      "publication_date": 20170725
    },
    {
      "title": "Good around bag",
      "text": "I like that there are fewer pockets. I tend to lose my stuff when I have too many pockets to look in. I wish there was an incline from the front of the bag to the rear, the top is a little flat and the clubs are sometimes hard to locate. A holder for a couple of balls on the outside of the bag would be nice.",
      "rating": 4.0,
      "verified": true,
      "author": "William Cavanaugh",
      "helpful_votes": 0,
      "publication_date": 20190706
    },
    {
      "title": "Great bag / Great price",
      "text": "I am Really happy with this bag. Very light. Well made. Great storage. I only golf on weekends so there won’t be a lot of wear and tear, but it looks like it can hold up. Having divided spacers for clubs is a big plus. They go 3/4 of the way down which is enough to do the job.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Oliver",
      "helpful_votes": 0,
      "publication_date": 20200318
    },
    {
      "title": "Better then the Taylormade bag it replaced",
      "text": "Bought this bag to replace a Taylormade bag I had bought for my wife a couple of years ago, that bag had the straps rip off and fray in less than a year and a half. This bag is much sturdier made and I'm sure half the price because it doesn't say \"Taylormade\" on the bag.",
      "rating": 5.0,
      "verified": true,
      "author": "Chazman1946Top Contributor: Watches",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "Looks nice.",
      "text": "I got my bag in a hurry which was great. First thing I did was take the clubs out of my old bag put them in the new bag still pretty light after all my clubs were in it. I took the rain cover that comes with the bag and tried it on the bag itself and it would not cover the handle on the front of the bag seems to be not big enough to cover all of the clubs and the bag itself. That’s why I am only giving it a four.",
      "rating": 4.0,
      "verified": true,
      "author": "Randy ",
      "helpful_votes": 0,
      "publication_date": 20200821
    },
    {
      "title": "Quality of the Zippers has improved.",
      "text": "This is the second time I have purchased this bag. Lots of pockets and compartments. First time purchased the zippers were low quality and broke soon after purchase. This time, the quality of the zipper vastly improved. This must be the best golf bag under $100. Compare with $150 quality bags.",
      "rating": 5.0,
      "verified": true,
      "author": "Dana Blister",
      "helpful_votes": 0,
      "publication_date": 20200809
    },
    {
      "title": "Very handsome and lightweight golfbag!",
      "text": "It's very lightweight, more so than other nylon bags Iv'e had. Very snappy looking, get many compliments. Love the assortment of pockets, way more than I need, especially the insulated chill pocket, for beverages, keeps 2 drinks frosty cold for hours.",
      "rating": 5.0,
      "verified": true,
      "author": "Wordman",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "Sturdy Cart Bag",
      "text": "I like the many pockets on this bag, especially the insulated one for cold drinks. They stay fairly cold, wish it was a deeper pocket. It holds 2 drinks comfortably. Nice design, color, and sturdy dividers for your clubs. For the price, what a deal!",
      "rating": 5.0,
      "verified": true,
      "author": "John Lindh",
      "helpful_votes": 0,
      "publication_date": 20190913
    },
    {
      "title": "Love this bag!",
      "text": "I wanted a lighter cart bag, and this answers the bill perfectly. It holds all my clubs, with a bigger pocket for the putter. I only wish they had put the handle in the BACK. Because it's in the front it kind of obscures the wedges. Lots of great pockets.",
      "rating": 4.0,
      "verified": true,
      "author": "MBGolfer",
      "helpful_votes": 0,
      "publication_date": 20190811
    },
    {
      "title": "Well organized. Great price.",
      "text": "It’s been years since I could walk and carry a bag, so I finally bought this cart bag. Good looking, fits on my walking cart beautifully, lots of storage pockets, and has separate compartments for 14 clubs. Used it yesterday and so far I love it. Also great price.",
      "rating": 5.0,
      "verified": true,
      "author": "iemusic",
      "helpful_votes": 0,
      "publication_date": 20200620
    },
    {
      "title": "Don't touch the drawstrings",
      "text": "I like the golf bag for its club dividers, its many pockets and room for umbrella. However, 2 drawstrings that are attached to the zippers broke as soon as I pulled on them. Like a hot knife through butter they just broke. Now it's not a big deal, I can still use the zipper but I just found it strange that the drawstrings literally broke into my hands.",
      "rating": 3.0,
      "verified": true,
      "author": "Scott Thomas",
      "helpful_votes": 0,
      "publication_date": 20180912
    },
    {
      "title": "What deal and great bag",
      "text": "I use this for both gas cart and push cart and it works great. The individual padded compartments for each club and separate putter tube exterior is exactly what I was looking for. Great price - value and performance - and well constructed and light weight.",
      "rating": 5.0,
      "verified": true,
      "author": "Alchemy",
      "helpful_votes": 0,
      "publication_date": 20200531
    },
    {
      "title": "Grandson's Golf Bag",
      "text": "My grandson picked out this Prosimmon Golf Bag for his 12th Birthday present. I was very happy with the fast response and delivery of the bag in time for his birthday. He loved it immediately and has already used it three time to play golf with his dad.",
      "rating": 5.0,
      "verified": true,
      "author": "Edward A. Brown",
      "helpful_votes": 0,
      "publication_date": 20200802
    },
    {
      "title": "Great bag for the bucks.",
      "text": "This bag is exactly what I was looking for ... inexpensive but not cheap. I particularly like the \"cold\" pocket, where I can keep a a couple of my favorite beverages cold and ready when needed. Plenty of storage for my shoes, jacket, hat, balls, etc.",
      "rating": 5.0,
      "verified": true,
      "author": "Jack S.",
      "helpful_votes": 0,
      "publication_date": 20200829
    },
    {
      "title": "Good value",
      "text": "This golf bag is very lightweight considering its not a carry bag. It has well thought out compartments and a lifting handle that I liked. Overall a good purchase so far. I cannot speak to durability yet since it is still relatively new.",
      "rating": 4.0,
      "verified": true,
      "author": "Jim P",
      "helpful_votes": 0,
      "publication_date": 20190626
    },
    {
      "title": "Started tearing after 10 months",
      "text": "It's a nice looking bag, but as I stated in the headline it is already starting to tear after less then 10 months of use Merchant is standing behind their product,replacing bag with a new one",
      "rating": 1.0,
      "verified": true,
      "author": "Joe K",
      "helpful_votes": 0,
      "publication_date": 20200323
    },
    {
      "title": "Lightweight",
      "text": "I don't like the positioning of the clubs. Woods and driver are in the front of the bag which to me seems backwards. However, they are easy to reach that way. Bag is very light and has plenty of storage.",
      "rating": 3.0,
      "verified": true,
      "author": "sofie",
      "helpful_votes": 0,
      "publication_date": 20200923
    },
    {
      "title": "Perfect - plenty of storage",
      "text": "Super light weight; lots of handy pockets/compartments for gear. I really like this bag.",
      "rating": 5.0,
      "verified": true,
      "author": "KT",
      "helpful_votes": 3,
      "publication_date": 20170902
    },
    {
      "title": "fine cart bag",
      "text": "I tried to find a bag with 2 outside tubes but settled for one outside tube. Since I am the primary I would have preferred the tube to be on the left side of the bag. Other than that it is a fine bag with plenty of storage space.",
      "rating": 4.0,
      "verified": true,
      "author": "Jerry",
      "helpful_votes": 0,
      "publication_date": 20200726
    },
    {
      "title": "Jumbo grips compatible",
      "text": "Being a golfer that has to use jumbo grips, this golf bag meets my requirements to the T. Even though the bag has 14 individual slots for the clubs, the jumbo grips fit them fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Antonio",
      "helpful_votes": 0,
      "publication_date": 20200228
    },
    {
      "title": "Golf bag to fit everyone's need...",
      "text": "I priced Golf bags at Discout stores, PGA Store and others. This product for the price is the Best Thing Going. Quality, value and shipped quickly, did not miss a round.",
      "rating": 5.0,
      "verified": true,
      "author": "Ed and Sue Enyedy",
      "helpful_votes": 0,
      "publication_date": 20200719
    },
    {
      "title": "What I expected",
      "text": "this bag was exactly what I wanted and for the money I am very happy. I use a cart and wanted a bag that had separators for each club. This bag is lightweight but not made cheap. It's a very attractive bag and fits perfect on my cart. Totally worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Dee W.",
      "helpful_votes": 0,
      "publication_date": 20180926
    },
    {
      "title": "Price",
      "text": "Love having individual slots for each club along with plenty of pockets. The price is by far the cheapest on the market without sacrificing quality",
      "rating": 5.0,
      "verified": true,
      "author": "Donald Lacombe",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "Christmas Gift",
      "text": "Just got the golf bag yesterday. This is the middle of Nov. so I will not be able to use till next spring. It will be aq Christmas gift to my son.",
      "rating": 3.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20181118
    },
    {
      "title": "Pro - light Con - the strap from the cart ...",
      "text": "Pro - light Con - the strap from the cart blocks the putter in the putter holder. Especially if you have a fat grip. The cart strap comes over the putter hold blocking the putter grip from coming out. It can be a handful to get your fat grip putter out of the putter holder.",
      "rating": 3.0,
      "verified": true,
      "author": "ross",
      "helpful_votes": 0,
      "publication_date": 20180801
    },
    {
      "title": "A lot of bag for the money!",
      "text": "Very good quality especially for the price. I replaced another bag whose putter well was too small for my Fatso grips and ring ball pickup. I have an Odyssey mallet putter and it fits quite well. Plenty of storage in the bag. I was a little disappointed at the size of the insulate pocket it probably will only hold an ice pack and a 2-3 cans but that is not a big down side. The divider top is nicely laid out and the other pockets and rings are well place. Overall a VERY good value at the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Jimmie the Bold",
      "helpful_votes": 0,
      "publication_date": 20180201
    },
    {
      "title": "great color (red /white)",
      "text": "this bag showed up 5 days earlier then expected, nicest bag i ever owned, great color (red /white), so much room for storage and even a insulated pocket to keep couple cans cold, awesome bag highly recommend it",
      "rating": 5.0,
      "verified": true,
      "author": "Durwud",
      "helpful_votes": 4,
      "publication_date": 20160819
    },
    {
      "title": "my golf clubs are now happy",
      "text": "The blue, white and black bag looks sharp. Don't expect to rough handle the zippers. Go slow and this bag will last a long time. Very happy with purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "oldgolferrelic",
      "helpful_votes": 0,
      "publication_date": 20190509
    },
    {
      "title": "Cart bag",
      "text": "I love that it has 14 slots for clubs, it’s lightweight and has plenty of pouches. It does seem top heavy when I carry the bag. May be able to fix with a strap adjustment",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Huttenlocher",
      "helpful_votes": 0,
      "publication_date": 20200905
    },
    {
      "title": "looks nice, returning it as it's a cart bag, not a stand bag",
      "text": "Bag seems nice, but haven't used it. I ordered the cart bag by mistake and was looking to exchange for a stand bag. It's a shame because they are charging me $14 to return. On principal, I'll buy something else.",
      "rating": 3.0,
      "verified": true,
      "author": "Bill Hueber",
      "helpful_votes": 0,
      "publication_date": 20181230
    },
    {
      "title": "Quality reflects price",
      "text": "You get what you pay for. Price reflects quality in this product. It looks good, good club dividers and has good pocket sizes and placement. But, the zippers are cheap and weak, and I can already tell that one or more of them will break before the end of this golf season. It is basically a 40 round of golf bag before you’ll need a new one.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190628
    },
    {
      "title": "Saved over $140",
      "text": "This bag is as good as my friend's Callaway Bag at $225. Plus, the dividers are full and it's what I wanted for my triple wrapped grips.",
      "rating": 5.0,
      "verified": true,
      "author": "Kerry McCullough",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "Great bags",
      "text": "Light, versatile, plenty of pockets and storage. Well designed, sleek look! Red and blue, nice colors.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20181203
    },
    {
      "title": "Good by for the money",
      "text": "This seems like a nice bag for the money. I wish it had a couple more pockets. I don't like the outside putter tube because my putter gets hung up on the club grip when withdrawing from the tube. Also, it works well with my left handed clubs.",
      "rating": 4.0,
      "verified": true,
      "author": "Ol'Kev",
      "helpful_votes": 0,
      "publication_date": 20171005
    },
    {
      "title": "Meh",
      "text": "Sorry, didn’t like some of the construction or the “tube” for the putter that many it awkward...plus delivery took too long.",
      "rating": 1.0,
      "verified": true,
      "author": "steve schwaid",
      "helpful_votes": 0,
      "publication_date": 20190910
    },
    {
      "title": "Great",
      "text": "Very nice little bag for the money lots of storage a small cooler to hold a couple of drinks I really like it Arrived in a short time",
      "rating": 5.0,
      "verified": true,
      "author": "Dan T.",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "Works great",
      "text": "We are far from pros. Just enjoy being outdoors and golfing for fun. This bag worked great for my husbands needs.",
      "rating": 5.0,
      "verified": true,
      "author": "CAK",
      "helpful_votes": 0,
      "publication_date": 20200912
    },
    {
      "title": "Works well",
      "text": "Bag appears to be of good quality and material. Received item on time. Using bag now and very happy with it.",
      "rating": 4.0,
      "verified": true,
      "author": "RD",
      "helpful_votes": 0,
      "publication_date": 20171122
    },
    {
      "title": "Cart Bag",
      "text": "Can't say enough about this cart bag. For the price, it is perfect. Did not want to pay upwards of $200 for a cart bag. For $90 or so, it is great. Has more than enough room for all 14 clubs PLUS it even has an external space for an umbrella. Quality is outstanding! I highly recommend this bag.",
      "rating": 5.0,
      "verified": true,
      "author": "Tank",
      "helpful_votes": 0,
      "publication_date": 20191116
    },
    {
      "title": "Good looking bag",
      "text": "Bought to replace a bag I've had for 20yrs. I've only had this bag for about a week but so far I am very pleased. Lightweight, plenty of storage compartments and rides well on my cart. Would recommend this product.",
      "rating": 4.0,
      "verified": true,
      "author": "Bob Cramer",
      "helpful_votes": 0,
      "publication_date": 20170827
    },
    {
      "title": "You’ll like this bag",
      "text": "Looking for a less expensive cart bag. This is but doesn’t look cheap. 14 inside slots for clubs plus an outside putter slot. Great bag",
      "rating": 5.0,
      "verified": true,
      "author": "XCC",
      "helpful_votes": 0,
      "publication_date": 20190621
    },
    {
      "title": "Good Cart Bag",
      "text": "The first one I bought, the inner lining wasn't sealed right. When I pulled a club out,it would get snagged on the lining which started to come out with the club.I reported it to the company and they graciously gave me a new one!",
      "rating": 5.0,
      "verified": true,
      "author": "Dickson Fong",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "This golf bag is trash.",
      "text": "Weak and very flimsy. I would not buy this golf bag or recommend anyone to buy it. It’s a disposable golf bag at best.",
      "rating": 1.0,
      "verified": true,
      "author": "Efren Munoz",
      "helpful_votes": 3,
      "publication_date": 20190613
    },
    {
      "title": "Graves",
      "text": "Bought this for husband's birthday. He really likes it, very lightweight and convenient. a place for everything.",
      "rating": 5.0,
      "verified": true,
      "author": "kegraves",
      "helpful_votes": 3,
      "publication_date": 20170123
    },
    {
      "title": "I really like it, but have only had it a couple days...",
      "text": "The bag is really light weight and I like the separate putter holder...I just got it, so I can't give it a complete review",
      "rating": 5.0,
      "verified": true,
      "author": "Naomi",
      "helpful_votes": 0,
      "publication_date": 20200608
    },
    {
      "title": "Great bag!",
      "text": "Although I've only had it for a few months, this bag is awesome. Very light, plenty of room for anything you need and keeps the clubs organized which is what I bought it for. No complaints here for a decently priced bag.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Denke",
      "helpful_votes": 0,
      "publication_date": 20201021
    },
    {
      "title": "Great Golf Bag",
      "text": "Really nice golf bag. I use it on a golf cart it is very light weight, nice looking, got the blue one. Exceptional value for this golf bag.",
      "rating": 5.0,
      "verified": true,
      "author": "Beach Girl",
      "helpful_votes": 0,
      "publication_date": 20200804
    },
    {
      "title": "lightweight",
      "text": "Damn good bag for the money...we'll see about long term durability but right now, very very satisfied.",
      "rating": 4.0,
      "verified": true,
      "author": "popeye",
      "helpful_votes": 0,
      "publication_date": 20200724
    },
    {
      "title": "High quality bag",
      "text": "For a basic bag this perfect and shows off its colors. The shaft holes are large enough.",
      "rating": 5.0,
      "verified": true,
      "author": "Suds",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "Really nice bag for the money",
      "text": "This is a really nice golf bag for the money. It’s lightweight, and has all the compartments that I need for my stuff.",
      "rating": 5.0,
      "verified": true,
      "author": "mp",
      "helpful_votes": 0,
      "publication_date": 20190830
    },
    {
      "title": "Wish it would have worked",
      "text": "Received wrong color. It was suppose to be for a gift so ended up having to return since the color sent wouldn’t work.",
      "rating": 1.0,
      "verified": true,
      "author": "Autumn",
      "helpful_votes": 0,
      "publication_date": 20201002
    },
    {
      "title": "Love me new bag...",
      "text": "I needed a cart bag with the club slots to replace the \"walking\" bag. Glad I found this one.",
      "rating": 5.0,
      "verified": true,
      "author": "KELLY",
      "helpful_votes": 0,
      "publication_date": 20190829
    },
    {
      "title": "good bag for the price",
      "text": "I like the handle at the top of the bag, but a strap or another place to grab the bag in the middle would be very useful for taking the bag out of my vehicle, i.e. need to grab the bag in 2 places to move/lift it in & out of my vehicle.",
      "rating": 4.0,
      "verified": true,
      "author": "Michael Dossett",
      "helpful_votes": 0,
      "publication_date": 20190712
    },
    {
      "title": "has plenty of room and at a good price for a cart bag",
      "text": "Bag is what I expected, has plenty of room and at a good price for a cart bag. Really like the out the bag putter holder.",
      "rating": 5.0,
      "verified": true,
      "author": "golfer71",
      "helpful_votes": 0,
      "publication_date": 20170904
    },
    {
      "title": "So far so good. My last back was Arnold Palmer bag that ...",
      "text": "So far so good. My last back was Arnold Palmer bag that was well over 25 years old, so this was a definite up grade. The club slot orientation was circular and the new one is square it will take awhile for me to get used to the new positions. plenty of pockets and space for every golf gadget.",
      "rating": 5.0,
      "verified": true,
      "author": "Brownsbacker53",
      "helpful_votes": 0,
      "publication_date": 20170919
    },
    {
      "title": "Problem with the bottom lift strap after 3 days use",
      "text": "I like overall product, but 3 days and the bottom lift strap came apart from the grommet holding it. Otherwise attractive and very light, numerous pockets. I did mickey mouse the strap bock together by drilling a hole and fastening it with ty raps.",
      "rating": 4.0,
      "verified": true,
      "author": "joegill",
      "helpful_votes": 0,
      "publication_date": 20190123
    },
    {
      "title": "Happy Hubby",
      "text": "Bought it for my husband. He is very happy about the purchase. Lite weight. Has different compartments and he liked that it had to handles for getting it out of the car",
      "rating": 4.0,
      "verified": true,
      "author": "M. Eddlemon",
      "helpful_votes": 0,
      "publication_date": 20170723
    },
    {
      "title": "Almost Perfect Fit",
      "text": "This bag was just what I was looking for. The outside putter tube makes for easy access to the most used club in the bag. My only negative is the lack of additional pockets. But for the price most users would be satisfied with the bag as is.",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer jeannie macek",
      "helpful_votes": 0,
      "publication_date": 20160908
    },
    {
      "title": "Good storeage and light weight",
      "text": "Light weight and hopefully holds up and doesn’t tear anywhere!!",
      "rating": 5.0,
      "verified": true,
      "author": "Joe LaLonde",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "Five Stars",
      "text": "Perfect for all 14 of my clubs. The zippers work very smooth and don't jam. Important to me.",
      "rating": 5.0,
      "verified": true,
      "author": "r c cunningham",
      "helpful_votes": 0,
      "publication_date": 20180517
    },
    {
      "title": "WOW",
      "text": "I couldn’t have ask for anything better. Thank you. S. Bishop Gaddy",
      "rating": 5.0,
      "verified": true,
      "author": "Northal",
      "helpful_votes": 0,
      "publication_date": 20190706
    },
    {
      "title": "that it is worth the wait!",
      "text": "i loved the color and the person i gave it to loved it!!!!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Loretta Hamby",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "Good Value",
      "text": "Reasonably priced, and the putter tube makes the bag a favorite.",
      "rating": 5.0,
      "verified": true,
      "author": "L. Frenz",
      "helpful_votes": 0,
      "publication_date": 20181006
    },
    {
      "title": "Received Wrong Color",
      "text": "The choice if colors was not clear, thus I didn't get the color I wanted. I won't send it back, but I would have been much happier with the colors I wanted.",
      "rating": 3.0,
      "verified": true,
      "author": "Ron Avant",
      "helpful_votes": 0,
      "publication_date": 20180713
    },
    {
      "title": "I am very pleased with this purchase",
      "text": "The bag was exactly as described. I am very pleased with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Bob Nite",
      "helpful_votes": 5,
      "publication_date": 20160201
    },
    {
      "title": "Good value for the frugal duffer",
      "text": "Fair price, an opening foreach of my clubs so they really don't bump against themselves .the bag has more than enough pockets for what you really need to carry and the beverage pocket is easy to each up front of bag. Enough for two cans a an ice pack. Very satisfied.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170905
    },
    {
      "title": "Great bag for the money!",
      "text": "The Prisimmon golf bag is a great bag to start with and at an incredible price. It has everything I was looking for in a cart bag including an additional separate tube for the putter. Easy to organize your clubs and a good looking bag to top it off.",
      "rating": 5.0,
      "verified": true,
      "author": "Douglas Foster",
      "helpful_votes": 0,
      "publication_date": 20190422
    },
    {
      "title": "Very good bag",
      "text": "Bag has lots of pockets and is as good as bag costing 3 times as much",
      "rating": 5.0,
      "verified": true,
      "author": "Bud",
      "helpful_votes": 0,
      "publication_date": 20190709
    },
    {
      "title": "Nice bag for the value",
      "text": "I bought this bag for my husband and he was completely satisfied. The top pocket is a little small but overall a good bag.",
      "rating": 5.0,
      "verified": true,
      "author": "Kimberly",
      "helpful_votes": 0,
      "publication_date": 20200920
    },
    {
      "title": "what a nice bag. The compartment for the water bottles could ...",
      "text": "what a nice bag. The compartment for the water bottles could use some more insulation. Keeps water cool but not cold.",
      "rating": 5.0,
      "verified": true,
      "author": "Frank Sclafani",
      "helpful_votes": 0,
      "publication_date": 20180824
    },
    {
      "title": "all my golf stuff fits in the bag and it is easy to find the in the various slots and pockets",
      "text": "the golf bag completely fills my needs. all my golf stuff fits in the bag and it is easy to find the in the various slots and pockets. the bag is light weight and looks great.",
      "rating": 5.0,
      "verified": true,
      "author": "ALKAP",
      "helpful_votes": 0,
      "publication_date": 20171005
    },
    {
      "title": "Good Value",
      "text": "Good value for the money, could use a few more tee holders on the bag. Only has space for 3",
      "rating": 5.0,
      "verified": true,
      "author": "John P",
      "helpful_votes": 0,
      "publication_date": 20190823
    },
    {
      "title": "Great Deal",
      "text": "Great bag with nice pockets, wish the water cooler was bigger. We will see how it last. I think it's a great deal for the money.",
      "rating": 4.0,
      "verified": true,
      "author": "BigTreayDay",
      "helpful_votes": 0,
      "publication_date": 20190523
    },
    {
      "title": "Won’t buy again. Cheap in all meaning.",
      "text": "Light weight but also poorly made. Started tearing and zippers broke three months ago and I’m just now getting around to reviewing.",
      "rating": 2.0,
      "verified": true,
      "author": "kris sulonen",
      "helpful_votes": 0,
      "publication_date": 20200928
    },
    {
      "title": "Golf",
      "text": "Very functional exactly what I wanted in a cart bag.",
      "rating": 5.0,
      "verified": true,
      "author": "jt236",
      "helpful_votes": 0,
      "publication_date": 20200221
    },
    {
      "title": "Good value",
      "text": "Good value for the price. Very lightweight, club dividers and pockets are all good. Not sure how durability will be since it's so lightweight. Pretty small cooler pocket; can maybe hold four cans without an icepack.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike C",
      "helpful_votes": 0,
      "publication_date": 20190703
    },
    {
      "title": "Bag’s got all you need!",
      "text": "This bag is perfect with all the dividers & pockets. Great value & well made. Very happy with purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "MJF",
      "helpful_votes": 0,
      "publication_date": 20190719
    },
    {
      "title": "Good looking bag for a good looking price.",
      "text": "Even my usual comatose golf buddies noticed my sleek new bag.",
      "rating": 5.0,
      "verified": true,
      "author": "Joseph Fronius",
      "helpful_votes": 0,
      "publication_date": 20180812
    },
    {
      "title": "Great Cart Bag",
      "text": "played one round with it and ALL IS GOOD. Priced right",
      "rating": 5.0,
      "verified": true,
      "author": "Jim Fitch",
      "helpful_votes": 0,
      "publication_date": 20190925
    },
    {
      "title": "Keeps drinks cool but stains easily",
      "text": "Great looking bag until it gets rained on then it stains bad. The cooler fits 4 12oz cans or 2 large twisted teas. Very good amenity.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200726
    },
    {
      "title": "Lightweight and holds everything a golfer needs",
      "text": "Awesome bag that holds all my clubs and golf paraphernalia. Club slots keep each club separate and doesn’t allow for any entanglement.",
      "rating": 5.0,
      "verified": true,
      "author": "H. Feig",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "Not impressed",
      "text": "Not good quality, won't stand up on its on. Hope it last a year, guess I got what I paid for.",
      "rating": 2.0,
      "verified": true,
      "author": "B. Anderson",
      "helpful_votes": 0,
      "publication_date": 20200108
    }
  ],
  "product_meta": {
    "title": "PROSiMMON Tour 14 Way Cart Golf Bag",
    "description": "This cart bag from Prosimmon Golf offers a 14 way divider top, perfect for keeping your clubs perfectly organized and exactly where you expect them to be. \n\n14 way dividers \nPlenty of zippered pockets including: \n1 deep ball pocket \n1 small accessory/tee pocket \n1 fur lined valuable pocket \n2 full length side pockets – perfect for waterproofs and clothing \n1 insulated drinks pocket \nExternal putter tube if you prefer to store your putter externally – great for putters with larger heads \nVelcro glove holder \nGolf towel ring \nExternal umbrella strap \nWeight – 5.3 Lbs \nRainhood included",
    "rating": 4.5,
    "feature_bullets": [
      "14 way dividers",
      "Plenty of zippered pockets",
      "External putter tube if you prefer to store your putter externally – great for putters with larger heads",
      "Velcro glove holder",
      "Golf towel ring, External umbrella strap"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "July 15, 2015",
      "Manufacturer": "Prosimmon",
      "ASIN": "B011O6Q3HM",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Sports & Outdoors",
      "Sports & Fitness",
      "Golf Club Bags",
      "Cart Bags",
      "Golf"
    ],
    "price": 99.99
  }
}