{
  "website_summaries": [
    {
      "verdict": "This elegant, plush headboard is accented with faux crystals and really dresses up your room.",
      "pros": [
        "Scalloped silhouette",
        "Upholstered plush headboard with faux crystal button-tufting design",
        "Black legs",
        "Adjustable headboard legs with pre-drilled holes",
        "Beautiful, high-end look",
        "Choice of color",
        "Easy to assemble"
      ],
      "cons": [
        "May arrive with a plastic odor that should fade"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Elegant and Classy Headboard",
      "text": "This headboard is absolutely perfect. I love love love it. The details are wonderful and I love the crystals in the tuffs. This is a very classy and elegant item that will definitely be the focal point in your bedroom. I have no complaints at all. It is wonderful.",
      "rating": 5.0,
      "verified": true,
      "author": "Whitney Baker",
      "helpful_votes": 76,
      "publication_date": 20160129
    },
    {
      "title": "Absolutely stunning",
      "text": "Photos do this headboard NO justice! Contrary to the mixed reviews I purchased this headboard to revamp my 12yr olds room. It was packaged very well and although we will not set it up just yet I did look it over and there are no dings to the faux leather and all the rhinestones are in place! My heart was set on black but the white looks so beautiful I want to convince my fiancé to let me buy one for our room! (Please excuse my photos, I just wanted to be able to show how pretty it was)",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 31,
      "publication_date": 20180102
    },
    {
      "title": "Very dissapointing",
      "text": "Really dissapointed. The product came completely damaged with several holes in the fabric and the box was ripped apart. The bolts were just thrown in the box and not in any kind of bag to keep them together ans on top of that the bolts don't even fit. What a waste of money. Amazon wants me to send it back for a refund, but the box is pretty much obliterated so I'm out almost 90$.",
      "rating": 1.0,
      "verified": true,
      "author": "Michelle Pardy",
      "helpful_votes": 10,
      "publication_date": 20171110
    },
    {
      "title": "I am in love with this headboard",
      "text": "I over love this headboard! It’s perfect. The color is perfect and the rhinestones are beautiful without being to much. You can adjust the headboard height to fit your needs and I love that it looks fabric but is a faux leather so you don’t have to worry about getting it dirty!",
      "rating": 5.0,
      "verified": true,
      "author": "Zoe",
      "helpful_votes": 11,
      "publication_date": 20171115
    },
    {
      "title": "Love the headboard",
      "text": "I love this headboard but I needed to take away a star for the legs. It is made out of wood and very flimsy. However, the headboard itself is very pretty and well made... It looks like a linen material. I bought it in gray and it was very easy to assemble. I currently use the sleep master bed base and did not have to buy the brackets - I just leaned the headboard against the wall and put my bed up against it.",
      "rating": 4.0,
      "verified": true,
      "author": "Leilani",
      "helpful_votes": 27,
      "publication_date": 20160803
    },
    {
      "title": "Nauseating smell",
      "text": "My love-hate relationship with this headboard. Fell in love with the shape, just beautiful. As soon as I opened the package, I noticed a nauseating smell from the plastic. Tried to air the headboard out a few days, and as soon I put it in my bedroom, the smell is still there, stronger than before; it gives me a headache, and sleep is impossible. Back it goes.",
      "rating": 1.0,
      "verified": true,
      "author": "sun made",
      "helpful_votes": 6,
      "publication_date": 20171123
    },
    {
      "title": "DON'T ORDER THIS",
      "text": "This arrived and we were unable to install it until the actual bed arrived, which was delayed. When we opened the box, headboard was fine, but the legs and all hardware and instructions were missing. The headboard is USELESS without legs and we are now past the return date. This is ridiculous and a waste of money due to something we had no control over. We just want our money back since the item is unusable without legs.",
      "rating": 1.0,
      "verified": true,
      "author": "Gdert9",
      "helpful_votes": 2,
      "publication_date": 20190227
    },
    {
      "title": "What a nice Headboard. It goes perfectly with the Zinus Bed ...",
      "text": "What a nice Headboard. It goes perfectly with the Zinus Bed Frame i bought and the brackets that are recommenced... I am so happy with the way it looks... Very easy to put together and looks high end.",
      "rating": 5.0,
      "verified": true,
      "author": "Meghane D.",
      "helpful_votes": 14,
      "publication_date": 20161118
    },
    {
      "title": "Works great for adjustable base beds",
      "text": "This headboard looks very nice and was easy to install. Our adjustable base does not allow us to have a normal base set up, so this solo headboard works perfectly and matches the gray base that holds our mattress. I saw the exact same headboard for almost double the price on another website. Glad I looked on Amazon before purchasing.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon User",
      "helpful_votes": 3,
      "publication_date": 20190813
    },
    {
      "title": "NO HARDWARE INCLUDED",
      "text": "It's 9 o'clock at night and go to add this headboard to my current bed frame as I have guests waiting to get in bed. Well, there's NO HARDWARE. I have scoured the box, all the packaging, the headboard itself (since sometimes they seal hardware inside) but NO. Nothing. So now since we're also in the midst of a pandemic, I can't even go to Home Depot to get parts. What a waste of a purchase.",
      "rating": 1.0,
      "verified": true,
      "author": "Julie S.",
      "helpful_votes": 2,
      "publication_date": 20200327
    },
    {
      "title": "SO PRETTY!",
      "text": "Just the touch I needed for my bedroom. Easy to assemble but it doesn't align with my platform frame but that was my fault for not reading the details. I still managed to make it work.",
      "rating": 5.0,
      "verified": true,
      "author": "Liza Lopes",
      "helpful_votes": 5,
      "publication_date": 20181110
    },
    {
      "title": "LOVE!",
      "text": "Bought this for my 13-year old daughter and she LOVES it! I love it too! It is so much prettier in person... very classy and \"glam\"! Fabric is very soft, and the rhinestone buttons make the perfect accent! Took my sister and I about 5 minutes to install it to my daughter's standard bed frame. Wish my husband would let me do rhinestones in our bedroom because I would order another one!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa",
      "helpful_votes": 7,
      "publication_date": 20160929
    },
    {
      "title": "Just 🤩 simply breath taking",
      "text": "Wooooow is all I can say. This is absolutely breath taking. Bout this for my daughter to match her diamond chandelier and it’s so beautiful. A must buy. I look I’m so many sites for a rhinestone headboard and they were soooo over priced. I’m so glad I look on amazon. They never let me down. phenomenal price.",
      "rating": 5.0,
      "verified": true,
      "author": "MARYANNBOWERS",
      "helpful_votes": 0,
      "publication_date": 20200425
    },
    {
      "title": "Beautiful",
      "text": "It is well made and beautiful. The legs to the headboard look nice but not the best, but worth buying anyway. It did not come with the nuts and bolts to attach the head board to my frame. The description says it comes with the parts, but mine were missing. Also, I didnt notice until I made a couple of trips to town getting wrong screws that there is a pdf for instructions to download in the description. The pdf will possibly save a extra trip to the store.",
      "rating": 4.0,
      "verified": true,
      "author": "Janie Dzona",
      "helpful_votes": 0,
      "publication_date": 20200326
    },
    {
      "title": "Very happy",
      "text": "I like the fact that the legs are wood. We may decide to cut a little off to allow the bottom of the headboard to sit below the mattress edge. Really amazing that I could get a headboard shipped for the cost. Excellent value. I added some felt chair leg protectors to keep the headboard from damaging the wall, as it sits up tight against the baseboard, but would flop against the wall if someone leaned on it. This is partly because of the frame attachment flexing, and the headboard flexing. Works great tho.",
      "rating": 5.0,
      "verified": true,
      "author": "aldridgec",
      "helpful_votes": 0,
      "publication_date": 20190217
    },
    {
      "title": "Good purchase",
      "text": "I got this headboard to go along with my adjustable bed. It is secured to the wall. I have it for a while and it still looks clean, new, and that’s something considering I have cats and all the jewels are still in place. The mattress rubs against it sometimes, it is holding up pretty well. If you have any questions or found this review useful, please let me know 💖",
      "rating": 5.0,
      "verified": true,
      "author": "Smoothie",
      "helpful_votes": 2,
      "publication_date": 20181218
    },
    {
      "title": "In love!!!",
      "text": "Awesome quality. The little \"rhinestones\", as I call them, aren't about to fall off and they feel pretty intact inbetween the tufts. The leather material on this is amazing and looks sleek. It was a bit difficult to attach to my platform even though it's the right one. Just look at the dimensions and compare them with your bed platform dimensions first. I still made it work because I'm in love with this headboard! It also seems like it's going to last a long time!",
      "rating": 5.0,
      "verified": true,
      "author": "AmazonCustomer",
      "helpful_votes": 2,
      "publication_date": 20181113
    },
    {
      "title": "Made well, looks great, and fits well",
      "text": "Looks good on a queen frame. The vinyl needs something to prevent squeaking when a pillow slides along it. I'm thinking of removing it and cutting a couple inches off the rail bottoms to close the gap between the mattress and the bottom of the board. Looks very mid century modern for our bedroom.",
      "rating": 4.0,
      "verified": true,
      "author": "destryer",
      "helpful_votes": 0,
      "publication_date": 20180903
    },
    {
      "title": "Easy to add to a regular bed frame",
      "text": "I was able to use the included hardware to install the headboard to my metal bed frame. They must have gotten wise to hardware going missing, because it was included in a hefty bag which was attached to the box with a sturdy string. It looks lovely installed and in combo with my purple and black bedding, it finally looks like an adult lives in my bedroom.",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel",
      "helpful_votes": 0,
      "publication_date": 20200301
    },
    {
      "title": "Nice and as described.",
      "text": "I purchased the full/queen size for a full mattress and it fits nicely. Worked well with my existing frame and came with the hardware for connecting. I was able to put together myself without help in less than 30 min. This was for a teenage girl and she likes it. My only complaint would be is that it is slightly wobbly and does hit the wall if sat against since there is the posts for attaching it can't be flush to the wall. I think that some sticky felt pads on the posts may solve this problem.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "Luxurious and affordable",
      "text": "This is a gorgeous headboard. It looks very high-end and expensive. It has great padding and it was easy to attach it to the bed. It adds luxury to the bedroom at a very affordable price.",
      "rating": 5.0,
      "verified": true,
      "author": "Heather",
      "helpful_votes": 2,
      "publication_date": 20190119
    },
    {
      "title": "LOVE LOVE LOVE this!",
      "text": "I ordered the black with crystal pins. LOVE LOVE LOVE this!!!! Great price and great quality. Set up was super easy. First order came without hardeware but they let me return it free of charge and sent a new one that arrived a few days later. Love this head bored and the glamorous look it gives my bedroom!",
      "rating": 5.0,
      "verified": true,
      "author": "Kristy Britton",
      "helpful_votes": 0,
      "publication_date": 20171023
    },
    {
      "title": "Beautiful headboard",
      "text": "I purchased this for my daughter she really loves the diamond studs that are in it. Also she wanted a headboard that wasn’t cloth so this headboard is perfect for her. When we first ordered the headboard it came but not with any screws so Amazon went ahead and re-order died for me. So the headboard finally came again today and it had the screws! We were very happy about that. The only con was that the headboard does not come with any instructions. But for the most part I could say based on the amount of money we paid for the headboard it was worth the value.",
      "rating": 4.0,
      "verified": true,
      "author": "Terri H.",
      "helpful_votes": 0,
      "publication_date": 20200428
    },
    {
      "title": "Beautiful headboard",
      "text": "I needed bigger bolts than were provided but everything else was great and the headboard is beautiful. We bought a very thick sturdy frame that just needed a longer bolt. My daughter LOVES it. Wish they stocked it in twin, but found that one on the Walmart site for my younger daughter and it is beautiful too.",
      "rating": 5.0,
      "verified": true,
      "author": "Melanie",
      "helpful_votes": 0,
      "publication_date": 20200528
    },
    {
      "title": "Pretty Headboard",
      "text": "Bought this for my 11 year old daughters bed for Christmas. It’s February and the headboard Is holding up nicely. She’s not rough on her bed so I would expect it to last for quite a while. Younger kids that may be tougher on it i can see where it could get broken. Overall it’s really pretty in her room and she loves it.",
      "rating": 4.0,
      "verified": true,
      "author": "A.Marie",
      "helpful_votes": 0,
      "publication_date": 20190227
    },
    {
      "title": "Not Tacky",
      "text": "I was hesitant about this headboard because I was afraid it might look tacky being “faux” leather with rhinestone embellishment and for such a good price. It’s absolutely adorable and I love it. It came with all the hardware and instructions unlike many people reported were missing.",
      "rating": 5.0,
      "verified": true,
      "author": "Betty Baker ",
      "helpful_votes": 0,
      "publication_date": 20200302
    },
    {
      "title": "Much nicer than I expected",
      "text": "This is a beautiful, well-made headboard. I love bling, so the rhinestones are perfect for me. It was very easy to assemble and looks much more expensive than it was. The bed frame I bought fit it perfectly, and I love that the height is adjustable. I would highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Joanne V. Ambrose",
      "helpful_votes": 0,
      "publication_date": 20191026
    },
    {
      "title": "SUPER FLIMSY",
      "text": "The headboard is super flimsy but it's cute that's the only reason i really kept it and my dad knew how to set it up to where it would have some sturdiness to it. But it's definitely not worth the price I bought it for. Sorry i don't have pics. It looks just like the picture, black faux leather with the rhinestones. I kept it because it goes good with my bed set, other than that i would be shipping right back !!",
      "rating": 3.0,
      "verified": true,
      "author": "Danielle",
      "helpful_votes": 0,
      "publication_date": 20190805
    },
    {
      "title": "Great Buy!",
      "text": "The headboard arrived earlier than expected!! The box was a little banged up but the headboard wasn't damaged in any way. For the price it is perfect. I would agree with other reviews, the color seems to have a greenish tint to it but still grey. It looks perfect and you can't beat the price!! Happy with my purchase!",
      "rating": 4.0,
      "verified": true,
      "author": "BellaBoo",
      "helpful_votes": 0,
      "publication_date": 20181017
    },
    {
      "title": "Great headboard great price!",
      "text": "Bought as a Christmas present for my teenage daughter. She loves it. Very easy to assemble and install. This is the 2nd headboard I’ve purchased from Baxton. The 1st one was also a Christmas present a few years ago for my other daughter. Both are very please. My step sons girlfriend also likes them. I told her to check out this brand for sure. Both headboards were just under $100. Great price in my opinion.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Ann",
      "helpful_votes": 0,
      "publication_date": 20200218
    },
    {
      "title": "Love this headboard",
      "text": "This is a super cute headboard! My 7yo daughter loves it, especially bc of the diamond button tufting. The faux leather feels thick and durable, and its MATTE so it gives the look of real leather. The best part is that you can wipe it down! Anyone who it human can appreciate that, and especially if you have kids. It looks just like the picture.",
      "rating": 5.0,
      "verified": true,
      "author": "Eve",
      "helpful_votes": 0,
      "publication_date": 20190223
    },
    {
      "title": "Love this headboard! Great material!",
      "text": "This is a fabulous piece! The sparkles are beautiful! I love the color and easy assembly! The delivery driver took this to the wrong house and the people would not give it back. My granddaughter was so sad. Amazon sent us a new one within a couple of days! What a great company!",
      "rating": 5.0,
      "verified": true,
      "author": "Joy Henderson",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "Beautiful",
      "text": "Screws dont come with hard for a lary like myself to find; even harder when looking for screw to fit it to rails 🤦🏽‍♀️ other than that its perfect",
      "rating": 5.0,
      "verified": true,
      "author": "CokeyTrav",
      "helpful_votes": 0,
      "publication_date": 20190917
    },
    {
      "title": "Cute headboard",
      "text": "This is a cute headboard, but not quite as stable as I would like. The wood pieces are securely attached, but I feel like it still has too much give. Overall, I really like this headboard for decoration. If you are looking for something that you could actually lean against (watch tv, read a book, etc) I would recommend trying to find one with a sturdier frame.",
      "rating": 4.0,
      "verified": true,
      "author": "Tarah",
      "helpful_votes": 0,
      "publication_date": 20190811
    },
    {
      "title": "Bad smell",
      "text": "I have had the headboard for 4 months already and still can’t get the smell out. The head board has a chemical smell since I bought it and thought maybe the smell would go away. I have tried everything to get the smell out and it will not go away.",
      "rating": 1.0,
      "verified": true,
      "author": "M. Salinas",
      "helpful_votes": 3,
      "publication_date": 20190521
    },
    {
      "title": "Thumbs up",
      "text": "Seriously the easiest addition to make your room feel and look luxurious... it came quickly and was effortlessly to put together and attach to a frame previously purchased nonissue here see how it hold up !!",
      "rating": 5.0,
      "verified": true,
      "author": "raychael",
      "helpful_votes": 0,
      "publication_date": 20190807
    },
    {
      "title": "Bargain find!",
      "text": "Super cute and half the price of other sites! I didn't take the best picture, but please believe it looks great in person. The gray material does have a tiny bit of shimmer to it, which I wasn't expecting, but it's subtle and doesn't make it less attractive. It seems very sturdy and the material appears to be of good quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Gina",
      "helpful_votes": 0,
      "publication_date": 20200311
    },
    {
      "title": "Missing pieces says Queen but doesnt fit queen!",
      "text": "I just recieved my package sitting wide open on my door step. No hardware to be found. I cant put it together. The box says hardware included but theres bothing in there but the two wooden parts and head board. ALSO days queen and doesn't fit my queen bed frame? Useless. Smells of formaldehyde as well.",
      "rating": 1.0,
      "verified": true,
      "author": "kristen",
      "helpful_votes": 0,
      "publication_date": 20181105
    },
    {
      "title": "BRIGHT WHITE, MAJESTIC, GREAT QUALITY",
      "text": "This is pure white color (not cream or milky white).. the diamonds are very sparkly and pretty.. the shape is very very unique and looks very majestic.. incredibly quality.. I love this headboard.. it made my old boring bed look great! Totally worth buying !!",
      "rating": 5.0,
      "verified": true,
      "author": "PGT",
      "helpful_votes": 0,
      "publication_date": 20190912
    },
    {
      "title": "great looking headboard!",
      "text": "Bought this as a prop for my boudoir photography studio - it looks fantastic. Am looking to buy another style in a darker color for variation, but would definitely recommend and would buy Braxton Studio again.",
      "rating": 4.0,
      "verified": true,
      "author": "Rich Cirminello",
      "helpful_votes": 0,
      "publication_date": 20190317
    },
    {
      "title": "Can't even put it on the bed frame!",
      "text": "This headboard is gorgeous, but it didn't come with the wooden supports or bolts! Unacceptable! So now, I try to use the \"customer service\" link to their website via Amazon, and the stupid link doesn't work! Add these facts onto the fact that the headboard is now \"temporarily out of stock\" and who knows if and when I will get the parts I need. Very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200517
    },
    {
      "title": "Beautiful Headboard",
      "text": "I love it! I put it in my guest room. It worked great with the recommended attachments for my metal frame. I put it together and attached it by myself. I'll let you know if it holds up to the test!",
      "rating": 5.0,
      "verified": true,
      "author": "Jen Limehouse",
      "helpful_votes": 0,
      "publication_date": 20190417
    },
    {
      "title": "Luxury look for less! They loved it!",
      "text": "Got this for my daughters room. I have a 13 year old and 3 year old that share a bed and they both absolutely love it. Looks way more expensive than it really is. Gave it a nice feminine touch to their metal bed frame. They have the 14\" smartbase metal bed frame. Either Zinus or Amazon brand I cant remember which one. I think its Amazon Basics one. We attached the headboard to the bed frame using the Zinus brackets (sold separately) only like 9 bucks and it worked marvelously. Me and my 13 year old girl did it all by ourselves. My hubby walked in towards the end and was impressed. Super simple.",
      "rating": 5.0,
      "verified": true,
      "author": "Sacha Conde",
      "helpful_votes": 0,
      "publication_date": 20180412
    },
    {
      "title": "I purchased this with the frame it recommended but it didn't align so not sure why it ...",
      "text": "I purchased this with the frame it recommended but it didn't align so not sure why it was recommended. My only issue that I have is that the headboard hits my wall every time I move so I have to add a blanket. Wish there was something to make it sturdy.",
      "rating": 3.0,
      "verified": true,
      "author": "Elizabeth P.",
      "helpful_votes": 0,
      "publication_date": 20170607
    },
    {
      "title": "It kinda thin and short, plus it has a ...",
      "text": "It kinda thin and short, plus it has a heavy plastic odor. I had to vent it for a week so I can bring it to the bedroom without getting a headache. Can't complain too much and didn't return because of the price. I would have given it 4 stars had it not been so stinky in the beginning .",
      "rating": 3.0,
      "verified": true,
      "author": "jane",
      "helpful_votes": 0,
      "publication_date": 20171130
    },
    {
      "title": "Awesome head piece, very elegant.",
      "text": "Fits perfect overhead a queen bed size frame. However be aware and check your product for all the items as the first time I ordered this it didn’t come with screws or other pieces. Other than that, great buy and beautiful.",
      "rating": 5.0,
      "verified": true,
      "author": "Agentice9 ",
      "helpful_votes": 0,
      "publication_date": 20190312
    },
    {
      "title": "So pretty, room changer, worth the money, buy it!!",
      "text": "This headboard is absolutely beautiful. It is well worth the money spent, and was shipped very fast. The hardware and legs were all included as well... my ONLY complaint is that the legs are not thick and don’t seem very sturdy... but I haven’t had any issues yet.... just expected them to be a little bit thicker. Other than that, highly recommend!!!",
      "rating": 5.0,
      "verified": true,
      "author": "brittany",
      "helpful_votes": 0,
      "publication_date": 20200210
    },
    {
      "title": "Great Headboard for the price.",
      "text": "Easy to put together but I had to buy the wing nuts to attach to the bed frame..but it is great.",
      "rating": 5.0,
      "verified": true,
      "author": "Lynn C. Peters",
      "helpful_votes": 0,
      "publication_date": 20190116
    },
    {
      "title": "Beautiful blank canvas to make ur own",
      "text": "I like the color and the bling! The simplicity of the head board allowed me to make it my own .its beautiful..but I made it better. Update.. Becareful with your pillow case because it can fade into the headboard and its hard to come out!",
      "rating": 4.0,
      "verified": true,
      "author": "Talika",
      "helpful_votes": 0,
      "publication_date": 20200601
    },
    {
      "title": "Pretty but...",
      "text": "Love the headboard but it was not packaged sufficiently and it arrived damaged with a small hole right in the leather front. Haven't decided if it is worth the trouble to exchange it yet. Also one of the nuts is not machined properly and won't screw on. I'll have to buy working hardware. This is definitely geared toward a thicker mattress. Mine is standard and there is a 2 or 3 inch gap to the bottom of the headboard. A little disappointed overall.",
      "rating": 3.0,
      "verified": true,
      "author": "It'sTatt",
      "helpful_votes": 0,
      "publication_date": 20170520
    },
    {
      "title": "No support from the manufacturer",
      "text": "While the headboard is beautiful it did not arrive with the legs or any hardware, there is no way to contact the manufacturer to set the matter straight so I have to go through amazon to do a return. So the that they get one star. I will edit my review if they can fix the matter.",
      "rating": 1.0,
      "verified": true,
      "author": "Amber Baruch",
      "helpful_votes": 0,
      "publication_date": 20190109
    },
    {
      "title": "Very weak legs",
      "text": "The legs are very very spindly and weak. Headband nice. My granddaughter likes to read in bed and prop against headboard. The legs are not stay sturdy, bend with her weight and she is only 90 lbs. I would not recommend except for a bed not used very much.",
      "rating": 3.0,
      "verified": true,
      "author": "L_love77",
      "helpful_votes": 0,
      "publication_date": 20200320
    },
    {
      "title": "Just ok",
      "text": "I will it was taller. I ended up adjusting the legs so that the headboard is above the mattress with visible space that I just cover with pillows. Other than the height issue it’s really pretty and worked perfect for my 11yrs room makeover. It’s sturdy and well made",
      "rating": 3.0,
      "verified": true,
      "author": "Taylor",
      "helpful_votes": 0,
      "publication_date": 20190827
    },
    {
      "title": "High Quality!",
      "text": "Beautiful headboard! This is very well made and sturdy. It only takes a couple bolts to attach the headboard to the support screws. All bolts are included, and there are even 2 different lengths of bolts for attaching the support legs to a bed frame. This would be very convenient if you have a wooden frame and need longer bolts. I highly recommend this!",
      "rating": 5.0,
      "verified": true,
      "author": "Heidi Shaw",
      "helpful_votes": 0,
      "publication_date": 20200519
    },
    {
      "title": "It is solid and looks fantastic  ! Great buy",
      "text": "Love this headboard. This is made very well. It is solid and not flimsy at all. Even the legs are nice. The headboard is heavy and looks absolutely beautiful. The color was exactly what I was hoping for. Great buy !",
      "rating": 5.0,
      "verified": true,
      "author": "carmens kindle 3",
      "helpful_votes": 0,
      "publication_date": 20171018
    },
    {
      "title": "Beautiful!",
      "text": "Beautiful headboard. Even better than I expected. We will see if it stands the test of time. But so far so good. Seems like good quality, especially for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 0,
      "publication_date": 20190321
    },
    {
      "title": "Amazing price & product",
      "text": "I just redid a guest bedroom in our home from top to bottom and this headboard was the must have final touch. (As you can see, my Great Dane approves too! She can be our most vocal critic if not pleased.) It came as promised, beautifully packaged, easy to attach to the bed using provided hardware and easy read instructions in less than 2 minutes. My husband says it has an old Hollywood glam look.) I LOVE IT!! It will make finding the dog easier too.",
      "rating": 5.0,
      "verified": true,
      "author": "T Lynn",
      "helpful_votes": 0,
      "publication_date": 20190221
    },
    {
      "title": "Not Impressed",
      "text": "The quality of the upholstered headboard is great, but the way it attaches to the actual bed frame looks cheap. It actually does not attach to metal rails at all. I'm not impressed, but my 12 yo doesn't care.",
      "rating": 3.0,
      "verified": true,
      "author": "Toni",
      "helpful_votes": 0,
      "publication_date": 20200216
    },
    {
      "title": "Quality",
      "text": "I was skeptical after reading some of the reviews but I decided why not take the chance, you can always send it back? The head board is beautiful and you couldn't get better quality for the price. It took me about 5 minutes to put it together with all the packaged hardware and tools.",
      "rating": 5.0,
      "verified": true,
      "author": "Katherine",
      "helpful_votes": 0,
      "publication_date": 20180624
    },
    {
      "title": "Easy to assemble, great to look at.",
      "text": "I love this headboard. It was easy to put together I did it myself in five minutes. It easily connected to my bed frame that I’ve had for a year now. Looks great in my bedroom. Super luxurious feel!",
      "rating": 5.0,
      "verified": true,
      "author": "Cam",
      "helpful_votes": 0,
      "publication_date": 20180702
    },
    {
      "title": "Missing Hardware",
      "text": "Package had a sticker with a string that said on the end of this string is a bag containing your hardware. Both ends of the string were on the outside of the box. No hardware. Had to go to 2 stores to find bolts that would fit. Other than that the headboard looks nice - but said it was for a full to queen - bottom attachments do not fit to my full size bed frame.",
      "rating": 3.0,
      "verified": true,
      "author": "Kelley D.",
      "helpful_votes": 0,
      "publication_date": 20200304
    },
    {
      "title": "Styrene risk Proposition 65",
      "text": "This item will never be used in my home. After I saw the California Proposition 65 Warning I messaged the product customer service. I was advised Styrene is used within approved amounts in their products and they are safe. I have a child that would be exposed to the headboard. Had I known this was an issue. I would never have purchased it. Having a possible Cancer causing toxin attached to my bed does not lead to a good night’s sleep ever.",
      "rating": 1.0,
      "verified": true,
      "author": "Daniese Roberson",
      "helpful_votes": 0,
      "publication_date": 20191119
    },
    {
      "title": "Easy to assemble",
      "text": "Exactly as we expected. Sturdy enough for a preteen/teen's bed and easy to assemble. Quality you'd expect for the price",
      "rating": 4.0,
      "verified": true,
      "author": "Mr V",
      "helpful_votes": 0,
      "publication_date": 20200809
    },
    {
      "title": "Missing necessary hardware to Assemble",
      "text": "Head board arrived missing the hardware to assemble it. Still trying to locate the correct metric bolts/nuts to assemble it.",
      "rating": 1.0,
      "verified": true,
      "author": "Student of the Game",
      "helpful_votes": 0,
      "publication_date": 20180510
    },
    {
      "title": "Super nice material and well made, but a little too wide to fit our queen size frame.",
      "text": "This bed frame is very nice and a good deal, however, if you bought a standard bed frame, this will not fit as it is too wide and the holes don’t line up with an inexpensive black metal bed frame. One made by Zinus, or similar.",
      "rating": 4.0,
      "verified": true,
      "author": "MomofFour",
      "helpful_votes": 0,
      "publication_date": 20180422
    },
    {
      "title": "Beautiful",
      "text": "White is beautiful and the diamond-like jewels make it look more expensive. Great quality and so easy to assemble my 12-year-old daughter put it together.",
      "rating": 5.0,
      "verified": true,
      "author": "December Kelt",
      "helpful_votes": 0,
      "publication_date": 20180102
    },
    {
      "title": "Beware of Missing pieces",
      "text": "Just received the headboard. I can't put it together because it came with no hardware even though the part list indicates it should. I'm trying to contact the vendor but I'm not getting thru.",
      "rating": 1.0,
      "verified": true,
      "author": "Jazmin",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "Pleather and shine. Enjoyable",
      "text": "This has jewelled buttons. Incase you missed that like I did. It works for me though. I attached it to the wall with a couple of those strips. Works perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Cabrina",
      "helpful_votes": 0,
      "publication_date": 20190724
    },
    {
      "title": "No Hardware",
      "text": "The headboard and legs were sent but no hardware was enclosed. Its pretty freakin hard to assemble with no hardware. Plus, the customer support is non-existent as there id no phone number or correct web link.",
      "rating": 1.0,
      "verified": true,
      "author": "calm.alpha",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Need help, but none to be found.",
      "text": "Tried to get support but the link in amazon doesn’t work. I got the headboard, but no hardware to put it together.",
      "rating": 1.0,
      "verified": true,
      "author": "Brenda Pruyn",
      "helpful_votes": 0,
      "publication_date": 20200702
    },
    {
      "title": "It is great quality, was easy to install and adds an ...",
      "text": "My daughter absolutely loves her new headboard. It is great quality, was easy to install and adds an elegant touch to her bedroom. The crystals add just the right amount of bling to make it fun! It is very tasteful. We are very pleased!",
      "rating": 5.0,
      "verified": true,
      "author": "Robin Rye",
      "helpful_votes": 3,
      "publication_date": 20161115
    },
    {
      "title": "Received with NO hardware to put it together!",
      "text": "took it out of the box lugged it up two flights only to realize no hardware to install it.",
      "rating": 1.0,
      "verified": true,
      "author": "Krista",
      "helpful_votes": 0,
      "publication_date": 20200807
    },
    {
      "title": "Not very sturdy",
      "text": "This comes pretty much already done for you but it's not very sturdy. It wiggles around a lot and the posts are very skinny. A but flimsy for my liking but we're still using it.",
      "rating": 5.0,
      "verified": true,
      "author": "Renae F.",
      "helpful_votes": 0,
      "publication_date": 20190704
    },
    {
      "title": "Beautiful",
      "text": "I only gave a 3 star review because the box came opened and damaged with the legs hanging out and both broken at the bottom. Other that than it’s a beautiful headboard. Still going to use it because it’s too much of a hassle to return.",
      "rating": 3.0,
      "verified": true,
      "author": "jodi motley",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "Mom loves her birthday present arrived 2 days early as well !",
      "text": "Looks 100 times better then photos appears to be studs? Well came out to be rhinestones! Some were bent awkwardly, I just end up sniping a que-tip an used half the head to straighten it up. Worked well an is invisible! Would be five star review if it weren’t for the case of altering needed. Rooms in the process of being renovated. Head board is great for the price too looks unbelievably nice an adds so much to the room!!",
      "rating": 4.0,
      "verified": true,
      "author": "Edward Ruiz",
      "helpful_votes": 0,
      "publication_date": 20191203
    },
    {
      "title": "Great buy. Worth it",
      "text": "So much prettier in person. The only problem I had was that the queen was a little too wide for the rails I have. But I was still able to lean it against the wall . It was bought for my daughter so it's easy to wipe off if needed.",
      "rating": 5.0,
      "verified": true,
      "author": "Becky P.",
      "helpful_votes": 0,
      "publication_date": 20200502
    },
    {
      "title": "Horrified",
      "text": "DO NOT BUY !!! I bought this headboard and it was infested with BED BUGS !!! I was horrified! I have always heard horror stories about this but never experienced until now. I will never buy again !!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200802
    },
    {
      "title": "Very nice",
      "text": "Nice and elegant. Fit my daughters room perfect. We love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason White",
      "helpful_votes": 0,
      "publication_date": 20190105
    },
    {
      "title": "I love it...sophisticated woman bedroom",
      "text": "Adore this...u can dress your room in any colors with this...comfy also..I didn't attach to my bed..it's just leaning against the wall..but doesn't move at all",
      "rating": 5.0,
      "verified": true,
      "author": "Bet",
      "helpful_votes": 0,
      "publication_date": 20190307
    },
    {
      "title": "Nice piece but no hardware.",
      "text": "The gray headboard is beautiful and feels like good quality. Unfortunately, it but did not come with the hardware and the package was opened on one end when delivery. At least the instruction sheet specifies the size of hardware needed since I'll have to shop for it myself.",
      "rating": 3.0,
      "verified": true,
      "author": "Candace T.",
      "helpful_votes": 0,
      "publication_date": 20200522
    },
    {
      "title": "Beautiful in person!",
      "text": "Absolutely beautiful headboard! Exactly as pictured if not actually better in person! I am came.with all hardware and even hardware to attach to a bedframe. Extremely fast shipping! I must say though the box was open when it was delivered though. But thankfully no damage.",
      "rating": 5.0,
      "verified": true,
      "author": "Ash",
      "helpful_votes": 2,
      "publication_date": 20180114
    },
    {
      "title": "Love It!",
      "text": "Item looks exactly like the photo. Very easy to assemble. Only one issue it did had a mark on it when arrived. Came with very clear Assembly instructions in plenty of parts, I have extra if needed. Overall happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Carlotta",
      "helpful_votes": 0,
      "publication_date": 20190324
    },
    {
      "title": "Stylish",
      "text": "I purchased this for our third bedroom. I is really nice and has a great appearance of elegance.",
      "rating": 5.0,
      "verified": true,
      "author": "InLovew/Him",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "Great buy",
      "text": "Just what my room needed, perfect headboard very good price",
      "rating": 5.0,
      "verified": true,
      "author": " Kimbrough",
      "helpful_votes": 0,
      "publication_date": 20200626
    },
    {
      "title": "Useless",
      "text": "Confused on why some customers are saying everything needed to assemble was included and others say you need to purchase the parts because mine definitely didn’t come with any kind of screws or instructions on what screws were needed so now it’s just sitting in my room disassembled until I can get to a hardware store to get the screws during a pandemic",
      "rating": 2.0,
      "verified": true,
      "author": "Alex K.",
      "helpful_votes": 0,
      "publication_date": 20200525
    },
    {
      "title": "Great Headboard for the Price!",
      "text": "Fantastic headboard. It looks exactly like the photos. It does have a slight smell when you open it but a bit of febreze and a few hours takes care of it. The headboard was not exactly compatible to the universal bedframe I had so I did have to purchase some brackets.",
      "rating": 5.0,
      "verified": true,
      "author": "Leslie Alfonso",
      "helpful_votes": 0,
      "publication_date": 20181012
    },
    {
      "title": "Great item!",
      "text": "Awesome piece of furniture! Bought for my Daughter. She loves it. Very stylish and sturdy",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer D.",
      "helpful_votes": 0,
      "publication_date": 20200530
    },
    {
      "title": "Beautiful headboard",
      "text": "When I received this and opened the box my mouth dropped open. It’s beautiful. I am so glad I purchased this.",
      "rating": 5.0,
      "verified": true,
      "author": "T. Mullens",
      "helpful_votes": 0,
      "publication_date": 20190417
    },
    {
      "title": "Great item",
      "text": "This is such a pretty addition to our daughters bed. She thinks its the fanciest bed ever since we installed it. It is solid and very well made.",
      "rating": 5.0,
      "verified": true,
      "author": "lvilla",
      "helpful_votes": 0,
      "publication_date": 20171113
    },
    {
      "title": "Missing parts",
      "text": "Headboard did not come with the support board screws, therefore was not able to assembly due to missing essential parts.",
      "rating": 1.0,
      "verified": true,
      "author": "N.Vasquez",
      "helpful_votes": 0,
      "publication_date": 20200819
    },
    {
      "title": "Fancy headboard",
      "text": "Looks great on my daughters bed. Perfect for teen girls room. Great value for the price. Very attractive. Nice and light weight. Recommended purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Ginamarie Hurd",
      "helpful_votes": 0,
      "publication_date": 20181112
    },
    {
      "title": "Love it! Just what I was looking for!",
      "text": "Beautiful headboard! I am very pleased with the quality! Packaged perfect with bolts and screws for attaching to bedframe. I would recommend this headboard to anyone looking for a chic and classy design.",
      "rating": 5.0,
      "verified": true,
      "author": "Maisee",
      "helpful_votes": 0,
      "publication_date": 20181030
    },
    {
      "title": "Gorgeous!",
      "text": "Used this in my bedroom love it cant believe how affordable it is and looks so expensive!",
      "rating": 5.0,
      "verified": true,
      "author": "Lynn",
      "helpful_votes": 0,
      "publication_date": 20200317
    },
    {
      "title": "Great purchase!! Buy it!",
      "text": "This was a great purchase! It came packaged well and looks better than the pictures. It came with the hardware needed to attach to the metal bed frame we already had. Only took a few minutes to put together. I recommended this to all my friends and family. Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "Ange",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "Great product, good price!",
      "text": "Received product today and was very surprised to see it had a “adjustable” height. I had worried without a box spring the height would be too tall, but it’s perfect on the lowest holes. Looks like great quality, a little rocking but only because it doesn’t sit flat because of baseboard. Looks great too!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191003
    },
    {
      "title": "Not what we thought.",
      "text": "We thought the studs were silver but they are crystal like. Also, bought for a full size bed but a bit too wide.",
      "rating": 3.0,
      "verified": true,
      "author": "Carolyn Dawson",
      "helpful_votes": 0,
      "publication_date": 20190211
    },
    {
      "title": "It’s beautiful!!",
      "text": "It’s beautiful!!! Just put it together. I was worried about it coming damaged or not looking good but I love it! Definitely worth the money",
      "rating": 5.0,
      "verified": true,
      "author": "Meagan",
      "helpful_votes": 2,
      "publication_date": 20171211
    },
    {
      "title": "Love this headboard!",
      "text": "Beautiful headboard. It is a pretty, pure white color. Not the vanilla color of some similar items. All the jewels were intact and headboard was perfect on arrival, packaged very well for shipping. I would definitely purchase again!",
      "rating": 5.0,
      "verified": true,
      "author": "JYC",
      "helpful_votes": 0,
      "publication_date": 20181016
    },
    {
      "title": "Does not fit a metal frame",
      "text": "Way off for a metal bed frame. We mounted to the wall after quite a bit of work. Doesn’t fit like intended at all.",
      "rating": 2.0,
      "verified": true,
      "author": "ASTO1651",
      "helpful_votes": 0,
      "publication_date": 20190116
    },
    {
      "title": "Nice piece of furniture",
      "text": "My daughter loves this headboard. Makes her bed looks expensive.",
      "rating": 5.0,
      "verified": true,
      "author": "Joanne tyes",
      "helpful_votes": 0,
      "publication_date": 20200121
    }
  ],
  "product_meta": {
    "title": "Baxton Studio Wholesale Interiors Rita Modern and Contemporary Fabric Upholstered Button-Tufted Scalloped Headboard, Queen, Light Beige",
    "description": "Color:Light Beige| Size:QueenMake a statement with the decorative look and quality finishes of the Rita Upholstered Headboard. Impart a unique elegance into your bedroom interior with this classic piece of design, its scalloped top adding a hint of whimsical charm. The Rita is constructed of quality hardwood frame and is cushioned with high density foam for softness and shape. For an ultra elegant look, the light beige polyester fabric upholstered headboard is button tufted. The headboard sits between the wall and the ensemble frame, attaching not to the bed base but to the legs, for stability. The leg supports are invisible once set up and can be adjusted to suit the height of your ensemble for convenience. Made in Malaysia, the headboard requires assembly.",
    "rating": 4.5,
    "feature_bullets": [
      "Scalloped Queen size headboard",
      "Adjustable headboard legs with five pre-drilled holes on top of the legs and two pre-drilled holes near the bottom",
      "Upholstered plush headboard with faux crystal button-tufting design",
      "Work well with any Leggett and Platt bed frame",
      "Legs Finish: Black"
    ],
    "specifications": {
      "Item Weight": "9 pounds",
      "Product Dimensions": "2.56 x 56.1 x 57.28 inches",
      "Item model number": "BBT6503-Light Beige-Queen HB",
      "Assembled Height": "4 inches",
      "Assembled Width": "26 inches",
      "Assembled Length": "64 inches",
      "Weight": "30 Pounds",
      "ASIN": "B011EUA0E0",
      "Customer Reviews": "4.5 out of 5 stars700 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#139,586 in Home & Kitchen",
      "Date First Available": "July 9, 2015"
    },
    "categories": [
      "Headboards & Footboards",
      "Furniture",
      "Home & Kitchen",
      "Bedroom Furniture",
      "Beds, Frames & Bases",
      "Headboards"
    ],
    "price": ""
  }
}