{
  "website_summaries": [
    {
      "verdict": "The Lenovo C40 gives you everything you need in an affordable all-in-one PC, along with a refreshing level of future-proofing.",
      "pros": [
        "Full HD touch display",
        "HDMI-in and HDMI-out ports",
        "802.11ac Wi-Fi",
        "User serviceable",
        "Very little bloatware"
      ],
      "cons": [
        "Wired mouse and keyboard",
        "Reflective screen"
      ],
      "aspects": {},
      "publication_date": 20151026,
      "rating": 8.0,
      "source": "pcmag"
    }
  ],
  "customer_reviews": [
    {
      "title": "Amazing All-In-One Computer~",
      "text": "I got it yesterday, but I already love it! It came exactly like the specs I chose, and honestly, it's a lot lighter than I expected, I feel like it's less than 12 pounds. The computer itself is big though. The foot of the computer is great and has rubber feet which really help prevent it from moving around the table. It also has really decent sound, I was shocked because it was only at 50% and it was loud. It's a great computer to watch movies on. My only problem is all the preloaded Lenovo apps which haven't been a problem, but I just don't like how it's installed already.",
      "rating": 5.0,
      "verified": true,
      "author": "Ramon Herrera",
      "helpful_votes": 4,
      "publication_date": 20151204
    },
    {
      "title": "I bought this for my kids to do their homework ...",
      "text": "I bought this for my kids to do their homework in December of 2015. It is rarely used other than to do homework since they also tablets.WEll 5 mos after purchasing it is no longer working the computer froze. We tried to restart it and now all we get is a black screen. I took it in to a computer repair shop and they tell me it is more expensive to repair than to buy a new computer. Basically I threw $$ down the trash. Irritating.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20160520
    },
    {
      "title": "Good product, tech service lacking",
      "text": "Good product once I got the software working. Lenovo 's customer service needs a serious upgrade. I had a problem with Microsoft's browser from day one! I spent 2+ hours every day over a 4 day period before a Lenovo tech was finally able to fix my problem in 5 minutes by helping me delete the browser. Lenovo techs are too busy trying to read a script and pass the problem to another department. I'm fairly certain Lenovo farms their tech service off overseas, so good luck!!",
      "rating": 4.0,
      "verified": true,
      "author": "Bamano1",
      "helpful_votes": 2,
      "publication_date": 20160222
    },
    {
      "title": "Great inexpensive home computer",
      "text": "For the price, this computer is a good deal. It isn't very powerful but does everything necessary for a home computer.",
      "rating": 4.0,
      "verified": true,
      "author": "Matt Hornbeck",
      "helpful_votes": 0,
      "publication_date": 20201017
    },
    {
      "title": "No wifi???????",
      "text": "Bought this desktop, had it for two weeks and the wifi card failed. Sent it back, got a replacement (took three weeks) and the damn wifi card failed AGAIN. Piece of s***. Don't buy.",
      "rating": 1.0,
      "verified": true,
      "author": "Jace D.",
      "helpful_votes": 2,
      "publication_date": 20161023
    },
    {
      "title": "NO Touch Screen! No Power Chord! Horrible Customer Service!",
      "text": "I Ordered a refurbished one to use in photo booth for an event for my daughter (I promised her)...It came with No Touch Screen as listed, No Power Chord, Used and not refurbished, and Horrible Customer Service!! Had Event without Photo Booth with NO choice!",
      "rating": 1.0,
      "verified": true,
      "author": "Filippo Davi",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "Simple and fast to set-up.",
      "text": "Very easy to set-up. I was up and running in 20 minutes. Typically, when I get a new computer it takes hours to update its software. This computer was ready to go out of the box. It comes with 30 day free trial of McAfee security and 30 day trial of Microsoft Word.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeffrey R. Rajca",
      "helpful_votes": 2,
      "publication_date": 20151205
    },
    {
      "title": "Great computer",
      "text": "A gift for my sister. Her first All in One and she loves it. Doesn't use the touch screen so much because you actually seem to forget that you can. Younger people not so indoctrinated into using a keyboard would probably love it more",
      "rating": 5.0,
      "verified": true,
      "author": "Sheri Kirkendall",
      "helpful_votes": 0,
      "publication_date": 20160219
    },
    {
      "title": "Decent desktop",
      "text": "I purchased this desktop approximately one month ago. It's an attractive unit. I love that it is a all in one unit. It has windows 10 and I have fallen in love with my personal assistant Cantana! LOL. My only grip is that the keyboard and mouse are not wireless.",
      "rating": 5.0,
      "verified": true,
      "author": "T. Y. Green",
      "helpful_votes": 0,
      "publication_date": 20151225
    },
    {
      "title": "Touchscreen stopped working after 12 months and 2 days. ...",
      "text": "Touchscreen stopped working after 12 months and 2 days. I have been dealing (mostly waiting on hold with Square trade, the extended warranty company) for the last 3 days. Still waiting to get it fixed.",
      "rating": 1.0,
      "verified": true,
      "author": "Lazou",
      "helpful_votes": 0,
      "publication_date": 20170120
    },
    {
      "title": "... this computer for 5 months and it has perform better than I",
      "text": "I have been using this computer for 5 months and it has perform better than I expected",
      "rating": 5.0,
      "verified": true,
      "author": "jose torres",
      "helpful_votes": 0,
      "publication_date": 20170410
    },
    {
      "title": "DOA.",
      "text": "DOA. Since I waited a few months to open the box, they won't exchange it. On the bright side, it was a really good price. On the dark side, it does not make financial sense to mess with it, so in the dumpster it goes.",
      "rating": 1.0,
      "verified": true,
      "author": "Joe Shapiro",
      "helpful_votes": 0,
      "publication_date": 20161223
    },
    {
      "title": "Computer works, but can't install any software",
      "text": "Cannot install any software on the computer. Need to install Office for the kids to do homework. You are prompted to enter an admin password which was not provided and is greyed out. I've been unable to solve so far",
      "rating": 2.0,
      "verified": true,
      "author": "eric bradley",
      "helpful_votes": 0,
      "publication_date": 20160905
    },
    {
      "title": "I bought this desktop and it's really good for work house",
      "text": "I bought this desktop and it's really good for work house. I thought that this model came with touchscreen but not! .. Eitherway, this isn't very important for me (My model is C40-05) I bought and brought to Venezuela, I could change the language, but the keyboard is not Latino and don't came with \"Ñ\" letter.",
      "rating": 5.0,
      "verified": true,
      "author": "Bárbara R.",
      "helpful_votes": 2,
      "publication_date": 20160110
    },
    {
      "title": "I wish I could return it",
      "text": "This computer is extremely slow!!! Built-in microphone doesn't work. I don't think it's worth buying computers through Amazon, as it creates a replacement nightmare.",
      "rating": 1.0,
      "verified": true,
      "author": "Anna Libman",
      "helpful_votes": 3,
      "publication_date": 20160204
    },
    {
      "title": "Excellent Product",
      "text": "Excellent Product. Very easy to set up. Does not have a lot of \"bloatware\" preinstalled on it. I was able to use an extra 4GB Ram chip from my previous laptop to bump up the RAM to 12GB. That only took about 30 seconds to do. Overall, a very stylish and capable computer.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160208
    },
    {
      "title": "Fantastic Unit",
      "text": "Lenovo out did itself with this unit! Quiet, fast and clear. Simple set-up. Getting used to Windows 10 is probably the hardest part.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike Shaw",
      "helpful_votes": 0,
      "publication_date": 20161229
    },
    {
      "title": "Awesome computer. Nice design",
      "text": "Awesome computer. Nice design, quality construction, great value. I really like Windows 10 so far. Don't know why a waited so long to purchase. Would recommend this PC to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "DMBJr",
      "helpful_votes": 0,
      "publication_date": 20160205
    },
    {
      "title": "Good quality - good value!",
      "text": "I bought this computer for a client and I found it was very easy to set up, and I have had no complaints from my client.",
      "rating": 5.0,
      "verified": true,
      "author": "acorn-sunflower",
      "helpful_votes": 0,
      "publication_date": 20161116
    },
    {
      "title": "great computer. I wish it had another slot for ...",
      "text": "Overall, great computer. I wish it had another slot for RAM and the molding around the screen is pretty thick, but those are smaller nit-picky things. I've been using the computer for a few months now and everything has worked great. Response is snappy, picture is clear, and for the price it is way better than I was expecting! Lenovo did a great job putting in a quality processor and other components to make this a solid 4.5/5 star machine.",
      "rating": 4.0,
      "verified": true,
      "author": "uscthomas",
      "helpful_votes": 6,
      "publication_date": 20160212
    },
    {
      "title": "Good price, good function",
      "text": "My wife loves this touch screen. Good price, good function, good speed and wonderful resolution.",
      "rating": 5.0,
      "verified": true,
      "author": "Jerry L.",
      "helpful_votes": 0,
      "publication_date": 20160422
    },
    {
      "title": "Soooooooo  Sloooooow!!",
      "text": "Not since the days of dial-up has a computer been so slow to load. God forbid you don't allow one (resident) program to fully close before opening another! Just like when computers were the size of a small oven, this one gets into some kind of loop and comes to a standstill. Yes it was cheap but I didn't think that it would be so useless!",
      "rating": 1.0,
      "verified": true,
      "author": "LmK",
      "helpful_votes": 0,
      "publication_date": 20170228
    },
    {
      "title": "Better then the big box stores",
      "text": "Excellent product below big box store prices, more powerful and delivered on Sunday!",
      "rating": 5.0,
      "verified": true,
      "author": "1PickyGirl",
      "helpful_votes": 0,
      "publication_date": 20161101
    },
    {
      "title": "Love this all in one there is no tower so ...",
      "text": "Love this all in one there is no tower so I have more room on my desk. Plenty of storage on it that I probably will not be able to fill up. Great product give it a try.",
      "rating": 5.0,
      "verified": true,
      "author": "reshoop",
      "helpful_votes": 0,
      "publication_date": 20160119
    },
    {
      "title": "So far so good. It works",
      "text": "So far so good. It works, the color is bright. Not sure that the touch screen is useful for anything (haven't used that feature yet).",
      "rating": 5.0,
      "verified": true,
      "author": "Svekruha",
      "helpful_votes": 0,
      "publication_date": 20160221
    },
    {
      "title": "Good quality for the price",
      "text": "Good PC for the price. Having an issue with the disk drive, but other than that it works like a charm.",
      "rating": 5.0,
      "verified": true,
      "author": "Clementina H.",
      "helpful_votes": 0,
      "publication_date": 20180920
    },
    {
      "title": "Awesome for the office",
      "text": "Great comp, great purchase. I use it for my business and this Lenovo is by far the best computer I've ever owned. Sleek, thin, very fast and great picture quality",
      "rating": 5.0,
      "verified": true,
      "author": "Smith",
      "helpful_votes": 0,
      "publication_date": 20160320
    },
    {
      "title": "Don't Even Bother.",
      "text": "Terrible product. Don't expect anything other than general purpose. It was slow ever since I got it and would sometimes spaz out. 4 months later, Windows gets CORRUPTED for me trying to turn it off. Now I'm left with an empty monitor. Save your money, trust me...",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160428
    },
    {
      "title": "Beware",
      "text": "Stop working after only a year. When I turn it on it says, \"no operating system found. Boot sequence will automatically repeat.\" Don't recommend seller or manufacturer.",
      "rating": 1.0,
      "verified": true,
      "author": "Steven",
      "helpful_votes": 0,
      "publication_date": 20171022
    },
    {
      "title": "everyting seems to be workong correctly. Set up was ...",
      "text": "everyting seems to be workong correctly. Set up was not a problem. I need to use it for a time longer to make sure it has no problems",
      "rating": 4.0,
      "verified": true,
      "author": "Papa Joe",
      "helpful_votes": 0,
      "publication_date": 20151116
    },
    {
      "title": "Four Stars",
      "text": "Nice computer...I really don't have much to love/hate about it. It works as advertised.",
      "rating": 4.0,
      "verified": true,
      "author": "TCA",
      "helpful_votes": 0,
      "publication_date": 20170307
    },
    {
      "title": "Best Desktop Ever!",
      "text": "Very, Very, Very nice!! Old computer Needed replacing! This touch screen With Windows 10.... All in One! Fantastic Investment!",
      "rating": 5.0,
      "verified": true,
      "author": "D. Henry",
      "helpful_votes": 0,
      "publication_date": 20151229
    },
    {
      "title": "This is a great all-in-the-monitor pc!",
      "text": "Off to a great start with this Lenovo all in the monitor computer! Exceeds my expectations!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160219
    },
    {
      "title": "Terrific computer. I purchased this as a Christmas gift ...",
      "text": "Terrific computer. I purchased this as a Christmas gift for other family members.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20160218
    },
    {
      "title": "The screen has started to not work on a regular ...",
      "text": "The screen has started to not work on a regular basis after about 10 months of use. I have had tremendous issues that I cannot resolve",
      "rating": 1.0,
      "verified": true,
      "author": "Anthony Cicalo",
      "helpful_votes": 0,
      "publication_date": 20170829
    },
    {
      "title": "have had problems with the touchscreens and using a",
      "text": "have had problems with the touchscreens and using a mouse Need to buy new PC in less than ONE year...",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171211
    },
    {
      "title": "Very week processor, had to return. Couldn't do ...",
      "text": "Very week processor , had to return. Couldn't do what I got the computer for ; Sound recording and video editing. Could not keep up on even the most basic level.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161227
    },
    {
      "title": "not a very good computer at all",
      "text": "not a very good computer at all. glad I didn't pay all that much money for it. really slow and none of the good stuff",
      "rating": 1.0,
      "verified": true,
      "author": "terry k.",
      "helpful_votes": 0,
      "publication_date": 20160119
    },
    {
      "title": "Nice sturdy desktop",
      "text": "Good desktop for home; all in one; touch screen; Windows10; beautiful sturdy design; 650USD",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 17,
      "publication_date": 20151017
    },
    {
      "title": "This model has a bad motherboard. Replacing it is useless as they all ...",
      "text": "This model has a bad motherboard. Replacing it is useless as they all go bad.",
      "rating": 1.0,
      "verified": true,
      "author": "JOAN M. MILLS",
      "helpful_votes": 0,
      "publication_date": 20180321
    },
    {
      "title": "Good value, great for a space saving full size computer.",
      "text": "I am still getting used to Windows 10. I do not like all the additional stuff that is on the computer, games I will ever play and other junk. However, the computer itself is terrific, a great screen and space saving feature because of the built in processor. It was easy to set up. It is fast. nother issue is the teeny mouse, not suitable for someone with larger hands and it is not remote. The keyboard is a bit flimsy as well, especially if you are a heavy user.",
      "rating": 4.0,
      "verified": true,
      "author": "Jane G. Bleakley",
      "helpful_votes": 0,
      "publication_date": 20160120
    },
    {
      "title": "Four Stars",
      "text": "Good computer but no way to wall mount the computer",
      "rating": 4.0,
      "verified": true,
      "author": "francois",
      "helpful_votes": 0,
      "publication_date": 20160830
    },
    {
      "title": "Three Stars",
      "text": "Not the fastest computer out there, but works well for the family.",
      "rating": 3.0,
      "verified": true,
      "author": "christopher t copeland",
      "helpful_votes": 0,
      "publication_date": 20151117
    },
    {
      "title": "I purchased this a few weeks ago and am super satisfied. It fit my budget and immediate needs",
      "text": "I purchased this a few weeks ago and am super satisfied. It fit my budget and immediate needs. I had to get Microsoft Office for it and mostly use if for my academic assignments and personal use. It is easy to carry and install. it comes with a keyboard and mouse with chords. I hope to get the bluetooth pair soon. The resolution is amazing, the size of the screen makes it comfortable to work with. My favorite feature are the speakers. The sound is AWESOME for watching movies or any form of entertainment. I don't regret this purchase at all. I do plan to upgrade the memory since it is only about 8gb of RAM.",
      "rating": 5.0,
      "verified": true,
      "author": "Jerielle Prudent",
      "helpful_votes": 0,
      "publication_date": 20170325
    },
    {
      "title": "Buyer Beware",
      "text": "This computer has two HDMI ports, but only one of them works. Plugging into more than one external monitor does not work. This is a known problem that the manufacturer has not resolved.",
      "rating": 1.0,
      "verified": true,
      "author": "Jeremy",
      "helpful_votes": 3,
      "publication_date": 20160216
    },
    {
      "title": "SLLLOOOWWWWW!",
      "text": "So SLOWWWWWWWWW. I just don't get why... I know I didn't buy top end, but even at $700, it should be better than this. But seriously...even after maxing out the RAM with the best RAM (not the cheapo RAM), still super slow and I only have MSFT office on here as primarily for business purpose. I only use chrome and firefox...so disappointed and too late to return. I love Lenovo...but this is a huge disappointment...and no matter what diagnostic software I have ran...still no luck.",
      "rating": 1.0,
      "verified": true,
      "author": "WL",
      "helpful_votes": 0,
      "publication_date": 20160916
    },
    {
      "title": "Lenovo C40",
      "text": "So far so good. It's taking some time getting use to using Windows 10. Like the touch screen except for the finger prints on the screen.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathy",
      "helpful_votes": 0,
      "publication_date": 20160203
    },
    {
      "title": "Pretty, but sluggish",
      "text": "Pluses: + Nice big screen + Touch screen, if that's your thing + Looks good Minuses: - Slow - Slow - Slow - Unresponsive - Slow - Slow - Slow - Slow - Please wait while your computer updates. Slowly. - Slowly. - 16% complete! This computer is laughably slow. It is slow for typing, for moving the mouse, for changing screens, for everything. So slow, we avoid using it.",
      "rating": 2.0,
      "verified": true,
      "author": "M. Heiss",
      "helpful_votes": 0,
      "publication_date": 20160111
    },
    {
      "title": "No windows 10 cd in english",
      "text": "The computer itself is ok But windows says I need to activate and it wont let me. The cd that it came with was suppose to have windows 10 on it and its in chinese and I don't think windows is there... I don't know how to contact the seller.",
      "rating": 1.0,
      "verified": true,
      "author": "Zeek H.",
      "helpful_votes": 0,
      "publication_date": 20151208
    },
    {
      "title": "Four Stars",
      "text": "Worth for the price, mouse and keyboard aren't wireless... besides that, everything was expected",
      "rating": 4.0,
      "verified": true,
      "author": "Jose Peraza",
      "helpful_votes": 0,
      "publication_date": 20160127
    },
    {
      "title": "Remember NO is in the middle of LeNOvo",
      "text": "This system is a complete waste of money. It is poorly designed with functional items hidden so you can see them, like the HD activity light. With the AMD processor it at best crawls, it has poor video switching, the HD access is slow (probably why they hide the HD activity light where you can not see it. It is no stable and prone to tipping over, which can end up with a cracked screen and since LeNOvo refuses to offer their Accidental Damage Warranty on it, they no it is unstable too. Say NO to this system and find something better.",
      "rating": 1.0,
      "verified": true,
      "author": "Mike Wodei",
      "helpful_votes": 2,
      "publication_date": 20151130
    },
    {
      "title": "Software issues",
      "text": "Got a virus as soon as the pre-installed virus protection expired and now I can't even renew it.",
      "rating": 1.0,
      "verified": true,
      "author": "sal mans",
      "helpful_votes": 2,
      "publication_date": 20160116
    }
  ],
  "product_meta": {
    "title": "Lenovo C40 21.5-Inch All-in-One Desktop (AMD A4, 4 GB RAM, 500 GB HDD, Windows 10) F0B50051US [Discontinued by Manufacturer]",
    "description": "Size:500 GB HDD/4 GB RAM| Style:AMD A4Refresh your home PC with the slim and sleek Lenovo C40 All-In-One. The 21.5” Lenovo C40 is an affordable, space saving All-in-One PC that marries the latest AMD processor technology and excellent entertainment capabilities. It's perfect for email, video playback, and homework, making the C40 All-in-One the ideal PC for the entire family. Plus, a sliding back cover makes it easy to upgrade storage and memory for added capacity.\n\nAMAZON.COM",
    "rating": 3.4,
    "feature_bullets": [
      "AMD A4-7210 1.8 GHz Processor",
      "4 GB DDR3 RAM",
      "500 GB 7200 rpm Hard Drive",
      "21.5-Inch Screen; AMD Integrated Radeon R3 Graphics",
      "Windows 10,this item ONLY is non-touch"
    ],
    "specifications": {
      "Standing screen display size": "21.5 Inches",
      "Max Screen Resolution": "1920x1080 Pixels",
      "Graphics Coprocessor": "AMD Integrated Radeon R3",
      "Card Description": "Integrated",
      "Wireless Type": "802.11ac",
      "Number of USB 3.0 Ports": "2",
      "Brand": "Lenovo",
      "Series": "Lenovo",
      "Item model number": "F0B50051US",
      "Hardware Platform": "Unknown",
      "Operating System": "Windows 10",
      "Item Weight": "12.17 pounds",
      "Product Dimensions": "20.86 x 14.21 x 2.01 inches",
      "Item Dimensions  LxWxH": "20.86 x 14.21 x 2.01 inches",
      "Color": "Black",
      "Processor Brand": "AMD",
      "Processor Count": "1",
      "Computer Memory Type": "Unknown",
      "Hard Drive Rotational Speed": "7200 RPM",
      "Optical Drive Type": "DVDRW",
      "ASIN": "B011HNTGBM",
      "Customer Reviews": "3.4 out of 5 stars103 ratings3.4 out of 5 stars",
      "Best Sellers Rank": "#67,284 in Computers & Accessories",
      "Date First Available": "August 30, 2015"
    },
    "categories": [
      "All-in-Ones",
      "Computers & Accessories",
      "Electronics",
      "Desktops",
      "Computers & Tablets"
    ],
    "price": 349.0
  }
}