{
  "website_summaries": [
    {
      "verdict": "A solid smoker box made from thick stainless steel that resists stains, rust, and warping. It adds delicious flavor to foods cooked on a gas grill.",
      "pros": [
        "This smoker box wins points for being sturdy and resisting warping, which is an issue with other brands",
        "The thick stainless steel also conducts and retains heat well, producing good smoke that lasts"
      ],
      "cons": [
        "This smoker box has a flat bottom and is designed to sit on top of the grill rather than underneath it",
        "Despite the claims that the thicker stainless steel construction won't warp, some users complain that it did"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Effective, cheap, tasty",
      "text": "Surprisingly effective. Used twice on ribs and turned out great. Doesn't light on fire, but needs a little extra heat to get them activated/smoking. Once the chips are going, it is perfect. Can't believe it. And I don't have to have an extra smoker. Just use my propane grill.",
      "rating": 5.0,
      "verified": true,
      "author": "Rich_CNY",
      "helpful_votes": 26,
      "publication_date": 20160406
    },
    {
      "title": "SOLVED MY SMOKE PROBLEM FOR PROPANE SMOKER",
      "text": "I couldn't get my smoker to smoke worth a crap, and this item solved that issue in my propane smoker. I also switched from the wood chips to the chunk and using this smoker box, get a great smoke flow for a good 2 hours. Just what I was looking for. Used a few times and no warping of box at all. Very pleased with item and seller and would recommend to a friend. Thanks!",
      "rating": 5.0,
      "verified": true,
      "author": "tracerv",
      "helpful_votes": 50,
      "publication_date": 20160313
    },
    {
      "title": "Good box, you should still soak your chips",
      "text": "It's well made and works, but in the instructions it specifically tells you to place the box directly on the heat source and to not pre-soak the chips as the box will prevent them from catching on fire. Well, my first time using it all the chips caught on fire and it caused my BBQ to flare up and cook hotter than I wanted. I might have to buy a second, as one box of chips seems to char too quickly to cook anything longer than about 30 minutes. I like the product, but I'll be soaking my chips from now on.",
      "rating": 4.0,
      "verified": true,
      "author": "Evan",
      "helpful_votes": 10,
      "publication_date": 20170814
    },
    {
      "title": "Best box I have found.",
      "text": "This box is the best I have found. Because there are no holes on the bottom the chips never receive enough air to catch fire and instead sit there and smolder (as they're supposed to!). The problem I had is with longer cooking times I ran out of smoke before the meat was done. My solution was to buy another one of these wonderful boxes and rotate them. As the smoke is slowing down from the first box, I put on the second box. The second box will then start smoking just as the first one finishes. by doing this I have smoke the whole time the meat is on the grill.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Dean",
      "helpful_votes": 9,
      "publication_date": 20170731
    },
    {
      "title": "Smoker box for BBQ Grill Wood Chips",
      "text": "Good product, but Cave Tools offers on its own site a triangular one which fits in between the flavorizer bars on a Weber grill, and gets right next to the burners. Smoke starts pouring out in minutes and is far superior to this flat design. Highly recommend going to the CaveTools site to look at that one instead. I own both.",
      "rating": 4.0,
      "verified": true,
      "author": "CynesigeTop Contributor: BBQ Styles",
      "helpful_votes": 12,
      "publication_date": 20160613
    },
    {
      "title": "LOVED it. Super easy to use and didnt warp",
      "text": "Used it for the first time last night in my gas grill. LOVED it. Super easy to use and didnt warp. It fit perfectly between the flavorizers and the grill. Its sturdy, great quality, and had the exact amount of capacity for my 2 hour smoke. I cant recommend this enough.",
      "rating": 5.0,
      "verified": true,
      "author": "Rob Waxman",
      "helpful_votes": 10,
      "publication_date": 20160707
    },
    {
      "title": "Doesn't really help much",
      "text": "I wanted my propane grill to give the food more flavor and I thought this box with wood chips would do it. It didn't do much and I ended up going with a \"pellet tube\". Using wood pellets in a pellet tube gave me tons of smoke and tons of flavor. I tried putting the leftover wood chips in the pellet tube also and it worked pretty well, although not for that long. Anyway, skip this and get a pellet tube instead and use it with either wood chips or wood pellets.",
      "rating": 2.0,
      "verified": true,
      "author": "J. Loveman",
      "helpful_votes": 0,
      "publication_date": 20200709
    },
    {
      "title": "Smoker Box for BBQ Grill Wood Chips",
      "text": "I have only used this one time. Filling it half full of wood chips it provided dense smoke for about 10-12 minutes,. Next time I will fill it completely full of dry wood chips so it will produce smoke longer. I cooked ribs using this and after 75 minutes on the grill directly over the burner I saw no evidence of the box warping. I would buy this again.",
      "rating": 5.0,
      "verified": true,
      "author": "Carroll B",
      "helpful_votes": 8,
      "publication_date": 20160628
    },
    {
      "title": "Creates a \"smoker\" in your gas grill",
      "text": "I have used this half dozen times in my Weber Genesis gs grill, Fill with desired flavored wood chips or pellets (Dry or Wet) \"wet takes 30 minutes to dry out and produce smoke) Dry chips start very fast but do not last as long because they are not damp or wet. Yes you can make your own smoke bombs but this stainless steel box is well made and will last for years to come; Smoked a Salmon with this box and it was pretty awesome!",
      "rating": 5.0,
      "verified": true,
      "author": "Dave B",
      "helpful_votes": 0,
      "publication_date": 20200725
    },
    {
      "title": "Works as Advertised.",
      "text": "Cooked up a nice steak on the BBQ, today, and I placed this 'Smoker Box' right on top the coals in my pit and the box smoked like crazy. 1st time I opened the BBQ, though, just to take a peak, the wood chips caught afire. Closed the pit and the vents for less than a minute and the flame went out. Had filled it almost to the top and it smoked at 450 degrees for about a half hour; steak, about an inch and a half thick, came out very nice. This was my first time at smoking and am pleased with results.",
      "rating": 5.0,
      "verified": true,
      "author": "Bill Oterson",
      "helpful_votes": 4,
      "publication_date": 20160910
    },
    {
      "title": "High Quality Product - Exceeded expectations",
      "text": "The quality of the product far exceed my expectations. Heavy duty and super quality. With only using it once since my purchase I am unable to provide a solid review of the \"smoke-ability\" vs. my electric smoker ... but that wasn't what I was looking for. I wanted to add flavor and I was able to accomplish this. Heads up, for best results don't soak the wood chips. I did and after 30 minutes of no smoke I dumped them out and added dry and Whoa! Looking forward to more use now the weather had improved. So I say - Smoke On!",
      "rating": 5.0,
      "verified": true,
      "author": "Wise Guy",
      "helpful_votes": 0,
      "publication_date": 20190416
    },
    {
      "title": "Great smoker box without warping issues",
      "text": "I bought this just in time for grilling season and I've had the chance to use it more than a dozen times before writing this review. It's reasonably priced, and the thicker steel does not warp even at high heat (I've brought my grill up to around 600 degrees with this thing in there, although I usually grill at around 400-550. The stainless steel is easy to keep clean. All this puts it above many of its competitors. I recommend this to anyone who wants a smoker box.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200529
    },
    {
      "title": "Makes for Long-Lived Woodchips",
      "text": "By design this smoker has no holes in the bottom...so one doesn't have to soak chips to try to get them to last and not burn up or catch fire. I slow cooked ribs, using this smoker for the first time. I filled it up. And have tons of chips left over to use the next time I grill...and plenty of smoke flavor imparted. So far so good.",
      "rating": 5.0,
      "verified": true,
      "author": "Bart Windrum",
      "helpful_votes": 0,
      "publication_date": 20200801
    },
    {
      "title": "Solid construction, Does the job",
      "text": "Sits directly on top of the flavor bars on my Genesis 2 315. Wood chips have not caught fire, just smoked. In the few times I've used it so far it does not give a strong smoky flavor but certainly can taste the hickory. Its of a solid construction and has not warped so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Adrian Knowles",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "Best Smoker Box",
      "text": "This is the best smoker box that I've used. The seller adds additional information and tips with the packaging and appears to really care about the quality and the user's experience. On my Weber grill, I found that it works best on the grates in the far back corner. Very sturdy construction. I have no doubt that this is going to last.",
      "rating": 5.0,
      "verified": true,
      "author": "GaryK",
      "helpful_votes": 0,
      "publication_date": 20191119
    },
    {
      "title": "Great Quality",
      "text": "The smoker box is just what I needed. The quality looks great and I like that the instructions recommend putting it directly on the coals below the great. I have a Dynasty grill with a built-in smoker box, but the part of the grill that holds the box has eroded away which causes the chips to burn instead of smoke. This box should solve that issue. I love the lifetime warranty and how the company stands behind its products.",
      "rating": 5.0,
      "verified": true,
      "author": "JohnH91",
      "helpful_votes": 0,
      "publication_date": 20190106
    },
    {
      "title": "does not work in BBQ",
      "text": "I got this to use with my grill- it works ok for smoking but beware!! If the box gets too hot, the metal bubbles up and flakes off weird particles. I'm not totally sure what this is but it happens inside of the box but not the outside. Kinda makes it iffy to keep using, but for low heat it should be fine.",
      "rating": 2.0,
      "verified": true,
      "author": "Beck",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "Seems solid - high quality",
      "text": "Just looking at this and handling it I know this is one nice smoke box. Beautiful for now but I know once I start using it this will change. And the metal isn't thin so I'm sure this one won't warp over time. I'm glad I bought this brand.",
      "rating": 5.0,
      "verified": true,
      "author": "john",
      "helpful_votes": 0,
      "publication_date": 20201007
    },
    {
      "title": "WoW and Beautiful!",
      "text": "Works really well when you follow directions. I placed it right over one of my burners for 10 minutes, I then moved it to the back of the grill and as I cooked my trial burgers, it continued to smoke. The construction of the box is definitely sturdy as advertised.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim",
      "helpful_votes": 0,
      "publication_date": 20190414
    },
    {
      "title": "So far I have wasted wood chips",
      "text": "So far I have wasted wood chips. It is easier to soak them and throw them on the coals. I cannot get this box to smoke. They said that there is a video of how to use the box. So far, I cannot find it. I am very disappointed with this purchase. i gave it 3 stars because it is thick stainless and looks pretty. I keep my digital thermometer in it. I have to use it for something? I will still give it a go and edit this review as things progress.",
      "rating": 3.0,
      "verified": true,
      "author": "Chester F. Saj",
      "helpful_votes": 3,
      "publication_date": 20160727
    },
    {
      "title": "Great Product",
      "text": "Excellent high quality product is perfect for adding smoke to the BBQ. Easy to use, easy to fill, well constructed, well designed. No need to soak your wood chips. Box is designed to prevent the chips catching fire, while providing good smoke.",
      "rating": 5.0,
      "verified": true,
      "author": "Book Worm",
      "helpful_votes": 0,
      "publication_date": 20200903
    },
    {
      "title": "Gives a great flavor, good quality!",
      "text": "Love my smoker box! Use it on the Weber two burner gas grill! I don't soak it, just put a handful wood chips, put it on top of the rack and it adds a good flavor to anything I grill! Just empty it after every use, wipe and it is ready for next time!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200915
    },
    {
      "title": "Great smoker box!",
      "text": "Purchased this for my husband for a father's day gift - yes a typical grilling gift.. but he was so excited to have a smoker box to add to either our gas grill or charcoal grill. Many reviews read and this was the one I landed on and I am happy that I did. Does its job well, adds whatever flavor we're smoking with, and seems to be of sturdy quality!",
      "rating": 5.0,
      "verified": true,
      "author": "Lauren Nicole",
      "helpful_votes": 0,
      "publication_date": 20190727
    },
    {
      "title": "Pretty cool item for the grill master",
      "text": "As the grill master of the house I found this product to be awesome! Very easy to use and it really does work. It's not as good as a traditional smoker, but for the price and effort it turns your gas grill into a flavor machine! Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "SirBigTuna1",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "Great smoke box for my gas grill",
      "text": "I've been using this box a few times a month for over a year and couldn't be happier with it. I use dry apple or hickory chips and haven't had any issues with flaring up or warping. I pack it pretty well and it smokes nice and consistent for almost 2 hours. Adds great flavor to anything I use it with and added a lot of value to a gas grill I used to think was one dimensional.",
      "rating": 5.0,
      "verified": true,
      "author": "Bob J",
      "helpful_votes": 0,
      "publication_date": 20200612
    },
    {
      "title": "WOW! This Smoker Box Is Really Nice",
      "text": "What amazing craftsmanship and quality! This box is so nice I had second thoughts about using it in my grill for smoking meats. I may get another to keep on my dresser for EDC items!! Great design and very sturdy.. Well made and the quality is OUTSTANDING!!",
      "rating": 5.0,
      "verified": true,
      "author": "A regular Joe",
      "helpful_votes": 0,
      "publication_date": 20200428
    },
    {
      "title": "But for small jobs like salmon, chicken",
      "text": "Works as advertised. Be sure to put directly on the heat bars as instructed. Used this in a weber gas grill and was able to do smoked salmon no problem. That said, don't expect smoker quality results. It's difficult to get as much smoke condensed within a gas grill, as gas grills are ventilated to breathe more than an actual smoker does. But for small jobs like salmon, chicken, etc. this does the trick.",
      "rating": 5.0,
      "verified": true,
      "author": "Taylor Dabb",
      "helpful_votes": 2,
      "publication_date": 20171216
    },
    {
      "title": "Great smoker box that works..",
      "text": "Have used it a half dozen times, works so good I bought one for my son for Christmas. I'd been using aluminum foil and never got the smoke I needed. This box is very, very, heavy duty steel that the grill does not damage because of its thickness... You fill it up with dry wood chips and put it on top of grill grate over a hot section, and after about 10 minutes it smokes for over an hour... gives great flavor to slow cooking of meats.. My personal favorite wood so far is the peach and Jack Daniels..",
      "rating": 5.0,
      "verified": true,
      "author": "pete ...",
      "helpful_votes": 0,
      "publication_date": 20161210
    },
    {
      "title": "I like it",
      "text": "This is not rocket science. It's a container for wood chips of a good gauge and material (S.S.) and if you use your head while utilizing it this little SS Box will do the job. If the chips don't smoke, put it nearer the burner and/or turn up the heat. If it flares up grab it with a tongs, pull it away from the heat and turn it upside down (vent holes down) for a while till the fire stops. Clean or burn the grease drippings off of it now and then to prevent flare ups. The lid snaps shut positively and everything is pretty well thought out. I like it!",
      "rating": 4.0,
      "verified": true,
      "author": "Ted R. Haag",
      "helpful_votes": 2,
      "publication_date": 20170502
    },
    {
      "title": "Well built",
      "text": "Bought as a gift for my husband and while we have not actually used it yet, we have taken it out of the box and it does seem to be well built and good quality. It’s kind of heavy but definitely sturdy and seems as though it will serve its purpose",
      "rating": 5.0,
      "verified": true,
      "author": "SM22",
      "helpful_votes": 0,
      "publication_date": 20201002
    },
    {
      "title": "Wood Chips Burn Quickly",
      "text": "I bought this to replace a Weber smoker box. The company makes a point of noting that because there are no holes on the bottom, the wood chips wont catch fire. Thats not my result - most times I use this the chips catch flames and burn up before they can give off much smoke. Disappointed in this purchase.",
      "rating": 2.0,
      "verified": true,
      "author": "lirong",
      "helpful_votes": 0,
      "publication_date": 20200724
    },
    {
      "title": "Longevity",
      "text": "I just recceived my Cave Tools Smoke Box yesterday. I used it yesterday to smoke some Burgers. I put it directly on the Weber Flavorizer bar and it took about 10 minutes to produce smoke. It heated up to nearly 600 degrees without warping. The Apple Chips burned well after the burgers were done. This product is excellent so far. Only time will tell how long it will last.",
      "rating": 5.0,
      "verified": true,
      "author": "Guy Williamson",
      "helpful_votes": 0,
      "publication_date": 20181122
    },
    {
      "title": "Really sturdy! will last for years",
      "text": "Really stared smoker! can feel that will last for a long time! came well packed and also came with website with recipes and other hints! you won't regret!",
      "rating": 5.0,
      "verified": true,
      "author": "Robson C.",
      "helpful_votes": 0,
      "publication_date": 20191105
    },
    {
      "title": "Great Thickness",
      "text": "I have now bought a few Cave Tools items, and their products seem to be made to last. This guy is shiny like a mirror, and the thickness is substantial. Should fit in any grill. Two thumbs up!",
      "rating": 5.0,
      "verified": true,
      "author": "Neil",
      "helpful_votes": 0,
      "publication_date": 20200829
    },
    {
      "title": "works very well",
      "text": "This is as good as a wood flavor as gas BBQing is going to get unless you add the smoke flavor. I love to BBq. I like the ease of Gas. I don't see the point of BBQing unless there is a smokey flavor. This was a nice product, and it's well made. If you want a smokey flavor and you are using gas this is the way to go.",
      "rating": 5.0,
      "verified": true,
      "author": "bryan greene",
      "helpful_votes": 0,
      "publication_date": 20190510
    },
    {
      "title": "Really smokes",
      "text": "I just tried this today with Hickory chips. I did like it said and ran the BBQ on high for 10 minutes. When I opened the lid the smoker had columns of smoke coming out of the holes.",
      "rating": 5.0,
      "verified": true,
      "author": "George Lutz",
      "helpful_votes": 0,
      "publication_date": 20200913
    },
    {
      "title": "Smoker Box",
      "text": "My husband hasn't used this item yet because of the cold weather. I got it for his birthday. He is very impressed with the construction. He is looking forward to using it. I may have prematurely given it a 5 star rating and will change it if he finds it doesn't meet his expectations. This is an update....worth every star. My husband says it is the best smoker box he has ever used. He has three BBQ grills and a smoker. He owns 4 BBQ grill books so he is more than just a novice.",
      "rating": 5.0,
      "verified": true,
      "author": "MRK",
      "helpful_votes": 0,
      "publication_date": 20170223
    },
    {
      "title": "Quality made smoker box",
      "text": "I love this smoker box and both chips and pellets have smoked well. I got it because it has holes only on the top, whereas other models have holes in the sides and bottom, but I didn't want to risk having ash drop out of the box into my grill. The steel and hinge are heavy gauge so I expect this smoker box to last a long time.",
      "rating": 5.0,
      "verified": true,
      "author": "BCF Ice",
      "helpful_votes": 0,
      "publication_date": 20180127
    },
    {
      "title": "This is the second Smoker Box I have purchased from ...",
      "text": "This is the second Smoker Box I have purchased from Cave Tools. This item is of top quality and it has endured 500 degree plus temperatures repeatedly without any signs of warping. If the need should arise I will not hesitate to order other products from Cave Tools as they sell top quality products.",
      "rating": 5.0,
      "verified": true,
      "author": "DaKa",
      "helpful_votes": 3,
      "publication_date": 20170525
    },
    {
      "title": "Do not buy",
      "text": "I never write reviews until I came across this item. I packed it full of wood chips and set it on my Weber Gas grill (on the burner under the grill) with gas heat on high. The amount of smoke is insignificant. It really did not smoke at all and I am used to smokers. I waited 15 minutes on high and did not see anything that would make a difference. By the time I got my steaks off the grill (another 10 minutes on top of the 15) and turned it off, I saw that this little box puts out about enough smoke as a burning cigarette if that. Nice idea but don't waste your money.",
      "rating": 1.0,
      "verified": true,
      "author": "Guinea Pig",
      "helpful_votes": 0,
      "publication_date": 20180813
    },
    {
      "title": "Nice construction.",
      "text": "I bought this as a gift for someone who grills often. It appears to be good quality and the recipient of the gift appeared to like it very much. Nice weight and some nice features.",
      "rating": 4.0,
      "verified": true,
      "author": "disappointed",
      "helpful_votes": 0,
      "publication_date": 20200619
    },
    {
      "title": "Quality Product, Good Smoking, Easy to Use",
      "text": "Quality manufacture for a Chinese made item. Good design. Worked great on my Weber Genesis and I got compliments on my smoked ribs. Game changer for my smoker cooking. HIghly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "D.R. Schneider",
      "helpful_votes": 0,
      "publication_date": 20200512
    },
    {
      "title": "Does not work.",
      "text": "I've placed this directly on the burners of my Weber summit gas grill. With all burners on high, including the \"sear\" burners, smoke barely trickles out after 30 minutes.",
      "rating": 1.0,
      "verified": true,
      "author": "A.F.",
      "helpful_votes": 2,
      "publication_date": 20180630
    },
    {
      "title": "Can't wait to use it.",
      "text": "This smoke box is a nice size and finely constructed from strong stainless steel. I have not used it yet but I'm sure it will add a new flavor to our grilled meats. This should last for many many years it is such a heavy construction.",
      "rating": 5.0,
      "verified": true,
      "author": "Doc Shopper 55",
      "helpful_votes": 0,
      "publication_date": 20190812
    },
    {
      "title": "Not great for gas grills",
      "text": "Doesnt matter what you do, your wood chips catch on fire unless you put it so low the wind will blow out the grill. Wet the chips and be prepared to waste some chips. Tried filling the box to fix the issue doesn't help. Save your money get a good smoker.",
      "rating": 2.0,
      "verified": true,
      "author": "Nick",
      "helpful_votes": 0,
      "publication_date": 20200522
    },
    {
      "title": "Fine workmanship and great design.",
      "text": "I haven't had a chance to put any heat to this box yet. But let me say this, what a fine piece of workmanship and artistry! I almost don't want to put it in the fire it's so nice. And nice and hefty. You wouldn't want to leave this laying around if your wife is prone to pitching things at you. All things being said, I'd buy this product again and definitely recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Fred",
      "helpful_votes": 0,
      "publication_date": 20170808
    },
    {
      "title": "Wonderful Present!",
      "text": "This was a present for my husband. He has wanted one of these for a long time. The item was well built and sturdy. He loves to smoke and grill meat and has been having great fun with his new toy. The smoking results are delicious.",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel Brown",
      "helpful_votes": 0,
      "publication_date": 20191119
    },
    {
      "title": "Great smoker box if you are not ready to spend ...",
      "text": "Great smoker box if you are not ready to spend a couple hundred (or more) bucks on a stand alone smoker. Box fits well directly on the \"flavorizer\" bars of a Weber Genesis. I removed the cooking grate for adding /removing wood chips from the box. You get about 30-45 mins of good smoke (low heat) before wood chips are completely blackened and need changed out. Have a spatula handy to open the box & scoop out the spent wood chips and add new.",
      "rating": 5.0,
      "verified": true,
      "author": "Stuart O.",
      "helpful_votes": 0,
      "publication_date": 20161203
    },
    {
      "title": "Difficult to get smoke",
      "text": "It’s extremely difficult to get the chips to actually smoke with this. I’ve put it directly on the grill and even with full heat, very little smoke. Since most smoking requires low heat, this presents a significant problem. I’ve read a lot of commentary about just because there’s no smoke doesn’t mean it isn’t working but the chips show almost no sign of burn and the meat isn’t smoked. Using them fully dry, just as the instructions recommend.",
      "rating": 2.0,
      "verified": true,
      "author": "Jason Bellomo",
      "helpful_votes": 0,
      "publication_date": 20180824
    },
    {
      "title": "So far so good",
      "text": "This is a well made box. Used it once and it held up pretty well. We'll see over time how it goes. Adds a bit of smoke flavor to the gas grill I have. Still need to practice a few more times.",
      "rating": 5.0,
      "verified": true,
      "author": "Roland",
      "helpful_votes": 0,
      "publication_date": 20191017
    },
    {
      "title": "EXACTLY what it is supposed to be!",
      "text": "This smoker box is made of heavy stainless steel which won't warp with an excellent hinge that opens and closes easily. UNLESS you are willing to pay heavily for the \"free\" bonus with your credit card don't waste your time signing up for it.",
      "rating": 5.0,
      "verified": true,
      "author": "J H",
      "helpful_votes": 0,
      "publication_date": 20201021
    },
    {
      "title": "chicken with great results!",
      "text": "This is an outstanding product. I have a long history smoking on a horizontal barrel smoker with wood chunks and chips, but wanted an easier way to generate smoke and use my gas grille. This works really well. I put the box directly on a burner (full of chips, unsoaked), crank up the burner and wait for smoke, then turn down to 225. With the rest of my burners off, I am basically smoking on a gas grille with the meat getting indirectly cooked. Have done ribs, shoulder, chicken with great results!! Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian R.",
      "helpful_votes": 0,
      "publication_date": 20170602
    },
    {
      "title": "Well made, not much smoke.",
      "text": "Well made, nice thick stainless steel. I used the box with chips of wood from an apple tree in my yard. The wood was cured and dry, but did not get as much smoke as I had hope for. After cooking I checked the box and the wood was still in tact but blackened. May have to use store bought wood which is cut into much smaller pieces.",
      "rating": 3.0,
      "verified": true,
      "author": "JF",
      "helpful_votes": 0,
      "publication_date": 20180703
    },
    {
      "title": "Great product!",
      "text": "I love this thing it provides a lot of flavor when smoking wood chips. I used it with a charcoal grill. My only recommendation is for things that you wish to smoke for long periods of time get a bigger box or you will have to replace chips in this one about every hour.",
      "rating": 5.0,
      "verified": true,
      "author": "w.parker",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Heavy duty material, very small box.",
      "text": "I have Gas grill and I have been wrapping wood ships with foil. I decided to invest in a smoke box. First: it is heavy and very small. It heats up fast and ships don't get on fire, but burn too fast. Not enough smoke tho smoke for over 3 hours.",
      "rating": 4.0,
      "verified": true,
      "author": "Hugo Erazo",
      "helpful_votes": 0,
      "publication_date": 20190602
    },
    {
      "title": "Excellent on my gas grill",
      "text": "No need to wet the chips. Put the box directly under the grill and imparts a great smoky flavor. i use mesquite. Cleaned up like new with a scouring pad.",
      "rating": 5.0,
      "verified": true,
      "author": "Goodenuf",
      "helpful_votes": 0,
      "publication_date": 20201004
    },
    {
      "title": "Do not heat box too much or chips will catch fire and box will emit foul chemical smell.",
      "text": "The box worked ok until the wood chips somehow catch fire. This has happened many times and when it does, a foul metal burning smell is emitted. I believe its from the chemicals of what the box is made out of. That same smoke got into the chicken and did not taste very good. I'm not sure why there is this chemical smell when the chips catch fire. Maybe the box is not meant to reach a certain temp? I don't know, but you have to make sure the chips in the box do not catch fire and just have the chips produce light smoke, which isn't quite enough smoke.",
      "rating": 2.0,
      "verified": true,
      "author": "Tranceman",
      "helpful_votes": 0,
      "publication_date": 20180207
    },
    {
      "title": "Doesn't work good at all...",
      "text": "This product did not work good at all. The wood chips burned up really quick. We replaced it with the old pan and used the same wood chips and it worked good so it wasn't the wood. The box just doesn't work good at all. Very disappointed...",
      "rating": 1.0,
      "verified": true,
      "author": "Cathy Wilson",
      "helpful_votes": 0,
      "publication_date": 20190706
    },
    {
      "title": "Turn you propane BBQ into an inespensive pellet grill",
      "text": "Perfect. It works as billed and turns a regular bbq in to the overpriced pellet version. I think this may be even better. The problem with the pellet stoves is that you have to be able to plug them in. I think the overpriced pellet is not only an environmental problem, but is just that, overpriced for what you get. Save yourself 550.00 and buy this.",
      "rating": 5.0,
      "verified": true,
      "author": "McGregg",
      "helpful_votes": 0,
      "publication_date": 20170728
    },
    {
      "title": "High quality",
      "text": "Very useful for adding wood chips to my gas grill. I used to soak them in water, and put in silver foil, but after using this, I can get a much more genuine smoky taste.",
      "rating": 5.0,
      "verified": true,
      "author": "Prolectric",
      "helpful_votes": 0,
      "publication_date": 20191107
    },
    {
      "title": "Stainless steel never felt so Good !",
      "text": "These Stainless Steel Boxes are simply Awesome. Tney really are heavy, thick, and shiney. REALLY. As soon as the box was opened, all I could do was wonder: whag else can I use this for?? Its so nice... Falling in live with it nice... and seems very well built. Size is smaller than I anticipated but perfectly well made",
      "rating": 5.0,
      "verified": true,
      "author": "Mero Group Hanalei Bay",
      "helpful_votes": 0,
      "publication_date": 20171014
    },
    {
      "title": "Works fine for me.  Much cheeper than buying a seperate Smoker.",
      "text": "This box is built better than any i have looked at. It's made of pretty thick stainless steel. There are times when I need more smoke than one small box can produce, but all the boxes I have seen are about the same size. I used it for a couple months, and decided to order a second one so I can double the amount of wood chips on those occasions when I want a LOT of smoke. Some of the cheeper boxes I have seen are made out of sheet metal, and would rust, and not last very long. My Grill is a Propane which I converted to Natural Gas.",
      "rating": 5.0,
      "verified": true,
      "author": "Raymond D. Roton",
      "helpful_votes": 0,
      "publication_date": 20160413
    },
    {
      "title": "Really works!",
      "text": "Got pretty much the same Smokey flavor in my brisket as my friend did with her wood pellet smoker. Great value.",
      "rating": 5.0,
      "verified": true,
      "author": "MJB La Quinta",
      "helpful_votes": 0,
      "publication_date": 20200615
    },
    {
      "title": "Rugged and works very well",
      "text": "I used this smoker box to smoke a pork belly for bacon and it worked very well. Following the instructions, I stuffed it full of chips and set it over my gas grill burner and let it smoke for hours. I got lots of smoke, no flames, and the box itself isn't warped or damaged in the slightest.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Lionel",
      "helpful_votes": 0,
      "publication_date": 20170417
    },
    {
      "title": "Good quality at reasonable price😊",
      "text": "Great value for the price! Smoked a turkey for Thanksgiving! It turned out great for my 1st attempt! Would definitely recommend. Got another one for a gift!",
      "rating": 5.0,
      "verified": true,
      "author": "ears",
      "helpful_votes": 0,
      "publication_date": 20191210
    },
    {
      "title": "Must have for any grill enthusiast - adds amazing flavor!",
      "text": "Wow! This is what my Weber grill was missing! I fill it up with wood chips and I'm ready to go! Now my grilling smells like smoked food. Fantastic! The quality is superb...I actually bought two: one for me and one for my dad. We both love it. It changes color (obviously) but shape does not distort. This is the one to get.",
      "rating": 5.0,
      "verified": true,
      "author": "Aleksandra & Tom",
      "helpful_votes": 0,
      "publication_date": 20170712
    },
    {
      "title": "Quality",
      "text": "I have used this product a few times on my gas grill and it works great. The gauge of metal is good and I expect it to last for some time. If I ever need another smoker box I would buy this one again.",
      "rating": 5.0,
      "verified": true,
      "author": "Ken M",
      "helpful_votes": 0,
      "publication_date": 20190406
    },
    {
      "title": "Great product! Great Flavored Food!",
      "text": "Product is really high quality, holds a good amount of wood, and my food tastes nice and smokey after using. I have nothing bad to say about this.",
      "rating": 5.0,
      "verified": true,
      "author": "Brenton C.",
      "helpful_votes": 0,
      "publication_date": 20191118
    },
    {
      "title": "Smokin Hot Box!!!!",
      "text": "I love this smoke box it's a great way to add the great flavour of smoke in my pork chops. The Heaven stainless steel box is great size, heavy, sturdy hinge and lots of holes to let the smoke flavour escape. Recommend this smoke box to everyone.",
      "rating": 5.0,
      "verified": true,
      "author": "joanne s ",
      "helpful_votes": 0,
      "publication_date": 20191118
    },
    {
      "title": "Well Made",
      "text": "I haven't had a chance to use this yet but I'm sure it will work fine. It's well made and designed well.",
      "rating": 5.0,
      "verified": true,
      "author": "Nboodris",
      "helpful_votes": 0,
      "publication_date": 20200430
    },
    {
      "title": "Smoking tool",
      "text": "This is the best thing I have ever used. I fill it up with wood with no water, and it smoke for over 6 hrs. Thank you",
      "rating": 5.0,
      "verified": true,
      "author": "Anonymous ",
      "helpful_votes": 0,
      "publication_date": 20200421
    },
    {
      "title": "Easy to use.",
      "text": "Sturdy and seems like it will last. Smoke of dry chips happens within 10-15 minutes.",
      "rating": 5.0,
      "verified": true,
      "author": "Bob DiMarzio",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "Fits a Weber",
      "text": "Love this product, works very well. Fits a Weber spirit e210 not a perfect fit but it works.",
      "rating": 4.0,
      "verified": true,
      "author": "Trisha",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "Bought as a gift",
      "text": "I got this for my brother who just moved into his own house and bought himself a BBQ. He has used it numerous times and he loves how the food comes out tasting.",
      "rating": 5.0,
      "verified": true,
      "author": "Concetta",
      "helpful_votes": 0,
      "publication_date": 20190808
    },
    {
      "title": "Easy to use",
      "text": "Great for adding smoke flavor to your food. Turn grill on high till you see smoke then start cooking.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "Not bad",
      "text": "It works ok, I lite a few pieces of charcoal then out the chips on top of it but it still seems to go out pretty quickly.",
      "rating": 4.0,
      "verified": true,
      "author": "Jason",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Cave Tools Smoker Box for BBQ Grill Wood Chips - 25% Thicker Stainless Steel Won't WARP - Charcoal",
      "text": "Very well made and is heavy. Lid opens easy and it does not take a lot of wood to fill it.",
      "rating": 4.0,
      "verified": true,
      "author": "Hammercl",
      "helpful_votes": 0,
      "publication_date": 20200416
    },
    {
      "title": "Sturdy, easy to use",
      "text": "Have used about 6 times for chops , steak and salmon. Since these cook quickly, they were not able to absorb smoke. Looking forward to cooking larger pieces if meat to hopefully impart more smoky flavor.",
      "rating": 4.0,
      "verified": true,
      "author": "Jim",
      "helpful_votes": 0,
      "publication_date": 20191218
    },
    {
      "title": "Works ok, but not as good as wood chunks for a long cook.",
      "text": "I bought this box to sue with wood chips given to me as a gift for use in a kamado type smoker. It works, but it's not a substitute for wood chunks in a smoker. It initially gives out a lot of smoke, but quickly burns the wood chips. Not good enough for a long cook.",
      "rating": 3.0,
      "verified": true,
      "author": "Ramblin Man",
      "helpful_votes": 0,
      "publication_date": 20180127
    },
    {
      "title": "Excellent little smoker box",
      "text": "“Very solid and well-made. I think this will last for a long time. Good job you guys.\"",
      "rating": 5.0,
      "verified": true,
      "author": "Douglas Roberts",
      "helpful_votes": 0,
      "publication_date": 20200512
    },
    {
      "title": "It works!!",
      "text": "Good smoke caught on fire but gotta work with it more good box",
      "rating": 5.0,
      "verified": true,
      "author": "Boogie Boy",
      "helpful_votes": 0,
      "publication_date": 20200721
    },
    {
      "title": "Great smoker box, fits under my grates on Weber Spirit gas grill!",
      "text": "Great sturdy product that doesn't warp or require me to soak my wood chips prior to grilling. It fits really well under the grates on my Weber Spirit E-210 leaving more free grill space and making sure the wood chips get plenty of heat. Cleaning is easy enough; just dump out the chips once they're cool and give it a quick wipe down.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian McCombs",
      "helpful_votes": 0,
      "publication_date": 20200912
    },
    {
      "title": "Smokin!...Literally.",
      "text": "Love it! I have abused this bad boy and it still chugging along. I like to put apple branches in and just let them go. Adds the smoke flavor and definitely starts you on the possible path to your won smoker. Dont say I didnt warn you. But for quick smoky taste of the grill, this is a really good product. ;)",
      "rating": 5.0,
      "verified": true,
      "author": "ROBERT MACMAHON",
      "helpful_votes": 0,
      "publication_date": 20171025
    },
    {
      "title": "Smoke smoke and more smoke!",
      "text": "Works extremely well. If you want smoke, this will provide it. We just set it across and on top of the burners under the grate and although I don’t think that is how it was intended to be used, it works well. Seems well made and should last a while.",
      "rating": 5.0,
      "verified": true,
      "author": "bruno",
      "helpful_votes": 0,
      "publication_date": 20180226
    },
    {
      "title": "Works great, just add dry wood chips and place directly ...",
      "text": "Works great, just add dry wood chips and place directly on to the flavorizer bars. After about 15 minutes, you start getting a really good amount of smoke.",
      "rating": 5.0,
      "verified": true,
      "author": "Jonathan Melim",
      "helpful_votes": 0,
      "publication_date": 20180717
    },
    {
      "title": "Spot on for customer service",
      "text": "Spot on for customer service... not sure on the smoker box when in use but customer service is great! Heavy duty box.",
      "rating": 5.0,
      "verified": true,
      "author": "Shereee Lyn",
      "helpful_votes": 0,
      "publication_date": 20191004
    },
    {
      "title": "Great item",
      "text": "I love this smoker and it adds the perfect amount of flavor",
      "rating": 5.0,
      "verified": true,
      "author": "Patrick",
      "helpful_votes": 0,
      "publication_date": 20200601
    },
    {
      "title": "Four Stars",
      "text": "I have a Weber Genesis. The smoker box fits under the Grill grates with room to spair.",
      "rating": 4.0,
      "verified": true,
      "author": "grant west",
      "helpful_votes": 2,
      "publication_date": 20180305
    },
    {
      "title": "“Works great! But you do need to soak the wood ...",
      "text": "“Works great! But you do need to soak the wood chips before putting them in the box, the directions says you don't need to, but if you don't they catch fire and burn, instead of smoking. Bit the box works great.\" I love it",
      "rating": 5.0,
      "verified": true,
      "author": "David  Prolific",
      "helpful_votes": 0,
      "publication_date": 20180418
    },
    {
      "title": "... for the guys and they really thought it was super thoughtful. The guys love to BBQ and this ...",
      "text": "I got this for a fathers day present for the guys and they really thought it was super thoughtful. The guys love to BBQ and this smoke box was a perfect size. Made heavy duty and did what it was made to do!",
      "rating": 5.0,
      "verified": true,
      "author": "Angela Guzman",
      "helpful_votes": 0,
      "publication_date": 20180730
    },
    {
      "title": "Thick steel, really won't warp. Works well.",
      "text": "The wood chips inside caught fire with the grease from the meat falling into the holes on top. Afterwards it cleaned up nicely and, as described, this thing won't warp. It's not thin or flimsy at all. If that fire didn't warp it, doubt it will go bad very quickly. It fit under my two burner grill nicely, doesn't take up much space.",
      "rating": 5.0,
      "verified": true,
      "author": "taester",
      "helpful_votes": 0,
      "publication_date": 20161126
    },
    {
      "title": "Great price, fast shipping to !!! Cave Tools have Great Products at Reasonable Prices !!!!",
      "text": "Very sturdy box !!! Tried it yesterday 4/9/17 , it worked great on my Ribs !!! But , put your full box of chips on your grill at least 10min before you put your food on the grill !!! When the chip box Start's to smoke real good , lower your grill Temperature to proper cooking Temperature !!!",
      "rating": 5.0,
      "verified": true,
      "author": "Showtime Ch.19, pace,FL.",
      "helpful_votes": 0,
      "publication_date": 20170410
    },
    {
      "title": "“Quality item. Thick stainless steel is much heavier than ...",
      "text": "“Quality item. Thick stainless steel is much heavier than other stainless steel smoker boxes. The lid is hinged, so you don't have to worry about a hot lid falling off and burning someone or something. Makes reloading the box easier and safer. I've used it several times and it is not discoloring. There are no holes in the bottom, so wood chips last longer and you don't need to soak the chips.\"",
      "rating": 5.0,
      "verified": true,
      "author": "Darryl LeQuia",
      "helpful_votes": 0,
      "publication_date": 20160203
    },
    {
      "title": "I've used the smoker box twice on different gas grills ...",
      "text": "I've used the smoker box twice on different gas grills and it worked well. On one grill it fit perfectly between the \"flavor bars\" and the other smaller grill I placed it directly on top of the burner. In both instances it produced lots of smoke after 5- 7 minutes and shows no signs of distortion or warping from the heat.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard W.",
      "helpful_votes": 0,
      "publication_date": 20171220
    },
    {
      "title": "GREAT PRODUCT! If you don't have one, get one.",
      "text": "Way to go Cave Tools! You really have a fine product here. I followed your suggestion to use dry chips and the results were spectacular. This is a well made box that comes with customer service above and beyond the call of duty. Cave Tools folks responded to emails, asked questions about product and delivery and I would recommend this Seller and this smoker box without reservation.",
      "rating": 5.0,
      "verified": true,
      "author": "William Douglas Divine",
      "helpful_votes": 0,
      "publication_date": 20161124
    },
    {
      "title": "Perfect in size and function",
      "text": "Perfect in size and function. My box saw about 30 h of smoking, didn't warp and delivered long lasting smoke. (I never tried a different box but this is so much better than the aluminum boats made from foil)",
      "rating": 5.0,
      "verified": true,
      "author": "Bama Boy",
      "helpful_votes": 0,
      "publication_date": 20180523
    },
    {
      "title": "So simple and strait forward",
      "text": "This is a quality product. Have had other brands and the very first issue is they rust! Grrrr... This one ; I have held off to review , NO RUST at all. Used multiple times and still in great shape. The smoker puts out great smoke and is every thing they say it is! Highly recommended",
      "rating": 5.0,
      "verified": true,
      "author": "dkiwidean",
      "helpful_votes": 0,
      "publication_date": 20200507
    },
    {
      "title": "I don't get it",
      "text": "Maybe it's me, but doesnt hold enough would to matter. And not easy to refill a hot metal box",
      "rating": 2.0,
      "verified": true,
      "author": "Sparky The Plug Man",
      "helpful_votes": 0,
      "publication_date": 20200202
    },
    {
      "title": "Smoked a mean chicken in my buddy's gas grill. ...",
      "text": "Smoked a mean chicken in my buddy's gas grill. Per instructions, didn't need to soak the chips so was able to jump right in. I waited for the thermometer on the grill lid to stabilize at around 250 deg. F and was able to leave it unattended for a few hours. Also, didn't need any of the heat under the bird, just on the side where the chips were.",
      "rating": 5.0,
      "verified": true,
      "author": "Zachary",
      "helpful_votes": 0,
      "publication_date": 20160430
    },
    {
      "title": "Great smoker",
      "text": "Exactly as advertised--very sturdy stainless. Just the right amount of smoke flavor for my Weber gas grill. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Les R. Schmeltz",
      "helpful_votes": 0,
      "publication_date": 20200105
    }
  ],
  "product_meta": {
    "title": "Cave Tools Smoker Box for BBQ Grill Wood Chips - 25% Thicker Stainless Steel Won't WARP - Charcoal & Gas Barbecue Meat Smoking with Hinged Lid - Best Grilling Accessories & Utensils Gift for Dad",
    "rating": 4.5,
    "feature_bullets": [
      "*** INSTANT 10% SAVINGS ON PURCHASE OF 2 OR MORE *** 25% THICKER STAINLESS STEEL REDUCES WARPING - Most smoker boxes warp immediately but the Cave Tools smoking box won't",
      "HINGED LID FOR EASY ACCESS - Easily add more wood chips in on the fly",
      "LARGE WOOD CHIP CAPACITY - Fits perfectly between flavorizer bars and grill grate or directly on top of charcoals",
      "COMES WITH 25 PROFESSIONAL BARBECUE RECIPES - step by step instructions and detailed grilling tutorial videos - Free Download Meat Smoking Journal iOS & Android App",
      "LIFETIME SATISFACTION GUARANTEE - If at any point you are unhappy with your smoker box you can return it for a full money back refund. We Take Customer Service That Seriously"
    ],
    "specifications": {
      "Product Dimensions": "9 x 3 x 1.5 inches",
      "Item Weight": "1.3 pounds",
      "Manufacturer": "Cave Tools",
      "ASIN": "B011VJ51J8",
      "Item model number": "Smoker Box",
      "Customer Reviews": "4.5 out of 5 stars916 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#6,265 in Patio, Lawn & Garden",
      "Is Discontinued By Manufacturer": "No"
    },
    "categories": [
      "Grilling Cookware & Rotisseries",
      "Patio, Lawn & Garden",
      "Garden & Outdoor",
      "Smoker Boxes",
      "Outdoor Cooking Tools & Accessories",
      "Grills & Outdoor Cooking"
    ],
    "price": 21.99
  }
}