{
  "website_summaries": [
    {
      "verdict": "These should be your go-to headphones if you're looking for a pair you can use while exercising.",
      "pros": [
        "Comes in 5 colors",
        "Special Stay Hear tips help to keep the earbuds in your ears",
        "Sweat- and weather-resistant",
        "Carrying case included",
        "Built-in microphone in the cord",
        "Superior clarity across the whole sound spectrum"
      ],
      "cons": [
        "These headphones do not have any built-in noise cancelling features"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "They died in less than two months with gentle use.",
      "text": "I bought these on March 4, 2018 and here on May 5, 2018 they have died. The left ear bud is filled with static and the volume control spontaneously increases bit by bit until its at its loudest possible level. I have run on an elliptical, lifted weights, and run outside with them 2-3 times a week since March 22 when I began using them. I've had other BOSE earbuds before that lasted for more than a year, so its a real shock that these died so quickly. Very disappointing.",
      "rating": 1.0,
      "verified": true,
      "author": "WCO6",
      "helpful_votes": 69,
      "publication_date": 20180505
    },
    {
      "title": "Poor Wire Quality! It's my third one and I QUIT Mr. Bose!",
      "text": "When I said, \"I hate it\", I don't hate it's sound quality. It's outstanding. But, Mr. Bose, come on! This is my 3rd one, and I am tired and will not BUY another Bose until the wire quality is not improved. I am sorry but when someone buy a earphone for $120+ that person can expect that the thing will be a part of his everyday life and it will last long. I don't expect it to last a lifetime though. I have tried to replace the cable in earlier one but the sound quality was not the same after replacing the cable. I wanted to add photos, but it's not being added.",
      "rating": 1.0,
      "verified": true,
      "author": "h3xsw1per",
      "helpful_votes": 65,
      "publication_date": 20180318
    },
    {
      "title": "Keep breaking",
      "text": "Probably won't get these again, this was my third pair, and all have died and been tossed in the trash. I keep thinking with a name like Bose, they'd be solid, but they aren't. Sound quality is fine, but they just keep breaking...",
      "rating": 3.0,
      "verified": true,
      "author": "Philip Ramsey",
      "helpful_votes": 51,
      "publication_date": 20170507
    },
    {
      "title": "Extremely poor quality",
      "text": "These headphones are comfortable and they sound good, but they are very poor quality - particularly at this price point. My first pair arrived and the microphone and volume adjustment buttons either failed the first day or never worked at all. I returned them for a replacement. The microphone on the second pair failed within a week. I've been very gentle with them, carefully storing them in the case that they came with after each use and I have not dropped them once. Extremely disappointing.",
      "rating": 1.0,
      "verified": true,
      "author": "jedinomad",
      "helpful_votes": 15,
      "publication_date": 20170721
    },
    {
      "title": "Poor build quality",
      "text": "I'm on my second set of these earphones. Unfortunately, after 13 months, one month beyond the warranty period, the little controller stopped functioning. I have no idea why since I usually just use them at the gym. Neither the buttons nor the microphone work any longer so, while I can still use it to listen to music, I can't use it for phone calls or controlling the volume. The build quality on these earphones seemed a little better than on the previous version but my older version actually lasted longer.",
      "rating": 1.0,
      "verified": true,
      "author": "Nathaniel D",
      "helpful_votes": 16,
      "publication_date": 20170705
    },
    {
      "title": "5 stars",
      "text": "They are absolutely fantastic. I work as a 5 Star Audio Visual Technician at multiple hotels and I have to say that these headphones fit comfortably within my ear just like an earpiece to a radio yet much easier. The soundstage it has is phenomenal as well as the high frequencies and even the lower Hz really makes you feel like your there. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "VDeN",
      "helpful_votes": 19,
      "publication_date": 20170330
    },
    {
      "title": "Decent headset",
      "text": "Seems to work pretty well for earbuds. I like that it doesn't go in my ear, as I have never had a pair that did that and were still comfortable. Have read many bad reviews about the build quality of these, specifically the wire insulation quality. I haven't had them long, but no issues so far. The mic seems to be clear and does not have much echo. These will let a lot of outside noise in, as they do not seal in your ear canal, they just sit outside it. I actually like this, as it helps you be more aware when you use them outside.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 10,
      "publication_date": 20160912
    },
    {
      "title": "These earphones are comfortable!",
      "text": "I bought the Android version of the earphones. It is very comfortable in my ears! It's almost like the earphones aren't even there in the ears! That's why I call them ghost earphones because of how comfortable it is. Bass is good and the earphones themselves is about the same quality as Apple's earphones, but even better due to the comfortable fit in my ears. The only con I have is the volume control does not work with my iPad pro, but the play and pause button does function. Overall, solid purchase on my part and thanks for my friend who recommended me these!",
      "rating": 5.0,
      "verified": true,
      "author": "IdarkZerefx",
      "helpful_votes": 2,
      "publication_date": 20190720
    },
    {
      "title": "Lousy",
      "text": "I bought these things less than three months ago and they are already unusable. They make a scratchy staticy sound, and consistently will suddenly drop the volume or stop the track altogether. I've had these headphones before, and they've lasted about a year, but this is ridiculous. They produce great sound when they're working, but that is not for long. I just chatted with an Amazon rep, and all she was willing to do was give me a $15 gift certificate. If I'd been at Best Buy I'd have had the product replaced immediately. I expect more from Bose and Amazon.",
      "rating": 1.0,
      "verified": true,
      "author": "Liam",
      "helpful_votes": 2,
      "publication_date": 20190308
    },
    {
      "title": "Boxed ''Bose'' but the product (EarPhones) not included",
      "text": "I purchased the Bose SoundSport in-ear headphones - Apple devices (Colour, Power Red) as a spare ear phone - being an ardent lover and user of Bose earphone for many years. So , I opened the box just a few days ago as I wanted to launch it on my summer holiday. To my surprise, the box was empty and there was no earphones. I decided to bring this to your notice to investigate and address this issue. I am now on holiday without the earphones, I left the box behind angrily and out of my confused state, not to miss my flight.",
      "rating": 1.0,
      "verified": true,
      "author": "Raykus",
      "helpful_votes": 2,
      "publication_date": 20190804
    },
    {
      "title": "Never had anything Bose before...",
      "text": "...but these things are awesome. I have small ears, so earbuds are a bane of my existence. However, I have never had buds that are supported by the inner corner of my ears? These are, and they are so comfy I can't even tell that I have them in sometimes! The noise cancellation isn't fantastic, but considering I wear these at work, I don't mind (I need to hear people calling my name). For a first time Bose product, I am impressed, and would buy a second set if anything ever happened to these. I also appreciate that they are not \"one size fit all\" and include several sizes of adapters to fit the size of your ears.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Jensen",
      "helpful_votes": 0,
      "publication_date": 20190904
    },
    {
      "title": "Worth it for the 4 year protection plan alone.",
      "text": "My kid plows through headphones, but he still wants a quality sound. Of course, Bose is one of the best. An example: kid (again) dropped one of the earbuds in cooking oil (yeah, don't ask). Took off the part that makes it fit in your ear. wiped it off and it went back to sounding normal when it dried. I thought it was game over. I'm still using a pair that I purchased years ago. When I find a sale I snatch a pair up for those, 'Mama, you'll never guess what just happened.' moments.",
      "rating": 5.0,
      "verified": true,
      "author": "Ariotstorm",
      "helpful_votes": 0,
      "publication_date": 20181202
    },
    {
      "title": "Worked 5 months!",
      "text": "This are great headphone while they work. Sound quality is great, comfort level is great. However I bought these in February 2017 and my left headphone today stopped working! July 2017. use them regularly for running and every day use for talking while driving. Extremely frustrated !",
      "rating": 1.0,
      "verified": true,
      "author": "CRLO",
      "helpful_votes": 5,
      "publication_date": 20170722
    },
    {
      "title": "Sound quality and microphone defective.",
      "text": "These in ear headphones were great when I got them on February 3 2019 but now only 6 months later on July 11 2019 the sound quality is ok but the microphone stoped working. And I enjoy using these earphones for singing on a Smule app I belong to. I bought them for the top sound quality they produce and now they are defective.",
      "rating": 1.0,
      "verified": true,
      "author": "BLACKCLOUDPAT18",
      "helpful_votes": 2,
      "publication_date": 20190711
    },
    {
      "title": "Love 'em, with one caveat!",
      "text": "These are terrific earbuds. I use them exclusively for workouts and they truly do stay in my ears thanks to the innovative ear piece. They're clear and crisp, though I initially was disappointed with the bass and noise isolation. Then I read another review in which the user recommended the Bose StayHear tips vs. those included with these. I ordered them and the difference is amazing! Far more bass and the isolation level is perfect! Best $10 spent for 100% improvement. I'm extremely happy with both items.",
      "rating": 5.0,
      "verified": true,
      "author": "An Opinion",
      "helpful_votes": 0,
      "publication_date": 20190704
    },
    {
      "title": "Do Not Buy These!",
      "text": "DO NOT BUY THESE HEADPHONES! I am on my third pair (two replacement pair were sent after registering complaints) and they simply won’t work with my iPod 160 gig. I get static noise and the iPod stops or skips mid-song. This only happens with these headphones - not any others that I have. It also happens on my iPad (another Apple product) with these headphones. I have a lot of Bose products and they all have been excellent EXCEPT for this. After a replacement by Amazon and then a replacement from Bose, I am frustrated and tired of complaining. I’ll not buy any Bose headphones again and do not recommend anyone else buying them.",
      "rating": 1.0,
      "verified": true,
      "author": "S S",
      "helpful_votes": 0,
      "publication_date": 20191127
    },
    {
      "title": "Very Little Bass!",
      "text": "Deep what?...Bass? I don't think so. Was not happy at all with this product especially for the price. The sound quality of the highs are good, but not that good. And most importantly these are made to let in background sound for safety since they are sport versions. I didn't know that until receiving them and then and looking up the issue in reviews.",
      "rating": 2.0,
      "verified": true,
      "author": "Mark Hawkins",
      "helpful_votes": 6,
      "publication_date": 20171209
    },
    {
      "title": "Best earbuds I've found",
      "text": "After trying a Bunch of earbuds these are the clear winners! They are comfortable and really stay in well. The sound quality it excellent too. Sound isolation is also great, it's pretty much directed into my ears and nowhere else. I can hear what I'm listening to perfectly without having to turn the sound up super loud and so the people around me don't have to hear it too. The case that comes with them is great, it's low profile and easy to keep up with. The earbuds also have a little clip attached to them that makes it easy to attach them to my clothes and not lose them either. Overall, excellent product!",
      "rating": 5.0,
      "verified": true,
      "author": "Victoria Hoover",
      "helpful_votes": 0,
      "publication_date": 20191219
    },
    {
      "title": "Works with Android",
      "text": "These sound great and they're very comfortable. They dont seal you ears like most earbuds that block your ear canal, so you can still hear whats going on around you, however the sound is still great. The lows are deep enough. Even though I got the ones listed for Apple devices, they work great with Android except for the volume buttons, but I can live with controlling the volume from my phone. I can control song playback/pause/next/call end, all with the middle button by pressing it once to pause/play and end calls, twice to skip, etc. I saved a bunch by buying these instead of the Android version.",
      "rating": 5.0,
      "verified": true,
      "author": "CG",
      "helpful_votes": 0,
      "publication_date": 20190403
    },
    {
      "title": "Sounds fantastic- stays in ear during workout really well. Mic/ remote works great",
      "text": "Very happy with these - I tried Bluetooth headphones from another brand and was so disappointed by how quiet they were and how tiny the sound was so I decided for me, wired is the way to go. I am so impressed with these Bose SoundSport they can get very loud, they sound amazing, and they totally stay in my ear during my (pretty quick) five mile walk. The “stay hear” pieces definitely work even when sweating. Again the headphones sound great - you really hear all the parts of the music without too much bass or tremble they are incredibly well balanced. Highly recommend. Also the in-line Mike and remote works great with Siri on the iPhone",
      "rating": 5.0,
      "verified": true,
      "author": "Mac Hawes",
      "helpful_votes": 0,
      "publication_date": 20190814
    },
    {
      "title": "Disappointing Sound Quality",
      "text": "I am a big fan of Bose products that’s why I’m so disappointed that Bose let these earbuds pass considering their high standards. A great looking set of earbuds and a very comfortable fit. That's where it ends. These earbuds are for when you want to listen to music as well as every other exterior noise. The highs are very tinny and the base is nonexistent. You need to turn up the volume to a dangerous level before you can get decent sound quality out of them. Compare to a set of disposable earbuds you get at the gym. The fact that Bose has the nerve to charge $99 for this quality of earbuds is a joke.",
      "rating": 1.0,
      "verified": true,
      "author": "Vicious",
      "helpful_votes": 0,
      "publication_date": 20190329
    },
    {
      "title": "Bose drops the ball",
      "text": "Similar to some of the other posts, they won't stay in your ears. Manually have to just squish and good them in. I tried the other 2 size ear adapter things and there was no change. Also, 0% noise canceling, so a super waste of money if you want to use them on a plane. A $20 cram in you're ear round traditional ear bud will work fine.",
      "rating": 2.0,
      "verified": true,
      "author": "Fizbin",
      "helpful_votes": 0,
      "publication_date": 20190815
    },
    {
      "title": "Best ever earbud design",
      "text": "I bought these as an extra pair of my favorite Bose earbud design. They fit comfortably \"on the inside of the ear with the tip of the bud at the entrance of the ear -- it is not stuck into the ear canal. I wear these 10-12 hours daily with no discomfort. And the Bose sound quality is superb. Yes. I'd love to have this type of earbud in the bluetooth design but Bose has chosen not to make that style. I hope they reconsider. For comfort, sound quality, even at regular price, these are terrific. At this sale price I'll probably get another set.",
      "rating": 5.0,
      "verified": true,
      "author": "Grant Hiesterman",
      "helpful_votes": 0,
      "publication_date": 20190818
    },
    {
      "title": "Extremely comfortable fit, and HD sound quality.",
      "text": "The noise cancellation isn’t the best, but the sound quality is top notch, and they stay in your ear perfectly. This is the most comfortable fitting earbud I’ve had in a long time. My ears are sensitive to a lot of other in-ear headphones because they stretch out my ears or irritate them, but these fit so snug and are extremely lightweight. I can’t stress enough how glad I am with these. I haven’t had a comfortable pair since 2012. I’ve tried many many many other headphones, but they either irritate my ears and are uncomfortable, don’t produce high quality sound, or fall out cause of poor design. These are perfect!!",
      "rating": 5.0,
      "verified": true,
      "author": "Dan Ryan",
      "helpful_votes": 0,
      "publication_date": 20190315
    },
    {
      "title": "Not worthy of the Bose name",
      "text": "This is my second set of Bose earplugs and I had expected these to be equal if not greater than my first set whose wires were slowly coming apart. Plugged these in and was bummed. The sound quality is akin to cheap airline buds, very little bass and lacking richness/depth. Like my first set, the wires are very light (flimsy) but I’m hoping they won’t come apart. I am a loyal believer in Bose having owned several headphones (which are fantastic) but for earbuds, I think I’ll pass when these need replacement. The only positive I can say is they are comfortable in the ear.",
      "rating": 3.0,
      "verified": true,
      "author": "VKSheridan",
      "helpful_votes": 0,
      "publication_date": 20190913
    },
    {
      "title": "NOT IMPRESSED.",
      "text": "I own Bose products, but these headphones are not impressive. They came with 3 different size ear attachments. None fit nice and snug all where loose and didn't give a good seal around my ear holes. Also they are not loud and have no bottom end also they are no clearer than my Betron BS10 headphones I got for around $10 on here. I will continue to use the ones I have they are a deal for around $10. If u think the Bose that I reviewed are the best, either u haven't tried many headphones or you are just a fan boy/girl of anything with the Bose name on it and high price tag.",
      "rating": 2.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 0,
      "publication_date": 20190809
    },
    {
      "title": "Best Earbuds Ever",
      "text": "This is 3rd set of the same Bose earbuds. I love the sound of these earbuds. The sound is crystal clear especially when I'm on calls all day long. The cord is also durable. I've dropped my phone quite a bit and the cord is still intact. I would never consider any other brand. I always have 2 of them on hand, one for work and one for home. It's my favorite way of catching up on my Audible books or podcasts while running or walking. I highly recommend it!",
      "rating": 5.0,
      "verified": true,
      "author": "ak",
      "helpful_votes": 0,
      "publication_date": 20181023
    },
    {
      "title": "Um, Really Bose",
      "text": "Bought these to upgrade from the earbuds that came with my iPhone. What a huge letdown. These sound worse than the apple earbuds. I cannot believe Bose is selling such low-quality junk. Wow. Unbelievable Bose.",
      "rating": 1.0,
      "verified": true,
      "author": "William J. Edwards",
      "helpful_votes": 2,
      "publication_date": 20190804
    },
    {
      "title": "Great!",
      "text": "These sound awesome to me. Granted I am not an audiophile, but I enjoy listening to contemporary, classic rock, and podcasts with these. The base is full, but that is the sound I like. They are remarkably comfortable, yet snug and secure in the ear. They do let outside noise in, which for me is good, since I want to be able to hear people when I have them in. I have an older version of these without the clip, and am glad they added it. I know these are all old technology now, but they are still my favorites.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191208
    },
    {
      "title": "Great Headphones for Working Out",
      "text": "Positives: - The fit on these headphones is amazing. I am never concerned that they will fallout. - Good features. The inline controls are decent and always work as expected on my Android. - Good build quality. Nothing much to say here, Bose knows what they're doing Average: - Sound quality and noise cancellation is not why you're are getting these so don't expect much (bass, low ends, etc.). Negatives: - With more wireless headphones around, you do wander why you are attached to your phone while working out. I have them as a backup in case my wireless headphones run out of battery. - The cable gets tangled constantly.",
      "rating": 4.0,
      "verified": true,
      "author": "Adrian Hernandez",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "Only works for a week, then the malfunction.  Second pair same problem.",
      "text": "These are only good for a week and then they start to malfunction. I’m returning the second pair after normal use. First they start to cause problems on video playback where they cause the video to stop. Then they start to crackle in one or both ears. When using them as a phone mic, people only hear crackling. These are garbage. Bose should be embarrassed to have their name on them and remove/destroy them from amazon. So disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 0,
      "publication_date": 20190623
    },
    {
      "title": "Good for what they’re made for.",
      "text": "These are solid earbuds and have pretty good sound quality. However, they are earbuds, so they don’t really have the best bass response, but it’s still fairly solid. Sound isolation is surprisingly good, but they aren’t noise cancelling, which is probably responsible of Bose considering they’re meant to be used for exercising. Ultimately, they are good-sounding, durable sports earbuds but are not meant to be your primary listening device. If you’re looking for something with top quality that you can use around the house or something, look into over-ear headphones.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "Does not work on latest Apple products / not on iPhone 8 or 10",
      "text": "Very misleading information. Outdated product description. Buyer beware. Does not register on late model apple products, even when using an APPLE jack converter. Does not recognize the device. Amazing that they have not change the product description.",
      "rating": 1.0,
      "verified": true,
      "author": "Rick Von Feldt",
      "helpful_votes": 2,
      "publication_date": 20190810
    },
    {
      "title": "If I Could Give 6 Stars, I Would",
      "text": "I love the volume control on the wire. But more than anything, I love that I can wear these running and they are perfectly secure in my ears! Requested ear buds for running for Christmas and got these and they're perfect. Love, love, love, love them and they've changed my exercise experience from being frustrated with and distracted by my ear buds to having these. Also, good sound cancellation. Appreciate the clip on wire to secure to my t-shirt so that a bouncing wire won't yank on my ears. Perfect product.",
      "rating": 5.0,
      "verified": true,
      "author": "trice01",
      "helpful_votes": 0,
      "publication_date": 20200215
    },
    {
      "title": "Stunning sound quality !",
      "text": "I exclusively listen to classical music and am more than delighted with those earbuds. The quality of the sound is incredible - a lot better than you would expect for this price range. The noise cancellation is indeed to be improved, but not much worse than with many other brands. I have tried more than 10 other headphone but BOSE beats them all.",
      "rating": 5.0,
      "verified": true,
      "author": "Jane Losson",
      "helpful_votes": 0,
      "publication_date": 20190615
    },
    {
      "title": "Comfortable fit - forget that it's there",
      "text": "It is very comfortable for me and fits in my ear very well. I forget that it is there due to how light it is. When there is no music playing, you can hear your surroundings almost as well as without having earphones. Even with music playing, you can still hear your surrounding relatively well. No passive noise canceling, but is expected as it is for outdoors. I walk to school with them on and I can hear cars and stuff around me, which I prefer. Sound is good. Not much bass, but sounds clear and enjoyable. Would recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Gen Ito",
      "helpful_votes": 0,
      "publication_date": 20190810
    },
    {
      "title": "These are the best headphones my husband has started stealing them",
      "text": "I have been getting these headphones year after year. Not because they go bad but because others borrow them and break them the losers. I only get these ones now because they stay in my ears while working out and I get SUPER sweaty! And even if they do happen to fall out I can get them to normally stay back in unlike anyother ear buds I have tried after I am already sweaty. I also can wear these for HOURS AND HOURS (like over 24 hrs!) and they won't hurt my hears they are so comfy.",
      "rating": 5.0,
      "verified": true,
      "author": "Danielle",
      "helpful_votes": 0,
      "publication_date": 20190815
    },
    {
      "title": "If you sweat a lot, this won't do...",
      "text": "There are many great things about this product, which you can read in other reviews. However, I paid $100 to listen to music while I run and this product had glowing reviews about the earphones staying in your ear. They do not. If you're someone like me who has searched for a long time to find earphones that stay in when you sweat and exercise, save $100 and try a different product (and let me know if you are successful ... I'd love to know.) The sound quality, comfort, etc. means nothing if it's not in my ear.",
      "rating": 1.0,
      "verified": true,
      "author": "its yeet or be yeeted out here",
      "helpful_votes": 5,
      "publication_date": 20170625
    },
    {
      "title": "Extremely comfortable \"in-ear\" headphones",
      "text": "I LOVE these Bose in ear headphones!! They are super comfortable and you hardly notice that you have anything in your ear. I listen to audiobooks while working in the yard, cleaning house or, driving down the road. If my iPhone rings I can answer quickly with the device controls. This is my second set of these and I will buy again if I need to replace. My first set is 5 years old and the wire is a little worn from dropping my phone but they still work and I keep them at my desk while working at home.",
      "rating": 5.0,
      "verified": true,
      "author": "Pen Name",
      "helpful_votes": 2,
      "publication_date": 20170504
    },
    {
      "title": "Bose is the best quality, hands down!",
      "text": "Just replaced a pair of these that my husband had for several years. We know and trust the Bose brand for great quality and durability. These are the best in ear headphones you can buy. They are 20 times more comfortable than the apple headphones in your ears! My husband uses them to talk on the phone and says the sound quality and mic are excellent. They also come with a nice little carrying case. If you have the money to spend and want a product that will last. These are for you. If this review was helpful please mark it as such! 💛",
      "rating": 5.0,
      "verified": true,
      "author": "Emily Carmony ",
      "helpful_votes": 0,
      "publication_date": 20180407
    },
    {
      "title": "They hurt, and they're hard to hear.",
      "text": "I'm looking to upgrade from the standard wired earbuds you get with any Apple device, and thought these would do the trick. NOPE. First off, even with three sizes of ear...flaps? Wings? Inserts? Whatever, the clear plastic thing that's supposed to affix to the inner curve of your ear, even with that, it doesn't quite fit well. Second, the sound quality just isn't there. I have better highs, lows, and mids - especially lows - with the standard Apple free stuff. I used them once at home, once on a plane, and went \"SEE YA!\" Back to Amazon they go.",
      "rating": 2.0,
      "verified": true,
      "author": "Sosai X",
      "helpful_votes": 0,
      "publication_date": 20190726
    },
    {
      "title": "It works",
      "text": "Okay, I got this after having the Bose ultra earphones for over 5 years. I loved them and they lasted forever. When the protective covering started to wear and the wire started showing, I looked into another pair. This one is okay. It works. I'm really picky about the sound quality and I still have to use it enough to know for sure. I believe it sounds as good as my Ultras, but want to check it out more . The main point I'm not happy about is the wire is very thin...so I'm concerned it won't wear as well as my last pair. With the price I got it for, it's a fair deal.",
      "rating": 4.0,
      "verified": true,
      "author": "chasmin",
      "helpful_votes": 0,
      "publication_date": 20190720
    },
    {
      "title": "Not for bass lovers",
      "text": "I ordered 2 pairs of these headphones. The overall build quality of the product was great as was the comfort of the earpiece. I was so disappointed with the sound of these headphones. I am a bass lover and these are the first bose product I was seriously disappointed in. I very rarely do returns. I returned both pairs. Neither my husband or I could justify paying even the reduced price for these.",
      "rating": 2.0,
      "verified": true,
      "author": "irishgirlieb",
      "helpful_votes": 0,
      "publication_date": 20190418
    },
    {
      "title": "Most comfortable, great sounding and balanced headphones in the planet.",
      "text": "Bose doesn't go wrong with this pairs of earphone in regards to sound and comfort. These are awesome set when you are commuting and are attentive to the surrounding environment. I commute about 8 miles back and forth everyday and like to pay attention to what's going on. And these help me at all times. Due to their comfort, fit and sound quality, I can wear them for a prolonged period of time. If you just got one of these, don't rush to review. Wear them at least a week and you will find the difference. I sincerely recommend these headphones to anyone loving music and also pays attention to the surroundings on the go.",
      "rating": 5.0,
      "verified": true,
      "author": "Puru",
      "helpful_votes": 0,
      "publication_date": 20180821
    },
    {
      "title": "Dont stay in my ears",
      "text": "The earplugs have a weird design that make them hard to hear and fall out easily. Maybe my ears are designed weird and they work for other people? Anyway, if I used my fingers and crammed the earbuds into my ears the sound was good but of course that is not a long term solution to the issue. I tried both the different sized crescent thingies that came with the earbuds but still no dice. They fall out easily and keep the buds so far away from my ear that I couldn't hear music well.",
      "rating": 2.0,
      "verified": true,
      "author": "Franko2000",
      "helpful_votes": 0,
      "publication_date": 20190810
    },
    {
      "title": "Not Impressed",
      "text": "For the name and price I'm not satisfied. I don't care if these are for running and they allow for some outside sounds to leak through. If your worried about getting hit by a car or honking horns then don't listen to music in the first place while running. The sound is not that great because of the outside noise interference which makes buying alleged high quality headphones not worth it in the first place.",
      "rating": 1.0,
      "verified": true,
      "author": "jerad",
      "helpful_votes": 2,
      "publication_date": 20190322
    },
    {
      "title": "The second pair has been much better and have been an overall great pair of headphones ...",
      "text": "My first pair ended up crapping out after a week or so of use, so I was skeptical to order a second pair (especially for the price). The second pair has been much better and have been an overall great pair of headphones for the gym and around the house. They don't get crazy loud which is honestly a good thing for your hearing, but I'd imagine on a plane they may be a bit quiet. Good sound quality for in ear headphones, much better treble/bass than your regular in ears that would come with your phone. The microphone works well for calls, no complaints about cracking/soft voice!",
      "rating": 4.0,
      "verified": true,
      "author": "Tyler Reed",
      "helpful_votes": 0,
      "publication_date": 20180206
    },
    {
      "title": "OVERALL REVIEW",
      "text": "PROS: -Crystal clear audio, -Honesty most comfortable pair of ear buds I have ever worn -Super light weight and portable -Great packaging -THEY CAN GET VERY VERY LOUD! CONS- -Literally no noise cancelation at all.... - The wire is so thin and feels incredibly cheap, so does he remote..... - very little bass, - Get tangled so easily OVERALL: great but no where near worth 100+$",
      "rating": 3.0,
      "verified": true,
      "author": "Labib Mahmud",
      "helpful_votes": 4,
      "publication_date": 20160728
    },
    {
      "title": "highly recommend these to anyone that wants good sound but doesn’t ...",
      "text": "Outstanding earbuds and with the discount price it made a very worthwhile buy....highly recommend these to anyone that wants good sound but doesn’t want a pair of earbuds that completely block out everything around you. Are use them in my office and they’re great for listening to music and blocking out all the background conversation but I can still hear my phone when it rings... Thank you Bose for a great product....",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas J.",
      "helpful_votes": 2,
      "publication_date": 20180125
    },
    {
      "title": "Deliberately no seal - not noise isolating",
      "text": "Only after trying these did I discover that they are deliberately designed not to form a vacuum seal within the ear canal for noise isolation purposes. Without a vacuum seal, I have to crank the volume way up to mask out background noise, and there's no 'suction' preventing them from falling out. As such, they are a poor fit for the gym.",
      "rating": 1.0,
      "verified": true,
      "author": "Nesky",
      "helpful_votes": 3,
      "publication_date": 20171129
    },
    {
      "title": "Great Ear buds / Head Phones",
      "text": "The sound quality is excellent. I kept getting cheap ear buds, and they would sound horrible. These are excellent. I have many sets of headphones, my Audio-Technica ATH-MSR7 are my go to head phones. These are getting close to that quality, but they're more comfortable. I can keep these in my ears for hours and hours with no discomfort. These are excellent for gaming. I hate wireless headsets and I don't understand why Bose is pushing that garbage. Keep me wired please.",
      "rating": 5.0,
      "verified": true,
      "author": "Byron Goodman",
      "helpful_votes": 0,
      "publication_date": 20190809
    },
    {
      "title": "Great in-ear headphones at a budget friendly price.",
      "text": "When it comes to great sound, you expect it to cost some serious money. These are the happy solution to a low cost, great sound in-ear headphone. My last pair lasted two years of daily use. I finally had to replace them, not because I wore them out but because I dropped one ear bud in a pan of cooking oil (not hot, thankfully). After much slinging to get the oil out, wicking and what-have-you, they still worked!!! There was just a bit of dampening of sound and I like to use them to sing on smule (a karaoke app), I decided to get a new \"unoiled\" pair. Happy, Happy :-).",
      "rating": 5.0,
      "verified": true,
      "author": "Marsha Smith",
      "helpful_votes": 0,
      "publication_date": 20190513
    },
    {
      "title": "They work great!",
      "text": "My all-time favorite headphones. Sound is very good and THEY STAY IN MY EARS. I like to go to sleep with an audiobook and these earphones are comfortable enough to sleep with and they stay in place until I consciously remove them. I've broken the wires on two pairs (not that easy to do) over the last 8 years and have made a point of getting the same kind as replacements. I hope Bose never changes this model, as I'll be heartbroken if I ever have to look for some other kind.",
      "rating": 5.0,
      "verified": true,
      "author": "Saelon R.",
      "helpful_votes": 0,
      "publication_date": 20180314
    },
    {
      "title": "Disappointed",
      "text": "No ambient sound muffling at all (which I expected some due to in the ear design). Could hear conversation across the room while also blasting my music :( Even with smallest ear piece attached, could not wear for more than 45 minutes because did not fit in my ear right and caused pain. Pros: stays in your ears Cons: $20 off brand replacement pair has better sound quality, more comfortable and muffled background noise. These do not",
      "rating": 2.0,
      "verified": true,
      "author": "Shannon L",
      "helpful_votes": 0,
      "publication_date": 20191101
    },
    {
      "title": "Not as good as the previous version",
      "text": "Not as good as the previous set I owned. The Bose quality isn't that great in this product. Most newer models when it comes to electronics and components usually means upgrades. I'm not alone in thinking these in-ear Bose aren't as good as the previous set I owned(black and white wired).",
      "rating": 3.0,
      "verified": true,
      "author": "C. Medina",
      "helpful_votes": 3,
      "publication_date": 20171128
    },
    {
      "title": "They are worth every penny",
      "text": "I have bought many different brands from cheap to headphones on the range of the 50-60 dollars . The result was that I was never satisfied. This headphones deliver everything I wanted they are VERY comfortable, sometimes I forget that I am wearing them, they have a very nice sound and the remote control is just convenient. Do not waste your money on 30-40 dollar headphones that might have \"good\" sound but are uncomfortable. This guys are worth its cost they offer great value. I even like them better than other Bose over the ear phones because those my ears warm after a short period of use.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20160622
    },
    {
      "title": "Disappointed",
      "text": "While the sound quality is almost as good as past models, the microphone for phone calls is so very poor that I literally have to hold the mic up to my mouth at about 6 inches from my mouth. People complain that they can't hear me or that I am breaking up. I don't use these as much as my older Bose Sport Headphones because of this problem so I don't know how they hold up over time. I have been a loyal Bose fan for years, but these are simply disappointing.",
      "rating": 3.0,
      "verified": true,
      "author": "Victor R. Peterson",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "Great for me",
      "text": "Love bose headphones. Use these for work and they’ve been great. No issues. Use them a lot too at work and I work graveyard night stocking shelves. I also talk with my friends while at work and they all say the mic sounds okay and they can hear me clearly. Had them for over a month now and still working wonders. No issues with wires or sound. Edit: The play/pause button just broke on me. I forgot when I bought these but it’s very annoying. So that sucks :/",
      "rating": 3.0,
      "verified": true,
      "author": "Devon Rosales",
      "helpful_votes": 0,
      "publication_date": 20190517
    },
    {
      "title": "JUNK",
      "text": "Ear buds are junk!!! Used them for a week or so and once in the rain. It would not respond to any buttons, I could not even shut it off. Returned it and they offered to send me another one. I agreed and they sent me a one of their portable batteries. This company is a joke, save your money and do what I did. Instead of buying cheap earbuds every 6 months I went ahead and splurged of the BOSE. The ear buds in the market!!",
      "rating": 1.0,
      "verified": true,
      "author": "V. Arzabe",
      "helpful_votes": 0,
      "publication_date": 20191019
    },
    {
      "title": "Fine sound but dont stay in while running",
      "text": "Stellar audio aside, these will not stay in my ears. Billed as “sport earbuds,” these aren’t designed well. I use them for running and the vibration causes them to dislodge from their fit. I tried all three sizes that came with the product but I still have to constantly reach up and reinsert them. I had better luck with the Yurbuds but the two pair that I used ended up with one side going out, the last pair after three uses...",
      "rating": 2.0,
      "verified": true,
      "author": "Dan",
      "helpful_votes": 0,
      "publication_date": 20191206
    },
    {
      "title": "Great sound but wires wont last",
      "text": "Dont waste your money on bose headphones. They sound great but wont last. Very poor quality in construction. The wiring will begin to fall apart and the base wire cant go through any type of stress without cracking. Ive purchased 4 of them...mainly due to sound but in the end, Bose wired and wireless headphones suck...great sound but wires wont last.",
      "rating": 1.0,
      "verified": true,
      "author": "Tim Vargas",
      "helpful_votes": 0,
      "publication_date": 20190526
    },
    {
      "title": "These are awesome, well worth the price!",
      "text": "I use these with an old mp3 player at the gym and for running, and they fit and sound great. I had old Apple earphones which were the best but after 4 years, 2 marathons and back and forth from gym, the cable broke. It has been a struggle to find wired earphones that were equally good. Finally I decided to take a chance on these and dont regret - I would say they are even a tad better than Apple's because they really dont get loose from ear. Highly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "Stenio Ferreira",
      "helpful_votes": 0,
      "publication_date": 20190912
    },
    {
      "title": "Great quality sound; comfortable and reliable",
      "text": "These headphones are great. I didn't want to get Bluetooth because I didn't want to have to worry about charging another thing in my life. These are comfortable and stay in place during exercise. The sound quality is excellent and the phone microphone is clear, better than without using the headphone mic. I use them at work often, and accidentally put them through the laundry - wash & dry. I wouldn't recommend that, but they still work fine! (and are very clean).",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel Atkinson",
      "helpful_votes": 0,
      "publication_date": 20190530
    },
    {
      "title": "Good sound quality but uncomfortable ear placement/feeling",
      "text": "I guess the sound quality on these is good enough, and the material quality is great. The downside of these for me is that none of the three sizes of ear buds that came with this fit my ear right because of the weird plastic wing thing that's supposed to hold it in place. It pushed the earbuds to a weird angle in my ear, which results in these being highly uncomfortable after more than 20-30 minutes. Maybe my head is just weird though?",
      "rating": 3.0,
      "verified": true,
      "author": "Emily Davidson",
      "helpful_votes": 0,
      "publication_date": 20181231
    },
    {
      "title": "Sounds great, questionable quality. 5 stars for sound and fit. 0 stars for volume control.",
      "text": "Bought the Bose SoundSport headphones 1 week ago and the in-line volume control has already stopped working (checked them on an iPod Nano and a cuurent generation iPod). I really like the sound and Bose's approach to holding the earphones snuggly in your ears for bikiing and runing. Over the years, these are the fifth set that I've had, and in every case , the volume control buttons quit working. Unfortunately, I threw all of the packing material away, otherwise I would return these. It may be time to look for another brand.",
      "rating": 3.0,
      "verified": true,
      "author": "LZ",
      "helpful_votes": 3,
      "publication_date": 20170515
    },
    {
      "title": "Absolutely not sweat resistant",
      "text": "These headphones are not water or sweat resistant at all. After a particularly sweat run today, the left earbud is nothing but static and it continuously turns the volume down to silent. These are no longer usable. I bought my sweet in April of 2019, and they later less than 3 months.",
      "rating": 1.0,
      "verified": true,
      "author": "Joel Tourigny",
      "helpful_votes": 0,
      "publication_date": 20190622
    },
    {
      "title": "Bad product",
      "text": "Very poor quality product. I'm almost 3 months to the day of wearing it, and the volume adjuster no longer works. After switching back to my iphone headphones I was surprised... the sound quality is better!",
      "rating": 1.0,
      "verified": true,
      "author": "M. Meyer",
      "helpful_votes": 7,
      "publication_date": 20170425
    },
    {
      "title": "Eh It's alright",
      "text": "I'm not in love with these ear buds. The earbuds are hard to fit in my ear and the bass on these are awful (I tested back to back with my Sennheiser headphones and AKG earbuds). It couldn't handle the bass and would start breaking up, so I'll be returning them. I think it has a nice sense of atmosphere (as in, it sounds more like a surround sound compared to other ear buds I've tried in the past) but that's the only plus i can give it.",
      "rating": 3.0,
      "verified": true,
      "author": "JJ",
      "helpful_votes": 0,
      "publication_date": 20190528
    },
    {
      "title": "Bose is the Best!",
      "text": "My wife has oddly shaped ear canals. I'm not making fun of her (I love her unconditionally), I'm simply stating a known fact about her freaky ears. With that said, she has issues with almost every earbud-type headphone. Every headphone except Bose. She LOVES these things. They sound great! They fit great! They're GREAT! These are the ones that plug into the phone and do NOT have noise cancelling technology. Just wanted to make sure you knew that.",
      "rating": 5.0,
      "verified": true,
      "author": "T. Person",
      "helpful_votes": 0,
      "publication_date": 20190820
    },
    {
      "title": "Very comfortable",
      "text": "Awesome headphones. I plug them into my PS4 controller for games and movies. Always crisp, clear audio, decent bass for a small package, and they're very comfortable. It's also not fully \"in-ear\" ear buds so when I paused my game to talk to people I don't have to take them out to hear them. I couldn't be more pleased with my purchase",
      "rating": 5.0,
      "verified": true,
      "author": "Jared Cardinet",
      "helpful_votes": 0,
      "publication_date": 20190307
    },
    {
      "title": "Most comfortable in ears ever",
      "text": "Own more expensive headphones but these get the most use, this is my third pair. Others were destroyed due to my clumsiness but they do take a beating before giving out.i can wear these all day without a hint of discomfort. Exceptional ear bud design and sound quality!!",
      "rating": 5.0,
      "verified": true,
      "author": "Ed Vela",
      "helpful_votes": 0,
      "publication_date": 20190416
    },
    {
      "title": "They always stay in!",
      "text": "These are the only ear buds I have found that will comfortably stay in my ears. I use them at the gym, while running, and every day use and they always stay in. And that is the most important quality I look for in earbuds. I’m a semi-audiofile and the sound quality is pretty good, not the best, but good enough for every day use. For the money I think you would be hard pressed to find something better.",
      "rating": 4.0,
      "verified": true,
      "author": "Douglas",
      "helpful_votes": 0,
      "publication_date": 20190805
    },
    {
      "title": "Love Love",
      "text": "I love these headphones. I had the earlier version - which I also loved - and am ecstatic for the new pair. The last ones survived about two years of hard wear - and the final points that died were wire joints (primarily by the plug). But they continued working with clear effectiveness, both for phone call and just general listening use. The newer version is measuring up well thus far after several months of use.",
      "rating": 5.0,
      "verified": true,
      "author": "H'Oscar",
      "helpful_votes": 0,
      "publication_date": 20180930
    },
    {
      "title": "Good sound, not so great inline controls",
      "text": "Worked great for about 15 months and then the inline controls failed completely. Initially the pause button would need to be pushed three or four time to engage but eventually they all failed. Of course it was after the 1 year manufacturers warranty was over. Thankfully I spent the $7 - $8 to get the Asurion extended warranty which was easy to claim and I'll have a full refund shortly. Headphones still sound great but the controls are a must have for me since I use this alone on runs/walks and easy access to make an emergency call is not something I'm willing to compromise on.",
      "rating": 3.0,
      "verified": true,
      "author": "Mrs Clean",
      "helpful_votes": 0,
      "publication_date": 20170815
    },
    {
      "title": "For Bose this is entry level sound but not that good in my opinion.",
      "text": "Not bad but not good. Better than cheap head phones but bass is not deep enough. Have sport wireless headphones Bluetooth and soundlink II, whatever center speaker without the handle. These headphones do not sound like those other products. However remarkably all of those products mentioned sound very much the same. So 50 is entry level sound, 199-299 sounds a little different. Just audio here which is nice too. Apple or android stuff gives me a head ache but more for controls.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190204
    },
    {
      "title": "Second Set",
      "text": "I've used these head phones for years. Quality of sound when I'm at the gym is good; I can still hear people just in case I need to. Mostly I've used them for sleeping. I have tinnitus and sometimes the buzzing gets so loud it's all I can focus on. The cord is long enough so I can keep my tablet next to my bed put the earphones around the back of my neck and use noise cancellation during the night. Works great and they stay in place.",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth H",
      "helpful_votes": 0,
      "publication_date": 20190410
    },
    {
      "title": "Not worth the price",
      "text": "They're decent headphones, but not worth the money, in my opinion. I've lived with $15 for years and figured a $40 pair, on sale when they're normally $90, had to be something special, so I purchased them. They're just okay. For $40 I could have purchased a similar pair of bluetooth headphones and not had to deal with the short cable. I'm 5'11\" and the cable barely makes it from my ears to the jack when the phone is in my back pocket.",
      "rating": 2.0,
      "verified": true,
      "author": "Mike Przybylek",
      "helpful_votes": 0,
      "publication_date": 20190804
    },
    {
      "title": "Disappointed",
      "text": "This purchase is not what I expected from a Bose product. The sound quality is not great. Even with the headphones in my ears and the music on I can still hear external noise. The wire on the earphones are not that long so every time I move the earpiece comes out. This is very frustrating! Certainly not worth the money in my opinion and the product does not live up to the brand name expected.",
      "rating": 3.0,
      "verified": true,
      "author": "Faith Miller",
      "helpful_votes": 0,
      "publication_date": 20190821
    },
    {
      "title": "The best earbuds w/mic - comfy, subtle, and functional",
      "text": "These are AMAZING. The sound quality is excellent and my coworkers never have any trouble hearing me. I work remotely and spend about 50% of my day on video conferences. These headphones are subtle and unassuming, but look far more professional than normal earbuds, and far less tacky than giant over-ear headphones with the wrap around microphone. The microphone works great and I appreciated that it came with multiple sizes for the ear inserts. These stay in my ear, even when I workout, and are so comfortable that I can wear them for hours on end. I will definitely buy these again.",
      "rating": 5.0,
      "verified": true,
      "author": "Rebecca Castro",
      "helpful_votes": 0,
      "publication_date": 20170430
    },
    {
      "title": "Great gift.",
      "text": "I bought these for my boyfriends birthday and he LOVES them. He needed headphones that he could use while working/getting sweaty and these have been perfect. As someone who talks on the phone with him, the speaker/sound quality is heads and tails above any other headphones he's used (including Sony and Seinnheiser). I spent weeks researching headphones, focusing on quality/price and these were the best quality for the price. I would definitely buy these again.",
      "rating": 5.0,
      "verified": true,
      "author": "Anonymous ",
      "helpful_votes": 0,
      "publication_date": 20180803
    },
    {
      "title": "Great upgrade to Apple EarPods",
      "text": "I'd been using the Apple EarPods for a while but I was frustrated with the sound quality and how easily they fell out of my ears. These are a great replacement! The sound quality is great given the price point (I listen to mostly jazz, rock, and podcasts). Also, I like that they're lightweight and stay in my ears, even while running, without needing the rubber pieces wedging themselves into my ears.",
      "rating": 4.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20190114
    },
    {
      "title": "Love them",
      "text": "I was skeptical at first since I never owned a pair of earbuds like these before. The sound quality is amazing for how small these buds are. They are so light that you almost feel like these earbuds will fall out, but I was pleasantly surprised to see that they didn't. I used them once on the treadmill and was so happy to see that they stayed in place. They are so comfortable. They didn't even make my ears sore from long periods of use! I will update this review of anything changes. I highly recommend them and the warranty as well just so you have peace of mind.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170501
    },
    {
      "title": "I wouldn’t buy them again",
      "text": "Just ok. Not good. I felt they were equal to any $20 set of wired in-ear headphones. I went ahead and bought and placed the Bose “Stayhere” (I think that’s the name) noise canceling tips. They didn’t work that well at canceling background noise. Granted, I was at the beach - but my wife’s AirPods with no sound canceling tips sounded much better. I would save up your $50-60 for some better phones - or go with something cheaper for now.",
      "rating": 3.0,
      "verified": true,
      "author": "J. Bennett",
      "helpful_votes": 0,
      "publication_date": 20190606
    },
    {
      "title": "Just what I needed, great fit.",
      "text": "I ordered these to replace the default headphones that were included in my LG cellphone kit. Great investment! They fit in my ears quite well, even when I do strenuous workouts at the gym, or listen to music or audio-books while gardening. The included softshell case helps ensure I'll never lose them, I keep these in my purse, jacket pocket, or backpack when not in use. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Margaret O.",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "Terrible noise isolation",
      "text": "The earpieces aren't snug in your ear canal at all, so the sound quality is terrible, and the sound ISOLATION is terrible. You'd have no trouble having a conversation with someone without shouting with the volume all the way up. I did try multiple sizes, the issue isn't size, it's the way they're shaped. Cheapo $20 bluetooth headphones sound twice as good and isolate sound MUCH better. Don't waste your money on these, I expected better from Bose.",
      "rating": 1.0,
      "verified": true,
      "author": "Jacob Haseman",
      "helpful_votes": 0,
      "publication_date": 20190724
    },
    {
      "title": "Very comfortable, great sound",
      "text": "Everything is great. I got it for $50 after black friday and they're the best earphones I've had, except airbuds might have slightly better sound quality. These fit great. The silicone crescent moons are weird at first, but now I prefer them to anything else. I can wear them for hours on end at work. Sound quality is great, and the ear fit is so well I barely hear anything else (sometimes a problem if my boss is calling me though so I keep volume down)",
      "rating": 5.0,
      "verified": true,
      "author": "Caed Frost",
      "helpful_votes": 0,
      "publication_date": 20181229
    },
    {
      "title": "Perfect buds for me",
      "text": "So far so good on these. Sound quality is superb for earbuds/IEMs. It isn't mind blowing, but it is solid quality sound. Best feature so far is that these fit my ear perfectly and I can even run with them in and they don't come loose. That's a first for me in about 20 pairs of earbuds. They don't cancel background noise per se, but they fit my ears so perfectly that they do a decent job keeping ambient sound out. I'd highly recommend giving these a try. I will update should any long term issues arise.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott O",
      "helpful_votes": 0,
      "publication_date": 20190805
    },
    {
      "title": "Most comfy in-ear headphones I've tried. Works well with iPhone.",
      "text": "These are really comfortable and stay in my ear really well. The silicon in-ear piece fits great in my ears, and it comes with some different sizes. Seem to be great quality, good sound, good controls. They definitely DO NOT prevent external sounds for entering your ear. So if you want something that's noise cancelling, these are not it. You can hear the music just fine, and also hear what's going on around you. I still recommend them!",
      "rating": 5.0,
      "verified": true,
      "author": "Mistercarbohydrate",
      "helpful_votes": 0,
      "publication_date": 20200415
    },
    {
      "title": "Better than the stock buds",
      "text": "I hate how everyone walks around like an iTwit with those white buds. I was one of the lucky folks at work to be given a free iPhone to be called at odd hours of the night, but the hard white buds just sounded aweful. These are worth the $50 sale price. Much better audio quality, they stay in, and let outside sound past for safety while walking outside. The case with clip has the Bose logo on it to boast that you have made an investment.",
      "rating": 5.0,
      "verified": true,
      "author": "Admin_Dude42",
      "helpful_votes": 0,
      "publication_date": 20181214
    },
    {
      "title": "Better than the super pricey ones.",
      "text": "In the past I spend over $100 on Bose headphones, they were great. But after two pairs of the expensive ones - one stopped working, and one lost shortly after purchase, I decided to find a cheaper way to go. These are great. They stay in your ears with running and offer great quality. I prefer wire and a nice ear plug in over the buds. It doesn’t noise cancel. I worked in Starbucks at times but it did not get the noise out unless the volume was high.",
      "rating": 5.0,
      "verified": true,
      "author": "Anita",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "Amazing Sound Quality",
      "text": "Great quality; I previously owned a pair of Power Beats 3 headphones and these BOSE ear buds give a better sound quality and cost less. Get these instead of Beats.",
      "rating": 5.0,
      "verified": true,
      "author": "Matt Rodriguez 1993",
      "helpful_votes": 3,
      "publication_date": 20181030
    },
    {
      "title": "Painful after 15 minutes of wear",
      "text": "The sound quality is slightly better than my 8 dollar Panasonic headphones. You can hear yourself talk when you have them on. My ears began to hurt after 10-15 minutes of wear on both the medium and small sizes. The large size hurt my ears within 5 minutes or less. If you have sensitive ears, these will likely be painful to wear even for a short duration. I was very disappointed as I read so many reviews saying they are comfortable. Not for me.",
      "rating": 2.0,
      "verified": true,
      "author": "Lemons",
      "helpful_votes": 0,
      "publication_date": 20180419
    },
    {
      "title": "Bose Headphones",
      "text": "My husband and I both purchased these headphones to use when we ride our bikes. They come with attachments in multiple sizes to fit inside your ears. I use the small size. Apple headphones frequently fall out of my ears. These stay in comfortably and the sounds is great. They say these work for Apple iPhone, and they do, but they still require the headphone jack adapter for your phone. I love these!!",
      "rating": 5.0,
      "verified": true,
      "author": "Heidi Flitton",
      "helpful_votes": 0,
      "publication_date": 20181202
    },
    {
      "title": "Very disappointing",
      "text": "I think these headphones have a built in obsolescence. After a period of time, the rubber lining on the control side began to stretch and peel off, exposing the pcb and making the controls difficult and silly to try to use. The same thing happened with the rubber insulation on the in-line volume control module. Then they began turning on when plugged into the charger so they could not be charged. Not doing much for the reputation of Bose.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191024
    },
    {
      "title": "Love these",
      "text": "I had a pair of these already, but when I saw the new ones with volume control and mic come up on the Black Friday deal I just had to get myself a Christmas present! They have great sound and work well on conference calls.",
      "rating": 5.0,
      "verified": true,
      "author": "Amy W.",
      "helpful_votes": 0,
      "publication_date": 20190703
    },
    {
      "title": "Durability is a problem",
      "text": "I used to love these but something changed. The sound is good. They stay in your ears with physical activity. Durability is the issue. Something happens and one earbud gets static. Then the volume mysteriously begins to increase on its own. I replaced multiple pairs and the same issue returned. I have moved on. Do not buy these.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190812
    },
    {
      "title": "Second pair. same issue. Left ear stopped working.",
      "text": "This is the second pair I've owned with the same issue. I'm beyond frustrated with Bose. The left headphone stopped working after one year of use. The only way to momentarily get both headphones to work is by bending the base of the cord at a certain angle. There's clearly a short in the wiring and now after owning two pairs with the same issue, it just seems like poor design.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190206
    },
    {
      "title": "Second pair, excellent product.",
      "text": "First pair lasted over 10 years, finally the wires gave out. Bought these as a replacement. Excellent sound. light weight, stays in you ear. I think better sound that Apple ear buds. Not as good as paid of headphones but those make my ears sweat out here in California. So for me the best bang for the buck. You have to use the dongle if you attach them to your I-phone. Oh yes works with Apple phone, easy to talk on the phone with these in you ears. Great for music.",
      "rating": 5.0,
      "verified": true,
      "author": "Philip A. Parker",
      "helpful_votes": 0,
      "publication_date": 20190109
    },
    {
      "title": "Great but..,",
      "text": "I love Bose. They have amazing quality products. However I am a bit disappointed that they state they are compatible with iPads, iPhone and iPods but have the old style plug. This wouldn’t be an issue for me if they included an adapter, but it does not which now adds to my cost for using this headset.",
      "rating": 4.0,
      "verified": true,
      "author": "Adam West",
      "helpful_votes": 0,
      "publication_date": 20190115
    },
    {
      "title": "These stay in your Ears!!!",
      "text": "Second pair for me and Wife has them too. Works exceptionally well with the iphone. The sound is great and when I mow the lawn with them I put my noise reducing ear muffs on and over these in my ears and I can hear every song fantastically. I dont think you can go wrong with Bose personally, I will buy them again as I tend to be rough on them and they last for years.",
      "rating": 5.0,
      "verified": true,
      "author": "Cigar Smoke",
      "helpful_votes": 0,
      "publication_date": 20191109
    }
  ],
  "product_meta": {
    "title": "Bose SoundSport, In-Ear Sports Headphones for Apple devices, (Water and Sweat Resistant Headphones), Charcoal",
    "description": "Color:Charcoal| Style:AppleBose Sound Sport in ear headphones deliver deep, clear sound for the music you love, with a durable design that stands up to the rigors of your day. Exclusive TriPort technology provides crisp highs and natural sounding lows, while acoustic ports are positioned to resist sweat and weather, and hydrophobic cloth keeps moisture out. Proprietary Stay Hear tips conform to your ears' shape, so they stay comfortably in place all day long. They come in a variety of colors to match your style: Charcoal, Frost, Energy Green, Power Red or Neon Blue. They even include a matching carrying case for storage and added protection. And an inline microphone and remote make for easy switching between calls and music with select iPhone models. Meet the headphones engineered to go wherever life takes you. Included: Sound Sport in ear headphones; 3 pairs Stay Hear tips (S, M, L); carrying case; clothing clip.",
    "rating": 4.3,
    "feature_bullets": [
      "The following Apple products are compatible with the (3.5 mm Jack) audio cable that has an inline remote and microphone: iPhone: 3GS, 4, 4S, 5, 5C, 5S, 6, 6 Plus , iPod touch: second, third, fourth and fifth generations , iPod classic: 2009 (120GB and 160GB) , iPod nano: fourth, fifth, sixth and seventh generations , iPad : all models , MacBook : unibody and Pro , iPod shuffle : 3rd and fourth generation",
      "Proprietary Stay Hear tips, in three sizes, conform to your ear's shape to stay comfortably in place all day",
      "Sweat and weather resistant; engineered and tested for lasting quality and durability. Not noise cancelling",
      "Inline microphone and remote for easy switching between calls and music with select iPhone models",
      "Matching protective carrying case included. Please Note: Kindly refer the User Manual before use also see page 10 for troubleshooting. Sound Sport in ear headphones:1.06 meter (17.86 gram ),Stay Hear tips:2.5 centimeter Height x 1.9 centimeter Width x 0.95 centimeter Depth ,Clothing clip:1.9 centimeter Height x 0.63 Width x 1.27 centimeter Depth,Case:8.4 centimeter Height x 8.4 centimeter Width x 2.8 centimeter Depth"
    ],
    "specifications": {
      "Product Dimensions": "4.88 x 1.88 x 8.75 inches",
      "Item Weight": "0.64 ounces",
      "ASIN": "B0117RFOEG",
      "Item model number": "741776-0010",
      "Customer Reviews": "4.3 out of 5 stars9,926 ratings4.3 out of 5 stars",
      "Best Sellers Rank": "#1,388 in Earbud & In-Ear Headphones",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "September 10, 2015",
      "Manufacturer": "Bose Corporation"
    },
    "categories": [
      "Earbud Headphones",
      "Electronics",
      "Headphones"
    ],
    "price": ""
  }
}