{
  "website_summaries": [
    {
      "verdict": "Works wonders on dry, flaking skin yet gentle enough for use on even the most sensitive skin.",
      "pros": [
        "Doesn't leave skin feeling sticky or oily",
        "Suitable for all skin types",
        "One of the best options for very dry skin",
        "Provides all-day moisture while brightening skin",
        "Soothing and plumping"
      ],
      "cons": [
        "Serum is on the high end of the price spectrum"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Superb",
      "text": "This HA serum is superb. I have tried many others, even one from Paula's Choice which also has 2 forms of Hyaluronic acid, but it was just sticky and it didn't do anything. This one instead penetrates and hydrates instantly without leaving a sticky sensation. Another Plus is that it doesn't have all those useless and irritating ingredients like alcohol, lavender oil, witch hazel, parabens...thus it's perfect also for very sensitive skins or after cosmetic procedures. I am only giving 4 out of 5 though because it came without a seal.",
      "rating": 4.0,
      "verified": true,
      "author": "Cathlyn",
      "helpful_votes": 18,
      "publication_date": 20170808
    },
    {
      "title": "Great for hydration, for face, elbows & hands!",
      "text": "It’s on been a few days, but so far I love this product. My skin looked fresher and felt softer the first day. It worked on a dry elbow and, best of all, worked a miracle on my nails, and the skin around them -overnight stopping drying and splitting -a surprise benefit! On the face, it gets very warm for a short time after application, but that means it’s working. Good purchase!",
      "rating": 4.0,
      "verified": true,
      "author": "JJB",
      "helpful_votes": 2,
      "publication_date": 20190322
    },
    {
      "title": "Best Moisturizer ever.",
      "text": "This is the best moisturizer I have ever used. Dry skin and dry cracked lips disappear. Use it right after washing your face to lock moisture in.",
      "rating": 5.0,
      "verified": true,
      "author": "aletia",
      "helpful_votes": 6,
      "publication_date": 20180226
    },
    {
      "title": "Excellent way to hydrate your skin!",
      "text": "I have always had very dry skin, even as a teenager. My dermatologist suggested to mix one drop of Replenix with my moisturizer to hydrate my skin. The very first time I tried her suggestion, my skin was “ soft as a baby’s bottom” ! I have used it twice a day since then on my face, neck, and chest. It has helped make my face and neck look a bit younger, and definitely smoother and softer. Now, two of my friends are using Replenix. Wonderful product.",
      "rating": 5.0,
      "verified": true,
      "author": "Troy McLaughlin",
      "helpful_votes": 0,
      "publication_date": 20190904
    },
    {
      "title": "Moisturizing",
      "text": "My Dermatologist recommended this and it was cheaper on Amazon that in her office. I use one dropper-full first thing in the morning and one before bed. Feels great.",
      "rating": 5.0,
      "verified": true,
      "author": "Dana",
      "helpful_votes": 5,
      "publication_date": 20170522
    },
    {
      "title": "It’s worth a shot!",
      "text": "I just received this product a week ago, a doctor recommended it to me in order to help lengthen the result of Voluma facial filler. He said it would maintain the product he filled in my temples. In just one week I noticed a skin texture change! Def more supple and a nourished feel",
      "rating": 5.0,
      "verified": true,
      "author": "Donna",
      "helpful_votes": 0,
      "publication_date": 20190218
    },
    {
      "title": "Not worth the price.  No positive effect.",
      "text": "Not worth the price of $84. No positive results derived from using the product.",
      "rating": 1.0,
      "verified": true,
      "author": "Starsnstripes",
      "helpful_votes": 0,
      "publication_date": 20191016
    },
    {
      "title": "Disappointed",
      "text": "I have very dry skin. This just sat on my skin and never soaked in....even after leaving on overnight. Very sticky. Makes me wonder if the other reviews are valid.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180221
    },
    {
      "title": "Several Drops of Product",
      "text": "This was a sample and when I opened it a few drops came out so I cannot really tell you anything about the product but I would not order again.",
      "rating": 2.0,
      "verified": true,
      "author": "Kari",
      "helpful_votes": 0,
      "publication_date": 20180527
    },
    {
      "title": "Great product",
      "text": "Love this product. Been using it for 4 years now and have my teens use it too. It's light on skin",
      "rating": 5.0,
      "verified": true,
      "author": "Sandy A",
      "helpful_votes": 0,
      "publication_date": 20201020
    },
    {
      "title": "I love this product",
      "text": "I love this product.. makes my derma pen glide ... I can use it with micro-needling or by itself it does a great job .",
      "rating": 5.0,
      "verified": true,
      "author": "C. Milu",
      "helpful_votes": 0,
      "publication_date": 20180502
    },
    {
      "title": "Very hydrating!",
      "text": "I like how just a few drops can hydrate your whole face and neck. I add moisturizer over it. Really like this product!",
      "rating": 5.0,
      "verified": true,
      "author": "georgianna",
      "helpful_votes": 0,
      "publication_date": 20190629
    },
    {
      "title": "Perfect for dry skin",
      "text": "This has been a game changer in my skin routine. Provides moisture to mature skin and over time Improvement appearance in the skin.",
      "rating": 5.0,
      "verified": true,
      "author": "Theresa ",
      "helpful_votes": 0,
      "publication_date": 20190919
    },
    {
      "title": "Amazing serum!",
      "text": "Love this serum! I found out about it from a YouTube video and ordered it shortly after. This keeps my skin super hydrated and fresh looking all day.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel Hogan",
      "helpful_votes": 0,
      "publication_date": 20180528
    },
    {
      "title": "Good absorption",
      "text": "This is a nice hyaluronic acid I strongly recommend it",
      "rating": 5.0,
      "verified": true,
      "author": "Lee and Tammy Guderian",
      "helpful_votes": 0,
      "publication_date": 20190420
    },
    {
      "title": "Five Stars",
      "text": "I have found this to be a wonderful product to help moisturize my skin.",
      "rating": 5.0,
      "verified": true,
      "author": "geek0130",
      "helpful_votes": 0,
      "publication_date": 20170909
    },
    {
      "title": "I've tried many products with minimal or no results. ...",
      "text": "I've tried many products with minimal or no results. This one is the real deal; smooths out the lines and makes my skin appear healthy !!",
      "rating": 5.0,
      "verified": true,
      "author": "melita",
      "helpful_votes": 0,
      "publication_date": 20180112
    },
    {
      "title": "Love it! Works as good as high priced",
      "text": "Love it ! Works as good as high priced products",
      "rating": 5.0,
      "verified": true,
      "author": "Ruth Ralls",
      "helpful_votes": 0,
      "publication_date": 20170930
    },
    {
      "title": "This product is very good. I LOVE REPLENIX",
      "text": "Thanks a lot .This product is very good. I LOVE REPLENIX",
      "rating": 5.0,
      "verified": true,
      "author": "eliza",
      "helpful_votes": 0,
      "publication_date": 20171115
    },
    {
      "title": "Great with Retin-A",
      "text": "Recommended by my dermatologist. Without this I couldn’t use Retin-A, it creates a barrier of hydration and saves my face from peeling.",
      "rating": 5.0,
      "verified": true,
      "author": "dk in marin",
      "helpful_votes": 0,
      "publication_date": 20171029
    },
    {
      "title": "Sample Size - Not Worth The Money",
      "text": "This product actually feels amazing but I can’t get over how small the sample size is and how much I paid for it. Face regiments take time to start working so to have paid for a one time, dime size amount (even though the directions say to apply twice in one day) is not only disappointing but to have the “complimentary sample not for resale” slapped on the front only adds insult to injury. :-(",
      "rating": 1.0,
      "verified": true,
      "author": "Mackenzie",
      "helpful_votes": 9,
      "publication_date": 20180329
    },
    {
      "title": "I would not recommend this to anyone",
      "text": "Hell no made my hair fall out in chunks. I would not recommend this to anyone.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180512
    },
    {
      "title": "Sample is Tiny",
      "text": "I purchased a sample of this product and thought I would be getting a small vial as a sample as shown in the photograph (Sephora, Ulta, and Nordstrom, etc. often sample in actual containers). Instead I received something that was the size of a ketchup packet, but was about 90% empty. Definitely not worth the $4 sample price. While I liked the product and found it to be effective, I don't think it works better than other hyaluronic acid serums that are 1/2-2/3 of the price of this one.",
      "rating": 2.0,
      "verified": false,
      "author": "candice lin",
      "helpful_votes": 4,
      "publication_date": 20180506
    },
    {
      "title": "love this stuff!!!",
      "text": "use this with Vitamin C and hyalauronic acid. this feels great and i'm amazed! love it!!",
      "rating": 5.0,
      "verified": false,
      "author": "Joann Dillon",
      "helpful_votes": 0,
      "publication_date": 20170731
    }
  ],
  "product_meta": {
    "title": "Replenix Pure Hydration Hyaluronic Acid Serum",
    "description": "Size:1 Ounce\n\nAs we age our natural levels of hyaluronic acid decrease, compromising our skin barrier and causing visible signs of aging. Replenix Pure Hydration hyaluronic acid serum addresses this with fractionated hyaluronic acid to ensure continuous and optimal skin hydration.\n\nResults from a 6-week patient assessment revealed:\n• 80% of patients agreed SKIN LOOKS FIRMER AND MORE FIRM\n• 90% of patients agreed SKIN TONE IS MORE EVEN\n• 100% of patients agreed SKIN FEELS HYDRATED AND SOFTER\n\nPure Hydration Hyaluronic Acid Serum quenches dehydrated skin to impart a supple, smooth complexion and instant correction. This Hyaluronic Acid moisturizer provides all-day moisture retention and visibly reduces the signs of aging with a nourishing blend of antioxidants and humectants.\n\nHYDRATE: Fractionated Hyaluronic acid penetrates the skin for maximum hydration and all-day moisture retention\nPLUMP: Powerful peptides and humectants combine to smooth and soften skin supporting healthy collagen\nREJUVENATE: A nourishing blend of antioxidants soothe skin and guard against free radicals \n\nBRAND STORY\nReplenix pharmaceutical-grade skin care products have been trusted by dermatologists for over 35 years. Green Tea, the most potent antioxidant known, soothes the skin helping patients of all skin types achieve maximum results.",
    "rating": 4.3,
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "3.75 x 1.25 x 1.25 inches; 3.21 Ounces",
      "Item model number": "896",
      "UPC": "358212896011",
      "Manufacturer": "Replenix",
      "ASIN": "B011MD169C",
      "Amazon Best Sellers Rank": "#57,335 in Beauty & Personal Care",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Skin Care",
      "Treatments & Masks",
      "Face",
      "Beauty & Personal Care",
      "Serums"
    ],
    "price": 84.58
  }
}