{
  "website_summaries": [
    {
      "verdict": "The vintage packaging and the quality components make this wet shaving kit a great gift idea. There can be a learning curve with wet shaving, but all of the items work well together.",
      "pros": [
        "Shaving soap bar produces good lather, doesn't have overpowering scent",
        "Safety razor well balanced in hand",
        "Attractive \"vintage\" packaging"
      ],
      "cons": [
        "Brush continually sheds bristles",
        "Changing blades can be difficult",
        "Individual items smaller than expected"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "... this as a present for Christmas and it looks great!",
      "text": "Got this as a present for Christmas and it looks great! Update: Boyfriend has been using this to shave his face and neck and he is blown away. He says it's his best shave ever. The block stops bleeding right away and he never gets razor bumps which use to be a big issue everytime he shaved with normal razors.",
      "rating": 5.0,
      "verified": true,
      "author": "Tabby",
      "helpful_votes": 13,
      "publication_date": 20171231
    },
    {
      "title": "My husband loved this set!",
      "text": "This was a gift for my husband and he absolutely loved it!",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa Savoie",
      "helpful_votes": 8,
      "publication_date": 20190107
    },
    {
      "title": "Amazing",
      "text": "Great kit. All the products are awesome and I love the packaging. Would and have repurchased products from this kit.",
      "rating": 5.0,
      "verified": true,
      "author": "sadie",
      "helpful_votes": 9,
      "publication_date": 20190104
    },
    {
      "title": "Best shaving kit on the market",
      "text": "I have been using five blades since I got into the military and wanted to change things up and making shaving comfortable. I made the switch to this kit from Gentlemen Jon and have loved it ever since. This is the best product I have used to date and the owners are very responsive and friendly. If there is any issue with your order contact them and they will fix any problem with the order immediately. Great product and I along with some of my friends will continue to use this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Spencer E Webb",
      "helpful_votes": 8,
      "publication_date": 20180102
    },
    {
      "title": "complete beginner's kit",
      "text": "This shaving kit is what you need if you want to get into wet shaving. The shaving soap is a little hard to use at first, but once you learn how to build up a good lather it's easy. The Astra razor blades are very sharp and hold up well even after a few shaves. The brush is pretty high quality and it's served me well for building up and applying the lather. If you want to get into wet shaving, buy this kit, watch some YouTube videos, and get started.",
      "rating": 5.0,
      "verified": true,
      "author": "Tyler Savage",
      "helpful_votes": 12,
      "publication_date": 20170710
    },
    {
      "title": "Valentine's gift",
      "text": "Bought this for my husband for Valentine's Day and he's thrilled with it. Great quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Lindsay",
      "helpful_votes": 6,
      "publication_date": 20190221
    },
    {
      "title": "Missing The Razor, Razor Blades, and the Soap",
      "text": "Absolutely appalled that for the price, the most important parts of the kit is missing. Not to mention that the box had minor damaging aswell. I for sure will not buy again and will be getting a refund ASAP.",
      "rating": 1.0,
      "verified": true,
      "author": "Hasami",
      "helpful_votes": 11,
      "publication_date": 20180908
    },
    {
      "title": "Love it!",
      "text": "It comes packaged nicely. Everything is snug and it's all rattling around the box. My husband had a beard for 5+ years, and after he used the clippers he used this to get a clean shave. It worked wonders! He usually has really bad razor burn no matter what kind of razor he uses. This left him clean and bump free! The aftershave helped a lot! I also like that it doesn't have a really strong smell, but still smells really nice.",
      "rating": 5.0,
      "verified": true,
      "author": "Lexi Vaughan",
      "helpful_votes": 7,
      "publication_date": 20170430
    },
    {
      "title": "Solid build and design. Product doesn't wear out or ...",
      "text": "Solid build and design. Product doesn't wear out or break down. Razors last just as long as gillette or any other. Replacements are cheaper. My face did have to adjust to a new kind of razor and I had to change the way I shaved. I prefer this product over any other razor now.",
      "rating": 5.0,
      "verified": true,
      "author": "Adan",
      "helpful_votes": 7,
      "publication_date": 20180305
    },
    {
      "title": "A big no :(",
      "text": "I gave this to my fiancee as a fathers day gift , he used this one time n broke. So embarrassed to give something and it breaking the first use. I never write reviews but this is not all steel its like plastic inside",
      "rating": 1.0,
      "verified": true,
      "author": "Truereviwz",
      "helpful_votes": 5,
      "publication_date": 20190620
    },
    {
      "title": "purest form of shaving.",
      "text": "You can use a 5 blade disposable razor all you want. You are not a man until you have shaved with this.",
      "rating": 5.0,
      "verified": true,
      "author": "Misty J",
      "helpful_votes": 7,
      "publication_date": 20180127
    },
    {
      "title": "The first time he used it he was really nervous and got a pretty deep cut and he didn't understand the lather",
      "text": "I bought this as a gift for my boyfriend and he only used those cheap razors to shave. The first time he used it he was really nervous and got a pretty deep cut and he didn't understand the lather, but now he uses it with so much ease and his skin is so much smoother and he has less bumps. I love the way it smells too! This is definitely really good for beginners :)",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 7,
      "publication_date": 20171019
    },
    {
      "title": "Perfect gift",
      "text": "Purchased this for gift for my husband. He had never used razor like this before. He absolutely loves shaving with it. Overall super satisfied with this.",
      "rating": 5.0,
      "verified": true,
      "author": "Helen VanDusen",
      "helpful_votes": 9,
      "publication_date": 20181124
    },
    {
      "title": "Don't forget the used blade container and extra blades",
      "text": "Fantastic starter set! The soap dish is a little small without a handle but works well enough; I'd reccomend a sturdy old mug instead.",
      "rating": 5.0,
      "verified": true,
      "author": "Terry",
      "helpful_votes": 5,
      "publication_date": 20190509
    },
    {
      "title": "My husband enjoyed this product",
      "text": "My husband enjoyed this product. I sent the first one back because the box was very badly damaged, but the contents were fine. The cardboard box was part of the appeal, so I had to get one that looked nicer.",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs. P",
      "helpful_votes": 6,
      "publication_date": 20171218
    },
    {
      "title": "Great gift!",
      "text": "Bought as a gift for my husband, he had never used a straight razor before, and now he won't use any other kind! Great starter kit! Plus he loved the lather!",
      "rating": 5.0,
      "verified": true,
      "author": "Brandi Campbell",
      "helpful_votes": 6,
      "publication_date": 20181103
    },
    {
      "title": "Great beginner's kit",
      "text": "A great beginner's kit. It has all you need to start. I would have wished that it included some sort of holder for the lather bar. Also, the salt block is supposed to sting a bit. You don't have to use it. I would recommend getting yourself extra razors soon because you get only 5 double sided ones. That's about 20 shaves worth.",
      "rating": 4.0,
      "verified": true,
      "author": "Dan Vatnik",
      "helpful_votes": 3,
      "publication_date": 20180810
    },
    {
      "title": "Great product",
      "text": "Bought this for my husband for Christmas and he loves it!",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel Jones",
      "helpful_votes": 5,
      "publication_date": 20190224
    },
    {
      "title": "Brush sucks, doesn’t lather",
      "text": "The brush keeps losing hairs all over the place, it’s rough and feels of bad quality, the soap bar it came with doesn’t lather up well and does not create a cream",
      "rating": 1.0,
      "verified": true,
      "author": "Patricia Correia",
      "helpful_votes": 5,
      "publication_date": 20181127
    },
    {
      "title": "Five Stars",
      "text": "Never had a better shave. I shave every 3 days and look forward to it",
      "rating": 5.0,
      "verified": true,
      "author": "Port City Warehouse",
      "helpful_votes": 7,
      "publication_date": 20171103
    },
    {
      "title": "Beginner set give it a go.",
      "text": "I am truly impressed. I don’t shave. Shave when dead. I like to keep my lines clean tho. I have got many strait razor shaves, and I have to say I will be saving money. I will have to get use to it tho. I do wish the soap got a little thicker. Over all I was happy. I do wish I had some kinda stand with it, for the price I under stand tho. When I become better at it I will upgrade, but for me to just buy something on a whim. I would do it again.",
      "rating": 4.0,
      "verified": true,
      "author": "thecokeinhour",
      "helpful_votes": 2,
      "publication_date": 20190220
    },
    {
      "title": "Five Stars",
      "text": "My husband really loves this kit. He ended up buying one for his brother.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer Brown",
      "helpful_votes": 6,
      "publication_date": 20171228
    },
    {
      "title": "Everything you need for shaving",
      "text": "Great product, very reasonable price. Was a perfect Christmas gift for my son.",
      "rating": 5.0,
      "verified": true,
      "author": "Gods Girl",
      "helpful_votes": 5,
      "publication_date": 20190108
    },
    {
      "title": "Very good quality 1st time using a single edge razor but ...",
      "text": "Very good quality 1st time using a single edge razor but with the good shaving kit such as this it was as hoped for.",
      "rating": 5.0,
      "verified": true,
      "author": "Barry E.",
      "helpful_votes": 9,
      "publication_date": 20160821
    },
    {
      "title": "Fastest shipping to ever ship!",
      "text": "Fast shipping! It came early morning before Christmas! It's amazing! The manliest way the shave!",
      "rating": 5.0,
      "verified": true,
      "author": "Gary",
      "helpful_votes": 5,
      "publication_date": 20181222
    },
    {
      "title": "Best shave of my life!",
      "text": "I've used electric and cartridge razors my entire life, but not anymore! I have sensitive skin, so I used to have tons of problems with razor burn and ingrown hairs. I started researching and I heard that a safety razor completely eliminates those problems. Everyone said it's great, so I figured \"I have to try it out\". Short and simple; throw out your cartridge razors and buy this. The razor is hefty and high quality steel. It doesn't feel like those cheap cartridge razors covered in plastic, it's the real deal! The shave lather smells great and feels good on the face. The actual quality of the shave is phenomenal. I highly highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Jon M.",
      "helpful_votes": 0,
      "publication_date": 20190901
    },
    {
      "title": "Five Stars",
      "text": "Got it as a gift for my husband, he loves it!",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs. Angelina Olimpiyuk ",
      "helpful_votes": 5,
      "publication_date": 20180104
    },
    {
      "title": "Love it",
      "text": "My hubby loves this shaving kit. I will be buying it regularly.",
      "rating": 5.0,
      "verified": true,
      "author": "Dana",
      "helpful_votes": 5,
      "publication_date": 20170728
    },
    {
      "title": "He has sensitive skin and it works great for him",
      "text": "I bought this for my husband who use to use an electric shaver. He loves this set!!!! He has sensitive skin and it works great for him.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 7,
      "publication_date": 20170110
    },
    {
      "title": "No complaints",
      "text": "Bought this for my husband as a gift and he loves it . No complaints !",
      "rating": 5.0,
      "verified": true,
      "author": "Belissa",
      "helpful_votes": 3,
      "publication_date": 20190712
    },
    {
      "title": "Great for the miney",
      "text": "Quality kit. The bowl is sort of cheap feeling but it works. The razor is nice. Good feel. Works well. The soap and alum are nice and go well together. Sandalwood isn't my favorite scent but it's nice. Comes with a 5 pack of Astra Sp. very nice blades. The brush is very stiff and fairly course. I had no problem getting good lather with the combo but the brush really isn't that comfortable. I will probably be upgrading my brush soon. This has given me the smoothest shave I can remember. I am not wasting any more money on cartridges.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170715
    },
    {
      "title": "Marketing > Quality",
      "text": "Overall disappointed with this product. It's packaged attractively and makes you think you're being presented a quality product. The razor is a screw on/off head that threatens to tumble off when you're resetting the blade; not the claw style screw to open. The bowl is way too small. The brush is middling in quality. The alum block is nice and effective; I actually like that product by itself. Avoid this kit, by what it presents seperately and make your own.",
      "rating": 2.0,
      "verified": true,
      "author": "Crito",
      "helpful_votes": 0,
      "publication_date": 20200603
    },
    {
      "title": "Gift for a first time shaver. Not much in quality",
      "text": "Everything in the box was nice except for the brush. The handle took a beating from the water and the brush part fell out of the handle. I silicone glued it back and it works fine. Brush hair is plastic so quality is cheap.",
      "rating": 3.0,
      "verified": true,
      "author": "Ciprian",
      "helpful_votes": 0,
      "publication_date": 20190909
    },
    {
      "title": "Great product at reasonable price. Bye bye expensive Gillette blades!",
      "text": "Never used a straight razor before, but after a few tries with this product I will never go back to the expensive Gillette razors I’ve been using for the past 20 years. Product was packaged well and included detailed instructions on how to use every component. Everything seems well-made and razor has a quality weight to it. Shave is as good as what you can get in a barbershop. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200206
    },
    {
      "title": "The perfect gift for the man born in the wrong era!",
      "text": "My husband loves it! And I love the close shave he gets. So much better than any disposable on the market! Definitely an awesome gift for a guy who likes retro!!! Can't get any classier than that!",
      "rating": 5.0,
      "verified": true,
      "author": "jessica",
      "helpful_votes": 6,
      "publication_date": 20170102
    },
    {
      "title": "Not good for Sensitive Skin",
      "text": "I bought this kit to move away from cartridge razors. The problem is that I have sensitive skin. The shave soap and the alum caused major irritation. Which kind of made some of the kit pointless. For those without sensitive skin, this is a great buy. I love the razor, brush, bowl and the blade combination.",
      "rating": 4.0,
      "verified": true,
      "author": "jremydeaton",
      "helpful_votes": 0,
      "publication_date": 20190728
    },
    {
      "title": "An Excellent Introduction to Wet Shaving!",
      "text": "After years of mutilating my face with “fancy” multi-blade cartridge subscriptions I was fed up- I wanted to take shaving to the next level. With this shaving kit a mundane task has become an experience in pampering. This neat kit has everything you need to see if a safety razor is for you. The lathering process is easy and fun with the soap, bowl and brush. The razor is easy to use and to fine-tune your technique. In sum I would highly recommend you give this set a try.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric B",
      "helpful_votes": 0,
      "publication_date": 20200704
    },
    {
      "title": "Perfect Gift",
      "text": "I sent this to my dad for his birthday. He really loved it. It reminded him of his dad shaving when he was just a boy.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200223
    },
    {
      "title": "Worth the price",
      "text": "This gift was everything I wanted it to be and more! The receiver now uses this frequently and never wants to go back to regular shaving. Great for beginner or novice AND high quality soaps.",
      "rating": 5.0,
      "verified": true,
      "author": "Koobs",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "Good set up...damage package",
      "text": "I got this for my boyfriend as a birthday gift and he was very excited!! Still figuring out how to get the clean cut but he is picking it up! This kit doesn’t come with a dish so you may want to pick one up. The package that it came in was ripped in several places as if somebody had opened it and then returned it. This made it a little embarrassing to give as a gift.",
      "rating": 3.0,
      "verified": true,
      "author": "lknapp12",
      "helpful_votes": 0,
      "publication_date": 20190823
    },
    {
      "title": "Did not come with astro blades as advertiesed!!!",
      "text": "Looks nice, however it didn't come with the astro blades as advertised now I have to buy them seperatetly to give as a gift. Lucky I looked in the box before giving as a christmas gift, would have been very embaressing.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20171219
    },
    {
      "title": "Fantastic introduction to wet shaving",
      "text": "Fantastic introduction to wet shaving. If you've never tried wet shaving before, this kit has nearly everything you need to get started. The razor is very easy to manipulate on the face if you're used to the cartridge razor. Good, expensive feel. Could be a gift: I'm considering buying for my brother as an intro to wet shaving. Brush is soft. Shaving cream puck smells great. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "silly",
      "helpful_votes": 9,
      "publication_date": 20160304
    },
    {
      "title": "Would Skip on this",
      "text": "The brush sheds nonstop and overall it feels like like a demo rather than a kit. The Alum bar is great. You can purchase it separately.",
      "rating": 3.0,
      "verified": true,
      "author": "Duy Huy Le",
      "helpful_votes": 0,
      "publication_date": 20190325
    },
    {
      "title": "Ladies buy this for your man 😍",
      "text": "So fun to watch my husband use this. It's kinda sexy not gonna lie. Good quality and very nicely packaged.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah Greenhaw",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "Awesome",
      "text": "Razors are sharp and has a great feel. Solid weight to all the items.",
      "rating": 5.0,
      "verified": true,
      "author": "Nychelle Rodriguez ",
      "helpful_votes": 0,
      "publication_date": 20200214
    },
    {
      "title": "Good Gift Idea",
      "text": "Im a researcher by nature and by profession so I look for the best quality for money spent. Good gift idea.",
      "rating": 4.0,
      "verified": true,
      "author": "MA",
      "helpful_votes": 0,
      "publication_date": 20191207
    },
    {
      "title": "Doesn’t hurt when it used!",
      "text": "I got impressed of how amazing and accurate does its job!It leaves my face clean and smooth as baby’s skin! Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Sergiu Racila",
      "helpful_votes": 0,
      "publication_date": 20180930
    },
    {
      "title": "Nice package.",
      "text": "I got this for my 16-year-old for Christmas. He has been very very happy with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Nurse Eri",
      "helpful_votes": 0,
      "publication_date": 20200908
    },
    {
      "title": "Good stuff.",
      "text": "Christmas present for my nephew who now has a beard. Damn millennials!",
      "rating": 5.0,
      "verified": true,
      "author": "JA",
      "helpful_votes": 0,
      "publication_date": 20190806
    },
    {
      "title": "My boyfriend loves it!",
      "text": "Bought this shave kit for my boyfriend, he loves it! It was the perfect gift - he wanted a shave set and it was confusing to figure out what to buy, but everything he wanted is in this kit. Just purchased 2 more for my brother & dad!",
      "rating": 5.0,
      "verified": true,
      "author": "MRC",
      "helpful_votes": 8,
      "publication_date": 20150810
    },
    {
      "title": "Disappointed.",
      "text": "This did not come with blades as advertised, which I'm seeing other customers say happened to them as well. The box was damaged also, which isn't too big of a deal, but I paid for a six piece set and this arrived with only five. Disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20180427
    },
    {
      "title": "Great gift",
      "text": "Made for a great Father's Day gift. He really enjoyed it",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica Kilroy",
      "helpful_votes": 6,
      "publication_date": 20160627
    },
    {
      "title": "Beautiful gift for a man",
      "text": "My husband absolutely loved this kit. It comes with everything that you need inside to get started.",
      "rating": 5.0,
      "verified": true,
      "author": "ASHLEY",
      "helpful_votes": 0,
      "publication_date": 20191108
    },
    {
      "title": "Very nice starter kit with a very cool looking razor",
      "text": "Very nice starter kit with a very cool looking razor. I like the charcoal steel look of the razor. It also comes with everything you need to get going and will last you quite a few shaves before you will ever have to find replacement soaps, blades, etc.",
      "rating": 5.0,
      "verified": true,
      "author": "jake",
      "helpful_votes": 8,
      "publication_date": 20160902
    },
    {
      "title": "Great starter kit",
      "text": "Everything you need in one package to begin your shaving experience",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200807
    },
    {
      "title": "its a gift.",
      "text": "do you really want to put more thought into it? no? then DONE!",
      "rating": 4.0,
      "verified": true,
      "author": "Jmz007",
      "helpful_votes": 0,
      "publication_date": 20200916
    },
    {
      "title": "Very nice",
      "text": "This was given to my husband as a gift. It came packaged well and he loves it. He said he will never use a generic razor again. Very nice kit.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170607
    },
    {
      "title": "Awesome",
      "text": "Wish I knew about wet shaving earlier. This is my first kit and I love it. The brush is extremely comfortable and the soap was easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Montanan",
      "helpful_votes": 3,
      "publication_date": 20170516
    },
    {
      "title": "Great for a Beginner",
      "text": "I really like this kit. The razor and brush are well made. The soap leathers very well. I wish the bowl was heavier though. If you try to set the bowl with lather and the brush in a sink of hot water, it will tip over and ruin your lather. The bowl is too buoyant.",
      "rating": 4.0,
      "verified": true,
      "author": "Donnie",
      "helpful_votes": 0,
      "publication_date": 20170822
    },
    {
      "title": "box smashed up",
      "text": "I bought this for my husband for Valentine's Day. He had been wanting a shaving kit for a while. It is a nice kit. However, when the box arrived the box was smashed. It was disappointing since it was a gift.",
      "rating": 3.0,
      "verified": true,
      "author": "Joshua Corley",
      "helpful_votes": 0,
      "publication_date": 20180619
    },
    {
      "title": "Not happy with the quality of the product - very irritating to my skin",
      "text": "Very irritating to my skin. I did not like this product",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190701
    },
    {
      "title": "A gift for my boyfriend",
      "text": "This is a gift I didn't give to my boyfriend, I want to give this gift to him early, he will like it very much, the brush is soft, the design is good, recommend this set of razor",
      "rating": 5.0,
      "verified": true,
      "author": "Jenn coles",
      "helpful_votes": 0,
      "publication_date": 20200604
    },
    {
      "title": "GREAT PRODUCT!!!",
      "text": "Absolutely loved this shaving kit great quality. Only thing is I wish the bowl was slightly larger, other than that completely happy with the shaving kit.",
      "rating": 5.0,
      "verified": true,
      "author": "Charles Bowden",
      "helpful_votes": 0,
      "publication_date": 20200202
    },
    {
      "title": "Gentleman Jack product look elsewhere",
      "text": "This thing cut my face up, terrible product. Now I just use Gillette skin guard works perfect",
      "rating": 1.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20200907
    },
    {
      "title": "Four Stars",
      "text": "Nice set but I wish it came in a nicer box.",
      "rating": 4.0,
      "verified": true,
      "author": "Lady Di",
      "helpful_votes": 0,
      "publication_date": 20170514
    },
    {
      "title": "Awesome product and fast shipping!",
      "text": "Got it for husband as a Valentine's gut and he loves it!!! Item is as described.",
      "rating": 5.0,
      "verified": true,
      "author": "emilygatlin74",
      "helpful_votes": 0,
      "publication_date": 20200217
    },
    {
      "title": "product shipped missing items",
      "text": "i got the product on time but it was missing a key item for a nice shave the shaving soap not a great experience for the first time buying",
      "rating": 2.0,
      "verified": true,
      "author": "alexios",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Great men’s gift",
      "text": "This was a gift , great product came in it’s own box, very sturdy and very nice presentation once opened.",
      "rating": 5.0,
      "verified": true,
      "author": "Omar ",
      "helpful_votes": 0,
      "publication_date": 20190825
    },
    {
      "title": "Wow",
      "text": "Got it last night. Best shave of my life! I am 43 No Cap!",
      "rating": 5.0,
      "verified": true,
      "author": "Jason C West",
      "helpful_votes": 0,
      "publication_date": 20200514
    },
    {
      "title": "... a requirement regular razors I was getting bumps and poor results using these products it's been amazing took a ...",
      "text": "I'm in the military overseas and shaving everyday is a requirement regular razors I was getting bumps and poor results using these products it's been amazing took a little time getting use too but it was my first saftey razor but great product",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 9,
      "publication_date": 20161106
    },
    {
      "title": "Great gift !",
      "text": "My bf loved it! Everything came perfectly just the note was bent but that’s it!",
      "rating": 5.0,
      "verified": true,
      "author": "Julianna Jaquez",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "My husband absolutely loved it and the quality of it all is great ...",
      "text": "My husband absolutely loved it and the quality of it all is great 👍🏻",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170626
    },
    {
      "title": "Perfect starter kit to break away from those multi-blade overrated ...",
      "text": "Perfect starter kit to break away from those multi-blade overrated razors. This kit has it all for half the prize. Keep it up Gent Jon!!",
      "rating": 5.0,
      "verified": true,
      "author": "M",
      "helpful_votes": 4,
      "publication_date": 20150815
    },
    {
      "title": "Four Stars",
      "text": "Good quality, easy to use. Only complaint is that the cardboard box it came in didn't ship well.",
      "rating": 4.0,
      "verified": true,
      "author": "Allison Kessler",
      "helpful_votes": 0,
      "publication_date": 20161214
    },
    {
      "title": "Five Stars",
      "text": "I bought it for me, but my dad stole it from me! He loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "Britton Sprouse",
      "helpful_votes": 2,
      "publication_date": 20161220
    },
    {
      "title": "WORST SHAVE I HAVE EVER HAD",
      "text": "This was the WORST SHAVE I have ever had! I tried for 3 days to use this product and each day was more and more terrible. The razor ripped me open, left me a bloody mess, and irritated my skin. “Shave like your Grandpa did”, well forget that! There are reasons razors made technological advances, so my FACE DOES NOT FEEL LIKE I LOST A FIGHT WITH MY LAWN MOWER!!! Worst product I ever bought on amazon, literally threw everything in the garbage. Don’t waste your money, trust me.",
      "rating": 1.0,
      "verified": true,
      "author": "Adam",
      "helpful_votes": 2,
      "publication_date": 20180801
    },
    {
      "title": "Be a gentleman wont you? Buy this kit.",
      "text": "My husband loves this kit! And the shave soap smells so freaking good. Woodsy, masculine, sandalwood, mouthwatering really. Men, if you want your wife or significant other to caress your face or head because of how smooth it is and then suggest coitus, then I reccomend this kit!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180526
    },
    {
      "title": "Happy",
      "text": "My boyfriend really likes it, I got it as a gift for him. The razor and brush come in the box but in their own box. Everything was great, he cut himself a few times though ( takes practice) he got a much smoother shave.",
      "rating": 5.0,
      "verified": true,
      "author": "chelsea s.",
      "helpful_votes": 4,
      "publication_date": 20160609
    },
    {
      "title": "Very pleased",
      "text": "Arrived early, packaged nicely, and is exactly what I was looking for. Compared to all of the other kits on here, it's like half of the price. A small warning though...if you have never used this kind of razor before, do your homework. One swipe, and it cleared a week's worth of growth, but cannot be handled like any of those mainstream razors. The soap works great, and has a nice light scent to it, the brush seems very high quality as well. If you want to try wet shaving, or to get a gentleman something they will love, and not break the bank, buy this kit. You won't regret it.",
      "rating": 5.0,
      "verified": true,
      "author": "gary reed",
      "helpful_votes": 18,
      "publication_date": 20151012
    },
    {
      "title": "Very good value for a complete shaving kit!",
      "text": "Very complete kit; arrived just as pictured. The soap cup is just the right size for convenient storage, and heavy enough to maintain warmth during shaving. Brush seems to be high quality too. Everything you need for a comfortable shave, and at an affordable price.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Brian",
      "helpful_votes": 5,
      "publication_date": 20151226
    },
    {
      "title": "Great shave all over",
      "text": "I am female and shave my body all over. Peach fuzz, side burns, underarms, legs, bikini, etc. This kit works very well and reduced my razor burn substantially. I have yet to cut my self with it, and the shave lasts for longer than normal 3 blade razors.",
      "rating": 5.0,
      "verified": true,
      "author": "G. Baker",
      "helpful_votes": 2,
      "publication_date": 20180714
    },
    {
      "title": "Cool product",
      "text": "Super nice and easy to clean and assemble if it ever gets lose all in all good product for a good price.",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20161210
    },
    {
      "title": "Great Product",
      "text": "This was my first step into wet shaving and buying this kit provided me with everything I needed and then some. From the safety razor itself to the alum block, all the products are quality made and you can tell its the real deal lol.",
      "rating": 5.0,
      "verified": true,
      "author": "Ron Lilly",
      "helpful_votes": 3,
      "publication_date": 20150829
    },
    {
      "title": "I need my money back I don't recommend this product",
      "text": "Missing parts!!!!! I need my money back I don't recommend this product.",
      "rating": 1.0,
      "verified": true,
      "author": "Bibi",
      "helpful_votes": 4,
      "publication_date": 20171219
    },
    {
      "title": "... a gift for my brother and he thinks it's great. Loves the razor and that it comes with ...",
      "text": "Bought as a gift for my brother and he thinks it's great. Loves the razor and that it comes with additional blades.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 2,
      "publication_date": 20171228
    },
    {
      "title": "Five Stars",
      "text": "I feel like a gentleman shaving with this. Would highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Juan",
      "helpful_votes": 3,
      "publication_date": 20160923
    },
    {
      "title": "Bought this for my husband and that made me the ...",
      "text": "Bought this for my husband and that made me the coolest wife in town, he has been trimming and shaving his beard with it and doesn't have had the need to go to the barber which he loves 'cuz he has no time.",
      "rating": 5.0,
      "verified": true,
      "author": "Naty",
      "helpful_votes": 0,
      "publication_date": 20180417
    },
    {
      "title": "Love it!",
      "text": "The kit is great. Love the color of the safety razor, probably my favorite part of the whole kit.",
      "rating": 5.0,
      "verified": true,
      "author": "Luis Lujan",
      "helpful_votes": 4,
      "publication_date": 20161103
    },
    {
      "title": "Everything is made very well and looks even better. I was new to high end shaving and ...",
      "text": "This kit is phenomenal. Everything is made very well and looks even better. I was new to high end shaving and this kit made me enjoy having to shave everyday. I will be a loyal customer and the company even contacted me after the kit arrived asking if everything was as it should be and if it wasn't they would fix it.",
      "rating": 5.0,
      "verified": true,
      "author": "kevin boyle",
      "helpful_votes": 4,
      "publication_date": 20150913
    },
    {
      "title": "MISSING PIECES",
      "text": "I was really excited to give this away for Christmas, and I still am I don’t exactly have time to send back or reorder. But it was missing the razors so there is no razor in the razor. I am so very upset with this.",
      "rating": 1.0,
      "verified": true,
      "author": "Kristin",
      "helpful_votes": 4,
      "publication_date": 20171223
    },
    {
      "title": "Great kit for the money",
      "text": "I was due for more alum when I realized this company now had a wet shave kit. Had been looking for a replacement to my expensive Mach3 blades for awhile, so I figured I give this a shot - and was pleasantly surprised. Everything was of good quality and didn't break the bank like other kits I had looked at.",
      "rating": 5.0,
      "verified": true,
      "author": "dsuliga",
      "helpful_votes": 4,
      "publication_date": 20150807
    },
    {
      "title": "I did good",
      "text": "This was a Father’s Day gift. Arrived as expected. Very nicely packaged. I was a little worried because the brush felt very course. But the hubby loved it. He said it’s a “man brush” so I guess it works.",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley",
      "helpful_votes": 0,
      "publication_date": 20180619
    },
    {
      "title": "Exactly what i was hoping it would be - the ...",
      "text": "Exactly what i was hoping it would be - the razor is heavy and everything in the kit is high quality. Bought it because its everything you need for classic shaving in one box and is much cheaper than all the other kits i saw. Very impressed",
      "rating": 5.0,
      "verified": true,
      "author": "Eliza Herbst",
      "helpful_votes": 5,
      "publication_date": 20150729
    },
    {
      "title": "and he loved it. It's a bit pricey",
      "text": "I bought this for my (new) stepdad as a birthday gift, and he loved it. It's a bit pricey, imo, but to see the look of joy on his face was worth every penny.",
      "rating": 5.0,
      "verified": true,
      "author": "Sheena",
      "helpful_votes": 0,
      "publication_date": 20180526
    },
    {
      "title": "All the stuff is made in China. The blades ...",
      "text": "All the stuff is made in China. The blades are ultra sharp. This kit is a joke. I have more skin scars from this than any other blade. Defi returning the product.",
      "rating": 1.0,
      "verified": true,
      "author": "Gurdev K Padda",
      "helpful_votes": 2,
      "publication_date": 20180310
    },
    {
      "title": "Beat up....",
      "text": "While the set itself looks great and I'm sure my boyfriend will love it, I'm really disappointed in the shipping. This cool little box was sent in one of those crappy yellow bubblewrap mailers. It was only coming from Lexington, KY to Ashland, KY... like 2 hours away, and yet the box is thrashed. This is a birthday gift so now I have to decide whether or not to try and re-package it in something else. For such nice set, it should be shipped in a box, not an envelope.",
      "rating": 4.0,
      "verified": true,
      "author": "Kari",
      "helpful_votes": 8,
      "publication_date": 20161201
    },
    {
      "title": "Missing blades, but kit looks nice",
      "text": "Looks nice and I want to use it, but the advertised blades did not come packaged in my order.",
      "rating": 4.0,
      "verified": true,
      "author": "Kevin",
      "helpful_votes": 4,
      "publication_date": 20180112
    },
    {
      "title": "bought this as a gift to get my dad started ...",
      "text": "bought this as a gift to get my dad started with high end shaving. he loves it and the quality of everything in the kit is on par with my own rotation that I paid much more for.",
      "rating": 5.0,
      "verified": true,
      "author": "swrader",
      "helpful_votes": 5,
      "publication_date": 20150802
    },
    {
      "title": "Well done!",
      "text": "Great introduction to wet shaving. Highly recommended, great value! Included Astra blades are high quality. Very pleased with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Casey Williams",
      "helpful_votes": 0,
      "publication_date": 20180802
    },
    {
      "title": "Perfectly balanced kit - everything you need to shave",
      "text": "Loved the Complete Shave Kit from Gentleman John. It's the perfect balance of giving everything you need to shave, without going overboard on the unnecessary fluff. My brother loved it as a birthday gift, and got him interested in the art of shaving as a hobby. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric C. COhn",
      "helpful_votes": 0,
      "publication_date": 20180502
    }
  ],
  "product_meta": {
    "title": "Gentleman Jon Complete Wet Shave Kit | Includes 6 Items: One Safety Razor, One Badger Hair Brush, One Alum Block, One Shave Soap, One Stainless Steel Bowl and Five Razor Blades",
    "rating": 4.5,
    "feature_bullets": [
      "THE ORIGINAL SHAVE KIT, DON'T FALL FOR CHEAP IMITATIONS! | Get everything you need to start shaving correctly, in one spot, of the highest quality, for one price.",
      "Upgrade Your Shave | Shaving is a ritual, not a chore and it's time to grow up. Toss the cheap cartridge razors & aerosol foams and upgrade to Gentleman Jon shaving products to see what it feels like to shave like a man.",
      "Slow down and see what you're missing, and quality goes a long way. Each of our products have been curated to deliver the finest shave at prices that will not break the bank. On top of this, quality shave products last much longer as than what you are used to. The days of 2 use shave cartridges and foams that only last for a month are over. Welcome to Gentleman Jon.",
      "This kit includes 6 carefully curated items to deliver the full experience, right from the start",
      "+ (1) Safety Razor + (1) Badger Hair Brush + (1) Alum Block + (1) Stainless Steel Shave Bowl + (1) Shave Soap + (5) Astra Razor Blades"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "11.15 x 5.15 x 2.6 inches; 14.89 Ounces",
      "Date First Available": "July 20, 2015",
      "Manufacturer": "Gentleman Jon",
      "ASIN": "B01221V6QG",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Men's",
      "Shave & Hair Removal",
      "Shaving & Grooming Sets",
      "Beauty & Personal Care",
      "Health, Household & Baby Care"
    ],
    "price": 49.5
  }
}