{
  "website_summaries": [
    {
      "verdict": "This is a durable boys' snow boot at a decent price.",
      "pros": [
        "Not too heavy, but solid",
        "Design comes in several colors on the upper",
        "Soft on the inside but firm on the outside",
        "A good boot",
        "Thick lining",
        "Zip up the side",
        "Kids can put them on and take them off themselves",
        "Good treads",
        "Feet stay dry"
      ],
      "cons": [
        "These run a little small",
        "company suggests ordering a half size up",
        "Warm, but not the warmest on the market"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Good Quality",
      "text": "We have seven kids, five are boys, and we live practically in the north pole. We have to have good quality snow gear but I'm not willing to spend an arm and a leg, just an arm. These are good quality boots and have held up this winter so far. They are warm, tough, and the kids love them. It was 0 degrees yesterday and they were outside sledding for four hours. They never complained about cold toes once.",
      "rating": 5.0,
      "verified": true,
      "author": "Laura",
      "helpful_votes": 55,
      "publication_date": 20190108
    },
    {
      "title": "these were a good purchase for the price",
      "text": "Our son with Sensory Processing loves these boots! I feel this is necessary to point out because finding shoes that he likes the look of and the feel of can sometimes be a difficult task. They are firm, durable boots but very soft on the inside. He will wear them around the house just because if we let him. As a parent, these were a good purchase for the price. The quality is top notch and I know that I will be able to hand them down to my other boys when he outgrows them! Definitely would buy again!",
      "rating": 4.0,
      "verified": true,
      "author": "Daeden",
      "helpful_votes": 71,
      "publication_date": 20160103
    },
    {
      "title": "Great snow boots!",
      "text": "My 10 year old wore these boots a few times during a big snowstorm to play in the snow - said his feet stayed dry and toasty. Also wore them to school during a 20 min walk and was able to do the walk comfortably - again, his feet remained dry. Perfect snow boots and they look a little more fashionable than typical snow boots in this price range, especially in the blue.",
      "rating": 5.0,
      "verified": true,
      "author": "brooklyn mommy",
      "helpful_votes": 32,
      "publication_date": 20160201
    },
    {
      "title": "Cute, but incredibly small",
      "text": "I first bought a size 13...too small and the box came destroyed. So I ordered a size up to size 1 and these looked small, but came in a better brand new box. I am having to return this pair as well. The size 1 looked almost smaller than the 13s. They are SUPER cute and the inside felt nice, but really really small. So sad...so I would suggest ordering 2 sizes up. I think they each came from different sellers so this might have been part of there reason.",
      "rating": 4.0,
      "verified": true,
      "author": "LcharapichTop Contributor: Nail Polish",
      "helpful_votes": 7,
      "publication_date": 20191012
    },
    {
      "title": "Five Stars",
      "text": "Really good boots for a great price. Happy with my purchase",
      "rating": 5.0,
      "verified": true,
      "author": "pamela richmond",
      "helpful_votes": 43,
      "publication_date": 20160118
    },
    {
      "title": "Nice boot for winter",
      "text": "These are really cute but they ran way too large. Wish I hadn't read the reviews to buy them bigger because that wasn't the case at all. I bought them for my 2 year old and they fit my 5 year old.",
      "rating": 4.0,
      "verified": true,
      "author": "Mrs.S",
      "helpful_votes": 15,
      "publication_date": 20161128
    },
    {
      "title": "Comfy but not super durable...",
      "text": "The tab that holds the elastic lace broke about 5 minutes into sledding. Exchanges are impossible with this company. I had to buy a new pair first and then send the broken ones back to get a refund. I also lost the lightening deal and had to pay full price which aggravates me. Besides all that, my girls love them. They are super comfy. They say they are even more comfy then their Uggs. They are very warm and they love them. Which is the only reason I went through all the junk to get a new pair.",
      "rating": 4.0,
      "verified": true,
      "author": "BJS",
      "helpful_votes": 6,
      "publication_date": 20171216
    },
    {
      "title": "Not waterproof",
      "text": "My daughter's feet were soaked within minutes of wearing these during the first light snowfall of the season and the boots take an incredibly long time to dry out. Unfortunately, I missed the return window by just a few days. Hopefully, I can save another kid from cold, wet feet this winter season. Otherwise, they are cute and appear well made but just not going to serve us well with the hefty snowfalls we get.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 7,
      "publication_date": 20181114
    },
    {
      "title": "Buying second year in a row!",
      "text": "I bought these last year and again this year! My 5yr old loves them! The fur has a pink tint to them and they’re super warm and waterproof! She’s able to get them on and off by herself which is a bonus! These don’t compare to the kind you get at Target; they’re legit!",
      "rating": 5.0,
      "verified": true,
      "author": "Nina Z.",
      "helpful_votes": 4,
      "publication_date": 20191023
    },
    {
      "title": "Kid approved - not MICHIGAN winter approved",
      "text": "My 6 year old daughter wears size 13 shoes so i bought size 13 boots. Fits her perfect. Inside the entire boot is lined with very soft faux fur. She told me they werent heavy and clunky and very comfortable. She went sledding for 2 1/2 hours and they kept her feet warm. I felt the inside bottom liner a day later and they were still wet (not sweat, wet). To be fair, MICHIGAN winters are very very wet and its almost impossible to keep their feet dry unless they wear wading fishing gear. But over all im happy with our purchase. She mostly needs these boots for when she goes to school not hours of playing in slush.",
      "rating": 5.0,
      "verified": true,
      "author": "Keren",
      "helpful_votes": 0,
      "publication_date": 20191117
    },
    {
      "title": "Must have!!!!",
      "text": "These boots are a must have for any toddler. I purchased these for my 4yr. old granddaughter and the boots have good thick fur all the way through them and keeps feet dry and warm....My review is the truth...These boots are exactly as pictured with fur all the way through from top of boot to the front where the toes are (lol) buy these boots good boots and very very warm as if they were Uggs or Northface boots.....2 Thumbs up for me.. P.S. My g.baby where a 10 shoe I bought a 10 in boots so she does has little toe room inside just the way I wanted them to be...",
      "rating": 5.0,
      "verified": true,
      "author": "MzNene.Love",
      "helpful_votes": 0,
      "publication_date": 20191115
    },
    {
      "title": "Great kid's boot, great price",
      "text": "I wanted to get a jump on snow boots for our snowy winters in the northwest. My granddaughter wears a size 3 shoe, but only size 4 was available. She picked out her favorite color/design and I ordered them in July. Delivery was on time. When they arrived, I was delighted. Very cute, with sturdy rubber and deep treads, no apparent openings, furry interior, soft insole and not too large. Its still only August, so they haven't been snow/water tested yet, but I will be very surprised if there is leakage. Given that they are no longer available, I assume they are very popular. They are a terrific boot. If they become available later, buy them.",
      "rating": 5.0,
      "verified": true,
      "author": "Mirth",
      "helpful_votes": 0,
      "publication_date": 20200819
    },
    {
      "title": "Nylon fabric getting stuck in the zipper",
      "text": "These boots are super cute and fuzzy, and my granddaughters love them! However; they are having trouble with the zippers catching the nylon fabric behind. Getting that un-stuck is really difficult I'm worried that one day, it will get stuck for good! In the meantime, and while the boots are a little big on them, they're trying to not even use the zipper at all. Eventually, as their feet grow, they will have to, however.",
      "rating": 3.0,
      "verified": true,
      "author": "Saliandra",
      "helpful_votes": 0,
      "publication_date": 20191011
    },
    {
      "title": "Stiff and Uncomfortable",
      "text": "Look nice but the toes/foot part on these boots are very hard and unflexible. They squeeze her feet and feel tight and hard. Not comfortable at all.",
      "rating": 1.0,
      "verified": true,
      "author": "Gina W",
      "helpful_votes": 7,
      "publication_date": 20171223
    },
    {
      "title": "Just what I was looking for",
      "text": "I was not expecting these boots to be good qualiy because I purchased them on sale and at last minute but they are really sturdy and I am really satisfied with this purchase. They’re not heavy on my daughter’s feet and they are warm in the inside. The insoles also have fur in them. Super cute. She can also put them on herself. Perfect fit. Just right! Will definitely recommend to everyone!",
      "rating": 5.0,
      "verified": true,
      "author": "Red117",
      "helpful_votes": 2,
      "publication_date": 20190117
    },
    {
      "title": "Too small.. not true to size",
      "text": "My daughter wear size 10. I ordered a size 11 for her at the beginning but it’s too tight and very comfortable. So I exchange it to a size 12 it’s a little bit big but the toe box is perfect for her feet. I would suggest ordering 2 sizes up. It’s really warm and the reason I love this boot is because it’s all fur inside the boot even in the toe area. I’m sure it will keep her little feet warm.",
      "rating": 4.0,
      "verified": true,
      "author": "P. Grunchich",
      "helpful_votes": 0,
      "publication_date": 20191022
    },
    {
      "title": "Excellent purchase!",
      "text": "They are so soft on the inside, my 6 yo says it feels like clouds. Fits well, great traction, and we've had windchills of -25 already and she's had no complaints. She s in the snow all the time, so I'm happy w the purchase. I also like that they also have both a zipper closure and the tightening bungee in the front. Can't beat it for the price. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Toofarfromstores",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "Great boots GET THEM!",
      "text": "Omg I bought this boots for my daughter but I didn’t Remember where I got them from until right now I remember I got them from amazon. One of the BEST boots ever don’t think twice GET THEM believe me as a mom when I said money well spent I mean it. I love love them and I wear it as well some times. The only thing is they run a bit big. But it’s warm and very comfortable. Love them I think I will get 2 more pairs soon.",
      "rating": 5.0,
      "verified": true,
      "author": "Shalini10",
      "helpful_votes": 0,
      "publication_date": 20191103
    },
    {
      "title": "Great Cold Weather Boots",
      "text": "Great boots for bitter cold single digit temperature. Waterproof a must! Tread keeps you from slipping. Great price. They for like they should. I read reviews sellers notes saying they ran small and ordered a size larger. Size larger is too large! These boots are sized right on for children.",
      "rating": 5.0,
      "verified": true,
      "author": "Patricia Mays",
      "helpful_votes": 18,
      "publication_date": 20160106
    },
    {
      "title": "Very warm and dry boots",
      "text": "I bought these boots for my 4 year old daughter and they are great. They fit her well and I was amazed to find it truly is fully insulated with soft fur material from upper to toes all around. The bottom of the boot is rubber and has great tread. I can pull the cord right around her snowpants inner lining to keep snow out. The shade of pink was true to the picture on my iPhone and matched her jacket perfectly. Material seems well made and sturdy they definitely keep her warm and dry compared to other boots we have bought for her.",
      "rating": 5.0,
      "verified": true,
      "author": "Live Life",
      "helpful_votes": 0,
      "publication_date": 20200212
    },
    {
      "title": "More girl than boy?",
      "text": "I didn't connect that the comments are in general for all the color options. Apparently these are more girl than boy in design. I picked the green/grey with symbols & faux pockets. Picture=boy. Upon arrival, 8 year old son tries them on.. 6 year old brother immediately commented that they look like girls boots. Dad looks, same comment.. so not my imagination. Too much \"fur\" on top begs the playground bully his best put-down material. I'm returning them. Too bad, very comfortable and warm.",
      "rating": 3.0,
      "verified": true,
      "author": "Dawn A",
      "helpful_votes": 0,
      "publication_date": 20181127
    },
    {
      "title": "Not high enough!",
      "text": "Boots are well made and sealed. Very warm. My daughter was excited to try them on as soon as they arrived. She put them on and immediately got them off. She said it squeezed the top of her feet and I ordered a whole size up! There is no way she could wear these with socks. The problem is the rubber part on top is inflexible. Have to return them and just ordered a new one without the rubber top. Such a bummer because I really like them and we are getting snow tomorrow. :(",
      "rating": 3.0,
      "verified": true,
      "author": "gatadapaz",
      "helpful_votes": 0,
      "publication_date": 20191101
    },
    {
      "title": "Great quality!",
      "text": "Very happy with these boots. These were ordered to replace a different pair that started to fall apart after a month of use. This pair was made with good quality and the design with zipper and pull string has worked very well. We’d order this brand and style again, but I don’t think we’ll need to next winter yet since they’ve held up so we’ll! Very happy with this pair as a replacement to a different brands failure.",
      "rating": 5.0,
      "verified": true,
      "author": "yeah",
      "helpful_votes": 0,
      "publication_date": 20200601
    },
    {
      "title": "Good boots",
      "text": "It is so hard finding kids boots that not only the kids like but are sturdy and tough for a New England winter but don’t break the bank. These so far (2nd month of owning) have held up nicely. Not breakage around the front. No loss of the fur. Good tread. My daughter loves them and the color. The inside is holding up as well. Easy to slip on and off. Water proof and keeps her feet warm for quite awhile. Really enjoy these. Great quality for the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Raven",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Order larger!",
      "text": "These are cute boots! However, I would definitely recommend ordering larger than your kiddo’s normal size. The inner lining at the toe is shorter than the toe of the boot. I made my daughter wear them around the house when they arrived, so she could tell me if they felt okay. She thought they were fine, but she wore them to school today and complained they were too short in the toe. Of course she couldn’t decide that before she wore them outside! She wears size 3 or 4 depending on the style of shoe. I ordered the 4, but it seems that will be a little small now.",
      "rating": 4.0,
      "verified": true,
      "author": "Jenn9872",
      "helpful_votes": 0,
      "publication_date": 20180205
    },
    {
      "title": "Our kid wore these out! Bought new ones for this season.",
      "text": "I wasn't sure what to expect from these boots so they were purchased without trying them on, but they fit my daughter's feet perfectly and she would not take them off! I love how cute they are and they seemed to support her ankle well and keep her feet warm. We liked them so much we bought a similar pair for this season as she grew out of them. Hurry and buy because they won't last!",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan Tucker",
      "helpful_votes": 0,
      "publication_date": 20200919
    },
    {
      "title": "Great boots, my girls LOVE",
      "text": "These are a great affordable option! My girls both wanted something different than what was on the local shelves, and these were the same price as the boots i was considering at Walmart. Much cuter! We have already had some brutal days here in Michigan, and so far the boots have worked perfectly. The cute print and fur at the top make these reliable boots extra special. Cant recommend them enough!",
      "rating": 5.0,
      "verified": true,
      "author": "Avalon33",
      "helpful_votes": 0,
      "publication_date": 20181129
    },
    {
      "title": "Sadly disappointed that these boots (which were super cute and came ...",
      "text": "Sadly disappointed that these boots (which were super cute and came only 1 day late) were not true to size (for us anyway). My child was in a size 5 that fit fine. I ordered these in a 6 to give him room to grow and to have a 2nd pair of boots (we love the snow). These didn't fit at all! Far too small. They are very snuggly and warm but that extra lining means they are several sizes too small, at least for my little guy.",
      "rating": 2.0,
      "verified": true,
      "author": "book lover",
      "helpful_votes": 2,
      "publication_date": 20171213
    },
    {
      "title": "Nice boots but they run small",
      "text": "These run super small! I ordered up two sizes for my daughter and they are still too small. Returning for three sizes up (free returns though so that's awesome!!). The entire boot is fur lined which will keep toes cozy in winter but makes them tight and need to size up.",
      "rating": 4.0,
      "verified": true,
      "author": "A. Epps",
      "helpful_votes": 0,
      "publication_date": 20190930
    },
    {
      "title": "Cost effective kids winter boots",
      "text": "Size is correct, true to the us standards. Material is waterproof and double stitching ties the rubber to it. The little pocket is non-functional just for fashion (pinned shut). Lined with thinsulate very warm and we live where it gets in the negatives for months on end. Faux fur is nothing to write home about. Side zipper helps the little ones do it by themselves, this helps alot at school. The pull-tight cinch feature is nice for a better fit. Overall fantastic boot for the price, these have lasted longer than a \"name brand\" boot purchased for 3x the cost of these!",
      "rating": 5.0,
      "verified": true,
      "author": "S McGee",
      "helpful_votes": 0,
      "publication_date": 20180510
    },
    {
      "title": "Worked but are very heavy",
      "text": "These boots lasted all winter and still look new. They kept his feet dry from the elements. Complaints would be they are very heavy and clunky. We had to return the ones for our five year old. She could barely walk. They do not allow the feet to breathe so his feet began to peel. They did the job and lasted but I would try a different kind/type next time.",
      "rating": 4.0,
      "verified": true,
      "author": "JaimeW",
      "helpful_votes": 0,
      "publication_date": 20200303
    },
    {
      "title": "I LOVE THESE BOOTS!!",
      "text": "I LOVE these boots. I prefer boots with a zipper, which these boots have. They are so soft and warm inside. The only thing that's confusing to me is the appropriate size. I ordered them in sizes 2 and 3. After a few minutes of wear in the house, the size 2 (left foot) seemed a bit tight. The size 3 fits the left foot better, but the heel of the foot slips out a bit when walking fast. I think the type of socks worn makes a difference as well. I do love the boots. I'm determined to find the best fit.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon shopper",
      "helpful_votes": 0,
      "publication_date": 20181124
    },
    {
      "title": "my daughter loves these",
      "text": "I wanted to try a more affordable boot since two of my three kids outgrew their boots mid-season. And these are fantastic! We have the red with a fur ruffle, which my 6-year-old daughter finds to be quite a fashion statement... More importantly, she can get these on and off of her feet easily and independently- which makes our mornings a whole lot better. She’s only been out in the snow with these a few times, but so far they still look new.",
      "rating": 5.0,
      "verified": true,
      "author": "Family of Five",
      "helpful_votes": 0,
      "publication_date": 20190209
    },
    {
      "title": "Inaccurate Sizing!- Too Large or Small",
      "text": "Due prior reviews suggesting one size up as the fur lining was bulky making boots tight on children’s feet. I ordered a small child size 13 (normally sized 12 little child)-They fit her perfectly pleased with that pair. Ordered the same exact matching pair big kid size 6 for sister (wears size 5 big kid) this pair was EXTREMELY large and fit MY Women’s size 8.5 feet with some extra wiggle room! The tag inside that pair stated Big Kid 6 some serious sizing flaws here.",
      "rating": 1.0,
      "verified": true,
      "author": "Deanna Trammell",
      "helpful_votes": 0,
      "publication_date": 20181206
    },
    {
      "title": "Good boots!",
      "text": "Feet stay dry, they look cute and they have good grip on the bottom. These boots check the main boxes for those of us that live with snow. They are a little bigger than expected. Will definitely fit big socks and have room to grow. Wish the top drawstring actually tightened and wasn’t just for looks. The leg is very loose on kids. Still a good boot and would buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer",
      "helpful_votes": 0,
      "publication_date": 20191224
    },
    {
      "title": "My son loves them",
      "text": "These boots look great my only complaint is they look a little girly in person versus the pictures. My son loves them and doesn’t care so that’s what matters. The lining is extremely nice and fluffy and the exterior seems to be water proof. We just got them so when we use them in the snow I’ll update if they’re not. My son is 10 wears a size 2 I bought a 3 they fit great with a little extra room. Would definitely recommend as of right now.",
      "rating": 5.0,
      "verified": true,
      "author": "samantha rushing",
      "helpful_votes": 0,
      "publication_date": 20191115
    },
    {
      "title": "A great little boot your girl will love",
      "text": "These work well for keeping my daughter’s feet warm. They are not super soft on the bottom but not rock hard either. She wears them all the time and they don’t have strings hanging or anything falling off and I think that’s a good sign of quality since she’s 3 and highly active. The only thing I don’t like is how the fabric gets caught in the zipper.",
      "rating": 5.0,
      "verified": true,
      "author": "abcain813",
      "helpful_votes": 0,
      "publication_date": 20200128
    },
    {
      "title": "Definitely recommend this boot. Measure foot as instructed",
      "text": "We measured daughters foot before ordering and was right around 9.5 size but went with a 10 to be safe. They are a bit big this year but will allow for room to grow and when we need to have to pairs of socks on it’s great to have extra room. Easy to put on and off which is key. Good bottom grip to allow for use when snowy and icy. Little one was able to climb up hill with no issues after large snow fall. LO has never complained about toes being cold so I think they are working as intended. Overall good boot for the price and I looked at a ton before ordering these. Shipped quickly also.",
      "rating": 4.0,
      "verified": true,
      "author": "Mommy of 2",
      "helpful_votes": 0,
      "publication_date": 20191130
    },
    {
      "title": "These are not waterproof!",
      "text": "Very disappointed! Purchased these for my granddaughter because it said WATERPROOF! If it had been water resistant, then I would have thought \"my bad\". No ... definitely not waterproof and her poor little feet are cold and wet and it takes a couple days to dry the boots. Very disappointed. Tried contacting the seller twice and no response.",
      "rating": 2.0,
      "verified": true,
      "author": "Michelle",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "These boots are awesome! The fur is so soft and I was ...",
      "text": "Ordered two pairs of different colors for my kids... These boots are awesome! The fur is so soft and I was a little worried the kids would think they're a bit \"girly\" because of it, but the boots look awesome on them. We finally had snow today and the kids tested them out. The boots were covered in snow, but their feet stayed dry and warm.",
      "rating": 5.0,
      "verified": true,
      "author": "Julie",
      "helpful_votes": 2,
      "publication_date": 20180125
    },
    {
      "title": "Warm, comfortable, and waterproof! Perfect",
      "text": "My kids love these boots! We have purchased this brand 5 times now because They’re warm, waterproof, and comfortable. Everything we could ask for 👍🏻 I was worried about the little bungee being strong enough to tighten the boots well enough, but it has never been a problem, and we’re in year three with one of the pairs. Would definitely recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Kassy P",
      "helpful_votes": 0,
      "publication_date": 20191210
    },
    {
      "title": "Order at least 1 size up if not two!",
      "text": "Our first order was 1 size up. It had plenty of room at the toe but the width around the heel is just too small. Thankfully, Amazon does returns. Our second order was 2 sizes up. fits great my daughter says. She loves them. Bummed about the fake pocket (minus one star) and the excessively narrow boot, so 4 stars it is.",
      "rating": 4.0,
      "verified": true,
      "author": "M.B.",
      "helpful_votes": 0,
      "publication_date": 20191031
    },
    {
      "title": "Good Purchase!",
      "text": "I purchased these boots for my grandson. Normally he wouldn’t need them until the end of November. The boots were delivered to my home on October 29th, and I was pleased with the quality of the boots. Then I found out we were to expect heavy snow that very evening. Snow in October! The next morning when he went to school there was 6 inches of the heavy wet stuff to trek through. That evening he called to tell me his boots kept his feet warm and toasty.",
      "rating": 5.0,
      "verified": true,
      "author": "RacineNana",
      "helpful_votes": 0,
      "publication_date": 20191108
    },
    {
      "title": "Sharp looking boot",
      "text": "I searched boots trying to find a pair for my 7-year old granddaughter. She's artistic and very messy...she gets her clothes dirty without even trying. While she loved the colorful design, I liked the black base and dark fur at the top. So these will still look good no matter what she does to them. And they're warm enough for our Michigan winters.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191213
    },
    {
      "title": "Boots can handle wet slushy snow",
      "text": "Purchased these boots 2 months ago and so far these boots are doing the job. They are a bit loose. My little girl foot came out twice when playing in some deep snow. I do like the fact that no water has leaked through with all the slushy wet snow we have right now and all the puddles my daughter likes to walk through like if she has rain boots on. These boots have kept my daughter feet dry and warm. Very happy with my purchase",
      "rating": 4.0,
      "verified": true,
      "author": "Armando Rosas",
      "helpful_votes": 0,
      "publication_date": 20190304
    },
    {
      "title": "Kid loves it! Doesn't leak or hurt!! Would buy again. :)",
      "text": "Kid loves these. We've gone to the mountains and played in the snow numerous times and she's never complained about leaking or her feet hurting, so that's a plus! The color and patterns are cute and she thought so as well. The fuzy, part around the edge (the fur) didn't seem to get drenched when submerged in snow so that was nice as well. The front of the boot and the bottom of the boot is thick rubbery plastic and seems very heavy duty! Would definitely buy again!",
      "rating": 5.0,
      "verified": true,
      "author": "Chris R.",
      "helpful_votes": 0,
      "publication_date": 20180413
    },
    {
      "title": "Great boot but....",
      "text": "Boot is like slipping your foot into a slice of heaven. Bought for my daughter... she’s a size 5 and bought the 5. As her mom, I’m a size 8 and could fit my foot in the boot with my toes crunched up. My girl says she loves them, and can’t get enough of the incredibly soft fur lining. She took off her socks at school just to feel it. They are definitely large, but still work for her. Recommend for comfort but consider it a 1/2 size larger at least when ordering",
      "rating": 5.0,
      "verified": true,
      "author": "lamilia",
      "helpful_votes": 0,
      "publication_date": 20181124
    },
    {
      "title": "SUPER Stiff",
      "text": "Minimal shoes are so expensive for growing kids, so we went with these. I expected the sole to be a bit more flexible than this, and it is definitely not. There is a rise in the heal, so these definitely don't qualify for minimal in any way. Otherwise, they are sturdy and warm. THE POCKET IS FAKE. My son was bummed.",
      "rating": 3.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20191126
    },
    {
      "title": "WOW! Tough Boots",
      "text": "Bought these for my 8 year old with down syndrome. I can't believe how thick and durable these are! These are soft on the inside and are very easy for her to put on. Looked at similar boots at shoe stores for $30 -$50 a pair and these are much more durable than any other boots I could find in a local store. 5 stars for days!",
      "rating": 5.0,
      "verified": true,
      "author": "Halfrightface",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "Nice looking boots and very high quality",
      "text": "Ordered these boots for our granddaughter because her boots she had were not warm and did not keep her feet warm. We received these boots quickly form amazon and they fit as expected. Our granddaughter loves them, she said they are really warm and on the first day she wore them she told us that she walked through a puddle and her feet didn't even get wet, lol. Nice looking boots and very high quality, would recommend them to any one looking for a good warm quality boot for their child or grandchildren.",
      "rating": 5.0,
      "verified": true,
      "author": "ADK Native",
      "helpful_votes": 0,
      "publication_date": 20180220
    },
    {
      "title": "The price was great.",
      "text": "I got this a little bigger than my 10yo true size. I ordered this for our trip to Iceland to see the Northern lights and it said it is for cold weather and weather proof so I am hoping it will live upto its promise. She loves the look of it and wears it around even though we live in Hawaii... The price was great.",
      "rating": 5.0,
      "verified": true,
      "author": "Fumie SP",
      "helpful_votes": 0,
      "publication_date": 20180923
    },
    {
      "title": "Perfect winter boots.",
      "text": "This is our second year buying these boots! We love them. I just wish they had smaller sizes for my youngest. :) They are soft and warm. My kids wear them in below 0°F temps and never complain their feet are cold. They are comfortable, cute, and I feel sure my children's feet will be safe.",
      "rating": 5.0,
      "verified": true,
      "author": "NewEnglandMom",
      "helpful_votes": 0,
      "publication_date": 20181030
    },
    {
      "title": "Sole not rubber on mine",
      "text": "Not sure if I got a defective pair but the soles on mine has like a felt material when the description says it’s rubber. You can see lint from my carpet collecting on it. I’m hoping the snow doesn’t pack on the bottoms. Other then that it’s a good fit, niece boot... will update after snow. Update: The snow did pack under my feet. The inside of the boot was nice and warm so of course your feet sweat a bit. So when the snow started to pack under the boot my feet got real cold real fast. Was fine before I stepped into the snow though.",
      "rating": 4.0,
      "verified": true,
      "author": "Alyssa",
      "helpful_votes": 0,
      "publication_date": 20190121
    },
    {
      "title": "Amazing boots! #bootswiththefur",
      "text": "Perfect boots! I love the insulated ones for my kiddo! Keeps his feet nice and warm, great price, great fit!",
      "rating": 5.0,
      "verified": true,
      "author": "Julie Kariann",
      "helpful_votes": 2,
      "publication_date": 20191028
    },
    {
      "title": "Great overall boots",
      "text": "Perfect winter boots. They are cute enough for my \"fashion queen\" 5 y/o daughter, rugged enough to make it through Midwestern winters, and easy enough to put on and take off that she can take them to school for recess (shoes or slippers are worn in the classroom). A great buy!",
      "rating": 5.0,
      "verified": true,
      "author": "Haon the GreatTop Contributor: Chess",
      "helpful_votes": 2,
      "publication_date": 20180124
    },
    {
      "title": "SIZE UP! TRUST ME! Beautiful and well made boots!",
      "text": "Beautiful and well made boots - adorably stylish! My daughter does NOT have wide feed so I didn't trust the other reviews and didn't size up. Lesson learned here? Trust your fellow reviewers. You NEED to order a size up on these. Otherwise no complaints. They are beautiful and well made!",
      "rating": 5.0,
      "verified": true,
      "author": "AnnieDrag",
      "helpful_votes": 3,
      "publication_date": 20171213
    },
    {
      "title": "Waste of money!",
      "text": "My son had these boots for about a month and a half. We've had a ton of snow, so they have been worn daily, but they are already breaking apart. The toggle and elastic lace snapped on one boot and on the other, the zipper is busted will only come up halfway. Not worth the money!",
      "rating": 1.0,
      "verified": true,
      "author": "Marsha",
      "helpful_votes": 0,
      "publication_date": 20190307
    },
    {
      "title": "Very cute, warm snow boots",
      "text": "Bought for my granddaughter. Her cousin received a pair for Christmas. She wanted a pair, which we were looking at llbean boots and she wanted these. Have to say we saved a bundle of money, went with these. She not only is happy with these, their just as warm. So we both win!",
      "rating": 5.0,
      "verified": true,
      "author": "susan garrett",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "Great no hassle",
      "text": "The boots are super cute an fluffy inside . The cute little pocket is for show only . Boots were snug in 3 her usual size returned an new boots within 3 days great no hassle. Ty amazon",
      "rating": 4.0,
      "verified": true,
      "author": "Unicorn princess ",
      "helpful_votes": 0,
      "publication_date": 20191010
    },
    {
      "title": "Not great",
      "text": "Bought these almost a year ago. They're cute and waterproof, but my daughter doesn't like wearing them. She says they hurt. They aren't too small-I sized up to allow for thick socks. I think the way the fabric bends at the ankle makes it dig in to her. So they work at keeping out snow and cold, but I have to convince her to put them on. Luckily we live in Georgia and only used these for visiting family up North.",
      "rating": 3.0,
      "verified": true,
      "author": "funmolly212",
      "helpful_votes": 0,
      "publication_date": 20181014
    },
    {
      "title": "Super cute, soft inside boots!",
      "text": "These only arrived yesterday, and my 7 year old granddaughter loves them so much, she wanted to wear them immediately (though it hasn't snowed yet in Minnesota.) My daughter is impressed with the quality. I will update after we have enough snow, to review the actual performance.",
      "rating": 5.0,
      "verified": true,
      "author": "Katniss05Top Contributor: Coloring",
      "helpful_votes": 0,
      "publication_date": 20191023
    },
    {
      "title": "Pretty boots, questionable quality",
      "text": "The second time my daughter wore the boots, the L boot decorative clasp holding the draw strings together fell off. I don’t expect these things to last forever, but the second time worn they were falling apart. Now I have to go through the hassle of returning them. Happy with the boots otherwise and my daughter loves them. Update: these boots continue to fall apart piece by piece.. Junk. I would never buy them again.",
      "rating": 1.0,
      "verified": true,
      "author": "S. Wolford",
      "helpful_votes": 0,
      "publication_date": 20190126
    },
    {
      "title": "Right is great. Left is too small",
      "text": "The right boot fits perfectly but the left boot feels too snug. I thought maybe they sent the wrong size on for the left boot but they’re both marked as the same size. I would have sent them back to exchange for a new pair but we had snow and I needed to wear them.",
      "rating": 4.0,
      "verified": true,
      "author": "Victoria Kozera",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "LOVE LOVE LOVE!!!",
      "text": "I ordered 2 pairof these. One for rach my 7 and 10year old daughters. Ive been striking out with boots and was super nervous about the quality and the fit of these, but to my surprise they're everything they say they are and more! I absolutely love them and so do my girls. Theyre so cute and extremely functional. We live in michigan where it gets very cold and these are perfect",
      "rating": 5.0,
      "verified": true,
      "author": "DreadHeadMommy",
      "helpful_votes": 0,
      "publication_date": 20181205
    },
    {
      "title": "Great quality, fit well, good price",
      "text": "My daughter loves them! They arrived quickly and they fit perfectly. She has a wide foot and this boot fit her snuggly without being too tight and provides her exceptional warmth when in the snow. Good quality especially for the price, though we haven't used it for more than a few days thus far. Pretty boots that I hope last through the winter season.",
      "rating": 5.0,
      "verified": true,
      "author": "dhead",
      "helpful_votes": 0,
      "publication_date": 20190119
    },
    {
      "title": "Awesome snowboots for kids!",
      "text": "Wow! Beyond impressed. Always a little nervous, especially when buying shoes, to purchase without actually being able to visually and physically inspect the quality of the product I am purchasing. My biggest concern purchasing these snow boots for my daughter, without seeing them in person, was if they would be warm enough as well as sturdy. The lining was so plush, thick, and warm. My daughter LOVES these boots. Great price and quick shipping! Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "B. FOX",
      "helpful_votes": 0,
      "publication_date": 20171102
    },
    {
      "title": "Look great and very functional.",
      "text": "My 9 year old daughter loves these boots, They keep her feet warm and dry. One of the nicest features is that they appear nice and not too bulky to be worn all day at school. The tread grips well. Excellent in the snow for all activities including hiking. Drawstring is nice to hug close to the leg and prevent snow from entering. These have been very durable. Worn every day for 2 months now and show no wear.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer Platkus",
      "helpful_votes": 0,
      "publication_date": 20180304
    },
    {
      "title": "She complained they were to tight",
      "text": "To be honest they seem a little narrow. I ordered a 13 thinking my daughter would have room to grow into them, but she hasn't had them on long enough for me to truly assess them. She wears a 12 and after having her try them in her foot seems to have room, but she's complaining they are tight. This could be because she's not use to snow boots or they truly are too tight. It's just to soon to tell. I'll try to remember to come back and update my review once I have more information.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170204
    },
    {
      "title": "Beautiful, stay dry and warm",
      "text": "Well we have used these throughout the Michigan winter. We got them in fall and are still wearing. They look brand new. The child who was using them always complains about shoes. These she loves. They are really cute and keep her warm and dry.",
      "rating": 5.0,
      "verified": true,
      "author": "MandaPanda",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Cute but not Durable.",
      "text": "These boots while cute, did not last the whole winter and were starting to come apart within a month. We have snowy winters so boots are important. My daughters feet were wet and cold because they were coming apart.",
      "rating": 2.0,
      "verified": true,
      "author": "S. Appel",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "New Purple Boots Keep Me Warm",
      "text": "Love my new boots. They are warm and comfortable. Although it doesnt snow where I live, if my feet are warm then so am I. I love wearing my new boots with shorts even. The color is perfect and matches my current hair color. These boots fit great and feel great. I bet they would be great in the snow but I may never know.",
      "rating": 5.0,
      "verified": true,
      "author": "Tazzie",
      "helpful_votes": 0,
      "publication_date": 20180102
    },
    {
      "title": "Very nice",
      "text": "These boots are high quality boots. I was not expecting to receive something like this in the mail. I did return them because they were a bit too heavy for my son to walk around it, thus creating a problem in causing him to trip. I would however, recommend these boots to anyone looking for high quality winter boots.",
      "rating": 4.0,
      "verified": true,
      "author": "Libbyrose82",
      "helpful_votes": 0,
      "publication_date": 20180130
    },
    {
      "title": "Kept my daughter’s feet warm/dry during tons of snow play",
      "text": "Kept my daughter’s feet warm/dry in hours of sledding and trudging through waist deep deep snow over Thanksgiving week. Good snow pants also helped! Temps were in the 20’s-30’s. She routinely wore only one pair of socks too. Definitely recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "ColoredInWild",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "very narrow",
      "text": "These boots would probably be fine if your child has narrow feet, but we returned them since my children have Flinstone feet. The fur lining was nice and they seemed like they would be good snow boots, otherwise, but can't confirm that with experience.",
      "rating": 3.0,
      "verified": true,
      "author": "Tiffster",
      "helpful_votes": 2,
      "publication_date": 20180204
    },
    {
      "title": "Cute boots, true to size",
      "text": "I bought these for my 7 year old daughter who is typically in a size 2 shoe. Most of the reviews said to size up, so I ordered a 3. These are a bit large on her but she could still wear them out in the snow, maybe with a thicker sock. She could of wore a 2 and they would have fit a whole lot better but on the plus side she can wear them next year. They are super cute though and look like great quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica R.",
      "helpful_votes": 0,
      "publication_date": 20190112
    },
    {
      "title": "Great boot",
      "text": "I bought the boots for my 4 year old granddaughter. She loved them and wore them in the House the rest of the day. I love the color, the draw string so you can tighten the boot and the zipper which makes the boot easier to put on. The rubber shoe part is great and sole with grippers is great. It is a little heavy because my granddaughter is a lightweight but it is a great boot.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20171119
    },
    {
      "title": "Great quality and price!",
      "text": "I buy a pair of these boots for my kids every year. The price and quality are just right! My kids love these boots and all the different style patterns they come in.",
      "rating": 5.0,
      "verified": true,
      "author": "La Doña",
      "helpful_votes": 0,
      "publication_date": 20201017
    },
    {
      "title": "Love the pink fur!",
      "text": "True to size for my daughter. She is six and can slide these on and off herself. They stay on well and keep her feet dry. She is particular about shoes and she likes these. I haven’t had any issues with the zippers or having to pull the string so tight that it becomes too long and gets in the way. They stay on without having to pull the top string tight. I’ve had other moms compliment them and ask where to purchase them.",
      "rating": 5.0,
      "verified": true,
      "author": "JK",
      "helpful_votes": 0,
      "publication_date": 20180123
    },
    {
      "title": "Great quality but go the next size up",
      "text": "We love the boots. The color, style and quality are all as good as we expected and they are warm & waterproof, a great choice. If I had read further into other reviews before purchasing I would have realized the sizing runs small and purchased the next size up. We happened to get quite a bit of snow in our area the day after they arrived and hadn't time to run out to purchase another pair that fit better. My daughter wore them with tights instead of sox and they got us through. We are purchasing a new pair the next size up because we (mom & daughter) liked them so well.",
      "rating": 4.0,
      "verified": true,
      "author": "Grace Williams",
      "helpful_votes": 0,
      "publication_date": 20180111
    },
    {
      "title": "Fit perfect, really cute!",
      "text": "These boots fit my daughter like a glove, very true to size. Very happy with my purchase, better quality than I expected. Would definitely purchase again and recommend! My daughter gets endless amounts of compliments on these boots!",
      "rating": 5.0,
      "verified": true,
      "author": "Libby",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "Would buy again",
      "text": "Hard to really speak to the fit as they are for a kid. That said they are worn often and feet are warm and cozy when they come off but not sweaty. The cord for tightening them doesn’t pull as tight as I would like and we have lost a boot in the snow as a result, so they might be a little too big in general. They’re holding up well and we will get more than one season out of them as long as feet don’t grow too much!",
      "rating": 5.0,
      "verified": true,
      "author": "TR",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Perfect for my kids!",
      "text": "I bought the pink pair for my daughter (5) & the grey for my son (7) a month ago & they still look new. They are super warm and very easy to pull on. Able to play in the snow and stomo around daily in them. Very well made.",
      "rating": 5.0,
      "verified": true,
      "author": "Meghan M",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "Lovely",
      "text": "Daughter loves them. They are heavy and kept her feet warm in this past storm. She likes them a lot and I like anything that keeps her warm and dry at a reasonable price. My hope is they hold up long term. They are attractive and warm.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 2,
      "publication_date": 20180105
    },
    {
      "title": "Slim toe. Women's to kids conversion see.s slightly off. Be prepared to pay 1/4 of the boots cost upon return.",
      "text": "Boots appeared to be built with slightly Above average quality, appropriate for price. Used the tried and true method of subsubtracting 2 sizes when moving from a women's size to a kids size. These ended up being pinched in thr toe on a petite sized foot. The seller did refund promptly (- a $6.70 shipping or restock8ng charge.",
      "rating": 3.0,
      "verified": true,
      "author": "MikeyWrighteous",
      "helpful_votes": 0,
      "publication_date": 20180110
    },
    {
      "title": "Adorable & Warm",
      "text": "My daughter loves these boots. We haven't used them for snow yet, but we've been able to utilize these for the freezing weather and winter rain. Her toes remain toasty and dry. Neither of us have any complaints thus far.",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "Good boot for snow but I wouldn't call this a boy/girls boot.",
      "text": "My wife bought this boot for my son for the snow. Worked well enough for keeping his feet dry in the snow but I really wouldn't consider this a boy's snow boot based on the looks. These boots are definitely meant for girls not boys. We're going to give these pair to our niece since I wasn't a fan of how they looked on our son.",
      "rating": 3.0,
      "verified": true,
      "author": "Michael R",
      "helpful_votes": 0,
      "publication_date": 20190124
    },
    {
      "title": "so good. My daughter likes them",
      "text": "So far, so good. My daughter likes them. I ordered them large, so they require a few pair of socks. They are easy to put on, zip on the side, havea cord to tighten, and they're warm. Apparently the pocket on the side is not a real pocket. That was a little disappointing. Nevertheless, we are happy!",
      "rating": 4.0,
      "verified": true,
      "author": "Ang *)",
      "helpful_votes": 0,
      "publication_date": 20180118
    },
    {
      "title": "They did fine..",
      "text": "I ordered 2 pairs and both had a weird clicking under the sole of the shoe. My son could feel it and her it when he walked. I returned one but kept the other because we were going to the snow and had no time to exchange. They did fine.... but that clicking like foil plastic was annoying to him. Not sure why they both had it.. but they did keep his feet warm.. and they are cute",
      "rating": 3.0,
      "verified": true,
      "author": "Heather",
      "helpful_votes": 0,
      "publication_date": 20180304
    },
    {
      "title": "Good boots",
      "text": "These are really good boots. They do a good job of keeping the snow out while keeping their feet dry. They are easy for the kids to get on themselves and do a pretty good job of staying on in deep snow. However, when inside a hard floors, two kids running in these boots can sound like a herd of elephants!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181218
    },
    {
      "title": "Not great for wet winter play.",
      "text": "Unfortunately, we were fairly disappointed with this product. Once wet, the boots were very difficult to dry and over time (nov-Jan) became very smelly. I understand that they were only waterproof upto the ankles or so but it’s impossible for boots not to get wet above the ankles here in New England and with our winters and my kids these boots did not serve us well. Kinda bummed. We will be making a smarter choice next winter. If your kid doesn’t go into deep snow or jump in icy puddles then I am sure these boots are warm and just enough.",
      "rating": 2.0,
      "verified": true,
      "author": "Julie A. Sella",
      "helpful_votes": 0,
      "publication_date": 20200208
    },
    {
      "title": "Great Buy",
      "text": "I bought these for my 3 yr old toddler son. He loved them. I loved the way he looked in them. They fit very nicely. Hopefully he gets at most 2 years of use out of them. If not I'd buy again in a larger size.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer Nicholas",
      "helpful_votes": 0,
      "publication_date": 20200628
    },
    {
      "title": "Awesome",
      "text": "Ordered a 12 because that's the size my daughter wears. Was hoping for a 13 so she would have extra room to grow. These were perfect! Just slightly bigger than I thought they may end up being so I am totally satisfied. She loves them and keeps thanking me for her pretty boots that are so soft and warm. Definitely would buy again",
      "rating": 5.0,
      "verified": true,
      "author": "David and Amanda",
      "helpful_votes": 0,
      "publication_date": 20190125
    },
    {
      "title": "Impressed",
      "text": "This is the first time we tried this brand, we've always give with Columbia. This year my daughter wanted something prettier then Columbia had to offer. She chose these. I wasn't expecting much for the price, but WOW I'm impressed with the quality. They are soft inside, keep my daughter's feet warm and dry. She loves them! I'll be buying this brand again next winter!",
      "rating": 5.0,
      "verified": true,
      "author": "MamacitaBonita",
      "helpful_votes": 0,
      "publication_date": 20180301
    },
    {
      "title": "Great buy, size up!",
      "text": "Nice boots for the price, they seem durable and light weight. The faux fur is lined inside the whole boot, nice to keep their feet warm! I will be exchanging for a bigger size, I recommend sizing up to account for the faux fur lining and heavy socks, my son tried them on with thin socks and he definitely would not be able to wear winter socks with them. He is a size 2.5-3 youth in sneakers with about a “thumbs” room or so. I ordered a 3 in the boots because he does not like boots too big, I will exchange for a size 4.",
      "rating": 5.0,
      "verified": true,
      "author": "Holly",
      "helpful_votes": 0,
      "publication_date": 20191205
    },
    {
      "title": "These boots are super cute, however they were not the best in ...",
      "text": "These boots are super cute, however they were not the best in the 3+ feet of snow that we had. They were water proof, but the top of the boot was so wide that snow just packed in there. They worked great just walking around wet and slushy parking lots. For kids that like to play hard in the snow (like my 8 year old does) they weren't the right style.",
      "rating": 4.0,
      "verified": true,
      "author": "C. Wahl",
      "helpful_votes": 3,
      "publication_date": 20160406
    },
    {
      "title": "Quality and fitting",
      "text": "It's a nice booth it's a little big in the back.for my granddaughter she is 8.years old she likes it alot a little too heavy on her feet for a 8.years old she is wearing it now the make is heavy for a child other from that it's not a bad material",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191213
    },
    {
      "title": "Comfy, warm boots at a great price!",
      "text": "These boots seem to be excellent quality. The interior had a nice plush lining. I like that they zip on the side and have a bungee. I ordered a size 1 after my daughter was complaining of last years boots (size 13, brand North Face) being too small. The size 1 was quite a bit bigger then her current size 13. I will keep these knowing she will grow into them because the price was just right and the features and quality seem great.",
      "rating": 5.0,
      "verified": true,
      "author": "Nelson1319",
      "helpful_votes": 0,
      "publication_date": 20171101
    },
    {
      "title": "The kiddo loves them and they are WARM",
      "text": "My kiddo needed a pair of snow boots and I wanted to make sure she had some that had the waterproof bottoms but was warm inside. The warm furry-ness goes all the way through and you can cinch them on the front and it makes it tighter. She loves them and I'm really glad I found some that are practical for weird snow patterns in Colorado.",
      "rating": 5.0,
      "verified": true,
      "author": "Amanus",
      "helpful_votes": 0,
      "publication_date": 20181206
    },
    {
      "title": "Good boot for the winter",
      "text": "Good boot for the winter. The good news is it never left my kids feet wet and cold. The bad news is...it was hard to adjust the boot to fit firmly on the foot. The boot as a zip down the side and a draw string in the front. Even with these two items it seemed to run a little large for my kid when ordering the same size as their sneakers.",
      "rating": 4.0,
      "verified": true,
      "author": "Jimmy",
      "helpful_votes": 0,
      "publication_date": 20180407
    },
    {
      "title": "Perfect",
      "text": "My 6 year old loves these even though they sound super clunky when she walks around in them. We’ve had them through several hours of playing on the snow with no reports of cold feet or wet socks.",
      "rating": 5.0,
      "verified": true,
      "author": "JuneBug",
      "helpful_votes": 0,
      "publication_date": 20191221
    }
  ],
  "product_meta": {
    "title": "DREAM PAIRS Boys Girls Insulated Waterproof Snow Boots",
    "rating": 4.7,
    "feature_bullets": [
      "man made material and rubber",
      "Rubber sole",
      "Shaft measures approximately 9\" from arch",
      "Boot opening measures approximately 9\" around",
      "FITTING TIPS: Full Size Only, Order Half Size Up For Loose Fit!",
      "Cold-weather boot featuring waterproof shell bottom unit, 200g Thermolite insulation rated to -25F, and one pull bungee lacing system",
      "Waterproof shell bottom unit, 200g Thermolite insulation rated to -25F",
      "All-weather protection and a toasty layer of insulation.",
      "Shaft Height With Heel: 9\" (approx)"
    ],
    "categories": [
      "Snow Boots",
      "Shoes",
      "Girls",
      "Outdoor",
      "Clothing, Shoes & Jewelry"
    ],
    "price": 29.99,
    "specifications": {}
  }
}