{
  "website_summaries": [
    {
      "verdict": "This is a great option if you're beginning to have trouble reading without glasses and just want a little bit of help.",
      "pros": [
        "3x magnification with six LED lights built in",
        "Two brightness settings",
        "Storage pouch included",
        "Large, wide display is ideal for reading",
        "Cleaning cloth for wiping away smudges"
      ],
      "cons": [
        "Users say this magnifying glass doesn't appear to be as powerful as it claims"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great magnifier, but watch out for the bright lights!!",
      "text": "I bought this for my 93-year-old Mom who has macular degeneration and has used it constantly. Be aware that if you have it turned wrong, the LED lights are extremely bright and can hurt sensitive eyes. First time Mom turned it on, she had the lights facing her and cried out in pain. I drew a smiley face on a small piece of paper and taped it to the handle. I told Mom to always be sure she can see the smiley face before she turns the light on. That has worked out perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Pressly",
      "helpful_votes": 357,
      "publication_date": 20170326
    },
    {
      "title": "Great with new improvements",
      "text": "I have the old one of these. It was heavier and only had four lights and the light wasn't adjustable. I love the new design. The handle is narrower than the old one and I love the addition of 8 lights to increase brightness. It is also lighter than the old one. All this makes for great improvements. I've used the old one for about 3 or 4 years and I absolutely love it but this one seems to be much, much better. This is a great magnifier for reading. And I love the new improvements.",
      "rating": 5.0,
      "verified": true,
      "author": "Drew",
      "helpful_votes": 224,
      "publication_date": 20181105
    },
    {
      "title": "Wonderful item but didn’t last long.",
      "text": "I bought this item in December of 2017. Didn’t start using it until May 2018. I do love it and used it when reading books and my newspaper. Now I am lost without it and very sad. The on/off switch doesn’t work. Took it to a retired electrician and he was unable to repair it. Said it had a faulty switch. I think I only used it about 50 times since May. I think it broke too soon. Was very happy but afraid now to spend the money to buy another.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Traino",
      "helpful_votes": 183,
      "publication_date": 20180813
    },
    {
      "title": "Lighting may be more important than magnification - was for me.",
      "text": "I bought this in order to read the fine print notes in my study Bible. I'm not certain that it is 3 power, but there is sufficient magnification. It soon occurred to me that poor inproper lighting was my main problem, and the lighting on this is excellent. Also I was concerned that the lense was not glass, nor that the handle was not angled for a proper grip. Both concerns were unfounded. The construction is solid, and I am very pleased with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Larry L. Emsweller",
      "helpful_votes": 168,
      "publication_date": 20181028
    },
    {
      "title": "Great for small print",
      "text": "Ordered these to help my mother who has macular degeneration. She has a hard time with seeing a lot of print of medicine bottles, coupons etc. With the bright lights and magnification these have done a good job of making is easier on her to read. Normally I would help her with what she couldn't see but since buying this she hasn't had to ask. She has been using these everyday and talks about how much she loves them. update dec 16 2019: My mom has still been using this everyday for almost a year, works just as good as day one with no issues. Planing on buying another one for my grandmother this year.",
      "rating": 5.0,
      "verified": true,
      "author": "Splinter",
      "helpful_votes": 132,
      "publication_date": 20190225
    },
    {
      "title": "Excellent for Elderly Use",
      "text": "I purchased the MagniPros 3x Large Wide Horizontal Handheld Magnifying Glass for my 95 year old Dad. He has limited vision especially regarding newsprint and other small print. The magnifier is perfect for him. He really likes the illumination, which is even and really helps him in reading. The horizontal glass enables him to read more text through the lens. He can turn the lights on and off and also dim them, but he typically just keeps them on full illumination most of the time. The magnifier is fairly light weight compared to other magnifying glasses, even with the larger lens, which makes it easier to hold for longer periods of time. We’re very happy with our purchase. Tammy Chambless",
      "rating": 5.0,
      "verified": true,
      "author": "T. Chambless",
      "helpful_votes": 119,
      "publication_date": 20181219
    },
    {
      "title": "Great for Reading Books",
      "text": "My mother has macular degeneration. This product works great for reading books! Learn from my errors. If you're getting a magnifying glass for someone with macular degeneration, you don't want a magnification that's too high. They can only see one word at a time and it makes for extremely slow reading. I bought my mother a 20x magnification so she could read books. 20x is too high a magnification for reading. It's great for reading pill bottles, but bad for reading books. The second thing I bought her was the Large Ultra Bright Handheld Reading Magnifier (3x Magnification) with 4 built in LEDs. This one works great for reading!",
      "rating": 5.0,
      "verified": true,
      "author": "L. Plummer",
      "helpful_votes": 177,
      "publication_date": 20161021
    },
    {
      "title": "Worth Every Penny!",
      "text": "This is a really nice solution to the slow creep of loss of eye sight. It's light weight but solidly made and easy to hold in my hand. I love the dimmer light feature that allows me to select the right level of light I need. I looked over several different brands when deciding to buy a lit hand held magnifying glass and I am really glad I choose this one! My grand daughter had fun playing with it too, when she came over. :D",
      "rating": 5.0,
      "verified": true,
      "author": "C. J.",
      "helpful_votes": 132,
      "publication_date": 20180109
    },
    {
      "title": "Very clear without wavy view - even though it reads a complete page width!",
      "text": "I've looked at cheaper wide magnification products and was very disappointed in \"wavy\" distortions that made reading difficult. Although this product allows you to read the entire width of the page without moving the glass there are NO DISTORTIONS!!! Not sure how they accomplished this for a non-round lens but they did it superbly. And the light is VERY BRIGHT making reading in low light very easy. And because the light intensity is adjustable you can dim it to reduce eye strain when needed. VERY HAPPY WITH THIS PRODUCT. [Paid full price and provided no support by manufacturer in case you are wondering if this is an honest review]",
      "rating": 5.0,
      "verified": true,
      "author": "Judy Roberson ",
      "helpful_votes": 36,
      "publication_date": 20180906
    },
    {
      "title": "THE Perfect Birthday Gift for a 100-Year Old Librarian With Failing Sight",
      "text": "We have a dear great-aunt who is nearing her 100th birthday, but whose eyesight is rapidly failing. She was once a librarian, treasures books and loves to read, and is still sharp as a tack, but could no longer read--until we bought her a MagniPros 3X. She cannot write this five-star review--but we gladly can do so for her!",
      "rating": 5.0,
      "verified": true,
      "author": "Columbus, OH",
      "helpful_votes": 148,
      "publication_date": 20170115
    },
    {
      "title": "My new one and only magnifier from now on",
      "text": "My friend had ordered this item a couple of weeks ago and loved it. So I ordered it to pass on to a friend of mine. When it arrived and I put in the batteries and practiced with it, I decided to keep it for myself and I will order another one for my friend. I like the fact that the lights can be dimmed as you don't always need all that brightness. I definitely recommend this product. I am going to replace all the other magnifiers I have laying around with this one.",
      "rating": 5.0,
      "verified": true,
      "author": "Diana Lee Cross",
      "helpful_votes": 37,
      "publication_date": 20190126
    },
    {
      "title": "A FINELT CRAFTED AND FUNCTIONAL ILLUMINATED MAGNIFIER",
      "text": "I have purchased many items using Amazon, but your MagNiPros hand illuminated Magnifier \"LED MAGNIFIER\" has been the best purchase of all. The 2 1/2 by 4 inch magnified lens with variable LED illumination has allowed me to see and read print as if I had normal vision. I have AMD, a visual defect found in the senior age group, so your magnifier has been a true blessing. I feel that it truly outshines all the other choices I have seen offered .. Five Stars for great work and a great product. P. Andrus",
      "rating": 5.0,
      "verified": true,
      "author": "Peter F. Andrus",
      "helpful_votes": 39,
      "publication_date": 20190222
    },
    {
      "title": "Another Quality Product",
      "text": "This works very well. I was surprised at how light it is having batteries and lights. It is easy to hold for long periods and the ability to set the light level is a real plus. The lense does not seem to have the edge distortion that some magnifiers have. As for the acrylic lenses, what's the issue; most corrective eye lenses are made of the same stuff. Glass lenses would make this too heavy to hold for long. I am more than satisfied and would recommend to anyone wanting a lighted reading magnifier.",
      "rating": 5.0,
      "verified": true,
      "author": "C. M. Guzowsky",
      "helpful_votes": 37,
      "publication_date": 20190210
    },
    {
      "title": "Terrific magnifying glass, lighting works perfectly.",
      "text": "Terrific magnifying glass. A bit bulky, would be nicer if somehow it could rest on the page (maybe I'll make a little wire bracket to do this), but this is by far the best tool of it's kind I've ever used. I bought it to read the tiny print in tour guide books 5 point type on maps. It's perfect. The lighting is even, completely adjustable. As a backpacker every ounce counts, but this is definitely going everywhere I go.",
      "rating": 5.0,
      "verified": true,
      "author": "W. N.",
      "helpful_votes": 38,
      "publication_date": 20180212
    },
    {
      "title": "Light weight and convenient",
      "text": "Given to a lady with eye problems. She had three other magnifying aids but preferred this to each of the others.",
      "rating": 5.0,
      "verified": true,
      "author": "C. del Uno",
      "helpful_votes": 90,
      "publication_date": 20151026
    },
    {
      "title": "Absolutely fantastic and I do mean fantastic",
      "text": "These are fantastic. I got one for my 94 year old mother and she can actually read through it. She has macular degeneration and glaucoma and cannot read the buttons on her toaster oven or her microwave and this is very very handy. In fact I liked it so well I got one for myself. Believe it or not I'm actually thinking about getting another one for her so she can have one in the kitchen and one for her TV Guide.",
      "rating": 5.0,
      "verified": true,
      "author": "Dottie",
      "helpful_votes": 40,
      "publication_date": 20170507
    },
    {
      "title": "Well lit and crystal clear.",
      "text": "This is an excellent lighted magnifier. Large size works well for newspapers and maps. Lights are nice and bright. Holding this about 4\" from surface works well and still nicely lights the surface. The lens is very clear and gives sharp image. Only suggestion I would have is to move the light switch to different location. When you hold this as shown in the photo (most natural way to hold it) the light switch is under the thump which makes it easy to accidentally turn it off while you are holding it over page to read. You just have to pay attention to not accidentally turn the lights out wile you are using it. All in all, excellent magnifier.",
      "rating": 5.0,
      "verified": true,
      "author": "Sheryl F.",
      "helpful_votes": 44,
      "publication_date": 20170213
    },
    {
      "title": "Distorted lens",
      "text": "I really got excited to purchase this great looking magnifying glass but to my dismay, the lens was distorted even worse than my cheap plastic one. I had to return it.",
      "rating": 1.0,
      "verified": true,
      "author": "Max Oliver",
      "helpful_votes": 18,
      "publication_date": 20191023
    },
    {
      "title": "Works ok but concerns",
      "text": "This magnifier does as intended with four LED lights to turn on as needed. But there are concerns. One is the magnifier \"glass\" is plastic and has some waviness in the viewing; a bit annoying but still works. The other is about the light switch which can be turned on with very light pressing. This has resulted in one instance so far where the three AAA batteries in the handle were run down when the magnifier had been put away in the provided faux leather case with the light inadvertently turned on. The case is a big plus, however, for storing in my car where it is quite useful as needed there.",
      "rating": 3.0,
      "verified": true,
      "author": "Don Dittmer",
      "helpful_votes": 46,
      "publication_date": 20170315
    },
    {
      "title": "MagniPros 3X large wide horizontal handheld magnifier",
      "text": "Disappointing 3X was no more than a 1.75X diopter magnification beautifully constructed. You need a 5X diopter wanting to see a 2.25X in magnification. .",
      "rating": 1.0,
      "verified": true,
      "author": "Harry A",
      "helpful_votes": 24,
      "publication_date": 20180704
    },
    {
      "title": "Total rip off",
      "text": "The view through the lens is very wavy and makes reading very difficult and causes dizziness. Total garbage product. Rip off",
      "rating": 1.0,
      "verified": true,
      "author": "Basam S.",
      "helpful_votes": 18,
      "publication_date": 20181101
    },
    {
      "title": "worst magnifier ever",
      "text": "worst ever. LED will not stay on and flickers. Can't read a standard size printed book. Magnification is non existent. General comment: more and more I'm getting knockoffs from China that are far inferior to the original designs.",
      "rating": 1.0,
      "verified": true,
      "author": "Steven Bernard",
      "helpful_votes": 13,
      "publication_date": 20190311
    },
    {
      "title": "Good idea not well executed.",
      "text": "I was really excited about getting this because of the light around the lens. Nothing like a medicine bottle with important instructions in 2-point type. Then there's electronic equipment with black letters stamped on black plastic. The magnification and light help greatly, but it feels like the magnifying lens is made of cheap plastic with a lot of distortions built in. A day or so after getting it, there was a scrape on the lens and it had only been in its bag. You also have to be careful sliding the device into its bag because the sides of the bag can rotate the light on and you won't know it until you get it out next time.",
      "rating": 3.0,
      "verified": true,
      "author": "ShoppingGeek",
      "helpful_votes": 4,
      "publication_date": 20191117
    },
    {
      "title": "Terrific Tool for the Bee Yard",
      "text": "The packaging in itself is impressive. This manufacturer truly cares about the customer. I purchased this magnifier to help me with my beekeeping tasks. I am excited to begin using it to look for the Queen and her eggs. The kit comes with a satin bag to store the magnifier, soft cloth to clean it and you can turn on the light to illuminate dark places in the hive!",
      "rating": 5.0,
      "verified": true,
      "author": "Wendolyn",
      "helpful_votes": 5,
      "publication_date": 20190407
    },
    {
      "title": "Great For Reading A Map, Not Books",
      "text": "Bright light. Nice design. However, this product selection for reading a book wasn't the best solution -- for me. Awkwardness involved when trying to hold this item and a book at the same time while trying to read it, not to mention the hand becoming tired after holding glass for an extended period of time. Not sure about others but I'm not a speed reader and trying to grip this magnifier for an hour to read a book isn't an option for me. DH inherited yet another purchase from my Amazon orders. At least it's being used.",
      "rating": 3.0,
      "verified": true,
      "author": "AmyTexas67",
      "helpful_votes": 2,
      "publication_date": 20200508
    },
    {
      "title": "GREAT PRODUCT!!!",
      "text": "My husband has macular degeneration and cannot read ANY SMALL PRINT. He watches college basketball and cannot see the schedules in the newspaper. Also, writing checks, etc is a chore for him, but these wonderful MagniPros glasses with anti-glare and dimmable LEDS are absolutely wonderful. The LEDS are all around the glass and it is wonderful for him. We are very thankful for these wonderful glasses. Thank you so much for asking and we hope many others will benefit from this great product. Thank you for asking. Amazon is fortunate to have you as a vendor. Anita",
      "rating": 5.0,
      "verified": true,
      "author": "ANITA",
      "helpful_votes": 0,
      "publication_date": 20200210
    },
    {
      "title": "Lens has distortion; very easily scratched; Brightness control doesn't work properly",
      "text": "The lens is lightweight because it's polycarbonate plastic, but it scratches easily. The lens has obvious distortions in the image quality. It's not a uniform image, but wavy. The brightness control on the light is not \"dimmable\". Instead, it's off, and then suddenly jumps up to full brightness. There's not a continuous variation. If it's going to work this way, we'd be better off with a simple ON/OFF switch, which would be easier to operate.",
      "rating": 2.0,
      "verified": true,
      "author": "TreeDoctor",
      "helpful_votes": 2,
      "publication_date": 20190922
    },
    {
      "title": "Super-bright lighting, crisp lens, nice to hold",
      "text": "My eyes are not what they used to be. Having a big, bright, rectangular magnifying glass on my desk is invaluable. This one meets my criteria: it's large, has high magnification, puts out lots of bright LED light, and has a convenient shape that is also comfortable to hold. The only flaw I see is that the rheostat (knob) that controls brightness is kind of \"jumpy.\" The light is off, dim, then *bright* without much gradation in between. This could be an imperfection in the unit I received rather than a general feature of this magnifying glass.",
      "rating": 4.0,
      "verified": true,
      "author": "Mysterious-Trousers",
      "helpful_votes": 0,
      "publication_date": 20200804
    },
    {
      "title": "... function properly after only a few weeks piece of crap looking for someone who makes a similar item that ...",
      "text": "Had it for a short time second one I have purchased and the light gives out again in the same way as the first battery compartment is cheap and on off switch will not function properly after only a few weeks piece of crap looking for someone who makes a similar item that works and the light will not give out after only a few weeks Do not purchase Anna Page",
      "rating": 1.0,
      "verified": true,
      "author": "A. Page",
      "helpful_votes": 16,
      "publication_date": 20160815
    },
    {
      "title": "rectangular shape leads to distortion.  3X magnification is disappointing.",
      "text": "Overall, I like the concept of the product. I like the idea of the rectangular shape. I like the handle. It is easy to hold. I like the dimmable lights. The 3X magnification is rather disappointing. It does not provide very much magnification. The rectangular lens shape leads to noticeable distortion. This is a Christmas gift for my wife. She may decide to return it due to the 3X issue not providing sufficient magnification for her needs AND because of the rather noticeable distortion created by the rectangular lens. My old Bausch and Lomb (non-lighted) magnifier does a much better job.",
      "rating": 2.0,
      "verified": true,
      "author": "RL",
      "helpful_votes": 0,
      "publication_date": 20191203
    },
    {
      "title": "Shape and lights are the best features",
      "text": "Bought this for my mom who not only has trouble seeing, but needs a lot of light plus she has hand tremors. This has allowed her to read again. She loves it so much, she had me get one for her elderly neighbor. She's gone thru lots of batteries since her tremors keep her from feeling the 'click' of turning the lights completely off. The dimmer is a good feature but in her case, she turns them down so does not see they are still on, so does not get them completely off all the time. She's aware and works at it now, so its better.",
      "rating": 5.0,
      "verified": true,
      "author": "Peggy S.",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "Bright lights and clear glass!",
      "text": "This product is great for anyone, but especially helpful for the elderly who need help with their vision. My father-in-law and mother-in-law, who are in their 90s, at first didn't think they would want to use the magnifying glass. But after trying it and seeing what a difference it made for them, to be able to read comfortably, they now use it all the time. Even needed to get two of them so they can each use one at the same time. The lighting is adjustable, but they like to use it on the brightest setting. The weight is fine too, even though they don't have a lot of hand strength.",
      "rating": 5.0,
      "verified": true,
      "author": "Varda",
      "helpful_votes": 0,
      "publication_date": 20190506
    },
    {
      "title": "The Worlds best Magnifying Glass!",
      "text": "This is without a doubt the best magnifying glass I have ever owned, and I have been looking for a magnifying glass I could use for sometime. I use it daily when I need to read printing that is to small for my tired eyes. I have been suffering with my eyesight each year as I get older. This magnifying glass is very helpful and enables me to read things I have trouble seeing. I highly recommend it to anyone who has a problems reading small print. The lights are an enormous help and a bonus that other magnifying glasses do not have.",
      "rating": 5.0,
      "verified": true,
      "author": "Buddy W. McGuire",
      "helpful_votes": 0,
      "publication_date": 20191029
    },
    {
      "title": "Not a useful magnifier for someone with macular degeneration.",
      "text": "I purchased this item for my 86 year old mother who has macular degeneration. Unfortunately, it is my opinion that this product is not appropriate for a person with macular degeneration. Although my mom can see through a magnifying glass to some degree, this magnifier didn't seem to be any better than ones of lesser value. I am currently waiting on the vendor to issue me a return slip so that I can be reimbursed for the purchase.",
      "rating": 2.0,
      "verified": true,
      "author": "Maria ",
      "helpful_votes": 5,
      "publication_date": 20190305
    },
    {
      "title": "Very low quality for high price",
      "text": "This magnifying glass is a disappointment. Obviously, it is not cheap, yet the level of distortion and waves that occur as the glass moves across the viewed object or material is significant. If a vendor is going to have something made in some third world country for pennies and then seek to sell it for $25, it should at least spend some of that money on quality control. As for the light, the dimmer switch does not lower or heighten the light in any progressive or uniform fashion. This feature matches is consistent with the quality of the lens. I would expect that a fair price for the overall quality of this product is about $5 to $7.",
      "rating": 1.0,
      "verified": true,
      "author": "John R.",
      "helpful_votes": 3,
      "publication_date": 20200613
    },
    {
      "title": "Nothing I Don't Like About It!!!!",
      "text": "This MagniPros 3X Magnifying Glass came today. I couldn't wait to open it up. Was packaged very well and the delivery was fast. It has a nice little bag and cleaning cloth also. It takes 3 AAA's batteries and who doesn't have those laying around? OMG....the brightness is wonderful which you can adjust from the side. It's not heavy. This review is done by a 70 + woman who has eye issues and has had eye surgery. I am Very Happy with this product! It's the best magnifying glass out there!",
      "rating": 5.0,
      "verified": true,
      "author": "HR from FL",
      "helpful_votes": 0,
      "publication_date": 20190124
    },
    {
      "title": "The Best Choice for practical convenience and efficiency",
      "text": "We are so pleased with the MagniPros 3X , we plan to buy several more. We purchased it for my husband's sister who has Macular Degeneration. My husband wants one to help him with jigsaw puzzles. Also a friend who has Macular Degeneration tried it and said she wants one because the viewing area is wider than her round magnifier. She also thought it was more helpful than the other magnifier we purchased which has greater magnification. The design is user friendly for holding the device and reading. I sincerely thank you for making this product available at a reasonable price and making life more pleasant for vision impaired loved ones.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190207
    },
    {
      "title": "Wow!!",
      "text": "Wow!! I didn't think I needed this when I started raising caterpillars. They're so tiny make them hard to see until they grow. And they blend in with the leaves. So I've been using this everyday!! I also get a closeup of unwanted few pests on leaves, and I can squash them with gloves on before they multiply. This is a lifesaver! Excellent product!! Definitely keeping it!! Thanks! 😊 Bonus: I hardcore dropped the magnifying glass on hardwood floors on accident, but the screen did not shatter!!! Only the batteries came out. But that's totally fine. The screen didn't break!! Amazing!! Extremely durable!! 😀",
      "rating": 5.0,
      "verified": true,
      "author": "C & A",
      "helpful_votes": 0,
      "publication_date": 20191010
    },
    {
      "title": "Brilliant and Clear",
      "text": "I have a bad habit of writing a lot of notes (well, that's the good part), but VERY SMALL! So, I frequently find myself trying to figure out what I wrote. Or, with all those new products with the tiny 2-point font Chinese instructions, who can read that? To the rescue is this magnifier. I will just say that the light of this, which you can adjust by a dial from zero to slight to medium to high, will blow you away! Beautiful product, so I've gone and ordered a second one for my lower floor. If I were truly wealthy, I would probably buy at least a dozen. Great product!",
      "rating": 5.0,
      "verified": true,
      "author": "Dr. Michael W. Ecker",
      "helpful_votes": 0,
      "publication_date": 20190405
    },
    {
      "title": "Excellent in an office for reading the fine print in numbers and agreements..",
      "text": "Essential in the office for reading fine print columns of numbers, and agreements, on paper and without using the light, on the screen, to prevent costly mistakes. The anti-reflective glass is a must in an office with ceiling lights. Being able to dim the very bright light is critical when that much light is not needed. I prefer the battery model because there may not always be the right USB connection to plug into, for instance when doing research in a library. But if this is a permanent fixture on the desktop, the rechargeable model saves money and batteries.",
      "rating": 5.0,
      "verified": true,
      "author": "Lynn",
      "helpful_votes": 0,
      "publication_date": 20200917
    },
    {
      "title": "Love This Product",
      "text": "Can easily read sentences with this. Light can get to Very bright. 3 AAA batteries are easy to install. Easy to hold. Am updating my review. This Really works GREAT !!! Sentences are SO easy to read with this.and Bright light Really helps. People with vision problems should get this !!! Just an update. This product is Fantastic !!! With the light getting so bright, it makes it really easy to read the smallest writing. I recommend this product to anybody with vision problems. It has helped me a lot !!!",
      "rating": 5.0,
      "verified": true,
      "author": "no name",
      "helpful_votes": 0,
      "publication_date": 20200711
    },
    {
      "title": "Just what I need to read effortlessly!",
      "text": "At age 70, I suddenly noticed that print and directions in books, on product and on signage in general - somehow got smaller and smaller and smaller : ) - yes, eyesight doesn't always age gracefully. That said, with this well-made, light-weight, effective devise, small print doesn't defeat me at all. I can now read the teeny print on the back of medications and all manner of household products and foodstuff. Ditto for ease in reading print in books. This is a bargain - very handy and easy to use and very effective - definitely worth the purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "DW",
      "helpful_votes": 0,
      "publication_date": 20200813
    },
    {
      "title": "If you're vision is decreasing,  this little tool will become your friend!",
      "text": "Due to cataracts and mecular degeneration, my vision isn't very good. Reading is difficult so I shopped around online looking for just the right magnifying glass. I'm so glad I ordered the MagniPros 3X.....it's wonderful and has made my life so much easier. I can read even the smallest print with no problem. When I saw it had a light I thought \"I don't need that feature\", but I use it all the time! Also, it's a comfortable weight and easy to hold onto. I'd be lost without this device. I've used others, but this is by far the best. If you're looking for a magnifying glass, do yourself a favor and order this one.",
      "rating": 5.0,
      "verified": true,
      "author": "GRACE",
      "helpful_votes": 0,
      "publication_date": 20191128
    },
    {
      "title": "Well made. Nicely balanced. Easy to use.  Easy to change batteries",
      "text": "I have used a round fairly long plastic magnifier with lights I bought several years ago. It has worked fine but the visual area is not very big, it is fairly heavy and the amount of light cannot be adjusted. This magnifier is wonderful. It is very well made. Nicely balanced and easy to hold and use. Very easy to change batteries - a very user friendly battery compartment, and on on and off and light adjustment It is so easy to use. It came with a soft drawstring slip sleeve to house it in when not in use, to keep it dust free. I highly recommend this magnifier.",
      "rating": 5.0,
      "verified": true,
      "author": "Oceans",
      "helpful_votes": 0,
      "publication_date": 20200427
    },
    {
      "title": "Great magnifier",
      "text": "I bought one for myself for reviewing blue prints and construction documents. It's really well made with a large lens and adjustable lighting level. When a friend used it at the office, he was so impressed I bought him one too. It's very easy to use, has great optics and the lens is nice and large that it covers a good portion of the paper. It comes with a protective vinyl sleeve to keep it scratch and dust free. I highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Dasher",
      "helpful_votes": 0,
      "publication_date": 20200205
    },
    {
      "title": "lighted magnifier",
      "text": "I bought this to put into my husband's tool box. The pertinent numbers and other information on the parts he installs in his job are so small that even the younger eyes cannot make them out. This allows him to get the information that is required for the paperwork portion of his job. Pretty sure that the other engineers are borrowing it.",
      "rating": 5.0,
      "verified": true,
      "author": "F. Gast",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "Very useful for bookworms!",
      "text": "I love to read and this magnifier is so useful. I like to read nonfiction which means a lot of what I read has maps, charts, graphs and tables. These graphics are often in smaller font and/or lighter, especially when viewed in an e-reader. This is where the magnifier really helps. I like the ability to adjust the lighting level or even just leave it off, depending on ambient lighting. The oblong shape is way more useful than a round magnifier when scanning across or down a page. I wish I bought this a long time ago!",
      "rating": 5.0,
      "verified": true,
      "author": "KLB",
      "helpful_votes": 0,
      "publication_date": 20190605
    },
    {
      "title": "Love This Magnifier!!!!!!",
      "text": "This is the 2nd one I have ordered. It's a fantastic magnifier. I can read the teeny tiny print on bottles and such, as I can't with my prescription glasses. I can really see detail in crafts better and when painting or drawing. I got my aunt one in Jan of 2019 and she loves it. She only has 90% vision in one eye. She loves reading the paper and this magnifier fit the bill to a T. I love the way you can dim or brighten the light and you can read a paragraph instead of scanning back and forth. I would give it 10 stars if I could!",
      "rating": 5.0,
      "verified": true,
      "author": "chubby58",
      "helpful_votes": 0,
      "publication_date": 20200902
    },
    {
      "title": "I can read in bed again!!",
      "text": "Fantastic product! Sadly, my eyes are paying the price from chemotherapy treatments and, of course age. The KJB in my pictures is a teeny 6 pt font and unreadable until now. I live the adjustable light and it’s lighter than I thought. I can enjoy reading in bed again! Included a bonus storage bag, cleaning cloth, and wallet magnifying card, SO NICE! Keep in mind that it takes 3 AAA batteries if you want to use the LEDs, which seems to account for most of the weight, such as it is. I would definitely buy this one again!",
      "rating": 5.0,
      "verified": true,
      "author": "1611KJVBIBLETop Contributor: Coloring",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "This magnifying glass makes reading much more comfortable",
      "text": "Recent cataract surgery that did not go exactly as I had hoped has impaired by prized close up vision that I used to have that enabled me to read comfortably without glasses. I read in bed on my side so wearing reading glasses is uncomfortable and I have found this magnifying glass to be just the thing. I like the built in LED lights which mean I do not need a bright overhead light and it is lightweight so easy to hold. I also liked the message I got from the seller letting me know how they started their American owned company.",
      "rating": 5.0,
      "verified": true,
      "author": "Llini Ugaz",
      "helpful_votes": 0,
      "publication_date": 20190805
    },
    {
      "title": "Great magnifier! Lightweight & good size",
      "text": "The handle is easy to hold. It's lightweight, which is nice especially if holding it for more than just a minute or two. I have magnifiers without a light but this one with the light is more helpful, and it's great that it lights up all the way across instead of just on one end. It's also super easy to adjust the lighting level, and I appreciate that it's adjustable instead of only on or off. I also like having the storage pouch to help keep it from getting scratched. I've not used it for a long time yet so I'm unsure how the batteries will hold up. This has been a wonderful magnifier and I'm happy I have it.",
      "rating": 5.0,
      "verified": true,
      "author": "The Cat-Tribe",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "Best magnifier I've found yet",
      "text": "I have a lot of magnifiers. The best one I had before worked well, but it was too small to read an entire line of text in a book. I wanted something larger and found this one. This one works the best of all that I have used. The light is actually too bright and has to be dialed back most of the way or it washes out the page. The handle could be thinner, and could be if only two batteries were needed instead of three. I'll buy another one to have as a back-up.",
      "rating": 4.0,
      "verified": true,
      "author": "LeoB",
      "helpful_votes": 0,
      "publication_date": 20200816
    },
    {
      "title": "Very clear and well lighted!",
      "text": "For me this greatly helped me to read and see a book with small print, an older one with the yellowing page! The light was clear, strong and wonderful... Years ago my wrist and hand were injured in a car accident so it is proving a bit heavy for me to hold above the page for more than several minutes. The page magnifier of this same company (MagniPros) that has the light is what i will hope to get next as it is bigger and a bit lighter. i am happy to find this! Thank you!",
      "rating": 4.0,
      "verified": true,
      "author": "Jin",
      "helpful_votes": 0,
      "publication_date": 20200517
    },
    {
      "title": "My Mom is Thrilled....works great!",
      "text": "My Mom is thrilled with this magnifier. She is able to see again and we did not have to cancel the newspaper yet. Still working with her Drs to see what they can do to help with her Macular Degeneration. It's sad. This has helped her stay on top of things...somewhat. Truly an 89 year old is thrilled that she can see again and read an entire sentence vs just one word.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Barry",
      "helpful_votes": 4,
      "publication_date": 20170210
    },
    {
      "title": "ABSOLUTELY the way to go",
      "text": "If you are looking for something to assist you in reading books, newspapers, instructions or ingredient labels this LED equipped rectangular shaped magnifier is ABSOLUTELY the way to go. I previously purchased the highest rated magnifier of this type on Amazon, it’s round and that was a mistake. Very happy with this unit.",
      "rating": 5.0,
      "verified": true,
      "author": "Ken Saint John",
      "helpful_votes": 0,
      "publication_date": 20181206
    },
    {
      "title": "Every house needs this handy tool!",
      "text": "I just got this a few days ago, and I've literally used it at least 10 times! It's good for getting splinters out, reading fine print, looking at details of something tiny... We are putting together a 1000 piece puzzle and it makes it so much easier to see little details. I also play a game on my phone that I need to see little things, and even with my glasses on it's hard to see, so I just use this without the light. I love the little travel magnification strip that came with it to. I'll keep that in my purse for going shopping and to restaurants! LOVE THIS!!! It's a great gift to give too!",
      "rating": 5.0,
      "verified": true,
      "author": "M. Strabala Parker",
      "helpful_votes": 0,
      "publication_date": 20200424
    },
    {
      "title": "Superb Magnifying Glass",
      "text": "This item was exactly what I was looking for! The magnification is clear and the adjustable lighting is easily controllable for use depending on need and time of day. I give MagniPros 5 Stars for creating a useful product that allows me to continue working with fine items as my vision changes with age. The handle was a bit wide to grasp onto because it holds the battery compartment...but barely. This would not be much of a discomfort for a larger hand. A+",
      "rating": 5.0,
      "verified": true,
      "author": "Jungle King",
      "helpful_votes": 0,
      "publication_date": 20200926
    },
    {
      "title": "Practical and the light really helps!",
      "text": "I'll admit, I'm not a Millenial, but the small print seems to be getting ridiculously smaller all the time. Trying to read the ingredients to be sure there is no additive that I might react to, in food or cosmetics, was beyond me. This magnifying glass with a very useful light really changed that. I just ordered a 2nd one to keep in my purse, so I can use it while shopping or the office, and still have one at home. Because sometimes you need to read the small print.",
      "rating": 5.0,
      "verified": true,
      "author": "Andy",
      "helpful_votes": 0,
      "publication_date": 20200614
    },
    {
      "title": "Not good",
      "text": "It is not good, all lights from windows, lamps etc. effect it. Does not cover much, very unhappy with it.",
      "rating": 1.0,
      "verified": true,
      "author": "\"Mary's brillant opinions\"",
      "helpful_votes": 4,
      "publication_date": 20191230
    },
    {
      "title": "On/Off Switch Has Failed",
      "text": "Magnipro on/off light switch doesn't turn off light. The light switch wheel turns but doesn't affect lights. It was purchased one year ago this May in 2019 and it worked fine until now (05/01/2020). The switch was always difficult to turn off but i could work with it until it failed. Otherwise, the magnifier was good but i do need one with lights.",
      "rating": 2.0,
      "verified": true,
      "author": "M. O. Johnson",
      "helpful_votes": 0,
      "publication_date": 20200501
    },
    {
      "title": "Wish I would have purchased a lot sooner!!!",
      "text": "I have worn reading glasses for over 3 years and no longer feel my yearly check ups make any difference with certain prints so I decided to give this magnifying glass a try and I WISH I WOULD HAVE PURCHASED IT A LOT SOONER!!! What I completely love about it is... YOU can adjust the lighting from dim to bring! A MAJOR PLUS! The anti glare feature is awesome! I promise you will not regret it! It is a nice size and makes a world of difference on small print for someone who is tired of straining!",
      "rating": 5.0,
      "verified": true,
      "author": "Jan4356",
      "helpful_votes": 0,
      "publication_date": 20191018
    },
    {
      "title": "Great magnifying glass",
      "text": "I have purchased two of these. One for myself and a friend. It is the best magnifying glass I've ever had. I do a lot of work and reading that requires magnification. This glass is easy to hold and the having 3x power and the 10 dimmable led lights that are evenly lit are excellent. I have had several types of glasses and this is now my go to. would highly recommend this to anyone looking for a magnifying glass.",
      "rating": 5.0,
      "verified": true,
      "author": "Ret. Trooper",
      "helpful_votes": 0,
      "publication_date": 20200207
    },
    {
      "title": "Great reading device.",
      "text": "Great device for a quick reading tool. I purchased one last week. Thought nothing about showing it my mom and when she saw how powerful, convenient and nice it is, she just got one this week too. I've never seen it's equal. She's always reading something. Thank you and keep up the good work - you obviously have some people around with great ideas and the ability to make them happen. Much appreciated, onlinejason",
      "rating": 5.0,
      "verified": true,
      "author": "Jason Online",
      "helpful_votes": 0,
      "publication_date": 20190818
    },
    {
      "title": "Waste of money",
      "text": "Magnifying is very low, non if placed on top of reading material and left stationary ! Waste of money 👎🏻 Would never buy again, they don’t deliver what they advertise",
      "rating": 2.0,
      "verified": true,
      "author": "VEYE",
      "helpful_votes": 2,
      "publication_date": 20190416
    },
    {
      "title": "Recommended",
      "text": "Attractive and works well. The product comes well packaged. The lights are bright and the handle is easy to hold. The lens is clear and comes well protected with peel-off scratch covers. The magnification is just right for this mostly blind 73 years old man. The little sack that comes with it fits just right. I haven't dropped it yet so we'll have to wait and see how that works out. George",
      "rating": 5.0,
      "verified": true,
      "author": "borobrygmus",
      "helpful_votes": 0,
      "publication_date": 20200911
    },
    {
      "title": "Not powerful enough",
      "text": "The magnifier is high quality. The best feature is the bright, uniform lighting. The issue that I have is that the 3X magnification is not sufficient. I wish it had a slightly higher magnification, maybe 4X or 5X. When i’m reading very small print with 3X magnification it just doesn’t help me enough.",
      "rating": 3.0,
      "verified": true,
      "author": "William E. Erickson",
      "helpful_votes": 0,
      "publication_date": 20190215
    },
    {
      "title": "Worth a strong five stars!",
      "text": "I'm an old guy with glaucoma and have a hard time with small print but my problem has been solved with this particular product.....the 3xdimmable led magnifier. The magnifier size is perfect for reading the newspaper (it covers one column at a time) and has a light built in with thumb control for brightness. For me having light available when needed is the best part. Anyway, it is a great product, well engineered and would be hard to improve on. PS. You will need three AAA batteries",
      "rating": 5.0,
      "verified": true,
      "author": "PAUL",
      "helpful_votes": 0,
      "publication_date": 20190327
    },
    {
      "title": "Delighted with thisprodect",
      "text": "I really like this product. It is easy to hold and I really like the light feature. I was using a smaller magnifying glass before for reading and kept having to move it back and forth across the page. The size of the MagniPros 3X allows ,e to read an entire line without moving it. I received the product in a timely manner. I would definitely recommend this product to others. Good luck with your business!",
      "rating": 5.0,
      "verified": true,
      "author": "Elaine Honecker",
      "helpful_votes": 0,
      "publication_date": 20200905
    },
    {
      "title": "I can see!",
      "text": "This magnifier is a must for \"page reading\". It is easy to hold, great illumination and the entire page feels like it is laid out in front of you. With the current pandemic, I am outside with my dad nightly reading. He usually uses a flashlight. Tonight I gave him the magnifying glass and he loved it. I also enjoyed taking it for a test drive. Our evening was illuminated. Thank you.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark Kantor",
      "helpful_votes": 0,
      "publication_date": 20200830
    },
    {
      "title": "Not your grandmother's magnifying glass",
      "text": "Just what we were looking for. Getting older and having more difficulty reading small print. Overhead lights and table lamps aren't always enough. This provides just the right amount of light (which you can control with the built-in dimmer switch), and it covers enough of the page that you don't have to keep moving it side to side - a real issue with old-style magnifying glasses.",
      "rating": 5.0,
      "verified": true,
      "author": "Orca17",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "Awesome product, great price",
      "text": "Finally a magnifying glass that really works. My mother can finally read books again. It has given her some joy back. We tried three different ones from other sites and they didn’t work very well. These were top of the line great.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer",
      "helpful_votes": 0,
      "publication_date": 20200705
    },
    {
      "title": "Love this but....",
      "text": "I really do like the size of this, the built in light and the handle. I use it for many things, including helping with stamp identification and reviewing construction drawings. Have purchased two of these. However, after a few weeks on one of the units the light is intermittent. I found if you push on the handle a certain way the light will go off. Have purchased two of these.",
      "rating": 3.0,
      "verified": true,
      "author": "Avid Reader - Bear",
      "helpful_votes": 0,
      "publication_date": 20200925
    },
    {
      "title": "Exceptionally Functional Magnifier, Exceeded our Expectations",
      "text": "Excellent image quality with minimal distortion. Large viewing area. Adjustable brightness, which can be very bright, bringing out details. Very light weight, easy to use. Comes with a micro fiber protective pouch. Greatly exceeded our expectations and very highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Steward H.",
      "helpful_votes": 0,
      "publication_date": 20190404
    },
    {
      "title": "Very nice well made product.",
      "text": "I recently received this magnifying glass bought for my home office, even though we have 2-3 magnifying glasses stationed at random places in the house. My husband loved it so much, he confiscated it for himself. We are both seniors and often have a need for a magnifying glass. We love how this is made, the large glass and the light helps ever so much. We have put this in the most central place in the house. We are very satisfied with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "YL",
      "helpful_votes": 0,
      "publication_date": 20200721
    },
    {
      "title": "IT'S A BIG LENS - IT DOESN'T LIGHT UP THE SUBJECT PROPERLY - LENS NOT VERY SHARP - POOR MAGNIFICATION -",
      "text": "THIS LENS LOOKS GOOD, IT HAS A LARGE SURFACE WITH 4 VERY SMALL LED LIGHTS ONE IN EACH CORNER WHICH THEY MAKE THE SUBJECT TO VIEW BRIGHT AT EACH CORNER BUT THE MIDDLE AREA STAYS TOO DARK TO BE APPRECIATED - ALSO THE MAGNIFICATION OF THE LENS IS NOT ENOUGH EVEN WHEN YOU BACK UP THE LENS FROM THE SUBJECT - I USED IT YESTERDAY TO LOCATE A SPLINTER ON ONE OF MY FINGER AND I COULD NOT SEE IT BECAUSE OF THE POOR MAGNIFICATION THE LENS HAS - I DO NOT RECOMMEND THIS LENS -",
      "rating": 2.0,
      "verified": true,
      "author": "Marion Truglio",
      "helpful_votes": 2,
      "publication_date": 20161112
    },
    {
      "title": "Poorly made",
      "text": "Worked great in the beginning although the battery case was very poorly constructed and I had to play with the batteries to get them to connect correctly. It lasted a couple months and then the lights stopped working. Changed the batteries and I can sometimes get it to work if I leave the battery cover off. Very frustrating to have to stop, jiggle the batteries and then have them work a couple minutes and they quit totally. Loved it while it was working but very disappointed at how poorly it was made and how short a time it took to fall apart. Can't recommend due to technical problems and poor quality of construction.",
      "rating": 2.0,
      "verified": true,
      "author": "Health Foodee",
      "helpful_votes": 0,
      "publication_date": 20170224
    },
    {
      "title": "A READER'S DREAM COME TRUE",
      "text": "A pleasure to read with this product, superior to any magnifier that I have ever used. Numerous beneficial features - light weight, one piece, gently curved handle, rectangular lens surrounded by LED lighting, easily adjusted for on/off and brightness level by a smooth thumb controlled switch. Immediately notable is the ability to read the entire width of the page without moving the magnifier. For those of us who need just a little more help for a more enjoyable reading experience this is a must-have, if you also happen to be a coin or stamp collector add a few more stars.",
      "rating": 5.0,
      "verified": true,
      "author": "'Pig William'",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "Cumbersum but does light and magnify.",
      "text": "The light on/off switch is located right next to a right handed person holding the product. Very easy to leave the light on when you put it back in the case. Would also be better if had a stand or feet so one would not have to hold it all the time when in use. Note the picture showing it is held by a left hand. .Put the switch at the base.",
      "rating": 3.0,
      "verified": true,
      "author": "William J. Lynch",
      "helpful_votes": 2,
      "publication_date": 20170129
    },
    {
      "title": "5 stars",
      "text": "My mother who has macular degeneration and is elderly was starting to get discouraged because her eyes couldn't read anymore and I read a review of another lady that bought her mom one and said she had macular degeneration and that it really really helped n it was the best thing she bought so i purchased one n she was right.. my mom uses it all the time fantastic five stars... my only complaint is that this magnifier is so nice that I wish they had a larger one that she could use for reading a book... A book magnifier lol",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle M.",
      "helpful_votes": 0,
      "publication_date": 20200926
    },
    {
      "title": "Great value, well designed and I can see again!",
      "text": "Omg...I can see again. I learned to turn off the very bright lights when using my phone due to glare. Easy enough. The lights are very bright, but dimmable. Well made and comfortable to use. Nice, soft protective bag and a great bonus travel magnifier which I promptly lost, Lol. I'm planning on purchasing some of the other models as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Be Be",
      "helpful_votes": 0,
      "publication_date": 20200506
    },
    {
      "title": "It really works!",
      "text": "This is my third magnifying glass like this. Now I can have one next to my chair, next to my bed, and in my purse. Reading labels written in a small font has gotten harder as I have aged. Being allergic to some ingredients means I must read the labels. The uses for this handy gadget are going to grow on you. I highly recommend this magnifier.",
      "rating": 5.0,
      "verified": true,
      "author": "birdshell",
      "helpful_votes": 0,
      "publication_date": 20200429
    },
    {
      "title": "NOT AS ADVERTISED!",
      "text": "I am very disappointed in this product. The 3X magnification in this product doesn't compare to the 3X magnification of the UltraOptix LED Lighted Folding Magnifier I purchased in January from Amazon. To me this is false advertising as the magnification is NOT 3X. The quality is poor as well. I recommend the UltraOptix magnifier in place of this more expensive piece of junk. I'm returning it for credit as it is completely useless.",
      "rating": 1.0,
      "verified": true,
      "author": "Suzanne S Wood",
      "helpful_votes": 8,
      "publication_date": 20170810
    },
    {
      "title": "I ordered 3!!!",
      "text": "I ordered this for a friend and she loved it so much that when she showed it to me I ordered 2 more (1 for my husband and 1 for myself). This magnifying glass is awesome!!! The light is super bright and you can adjust it to however bright or however dim you want the light to be. I am super happy with this purchase and I know you will be also.",
      "rating": 5.0,
      "verified": true,
      "author": "BuddysMommy",
      "helpful_votes": 0,
      "publication_date": 20200819
    },
    {
      "title": "Finally, a product of quality!!!",
      "text": "I purchased this MagniPro Magnifer x3, w/ LED light, last week. My pkg arrived 4 days earlier than expected. I quickly opened up the package as I need to use this magnifier at my new job (working w/ a boss who writes very small print). This magnifying device is great; it's light weight, has an adjustable light to aid for reading, and best of all, the magnifier works well with fine print. What's also nice is that you can refer to the website for some quick tips and to sign up for the 2 year extended warranty. I definitely recommend this magnifying glass product without hesitation. Big plus: the price is very reasonable for those on a fixed income!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200725
    },
    {
      "title": "Excellent Magnifier",
      "text": "Have just had this for a day or two and so-far it is a great magnifier for these aging eyes. Lighting is adjustable to very bright and it is very evenly dispersed. I like the size as I don't have to keep moving it around every few words. The size is an advantage for viewing but may get a little heavy for extended reading. So far, not an issue. Would recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "RM",
      "helpful_votes": 0,
      "publication_date": 20200426
    },
    {
      "title": "exactly what I need",
      "text": "After successful eye surgery, my sight is greatly improved, but my glasses no longer work for reading. Exentually I will have a new prescription for reading glasses, but meanwhile, this magnifier is a very helpful stopgap, whether I'm using my computer or reding the Sunday paper. I'm sure I'll continue using it for all kinds of small print.",
      "rating": 5.0,
      "verified": true,
      "author": "Diana K. Myers",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "Bright and easy to read",
      "text": "I wear reading glasses but it doesn't compare to the use of this MagniPro. I was able to read the tiny print on the side of the vitamin bottle and by using the brightness feature on the handle, I had no issue at all reading the very fine print. I would recommend this for anyone who needs help with tiny print with or without reading glasses.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda Tarnawskyj",
      "helpful_votes": 0,
      "publication_date": 20200513
    },
    {
      "title": "The light helps immensely",
      "text": "I live in a retirement community where several people have eye problems. When I received my magnifying glass, I showed it to a friend and she asked me to order one for her. Then she showed hers to another resident, and she also asked me to order one for her. All of us are happy with it! I use the magnifying glass for reading my Bible, the newspaper, working puzzles and anything with small print. It is a little heavy and that is my only complaint. Has the manufacturer ever considered putting a magnifying glass on a necklace as a pendant? I would buy that too.",
      "rating": 4.0,
      "verified": true,
      "author": "catsrule",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Does work well",
      "text": "I bought this for my mother, who has macular degeneration. She uses it when she needs to see small details in things, like threading a needle or reading fine print. The light really makes it useful, but be sure when you turn it off that you actually hear it click; otherwise, it might still be, just very dim, and the battery can wear down.",
      "rating": 5.0,
      "verified": true,
      "author": "Meltha",
      "helpful_votes": 0,
      "publication_date": 20200123
    },
    {
      "title": "Life-changing for those with sight issues",
      "text": "My mother has advanced macula degeneration and this magnifier is a GODSEND! She is thrilled that she can see to write checks and pay her bills. Anything that helps someone you love to hold on to some autonomy and independence is a wonderful thing. I just can't say enough about this magnifier, but a HUGE thank you is a start.",
      "rating": 5.0,
      "verified": true,
      "author": "NC Witchypoo",
      "helpful_votes": 0,
      "publication_date": 20200902
    },
    {
      "title": "Small magnifier for coin and stamp work.",
      "text": "I ordered this 3X hand-held MagniPro magnifier to facilitate work on my coin collection. I need a magnifier that provides a bright sharp image of small features of sometimes worn coins. I wanted a magnifier that provide a large image of what is often a small coin. This MagniPro magnifier is ideal for coin or stamp work. It includes bright yet dimmable LED lights around the lens to provide a bright crisp image. It has a large easily grasped handle and is light enough so that it can be easily held. The magnifier requires thee XXX batteries (not included). I strongly recommend this item for any sort coin or stamp work.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "A very satisfactory magnifier",
      "text": "I'm 83 and I have two problems: one is painfully arthritic hands and the other is recently-diagnosed macular degeneration. The unit is not too heavy to hold, but holding onto any device for very long is problematic for me. For short periods, this magnifier is, well constructed, good quality, and meets advertiser's claims.",
      "rating": 5.0,
      "verified": true,
      "author": "Serious reader",
      "helpful_votes": 0,
      "publication_date": 20200919
    },
    {
      "title": "This is a beautiful magnifier, it has a sturdy feel yet is ...",
      "text": "This is a beautiful magnifier, it has a sturdy feel yet is light weight and comfortable to hold. It magnifies clear and bright - thanks to the lights you can switch on and off when needed, It is great for reading maps, but today it seems that so many items have very small print from reading material to package directions so this is a great item for everyone to have in their home - Thank You",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara D. Zambrana",
      "helpful_votes": 3,
      "publication_date": 20160812
    },
    {
      "title": "Wonderful tool for AMD",
      "text": "Bought this for my mom who lives with age related macular degeneration. She has lost the central vision in her left eye and her right eye struggles. This has become a wonderful tool for her to do things like read the hymnal at church! It's light weight and the extra light is so useful. No one product or device will \"fix\" everything for someone with low vision, but rather each device serves specific purposes. I'm so glad I got this for her!",
      "rating": 5.0,
      "verified": true,
      "author": "Leah",
      "helpful_votes": 0,
      "publication_date": 20200618
    },
    {
      "title": "You need this",
      "text": "As much as I hate to admit it, my eyes need a little help beyond prescription bifocal glasses these day. To see the fine print, I need magnification and more light. Darn those forming cataracts. This easy to hold, lightweight magnifying glass does the trick. The built in LED light makes it indispensable! I recommend one for your purse and one for the car.",
      "rating": 5.0,
      "verified": true,
      "author": "Loyal Reader",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "Superb Magnifier",
      "text": "This is one the best magnifiers I’ve owned. The added LEDs make it easier to use under any circumstance but especially at night time. The handle is form fitting and thus easy to hold. The magnifier itself is large enough to cover a great deal of area and the focal point is far enough away from your face to make it pleasant to use. I highly recommend it as a keeper.",
      "rating": 5.0,
      "verified": true,
      "author": "MM Gibbons",
      "helpful_votes": 0,
      "publication_date": 20200406
    },
    {
      "title": "Wow this  Wide Horizontal Handheld Magnifying Glass is the boom",
      "text": "The bright lit-allows me too read the small print on my credit cards. This is amazing. I can read the lines of words in our church sonTg book, because it horizontal I can read ac-cross the page. This is AWESOME!!! Thank you for helping me read small print again..",
      "rating": 5.0,
      "verified": true,
      "author": "its meaalem",
      "helpful_votes": 2,
      "publication_date": 20181018
    },
    {
      "title": "I can see to read again!!",
      "text": "I love everything about this product, the lights are completely adjustable and very bright when turned all the way up allowing you to see extremely well. I purchased this product to help me be able to read again honestly. My vision is not as good as it used to be and I have sorely missed reading books, but then I discovered this little gem 🙂 I am so happy with how easy it is to read books again with this, it's very well made and very easy to hold & is lightweight.",
      "rating": 5.0,
      "verified": true,
      "author": "Tami Reichelderfer",
      "helpful_votes": 0,
      "publication_date": 20190516
    },
    {
      "title": "Virtually No Magnification",
      "text": "This is a beautiful and impressive looking magnifying glass with only one problem: the magnification is virtually non-existent. The seller has declined to issue even a partial refund notwithstanding the fact that the product does not perform as advertised.",
      "rating": 2.0,
      "verified": true,
      "author": "bhlawyer",
      "helpful_votes": 2,
      "publication_date": 20190923
    },
    {
      "title": "Great for Older Eyes",
      "text": "As age advances, the need for magnification and more light increases -- it's just a fact of life. Reading 6-point type is easy with this device. Extra light and a wider view than the traditional magnifying makes it very usable. I purchased three of these so I could have one where I needed it at all times.",
      "rating": 5.0,
      "verified": true,
      "author": "ff5605",
      "helpful_votes": 0,
      "publication_date": 20191228
    }
  ],
  "product_meta": {
    "title": "MagniPros 3X Magnifying Glass with [Anti-Glare & Fully Dimmable LEDs]-Evenly Lit Viewing Area-The Brightest & Best Magnifying Glass for Reading, Low Vision Seniors, Macular Degeneration, Inspection",
    "rating": 4.6,
    "feature_bullets": [
      "★ RECTANGULAR SHAPES THE WAY YOU NATURALLY READ: The rectangular lens is especially design to simulate the way we naturally view things from left to right, the magnifying lens covers large viewing area without having your hands move all the time, lens is measured 4.35\"x 2.7\" and magnifies up to 300%.",
      "★ CRYSTAL CLEAR ACRYLIC LENS: Made out of optical grade acrylic which is lighter and more scratch-resistant & shatterproof than glass while provides the same clarity level. Magnifies up to 3x(300%) without optical distortion. Optimal to enhance reading and viewing very fine details in books, newspapers, magazines, photographs, maps, electronics, miniatures, jewelry, pill bottles, medications, hobbies, models, and crafts of all kinds.",
      "★REDUCE EYE STRAIN & DIMMABLE LIGHTING : This led magnifier is clinically proven to be ideal for anyone who strains their eyes to see words on a page because it magnifies and provides light without glare. The roller dimmer allows you to easily adjust the brightness level(peaks at 600 lumens) with the tap of a finger to achieve the perfect lighting for various tasks.",
      "★ LIGHTWEIGHT & ERGONOMIC HANDLE: Thanks to the special design premium lighter lens it only weighs 6.5oz, in addition, the handle of this LED magnifier is ergonomically designed to grip/hold comfortable for most hands, making it ideal for anyone who loves to read for longer period of time.",
      "★ 10 ENERGY EFFICIENT & LONG LASTING SMD LEDs: Our SMD LEDs are powered by 3 AAA batteries(Not included) and are designed to last more than 100,000 hour. They provide more evenly lit viewing area, our LED lighting will last for more than 20 years without burning out or overheating. Save money and energy while enjoying long lasting bright light."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "10 x 3.5 x 1.25 inches; 7.04 Ounces",
      "Date First Available": "July 25, 2015",
      "Manufacturer": "MagniPros",
      "ASIN": "B012ID4XAE",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Hobbies",
      "Toys & Games",
      "Hobby Building Tools & Hardware",
      "Magnifying Tools",
      "Health, Household & Baby Care"
    ],
    "price": 24.95
  }
}