{
  "website_summaries": [
    {
      "verdict": "This glamorous Cinderella doll will be adored by kids who love Disney princesses.",
      "pros": [
        "Doll is a fun toy on its own or when paired with a Disney dollhouse",
        "Good quality doll that is decently sized – slightly larger than a Barbie",
        "Doll has pretty features and is recognizable as Cinderella",
        "Suitable for kids 3 and up",
        "Other princesses available"
      ],
      "cons": [
        "Only comes with one outfit"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Lovely Rapunzel",
      "text": "Bought this for my 3 year old granddaughter - she LOVES Rapunzel and could not take her eyes off of this doll when she opened her birthday presents. I like the Hasbro dolls. They are more childish looking. Nice size and quality for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "KL",
      "helpful_votes": 10,
      "publication_date": 20160519
    },
    {
      "title": "Six year old approved",
      "text": "I bought this for my Cinderella-obsessed six year old daughter. It's the same kind you can buy at Wal-Mart, but I was able to get it here with a few clicks instead of navigating Wally World. She received Aurora at the same time and now they both sleep in her bed. It is not the same size as a Barbie, so Barbie clothes will not fit. I have seen some clothes made specifically for these Disney Princess dolls.",
      "rating": 5.0,
      "verified": true,
      "author": "Gadget",
      "helpful_votes": 5,
      "publication_date": 20160417
    },
    {
      "title": "Decent Doll",
      "text": "My daughter (5) loves these dolls. They're barbie sized and stand up to a decent amount of abuse. I'm not a fan of barbie products, so these are a great substitute. Even their hair can be combed back to normal (with a little dangler). I catch my 9 year old playing with them at times. For the money, it's a great toy/present. Paid under $10 each for several of them. This one is not as fancy as the rest (but that is her standard outfit) and her face is a bit odd to me... not as innocent looking as the other similar dolls. lol.",
      "rating": 4.0,
      "verified": true,
      "author": "DeWcandles",
      "helpful_votes": 0,
      "publication_date": 20161221
    },
    {
      "title": "Love these dolls",
      "text": "I love these dolls and couldn't beat the price on black Friday. My girls age 6 and 3 love them. I expected them to be cheap plastic but they weren't I was impressed with the quality. They are very durable. My only recommendation would be to keep the rubber band that holds the shoes on on for as long as you can because we have spent a significant amount of time searching for shoes! I was so happy to find a Pocahontas doll since she is one of my favorites. We have all but 1 of these dolls now and love all of them.",
      "rating": 5.0,
      "verified": true,
      "author": "Kim",
      "helpful_votes": 0,
      "publication_date": 20170104
    },
    {
      "title": "Good Toy for the price",
      "text": "My daughter (5) loves these dolls. They're barbie sized and stand up to a decent amount of abuse. I'm not a fan of barbie products, so these are a great substitute. Even their hair can be combed back to normal (with a little dangler). I catch my 9 year old playing with them at times. For the money, it's a great toy/present. Paid under $10 each for several of them.",
      "rating": 4.0,
      "verified": true,
      "author": "DeWcandles",
      "helpful_votes": 0,
      "publication_date": 20161221
    },
    {
      "title": "at best.",
      "text": "I'm really surprised by all the 5 star reviews. This doll doesn't retail for much and I can say, we get what we pay for. Flimsy packaging, shoes that do not stay on AT ALL, flimsy plastic and \"meh\" quality. Mediocre, at best.",
      "rating": 2.0,
      "verified": true,
      "author": "Terry ",
      "helpful_votes": 2,
      "publication_date": 20161219
    },
    {
      "title": "so these are a great substitute. Even their hair can be combed back ...",
      "text": "My daughter (5) loves these dolls. They're barbie sized and stand up to a decent amount of abuse. I'm not a fan of barbie products, so these are a great substitute. Even their hair can be combed back to normal (with a little dangler). I catch my 9 year old playing with them at times. For the money, it's a great toy/present. Paid under $10 each for several of them.",
      "rating": 4.0,
      "verified": true,
      "author": "DeWcandles",
      "helpful_votes": 0,
      "publication_date": 20161221
    },
    {
      "title": "She loves playing with her right alongside her other Disney Princess dolls and was very happy to have this addition to her colle",
      "text": "MY daughter is VERY into Disney princesses lately. This Mulan doll comes exactly as pictured. While her dress seems slightly different from the one I remember from the cartoon movie, my daughter doesn't seem to mind at all. She loves playing with her right alongside her other Disney Princess dolls and was very happy to have this addition to her collection.",
      "rating": 5.0,
      "verified": true,
      "author": "Lydia Goodwin",
      "helpful_votes": 0,
      "publication_date": 20161215
    },
    {
      "title": "Perfect and adorable",
      "text": "Exactly as pictured. One thing to know is the hair on the Disney Shimmer Barbies are not meant to be brushed. My daughter tried and it took half a bottle of detangler and an hour of curling to get it back to normal.",
      "rating": 5.0,
      "verified": true,
      "author": "MizzMeganMae",
      "helpful_votes": 0,
      "publication_date": 20180325
    },
    {
      "title": "Value for money",
      "text": "This is an amazing doll, made of good quality plastic and does not feel cheap at all. I bought all the Disney princess dolls for my niece and she loves all of them. They are good products to play with and is safe for kids. Highly recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Vivek Yadav",
      "helpful_votes": 0,
      "publication_date": 20200301
    },
    {
      "title": "Hasbro did a great job",
      "text": "Hasbro did a great job with these Disney dolls. I felt \"wow\" almost in the same way I felt when I first saw the Animator's dolls in persons. Of course, I was having the prices of the dolls in mind too. The paints on the doll faces are quite good. The head to body proportion is more like that of an young girl. I have bought the entire set.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris M.",
      "helpful_votes": 0,
      "publication_date": 20160220
    },
    {
      "title": "Love the shimmer dolls!",
      "text": "As a Disney lover I was so happy these dolls were on sale and available for Christmas. My nieces and daughter loved these dolls! I would say , I was a little disappointed in the quality of the clothing, however I could not pass up the price. I bought the Rapunzel Doll, Jasmine Doll and Pocahontas. The Pocahontas doll was the best one as she was just beautiful and the level of detail was very well done.",
      "rating": 4.0,
      "verified": true,
      "author": "Heather Terry aka Triplet Mom",
      "helpful_votes": 0,
      "publication_date": 20170306
    },
    {
      "title": "Lovely Jasmine doll!",
      "text": "I bought this for my daughter who's favorite princess is jasmine. Needless to say she loved it! They are nicely made dolls with cute outfits and accessories. Will definitly be getting more of this line for her princess collection!",
      "rating": 5.0,
      "verified": true,
      "author": "kmaebyte",
      "helpful_votes": 0,
      "publication_date": 20160711
    },
    {
      "title": "Adorable",
      "text": "I got this for my 3 year old. We recently watched Pocahontas and she loves it. It used to be my favorite movie, so I wanted to find a toy to commemorate. She loves it. The hair is all over the place and impossible to make smooth again now, but it's still adorable.",
      "rating": 5.0,
      "verified": true,
      "author": "Mya",
      "helpful_votes": 0,
      "publication_date": 20170820
    },
    {
      "title": "Doll",
      "text": "Good Disney toy, clothing is more appropriate on this version than on most of the Jasmine dolls.",
      "rating": 5.0,
      "verified": true,
      "author": "S l b",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "Beautiful!!",
      "text": "Got her in the mail yesterday and I'll say it was well worth the wait :) The only feature missing is the tattoo or mark on her right arm, but other than that, she is absolutely beautiful :) Somehow, she reminds me a little of my old Sun Colors Pocahontas doll from 1995, another treasure :) And since I have the entire Royal Shimmer line (except for Ariel, as I already have an Ariel doll-and she fits right in with the others), I'll definitely say Hats Off to Hasbro. WONDERFUL job!!",
      "rating": 5.0,
      "verified": true,
      "author": "Breanne",
      "helpful_votes": 0,
      "publication_date": 20160322
    },
    {
      "title": "Cute inexpensive doll for preschoolers",
      "text": "Cute doll for preschoolers. Only separate pieces are shoes- these can get easily lost. The arms and legs don't bend at the elbows and knees which would be nice but otherwise easy for kids to move and play with. Heads are strangely large.",
      "rating": 4.0,
      "verified": true,
      "author": "Charleen",
      "helpful_votes": 0,
      "publication_date": 20170409
    },
    {
      "title": "This Pocahontas is beautiful, well made",
      "text": "My little girl has this doll along with several other dolls from this line of Shimmer Disney dolls. I bought two more of these dolls for my little cousins. My husband's side of the family is Native American and it's hard to find dolls that are as well. This Pocahontas is beautiful, well made, and as she is Native American it makes her that much more special to our girls.",
      "rating": 5.0,
      "verified": true,
      "author": "DaisySayWhat",
      "helpful_votes": 0,
      "publication_date": 20160717
    },
    {
      "title": "Missing Shoes?",
      "text": "Doll is fine, and this may not be a big deal for most people, but it doesn't seem to come with the shoes. We got one and thought it was a fluke so returned it for another one that also didn't come with shoes. The box and picture definitely show shoes, and the feet are shaped like there should be shoes, but somehow the shoes didn't make it in the box.",
      "rating": 2.0,
      "verified": true,
      "author": "Elizabeth W.",
      "helpful_votes": 0,
      "publication_date": 20190713
    },
    {
      "title": "pretty princess",
      "text": "We bought this for a little girl who wasn't going to have much at Christmastime. We want one, too! She is very pretty! My husband & I got Pocahontas for our 5-year old daughter & she is equally as beautiful as Mulan! Now we want all of the Royal Shimmer princesses!",
      "rating": 5.0,
      "verified": true,
      "author": "T.C.",
      "helpful_votes": 0,
      "publication_date": 20161229
    },
    {
      "title": "Simply beautiful. What a big surprise for my granddaughter on ...",
      "text": "Simply beautiful. What a big surprise for my granddaughter on Christmas day. She doesn't have and Jasmine dolls so she'll be really excited. The doll seems well built and the clothes are amazing.",
      "rating": 5.0,
      "verified": true,
      "author": "Leslie",
      "helpful_votes": 0,
      "publication_date": 20161213
    },
    {
      "title": "a doll that LOOKS like Merida! The only negative is that her head ...",
      "text": "Finally, a doll that LOOKS like Merida! The only negative is that her head is a bit more wobbly than I'd prefer. It spins backward pretty easily. I think I'm going to use a bit of hair gel to tighten it up a little.",
      "rating": 5.0,
      "verified": true,
      "author": "WaterRedwood",
      "helpful_votes": 0,
      "publication_date": 20160424
    },
    {
      "title": "Great Pocahontas toy!",
      "text": "My daughter loves Pocahontas! This was a great doll to add to her collection.",
      "rating": 5.0,
      "verified": true,
      "author": "Vincent L.",
      "helpful_votes": 0,
      "publication_date": 20200516
    },
    {
      "title": "Great doll",
      "text": "Bought this for my 3 year old daughter. She loves the Disney princesses and I love the price of this line! These dolls are mostly hard plastic. Her hair was very \"tangled\" within a day but my daughter still loves this rapunzel.",
      "rating": 5.0,
      "verified": true,
      "author": "lacee",
      "helpful_votes": 2,
      "publication_date": 20161112
    },
    {
      "title": "Beautiful Doll, though perhaps too beautiful for some",
      "text": "Another beautiful Royal Shimmer doll. While it's a beautiful doll and I'm sure my granddaughter will love it, it doesn't quite look right to me, while not as bad as some of the others Rapunzel seems just a bit too \"made up\" for me personally.",
      "rating": 4.0,
      "verified": true,
      "author": "NMesarch",
      "helpful_votes": 0,
      "publication_date": 20161122
    },
    {
      "title": "Just as described",
      "text": "Arrived as described. Good quality and cheaper than in the stores. Does contain small pieces like the shoes that come off and won't really stay on once the packing is removed. My daughter loves them however. Has very soft long hair!",
      "rating": 5.0,
      "verified": true,
      "author": "Riddle me this",
      "helpful_votes": 0,
      "publication_date": 20170106
    },
    {
      "title": "Just as  described",
      "text": "Arrived as described. Good quality and cheaper than in the stores. Does contain small pieces like the shoes that come off and won't really stay on once the packing is removed. My daughter loves them however. Has very soft long hair!",
      "rating": 5.0,
      "verified": true,
      "author": "Riddle me this",
      "helpful_votes": 0,
      "publication_date": 20170106
    },
    {
      "title": "Good size good product",
      "text": "Wonderful for young girls... My granddaughter loved it very much",
      "rating": 5.0,
      "verified": true,
      "author": "Tatiana",
      "helpful_votes": 0,
      "publication_date": 20200624
    },
    {
      "title": "REALLY GOOD QUALITY.",
      "text": "I was expecting these to be really cheap and cheasy but they are really large and good quality. I thought I would be able to put two of them in a stocking but they are too big.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161127
    },
    {
      "title": "Too my delight, my 4-year-old niece is very into the princesses",
      "text": "Too my delight, my 4-year-old niece is very into the princesses. I wanted to get her one that was new to her - so I bought her Merida & Mulan. She was most excited by the fact Merida has red hair like me - LOL.",
      "rating": 5.0,
      "verified": true,
      "author": "unlimitedHope",
      "helpful_votes": 0,
      "publication_date": 20161216
    },
    {
      "title": "My granddaughter loved it",
      "text": "My daughter specifically asked for the \"shimmer\" version, as the dress is removable, as well as the shoes. I guess some of the other versions only have the skirt removable, or come without shoes.",
      "rating": 5.0,
      "verified": true,
      "author": "gailengineer",
      "helpful_votes": 0,
      "publication_date": 20161211
    },
    {
      "title": "Just as  described",
      "text": "Arrived as described. Good quality and cheaper than in the stores. Does contain small pieces like the shoes that come off and won't really stay on once the packing is removed. My daughter loves them however.",
      "rating": 5.0,
      "verified": true,
      "author": "Riddle me this",
      "helpful_votes": 0,
      "publication_date": 20170106
    },
    {
      "title": "Just as  described",
      "text": "Arrived as described. Good quality and cheaper than in the stores. Does contain small pieces like the shoes that come off and won't really stay on once the packing is removed. My daughter loves them however.",
      "rating": 5.0,
      "verified": true,
      "author": "Riddle me this",
      "helpful_votes": 0,
      "publication_date": 20170106
    },
    {
      "title": "DISNEY DOLLS",
      "text": "This doll was purchased for our six year old grand daughter and she loved it. She made a list and this was one of the many Disney Dolls she now has.",
      "rating": 5.0,
      "verified": true,
      "author": "W.N.",
      "helpful_votes": 0,
      "publication_date": 20170405
    },
    {
      "title": "Just as described",
      "text": "Arrived as described. Good quality and cheaper than in the stores. Does contain small pieces like the shoes that come off and won't really stay on once the packing is removed. My daughter loves her!",
      "rating": 5.0,
      "verified": true,
      "author": "Riddle me this",
      "helpful_votes": 0,
      "publication_date": 20170106
    },
    {
      "title": "Just as described",
      "text": "Arrived as described. Good quality and cheaper than in the stores. Does contain small pieces like the shoes that come off and won't really stay on once the packing is removed. My daughter loves her!",
      "rating": 5.0,
      "verified": true,
      "author": "Riddle me this",
      "helpful_votes": 0,
      "publication_date": 20170106
    },
    {
      "title": "Five stars",
      "text": "Love it got it for a birthday girl who loves mulan",
      "rating": 5.0,
      "verified": true,
      "author": "Angie",
      "helpful_votes": 0,
      "publication_date": 20191112
    },
    {
      "title": "Awesome deal and quality",
      "text": "Very happy with this purchase. Nice quality for the price. Bought the book and DVD to match and it was a great gift for my 5 year old. She loves playing with it and the doll joins her every time she reads the book or watches the movie.",
      "rating": 5.0,
      "verified": true,
      "author": "Kirsten",
      "helpful_votes": 0,
      "publication_date": 20161227
    },
    {
      "title": "Lovely doll, and cannot beat the price",
      "text": "My daughter was beyond thrilled to get this doll on Christmas, and I was thrilled about the price. Who needs to spend $18 on a princess doll when this is just perfect? Very happy mom and kid!",
      "rating": 5.0,
      "verified": true,
      "author": "Holly E. Mays",
      "helpful_votes": 0,
      "publication_date": 20161229
    },
    {
      "title": "Good doll for the price",
      "text": "It was a gift for my granddaughter, along with a couple of other Royal Simmer Princess dolls. She loved it. I thought they were cute, but made fairly cheaply, but they weren't expensive, so I guess there's no complaint.",
      "rating": 4.0,
      "verified": true,
      "author": "Funnybones",
      "helpful_votes": 0,
      "publication_date": 20170101
    },
    {
      "title": "Cute",
      "text": "So glad they have a new Pocahontas doll.. I bought this for my mom and she loved it!! We don't see a whole lot of her and jasmine so I was super excited for them.. These dolls are so adorable",
      "rating": 5.0,
      "verified": true,
      "author": "Page S.",
      "helpful_votes": 0,
      "publication_date": 20160803
    },
    {
      "title": "Excellent value; she loves it!",
      "text": "How do you go wrong with a $5 doll? It's actually very comparable to $30 dolls I've bought. I bought the whole collection for my daughter.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristen Handler",
      "helpful_votes": 0,
      "publication_date": 20170328
    },
    {
      "title": "the doll is so vivid high quality . any little child will love it",
      "text": "so cute in a great package the doll is so vivid high quality . any little child will love it . I got the series cause they were at great add in price and they will make a great gift",
      "rating": 5.0,
      "verified": true,
      "author": "FLOWERPOWERMD",
      "helpful_votes": 0,
      "publication_date": 20161207
    },
    {
      "title": "Perfect Present for a Little Girl",
      "text": "It was a cute Jasmine Doll. My friend's daughter loved it.",
      "rating": 5.0,
      "verified": true,
      "author": "Sabreezy Aint Easy",
      "helpful_votes": 0,
      "publication_date": 20190622
    },
    {
      "title": "Beautiful Jasmine doll.",
      "text": "Jasmine looks beautiful in the shimmer outfit, and her hair is just beautiful. My grand daughter loved adding her to her collection of princess dolls she has.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Vensko",
      "helpful_votes": 0,
      "publication_date": 20160514
    },
    {
      "title": "Who doesn't love a princess?",
      "text": "What could possibly be wrong with a beautiful princess doll? This doll, along with all the other Royal Shimmer Dolls, is adorable, cute and well made. My daughter absolutely loves each and every one of them!",
      "rating": 5.0,
      "verified": true,
      "author": "jro",
      "helpful_votes": 0,
      "publication_date": 20170116
    },
    {
      "title": "There's nothing really wrong with it, but you can't ...",
      "text": "There's nothing really wrong with it, but you can't take her hair down because of a big bald spot. That was a big deal to my daughter.",
      "rating": 4.0,
      "verified": true,
      "author": "Rachel",
      "helpful_votes": 0,
      "publication_date": 20161231
    },
    {
      "title": "Great Product",
      "text": "I bought this for my 4 yr old granddaughter and had it shipped directly to her so I didn't see it before she received the doll. I do know that she loves it and her mom said it was a pretty doll.",
      "rating": 5.0,
      "verified": true,
      "author": "Melanie L. Waidler",
      "helpful_votes": 0,
      "publication_date": 20160730
    },
    {
      "title": "Quality doll, Great price",
      "text": "This is such a great doll. My daughter absolutely loves it, not as tall as a normal Barbie but she is well made. The thumbs stick a little bit when trying to put on the dress but otherwise a nice toy.",
      "rating": 4.0,
      "verified": true,
      "author": "A. Shafer",
      "helpful_votes": 0,
      "publication_date": 20160421
    },
    {
      "title": "Merida Shimmer doll",
      "text": "Very cute Merida doll. I prefer the Disney classic version. It looks more like the movie character's features. But this was worth the price.",
      "rating": 5.0,
      "verified": true,
      "author": "musicfan",
      "helpful_votes": 0,
      "publication_date": 20170429
    },
    {
      "title": "love it!",
      "text": "absolutely love this doll! it made my daughters day to open this on her birthday since she has been wanting a Mulan doll for a while now and has never seen one in stores! very happy with this product!",
      "rating": 5.0,
      "verified": true,
      "author": "Tonilyn Wittmer",
      "helpful_votes": 0,
      "publication_date": 20160430
    },
    {
      "title": "Very beautiful gown. Be aware",
      "text": "My daughter ordered this. Arrived New in the box, very promptly. Very beautiful gown. Be aware, the arms and legs only move at the hip and shoulder (unlike Barbie brand that bends at the knee and elbow also).",
      "rating": 5.0,
      "verified": true,
      "author": "Lali DeRosier",
      "helpful_votes": 0,
      "publication_date": 20170106
    },
    {
      "title": "Good quality",
      "text": "Nice, good quality Mulan doll. Goes well with my daughters Disney doll collection.",
      "rating": 5.0,
      "verified": true,
      "author": "Kailey",
      "helpful_votes": 0,
      "publication_date": 20181105
    },
    {
      "title": "beautiful",
      "text": "very beauty doll. she is super pretty and her hair feels like real hair. its soft and long. the clothing is very nice and super pretty. nicest doll I have ever seen and my daughter loves her.",
      "rating": 5.0,
      "verified": true,
      "author": "Jenene",
      "helpful_votes": 0,
      "publication_date": 20160209
    },
    {
      "title": "Good Condition, Box Was Open",
      "text": "The doll itself is in perfect condition, but I didn't expect her package to be open inside the Amazon box. Still a good value and acceptable for intended purposes.",
      "rating": 4.0,
      "verified": true,
      "author": "Annie09",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "She is happy though so that is all that matters",
      "text": "My 8 year old likes the doll but I dont know, I think her face looks a little weird compared to the other Princess Jasmine dolls. She is happy though so that is all that matters.",
      "rating": 4.0,
      "verified": true,
      "author": "Jennis0212",
      "helpful_votes": 0,
      "publication_date": 20160801
    },
    {
      "title": "Great doll for my granddaughter",
      "text": "Great doll for my granddaughter. She loves to play with her hair. Costume is as it appears and the clothes come off and on easily.",
      "rating": 5.0,
      "verified": true,
      "author": "loveupnorth",
      "helpful_votes": 0,
      "publication_date": 20160524
    },
    {
      "title": "Mulan",
      "text": "Her face is a little off not really Asian but otherwise a great doll",
      "rating": 5.0,
      "verified": true,
      "author": "kela",
      "helpful_votes": 0,
      "publication_date": 20171228
    },
    {
      "title": "Perfectly Pretty",
      "text": "Very pretty Mulan Barbie for a great price, she even has delicate red shoes too. My daughter loves her.",
      "rating": 4.0,
      "verified": true,
      "author": "Island-Mom",
      "helpful_votes": 0,
      "publication_date": 20161214
    },
    {
      "title": "Very nice detail on the dress and doll seems stu I ...",
      "text": "Doll is larger proportioned than expected, especially the head. Very nice detail on the dress and doll seems stu I like the ethnic doll series Disney is putting out at reasonable prices.",
      "rating": 4.0,
      "verified": true,
      "author": "Stephanie Campo",
      "helpful_votes": 0,
      "publication_date": 20160701
    },
    {
      "title": "Exactly what you'd expect",
      "text": "Exactly as expected, the doll was clean and without flaws. She's perfect for an upcoming project. I love the unique head scuplt.",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley",
      "helpful_votes": 0,
      "publication_date": 20190228
    },
    {
      "title": "This is a great doll, for only 8 dollars",
      "text": "This is a great doll, for only 8 dollars. And my daughter LOVES it!! Will be purchasing more for holidays, birthdays, ect.",
      "rating": 5.0,
      "verified": true,
      "author": "MDMomma",
      "helpful_votes": 2,
      "publication_date": 20160729
    },
    {
      "title": "We have a couple of these and my daughter loves ...",
      "text": "We have a couple of these and my daughter loves them. They can wear clothes made for a Barbie but not the shoes. And the glitter on the dress doesn't shed almost at all.",
      "rating": 4.0,
      "verified": true,
      "author": "Jocelyn Sanders",
      "helpful_votes": 0,
      "publication_date": 20170403
    },
    {
      "title": "Like the detail, very well made doll",
      "text": "I have ordered more of these dolls.i am very pleased with the purchase. It is a great gift for a little girl",
      "rating": 5.0,
      "verified": true,
      "author": "M. Wang",
      "helpful_votes": 0,
      "publication_date": 20170507
    },
    {
      "title": "Five Stars",
      "text": "my little girl was so happy to add this to her doll collection",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180528
    },
    {
      "title": "Excellent quality product",
      "text": "Exceeded my expectations . Excellent quality . Very realistic. and better than Mattel products Bought two of these so far as gifts for my daughter and niece . Super fast delivery amazon",
      "rating": 5.0,
      "verified": true,
      "author": "HAITHAM  ABDALLA",
      "helpful_votes": 0,
      "publication_date": 20161212
    },
    {
      "title": "Five Stars",
      "text": "Amazing doll for the price. Just as beautiful as a Disney Store doll",
      "rating": 5.0,
      "verified": true,
      "author": "Amy Abel",
      "helpful_votes": 0,
      "publication_date": 20170115
    },
    {
      "title": "Excellent quality product",
      "text": "Exceeded my expectations . Excellent quality . Very realistic. and better than Mattel products Bought three of these so far as gifts for my daughter and niece . Super fast delivery amazon",
      "rating": 5.0,
      "verified": true,
      "author": "HAITHAM  ABDALLA",
      "helpful_votes": 0,
      "publication_date": 20161212
    },
    {
      "title": "First Princess",
      "text": "Looks exactly like pictured. My granddaughter is going to love her hair. This will be her first princess doll.",
      "rating": 5.0,
      "verified": true,
      "author": "KarenJ",
      "helpful_votes": 0,
      "publication_date": 20161220
    },
    {
      "title": "Great great price too",
      "text": "This doll is so cute! I would definitely buy another. Great great price too.",
      "rating": 5.0,
      "verified": true,
      "author": "Holley Warner",
      "helpful_votes": 0,
      "publication_date": 20160127
    },
    {
      "title": "just as described",
      "text": "Perfect! same doll you would buy at the store just half the price. my daughter loves it!!",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa Fionda",
      "helpful_votes": 0,
      "publication_date": 20170225
    },
    {
      "title": "Kind of odd but still cute",
      "text": "I bought this doll with the accompanying Maximus horse, thinking that they could be used together. I was surprised that there were no knee joints in the doll so she can't sit on the horse. It's OK - cute and it delighted our 3-year-old granddaughter but it's not up to Barbie standards.",
      "rating": 3.0,
      "verified": true,
      "author": "Patricia Hillyer",
      "helpful_votes": 0,
      "publication_date": 20161227
    },
    {
      "title": "Buying them all",
      "text": "Super cute love these dolls more than traditional barbie. They looks so much like the characters freckles and all!",
      "rating": 5.0,
      "verified": true,
      "author": "Rachelle laughlin",
      "helpful_votes": 0,
      "publication_date": 20161218
    },
    {
      "title": "Granddaughter loves play with Merida Doll",
      "text": "great birthday gift for my granddaughter - she loves paying with it",
      "rating": 5.0,
      "verified": true,
      "author": "Carrie",
      "helpful_votes": 0,
      "publication_date": 20180223
    },
    {
      "title": "This is a great product I'm very pleased",
      "text": "I bought this doll for my sister who is disabled . Her birthday is November 30 and she is handicapped and loves dolls . This is a great product I'm very pleased .",
      "rating": 5.0,
      "verified": true,
      "author": "Faye Vickers",
      "helpful_votes": 0,
      "publication_date": 20161119
    },
    {
      "title": "So cute!",
      "text": "My daughter and I love these disney princess dolls! They are adorable!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Ashantae P.",
      "helpful_votes": 0,
      "publication_date": 20170204
    },
    {
      "title": "Watch the pricing on Amazon- don't over pay",
      "text": "Several of the dolls in this collection are also sold at Walmart- some in the collection are $5+ more on Amazon than on the shelf of your local Walmart. The doll was as advertised and fill a void in my little Disney fan's collection",
      "rating": 4.0,
      "verified": true,
      "author": "LegoCrazy",
      "helpful_votes": 0,
      "publication_date": 20160709
    },
    {
      "title": "Excellent quality product",
      "text": "Exceeded my expectations . Excellent quality . Very realistic. and better than Mattel products Bought two of these so far as gifts for my daughter and niece . Super fast delivery amazon",
      "rating": 5.0,
      "verified": true,
      "author": "HAITHAM  ABDALLA",
      "helpful_votes": 0,
      "publication_date": 20161212
    },
    {
      "title": "Excellent quality product",
      "text": "Exceeded my expectations . Excellent quality . Very realistic. and better than Mattel products Bought two of these so far as gifts for my daughter and niece . Super fast delivery amazon",
      "rating": 5.0,
      "verified": true,
      "author": "HAITHAM  ABDALLA",
      "helpful_votes": 0,
      "publication_date": 20161212
    },
    {
      "title": "Five Stars",
      "text": "Adorable doll, and I'm sure my granddaughter will love it!!",
      "rating": 5.0,
      "verified": true,
      "author": "Lori",
      "helpful_votes": 0,
      "publication_date": 20161206
    },
    {
      "title": "I will be giving this as a gift tomorrow to ...",
      "text": "I will be giving this as a gift tomorrow to my grandaughter who turned 5 years old, she always gets so excited every time I buy her a Disney princess doll, now she has all of them.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170228
    },
    {
      "title": "Cute",
      "text": "Dress was super cheap material and stiff. Daughter loved it and price was right!",
      "rating": 5.0,
      "verified": true,
      "author": "LD",
      "helpful_votes": 0,
      "publication_date": 20170104
    },
    {
      "title": "pretty princess",
      "text": "My 5-year old daughter & I think that this doll is so pretty! Now we want all of the Royal Shimmer princesses!",
      "rating": 5.0,
      "verified": true,
      "author": "T.C.",
      "helpful_votes": 0,
      "publication_date": 20161229
    },
    {
      "title": "Im sure she loved it and the prices was great",
      "text": "christmas gift for granddaughter, Im sure she loved it and the prices was great! Thanks",
      "rating": 4.0,
      "verified": true,
      "author": "Navy Mom",
      "helpful_votes": 0,
      "publication_date": 20170103
    },
    {
      "title": "Good for the price",
      "text": "My five year old daughter loves this doll. Pretty nicely made.",
      "rating": 5.0,
      "verified": true,
      "author": "homemakingmama",
      "helpful_votes": 0,
      "publication_date": 20160901
    },
    {
      "title": "Decent for the money",
      "text": "Oddly enough I was the second person to get this for my niece. She loved it all the same. Hah",
      "rating": 4.0,
      "verified": true,
      "author": "J",
      "helpful_votes": 0,
      "publication_date": 20170116
    },
    {
      "title": "Excellent quality product",
      "text": "Exceeded my expectations . Excellent quality . Very realistic. and better than Mattel products Bought two of these so far as gifts for my daughter and nieces",
      "rating": 5.0,
      "verified": true,
      "author": "HAITHAM  ABDALLA",
      "helpful_votes": 0,
      "publication_date": 20161212
    },
    {
      "title": "Five Stars",
      "text": "Bought this for a boys and girls club toy donation. Affordable and cute.",
      "rating": 5.0,
      "verified": true,
      "author": "Liz",
      "helpful_votes": 0,
      "publication_date": 20170619
    },
    {
      "title": "Beautiful doll! My four-year-old opened it on Christmas morning ...",
      "text": "Beautiful doll! My four-year-old opened it on Christmas morning and was thrilled by it. Great quality!",
      "rating": 5.0,
      "verified": true,
      "author": "Katie Stacey",
      "helpful_votes": 0,
      "publication_date": 20161230
    },
    {
      "title": "Such a pretty doll! My four year old was absolutely thrilled ...",
      "text": "Such a pretty doll! My four year old was absolutely thrilled by it and loved opening it on Christmas.",
      "rating": 5.0,
      "verified": true,
      "author": "Katie Stacey",
      "helpful_votes": 0,
      "publication_date": 20161230
    },
    {
      "title": "Also like the other reviews",
      "text": "Daughter loves her so much! Also like the other reviews, she doesn't bend well but a wonderful toy.",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda Seitzler",
      "helpful_votes": 0,
      "publication_date": 20170206
    },
    {
      "title": "She is really pleased with it",
      "text": "Christmas gift for my Granddaughter. She is really pleased with it. Thanks.",
      "rating": 5.0,
      "verified": true,
      "author": "Jon P. Smitherman",
      "helpful_votes": 0,
      "publication_date": 20161226
    },
    {
      "title": "Four Stars",
      "text": "Even more beautiful in person, Haven't taken it out of the package however but it's still really pretty",
      "rating": 4.0,
      "verified": true,
      "author": "Jade Hale",
      "helpful_votes": 0,
      "publication_date": 20161125
    },
    {
      "title": "awesome buy!",
      "text": "got this for my niece and she loved it so much! Came in so fast and was at least a dollar cheaper than any store I saw it in. Would highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170314
    },
    {
      "title": "Great quality",
      "text": "Better quality than I thought it would be! My daughter loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "June Klass",
      "helpful_votes": 0,
      "publication_date": 20170124
    },
    {
      "title": "Beautiful doll for Mulan fans",
      "text": "My daughter adores the Mulan cartoon. This doll is perfect and made her squeal with glee. For those who'd like to know - elbows and knees don't bend.",
      "rating": 5.0,
      "verified": true,
      "author": "O. Klein",
      "helpful_votes": 0,
      "publication_date": 20160405
    },
    {
      "title": "Gorgeous doll - better than pictures",
      "text": "Wonderful! Gorgeous doll. My little 4 year old will be so very excited!",
      "rating": 5.0,
      "verified": true,
      "author": "MN",
      "helpful_votes": 0,
      "publication_date": 20171127
    },
    {
      "title": "Five Stars",
      "text": "Really nice doll and a great deal. Her boots also fit Barbie size dolls",
      "rating": 5.0,
      "verified": true,
      "author": "shopper",
      "helpful_votes": 0,
      "publication_date": 20170405
    },
    {
      "title": "Five Stars",
      "text": "Great princesses! my 5 year old loves them! they are bigger than i thought but that's great!",
      "rating": 5.0,
      "verified": true,
      "author": "tamara",
      "helpful_votes": 0,
      "publication_date": 20161206
    },
    {
      "title": "Very cute Rapunzel!",
      "text": "My 3 year old loves this little doll! She is very cute and looks a lot like the Rapunzel in the movie. Only complaint is that her hair isn't long enough. 😉",
      "rating": 4.0,
      "verified": true,
      "author": "Elizabeth",
      "helpful_votes": 0,
      "publication_date": 20161227
    }
  ],
  "product_meta": {
    "title": "Disney Princess Royal Shimmer Cinderella Doll",
    "description": "Style:Cinderella DollCinderella is ready for shimmering adventures with your little princess! Wearing her classic outfit with a new twist, Royal Shimmer Cinderella dazzles in a signature-colored, jewel-ombre gown with glitter print detailing. Your little dreamer will love playing out magical moments from Disney's Cinderella, as well as imagining her own fairy tale with this beloved Princess. Copyright Disney Hasbro and all related terms are trademarks of Hasbro.",
    "rating": 4.7,
    "feature_bullets": [
      "Doll comes with removable shoes",
      "Doll has movie-inspired features",
      "Doll features a shimmering gown in her signature color",
      "Gown has beautiful ombre and glitter accents",
      "Includes doll, outfit, pair of shoes, and 2 accessories."
    ],
    "specifications": {
      "Product Dimensions": "2.01 x 5.98 x 14.02 inches",
      "Item Weight": "4.3 ounces",
      "ASIN": "B0125KTVE8",
      "Item model number": "B5288",
      "Manufacturer recommended age": "3 years and up",
      "Best Sellers Rank": "#61,013 in Toys & Games",
      "Customer Reviews": "4.7 out of 5 stars665 ratings4.7 out of 5 stars",
      "Is Discontinued By Manufacturer": "No",
      "Release date": "January 1, 2016",
      "Mfg Recommended age": "36 months - 99 years",
      "Manufacturer": "Hasbro"
    },
    "categories": [
      "Dolls & Accessories",
      "Toys & Games",
      "Dolls"
    ],
    "price": ""
  }
}