{
  "website_summaries": [
    {
      "verdict": "A stable stove that runs primarily on wood, pine cones, and other free fuels, which can be both a blessing and a curse.",
      "pros": [
        "Stainless steel construction with good cooking surface support",
        "Comes with a mesh carry bag",
        "Fuel can either be wood, twigs, or other scavenged materials, or you can use solidified alcohol",
        "Breaks down to 5.3 by 3 inches, with a weight of 14.2 ounces",
        "Stable"
      ],
      "cons": [
        "Wood can get wet or be a pain to collect, so bring solidified alcohol just in case",
        "Must lift pot to add more fuel to the fire",
        "The metal here is on the thin side, and can break or rust easily"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "perfect!",
      "text": "just what i needed, also i recommend getting this stainless steel grate along with it, it allows the fits perfect on top to make a more stable surface for smaller pots .. (5.6\" stainless steel grill grate)",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 114,
      "publication_date": 20170629
    },
    {
      "title": "EXCELLENT PRODUCT",
      "text": "I purchased this last night to replace the Solo Stove I had before not really expecting as good of a product. I had a Solo Stove Titan before and I was very surprised this stove actually seemed to work better than the Solo Stove. I HIGHLY recommend this product to anyone who camps or lives off the grid. Others of similar design get so hot they will burn the ground or right through a plastic table. This one stays cool enough at the bottom I can pick it up bare handed and move it around while burning.",
      "rating": 5.0,
      "verified": true,
      "author": "RCS Motorsports",
      "helpful_votes": 160,
      "publication_date": 20160421
    },
    {
      "title": "It burns HOT HOT HOT!!!!  ROAST that pot!",
      "text": "WOW!!!!! I just tried it for the 1st time! Some people complain it is small, it's for BACKPACKING, it better be small. It burns HOT HOT HOT!!!! I was amazed! Cut all the wood you want to use before hand, it burns HOT, so it uses wood quick to do that. I put a small pot on it and it brought the water to a boil FAST! I am going to get more of these!",
      "rating": 5.0,
      "verified": true,
      "author": "Not of the Herd",
      "helpful_votes": 238,
      "publication_date": 20151211
    },
    {
      "title": "Susceptible to breeze/wind, use a windscreen",
      "text": "Great stove. Keep in mind that it is very susceptible to breeze/wind, especially if you're trying to boil water, It's nearly impossible to bring water to a boil if its breezy out and you don't have something to block the wind. A windscreen that is tall enough for this stove is a requirement if you are going to be using it in the wild while hiking/camping. Most of the popular windscreens are not tall enough, so look for a 9 inch+ model. I went withwhich comes with a nice carrying case.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 8,
      "publication_date": 20170413
    },
    {
      "title": "Fire! Food!",
      "text": "Works pretty well. I agree with other reviewers that the pot stand legs are sharp! 5 Minutes with a Dremel tool and grinding stone fixed that. One thing worth mentioning is that the pot stand legs folded inward will support cups and dishes of a smaller diameter.",
      "rating": 4.0,
      "verified": true,
      "author": "Vince",
      "helpful_votes": 12,
      "publication_date": 20161021
    },
    {
      "title": "Insurance policy",
      "text": "Listen, for the price, this thing works. It is not the best stove but I got it to boil water in 9 minutes under perfect conditions. The caveat being; on windy days and with damp fuel, it's going to be a PITA or impossible to lite or keep lit. So, buy a wind shield or be prepared to make one and keep dry kindling handy. This is in my go-bag. It nests neatly and coincidentally into the, completing a nice cheep insurance policy for disinfecting water or cooking a quick can of soup in a pinch. I also stuff Vaseline infused cotton balls for quick ignition of fuel.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael McKien",
      "helpful_votes": 4,
      "publication_date": 20171210
    },
    {
      "title": "Great product !!!",
      "text": "I am blown away by the efficiency of this little stove and its ease of use. I have cooked burgers and breakfast with this little stove. I also use it to boil water for coffee every day when camping. Works great and burns everything down to fine ashes. Its also very light and breaks down into a tiny little package and comes with a nice little carrying sack. I highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony J. Cirullo",
      "helpful_votes": 21,
      "publication_date": 20160823
    },
    {
      "title": "Pain in the rear to use. Update 9/14/20 World class customer service!",
      "text": "This stove is a pain to use. It requires constantly feeding really small twigs and constant attention. It's a great idea and works really well for the few minutes it is fully fired but it won't stay fully fired long enough without continuously feeding to actually boil water. Update 9/14/20: Pro's: World class customer service! After seeing my original review, the company reached out to me to offer resolution. I've upgraded my review to 3 stars as a result (from 2 stars) Stove is really well built and sturdy. Sets up and takes down easily. Comes with a storage bag. The concept is fantastic and actually works. Con's listed in original review.",
      "rating": 3.0,
      "verified": true,
      "author": "Michael S.",
      "helpful_votes": 0,
      "publication_date": 20200829
    },
    {
      "title": "Cheap Pease of crap!!",
      "text": "This thing is cheap and flimsy! If you're looking for something well made and durable check out the unigear 5×7 in. Stainless steel stove! It is great!",
      "rating": 1.0,
      "verified": true,
      "author": "Matthew W.",
      "helpful_votes": 5,
      "publication_date": 20190308
    },
    {
      "title": "Clever little set up.",
      "text": "This is a clever little stove. I have used it many time out in the Bush. I have burned wood in it. I have used SOL fire cubes with it. I have even dropped my mini stove inside it and used it as a wind breaker. It can be set up in a variety of configurations and can adapt quite well to different situations. It collapses down and packs away quite small, so it’s really easy to fit into your gear. I am very satisfied with this stove and recommend it to anyone looking for a lightweight stove that can adapt to a variety of fuel sources.",
      "rating": 5.0,
      "verified": true,
      "author": "Janna S22",
      "helpful_votes": 3,
      "publication_date": 20180120
    },
    {
      "title": "Great lightweight stove!",
      "text": "This is the first wood burning backpack stove I have used. Let me say: This stove is awesome. I liked it so much that I purchased a second one. This stove allows you to use wood or solid alcohol fuel. It has two burning phases. First, it burns the fuel you add (wood or alcohol), then there is secondary burn that burns the smoke because of the air holes on the top inside of the stove. My only complaint is you have to remove your pot to add more fuel. I have not had a chance to try it with the solid alcohol fuel.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian S.",
      "helpful_votes": 6,
      "publication_date": 20160922
    },
    {
      "title": "Best hiking/camping tool I've bought in a long time.",
      "text": "The thing about a portable camp stove is that you're always lugging around fuel - white gas, propane, alcohol, chemical pellets, something. And, when you run out, you run out. With this stove, your supply of fuel is endless. It burns hot enough to meet any of your outdoor needs and for a price that beats the nearest competitor by far. I'm more than happy with my purchase and I intend to buy another one to give away as a present. ~Manfred",
      "rating": 5.0,
      "verified": true,
      "author": "Manfred Knight",
      "helpful_votes": 19,
      "publication_date": 20160621
    },
    {
      "title": "Versatility and great performance",
      "text": "Great product using dual fuel resources (wood or alcohol). Can be use with alcohol in the morning for breakfast cooking and wood in the evening for dinner cooking. Can be also use for s’mores in a short time, and as a light and heating source as well. As any light metal subject to fire constant use will diminish life span if not handle with care. Good size for backpacking. The heat level is amazing. Tried it using alcohol and was ok but, using wood it last longer. It retained enough heat for awhile after most of the wood burned.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181107
    },
    {
      "title": "Missing a part. But it's ok",
      "text": "Mine didn't include the grill top, which would be useful . It works, but does take a little practice and modifications make it better. You definitely want some dry wood and you need to constantly feed it as this is a system where you cook over the direct flame (your water won't boil if you just are trying to use coals). I would recommend that you practice before relying on it. I think it will be suitable for my car but I will probabaly look for something a bit larger that folds flat for camping.",
      "rating": 3.0,
      "verified": true,
      "author": "Michael Gardner",
      "helpful_votes": 0,
      "publication_date": 20200721
    },
    {
      "title": "Tiny but cool or 🔥",
      "text": "This turned out to be a little smaller than I expected but is very cute. It won't hold a bigger pan safely but it will hold smaller pans and certainly will hold the coffee pot with no problem. And if you have one of those tall pasta pots, it would work perfect on this so you can do soups, small stews, boil eggs or pasta. I don't regret this ittle guy at all. I think maybe I'll give it to the guys on my shopping list for Christmas and even a couple of gals.",
      "rating": 5.0,
      "verified": true,
      "author": "But whyyyyyy? ",
      "helpful_votes": 0,
      "publication_date": 20201003
    },
    {
      "title": "Easy to use and burns hot.",
      "text": "This is perfect for my daughter and I to use while camping. i'll let her start the fire with some twigs and branches, but when it comes time for cooking I like to use kingsford charcoal. we usually bring about 15-20 briquets in a Ziploc bag and that will last us through the weekend, it uses about 4-5 briquets per cooking session. I've actually purchased this item a few times, gifting it to my brother and brother in law. So long as you clearly understand the size of this grill, there is no reason why you would be disappointed when using it.",
      "rating": 5.0,
      "verified": true,
      "author": "Todd",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Worked way better than I thought it would !",
      "text": "This thing works great. Cooked hotdogs on the brill and hard boiled an egg. Once you light it (was easy to light) let it burn down some to get some coals in the bottom. Just because you don’t have flames roaring out of this thing doesn’t mean it’s not hot. It’s better to grill over the coals. Cleans up well. Seems very sturdy. Break up dry twigs into about 3” length, fill it half way. Great for backpacking bike camping, or even an emergency. Very happy with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "Burns Wood Sticks, Pellets & Alcohol",
      "text": "I own several wood burning stoves for hiking ranging from expensive titanium models to homemade jobbers. The Ohuhu stove is the most fun in part because of its price and option to burn wood pellets & alcohol. The alcohol tray holds a smidgen over an ounce of fuel which provides enough to boil 2 cups of water. The only minor issue really is the stove does not nestle into many of my cooking pots.",
      "rating": 5.0,
      "verified": true,
      "author": "jpmac55",
      "helpful_votes": 0,
      "publication_date": 20191010
    },
    {
      "title": "Great stove!",
      "text": "I bought this stove as and emergency stove if i lose power or need a small stove to backpack with. This stove is great with twigs but also works really well with wood pellets. I used a combo just to see how it works and the gasification was amazing. Very hot and burns for an extended period of time. For this price you cannot go wrong with this stove. the only downside i see is that its hard to add fuel if you have a pan on top cooking however given the 45 min burn time with pellets i dont see the need to ever add fuel while i am cooking.",
      "rating": 5.0,
      "verified": true,
      "author": "Justin L.",
      "helpful_votes": 0,
      "publication_date": 20190805
    },
    {
      "title": "Super Cute Nesting, Portable Cooking Stove",
      "text": "I really love this portable cooking stove. I took another reviewer's advice and bought the \"MSR Alpine Stowaway Pot 775ml.\" It fits perfectly inside and I love the space efficiency of it; however, it's difficult to get the fire going at a good, level intensity that isn't shooting several inches above the top or dying out. It might be the type of wood we're using, but I dislike the sheer amount of black soot that coats my portable pot or food when cooking over the fire.",
      "rating": 5.0,
      "verified": true,
      "author": "Heather G.",
      "helpful_votes": 2,
      "publication_date": 20180201
    },
    {
      "title": "Small camping pot cup sits on grate...great",
      "text": "Haven’t used it yet but I was nervous my cup wouldn’t fit, so I tried using the grate on top and it seems to fit perfect. Didn’t see any pics in the description so I posted some here. Gonna have to wait and see if it works.",
      "rating": 5.0,
      "verified": true,
      "author": "Guy",
      "helpful_votes": 0,
      "publication_date": 20201014
    },
    {
      "title": "RUSTED IN 3 WEEKS!!!",
      "text": "I own this stove for 3 weeks and used 1 time during Wisconsin ice fishing trip and already rust in and around the burning chamber. Not worthed!",
      "rating": 1.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 6,
      "publication_date": 20180110
    },
    {
      "title": "The is one amazing lil stove burns hot",
      "text": "The is one amazing lil stove burns hot. Cooked four full meals on one trip did the job perfectly and on very little wood. However on another trip temps dropped it poured for hours all night lucky I did my wood prep the night before, that morning it was like having my very own fire place under my tarp set up. Very easy set up and clean it's a must buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Marlonsmie",
      "helpful_votes": 8,
      "publication_date": 20161023
    },
    {
      "title": "This thing is incredible. I love it.",
      "text": "I was on the fence about buying this for a long time. Could it really work as well as everybody says it does? Well I finally bought it just for fun, and boy does it work. I've only played with it in my wood stove with the door open but man, you throw anything in there and it burns hot and clean. Even shredded paper burns great, because of the gasification action the ash doesn't even rise out of it on the hot air current.",
      "rating": 5.0,
      "verified": true,
      "author": "Drew",
      "helpful_votes": 0,
      "publication_date": 20181118
    },
    {
      "title": "Awesome little stove",
      "text": "I LOVE this little stove! Used it every day over a two week camping trip. It packs up small and is cool to the touch soon after use. It's very effective for heating up water and food and is very stable - both the unit on the ground and also the prongs that support the kettle/pot. I only used the fuel cubes, did not use wood in it. It worked so great. It's so easy to set up and was great in windy conditions. For the price you totally can't go wrong. This is awesome!",
      "rating": 5.0,
      "verified": true,
      "author": "L. Scott",
      "helpful_votes": 2,
      "publication_date": 20171117
    },
    {
      "title": "Can't go wrong with this jewel",
      "text": "Bought this for our boat camping along the Columbia I choose it because all the similar ones did not look too stable and none would take a reasonable size pan This larger stove diameter and flip-out pan holder easily support by 8\" pans And because it was one of the lowest cost models :) To date I've used it with twigs, Sterno, fuel cubes, and charcoal briquets OMG, am I pleased! And my jealous friends are hinting at being gifted one",
      "rating": 5.0,
      "verified": true,
      "author": "bricevine",
      "helpful_votes": 0,
      "publication_date": 20190707
    },
    {
      "title": "Well designed,  low price.",
      "text": "The performance of other stoves for a lower price. However will not compete against the Wyoming wind. If you absolutely have to count on it to work under any weather condition this probably isn't the stove you need. If you need a compact, well designed, sturdy but a bit on the heavy side, for hobby camping under less extreme conditions , this might work for you. The price is low enough to try it out to see if it is what you need.",
      "rating": 3.0,
      "verified": true,
      "author": "M. W.",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "Great for a really hot flame",
      "text": "I put my alcohol burner inside this unit and fired it up indoors. I don't recommend doing this unless you are prepared for a very hot and potentially dangerous flame. I have used alternate cooking methods indoors for a long time so I feel reasonably confident doing this. The alcohol flame used to be only good for low to medium heat, but now it is hot enough to pop popcorn even. Only put in the amount of alcohol you need and let it die down by itself. Don't try to force-extinguish it. This stove would be awesome for outdoor cooking also.",
      "rating": 5.0,
      "verified": true,
      "author": "JG",
      "helpful_votes": 0,
      "publication_date": 20190126
    },
    {
      "title": "Know your wood and this will work",
      "text": "It works fairly well, as long as you keep it fed. If the burn chamber is less than full, it has a tendency to die down to embers. Blowing can get the flames started again with new wood added. Very easy to start, as long as you have dry wood. If you use deadfall from your camping area, you may have more moisture than this puppy can handle.",
      "rating": 4.0,
      "verified": true,
      "author": "Dan O'Sterling",
      "helpful_votes": 2,
      "publication_date": 20180806
    },
    {
      "title": "Verified: everything fits nicely in a MSR alpine 775ml stowaway pot.",
      "text": "Everything fits perfectly in a MSR 775ml stowaway pot. There is a specific layout for placing the parts. Try a few times you'll find it. There are no sharp edges. Light weight and well made. Perfect for a 1-2 person camping trip. The airflow design is very successful and practical. Place stove on a flat ground with minimal vegetation.",
      "rating": 5.0,
      "verified": true,
      "author": "User",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "Selling used as new/ the sent me a new one",
      "text": "Not at all happy with this, it arrived today and it’s obvious that it’s been used. I paid my money for a NEW product, not somebody else’s reject. Update, they did send me a new one which looked good and works well",
      "rating": 4.0,
      "verified": true,
      "author": "Mark Schmidtke",
      "helpful_votes": 3,
      "publication_date": 20181026
    },
    {
      "title": "Great little stove",
      "text": "I really like this little stove. I have a little jetboil fuel type apparatus that I like to carry in my back pack...but I also thought using wood would be nice. So I bought this stove. It boiled a cup of water in about 4 minutes. Plus I will have flexibility to cook other foods that are not possible to cook with the jetboil fuel. The stoves will both have their place in my back pack depending on what type of back packing I am doing.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon_User_SC",
      "helpful_votes": 0,
      "publication_date": 20190131
    },
    {
      "title": "This is a super cool little easy to use camp stove!",
      "text": "I am a camper, not a \"glam-per\" and I tend to travel pretty light weight when I go camping. This little stove is light weight and convenient. I'm not feeding an army - I'm feeding myself and maybe one other person, so please don't buy this if you're feeding a big family. For the region I was in, it was easy to find enough fuel on the ground to easily use the stove. I am very pleased with this little camp stove.",
      "rating": 5.0,
      "verified": true,
      "author": "Music Lover",
      "helpful_votes": 0,
      "publication_date": 20191009
    },
    {
      "title": "Great compact and versatile little gasifier stove",
      "text": "I absolutely love this stove and have recommended it to several people in the bushcraft and camping community. My older father even bought one. I love the versatility to it as well, can be a stick burner gasifier, alchohol burner, solid fuel, or gel fuel stove. It folds down down to about 2\" tall by around 5\" in diameter. The only shortcoming is probably the pot stand. Not extremely stable with a Stanley small cookpot. I have found work arounds by using the supplied grill instead. If you made it this far, buy it, for the price you can't expect much. It IS a great little performer though.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Sappington",
      "helpful_votes": 0,
      "publication_date": 20191221
    },
    {
      "title": "It works",
      "text": "This stove works, and I was able to make coffee and fry some sausages with it. A few issues: once it's heated up you have to babysit it until the coals burn out and it cools back down. If you try to get the embers out to dump into a bucket of water or something, it may tend to tip over and spill hot embers, in which case the bucket of water will come in handy. It's not that easy to light.",
      "rating": 4.0,
      "verified": true,
      "author": "Psy",
      "helpful_votes": 0,
      "publication_date": 20191027
    },
    {
      "title": "Perfect backpacking and camping stove",
      "text": "Perfect backpacking and camping stove! It is very light weight and as long as you have plenty of fuel near by it can get the job done. Boils water quickly and cooks food with vigor. It is very compact and packs well with my other gear. My only concern is due to the light weight the material can give a little or dent if it becomes lose in the pack or accidentally knocked over. Overall great product and highly recommend it for backpacking or survival kit.",
      "rating": 4.0,
      "verified": true,
      "author": "Morab1cm",
      "helpful_votes": 6,
      "publication_date": 20160202
    },
    {
      "title": "Impressive for the weight and price",
      "text": "I bought this stove because I didn't want to carry extra liquid fuel in my pack and based on the good reviews. For the price I'm very happy after my first overnighter with it. I had plenty of deal to work with so fuel was no problem. It fired up easily and easily headed up my 2-cup pot of water. The wood will burn down quickly so you do need to tend to it but that isn't an issue for me. Others complain that there isn't a big slot for putting more sticks in; I didn't have any issue just lifting my pot off for a few seconds to refuel. Overall I'm happy with the performance for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Timothy Shaw",
      "helpful_votes": 0,
      "publication_date": 20180418
    },
    {
      "title": "Teach scouts to use biofuel stoves.  Renewable energy resource.",
      "text": "These stoves are fantastic! My entire boy scout troop has become extremely proficient in using them on campouts. If you wipe you pot outside with bar soup it makes chat removal a but easier when you clean your pot. I wish I could buy the grill they added to these stoves for my older Ohuhus. Great addition for those cooking soup right from the can. Most cans fall through little holders unless you have a grate.",
      "rating": 5.0,
      "verified": true,
      "author": "Suzanne Breder",
      "helpful_votes": 0,
      "publication_date": 20190325
    },
    {
      "title": "Little fire pit",
      "text": "I live in a small area and don't have much storage space. This is very compact and conveniently stores! I use it as a fire pit for my husband and I so we can roast marshmallows. It's easy to keep the fire going since it only needs little pieces of wood. We will probably use it for its intended purpose next time we go camping.",
      "rating": 5.0,
      "verified": true,
      "author": "Heasha",
      "helpful_votes": 0,
      "publication_date": 20200507
    },
    {
      "title": "Pretty effective, when you get it burning well.",
      "text": "This stove is AWESOME!!! I load it up with little bits of wood, and keep a bunch of extra wood next to it. You will need them, because you need to drop a few in every few minutes. I light it by pouring denatured alcohol onto it and dropping a match onto it. It makes a nice noise, smokes a little for a minute while it's warming up, and then you have smokeless awesomeness. Cooking is a joy :)",
      "rating": 5.0,
      "verified": true,
      "author": "OuluPulu",
      "helpful_votes": 2,
      "publication_date": 20170805
    },
    {
      "title": "Very cool stove",
      "text": "Very cool product. I have just done one trial run and it was perfect. Light a little fire, load it up and put the pot on. I had to reload mine once, but that's partly my fault as I didn't have the burner all the way down so it was only half full. Boiled 1L of water in 10 mins. A small wind screen might be helpful getting it going but it makes a hot smoke free fire when it's going. Comes in a nice mesh pouch. Seems like it should last. The only potential weak spots I can see are the 3 rivets for the pot holders.",
      "rating": 5.0,
      "verified": true,
      "author": "Johnny Lunchmeat",
      "helpful_votes": 0,
      "publication_date": 20180718
    },
    {
      "title": "It surprised me!",
      "text": "This thing actually works. I bought it just to see if it would actually work, or if it was a gimmick. But I was able to boil water for oatmeal the last time I was camping - it took a little longer than my camping stove, and it was more work - you have to feed it twigs constantly - but it definitely worked!! I actually couldn't believe it. If I was in the woods without camping fuel, this would definitely work in a pinch.",
      "rating": 4.0,
      "verified": true,
      "author": "FSOAPM",
      "helpful_votes": 0,
      "publication_date": 20190421
    },
    {
      "title": "Great stove multiple uses",
      "text": "Great stove !! Initially I was worried as it seemed cheap. After using it I realized what I thought was loose fit was to account for slight metal expansion while burning. Also arms on top seemed tight/stiff , but again after using it they loosened a small amount and are perfect. Well thought out and designed Brought my Stanley pot to a rapid boil in 8 min , continued to rapid boil for 20min. Very pleased and all with only a handful of sticks Plastic drawer in pic was behind as it was very windy. May have boiled sooner with less wind",
      "rating": 5.0,
      "verified": true,
      "author": "C Rinehart",
      "helpful_votes": 0,
      "publication_date": 20200815
    },
    {
      "title": "Best stove ever!",
      "text": "This couldn't be easier and faster to use... way better for heating water up in the morning while camping... as it doesn't take nearly as long as a big fire. Plus you can get your pot right up to the flames. Very fast setup, great compact storage. Easy to chop up little pieces of firewood with a hatchet to use as fuel.",
      "rating": 5.0,
      "verified": true,
      "author": "burgundeejones",
      "helpful_votes": 0,
      "publication_date": 20200620
    },
    {
      "title": "Great purchase!",
      "text": "Really like this stove, we have had this stove for some time and it has held up really well. Was concerned it might be too heavy, but it has not been an issue. Solidly built it has not burned through like some cheap stoves or warped out of shape. Cleans up well and this might be my last stove.",
      "rating": 5.0,
      "verified": true,
      "author": "GP",
      "helpful_votes": 0,
      "publication_date": 20190302
    },
    {
      "title": "Started easily with wood I picked up but didn't boil water ...",
      "text": "Got my stove yesterday and wanted to test it as i'm leaving in 4 days. Started easily with wood I picked up but didn't boil water without more fuel. Seemed to smoke in the wind. Tried wood pellets and that's where this thing is awesome. a cup and a half of pellets started with waxed lint ball burnt for over an hour. easily boiled 1 litre of water and then some. even when flame died the coals kept coffee hot for a while. small and transportable, yet held my cast iron skillet and ten cup coffee pot. this is going in my get home bag as I travel a lot. well worth the $15.",
      "rating": 5.0,
      "verified": true,
      "author": "Carol Terrill",
      "helpful_votes": 0,
      "publication_date": 20170825
    },
    {
      "title": "a good purchase",
      "text": "I like this product it worked great and I am well pleased withe results, I used my spirit stove in it and it kept the the distance and flame hot boiled water for coffee and cooked some dishes on it and it fit inside my camp cooking pan, I would have liked to have had my spirit stove fit in the same kit but hey two out of three is ok with me, I see many good uses ahead ,camping season is just starting in Texas",
      "rating": 5.0,
      "verified": true,
      "author": "mike lazar",
      "helpful_votes": 0,
      "publication_date": 20191030
    },
    {
      "title": "Nice, but heavy",
      "text": "Nice little, cheap, compact unit compared to a solo stove. It's pretty heavy duty, so it's heavier than I expected. Fits very easily in the MSR stowaway 1.1L pot. I read that it also fits in the 750ml pot but I haven't tried that myself. The 1.1 liter pot fits on the top of the stove, but smaller pots may be a little sketchy. It's already a little unstable with only 3 pot holder feet. Not bad for the price though. Used this stove today, I put some charcoal briquettes in it and cooked hot dogs. Worked great!",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20180403
    },
    {
      "title": "Decent but not fantastic.",
      "text": "Seems to be good enough quality to hold up, but the three prongs are really flimsy and I could see those falling off with heavy use. It does take quite a bit of practice to get the fire going in the container, as you can't hold smaller coals (the bottom holes are too large) so you must constantly feed it. Overall it might be useful in a pinch but I won't be using it as a primary stove.",
      "rating": 3.0,
      "verified": true,
      "author": "Nic",
      "helpful_votes": 0,
      "publication_date": 20180501
    },
    {
      "title": "There is great airflow and this drive works like a champ",
      "text": "Gather as much tindered wood as possible for this little guy if you’re backpack hiking. There is great airflow and this drive works like a champ. It stows compactly. I laminated to the stowing instructions (or use a ziploc bag). Those who have white fuel options, this stove works just as well. Don’t forget to pickup a colllapsoble wind shield. That also comes in handy to keep your fuel from burning too quickly.",
      "rating": 5.0,
      "verified": true,
      "author": "Promee",
      "helpful_votes": 0,
      "publication_date": 20180209
    },
    {
      "title": "Great!",
      "text": "This was a game changer. Takes a little learning curve to figure out what to burn, and how to pack it, but once you get it going this will change your experience. Heat is direct and takes a few seconds to start sizzling meat. Pick up the fuel you intend to burn before you start cooking, make a nice pile next to you, then light up your stove. Be prepared to sos pad your cookware. Cooking wood will leave oily pitch black soot on the underside of everything used. That's the only negative I have for this. It compacts into my current camping pots so it takes up no additional space. For the price this thing is a must have",
      "rating": 5.0,
      "verified": true,
      "author": "Jim",
      "helpful_votes": 2,
      "publication_date": 20150929
    },
    {
      "title": "Decent for the price",
      "text": "For what it is, not bad but certainly nothing exciting. Cheap stainless but that is expected for the price. My only real gripe is in regards to the pot holders... VERY flimsy and only held on by cheap rivets. I will be replacing those with better hardware but for the price again it's no loss. Stove works as advertised and is efficient.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190118
    },
    {
      "title": "The second time around, persistence pays off.",
      "text": "This is the second stove I’ve ordered. The first stove was a wreck out of the box (broken pot support, wonky holes), seemed to have been a previous return and was returned again. This one is in great shape with no broken or mismade parts. I’ve not used this one yet but based on some videos I’ve seen of them being used it will be a welcome addition to my husband’s backpacking/camping equipment. This design is very similar to the Silver Light twig stove I saw he was looking at but is one third the cost.",
      "rating": 5.0,
      "verified": true,
      "author": "Gina",
      "helpful_votes": 0,
      "publication_date": 20180506
    },
    {
      "title": "Fantastic stove",
      "text": "I love this camp stove!!! It run off of small sticks and twigs, or any other small flammable materials. I love the optional liquid fuel dish for added versatility. It packs down to half its size. The only caveat however is the pot stand seems to be flimsy, so I wouldn't trust putting on a cast iron skillet. Otherwise, fantastic product!!",
      "rating": 4.0,
      "verified": true,
      "author": "AudioPhile",
      "helpful_votes": 3,
      "publication_date": 20170406
    },
    {
      "title": "Just because there are a lot of reviews, doesn't mean they're all valid.",
      "text": "Update to one star because after receiving it, I realized the pot/pan supports were very poorly made of thin metal and one was crooked. In addition, I realized this was a Chinese knock-off of the Silver Fire Scout, before they modified the design to stationary supports instead of flimsy folding legs. I also realized that there is no catch for the embers so, to be used safely, this stove should be used on a metal/tile/rock surface. Because the embers are not elevated, they will build up and stifle the fire. Lastly, I found dozens of this same stove under different names, at varying prices, all made in China.",
      "rating": 1.0,
      "verified": true,
      "author": "mocean",
      "helpful_votes": 26,
      "publication_date": 20170820
    },
    {
      "title": "Great for Alchohol stove or wood!",
      "text": "I used this stove to cook ramen. It brought the water (2/3 full) to a boil in 3 minutes using Heet as a fuel souce. With the fuel tray also filled to 2/3 I was able to cook for 7 minutes total with great results. I plan on catching crawfish and cooking them using this and the 750ml pot and heet for little snacks. This will go great with a bugout bag and a car kit too. I highly recommend buying this. Best bang for your buck guranteed!",
      "rating": 5.0,
      "verified": true,
      "author": "Kolby N.",
      "helpful_votes": 0,
      "publication_date": 20180430
    },
    {
      "title": "Dollar for dollar you can't go wrong",
      "text": "I ordered this several months ago and have used it throughout​ the summer and I like it. I have a Solo Stove that cost 2/3 more and I like that slightly better but not by much and not enough to justify the price difference. Pros; Significantly cheaper then most others Burns fuel great just like it's competition Large fire box Breaks down/packs well Cons; You can't use this on a bench because it's open on the bottom After several uses the metal of the parts expanded differently so it doesn't go together as well...but it does still go together. Small pots/cups don't work well on the stand (this is my major complaint)",
      "rating": 4.0,
      "verified": true,
      "author": "Brassghanistan",
      "helpful_votes": 0,
      "publication_date": 20170805
    },
    {
      "title": "This is amazing!",
      "text": "I've used this so much in the past month that it looks like it is years old. I've had a LOT of camp stoves in my life and have always been annoyed by having to carry fuel. With this thing, I just gather some sticks! It is awesome. I'll probably get another one.",
      "rating": 5.0,
      "verified": true,
      "author": "Elemental",
      "helpful_votes": 0,
      "publication_date": 20200614
    },
    {
      "title": "I like it --- But bothersome to use with small sticks.",
      "text": "I really like this little burner, however, as other reviewers have stated, its a drawback to have to keep lifting up the pan to add more wood. . . . I never did get 2 cups of water to boil, until I set the pan next to the campfire. I got tired of adding sticks, so I threw in a couple fire starters (sawdust & wax cubes), which kept the sticks burning a little longer... Next time I will try charcoal cubes and the fire starter cubes. and I Love the compact storage!",
      "rating": 4.0,
      "verified": true,
      "author": "Angelwings2ltd",
      "helpful_votes": 0,
      "publication_date": 20170319
    },
    {
      "title": "Impressed so far",
      "text": "I'm still learning how to best use this stove, but I've had pretty good luck with it so far. The trick I'm finding is figuring out the right amount of fuel to load it with for the task at hand. Too little and it doesn't burn that long....too much and you get a flame a foot high that runs up the side of your container. I am impressed with how long it will burn on whatever you find laying around. I'm finding that pinecones work well as fuel and tend to burn longer than other items. Great that it comes with a bag for storage...folds down pretty small so it's easy to pack away.",
      "rating": 4.0,
      "verified": true,
      "author": "M. Smith",
      "helpful_votes": 0,
      "publication_date": 20161026
    },
    {
      "title": "Fantastic",
      "text": "This little stove has exceeded our expectations and blew my boyfriend's mind on the fact that it actually fit all of the 5 star reviews. We have made s'mores on it a few times on our back porch. My boyfriend keeps starting random fires in the stove with little twigs he finds walking the dog. His favorite saying \"Look babe, I barely put anything in it and it's roaring!\" We strongly recommend this stove!",
      "rating": 5.0,
      "verified": true,
      "author": "CassieSz89",
      "helpful_votes": 0,
      "publication_date": 20200513
    },
    {
      "title": "With wood...might as well build a fire on the ground.",
      "text": "Worked great for about 2 minutes until the ashes cover the bottom and no air circulates resulting in the fire being snuffed out. Would have to constantly blow through the bottom just to keep flame going. Going to give it a try with alcohol and the firetabs you can buy for dual and see how that works but with wood....I dont believe it is very reliable.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200821
    },
    {
      "title": "A lot of work",
      "text": "cutting the wood to 3\" pieces was a lot of work however store bought wood pellets worked well with a long burn (2 cups of pellets = 2 hours) and little ash. Both methods sooted up the bottom of the pans. Trying to feed it with sticks and twigs created flames that were hard to control for cooking, the pellets provided a more even heat.",
      "rating": 3.0,
      "verified": true,
      "author": "gregory paynton",
      "helpful_votes": 0,
      "publication_date": 20190818
    },
    {
      "title": "You gotta try this!",
      "text": "Product is better than described! Used with small sticks for fuel. Used with Alpine stowaway pot 775ML worked perfectly to cook dinner. The stove is a tad heavy if you're long backpacking but the cost and ease of use makes it perfect for backpacking. I also have the MSR Apline Stowaway 775ML cook pot and the stove stores nicely in the pot for travel. Had a competition with a JetBoil and this cooker was about 2mins longer to boil same amount of water but it worked nicely. If you're not in a hurry and not concerned with weight this is an excellent, affordable and easy to use product.",
      "rating": 5.0,
      "verified": true,
      "author": "SCrisp",
      "helpful_votes": 0,
      "publication_date": 20170615
    },
    {
      "title": "Small in size, handy in all matters",
      "text": "So many things to do with this small little package.. I tried both.. putting all the twings n charcoal And using solid alcohol.. perfect setup.. the holes at the bottom allow for ventilation.. This setup keep my coffee at the temperature needed",
      "rating": 5.0,
      "verified": true,
      "author": "MuddStyLo",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Great stove",
      "text": "Took it on a three day backpack trip. It worked great, was able to boil 4 cups of water in just a few minutes, just using small pieces of laying around the camp.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Armijo",
      "helpful_votes": 20,
      "publication_date": 20160407
    },
    {
      "title": "Very nice and efficient! Little to no smoke when running right!",
      "text": "Played with a few designs, this is a great piece of gear for the price. Simple to use, just set yourself aside some time to grab enough varied fuels, set up a safe spot and play with it. Once you learn how to feed it properly, it will be your go to unit. Built sturdier than the competition, this should last a long time.",
      "rating": 5.0,
      "verified": true,
      "author": "Quasilogical",
      "helpful_votes": 0,
      "publication_date": 20190725
    },
    {
      "title": "convenient, easy to use, well-built",
      "text": "(have only used alcohol as a fuel so far. will update my review if i have a different experience with biomass fuels) using stoves like this while camping / hiking is definitely new for me. this stove was so easy to use! it \"assembles\" quickly, can be used with a variety of fuels, and packs easily for a relatively lightweight stove. the prongs are adjustable and i successfully cooked using a variety of different sized containers. overall, it's simple, quick, convenient, and seems to be constructed well. i'm suitably impressed!",
      "rating": 5.0,
      "verified": true,
      "author": "HappyCamper",
      "helpful_votes": 0,
      "publication_date": 20170525
    },
    {
      "title": "Nice Stove",
      "text": "Great stove. Boiled big pot of water then grilled a piece of steak on stove's small grill. Btw, the grill is important to me. It would be way better if they would have a way to lock it down so that it doesn't fall off while grilling.",
      "rating": 5.0,
      "verified": true,
      "author": "dsan1",
      "helpful_votes": 0,
      "publication_date": 20200629
    },
    {
      "title": "Fantastic. I haven't owned a Solo but I can't ...",
      "text": "Fantastic. I haven't owned a Solo but I can't imagine it being any better than this at a fraction of the cost. I also bought this same company's wind guard for this stove. Both came in their own case which is great for packing. I'll add a video next time I'm camping..",
      "rating": 5.0,
      "verified": true,
      "author": "vizualeyesit",
      "helpful_votes": 2,
      "publication_date": 20180203
    },
    {
      "title": "Lightweight, simple, and does the trick.",
      "text": "Not bad at all for the price. I love how small and lightweight this stove is but the fuel, wether using wood or stove alcohol is so limited. I honestly think it works better with stove alcohol but the fire only lasts 5-10 minutes usually before I have to remove the pot and add more alcohol. I’m considering buying a stove more like a pocket rocket and using this as a back up or second stove.",
      "rating": 4.0,
      "verified": true,
      "author": "Priscilla",
      "helpful_votes": 0,
      "publication_date": 20181107
    },
    {
      "title": "Great camping/emergency stove for a great price",
      "text": "This is a great camping/emergency stove. We used it during the power outages and were able to cook whole meals on it eith jut twigs that we picked up in the yard. It’s very compact and easy to use. You can’t bea the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Bret D. Anderson",
      "helpful_votes": 0,
      "publication_date": 20190312
    },
    {
      "title": "Excellent twig stove",
      "text": "Got this after watching Joe Robinet's videos on youtube. He boils water in one similar to this (though his is about nine times as expensive) and thought I needed to get one. Packaging is great, the instructions are super easy to follow, and it comes with a slightly padded mesh carrying case that makes it all pack together nicely. I love this stove and can't wait to cook on it.",
      "rating": 5.0,
      "verified": true,
      "author": "Home&GardenGoods",
      "helpful_votes": 0,
      "publication_date": 20181011
    },
    {
      "title": "Not steel, but reasonably priced.",
      "text": "For Ohuhu stove, was sad to see this is not a \"stainless steel\" stove as advertised. It came nicely boxed and undamaged though. Little heavy for backpacking, more for car camping but the versatility for fuels you can use is a plus. I deducted stars because I don't like being mislead in a description of the product.",
      "rating": 2.0,
      "verified": true,
      "author": "Cj",
      "helpful_votes": 0,
      "publication_date": 20180715
    },
    {
      "title": "Soot all over everything",
      "text": "This stove is... hard to light, impossible to control the flame, and leaves soot all over the bottom of your plans. It is lightweight and nicely designed, I’ll give it that. Maybe if you were a desperate survivalist it’d be worth it but I’ll be looking for something that I can actually cook on.",
      "rating": 1.0,
      "verified": true,
      "author": "PatriciaJ",
      "helpful_votes": 0,
      "publication_date": 20200717
    },
    {
      "title": "It is fairly easy to feed the fire without removing a pot",
      "text": "I tested this stove today as a twig burner and found it quite stable and efficient. It is important to use enough tinder and/or long stem matches or lighter to light your \"nest\" of twigs as it can otherwise be a little tricky to start. It is fairly easy to feed the fire without removing a pot, though that may be more difficult if cooking in a pot or pan much wider than the top of the stove. After a few uses I may give up on cannister stoves altogether and just carry some fuel tablets as a backup for very rainy conditions or trips above the tree line.",
      "rating": 5.0,
      "verified": true,
      "author": "60s_teen",
      "helpful_votes": 0,
      "publication_date": 20180318
    },
    {
      "title": "I've tested it out and it seems to be a good gasifying stove",
      "text": "Always looking to stock up on discounted backpacking gear.. I've tested it out and it seems to be a good gasifying stove. Bigger than I was expecting though. Comes with an insert for using liquid fuel of solid fuel tablets. Black mesh bag included. You could boil serious quantities of water with this thing, easily enough to accommodate the boiling needs for 2 people. Obviously you can't simmer over it like an isobutane stove but that's not it's intended use.",
      "rating": 4.0,
      "verified": true,
      "author": "Brian",
      "helpful_votes": 0,
      "publication_date": 20180113
    },
    {
      "title": "Tiny package well made!",
      "text": "Love this little guy. Used this on our camping trips and on weekends!",
      "rating": 5.0,
      "verified": true,
      "author": "Vikram Singh",
      "helpful_votes": 0,
      "publication_date": 20200822
    },
    {
      "title": "Awesome little cooker!",
      "text": "I was skeptical at first for it being so small but after I got it lit with some sticks it put out some heat! It's very compact and light weight and I like the fact that you can use sticks, fuel blocks or alcohol. It was easy to put together on the first use and stayed burning without having to stoke it. I'm really happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Austin",
      "helpful_votes": 2,
      "publication_date": 20170525
    },
    {
      "title": "Great stove!",
      "text": "Bought this 2 years ago but didn't use it until recently. It worked as advertised. I didn't have to use my isopro fuel. Not sure I would take this backpacking, I guess it depends on the trip. My backpacking stove and fuel is lighter than this. Great stove nonetheless. Not sure if the grill was being offered 2 years ago but I did not get a grill.",
      "rating": 5.0,
      "verified": true,
      "author": "Roland Simmons",
      "helpful_votes": 0,
      "publication_date": 20200730
    },
    {
      "title": "Great little stove",
      "text": "I wanted a way to teach my son about fire safely. This was a great way to do it. However i may have created the next future arsonist. Every day he now wants to make a fire in the driveway... I'm running out of scrap wood...",
      "rating": 5.0,
      "verified": true,
      "author": "Kyle Naval",
      "helpful_votes": 0,
      "publication_date": 20190214
    },
    {
      "title": "Perfect for camping/bug out bag",
      "text": "I purchased this little cooking stove for camping as well as for my 3 day assault/bug out bag. I have not used it yet, but it appears to be of great quality. I love how compact it is. Fits in my backpack without taking up much space. The added grate is a bonus.",
      "rating": 5.0,
      "verified": true,
      "author": "ICED",
      "helpful_votes": 0,
      "publication_date": 20191123
    },
    {
      "title": "Great flame",
      "text": "I really like this stove. I’ve added it t my collection because it burns readily available fuel and is very efficient. The blue flame you get from wood gasification is very hot and produces little smoke. This supplier was very quick with shipping and delivery. I order another one sent to my son.",
      "rating": 5.0,
      "verified": true,
      "author": "Mississippi Bob",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "It’s awesome! 🔥",
      "text": "I’ve had this thing for a few years now. It is amazing. I use a butane torch to start the fire and I use my battery powered mini leaf blower to feed it some oxygen to get it real hot real quick.",
      "rating": 5.0,
      "verified": true,
      "author": "Luigi",
      "helpful_votes": 0,
      "publication_date": 20200520
    },
    {
      "title": "This is our new camp stove forever!!",
      "text": "This little stove is amazing! I love how fast it boils water and cooks food, and all it takes is some sticks. We didn’t have fire starter and found it was really easy to get it started with some kindling, then keep adding bigger pieces to keep it going. It boils water SO fast, and you don’t have to worry about anything getting burnt because the fire will just die down quickly if you don’t add more fuel. We love it so much!!",
      "rating": 5.0,
      "verified": true,
      "author": "Grace",
      "helpful_votes": 0,
      "publication_date": 20200805
    },
    {
      "title": "Great flame, seems very efficient. .",
      "text": "Upside: Airflow design gives hot flame that is focused. Top refueling is easy and it takes a decent quantity of wood. Round design is in my view better than square. Downside: takes more room and weighs more than say a titanium folding stove. Overall I take this unless my pack is too full/ heavy. My boys Insist cook steaks on this at home to get that mild smokey flavor and I have got to say, it does a great job.",
      "rating": 5.0,
      "verified": true,
      "author": "tyke999",
      "helpful_votes": 0,
      "publication_date": 20190104
    },
    {
      "title": "Cool stove",
      "text": "Cool little camping stove. Very compact and lightweight traveling bag. Burns well. Will come in handy.",
      "rating": 5.0,
      "verified": true,
      "author": "XPortDawg",
      "helpful_votes": 0,
      "publication_date": 20200218
    },
    {
      "title": "Highly recomend",
      "text": "Very cool product, compact storage, bought for emergency to go bag . Fits inside alpine 775ml msr stowaway pot perfectly that I also bought (as I seen in others reviews. Very helpfull.). Think its great purchase esp for price ! Camping or emergency bag. May buy another later for camping.",
      "rating": 5.0,
      "verified": true,
      "author": "saylabud",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "a great bargain!",
      "text": "very light and compact for tucking in a backpack. it will blacken your pot or kettle but anyone who cooks this way regularly already knows this. heats water really quick with very little fuel which can be quickly gathered around camp. you do have to pick up your pot to add fuel but i certainly don't mind that. all in all it is compact, sturdy, light weight, and easy to use. oh, and i feel its very stable as compared with balancing on rocks in a large fire. a great bargain!",
      "rating": 5.0,
      "verified": true,
      "author": "Alley cat",
      "helpful_votes": 0,
      "publication_date": 20160726
    },
    {
      "title": "Get alcohol tablets",
      "text": "Ok so I’m an experienced camper and thought this was a revolutionary technology but I can’t get it to work without an alcohol tab. Which is fine it’s still wonderful purchase in terms of weight and value for money.",
      "rating": 3.0,
      "verified": true,
      "author": "Raia",
      "helpful_votes": 0,
      "publication_date": 20200701
    },
    {
      "title": "Awesome little stove",
      "text": "** This is not a review of a free product. I purchased this and all products I review.** I purchased this yesterday and it arrived on time, very quickly(I love Amazon Prime!). I am going on a multi-month-long backpacking trip and after testing it, I am thoroughly impressed. It works way better than expected/advertised. A handful of twigs and some kindling made a roaring fire, with 2-3ft flames, and it burned for about 20 minutes! Again, a HANDFUL OF TWIGS!! How awesome!! I definitely recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Vince",
      "helpful_votes": 3,
      "publication_date": 20160416
    },
    {
      "title": "LOVE uv this",
      "text": "I use pellets from my pellet grill by placing a tiny part of a starter cube. The hand full of pellets last 22 minutes and if you need more burn time the pellet are simple to load with a spoon while cooking. I have other micro burners and together I can cook regardless if I have propane or not. LOVE uv this!!",
      "rating": 5.0,
      "verified": true,
      "author": "Mark Campbell",
      "helpful_votes": 0,
      "publication_date": 20180703
    },
    {
      "title": "Great Stove.",
      "text": "It works well. I used tinder from my yard and kindling off the stick pile. It cooked a pan of beans very fast and I could roast marshmallows too. You have to be careful not to put too much fuel on it at a time. It fits inside the MSR Alpine stowaway pot 1.1 liter size. Great combination. It works with esbit cubes. Now here's what they don't tell you, if you mess around with the arrangements of the stove you can fit a small sterno stove inside to cook with. I also suspect my little alcohol stove will fit in here, but I haven't tried yet.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Homan",
      "helpful_votes": 0,
      "publication_date": 20160912
    },
    {
      "title": "Solid wood stove without the high price",
      "text": "I've used this on several extended camping and backpacking trips and, for the money, I can't imagine anything better. It's not $60 like a Solo stove, but it works. It breaks down nicely, and the additional weight in materials is worth the durability. I only wish the pot supports were a little more adjustable. In or out is all you get.",
      "rating": 4.0,
      "verified": true,
      "author": "Scott j Sample",
      "helpful_votes": 0,
      "publication_date": 20181022
    },
    {
      "title": "A pretty impressive flame from this little thing.",
      "text": "This is a fun little stove. It does take a bit getting used to. The way that works best for me is to put the small branches and leaves in first, and get a small fire going. Then put the lid with the 3 prongs on and add more wood. The flame comes shooting out of it is pretty impressively. But this thing folds up really portable. And is great to have to cook with.",
      "rating": 5.0,
      "verified": true,
      "author": "SoCal Hiker and ProspectorTop Contributor: Hiking",
      "helpful_votes": 0,
      "publication_date": 20180601
    },
    {
      "title": "Flimsy and won't last long",
      "text": "After I got this I'm packed it and looked at all the parts. it was made of very thin metal and the part that was supposed to hold your pot looks like it would only last for a few uses. I sent it back",
      "rating": 1.0,
      "verified": true,
      "author": "mike",
      "helpful_votes": 0,
      "publication_date": 20191106
    },
    {
      "title": "Garbage",
      "text": "The pot/pan claws are flimsy and one of them heated up enough to bend causing the claw to tilt so it would no longer hold a pan straight. Save yourself the trouble and purchase another type of alchohol stove.",
      "rating": 1.0,
      "verified": true,
      "author": "Troy Teixeira",
      "helpful_votes": 0,
      "publication_date": 20200203
    },
    {
      "title": "Not too shabby for the price.",
      "text": "I took it out on a camping trip with the scouts. It did pretty well. I boiled water in a MSR pot (755) in about 2 min.. good heat. My cons on this one: you have to take everything off it to load more fuel. The paws are fairly wide, I wanted to use a Clean Canteen to boil water in, but even my big canteen won't stay on the paws.. Pros: it nests great, and it actually fits in the MSR pot!",
      "rating": 4.0,
      "verified": true,
      "author": "Blue",
      "helpful_votes": 0,
      "publication_date": 20170308
    },
    {
      "title": "Excellent Little Stove",
      "text": "Saw this on YouTube and just needed to have it for my next camping trip. I love that you can use either alcohol or small sticks as your fire source. I've used the alcohol so far and it is very efficient with its heat generating capabilities and it brings a small pot of water to boil very quickly. Lightweight and compact, I certainly know how important it will be when the zombie apocalypse hits and the grid goes down. All joking aside, it is great for the amateur and experienced hiker and would be great for long backpacking trips due to its small size and low weight.",
      "rating": 5.0,
      "verified": true,
      "author": "Jon R. Zug",
      "helpful_votes": 0,
      "publication_date": 20160709
    },
    {
      "title": "Great little stove.",
      "text": "This is a great little stove. There are a couple of configurations possible and it will burn anything. I have a ceramic base I set it on just to keep the ground moisture out. I need to test it on a piece of lumber to see how well the tile insulates a table. I have some lump charcoal I need to try but being winter and wet I haven't done it. I'm planing on getting a couple more for gifts.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda T.",
      "helpful_votes": 0,
      "publication_date": 20180201
    }
  ],
  "product_meta": {
    "title": "Camping Stove Ohuhu Stainless Steel Backpacking Stove Potable Wood Burning Stoves for Picnic BBQ Camp Hiking with Grill Grid",
    "rating": 4.6,
    "feature_bullets": [
      "STURDY STAINLESS STEEL: Crafted with high quality stainless steel, this portable camping stove will steadily burn bright, whatever heavy weight or high heat comes its way",
      "STABLE AND SAFE: Geared with a 3-arm base support system, even the grassiest fields will be your personal cooking countertop, stable even in windy conditions",
      "FUELLED BY NATURE: Mother Nature presents the best fuel catalogue, with the abundance of dried twigs, leaves, pinecones and wood as nature’s perfect kindling",
      "COMPACT & LIGHTWEIGHT: Easily collapsible and lightweight, this camping stove comes with its own mesh carry bag so you can sling it along and serve up a warm piping meal wherever you’ve set up camp",
      "ENVIRONMENTALLY FRIENDLY: With no fuel canisters or alcohol needed, we’ll be leaving no chemical emissions behind. Treating the earth with extra good care, without any of the hassle"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "5.3 x 5.3 x 5.3 inches; 12.8 Ounces",
      "Date First Available": "July 21, 2015",
      "Manufacturer": "Ohuhu",
      "ASIN": "B0125U36Q2",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Outdoor Recreation",
      "Stoves & Grills",
      "Sports & Outdoors",
      "Backpacking Stoves",
      "Camp Kitchen",
      "Camping & Hiking"
    ],
    "price": ""
  }
}