{
  "website_summaries": [
    {
      "verdict": "If you are looking for a versatile eyelash serum that offers promising results for most users for a fraction of the price of higher-end brands, this is the one to choose.",
      "pros": [
        "A versatile formula that can be used on lashes and brows, and has been known to produce noticeable results",
        "Contains peptides and nourishing plant-based oils and extracts"
      ],
      "cons": [
        "Some mixed reports of length of time it takes to see results – from 2 weeks to more than a month"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "But I’m very happy with the results so far",
      "text": "I have only been using for about three weeks but I see an improvement in thickness. Not so much length yet. But I’m very happy with the results so far. I will update after another three weeks.",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth Garza",
      "helpful_votes": 11,
      "publication_date": 20180503
    },
    {
      "title": "It DOES work, just be patient!",
      "text": "I used generic Latisse for years, and it worked extremely well. But I was getting dark stains on my eyelids from it, which is a known side effect. I searched for something more natural that would give good results but not stain my kids. I chose this product after reading about and comparing numerous lash growth products on Amazon. It does work (contrary to negative reviews), but you have to use it twice daily, AM and PM... Unlike bimatoprost/Latisse, which is just once per day. You must be patient! I didn't see real results for about four weeks. I'm on my second tube. If it didn't work, I wouldn't have come back for more.",
      "rating": 5.0,
      "verified": true,
      "author": "S. M. Escott",
      "helpful_votes": 2,
      "publication_date": 20190916
    },
    {
      "title": "From no lashes to sexy eyes",
      "text": "My lashes are really thin due to age, lupus and medication. I decided to purchase insta natural after reading the reviews. In 2 weeks I noticed a significant difference in the length of my lashes which prompted me to try it on my eyebrows. I must say this girl is extremely satisfied! In a week my eyebrows were in desperate need of waxing. Will continue to use in hopes that my lashes will become fuller.",
      "rating": 5.0,
      "verified": true,
      "author": "Luvshine1",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Wish I could give it more than 5 stars!!!",
      "text": "OMG. This stuff is amazing. I honestly didn't think there was a product out there that was capable of bringing my brows back.......but I started noticing improvement a couple of weeks into using this! Will definitely buy more. I had just about lost hope after overplucking for years. Glad I didn't get rid of my tweezers, because my eyebrows are now almost as full and thick as they were 20 years ago!",
      "rating": 5.0,
      "verified": true,
      "author": "Maria Baskett",
      "helpful_votes": 3,
      "publication_date": 20160719
    },
    {
      "title": "Worth the money!",
      "text": "I had been using City Lash for about 2 yrs. and it seemed to help my lashes lengthen slightly. However, for me, it is somewhat expensive. After reading the reviews for InstaNatural Eyelash Serum and seeing how reasonable the price was, I placed an order. The shipping was incredibly fast! The tube was completely full! And within a week InstaNatural was contacting me to see how I liked the product! The serum seems to be helping my lashes and it's very easy to apply. I am also very impressed with the customer service and would order from them in the future.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Christanell",
      "helpful_votes": 0,
      "publication_date": 20160803
    },
    {
      "title": "Works well for me",
      "text": "I'm 60 years old and have virtually no eyebrows and minimal lashes ( blond and hereditary). I've been using this for only three weeks and can definitely see thicker eyebrows. They are still blond but they really are growing! Not sure yet on the lashes, may take a bit more time. The directions advise to use twice a day for 30 days before seeing results.I assumed that was how long the tube of serum was going to last. Not so! I have barely made a dent in the tube, it may last for six months. I'm very pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "N. Ross",
      "helpful_votes": 0,
      "publication_date": 20160420
    },
    {
      "title": "Saw no improvement...",
      "text": "...after MONTHS. I was looking for something to replace my Urban Decay lash serum and decided to give this a try after reading the reviews. I should have looked closer however as many were sponsored. I used this product for 3 months and saw no improvement. If you are looking for a product that works, look elsewhere.",
      "rating": 1.0,
      "verified": true,
      "author": "Charmed93",
      "helpful_votes": 3,
      "publication_date": 20170216
    },
    {
      "title": "noticeably longer lashes and brows",
      "text": "I was skeptical, but I have definitely noticed slightly longer and thicker lashes and brows. first two pictures are before, and following 3 pictures are after 4 weeks of use (sometimes twice a day, usually once a day, sometimes not used). sometimes I noticed a slight burning sensation after using the product. I would purchase the product again.",
      "rating": 5.0,
      "verified": true,
      "author": "Smita",
      "helpful_votes": 0,
      "publication_date": 20190915
    },
    {
      "title": "but I feel like I'm noticing a difference",
      "text": "I haven't been using this long, but I feel like I'm noticing a difference. I may have been using the growth serum for at least 3 weeks. I have been pretty consistent with twice a day application. My lashes look more full, meaning I have more lashes. I think they also look darker! I'm not sure if they are longer, but I do notice a difference when I wear mascara. I don't need to use a primer to get a false lash effect. Overall, I think the serum is helping condition and strengthening my lashes by: -decreasing breakage -increasing growth of eye lash hairs -slightly darkening my lashes Slight Con: -mild itchiness when first applied, goes away after dried.",
      "rating": 4.0,
      "verified": true,
      "author": "Kettlynn Prophete",
      "helpful_votes": 0,
      "publication_date": 20160523
    },
    {
      "title": "This Serum Works!!!",
      "text": "I have been using this for three weeks and I can safely say, this eyelash serum has made my short thin eyelashes fuller and longer...! I have always had thin short eyelashes and never thought they could or would become longer or thicker; but this product has made a believer out of me. I use it only at night right before I go to bed. There's no irritation and within three weeks there has been a marked improvement in the length and fullest of my lashes... Thank you InstaNatural, I will continue to use this product and highly recommend it to others.",
      "rating": 5.0,
      "verified": true,
      "author": "Debi",
      "helpful_votes": 12,
      "publication_date": 20160114
    },
    {
      "title": "It works",
      "text": "This is a super product and my eyebrows are fuller and eyelashes longer. It took a while, but stay with it. This is a very good product. It is colorless, as it should be. I use it twice a day and it is very satisfactory. Lasts a long time. The questions asked by Amazon for this review make no sense. This isn't a coloring product, it is a growing product",
      "rating": 5.0,
      "verified": true,
      "author": "jbird",
      "helpful_votes": 0,
      "publication_date": 20170805
    },
    {
      "title": "FULL LASHES!!",
      "text": "very easy to use i put on at night after i have taken off makeup i put a decent coat on lash base i have accidentally gotten into eye a couple times by my own fault and there was no irritation or discoloring affect ...as far as results i have noticed that my lashes are thicker and longer and if i take an up close look i can see buds of new lashes growing at a much faster rate than normal",
      "rating": 5.0,
      "verified": true,
      "author": "lhemilie202",
      "helpful_votes": 0,
      "publication_date": 20160301
    },
    {
      "title": "Useless after 2 months, save your money",
      "text": "After 2 months of use, the is absolutely useless. Routinely applied at least once, if not twice a day and I can see absolutely no growth or thickening. Would return it if I could but as the return window is 30 days and that's as long as it takes to begin to see results, the return policy is useless. That and it did cause mild eyelid irritation and I'm not prone to sensitive skin. Save your money and buy something legit.",
      "rating": 1.0,
      "verified": true,
      "author": "SJ",
      "helpful_votes": 0,
      "publication_date": 20160423
    },
    {
      "title": "Wanted it to work... nothing",
      "text": "I wanted so much for this to work. With perimenopause my eyelashes have become thin and short. Basically invisible. I was exited to try this because it was reasonably priced and especially as it is made in my hometown. I used it twice/day religiously for 8 months and experienced NO changes. Maybe it works better of lash changes aren’t hormonal. 😕",
      "rating": 1.0,
      "verified": true,
      "author": "ainannarb",
      "helpful_votes": 0,
      "publication_date": 20200413
    },
    {
      "title": "Works for me!",
      "text": "I've only been using it for just over two weeks now, but it seems to be working nicely. I can't attest that it makes them longer, because I already had long lashes, they were just getting a little more sparse with age. I tint my lashes, so I can definitely see all the new growth, because it grows in blonde, and my existing lashes are tinted. It seems to be a lot more new growth than I had previously. Also, it filled in a sparse spot on one brow (thankfully) that I've always had trouble with. Pretty impressive after only two weeks. I'll be reordering.",
      "rating": 5.0,
      "verified": true,
      "author": "Lola the Brat",
      "helpful_votes": 0,
      "publication_date": 20160214
    },
    {
      "title": "I have noticed that my eyelashes are much fuller and am happy with the difference I see",
      "text": "I use it twice a day -- once in the morning and same in the evening. Sometimes I even apply it two layers at a time. No stinging if you are careful. I have noticed that my eyelashes are much fuller and am happy with the difference I see. Glad I took a chance on this! Edit 5/12/16 -- I've found that after using the growth serum for at least a few months, there's only so much that it can do. To me, it feels like after a while, my eyelashes stopped responding to the serum and just stayed where it was.",
      "rating": 5.0,
      "verified": true,
      "author": "DRA",
      "helpful_votes": 0,
      "publication_date": 20160220
    },
    {
      "title": "It Works",
      "text": "I thought I would try this and I'm so glad I did. It works as well, if not better than a higher priced similar product I've used in the past. I use the serum for my eyebrows and have seen an improvement, which is why I reordered it. It's much easier to see how much is left in the tube with the updated packaging. I use it twice a day and could not be happier.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda",
      "helpful_votes": 0,
      "publication_date": 20161121
    },
    {
      "title": "great product great price",
      "text": "works it actually grows the eyelashes and for a fraction of the cost of high end products takes several weeks to see the growth but I used it twice a day once in the morning and once at night. Don't be fooled by the small size this little bottle last 3 months!",
      "rating": 5.0,
      "verified": true,
      "author": "U S Man Of Steel",
      "helpful_votes": 0,
      "publication_date": 20171014
    },
    {
      "title": "Meh.  Save your money",
      "text": "I have used this religiously twice a day for almost a month and my eyelashes look the same. They aren't thicker. They aren't longer. Maybe this stuff works for some people but it isn't working for me. I have had great experiences with other eyelash enhancing products so I don't know what is different about this one. At least it wasn't expensive.",
      "rating": 2.0,
      "verified": true,
      "author": "ROXY",
      "helpful_votes": 0,
      "publication_date": 20160413
    },
    {
      "title": "DO NOT WASTE YOUR MONEY!",
      "text": "After reading the reviews and product information, I decided to give this product a try. I have used Rapid Lash in the past and received really good results but wanted to compare that to other eyelash serums on the market. I have been using Insta Natural for just over two weeks now and am seeing zero effects. If anything, my eyelashes look even shorter; as if the serum caused breakage. I will be faithful (hopeful) and continue the product for another week or so to see if anything positive occurs with lash growth. But so far, am extremely disappointed. Wish they offered a money back guarantee.",
      "rating": 1.0,
      "verified": true,
      "author": "Makeup Guru",
      "helpful_votes": 0,
      "publication_date": 20160504
    },
    {
      "title": "Eureka!",
      "text": "Love this product! After eye surgery many years ago my eyebrow stopped producing. Strange look with one eyebrow, you say. Right. Am on my second tube of your eyelash enhancing serum (used on the brows) and gradually the brow has regrown. Now am using it on both brows and eyelashes. Not only does it work but the price is right! Thank you for a great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Twinkle Toes",
      "helpful_votes": 0,
      "publication_date": 20160621
    },
    {
      "title": "Did not work!",
      "text": "I used itt for 2 months and absolutely nothing happened for me! It may work for someone else.",
      "rating": 1.0,
      "verified": true,
      "author": "Sally",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "Ok product, but be consistent with use.",
      "text": "My lashes are getting longer, but not thicker. I don't use it every day because I sometimes forget. I use it on my brows as well, and I see a little improvement, as my brows are sparse.",
      "rating": 3.0,
      "verified": true,
      "author": "Mrs. Frazier ",
      "helpful_votes": 0,
      "publication_date": 20160906
    },
    {
      "title": "Unsure",
      "text": "I've given this a couple weeks now before writing my review! I haven't really noticed a difference in my brows or lashes!!! But with that said the product I was using prior to this was an exceptional product, \"revitalash\"! It is little more pricey but sometimes you get what you pay for!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160501
    },
    {
      "title": "Amazing",
      "text": "I have been using this for about a month and have seen a tremendous amount of growth on my brows, as a matter of fact I started seeing results in as little as a week. I am diligent about putting on every evening. I can truly say that it does promote growth, hands down",
      "rating": 5.0,
      "verified": true,
      "author": "Mitch",
      "helpful_votes": 0,
      "publication_date": 20160827
    },
    {
      "title": "I feel like my eyelashes are longer than before",
      "text": "It does burn the eye a little if it gets in. I feel like my eyelashes are longer than before. But I didn't take pictures before I started using this so I cannot be sure. I'm using it twice a day on most days unless I forget.",
      "rating": 4.0,
      "verified": true,
      "author": "Bo Zhai",
      "helpful_votes": 0,
      "publication_date": 20160516
    },
    {
      "title": "Didn't See Any Change",
      "text": "For a long time I used the serum methodically every day but haven't seen any changes to my eyelashes. I love all of the Instanatural skin care products I've tried but unfortunately the eyelash serum didn't work for me.",
      "rating": 2.0,
      "verified": true,
      "author": "Brit",
      "helpful_votes": 0,
      "publication_date": 20171001
    },
    {
      "title": "Recommend",
      "text": "Great value! Started seeing results a month or so in.",
      "rating": 5.0,
      "verified": true,
      "author": "Viviana",
      "helpful_votes": 0,
      "publication_date": 20200320
    },
    {
      "title": "The product did not work at all for me. ...",
      "text": "The product did not work at all for me. I used it daily for 3 months solid. My lashes did not grow any longer, nor were they more thick. I can say that I lost more lashes than usual while using the product, and if any got in my eye, it did sting a little.",
      "rating": 2.0,
      "verified": true,
      "author": "Rebecca M",
      "helpful_votes": 0,
      "publication_date": 20161005
    },
    {
      "title": "I've, Been using this and I have yet to ...",
      "text": "I've, Been using this and I have yet to see any difference it doesn't work for me . And I developed a slight irration from the product i won't bye this again . In the meantime I'm looking for a different product.",
      "rating": 1.0,
      "verified": true,
      "author": "Ashley",
      "helpful_votes": 0,
      "publication_date": 20160419
    },
    {
      "title": "Didn't work on my eyebrows",
      "text": "Try this on my eyebrows but had no luck even with consistent nightly use.",
      "rating": 1.0,
      "verified": true,
      "author": "Me",
      "helpful_votes": 0,
      "publication_date": 20200608
    },
    {
      "title": "This product did not work for me.",
      "text": "This product does not work as expected. I've been using it faithfully twice a day and see no new growth. Eyebrows are the same as when I started using this product.",
      "rating": 1.0,
      "verified": true,
      "author": "Patricia",
      "helpful_votes": 2,
      "publication_date": 20160131
    },
    {
      "title": "My experience has been great and I'm so happy I found this product",
      "text": "Thank you InstaNatural for delivering a product that met my expatations. I found your lash serum to emprove my lash and brow length. My experience has been great and I'm so happy I found this product. I feel great at 55 and even better now because my lashes look as they did in my teens. Longer, fuller more beautiful! I've been using the lash serum for 4 months now and love my results. Michelle",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170106
    },
    {
      "title": "I have been using this product for about a month ...",
      "text": "I have been using this product for about a month have not seen much change yet but I'm hoping",
      "rating": 3.0,
      "verified": true,
      "author": "Lonnie Franklin",
      "helpful_votes": 0,
      "publication_date": 20161025
    },
    {
      "title": "Took a good two months to really see results but knowing that ...",
      "text": "Works wonders! Fuller and longer lashes. Took a good two months to really see results but knowing that hair grows in cycles I wasn't expecting overnight results. Very pleased!",
      "rating": 5.0,
      "verified": true,
      "author": "slp2010",
      "helpful_votes": 0,
      "publication_date": 20161008
    },
    {
      "title": "It burned so bad. I had to return it",
      "text": "I couldn't use this. It burned so bad. I had to return it.",
      "rating": 2.0,
      "verified": true,
      "author": "Melanie K.",
      "helpful_votes": 0,
      "publication_date": 20180326
    },
    {
      "title": "So far so good...",
      "text": "It's been five weeks. My lashes have stopped falling out, filled in a little, and I have one long lash! :-) I'm hoping a few more weeks will make a bigger difference.",
      "rating": 4.0,
      "verified": true,
      "author": "Janet",
      "helpful_votes": 0,
      "publication_date": 20161021
    },
    {
      "title": "Great product",
      "text": "I've used lots of products to help with lash growth/health and I really like this product. Less are falling out, darker fuller lashes, not to mention the growth. Product arrived fast, new in box and exactly as described. Will be returning!",
      "rating": 5.0,
      "verified": true,
      "author": "Amie",
      "helpful_votes": 0,
      "publication_date": 20160116
    },
    {
      "title": "This product is amazing. I have used it on and off for ...",
      "text": "This product is amazing. I have used it on and off for about two months, applying every other day only at night and it still has made my lashes grow tremendously. My bottom lashes were almost non existent and now you can actually see them and put product on them. My eyelashes are fuller and longer.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160705
    },
    {
      "title": "One Star",
      "text": "Did not work it seems like it's water in the container.",
      "rating": 1.0,
      "verified": true,
      "author": "Love of Books",
      "helpful_votes": 0,
      "publication_date": 20170109
    },
    {
      "title": "Definitely noticed that eyelashes seem a bit longer.",
      "text": "I ordered this product a couple of weeks ago and I can already see a difference, I have not been applying it twice a day as instructed usually at night but not in the morning. I did sting a bit upon first using it, but now have not had that issue.",
      "rating": 4.0,
      "verified": true,
      "author": "O. Finch",
      "helpful_votes": 0,
      "publication_date": 20160512
    },
    {
      "title": "If anything it seemed to make my eyelashes worse. Will not buy again",
      "text": "Applied for two months with no positive results. If anything it seemed to make my eyelashes worse. Will not buy again.",
      "rating": 1.0,
      "verified": true,
      "author": "Sean Galloway",
      "helpful_votes": 0,
      "publication_date": 20160730
    },
    {
      "title": "Does not work",
      "text": "Does not work. I have tried other brands with great results. I tried this one because its a lot cheaper and ordered 2 for a friend and me, after months daily use we both see no difference. I dont recommend it.",
      "rating": 1.0,
      "verified": true,
      "author": "Marsha",
      "helpful_votes": 0,
      "publication_date": 20161027
    },
    {
      "title": "A little disappointed in wasting my money on this product",
      "text": "Not sure this product even caused eyelashes to grow. I did not notice a thing different. A little disappointed in wasting my money on this product.",
      "rating": 1.0,
      "verified": true,
      "author": "H.I.L.",
      "helpful_votes": 0,
      "publication_date": 20160421
    },
    {
      "title": "Great product",
      "text": "Grew my eyelashes back to normal due to pulling from removing individual false lashes after 2 weeks. Great product",
      "rating": 4.0,
      "verified": true,
      "author": "kwa",
      "helpful_votes": 0,
      "publication_date": 20160410
    },
    {
      "title": "love it! I saw new lashes come in within ...",
      "text": "This product works, love it! I saw new lashes come in within 2 weeks. Works 100 times better than Rapid Lash.",
      "rating": 5.0,
      "verified": true,
      "author": "Patti Bergmann",
      "helpful_votes": 0,
      "publication_date": 20160501
    },
    {
      "title": "I immediately went back to using RapidLash and everything was fine again.",
      "text": "As soon as I started using it my lashes started falling out! I immediately went back to using RapidLash and everything was fine again.",
      "rating": 1.0,
      "verified": true,
      "author": "DolceSoprano",
      "helpful_votes": 2,
      "publication_date": 20160202
    },
    {
      "title": "Insta Natural Eyelash Boost",
      "text": "This eyelash booster did seem to thicken lashes a bit.",
      "rating": 4.0,
      "verified": true,
      "author": "Debi Harris",
      "helpful_votes": 0,
      "publication_date": 20170105
    },
    {
      "title": "There are other products that are far better than this",
      "text": "This is just not what I expected. There are other products that are far better than this one",
      "rating": 1.0,
      "verified": true,
      "author": "Dee S.",
      "helpful_votes": 0,
      "publication_date": 20160201
    },
    {
      "title": "Easier than Latisse and much more cost effective Eyelash serum.",
      "text": "Love the easy application; now can't wait for amazing results. Much easier than Latisse with those little brushes...",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20160504
    },
    {
      "title": "wasn't a good fit for me",
      "text": "I was using Lash & Brow Elixir- Biotin Infused Eyelash & Eyebrow Serum for weeks and then switched over to this one.....my lashes started falling out and caused irritation....wasn't a good fit for me :(",
      "rating": 3.0,
      "verified": true,
      "author": "newbie",
      "helpful_votes": 0,
      "publication_date": 20161024
    },
    {
      "title": "One Star",
      "text": "It made my eye site blurry!! Don’t buy this product!!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180813
    },
    {
      "title": "... I would try a different brand & was very disappointed with this product",
      "text": "I thought I would try a different brand & was very disappointed with this product. I did not notice any difference in my lashes even after recommended use.",
      "rating": 1.0,
      "verified": true,
      "author": "Abigail R.",
      "helpful_votes": 0,
      "publication_date": 20160822
    },
    {
      "title": "I used it in the morning and at night for ...",
      "text": "I used it in the morning and at night for 2 months straight, and there is no difference at all. Also it hurts eyes if it gets inside.",
      "rating": 1.0,
      "verified": true,
      "author": "Alenka",
      "helpful_votes": 0,
      "publication_date": 20180608
    },
    {
      "title": "DOESNT WORK AT ALL!",
      "text": "Worst ever! Does not work at all and is no comparison to Latisse.",
      "rating": 1.0,
      "verified": true,
      "author": "wendyb",
      "helpful_votes": 0,
      "publication_date": 20170123
    },
    {
      "title": "One Star",
      "text": "Didn't really change the thickness of my eyelashes after a month of use.",
      "rating": 1.0,
      "verified": true,
      "author": "Debra R.",
      "helpful_votes": 0,
      "publication_date": 20161017
    },
    {
      "title": "Great product!",
      "text": "I only use it once a day and have seen a difference in just a few weeks!",
      "rating": 5.0,
      "verified": true,
      "author": "Brandy McCoy",
      "helpful_votes": 0,
      "publication_date": 20200301
    },
    {
      "title": "Four Stars",
      "text": "haven't used this product long enough to see any results.",
      "rating": 4.0,
      "verified": true,
      "author": "Missouri customer",
      "helpful_votes": 0,
      "publication_date": 20160308
    },
    {
      "title": "I will not buy this product again Latisse is the best serum I've used",
      "text": "Not impressed. I will not buy this product again Latisse is the best serum I've used....results were awesome with Latisse.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160528
    },
    {
      "title": "Five Stars",
      "text": "3 weeks of use and notice slight increase in volume..",
      "rating": 5.0,
      "verified": true,
      "author": "KrisSh",
      "helpful_votes": 0,
      "publication_date": 20160627
    },
    {
      "title": "Burned my eyes terribly. This is definitely not natural",
      "text": "Burned my eyes terribly. This is definitely not natural. Please spend the extra money for a product that won't hurt your eyes.",
      "rating": 1.0,
      "verified": true,
      "author": "ACThomas",
      "helpful_votes": 0,
      "publication_date": 20170919
    },
    {
      "title": "Didnt work for me. Burned my eyes everytime i ...",
      "text": "Didnt work for me. Burned my eyes everytime i put it in my lashes too.",
      "rating": 1.0,
      "verified": true,
      "author": "Kim Antunez",
      "helpful_votes": 0,
      "publication_date": 20170411
    },
    {
      "title": "Very disappointed",
      "text": "Have been using this product morning and night for 2 months and did not work! Very disappointed",
      "rating": 1.0,
      "verified": true,
      "author": "debra cabral",
      "helpful_votes": 0,
      "publication_date": 20170212
    },
    {
      "title": "The product is amazing but there is WAY too much packaging for such ...",
      "text": "The product is amazing but there is WAY too much packaging for such a tiny shipment. Whatever happened to trying to safe the planet???",
      "rating": 3.0,
      "verified": true,
      "author": "Michael M.",
      "helpful_votes": 0,
      "publication_date": 20160519
    },
    {
      "title": "I would like to see more length added as well",
      "text": "It has thickened my lashes; however, I would like to see more length added as well. I have been using it for about 9-10 weeks now.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160608
    },
    {
      "title": "Scarse results",
      "text": "Does not help anything. Results after four weeks use: zero.",
      "rating": 1.0,
      "verified": true,
      "author": "Niina Virtala",
      "helpful_votes": 0,
      "publication_date": 20170406
    },
    {
      "title": "Three Stars",
      "text": "Used a third of the tube already and not much growth for my lashes :(",
      "rating": 3.0,
      "verified": true,
      "author": "Becky",
      "helpful_votes": 0,
      "publication_date": 20170120
    },
    {
      "title": "Very prompt delivery. Seems to be working well. ...",
      "text": "Very prompt delivery. Seems to be working well. I haven't used it for a long time, but no complaints so far. Thanks",
      "rating": 4.0,
      "verified": true,
      "author": "Barb Williams",
      "helpful_votes": 0,
      "publication_date": 20151230
    },
    {
      "title": "Must have!",
      "text": "Already see a difference in length and fullness. It's kinda crazy how quickly it works!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20151220
    },
    {
      "title": "Two Stars",
      "text": "This product does not satisfy me by using already two weeks.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160516
    },
    {
      "title": "Love!",
      "text": "Love this product! Will be buying again! I could see a difference in 2 weeks!",
      "rating": 5.0,
      "verified": true,
      "author": "TVinlove",
      "helpful_votes": 0,
      "publication_date": 20160421
    },
    {
      "title": "I've used Rapid Lash with modest success in the past ...",
      "text": "I've used Rapid Lash with modest success in the past, but when Amazon wasn't offering it, I bought this instead. I lost all the gains I had with Rapid Lash and didn't feel it worked at all. Can't explain why some people feel it does work.",
      "rating": 1.0,
      "verified": true,
      "author": "Suburbs girl",
      "helpful_votes": 2,
      "publication_date": 20160307
    },
    {
      "title": "Omg",
      "text": "This really made my eyelashes full and just a little longer.",
      "rating": 4.0,
      "verified": true,
      "author": "Luis Ruiz",
      "helpful_votes": 0,
      "publication_date": 20160104
    },
    {
      "title": "The jury is still out on this",
      "text": "There is no color to this serum. I am still looking for more eyelashes.... Can't see any difference. But, in all fairness to the product, I have not been consistent in using it.",
      "rating": 3.0,
      "verified": true,
      "author": "kphaTop Contributor: Baking",
      "helpful_votes": 0,
      "publication_date": 20161007
    },
    {
      "title": "Not worth it!! WASTE OF MONEY!!!",
      "text": "I have been using for weeks without any obvious results at all. Not sure how long this takes but I used a different brand before and results were more obvious. I want my money back!!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160429
    },
    {
      "title": "I used Lumigan (same as latisse bought from Mexico) and it always worked like wonders within the same period of time and nobody",
      "text": "I used it diligently for more than two months now and I don't see noticeable changes. Trust me if any I would have noticed. I used Lumigan (same as latisse bought from Mexico) and it always worked like wonders within the same period of time and nobody could miss that kind of change. Seriously Lumigan made all women jealous of my eyelashes. I was hoping that this would do the same. I am still using it because it's here but I just don't think it would work. Plus people are all right about the stinging. It does sting.",
      "rating": 1.0,
      "verified": true,
      "author": "D. N. Elizondo",
      "helpful_votes": 8,
      "publication_date": 20160204
    },
    {
      "title": "Unbelievable!",
      "text": "I have used Rapidlash for years and was very pleased with the results, but I thought I would try the InstaNatural Growth Serum for a change. I saw a difference in length in two days! It is a clear liquid that ideally is used twice a day. It can sting for a moment if it enters the eye but nothing unbearable. My lashes are soft, thick and long. There is quite a bit in the tube so I feel it will last much longer than Rapidlash. I love it.",
      "rating": 5.0,
      "verified": true,
      "author": "4 Fleurs",
      "helpful_votes": 2,
      "publication_date": 20160128
    },
    {
      "title": "In love with this!!!!",
      "text": "Love it!!! I've only been using it once daily for about 20 days now and can already see a huge difference. My lashes have never been very long and always been on the thin side. Since using this, they are growing longer and fuller. I will definitely keep this as a part of my daily routine.",
      "rating": 5.0,
      "verified": true,
      "author": "Lane",
      "helpful_votes": 11,
      "publication_date": 20160418
    },
    {
      "title": "Good product",
      "text": "I got scared for using this product too closely to my eyes after a friend told me some eyeball horror stories of similar products so I opted for JUST castor oil instead. I still however use this product for my thin eyebrows and it works GREAT!! I can actually see the little sprouts of hairs growing in just under 2 weeks.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20160829
    },
    {
      "title": "A noticeable improvement in my lashes",
      "text": "Even without mascara I could see my blond lashes. I used it as a base before using mascara ( using a disposable mascara brush) and the mascara went on without the lashes sticking to each other. Great product",
      "rating": 5.0,
      "verified": true,
      "author": "B. Maidenberg",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "works for me",
      "text": "Well, I've been using it for six months now. At first if you're looking, it doesn't stand out, but then you start seeing the results. My eyelashes are longer, even the bottom lashes are longer and in density too. I really got it for my eyebrows and are denser now. After I saw results, I use it only once a day. It's not an overnight or a month process, but slow and steady. The tube lasted a long time and only yesterday ordered my second! I recommended it to a friend and hopefully she ordered it. I'm in my late sixties so anything which will help me appear younger is highly welcomed that isn't harmful to my eyes!",
      "rating": 5.0,
      "verified": true,
      "author": "YAC",
      "helpful_votes": 0,
      "publication_date": 20151230
    },
    {
      "title": "Very happy with it",
      "text": "Noticeable difference on eyelashes after about 2 months. Especially on my lower eyelashes. Very happy with it. I also applied to my eyebrows to make them a little fuller, but haven't seen any results. I applied this about 3 or 4 times a week. I'm sure if I do it every night I would see even better results. My eyes are sensitive, and if I put too much on, it irritates it a bit, but it's not a painful burn or anything.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Applebaum",
      "helpful_votes": 0,
      "publication_date": 20170315
    },
    {
      "title": "... well-conditioned eyelashes (and smoothing of my eyelid skin - nice bonus), 5 stars because this company has some ...",
      "text": "though all i really experienced was well-conditioned eyelashes (and smoothing of my eyelid skin - nice bonus), 5 stars because this company has some of the nicest customer services reps that i have EVER encountered, they are readily accessible for questions, advice, etc., and most of all, they have integrity, honesty, and courtesy, a rare combination these days. i trust and respect them and recommend anyone interested to give their products a try - this is a lovely company! thank you for all of your help!",
      "rating": 5.0,
      "verified": true,
      "author": "horsewoman",
      "helpful_votes": 0,
      "publication_date": 20160415
    },
    {
      "title": "faulty bottle",
      "text": "I love Instanatural lash serum, and have seen amazing results for years. However this seller gave me a bottle that was half used, resealed, foggy, thick and over 1 year expired. I recommend finding a credible, amazon prime seller.",
      "rating": 1.0,
      "verified": true,
      "author": "Dadman",
      "helpful_votes": 0,
      "publication_date": 20190827
    },
    {
      "title": "Better for brows. Made lashes break.",
      "text": "I have been using this product for about a month and it has done nothing for my lashes. As a matter of fact they are actually breaking off. However, I also decided to apply it to my scarce thin eyebrows and have noticed those are filling in. So I'm not sure why it's so effective for my brows and not my lashes. I had better luck for my lashes with RapidLash, but that product did nothing for my brows. So, guess I'll be using two different products for my brows and lashes. This one for brows and RapidLash for lashes.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160511
    },
    {
      "title": "So far, so good!",
      "text": "I have only used this a few times now, but it already seems to be working well. I think my lashes respond really well to any growth serum because I really haven't found one that hasn't worked so far. I did get a little that seeped into my eye and it did sting, but that is user error I suppose :) So far, so good!",
      "rating": 5.0,
      "verified": true,
      "author": "Allison",
      "helpful_votes": 0,
      "publication_date": 20160329
    },
    {
      "title": "Didn't really work.",
      "text": "I didn't notice any difference after using it for a month. I will probably go back and use Latisse. There were no side effects that I could see. Update: Vendor has reached out to offer product replacement. I will definitely try another product. Thank you for reaching out.",
      "rating": 3.0,
      "verified": true,
      "author": "Danika",
      "helpful_votes": 0,
      "publication_date": 20160809
    },
    {
      "title": "Get Latisse - it'll actually work",
      "text": "The only reviews I could find on this product BEFORE I bought it, were from those who had been \"given\" the product to try. ALL their reviews were the same: \"best product ever.\" I was dubious. Turns out I was right. Don't believe the hype. I'm now using Latisse and have terrific lashes.",
      "rating": 2.0,
      "verified": true,
      "author": "JClo in the Great White North",
      "helpful_votes": 0,
      "publication_date": 20161209
    },
    {
      "title": "burns and stings my eyes because it's too watery",
      "text": "This is going in the trash - it is far too watery and seeps through my lashes into my eyes. It stings terribly! I've tried wiping off any excess serum on the wand prior to application, but it still leaks into my eyes and burns. It needs to be thicker, like a gel, to stay put.",
      "rating": 1.0,
      "verified": true,
      "author": "queenmum",
      "helpful_votes": 0,
      "publication_date": 20160622
    },
    {
      "title": "Jury is out...",
      "text": "You're supposed to apply 2x daily. I have, for about 3 weeks and I can't see any difference. Giving it more time, which is why I'm not rating it lower. Latisse is still my favorite - albeit pricier - product for guaranteed lash growth. I was hoping to find a less expensive alternative.",
      "rating": 3.0,
      "verified": true,
      "author": "deneeno",
      "helpful_votes": 0,
      "publication_date": 20160528
    },
    {
      "title": "Purchased my own, so glad I did!",
      "text": "While it took me a while to see results, I'm really glad I stuck with this product. The longer I use this the longer and fuller my lashes are. I've recently decided to try it in my brows too, so we'll see what happens there! The product is affordable, a tube is good for a year, and a little goes a long way -I've been using it for probably 5 months now, and I'm not even 1/4 of the way through my first tube yet. I purchased this product with my own money, and I'll probably repurchase it when I run out.",
      "rating": 4.0,
      "verified": true,
      "author": "Melissa Henneman",
      "helpful_votes": 0,
      "publication_date": 20160524
    },
    {
      "title": "Lashes!  Finally!!",
      "text": "I am actually growing eyelashes!! I was a little nervous about using it. I have lens implants and was a little apprehensive about using this because I have lens implants. However, it has caused NO problems!! I am actually growing eyelashes!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Marty Colletti",
      "helpful_votes": 0,
      "publication_date": 20160411
    },
    {
      "title": "Only few weeks of use after removing eyelash extensions and ...",
      "text": "Only few weeks of use after removing eyelash extensions and longer lashes and fullness evident!!! Instanatural never dissapoints! I wear contact lenses as well, and while i do not apply product while wearing lenses; i have not experienced any irritation.",
      "rating": 5.0,
      "verified": true,
      "author": "mary",
      "helpful_votes": 0,
      "publication_date": 20160303
    },
    {
      "title": "Disappointed",
      "text": "Easy application, however it did not make any difference to me. used it for 2 month twice a day regularly and did not see any difference. The product tends to run into my eye and irritates me.",
      "rating": 1.0,
      "verified": true,
      "author": "Amani Alsaery",
      "helpful_votes": 0,
      "publication_date": 20161205
    },
    {
      "title": "love it.",
      "text": "This works wonder really... love it.. Bought more for my friends cousin and aunt coz they were amazed the changes it does to my eyelashes and brows... So far, they are also enjoying the growth of their lashes and brows.. Highly recommended...",
      "rating": 5.0,
      "verified": true,
      "author": "Jovie S.",
      "helpful_votes": 0,
      "publication_date": 20160406
    },
    {
      "title": "Couldn’t Use",
      "text": "Could not use. Used one night and made my eyes hurt. Threw away.",
      "rating": 1.0,
      "verified": true,
      "author": "Betty R.",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "It works!",
      "text": "Yes, it takes several weeks to see effects...but my lashes are noticeably longer and thicker. Best serum I've ever tried, with the exception of Lilash, which can no longer be sold in the US.",
      "rating": 4.0,
      "verified": true,
      "author": "Jwn999",
      "helpful_votes": 0,
      "publication_date": 20160520
    },
    {
      "title": "Burns the crap out of my eyes",
      "text": "Burns the crap out of my eyes, only used a few days before I got too scared I was going to mess up my eye site or something",
      "rating": 1.0,
      "verified": true,
      "author": "Taylor",
      "helpful_votes": 0,
      "publication_date": 20161101
    },
    {
      "title": "Unfortunately this item did not work for me my eyes ...",
      "text": "Unfortunately this item did not work for me my eyes were watering and I had a reaction but I have tried other brands that I did buy and I'm excited because I know they work thank you",
      "rating": 1.0,
      "verified": true,
      "author": "Silvia Manning",
      "helpful_votes": 2,
      "publication_date": 20160314
    },
    {
      "title": "It’s works hella good",
      "text": "I never write reviews but this stuff works and works fast.",
      "rating": 5.0,
      "verified": true,
      "author": "aryn",
      "helpful_votes": 0,
      "publication_date": 20200515
    }
  ],
  "product_meta": {
    "title": "Eyelash & Eyebrow Boost Serum - Rapid & Fast Lash Care for Long, Thick & Fuller Eyelashes & to Enhance Brows - With Peptides, Organic Vitamins & Premium Xlash Liquid Formula - InstaNatural - 10 ml",
    "description": "InstaNatural's Eyelash Enhancing Serum is a powerful formula that gives ordinary-looking lashes a more luxurious appearance. This advanced blend uses clinically-proven ingredients to visibly lengthen and thicken lashes.",
    "rating": 3.6,
    "feature_bullets": [
      "PROVEN RESULTS - Using a powerful peptide formula, this product helps grow and renew lashes without eye irritation. Featuring SymPeptide XLash with Pentapeptide-17, this serum strengthens eyelashes with 3x the amount of active ingredients that nourish and strengthen lashes.",
      "CLINICALLY PROVEN WITH PURE, ORGANIC INGREDIENTS - Extensive clinical testing has shown that this serum increases the length and density of lashes by as much as 26% after just two weeks of use and up to 66% in just a month.",
      "LUSH EYELASHES - This gel serum is a blend of advanced ingredients that visibly boost the natural length and thickness of eyelashes. It doesn't just fill the spaces where your eyelashes are normally sparse; it transforms your lashes too.",
      "ESSENTIAL FOR ULTIMATE BROWS - In addition to lengthening and plumping lashes, this serum will add volume into brows as well. Get the confidence of an amazing new look all without the need for expensive, time consuming makeup or extension application."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "3 x 4 x 4 inches; 0.71 Ounces",
      "Item model number": "3Y-YSH1-B4BV",
      "UPC": "616913954981",
      "Manufacturer": "InstaNatural, LLC",
      "ASIN": "B012P6AX4E",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Makeup",
      "Lash Enhancers & Primers",
      "Eyes",
      "Beauty & Personal Care"
    ],
    "price": ""
  }
}