{
  "website_summaries": [
    {
      "verdict": "Keep mud and dirt outside where it belongs with this mountable scrubber.",
      "pros": [
        "Easily mount to any floor with included hardware",
        "Indoor or outdoor use",
        "Treated maple finish",
        "Tough, rigid bristles easy remove debris from boots",
        "Mounts easily to wood"
      ],
      "cons": [
        "Coarse bristles may scratch leather"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Solid Product, Great Value.",
      "text": "I mounted this into the cement pad at the bottom of my back deck stairs using over-sized concrete anchors. I’ve had it about 4 months and use it multiple times daily to remove dirt, mud, chicken poop etc. it works great. I hose it off every once in a while and it’s good to go. If you have these conditions around your place, you can’t go wrong with this boot cleaner",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa N",
      "helpful_votes": 24,
      "publication_date": 20180304
    },
    {
      "title": "Great product",
      "text": "We mounted the product on boards to help step on either side to clean shoes/boots before entering the house. Very sturdy. Gets the job done.",
      "rating": 5.0,
      "verified": true,
      "author": "katrin  s",
      "helpful_votes": 4,
      "publication_date": 20200102
    },
    {
      "title": "Heavy duty, does the job",
      "text": "Works great and very heavy duty metal and wood construction. Should last a very long time until the bristles wear out. Bristles for the bottom of the shoe/boot are more firm than the side bristles which is good to help get the mud off the bottom but softer bristles won't damage/scratch up the sides of my shoes. You'll obviously want to mount it somewhere that you can hose it down after using it which I had to do since I'm scraping mostly mud off.",
      "rating": 5.0,
      "verified": true,
      "author": "The Millers",
      "helpful_votes": 5,
      "publication_date": 20170322
    },
    {
      "title": "Wood pieces won’t last outdoors",
      "text": "I like the look of wood, so I ordered this one. It’s at a boot cleaning station where is gets splashed some and is in the sun. Wood is already cracking at 6 months. The ones with the plastic inside the metal frame would have lasted forever except they don’t really withstand being ran over too many times by trucks. Even at that though, we bend them back out and they were good for another year! :D. Eventually the metal broke.",
      "rating": 2.0,
      "verified": true,
      "author": "Mel's Mrs.",
      "helpful_votes": 0,
      "publication_date": 20190629
    },
    {
      "title": "Doesn't get the bottom of shoes",
      "text": "Ordered this and realized #1 it needs to be staked down or somehow put on something to keep it in place. I have it at my back door but don't have anything to keep it in place which doesn't work well. #2 It only gets the side of the shoes. Our biggest problem is what is on the bottom of shoes and there is nothing to get that off. I am sure this works for a lot of people as it got great reviews but it definitely doesn't work for me.",
      "rating": 2.0,
      "verified": true,
      "author": "just jen",
      "helpful_votes": 0,
      "publication_date": 20190618
    },
    {
      "title": "Well Worth Every Penny",
      "text": "I ordered the Boot Brush cleaner because my wife made me spend a lot of money on boots for the winter. Throughout the winter, salt and dirt had accumulated on them and didn't want it to start eating away at my boots. The brush was very efficient cleaning both the bottom and side of my boots at the same time. I was honestly expecting the bristles to be flimsy but I am pleasantly surprised at how durable they are. Another important thing to note is that the bristles didn't scratch my shoes AT ALL!! This was a great purchase to protect my investment!",
      "rating": 5.0,
      "verified": true,
      "author": "Marc",
      "helpful_votes": 3,
      "publication_date": 20170314
    },
    {
      "title": "So far so good. I've had this up for a couple months ...",
      "text": "So far so good. I've had this up for a couple months now and it seems to be doing the job well. I only have one pair of tennis shoes that sometimes still have a little mud in them, but I think that has more to do with the shoes. They have really deep rubber treads on the bottom which allows dirt and mud to get stuck in them. This gets about 90% of the mud out of those and all of the mud out of everything else that I wear. This was a huge help as I am constantly tracking mud in the house (It seems to rain almost every day at my house and our grass is patchy).",
      "rating": 5.0,
      "verified": true,
      "author": "Jacob",
      "helpful_votes": 2,
      "publication_date": 20160824
    },
    {
      "title": "Works somewhat but not as well as I expecteds.",
      "text": "Not as good as I hoped. Our problem is millions of fir needles that cling to our shoes on our daily walks. They break into little bits and pieces and this brush gets about half of them. Also the included screws were unsuitable for fastening to a wooded deck. The first one I tried promptly stripped out and it took quite a while to remove it with a vise grip tool. I used #10 X 3/4\" hex head sheet metal screws.",
      "rating": 3.0,
      "verified": true,
      "author": "Michael J. Hertel",
      "helpful_votes": 0,
      "publication_date": 20171026
    },
    {
      "title": "Not weighted therefore flimsy",
      "text": "Overall I'm not impressed with this product. You have to permanently install it because the metal is not heavy enough to just leave it free standing. I'm not a fan of having to screw it into a wood deck or plank. Not to mention my doorstep is cement. I just find this product very inconvenient because it's not weighted. Forget sticking your boot through this because it'll fly all around if it's not secured to a fixed ground.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181223
    },
    {
      "title": "Works great to clean your shoes !!",
      "text": "I have this mounted outside on the sidewalk right before you walk into my house, it does a fantastic job cleaning the mud and debris off of your shoes but be very careful as if you use this on any delicate shoes the bristles will likely destroy them or mark them up, but this is to be expected, great for work boots or tennis shoes",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190813
    },
    {
      "title": "Not for every day use!",
      "text": "Side brushes are made with wood and being outside all the time in many weather situations it becomes weak. Mine was in use for 4 months before the wood on the side brushes split and broke. Now it's unusable. Will now have to buy another brand boot brush scraper.",
      "rating": 1.0,
      "verified": true,
      "author": "WalterRadz",
      "helpful_votes": 2,
      "publication_date": 20181220
    },
    {
      "title": "Should state only could use certain size shoes on it",
      "text": "The product only can fit certain size shoes in it should start that I purchase alot from Amazon and this item I am very disappointed in it",
      "rating": 1.0,
      "verified": true,
      "author": "larry",
      "helpful_votes": 3,
      "publication_date": 20190418
    },
    {
      "title": "As advertised",
      "text": "This item must be mounted on some sort of base. The brushes are stiff enough to remove grass and dirt. We've had it about 2 months and the bristles seem to be holding up pretty well. Training kids and dogs to use it before entering the house is the problem!",
      "rating": 5.0,
      "verified": true,
      "author": "martha",
      "helpful_votes": 0,
      "publication_date": 20200415
    },
    {
      "title": "Bought this boot brush and it is working great, I mounted it directly to my garage entry ...",
      "text": "Bought this boot brush and it is working great, I mounted it directly to my garage entry way so we can clean our shoes before entering the house. I would recommend a permanent mount for this item. The bristles are stiff and do a really good job getting the dirt off our shoes. Kids love it and think it is really neat and it keeps their soccer cleats clean.",
      "rating": 5.0,
      "verified": true,
      "author": "ICT",
      "helpful_votes": 0,
      "publication_date": 20170311
    },
    {
      "title": "Clean Boots",
      "text": "This thing is really awesome. I use these all the time at the golf course for my shoes. Never thought of purchasing one for my home. Not just for golf shoes, but it works great for my muddy boots. Helps keep bottom and sides clean so that you are not tracking dirt and mud every where. It includes screws and anchors to make it stable to the ground. Great idea!",
      "rating": 5.0,
      "verified": true,
      "author": "TJN",
      "helpful_votes": 0,
      "publication_date": 20170311
    },
    {
      "title": "works like a champ and easy to wash out.",
      "text": "My wife and I own a lake home in Minnesota. That area has some of the darkest soil I have ever seen. This scrubber makes a huge difference with the amount of that soil brought into the home. We screwed it to our deck so it does not move. There are openings in the bottom which also make it easy to spray out. This is a big deal if you tend to bring in an decent amount of dirt, snow, or grass. Would recommend this product under those circumstances.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200519
    },
    {
      "title": "Difficult to use sometimes.",
      "text": "This product is difficult to use without it being screwed down to anchor it. It is difficult to pull one shoe across it to remove debris from the sole because there is no easy way to hold it with the other foot. However, attaching it to the floor or a board by using the screw holes provided would eliminate this problem.",
      "rating": 3.0,
      "verified": true,
      "author": "P. Roth",
      "helpful_votes": 0,
      "publication_date": 20190207
    },
    {
      "title": "Garbage. 4 brushes fell out stapled and all first ...",
      "text": "Garbage.4 brushes fell out stapled and all first use. The wood is cheap, and the brush retention sucks. I mounted it to a set of stairs to the house. It is currently in the trash.",
      "rating": 1.0,
      "verified": true,
      "author": "Matt",
      "helpful_votes": 3,
      "publication_date": 20180328
    },
    {
      "title": "Great buy",
      "text": "Works great. Easy to install. Heavy duty bristles feel like they will last quite a few years.",
      "rating": 5.0,
      "verified": true,
      "author": "martha morrison",
      "helpful_votes": 0,
      "publication_date": 20200818
    },
    {
      "title": "No more tracking junk in the house on my shoes!!!",
      "text": "This boot scraper is well built with strong solid frame work, stiff brisseled brushes. Shoes fit easily inside the brushes with just enough drag to really get in and clean the soles and sides of the shoes. Plan on ordering another for the front door step. The only thing I was disappointed with was the hardware that was supposed to be included was missing, only an empty, torn plastic bag that I can only assume once contained that hardware. Not the end of the world after all who doesn't have a few screws laying around to mount it with. Over all very happy with the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Ronald E Flanders",
      "helpful_votes": 0,
      "publication_date": 20180508
    },
    {
      "title": "Great purchase!",
      "text": "Bought this for the husband for Christmas and he uses it everyday. The man is a steamfitter, so he spends time at work in mud and dirt almost everyday. He mounted this on a slice of tree trunk to add stability, and it's perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "meow",
      "helpful_votes": 0,
      "publication_date": 20190828
    },
    {
      "title": "Best Investment!!",
      "text": "Absolute best investment we have made since moving to our farm. My father bought it as a gift for us and it has significantly cut down on the amount of dirt and droppings that come into our home.",
      "rating": 5.0,
      "verified": true,
      "author": "andrea bomar",
      "helpful_votes": 0,
      "publication_date": 20200313
    },
    {
      "title": "Disappointed",
      "text": "Item is not designed to clean shoes/boots as advertised. The item is flimsy and absolutely has to be affixed to something to prevent it from moving all over the place. Do not recommend",
      "rating": 1.0,
      "verified": true,
      "author": "moskqq",
      "helpful_votes": 0,
      "publication_date": 20191208
    },
    {
      "title": "Sturdy -- does the job",
      "text": "Love it. I should have gotten one of these a long long time ago! I bolted it right into the cement outside of my dog school -- Now I just need to get the PEOPLE COMING IN TO USE IT!! You need to get another brush to clean the mud off the bristles regularly, but I think that is true of any of these types of things...",
      "rating": 5.0,
      "verified": true,
      "author": "Andrea Dannegger",
      "helpful_votes": 0,
      "publication_date": 20180209
    },
    {
      "title": "High quality!",
      "text": "High quality for price! I expected more plastic used to make this but nope it was a lot of metal!! Love this for my restaurant line cook staff to scrub out their shoes!",
      "rating": 5.0,
      "verified": true,
      "author": "Nicholas Peckham",
      "helpful_votes": 0,
      "publication_date": 20200420
    },
    {
      "title": "Gets the job done",
      "text": "I bought three of these for a machine shop I work at. I like that all of these came as described and with the hardware needed to install them. They are outside and have stood up well against the elements for a few weeks now. I bought them because they were cheaper than the other brands I saw. Overall, good bang for the buck.",
      "rating": 5.0,
      "verified": true,
      "author": "Erin E.",
      "helpful_votes": 0,
      "publication_date": 20191206
    },
    {
      "title": "Broke on first use",
      "text": "This looked like it would be good. Put it outside and 6 weeks later it broke on the first use. Don't waste your money!",
      "rating": 1.0,
      "verified": true,
      "author": "R Smith",
      "helpful_votes": 0,
      "publication_date": 20200927
    },
    {
      "title": "Works well",
      "text": "The brushes work well to clean my boots. I noticed the wood holding the brushes warping from being out in the weather. I have had this boot brush less than 60 days. Hope it lasts.",
      "rating": 3.0,
      "verified": true,
      "author": "samjm1",
      "helpful_votes": 0,
      "publication_date": 20200521
    },
    {
      "title": "I bought this as a gift to my mom and ...",
      "text": "I bought this as a gift to my mom and brother. My brother's boots are always tracking mud into my Mom's house. I ordered 2 so that there would be one at the front door as well as the back door so no matter how he comes in he can clean off his boots and keep my 84 year old mother from having to clean up after him.",
      "rating": 5.0,
      "verified": true,
      "author": "Carol Arnold",
      "helpful_votes": 2,
      "publication_date": 20160713
    },
    {
      "title": "No More Tracking In Mud & Dirt",
      "text": "This brush cleaner comes with sturdy brushes on the bottom and sides - just as described in the listing. I plan to mount the boot cleaner on my deck outside my back door. This will come in handy so I don't have to take off my boots every time I need to get something inside the house. The only thing missing is a scraper; but I'm sure the bristles will get the job done. Clean your boots so you don't have to clean your carpet. Small price to pay to keep mud and dirt out of your house.",
      "rating": 5.0,
      "verified": true,
      "author": "Dan",
      "helpful_votes": 0,
      "publication_date": 20170313
    },
    {
      "title": "Decent Boot Cleaner",
      "text": "Decent, inexpensive boot cleaner. Only use it to get sand off and it works fine. When the elements have their way with it, won’t be stressed to toss it and replace it.",
      "rating": 4.0,
      "verified": true,
      "author": "circuitbored",
      "helpful_votes": 0,
      "publication_date": 20180221
    },
    {
      "title": "Gets the crud off.",
      "text": "Good boot cleaner. Stand up for about 2 years with heavy use the wood does eventually breaking down and needs to be replaced with a new cleaner.",
      "rating": 4.0,
      "verified": true,
      "author": "OK Fowl",
      "helpful_votes": 0,
      "publication_date": 20200229
    },
    {
      "title": "cleans wet grass ok",
      "text": "Have not tried for mud or snow, but wet grass comes off easily. I attached it to square of plywood so I can move it outside to rinse it should it get clogged with mud.",
      "rating": 5.0,
      "verified": true,
      "author": "Judy M.",
      "helpful_votes": 0,
      "publication_date": 20200825
    },
    {
      "title": "Beats sweeping the floor or being nagged by wife!",
      "text": "It certainly makes for a cleaner cabin! I use this to scrape off the mud or dirt, and then step into a pan with 1/2 in. of water with chlorine in it to disinfect before going in my cabin or my greenhouse. It's a great tool! Beats sweeping the floor all the time!",
      "rating": 5.0,
      "verified": true,
      "author": "AquiFer",
      "helpful_votes": 0,
      "publication_date": 20180122
    },
    {
      "title": "Works well - needs to be attached to something",
      "text": "Works well, as long as you attach it to something. We have concrete steps, so my husband ended up attaching this to a board with room on either side to step on, as illustrated by some of the other reviews on here.",
      "rating": 4.0,
      "verified": true,
      "author": "minibus",
      "helpful_votes": 2,
      "publication_date": 20170705
    },
    {
      "title": "Works as expected",
      "text": "Works really well. I screwed it to a piece of wood so I can stand out the wood with one foot while I scrape the other boot.",
      "rating": 4.0,
      "verified": true,
      "author": "cds",
      "helpful_votes": 0,
      "publication_date": 20191114
    },
    {
      "title": "Nice Quality",
      "text": "Bolted two of these to some spare 2\"x12\" lumber I had laying around. One for the front door and one for the back. Looks pretty good and works well.",
      "rating": 4.0,
      "verified": true,
      "author": "Jetertorre",
      "helpful_votes": 0,
      "publication_date": 20190221
    },
    {
      "title": "Just what I wanted!!",
      "text": "My husband set it up on our back porch and I use it after my morning run! I try to run on the grass mostly and this niffy boot cleaner cleans it right off!!",
      "rating": 5.0,
      "verified": true,
      "author": "Diane Smith",
      "helpful_votes": 0,
      "publication_date": 20190626
    },
    {
      "title": "Four Stars",
      "text": "could be more sturdy, but works well. used my own concrete anchors for a better hold.",
      "rating": 4.0,
      "verified": true,
      "author": "Jesse",
      "helpful_votes": 4,
      "publication_date": 20171101
    },
    {
      "title": "For your porch",
      "text": "The bristles are stuff and do a great job of cleaning my work boots when I get home in the evening",
      "rating": 5.0,
      "verified": true,
      "author": "Richard Genthner",
      "helpful_votes": 0,
      "publication_date": 20200607
    },
    {
      "title": "This product is fairly affective",
      "text": "Not quite 5 stars. It takes care of the big stuff, but I still manage to track dirt in the house.",
      "rating": 4.0,
      "verified": true,
      "author": "Daniel Huft",
      "helpful_votes": 0,
      "publication_date": 20190630
    },
    {
      "title": "Stiff enough for tough mud!",
      "text": "Exactly what I wanted: a sturdy, heavy-duty scraper which could handle the mud on hiking boots! I did have to be a little creative to mount it next to my front steps, but the whole project took less than ten minutes including \"engineering\" time.",
      "rating": 5.0,
      "verified": true,
      "author": "Crow",
      "helpful_votes": 0,
      "publication_date": 20160717
    },
    {
      "title": "Works great!",
      "text": "I mounted mine on our deck by the backdoor, No more tracking dirt or snow into the house!",
      "rating": 5.0,
      "verified": true,
      "author": "Neil B",
      "helpful_votes": 0,
      "publication_date": 20190826
    },
    {
      "title": "Heavy duty works as it should !!",
      "text": "Husband has been asking for a boot brush for awhile . This one is perfect . Quality product . No more mud tracked inside !!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190302
    },
    {
      "title": "Great Value for Money3",
      "text": "This was great for what I needed. I didn't want to drill into the concrete, so instead I found an old board and it works great. It hugs the shoe just enough to get the dirt and mud off without being too abrasive. I've had this for about 3 months, it sits outside in the elements and is doing fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole Stahl",
      "helpful_votes": 0,
      "publication_date": 20190831
    },
    {
      "title": "This thing is AWESOME.",
      "text": "You have to get this boot cleaner. Bought this for winter snow removal but we use it all the time now. Really cleans the sides and bottom's of our shoes well. We don't have to sweep as often now either. I 100% recommend this beauty.",
      "rating": 5.0,
      "verified": true,
      "author": "Lou Flora",
      "helpful_votes": 0,
      "publication_date": 20170102
    },
    {
      "title": "All good",
      "text": "Not sure how to anchor it down but it’s a good study piece",
      "rating": 5.0,
      "verified": true,
      "author": "Martin Cander",
      "helpful_votes": 0,
      "publication_date": 20200321
    },
    {
      "title": "Worked well while it lasted",
      "text": "Piece of junk can’t even handle being ran over with a skid steer",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200416
    },
    {
      "title": "... way by the back door and its holding up fine and works well",
      "text": "I bolted it tight to my drive way by the back door and its holding up fine and works well. Im sure it will last a few years",
      "rating": 5.0,
      "verified": true,
      "author": "Jon",
      "helpful_votes": 2,
      "publication_date": 20170228
    },
    {
      "title": "Great product that does a good job",
      "text": "My husband loves this boot cleaner and uses it every day before getting in the house.He works in construction so he was bringing in a lot of rocks and dirt in the house but with the boot cleaner that has helped a lot.",
      "rating": 5.0,
      "verified": true,
      "author": "Rosalinda",
      "helpful_votes": 0,
      "publication_date": 20200220
    },
    {
      "title": "Gets the job done",
      "text": "Great product mounted to a moveable 2x4 so not in the way in the summer.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190908
    },
    {
      "title": "Not to bad",
      "text": "Not to bad for the price. little cheap built though. I would buy again though.",
      "rating": 4.0,
      "verified": true,
      "author": "robert s liao.",
      "helpful_votes": 0,
      "publication_date": 20200517
    },
    {
      "title": "Disappointed",
      "text": "Ours arrived damaged and not as big as we expected! Was disappointed with the product after all the great reviews.",
      "rating": 2.0,
      "verified": true,
      "author": "Toni715",
      "helpful_votes": 0,
      "publication_date": 20200830
    },
    {
      "title": "Not weather proof",
      "text": "Cracks in the wood only had it 3 months. Should have a weather protectant on the wood sides that hold the bristles",
      "rating": 3.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20201011
    },
    {
      "title": "Does the trick!",
      "text": "Got tired of cleaning the dried mud off my shoes after the rains. This is perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "sandra miller",
      "helpful_votes": 0,
      "publication_date": 20190328
    },
    {
      "title": "Getting that sand off your shoes.",
      "text": "This is great! We have a beach house, so this is the best way of getting all the sand that's stuck in your shoes off.",
      "rating": 5.0,
      "verified": true,
      "author": "Sophia",
      "helpful_votes": 0,
      "publication_date": 20190714
    },
    {
      "title": "To tight for men to use",
      "text": "This may be a quality boot brush, but with my boots or shoes this seems to small for me to get my shoes all the way into the brush. It seems that they were not made for men's shoes or boots.",
      "rating": 3.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 0,
      "publication_date": 20190314
    },
    {
      "title": "Ok",
      "text": "Was scuffed up when we received it. I wanna spray or paint it with some outdoor sealer. I can’t seeing it lasting very long with out it",
      "rating": 3.0,
      "verified": true,
      "author": "Crystal Smagala",
      "helpful_votes": 0,
      "publication_date": 20191223
    },
    {
      "title": "Good buy",
      "text": "Durable and works great. It’s a tight fit for wide feet but they should breakin nicely.",
      "rating": 5.0,
      "verified": true,
      "author": "Seth",
      "helpful_votes": 0,
      "publication_date": 20190125
    },
    {
      "title": "Don't buy it.",
      "text": "Useless. Screws stripped on first attempt. Then the wood broke on my first attempt to clean my shoe.",
      "rating": 1.0,
      "verified": true,
      "author": "Dan geherin",
      "helpful_votes": 16,
      "publication_date": 20170325
    },
    {
      "title": "Does a nice job of cleaning my boots when I come back ...",
      "text": "Does a nice job of cleaning my boots when I come back from taking care of my horse or from working in my flower beds.",
      "rating": 5.0,
      "verified": true,
      "author": "b.k.",
      "helpful_votes": 0,
      "publication_date": 20180508
    },
    {
      "title": "Cleaner house",
      "text": "Love being able to clean shoes and boots before entering the house.",
      "rating": 4.0,
      "verified": true,
      "author": "Bonnie",
      "helpful_votes": 0,
      "publication_date": 20190719
    },
    {
      "title": "Works perfectly!",
      "text": "Works perfectly on our back deck to ensure we aren't tracking dirt and grass into the house. Sturdy as well, easy to affix.",
      "rating": 5.0,
      "verified": true,
      "author": "Amy",
      "helpful_votes": 0,
      "publication_date": 20200514
    },
    {
      "title": "Good brush.",
      "text": "Good brush, easy to use once you mount it to a solid surface. Sure cut down on the dirt tracked into the house.",
      "rating": 5.0,
      "verified": true,
      "author": "Jean Gardner",
      "helpful_votes": 0,
      "publication_date": 20181227
    },
    {
      "title": "this is perfect for our mudroom to scrape off the extra snow",
      "text": "With all the snow we've had in Tahoe, this is perfect for our mudroom to scrape off the extra snow. It's sturdy and the brush bristles are stiff. It came today just before we are heading up to the mountains.",
      "rating": 5.0,
      "verified": true,
      "author": "Ultra LTD",
      "helpful_votes": 0,
      "publication_date": 20170310
    },
    {
      "title": "not long lasting for outdoor use",
      "text": "in less than a year the sides rotted and crumbled",
      "rating": 2.0,
      "verified": true,
      "author": "carlos g.",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "No mounting brackets",
      "text": "The mounting brackets were missing from the bag. The bottom of the bag had been sliced open & they weren’t anywhere in the box.",
      "rating": 2.0,
      "verified": true,
      "author": "Mary Whitlatch ",
      "helpful_votes": 2,
      "publication_date": 20180623
    },
    {
      "title": "Happy Wife",
      "text": "I used this for the first time yesterday after working in the yard following a nice little rainstorm. My wife appreciated that for the first time in a while I didn't come in the house with muddy boots. This item is durable, sturdy and the brushes are just the right size and stiffness to do a great job cleaning my boots and shoes. Highly recommend this product to anyone in need.",
      "rating": 5.0,
      "verified": true,
      "author": "eric bosse",
      "helpful_votes": 0,
      "publication_date": 20170313
    },
    {
      "title": "This works just fine",
      "text": "I wish I'd bought this a couple of years ago; I've used similar ones at work for years, and I don't know why I didn't get one for here at the farm.",
      "rating": 5.0,
      "verified": true,
      "author": "Ranger Phil",
      "helpful_votes": 0,
      "publication_date": 20180413
    },
    {
      "title": "Great boot brush",
      "text": "Solid, well made boot brush. Exactly what I needed for the back deck. A nice gauge of metal, thick wood and the bristles aren’t falling out.",
      "rating": 5.0,
      "verified": true,
      "author": "Chef Chocolatier",
      "helpful_votes": 0,
      "publication_date": 20171104
    },
    {
      "title": "Works great on cleaning shoes off it helps keep the mud ...",
      "text": "Works great on cleaning shoes off it helps keep the mud out of the house sits nicly on the bottom step of our entru deck needvto get another one for back door frand kids enjoy using it",
      "rating": 5.0,
      "verified": true,
      "author": "jkblondy",
      "helpful_votes": 0,
      "publication_date": 20180321
    },
    {
      "title": "4 stars",
      "text": "This works pretty well. It would help if there were more bristles on the bottom and less on the sides though.",
      "rating": 4.0,
      "verified": true,
      "author": "Rachel ",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "We mounted it outside and works great taking mud and snow off our shoes and boots",
      "text": "Ordered this for my husband for Christmas as he works in construction and he loves it! We mounted it outside and works great taking mud and snow off our shoes and boots.",
      "rating": 5.0,
      "verified": true,
      "author": "Jen",
      "helpful_votes": 0,
      "publication_date": 20180127
    },
    {
      "title": "Works Great !!!!!!",
      "text": "Works Great when I come in from the chicken coop!!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Bob 6907",
      "helpful_votes": 0,
      "publication_date": 20180207
    },
    {
      "title": "Durable",
      "text": "Must have for those out there that need mud/dirt/gravel/dried concrete etc knocked off your boots. I mounted mine to a 2x8 pressure treated board outside and use heavily multiple times a day 7 times a week. Product does come with 4 Phillips head screws for mounting.",
      "rating": 5.0,
      "verified": true,
      "author": "Adam",
      "helpful_votes": 0,
      "publication_date": 20190304
    },
    {
      "title": "A must to keep your house clean !",
      "text": "This is great to have if you live on dirt roads and muddy sitiuation.",
      "rating": 5.0,
      "verified": true,
      "author": "JoJo",
      "helpful_votes": 0,
      "publication_date": 20190313
    },
    {
      "title": "Great Foot Scraper",
      "text": "Bought this for ny daughter for her birthday and she absolutely loves it and has a great use for it. JB-NV",
      "rating": 5.0,
      "verified": true,
      "author": "JB-NV",
      "helpful_votes": 0,
      "publication_date": 20180228
    },
    {
      "title": "Five Stars",
      "text": "this thing is great I use it all the time mounted on my camper steps",
      "rating": 5.0,
      "verified": true,
      "author": "Stryker Perry",
      "helpful_votes": 2,
      "publication_date": 20170221
    },
    {
      "title": "A nice way to make it possible for folks to scrape ...",
      "text": "A nice way to make it possible for folks to scrape the mud and leaves from their shoes/boots before coming inside.",
      "rating": 5.0,
      "verified": true,
      "author": "J Smith",
      "helpful_votes": 0,
      "publication_date": 20171116
    },
    {
      "title": "Bigfoot beware.",
      "text": "It's a little tight for my size 12 1/2 boots. I hope it will break in a little. It does do a good job of scraping off dirt.",
      "rating": 4.0,
      "verified": true,
      "author": "S. Allen",
      "helpful_votes": 0,
      "publication_date": 20170307
    },
    {
      "title": "For small feet",
      "text": "Too small good for kids adults shoes don't fit need to be 2inch wider",
      "rating": 2.0,
      "verified": true,
      "author": "Karen Conners ",
      "helpful_votes": 0,
      "publication_date": 20190424
    },
    {
      "title": "Poor value for the money",
      "text": "Painting on the metal frame was shoddy,especially on the underside of the metal frame . The wooden pieces appeared to have no weatherproof coating as I expected for a product intended for outdoor use. Recommend not buying this item",
      "rating": 2.0,
      "verified": true,
      "author": "John Q Public.",
      "helpful_votes": 0,
      "publication_date": 20190313
    },
    {
      "title": "I hate it when things arrive like",
      "text": "One screw missing! I hate it when things arrive like that",
      "rating": 3.0,
      "verified": true,
      "author": "Harry",
      "helpful_votes": 2,
      "publication_date": 20180705
    },
    {
      "title": "Love this product",
      "text": "I was very skeptical at first but when I cleaned my work boots it did a really great job",
      "rating": 5.0,
      "verified": true,
      "author": "Rhoseanda Tookes",
      "helpful_votes": 0,
      "publication_date": 20170310
    },
    {
      "title": "Four Stars",
      "text": "need strong board or some kind of foundation to screw it onto",
      "rating": 4.0,
      "verified": true,
      "author": "Bill Long",
      "helpful_votes": 0,
      "publication_date": 20180730
    },
    {
      "title": "Works Great!",
      "text": "Love my new boot brush. I mounted it on my back deck with the screws provided, and it works great on both my work boots, and trail running shoes getting the trapped dirt and muck from the bottoms and sides. Great product--highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171222
    },
    {
      "title": "Tight Fit For Big Foot",
      "text": "I wear a size 13 mes hiking boot and they just barely fit into this scraper. Would have liked one a little bigger but it works. Mounted it to some painted MDF and figure it will last the season.",
      "rating": 4.0,
      "verified": true,
      "author": "OkieChef",
      "helpful_votes": 0,
      "publication_date": 20161203
    },
    {
      "title": "Good quality",
      "text": "Heavy sturdy boot brush. Screw holes in the base for keeping it in place. I use it at the front door every time I enter, works great for keeping sand off the hardwood floors.",
      "rating": 5.0,
      "verified": true,
      "author": "Dane",
      "helpful_votes": 0,
      "publication_date": 20170210
    },
    {
      "title": "If you have boots and they get dirty as boots should. You need this boot cleaner!",
      "text": "This boot cleaner ROCKS! I really needed this as I haven't cleaned my boots since our last snow storm. And got it just in time for another one we have hitting tonight. Love the way it cleans everywhere all at once. If you have boots that get filthy from working or trudging through snow or mud then this is for you. Fast, easy, and works like a charm! Highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Diamond Distributing",
      "helpful_votes": 0,
      "publication_date": 20170313
    },
    {
      "title": "Nice that you can screw it down but the bristles ...",
      "text": "Its ok. Nice that you can screw it down but the bristles arent the toughest. They are already smashing..",
      "rating": 3.0,
      "verified": true,
      "author": "Mandi",
      "helpful_votes": 0,
      "publication_date": 20170614
    },
    {
      "title": "Gets your shoes clean!",
      "text": "I had it installed within five minutes of receiving. It works as advertised and seems to be well constructed.",
      "rating": 5.0,
      "verified": true,
      "author": "Gary E. Sanchez",
      "helpful_votes": 0,
      "publication_date": 20190115
    },
    {
      "title": "works great",
      "text": "Works great. I have clay soil so in the spring boots and shoes are covered with mud. Since I have it mounted outside I coated the wood with Marine varnish.",
      "rating": 5.0,
      "verified": true,
      "author": "15790",
      "helpful_votes": 0,
      "publication_date": 20170427
    },
    {
      "title": "No good",
      "text": "We have not had it very long and it already broke",
      "rating": 1.0,
      "verified": true,
      "author": "Mona",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "No more gunk going into granny's house",
      "text": "I have several boot wearing family members and they love it. We did have to install the scraper onto the porch because it isn't very heavy. but, it does the job very nicely.",
      "rating": 5.0,
      "verified": true,
      "author": "brenda",
      "helpful_votes": 0,
      "publication_date": 20170124
    },
    {
      "title": "Works excellently. As other reviws have stated, it ...",
      "text": "Works excellently. As other reviws have stated, it needs to be mounted to the floor with the included hardware, or it will move and not work.",
      "rating": 5.0,
      "verified": true,
      "author": "rabel",
      "helpful_votes": 0,
      "publication_date": 20161205
    },
    {
      "title": "Very happy with this boot brush",
      "text": "Easy to mount, nice stiff brush clean the boots very well",
      "rating": 5.0,
      "verified": true,
      "author": "D.R. Briggs",
      "helpful_votes": 0,
      "publication_date": 20190406
    },
    {
      "title": "Worked great until then",
      "text": "Bought this in March of this year for cleaning shoes around the farm and one side of the wood that holds the bristles has already broken off. Bristles should be in restin or hard plastic and not wood. Not worth the money for such short life. Worked great until then.",
      "rating": 2.0,
      "verified": true,
      "author": "DLP",
      "helpful_votes": 0,
      "publication_date": 20170926
    },
    {
      "title": "Not a flimsy boot scraper. We installed it at our office in so far as work perfectly.",
      "text": "Not a flimsy boot scraper. We installed it at our office in so far as work perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "doug",
      "helpful_votes": 0,
      "publication_date": 20190615
    },
    {
      "title": "heavy duty and price is fantastic",
      "text": "Heavy heavy duty and the price was so affordable. It will take a life time before this wears out. Buying another one for the garage it is that good.",
      "rating": 5.0,
      "verified": true,
      "author": "reen5horse",
      "helpful_votes": 0,
      "publication_date": 20171110
    },
    {
      "title": "A truly useful tool...",
      "text": "Dirty boots but too much in-n-out of the ol' household to bother removing your big kickers constantly? Get one of these. Mount it next to a tray of water and dip-brush-done. Works like an absolute charm, and it'll save you tons of time vacuuming up your own mess. The bristles are heavy, the steel and wooden construction looks good and is very sturdy, and the mounting method (4 large wood screws) is mechanically sound. Help clean up your act and get one! You'll USE it...trust me.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeffrey L.",
      "helpful_votes": 5,
      "publication_date": 20170115
    }
  ],
  "product_meta": {
    "title": "Boot Brush Cleaner Floor Mount Scraper Commercial With Hardware Indoor / Outdoor",
    "description": "For use on the job site, garage, patio and more. Simply fix the boot brush to the floor with the included mounting hardware. The boot brush scraper is for use on shoes and boots. The tough bristles are rigid enough to clean the toughest dirt, and soft enough not to scratch. Take advantage of our 100% no hassle guarantee and test drive the Mr Clean Boot Brush today. Consider adding a second one to your cart as a great gift or for use at the office.",
    "rating": 4.5,
    "feature_bullets": [
      "Boot Brush - Easily mount to any floor with included hardwood.",
      "Guarantee - If you are not 100% happy with your purchase, simply return it for a no hassle refund. Add one to your cart now.",
      "Indoor / Outdoor - Treated maple finish , designed to stand up to outdoor elements.",
      "Durable - Use on boots and shoes. The boot brush scraper makes it easy to get off tough mud and dirt with just a few swipes."
    ],
    "specifications": {
      "Package Dimensions": "9.6 x 6.7 x 4.7 inches",
      "Item Weight": "2.74 pounds",
      "ASIN": "B013UOUV24",
      "Item model number": "SYNCHKG061282",
      "Customer Reviews": "4.5 out of 5 stars1,060 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#29,919 in Health & Household",
      "Is Discontinued By Manufacturer": "No",
      "Batteries Required": "No"
    },
    "categories": [
      "Household Supplies",
      "Home & Kitchen",
      "Health & Household",
      "Cleaning Tools"
    ],
    "price": 18.88
  }
}