{
  "website_summaries": [
    {
      "verdict": "A top-of-the-line range hood that can help you address a wide range of kitchen challenges.",
      "pros": [
        "Offers a brushed steel frame and filters",
        "Remote control makes it simple to turn the hood on and off, even if you are outside the kitchen",
        "Comes with an auto-delay shut-off timer",
        "Equipped with a pro-style canopy hood with an industrial design"
      ],
      "cons": [
        "More expensive than many comparable options",
        "Can be difficult to install"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Pulls air nicely - lights the work surface poorly",
      "text": "Nice looking unit - similar to other brands that use the same source for the basic machine. As you look around the internet you will see various brands with identical looking products. Those sellers customize the base model with add ons and label it with their own name. This one has a good air flow (purported to be 900 cubic feet/minute) but very poor lighting. There are two lighting units - each a single \"bulb\" containing multiple LEDs. In the unit I have the lights are like Marty Feldman eyes, going off to the side but not illuminating the cooking surface. Not only that but they are not bright. That has been a great disappointment.",
      "rating": 3.0,
      "verified": true,
      "author": "G. H.",
      "helpful_votes": 22,
      "publication_date": 20180610
    },
    {
      "title": "What incredible quality for the price!",
      "text": "Absolutely amazing quality. I was hesitant to buy online sight unseen, but I took my chances and I'm glad I did. I am super impressed with all the features this offers. No more smoke in the kitchen when I cook! The LED lights are absolutely beautiful and illuminate the food better than any single light bulb under the Hood ever could. Just one thing to keep in mind, this is not a hard wire, it's plug in. So if you purchase be sure you already have an outlet, or be prepared to have one installed.",
      "rating": 5.0,
      "verified": true,
      "author": "Penelope",
      "helpful_votes": 13,
      "publication_date": 20181114
    },
    {
      "title": "Perfect for stirfry, powerul and heavy duty",
      "text": "This hood has two powerful fans with 900CFM. The suck force is much stronger than my previous hood with 360CFM. This hood is heavy and it took some effort to install it. Once installed, we love the hood. We wish the LED light could be brighter and the oil collector can be accessed externally without having to remove the filters. Otherwise, will give a 5 star.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 14,
      "publication_date": 20180902
    },
    {
      "title": "When I bought it at 900 cfm, it has now become 500 cfm.  Feeling cheated.",
      "text": "When I bought it at 900 cfm, it has now become 500 cfm. Feeling cheated.",
      "rating": 1.0,
      "verified": true,
      "author": "lifang",
      "helpful_votes": 8,
      "publication_date": 20200701
    },
    {
      "title": "Product Quality",
      "text": "After having this range hood installed for not even a month, the display for the digital clock is already inoperable. The LCD sections are not all working. The problem is that this is installed and tile around it grouted. Does anyone know if display can be replaced without removing hood?",
      "rating": 1.0,
      "verified": true,
      "author": "Lisa B.",
      "helpful_votes": 9,
      "publication_date": 20181123
    },
    {
      "title": "broken range hood damper",
      "text": "When my contractor opened the box, found out one of the dampers is broken. The damper looks really cheap. I have to return it. It is really heavy one.",
      "rating": 1.0,
      "verified": true,
      "author": "Yi Shen",
      "helpful_votes": 8,
      "publication_date": 20190206
    },
    {
      "title": "Beautiful",
      "text": "I love the smooth operation of this range hood. It looks wonderful with our new range, the fan is quiet, the touch controls are a great feature. We had this professionally installed to vent through the roof and when the fan is on it draws any smoke and heat away very nicely. This range hood is heavy duty, it gives the appearance of a professional kitchen. I highly recommend it!",
      "rating": 5.0,
      "verified": true,
      "author": "HappyGirl",
      "helpful_votes": 4,
      "publication_date": 20190328
    },
    {
      "title": "Super stylish, powerful and easy to install",
      "text": "I just remodeled my whole kitchen and since I have an open floor model house I was told to stay away from a microwave hood since I need something more stronger. I did some research and found cosmo to be the best of its own line of goods as far as price, style, power, ease of installation and durability. I am very happy with my choice so far and I would highly recommend this to anyone who is looking for a dash of style and functionality. I almost forgot to mention the little remote that it comes with.",
      "rating": 5.0,
      "verified": true,
      "author": "Neener",
      "helpful_votes": 0,
      "publication_date": 20200314
    },
    {
      "title": "Lasted three years and then went crazy",
      "text": "I installed one of these three years ago, and now the control panel is going crazy. All the lights blink on and off, none of the buttons are responsive, and the fan turns on and off randomly. It’s a real shame How unreliable this is because of how well the overall design is. I want to love it, but I simply cannot recommend buying one of these based on the poor reliability.",
      "rating": 2.0,
      "verified": true,
      "author": "chemao",
      "helpful_votes": 2,
      "publication_date": 20191231
    },
    {
      "title": "Well worth the money",
      "text": "When I first received my range hood, it was well packed. I agree with other reviewers that a template would help installing but it was easy enough to make. The description is perfect and I love the way it looks above my new range. I purchased this model since I like the rounded edges and wanted the LED lights. It is well made and you can see the quality when you first take it out of the box. Everything is plastic wrapped to protect the stainless steel. It is easy to use and looks beautiful as you can see in the pictures. I recommend this RANGE Hood to make you kitchen beautiful.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff V",
      "helpful_votes": 2,
      "publication_date": 20190311
    },
    {
      "title": "looks beautiful!",
      "text": "We bought this to replace one of those little fiddly contractor fans, and were a bit worried that where it extends in front would cause us to bang our heads: not a problem at all! We have a five burner gas range, with a \"turbo\" flame in the middle, and it works spectacularly to keep the heat, steam, and smells under the hood and not in the rest of the house. The light is really nice, and having the remote is great if you want to sit down after dinner and not have to get up to turn off the fan/light. I can easily recommend it!",
      "rating": 5.0,
      "verified": true,
      "author": "laprof",
      "helpful_votes": 0,
      "publication_date": 20190831
    },
    {
      "title": "Damaged from the contents being packed wrong, no external packaging damage",
      "text": "Came with a flexible duct crammed on top of the hood, leaving a circular abrasion visible from ten feet away. Didn't have time to return it so I'll be sanding it out, very annoying.",
      "rating": 1.0,
      "verified": true,
      "author": "J. Anderson",
      "helpful_votes": 4,
      "publication_date": 20190415
    },
    {
      "title": "Overall good product, and you pay for what you get",
      "text": "This hood vent seems quality built, it is heavy and the steel seems thick. The installation was the hardest thing about it, the instructions were worse than Ikea ones. They gave a lot more extra hardware than you need, and also in the manual/instructions, they do not explain what each hardware was used for. This leaves you very puzzled to why they sent them. It's louder than expected, the suction seems good so far. For a hood vent under $1000, this seems to be the best bang for buck. I would highly recommend hiring someone if you are not that handy.",
      "rating": 4.0,
      "verified": true,
      "author": "Kevin Chau",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "Great product but misleading installation guide",
      "text": "This is a great range hood, both appearance and functions. But it took us quite long trying to figure out where to drill in the back wall. The installation guide is misleading. The back wall screws are mainly for put the hood on so the top screws can be installed. For back screws, lower a half inch when you drill than where the guide tells you. You can adjust the lower two screws after tops ones if you want. But the suction power is very good. No more oily smell anywhere in the house. Should have bought one this years ago. Despite the installation guide, I am still giving 5 stars.",
      "rating": 5.0,
      "verified": true,
      "author": "Charles L. ",
      "helpful_votes": 0,
      "publication_date": 20200617
    },
    {
      "title": "Sucks in a good way!",
      "text": "I love this range hood! Had this professionally installed during a remodel with outside venting done at the same time. This travels through about 10 feet of ducting with one bend. The suction on this is fantastic! Last night was my first real test while searing steak in cast iron producing a bunch of smoke. It captured 100% of visible smoke. My clothing didn't smell of steak and my house didn't smell like steak after dinner. This is exactly what I was hoping for with range hood. Not only does it work very well, but looks stunning. The drip tray went missing and Cosmo is sending me a new one free of charge, very good customer service!",
      "rating": 5.0,
      "verified": true,
      "author": "bakeman",
      "helpful_votes": 0,
      "publication_date": 20200305
    },
    {
      "title": "Loud!",
      "text": "This thing is loud... I am ready to return it but spent a lot of time installing it.. super bummed.. how can anybody say this thing is quiet it's like a freight train through the kitchen..I never write reviews but this is one worth writing for because what a pain in the ass. I am looking for an external fan to mount on the outside of the house.",
      "rating": 1.0,
      "verified": true,
      "author": "KAREN A MOREY",
      "helpful_votes": 4,
      "publication_date": 20190814
    },
    {
      "title": "Good range hood but a bit hand to install for ordinary people",
      "text": "Nice and slick looking range hood with plenty of suction power. We are replacing this hood with a microwave. However, installation is harder then I thought. Finally we used the old microwave as a supporting platform and use a car jack plus a 2x6 beam to raise it up to position before be able to drive the screws to secure it to the cabinet. I recommend to use better screws to replace the supplied screws since they are low quality and too easy to be stripped.",
      "rating": 4.0,
      "verified": true,
      "author": "Icewolf",
      "helpful_votes": 0,
      "publication_date": 20191221
    },
    {
      "title": "Unbeatable quality and performance for half the cost of big name brands",
      "text": "Beautiful high performance 900cfm range hood. This hood is heavily built with high quality construction and quality parts. Inside is as nice as the outside with powder coated components and polished stainless steel. The 4 speed dual fans move a huge volume of air. Fan speeds 1 and 2 are quiet enough to not be bothered but 3 and 4 gets fairly loud but only needed when some seriously smelly / smoky food is being cooked. This range hood is every bit the quality of the same hoods that go for twice the price. This is my 3rd hood in a 3rd house and all work well for many years",
      "rating": 5.0,
      "verified": true,
      "author": "RZR Dad",
      "helpful_votes": 0,
      "publication_date": 20191224
    },
    {
      "title": "Very Nice Kitchen Update",
      "text": "Pleasantly surprised with think gauge stainless steel. The same construction grade as Viking and commercial grade hoods. Everything's stainless except they motor and motor guard. It was very heavy, and it exhausted me and two of my friends because I had an inaccurate drill holes. After install, I deep fried right away and we cannot smell the oil frying two feet the stove. I made fish and chips and you can hear the fryer screaming but cannot smell what's cooking. I'm happy with the material and the exhaust power but I'll get back with you on the motor durability.",
      "rating": 5.0,
      "verified": true,
      "author": "EA",
      "helpful_votes": 0,
      "publication_date": 20200129
    },
    {
      "title": "We are very happy with this vent hood",
      "text": "What a change from our old vent hood! This is so much more powerful than our previous vent hood. You can really feel the power as it pulls up the smoke and smell from our cooking. We had a fire alarm that was constantly going off when we cooked pizza or bacon, so the vent hood we had was basically for show. And it was an ugly show! What a difference this vent hood has made. It looks very nice in the space, and the power is fantastic. The display is low profile but modern, and we love the bright LED lights. It adds a lot of class to our kitchen!",
      "rating": 5.0,
      "verified": true,
      "author": "greyseal",
      "helpful_votes": 0,
      "publication_date": 20200528
    },
    {
      "title": "Great Range Hood",
      "text": "Installation was a bit challenging because of limited space for the duct to move the air out. it replaced a Microwave with exhaust fan. existing opening on the wall was only 4\" and for this unit a 6\" to 8\" was required. so the opening needed to be enlarged and new outside damper installed. It has 4 fan speed and looks very nice. The noise level is fine in lower speeds but expectedly higher in full fan speed. So far it is what I expected. Works and looks great.",
      "rating": 5.0,
      "verified": true,
      "author": "Bardif",
      "helpful_votes": 0,
      "publication_date": 20200515
    },
    {
      "title": "High performance, esthetically pleasing.",
      "text": "I purchased this unit because of its features, namely 3 exhaust speeds speed, LED touch panel control, stainless steel construction and easily cleaned baffle filters. It also comes with a remote control. This purchase was part of a complete kitchen renovation. I am extremely pleased with the unit. It is quiet and efficient. I would recommend this unit for serious consideration for a new or replacement range hood. .",
      "rating": 5.0,
      "verified": true,
      "author": "Gao Cong",
      "helpful_votes": 5,
      "publication_date": 20180412
    },
    {
      "title": "Totally useless",
      "text": "Don't know why this hood is blowing air outward. I don't need a fan with super loud noise in my kitchen, I need something to pull the air out! Also one of the LED lights never turned on. Terrible product.",
      "rating": 1.0,
      "verified": true,
      "author": "J",
      "helpful_votes": 3,
      "publication_date": 20191027
    },
    {
      "title": "looks good and works good",
      "text": "range hood looks very good...suction is strong, on the lowest setting its already stronger than the range/microwave that came with the house on the strongest setting... installation was painful though...if only they had a way to make it easier to get to the holes a that are in the back corner...template helps a lot but in the end it is still very difficult to get to those corner holes",
      "rating": 4.0,
      "verified": true,
      "author": "Ni Nguyen",
      "helpful_votes": 0,
      "publication_date": 20190509
    },
    {
      "title": "Nice heavy duty hood with 4 fan speeds.",
      "text": "The install took 6 hours but we had to run power, duct work and cabinets. We bought a wall vent with a damper ($50) and took out the damper that came with the hood. We ran a test and the damper flap stayed open after 1 run. :( Lights could be brighter and they could be covering the whole cooking surface instead of 2 little spots. Other than that it looks really nice and its very powerful which is desperately needed.",
      "rating": 4.0,
      "verified": true,
      "author": "sam",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "Great range hood, fair price, medium install...",
      "text": "To start off, this seams to be one of the best made range hoods we have seen in a while. The quality is spot on. The hood grates seem commercial grade. Love the LED lights, although it would have been nice to have low and high settings...But its fine. The blower is powerful...Actually amazing. Installation wasnt hard but wasnt easy, and the hood is heavy. Take your time, think, and you should do fine. Exhaust is 8 inches, I reduced to 6 inches...Can be tricky, but again just take your time.",
      "rating": 5.0,
      "verified": true,
      "author": "Edward Watts",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "Few dislikes",
      "text": "I bought this hood from a seller that was selling it in like new condition. When i received the box, the hood was scratched up in different places, the clamp was missing. Not really LIKE NEW CONDITION I would say at all. Installation was a bit tough but manageable. Works nice and looks nice too. The lights are not that bright as I had it on the over the range microwave. Wish it had a few settings for lights to go from dim to bright but it doesn't. Overall its a nice unit",
      "rating": 3.0,
      "verified": true,
      "author": "Natalie",
      "helpful_votes": 0,
      "publication_date": 20191210
    },
    {
      "title": "Powerful yet quiet hood.",
      "text": "Very nice hood. Looks and works extremely well. 900 cfm at high speed and its still not very noisy. Only problem I have is it came with the two plastic dampers that are there to keep the outdoor air from coming into the house are broken. The small plastic pins are broken. Unless Cosmo sends me new parts I will have to send it back.",
      "rating": 4.0,
      "verified": true,
      "author": "Carol R. Bencivenga",
      "helpful_votes": 4,
      "publication_date": 20181230
    },
    {
      "title": "Purchase won’t disappoint",
      "text": "I really recommend this range hood. The power it has is unbelievable, the leds are ok not as bright as the one I had and the angle of the leds and for my range as you can see on the photo lights half the pan that’s why I gave it 4stars, looks nice, doesn’t have pointy corners there nice and round corners, don’t have to worry about bumping your head or damaging cabinet doors. I’m going to see if I can change to different leds and update here later.",
      "rating": 4.0,
      "verified": true,
      "author": "Felix",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "Great for the price",
      "text": "PROS - the design is very nice, easy to install, directions were just right. I opted to do vented outside. Hardest part is the air duct. CONS - putting the bold from the inside is very hard to reach so i convinced my husband that doing from the top and using extra large washer will not negatively impact the installation. Sow we did that. Regarding the suction I would expect a little more power for the amount of noise. But by far it is still very good.",
      "rating": 4.0,
      "verified": true,
      "author": "Adriana P",
      "helpful_votes": 0,
      "publication_date": 20200216
    },
    {
      "title": "Pain to install! Duct is not 7.5 inch as described",
      "text": "The template doesn't do justice at all, you use the template to mark and it is off when you try to put the unit. Real paint to install with screws provided. ended up buying nuts and bolts to hang. My main issue is the descriptions say 7.5-inch baffle/outlet but it is more like 7.3/4 or 8 inches. I bought the 7.5-inch drill saw for the installation come to find out the unit baffle doesn't fit through a 7.5inch hole what a Joke! Other than the installation pain this product has good power and nice features and finishes",
      "rating": 3.0,
      "verified": true,
      "author": "TG",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "Would purchase again in a heartbeat. Well done!",
      "text": "This is a physically beautiful & powerful fan that does everything it should. That said, it’s heavy and takes 3 people to install. The good news is that the company listened to customer feedback and now includes a paper mounting template. Also included are an 8” collapsible vent and an 8” hose clamp to attach that to the fan. GREAT! Set to high, it makes a lot of noise. We use a medium setting and it works great with a lot less noise and has plenty of suction. No more smoky or smelly kitchen!",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel S. Levy",
      "helpful_votes": 0,
      "publication_date": 20190503
    },
    {
      "title": "Worth every penny.",
      "text": "Works incredible. You need two people to install because it’s pretty heavy. All hardware includes is very nice. Even includes nice stainless cabinet washers for install. Filters are quality. Have nothing bad to say. You may think you won’t use the remote. But when you’re sitting down at the dinner table, and you forgot to turn off the fan, then you’ll appreciate it.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul M. Giglio",
      "helpful_votes": 2,
      "publication_date": 20190209
    },
    {
      "title": "Overall a great product",
      "text": "I was looking for a range hood with 800 or higher CFM. I compared the features of several brands and decided on this model for its look and price level. Be aware that it is very heavy so help might be needed during installation. I was not sure whether the suction would work well as the filters seem to block the airways, but it turned out to be OK. There is a noticeable reduced smell after cooking with this new range hood.",
      "rating": 5.0,
      "verified": true,
      "author": "Swane38",
      "helpful_votes": 0,
      "publication_date": 20200320
    },
    {
      "title": "Great Range Hood, but a Pain to install!",
      "text": "Great product, great suction power, and the noise is reasonable for the power. With that said this range hood was a pain to install, even the carbon filters were troublesome to install. I don't have an exhaust vent neither, which I think that this range hood is more built for; I am using it as a recirculation hood. I am considering buying a \"grow room\" carbon filter for maybe some out side of the diy carbon filtration, so I won't have to buy the carbon filters that are only sold by Cosmo, which are 50$ bucks pair, and they should be changed every six months.",
      "rating": 5.0,
      "verified": true,
      "author": "poloswolo ",
      "helpful_votes": 0,
      "publication_date": 20200121
    },
    {
      "title": "POWER OF SUCTION HO HO HO!",
      "text": "After doing tons of research and watching review i found that this hood vent was perfect especially living in and Asian house hold where stinky cooking is always a factor. After installing rhis though didnt realize the hole of the exhaust was 8in diameter so i had to cut the bottom of my cabinet a little larger. Now to its performance on the highest vent setting you can cook bacon in the house and you would git very minimal bacon smell escape. I mean like your whole house wont smeel like bacon forever. I love this hood vent glad I pulled a Tim Allen and thought bigger is better because man 900cfm is amazing.",
      "rating": 5.0,
      "verified": true,
      "author": "Giangn",
      "helpful_votes": 0,
      "publication_date": 20200129
    },
    {
      "title": "Efficient and quiet",
      "text": "This hood really pulls out the smoke and grease. It is much quieter than the last two hoods I have owned and pulls much more stale air out of the kitchen. Think I'll use this fan to cool the house with fresh air this Fall and next Spring as well. Surely looks good also. The remote does not consistently work and the hood is heavy enough it takes two people to hold it for instillation, but that is what makes it worthwhile. It is sturdy, attractive and well built.",
      "rating": 5.0,
      "verified": true,
      "author": "Buddy B",
      "helpful_votes": 0,
      "publication_date": 20190701
    },
    {
      "title": "Don’t buy weak power",
      "text": "Installation was hard, the wright of this ranghood was heavy, so u need 2 back screw to support the hood, but the main reason I give it a one star is because the suction power, the suction was so bad when I put a paper there see if suction will hold the paper, but no, it fall very easy cause the weak suction power.",
      "rating": 1.0,
      "verified": true,
      "author": "Jin",
      "helpful_votes": 0,
      "publication_date": 20191129
    },
    {
      "title": "Powerful suction",
      "text": "This is a heavy duty range hood fan that will not disappoint! It does get a little loud at family speed 4 but I can 9only see myself using that speed when using my deep fryer or cooking fish. The first and second speed seem plenty for daily use. It was hard for me to install on my own, so I decided to order a cabinet lift to help me carry the weight and screw it on. The instructions leave plenty to be desired but I was still able to figure it out. Overall i am very pleased with my purchase and I would definitely recommend to others.",
      "rating": 5.0,
      "verified": true,
      "author": "Jesus O.",
      "helpful_votes": 0,
      "publication_date": 20200305
    },
    {
      "title": "Wonderful Range hood!",
      "text": "The 4 speeds are perfect for me. Very sturdy with lighting such as I have never had before. It looks good and operates very easily. From everyday cooking to oven cleaning this fan keeps all odors out of my house. They used to linger for days. I am very happy with this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Dee",
      "helpful_votes": 2,
      "publication_date": 20181015
    },
    {
      "title": "Love the sleek line and permanent  filters",
      "text": "I needed to replace my combination hood and microwave. I decided to separate the items to enable a higher grade on the items. I really love the fact that the filters are permanent and dishwasher friendly. The suction power is great but it does make it louder than my old unit. We did our own installation and found that the pattern did not quite match up making it a bit of a challenge. You do need a loooonnng bit for the screwdriver to set the screws into the cabinet. Overall I love my new hood.",
      "rating": 5.0,
      "verified": true,
      "author": "Simmons",
      "helpful_votes": 0,
      "publication_date": 20200924
    },
    {
      "title": "Not great at sucking away smoke or steam, etc.",
      "text": "Looks fine and turns on but very ineffective at sucking away smoke or fumes. You can see the smoke swirling and not generally getting sucked away. Turns out the design matters more than the cfm.",
      "rating": 2.0,
      "verified": true,
      "author": "GLP",
      "helpful_votes": 6,
      "publication_date": 20180526
    },
    {
      "title": "Way better than expected",
      "text": "Absolutely great. It even has a timer to allow you to leave fan on for a period after cooking. My only issue is that the damper that comes with it is very cheesy. Two plastic pieces with 1/16 inch pivots. The unit arrived with both halves broken. I called cust svc and the first person I spoke with couldn't be bothered. Called back and got a real customet service person. He put new dampers in the mail right away. Once installed I could not be happier.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard G. Maner",
      "helpful_votes": 0,
      "publication_date": 20190527
    },
    {
      "title": "Nice and elegant design.",
      "text": "Produce comes with a template making it easy to install. It is really nice stainless steel that covers the whole range. This Cosmo will remove the air from front burners better than other manufacturers just have their hood range same depth as the cabinets. 2 big fans with 4 fan settings work really well overall. I am thinking to get another one for my parents' kitchen as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Ban Ng",
      "helpful_votes": 0,
      "publication_date": 20200709
    },
    {
      "title": "Great exhaust hood!",
      "text": "This is a really nice exhaust hood especially at this price point. Quiet, nice looking and I get a free gift for leaving a review!! Can’t beat that",
      "rating": 5.0,
      "verified": true,
      "author": "dbaack",
      "helpful_votes": 3,
      "publication_date": 20181211
    },
    {
      "title": "Good range hood at a great price.",
      "text": "The hood works great, no smoke or steam to be seen when my wife cooks. It must be how my wife uses spices the reason for odor to linger a bit longer, bacon smell stays for a few minutes but gets sucked away . No quiet mode though but that's ok, the only feature I wish it have is a timer so that after cooking I can set it to run for 15 to 30mins before it turns off but alas it doesn't have it but the remote is a good alternative.",
      "rating": 4.0,
      "verified": true,
      "author": "Archie Obmasca",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "Broken air flow flap",
      "text": "The air flow flap was delivered broken, I cannot reach customer service. It is holding up with tape but I don’t think that is a long term fix. I wish I could get customer service to respond to me.",
      "rating": 1.0,
      "verified": true,
      "author": "Izzy",
      "helpful_votes": 3,
      "publication_date": 20190127
    },
    {
      "title": "Nice unit",
      "text": "Great looking unit and the price is right. Has enough power for every challenge but it is somewhat noisy. The challenge for us was it has an 8 inch found includes 8 inch flex pipe with the existing hood was 6 inch with a 6 inch Cut in the cabinet and in the outside wall. Simplest option was to reduce it from an 8 inch to 6 inch but didn’t have the proper tools to get all that done but after some trips To Lowe’s we figured it out. Definitely two people to install but otherwise great looking unit it does the job",
      "rating": 4.0,
      "verified": true,
      "author": "Handyman NOT",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "Exactly what I needed",
      "text": "I read a lot of reviews before putting an order. The first one I got did not work well, and they sent a replacement immediately after I issued a return. The 2nd one works very well so far. I can fry some Chinese food now.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon customer",
      "helpful_votes": 2,
      "publication_date": 20190206
    },
    {
      "title": "Compensate for extra height of the hood.",
      "text": "This is an excellent hood. It is sort of commercial quality so far. The suction is great, the lighting is decent, and it looks good. The only concern with using in a kitchen with standard cabinet height is it’s height. With any cabinet taller than 12” above it, would put the hood too low.",
      "rating": 5.0,
      "verified": true,
      "author": "michael lowell dyer",
      "helpful_votes": 2,
      "publication_date": 20190503
    },
    {
      "title": "Great product!",
      "text": "It just worked great or even better than I expected. The suction power is really impressive compared to my old range hood. Of course, you can't avoid the noise with such a powerful motor. Still, the noise is at an acceptable level. Just a reminder here, It is heavy. A car jack or something similar is necessary when installing it. I also recommend a drill bit extension (12\") since the screws are deep inside and hard to reach with just regular drill bit.",
      "rating": 5.0,
      "verified": true,
      "author": "Ben",
      "helpful_votes": 0,
      "publication_date": 20200710
    },
    {
      "title": "Nice Range Hood!",
      "text": "This range hood is sleek looking, powerful yet pretty quiet, it came with a rear and a top template, the instructions were not very clear, I first drilled the wrong holes so there was a big gap between the cabinet and the hood, had to take it down, I end up just use 4 toggle bolts for the top, tighten from the top much easier, then just use two bottom holes to secure to the wall, this thing is heavy I set a coffee table over the range and use a car jack to lift it up, it's well worth it!",
      "rating": 5.0,
      "verified": true,
      "author": "Justice",
      "helpful_votes": 0,
      "publication_date": 20190528
    },
    {
      "title": "Great suction",
      "text": "Very well made and heavy. Make sure you have someone to help install. This cosmo hood has great suction and pulls up the smoke and smell very well Especially compared to the microwave that we had there. It does have a rattle sound in all suction levels. I think it is the dampers but I have not had a chance to check it. Overall I would give it a 4 star rating",
      "rating": 4.0,
      "verified": true,
      "author": "Swapeasy",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "Very noisy.",
      "text": "I did a lot of research before chose this. I compare the noise level data with the other brand. This one looks having better data. I thought it will be ok. However, it is very loud. I can only use the lowest speed. if I use the highest speed, I cannot hear someone call me in the kitchen.",
      "rating": 2.0,
      "verified": true,
      "author": "Jean",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "Awesome Range Hood",
      "text": "So glad we purchased the under cabinet range hood. I got tired of food odors in the house specially when frying. Paying a bit more for a 900-CFM was so worth it, it is not loud at all, very easy installation process. Perfect addition to our stainless steel kitchen appliances. Oh it was well protected in the box and my delivery arrived a day earlier which was even better!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200401
    },
    {
      "title": "looks good and not sure whether effective",
      "text": "stainless steel , heavy and very strong built, it feels like it throwing lot of air out but not sure how effective is. We will have to wait couple of month to see how much grease gets captured in filters. improvement suggested - installing reusable filters is very cumbersome , design easy slide in.",
      "rating": 5.0,
      "verified": true,
      "author": "AS",
      "helpful_votes": 0,
      "publication_date": 20200923
    },
    {
      "title": "Be sure the people exchange the staff do the job .",
      "text": "Is exactly the same come first looks bad the front part ...is no sense to take this out to the box so I want to returned I get my money back ...I dont like they playing and is not funny to go back again to ups to returned ...they dont let me submit so I have to put even 1 star ...",
      "rating": 1.0,
      "verified": true,
      "author": "Susana Guerrero",
      "helpful_votes": 0,
      "publication_date": 20190726
    },
    {
      "title": "Solid Quality",
      "text": "I purchased this hood due to its price and 900CFM power. Quality is very nice and install was straight forward but I would not say easy. My main concern is that after I purchased the hood, the description changed to saying that is only 500CFM. I'm not sure which it is at this point in time. The fans are powerful but definitely make some noise. I am very happy with my purchase as long as I received a 900CFM unit and not 500CFM!",
      "rating": 5.0,
      "verified": true,
      "author": "AKH345",
      "helpful_votes": 0,
      "publication_date": 20200629
    },
    {
      "title": "A fake Suction Power was advertised",
      "text": "When I ordered the same product. It clearly showed on webpage is 900CFM and Now It became 500 CFM. that is not the product what I need for my kitchen!",
      "rating": 1.0,
      "verified": true,
      "author": "dayan",
      "helpful_votes": 2,
      "publication_date": 20200711
    },
    {
      "title": "Very good product to buy",
      "text": "This product is very good looking and great suction power for daily cooking. Only problem I found with this is installation process and instructions. It is definitely not easy to install this product and would be better if they have more easy way to installation it took more than 2-3 hours with 2 people as product is very heavy and not easy to slip on to the top rear screws. Other than installation process I like everything else. Flawless with product. I would definitely recommend this product for your kitchen. It would be more better if it is easy to install.",
      "rating": 4.0,
      "verified": true,
      "author": "srinivas reddy bontha",
      "helpful_votes": 0,
      "publication_date": 20190811
    },
    {
      "title": "Great Quality and Installation is a breeze",
      "text": "Removed my over the stove microwave unit and replaced it with the Cosmo CQS-QS75 range hood. I was pleasantly impressed with the way the unit was packaged in the box it came in. There were no scratches or dents as others reported. I liked the 8 inch diameter flexible aluminum ducting that came with it that made the installation and connection to my outside exhaust a breeze. The volume of air (900 cfm) it is able to exhaust out now leaves no smell residue in the house; A day and night difference from my old microwave unit. Great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Gil",
      "helpful_votes": 2,
      "publication_date": 20181106
    },
    {
      "title": "great range hood. just better design for installation",
      "text": "finally our over the range microwave stopped working. We could find some powerful range hood to replace it now. Installation is hard. at least 2 persons needed for this work. need to use my own rivet and washer to hold the hood under the cabinet. use the pattern paper included to mark the position. But since it's soft paper, really hard to get the exact position even after tape it on the wall and cabinet. My pipe to outside is rectangular shape. So I had to buy some transition from 8\" circle to rectangular. noise level is ok. suck power is great. use level 1 or 2 most of time. Overall, really like this range hood.",
      "rating": 4.0,
      "verified": true,
      "author": "C. Wan",
      "helpful_votes": 0,
      "publication_date": 20191201
    },
    {
      "title": "Works good",
      "text": "Speed 1 and 2 are quite but work well. Think speed #3 & 4 are noise. Comes with Exhaust 8 inches and my wall exhaust is 7 inches so I used a 8in to 7 in reducer from homedepot and screwed down with screw metal sheets and taped with aluminum tape. Overall I love this range hood and got rid off my old microwaved. Instructions not well explained but I got help by two friends to hold the range hood up and I screwed into the wall and upper cabinet. Easier then following directions....",
      "rating": 5.0,
      "verified": true,
      "author": "David Iniguez",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "So much noise",
      "text": "I got this range-hood looking at the good reviews. But its the worst experience for my ears. The noise level is way to high and it sounds like a fan is broken. I cannot even return it as I got fixed to my wall.",
      "rating": 1.0,
      "verified": true,
      "author": "Raki",
      "helpful_votes": 4,
      "publication_date": 20190409
    },
    {
      "title": "Very good looking and effective.",
      "text": "It's a very attractive design, sleek looking and easy to clean. Effective steam removal on the lowest setting, I imagine the high setting could pull most of the smoke from a pan fire out (but haven't tried that). It's not quiet, low speed has a loud hum, high speed is noisy. It's a beast to install, you'll want two strong people handy, also thier install template is wrong, do your own measurements.",
      "rating": 4.0,
      "verified": true,
      "author": "PhilDx",
      "helpful_votes": 0,
      "publication_date": 20200401
    },
    {
      "title": "Don’t buy this piece of trash",
      "text": "I tried to write a truthful review of my experience with this pile of garbage but amazon blocked it. So here is the abridged version: this thing is Chinese garbage. Don’t buy it. If you follow the installation instructions to the letter, you might get your hand smashed.",
      "rating": 1.0,
      "verified": true,
      "author": "J. Guo",
      "helpful_votes": 0,
      "publication_date": 20200508
    },
    {
      "title": "Strong suction",
      "text": "This is one of the best range hoods I have ever owned. The suction removes kitchen odors within minutes. The noise level is about the same as an ordinary microwave fan. The design and appearance is professional. We are happy we chose a Cosmo appliance.",
      "rating": 5.0,
      "verified": true,
      "author": "Armand A. Gonzalzles",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "WORKS VERY GOOD",
      "text": "SO FAR SO GOOD. HAD THIS INSTALLED ALMOST 2 WEEKS AGO AND WORKS GOOD AND LOOKS GOOD. VERY POWERFUL MOTORS 4 LEVELS... VERY GOOD, BIT NOISY BECAUSE OF 2 MOTORS. THE ONE I HAD FOR 15 YEARS COST ME $100 AND IT DID LAST LONG TIME AND IT WAS STILL WORKING JUST DIRTY AND GREASY. I'LL REVIEW AGAIN AFTER A YEAR OR TWO. IF YOU COOK A LOT AND NEED SOMETHING THAT SUCKS ALL THE SMOKE AND VAPOR GO AWAY... I DO RECOMMEND THIS ITEM.",
      "rating": 5.0,
      "verified": true,
      "author": "AC-K",
      "helpful_votes": 0,
      "publication_date": 20200520
    },
    {
      "title": "Crap quality.  Don’t buy.",
      "text": "I bought and returned FOUR of these and each was scratched, scuffed, or dented. I really wanted to install this vent but the quality was so bad. I want about to install a dented and scratched hood into my lovely new kitchen.",
      "rating": 1.0,
      "verified": true,
      "author": "JC",
      "helpful_votes": 2,
      "publication_date": 20190811
    },
    {
      "title": "Very strong suction, Easy to clean, noisy at higher fan speeds, very heavy to install",
      "text": "The Cosmo QS75 30-in Under-Cabinet Range Hood has very strong suction specially at the higher fan speeds. I did not have any problems with the electronics or the clock that some other reviewers have mentioned. It does a great job at the basic function of exhausting the fumes from cooking. It is also easy to clean the baffles as well as the rest of the all stainless steel body. On the less desirable side the hood sticks out more than most contemporary exhausts and you are likely to bang against it specially when working with the inner row of burners. It is noisy at the higher fan speed levels. It is very heavy and definitely needs two people to install.",
      "rating": 5.0,
      "verified": true,
      "author": "Hemant",
      "helpful_votes": 0,
      "publication_date": 20200314
    },
    {
      "title": "Exceeded expectations",
      "text": "Waited a few months to review. Didn’t have a problem many reviews mentioned about lack of template because it did come with one. It is a bit heavy so a couple of people would be needed for installation. The suction is incredible, a friend helped us with installation and was impressed with the suction power at highest level. Even when cooking fried salmon the house doesn’t smell. Haven’t had a problem with control either. It works as expected and we are very satisfied with the purchase. Great value compared to other brands sold at big retailer.",
      "rating": 5.0,
      "verified": true,
      "author": "Customer",
      "helpful_votes": 0,
      "publication_date": 20191106
    },
    {
      "title": "Noise is very high. Forget about running it on high.",
      "text": "Suction power will not even hold a tissue to the grills. This unit is heavy so have someone to help with installation. I am 74 and cannot climb stairs so working in an attic and roof is out of the question. The product was late getting here and it took 2 months to find a contractor to get it installed. Kitchen and bath companies would not install it because I didn't buy it from them and would not be liable for any roof leaks. Now that it has been installed and in use for 2 weeks it is out of warranty and I can not return it. It is a beautiful unit but it is loud.",
      "rating": 2.0,
      "verified": true,
      "author": "Myrna VanDoren",
      "helpful_votes": 0,
      "publication_date": 20200504
    },
    {
      "title": "Great Product - Not too easy to install",
      "text": "The hood is very efficient, sleek and fits well when installed. I am giving a 3 star on installation because the top two screw slots on the rear of the unit are not really accessible for tightening when the unit sits in, unless you have a multi-angle flexible screw driver! I had to go buy a set of hex-head screws to get that part done. If only they had added the hex-heads and made a mention of possible options, they could have a 5 star.",
      "rating": 4.0,
      "verified": true,
      "author": "V Krishnan",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "Awesome product",
      "text": "Has great suction power and looks great! The unit was easy to install, however it is heavy you will want 2 people to install this. The noise level was much less than the old microwave range hood we had, but with the powerful suction you will get some noise at the higher speeds. Unit had everything we needed to install and we were done in 5 hours, not bad considering I don't do installations for a living. Just FYI, it also includes a flexible duct pipe that helps with installation.",
      "rating": 5.0,
      "verified": true,
      "author": "Philip",
      "helpful_votes": 0,
      "publication_date": 20190512
    },
    {
      "title": "Works pretty well",
      "text": "This wasn't the easiest to install and I wish we had the option to use with a duct, but for now we're using it ductless, so the suction power is minimal, but better than the one under the microwave which was previously used. It looks great and overall we're happy with it.",
      "rating": 4.0,
      "verified": true,
      "author": "Trent & Brooke Peterson",
      "helpful_votes": 0,
      "publication_date": 20201019
    },
    {
      "title": "Pain in the A****",
      "text": "The instructions were written by someone that does not have a clue about the English Language or how to install this product. After fruitless attempts at following said instructions I threw them away and engineered the installation myself. Works well and looks great. Just be aware you are on your own when it comes to installing this thing...",
      "rating": 5.0,
      "verified": true,
      "author": "Dan Hutchinson",
      "helpful_votes": 0,
      "publication_date": 20190616
    },
    {
      "title": "Great addition to modern kitchens...",
      "text": "So far so good with this item. Got it installed on Sunday night. Haven't cooked under it except for an electric frying pan, as we haven't finished our kitchen yet. Removes as much air on low speed as our microwave removed on high, and much quieter. The other speeds are pretty loud, but for this much airflow, that is to be expected.",
      "rating": 5.0,
      "verified": true,
      "author": "FullySatisfied",
      "helpful_votes": 0,
      "publication_date": 20190212
    },
    {
      "title": "Wonderful fan",
      "text": "We love our new fan, it’s beautiful and really cleans the air. I like that the ease of cleaning the baffles in the dishwasher. We had an over the range microwave/fan it didn’t work at all. Really happy with our purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "tanzyb",
      "helpful_votes": 0,
      "publication_date": 20200804
    },
    {
      "title": "Good looking unit !!!!!!!!",
      "text": "The instructions are easy and clear. the unit is fairly heavy so it definitely needs two strong people to hold it in place to install it. Unfortunately the screws are kind of weak and using a screw drill broke the head off one was really easy to do not great screws. it has great suction power the lights are bright and it's a beautiful looking unit very well-built and solid.",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan J.",
      "helpful_votes": 0,
      "publication_date": 20191019
    },
    {
      "title": "Nice looking, well-designed, easy for my plumber to install, works very well",
      "text": "My headline says it all. It's attractive and I love the removable filters for easy cleaning. My plumber did the basic installation in under 30 minutes. It's such an improvement on the air quality and cleanliness of our kitchen. The only negatives: 1) the lights, while bright enough for cooking, are harsh and lack a warm glow. Luckily it's a standard GU10 fixture so I can replace it with a warmer bulb. And 2) who needs another digital clock on a kitchen appliance? Yet another clock to change in March and November. But overall I am too, too pleased with this hood!",
      "rating": 5.0,
      "verified": true,
      "author": "M R. Connors",
      "helpful_votes": 0,
      "publication_date": 20191106
    },
    {
      "title": "Excellent product love it",
      "text": "Excellent product love it! Installation is hard due screws and instruction not very good! Had to buy bigger weight bearing screws from Lowes! Very powerful exhaust:)",
      "rating": 4.0,
      "verified": true,
      "author": "M. S. Ibrahim",
      "helpful_votes": 3,
      "publication_date": 20180415
    },
    {
      "title": "Glad we purchased this one!",
      "text": "This range hood is fabulous.Top quality, four speed exhaust, permanent stainless filters, dishwasher safe. Digital controls. Time set is military but we easily adjust: simple math. Glad we purchased this one.",
      "rating": 5.0,
      "verified": true,
      "author": "GiGi",
      "helpful_votes": 0,
      "publication_date": 20200602
    },
    {
      "title": "missing parts",
      "text": "The hood looks like a well made product. Item B in the manual was missing. The item is the damper flap. Emailed customer service 5 days ago with no response. Looks like I will have to buy a flapper.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190308
    },
    {
      "title": "Beautiful and professional appearing.  Strong kitchen performer.",
      "text": "Beautiful, professional appearing asset to my kitchen. Solid and well constructed. My installer was impressed compared to the normal lightweight hoods from the big box stores. LED lighting is excellent for food prep. Might have been nice to have a dual light intensity setting to occasionally serve as a “night light” for company that might want to make a midnite kitchen snack run. Very pleased with this purchase and will recommend to others.",
      "rating": 5.0,
      "verified": true,
      "author": "Pam Burkett",
      "helpful_votes": 2,
      "publication_date": 20181123
    },
    {
      "title": "gets a lot of air out of stove",
      "text": "This extractor has brought balance to our home. I can now cook bacon on high heat without hearing any complaint of bacon smell all over the house. The lights on it are convenient for cooking and it installed perfectly in 30\" opening. c Highly Recommended .",
      "rating": 5.0,
      "verified": true,
      "author": "Denn",
      "helpful_votes": 0,
      "publication_date": 20191120
    },
    {
      "title": "Better than expected. Worth the Money",
      "text": "The range hood arrives on time, well packed. DIY installation took some time, 2 person would be better, but I did it myself. It looks great after installation. Suction power is good enough. Remote control works fine. With the cost and function, as well as the shape and appearance, I am pretty pleased with the product. I would like it to have a delayed auto turn off function like the high end or more expensive brand has, but at this price point, no complaints.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul D.",
      "helpful_votes": 0,
      "publication_date": 20200301
    },
    {
      "title": "Powerful and high performance Hood",
      "text": "Moder design and high performance sturdy Range Hood. 900 cfm is good enough for me to reduce kitchen smell and smoke when I cook spicy foods. It has met my expectations so far.",
      "rating": 5.0,
      "verified": true,
      "author": "B.D.",
      "helpful_votes": 3,
      "publication_date": 20180408
    },
    {
      "title": "Smoke free Cooking!",
      "text": "Previously we had a microwave with an exhaust fan installed over our range. Everytime we cooked something (As opposed to simple heating) the house would fill with smoke or odors. This ducted range hood has solved our cooking issues once and for all. It also looks fantastic!",
      "rating": 5.0,
      "verified": true,
      "author": "stacey warren",
      "helpful_votes": 0,
      "publication_date": 20190825
    },
    {
      "title": "High power - Low Noise",
      "text": "Replaced a 25 year old range hood with this unit. Much more efficient with more power and lower noise then our old unit. Touch controls are easy to use and the LED lights give the right level of illumination. The unit is heavy, not really a one person job to install.",
      "rating": 5.0,
      "verified": true,
      "author": "T. Griz",
      "helpful_votes": 0,
      "publication_date": 20200507
    },
    {
      "title": "It's a heavy weight product so you need to strong place to fit .",
      "text": "It's a heavy duty product, sound is little bit more because so powerful fan . Overall awesome product. The product is for under cabinet but I don't have cabinet on top of the oven that's why put it on the wall . And it's working no complaints yet .",
      "rating": 5.0,
      "verified": true,
      "author": "Mohammad Islam",
      "helpful_votes": 0,
      "publication_date": 20191220
    },
    {
      "title": "Will take off if it has wings",
      "text": "If you buy lay small objects around, it might suck them through the vent, J/K. Very strong fan, my wife afraid to fry fishes in the house, and I put it to test. It does a very good job because my vent goes to outside. If yours is circulating, possibly upgrade it to ventilated vent, worth it",
      "rating": 5.0,
      "verified": true,
      "author": "P. NGUYEN",
      "helpful_votes": 0,
      "publication_date": 20190511
    },
    {
      "title": "High CFM air flow",
      "text": "Nice looking range hood that matches nicely with our new range. It really has a lot of air flow when you need it. It is pretty loud at its highest setting but not too bad on lowest setting. The lights do a decent job lighting the cooking area and are LED which give a more whitish color. Overall a great buy.",
      "rating": 5.0,
      "verified": true,
      "author": "MJS",
      "helpful_votes": 0,
      "publication_date": 20190312
    },
    {
      "title": "Just what I expected in terms of power and noise level,",
      "text": "Quiet, powerful, slick, round corners. This is exactly what I was looking for. No more food smelling house. Beautiful design with round corners. 8\" ducting for proper airflow. Metal damper. I installed it with the help of my wife. Feels sturdy.",
      "rating": 5.0,
      "verified": true,
      "author": "CAZAMENDEZ",
      "helpful_votes": 0,
      "publication_date": 20200412
    },
    {
      "title": "Undisclosed Damage",
      "text": "So I got this item and... first of all: 1. Missing parts 2. Damage dampers 3. Damage air duct 4. Lose parts inside the hood not even in a bag I know that this wasn’t a new item, but the seller should at least post pictures of the damage item, I was in such a tight situation I had to come up with a Mickey Mouse to make it work...",
      "rating": 2.0,
      "verified": true,
      "author": "Javier Delgado",
      "helpful_votes": 2,
      "publication_date": 20190127
    },
    {
      "title": "Terrific hood at a very good price!",
      "text": "I'm very pleased with this hood, which we've had in use for a month now. It seems to be very sturdily built and is both powerful and attractive. The price is very reasonable - indeed, several guests have expressed envy over the hood, which outperforms ones for which they paid considerably more! The hood was well packaged and the stainless surfaces well protected. Instructions were sufficiently clear and included hardware allowed for various installation approaches. The attached photo shows the hood installed but before the final fascia was put in place to give a sense of my installation. Very highly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "Michael A. Gillette",
      "helpful_votes": 0,
      "publication_date": 20191111
    },
    {
      "title": "Love this hood vent!!",
      "text": "We just moved into our new home and had our kitchen remodeled. After reviewing many different hood vents we decided to go with this one. We are SO happy we did!! It looks amazing, works well and even on it's lowest setting it provides even suction when cooking. Our kitchen is big so I think it's cool that it sounds like an airplane taking off on it's highest setting:) The filters look like a commercial grade set up and the lights look great with our new white cabinets. Very happy with this item!!",
      "rating": 5.0,
      "verified": true,
      "author": "Joseph Yacono",
      "helpful_votes": 0,
      "publication_date": 20200927
    },
    {
      "title": "Great item",
      "text": "I love this hood. I am very happy that I chose this item. It came packed well with everything you will need for an easy installation. It came with a template which made everything so easy to install",
      "rating": 5.0,
      "verified": true,
      "author": "GobbleBacon",
      "helpful_votes": 0,
      "publication_date": 20200502
    },
    {
      "title": "Great exhaust fan; though a little hard to install.  Worth it",
      "text": "We replaced an over-the-range microwave with this fan as I do a lot of cooking and wanted something to take the smell out and the microwave was not doing it. This does it. Even on low...which isn't too loud. High is pretty loud but would rather have noise than smell. It is pretty heavy and we did have to purchase a jack ($30) to help with the install. Put one board on range and another board on top of the jack. So, with little help from me my husband was able to install by himself.",
      "rating": 5.0,
      "verified": true,
      "author": "EvKn",
      "helpful_votes": 0,
      "publication_date": 20200509
    },
    {
      "title": "Powerful Range Hood",
      "text": "Beautiful unit - This is a great range hood if you are looking to purchase a strong oriental style range hood. This is a very powerful range hood. A lot of suction,900-CFM Included: One 8\" inch diameter metal clamp / One flexible duct / One Mounting Template. It took a little effort to install it myself with a friend.",
      "rating": 5.0,
      "verified": true,
      "author": "OhAndersen",
      "helpful_votes": 0,
      "publication_date": 20190317
    },
    {
      "title": "Great Suction",
      "text": "Bought this under cabinet range hood for our kitchen from @cosmokitchenproducts and we really satisfied with it. It’s generally quiet at all speeds unless you burn something and switch to highest fan setting. Would definitely recommend to anyone looking for a range hood!!",
      "rating": 4.0,
      "verified": true,
      "author": "Amulya Arora",
      "helpful_votes": 0,
      "publication_date": 20200703
    }
  ],
  "product_meta": {
    "title": "Cosmo COS-QS75 30 in. Under Cabinet Range Hood with 500 CFM, Permanent Filters, LED Lights, Convertible from Ducted to Ductless (Kit Not Included) in Stainless Steel",
    "description": "Style:HoodCosmo presents a modern professional under cabinet range hood perfect for homeowners and builders with limited space. Fits easily into an existing cabinet, has premium brushed stainless steel that matches seamlessly with existing kitchen appliances for a modern upscale look. Our under cabinet range hood features a 500 CFM motor with premium stainless steel baffle filters to trap grease and oil. Newly designed, this under cabinet range hood is both energy efficient and quiet, utilizing high lumen LED lighting for year-round cost savings. Our filters save you money year after year and are dishwasher-safe for added convenience. Trust Cosmo for your next kitchen appliance for premium quality at factory direct prices. Includes 3-prong power plug for easy use. The unit is convertible from ducted to ductless using an optional Carbon Filter Kit (Purchase Part # CFK5) that can be purchased from the manufacturer.",
    "rating": 4.5,
    "feature_bullets": [
      "EFFICIENT AIRFLOW: Featuring 500 CFM airflow, backlit touchscreen, 4-speed fan and twin centrifugal motors; Quickly ventilate your kitchen without the noise of competing range hoods; Optional Carbon Filter Kit for ductless (Purchase Part # CFK5)",
      "EASY TO CLEAN FILTERS: Cosmo’s ARC-FLOW Stainless Steel Permanent Filters are dishwasher-safe and extremely durable. Range hood can be used ductless with optional Carbon Filter Kit (Purchase Part # CFK5)",
      "CONTEMPORARY MODERN DESIGN: Designed to fit under a kitchen cabinet, this range hood adds sophistication to your kitchen. Made of premium 430 grade, 18-Gauge thick stainless steel",
      "ENERGY SAVING LIGHTS: The energy-efficient, 1.5-watt LEDs are long-lasting and provide bright, high lumen lighting for better visibility at night",
      "5 YEAR LIMITED : Our customer support team is based proudly in the USA. Product Dimensions: 29. 5 x 22 x 10 inches Electrical Requirements: 120V/60Hz, 3 Prong Plug. Round duct 7. 5 inch"
    ],
    "specifications": {
      "Brand Name": "Cosmo",
      "Model Info": "COS-QS75",
      "Item Weight": "52.8 pounds",
      "Product Dimensions": "22 x 29.5 x 10 inches",
      "Item model number": "COS-QS75",
      "Capacity": "500 Cubic Feet",
      "Part Number": "COS-QS75",
      "Color": "Stainless Steel",
      "Control Console": "Touch",
      "Voltage": "120 Volts",
      "Fuel type": "Electric",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "ASIN": "B013JVO1U6",
      "Customer Reviews": "4.5 out of 5 stars1,026 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#91 in Appliances",
      "Date First Available": "July 3, 2014"
    },
    "categories": [
      "Appliances",
      "Range Hoods",
      "Ranges, Ovens & Cooktops"
    ],
    "price": 284.99
  }
}