{
  "website_summaries": [
    {
      "verdict": "Energy-saving upgrade from traditional zone thermostats. Works well with smart home environmental systems and remote apps.",
      "pros": [
        "Motion-sensitive temperature display at night",
        "Responds well to most remote programs, including Alexa",
        "Can be installed by experienced homeowners"
      ],
      "cons": [
        "Software performance can be variable",
        "Larger display shows set temperature, not real temperature",
        "Difficult to troubleshoot"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "A complete wireless package with the intelligence to control the temperature automatically. Clean interface makes it simple to use.",
      "pros": [
        "Integrated platform that works with Alexa offers unrivaled voice commands",
        "Presents information in a very clear format"
      ],
      "cons": [
        "One of the most expensive options around"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "Nest is a solid smart thermostat, but the Ecobee4 offers more smart home integrations and a better overall value.",
      "pros": [
        "The $249 Nest Learning Thermostat has a larger display, a better resolution and a far-field sensor for viewing time and temperature information from a distance",
        "It works with Google Assistant and Alexa -- and Nest *finally* sells a temperature sensor as an optional accessory"
      ],
      "cons": [
        "The Nest Learning Thermostat isn't compatible with Apple HomeKit"
      ],
      "aspects": {
        "Features": 8.0,
        "Usability": 8.0,
        "Design": 9.0,
        "Performance": 9.0
      },
      "publication_date": 20180511,
      "rating": 8.5,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Stopped working after 1 Year!!!!",
      "text": "Bought this 1 year ago and thermostat has been great until just now. It is no longer sending enough voltage to the HVAC and the AC is no longer working. Had to have an HVAC tech come out to see what was wrong and they diagnosed and confirmed the issue is with the Nest (hooked up a different thermostat and it worked fine, also connected wires directly and system worked fine). Not sure if this is the result of a firmware upgrade or not. Trying to get some help from Nest support but have been on hold for several hours and have tried multiple times - they are useless. Amazon support was great though!",
      "rating": 1.0,
      "verified": true,
      "author": "RT",
      "helpful_votes": 383,
      "publication_date": 20180503
    },
    {
      "title": "Copper Nest is beautiful and functional",
      "text": "Yes, I’m another proud Nest concert and will never look back! It’s simply awesome for my gas heating and cooling forced air system here in Texas. The weather changes seasons inside of one day here during the winter months so having a Thermostat that switches between AC and furnace automatically is amazing to me. Only thing I would recommend beyond this is a 3rd party plate like the POPMAS copper plate I bought here from Amazon. The neat comes with a super cheap plastic plate that will look terrible. If you’re going to spend $200-250 on a Nest, do spend another $20 on the plate. (See pics)",
      "rating": 5.0,
      "verified": true,
      "author": "Molly Granger",
      "helpful_votes": 218,
      "publication_date": 20181212
    },
    {
      "title": "I heard that Nest thermostat sounds great. It is controllable in the smartphone",
      "text": "I heard that Nest thermostat sounds great. It is controllable in the smartphone. And the design is also very beautiful.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve Kwon",
      "helpful_votes": 155,
      "publication_date": 20171205
    },
    {
      "title": "Won’t Replace Defectice Unit",
      "text": "I’ve had my Nest for a little over two years. Today it disconnected from our WiFi and Nest says the WiFi chip is bust. They will give me a 20% discount, but not replace the product. How does a company sell an electronic device that fails after a few years and not honor its workmanship. I have iPads over 5 years old that can connect to the internet. This is ridiculous.",
      "rating": 1.0,
      "verified": true,
      "author": "boback",
      "helpful_votes": 111,
      "publication_date": 20180808
    },
    {
      "title": "NEEDS “C” wire even though they say it doesn’t. NOT FOR COLD CLIMATES.",
      "text": "NOT FOR COLD CLIMATES!! Nest claims you don’t need a Common “C” wire, but you ABSOLUTELY DO. Without it, in the coldest time of winter your Nest will stop staying charged because it charges off your air conditioning thermostat wire. But when it’s bitter cold, AC units go into a protection mode and stop sending power that was being “borrowed” to charge the NEST. Now I keep coming home to a bitter cold house with a 6 month old baby and 2 year old. This is a 100% known issue, see picture. Then the supposed work around causes my furnace fan to start and stop rapidly, which I’m certain is ruining that motor.",
      "rating": 1.0,
      "verified": true,
      "author": "Healy/Nelson/Thompson",
      "helpful_votes": 56,
      "publication_date": 20190127
    },
    {
      "title": "Product died in 2 years; customer service worse than product",
      "text": "Had this product for a little under two years when it started to go into a reboot cycle. Called customer support to resolve the issue and was informed there was a software issue. That is where the support ended. They offered me a 20% discount on my next nest product and said that was the best offer they could do. Of course, I kvetched and they transferred me to somebody who offered me 40%, alas this was after 60 minutes of waiting and I was in no mood to continue using nest. Buyer beware! Unless you like being on hold, then buy as many as you can.",
      "rating": 1.0,
      "verified": true,
      "author": "O.J.",
      "helpful_votes": 54,
      "publication_date": 20180726
    },
    {
      "title": "Disappointed",
      "text": "I am really beginning to hate it. It doesn't work well with Alexa, not all the functions work. It keeps losing connections to the wi-Fi. And now it's not staying charged. Considering getting something else and using it for target practice. PULL!",
      "rating": 1.0,
      "verified": true,
      "author": "Steve Austin",
      "helpful_votes": 48,
      "publication_date": 20180810
    },
    {
      "title": "TOO SMART FOR MY AC UNIT",
      "text": "We had two different AC Technicians come out to our house to inspect why our ac unit kept tripping. Both told me it was the Nest system causing this. It makes sense because we did not have the problem before we installed it. Now that we switched out for another system, we are having no problems. Amazon is not making it easy for me to return this product. I am having issues dealing with Nest as well. I feel since it was purchased through amazon, they should allow me to return it at least for credit!",
      "rating": 1.0,
      "verified": true,
      "author": "cian c debaldo",
      "helpful_votes": 30,
      "publication_date": 20180911
    },
    {
      "title": "Nest thermostat",
      "text": "Don’t buy; if you encounter a power surge you just toss your money way. I bought one two months ago and there is no way too reset back to factory mode no matter how many suggestions you get for techs. Still not wanting to throw my money away I call two of my friends that I knew had purchased them and ask for help just to find out that they also encounter the same problem and decided to replace with an other brand. Ouch I just lost $300.00 of my hard earned money.😔",
      "rating": 1.0,
      "verified": true,
      "author": "Marilyn s.",
      "helpful_votes": 12,
      "publication_date": 20191120
    },
    {
      "title": "Was great until they dumped their 'Works with Nest' API.  It longer works with my smarthome hub.",
      "text": "Today, Google (Nest's parent company) decided to deprecate their 'Works with Nest' API. It will be completely phased out in 116 days (16 weeks from now). They've rolled out an intrusive replacement that requires a Google account. This will be my last Nest product that I buy. To be clear: I love Nest, I love their products. I hate their parent company and their knee-jerk management style.",
      "rating": 1.0,
      "verified": true,
      "author": "Neil Jansen",
      "helpful_votes": 12,
      "publication_date": 20190507
    },
    {
      "title": "Think Twice Before Making Such a Large Investment",
      "text": "I have had this device for almost a year now. I have come to the conclusion that I should have kept my programmable thermostat. The Nest is great if you need to control your HVAC at a vacation home or other long distance mostly unoccupied home. It might also provide some benefit if you have a DRAMATICALLY inconsistent schedule at your primary residence. But for the average person, there is essentially nothing it has to offer over a programmable thermostat. Unless of course you just feel the need to control something electronically \"just because you can.\"",
      "rating": 3.0,
      "verified": true,
      "author": "2000SS",
      "helpful_votes": 12,
      "publication_date": 20180806
    },
    {
      "title": "Do not install it if you don't have 5 wired system. Networking failed in 2 out of 2 nests in 6 months.",
      "text": "its 6 months out. The networking has stopped working. Troubleshooted as directed. Even a professional came and checked it. It is simply now a regular thermostat. I had 2 of them now both with same issues. Its a scam. Please avoid.",
      "rating": 1.0,
      "verified": true,
      "author": "Gagan",
      "helpful_votes": 16,
      "publication_date": 20171216
    },
    {
      "title": "He is fantastic. But alas",
      "text": "Product probably works well, but I spent two hours prepping the dry wall, texture and paint and then wiring and testing so the thermostat could be mounted to the wall in an attractive manner. Then went on line and signed onto Nest System, followed ALL instructions. IT DID NOT WORK. I called customer service and their rep, DwightS, carefully walked me through identifying any issues. He is fantastic. But alas, the Thermostat is incompatible with my Carrier AC system. It would be a great improvement if there was an online Nest web page that asked a potential customer the ID information on the existing thermostat and whether it is compatible.",
      "rating": 1.0,
      "verified": true,
      "author": "No Public name",
      "helpful_votes": 13,
      "publication_date": 20170826
    },
    {
      "title": "if you have only 4 wires DO NOT BUY, will drive you crazy",
      "text": "Turns off and on all the time. worst experience ever. I have a standard DC 4 wire setup, This thermostat is horrible, it turns off suddenly before reaching desired temperature. Customer support told me it was wrong installation af first, telling me it was wires not making contact. They were WRONG. This thermostat NEEDS 5 wires to work, BUT THEY DONT SAY THAT RIGHT OFF THE BAT. Many sleepless nights with no AC.",
      "rating": 1.0,
      "verified": true,
      "author": "EBaiz",
      "helpful_votes": 9,
      "publication_date": 20180714
    },
    {
      "title": "Continued issues when weather got cold. Now power problem ...",
      "text": "Continued issues when weather got cold. Now power problem. Research online all the issues when cold weather before buying this product. The thermostat says says no power to red wire when checking the red wire with the yellow and white wire the voltage is 26v more than the required 24V (range should be 24 to 30V). Nest tells me it is a faulty base to the thermostat. The $60 dollar trane thermostat is actually cooling the house while waiting for a replacement. I almost bought an ecobee after reading reviews but bought the nest because of Google. Wish I hadn't bought the nest with all the troubles and days without a functioning system.",
      "rating": 1.0,
      "verified": true,
      "author": "Ralph Sherrin",
      "helpful_votes": 7,
      "publication_date": 20180508
    },
    {
      "title": "Warning! Nest is now owned by Alphabet and is being incorporated into Google’s Smart Home system.",
      "text": "I purchased the 3rd Gen. Nest thermostat only to return it after learning Nest has recently been repurchased by Google’s parent company Alphabet. Google is an information and marketing company that gets it’s information by offering services, ie GoogleMaps, Gmail, Chrome and selling the user information for marketing purposes. Although I was interested in the features offered by a wifi thermostat, it is not worth the price of my personal information on an ongoing basis.",
      "rating": 1.0,
      "verified": true,
      "author": "Eric B.",
      "helpful_votes": 7,
      "publication_date": 20181020
    },
    {
      "title": "A new level of comfort",
      "text": "My installation is a simple forced air heater. For years I have had a basic programmable thermostat. I found a like new discount NEST (the one with the fancy screen) and jumped at the chance to upgrade. The installation was easy enough (I did need to do a factory reset but that is to be expected given it was a used device). Once completing the reset it has functioned flawlessly. With the ability to manage the system from my smartphone and the devices ability to adjust to my schedule and temperature setting makes to really nice. After a few weeks it seems to automatically go on or off just like it was reading my mind.",
      "rating": 5.0,
      "verified": true,
      "author": "Metz",
      "helpful_votes": 3,
      "publication_date": 20191124
    },
    {
      "title": "MY nest worked perfectly for about 5 months, then ...",
      "text": "MY nest worked perfectly for about 5 months, then all of a sudden, it will not stay charged. I have removed from base and charged with micro USB cord and still will not stay charged longer than 2 hours. Now my A/C will not turn on and stay on due to thermostat shutting down. Even with out the Common wire connected, my nest worked for over 5 months, it is supposed to charge while the A/C, Fan or Heater are running without the Common wire connected. It is not charging even while the A/C is running. It will not get above 2.6 volts even after spending all night on the wall charger. Biggest piece of junk I have ever bought.",
      "rating": 1.0,
      "verified": true,
      "author": "Anthony",
      "helpful_votes": 6,
      "publication_date": 20180523
    },
    {
      "title": "Is that you HAL 9000?",
      "text": "The 'learning' part of this thermostat is that you learn that it will adjust the temperature anyway it pleases no matter what you do. Set it 19C, come back 20mins later and its set to 24C. Turn off Eco, 2hours later its back on. I left it installed for 3 weeks, got frustrated that it was like having my cat control it, and then de-installed it. It gets 1 star for appearance and packaging.",
      "rating": 1.0,
      "verified": true,
      "author": "EastBayRae",
      "helpful_votes": 6,
      "publication_date": 20190217
    },
    {
      "title": "Pathetic customer support. C grade software system. Do not buy!",
      "text": "Bought 3 nest thermostats for my house. I put a lock on the range using the Nest app. I tried to change the settings from Heat to Cool from the app, it did not work. I tried to unlock the devices from the app it did not work. I forgot the lock password. I am now stuck with the thermostats in the \"heat\" mode. I called customer support, I am on call for 2 hours waiting for the senior support folks as the first level cannot solve the problem. I can clearly see that Nest and Google are going downhill. Google no longer stands for quality - they need to learn from Amazon.",
      "rating": 1.0,
      "verified": true,
      "author": "FM22",
      "helpful_votes": 4,
      "publication_date": 20190513
    },
    {
      "title": "Poor customer experience, Nest is junk",
      "text": "Product didn't last 6 months, tried to send in for a replacement and they said I need to hook it back up and troubleshoot it. It's the dead of summer and the the hvac guy already hooked up the original thermostat. Nest wanted me to unhook that one and hook the Nest back up. $235 down the drain. The hvac guy said these things are junk.",
      "rating": 1.0,
      "verified": true,
      "author": "BERK",
      "helpful_votes": 6,
      "publication_date": 20180816
    },
    {
      "title": "I am going to buy again",
      "text": "I love my Nest, I would recommend it to everyone that comes into my house. So great that you can control your temp from anywhere in the world. Also the home/away assist and other energy saving techniques really do save you money. Installing is also easy as long as you don't rush. I am moving in a few months and will be buying a new Nest for my next home.",
      "rating": 5.0,
      "verified": true,
      "author": "Emery G.",
      "helpful_votes": 3,
      "publication_date": 20191127
    },
    {
      "title": "Warning to anyone with an older home, make sure ...",
      "text": "Warning to anyone with an older home, make sure your wiring can handle the device. We tried for two months to get ours to work, the fan for our A/C would constantly run and then it wouldnt work with our heat. Had an HVAC guy come out to assist and he said he sees this issue all the time with people who have purchased a Nest. Unfortunately this product has an incredibly short return policy, so I wasnt able to return for another thermostat.",
      "rating": 1.0,
      "verified": true,
      "author": "Malori",
      "helpful_votes": 7,
      "publication_date": 20171030
    },
    {
      "title": "Buy a Honeywell.",
      "text": "Purchased based on good reviews. Well, it quit working after four months. Then, had several HVAC reps tell me that the NEST is junk and to buy a Honeywell. Now I can’t get my money back on the Nest.",
      "rating": 1.0,
      "verified": true,
      "author": "Tori",
      "helpful_votes": 6,
      "publication_date": 20190507
    },
    {
      "title": "Bogus reviews--13,000 agree 99%--Never",
      "text": "Here I sit freezing my butt off. Three times I have dealt with Nest support staff. The Nest thermostat has not worked from day one. Bells whistles, but no consistent, reliable HVAC control. I was at first skeptical when I saw that 13K+ people rated it so high. Ask yourself: does 13000 people have such unanimity on anything Yet my skepticism based on statistical classes gave way to the romance of big numbers I could read on the display and the bogus too-good reviews. If you do not believe this product is junk, come over and sit a spell but bring a heavy coat and two pair of socks.",
      "rating": 1.0,
      "verified": true,
      "author": "Paul J Paradis",
      "helpful_votes": 3,
      "publication_date": 20190301
    },
    {
      "title": "Too much hype for nothing, bad product with bad support",
      "text": "Spent 3 hours on the phone with Support troubleshooting, swapping wires from contact to contact, etc., to no avail, it kept blowing hot air instead of cool. The wait time to talk to Senior Support staff is 45 minutes! A product that is incompatible with most systems, plus a frustrating support service. Don't buy, stay with your current brand of thermostat. After all, this fancy looking gadget doesn't really offer anything special; you just need cool air in the summer and that is all you expect from a thermostat.",
      "rating": 1.0,
      "verified": true,
      "author": "GM",
      "helpful_votes": 3,
      "publication_date": 20181012
    },
    {
      "title": "Google took over Nest and the broke it.",
      "text": "The biggest problem with Nest right now is that Google has taken over complete control of the product and in doing so they took away many features. This will not work with Alexa in the way that you want, will not work with IFTTT, and therefore making automation work with this impossible. It's really sad because it was working just fine before, but almost all of the automation functionality of talking to your other smart devices has been removed.",
      "rating": 1.0,
      "verified": true,
      "author": "Callum",
      "helpful_votes": 2,
      "publication_date": 20200331
    },
    {
      "title": "Disappointed - Ordered 4 thermostats - and 2 of them do not work",
      "text": "At first, all 4 thermostats worked fine. Then, about a week later 2 of the 4 thermostats stopped connecting to the internet. We looked it up online and there were a lot of suggestions to try to get them to reconnect - but none of them worked. So, we now have 2 thermostats that are just the same old \"manual\" type thermostats that you could by for about 1/10th the price at the hardware store. We are past the time where we could return them - and there does not appear to be any way to contact the seller to try to have them fixed. Very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20190131
    },
    {
      "title": "Issue on the 2nd day, does not reply to your message",
      "text": "I had an issue where the thermostat wouldn’t stop. I was outside but had to drive back home to turn the AC off by shutting off the power. I messaged the seller few days ago but I haven’t received any reply. I had to reset the device so it would work again but I’m doubtful with this device now that it had failed once on the second day of usage... Main reason for the one star is because I expect amazon sellers promptly replying customers and not just ignoring their messages. Any new problem with the device, I’m returning it.",
      "rating": 1.0,
      "verified": true,
      "author": "Picky One",
      "helpful_votes": 3,
      "publication_date": 20180910
    },
    {
      "title": "Worked for less then a week and died",
      "text": "Just moved into our new house and Installed the Nest. We were pretty happy with it until my AC unit stopped working. We were getting ready to call for servicing when my husband decided to put the old thermostat on to see if that was the issue. As soon as we took off the Nest and put the thermostat back on, the AC unit kicked on. Before this happened the Nest kept switching it to the \"away\" mode and the house was getting hot. I guess we received a defective unit. Pretty sad because we loved the options it provided. Not going to chance it again when it's 94 degrees outside.",
      "rating": 1.0,
      "verified": true,
      "author": "Helen",
      "helpful_votes": 3,
      "publication_date": 20180927
    },
    {
      "title": "I would like to like this product, but when something goes wrong it goes wrong",
      "text": "After close to 2 years, all of a sudden it stopped connecting to WiFi. It would connect and disconnect immediately. Troubleshooting is next to impossible, it just gives you a cryptic message w/o any details. I've done a hard reset of the thermostat and a hard reset of my WiFi router. No change. I'm out of warranty out of luck. For $250 I expect better quality and way better support. This is unacceptable. I won't be buying any more Google products, their warranty and support are atrocious.",
      "rating": 1.0,
      "verified": true,
      "author": "Pavel Chernikov",
      "helpful_votes": 2,
      "publication_date": 20190905
    },
    {
      "title": "Nice design, but I hate it",
      "text": "I hate this thing. I've been on support 3 or more times now to get the home/away assist to work. That's all i really care about. I want it to turn on when I am home and turn off when i leave. Support keeps having me do different thing and nothing works. The home/away assist is supposed to detect when my cell phone is at home. It doesn't and now my activity history does not work. You can find less expensive themostats that work better than this. I'm sitting at home working in my office wondering why it's so hot. It's because it thinks I'm away and sets the thing to eco mode.",
      "rating": 1.0,
      "verified": true,
      "author": "S. R.",
      "helpful_votes": 3,
      "publication_date": 20180423
    },
    {
      "title": "Just burn your money",
      "text": "You WILL have problems with these. Setup is easy. Pull off the old thermostat and replace wires in the new one. When it works, it works great, however, when you have issues (and you will have issues) you’re done! Call tech support and you’ve just wasted a couple hours of your life you’ll never get back. I’ve been handed off to several “technicians” and they will jack your settings, wires, etc., then pass you off to another “technician”. This company and product is worthless. Read threads on Reddit. I’ve already replaced one and I have another dreaded call to make because of WiFi issues. I have two. One works one doesn’t. Here goes another few hours of my life...",
      "rating": 1.0,
      "verified": true,
      "author": "R&R",
      "helpful_votes": 0,
      "publication_date": 20200407
    },
    {
      "title": "Does not read temperature correctly.",
      "text": "I wish I had done more thorough research before buying this turd of a thermostat. The thermostat is a huge disappointment all in all. From needing google account integration to blatantly reading the temperature wrong by 6 degrees. I’ve reset the damn thing multiple times, scanned for updates reset again and low and behold the stupid thermostat which it’s only 1 job is measuring temperature just can’t do it correctly. If you’re reading this and are between an ecobee or a nest I can safely say you’d be best off with an ecobee as at the moment I’ve re-installed my ancient Honeywell and am selling this POS Nest on eBay for a fraction of what I paid for it.",
      "rating": 1.0,
      "verified": true,
      "author": "Mustafa_Jenkins",
      "helpful_votes": 0,
      "publication_date": 20200627
    },
    {
      "title": "Don’t buy; doesn’t work 100%; horrible tech support",
      "text": "Nest says you don’t need a C wire but it won’t run without the C wire. I added the C wire. Now it keeps running the AC even after target temp is reached. I have been waking up in the middle of the night to find the house is freezing. Then when I turn the AC off, it doesn’t cut power to the AC unit. So, it keeps running. The only way to turn AC off is from the breaker. Called Nest but they won’t help. My 20 years old thermostat runs fine but this expensive pice of junk doesn’t work.",
      "rating": 1.0,
      "verified": true,
      "author": "jajabor",
      "helpful_votes": 2,
      "publication_date": 20190612
    },
    {
      "title": "It got annoying because my circuit breaker is down stairs",
      "text": "had to return this. Installed per instructions and still didnt work. Called NEST customer service and had me switch wires around over 10 times..It got annoying because my circuit breaker is down stairs. I lost about 5 pounds that day..Customer service finally told me that maybe I installed unit incorrectly and that I needed to pay more money to get a NEST PRO out there. I said NAh im good and i told them I will just install my old thermostat.. He said it wouldnt work. I hung up on him and installed my old thermostat. Worked perfect. Wish he would have just listen and sent a new unit.",
      "rating": 1.0,
      "verified": true,
      "author": "JP",
      "helpful_votes": 3,
      "publication_date": 20180604
    },
    {
      "title": "New version is very cheap he feeling and does not attach to backing plate very well",
      "text": "Extremely overpriced for what they are especially the new version is very cheap feeling old ones felt robust and what you would expect new ones have cheapie basil it feels like it won’t last very long also had a really hard time while doing set up To not pull faceplate off wall does not seat to backing plate very well I am in the HVAC industry and for this kind of money there are much much much better thermostats on the market but why many people purchase them has nothing to do with functionality but because they are trendy",
      "rating": 1.0,
      "verified": true,
      "author": "Ninefinger",
      "helpful_votes": 3,
      "publication_date": 20180519
    },
    {
      "title": "Not ready for prime time!",
      "text": "Got this unit installed quickly and easily. Went through unit testing successfully. In operation the unit would only heat, baking the house. Attempted to test again, the unit refuses to test if outside temp is <60 degrees?! It was 59 outside, 80 inside thanks to unit. Attempted to chat with service, 53 ahead of me, obviously lots of malfunctioning. When you allow a machine to control major home systems, you must be able to trust it. Don't trust this one! Found others with the same problem, probably software. I have not found anyone successful with this product.",
      "rating": 1.0,
      "verified": true,
      "author": "Ken",
      "helpful_votes": 4,
      "publication_date": 20171127
    },
    {
      "title": "DOES NOT WORK WITH TWO-STAGE, VARIABLE SPEED HVAC SYSTEMS",
      "text": "Bought the 3rd generation NEST in May 2016, had to get a new furnace system and does not work with two stage, variable speed furnace? Worked fine with one stage furnace and is SUPPOSED to work with two stage gas furnace but sends wrong message to gas furnace (calls it a heat pump?) technician here for over 6-hours trying to troubleshoot. replaced thermostat with a Honeywell, everything work great. Was sold on Nest but now I am very disappointed with this NEST thermostat as it says it is supposed to work. STAY AWAY if you convert to new furnace and A/C systems.",
      "rating": 1.0,
      "verified": true,
      "author": "Ray",
      "helpful_votes": 5,
      "publication_date": 20170820
    },
    {
      "title": "Not much better than a dumb thermostat",
      "text": "Lovely design. Great to be able to control the temp from your phone. However, the Home/Away Assist is completely broken (with Android 9.0). I've woken up to a 50°F house because the Nest thought my phone left the house at 3am (!?) and turned off the heat. I've also come home to a house where the furnace was on all day because the Nest thought I was home. I've disabled this functionality... but really, that's why I bought the Nest. Now I have to manually turn on/off the furnace... the same way I did with my $30 dumb thermostat.",
      "rating": 2.0,
      "verified": true,
      "author": "Reviewer",
      "helpful_votes": 2,
      "publication_date": 20181206
    },
    {
      "title": "Installation is not straight forward. Got their online assistance ...",
      "text": "Installation is not straight forward. Got their online assistance and was advised by Nest to do it incorrectly. It worked through the winter but wouldn't control the air conditioning when it finally got hot enough to turn on the system. Not saving us a dime when I have to spend $200 for a service call to fix a simple thing Nest should have made clear if they are giving installation advice. On top of that, record heat and no AC. Would consider an alternative were I to do it again. Makes me concerned about their other products. May revise after seeing how their customer service assists in remediating the problem.",
      "rating": 1.0,
      "verified": true,
      "author": "B. Link",
      "helpful_votes": 3,
      "publication_date": 20180607
    },
    {
      "title": "Not worth the money. The display is UNSATISFACTORY.",
      "text": "Not sure what the heck is going on. First one came broken. We had to send it back. 24 degrees out, NEST took 5 days to get the new one to us. Set for 65, but the heat comes on when it's 70 in the room. It must be \"learning\" we are coming home, so warms the home well beyond what we want. The display is UNSATISFACTORY. It displays only the temperature setting with a 4 pitch font display of the current temperature in the room. I want to see the current temperature in the room first. Worthless. I would not buy this again.",
      "rating": 2.0,
      "verified": true,
      "author": "RTaylor",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "Worst thermostat",
      "text": "It is the worst thermostat you can ever have. Battery died in 6 months and wouldn’t charge.Contacted customer care and was assured that a brand new replacement will be sent. But instead i received a refurbished one. After i raised my concern they again sent another refurbished one. Now this refurbished thermostat is behaving weird. Temperature set to 77 degrees and even when the room temperature is 77,the thermostat runs till the room temp reaches 76. Now the customer care agent says “Return your thermostat “ after the return window is closed.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200904
    },
    {
      "title": "Complicated. Takes time to learn. Has a mind of its own.",
      "text": "Took me two weeks to get it right. It would not connect to WiFi so I couldn’t work it on my phone during that time. It has a mind of its own and is very complicated to figure out initially. I would wake up to hear blaring when I turned it down to 64 to sleep. It takes some getting used to but I finally feel like I got it figured out. It works okay now. I like to be able to control it from my phone but I wouldn’t buy it again. That’s the only perk. I have to keep my heat higher than I did with my old thermostat to keep it comfortable in my house.",
      "rating": 3.0,
      "verified": true,
      "author": "Jennifer",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "Works great",
      "text": "I installed the Nest and had it set up in less than an hour and that included having to charge the internal battery for about 20 minutes with the micro usb port on the back. It wouldn’t connect to the internet until the battery was charged enough. After connecting to the internet it was easy to set it up with Alexa. I set a few schedule points for the first few days and it worked great. I noticed the first couple times i’ve left the house it hasn’t gone to the away mode without me doing it myself but it has gone back to home on its own when i returned. I am very pleased so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Big Dawg",
      "helpful_votes": 0,
      "publication_date": 20200302
    },
    {
      "title": "Total waste of money!!!",
      "text": "I bought 3 - two for our office and one for home. The only redeeming feature is remote monitoring and control. The scheduling and energy saving is total crap. I used to come home to a cool home with my simple Honeywell and its schedule. Despite entering a schedule and turning on \"early on\", I still come home to a hot house even after 3 weeks of \"training.\" At our office, during a really hot spell both units shut down all weekend and didn't precool at all beforehand despite weeks of training and a manually entered schedule. Took three days of miserable heat to recover! Worst investment ever!!!",
      "rating": 1.0,
      "verified": true,
      "author": "ramman",
      "helpful_votes": 16,
      "publication_date": 20160621
    },
    {
      "title": "Great Thermostat but Trouble Connecting to Alexa",
      "text": "As a thermostat that promises to save me money by adjusting the temperature when I’m not at home, I couldn’t ask for better. However, since Google bought Nest, I have yet to integrate it with Alexa. The directions on how to migrate my account to Google has not worked so far. (Google wants you to use Google Home with all Nest products. I want to use Alexa.) Waiting until after the holidays. This is not the thermostat’s fault. Just be aware that using Alexa is not as easy as it use to be.",
      "rating": 5.0,
      "verified": true,
      "author": "SandyW.",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "For the most part....",
      "text": "I like that it updates the home compared the faded white box. Scheduling is easy, I don’t use the Eco due to my medical issues. I purchased the echo combination and I think I need a hub because Alexa only tells me the temp, the AI doesn’t change the temp for you. However the app is nice to change the temp once you’re comfortable in bed and not wanting to get up, lol. Oh!, install is simple!!!!! Please check your wiring before ordering and do your research. It took me three years to finally bite on this thermostat (Black Friday sale) I personally don’t think it’s worth the full price amount.",
      "rating": 4.0,
      "verified": true,
      "author": "Gary",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "Migrating to EcoBee",
      "text": "Bought this a couple of years ago for my one house worked great. Now that Google has bought nest all the compatible devices are no longer going to be compatible. Only with Google products and maybe* Alexa. Will not be buying this product anymore will migrate to the EcoBee which is what I have in my beach house. Far superior to the nest unless a huge deal to get the nest for $60 I would not invest since Google is taking it over very shortly now. Will be changing the Nest out for another EcoBee will donate the nest to Goodwill.",
      "rating": 3.0,
      "verified": true,
      "author": "Aaron",
      "helpful_votes": 2,
      "publication_date": 20190512
    },
    {
      "title": "Does not support Google G-Suite Accounts",
      "text": "Google has discontinued its support of Nest legacy 3rd party Integrations and is requiring users to migrate their Nest accounts to Google. Free Google Gmail accounts are supported but for some insane reason paid G-Suite accounts are not. I bought several thermostats a year ago and now I am no longer able to use some of the features that made me buy this product in the first place because I have a paid Google account instead of a free one. Do yourself a favor and stay away from Google products.",
      "rating": 1.0,
      "verified": true,
      "author": "Steve G.",
      "helpful_votes": 0,
      "publication_date": 20191125
    },
    {
      "title": "Works with No C wire",
      "text": "I was unsure about spending 200+ on a thermostat But I am glad I did. So far it has was worked flawlessly with and without using the app. I like the big numbers, No need to go get my reading glasses to see what the temp is set too. It was real easy to install and it is working on my system without a C wire which all other wifi thermostat require The wires on my system are yellow, green and red. Update 10/11/19 I bought another to use on my heat system which only had a red and a white wire. It works great Glad I bought it",
      "rating": 5.0,
      "verified": true,
      "author": "steve",
      "helpful_votes": 0,
      "publication_date": 20190701
    },
    {
      "title": "Temperature reading incorrect",
      "text": "I ordered this product thinking it would help me save $$'s at one of my rental properties in Hawaii. Unfortunately it seems that the temperature reading calibration was off on install so when it was reading 78deg it was actually 74deg which means a renter would set it to a temperature they thought was reasonable it was over cooling the condo. this resulted in higher than usual electricity costs instead of the lower costs I was looking for. I'm confident that the device would help us if it was reading the temperature correctly. Unfortunately the install technician just un-installed the device instead of working with tech support on it.",
      "rating": 3.0,
      "verified": true,
      "author": "Rob Seaman",
      "helpful_votes": 0,
      "publication_date": 20190919
    },
    {
      "title": "BEWARE: This doesn't work on some systems!",
      "text": "Had to return for credit after I ordered the NEST thermostat, three remote sensors and a wall plate. I started opening the packaging and noticed a small sticker with a warning that the thermostat doesn't work on all systems and gave a URL to check. Turns out my 4 wire ABCD system can not work with the NEST thermostat. I have a high tech, high efficiency Bryant system. I don't know why Google would exclude some systems, especially one that is only about 6 years old!!",
      "rating": 2.0,
      "verified": true,
      "author": "Douglas Rhoads",
      "helpful_votes": 0,
      "publication_date": 20201008
    },
    {
      "title": "So many features you don't need! Accurate temperature - nope!",
      "text": "This thing is to control temperature, right? Don’t buy it! It us the most frustrating thermostat you’ll ever have. It cannot read accurately. It will always be too cold or too hot. The cheapest thermostat will do much better job. Also, these things fail on cold nights. I think its hacking but cannot prove it. I has all the bells and whistles you’ll turn off anyway. Only good thing is to set temperature over your phone, but that’s whats dangerous about it! We are so happy with good old Honeywell!",
      "rating": 1.0,
      "verified": true,
      "author": "Elmedin",
      "helpful_votes": 2,
      "publication_date": 20191124
    },
    {
      "title": "Very disappointed.",
      "text": "I have used Nest products for several years. Thermostats, smoke detectors, the works. Ever since Google integrated with Nest, the Nest app does not communicate or support the products. Tech support is non existent and they lack knowledge and have difficulty communicating properly to the consumer No follow up support. My instincts tell me they know there is a problem with the integration since the software updates with google but don’t want to tell you because you will just use the thermostat at home without being able to set them remotely. Very disappointing. Returning all my products and deciding to go with a system that supports the software changes.",
      "rating": 1.0,
      "verified": true,
      "author": "Jon",
      "helpful_votes": 2,
      "publication_date": 20191111
    },
    {
      "title": "great thermostat, but difficult connectivity",
      "text": "I have a house that is well integrated with Alexa connected products. Since I had previously owned a nest and liked it very much, I decided to add it to my current home. It was very easy to install and works beautiful as a learning thermostat. But, when I tried to connect it to my Alexa system, it became a nightmare. No matter what or whose directions I followed, it kept telling me I had to transport my google account or my Alexa accounts, etc. Every time I tried, it said it couldn't find the Nest or I had already transported my account previously. Nothing has helped. This is not a user friendly Alexa product!",
      "rating": 3.0,
      "verified": true,
      "author": "Robert A. Simpkins",
      "helpful_votes": 0,
      "publication_date": 20190924
    },
    {
      "title": "Great thermostat not made for complex HVAC",
      "text": "The Nest thermostat works well for simple systems. It is easy to use and reliable. For single stage systems it is great. It’s not great for multistage heating or cooling systems. First it is quite dumb. It will only turn on the second stage AC once the temperature gets 3 degrees more than the set point. This is not adjustable. Therefore you are sweltering before the second stage kicks in. For heat you can only turn on emergency heat at the thermostat not via the app. Again it’s dumb. Other cheaper thermostats like Honeywell handle multistage systems better and are cheaper. Bottom line is Nest is great for single stage systems. Get something else for multistage systems.",
      "rating": 4.0,
      "verified": true,
      "author": "JD",
      "helpful_votes": 0,
      "publication_date": 20200202
    },
    {
      "title": "Pretty on the wall...",
      "text": "I'm definitely regreting getting the Nest. Our energy bill has almost doubled because of Google's crap algorithms that keep getting forced on you. There are 4 features which don't work. Learning, Eco, Home/away and schedule. We have turned off everything (except schedule... you can't.) Yet it will constantly put random temperatures in the schedule. For example, I just deleted 80 degrees at 10 am, followed by 73 deg at 4pm. (Hmmm... I wonder why my freaking electric bill has doubled!) Also, Google made deleting these values a tedous pain. The app isn't very good either... Definitely needs a lot of work. It does look pretty on the wall, though.",
      "rating": 1.0,
      "verified": true,
      "author": "NONAMEHERE",
      "helpful_votes": 0,
      "publication_date": 20200901
    },
    {
      "title": "2019 - Forced \"Upgrade\" major security risk... NO LONGER USABLE",
      "text": "As of October 2019 you can no longer invite a user to your \"Nest\" account. They are forcing a migration to \"Google Home\". So now, if you want to give anyone access to control the thermostat they can: Add new devices, like speakers, displays, or a smart light bulb Use and change the settings of the devices in the home Automatically link their media services, like YouTube, to speakers, smart displays and Chromecast built-in devices in the home Add and remove other home members, including you I gave guests who i just want to control my thermostat and nothing else. What the heck? Why is there only 1 level of access? Can i have my money back? LOL",
      "rating": 1.0,
      "verified": true,
      "author": "Michael P",
      "helpful_votes": 0,
      "publication_date": 20191101
    },
    {
      "title": "Have 5 units.  One major flaw.",
      "text": "The ambient temperature sensor overheats (probably due to the wifi module) and heats the unit itself up 6 degrees or more. This makes the AC run constantly which freezes the the lines. I've called NEST support 3 times regarding this. They are unable to help and say there is NO issues with the unit heating up. I've loved nest for years, but whatever update they pushed out in the last year caused this issue. I just read on a forum that you can turn off WIFI within the nest and it will cool off and read normal ambient temps... I'm doing it now.",
      "rating": 2.0,
      "verified": true,
      "author": "JMason",
      "helpful_votes": 0,
      "publication_date": 20190702
    },
    {
      "title": "Don't buy the Nest Thermostat.",
      "text": "I purchased the Nest because of the reviews but it isn't a good thermostat. The biggest problem I have is that the Nest doesn't have built-in compressor protection. So if you have power failures or surges you could burn out your compressor. I tried reaching tech support to see if in fact the thermostat had this feature and was on the phone for over an hour to get a answer. Buy a Honeywell, Ecobee or Emerson thermostat because they have this very important feature.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20200622
    },
    {
      "title": "Has been great for a year, then failed base, still no homekit support.",
      "text": "I calculated that this product saved me $100 over the past year. However, it suddenly stopped energizing the reversing valve and after tons of diagnosing and spending $100 for an AC company to confirm, I'm stuck without cooling and waiting for a new part to show up 5-7 business days later. Not sure why Nest is so confident that it's the base because the thermostat could also be producing these exact same symptoms and none of the diagnostic steps isolate the base vs the thermostat. Also, no homekit support. First and last Nest I will buy. The competition has caught up and has excellent products worth considering.",
      "rating": 3.0,
      "verified": true,
      "author": "Alexandru Barabas",
      "helpful_votes": 0,
      "publication_date": 20190102
    },
    {
      "title": "Wrong measurements of actual temperature.",
      "text": "I do love it but the temperature sensors are not calibrated properly... Meaning it states a temperature approximately 5 - 8 degrees warmer than it actually is. States its 75 degrees when its 68 degrees. Ive searched high and low for a solution and found it to be a common occurance with folks all around. Hoping it'll be fixed in a software update.",
      "rating": 3.0,
      "verified": true,
      "author": "Ranmar",
      "helpful_votes": 3,
      "publication_date": 20181106
    },
    {
      "title": "Great thermostat for saving money, not too hard to install",
      "text": "We love this thermostat in our house. It's great for saving money with the adaptive temperature control, especially for when you come and go. It will tell you when you have the temperature set in an eco friendly range. You can also set it up to notify you when your electric provider has surge pricing enabled so that you can save money then. Our bill has soberly seen savings since getting this. We also put the thermostat in ourselves. It take probably 30 minutes, which is not bad but you should have minor repair and home improvement skills. Also, double check on Nest's website that your system is compatible with this thermostat. Not everyone's is.",
      "rating": 5.0,
      "verified": true,
      "author": "Rebecca B",
      "helpful_votes": 0,
      "publication_date": 20201001
    },
    {
      "title": "Perfect Thermometer",
      "text": "I am changing my review because the problem was not the nest product and was the connection I have to the nest. Still I needed to upgrade the connections (cables) and forced air system to be able to provide nest enough and stable energy to function. As soon as I started to use nest, my ConEdison bill is halfway less. Hard to believe but the only thing we changed was to have the nest thermostats.",
      "rating": 5.0,
      "verified": true,
      "author": "KH",
      "helpful_votes": 2,
      "publication_date": 20181205
    },
    {
      "title": "Great addition to your smart home",
      "text": "We love our nest thermostat. Helps control from phone using the nest app. Also integrates with Alexa for some basic operations like temperature control. Ours sometimes goes offline which I had not had a good handle on. It comes back automatically after the nest thermostat comes up online and working. It also has reminders for changing filters which is good. Also several utility companies reimburse for portion or whole of the nest thermostat cost if you want to check with your utility provider.",
      "rating": 4.0,
      "verified": true,
      "author": "gaithersburger",
      "helpful_votes": 0,
      "publication_date": 20200328
    },
    {
      "title": "A must buy for the household. Instant savings",
      "text": "First off this is my first \"smart home\" device that I've installed in my house. The level of ease of installation was incredible, I was able to install and test within 20 mins ( I surprised myself even). Then afterwards you instantly notice the difference as the AC is not turning on every 15/30 mins. It cycles the air much better, it senses the ambient temperature with way more accuracy than those old mercury thermostats that suddenly got triggered when you move by them. So this all translates to savings on your electric bill and the fact that you can now change the temperature from your phone...c'mon that's just cool.",
      "rating": 5.0,
      "verified": true,
      "author": "Some guy",
      "helpful_votes": 0,
      "publication_date": 20190522
    },
    {
      "title": "It was great until  ...",
      "text": "Worked fine for a number of month then started dropping off the network.... Today it's gone off the network when everything else is functioning fine all wifi devices in the home are functional. Finally got thru to tech support the agent was patient and helpful so I will upgrade this back to 5 stars he even stated that a ticket will be open and they will watch the thermostat for 24 or so hours in case the problem recurs and needs further assistance.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Biegler",
      "helpful_votes": 0,
      "publication_date": 20190803
    },
    {
      "title": "Worth the Money",
      "text": "Love this thermostat. Reasonably easy to install and set up, works very well. The Eco mode is especially useful and the app works well, allowing monitoring and reset from the road. Was nervous about spending the money but worth every penny so far. Only very minor downside is NEST room temp is one degree different from actual room temp. Can't find an adjustment so just compensated in temp settings.",
      "rating": 5.0,
      "verified": true,
      "author": "Trollingstone",
      "helpful_votes": 2,
      "publication_date": 20181121
    },
    {
      "title": "Well I love the thing, but it DEFINITELY DOES NOT work with Alexa as far as I can tell",
      "text": "It's been a great addition to our home and seriously works wonders, but I have yet to find/see a single thing that hints at it being Alexa-integrative. It can work with Google Home, but nothing is saying 'Alexa' anywhere on the instructions, on the app, on the box.... Even my Alexa is all \"nope, sorry, don't see any smart thermostats\". It is possible I'm doing it wrong, of course, but even if not it's been great regardless. I love having it, Alexa-integration or otherwise!",
      "rating": 5.0,
      "verified": true,
      "author": "Mitch",
      "helpful_votes": 0,
      "publication_date": 20190515
    },
    {
      "title": "Failure of a product",
      "text": "'Learning' is an in thing that many products claim but not many deliver. Since installing nest it's been just disappointing!! I have finally turned off the learning mode and will mostly replace the unit with ecobee. I don't know who came up with the idea of adding multi-minute delays after every setting change. It's taking hours to cool the house by 3-4 dev which a dump $50 unit could do in less than an hour. I think the shiny unit may look cool on the wall but they should divert some $ from design to software development.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190609
    },
    {
      "title": "This is my second time ordering the Nest. The ...",
      "text": "This is my second time ordering the Nest. The first time I did not have a common wire. Nest claims that it will work. It powered up but caused my system to short cycle. This time I had a common wire installed but the Nest would not boot up. When I removed the C wire, it did boot it. This was very strange. Some people online were experienceing the same issue. I even went as far as removing the C wire and bought a venstar 4 to 5 wire kit. Still no luck. After much research I finally gave up. Bought the ecobee and it worked.",
      "rating": 1.0,
      "verified": true,
      "author": "gtran",
      "helpful_votes": 3,
      "publication_date": 20171127
    },
    {
      "title": "Consistently shows +8 degree higher temperature. Pretty poor for a thermostat.",
      "text": "You’re much much better off buying a cheap $15 thermostat. This has lots of issues, the biggest being that it shows the wrong temperature. Alsways about 8 degrees higher. So it doesn’t come on when it’s supposed to and we’re freezing. To compensate I started setting the thermostat higher and now we’re boiling. There are literally 100s of cheaper alternatives that can do this very basic operation properly. Also, this Seems to be a very common problem with nests, and there is no fix yet.",
      "rating": 1.0,
      "verified": true,
      "author": "Bald Seagle",
      "helpful_votes": 0,
      "publication_date": 20190603
    },
    {
      "title": "Overpriced and best functionality removed.",
      "text": "This is a downgrade from my old thermostat in some respects. I upgraded from a Hunter thermostat that was in use for a decade, and it kept stats for the day, yesterday, this week, last week and all time. This new fancy thermostat can’t even tell you today’s usage until the next day. Then it only keeps 10 days. I don’t get it. It’s totally lacking. The monthly report is a waste. It shows total hours of usage, and the rest is self promotion. They removed IFTTT support, and support for every other “works with nest” service. Save your money and buy something that does more for less.",
      "rating": 2.0,
      "verified": true,
      "author": "Charles",
      "helpful_votes": 0,
      "publication_date": 20200203
    },
    {
      "title": "Unit unable to work as advertised.",
      "text": "My unit \"work\" however per support I must setup a separate \"home\" for this ONE unit, as it can not be in the same home as my other unit.. meaning I can not show TWO nest in the same home.. I tried over and over, and in the end support staff told me the only way to install this would be to make a separate home.. however I have installed these many times and had no problems having more than one in one home address. Unfortuantely waited for Nest support promising to get back to me with a solution and am now stuck with a $200 piece of crap that is not working. thanks for nothing nest.",
      "rating": 1.0,
      "verified": true,
      "author": "Bo Lorentzen",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "Not your best, just Google's best",
      "text": "Product is not made to serve the customer. It is a way to hook the customer into Google's platform. Google purposely denies integration into standalone home automation systems. The thing has to talk to mother ship and everything be controlled through it. At times you may see your settings tweaked without knowledge. Had to call and ask for an explanation. Was told that the tuneup will save me money. This is pretty much an act of digital trespassing. The only option left for privacy conscious customers is to not configure internet access. This would leave you without the ability to reach to it remotely, even if inside the house. YMMV.",
      "rating": 3.0,
      "verified": true,
      "author": "Doru C",
      "helpful_votes": 0,
      "publication_date": 20200122
    },
    {
      "title": "Customer support may be dead in most places, but not here!",
      "text": "My learning thermostat arrived yesterday. Installing it was easy, I did need some sheet rock anchors that were not included. But, the wiring was simple, or so I thought. My particular wiring was strange and even though I followed the directions the Nest thought I had a heat pump, which I do not. I contacted customer service through Facebook messenger. They went back and forth with me all day trying different things until we got it figured out. They drew different diagrams and had me try different configurations until it worked. Truly, some of the best customer service I have experienced in a long time!!",
      "rating": 5.0,
      "verified": true,
      "author": "Rex0725",
      "helpful_votes": 0,
      "publication_date": 20200712
    },
    {
      "title": "Really easy to install.",
      "text": "The thermostat is sturdy. A door slam knocked it clean off the wall and it bounced on a tile floor. After a couple minutes, it worked fine again. Periodically, the app takes forever to respond. With 5 temperature sensors, sometimes the thermostat shows offline. Apparently this is some kind of battery drain problem. We have it integrated into our security and the two \"argue\" about \"who is in charge\" despite several schedules programmed. It works well enough; the primary reason I bought it was to access the circulation fan function of my HVAC system, which it does perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180910
    },
    {
      "title": "Not so smart",
      "text": "For a time I lived in California and had a home on the east coast and had nests in both locations. I had the Cali nest first and all was well. Then I added the GA nests and realised they are all displaying California time/weather/location. I would think it would at least know which time zone it is in. I think they are just following my phone and wherever it is. I have to manually program location to get accurate time and weather. Not so sure about the temperature control. I seem to have to adjust it an awful lot. I don’t think it’s any better or worse than any other thermostat. I admit I bought it for looks.",
      "rating": 3.0,
      "verified": true,
      "author": "margaret o.",
      "helpful_votes": 0,
      "publication_date": 20200120
    },
    {
      "title": "Great when it works",
      "text": "For the most part I like the unit for what it can do. Our issue is after 7 months it won’t connect to the internet anymore. I have been messaging Google back and forth to try to figure out what it wrong but after 2 weeks of messaging them they have not come up with a fix. I feel it needs to be replaced. We have tried to reset it several times doing it different ways without luck.",
      "rating": 3.0,
      "verified": true,
      "author": "Larry Wixom",
      "helpful_votes": 0,
      "publication_date": 20200814
    },
    {
      "title": "Will no longer work with IFTTT",
      "text": "One of the most important features for a connected device is its ability to work with IFTTT. Because this functionality is being removed, this product and brand deserves a big rating reduction.",
      "rating": 1.0,
      "verified": true,
      "author": "G. R. D'Anna II",
      "helpful_votes": 3,
      "publication_date": 20190509
    },
    {
      "title": "The first one didn't work",
      "text": "The first one didn't work. I did an exchange, and it wasn't prime shipping. It took 10 days to get a replacement. During this time, the heat didn't work. Living in the Northeast, it is not good to have no heat in December. The problem was with the wifi connection, the battery & the connection itself. This thermostat I had one previous to this one, it works great. The replacement works great. Having no heat for a month. We ordered it on November 30th, and it was delivered and installed on December 1st, reordered, and delivered on December 30th. It took 10 days to receive a replacement.",
      "rating": 1.0,
      "verified": true,
      "author": "Oscar",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "Beautiful unit",
      "text": "Appearance and function were great. Easy to install, but really need C wire. Google Nest does not support (works with) using Alexa. I have Amazon Echo and wanted to use it to control Nest, but too many warnings on Internet and Google's own statement so I returned the unit. Really liked it and the way it worked, but want support for Alexa. Bought Ecobee.",
      "rating": 3.0,
      "verified": true,
      "author": "MKS",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "They promise but don't reimburse for installation problems.Not buying again.",
      "text": "Installed and it kept on restarting. Found out from google search that another wire (C) has to be added. Chatted with nest support and they promised to reimburse if I use a nest-certified installed. I did. Then uploaded the invoice to Nest support (chat link) as asked by the agent. TWICE. and still waiting for a response after 9 weeks. So it looks nice thats the only positive. Its wifi connected so it can be controlled remotely. Other than that, its overpriced, ill-supported. I regret buying it.",
      "rating": 2.0,
      "verified": true,
      "author": "a",
      "helpful_votes": 2,
      "publication_date": 20180303
    },
    {
      "title": "Poorly produced",
      "text": "I received my Nest Thermostat, when I went to screw in the base plate where you plug in the cables and screwed the screw right through the plate and broke it. Now I don't know if I am really strong or if the materials of the base plate were just super weak. But now my thermostat isn't working.",
      "rating": 1.0,
      "verified": true,
      "author": "MrPrice_isRight",
      "helpful_votes": 5,
      "publication_date": 20180118
    },
    {
      "title": "Terrible Product!",
      "text": "I have 20 of these used for my home and office. They were fine in the beginning when adjusting them from the app or computer, but now after a bit of time, the Nest system is not responsive. It either locks up or is unable to connect to the Nest network rendering it unable to change the temperature remotely. I am assuming that since so many people are now using the Nest, their system is overloaded and they are unable to service that many stats at any one time. I know this because it happens more frequently at peak times. I would try another brand without so much network traffic.",
      "rating": 1.0,
      "verified": true,
      "author": "UNCLEGIA",
      "helpful_votes": 0,
      "publication_date": 20200429
    },
    {
      "title": "Easy to Install",
      "text": "Love it. Another smart way to control your home and help reduce your energy expenses as it learns your routines/ preferences when you are home & recognizes when you are not home so it will automatically o into eco mode to save you $$. I’m not the handiest of people especially with any type of electrical work, but the online step by step guide to install he nest was super easy to follow even for a novice like me. Took maybe 20-30 min from start to finish. Easy to control from the app on my phone & iPad, I haven’t tried to connect to Alexa As of yet.",
      "rating": 5.0,
      "verified": true,
      "author": "BigBlueLeaf",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "Be patient and follow the instructions",
      "text": "For now, I can only provide an initial review. It will take some time to learn how to use the thermostat. Google provides plenty of on line videos and instructions. It just takes time to digest it. Once you have determined your current wiring is compatible and where the wires go it is easy to install. I’m still working to understand the thermostat scheduling process. Not sure if I can set a daily schedule via the Nest app. I can’t get Alexa to recognize Thermostat. Need to work that with Amazon. For now, the AC is operational. My wife says it looks good.",
      "rating": 3.0,
      "verified": true,
      "author": "WSW",
      "helpful_votes": 0,
      "publication_date": 20200911
    },
    {
      "title": "Stay away from Nest!",
      "text": "I am very disappointed with the Nest thermostat. Prior to purchasing, I contacted Nest technical support to confirm comparability with my Trane XL16i HVAC system. I was assured it was compatible and was provided a wiring diagram to use. After reviving the Nest Learning thermostat and following the wiring diagram, the Trane XL16i will not cool correctly. I have contacted Nest technical support and they are unable to resolve the issue. What a waste of time and money!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20180623
    },
    {
      "title": "DID NOT WORK WITH MY SYSTEM",
      "text": "apparently the nest thermostat is NOT compatible with all systems. when i opened my old thermostat i saw that onloy 2 wires were being used instead of 4. i contacted NEST and they were very helpful and very nice. they explained that my system is called a priority system and is not compatitble with the Nest. I was very sad because it would have been great to use for my weekend house. i could have left the heat low all week and cranked it up for my arrival on Friday. OH WELL :(",
      "rating": 4.0,
      "verified": true,
      "author": "ellen from long island, ny",
      "helpful_votes": 0,
      "publication_date": 20200310
    },
    {
      "title": "Electrical and Communication Issues with my AC - DOESNT WORK!",
      "text": "Bought this thermostat 5 months ago and it started creating electrical issues with my AC unit. I have paid numerous costs in HVAC technicians until I had to finally just take the nest off and replace it with my old school thermostat. I am not even able to return the product but I cant use it because it does not communicate well with my AC unit. Fancy but not worth the money for having issues and support technician fees. Wish they would allow me to return it!",
      "rating": 1.0,
      "verified": true,
      "author": "ewgigem",
      "helpful_votes": 3,
      "publication_date": 20171013
    },
    {
      "title": "⚠️WiFi ERROR⚠️",
      "text": "I purchased this thermostat about 6 months ago. It's great when everything works, 6 months in and I'm no longer able to connect to wifi. I followed their troubleshooting guide and no luck. Thermostat now restarts itself over and over till it asks me to plug it in and charge it, what!!!!? I researched online about the Wi-Fi issue and it's a common problem with the internal Wi-Fi card. I contacted customer support and I'm receiving a replacement in 7days. Grade A customer support, I got instant help through chat. I'll update once the replacement gets here, 2* for now for the inconvenience.",
      "rating": 2.0,
      "verified": true,
      "author": "Tony",
      "helpful_votes": 0,
      "publication_date": 20200519
    },
    {
      "title": "Avoid at all cost",
      "text": "Nothing but problems with this. First It burnt out my boiler, which was only 3 years old. Then the 'smart learning' feature overrides your not only your programming of it, but also your online commands when you are away from home. What does that mean. It means that when I went away to Japan for a week, the stupid Nest shut off my heat because it didn't sense me around. So when I got back my house was freezing cold. For the price.... you just get jobbed in every direction.",
      "rating": 1.0,
      "verified": true,
      "author": "C. Morris",
      "helpful_votes": 0,
      "publication_date": 20190115
    },
    {
      "title": "Love my Nest Thermostat",
      "text": "This is my second Nest 3rd Generation Thermostat. I recently upgraded my home system from a single zone to a dual zone and added this second thermostat to control the upstairs zone. It seamlessly integrated with the Honeywell HZ322 zone controller. One piece of advice for those installing: once you have everything installed and running well. Reboot power to your air handler and heat pump (or AC unit). Sometimes, the thermostat would say it's cooling but the system wouldn't respond, doing this reboot once after the initial install fixes the issue for good.",
      "rating": 5.0,
      "verified": true,
      "author": "AeroPnk",
      "helpful_votes": 0,
      "publication_date": 20190727
    },
    {
      "title": "Difficult to understand settings",
      "text": "Physical installation easy with instructions provided. Same with wiring, but not so much with programming. Yes the basic program setup is a piece of cake, it’s when you get to temperature settings and echo that there is no clear logic to your decisions. I set it manually only to discover latter it has reset the temperature to some other number that’s a problem. 60 degrees in the winter, who does that. There is no literature or you tube to explain in detail this anomaly.",
      "rating": 3.0,
      "verified": true,
      "author": "Guy Clark",
      "helpful_votes": 0,
      "publication_date": 20190202
    },
    {
      "title": "DO NOT BUY-DOESNT WORK",
      "text": "Installed this myself, took about 10 minutes. Since then, my AC is never on. When it does come on, hot air comes out. And the AC never kicks in until nighttime. I have tried setting up temp schedules. NEST just says to hell with your schedule, turns AC off. Everyday its, 75—-87deg...3 hours till temp. Then after a few minutes I hear the AC kick off, and I have to manually start it. For a smart home device, the NEST is dumb as sh!t. Don’t waste your money on this junk, most likely its just a way for us to monitored in our own homes.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190624
    },
    {
      "title": "Plus the other features of this thermostat are great. I never thought I'd pay $200+ for a ...",
      "text": "The only reason I purchased this was because my apartment's thermostat location is behind my TV. The heat from my TV was causing the thermostat to read up to 5 degrees higher than the rest of the room. I replaced the original thermostat with the Nest, and then purchased Nest's remote sensor and placed it on the other side of the room. In 1 month I cut my electric bill in half because my air conditioner wasn't running as much. Plus the other features of this thermostat are great. I never thought I'd pay $200+ for a dang thermostat but the savings will help pay for itself, plus AEP is giving $100 rebates for electric furnaces.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Collins",
      "helpful_votes": 0,
      "publication_date": 20180804
    },
    {
      "title": "Do not purchase; poor performance.",
      "text": "Let me begin by saying that I am tech savvy and have 3 nest thermostats. I cannot maintain any desired temperature in the house. The device overrides my choices and while I am away, it wastes crazy amounts of energy. The exact oppposite of its purported design. 3 trusted contractors have told me to remove them as they refuse to use them. I will not promote another device other than to say, the nest thermostat is a major disappointment and a complete waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "Reasonable Person",
      "helpful_votes": 2,
      "publication_date": 20181223
    },
    {
      "title": "Once installed, it's nice",
      "text": "Initially installing this device was a pain. I failed at it twice, and then it somehow started working on the third try. The first two times the device caused my HVAC to blow heat nonstop. But after the third time it mostly works as expected. I can control it from my Google Assistant and Google Home app. Not sure if it's a setting, but sometimes I'll set the AC to a certain temperature and then come back an hour later and it's set itself to an even lower temperature. Fun device if you want your home to be \"Smart\" but just know there's still room for improvement with this device.",
      "rating": 4.0,
      "verified": true,
      "author": "Reedster",
      "helpful_votes": 0,
      "publication_date": 20190817
    },
    {
      "title": "Works well",
      "text": "I installed this myself in about 30 minutes. It works well and I love that you can ask Alexa to adjust the heat. However, Alexa will not turn on or off the heater or air conditioner. It will only adjust the thermostat. I only have one thermostat in my house and it is downstairs, so I felt I needed this. I do wish it was less expensive.",
      "rating": 4.0,
      "verified": true,
      "author": "Clark G",
      "helpful_votes": 0,
      "publication_date": 20191223
    }
  ],
  "product_meta": {
    "title": "Google Nest Learning Thermostat - Programmable Smart Thermostat for Home - 3rd Generation Nest Thermostat - Works with Alexa - [Stainless Steel]",
    "description": "Color:Stainless Steel| Style:Thermostat OnlyThe Nest Learning Thermostat is a smart thermostat that learns your schedule and programs itself to help save energy. You can control it from anywhere with the Nest app, and it works with Alexa and Google Assistant so you can adjust the temperature with your voice. And it’s beautifully designed, with a big, bright display and metal finishes to suit any home’s style.[1] Remote control and mobile notifications require working internet and Wi-Fi. [2] Energy savings are not guaranteed and depend on energy usage, weather, and other factors.[3] Independent studies showed that Nest thermostats saved people an average of 10% to 12% on heating and 15% on cooling. Based on typical energy costs, we’ve estimated average savings of $131 to $145 a year. Individual savings are not guaranteed.",
    "rating": 4.4,
    "feature_bullets": [
      "Programmable smart thermostat that learns your schedule and the temperatures you like and programs itself to help you save energy and stay comfortable",
      "Home/Away Assist automatically adjusts itself to an Eco Temperature after you leave, so you don’t heat or cool an empty home",
      "Remote control lets family members change the temperature from anywhere on a phone, laptop, or tablet[1]",
      "With Energy History, just check your phone to see how much energy you used and why, or use Quick View on the thermostat’s display to reach Energy History, settings, or your schedule",
      "The Nest Leaf appears when you choose a temperature that saves energy",
      "Farsight shows you the temperature, weather, or time on your thermostat when you walk in the room",
      "The Nest Learning Thermostat works with the Nest Temperature Sensor (sold separately) to help make sure a certain room is the exact temperature you want it to be",
      "Beautifully designed, with polished metal finishes and bright, high resolution display",
      "It’s easy to install your thermostat, typically in 30 minutes or less, with everything you need included in the box; compatible with 95% of heating and cooling systems",
      "Please refer to the product description section below for all applicable legal disclaimers denoted by the bracketed numbers in the preceding bullet points (e.g., [1], [2], etc.)"
    ],
    "specifications": {
      "Manufacturer": "Google",
      "Part Number": "T3016US",
      "Item Weight": "1 pounds",
      "Product Dimensions": "3.3 x 3.3 x 1.21 inches",
      "Item model number": "T3007ES",
      "Batteries": "1 CR2 batteries required.",
      "Is Discontinued By Manufacturer": "No",
      "Size": "1",
      "Color": "Stainless Steel",
      "Style": "Thermostat Only",
      "Finish": "Stainless Steel",
      "Material": "Metal",
      "Pattern": "Minimalistic",
      "Shape": "Round",
      "Power Source": "Battery powered",
      "Voltage": "24 Volts",
      "Item Package Quantity": "1",
      "Number Of Pieces": "7",
      "Type of Bulb": "LED",
      "Number Of Holes": "2",
      "Display Style": "Digital",
      "Switch Style": "Touch-Sensitive",
      "Certification": "ENERGY STAR Certified and UL Listed",
      "Special Features": "Wireless: Working Wi-Fi connection: 802.11b/g/n @ 2.4GHz, 5GHz, Wireless interconnect: 802.15.4 @ 2.4GHz, Bluetooth Low Energy",
      "Included Components": "Display, Base, Optional trim kit, Mounting screws and labels, Nest screwdriver, Installation Guide, Welcome Guide, Nest Pro installation card",
      "Batteries Included?": "Yes",
      "Batteries Required?": "Yes",
      "Battery Cell Type": "Lithium Ion",
      "ASIN": "B0131RG6VK",
      "Customer Reviews": "4.4 out of 5 stars21,782 ratings4.4 out of 5 stars",
      "Best Sellers Rank": "#258 in Tools & Home Improvement",
      "Date First Available": "September 1, 2015"
    },
    "categories": [
      "HVAC",
      "Thermostats",
      "Building Supplies",
      "Tools & Home Improvement",
      "Programmable",
      "Thermostats & Accessories"
    ],
    "price": ""
  }
}