{
  "website_summaries": [
    {
      "verdict": "A watch box with looks and quality that match its higher price tag.",
      "pros": [
        "This sleek, classic design is spacious and well-built and makes a great gift",
        "Holds 12 watches"
      ],
      "cons": [
        "This box is more expensive than most"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Engraving Plate Magnetizes Automatic Watches",
      "text": "This is nice for a cheap Chinese-made watch box. At first, I was happy because the box presented my watches handsomely. After a month, I realized my automatic watches were not running accurately. Well, guess what? The metal engraving plate on the watch box front magnetized many of my automatic watches! It took several trips to the jewelers and over $150 to de-magnetize my watches to realize this. Bad design flaw.",
      "rating": 1.0,
      "verified": true,
      "author": "RSB",
      "helpful_votes": 80,
      "publication_date": 20180224
    },
    {
      "title": "Great Anniversary Gift",
      "text": "Very pleased with this watch box! Brought it for my husband for our 1st wedding anniversary. Very nice quality & construction. I had an engraved initial plaque made and it covers the \"Glencor\" name plaque. (see attached)",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 113,
      "publication_date": 20160712
    },
    {
      "title": "Glencor doesn't disappoint again",
      "text": "I've had a 6 pillow Glencor box for a couple of years now, and decided to add to my collection. I liked the Glencor with 24 slots and the drawer, but I don't wear any other jewelry than my wedding ring, and have my closet organized already, so the space consumed wasn't justified for the storage gained. This box, however, slides right into where the 6 pillow version was, and simply takes up 2x the depth. I love the carbon fibre look, the hinge is just as good as the 6 pillow version and it works just as well, I just have more space for my watches!!! Now, that means I'm likely to go spend more money on timepieces!",
      "rating": 5.0,
      "verified": true,
      "author": "Charles",
      "helpful_votes": 0,
      "publication_date": 20190915
    },
    {
      "title": "Amazing quality!",
      "text": "I bought this for my husband for Christmas and was overly impressed with the quality and attention to detail. This box is very sturdy and feels and looks very high quality. The packaging was an added bonus. It comes wrapped and in a gift box. The lid has a black carbon fiber pattern and the glass appears to be real glass. The magnetic clasp is strong, which adds to the overall quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Waldros",
      "helpful_votes": 6,
      "publication_date": 20170413
    },
    {
      "title": "Quality Watch Box",
      "text": "Very pleased with this watch box. Calling it a great value would almost seem to do it a disservice as it's of a much higher quality than what I would otherwise consider a \"value\" product. It was packaged well, constructed of nice materials, seems solid and sleek, but understated. My *only* suggestion would be for Glenor to consider another location for their logo which appears etched in the silver plate on the front. It's fairly quiet, but would like the design to stand on its own—maybe even remove it entirely. If not, perhaps very small in the lower right corner of the plate or on the back side where the hinge is located.",
      "rating": 5.0,
      "verified": true,
      "author": "MJ Simon",
      "helpful_votes": 4,
      "publication_date": 20170328
    },
    {
      "title": "A Watch Case That Holds 12 Writst Watches and Is Of Good Quality",
      "text": "This watch box handled exactly what I wanted: a watch case with pillows and dividers that had a clear display front so that I was able to see the watches. at the same time, the case seals out dust and keeps moisture under a degree of control to create a usable environment for one's watches while still having them all in one place. Of course, there is no winding for automatic watches, although a movement cradle, if developed for the box would in fact work. The quality looks sufficient for my purposes: convenient watch storage. The charge for the box was reasonable and it appears that it will hold up for quite a long time, properly cared for.",
      "rating": 5.0,
      "verified": true,
      "author": "Alex Ford",
      "helpful_votes": 0,
      "publication_date": 20191210
    },
    {
      "title": "Quality is good for the price",
      "text": "Received my watch box recently. Quality is good for the price. I couldn't find many faults with it. I do have a few suggestions on how to improve the product. I think it would be nice to include a hinged arm to support the lid. Another would be to remove the large Glenor lettering on the lid label. It seems a bit out of place. For the price though I am satisfied with my purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "Synnyster",
      "helpful_votes": 6,
      "publication_date": 20170323
    },
    {
      "title": "Very well made and perfect for the collector.",
      "text": "This is a very nice watch box. The exterior has a nice carbon fiber look and feel and the watch pillows included don’t feel cheap. I recently started collecting watches and this fits the need perfectly. The overall build is very nice. I have filled this one already and purchased the 24 slot one as well. The only issue is had was with the metal lid handle, as it was a bit sharp and did scratch me one day. Nothing that can’t be sanded smooth and it only happened one evening",
      "rating": 5.0,
      "verified": true,
      "author": "Larryw",
      "helpful_votes": 0,
      "publication_date": 20190904
    },
    {
      "title": "an excellent item for your watch collection",
      "text": "This is my second watch display box by Glennor, I found both to be excellent, well constructed devices that can take pride of place where you wish to show off your watch collection. The box itself is very stylish and something of a focal piece even without any watches inside it. It has plenty of space for the watches you want to put in and strap pillows are reassuringly well put together, as is the entirety of the box. This is not something that you're going to have to worry about falling to pieces in six months. Overall I fully recommend this as a five-star buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200627
    },
    {
      "title": "Beautiful watch case",
      "text": "Beautiful watch case. Very well made. Attention to detail. Fantastic value. Other reviews very accurate. Very pleased with this watch case. Plenty of room within each compartment to hold larger sized watches. Love that it is glass and not plastic on top. Came in a very nice gift box along with a blank notecard to address the recipient. Very classy. Gave to my husband as a gift to hold his watches. For the money, a great purchase. Would highly recommend to any watch collector out there!",
      "rating": 5.0,
      "verified": true,
      "author": "C. Stockmal",
      "helpful_votes": 3,
      "publication_date": 20170331
    },
    {
      "title": "A Quality Solution for displaying and protecting your watch collection",
      "text": "This carbon fiber watch box is a collectors dream for storage and use. The watches are well protected and easily accessible. If you have a collection, and want to preserve and protect them, and have easy acces to them, this is the ultimate answer.",
      "rating": 5.0,
      "verified": true,
      "author": "Fred C. Harnish",
      "helpful_votes": 3,
      "publication_date": 20170802
    },
    {
      "title": "Superb craftsmanship in a watch box",
      "text": "The craftsmanship in this watch box was superb! It was so well constructed and was very \"high end\" for the reasonable cost. I would highly recommend purchasing this watch box. There is plenty of room for those who have a watch collection and the quality of the materials used in construction will protect your watches along with providing a nice display of your accessories. I cannot say enough about the quality of this item. A great gift for the man in your life!",
      "rating": 5.0,
      "verified": true,
      "author": "PKwiat",
      "helpful_votes": 0,
      "publication_date": 20200122
    },
    {
      "title": "Solid watch box choice",
      "text": "It took me 3 tries, but I finally got it right. I was looking at the watch boxes with drawers and tried a couple at different price points, but none really functioned all that well. Eventually, I decided to keep it simple and focus on what I wanted and am very happy now. This is a very well made and attractive box, will look great on the dresser yet small enough to slip inside the smaller top dresser drawer. The watch pillows are soft yet sturdy and can be removed in lieu of other storage.",
      "rating": 5.0,
      "verified": true,
      "author": "The Doug",
      "helpful_votes": 0,
      "publication_date": 20190418
    },
    {
      "title": "Watch cushions don't fit the slots",
      "text": "I wanted to like this watch box, its a really nice look. but when you start using most of the slots, then you realize the issues. A lot of the watch cushions that came with my box sit very loose in their slot, so they will move around when you move the box. This is big minus in my book. The watch cushions need to fit snug otherwise they may scratch up the watches if you accidentally or intentionally move the watch box. Should have realized this earlier :(",
      "rating": 2.0,
      "verified": true,
      "author": "Imran Ahmed Khan",
      "helpful_votes": 2,
      "publication_date": 20180818
    },
    {
      "title": "Worth the price. Great for large watches",
      "text": "Excellent quality, outperforms the price. Most of my watches are 48mm or larger and most watch cases don’t really fit large watches and when they do, they tend to touch each other. This 12 watch case can hold a 48mm face with space to line them up next to each other without scratching. Highly recommend, built like a case more expensive than this. Good quality hinges. Good cushions for your watch. No complaints. If this product fails in the future I will edit my review",
      "rating": 5.0,
      "verified": true,
      "author": "jimmytown",
      "helpful_votes": 0,
      "publication_date": 20200725
    },
    {
      "title": "Looks nice and sturdy",
      "text": "I hope it lasts longer than the other one. I got the leather this time because the felt on the last one somehow got wet and started growing mold. It was EVERYWHERE throughout the old watch box. Hopefully that doesn’t happen with this one since it’s leather. Looks nice and is sturdy also.",
      "rating": 4.0,
      "verified": true,
      "author": "Gabby Hallman",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Reviews won't do justice.",
      "text": "Want to organize all your watches without having 100 different boxs from each individual watch but also be able to know which one you're grabbing? This is your solution. This box creates a beautiful display of your watches, whilst also allowing you to downsize and organize efficiently and effectively. High quality everything, from the glass, to the latch, build, and material, this box feels sturdy all around AND looks darn good. So nice, I bought another one as a gift shortly after I bought mine. You cannot go wrong.",
      "rating": 5.0,
      "verified": true,
      "author": "#JackieLife",
      "helpful_votes": 0,
      "publication_date": 20190319
    },
    {
      "title": "The perfect gift",
      "text": "The watch box arrived quickly and in great condition. I had bought it for my boyfriend as a gift and he loved it! It's very masculine and elegant for any watch collection. I also had a local trophy shop customize a plaque to go on top of the Glenor Co. one and that small touch of personalization made the gift even better! I am very satisfied with Glenor Co, I love how they check up on you once you've received it to make sure you are satisfied with it. :)",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 8,
      "publication_date": 20170422
    },
    {
      "title": "Solid watch box",
      "text": "It's a great display case, but it does have two shortcomings in my opinion though. The pillows aren't exactly a perfect fit and move around a bit if you move the box. It's not suitable for transportation, but then again, it probably wasn't meant to be. It also doesn't have any lock or closing mechanism. Not really an issue but just a nitpick that would have been a good feature (the hinges and weight of the door itself are enough for this to not really matter regardless). Not perfect, but a good enough display case for the price.",
      "rating": 4.0,
      "verified": true,
      "author": "Chris Sztof",
      "helpful_votes": 0,
      "publication_date": 20181204
    },
    {
      "title": "Time Under Glass",
      "text": "The watch box was delivered by the promised date and arrived without damage. Contained within the shipping carton was the item packaged in a formal cardboard gift box complete with presentation card. I found the 12 slot watch case to be exactly as described on the sellers page. The product is well constructed and its clean lined design enables it to look great in any décor. I am most pleased with this item, which is already nearly full. I will defiantly be purchasing a second similar case from this seller when the need arises.",
      "rating": 5.0,
      "verified": true,
      "author": "PJS5000",
      "helpful_votes": 3,
      "publication_date": 20171028
    },
    {
      "title": "Incredible product & great value",
      "text": "We buy a lot from Amazon and this has quickly become my all time favorite purchase. It's a huge value for $39. It looks fantastic, fits watches of all sizes (including my huge Wenger watch), the door opens perfectly, everything fits perfectly... I had an old wooden watch box that I kept in our walk in closet but now this new watch box is on display in the master bedroom. I love this product and for the money it's an excellant value.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard",
      "helpful_votes": 0,
      "publication_date": 20200529
    },
    {
      "title": "Damn this looks amazing",
      "text": "Wow. Let me just start by saying that. I opened the box, which was really nice and not cheap. A nice card inside thanking me for my purchase and foam wrapped in tissue paper protected the inner glass panel. Super classy. The case is just cool looking. Carbon fiber and leather (like) pillows inside. Damn it looks great without my watches in it and even better with them in it. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul Lo Verme",
      "helpful_votes": 0,
      "publication_date": 20200426
    },
    {
      "title": "Exceeded my expectations",
      "text": "The watch box arrived quickly. The packaging was first class and the craftsmanship of the watch box was excellent and felt sturdy. All my watches with various sizes was held nicely in the case. The glass top was ideal for my solar powered watches, because the watch box sits under a white led light that keeps my solar watches charged properly. I highly recommend this watch box from Glenor Co.",
      "rating": 5.0,
      "verified": true,
      "author": "G.C.",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "Like it so much I purchased the 6-slot version for my son",
      "text": "I recently became hooked on searching for and purchasing watches and needed somewhere to put them. I saw this watch box when researching for places to store watches and am so glad I found it. It came on time and is really a very nice watch box. I have filled it half-way so far and it looks outstanding on my dresser. I like it so much I purchased the 6-slot watch box for my son who also loves watches. I would definitely recommend this to anyone looking for a solid, high-quality watch box.",
      "rating": 5.0,
      "verified": true,
      "author": "The One and Only Plamonster",
      "helpful_votes": 0,
      "publication_date": 20180129
    },
    {
      "title": "This is a beautiful display box for your nice watch collection",
      "text": "This is a beautiful display box for your nice watch collection. I just got one for my son, and he was over the moon, having such a nice case to display the watches that he receives from his family and others for special occasions, and he is starting to get quite a collection by now.",
      "rating": 5.0,
      "verified": true,
      "author": "G. E. Williams",
      "helpful_votes": 0,
      "publication_date": 20180409
    },
    {
      "title": "Fantastic gift idea",
      "text": "If you have 3+ watches you should get a small watch box. If you have 5+ watches (or know someone who does) you should get this one. The pillows are a bit big but I have a very small wrist and most of my bands are custom so thats probably my fault. Its a solid build, beautiful design, and an excellent display. I'm very happy with the box and the company was a breeze to work with. I would definitely recommend getting it, you'll be happy every time you go to switch watches.",
      "rating": 5.0,
      "verified": true,
      "author": "TK",
      "helpful_votes": 0,
      "publication_date": 20170722
    },
    {
      "title": "Quality of Products, services, Customer Service, after the sale...",
      "text": "This watchbox is awesome, I am away from my home, but will include a picture, with my 12 Invicta, Swiss Watch, Collection... This watchbox is top shelf, looks awesome, protects my watches and has a very handsome display window...Padded watch holders, velvet wrapped inside provides extra protection...Great looking exterior with the graphite, sleek, modern look. HIGHLY recommend to any watch collector, especially for showing off a great collection..Great Job, arrived in exquisite, box, packaging...",
      "rating": 5.0,
      "verified": true,
      "author": "Patrick R.",
      "helpful_votes": 2,
      "publication_date": 20180111
    },
    {
      "title": "Great high quality watch box",
      "text": "When I received the package from delivery and opened it, I was immediately impressed in the effort and the details put into the watch box. Everything seemed high quality from the material, glass, hinges and the pillows. This stylish carbon fiber design box will provide protection for my watches, displays my watches and make it easier for me to swap and rotate my watches. Only con for me is that now I have to buy more watches to fill the rest of the pillow spaces. I highly recommend this watch box.",
      "rating": 5.0,
      "verified": true,
      "author": "BAH",
      "helpful_votes": 0,
      "publication_date": 20190222
    },
    {
      "title": "Well worth the price",
      "text": "In late Dec 2019 I began to feed my new obsession for watches. I already have seven with three more on order, as of this writing. I purchased a six slot case, which I liked, from the same online retailer that I purchased a couple of my watches. I soon needed more room so I picked up this 12 slot Glenor for the same price as my original purchase (oh well). I had a brass plate prepared for it. Looks great in my home office. I recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Nasser Tamimi",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "Great quality and price! Came the next day! Unbelievably satisfying purchase",
      "text": "It is such a quality product, and it looks amazing, for a great price! So glad I found it as I had been looking everywhere and was stressed about getting the right one, as it’s not something to easily return and I’m very picky! Although, be careful of the front metal piece, it’s very sharp. If the box is not resting on it’s own when opened (if there is a wall behind it or anything preventing it from fully opening), you could cut yourself or severely damage a watch!",
      "rating": 5.0,
      "verified": true,
      "author": "Dan D.",
      "helpful_votes": 0,
      "publication_date": 20190406
    },
    {
      "title": "perfectly acceptable",
      "text": "a lock on a see-through box isnt really needed: it might keep prying small hands away from your watches at home, or those small hands might be frustrated at getting in and decide to drop the whole box and collection...mine is just what i need. a padded, dust free place to store not so expensive watches. yes, any thief could pick up the box and walk away, but this is not a safe. its a safe-keeping place, watches fit well and dont hit against the top glass, quality is quite acceptable and i would order another, should i continue to buy old watches on ebay haha. worth the money it costs, and zero complaints.",
      "rating": 4.0,
      "verified": true,
      "author": "P. F. Schumacher",
      "helpful_votes": 0,
      "publication_date": 20190515
    },
    {
      "title": "Highly recommended!!",
      "text": "All of the reviews that I read said that this box would be well made and beautiful...and all of the reviews that I read were correct! I bought this to replace a smaller watch box from another vendor on Amazon that I also liked very much - however I like this one more. For the money, it would be hard to get a nicer box for your collection of watches. Highly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "David M.",
      "helpful_votes": 0,
      "publication_date": 20171016
    },
    {
      "title": "Looks cool gift for bf",
      "text": "The overall look is very cool bf loves cars so the carbon fiber is a win i bought another brand then got scared after reading reviews saying it was cheaply made so i also bought him this one we're not home yet and i happen to be out of the return policy so ill update once he choices his favorite told him to gift the other to a friend",
      "rating": 4.0,
      "verified": true,
      "author": "Jessica Lynn",
      "helpful_votes": 0,
      "publication_date": 20190124
    },
    {
      "title": "So glad we purchased this item!",
      "text": "This wa part of a college graduation gift for our son and we were more than pleased with the quality and appearance of the item. It arrived very well packaged and for the price it doesn't not look \"cheap\" and compliments the watches that he currently has. With only four spaces remaining (the case holds 12 watches) we may need to purchase another one soon!",
      "rating": 5.0,
      "verified": true,
      "author": "Buckeye fan",
      "helpful_votes": 0,
      "publication_date": 20190507
    },
    {
      "title": "Great quality product",
      "text": "I bought this watch box for my boyfriends birthday and he absolutely loved it. It looks very sophisticated and luxurious. Great product. The only downside is that I wasn’t able to get it engraved because of the way it is made (I went to Things Rememnered), but it’s possible that I could have gone somewhere else to get it engraved that could handle a larger item like this. Definitely has a good sturdy weight to it too.",
      "rating": 5.0,
      "verified": true,
      "author": "Natalie Lee",
      "helpful_votes": 0,
      "publication_date": 20180628
    },
    {
      "title": "Luxury Watch Box, Indeed.",
      "text": "A must-have to display your watch collection. I don't want to repeat what others have stated in their reviews. I'll simply state I found many of the positive reviews to be true. There is a reason you see a 93% 5-star review rating. I am very happy with this purchase. I will be recommending this product to my family and friends. At the $40 price-point, you really can't go wrong. Have a great day.",
      "rating": 5.0,
      "verified": true,
      "author": "MegaDave",
      "helpful_votes": 2,
      "publication_date": 20170123
    },
    {
      "title": "Solid, basic, good looking",
      "text": "For the price, this is a great case. The slots will accommodate multiple size watches and the cushions are properly sized as well. The case itself is basic but fits well. There isn't a latching mechanism on the lid but it closes snugly and stays open when raised. I am very pleased with this case and don't feel any need to get another.",
      "rating": 4.0,
      "verified": true,
      "author": "Peter Buehner",
      "helpful_votes": 0,
      "publication_date": 20190905
    },
    {
      "title": "Watch Box is Great!",
      "text": "High quality Watch Box. The only issue I have for this watch box is that I do not have enough watches to fill it up. Not a great problem to have but seeing I saved some money on a quality and beautifully made watch box maybe I can invest that cash flow into getting some more wrist candy. The glass top allows you to clearly see all the watches and show off your style and personal taste in luxury wrist wear. Highly recommended for a young guy looking to show off your watches without dropping a big price tag into building a custom box.",
      "rating": 5.0,
      "verified": true,
      "author": "spencer b.",
      "helpful_votes": 0,
      "publication_date": 20170802
    },
    {
      "title": "Perfect For Watch Aficionados!!",
      "text": "I have to admit, i was a bit skeptical about this purchase. After receiving this item, even I had to admit how pleasantly surprised I was with this this purchase! Definitely better than I had expected. Feels and looks better than most watch boxes of the pricier variety. I have timepieces with case sizes varying from 40mm - 47mm and they all fit with no problem. If you do have automatics, do not worry. This watch box does not have any magnets!! Over all, I was pleased with this purchase. Definitely a great buy!",
      "rating": 5.0,
      "verified": true,
      "author": "Brian Harvey Yalong",
      "helpful_votes": 0,
      "publication_date": 20191205
    },
    {
      "title": "Fantastic appearance, quality and craftsmanship",
      "text": "I began collecting watches just two years ago. I wanted a way to keep them organized. I love this display case! The carbon fiber look is nice and looks costly. The pillows are just the right size to wrap your watch around. I loved this case so much that I recently bought a second (which I am working to fill up). I love showing off my collection and this case helps them look great.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew",
      "helpful_votes": 0,
      "publication_date": 20190506
    },
    {
      "title": "If you're looking at this, just buy it!",
      "text": "Nice construction. Nice quality materials and craftsmanship. Great attention to detail. No frayed edges or bad stitching. Chrome hinges are nicely polished and screwed on flush. All the edges line up clean. Very nice product. If you have watches worth keeping in a case, your watches need this case.",
      "rating": 5.0,
      "verified": true,
      "author": "Joshl74",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "My Second One!",
      "text": "After tossing cheaper boxes, I have purchased two of these watch boxes and I couldn't be happier. The price is right, the quality of construction is excellent, and the classy packaging from Glenor shows the pride they take in this product. The box accommodates all but the few rediculously large pieces I have. I may even buy a third in the future!",
      "rating": 5.0,
      "verified": true,
      "author": "TexStan",
      "helpful_votes": 0,
      "publication_date": 20190408
    },
    {
      "title": "Quality and Design",
      "text": "The box was a present for my husband and he did not know it was for him. To begin with, my husband makes all kinds of boxes and treasure chest so he never buys any kind of boxes. When he received this box he was extremely happy with it. He feels that this is the BEST watch box that he has seen; the quality, workmanship and the presentation of the box is absolutely perfect and beautiful. He would recommend this box to anyone who would like to own a beautiful watch box, and he will continue to order from your company. This deserves more than five stars. GREAT WATCH BOX!",
      "rating": 5.0,
      "verified": true,
      "author": "Lynne",
      "helpful_votes": 0,
      "publication_date": 20190127
    },
    {
      "title": "This is a great watch case",
      "text": "It looks good and it's well made and easy to use. I've had it almost 2 years now, and I don't particularly fuss with it and it looks the same as the day I bought it. I have a bunch of Citizen Eco-Drive watches, so I just put this on my windowsill and they get solar charged without even taking them out of the case, due to the large glass window on the cover. Nice price, too.",
      "rating": 5.0,
      "verified": true,
      "author": "ZipBeep",
      "helpful_votes": 0,
      "publication_date": 20200610
    },
    {
      "title": "Fits all my G Shocks, including 'The king'",
      "text": "I was concerned about being able to fit in all my G Shocks and especially the largest of them all 'the king' (GX-56). This watch box works perfectly and there is a ton of room for even the largest of the G's. Nice tall lid that wont even begin to touch the watches when closed. The box itself is very well constructed and heavy. This would make an awesome gift too.",
      "rating": 5.0,
      "verified": true,
      "author": "DMD",
      "helpful_votes": 0,
      "publication_date": 20180814
    },
    {
      "title": "Stop shopping around and buy this box...",
      "text": "I bought this watch box as a holiday gift and I'm very happy with it. Everything looks fantastic and it is very nicely finished inside and out. Much nicer than I expected for the price. The box it came in is equally as impressive and truly is nice enough to present as a gift. I can't imagine being able to get a better product at this price point..",
      "rating": 5.0,
      "verified": true,
      "author": "johnny",
      "helpful_votes": 0,
      "publication_date": 20180116
    },
    {
      "title": "This thing is an absolute piece of garbage. I have it sitting on my dresser and ...",
      "text": "This thing is an absolute piece of garbage. I have it sitting on my dresser and all I do each day is open it gently to pull out a watch and close it. Within a month the screws all started coming out of the hinges and now if I open it too far the top completely falls off. Looks good online, horrible quality. Don't waste your money.",
      "rating": 1.0,
      "verified": true,
      "author": "Edward Russo",
      "helpful_votes": 8,
      "publication_date": 20161106
    },
    {
      "title": "BIG & BIGGER",
      "text": "As advertised. It handles big watches. If you have big watches in the 46mm plus range this will work for you. No issues. Packaging is great if you want to put one under the tree. As far as build materials under the \"looks like carbon fiber ersatz material,\" who knows?",
      "rating": 5.0,
      "verified": true,
      "author": "JP",
      "helpful_votes": 0,
      "publication_date": 20191122
    },
    {
      "title": "this box turned out to be a beautiful gift for my middle-aged son who has accumulated many ...",
      "text": "this box turned out to be a beautiful gift for my middle-aged son who has accumulated many watches over the years - and has thrown them into a drawer. The box is a very classy looking box that only adds to the appearance of his dresser. The packaging was even down way above expectations. I will buy this again for other men in my life.",
      "rating": 5.0,
      "verified": true,
      "author": "A.H.H.",
      "helpful_votes": 0,
      "publication_date": 20180224
    },
    {
      "title": "Exceptionally large box",
      "text": "Very large exquisite box. Holds 12 large watches very well. I was a little concerned that the pillows would be too big & my watches would be tight on them because i usually have to remove approximately 4-5 links from my watches, but even with the links removed it fit around the pillows nicely. Just wish it was a little smaller as to fit in the drawer of my night table, but not knocking a star off for that because its not the fault of the box, just a personal preference.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Martinez",
      "helpful_votes": 5,
      "publication_date": 20151201
    },
    {
      "title": "Totally impressed",
      "text": "I am totally impressed by the Glenor 12 slot watch case. This case is well made and exudes quality. The case has cushioned holders for each watch and can easily hold the larger Casio watches or in my case, Invicta and Citizen watches. It includes a faceplate on the front of the case which I believe you can engrave. The top of the case is plexiglass where you can view your watches without opening the case, although some reviews stated it was glass. It definitely isn’t glass. I definitely recommend anyone who is looking for a watch case to purchase this case. I looked at other cases but ended up choosing this case and have no regrets.",
      "rating": 5.0,
      "verified": true,
      "author": "CQ",
      "helpful_votes": 0,
      "publication_date": 20181216
    },
    {
      "title": "Great quality",
      "text": "Great quality. The watch display case is listed as being for men but after looking at several cases this was the one I wanted. I am a female so with small wrists some of my watches do not fit around the pillow to close but I was still able to make them look like they did. I absolutely love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190113
    },
    {
      "title": "Elegant piece for my watches",
      "text": "The packaging was definitely elegant, this is a simple yet stunning watch case I’ve seen. I’m so glad I found a new home for my babies. It definitely makes my watches look superb. Only one tiny thing that would make the product much better is that the silver clasp doesn’t do anything, it’s just there. I thought it would hold the box close, but it doesn’t it just lifts and closes. It would be better off without since it serves no purpose. But all in all I love this so much. I have posted pics so you can see for yourself : )",
      "rating": 5.0,
      "verified": true,
      "author": "vanelle22",
      "helpful_votes": 0,
      "publication_date": 20181031
    },
    {
      "title": "Quality",
      "text": "I love the unit. My wife hates it since she thinks if it has 12 slots \"I have to fill the box\" lol. I bought her a new watch yesterday. She likes it now that her watches will also be in there.... :D Good value buy for the quality level at the price it was. Thank you.",
      "rating": 5.0,
      "verified": true,
      "author": "Mstar",
      "helpful_votes": 0,
      "publication_date": 20190730
    },
    {
      "title": "Wonderful Gift for the Gentleman in Your Life",
      "text": "I ordered this for my son who is becoming a watch collector. It has a subtle masculinity with the wonderful textured covering. There's even a silver plaque on the front which assists in opening and closing, and is the perfect size for engraving initials or a short personal message. (Hint, hint- Glenor, why don't you offer this option!?) I would definitely purchase this again.",
      "rating": 5.0,
      "verified": true,
      "author": "CLC",
      "helpful_votes": 0,
      "publication_date": 20190102
    },
    {
      "title": "Great value",
      "text": "I've been using this box for about a month, as of this post. I absolutely LOVE it. It feels very sturdy and the glass top with the watch pillows allow you to display your timepieces extremely well. Th hinges appear to be strong and willing to last. I look forward to using this box for a long time.",
      "rating": 5.0,
      "verified": true,
      "author": "Blake",
      "helpful_votes": 0,
      "publication_date": 20190819
    },
    {
      "title": "Nice Quality and GREAT Value! Perfect Gift.",
      "text": "Got this for my husband as a birthday gift and he LOVES it. Extremely reasonable price for what it is. He loves the carbon fiber styling and this is a well-made piece that comes in very high quality gift -worthy packaging. Great for storing and displaying his watch collection. AAA+++++",
      "rating": 5.0,
      "verified": true,
      "author": "Becky G",
      "helpful_votes": 0,
      "publication_date": 20190822
    },
    {
      "title": "Hubby loves it",
      "text": "I bought this as a gift for my hubby. First, I did not realize it would be this big but he loves it. It can hold big watches like Invicta. Love the craftsmanship and the weight. I love how it stays open when it lifts up and has the magnet when it closes.",
      "rating": 5.0,
      "verified": true,
      "author": "Suzette",
      "helpful_votes": 0,
      "publication_date": 20200128
    },
    {
      "title": "Simply put, this thing screams quality",
      "text": "Very well made. I believe this product is worth the extra money compared to similar products. This company provides a superior product and offers tremendous customer support. Although I did not use any of the support, the company reached out to me immediately after my purchase to ensure that the product met all of my needs. Which it did. The few people that have seen this on my dresser have complemented how nice it looks. I told them the price and they were surprised by how much value was given for such a price. I can't recommend this enough.",
      "rating": 5.0,
      "verified": true,
      "author": "Drew",
      "helpful_votes": 0,
      "publication_date": 20160913
    },
    {
      "title": "Wonderful product!",
      "text": "My roommate loved this as a gift for his watches. He has some decent watches all sub $1,000 and he just left them laying around, so I got him this box and he was able to put them in there and take nicer care of them. He seemed quite happy with it and hasn't mentioned any issues yet.",
      "rating": 5.0,
      "verified": true,
      "author": "Lane",
      "helpful_votes": 0,
      "publication_date": 20190522
    },
    {
      "title": "Consolidate watches in sporty box.",
      "text": "Watches come with their own box, usually it's huge. Having a lot of huge boxes takes up a lot of space. This box is very smart looking. I like the carbon fiber look and the window to see them when they're not on my wrist, and has room for more watches :) Might not be the same level of luxury as the original boxes, but sufficiently soft so they won't be getting scratched or anything.",
      "rating": 5.0,
      "verified": true,
      "author": "Jerrett Boehning",
      "helpful_votes": 0,
      "publication_date": 20180712
    },
    {
      "title": "Nice case good quality number one 1111111",
      "text": "Very nice case! Update** After reading my review, I was sent a brand new watch box free of charge. I stand by the fact that this case is awesome, and even more now, after seeing how hard they strive to make their customers happy. You will not be disappointed with this case!",
      "rating": 5.0,
      "verified": true,
      "author": "Cuong de dang",
      "helpful_votes": 0,
      "publication_date": 20191213
    },
    {
      "title": "Awesome watch box for large watches",
      "text": "This watch box is awesome. It’s even fits my large oversized Invicta watches. Looks great displaying my watches too. Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Geo",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "Time to watch your box and choose",
      "text": "The product is exactly what is represented. I was impressed with the picture and equally the actual product. It's very good value for money and would recommend it to anyone who has multiple watches. It saves a lot of time in the watch selection process as you can plainly see your choices. The box can easily fit in standard drawer so avoids occupying other locations in your closet etc.",
      "rating": 5.0,
      "verified": true,
      "author": "Peter Adam",
      "helpful_votes": 0,
      "publication_date": 20180308
    },
    {
      "title": "Very sturdy",
      "text": "The watch box was perfect I like the manufacturing I like the softness on the outside and it’s seems very Sturdy it came in a reasonable time. Almost makes you want to get more watches but I think I have enough but if I do decide to get more I would definitely go with your product. The only thing that I would have a slight complain about is that the part that holds the watches or the spaces between there not the same size as some of them rolling some don’t because one space is a little bigger than the other",
      "rating": 5.0,
      "verified": true,
      "author": "Arvella Calloway",
      "helpful_votes": 0,
      "publication_date": 20181218
    },
    {
      "title": "Excellent Watch Box",
      "text": "This watch box was delivered quickly and it was very well packaged. The craftsmanship was above par. No gaps, the hinges were smooth, and the glass was in great condition. Others commented on the magnetic clasp. This didn’t have a magnetic clasp so it’s possible they updated the design. I would agree though that magnets anywhere on this would not be a good idea. Automatic watches are usually not shielded from magnetic waves and that would affect the watch movement. So far the only complaint is I’ll need to order another one soon as this one is now full.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert M",
      "helpful_votes": 0,
      "publication_date": 20190805
    },
    {
      "title": "Attractive and Solid, Quality Construction",
      "text": "We purchased two fo these watch boxes - one for each of our sons for Christmas - and they really do seem to be of solid quality and construction. They are heavy and the design is clean and aesthetically pleasing. Our sons are 22 and 17 so they are young men and they both really seem to appreciate their watch box setting them up and displaying their growing watch collections very soon after receiving them.",
      "rating": 5.0,
      "verified": true,
      "author": "RXC",
      "helpful_votes": 0,
      "publication_date": 20170109
    },
    {
      "title": "super sleek, feels expensive, clean and affordable!",
      "text": "Perfect for a Christmas gift, anniversary or bday for the men in your life! I got one for my BF and another for my dad and they both loved it! It’s super sleek, clean and affordable. It looks and feels expensive! It’s pretty heavy, like I said it doesn’t feel cheap at all!",
      "rating": 5.0,
      "verified": true,
      "author": "Anak",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "Excellent purchase",
      "text": "12 slots for watches, each one big enough to accommodate large case sizes. The glass top is especially useful for charging my light powered watches. If I could change one thing it would be adding a way to elegantly charge a smartwatch. As a traditional watch case though, this is perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190826
    },
    {
      "title": "MY WATCHES LOOK SO GOOD I HATE TO TAKE THEM OUT OF THE CASE!",
      "text": "Love the look of the case. The out casing material has a very streamline finish that sets off the glass and the closure clip. If there is ever a break-in at my house, I'm sure this will be the first thing stuffed into the pillow case. Love the product and everything about the purchase was great. I have 4 sons and I plan on gifting each of them with a Glenor Co watch box for their watches.",
      "rating": 5.0,
      "verified": true,
      "author": "Birdieland",
      "helpful_votes": 0,
      "publication_date": 20200615
    },
    {
      "title": "Great Christmas or Birthday gift Highly recommended",
      "text": "I purchased this for my son for Christmas and he absolutely loved it. He received another watch box from his mother, we're divorced, and he had her return the box because it was not nearly as attractive as this one. The best part of it is this one cost less than the one his mother purchased and was so much nicer. My son has five watches on display and of course is looking to fill the case so I know what to get him for his birthday. I was actually surprised my son requested this since he's 21 years old, I thought for sure he would have wanted something different.",
      "rating": 5.0,
      "verified": true,
      "author": "Glen Stewart",
      "helpful_votes": 0,
      "publication_date": 20160509
    },
    {
      "title": "Great quality item",
      "text": "Gifted this to my husband for Fathers Day and he absolutely loved it! Well packaged and it protected the glass top perfectly. It was worth the amount paid, good quality and very masculine. Will definitely protect and keep my husbands watches organized.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Catalan",
      "helpful_votes": 0,
      "publication_date": 20200624
    },
    {
      "title": "Not only is the packaging beautiful but the box is wonderfully crafted",
      "text": "I purchased this watch box for my husband for Christmas ! It came in the mail yesterday and I cannot wait to give it to him !! Not only is the packaging beautiful but the box is wonderfully crafted ! Great buy!",
      "rating": 5.0,
      "verified": true,
      "author": "chelsea",
      "helpful_votes": 6,
      "publication_date": 20151204
    },
    {
      "title": "Beautiful way to display your watches",
      "text": "This is my 2nd watch box I've purchased from Glenor; the first was also a 12 slot but it has the drawer underneath for storing cufflinks, etc. I am likely to purchase a 3rd watch box so I can begin displaying some of my vintage watches as well. The Glenor box is well made with clear glass on the top, smooth hinges, just the right size pillows and a tight, clean fit when the lid closes. If you're someone who is just beginning to collect watches or a seasoned collector like me, you won't be disappointed with this quality product.",
      "rating": 5.0,
      "verified": true,
      "author": "Aiden",
      "helpful_votes": 0,
      "publication_date": 20180410
    },
    {
      "title": "Very good craftsmanship",
      "text": "Love this watchcase. Was given as a gift and was impressed by quality and craftsmanship. Found another one brand new at garage sale and snatched it up as another gift. Would buy this for any watch finatic",
      "rating": 5.0,
      "verified": true,
      "author": "Kelsey",
      "helpful_votes": 0,
      "publication_date": 20191214
    },
    {
      "title": "Great value for the quality",
      "text": "My husband loved it, it’s a very well built solid case, all his watches fit nicely even the bulkier ones. Solid heavy does not feel cheap but actually feels and looks very high end. I highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel_S",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "I figured this was the perfect solution. This set holds up to 12 which ...",
      "text": "Purchased this as a gift for my husband. He has watch boxes all over the place which create clutter. I figured this was the perfect solution. This set holds up to 12 which allows me the ability to purchase more watches for him (lol). He loves the glass see through part and proudly displays his \"nicer\" watches (as he calls them). I really love this purchase and may end up purchasing a box for myself.",
      "rating": 5.0,
      "verified": true,
      "author": "JustAGuy",
      "helpful_votes": 0,
      "publication_date": 20161018
    },
    {
      "title": "This is a very nice watch box",
      "text": "This is a very nice watch box. I looked at so many, read all their reviews (I practically live by the phrase \"caveat emptor\") and then ordered it. I am not disappointed. Finally, all my watches, from small to large, expensive to not, in one place, nicely displayed and well protected. Easy to put 'em in and take out.",
      "rating": 5.0,
      "verified": true,
      "author": "Old School",
      "helpful_votes": 0,
      "publication_date": 20180531
    },
    {
      "title": "MY FIANCE LOVED IT!",
      "text": "Best Fathers Day gift ever! My fiance was so surprised and it's crafted so well! It holds a good amount of watches and will be used for the years to come. I highly recommend this! Not cheaply made, at all!",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy Bunker",
      "helpful_votes": 0,
      "publication_date": 20200724
    },
    {
      "title": "lovely craftsmanship",
      "text": "This gift was the highlight of Christmas for my husband. He has started collecting a few watches and had them just sitting in a drawer. He couldn't wait to display them in his new watch box. He proudly set the box on top of his dresser. The product is quite well made with twelve little watch couches (o.k. I had to laugh when my husband calls them by that term). The clear top allows him to see his watches clearly and keep everything protected. It is a win/win for both spouses because he likes displaying the watches and I like how it keeps them organized. This is a must-have product for anyone who has several watches.",
      "rating": 5.0,
      "verified": true,
      "author": "Beth Brewer",
      "helpful_votes": 0,
      "publication_date": 20180114
    },
    {
      "title": "Beautiful Watch Box!!!",
      "text": "This watch box is a Xmas gift for my son. He is an avid watch collector. I know he will love this because he has several other boxes and they can't even compare to this beautiful one. When I received this box I was very impressed. He going to be very pleased when he opens this present. It is well made and very sturdy and something he will have for years.",
      "rating": 5.0,
      "verified": true,
      "author": "jiwarren",
      "helpful_votes": 0,
      "publication_date": 20181121
    },
    {
      "title": "Makes a nice gift.",
      "text": "It made a nice birthday gift for hubby, along with fixing up one of his watches that had a broken band. It's an elegant looking box to display his collection. If your man likes watches, get this for him, he will like it.",
      "rating": 5.0,
      "verified": true,
      "author": "Angela",
      "helpful_votes": 0,
      "publication_date": 20200515
    },
    {
      "title": "Overall great product; watches flop around when moved though.",
      "text": "Nice box, was glad to see it didnt have a magnet on the lid, however now it doesnt lock. The only real problem is that the watches flop around inside, but I solved the problem by inserting black foam blocks into the empty space above the watches.",
      "rating": 4.0,
      "verified": true,
      "author": "see",
      "helpful_votes": 0,
      "publication_date": 20200129
    },
    {
      "title": "Perfect for the guy that pulls his look together with accessories!",
      "text": "This was so much better than expected and really pleased with item. The rounded forms for the watches are so much easier to work with than those pillow-type that come with the watches. It’s easy to see what there is and get a kick out of putting the outfit together. Totally recommend this if you have more than 6 watches, now looking to fill it up!",
      "rating": 5.0,
      "verified": true,
      "author": "Marlene N",
      "helpful_votes": 0,
      "publication_date": 20180503
    },
    {
      "title": "Room to grow!",
      "text": "Happy so far! I was a little worried that this would not fit my larger fave watches, but it does with no problem. Watches fit snugly in their compartment BUT remember that this is not intended as a traveling case, just for displaying/storage. You get what you pay for...so for a middle of the road watch case this is an excellent buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Handymancan",
      "helpful_votes": 0,
      "publication_date": 20181128
    },
    {
      "title": "Well Made Attractive Watch Box",
      "text": "I'm very pleased with the Glenor Co. Watch Box. The craftsmanship is excellent and it's the most attractive watch box I've ever owned. I wouldn't hesitate to give it as a gift though I'm keeping this one.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas F. Maguire",
      "helpful_votes": 0,
      "publication_date": 20200610
    },
    {
      "title": "Elegant",
      "text": "This is a very well made and elegant box. It's not the less expensive but the intermediate. The size of the cushions is good for my watches (my wrist is 19.5 cm), but for wrists less than 17.5 cm you will need to left the clasp opened.",
      "rating": 5.0,
      "verified": true,
      "author": "Gerval",
      "helpful_votes": 0,
      "publication_date": 20190121
    },
    {
      "title": "My husband loves this and it’s easy to personalize",
      "text": "This looks expensive, Valentine’s Day present for hubby. The glass top gives you lots of potential for customization. I made a graphic and used my cricut to cut out of glass etch vinyl to place on top",
      "rating": 5.0,
      "verified": true,
      "author": "Jonlyn",
      "helpful_votes": 0,
      "publication_date": 20190318
    },
    {
      "title": "Craftsmanship at its Finest",
      "text": "During the Holiday Season I was really looking into purchasing a Watch Box for my Watch collection and when I came across the Glenor Co watch box, its elegant and carbon fiber design really stood out from the rest. When it finally came, I was really impressed that the Box it which it came with had luxury feel to it, and when I opened it, it was a True Marble. Clean precision made watch box and the spacing between the boxes made it easy to fit both my big and small watches. Definitely worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Marcos Y.",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Great gift for a junior watch collector.",
      "text": "Works and looks great. Fits large and medium-sized watches. The box looks and feels great to the touch. Great looks that don't break the bank. Not sure if this is general, but the lid in mine does not stay up like in the pics, hence my 4-star rating.",
      "rating": 4.0,
      "verified": true,
      "author": "Gerardo Ruiz",
      "helpful_votes": 0,
      "publication_date": 20200217
    },
    {
      "title": "I looked at many watch boxes and this one was the nicest one I found",
      "text": "I looked at many watch boxes and this one was the nicest one I found. It has slots for 12 watches instead of 10. It has no magnets in the lid. it is heavy duty. It has a durable hinge for opening and closing the lid. Many folks complain that the pillows don't give, but I just leave my watches unlatched and put them around the pillows that way, and it works fine. It does not lock but I didn't see the need in that feature for myself. It was well packed when I received it.",
      "rating": 5.0,
      "verified": true,
      "author": "Larry G. Evans",
      "helpful_votes": 0,
      "publication_date": 20190402
    },
    {
      "title": "Awesome Quality Case at Good price",
      "text": "Bought this to have my watches where I can see them to chose which one to wear instead of buried in a jewelry box and very happy with it. It appears to be of very good quality construction. Very professional packaging. The cushions inside are very nice quality as well. I have some larger watches, a few 50mm or more and they fit nicely. It’s a great value for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Chibi",
      "helpful_votes": 0,
      "publication_date": 20180128
    },
    {
      "title": "Perfection",
      "text": "I purchased thewatch box as a gift for my stepfather who is an avid collector and blogger. He loved the box so much that he posted on his blog about the quality of the box, the pillows, the hinges and the price. How he has other boxes that he's paid much more for but this box is of the same caliber as those more expensive boxes. He's so pleased withhis gift and I'm so pleased that the product lived up to the picture and description.",
      "rating": 5.0,
      "verified": true,
      "author": "tcrunk",
      "helpful_votes": 0,
      "publication_date": 20170708
    },
    {
      "title": "Amazing quality ,Boyfriend loved it! Heavy duty.",
      "text": "I brought this for my boyfriend for Christmas and hoped that it would be good quality and not an embarrassment because I ordered it so last minute. When it arrived it was extremely heavy! And I was surprised when I opened it it was in beautiful condition wrapped no scratches the glass was clean. I was so excited about it that I had him open it on Christmas Eve and he absolutely loved it. He went straight to the room and put all of his watches in there ! The box keeps them safe and free of dust and is a great way to display what he has so he can pick one out each day with ease!.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie",
      "helpful_votes": 0,
      "publication_date": 20180108
    },
    {
      "title": "The recipient was overwhelmed with the quality and just loved it! Of course I bought a watch to ...",
      "text": "The delay in response was because this was a gift. The recipient was overwhelmed with the quality and just loved it! Of course I bought a watch to start him off but he is looking forward to filling it up! Should I ever need another gift for a gentleman I would definitely consider one of your products. Also, I have to mention how impeccable the gift was packaged! Absolutely awesome!",
      "rating": 5.0,
      "verified": true,
      "author": "mk",
      "helpful_votes": 0,
      "publication_date": 20180622
    },
    {
      "title": "First Watch Box and I'm Impressed!!",
      "text": "The box is well packaged so before you even lay eyes on the watch box you get the feeling that their is a quality product inside. Once the watch box is unboxed you quickly realize the packaging accurately reflected what was inside. The quality, durability, and feel is really good for this price point and you can tell it wasn't just thrown together. The engravement plate on the front is a great bonus. Overall I am satisfied with this purchase and would recommend it to any watch owner.",
      "rating": 5.0,
      "verified": true,
      "author": "Darius & Precious Weddington",
      "helpful_votes": 0,
      "publication_date": 20181106
    },
    {
      "title": "Super Fancy Looking",
      "text": "I purchased this as a Father’s Day gift for my husband because he collects watches and honestly it’s absolutely amazing... It looks super high end and he absolutely loved it we’re probably going to end up buying him another one! Such a great gift.",
      "rating": 5.0,
      "verified": true,
      "author": "@TheBossBets",
      "helpful_votes": 0,
      "publication_date": 20190628
    },
    {
      "title": "Great watch box!",
      "text": "I collect a lot of watches and needed a place to store/display them. This watch box looks great and does the job brilliantly. It doesn't actually \"lock\" down, so just be aware of that.",
      "rating": 5.0,
      "verified": true,
      "author": "Tanvir Talukder",
      "helpful_votes": 0,
      "publication_date": 20191028
    },
    {
      "title": "Overall very nice",
      "text": "Overall it's a great case. Seems well made. My biggest \"gripe\" is that the watch holders (the pillows) don't all fit in well, so are loose and some are tight, otherwise a nice product.",
      "rating": 4.0,
      "verified": true,
      "author": "John D. Wardell",
      "helpful_votes": 0,
      "publication_date": 20191123
    },
    {
      "title": "Great Box",
      "text": "Top quality and craftsmanship. Pillows for the watches are well made and the box itself looks and feels luxurious. The only tiny flaw is the the name plate on the front is just a tad off off of center.. Hardly any issue at all.",
      "rating": 5.0,
      "verified": true,
      "author": "Quika MoBusch Hubby",
      "helpful_votes": 0,
      "publication_date": 20170428
    }
  ],
  "product_meta": {
    "title": "Glenor Co Watch Box for Men - 12 Slot Luxury Carbon Fiber Design Display Case, Large Holder, Metal Buckle - Black",
    "rating": 4.9,
    "feature_bullets": [
      "12 LARGE COMPARTMENTS- Each watch cushion holds a small or large watch neatly in place . There is plenty of space between the lid and cushions to accommodate watches of all size.",
      "UNIQUE,CONVENIENT & ATTRACTIVE DESIGN - Glenor Co. Watch Box boasts a unique , beautiful and a more convenient design than the other watch boxes out there. Our talented team of designers have worked hard to produce the perfect balance of modern ,sophistication and class to create this unique box and its attractive metal plate. Unlike others our box can be easily opened and closed with one hand for the most convenient use.",
      "GIFT BOX & BLANK CARD INCLUDED- An elegant gift box and blank card is included with each watch box for the most presentable gift giving. This makes a great gift for a father, boyfriend , husband, son, boss, friend or any other watch lover in your life.",
      "Glenor Co watch boxes keep automatic and battery watches safe. Our boxes do not have any magnets in them so therefore will not cause magnetization to any of your watches",
      "DIMENSIONS- Exterior: 14 ¼ Inches long x 8½ Inches wide x 3½ Inches high. Interior compartments: 2 Inches (51mm) wide x 3/½ Inches long."
    ],
    "specifications": {
      "Manufacturer": "Glenor Co",
      "Part Number": "GLWB12BK",
      "Item Weight": "5.2 pounds",
      "Product Dimensions": "15 x 9.4 x 3.9 inches",
      "Item model number": "SYNCHKG070545",
      "Is Discontinued By Manufacturer": "No",
      "Color": "Black",
      "Material": "Glass, Carbon fiber",
      "Shape": "Rectangular",
      "Item Package Quantity": "1",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "ASIN": "B013GX030E",
      "Customer Reviews": "4.9 out of 5 stars3,059 ratings4.9 out of 5 stars",
      "Best Sellers Rank": "#34,419 in Clothing, Shoes & Jewelry",
      "Date First Available": "August 5, 2015"
    },
    "categories": [
      "Cabinets & Cases",
      "Shoe, Jewelry & Watch Accessories",
      "Clothing, Shoes & Jewelry",
      "Tools & Home Improvement",
      "Watch Accessories"
    ],
    "price": 39.99
  }
}