{
  "website_summaries": [
    {
      "verdict": "This powerful machine is professional-grade but nimble enough to handle household projects. Easily maneuvers in cramped spaces.",
      "pros": [
        "The Kohler engine is capable of producing an impressive 6,400 vibrations per minute",
        "The base plate is made of cast iron and the most sensitive parts of the machine are heavily reinforced for maximum protection and durability"
      ],
      "cons": [
        "Costlier than some",
        "No wheels to aid in movement"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great compactor for the money",
      "text": "The compactor works great. It is well designed and is easy to maneuver. The wheel kit is especially nice for moving it to and from the work site. I am a Honda small engine fan, but I’ve had good luck with Kohler engines as well. For a $400 lower price it was an easy decision to get the Kobler powered model, which is identical to the Honda unit other than the engine. I haven’t been disappointed. The Kohler runs strong and generally starts on the first pull.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200807
    },
    {
      "title": "Exceeded my expectations. Well built and excellent value.",
      "text": "Very high quality compactor for the price. I particularly like that the plate is beveled on all sides so it does not pick up dirt in the plate as easily. Starts right up and runs well. I'm very happy with this purchase. It will pay for itself many times over vs. renting a plate compactor.",
      "rating": 5.0,
      "verified": true,
      "author": "Captain Caramba",
      "helpful_votes": 0,
      "publication_date": 20180503
    },
    {
      "title": "Runs like a scalded dog",
      "text": "Good communication, fast delivery. I Have used plate compactors in dirt work for 3 decades. I am an old cranky contractor, not easily pleased. This is a great little plate, from a great company.",
      "rating": 5.0,
      "verified": true,
      "author": "Edie M. Scruggs",
      "helpful_votes": 0,
      "publication_date": 20200525
    },
    {
      "title": "Great compactor.",
      "text": "Great product. Fired up easy when following the guide. Completed a 900 square foot patio with it. Fires up easy every time. Will 100% buy again in the future. Only downfall would be the muffler rattled off fairly early on. Still overall a great product.",
      "rating": 5.0,
      "verified": true,
      "author": "DjmGhost",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "Works great for me.",
      "text": "Excellent customer service. Good 100% warranty experienced. Machine has given me good service for 10 months so far. Very good value and good people to work with.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171106
    },
    {
      "title": "Fantastic product!",
      "text": "Fantastic product!! Works exceptional on gravel and dirt. I used it to grade a steep hill. I bought in dirt and was able to grade over 1000 sq feet in a day. Works exactly as described. Thanks Tomahawk!",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan",
      "helpful_votes": 0,
      "publication_date": 20180221
    },
    {
      "title": "Purchaced and ran it through 6 tanks of gas on ...",
      "text": "Purchaced and ran it through 6 tanks of gas on a large jobsite. Performs as advertised. It did rattle off an air cleaner cover attachment clip.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170521
    },
    {
      "title": "Great machine and great after-sale service..Worth the money",
      "text": "We purchased this a year and a half ago and it was one of the best investments we made..it has a powerful motor so the Job gets done better and faster, the quality is definitely better than the ones we use to rent from the hardware stores and of course after using it for few times , it will start saving you the rental money.. Most importantly The Tomahawk after-sale representatives went far and beyond with helping us with all our questions , concerns and issues we encountered while using this machine... really worth every penny! Definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Carol22",
      "helpful_votes": 0,
      "publication_date": 20201201
    },
    {
      "title": "Good compactor for gravel, soil and sand",
      "text": "This is good compactor for gravel, soil and sand. I used it for site prep on a long driveway, backyard patio, and even some patch work. This compactor takes its time which is good because It gets the proper compaction depth and I don't have to go back and redo my work. The subaru engine works great no repairs yet and starts on every pull",
      "rating": 5.0,
      "verified": false,
      "author": "Patrick",
      "helpful_votes": 4,
      "publication_date": 20160331
    },
    {
      "title": "Good Value",
      "text": "Machine arrived on time, well packaged, no damage. Engine started on first pull and went to work right away. Great machine, good value, heavy machine though...",
      "rating": 5.0,
      "verified": false,
      "author": "Terence Winson",
      "helpful_votes": 0,
      "publication_date": 20200930
    },
    {
      "title": "Very good",
      "text": "Very good quality for the price. Never had an issue with this plate. Definitely recommend.",
      "rating": 5.0,
      "verified": false,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170524
    }
  ],
  "product_meta": {
    "title": "TOMAHAWK Vibratory Plate Compactor Tamper for Dirt, Asphalt, Gravel, Soil Compaction with Kohler Engine",
    "rating": 3.8,
    "feature_bullets": [
      "6HP Kohler CH260 Engine with 3 Year Warranty",
      "Compaction force of 3000 lbs/ft²",
      "Compaction of cohesive and granular soils and clays up to 22 in.",
      "Beveled 17\" x 21\" plate for compaction that does not dig in",
      "Achieve 98-100% Compaction on Field Density Tests"
    ],
    "specifications": {
      "Manufacturer": "Tomahawk Power",
      "Part Number": "TPC80-P",
      "Item Weight": "176 pounds",
      "Product Dimensions": "21 x 37 x 17 inches",
      "Item model number": "THZR80",
      "Is Discontinued By Manufacturer": "No",
      "Horsepower": "6",
      "Item Package Quantity": "1",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "ASIN": "B013PONKVS",
      "Customer Reviews": "3.8 out of 5 stars16 ratings3.8 out of 5 stars",
      "Date First Available": "August 4, 2016"
    },
    "categories": [
      "Tools & Home Improvement"
    ],
    "price": 999.0
  }
}