{
  "website_summaries": [
    {
      "verdict": "Offers excellent support for sleepers in the 250- to 350-pound range and lasts quite a few years for a mattress at this price.",
      "pros": [
        "With extra iCoil pocket springs, this extra-firm mattress provides very good support for larger sleepers",
        "Two comfort foam layers, including a pressure-relieving layer",
        "Maintains its firmness and support for years"
      ],
      "cons": [
        "May be uncomfortable for stomach sleepers due to its firmness"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "I am very disappointed, because I now have to go looking for ...",
      "text": "I ordered this mattress around a year and a half ago, and it has really gone down hill. The mattress has become extremely hard and uncomfortable. I am a side sleeper, and I now need 3 pillows to sleep at night. I am very disappointed, because I now have to go looking for another mattress after buying this one very recently. Don't make the same mistake as me and go with the fairly priced option. Spend the money once for the a nicer option.",
      "rating": 1.0,
      "verified": true,
      "author": "Jason Huber",
      "helpful_votes": 36,
      "publication_date": 20180103
    },
    {
      "title": "Noisy mattress",
      "text": "This mattress is as firm as I wanted. But it came with a noisy sound on bottom edge and support from zinus just don't exist. I'm trying to call and message them and no answers at all.",
      "rating": 1.0,
      "verified": true,
      "author": "LUCIANO",
      "helpful_votes": 18,
      "publication_date": 20200609
    },
    {
      "title": "Garbage!!!!",
      "text": "In less than a week this mattress started having problems. Uneven firmness and a spring poking . Perhaps the only thing worse than the mattress quality is the customer service. The saddest part for me is that the few days the mattress was good it was great. But a mattress should last more than a week, even a cheap one. I do not recommend, I will not ever buy from this company . ..And neither should you. Unless of course you want a poor quality mattress, with a side of crappy customer service. Still no exchange or refund. Zinus has a different excuse every time .",
      "rating": 1.0,
      "verified": true,
      "author": "F pickels",
      "helpful_votes": 142,
      "publication_date": 20170814
    },
    {
      "title": "Sinks in the middle in less than 2 months",
      "text": "My friend used this same mattress in twin size for 2 years and it was in a good shape. That is the reason i decided to buy this mattress, since i was looking for a firm top that wouldn't sink in a lot when you sit on it. I bought a queen 10 inch. Initially i was happy with it, but it has not even been 2 complete months and the mattress sinks in the middle. It is not comfortable to sleep on as you can always feel it slanting. I wish there was a return policy longer then 1 month on this mattress. I'd really like to return/exchange it.",
      "rating": 1.0,
      "verified": true,
      "author": "Jasmine",
      "helpful_votes": 26,
      "publication_date": 20180819
    },
    {
      "title": "Terrible",
      "text": "Reviews weren't terrible but this mattress is. This is my main mattress, for better or for worse, until I can afford another one. It's absolutely terrible. Five months old, I have to flip it every week to week and a half to even get a half of a night's worth of good sleep. You sink in so bad. Do not buy.",
      "rating": 1.0,
      "verified": true,
      "author": "Anthony",
      "helpful_votes": 21,
      "publication_date": 20180516
    },
    {
      "title": "Instead of 12”, decompressed 9.7”",
      "text": "It is 47 hours now since I opened the Mattress as soon as I had received. Instead of 12” it is still seating at 9.7” and is same since last 44 hours. This is a huge difference.",
      "rating": 1.0,
      "verified": true,
      "author": "Percy Dhamodiwala",
      "helpful_votes": 21,
      "publication_date": 20181003
    },
    {
      "title": "Returned... but great customer service.",
      "text": "When it arrived my husband and I were so excited to have a bigger bed. We have a cal king and nothing fits it, finding comforters and sheets was always hard so we were excited to have a more well known bed size. First night sleeping on it I ended up getting up and moving to the couch we tried it for three nights and woke up stiff every morning. It is wayyy to extra extra firm. The nice thing though is the return was so easy. I was refunded my money and told to donate the mattress because they don't take it back. I was able to donate and help a needy family and still receive my money back!",
      "rating": 1.0,
      "verified": true,
      "author": "Melynee",
      "helpful_votes": 32,
      "publication_date": 20170801
    },
    {
      "title": "DO NOT BUY",
      "text": "I bought 2 of these mattresses and in under a year they are dented and very little support. The center sags so bad that when lay on the mattress you are in a V position! The center of the mattress literally touches the box spring when you sit on the bed. I bought this bed because all of the positive review. Beware most of these reviews are written shortly after purchase....my mattress was great in the beginning also, but within months it lost all support. I suggest purchasing a different mattress.",
      "rating": 1.0,
      "verified": true,
      "author": "Alysha  Littlejohn",
      "helpful_votes": 7,
      "publication_date": 20190409
    },
    {
      "title": "Most of the Indians love Firm mattresses like we have cotton mattresses back home ...",
      "text": "Most of the Indians love Firm mattresses like we have cotton mattresses back home that are firm. It helps relieve back pain and prevents back pain. We have this mattress in all 3 bedrooms and our parents feel comfortable sleeping on it when they visit us from India. It's firm yet comfortable. Does not sag even after 3 years of use. Still as good as new. Purchased one more recently.",
      "rating": 5.0,
      "verified": true,
      "author": "SaRa",
      "helpful_votes": 10,
      "publication_date": 20180717
    },
    {
      "title": "Sleeping on the floor",
      "text": "Seriously it's really firm and good support If you get comfort from laying down on the floor with a blanket under you then this maybe the bed for you!! But it's not extra firm to the fact it will support more then 250 pound person the mattress it's something for a few years nothing heavy duty like a 10 yr warranty item but I tested a $3000 mattress that I love and compared to this one the firmness is the same just warranties are different",
      "rating": 5.0,
      "verified": true,
      "author": "sal s.",
      "helpful_votes": 10,
      "publication_date": 20171229
    },
    {
      "title": "... have a bunch of spinal issues so getting a good nights rest has been well all but impossible for ...",
      "text": "ok I have a bunch of spinal issues so getting a good nights rest has been well all but impossible for me . the 1st week I found this bed hard to fall asleep on as it was just very firm however I woke in the morning well rested . after just over a months worth of nights on this mattress its soften a little and I fall asleep and wake feeling better rested then I have in the last 15 years . anyhow this product impressed me , for price and for how well I'm sleeping WOW!!! thank you Zinus My quality of life has improved .",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan  C.",
      "helpful_votes": 10,
      "publication_date": 20170731
    },
    {
      "title": "Not built to last",
      "text": "There is no perfect mattress, they all wear out. But I guess the low price I paid for this is related to how quickly it began to sag in the middle. I'm pretty sure I noticed a bit of a sag after less than a month, and after 6 months or so, it's almost as bad as the mattress I was replacing. It was very comfortable to begin with, and I would absolutely recommend it for a guest bed. But I'm going to find something else for my next one.",
      "rating": 3.0,
      "verified": true,
      "author": "Scott",
      "helpful_votes": 4,
      "publication_date": 20190907
    },
    {
      "title": "Disappointed",
      "text": "Unfortunately I wanted to love this and for the first 6 months I did. This is not a mattress for big and tall. In two years the mattress totally lost its structure and what used to be extra firm is now little to no support at all. I even rotate/flip often to give me some relief but it’s just not made for a bigger person. Especially in warmer temps of the summer it just didn’t work for me and it’s sad it lost its integrity so fast. Hope the company stands by their products.",
      "rating": 1.0,
      "verified": true,
      "author": "Kevrockd",
      "helpful_votes": 8,
      "publication_date": 20180915
    },
    {
      "title": "Seriously, DON'T buy if you're a side sleeper.",
      "text": "If you're heavier/sleep on your back, maybe this will work for you, but this mattress was waaaay too firm for me to sleep on as a side sleeper. Didn't realize a mattress this firm was actually marketable. I'd never gotten back pain from a mattress until I slept on this. My back was ruined for a week. That being said, I'm giving it 2 stars because it's a really high quality mattress for the price, and I received a full refund. Also, I'm pretty light, so I couldn't make a dent in this bed. It's obviously intended for heavier people, so the purchase was mostly my fault. I absolutely COULD NOT sleep on it though.",
      "rating": 2.0,
      "verified": true,
      "author": "JJ Stepan",
      "helpful_votes": 3,
      "publication_date": 20200222
    },
    {
      "title": "FIRM AS WOOD",
      "text": "Terrible! Stay away! This mattress is so firm it feels like you’re sleeping on the floor. No joke. I like firm but i can’t imagine this being comfortable for anyone!",
      "rating": 1.0,
      "verified": true,
      "author": "Lolo",
      "helpful_votes": 13,
      "publication_date": 20180106
    },
    {
      "title": "Firm bed for back sleepers",
      "text": "Exactly what I wanted. Its a bed in a box that doesn't break the bank and is firm and stays firm. It has helped my neck discomfort due to it being more firm and the mattress not allowing me to sink into it. This bed is for back sleepers. If you sleep on your side like I occassionally do then you're definetly going to need an extra pillow or two to make side sleeping more comfortable. After sleeping on a very soft pillow top for 8 months this bed felt amazing due to general body discomforts developed from sleeping on a soft bed. I can sleep 12 hours and wake up feel great.",
      "rating": 5.0,
      "verified": true,
      "author": "Su",
      "helpful_votes": 3,
      "publication_date": 20200622
    },
    {
      "title": "Was hopeful...",
      "text": "I just received this mattress yesterday and was able to use it first night. I needed to replace a mattress that was causing pressure point pain all over. My one night’s sleep on it was a 100% improvement. I’ll update this review if anything changes. **Update: After 6 weeks I've decided to give this mattress away to a colleague whose young son needs a new bed. It is a quality product for sure, but on top of the \"firm\" mattress is much too much plush topping which has sent me back to the chiropractor. In the end I have been able to find a merchant who was able to make me a mattress specific to my needs.",
      "rating": 3.0,
      "verified": true,
      "author": "M. D.",
      "helpful_votes": 4,
      "publication_date": 20180901
    },
    {
      "title": "Loved it at first but now....",
      "text": "I really liked our mattress when we first got it. It was really firm and hard to get used to at first but once we did we loved it. After about 6 months there was a lump developing in the corner. We decided to wait to see if it would smooth out but now they're are two lumps on the corners and the edges of the mattress is not supporting. The sides just sink in a bit more when you sit on them. I was sad when all of this started happening because we really liked it. Hopefully nobody else is dealing with the same thing. It's not fun.",
      "rating": 2.0,
      "verified": true,
      "author": "Celia",
      "helpful_votes": 7,
      "publication_date": 20181214
    },
    {
      "title": "comfortably hard and great value",
      "text": "Just received mattress it came well packed . I immediately opened the box removed the packaging inside and the mattress almost immediately expanded to its full size . I will not use it for a day or so to give it time to settle in to the expanded size. I would have given it only four and a half stars due to the very slight odor however I have had mattress toppers that smelled horribly. I believe within a day or so the very slight odor will be gone..The mattress is hard but not rock hard It has a very gentle sink to contour to the body when you lay on it. Would definitely recommend ,",
      "rating": 5.0,
      "verified": true,
      "author": "ZACK199",
      "helpful_votes": 4,
      "publication_date": 20180717
    },
    {
      "title": "broke in 7 months",
      "text": "The coil spring under my back broke leaving me sleeping with my whole back unsupported. I'm not expecting this mattress to last forever but 7 months is still disappointing.",
      "rating": 1.0,
      "verified": true,
      "author": "Renchang Tan",
      "helpful_votes": 8,
      "publication_date": 20180905
    },
    {
      "title": "Lost firmness in less than 2 months",
      "text": "Not recommended. When first arrived everything started smooth. I wait 48 hours and mattress got a nice size (I got the 12 inch). No funny odors, looked good and was comfy. I like the firmness. We got a king size. My weight is 180pounds and my wife 125 pounds. Sadly firmness dropped in just 2 weeks. I thought may be normal to lose some while it adjust. But I was wrong. Firmness is lost every day and by now I’m ready to buy a new mattress even though this one only 3 months old Think twice before you Ainvest your money on this mattress.",
      "rating": 1.0,
      "verified": true,
      "author": "JCR Giraldo",
      "helpful_votes": 0,
      "publication_date": 20200814
    },
    {
      "title": "Not firm at all",
      "text": "Waited the full recommended time of 48 hrs for the bed to fully decompress and it's very dissaponting. All four corners of the bed are smudged downward and there's nothing I can do to get them to fully expand. The bed doesn't seem to be a full 10in. I have another 10 in bed that I bought from Ashley furniture and after just a few hrs that one expanded far larger than this one and without the smushef corners. Overall it's fine I guess for my daughter who is only about 60 pounds but if she were older this bed would be horrible for her.",
      "rating": 2.0,
      "verified": true,
      "author": "Nicole K",
      "helpful_votes": 2,
      "publication_date": 20191017
    },
    {
      "title": "Mattress not as good as described",
      "text": "I ordered a king size mattress about 1 week ago. First, the mattress never fully decompressed. Second, the smell...it still has a weird smell. But the worst thing is that I feel I keep turning into the middle of the bed as it seems to be depressed on some sections. Overall, the mattress has been a total disappointment and will probably be looking elsewhere. I would suggest you do the same. A better quality, even if more expensive, product is what you need for good night sleep.",
      "rating": 1.0,
      "verified": true,
      "author": "Manuel C",
      "helpful_votes": 3,
      "publication_date": 20190815
    },
    {
      "title": "In love with my bed",
      "text": "I was really worried about ordering because I could not test it out and some other reviews. But I am so glad I ordered!!! The price point is amazing!!!! It coming in a box made it so easy to get a long size mattress up my stairs. It is ssssoooo comfortable!!! Typically when my partner gets in bed it moves the whole bed, but not with this mattress. I don't even feel him leave to work at 3 a.m anymore. Also many people said it has a smell...so I smelled my hardest to try and find the smell everyone described...nope no smell!!!! I love this bed and have recommended it to everyone I know.",
      "rating": 5.0,
      "verified": true,
      "author": "Nikkie Jackson",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "HATE THIS BED!",
      "text": "Thisis the worst mattress I've ever owned . Its hard as a rock ! After night #3 of no sleep i finally broke downand spent an additional $105 on a memory foam topper 😠 not happy about that . who knows if a 3inch topper will even help this mattress . You can feel the inner springs . pressure point pain is extremely painful with this mattress . I get red marks from laying to long on one side . Save your money buy a better bed !",
      "rating": 1.0,
      "verified": true,
      "author": "Shawna Dean",
      "helpful_votes": 2,
      "publication_date": 20191128
    },
    {
      "title": "Move on to other mattresses.",
      "text": "First time I've bought a bed sight unseen. Slightly disappointed. Its comfortable at first; not really that firm though. Within 2 weeks there was a noticeable dip where my husband and I lay. Thankful it was only $300, because having to replace it in likely 2 years won't be too much of a loss.It seems to retain heat and can be rather warm. Received on time. It was a trip getting it rolled up and cutting the bag open and watching it refill with air. I bought the 12 inch but the bed it not 12 inches high, closer to 10 inches. Honestly, would not recommend.",
      "rating": 3.0,
      "verified": true,
      "author": "K. B.",
      "helpful_votes": 5,
      "publication_date": 20170918
    },
    {
      "title": "Perfect mattress",
      "text": "This is a firm mattress which I have been looking for. It doesnt sag. Much much better than linenspa hybrid firm mattress. Linenspa is a plush mattress although they write it to be firm. Go for this one. It is firm and soft from the top.",
      "rating": 5.0,
      "verified": true,
      "author": "Sidhant Goel",
      "helpful_votes": 3,
      "publication_date": 20200308
    },
    {
      "title": "Very soft. Do nof believe description.",
      "text": "Very soft compared to the same matress I purchased a year prior. Sides are breaking down quickly and saging has begun in less thsn a week. I use the big/tall support frame and will try a bunkie board on top to help prevent further saging. I am very disappointed at how poor the quality has changed on this mattress.",
      "rating": 1.0,
      "verified": true,
      "author": "Patrick P",
      "helpful_votes": 8,
      "publication_date": 20180601
    },
    {
      "title": "Fix your back pain!",
      "text": "We have a winner! Last year, I was unable to walk due to back pain from a 12 year old firm bed. It was drooping and I had to sleep in the middle where it was less droopy. It took me 45 minutes to get out of bed once. Even after therapy and drugs, I had issues. Then, I started using this bed and I haven't thought about back pain since. Pain gone just like that! Yeah, I usually do better when I replace a bed, but not as well as with this product. Buy this one so they stay in business!",
      "rating": 5.0,
      "verified": true,
      "author": "A. Detrick",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "Great Mattress!",
      "text": "I just got this mattress and I’m so happy with this purchase, I’ve had high end mattresses and this mattress is just as GREAT! at half the PRICE! I’m 6’4” 280 with chronic lower back pain, so I switch mattresses every couple of years, I’ve only had this mattress for a short time and I have no complaints, back is feeling better. I hope this helps out anybody looking to buy this mattress.",
      "rating": 5.0,
      "verified": true,
      "author": "Harold Hall",
      "helpful_votes": 2,
      "publication_date": 20200601
    },
    {
      "title": "This bed sucks....Me in and makes it hard to get up!!?",
      "text": "I wanted to give it some time before I reviewed it. So far, I am loving this mattress. To call it extra firm miiiiiight be a bit of a misnomer. But it's firm enough to give me proper back support, and I'm sleeping well. I gave it 2 days to fluff. I might wish I had given it a little more, but it feels good now and everything seems to be sitting square. I'm really happy for this bed and price point. I'll never spend thousands on a mattress again. They really don't hold up that well. I'll buy inexpensive and be happy with changing them out if needs be.",
      "rating": 5.0,
      "verified": true,
      "author": "Kimberly Sterkel",
      "helpful_votes": 0,
      "publication_date": 20200307
    },
    {
      "title": "After three weeks, all I can say is it's ...",
      "text": "After three weeks, all I can say is it's not as firm as expected. Maybe it's because we're originally from Europe, and thus used to firm mattresses which just don't budge when you get on them. Anyway, it's ok but not firm enough for us. I dream about matress where I lie down and it doesn't sink even a 1/4 of an inch. When I'll have the money, I'll go to a store to try mattresses before buying the one.",
      "rating": 3.0,
      "verified": true,
      "author": "Milka",
      "helpful_votes": 6,
      "publication_date": 20170908
    },
    {
      "title": "Worth the purchase",
      "text": "I am very careful with my hard-earned money. I read reviews and always make sure it is a verified purchaser; so even at this price, I was online checking it all out. When you live on SSI and your back is always out due to an old mattress, its time to pay up for health - and this was a wonderful purchase. It came out of the packaging fast and furious, even the warning didn't really warn me; but the mattress is made of quality material, I bought extra firm and it was perfect, not a blemish on it. So yes, I would definitely consider this for your next mattress.",
      "rating": 5.0,
      "verified": true,
      "author": "K.L. Thompson",
      "helpful_votes": 0,
      "publication_date": 20191009
    },
    {
      "title": "Decompression problems",
      "text": "The mattress seemed fine the first day or two perhaps because I was so excited to receive it that I did not notice any issues. However this only made my back issues worse. In the picture if you notice you can see a waving “lumpy”pattern in the mattress. On the sides you can see the springs poking out and you can feel a few when laying down. The 4 stars are because I will be getting a replacement I don’t know if it’s because of amazon prime EXCELLENT customer service but either way my money wasn’t lost and that’s all that matters to me so far.",
      "rating": 4.0,
      "verified": true,
      "author": "solejands",
      "helpful_votes": 4,
      "publication_date": 20180821
    },
    {
      "title": "Inexpensive yet Decent Quality",
      "text": "I needed this to bring to a room with a narrow stairway. This was perfect. Boxed and easy to set up. Please use two people so that you don’t hurt yourself! It’s too much for one person to carry. I covered it with a thick 3 inch extra firm latex topper and it’s perfect. I needed a basic mattress that would be a good foundational support and this worked perfectly. It makes a great stand alone mattress as well which is surprising. The edges could use more support, but overall, for the low price under $270, I was quite surprised at the ease of set up and good quality.",
      "rating": 5.0,
      "verified": true,
      "author": "npview",
      "helpful_votes": 0,
      "publication_date": 20191003
    },
    {
      "title": "Twin",
      "text": "What a nice addition to our home. Our twin bed has a nice and firm feel to it. We just use wood across the length and have 3 metal side to side bars. A little heavy for one to drag up our stairs, I just walked it up the stairs. Interesting to see it open. Had no smells. Mattress protector and fitted sheet fits great. The top pattern is not all the same pattern, looks like it may be graduated. Would buy again",
      "rating": 5.0,
      "verified": true,
      "author": "68EagleTop Contributor: Photography",
      "helpful_votes": 5,
      "publication_date": 20171208
    },
    {
      "title": "I am amazed that I can literally order a mattress and have ...",
      "text": "I am amazed that I can literally order a mattress and have it delivered to my home with prime! This mattress is firm 🙌🏽 Which I love. It was ordered for our spare bedroom. It came in perfect condition, wrapped protectively. The mattress itself has a soft fabric. I honestly love resting on this mattress a few minutes in the day when I have a chance between cleaning or chasing my kids. It will be wonderful to have when someone is sick or a baby needs a nap. Oh yah, or in case of guests.",
      "rating": 5.0,
      "verified": true,
      "author": "Brown* I *Girl ",
      "helpful_votes": 5,
      "publication_date": 20170727
    },
    {
      "title": "Long term review",
      "text": "Have owned this bed for 7 months and thought at the time, it's a cheap mattress until I get what I really want. No way am I changing. Is extra firm like people have said but it's so supportive and I just love this thing. Have not had spring issues like others have complained about. Also, no smell, mattress doesn't make me too warm as you really sleep on this mattress and not in it like a Casper or similar product. This is my first memory foam-coil mattress and I'll never change. One less thing to worry about in life. If you're thinking this is too cheap and too good to be true, get in line. But it's that good.",
      "rating": 5.0,
      "verified": true,
      "author": "Casey",
      "helpful_votes": 0,
      "publication_date": 20190523
    },
    {
      "title": "I have developed back pan I never had before",
      "text": "I waited 1 year to review this mattress. It started off ok but it is killing my lower back. I have never had back pain and I am not overweight so there is definitely something wrong with this bed. My hips and lower back are in pain for several hours after I wake up. I want to cry because it was a gift to myself and I dont know if I can return it. It is NOT FIRM, the sides are weak.....",
      "rating": 1.0,
      "verified": true,
      "author": "LaurasGreenEyes",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "Worst Amazon Purchase I've Ever Made",
      "text": "I am not happy with this mattress. I feel like I'm sleeping on a thick board. It is beyond firm. I am now in more pain than before. I want so bad to return it but, my brother discarded the package when it arrived to surprise me with putting it on my frame and discarding my old mattress. I wouldn't even have known how to wrap it back up anyway. I am throwing it away until I can save for another mattress. I'll just sleep on the couch. Anything other than the direct floor, which this mattress feels like, is better.",
      "rating": 1.0,
      "verified": true,
      "author": "T. Ward",
      "helpful_votes": 2,
      "publication_date": 20190421
    },
    {
      "title": "High quality, very firm mattress. Doing great after a year of daily use.",
      "text": "Best mattress ever. Our usage is every night by large adults. It’s very firm. There is some type of pillow top thing, but we added the pinzon mattress pad for a little more surface cushioning. The edge support is amazing. It feels bigger because you can use sit or sleep on the entire mattress. You can put a cup of water on the bed next to you and it probably won’t spill if you sit up. The price went up 30% since I bought it. I still think it’s a great deal. What I imagine $1500 mattresses are like.",
      "rating": 5.0,
      "verified": true,
      "author": "NYC Family",
      "helpful_votes": 2,
      "publication_date": 20181227
    },
    {
      "title": "Not a good product and not good experience  with seller",
      "text": "Mattress unfortunately not good , very flimsy and loose . Seller not good either as not able to find anyone to pick up the mattress for return . Gave info to contact a company that does not pick up mattresses. Did let seller know . Been another two weeks and no response from seller . Unfortunately a bad experience . Please do not purchase and be aware of this seller for other products . I have waited to give the seller time to figure it out, but enough is enough . Been over a month . Sad to write a poor review .",
      "rating": 1.0,
      "verified": true,
      "author": "Ann-kristin",
      "helpful_votes": 0,
      "publication_date": 20201018
    },
    {
      "title": "Great bed, great price",
      "text": "I bought this for our guest room before I had family in town. They slept on the bed for a week, and we have slept on it here and then since then (we have had it about two months now). Everyone says the bed was really comfortable. It was a screaming deal for the guest room. One note: Getting the bed out of the box and onto the frame is best with a helper. Once we got it rolled out and started taking the plastic off, the decompression started and it went pretty fast! It's amazing that a bed this firm and comfortable came out of a box like that.",
      "rating": 5.0,
      "verified": true,
      "author": "Angie Kritenbrink",
      "helpful_votes": 0,
      "publication_date": 20190527
    },
    {
      "title": "Go ahead but....",
      "text": "This was my very first mail order mattress. I've ordered from Zinus their mattress toppers and have been very pleased with the company's quality. This mattress is exactly as described and comes EXTRA firm. If you have back issues you may or may not like extra firm. For me, I had to add a Zinus topper to add just a little bit more softness/comfort for me. But, the quality of this mattress is better or exactly the same as a mattress three times the price from a store. I think I'll order mail-order mattresses from now on.",
      "rating": 4.0,
      "verified": true,
      "author": "Angela H.",
      "helpful_votes": 2,
      "publication_date": 20190529
    },
    {
      "title": "Great Choice, Great Value",
      "text": "The mattress is extremely comfortable. My husband and I were having back pain with our old mattress. That has now gone away. I was concerned about the \"extra firm\" description but it is not at all hard. It strikes a nice balance so as not to be too soft or too firm. The one thing we noticed (which is why 4 stars instead of 5) is that we sometimes feel as though the mattress holds our body heat in and consequently, we feel a little warm. Not really a big deal. Just a small consideration. Overall this is a great mattress for the price. Beats out some of the ridiculously high priced ones we had been looking at.",
      "rating": 4.0,
      "verified": true,
      "author": "MCorr",
      "helpful_votes": 3,
      "publication_date": 20170731
    },
    {
      "title": "good for my back",
      "text": "My old mattress was too soft that I started having back problem earlier this year. After sleeping on my floor for a couple of weeks, I finally decided to replace it with a firm mattress. After some research and recommendation from friends, I decided to give this one a try. This is my first purchase of mattress from the Internet, and I was completely fascinated by how the mattress expanded from a roll up to such a beautiful, tall mattress that is so firm and flat. It is firm yet not hard like my floor. It's still comfortable but doesn't make my back suffer. I'm very grateful for this purchase and wish I had switched earlier.",
      "rating": 5.0,
      "verified": true,
      "author": "gfdfg",
      "helpful_votes": 0,
      "publication_date": 20181121
    },
    {
      "title": "Exceeded my expectations",
      "text": "I purchased this bed over 1 year ago. I was nervous that it would be cheap and not last but I was getting divorced, moving out and needed something to sleep on. This bed is excellent! I have it on a platform frame and it is comfortable and supportive. I like the firmness. This is more comfortable than the expensive mattress I was using prior to moving. I will be ordering this for my daughter as well. If you like a firm mattress, I recommend this!",
      "rating": 5.0,
      "verified": true,
      "author": "Ranee",
      "helpful_votes": 0,
      "publication_date": 20200717
    },
    {
      "title": "Very firm and feels nice. Highly recommend at any price.",
      "text": "Coming from a high end mattress, I was shocked that something that explodes out of a box could be good quality. It's straight, firm, after a month shows no wear at all (I'm 250 pounds), and feels nice. The only downside, if you can consider it a downside at all is there's little support when you sit on the edge to dress. But I don't see how you can roll a mattress into a box with a rigid edge. UPDATE. We bought another 10\" for a different room. I can't tell the difference between that and our 12\". Both exceed expectations in quality, comfort, and so far no sag or degeneration at all.",
      "rating": 5.0,
      "verified": true,
      "author": "Jules P",
      "helpful_votes": 0,
      "publication_date": 20181227
    },
    {
      "title": "Great mattress for the price and firm!",
      "text": "This is a great mattress for the price. We first bought a memory foam mattress but it was way too soft for both my back and my husband's back. We needed something more firm and this has worked well for us, especially with the price as we couldn't afford a mattress that was $1,000+ at the time. I was a little bummed that the first mattress we bought didn't work out because it was USA made and this one is made in China, but nevertheless, it has been good! We've been sleeping on it for maybe 5-6 months now.",
      "rating": 4.0,
      "verified": true,
      "author": "Cindy",
      "helpful_votes": 0,
      "publication_date": 20190728
    },
    {
      "title": "Great Mattress",
      "text": "Be advised that this is a extra firm mattress. I previously had a mattress that was firm on one side and plush on the other. I slept on the firm side. You will notice the difference and it will take a week or so to get accustomed to the extra firmness. One thing for sure my body pain getting out of bed in the morning is now almost non-existent.",
      "rating": 5.0,
      "verified": true,
      "author": "Raul Ponce",
      "helpful_votes": 0,
      "publication_date": 20200919
    },
    {
      "title": "Great mattress",
      "text": "We purchased this about 9 months ago because my husband's back was in so much pain from our previous mattress. It is a firm mattress and helped his back right away! It holds up well and for the price you can't beat it. We researched a lot before buying this mattress and we were not disappointed with our buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Tiffany",
      "helpful_votes": 2,
      "publication_date": 20200314
    },
    {
      "title": "Second time was not a charm",
      "text": "I ordered this bed in queen size a few years back and fell in love. When I moved, I decided to upgrade to a king and put the queen in my spare bedroom. Unfortunately, the company does such a pi** poor job packing the mattresses that it had complications in transit. I remember when my queen mattress was delivered it was nearly coming out of its box, as the weight of the mattress was too much for the cheap cardboard it was in. I assume the same happened with my king... only worse. Will not be wasting my time ordering one of these again. I waited two weeks for a bed that never came. Good bed, if you get it.",
      "rating": 1.0,
      "verified": true,
      "author": "Carly Moore",
      "helpful_votes": 0,
      "publication_date": 20190926
    },
    {
      "title": "Great value for the money!  Love my new mattress.",
      "text": "I was a little hesitant about ordering a mattress from Amazon, but i looked at all the positive reviews and I'm glad I did. Arrived quickly. Easy to handle since it is vacuum packed and rolled up. Rolled it out on the bed and then opened the package. It was fun watching it expand. I didn't notice any odor as others have mentioned. Mattress is very firm. I was looking for that. I topped this with a feather filled topper for some softness. It's perfect. I would not hesitate to recommend this to anyone looking for a firm mattress. 5'11\" 190#",
      "rating": 5.0,
      "verified": true,
      "author": "K. Allred",
      "helpful_votes": 0,
      "publication_date": 20190114
    },
    {
      "title": "Mattress is Heaven on Earth!",
      "text": "We've both been suffering from bad backs and within 1-2 days of sleep on the new mattress backs were INFINITELY better. We also added a memory foam topper (kinda pricey at Costco but SO worth it). It's like a firm cloud (I know, oxymoron). I will say it's imperative to break it in properly. Must sleep not just on bed edges but in the middle as well. Otherwise if you roll over they'll be a big lump (learned this from a mattress salesman years ago). Great price! Fast delivery! Not too heavy as we turn it once a month (not flip it, but turn it so it wears out evenly). You won't regret buying this bed! Enjoy and sweet dreams.",
      "rating": 5.0,
      "verified": true,
      "author": "imirishgal",
      "helpful_votes": 2,
      "publication_date": 20171113
    },
    {
      "title": "Extra Firm",
      "text": "This mattress is Extra FIRM. If you have back problems in your mid 20's get this mattress cause it helps with the back pain. I have lower back pain and this mattress has made a big difference when I sleep. It is not hard as a rock it does have some bounce to it which is nice. My dog really enjoys it also.",
      "rating": 5.0,
      "verified": true,
      "author": "Minisha Prasla",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "Will not last 1 year for 130lb person",
      "text": "I am a single person weight about 130 pounds . When I originally bought this mattress , it was firm yet comfortable and soft. About about 5 months I noticed it did not feel as soft and it started feeling quite hard . One year after purchasing this mattress I highly regret it. My mattress feels hard and uncomfortable. It hurts my back . Clearly this mattress is not built for longevity . I would rather buy a more expensive mattress that will last because at this point I already need to replace it .",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon User",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "This is an actually VERY FIRM BED!!!!",
      "text": "This is an actual firm bed. I've tried the the Plank (its not planklike). I've tried the purple mattress. I've tried the face to face stores. I tend to sleep directly on the floor, but, you know, then I'm on the floor. And yeah, I could sleep on the floor fine, but it's hard to find someone I like who would willingly join me. This is the solution. Or at least mine. I can't believe this bed was SO CHEAP compared to the others and it's the only one that delivered.",
      "rating": 5.0,
      "verified": true,
      "author": "A",
      "helpful_votes": 0,
      "publication_date": 20200923
    },
    {
      "title": "So far so good",
      "text": "Purchased to replace spring mattress with 2 inches plush top. The plush top lost shape and became uncomfortable, hence no plush top this time. I picked it up at a UPS location a few days after delivery so I was afraid it would not expand properly (supposed to open within 48 hrs of delivery). I ordered in August, delivered in Sept but it was manufactured in Indonesia in May according to label so I guess it can be in the box for months. Edge support not great but considering it is one of the cheaper brands it is good enough. Warranty is only 5 years so hopefully it will last the whole 5.",
      "rating": 4.0,
      "verified": true,
      "author": "thefirstwml",
      "helpful_votes": 0,
      "publication_date": 20201005
    },
    {
      "title": "EXTRA FIRM! My back and I both love it!",
      "text": "I NEED an extra firm mattress. And this is it. It is affordable, firm, and amazing. I've had the 12 Inch Queen for over a year now and love it as much as when it first arrived. We're upgrading to a king bed, and I just purchased the 12 inch King size. If you need an extra firm mattress, this is the ticket! I will note there was a weird aroma the first week or so, but it goes away. I'm assuming something from the packaging or compression.",
      "rating": 5.0,
      "verified": true,
      "author": "Mandy C",
      "helpful_votes": 0,
      "publication_date": 20190809
    },
    {
      "title": "No Longer Sleep on the Floor",
      "text": "I had costochondritis for years, and I developed a habit of sleeping on the ground with matress pad or just one or two layers of blanket, which could help reducing my pain on the chest. I debated a lot before trying out this one, and luckily it worked! As I was working with a good chiropractor, my symptoms my symptoms were flaring up frequently. After I started sleeping on this mattress, there were much fewer times of flare of pain. Now I am 99.9% healed from costochondritis, after 3 months sleeping on this mattress.",
      "rating": 5.0,
      "verified": true,
      "author": "JSean",
      "helpful_votes": 0,
      "publication_date": 20200907
    },
    {
      "title": "Love this mattress, much better than spending $1000!",
      "text": "Zinus advertises this as an extra firm mattress and it really is, which is exactly what I wanted. I was afraid to get one of those \"pillow top\" types, that they would be way too soft and very bad for my back. Unless you have a very low bedframe I doubt this would work with a box spring. The mattress inflates to a full 10\". I'm very satisfied with its comfort and quality. I slept on it the first night I received it with no complaints. And I'm really pleased with having saved so much money, now I can buy that new bedding I've been wanting!",
      "rating": 5.0,
      "verified": true,
      "author": "Jean K",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "The bed is great but the price keeps changing",
      "text": "I think it is a great bed, very firm and we had bought one in a queen before and liked that it did not shake when one person getts up in the night. What I am not happy about is that we bought the queen about 10 months ago for about $221 than I paid $198 two weeks ago for a twin, and went to ordr another tonight but it is up $25! This does not feel right and I will hopd off buying from this company unless the price can be equal. Its like gasoline!",
      "rating": 4.0,
      "verified": true,
      "author": "farin greer",
      "helpful_votes": 0,
      "publication_date": 20190620
    },
    {
      "title": "6 month indentations- I don't move when I sleep",
      "text": "I'm 230lbs and 5' 11\". I don't move when I sleep. After 6 months, the mattress is sagging and I am having back issues when I wake. For the money, the mattress has been good but is now having indentations. I just want a firm mattress that doesn't sag after 6 months.",
      "rating": 2.0,
      "verified": true,
      "author": "The Cotters",
      "helpful_votes": 8,
      "publication_date": 20170228
    },
    {
      "title": "Initially great but didn’t last",
      "text": "We bought this item less than 2 years ago. My partner is under 200 lbs and I am over. While initially it was pretty magical- totally eliminated any back issues I was having, over the past couple months it has been unbearably too soft. We have tried many different positions and I always wake up in a significant dip in the mattress, with excruciating back pain. To be fair, my partner has not had any issues, so lighter customers might have better luck. After reading so many positive reviews, I was looking forward to this mattress being a solution but it was sadly very short lived.",
      "rating": 2.0,
      "verified": true,
      "author": "Emily",
      "helpful_votes": 0,
      "publication_date": 20200217
    },
    {
      "title": "Trash",
      "text": "This is piece of trash in the name of extra firm mattress. I am average weight guy and as soon as I sleep in it my hips sink in it. I spoke to Zinus customer care after 30days when it sagged more than a inch and caused me pain, they said they can not do anything because firmness is subjective but still they claim it ‘extra firm’",
      "rating": 1.0,
      "verified": true,
      "author": "Virendra Singh",
      "helpful_votes": 2,
      "publication_date": 20200830
    },
    {
      "title": "Good for the cost",
      "text": "Ive had this bed for over a yr so i figured it was time to write a review. My sleep quality has greatly improved since purchasing this mattress, also it has relived my back pain. I went from a 20yr old mattress to this so i needed time to make sure it was actually good. No sagging or weird indents. I sleep on it alone mostly and im happy to say it has help up nicely. Even my parents love it when they spend the night on it.",
      "rating": 5.0,
      "verified": true,
      "author": "deborah fisher",
      "helpful_votes": 0,
      "publication_date": 20201016
    },
    {
      "title": "A must buy",
      "text": "So far so good , just unboxed about 20 min ago . For the price I can’t complain really . No harsh smells like others have said . Fits the bed frame kinda weird and there’s some lumps but I’m assuming it’ll go down when it decompresses further . I’ll come back with an update 👌🏼 ***Update*** one year later...... I love this bed ! ive had it for just about one year now, super firm, and still is a year later, for getting this at such an amazing deal, having it delivered, and lasting up so well a year later, I recommend to all my friends and fam",
      "rating": 5.0,
      "verified": true,
      "author": "Logan",
      "helpful_votes": 2,
      "publication_date": 20171204
    },
    {
      "title": "Lost its firmness in just 3 months.",
      "text": "I bought Zinus Queen bed slats and this icoil 10 inch mattress. Initially it was okay but never to be called an \"extra firm\". Within 3 months, it almost lost the firmness and deformed in different sections especially at the middle sections-so much so that eveyr morning I am having back pains. I already contacted Zinus as Amazon will not support after 3 months.",
      "rating": 3.0,
      "verified": true,
      "author": "Iftekar",
      "helpful_votes": 2,
      "publication_date": 20190111
    },
    {
      "title": "Not firm enough as advertised, had back pain",
      "text": "Me and my wife slept ok for first 2 days, then we started getting severe back and neck pain. Had to return otherwise good looking mattress due to discomfort while sleeping and causing back pain within 2 weeks of buying it. Per given instruction, we did leave the mattress for 2 days for proper expansion. We both are under 180 pounds so if the mattress was reasonably firm, we should have been okay however this one just didn't work out in terms of back support and firmness for us.",
      "rating": 2.0,
      "verified": true,
      "author": "SO",
      "helpful_votes": 0,
      "publication_date": 20200305
    },
    {
      "title": "Let the mattress sit for three days at least!",
      "text": "I just ordered another Zinus for my kid’s room. I’m completely satsified with this product. We’ve had it for three months now, and it still remains firm. The mattress will probably have a “hump” in the middle after a year or so, to be expected since we are big and tall people. We let the mattress sit for three days before sleeping on it so it could expand fully. I do believe that helped get us off on the right foot. Also, it has a slight odor that has faded over time. I’m very sensitive to chemical smells and I could handle this just fine.",
      "rating": 5.0,
      "verified": true,
      "author": "DissidentGirl",
      "helpful_votes": 2,
      "publication_date": 20180918
    },
    {
      "title": "Great",
      "text": "We purchased this for our office Murphy Bed more than a year ago. My entire family has slept on this when they visit (they come from Europe and stay for extended periods of time) and have loved sleeping on this mattress. We have occasionally had to use it for us as well and it has excellent firm support and good quality. It is firm - if you are looking for a soft mattress, this isn't it. Shipping and packaging were excellent as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Karla",
      "helpful_votes": 0,
      "publication_date": 20190513
    },
    {
      "title": "Goldilocks...this one is just right!",
      "text": "This bed is amazing I don't have any pain issues but found it to be just right. I thought it might be small but for someone 5'5\" 130 lbs it's perfect. The combination of individual spring coils with the cooling foam topper is amazing. I had bought a queen topper and it's great so I came back. Zero smell and certified safe just figure out what level firm or soft works for. Can't imagine how I would of returned it since it comes rolled up and vacuum sealed thank goodness it worked out.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200312
    },
    {
      "title": "Super firm and smelly",
      "text": "First night review (will update): My entire house smells like someone was painting the walls all day with no ventilation, so that's fun. Who knows what chemicals I'm enjoying, but they're making my nose run. Also, the bed is *super* firm, for better or worse. This isn't a mattress you can curl up on and feel cozy. You can lay stiffly atop it and hope for the best. So far, not very into pleased, but stuck with it regardless.",
      "rating": 3.0,
      "verified": true,
      "author": "SJ",
      "helpful_votes": 0,
      "publication_date": 20190320
    },
    {
      "title": "Two mattresses failed and a loss",
      "text": "I bought 4 twin mattresses from Zinus. Unfortunately, two off them did not inflate to the promised 12 inch from two corners. Two of them inflated fine with no issues. The other two inflated about 9.5 -10.5 inch on two corners. The other two corner to almost 12. Unfortunately, the amazon 30 day warranty is over as I was traveling. Now, I got stuck with two mattresses that essentially failed to inflate.",
      "rating": 1.0,
      "verified": true,
      "author": "Jay",
      "helpful_votes": 0,
      "publication_date": 20190506
    },
    {
      "title": "Extra firm!",
      "text": "So far, two weeks in, i couldnt be happier. Excellent value for the price, shipping and delivery with no issues. Followed directions for set up with no issues. I am 250 lbs, this is an extra firm mattress and is exactly what i was looking for. I figured if it was too firm i could always add a memory foam topper, but after a few nights ive adjusted. My only complaint is i should have bought this years ago.",
      "rating": 5.0,
      "verified": true,
      "author": "Blainet",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "Great bed, fantastic bargain",
      "text": "The bed is extremely comfortable and firm. I'm 6'2\" 240lbs and I dont sink in at all. I had purchased a novaform at Costco (about $200 more) and had to return it 2xs (never fully expanded) and woke up with pain. Though the delivery did not go as planned, (they left the bed outside the building in the middle of an ice storm, and I live in a multiple dwelling complex, luckily it wasn't stolen. They were supposed to have left it on my front door, instead it was left outside, box covered with ice.) it has no impact on the bed itself. Provides great support and no lower back pain. Bed is great for any type of sleepers.",
      "rating": 5.0,
      "verified": true,
      "author": "Lexx28",
      "helpful_votes": 0,
      "publication_date": 20190124
    },
    {
      "title": "Do NOT buy this mattress.",
      "text": "I bought this mattress in November 2018. The first mattress lasted a year and then began to sag in the middle. The company made me go through all kinds of hoops for a replacement. Finally the replacement comes in and I will NEVER purchase any product from this company again. The center of the replacement mattress began to sag a month in. My husband I both wake up with severe back pain. We’re not heavy individuals either so it’s crazy to me how these mattress cave so easy. Save your money and spend it on a mattress that won’t hurt your body and actually lets you get some sleep through the night.",
      "rating": 1.0,
      "verified": true,
      "author": "Angie",
      "helpful_votes": 0,
      "publication_date": 20200425
    },
    {
      "title": "Not bad",
      "text": "The last time I ordered a spring mattress off Amazon, you could feel the coils under you while sleeping. I was kind of expecting the same with this mattress, but I was pleasantly surprised. The plush layer on top is soft enough where you get a memory-foam feel with the support of the springs underneath. If you just moved into a new apartment and need a new mattress asap, I'd highly recommend this.",
      "rating": 4.0,
      "verified": true,
      "author": "Adriano",
      "helpful_votes": 0,
      "publication_date": 20190612
    },
    {
      "title": "Supportive mattress",
      "text": "It’s my second time buying this mattress! Still love it so much!!!! I’m having a bad back pain and the mattress is supporting my back so I don’t feel much pain when I lay on it!! It’s firm but not like hard as rock. I think it suits most of the people who don’t prefer super soft mattress",
      "rating": 5.0,
      "verified": true,
      "author": "tszonyu",
      "helpful_votes": 0,
      "publication_date": 20200822
    },
    {
      "title": "Back Pain",
      "text": "DO NOT purchase this bed. With the high rating of this mattress, I ignored the bad reviews and bought it. I am 23 years old, and I have never had back pain in my life until this mattress. Not only is it non-supportive, but it starts to indent and sink wherever you sleep (and after only a few months of sleeping on it). Save yourself the $300 and the lower back pain. I have had to purchase a $100 cushion topper just to BEAR to sleep on top of this mattress.",
      "rating": 1.0,
      "verified": true,
      "author": "M Dunck",
      "helpful_votes": 2,
      "publication_date": 20200107
    },
    {
      "title": "3 months. No sagging. Great buy.",
      "text": "I waited a couple of months before writing this review to be sure that the mattress held up. It absolutely did. I get back injections and a firm mattress is a must with degenerative disk disease. This mattress is very, very firm. No sagging. I did purchase a mattress topper as a firm mattress can be uncomfortable on my hips. I am a side sleeper. I weigh 275 lbs. I'm super happy with this purchase. No problems. Great price. Delivery in 5 days. Ready to sleep on immediately.",
      "rating": 5.0,
      "verified": true,
      "author": "Jocelyn",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "best firm mattress",
      "text": "This is the best firm mattress in an affordable budget I ever known. I have tried other brands with similar budgets. None of these mattresses has the same firmness. Highly recommended for an affordable firm mattress. Extra firm is a little bit confusing and it is not extra, just firm.",
      "rating": 5.0,
      "verified": true,
      "author": "Thara",
      "helpful_votes": 0,
      "publication_date": 20200324
    },
    {
      "title": "Amazing. It’s incredibly comfy!!",
      "text": "We’ve had this a month now, and I am amazed at how great this is. We got it for my mom & she loves it! It’s firm, but not hard, excellent support. She loves that she’s closer to the ground (her old mattress & box spring added up to more than double this height) & no squeaky box spring. We out this on the metal frame from the same company & are ridiculously pleased. We did jet ghus unroll & expand for 4 days. I think that helps with a lot of issues. If anything changes, I’ll update. But, as of now, hubby & I are waiting on the King Suze to go I’m sake & we are getting it!",
      "rating": 5.0,
      "verified": true,
      "author": "J. BurnettTop Contributor: Cooking",
      "helpful_votes": 0,
      "publication_date": 20190208
    },
    {
      "title": "Firm, supportive, and comfortable",
      "text": "This bed is wonderful. It’s supportive but not hard. My sleep has improved immensely. I have had this bed for a while and it feels great! I needed a bed that was firm but didn’t feel too firm. It feels firm in that it supports me, but soft and comfortable. I am not a small woman and this mattress is wonderful!",
      "rating": 5.0,
      "verified": true,
      "author": "pheonix",
      "helpful_votes": 0,
      "publication_date": 20200320
    },
    {
      "title": "Give it time!",
      "text": "This is a great mattress for the price! Criminally inexpensive!! I grew up with a firm mattress and needed to follow up with a new firm mattress so I got this one. Please take time and consideration to let the mattress decompress for as long as possible. My mattress was still a little soft the first couple of weeks but after sleeping in different spots for a few nights to even out the lumps it became totally even after! It also becomes more firm over the course of a few weeks so don’t make your decision about it just yet. Sleep on it ;)",
      "rating": 5.0,
      "verified": true,
      "author": "George G.",
      "helpful_votes": 0,
      "publication_date": 20191220
    },
    {
      "title": "Nice firm mattress",
      "text": "Very firm mattress, gives a solid support to our back. It has pressure relief too. Purchase the twin size bed, the middle of the mattress feels slightly higher than the side part. Probably because twin is smaller and compact.",
      "rating": 3.0,
      "verified": true,
      "author": "Winnie P.",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "Firm in the center",
      "text": "This mattress is Firm. However, the edge of the mattress is not firm at all. You can easily fall if you get closer to all the sides of this mattress and cannot sit over the edges as it is very weak. I bought it and gave it away for free after few months and got a better one. It's worth because it is cheap but if you can afford or pay montly a better one I'd recommend to do it",
      "rating": 3.0,
      "verified": true,
      "author": "Josue A. Rodriguez",
      "helpful_votes": 0,
      "publication_date": 20190719
    },
    {
      "title": "Great bed at affordable prices",
      "text": "Pretty firm and nice. No lumps so far. Bought for my mom and she loves it, no back pain, and she's had back problems when she had her old Macy's lumpy bed. Thanks Amazon for making ordering beds a piece of cake! Update: It's been nine months on this bed, with a baby at home and it's still hanging in there! The edges do slump a bit but it's nothing compared to the Macy's beds we had before, and they were hundreds more with warranty! I highly recommend this to anyone who needs a good bed for back support or just something to sleep on without worrying about how much you spent!",
      "rating": 5.0,
      "verified": true,
      "author": "bb",
      "helpful_votes": 0,
      "publication_date": 20181226
    },
    {
      "title": "Save your money — this product is poorly built.",
      "text": "Horrible. This bed has sunk in the middle beyond belief. I wake up at 5:00 AM every day from back pain, and it has zero support. It is firm for the first few months then the integrity of the bed is gone. I have a pretty slim build and I weigh 150 pounds and this is a king sized bed — it should not look like it has a huge dent in the middle. Save your money — this product is poorly built.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Truly extra firm! Great value",
      "text": "We purchased this extra firm mattress for a vacation cabin. Unlike other online-sold mattresses that say they're firm but are not even close, this product delivered. It's firm enough for my bad back. I'm someone who would rather sleep on a hard floor than on a too-soft mattress. Of course for the price, we don't expect it to last for years, but since it will only be used an average of 30 nights a year, it should be just fine. Thanks!",
      "rating": 5.0,
      "verified": true,
      "author": "Trees and stuff",
      "helpful_votes": 0,
      "publication_date": 20181221
    },
    {
      "title": "Big disappointment - does NOT live up to the quality seen in the twin mattress",
      "text": "I own two twin Zinus mattresses that I love as they are very firm, very comfortable. I have had them for over a year and they are still firm. I was hoping this Queen would be as comfortable but it is a lumpy, uncomfortable disappointment and has been for the month I have had it. It is about to go on the curb. I have to shift from the rim to the middle and back to the rim again during the night to avoid worsening back and neck pain in the morning. HUGE disappointment.",
      "rating": 2.0,
      "verified": true,
      "author": "Suzannah",
      "helpful_votes": 0,
      "publication_date": 20191001
    },
    {
      "title": "Comfortable",
      "text": "I find the support from this mattress is perfect while it simultaneously yields gently for a feeling of being on a cushioned surface. I find myself quickly becoming sleepy after laying on the mattress a few minutes. This is my second zinus mattress (two bedrooms). Although I dragged the box into the house and hoisted it onto the bedframe, the unfolding was efficient. I cut the wrapping carefully with scissors to avoid the path of the powerful unfolding. I've been a long time user of a famous firm mattress named S----, and also own an expensive mattress that offers extended trial use. So far, the zinus is my favorite!",
      "rating": 5.0,
      "verified": true,
      "author": "Katy 951",
      "helpful_votes": 0,
      "publication_date": 20190924
    },
    {
      "title": "Firm but Febreeze Needed",
      "text": "Purchased based on the reviews stating it's firm and good for guest room purposes. The bed is very firm and does not \"give\" when lounging on it. This is great for infrequent use and the price is a winner. The four star rating is due to the chemical smell that took one week and two rounds of febreze to dissolve. Overall it's a good purchase that I hope stands the test of time.",
      "rating": 4.0,
      "verified": true,
      "author": "Stella R.",
      "helpful_votes": 0,
      "publication_date": 20190427
    },
    {
      "title": "Good Good great",
      "text": "I waited few months before writing my review so I could have time to see how this mattress works. I am highly satisfied with it . It is a Very very good product . It arrived on time and we are enjoying every bit of it. We just ordered king size for the master bedroom. The negative reviews with one star rating by some disgruntled customers concerning this mattress claiming that it is too firm for the body in fact played well in convincing us that this is the mattress(EXTRA FIRM) we really wanted. Sometimes what someone wanted to discredit, actually helped this business indirectly",
      "rating": 5.0,
      "verified": true,
      "author": "Joseph Atkins",
      "helpful_votes": 0,
      "publication_date": 20171105
    },
    {
      "title": "I do not recommend.",
      "text": "I do not recommend. Product completely different from the description of the seller, and from the images posted in the advertisement. Disappointment, that's the word! When I looked for an \"EXTRA FIRME\" mattress, I was looking for an extra firm mattress, not a medium to soft mattress! Unfortunately, I have no way to put it back in the box and ask for a return! I learned that you can't trust all the stars that a product can have!",
      "rating": 1.0,
      "verified": true,
      "author": "Cristiano De Oliveira",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "Constant back pain and stiffness in the morning since I bought Zinus mattresses.",
      "text": "I haven’t had back pain for years, and since I bought this mattress I’ve woken up with back pain literally every day. It’s the second Zinus mattress I bought, I returned the first one (“memory foam”) for the same reason. I sleep well on firm mattresses, and this one is decently firm, but gosh I wish I spent the money on a better mattress brand. I thought the back pain was just me getting used to a new mattress so I kept it. Regretful buy 😌",
      "rating": 1.0,
      "verified": true,
      "author": "Christina",
      "helpful_votes": 0,
      "publication_date": 20191210
    },
    {
      "title": "Purchased November 2016",
      "text": "Mattress is maintaining support. It is firm. I added a mattress pad and it is soft enough for both my husband and myself. We can sit on the edge of this mattress without problem. We are back and side sleepers primarily. I can lay on stomach comfortably. We are 160 and 185 pounds. This is the 12” king on a metal zinus frame. I just ordered another mattress for my son. Highly recommend this mattress if you want a firm, supportive mattress. Add padding to customize. Feb 2020. We are still happy with mattress. Have also bought a full and and 2 twin size. We added pure green 100% natural latex mattress topper 1 inch. Perfection. Soft firm support.",
      "rating": 5.0,
      "verified": true,
      "author": "Rikpaul",
      "helpful_votes": 0,
      "publication_date": 20180405
    },
    {
      "title": "Very firm, love it!",
      "text": "I bought this for my husband to replace his worn out mattress. We have two twin mattress together to make a king and it worked perfectly next to mine. He loves it. It did take him a few days to get used to it since his old one was so broken down but he's very happy with it now. I was impressed with it as soon as it uncoiled. Very nice looking, firm and well made. We are both very pleased with the mattress and he has been sleeping on it for about month now.",
      "rating": 5.0,
      "verified": true,
      "author": "Diana D",
      "helpful_votes": 0,
      "publication_date": 20190112
    },
    {
      "title": "Constant backache. Beware",
      "text": "I've had this mattress for several months. I really, really wanted to enjoy it as I am used to a extra firm mattress. However, it just hurts. It's firmness is on point but it just hurts every morning. We've even tried putting on expensive mattress toppers and nothing works. I bought the box and bed frame and they are great. Just wish I would have bought it through the company store instead of Amazon so I could return/replace the mattress.",
      "rating": 2.0,
      "verified": true,
      "author": "D. Brown",
      "helpful_votes": 0,
      "publication_date": 20181220
    },
    {
      "title": "Quality control is doubtful",
      "text": "Quality control is questionable... 10 years warrantied product souls have been enforces at least common sense on basic quality checks but it is missing.. Packing is not solid & nor acceptable by that time it reaches consumers. Worth the money we spent ? No.. Spend couple bugs extra and get beauty rest mattress in local stores Not worth ordering via online and ask for replacement due to and wait for delayed return pickup etc..",
      "rating": 1.0,
      "verified": true,
      "author": "MSNandi INC",
      "helpful_votes": 0,
      "publication_date": 20190915
    }
  ],
  "product_meta": {
    "title": "Zinus 12 Inch Support Plus Pocket Spring Hybrid Mattress with Euro Top / Extra Firm Feel / More Coils for Durable Support / Pocket Innersprings for Motion Isolation / Bed-in-a-Box, Queen",
    "description": "Size:Queen| Style Name:12 InchHow much support you need from your mattress is probably just as subjective as how you like your eggs cooked! For those who find comfort in a firm bed with a soft quilted top microfiber cover, we developed our Support Plus Extra Firm Hybrid Mattress. Densely packed with 10% more pocketed springs than our other mattresses, it provides extra support and rigidity, making it ideally suited for stomach sleepers, plus-sized individuals, and firm mattress lovers of course! Not only do our revolutionary iCoil pocket springs hug your every curve for pressure-relief, but they also work to keep motion from a sleeping partner away from your side of the bed. Cozy, Certi-PUR US certified foams complete the top layer for the right touch of softness. And yes, even this ultra-firm bed is expertly compressed and packed into a box, so setup is worry-free, much like the 10 year warranty you get with your purchase! Fortunately for you, unlike the challenges involved in perfecting your eggs, we’ve perfected our mattress technology – so all you need to do is lay on this one to enjoy its many benefits.\n\nFROM THE MANUFACTURER\nThe Zinus Support Plus Mattress collection is made with an additional 10% more individually wrapped iCoils in the core of the mattress to provide extra support and motion separation for a comforting night's sleep. The foam layers above the Support Plus iCoil Springs adjust to your body to give you a customized, comforting, sleep surface. This unique combination of Support Plus iCoil Springs along with comforting foam layers will help you sleep well and wake up refreshed. Please open your mattress package within 72 hours of receipt and allow 48 hours for your new mattress to return to its original, plush shape. Another comfort innovation from Zinus. Pioneering comfort.",
    "rating": 4.4,
    "feature_bullets": [
      "FIRM SUPPORT, PLUS MORE - Our firmest mattress ever is engineered with 10% more heavy gauge steel iCoil pocket innersprings for added stability and extra firmness, ideal for stomach sleepers and plus-sized individuals",
      "SUPPORTIVE FOAM & POCKET SPRINGS - 1.25 inches soft comfort foam, 2.5 total inches durable high-density foam and 7.5 motion-isolating iCoil pocket springs with a microfiber-filled euro top and quilted jacquard cover",
      "CERTIPUR US CERTIFIED - Highest quality foam is CertiPUR-US Certified for durability, performance, and content. All sizes are subject to +/- 0.5 inch",
      "EXPERTLY PACKAGED - Our technology allows this mattress to be efficiently compressed into one box that’s easily shipped and maneuvered into the bedroom; simply unbox, unroll and this mattress does the rest, expanding to its original shape within 72 hours",
      "Worry-free 10 year limited warranty included; twin mattress supports a maximum weight of 250 lbs, while all other sizes can support up to 500 lbs",
      "1.5 top Comfort Foam layer, 2.5 inch High Density Foam Support layer",
      "7.5 inch base layer of over 10% more individually wrapped coils assures no motion transfer",
      "Extra firm support",
      "Only the Highest Quality of Foam - Foam is CertiPUR-US Certified for durability, performance, and content",
      "Worry free 10 year limited warranty"
    ],
    "specifications": {
      "Item Weight": "86.7 pounds",
      "Product Dimensions": "80 x 60 x 12 inches",
      "Item model number": "AZ-PPSM-12Q",
      "Is Discontinued By Manufacturer": "No",
      "Assembled Height": "12 inches",
      "Assembled Width": "60 inches",
      "Assembled Length": "80 inches",
      "ASIN": "B0134FXZ40",
      "Customer Reviews": "4.4 out of 5 stars3,263 ratings4.4 out of 5 stars",
      "Best Sellers Rank": "#13,245 in Home & Kitchen",
      "Date First Available": "July 30, 2015"
    },
    "categories": [
      "Furniture",
      "Home & Kitchen",
      "Mattresses",
      "Bedroom Furniture",
      "Mattresses & Box Springs"
    ],
    "price": 362.53
  }
}