{
  "website_summaries": [
    {
      "verdict": "If the thought of vacuuming makes you want to run, this Roomba is for you. It's packed with unique features to keep your home clean.",
      "pros": [
        "The AeroForce function helps your Roomba go from hardwood to high pile rug with no issue",
        "Works with home assistants, like Google Home and Amazon Alexa"
      ],
      "cons": [
        "Our test robot got stuck a few times in tight corners"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "iRobot's Wi-Fi-enabled Roomba 980 is an exciting hunk of next-gen vacuum tech, but it didn't wow us during testing. I'd hold off on this pricey automated floor cleaner until we review Neato's Botvac Connected and Dyson's 360 Eye.",
      "pros": [
        "iRobot gives its $900 Roomba 980 a brain power boost with a lithium ion battery, additional sensors, a camera, and Wi-Fi and app connectivity on Android and iOS devices"
      ],
      "cons": [
        "It didn't perform as well as the $700 Roomba 880 we reviewed in 2013",
        "We also want to see features like a remaining battery life readout, push alerts and third-party integrations added to the iRobot Home app"
      ],
      "aspects": {
        "Performance": 6.0,
        "Features": 7.0,
        "Design": 8.0,
        "Usability": 9.0
      },
      "publication_date": 20150916,
      "rating": 7.2,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Awesome.",
      "text": "Due to a recent health decline, housework is now very painful. This has forced me to sit and watch in horror as the mountain of cat hair has built up. I hesitated for ages before making such a big financial investment, but I’m so glad I did. It’s strangely calming watching it trundle its way around and all I have to do is put the small stuff out of the way. It’s early days yet but zero problems so far. Buy it, you’ll love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Merita King",
      "helpful_votes": 11,
      "publication_date": 20180627
    },
    {
      "title": "one of the best roomba robots i have ever had",
      "text": "one of the best roomba robots i have ever had. cleaning pattern is finally in ordinate parallel passes instead of silly random paths as it used to be. great at recognising rooms. completes cleaning rapidly and much better at avoiding obstacles.",
      "rating": 5.0,
      "verified": true,
      "author": "Krome",
      "helpful_votes": 14,
      "publication_date": 20180201
    },
    {
      "title": "My iRobot",
      "text": "Excellent product, I have owned an iRobot since they came on the market in 2002 and still have the old one, I would not be without it, now them",
      "rating": 5.0,
      "verified": true,
      "author": "Saundra Renwick",
      "helpful_votes": 4,
      "publication_date": 20181216
    },
    {
      "title": "Robbie the Robot - Expensive but top of the range.",
      "text": "Actually performs very well compared to previous robot vacuums we have owned. Very thorough and not too noisy. If your trying to replace a manual vacuum cleaner without the effort then this is most probably your best choice. Ours is called Robbie the Robot and he has quite a character.",
      "rating": 5.0,
      "verified": true,
      "author": "Keith H",
      "helpful_votes": 0,
      "publication_date": 20190822
    },
    {
      "title": "... few spots afterwards but it clears the majority away beautifully.",
      "text": "You will have to clean up a few spots afterwards but it clears the majority away beautifully.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 15,
      "publication_date": 20160723
    },
    {
      "title": "My best friend is Roomba",
      "text": "I would never imagine my life without Roomba. Ohhhh gosh that’s a life saver",
      "rating": 5.0,
      "verified": true,
      "author": "London",
      "helpful_votes": 0,
      "publication_date": 20191116
    },
    {
      "title": "It's won me over!",
      "text": "Ordered this pretty much against my will but it's turned out to be a good investment. Pleased I bought it when I did as it's since gone up in price by £55!",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff",
      "helpful_votes": 4,
      "publication_date": 20180121
    },
    {
      "title": "Unhappy",
      "text": "The product was good initially then stopped charging. I have returned product and have yet not received my refund which is not insubstantial. Please can this be amended.",
      "rating": 1.0,
      "verified": true,
      "author": "Urmila Tandon",
      "helpful_votes": 0,
      "publication_date": 20200827
    },
    {
      "title": "As robots go its a good one.",
      "text": "Does a great job, only downside is it needs a mute button to stop the beeping on start and finish. The app works well, set up was straight forward.",
      "rating": 4.0,
      "verified": true,
      "author": "Grant Smith",
      "helpful_votes": 0,
      "publication_date": 20190902
    },
    {
      "title": "Worth every penny. Brilliant!",
      "text": "This is an amazing product. I have had previous robot vacuums that being honest, were a gimmick. But this is perfect. I've had it a week and not had to get my big vacuum out at all and my floors are spotless. I just leave all of my internal doors open downstairs and let the robot do his thing while I'm at work. Couple of times a week I quickly place him at the top of my stairs and leave all the upstairs doors open and he cleans their successfully as well. a week after purchase, I've not had one problem. Worth every penny despite seeming expensive before purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Peter Holdstock",
      "helpful_votes": 14,
      "publication_date": 20170311
    },
    {
      "title": "Best Roomba / Vaccum yet",
      "text": "Completely awesome, has picked up more on my new carpets than my new Dyson, expensive yes but I don't have to hoover anymore! Used to have a 7 series which I loved but this one has so much better navigation not just random movements. Doesn't miss a spot",
      "rating": 5.0,
      "verified": true,
      "author": "Sb",
      "helpful_votes": 16,
      "publication_date": 20160705
    },
    {
      "title": "... something to clean the house and the iRobot is perfect. It cleans very well",
      "text": "We wanted something to clean the house and the iRobot is perfect. It cleans very well. You can program it so it can start when you are away. He cleans very well and will do a great job. You can use the app to controll it. If it runs out of battery before finishing it goes back to his base recharge and resume working. Very pleased with it",
      "rating": 5.0,
      "verified": true,
      "author": "Vittorio C.",
      "helpful_votes": 6,
      "publication_date": 20161030
    },
    {
      "title": "A Significant upgrade.",
      "text": "Significant upgrade to earlier versions. App works well to set schedule and check area cleaned.",
      "rating": 5.0,
      "verified": true,
      "author": "Quentin Bargate",
      "helpful_votes": 8,
      "publication_date": 20170730
    },
    {
      "title": "Definitely a treat to be had",
      "text": "Love Roomba... i do make an effort to pick up chairs & dog toys/beds before letting it loose but it does a nice job. I like having clean floors and it gifts me that. Quieter than vacuuming and doesn’t scare the animals too much. Wish the bin was a bit larger and that it was maybe 10cm shorter so it could go under a few pieces of furniture. App is awesome, I can turn it on while I’m out and about and have a clean floor when I return. Expensive but overall, a very nice lush treat.",
      "rating": 5.0,
      "verified": true,
      "author": "Kris S.",
      "helpful_votes": 2,
      "publication_date": 20180420
    },
    {
      "title": "Time saving appliance x1000",
      "text": "Fantastic product, Bin nees emptying frequently and the robot does get stuck on certain rug positions against walls but can live with these small things",
      "rating": 5.0,
      "verified": true,
      "author": "The Fin",
      "helpful_votes": 0,
      "publication_date": 20180427
    },
    {
      "title": "I am overall happy with this machine",
      "text": "I am overall happy with this machine. It cleans pretty good, both hard surfaces and carpets. The main painpoint is that sometimes (roughly 35% of the time) it gets stuck for no apparent reason.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 6,
      "publication_date": 20170816
    },
    {
      "title": "Better than I thought it would be",
      "text": "Better than I thought it would be. Works very well but does need to be maintained regularly which is very easy to do as rubbish invariably gets stuck occasionally (e.g. sweet wrapper) and blocks suction. The scheduling, remote control from my iPhone and its performance all makes this an excellent product. Only negative is the cat loves riding on it and turns it off!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 18,
      "publication_date": 20160609
    },
    {
      "title": "Five Stars",
      "text": "This is a great product to maintain a clean floor all around the house.",
      "rating": 5.0,
      "verified": true,
      "author": "Cliente Amazon",
      "helpful_votes": 2,
      "publication_date": 20170821
    },
    {
      "title": "Love it!",
      "text": "I love my roomba! It was expensive (this 4 versus 5 stars) and I was embarrassed at my extravagance, but generally worth it as now my husband and I do not fight over who will or should do the hoovering. And even better - It vacuums better than our upright vacuum! The docking station and app make it very convenient and allows us to keep up with pet hair. Having the roomba allows us to get on with other things around the house. I definitely recommend it especially if you have busy lives.",
      "rating": 4.0,
      "verified": true,
      "author": "Bonnie M.",
      "helpful_votes": 19,
      "publication_date": 20160916
    },
    {
      "title": "Highly recommended.",
      "text": "Can't imagine how I managed without it now. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "KTB",
      "helpful_votes": 0,
      "publication_date": 20170602
    },
    {
      "title": "Excellent!",
      "text": "I feel compelled to write a review for this because I struggled to research this before buying, as there was so little information available from buyers. However, i took and plunge and love it. I work full time and have a household of 5, but with its help I'm managing without a cleaner! It is efficient, easy to use and, so far, hasn't needed any major maintenance. It is my new best friend and has exceeded my expectations. Customer service and aftercare has also been impressive. Well done Roomba and thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "Simply me",
      "helpful_votes": 13,
      "publication_date": 20170627
    },
    {
      "title": "Roomba client sevice",
      "text": "After two weeks work the vacuum cleaner malfunctioned we up to this point in time were very content with the machine",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20180111
    },
    {
      "title": "Disappointing",
      "text": "It's nifty toy, but not really more than that. I was disappointed to see it not be able to clean my medium shagginess carpets (just giving up when it should push a little in order to move on them), to find easily cleanable dirt near the walls (it seems it does not make a pass with the long brush by every wall), and especially to find out that I can't connect it to my Google Home, for no other reason than that I'm not a US customer.",
      "rating": 2.0,
      "verified": true,
      "author": "Ezada",
      "helpful_votes": 5,
      "publication_date": 20170726
    },
    {
      "title": "Might be scratching hard floors",
      "text": "I have just got a robot last week. I love using it for the small clear-up tasks, however started noticing some scratches on our hard floors. Will update this review after a couple of weeks once I have a better idea of the product.",
      "rating": 3.0,
      "verified": true,
      "author": "Agnieszka Gradzewicz",
      "helpful_votes": 0,
      "publication_date": 20201125
    },
    {
      "title": "Breaks down quickly",
      "text": "So I have had a Roomba 980 for 3 weeks now. For the first 10 days it was great and I followed the manual for cleaning brushes, aeroforce blades etc. However, as of today it has developed a massive noise. Again I completed the whole dismantling, cleaning and assembling the machine again but the noise (high frequency crackling noise) continues. I am quite disappointed that such an expensive kit did not last very long. It has been cleaning marble flooring which is not heavy duty and should have lasted longer than this. I am returning it back to Amazon for refund.",
      "rating": 1.0,
      "verified": false,
      "author": "M. Veisi",
      "helpful_votes": 7,
      "publication_date": 20180312
    },
    {
      "title": "Broke after 4 hours",
      "text": "I would not buy this product or any irobot product in the future. this stopped working after 4 hours and its been sent back over 4 weeks now. When I ring irobot they cannot give me an update and never ring back. I have rang them 6-7 times in the last 3 weeks. They promise that the supervisor will ring me with an update but that never happens. The service is extremely poor.",
      "rating": 1.0,
      "verified": false,
      "author": "Brian",
      "helpful_votes": 0,
      "publication_date": 20200523
    },
    {
      "title": "Best Christmas present I’ve ever got",
      "text": "Can’t praise this little machine enough, my carpets have never been so clean. What more can I say. It’s perfect.",
      "rating": 5.0,
      "verified": false,
      "author": "julie",
      "helpful_votes": 0,
      "publication_date": 20180717
    },
    {
      "title": "Been doing a great job for over a year",
      "text": "I’ve had the Roomba for over a year now (since Aug 2016), and have been very happy with it. Using scheduled runs during the day while everyone is out is great, and it can easily do a double run in our flat (two carpeted bedrooms, hardwood and tiles elsewhere) without skipping a beat. The only niggle is that it sometimes gets stuck in an awkward angle on the sloping legs of a Barcelona chair, but that’s very infrequent (once a month tops).",
      "rating": 5.0,
      "verified": false,
      "author": "MJI",
      "helpful_votes": 5,
      "publication_date": 20171127
    },
    {
      "title": "You still need to pick up a vacuum cleaner now ...",
      "text": "You still need to pick up a vacuum cleaner now and then to finish the job, but it does 80-90% of the work for you.",
      "rating": 5.0,
      "verified": false,
      "author": "Morten Pedersen",
      "helpful_votes": 18,
      "publication_date": 20160817
    },
    {
      "title": "... about 6 months now I can say is my best buy ever",
      "text": "I have romba 980 model for about 6 months now I can say is my best buy ever. I love it. I bought it in other shop, is doing a great job, better then me with my dyson. I never need to hover again . Have a few small issues from time on time like if I put it in the kitchen and is messy it won t clean it perfectly unless I close the door, and after I have to bring him back to the charging unit but once you learn to know him you won t be able to live without him > I LOVE IT .",
      "rating": 5.0,
      "verified": false,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20170314
    }
  ],
  "product_meta": {
    "title": "iRobot ROOMBA980 Robot Vacuum Cleaner",
    "description": "ROOMBA 980\n\n\nVacuum Cleaning Robot\n\n\nThe new Roomba 980 keeps going until the job is done, vacuuming an entire level of your home for up to two hours*, recharging as needed. And with the iRobot HOME App, you can start and schedule Roomba 980 from anywhere. Get the Smart, Simple, powerful Clean of Roomba 980.\n\n\n\n\n\n\n\n\n\n\n\n\nINTRODUCING ROOMBA® 980 - The power to change the way you clean\n\nAll Roomba® vacuum cleaning robots help you keep up with everyday mess.\n\nSmart: Seamlessly navigates under furniture and around clutter\n\nSimple: Just press CLEAN\n\nClean: 3-Stage Cleaning System with Spinning Side Brush easily picks up dust, dirt, pet hair and large debris like cereal\n\nRoomba® 980 specific features:\n\nEntire Level Cleaning\n\n\niAdapt® 2.0 Navigation with Visual Localisation helps Roomba seamlessly and e",
    "rating": 4.2,
    "feature_bullets": [
      "iRobot HOME App lets you clean, schedule, & customize cleaning preferences from your smartphone",
      "Cleans an entire level of your home with iAdapt 2.0 Navigation with Visual Localization",
      "Runs for up to 120 minutes, then automatically recharges and resumes cleaning to complete the entire job",
      "AeroForce Cleaning System loosens, lifts & suctions dirt with up to 10x more air power",
      "Automatically increases cleaning performance on carpets with Power Boost"
    ],
    "specifications": {
      "Brand": "IRobot",
      "Model Number": "R980020",
      "Colour": "Black/Brown W/ Extras + 3 Sidebrushes",
      "Product Dimensions": "35.31 x 35.31 x 9.14 cm; 3.95 Kilograms",
      "Capacity": "2 litres",
      "Power / Wattage": "33 watts",
      "Voltage": "110120 Volts",
      "Special Features": "Cordless, Bagless",
      "Item Weight": "3.95 kg",
      "ASIN": "B013E9L4ZS",
      "Customer Reviews": "4.2 out of 5 stars296 ratings4.2 out of 5 stars",
      "Best Sellers Rank": "83,722 in Home & Kitchen",
      "Delivery information:": "We cannot deliver certain products outside mainland UK",
      "Date First Available": "11 Nov. 2015"
    },
    "categories": [
      "Kitchen & Home Appliances",
      "Robotic Vacuums",
      "Home & Kitchen",
      "Vacuums",
      "Vacuums & Floor Care"
    ],
    "price": 796.67
  }
}