{
  "website_summaries": [
    {
      "verdict": "Inexpensive style of golf shoe that will yield a good level of support.",
      "pros": [
        "Will last longer than you'd think for a golf shoe at this price range",
        "Rubber sole provides a bit more comfort than a stiffer sole",
        "Low profile cleats have a nice grip to them, but they are removable, making them easy to change out as needed"
      ],
      "cons": [
        "Sizes run a little big",
        "Cushioning in the sole is too thin"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Sub Par Golf Shoe",
      "text": "Anything Puma, I always buy a half size larger. This is a good looking shoe and fits appropriately due to my adjustment versus other popular golf shoes (Addidas, FootJoy, etc.). My major complaint is that the leather is already cracking after three rounds of golf, all in good Florida weather. Not good quality at all.",
      "rating": 2.0,
      "verified": true,
      "author": "Junius Hill",
      "helpful_votes": 0,
      "publication_date": 20191114
    },
    {
      "title": "Surprise Inside!!",
      "text": "Great golf shoes at a Great price. Two very nice surprises in the shoes!!! 1) Two pair of shoe laces \"excellent\" and 2) A set of hard papered \"shoe trees\", very unexpected!!! They look good on me and that is really the whole point of buying golf shoes. All in all, I will buy PUMA bra",
      "rating": 5.0,
      "verified": true,
      "author": "Lewis J.",
      "helpful_votes": 0,
      "publication_date": 20180501
    },
    {
      "title": "Well made, nice fit and very comfortable!",
      "text": "When I had purchased these, my biggest fear was the fit. I made sure to get a 1/2 size larger, because of the way the shoe is made and it was an excellent choice. They wear exceptionally well and have truly a firm grip to the ground, even in sand, so that I don't slip and slide. Even walking on pavement isn't jarring to the body! Well Made Puma!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Dana Weber",
      "helpful_votes": 0,
      "publication_date": 20180801
    },
    {
      "title": "get a half size bigger",
      "text": "Fit as described. I wear a size 11 and as mentioned they fit small so I gotan 11 1/2 and very happy. Still breaking in but so far fit amd feel good.",
      "rating": 5.0,
      "verified": true,
      "author": "matt b",
      "helpful_votes": 0,
      "publication_date": 20170309
    },
    {
      "title": "Very nice shoe, great grip",
      "text": "Very nice shoe, great grip. It was very comfortable at first but at the end of 18 holes, it was hurting my toes a bit. They seem to get a little narrow at the toe and just bothered my toes. The rest of the shoe was perfect fit and comfortable.",
      "rating": 4.0,
      "verified": true,
      "author": "jp4",
      "helpful_votes": 0,
      "publication_date": 20161122
    },
    {
      "title": "Great looking, Comfortable",
      "text": "Great looking, Comfortable, water proof and a nice sturdy golf shoe. Didn't give 5 stars because cleaning dirt out of the cleats is a pain.",
      "rating": 4.0,
      "verified": true,
      "author": "Rachel",
      "helpful_votes": 0,
      "publication_date": 20170424
    },
    {
      "title": "I really liked these shoes the first time I used them",
      "text": "I really liked these shoes the first time I used them. I sprayed mine with camp dry so the moisture wouldn't leak in. They fit will..now if I could work on my slice..",
      "rating": 5.0,
      "verified": true,
      "author": "G. Daniel",
      "helpful_votes": 0,
      "publication_date": 20170606
    },
    {
      "title": "Perfect golf shoe for the price..",
      "text": "Perfect golf shoe for the price. Comfortable, durable, and grip well. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Tyler C.",
      "helpful_votes": 0,
      "publication_date": 20180113
    },
    {
      "title": "Five Stars",
      "text": "Very comfortable, good quality product. I may purchase another pair.",
      "rating": 5.0,
      "verified": true,
      "author": "kp",
      "helpful_votes": 0,
      "publication_date": 20170124
    },
    {
      "title": "Do what I figured they would",
      "text": "Good shoe. Played a round the day I got them. Performed as a gold shoe should as I expected.",
      "rating": 4.0,
      "verified": true,
      "author": "Joe & Andrea",
      "helpful_votes": 0,
      "publication_date": 20161202
    },
    {
      "title": "Five Stars",
      "text": "A great golf shoe. Fits perfect. Looks great and easy to clean. No complaints.",
      "rating": 5.0,
      "verified": true,
      "author": "alfred wheeler",
      "helpful_votes": 0,
      "publication_date": 20170718
    },
    {
      "title": "Totally Satisfied",
      "text": "Product is as advertised. Excellent customer service and fast delivery! A++",
      "rating": 5.0,
      "verified": true,
      "author": "Phil",
      "helpful_votes": 0,
      "publication_date": 20170104
    },
    {
      "title": "Not comfortable. Need more cushion",
      "text": "Not comfortable. Need more cushion. I could feel spikes through the soul. I returned them. Disappointed with cost of return. 20.00 to mail and restocking charge. I will not buy your products in future. Steve 804 784 8799",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170627
    },
    {
      "title": "Louisiana Rick",
      "text": "Fit a little loose. Not as comfortable as others I have owned. About average.",
      "rating": 3.0,
      "verified": true,
      "author": "Rick",
      "helpful_votes": 0,
      "publication_date": 20161202
    },
    {
      "title": "Amazing shoes, very nice",
      "text": "I really like these shoes because they keep me balanced during my swing without my feet slipping. I've been hitting it solid almost every time, love the cleats.",
      "rating": 5.0,
      "verified": true,
      "author": "Maggie G.",
      "helpful_votes": 0,
      "publication_date": 20170510
    },
    {
      "title": "Five Stars",
      "text": "Fit is perfect. For what I paid, they're very good shoes.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeffry Gardner",
      "helpful_votes": 0,
      "publication_date": 20170410
    },
    {
      "title": "Great Game Improvement Tool...Shoes",
      "text": "Great Looks, Comfort , and Function. Can't ask for anything more. Been using spikeless shoes for a while, and didn't realize how much more grip and stability you get with spiked shoes. Glad I bought them.",
      "rating": 4.0,
      "verified": true,
      "author": "Ed Wynn",
      "helpful_votes": 0,
      "publication_date": 20161103
    },
    {
      "title": "These are very comfortable. Never got any blisters",
      "text": "These are very comfortable. Never got any blisters. I play early in the morning when it's often very dewy. They have done a good job keeping my feet dry so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Kent Walrath",
      "helpful_votes": 0,
      "publication_date": 20170823
    },
    {
      "title": "I like them a lot",
      "text": "I like them a lot. First pair in a long time. Fits good I wear a 13. Wish they weren't so pointy at the toe but fit well. I like them.",
      "rating": 4.0,
      "verified": true,
      "author": "Nick",
      "helpful_votes": 0,
      "publication_date": 20170122
    },
    {
      "title": "Five Stars",
      "text": "Nice looking shoes. I went with a half size larger because of the pointed toe, they fit well.",
      "rating": 5.0,
      "verified": true,
      "author": "James Arndt",
      "helpful_votes": 0,
      "publication_date": 20170322
    },
    {
      "title": "Great Shoes",
      "text": "Fit well and feel go when I golf! Gave me more stability on my swing!",
      "rating": 5.0,
      "verified": true,
      "author": "Howard J. Kisor Jr.",
      "helpful_votes": 0,
      "publication_date": 20161120
    },
    {
      "title": "I have super narrow feet",
      "text": "I have super narrow feet, so I'd expect a normal person have a super fit. Great shoes, waterproof held up in bad conditions.",
      "rating": 4.0,
      "verified": true,
      "author": "Nick B.",
      "helpful_votes": 0,
      "publication_date": 20161019
    },
    {
      "title": "Five Stars",
      "text": "Quality golf shoes for dirt cheap. Came fast, no complaints.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180228
    },
    {
      "title": "Sharp looking and very comfortable!",
      "text": "Just arrived today and they look even better in person. Very comfortable. Will be trying on the course in the next week. Seem to be very well made and a great deal.",
      "rating": 5.0,
      "verified": true,
      "author": "Chase Tomlinson",
      "helpful_votes": 0,
      "publication_date": 20160709
    },
    {
      "title": "Good fit and firm in the heal.",
      "text": "Puma fits me well so I'll continue to add styles. The Ace is very supportive in the heal where I have some reoccurring soreness.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161203
    },
    {
      "title": "i know its a personal thing, i have other ...",
      "text": "i know its a personal thing, i have other Puma shoes and they are ok, these are quite if possible i will be returning them",
      "rating": 3.0,
      "verified": true,
      "author": "L R-H",
      "helpful_votes": 0,
      "publication_date": 20160829
    },
    {
      "title": "Five Stars",
      "text": "Very pleased with this shoe, received it fast and it looks and feels great.",
      "rating": 5.0,
      "verified": true,
      "author": "Edward C.",
      "helpful_votes": 0,
      "publication_date": 20170327
    },
    {
      "title": "Great shoe first time I put them on to play ...",
      "text": "Great shoe first time I put them on to play golf walked 5 mile course my feet thanked me Awsome",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161102
    },
    {
      "title": "Five Stars",
      "text": "No problems got my new puma golf shoes in two days.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161130
    },
    {
      "title": "Great buy",
      "text": "No issues so far. Have used them around ten times so far. There is a major swing difference when you go from running shoes to actual golf shoes so make sure you hit the range prior to course.",
      "rating": 5.0,
      "verified": true,
      "author": "brewerfamily",
      "helpful_votes": 0,
      "publication_date": 20161229
    },
    {
      "title": "Not so much that I can't wear them comfortably. 1st pair of golf shoes",
      "text": "I know PUMA shoes are a bit small, so I ordered a 1/2 size larger, and it was probably a bit too much. Not so much that I can't wear them comfortably. 1st pair of golf shoes.",
      "rating": 4.0,
      "verified": true,
      "author": "Matt Coglon",
      "helpful_votes": 0,
      "publication_date": 20161012
    },
    {
      "title": "Five Stars",
      "text": "Great shoe. Ran slightly small. Ordered a half size up.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160914
    },
    {
      "title": "Just be aware. That not everything is what it seems",
      "text": "Just seem like the product was nicer in picture but once I saw it. It wasn't what I hoped for. The quality of the shoe seems poor..",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160726
    },
    {
      "title": "Nice",
      "text": "Bought these for my son who started golfing this year. Size 14 feet, he likes them, but he has never had any others. He doesn't complain, and he would if they weren't comfortable. They look exactly like my other son's tennis shoes.",
      "rating": 3.0,
      "verified": true,
      "author": "Nonni to 4",
      "helpful_votes": 0,
      "publication_date": 20160908
    }
  ],
  "product_meta": {
    "title": "PUMA Men's Golf Ace Golf Shoe",
    "description": "Full-grain leather quality and performance with amazing comfort and timeless design.\n\nPUMA is the global athletic brand that successfully fuses influences from sport, lifestyle and fashion. PUMA's unique industry perspective delivers the unexpected in sport-lifestyle footwear, apparel and accessories, through technical innovation and revolutionary design.",
    "rating": 4.4,
    "feature_bullets": [
      "100% Ultra Premium/Full Grain Leather Upper",
      "Imported",
      "Rubber sole",
      "PWRCOOL powered by Outlast regulates temperature and increases comfort"
    ],
    "categories": [
      "Men",
      "Athletic",
      "Shoes",
      "Clothing, Shoes & Jewelry",
      "Golf"
    ],
    "price": "",
    "specifications": {}
  }
}