{
  "website_summaries": [
    {
      "verdict": "The best overall racing tire available to average drivers and weekend racers.",
      "pros": [
        "Aggressive tread pattern digs deep into most hard race surfaces with ease",
        "Produces minimal amount of burnout during launch and acceleration",
        "Excellent grip and handling at high speeds for better acceleration and braking"
      ],
      "cons": [
        "Cornering performance is not as good as straight acceleration"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "2016 Camaro SS with stock tires",
      "text": "Bought 2 for my 2016 Camaro SS, mounted in rear with the stock wheels (20x9.5 yes it fits!), i just have one week with them at this time and i love them, very good grip, i also drove the car under heavy rain and no issues whatsoever, i think these are the best radials you can buy for everyday use. The only thing i didn't like is that after i received the tires, the price went down 40 bucks on each tire! :p (If I had known it would happen I would have waited a week more lols)",
      "rating": 5.0,
      "verified": true,
      "author": "Edra",
      "helpful_votes": 6,
      "publication_date": 20170703
    },
    {
      "title": "awesome, no shimmy at high",
      "text": "Ran low 11s on stock Charger Hellcat, awesome, no shimmy at high speed",
      "rating": 5.0,
      "verified": true,
      "author": "Eric Tornwall",
      "helpful_votes": 8,
      "publication_date": 20170416
    },
    {
      "title": "Wins races, but keep 'em dry",
      "text": "I have had many pairs of these on the rear of a 2016 Hellcat Challenger and now a 2019 Hellcat Redeye. They definitely hook off the line when warmed up, but if you drive them in the rain you will crash the car. I did. They are a summer tire, and I got caught in a sudden downpour, if that happens, pull over and wait it out.",
      "rating": 5.0,
      "verified": true,
      "author": "Sabrina M.",
      "helpful_votes": 3,
      "publication_date": 20171116
    },
    {
      "title": "Very good tire",
      "text": "Bought those for a friend who has a modified Shelby GT500, finally the car is drivable on the street! We don't expect a very long lifespan out of them because the compound is very soft, but also we don't expect a long live out of the car with the stock tires if it's uncontrolable either so we opted to change tires more often instead of having to repair a car from a crash damage",
      "rating": 5.0,
      "verified": true,
      "author": "Patricio",
      "helpful_votes": 4,
      "publication_date": 20130608
    },
    {
      "title": "Good tires. Wear pretty well",
      "text": "Good tires. Wear pretty well, mount and balance well, but not the stickiest out there. If you need a positive and consistent hook up from launch, buy the Mickey Thompson Street Radial 2s.",
      "rating": 4.0,
      "verified": true,
      "author": "09CD",
      "helpful_votes": 0,
      "publication_date": 20180802
    },
    {
      "title": "NT555 drag radial",
      "text": "Put these tires on my 2012 GT500 and they hooked up very well on the street. Haven't done a track day yet. Good tires for the price.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170924
    },
    {
      "title": "A huge improvement over the factory rears on my Hellcat ...",
      "text": "A huge improvement over the factory rears on my Hellcat, but not sticky enough for the drag strip. I'll keep using hem on the street.",
      "rating": 4.0,
      "verified": true,
      "author": "Jay",
      "helpful_votes": 0,
      "publication_date": 20180516
    },
    {
      "title": "THE FIT.",
      "text": "I HAVE A 2018 SRT CHALLENGER THAT THESE FIT ON VERY NICELY,. HAVENT PUT THEM ON THE TRACK YET BUT WILL LET YA KNOW HOW THEY DO.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180505
    },
    {
      "title": "Best drag radials I've used!",
      "text": "Absolutely love these tires! I run them on a shelby gt500 heavily modified (800hp at the wheels) they have a much better grip than the stock tires which honestly isn't saying much but these things hook good. Of course you're going to be able to break them loose but if you know how to drive your car they will work great. I daily drive my car yes even in light rain and they still hook decent enough (again not driving like an idiot in the rain) but they make it to where I am able to drive an 800hp rear wheel drive car in the rain so I am very pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20170114
    },
    {
      "title": "Awesome tire",
      "text": "Night and day difference. Took my car from a 12.8 1/4 mile down to a 11.2. Worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Sean",
      "helpful_votes": 0,
      "publication_date": 20180525
    },
    {
      "title": "Grip",
      "text": "Good tire lower tire pressure lil burn out, let's go!! 305/35/20",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "Awesome tire works well in rain",
      "text": "Awesome tire works well in rain. This is the most versatile tire I have used besides the Goodyear eagle F1.",
      "rating": 5.0,
      "verified": true,
      "author": "Hubbard",
      "helpful_votes": 0,
      "publication_date": 20150912
    },
    {
      "title": "Hellcat Challenger",
      "text": "Great set of tires, looks good on out Hellcat Challenger",
      "rating": 5.0,
      "verified": true,
      "author": "Jack",
      "helpful_votes": 6,
      "publication_date": 20151005
    },
    {
      "title": "Five Stars",
      "text": "Hookup way better on the street. So far very happy",
      "rating": 5.0,
      "verified": true,
      "author": "Dennis Moore",
      "helpful_votes": 0,
      "publication_date": 20170617
    },
    {
      "title": "Makes high horsepower cars streetable.",
      "text": "Purchased these for a 2014 Shelby GT500. It is spec'd for a minimum 10\" wide rim. But mounted great on the factory 9.5\" rim. It bulges somewhat on the side facing inward but perfectly flat on the side facing the outward. So it looks great and doesn't rub which was my main concern. It doesn't solve all traction issues since it is still easy to spin. But traction is greatly improved and far more controllable. Like the other reviews state, it is a streetable car now.",
      "rating": 4.0,
      "verified": true,
      "author": "Brian",
      "helpful_votes": 4,
      "publication_date": 20140915
    },
    {
      "title": "Great tires for a true muscle car on the street",
      "text": "These tires hook up good, but not as good as the nitto nt05r, but I'm not changing tires when I change my oil. Great tires for the street, I'm putting down 691 rwhp and they hook in but not that well in 1st gear. They handle way better in the rain then drag radials, I would recommend these tires for street driving over summer performance tires.",
      "rating": 5.0,
      "verified": false,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20200415
    },
    {
      "title": "... and cam these tires hook from a dig highly recommended",
      "text": "Have a 2014 camaro ss with full boltons and cam these tires hook from a dig highly recommended",
      "rating": 5.0,
      "verified": false,
      "author": "Edward Astorga",
      "helpful_votes": 2,
      "publication_date": 20170221
    },
    {
      "title": "awesome",
      "text": "Slapped these on my 2012 SRT8 Hemi Challenger and couldn't ask for more. Perfect fit yada yada yada.. :-) I will buy these again after I shred threw them. Baa!!!",
      "rating": 5.0,
      "verified": false,
      "author": "Ronald R.",
      "helpful_votes": 4,
      "publication_date": 20130724
    }
  ],
  "product_meta": {
    "title": "NITTO 180-830 Nitto (Series NT 555R DRAG) 305-35-20 Radial Tire",
    "description": "Always gauging distances a quarter mile at a time? The Nitto NT555R tire has the optimal dry performance you need to rack up drag wins, plus enough versatility for occasional street use. But don’t get the wrong idea – this tire isn’t like the others. It’s D.O.T.-compliant, so you know you’re getting a compound that’s tough enough for demanding track driving, and the stable contact patch provides the perfect footprint for hard launches. We have a winner.",
    "rating": 4.8,
    "feature_bullets": [
      "This product is not for sale in the state of Arkansas"
    ],
    "specifications": {
      "Manufacturer": "Nitto",
      "Brand": "Nitto",
      "Model": "NT555R",
      "Item Weight": "31.9 pounds",
      "Product Dimensions": "28.58 x 12.16 x 28.58 inches",
      "Item model number": "180-830",
      "Manufacturer Part Number": "180-830",
      "OEM Part Number": "180830",
      "Special Features": "Tread_wear_indicator",
      "Section Width": "305 Millimeters",
      "Aspect Ratio": "35",
      "Construction": "Radial",
      "Rim Diameter": "20 Inches",
      "Load Index Rating": "104",
      "Speed Rating": "V",
      "Tread Depth": "5 32nds",
      "UTQG": "100AA",
      "Bolt Pattern (Pitch Circle Diameter)": "1 Inches",
      "ASIN": "B013J8QZE4",
      "Customer Reviews": "4.8 out of 5 stars31 ratings4.8 out of 5 stars",
      "Best Sellers Rank": "#699,381 in Automotive",
      "Date First Available": "July 12, 2010"
    },
    "categories": [
      "Light Truck & SUV",
      "All-Season",
      "Automotive Parts & Accessories",
      "Tires & Wheels",
      "Tires",
      "Automotive"
    ],
    "price": ""
  }
}