{
  "website_summaries": [
    {
      "verdict": "A 3-piece set from a reputable brand, these best-selling cases are a solid investment.",
      "pros": [
        "The micro-diamond polycarbonate cases resist dents and scratches to keep them looking good through many trips",
        "They come with durable, expandable zippers and ultra glide wheels",
        "Super light yet sturdy",
        "They also sport TSA-compliant locks and a 10-year warranty",
        "Comes in a choice of 9 colors"
      ],
      "cons": [
        "You may have issues picking it out on the carousel – especially if black",
        "This is a more costly set of luggage"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "Durability with good looks and plenty of space.",
      "pros": [
        "As with all of Samsonite's 100% polycarbonate hardside luggage, this model is difficult to damage",
        "What's more, the expandable feature means this luggage can be your everything"
      ],
      "cons": [
        "Although the exterior is highly durable, once it becomes dented, repairing it can be a hassle"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "The only thing missing is a handle in the side ...",
      "text": "The only thing missing is a handle in the side to help when putting it and taking it out of overhead bins (not a deal breaker)",
      "rating": 4.0,
      "verified": true,
      "author": "sullynyc67",
      "helpful_votes": 173,
      "publication_date": 20160209
    },
    {
      "title": "Modern and smart looking suitcases. Great quality!",
      "text": "Great deal and package. I used the middle and small suitcases on my last trip and they didn't disappoint. Occasional scratch here and there but that's expected with a hard case and rough baggage handlers. They still look great. They look really expensive - i have gotten complemented on them. Very easy to travel with, spinner wheels are the best. I highly recommend this package.",
      "rating": 5.0,
      "verified": true,
      "author": "SWY",
      "helpful_votes": 122,
      "publication_date": 20170612
    },
    {
      "title": "Broke on first use!",
      "text": "Rarely write reviews, but I need to share on this. The top handle of the medium sized suitcase broke upon first use with only a 30 lbs inside. Unfortunately, the time between when I bought and first use was too long to return. I would expect more from Samsonite, where you supposedly pay a premium for quality.",
      "rating": 1.0,
      "verified": true,
      "author": "Shawn Sweeney",
      "helpful_votes": 51,
      "publication_date": 20180715
    },
    {
      "title": "Small suitcase arrived locked!",
      "text": "Great set of luggage! Durable. I didn't give it more stars (and I probably would have given 5) because the smallest suitcase was delivered locked and I have still not been able to open it after 10 months. I have tried numerous times to contact Samsonite to no avail. I gave them the serial number of the product which they asked for but then nothing has been done. Very disappointed in customer service!!",
      "rating": 1.0,
      "verified": true,
      "author": "Julia",
      "helpful_votes": 38,
      "publication_date": 20181006
    },
    {
      "title": "Great set. Holds a lot of stuff. Love the carry on.",
      "text": "Items got here quick. The set looks great. It's built very well and sturdy. The wheels roll nice and smooth. The 28 I was able to get 70 lbs in it. The 24 got 43 lbs. The 20- the carry on fits prefect in the over head. The carry on, I think is the best item. When walking down the those tiny aisle on the plane, you don't have to carry it at all. The four spinner wheels roll nice and smooth when getting on or off the plane, especially if you have a lot of stuff.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 198,
      "publication_date": 20160311
    },
    {
      "title": "Great, durable bag that has now made it through ...",
      "text": "Great, durable bag that has now made it through around 25-30 flights since I bought it- still going strong and no signs of significant wear or damage. I travel weekly - and this has been very dependable and great at keeping my clothes dry when its been out in the rain. Highly recommend for the frequent traveler.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin F.",
      "helpful_votes": 61,
      "publication_date": 20170318
    },
    {
      "title": "Lightweight and affordable option",
      "text": "3 1/2 stars. PROS: I like the size, weight (very light), the amount of stuff I can pack, the zippered compartment, it's expandable. It still looks good after several uses, including a 6 week trip to Europe (where we did laundry about once a week). CONS: There's no side or bottom handle so it can be hard to lift or carry just using the handle on the top. The telescoping handle feels a bit weak.",
      "rating": 3.0,
      "verified": true,
      "author": "library girl",
      "helpful_votes": 39,
      "publication_date": 20171202
    },
    {
      "title": "Don't buy it!",
      "text": "I thought the 4.5 rating outweighed the negative reviews, but I found out firsthand it doesn't. Mine arrived on Wednesday and I used it Friday to pack lightly for a weekend road trip. I loved the color and the weight and the wheels were smooth. As stated in other reviews, the pull out handle is flimsy, and the top inside lining zipper was broken. Even so, because of the price and other features, it would have been okay had the top handle not broken. As you can see, the suitcase was not fully or heavily packed, yet the second time I lifted it using the handle, one side of the handle came completely off the suitcase!",
      "rating": 1.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 21,
      "publication_date": 20190729
    },
    {
      "title": "I cannot believe my luggage fell apart on my first ...",
      "text": "I cannot believe my luggage fell apart on my first trip. I wonder whether it has any wanrranty from samsonite.",
      "rating": 1.0,
      "verified": true,
      "author": "Lisa",
      "helpful_votes": 38,
      "publication_date": 20170813
    },
    {
      "title": "Lightweight, but not durable",
      "text": "I purchased this suitcase to transport a large bulky costume in. The costume fit just fine since this case is quite large. Unfortunately, on the return journey of the first aircraft trip I took the polycarbonate side was cracked open and water leaked in and damaged items of mine. I expect rough treatment by airlines but I feel that either I got extremely unlucky or this suitcase isn't up to muster thanks to the quest for minimal weight. I would expect a hard-side case to last through more than one instance of abuse? People buy hard-side cases to protect their items and I don't feel like you can be confident in this suitcase after my incident.",
      "rating": 3.0,
      "verified": true,
      "author": "D. Irwin",
      "helpful_votes": 100,
      "publication_date": 20161213
    },
    {
      "title": "Excellent suitcase!",
      "text": "Bought this for a recent trip (flights and cruise) which required a lot of baggage checking and handling. Suitcase looks brand new upon our return. The \"dimpled\" surface reduces marks and scars as advertised. Color is beautiful, not too bright, just rich looking. Easy to pack, and nice quality. We added a two-way baggage strap (BlueCosto (Black) Heavy Duty Long Cross Luggage Strap Suitcase Travel Belt Non-slip 600001-BLK) to add to security, stability, and aid in easy identification at baggage claim. Lightweight which gives you an opportunity to pack more stuff or souvenirs. Rolls easily. Very happy with the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "LLM",
      "helpful_votes": 18,
      "publication_date": 20170915
    },
    {
      "title": "Price stiff and quality of material is poor.",
      "text": "Used it once, zipper of the two suitcases already broke. Price stiff and quality of material is poor.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 19,
      "publication_date": 20180114
    },
    {
      "title": "I would not recommend. Small suitcase which I use regularly barely rolls ...",
      "text": "I would not recommend. Small suitcase which I use regularly barely rolls and with laptop bag on top does not roll at all. Larger suitcases which I use less frequently are in good shape but use them once a month vs weekly. Very disappointed with smallest bag and it’s duability.",
      "rating": 1.0,
      "verified": true,
      "author": "Christine Sudmalis",
      "helpful_votes": 17,
      "publication_date": 20180531
    },
    {
      "title": "The best and most versatile bags there is",
      "text": "The best and most versatile bags there is. We went on a 30 day trip to India to many states and the design on this is number one. Its twin the Winfield which we also bought was a disaster. So much damage due to the material not being able to handle international travel in planes.",
      "rating": 5.0,
      "verified": true,
      "author": "Reuben Kanhai",
      "helpful_votes": 62,
      "publication_date": 20160319
    },
    {
      "title": "That said it is sturdy (so far) with good wheels and it is light ...",
      "text": "WARNING The suitcase in the picture is not the suitcase you will receive. The suitcase in the picture has a handle on the side by the TSA locks. The suitcase you will receive does not have a side handle. This is a major annoyance if you are a road warrior and use this regularly. I've used mine three or four nights a week for the last five weeks with lots more travel to come. That said it is sturdy (so far) with good wheels and it is light weight. With a good set of packing cubes I can take it out for a week. And the price is right if it holds up. But I really miss that extra handle!",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 12,
      "publication_date": 20180608
    },
    {
      "title": "Round Trip Overseas twice and still going strong",
      "text": "This 28\" version and it's 20\" companion have been taken on planes to the Philippines round trip twice now and have shown no signs of wear and tear. We are very pleased with this purchase and would definitely recommend it for long trips. The wheels and handle make them very easy to maneuver in the airport, which is great 'cause we all know how stressful a crowded airport can be.",
      "rating": 5.0,
      "verified": true,
      "author": "The_Phantom",
      "helpful_votes": 9,
      "publication_date": 20180724
    },
    {
      "title": "Cheap luggage",
      "text": "Cheaply made for Samsonite. Not only is there a zipper broke but I found duck tape inside on one of the corners...what the?! So disappointed after looking for hours at luggage online, ugh!!",
      "rating": 1.0,
      "verified": true,
      "author": "Stephanie",
      "helpful_votes": 63,
      "publication_date": 20170503
    },
    {
      "title": "Use this product on a bi-weekly basis. When unzipped ...",
      "text": "Use this product on a bi-weekly basis. When unzipped for extra space, it meets overhead requirements for the JetBlue, United, and Spirit (these are the only flights I have been on so far with it. Also sat directly on this bag during a 45 minute subway ride because there weren't any seats. Very reliable travel companion!",
      "rating": 5.0,
      "verified": true,
      "author": "Tyler",
      "helpful_votes": 30,
      "publication_date": 20170115
    },
    {
      "title": "Irreparably broken zipper on 3rd trip",
      "text": "The luggage looks nice and is spacious. We have traveled with it for 3 different trips now, and it worked well until our last trip. The zipper irreparably broke on the medium piece on our last return trip. This caused the contents of our luggage to dump out at the airport which caused damage and loss to our items inside (e.g. baby monitor camera). Besides the cost of buying more luggage and a new baby monitor system, the worst part was trying to lug the broken suitcase to the car without dumping out what was in it. The zipper should not have broken after only a handful of flights. Samsonite's website says they don't cover these types of damages.",
      "rating": 2.0,
      "verified": true,
      "author": "Andy",
      "helpful_votes": 5,
      "publication_date": 20190721
    },
    {
      "title": "Not my first and not my last",
      "text": "Got the luggage for an international trip. This is not my first samsonite luggage and won’t be the last. I like how lightweight it is and sturdy. The non-scratch surface is pretty good but honestly, unless your luggage is made out of diamond, it will get scratches no matter what. I am okay with it as long as it doesn’t look horrible. The luggage is easy to clean. I always clean my checked bags because who knows what’s in the cargo area! The hard shell makes it possible to clean thoroughly and dry fast. Fast shipping and no issue at all.",
      "rating": 5.0,
      "verified": true,
      "author": "Alice",
      "helpful_votes": 9,
      "publication_date": 20171214
    },
    {
      "title": "After 2 years, my luggage has gone kaput",
      "text": "I purchased this summer of 2017. I’m writing this review now because my luggage has finally taken its last breath and I need to find a new one. I imagine that after 2 years with about 8 trips, lugging this bad boy across airport parking lots, and especially being tossed around by TSA, I’ve gotten my money’s worth. Now, the structure of the bag is 100% in tact. The parts that have given out are the TSA lock and especially the poor wheels. It’s impossible to trolley around at this point since 2 of the wheels are stripped. All in all, this is a great piece of luggage and will protect your items very well during travel.",
      "rating": 4.0,
      "verified": true,
      "author": "Tracey H.",
      "helpful_votes": 3,
      "publication_date": 20190619
    },
    {
      "title": "First off this was crazy stupid insanely cheap",
      "text": "First off this was crazy stupid insanely cheap. I went to the Samsonite outlet near me, similar products are selling today for $190 or more for just the large piece. I bought this for $244 for the whole set. Seems pretty nice. The polycarbonate seems like it should hold up well and not be too susceptible to scratches. Very light - If I had to guess about 50% lighter than my 10 year old soft side Samsonite suitcases. The reason why it would be 4 stars right now if it wasn't for the incredible price: --Seems alarmingly flimsy. --Has one small pocket and then a separated area in the lid portion.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew",
      "helpful_votes": 7,
      "publication_date": 20170831
    },
    {
      "title": "I was impressed with the generous interior size and the suitcase itself is very light making it very easy to handle even when fu",
      "text": "Medium sized suitcase survived planes, trains and automobiles on its first outing without a scratch. I was impressed with the generous interior size and the suitcase itself is very light making it very easy to handle even when fully packed. Easy to steer and even easier to spot on the baggage carousel. Definitely can't beat the Amazon price either!",
      "rating": 5.0,
      "verified": true,
      "author": "shookie",
      "helpful_votes": 19,
      "publication_date": 20160518
    },
    {
      "title": "SUITCASE BROKE ON DAY 1",
      "text": "The handle of the suitcase broke as I arrived at the airport and lifted it to weigh it for the first time. It was under 50 lbs, so it was not a weight issue. I had purchased the ASURION protection plan based on other reviews, but the one that was offered when I purchased these did not cover one suitcase. So now I'm stuck with one broken suitcase out of a set of 3. VERY FRUSTRATED AMAZON CUSTOMER!",
      "rating": 1.0,
      "verified": true,
      "author": "VG Chicago",
      "helpful_votes": 7,
      "publication_date": 20181120
    },
    {
      "title": "Best.Luggage.Ever!",
      "text": "Best luggage I have ever owned. They have held up well to our adventurous international travel. Dragging them through the airport. Checked baggage horrors of rough handling. Hopping on and off trains and buses. Rolling them several blocks down sidewalks in search of our hotel. They rolled relatively easy in any direction. So glad I chose this set. Love it!!",
      "rating": 5.0,
      "verified": true,
      "author": "OkieGirl",
      "helpful_votes": 11,
      "publication_date": 20161213
    },
    {
      "title": "Wheel broken after only a few uses -- very poor quality bag",
      "text": "I have only used this bag a few times -- and purchased it less than a year ago -- but already a piece of one of the wheels has broken off, meaning that it is very difficult to roll, and basically unusable. Very disappointing, as I expected better from Samsonite. Looking over some of the other reviews, it seems like this is not an uncommon problem. Buyer beware.",
      "rating": 1.0,
      "verified": true,
      "author": "Ashley",
      "helpful_votes": 28,
      "publication_date": 20170429
    },
    {
      "title": "HUGE DISAPPOINTMENT!!!",
      "text": "IF I COULD GIVE THIS A 00 STAR RATING, I WOULD!!! I purchased this luggage set based upon the Samsonite name brand. This purchase has been the BIGGEST disappointment! I used the largest suitcase to attend a work conference. It seems as if the wheels are too small for the suitcase which makes it is very difficult to navigate on carpet. I hurt my shoulder trying to move the suitcase from my room to the elevator of the hotel! I requested a refund from the seller and no response was received! BUYERS BEWARE!!!",
      "rating": 1.0,
      "verified": true,
      "author": "N Sandy",
      "helpful_votes": 5,
      "publication_date": 20190320
    },
    {
      "title": "Great set at a great price- but I think mine was faulty",
      "text": "Super happy. Great set for a great price.... 2nd part of the review I just went on a 3 week trip to Bali and took one of the sets. The suitcase made it. It did have scratches which I expected but I was really bummed out when I had to brake the lock. I had the code working just fine and when I arrived at my first destination, it wouldn’t open... I was desperate and googled videos on how to reset code when locked- no luck. (Limited supplies where I was) so I had to jam it open. I know I didn’t forget the combination- it just did t want to open",
      "rating": 3.0,
      "verified": true,
      "author": "305fun",
      "helpful_votes": 3,
      "publication_date": 20180701
    },
    {
      "title": "Too big for my preference, will go for the 25\"",
      "text": "It's a good product. Looks stylish. Love the lock. Lightweight. However, I returned it because I felt it was too big for a checked bag on a flight. It's a personal preference. Dimensions may be slightly over the 62\" max requirement, plus it gets to 50lbs even when it's 50% full. I'm going to downsize and buy the 25\" checked instead, which I'm sure I can fill it to 50lbs worth. Note: I didn't know returning a product is not free, plus I accidentally threw out the box and had to pay for that too, both on the returning end, and on the reimbursement end also!",
      "rating": 4.0,
      "verified": true,
      "author": "S. K.",
      "helpful_votes": 0,
      "publication_date": 20200314
    },
    {
      "title": "Light and durable; Amazon used-like new in perfect condition",
      "text": "I bought two of these from Amazon Warehouse in \"used-like new\" condition and they are both truly nearly mint condition. One has the tiniest scratch on it that I could get from just loading it in the car, let alone checking it with an airline. They are roomy and super light. The wheels are super slick and make it maneuverable. Pretty durable luggage, but the somewhat thin sides could potentially get bent if there wasn't anything inside countering the inward pressure.",
      "rating": 5.0,
      "verified": true,
      "author": "KH",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "One use and the lock broke.  ONE!",
      "text": "One use and the lock broke. That's pretty pathetic. And trying to call or chat for help with warranty repairs if the luggage is in another country is really pointless. They just keep passing you to someone else.",
      "rating": 1.0,
      "verified": true,
      "author": "tg4web",
      "helpful_votes": 7,
      "publication_date": 20181101
    },
    {
      "title": "Nice looking luggage! Wheels could be better...",
      "text": "Took this suitcase to Spain, Portugal, and Morocco for almost 3 weeks! Just a few scuffs but it held up just fine. The rolling is a bit of a struggle when the floor is not a smooth surface so I'm docking a star. Overall, I do like the overall look of the suitcase and the sturdiness of the outer shell. It's also quite roomy inside especially when expanded.",
      "rating": 4.0,
      "verified": true,
      "author": "Sandra",
      "helpful_votes": 7,
      "publication_date": 20170618
    },
    {
      "title": "3 piece set, Caribbean Blue (not).  Great luggage - Color WAY off",
      "text": "Great luggage - Colors are WAY off. I love the 3-piece set I got. The only downer is that the color - Caribbean Blue - looks nothing like what is pictured online. I love the online color, which is a bright sea blue. What you get is something that is a very dark turquoise - accent on the VERY DARK. Really looks more like a medium dark green than anything else. Nothing like pictured. Which is too bad. I have a Samsonite cosmetic case that IS that color. So, it doesn't match. Wish I could get it in the actual color in the description.",
      "rating": 4.0,
      "verified": true,
      "author": "AStricklin",
      "helpful_votes": 0,
      "publication_date": 20191004
    },
    {
      "title": "Love these suitcases",
      "text": "This set is a perfect set of 3 sizes of suitcases. It is all you would ever need for traveling. I am getting older, and even the 2 wheeled luggage is sometimes hard to manage. These are easy to roll,light weight, and yet seems to have plenty of room. The locking mechanism is supposed to be TSA approved. I am afraid to use it. The directions came in the form of a picture, which is not clear to me. Perhaps younger people could figure out how to use it, but I could not. Better directions would have been appreciated.",
      "rating": 5.0,
      "verified": true,
      "author": "Debby A. Dillon",
      "helpful_votes": 2,
      "publication_date": 20181202
    },
    {
      "title": "My favorite luggage ever!",
      "text": "This is the first set of luggage I've ever bought myself. I lugged these bags all over Europe and the U.S. in planes, trains, and automobiles, and they have held up phenomenally. The smallest bag is great as a carry-on for most American airlines, but has to be checked on many of the European ones. Make SURE you check the allowable measurements anytime you fly. I love the Caribbean Blue, too. It really stands out in the countless black suitcases on the carousel.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristen",
      "helpful_votes": 3,
      "publication_date": 20190828
    },
    {
      "title": "This bag was small enough to fit on all the trains in those European countries and it was able to fly easily on all of the airlines I used",
      "text": "I used this suitcase to take to France, Italy, Spain and several trips within the United States. This bag was small enough to fit on all the trains in those European countries and it was able to fly easily on all of the airlines I used. I find it to be very lightweight considering that it is hard sided luggage. The wheels have held up great to several miles of pulling it through the streets of Europe and here in the USA. The handle is sturdy. When you expand the luggage it gains a ton of extra space. The bag looks good too.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeffrey",
      "helpful_votes": 3,
      "publication_date": 20180307
    },
    {
      "title": "Works well and seems robust enough to last more than a few years.",
      "text": "Took this on a 2 week trip in Japan where we stayed in 3 cities. Took it on planes, trains and buses. Replaced a cheap spinner that would tip over easily. This was very stable compared to our previous spinner. Only downside is that the wheels are a little small, so it would sometimes get hung up on the larger cracks on the walkways and was a little difficult in any carpet that's more plush than your standard office carpet. The handles is sturdy and doesn't have any excess give.",
      "rating": 4.0,
      "verified": true,
      "author": "Gelo",
      "helpful_votes": 3,
      "publication_date": 20180907
    },
    {
      "title": "Check for ALL Parts to the Lock",
      "text": "I ordered this about 3 weeks ago for an upcoming trip and saved ALL packaging. Set it aside and began packing today. Went to use the built in lock and realized the connector strap is missing. Will be using my own lock now. Since I saved all packing in case of a return I was able to check and see that the part was truly missing as was any booklet to explain how to use it. I’ll add to this review onceI know how it fares on my trip.",
      "rating": 3.0,
      "verified": true,
      "author": "Steelermaven",
      "helpful_votes": 0,
      "publication_date": 20200124
    },
    {
      "title": "Very disappointed as the suitcase is now useless",
      "text": "Gorgeous suitcase. Unfortunately it cracked/broke somehow while traveling back home from our second trip using it. Very disappointed as the suitcase is now useless. Not the kind of quality we're used to with Samsonite and had just purchased this to start replacing older ones.",
      "rating": 1.0,
      "verified": true,
      "author": "Lori Thompson",
      "helpful_votes": 8,
      "publication_date": 20171203
    },
    {
      "title": "Very light weight, rolls butter smooth.",
      "text": "This luggage set is pretty practical and looks really nice. They are a shell that opens like a clam. There is a pocket on one side of the luggage to store shirts or pants in. The rest of the luggage is pretty much open so you can store all your things. It definately doesn't have the organization system other suitcases may have, but this thing is LIGHT!. The wheels roll buttery smooth. My only concern is that they are made out of a hard plastic like material. I can see the wheels wearing down if pulled across rough surfaces very often. Other than that, I am very happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Debounce",
      "helpful_votes": 0,
      "publication_date": 20200305
    },
    {
      "title": "Cute, lightweight, durable",
      "text": "This was our fourth piece from this line. I am a travel advisor so I end up traveling about once a month. We love it because of how lightweight yet durable it is. I love that onside you can zipper off one side of the compartment. I also like that it comes in bright colors and stands out from the boring dark colored bags on the conveyor belt at the baggage claim. It is a great choice!",
      "rating": 5.0,
      "verified": true,
      "author": "C Burriss",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "Solid luggage",
      "text": "I initially bought this for an overseas trip to Japan. The color is beautiful & was easy to spot during luggage claim. The textured outer shell held up nicely, as I returned home from a 2 week trip with no scratches or dings. This is my fault for not having proper expectations, but the size was a bit bigger than what I was initially looking for...as in too spacious. I had to pack a flat pillow to keep my things from sliding around. Again, that was my fault for misjudging the size. For my next trip, I would probably get the same model in the next size down.",
      "rating": 5.0,
      "verified": true,
      "author": "KKN",
      "helpful_votes": 3,
      "publication_date": 20170913
    },
    {
      "title": "Warranty Information Not Easily Found",
      "text": "I ordered this complete set in 2018 - have only used them several times - but as I prepared for my next adventure I see one of the wheels is pushed in to the luggage - making it inoperable. Cannot find any information regarding the warranty on the Amazon site - very frustrated. The product information claims a 10 year warranty on the product for workmanship - but good luck finding any information as to how to file a claim.",
      "rating": 1.0,
      "verified": true,
      "author": "Mike Mier",
      "helpful_votes": 2,
      "publication_date": 20190930
    },
    {
      "title": "Economical Carry-On Suitcase",
      "text": "Pros: Lightweight, affordable (I bought for ~75 USD), rolls smoothly, fit and finish seem good, color options, built in TSA approved combo lock Cons: the poly-carbonate seems quite thin and can bend inward easily (don't put anything crushable near the corners when packing), the silver is much brighter in person than in the pictures online, no side luggage handle In general I like this suitcase, it looks like it will do a great job allowing me to pack carry-on luggage while traveling. However, time will tell as to the durability of the lightweight materials used in construction. At this point, I would buy it again.",
      "rating": 4.0,
      "verified": true,
      "author": "Jon J.",
      "helpful_votes": 0,
      "publication_date": 20181017
    },
    {
      "title": "It is a sturdy basic, but it lacks compartments and the wheels are terrible!",
      "text": "I've had this bag for 2 years now. The outside shell has held up very well. It also expands tremendously which is great! However, the wheels are TERRIBLE. They're so tiny and hard to maneuver and if your bag has any sort of weight then they will grind down and disappear within a couple of months. Also, the inside of the bag is SUPER basic. There are no compartments or anything, just two giant spaces for your items.",
      "rating": 3.0,
      "verified": true,
      "author": "Michael George",
      "helpful_votes": 3,
      "publication_date": 20190917
    },
    {
      "title": "Get 3rd party straps to support zippers",
      "text": "When I got these, I was skeptical if they would survive international travel with 50 lbs. of belongings in each. Glad I read about the weak zippers splitting open in transit (there are no real metal latches to hold them together, just the teeth of the plastic zippers). Purchased elastic straps in advance, use of which I am convinced saved my luggage during international travel involving baggage handlers at 4 airports.",
      "rating": 4.0,
      "verified": true,
      "author": "WDJ",
      "helpful_votes": 3,
      "publication_date": 20180505
    },
    {
      "title": "Nice color, seem durable.",
      "text": "The \"burnt orange\" color is nice: my husband called it \"metallic terra-cotta.\" We will see how this holds up over the next 2 months -- I have two flights and two car trips -- in which I'll use all three of these cases. They seem flexible enough to endure a bit of punishment, and as long as they don't sustain any major dents, I'll be fine. They are actually lighter than my cloth suitcases, which is a plus. I'll update after my trips if these do not function well.",
      "rating": 4.0,
      "verified": true,
      "author": "Cayla B.",
      "helpful_votes": 4,
      "publication_date": 20170626
    },
    {
      "title": "Can you even buy a super durable suitcase anymore?",
      "text": "Good quality on the surface, this appears to be as sturdy and well made as the $250 Samsonite version sold in the department store. Held up to our first flight. Seems to hold about 30lb. of stuff with no problem. But really, all these new roller 'hardside' suitcases are made of this thin cheap plastic that flexes easily, and after a trip they all seem to have white plastic fatigue marks in them from where they were thrown, so who knows how long this will hold up?",
      "rating": 4.0,
      "verified": true,
      "author": "C. Frederick",
      "helpful_votes": 2,
      "publication_date": 20180820
    },
    {
      "title": "Shoddy packaging/shipping?",
      "text": "The box arrived slightly mangled and barely taped shut on one edge. When opened and pulled it out, one side of it had been jammed into the other peeling back the black plastic lip that goes around the edge of the luggage. Inside everything seemed to be fine, although I noticed that the lining zippers didn't actually have a tab to pull on them, will have to rectify that with small keyring or the like. Ultimately, I figured this wasn't worth trying to get a return or replacement on the product so we'll see how it holds up.",
      "rating": 3.0,
      "verified": true,
      "author": "Jason Kientz",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "Durable and Functional",
      "text": "The set looks great. It's built very well and sturdy. The wheels roll nice and smooth. You don't have to carry it at all. The four spinner wheels roll nice and smooth when getting on or off the plane, especially if you have a lot of stuff.",
      "rating": 5.0,
      "verified": true,
      "author": "Rice",
      "helpful_votes": 7,
      "publication_date": 20170625
    },
    {
      "title": "Yay wheels and handle",
      "text": "I am very happy with this suitcase. Having traveled many times with traditional suitcases, this one with handle and wheels was a 100% improvement. I purchased this suitcase, as I no longer do carry-on when traveling. Tired of fighting for an overhead bin and retrieving my bag is faster then it used to be.",
      "rating": 5.0,
      "verified": true,
      "author": "Lynne Lukasunis",
      "helpful_votes": 22,
      "publication_date": 20160819
    },
    {
      "title": "Recommend",
      "text": "Happy with purchase, suitcase is functional and survived my Europe trip. Is light, a bit softer than expected, but since even fragile decorated Easted egg shells made it through airline checked luggage without harm, I have no complaints. Handle could be longer for us tall folks. Keeps things tidy and organized. Good price!",
      "rating": 5.0,
      "verified": true,
      "author": "I. Schmidt",
      "helpful_votes": 6,
      "publication_date": 20170415
    },
    {
      "title": "High quality, very pleased",
      "text": "So far, so good. The medium size is great for a weekend away for 2. Wheels operate smoothly, lightweight, easy to set up combination locks, The hard shell, is not a hard, brittle plastic, it has a little give to the shell, which I would think helps prevent cracking when its handled not so carefully when you have to check your luggage. 1 side on the interior has straps to keep clothing in place, the other side has a mesh panel that zips to cover the entire area, I love this feature, works to keep smaller items, like blow dryer, or toiletries from shifting.",
      "rating": 5.0,
      "verified": true,
      "author": "Bonnie Williams",
      "helpful_votes": 3,
      "publication_date": 20171023
    },
    {
      "title": "Locking Zippers protrude off the side.",
      "text": "This is supposed to be a carry on bag but united airlines wouldn't let me carry on! Charged me $30 Disappointed! Overall seems well made Moves easily. Carried seven days of clothes with hygiene. All hot weather clothes and long sleeve fishing shirts. I over packed! Still had room. The only thing I noticed is the zipper lock protrudes from the corner and already hit a few things just going on one trip. I hope in the future it doesn't get broken off. But Alot better that shouldering a large duffle bag running into people looking like a tourist!",
      "rating": 5.0,
      "verified": true,
      "author": "James B.",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "Our New Samsonite Omni PC HardSide Luggage Is Awesome 😎",
      "text": "The Samsonite Omni PC HardSide luggage that we ordered back in November 2019, is durable, light weight, easy to maneuver with the 360 wheel capability and made of quality materials. My family & I took it with us on a trip to Portland and it held everything we needed. We will be utilizing this suitcase for all of our international trips in the near future. Purchase with no cares in the world, My fellow “Amazon Shoppers”, you won’t be disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "Patricia5000",
      "helpful_votes": 0,
      "publication_date": 20200422
    },
    {
      "title": "Stylish, Lightweight and Simple",
      "text": "Got these because I travel a lot and polycarbonate is supposed to be the most durable. I have had many suitcases in the past for a year and then they had to be thrown away because they broke. I will write an update after a couple of flights. I got the gray color and they were more light gray/silver than what was pictured in the picture but I don’t mind. They are stylish and lightweight and I like the TSA lock feature because my locks have been broken in the past by TSA.",
      "rating": 4.0,
      "verified": true,
      "author": "Mina",
      "helpful_votes": 0,
      "publication_date": 20201016
    },
    {
      "title": "Spacious and very sturdy. We traveled internationally with the right after I ...",
      "text": "Spacious and very sturdy. We traveled internationally with the right after I purchased them and could not be more please with how well they did. I love the color too because it makes it easier to pick them out from the endless black bags on the luggage carriers. The only downside is that it doesn't come with instructions on how to set the combination locks.",
      "rating": 5.0,
      "verified": true,
      "author": "Paula Applegate",
      "helpful_votes": 9,
      "publication_date": 20160808
    },
    {
      "title": "It's only the fourth time that I used it after ...",
      "text": "It's only the fourth time that I used it after I purchased it, and it breaks. One roller become completely not rollable.",
      "rating": 1.0,
      "verified": true,
      "author": "Darren Ma",
      "helpful_votes": 179,
      "publication_date": 20160509
    },
    {
      "title": "Poor maneuverability",
      "text": "I was hoping for a bit more from Samsonite. It was super lightweight & the exterior stood up to 3 weeks of traveling through Europe on multiple trains & flights, however it was very hard to maneuver. I was cursing the luggage as I was traveling. It has only 4 spinner wheels which make it hard to travel with. I can back home to pack for a short trip and used my smaller CalPak luggage that has 8 wheels and I realized that’s what I was missing from this Samsonite luggage. I wish I could have returned this luggage, but by the time I came home the return window had closed. Disappointed ☹️",
      "rating": 3.0,
      "verified": true,
      "author": "sarah-cate davis",
      "helpful_votes": 0,
      "publication_date": 20200303
    },
    {
      "title": "If frequent traveler splurge for spinners w 2 wheels",
      "text": "It is very difficult to roll on all 4 wheels. Ends up being an arm work out to keep it up right. I typically put my backpack on top of it which makes it very inconvenient to roll on 4 wheels. Wish I would have splurged for the Away Suitcase or one with two wheels. I travel to 1-2 different states per week and this doesn’t cut it for me.",
      "rating": 2.0,
      "verified": true,
      "author": "Cameron",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "Super light and the wheels roll like a dream!",
      "text": "So glad I bought this set of luggage! I am a road warrior and was really hesitant to switch from soft side to hard side luggage. But, boy am I glad I did! The luggage is super light and the wheels roll like a dream, (no matter how full I pack them). Additionally, the set has effortlessly withstood my multi week flights and the associated airline handling abuse. One downside, but not a deal breaker. There is not enough pockets in the interior. But I solved it quickly by using my Amazon packing cubes. My husband will be making the switch next!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190322
    },
    {
      "title": "Nothing more than fine.",
      "text": "We've used it on 3 trips, including one half-way around the world. Did not know this was possible, but there is no handle on the side of the bag, which we did not realize until trying to check it. Not fun getting it on the belt when they want it on its side. Also not fun while rearranging the luggage puzzle in a car. ;) The other drawback was when my husband pinched his hand from the handle collapsing and got a blood blister. It is a perfectly fine little case, but not 100% worthy of the Samsonite brand.",
      "rating": 4.0,
      "verified": true,
      "author": "C. Caldwell",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "Love this luggage!",
      "text": "I finally feel like I have grown-up luggage. Love the color, and it feels really well made. Have done two road trips with it quite successfully, will be flying with it twice in the next 6 months. Wheels do not roll well on med. or deep pile carpet or rough outdoor surfaces, but I don't care - I only care how well it rolls through an airport, and it does beautifully on tile, low pile carpet, asphalt and sidewalks. My husband likes it so much, he just ordered a silver one.",
      "rating": 5.0,
      "verified": true,
      "author": "Shanna A",
      "helpful_votes": 0,
      "publication_date": 20181205
    },
    {
      "title": "Great suitcases for multiple international trips!",
      "text": "I bought these suitcases to fly internationally. I have flown twice internationally with them and plan to use them again in a few weeks. I packed them to exactly 50 pounds apiece and checked them both times and at the end they came back to me in one piece and look brand new. As someone who flies internationally several times a year it says a lot about a suitcase that it can fly internationally at 50 pounds and come back to you in the same condition. I approve of the suitcases we shall see after a few more trips how they do.",
      "rating": 5.0,
      "verified": true,
      "author": "lexie",
      "helpful_votes": 0,
      "publication_date": 20200915
    },
    {
      "title": "Durable and light",
      "text": "We have made numerous trips with these luggage and they're still holding up really well. We've taken at least 15 flights total (both long and short). The orange color is the cheapest option and actually such a pretty deep orange color AND most importantly, can be identify easily!",
      "rating": 5.0,
      "verified": true,
      "author": "Van N.",
      "helpful_votes": 2,
      "publication_date": 20190829
    },
    {
      "title": "Great size and smooth operation",
      "text": "Bought three of these for a 10 day trip to Italy. They are the perfect size for about 4 days of clothing, a jacket and an extra pair of shoes. With the zippers all closed, they can easily be carry-on but when you expand them, they can easily fit a lot more stuff. Durable. Good handles and love the spinner wheels. **UPDATED MARCH 2017** So this is now my go-to bag for even for short business trips. I throw in my laptop and don't hesitate to bring my workout clothing because of space. It easily fits in even smaller planes (not twin-props). It has taken a beating but looks as good as new.",
      "rating": 5.0,
      "verified": true,
      "author": "Erica J Rader",
      "helpful_votes": 14,
      "publication_date": 20160721
    },
    {
      "title": "Buy cheaper, it'll last longer",
      "text": "When you call their 1-800 customer service number, it's a recording saying there is a high volume of calls and will give you an email to send your info to, and then the call hangs up on you. The reply back from Samsonite is they'll get back to you within 7 business days. What a crock! They're not going to have my luggage fixed within two weeks... they're going to get \"back to me within two weeks!\" I've bought luggage at half the price and it's lasted 4x's longer! And when it did break, that manufacturer mailed me a new one with a return label the same week! Never again with Samsonite.",
      "rating": 1.0,
      "verified": true,
      "author": "Art Solis",
      "helpful_votes": 0,
      "publication_date": 20201013
    },
    {
      "title": "Liked it a lot",
      "text": "I really liked traveling with the suitcase. I felt like I packed a lot in it and loved having two sides to pack in instead of one deeper with just pockets on the other side. The suitcase itself is a little heavy but probably because it isn't cloth like my old set was. I loved the wheels and on hard floor it was super easy to maneuver but it took more effort when I was on carpeted areas. The handle feels a little loose and temperamental. If not for that, I would have given it 5 stars.",
      "rating": 4.0,
      "verified": true,
      "author": "Ria",
      "helpful_votes": 0,
      "publication_date": 20200201
    },
    {
      "title": "Sweet Looking Carry On!",
      "text": "I'm traveling with it for the first time this week but it looks great. Nice-looking materials and does not look cheap. Definitely high-quality so I'd recommend it based on its appearance and style alone. Looking at the other reviews, I'm not worried about the performance aspect either. I got the carry on size so I'm also not worried about it getting tossed around and/or dented. This was also about $60 cheaper than comparable Samsonite carry on luggages from Macys, so that's an extra plus.",
      "rating": 5.0,
      "verified": true,
      "author": "Pierre",
      "helpful_votes": 0,
      "publication_date": 20191014
    },
    {
      "title": "Good looking and great quality!",
      "text": "These suitcases were perfect for my wife while travelling internationally. The wheels are very smooth and making rolling them along very easy, even when they are stuffed full and heavy and rolling over the cobblestone streets that are common throughout Europe. They didn't get any scratches on them and felt very secure with the locking mechanism.",
      "rating": 5.0,
      "verified": true,
      "author": "Christofer Morrish",
      "helpful_votes": 6,
      "publication_date": 20161108
    },
    {
      "title": "Great 3-pc set, lightweight, strong, stylish, and Samsonite quality does not disappoint",
      "text": "We shopped around pretty heavily for a 3-pc. luggage set to replace our hodge-podge of old black bags and miscellaneous \"carry-ons\" that we've accumulated over the years (and no long qualify as carry-ons!). We chose a name brand like Samsonite mostly for the company reputation, but also with many positive reviews to back it up. We are VERY pleased with this set. Very lightweight yet strong, expansion zippers if needed, cavernous interiors, and super-freewheeling spinners. We bought this set in advance of a recent family vacation to the Caribbean, and it weathered the international flights with flying colors!",
      "rating": 5.0,
      "verified": true,
      "author": "Bruce Rodgers",
      "helpful_votes": 3,
      "publication_date": 20170921
    },
    {
      "title": "Quality Control needs improvement",
      "text": "Just got my brand new suitcase and discovered the zipper seam stitching inside is torn. Pretty disappointing, returning and contemplating if I even want to try a replacement. If I do, I'll update this review. Update: revised from 2 stars to 4. I received my replacement and everything looks good. Though, it's kinda strange the replacement came in a different box and had different looking materials included than the original detective unit I received.",
      "rating": 4.0,
      "verified": true,
      "author": "801Jones",
      "helpful_votes": 3,
      "publication_date": 20170716
    },
    {
      "title": "Great piece of luggage, but arrived damaged",
      "text": "This is a great, lightweight piece of luggage. Scratch-resistant may be a bit of an overstatement, however. My item was delivered in packaging that was much too flimsy, and had a big gash through a corner. Whatever tore open the box also scratched the heck out of the luggage. No time to exchange it, sadly. Another problem is the instructions for the TSA combo lock. The instructions have no words, only images. And the images do not match the actual lock. With a little intuition, you can figure it out, but they ought to give you the correct instructions with some actual words in them.",
      "rating": 5.0,
      "verified": true,
      "author": "MC",
      "helpful_votes": 0,
      "publication_date": 20200615
    },
    {
      "title": "it is built with quality and has some nice features I really enjoy (zipper mesh for one side",
      "text": "I've used this on 4-5 roundtrip flights already, and it has held up with minor scratches and abrasions. While not cheap, it is built with quality and has some nice features I really enjoy (zipper mesh for one side, expandable option, etc...). It rolls great on two wheels or four. I would definitely buy this product or a larger/smaller version agin!",
      "rating": 5.0,
      "verified": true,
      "author": "Joe",
      "helpful_votes": 4,
      "publication_date": 20180610
    },
    {
      "title": "Keep shopping this spinner doesn’t spin!",
      "text": "I travel every week and I needed a carryon spinner. I read the reviews of this suitcase and I thought it would be perfect. The wheels are to small and don’t roll easy at all. Even in smooth tile its s struggle to get this to move without torquing the handle. And don’t even get me started on when you put a briefcase on top it’s almost impossible to move. What a hunk of crap!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20181019
    },
    {
      "title": "A cheap suitcase",
      "text": "It is flimsy. The lock is cheap. Difficult to change the combination:. They show using a pen tip. You need a reset tool that comes with your phone. But it's weak. The overall case is equivalent to a street market suitcase. You're paying for a Samsonite brand. The wheels are cheap and don't have durability. I will use it for car trips but air travel. It won't make it through airports, baggage handlers. If you can get it on sale, which is what I got it for then buy it but don't spend more than $65.00. Not up to scratch.",
      "rating": 2.0,
      "verified": true,
      "author": "Caty",
      "helpful_votes": 0,
      "publication_date": 20190110
    },
    {
      "title": "Top handle failed on first use.",
      "text": "Upon first use the handle at the top of the bag broke and was useless. The bag was packed with a moderate load, well within normal checked bag limits. The side handle appears strong enough. There is no excuse for a design failure like this, especially with a bag of this size which can easily accommodate more than 50 lbs from a size standpoint. I have requested a refund, not replacement.",
      "rating": 1.0,
      "verified": true,
      "author": "J. Lowry",
      "helpful_votes": 2,
      "publication_date": 20180616
    },
    {
      "title": "The actual case is good but the handles are horrible",
      "text": "This is hands down the worst luggage I've have ever owned. This is my second review of this product. I have less than 20 pounds of luggage in it and the handle broke off again causing my stuff to fall down a flight of stairs.",
      "rating": 1.0,
      "verified": true,
      "author": "Travis Saylor",
      "helpful_votes": 6,
      "publication_date": 20180829
    },
    {
      "title": "Bigger than advertised. Width + Height + Depth 64.5 not 62.5 inches!",
      "text": "Product is larger than indicated. Ebags.com has the correct size on their web site. Most airlines accept 62 inches. Pretty sure 62.5 would not have been an issue. With 64.5 plus a huge looking bag, I am not so sure. Mine also came with a dent and looked like an item that had been returned before. However, I must say that this thing looked really well built and sturdy, especially given its huge size and low weight.",
      "rating": 3.0,
      "verified": true,
      "author": "Phil from Albuquerque",
      "helpful_votes": 0,
      "publication_date": 20190516
    },
    {
      "title": "Durable and awesome!",
      "text": "This review has been a long time coming. I ordered mine in July of 2016 and it is still in use today. It has accompanied me to Thailand, Canada, and Puerto Rico and I have to say I have no complaints. Actually, maybe one minor complaint: the handle wiggles a little; that's it. I ordered one for my boyfriend and he loves his too. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "JAragon",
      "helpful_votes": 2,
      "publication_date": 20180824
    },
    {
      "title": "Not worth the money",
      "text": "I wouldn’t spend this much money again on this set. The zippers have torn and I haven’t had them for 6 months.",
      "rating": 3.0,
      "verified": true,
      "author": "Rebecca Hertzel",
      "helpful_votes": 3,
      "publication_date": 20191002
    },
    {
      "title": "Good basic luggage...but not up to normal Samsonite quality!",
      "text": "I ordered this luggage set with the hope that getting a name-brand like Samsonite will offer a higher quality suitcase set. This luggage is nice looking but basic by Samsonite standards. The shell, handles, and zippers of the luggage seems flimsy and the interior lacks the organizational pockets seen in other (more expensive) Samsonite models. I ended up sending this set back without ever using it. This is probably a decent luggage set for occasional travel use but not for extensive or international travel.",
      "rating": 3.0,
      "verified": true,
      "author": "dpco25",
      "helpful_votes": 0,
      "publication_date": 20190927
    },
    {
      "title": "Just what I wanted...almost.",
      "text": "The size and color are just what I wanted but there is one area, about 5 inches long, where the zipper isn't fully attached to the 'fusliage'. There isn't enough time before my flight to gave it replaced. Since I will be using it as a carry-on it won't be submitted to the rough handling of the airline staff hopefully it will hold up.",
      "rating": 4.0,
      "verified": true,
      "author": "Norma L McBrayer",
      "helpful_votes": 0,
      "publication_date": 20191004
    },
    {
      "title": "Samsonite Omni PC suitcase is awesome",
      "text": "This is my third purchase as I have 2 others large bags. I like that you can get so many things inside that you gave to be careful not to overpack .Be sure to weigh the bag. Easy mobility. Taken many times , so far these hold up.",
      "rating": 5.0,
      "verified": true,
      "author": "Smiley",
      "helpful_votes": 0,
      "publication_date": 20200420
    },
    {
      "title": "A very good luggage set for price.",
      "text": "When one has to make a eleventh hour decision, it is difficult to make selection. I was wavering between Samsonite and Amazon brand. After reading lot of reviews, I decided to go with Samsonite. The product survived my trip to India and came back with everything intact. The material is durable, the wheels are easy to roll on hard floor and on carpets. The zipper is strong and easy to open and close. The built-in lock worked well on repeated open and close. The lift handles worked well. I used big and middle sized luggage bags. I did not use carry on. I am very satisfied with this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Bob99",
      "helpful_votes": 0,
      "publication_date": 20181006
    },
    {
      "title": "Considered “oversize” by airlines and costs a lit of money to put on the flight.",
      "text": "This suitcase size is considered “oversize” by the airlines, which I was not aware of, and they were going to charge $200 when I checked it just because of the dimensions. Be aware of airline dimensions for luggage before you buy. It’s a nice suitcase but I had to return it and get a smaller size.",
      "rating": 4.0,
      "verified": true,
      "author": "D. Elmore",
      "helpful_votes": 0,
      "publication_date": 20190924
    },
    {
      "title": "Perfect Little Suitcase!",
      "text": "I bought this suitcase to use as a carry on for a trip I'm taking to Scotland at the end of the year. I have yet to fly with it, but it's been fantastic for road trips so far. I was able to fit a week's worth of outfits into this suitcase along with toiletries, an extra pair of shoes, and a couple of novels. I rolled the case along some rather uneven and bumpy roads and it held up like a champ. I look forward to travelling again with this case!",
      "rating": 5.0,
      "verified": true,
      "author": "Sydney R. Colyott",
      "helpful_votes": 0,
      "publication_date": 20180822
    },
    {
      "title": "So far love this luggage set",
      "text": "We bought these for an International trip, well priced & really lightweight as per description !!! The colors are really very pretty & eye catching which is why we chose these because they're easy to spot in luggage claim. So far we really like them. On a side note I was a little surprised to see that one of them got a little banged up during the trip already. Hoping they last for a few years at least.",
      "rating": 4.0,
      "verified": true,
      "author": "Nafis",
      "helpful_votes": 0,
      "publication_date": 20200128
    },
    {
      "title": "Handle Ripped Off",
      "text": "We loved the color and look of the suitcases. We have only used them once. The rollers were great, zippers seemed durable. We still want to get a band as a secondary safety in case the zippers fail down the road. The only thing that bummed us out was that the top handle on the bigger suitcase ripped off during transit with the airline. We were disappointed the handles were not more durable and that it happened on the first outing.",
      "rating": 3.0,
      "verified": true,
      "author": "Todd S Grubb",
      "helpful_votes": 0,
      "publication_date": 20200304
    },
    {
      "title": "Handle Broke off 5-minutes Into Use",
      "text": "Bought two of these for an international trip and literally, as we were loading the suitcase into the taxi to go to the airport the strap broke. The driver tried the other strap and it promptly broke. Since we were on our way to the airport we had no choice but to continue on our 3-week trip with a broken suitcase. I would expect a better quality from Samsonite. The other suitcase held up just fine on the trip so we got 1 dud out of two. 50/50 odds on this suitcase.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180627
    },
    {
      "title": "Poor quality wheels and mechanics",
      "text": "I have been using this luggage monthly for about 18 months. The wheels are junk and had to be replaced. See photo of the flat wheel that I had to drag thru the airport and it scratched my hardwood floors. I have other cheaper luggage with better wheels. The handle jams all the time - won't slide into the bag without several forceful attempts. The description mentioned scratch resistant and mine were scratched after the first use as a carry on, so don't count on that attribute. The only positive is that they are lightweight.",
      "rating": 2.0,
      "verified": true,
      "author": "Ms. Manley",
      "helpful_votes": 0,
      "publication_date": 20191201
    },
    {
      "title": "Fabulous, Affordable Set!!!",
      "text": "I was skeptical after reading some of the reviews because I bought these for international travel, but they look as good as new after a 15-day trip to Europe with multiple luggage transfers. No dents, no scratches. I love that they have locks. Someone in a review mentioned there not being instructions for programming the locks- they did not come with instructions, but they were super-simple to find online. Google Samsonite and the model. Easy. I would absolutely recommend these to anyone looking for an affordable, durable luggage set! Buy with confidence.",
      "rating": 5.0,
      "verified": true,
      "author": "N. Sauta ",
      "helpful_votes": 0,
      "publication_date": 20190211
    },
    {
      "title": "Wheel broke on second use",
      "text": "I bought this suitcase in November 2018 after doing extensive research. Was very excited about it. Then on my second or third trip in June 2019, one of the wheels got jammed and worn down to the point where the only way to use it is to basically drag it like a box with a handle. Wish it was clearer how to activate the warranty.",
      "rating": 1.0,
      "verified": true,
      "author": "Martha S.",
      "helpful_votes": 2,
      "publication_date": 20190701
    },
    {
      "title": "Great Scratch-Resistant Luggage",
      "text": "Samsonite has always been known for being a leader in luggage construction. This line of luggage—the Omni—is no exception. It maneuver well and has great storage capacity. Though it is a solid side suitcase, it’s not so heavy that I feel like I’m logging around an old-fashioned hard-sided suitcase. My only regret is that I didn’t buy the entire set. Note, I cannot find the other pieces in the same color.",
      "rating": 5.0,
      "verified": true,
      "author": "Slim2u",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "The Big Suitcase Passes Checked Bag Limits!!",
      "text": "Cool color and I’m hoping these bags will hold up. Cats can’t damage these with clawing or puking and while I didn’t use them I like the TSA lock feature on the bags. I find it ironic that this set cost less than my old one (which wasn’t from a brand known for making high quality luggage). I’m still hoping to use these for more exciting travel but time will tell.",
      "rating": 5.0,
      "verified": true,
      "author": "bouncin_frog",
      "helpful_votes": 0,
      "publication_date": 20201004
    },
    {
      "title": "Perfect set of luggage",
      "text": "I was looking for a nice set of lightweight, hardside luggage firvquite a while. Finally found this set. The color is beautiful. My husband and I are going on a two week vacation (cruise and land trip), and we are only checking the medium size suitcase and using the small for a carry on. Plenty of room in the luggage and seems very sturdy. Especially like the TSA locks that are on the luggage. Directions for the locks are in the inside pocket. Also, the luggage came one day earlier scheduled. Nice surprise! Very happy customer.",
      "rating": 5.0,
      "verified": true,
      "author": "C Doro",
      "helpful_votes": 0,
      "publication_date": 20190208
    },
    {
      "title": "GREAT suitcase set",
      "text": "I'm writing this several years after my purchase and I'm still thrilled with the quality and durability of this luggage set! Dimensions are great and I especially love the littlest one, which I use as my carry-on for every flight I go on. VERY scratch and damage-proof, handles and wheels have also held up very well over time.",
      "rating": 5.0,
      "verified": true,
      "author": "Mercy Barrial",
      "helpful_votes": 0,
      "publication_date": 20191013
    },
    {
      "title": "Great piece of rolling luggage",
      "text": "This luggage is good for the traveler who needs to move quickly through the airport while carrying heavier luggage than most. This luggage can easily be loaded beyond 50 pounds so do be careful. Thus far, I've had no oversize charges with it. This luggage case seems sturdy and well constructed albeit it does tend to pick up dust marks fairly easily.",
      "rating": 5.0,
      "verified": true,
      "author": "Matt",
      "helpful_votes": 0,
      "publication_date": 20200905
    },
    {
      "title": "One trip and it's already broken",
      "text": "We took a 3 week trip a week after we bought the suitcase and during the first week it started not rolling correctly, it rolls off to the side all the time, not easy to work with at all. And now apperantly I can not return it, cut off day was 30 days after purchase. What's up with that??? When did that happen?? Now I'm stuck with a bad suitcase???!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Kathy Whitehead",
      "helpful_votes": 2,
      "publication_date": 20191124
    },
    {
      "title": "Surprising",
      "text": "This is a really good luggage that went above my expectations. Very lightweight but pick it full and you can still maneuver this luggage with great ease. I was almost thrown off by how great the maneuvering/control was. The outside shell is some kind of hardened plastic. It bends which I was worried at first regarding at durability, but this is super durable. No complaints with this luggage.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191220
    }
  ],
  "product_meta": {
    "title": "Samsonite Omni PC Hardside Expandable Luggage with Spinner Wheels, Black, 3-Piece Set (20/24/28)",
    "description": "Size:3-Piece Set (20/24/28)| Color:BlackIntroducing a line built to take the harshest travel elements Omni PC combines scratch resistant textures with the lightest 100% polycarbonate construction, ensuring your luggage looks as great on the 100th trip as it does on the 1st. This lightweight line offers heavyweight protection riding on effortless 360 spinner wheels. Don't pull your case; let Omni PC roll comfortably beside you on your journey. Design includes expansion for added capacity when needed. TSA locks ensure your belongings arrive safely to your destination. Extremely lightweight and visually impactful, this collection takes 100% polycarbonate design to the next level. Hardside Care: To clean hardside luggage, we recommend using a gentle soap and warm water, rinsing well. If you would like to wax the case after cleaning, any good silicone-base automobile or furniture polish will preserve the luster and add resistance to the covering. We do NOT recommend, however, that you try to clean the luggage with a combination cleaner-polish. Shell material is made of injection molded polycarbonate, a highly impact-resistant plastic that is strong and lightweight.",
    "rating": 4.6,
    "feature_bullets": [
      "Set includes 20\" carry on (Meets carry-on size restrictions for those traveling domestically and looking to stay light) And 24\"/28\" spinners (Maximize your packing power and the ideal checked bags for longer trips)",
      "10 year limited warranty: Samsonite products are rigorously tested to ensure our products meet stringent standards. This bag comes with a 10-year warranty against defects in materials and workmanship.",
      "Micro-diamond polycarbonate texture is extremely scratch-resistant, keeping cases beautiful trip after trip",
      "Side-mounted TSA locks act to deter theft, ensuring that only you or a TSA agent have easy access to your belongings when traveling",
      "Four, multi-directional oversized spinner wheels for effortless mobility, re-engineered lightweight",
      "Book opening case with mesh divider and cross straps in main compartment with a zipped modesty pocket",
      "Expansion to allow you to pack more items and compression keeps clothing neatly pressed",
      "Push-button locking handles provides easy maneuverability when extended out from the suitcase, and stores neatly inside when not in use"
    ],
    "specifications": {
      "Product Dimensions": "28.5 x 20.5 x 13.5 inches",
      "Item Weight": "25.5 pounds",
      "Department": "Unisex-adult",
      "Manufacturer": "Samsonite Corporation",
      "ASIN": "B013WFOBYA",
      "Item model number": "68311-1041",
      "Customer Reviews": "4.6 out of 5 stars5,173 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#1,107 in Clothing, Shoes & Jewelry",
      "Is Discontinued By Manufacturer": "No"
    },
    "categories": [
      "Luggage",
      "Luggage Sets",
      "Clothing, Shoes & Jewelry",
      "Luggage & Travel Gear",
      "All Departments"
    ],
    "price": 232.23
  }
}