{
  "website_summaries": [
    {
      "verdict": "Buy the Samsung Galaxy S6 Edge+ if you love the idea of a wraparound screen; otherwise, you'll be able to find less expensive phones that do nearly as much.",
      "pros": [
        "Samsung's Galaxy S6 Edge+ has a compelling design, top-tier specs and excellent battery life",
        "Its second menu for the curved display adds some useful shortcuts"
      ],
      "cons": [
        "One of the most expensive handsets on the market, the Edge+'s usefulness doesn't live up to its sky-high price",
        "Fans of removable batteries and microSD card slots will be disappointed that this has neither"
      ],
      "aspects": {
        "Design": 9.0,
        "Features": 9.0,
        "Performance": 9.0,
        "Camera": 8.0,
        "Battery": 9.0
      },
      "publication_date": 20170328,
      "rating": 8.8,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Never buy refurbished.",
      "text": "I was so excited about receiving this phone unfortunately I'm returning it in less than 24 hours of use because the screen went out. What a shame. I never buy refurbished and i never will again.",
      "rating": 1.0,
      "verified": true,
      "author": "Summer 227",
      "helpful_votes": 12,
      "publication_date": 20180105
    },
    {
      "title": "The edge is great!",
      "text": "I bought this phone two years ago. Still have it. It \"replaced\" my Note 5. Let's be honest, my Note 5 is the best phone I had. This phone is a close 2nd. Very close. I love the edge with the clock. It's perfect for what I use it for.",
      "rating": 5.0,
      "verified": true,
      "author": "Kara LaMarca",
      "helpful_votes": 0,
      "publication_date": 20200215
    },
    {
      "title": "Horrible phone, drained battery and bad customer support.",
      "text": "After four months the phone will not hold a charge, turns off randomly, super glitchy, and battery last like two hours. Customer support just says \"sorry nothing we can do\" For the money you waste on this you think it would last more than four months.",
      "rating": 1.0,
      "verified": true,
      "author": "Eric F",
      "helpful_votes": 5,
      "publication_date": 20180115
    },
    {
      "title": "The phone came in pretty rough shape",
      "text": "The phone came in pretty rough shape. The price is good but the shape of the phone was not. The fingerprint option did not work half the time. I’m pretty disappointed. I really wanted to go from and iPhone to android. But I will be returning this phone and continue to use my iPhone. Not worth it.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20180101
    },
    {
      "title": "This phone is absolute garbage.",
      "text": "This phone sporadically refused to fast charge. Switched to other Samsung OEM chargers. Sometimes worked. Now the phone's been plugged in for 18 hours and it's at 26%. I want my money back.",
      "rating": 1.0,
      "verified": true,
      "author": "Rick Roberge",
      "helpful_votes": 0,
      "publication_date": 20200606
    },
    {
      "title": "this is a great phone with lots of memory",
      "text": "So far, this is a great phone with lots of memory! My only concern is that the battery needs to be recharged a lot compared to my old iphone6. I find that this is normal with Galaxy phones, though.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170731
    },
    {
      "title": "Love it so far does more than I will ever ...",
      "text": "My last phone was an LG 3 and it gave me trouble from day one. I have only had this phone for 4 days and I am already loving it. My son talked me into getting this phone because he has one and had also ordered from Amazon. Love it so far does more than I will ever have time to learn and use.",
      "rating": 5.0,
      "verified": true,
      "author": "Walker",
      "helpful_votes": 4,
      "publication_date": 20170403
    },
    {
      "title": "Great phone, but problems with seller",
      "text": "Advertised as refurbished, it's not. Advertised to work with Sprint, does not work with prepaid plans (I switched to Ting). Phone arrived almost a week late, but I was reimbursed for shipping. Otherwise, I am happy with the phone. Great camera quality, ample storage.",
      "rating": 3.0,
      "verified": true,
      "author": "Caitlin",
      "helpful_votes": 3,
      "publication_date": 20171213
    },
    {
      "title": "Samsung S6",
      "text": "Love this phone. Has glitches every once in awhile but that's usually my fault 🤓 I did not realize that it was used until I received it tho.",
      "rating": 4.0,
      "verified": true,
      "author": "Christina Gagne",
      "helpful_votes": 0,
      "publication_date": 20190929
    },
    {
      "title": "Happy Happy!",
      "text": "I have always hesitated getting a used phone, especially site-unseen, but I got this the other day and it's perfect. I brought it to Sprint and they checked to make sure it wasn't blacklisted and it wasn't. So far it works great. Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161126
    },
    {
      "title": "Great deal",
      "text": "It is such an improvement over the old phone. I'm so glad I tried this.",
      "rating": 5.0,
      "verified": true,
      "author": "Stacie Romportl",
      "helpful_votes": 4,
      "publication_date": 20161017
    },
    {
      "title": "I Love, Love, Love my new phone.",
      "text": "I Love, Love, Love my new phone. buying used and paying half the cost was a great idea! It appears brand new and works like it is brand new! I love the Gold color and the size of this \"plus\" phone.",
      "rating": 5.0,
      "verified": true,
      "author": "Carole",
      "helpful_votes": 0,
      "publication_date": 20160626
    },
    {
      "title": "Awesome phone!",
      "text": "Thank you so much! I'm loving this phone. Its a wonderful upgrade from my last phone. Its runs very smoothly. I love the big screen and the camera is great!",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle Lucas",
      "helpful_votes": 4,
      "publication_date": 20160915
    },
    {
      "title": "Best phone!",
      "text": "Love love love this phone would buy it twenty times over. Got it for great price and in timely manner.",
      "rating": 5.0,
      "verified": true,
      "author": "Holden Daugherty",
      "helpful_votes": 3,
      "publication_date": 20160929
    },
    {
      "title": "Don't buy this product!! It is a nightmare and waste of money!!",
      "text": "This phone does not come with a sim card and is impossible to get activated!! After going through hell with getting them activated, the phones died in 5 months, a major RIP off!! They claim these are new phones but they are not!!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "I know product was refurbished but it should have Biggs ...",
      "text": "I know product was refurbished but it should have Biggs fixed. Keeps turning itself off. What if I has an emergency?",
      "rating": 1.0,
      "verified": true,
      "author": "not so new",
      "helpful_votes": 0,
      "publication_date": 20180405
    },
    {
      "title": "I guess Im not disappointed in the phone itself just the supplier",
      "text": "After having to send the 1st one back due to it not charging at all. I received one that has a scratch on the screen and a full battery only last 2-3 hours. Due to my current phone completely dying on me I had not choice but to keep it at this point. I guess Im not disappointed in the phone itself just the supplier!",
      "rating": 3.0,
      "verified": true,
      "author": "Chasity",
      "helpful_votes": 0,
      "publication_date": 20180307
    },
    {
      "title": "Love it !",
      "text": "Love it! Came in new and works great, but doesn't work with my Samsung Gear vr though, was not expecting that with a new phone. Kinda disappointed on that end",
      "rating": 4.0,
      "verified": true,
      "author": "MS",
      "helpful_votes": 0,
      "publication_date": 20170502
    },
    {
      "title": "Grate phone,",
      "text": "Grate phone, dose everything it's supposed to do, and more. Really satisfied",
      "rating": 5.0,
      "verified": true,
      "author": "jose",
      "helpful_votes": 3,
      "publication_date": 20160120
    },
    {
      "title": "Best value in phablets!",
      "text": "Love this phone, perfect size and with a waterproof case it may be a way better deal than the s7 edge.",
      "rating": 5.0,
      "verified": true,
      "author": "Randy",
      "helpful_votes": 2,
      "publication_date": 20160928
    },
    {
      "title": "Great phone",
      "text": "Is a great phone I love it. Came new in a AT&T box with everything and just what I wanted. It is so worth the price ^-^",
      "rating": 5.0,
      "verified": true,
      "author": "Danissa",
      "helpful_votes": 2,
      "publication_date": 20161221
    },
    {
      "title": "Great phone.",
      "text": "Great phone..good battery,speaker,no dropped calls nor WiFi problems. Awesome screen plus the edge screen and apps make this a phone fun to customize. Still wish it had an sd card but with 64gb I'm very satisfied.",
      "rating": 4.0,
      "verified": true,
      "author": "karen roche",
      "helpful_votes": 0,
      "publication_date": 20161101
    },
    {
      "title": "plastic screen deception possible!",
      "text": "phone is in new condition i love it but i think i was tricked the screen is plastic!! and it is kinda difficult to type and sometimes the screen didnt respond due to the plastic screen. i dont think its gorilla glass 4",
      "rating": 3.0,
      "verified": true,
      "author": "john",
      "helpful_votes": 0,
      "publication_date": 20180117
    },
    {
      "title": "BEWARE",
      "text": "My daughter & family could have DIED when this happen in the night, if they didn't have a smoke detector",
      "rating": 1.0,
      "verified": true,
      "author": "Fred Gillett",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "Battery life is terrible.  Notifications are weak.",
      "text": "Personal use mainly for text and some calls. Notifications are too low, vibrations not felt, sounds are weak. Will not hold a charge so charging it everyday.",
      "rating": 1.0,
      "verified": true,
      "author": "Lou",
      "helpful_votes": 0,
      "publication_date": 20190902
    },
    {
      "title": "Amazing product",
      "text": "Its a perfect phone theres nothing I dislike about it.",
      "rating": 5.0,
      "verified": true,
      "author": "Jesse",
      "helpful_votes": 0,
      "publication_date": 20200909
    },
    {
      "title": "Four Stars",
      "text": "Until now phone is working good, a very nice phone.",
      "rating": 4.0,
      "verified": true,
      "author": "Louis.C",
      "helpful_votes": 0,
      "publication_date": 20170623
    },
    {
      "title": "Old",
      "text": "Phone worked less than 30 days I took it to Verizon they said it was too old of a phone for them to try to fix all updates no longer available",
      "rating": 1.0,
      "verified": true,
      "author": "helen wright",
      "helpful_votes": 0,
      "publication_date": 20200205
    },
    {
      "title": "Good product",
      "text": "Good battery life, easy to use and i got value for my money.",
      "rating": 5.0,
      "verified": true,
      "author": "Serina Findley",
      "helpful_votes": 0,
      "publication_date": 20190206
    },
    {
      "title": "Best phone I've ever owned!",
      "text": "I LOVE LOVE LOVE my phone, It's big and bad-*ss!",
      "rating": 5.0,
      "verified": true,
      "author": "Nad L.",
      "helpful_votes": 0,
      "publication_date": 20160817
    },
    {
      "title": "I absolutely loved it. It came looking brand new and came ...",
      "text": "I absolutely loved it. It came looking brand new and came in a box and shipped fast. The only reason I give 4 stars is because it didn't come with the actual charger.",
      "rating": 4.0,
      "verified": true,
      "author": "Anthony Deniz",
      "helpful_votes": 0,
      "publication_date": 20160505
    },
    {
      "title": "Great condition, screen was scratched up and I'm thinking ...",
      "text": "Great condition, screen was scratched up and I'm thinking the screen has been removed from the body before because it was kinda coming out. But other than that it's a good phone.",
      "rating": 4.0,
      "verified": true,
      "author": "matheus santana",
      "helpful_votes": 0,
      "publication_date": 20161216
    },
    {
      "title": "Three Stars",
      "text": "The speakerphone does not work. I can hear the caller but they cannot hear me.",
      "rating": 3.0,
      "verified": true,
      "author": "Beverly Elston",
      "helpful_votes": 0,
      "publication_date": 20180324
    },
    {
      "title": "It's a great phone with a lot of options",
      "text": "It's a great phone with a lot of options, but it's power hungry. I have to keep a portable battery with me to keep the battery charged.",
      "rating": 4.0,
      "verified": true,
      "author": "Charles P. Graham, Author of Survive! Marooned on Planet Tau Ceti g",
      "helpful_votes": 0,
      "publication_date": 20170117
    },
    {
      "title": "Great phone bt when I got it there were imperfections ...",
      "text": "Great phone bt when I got it there were imperfections with the device that u can't see in the picture",
      "rating": 4.0,
      "verified": true,
      "author": "Rashawn Christian",
      "helpful_votes": 2,
      "publication_date": 20170426
    },
    {
      "title": "I win",
      "text": "It's prime there's not a scratch and not a thing wrong with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric",
      "helpful_votes": 0,
      "publication_date": 20190518
    },
    {
      "title": "Satisfied!",
      "text": "Love the phone. It came brand new. Works with MetroPCS. Would recommend seller and phone",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer",
      "helpful_votes": 2,
      "publication_date": 20161227
    },
    {
      "title": "BUYER BEWARE",
      "text": "Buyer BEWARE! This phone continues to revert to Sprint when I try to search the Internet. When I took it to the Verizon store, I was told the phone was likely a Sprint phone that was converted to a Verizon phone. At certain times, it will search for Sprint network, it will drain the battery. This happens randomly. I tried to return the phone, but was told I was a few days too late. The phone was advertised as a new VERIZON phone; however, it keeps trying to open up websites through Sprint. I have had nothing but trouble with it, and I would not recommend purchasing from this seller.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 9,
      "publication_date": 20161222
    },
    {
      "title": "Never again",
      "text": "I will never pay full price again. Amazing condition for used. Totally satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "james Edwards",
      "helpful_votes": 0,
      "publication_date": 20170612
    },
    {
      "title": "the phone was in great condition. It also works without any issues",
      "text": "the phone was in great condition. It also works without any issues, but it did not include a sim card.",
      "rating": 4.0,
      "verified": true,
      "author": "Charles Thomas",
      "helpful_votes": 0,
      "publication_date": 20161107
    },
    {
      "title": "Five Stars",
      "text": "Great phone. Description was very accurate. Would buy again from seller",
      "rating": 5.0,
      "verified": true,
      "author": "SexyRed",
      "helpful_votes": 0,
      "publication_date": 20170413
    },
    {
      "title": "Four Stars",
      "text": "After buying 3 phones this one finally worked. The first 2 were bought elsewhere.",
      "rating": 4.0,
      "verified": true,
      "author": "maisha wingfield",
      "helpful_votes": 0,
      "publication_date": 20180424
    },
    {
      "title": "Everything was good except the box had been opened when i got ...",
      "text": "Everything was good except the box had been opened when i got it. Everything was in the box when i opened it. Got here on time.",
      "rating": 5.0,
      "verified": true,
      "author": "Luedimus",
      "helpful_votes": 0,
      "publication_date": 20170411
    },
    {
      "title": "Five Stars",
      "text": "I like how fast it is along with all of the application s.",
      "rating": 5.0,
      "verified": true,
      "author": "martha dietz",
      "helpful_votes": 0,
      "publication_date": 20180205
    },
    {
      "title": "I made good decision purchasing it",
      "text": "Phone came exactly as described....I made good decision purchasing it!",
      "rating": 5.0,
      "verified": true,
      "author": "Linda Novakovich",
      "helpful_votes": 0,
      "publication_date": 20170320
    },
    {
      "title": "Sweet phone",
      "text": "Best phone ever, easy to use, very durable and very stylish. It was quite affordable.",
      "rating": 5.0,
      "verified": true,
      "author": "Dean S.",
      "helpful_votes": 0,
      "publication_date": 20170422
    },
    {
      "title": "Five Stars",
      "text": "No issues, been using it since I got it: quality, not too expensive, totally worth the buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Johnny Dank",
      "helpful_votes": 0,
      "publication_date": 20170902
    },
    {
      "title": "Five Stars",
      "text": "Great phone. Everything that the seller said was great and on point",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170604
    },
    {
      "title": "way to go Samsung! LOVE THIS PHONE!",
      "text": "so glad I ordered this phone, seller has great quality-turned off the normal bloatware and extra's so battery last all day and into the night without charging. love the large screen and phone fits my hands and easy to hold and carry.",
      "rating": 5.0,
      "verified": true,
      "author": "K. smith",
      "helpful_votes": 0,
      "publication_date": 20160626
    },
    {
      "title": "S6edge+ is the G.O.A.T",
      "text": "This phone is awesome! The quality,the beauty, it's one hell of a headturner.",
      "rating": 5.0,
      "verified": true,
      "author": "mike creason",
      "helpful_votes": 0,
      "publication_date": 20160604
    },
    {
      "title": "Just as pictured!",
      "text": "I loved this phone when it first came out and was happy to see I could still get this \"older\" model still! Was beautiful and looked brand new when I got it. Haven't had any problems with it at all. I will buy from this vendor again.",
      "rating": 5.0,
      "verified": true,
      "author": "Aimie",
      "helpful_votes": 0,
      "publication_date": 20170928
    },
    {
      "title": "Only charges on wireless pad now and is extremely annoying!",
      "text": "USB charging port quit working soon after purchased. Only charges on wireless pad now and is extremely annoying!",
      "rating": 2.0,
      "verified": true,
      "author": "James delaney",
      "helpful_votes": 0,
      "publication_date": 20170125
    },
    {
      "title": "Good product - annoying looping system update",
      "text": "I like this phone - it keeps looping a system update which is annoying. No matter how many times I install it continues to request to update the system. Other than that the phone works great.",
      "rating": 4.0,
      "verified": true,
      "author": "Kimberly Slaughter",
      "helpful_votes": 0,
      "publication_date": 20170329
    },
    {
      "title": "Great phone",
      "text": "It took me a bit of online time to find this Verizon-compatible model. I had played with it in a store but when I was ready to upgrade none of the stores had it any longer and it had only been a month or so. I saved big bucks getting it here than through Verizon's website. Since I was looking to save, I did not mind the color. This is a much larger phone than my old one, but it's so awesome I can live with that. I've had it for several months now and it's a fantastic phone.",
      "rating": 5.0,
      "verified": true,
      "author": "Mindy",
      "helpful_votes": 3,
      "publication_date": 20160523
    },
    {
      "title": "So far so good.",
      "text": "So far so good. No complaints about the phone. Love the screen. The aftermarket charger is not impressive.......Just loosely thrown in the box with the phone. But it does do the job.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170111
    },
    {
      "title": "It has worked wonderfully so far",
      "text": "It arrived quickly and was well packaged. I followed the directions, got some help from Verizon and it was ready to go. It has worked wonderfully so far. It is a far better phone than what I had before. I have been very happy with this purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Charlie Wingo",
      "helpful_votes": 0,
      "publication_date": 20161210
    },
    {
      "title": "The phone was in really good cosmetic shape the only thing wrong with this phone ...",
      "text": "The phone was in really good cosmetic shape the only thing wrong with this phone is it has a bad charging port",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20161009
    },
    {
      "title": "Love this phone has the size of the iphone 6 ...",
      "text": "Love this phone has the size of the iphone 6 plus but with all the features of an android open system!",
      "rating": 5.0,
      "verified": true,
      "author": "ALANNA",
      "helpful_votes": 0,
      "publication_date": 20170307
    },
    {
      "title": "Absolutely love the phone",
      "text": "Absolutely love the phone, but the charger that was sent to me was not the charger that actually came with the phone originally. I got a charger that works but isn't the cord that goes with this phone and does the fast charge.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20160221
    },
    {
      "title": "It was fine until the battery started not doing so well then ...",
      "text": "It was fine until the battery started not doing so well then when i deciede to give it back because i was on it, it had 21% battery not even 1 second it jumped from 21% to 3%",
      "rating": 1.0,
      "verified": true,
      "author": "Megan",
      "helpful_votes": 2,
      "publication_date": 20170417
    },
    {
      "title": "Headphones broken",
      "text": "The headphones only lasted me 2 weeks good and no longer serve where this my guarantee I am angry. Are supposed to be oroginals and no longer serve ...",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170801
    },
    {
      "title": "I bought this phone for my wife. She was ...",
      "text": "I bought this phone for my wife. She was so excited when she got it. Until we went to put SIM card in to find out the sim tray was missing. What type of business does tht? I paid big money for a incomplete used phone. Had to spend another 18 dollars for a replacement tray and wait to activate it. Word of advice make sure you buy all new products. This is sh**ty",
      "rating": 1.0,
      "verified": true,
      "author": "franklin",
      "helpful_votes": 2,
      "publication_date": 20161219
    },
    {
      "title": "Received product with scratches and dents on the side. ...",
      "text": "Received product with scratches and dents on the side. Also could not log into it because previous owner synced their email onto the phone so ended up not able to use the phone.",
      "rating": 1.0,
      "verified": true,
      "author": "anonymous",
      "helpful_votes": 5,
      "publication_date": 20160714
    },
    {
      "title": "Used-Like New Galaxy S6 Edge+ from Edge Cellular...... Yup, LIKE NEW!!",
      "text": "Great phone!! Bought it for myself. Used-Like New condition, From Edge Cellular. When it arrived, it came in a plain box with an original charger. The phone was exactly as described. Like new condition!!! Screen was pristine, it still had some of the original plastic protection cover on some of the sensors and camera lens. Couldn't find a scratch on any part of the glass, front or back. There was some edge wear on the metal but it was not noticeable unless you were looking for it. If I ever need to upgrade or replace this phone I will definitely check out what Edge Cellular is offering because when they say LIKE NEW it is LIKE NEW!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Austreng01",
      "helpful_votes": 7,
      "publication_date": 20170302
    },
    {
      "title": "Plenty of bells and whistles until it's pushing up daisies.",
      "text": "It worked great and took great pictures, at least until it died, and I mean it just died. No warning. No errors. It just bricked. On one second, gone the next. It has no damage to it and it's never been submerged, and absolutely no unauthorized apps. It lasted just past the warranty, which is ridiculous. I have a flat screen TV that's lasted 5 years and Samsung can't make a smart phone that lasts longer than 2 years. For $450 I would expect a bit more longevity.",
      "rating": 2.0,
      "verified": true,
      "author": "Josh Teal",
      "helpful_votes": 0,
      "publication_date": 20171206
    },
    {
      "title": "These phones do not have place for sd card.",
      "text": "Had bruised place under screen when I got it out of box to charge it. Before I ever activated. Then noticed small lines through screen.. Making words and letters not clear. Small chip on corner bottom opposite of the bruise like spot in top right area.",
      "rating": 2.0,
      "verified": true,
      "author": "stacey",
      "helpful_votes": 3,
      "publication_date": 20180113
    },
    {
      "title": "Buyer beware",
      "text": "Stay away from ordering this product on this platform . Charger that came with phone does not charge phone I am using a old phone charger , I am starting to believe what others are saying which is Amazon is a platform for companies to sell below quality name brand products. Update now the phone will not charge , stay away from this seller/priduct!!!!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Ray W",
      "helpful_votes": 0,
      "publication_date": 20191005
    },
    {
      "title": "Great overall phone",
      "text": "Substitute for Note 7. Its a great phone but lacks my note 7 pen and screen real estate. I look forward to the next generation of Samsung phones. The S7 is a good basic all around phone that will not disappoint for those who don't need the business function of the note series. I would recommend this phone to anyone! Great photos, clear calling and great to play games on!",
      "rating": 5.0,
      "verified": true,
      "author": "Lori K. Christiansen",
      "helpful_votes": 2,
      "publication_date": 20170109
    },
    {
      "title": "The seller sold me a broken phone.",
      "text": "I placed a new phone screen protector and activated the phone. When. I got home I tried to charge it only to find out it doesn't charge cause the pins are broken",
      "rating": 1.0,
      "verified": true,
      "author": "Bee",
      "helpful_votes": 2,
      "publication_date": 20180718
    },
    {
      "title": "Most features work...",
      "text": "As usual for a refurb. Nfc doesn't work. I returned my last refurb because of this because I'm sick of having to carry a wallet again. Everything else works fine. Looks like I'll just have to buy a new phone if I want everything to work though.",
      "rating": 2.0,
      "verified": true,
      "author": "deimos",
      "helpful_votes": 2,
      "publication_date": 20170924
    },
    {
      "title": "Great purchase, excellent phone condition!",
      "text": "I was very skeptical to purchase a cell phone online after reading mixed reviews. I am very glad that I made the purchase. I ordered a Verizon compatible phone because that is the service I wanted to transfer to. The phone is in excellent condition even the rep at the Verizon store commented that it was one of the best refurbished that she had seen. All of my services transferred over, I was able to sync my previous apps. I am very happy with this purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "MargB",
      "helpful_votes": 0,
      "publication_date": 20181115
    },
    {
      "title": "I love the phone",
      "text": "I love the phone, works as expected. The only part I don't like is I ordered as used-like new and there are pixels up on the left hand side that are dead. They're not noticeable really but me being the person I am noticed it shortly after switching my service to the phone. It doesn't affect seeing anything since it's at the very top, just irritating.",
      "rating": 4.0,
      "verified": true,
      "author": "Sara Dealy",
      "helpful_votes": 2,
      "publication_date": 20160826
    },
    {
      "title": "Could not activate",
      "text": "Bought this for my son's birthday and attempted to activate it to our Verizon account and were unsuccessful. After 3 hours of phone calls and visits to the Verizon store with 2 new sim cards, the phone was found to be defective. This was very upsetting as it is a birthday gift for my son, so much for the suprise! Returning this and not purchasing online again.",
      "rating": 1.0,
      "verified": true,
      "author": "Margaret",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "WARNING Warranty void",
      "text": "Warning, buying this phone through Arad System is viewed as an unauthorized reseller by Samsung and voids the warranty. The processor fails on this phone in less than a year. So you'll be throwing you're money away if you buy this phone.",
      "rating": 1.0,
      "verified": true,
      "author": "Busy Ty",
      "helpful_votes": 3,
      "publication_date": 20171207
    },
    {
      "title": "Love love love it",
      "text": "Love love love it . Bought it in Dec and it's still great. Slow at times but it even tells you you have to turn it off then on so the updates can work better you know restart your phone. I had to do it once and it's fast",
      "rating": 5.0,
      "verified": true,
      "author": "samantha messer",
      "helpful_votes": 2,
      "publication_date": 20170216
    },
    {
      "title": "I'm confused.",
      "text": "Says it's a Samsung s6 edge but it's not as big as it should be. Edge case too big on it. But it does have the edge on it. I'm confused.",
      "rating": 1.0,
      "verified": true,
      "author": "glorygal",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "I couldn't bear to part with another 650 bucks for ...",
      "text": "I couldn't bear to part with another 650 bucks for a new one, so I rolled the dice. A few months after my wife started using it ... still no issues. :-)",
      "rating": 5.0,
      "verified": true,
      "author": "Marc S.",
      "helpful_votes": 0,
      "publication_date": 20180403
    },
    {
      "title": "Great phone!",
      "text": "My fiance loves his phone. It works great and is a big upgrade from his galaxy 5. It is much heaver than the regular galaxy S6 but the screen is larger and worth the extra weight.",
      "rating": 5.0,
      "verified": true,
      "author": "Taylor Miller",
      "helpful_votes": 2,
      "publication_date": 20170711
    },
    {
      "title": "Amazing for the price. Forget the new store ones...",
      "text": "Got it for my dad for his birthday. Just like new! love it",
      "rating": 5.0,
      "verified": true,
      "author": "Jason Johnson",
      "helpful_votes": 2,
      "publication_date": 20170612
    },
    {
      "title": "Great for the price!!!",
      "text": "I've had my galaxy s6 edge plus for about a month now. I love it. No issues for now. Brand new in the box untouched! I saved a lot of money!",
      "rating": 5.0,
      "verified": true,
      "author": "phillip c harris",
      "helpful_votes": 0,
      "publication_date": 20161114
    },
    {
      "title": "Five Stars",
      "text": "Absolutely and totally in love with this phone! Exactly what I wanted!",
      "rating": 5.0,
      "verified": true,
      "author": "Georgia",
      "helpful_votes": 0,
      "publication_date": 20170628
    },
    {
      "title": "I LOVE MY PHONE",
      "text": "I LOVE MY PHONE!! I WILL NEVER BUY FROM THE VERIZON STORE BECAUSE I SAVED SO MUCH MONEY BUYING THIS FROM AMAZON! I'M VERY HAPPY!!",
      "rating": 5.0,
      "verified": true,
      "author": "VaLori",
      "helpful_votes": 0,
      "publication_date": 20161107
    },
    {
      "title": "Phone has issues very slow",
      "text": "Phone had awful battery. Phone would not allow you to go backward. Software problem with return and money",
      "rating": 1.0,
      "verified": true,
      "author": "JD",
      "helpful_votes": 0,
      "publication_date": 20181027
    },
    {
      "title": "Perfect condition and works wonderful",
      "text": "very happy with me purchase, it will be a great back up phone.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20180523
    },
    {
      "title": "Being a refurb unit it's in surprisingly great shape. USB port does not work so well ...",
      "text": "Being a refurb unit it's in surprisingly great shape. USB port does not work so well as only a few cords I have will work with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Roger Truss",
      "helpful_votes": 0,
      "publication_date": 20170728
    },
    {
      "title": "Perfect Phone",
      "text": "Absolutely perfect, just as described and battery life is great. Love the edged screen.",
      "rating": 5.0,
      "verified": true,
      "author": "Joey Mckinnon",
      "helpful_votes": 0,
      "publication_date": 20190703
    },
    {
      "title": "Great purchase definitely buy its brand new came with charger ...",
      "text": "Great purchase definitely buy its brand new came with charger headphones and most importantly it works with no flaws great battery life great screen resolution very satisfied and it's unlock I'm using this with cricket",
      "rating": 5.0,
      "verified": true,
      "author": "Tony",
      "helpful_votes": 0,
      "publication_date": 20170528
    },
    {
      "title": "Seven stars",
      "text": "Best mobile phone Samsung has ever created. Top notch hardware plus breath taking design and glass coated body. I bought two pieces, one of them as a spare, before it would be sold out.",
      "rating": 5.0,
      "verified": true,
      "author": "A Elguindy",
      "helpful_votes": 0,
      "publication_date": 20170427
    },
    {
      "title": "I loved the phone wasn't too hard to connect but I ...",
      "text": "I loved the phone wasn't too hard to connect but I had boost mobile and I couldn't connect the phone with them had to go to Sprint.The battery life is like a 6/10 but phone looked barely used and I love it ☺",
      "rating": 4.0,
      "verified": true,
      "author": "Ale,",
      "helpful_votes": 0,
      "publication_date": 20180501
    },
    {
      "title": "Five Stars",
      "text": "it's great I love it and the camera is very nice and clear.",
      "rating": 5.0,
      "verified": true,
      "author": "patty bugayong",
      "helpful_votes": 0,
      "publication_date": 20170523
    },
    {
      "title": "Photo buff loves this phone!",
      "text": "I LOVE this phone and its 16 mp camera. It has awesome edit features and is so easy to adjust focus and exposure by just tapping the screen. LOVE it.",
      "rating": 5.0,
      "verified": true,
      "author": "reveiwer",
      "helpful_votes": 2,
      "publication_date": 20160623
    },
    {
      "title": "And it is a great phone!",
      "text": "I was so worried about buying a used phone! But it came with no scratches! And it is a great phone!!! Thank you amazon",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180119
    },
    {
      "title": "... I've bought from this seller and I couldn't be happier with both of them",
      "text": "This is the second edge 6 s plus I've bought from this seller and I couldn't be happier with both of them. Definitely my best experience on Amazon so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Brandt Neider",
      "helpful_votes": 0,
      "publication_date": 20160808
    },
    {
      "title": "Five Stars",
      "text": "Nice phone, great price. Big screen with a high resolution. Arrived quickly, as described...",
      "rating": 5.0,
      "verified": true,
      "author": "Allen Freeman",
      "helpful_votes": 0,
      "publication_date": 20161005
    },
    {
      "title": "The phone looks great have to give it that but it kept shutting ...",
      "text": "The phone looks great have to give it that but it kept shutting off after 3 months and the sensor is not as responsive as it should be. After trying for 6 months i had to get another phone because even the ability to answer a call is extremely difficult when the touch sensor not working.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20161207
    },
    {
      "title": "Awesome seller",
      "text": "What can I say Edge Cellular did it again. Phone didn't have a scratch.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Conyers",
      "helpful_votes": 0,
      "publication_date": 20171023
    }
  ],
  "product_meta": {
    "title": "Samsung Galaxy S6 Edge+, Gold 32GB (AT&T)",
    "description": "Service Provider:AT&T| Color:Gold| Size:32 GBACCEPTABLE (2/5) - Shows signs of significant wear and tear, will have scuffs, scratches, dents and/or housing marks. May have LCD halo or other useable screen discolorations. Product is fully functional and tested. A standard US home charger is included. SIM card not included. ESN has been verified as clear to use with Verizon prepay network.",
    "rating": 3.6,
    "feature_bullets": [
      "Display: 5.7-inches",
      "Camera: 16-MP",
      "Processor Speed: 2.1 GHz",
      "OS: Android 5.1.1 Lollipop"
    ],
    "specifications": {
      "Product Dimensions": "2.98 x 0.27 x 6.06 inches",
      "Item Weight": "5.4 ounces",
      "ASIN": "B013X8XXT0",
      "Item model number": "Galaxy S6 Edge+",
      "Batteries": "1 Lithium ion batteries required.",
      "Customer Reviews": "3.6 out of 5 stars179 ratings3.6 out of 5 stars",
      "Best Sellers Rank": "#134,847 in Cell Phones & Accessories",
      "OS": "Android",
      "RAM": "32 GB",
      "Wireless communication technologies": "Cellular",
      "Additional Features": "Camera, Smartphone",
      "Display technology": "LCD",
      "Display resolution": "2560 x 1440 pixels",
      "Other display features": "Wireless Phone",
      "Device interface - primary": "Touchscreen with Stylus Support",
      "Other camera features": "16 MP",
      "Form Factor": "Bar",
      "Colour": "Gold",
      "Phone Standy Time (with data)": "336 Hours",
      "Included Components": "Pre-Installed SIM Card, Wall Charger, Samsung S6 Edge+, USB Cable",
      "Manufacturer": "Samsung",
      "Date First Available": "August 19, 2015"
    },
    "categories": [
      "Cell Phones & Accessories",
      "Carrier Cell Phones",
      "Cell Phones",
      "All Departments"
    ],
    "price": 208.0
  }
}