{
  "website_summaries": [
    {
      "verdict": "A great military survival shovel with one of the best serrated edges for chopping and cutting.",
      "pros": [
        "Serrated edge has deeper teeth for more efficient sawing and cutting",
        "Rubber straight handle is contoured for a more ergonomic grip",
        "Shovel head can be turned 90 degrees for trenching"
      ],
      "cons": [
        "Can take a long time to dig the shovel head into the ground due to its small size"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Nice little shovel for the price",
      "text": "I needed one these gadgets so I decided to get this one. Out of the box, I was kind of surprised as to the size of it. It seemed kind of small, almost petite, but after more consideration, I noticed it was pretty robust, not cheaply made. The size can be an advantage for quad, side by side riders and those who backpack, although a little heavy for you minimalists out there. It's multi-use, which offsets the size thing as well. For Jeep and 4x4 drivers you might want to consider a full size shovel. This one goes in my RZR.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Kohlbrecher",
      "helpful_votes": 16,
      "publication_date": 20151203
    },
    {
      "title": "Everyone should have one of these, well made and the price is right!",
      "text": "Just adding to our collection of Self Sufficiency tools, this is very very well made, it's sharp, open cans, digs, has a flint fire starter attached to the small pouch it stays in. This shovel/pick tool takes up really no room. It's a great find and goes well in our collection.",
      "rating": 5.0,
      "verified": true,
      "author": "Tom and Heather",
      "helpful_votes": 0,
      "publication_date": 20170103
    },
    {
      "title": "Great item for camping!",
      "text": "LOL Used this with my grandparents when camping to cover a hole in front of their camper. I was the hero of that moment ;) Great tool for a great price! Seems durable, seeing as I hit this against fallen trees to get some bark for a fire, and it's easy to assemble and fold again.",
      "rating": 5.0,
      "verified": true,
      "author": "JC Live On",
      "helpful_votes": 25,
      "publication_date": 20161126
    },
    {
      "title": "Awesome product!",
      "text": "I love this shovel! It's so handy. It's small enough to fit under a car seat, in a tool box, or in a hiking pack. Even the serrated edge works great! Overall awesome product. Can't imagine going camping without it. I do bring it 4x4/wheeling as well. It would be a decent emergency shovel if I got my rig stuck, but it's so small that it would be a bit of a pain for that. So I might suggest a larger shovel for that. But for general use, certainly recommend!!",
      "rating": 5.0,
      "verified": true,
      "author": "Audric S.",
      "helpful_votes": 0,
      "publication_date": 20170306
    },
    {
      "title": "... works well some of the paint was chipping off pretty shortly after I got it and given the beach ...",
      "text": "i use it as a shovel on the beach and it works well some of the paint was chipping off pretty shortly after I got it and given the beach use it will probably rust away in the next few years of use but for the price it's a good buy. adjusting it is kinda annoying though, screwing and unscrewing. It can be hard to get it tightened enough not to slip when working in sandy conditions. Lastly it would be nice if it wasn't stright or 90 but if there was a slight bend option as shovels are a lot more comfortable and easy to use if they have a but of a angle at the end.",
      "rating": 4.0,
      "verified": true,
      "author": "Old Timer",
      "helpful_votes": 0,
      "publication_date": 20160822
    },
    {
      "title": "but for simple activities it is great. In an emergency it works well to help ...",
      "text": "I use this as an emergency shovel in my truck. I do a lot of camping and various outdoor activities and a shovel or pick comes in handy. It is not huge and would not be the one tool you need in a major project, but for simple activities it is great. In an emergency it works well to help get tires unstuck, remove debre, create ditches etc. Haven't used the fire starter, blade or other features yet, but they do see to be good quality.",
      "rating": 5.0,
      "verified": true,
      "author": "st7",
      "helpful_votes": 0,
      "publication_date": 20170707
    },
    {
      "title": "Breakable",
      "text": "Its not good whatsoever. I went on my AT for 3 weeks camping in the woods hoping this would come in handy and it broke within the first 10 swings into the ground to cut some roots. They werent big roots at all either. Plus thr shovel isnt even that big.it sucks and i cant get my money back so its crappy. Dont buy it trust me. Id rather bring a shovel from home depot thats gonna last me a while",
      "rating": 1.0,
      "verified": true,
      "author": "Joey",
      "helpful_votes": 0,
      "publication_date": 20180809
    },
    {
      "title": "Needed for Outdoor Survival Stuff",
      "text": "This thing is great! Small, compact, very sturdy shovel! I love how when put together it's about 2' long cause all of the compact shovels are not that long, nor this sturdy. The saw part of the shovel is quite sharp, very impressive. Whistle works. The sharp part which could be used as an axe... I suggest just getting a hatchet in your Arsenal of camping gear lol. Pick part works amazing, as well. This shovel is so worth the $30. Strong, not too light, not too heavy, you will be impressed when you get it... Cause I had all kinds of doubts but not anymore!",
      "rating": 5.0,
      "verified": true,
      "author": "Jackie ",
      "helpful_votes": 0,
      "publication_date": 20160224
    },
    {
      "title": "Great Alternative to true military issue",
      "text": "This thing seems to be good quality. I havent used it yet but it feels like heavy steel. Its not exactly like the military issue since the handle screws in rather than fold but i think it makes it stronger that way. The only issue that can cause is if dirt gets caked on it it may not screw in easily. Otherwise it feels tough, the serrated part has bent serrations and its not sharp in any way, but with the pick axe head it is a true multi purpose survival tool. It would be useful as a weapon in dire situations as well.",
      "rating": 4.0,
      "verified": true,
      "author": "Beezy",
      "helpful_votes": 0,
      "publication_date": 20160412
    },
    {
      "title": "Worth the price",
      "text": "Love it! I looked at A LOT of camp shovels before buying this one. I have used every feature on this shovel over the years of having it. It cleans easily and it’s easy to resharpen the cutting edge. This little guy fits well into an overnight bag/ survival gear/ hiking pack. It’s light weight but feels sturdy when you use it, and it will move a lot of earth when you quickly switch between shovel and it’s pickaxe.",
      "rating": 5.0,
      "verified": true,
      "author": "Brad R",
      "helpful_votes": 0,
      "publication_date": 20181029
    },
    {
      "title": "Very small- read review for alternate suggestion from same company",
      "text": "For me this is way too small. From the picture, you can see that it is barely bigger than a spatula. I did not see that in the specs- a picture with something familiar for context would have been very valuable. However, after posting a negative review the company offered me a full refund and pointed me towards a larger version that they make, and I have ordered it to replace the little one: Fobachi Large Military Folding Shovel and Pick $30  I did not actually use the small shovel before the review, but quality looked good. And I was VERY IMPRESSED with the service I received from this company.",
      "rating": 3.0,
      "verified": true,
      "author": "EZBZ",
      "helpful_votes": 20,
      "publication_date": 20160508
    },
    {
      "title": "Impressed",
      "text": "Sharp,sturdy, folds into small easy to carry. I like it so much I'm not saving it for bug out kit, I'm also using it in my tiny garden. My only complaint/suggestions is another section for the handle. It would make the shovel so much more useful, comfortable. It would provide leverage.",
      "rating": 4.0,
      "verified": true,
      "author": "tt58",
      "helpful_votes": 0,
      "publication_date": 20171108
    },
    {
      "title": "Are these reviews for real?",
      "text": "The shovel bent, and the pick broke, after the first light use. I used it to clear a camp sight for my tent. I contacted the manufacturer, and they sent me a new one without question, but I have zero faith in this shovel. Great design and concept, but horrible weak metal. I have a hard time believing that all of these reviews are from verified purchasers, or from people that actually used the shovel. I gave it two stars because the company sent me a new one. One star for the shovel itself.",
      "rating": 2.0,
      "verified": true,
      "author": "Run",
      "helpful_votes": 0,
      "publication_date": 20160331
    },
    {
      "title": "Great Tool for Camping",
      "text": "I purchased this for my on and his girlfriend for their camping . They love its versatility and said it comes in handy for putting tent poles in hard ground, digging fire and latrine pits, etc. Very satisfied with this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Kellyd8421",
      "helpful_votes": 0,
      "publication_date": 20180311
    },
    {
      "title": "it will not disappoint.",
      "text": "Bought this shovel to keep in the RV for trenching water drainage, moving hot coals about. A quality, solid and well built tool. . Folds into a small pouch for storage. Shovel is about 18\" long, so you are not going to dig major trenches with it, but it is very well built and will not bend under stress. Pay a little extra and get this shovel .... it will not disappoint.",
      "rating": 5.0,
      "verified": true,
      "author": "Kram Nossungam",
      "helpful_votes": 0,
      "publication_date": 20170115
    },
    {
      "title": "I like it a lot",
      "text": "Got this for a car emergency kit. I like it a lot. You're definitely not going to be moving a ton of snow very quickly but this will do in a pinch. Pretty cool that it has a saw and a couple other things built in. It folds down into a really small carrying case.",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan",
      "helpful_votes": 0,
      "publication_date": 20180307
    },
    {
      "title": "Good multi tool/ don't expect to chop much with \"axe\"",
      "text": "Good multi tool. Don't expect to really chop anything with the blade. I'm going to sharpen mine to see if that helps but it's very light therefore doesn't cut easily. The other tools seem to be just enough for camping, etc...",
      "rating": 4.0,
      "verified": true,
      "author": "Optimus Clay",
      "helpful_votes": 0,
      "publication_date": 20170723
    },
    {
      "title": "Great tool",
      "text": "I primitive camp a lot, via canoe. This is a great shovel, very small. It's purpose in life is to dig my latrine, my fire pit and to cover both before shoving off the next morning. Couldn't ask for a better tool.",
      "rating": 5.0,
      "verified": true,
      "author": "Don Foley",
      "helpful_votes": 0,
      "publication_date": 20170404
    },
    {
      "title": "Perfect for camping",
      "text": "Nice camp shovel - utilitarian and takes up very little room. You'll have to wash and let the carry pouch out-gas. It has a very strong rubbery smell when you first get it. Other than that, this is a great item to have on hand while camping.",
      "rating": 5.0,
      "verified": true,
      "author": "Leslie Jensen",
      "helpful_votes": 0,
      "publication_date": 20171119
    },
    {
      "title": "Parts came rusted but sturdy tool",
      "text": "This seems to be a good addition for any camping trip. I tested both the blade and saw of the shovel on a 3 inch diameter piece of oak and both worked well. Would probably not use it on anything thicker. The shovel will do the trick for small jobs in softer or sandy soil - the pick worked as well. The main issue I had was with the middle handle piece arriving rusted both inside and on the threads. Since this product is no longer available I will be cleaning it up and adding a \"No Rust\" product to both of the handle pieces to fix and/prevent this from happening in the future.",
      "rating": 4.0,
      "verified": true,
      "author": "Tommy",
      "helpful_votes": 10,
      "publication_date": 20160322
    },
    {
      "title": "Great LITTLE shovel!",
      "text": "As long as you know what to expect...it's a great little shovel. Solid in hand, solid after handle screwed in, locks the shovel head or pick in open closed or 90 degree position. See my photos for dimensions. The case/cover is pretty weak, but will suffice for very casual use (stored in truck, behind truck seat, occasional camping, etc.)",
      "rating": 5.0,
      "verified": true,
      "author": "Benchtest",
      "helpful_votes": 2,
      "publication_date": 20160121
    },
    {
      "title": "Smaller than Expected",
      "text": "This shovel was much smaller than I expected. I was expecting the standard military size. This could be a benifit as it can be placed in a back pack. Seems durable enough but I haven't throughly tested it yet either. For the price it packs a lot of functionality. It may be tough to dig a Jeep out of a mud hole with it.",
      "rating": 3.0,
      "verified": true,
      "author": "Kevin Hoff",
      "helpful_votes": 0,
      "publication_date": 20170905
    },
    {
      "title": "This product is a rip off (I just had one ...",
      "text": "This product is a rip off (I just had one delivered) It fits in a 6 inch pouch and is a toy rather than an tool",
      "rating": 5.0,
      "verified": true,
      "author": "Billy J Stachowiak",
      "helpful_votes": 0,
      "publication_date": 20180506
    },
    {
      "title": "Solid. Good weight.",
      "text": "Nice packaging and carrying bag. Good weight. Doesn’t feel flimsy. Unit feels solid when assembled. I was surprised that the shovel is smaller than I expected. But a great size for camping or bug out bag.",
      "rating": 4.0,
      "verified": true,
      "author": "Gary C",
      "helpful_votes": 0,
      "publication_date": 20180129
    },
    {
      "title": "Excellent tool",
      "text": "Quite literally my most useful tool on my last hike/climb, saved my life twice. Caught on a tree root in a backslide, the pickaxe held firm. very sturdy, and the pouch has a little extra room for my striker and loose debris if you're in the habit of saving perfect tinder bits while you're hiking. Would definitely recommend this product again,",
      "rating": 5.0,
      "verified": true,
      "author": "Peter Margison",
      "helpful_votes": 0,
      "publication_date": 20160406
    },
    {
      "title": "... other wise as advertised and im sure will work fine also folds up into a surprisingly small bag",
      "text": "smaller then expected the shovel has next to no curve to it and im not sure i truse the threads that hols the handle together but other wise as advertised and im sure will work fine also folds up into a surprisingly small bag",
      "rating": 4.0,
      "verified": true,
      "author": "ethereal",
      "helpful_votes": 0,
      "publication_date": 20171004
    },
    {
      "title": "Way too small for my use.",
      "text": "It is TINY like a toy, I was shocked, I bought it for my jeep, for an emergency shovel, but it is way to small. It is actually a nicely made product, but not for my use. Maybe for a tiny hiker backpack it might be OK it is so, so small, But it is not what I thought it was and not big enough for my use. I had to send it back and start my search over,",
      "rating": 2.0,
      "verified": true,
      "author": "Rick Allen",
      "helpful_votes": 0,
      "publication_date": 20160111
    },
    {
      "title": "Not for the price.",
      "text": "Does what it intended to do. I keep this in the bag, car trunk at all times.",
      "rating": 3.0,
      "verified": true,
      "author": "LoveAllKindsOfGear",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "A neccesity when roaming about!",
      "text": "This E Tool came with only one side ground. You will need to grind the other side for best performance, love the bottle opener, have a cold one after the work!",
      "rating": 3.0,
      "verified": true,
      "author": "David C Brown",
      "helpful_votes": 0,
      "publication_date": 20180530
    },
    {
      "title": "Military Survival Folding Shovel and Pick",
      "text": "I really like this little shovel. It is very compact and is very well made.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert E. Richardson",
      "helpful_votes": 0,
      "publication_date": 20170812
    },
    {
      "title": "Love it!",
      "text": "This was a gift for my husband who has been wanting one to add to his \"survival kit\" and I must say that I am impressed! It's small enough to be put in his backpack, light enough to not add too much weight to an already heavy bag and its durable! Would most certainly recommend!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Kayla",
      "helpful_votes": 0,
      "publication_date": 20160813
    },
    {
      "title": "Good solid shovel with lots of cool extras",
      "text": "Great shovel, loved all the extras (fire starter, saw, etc). Used to dig catholes on a sandbar and it obviously worked well. Out is a bit heavy (1.5lbs) for backpacking probably. Currently looking for something lighter to take with on a hike. It got rusty after washing with dish soap and letting air dry.",
      "rating": 3.0,
      "verified": true,
      "author": "Briana",
      "helpful_votes": 0,
      "publication_date": 20171014
    },
    {
      "title": "Small with a punch.",
      "text": "Extremely nice shovel, but way too small for what I want when camping and off-roading. Still worth five stars because it is durable and constructed nicely. Would possibly buy later down the road for a young outdoorsman.",
      "rating": 5.0,
      "verified": true,
      "author": "Kiel",
      "helpful_votes": 0,
      "publication_date": 20170619
    },
    {
      "title": "Small but effective",
      "text": "I thought it'd be a little larger but it packs easily and is a useful tool for any backpacking, camping or mountaineering adventure. I dropped a star because I think they could have made it longer without too much trouble given the available interior space within the pole.",
      "rating": 4.0,
      "verified": true,
      "author": "paws",
      "helpful_votes": 0,
      "publication_date": 20160623
    },
    {
      "title": "Great value, and very sturdy",
      "text": "This is the most useful and versatile multitools I have had in any of my vehicles. Construction is very sturdy.",
      "rating": 5.0,
      "verified": true,
      "author": "Diggity Kid",
      "helpful_votes": 0,
      "publication_date": 20180307
    },
    {
      "title": "this is basically useless. I hit some rocks while digging and it ...",
      "text": "Unless you're trying to trowel away in your garden, or in some sand at the beach, this is basically useless. I hit some rocks while digging and it cracked part of the shovel. I kept using it and the handle bent, so that it no longer folded. Now that it was no longer folding or a shovel, it no longer served either purpose that I purchased it for. After doing some research, this brand doesn't even exist, and some company just assigned it to this product to make it look like a legitimate product. Try putting \"fobachi\" into Google. After complaining to the company I was given a partial refund omg...",
      "rating": 1.0,
      "verified": true,
      "author": "Grimnebulin",
      "helpful_votes": 4,
      "publication_date": 20161122
    },
    {
      "title": "Smaller than expected but appears to be a good quality tool in a nice little carrying case",
      "text": "Smaller than expected but appears to be a good quality tool in a nice little carrying case. Takes up little space on my quad runner. Haven't used it much yet , but will update my review when I have some experience with it.",
      "rating": 4.0,
      "verified": true,
      "author": "JAMES H LACEY",
      "helpful_votes": 0,
      "publication_date": 20160510
    },
    {
      "title": "Haven’t used this as of yet but it seems sturdy and well built",
      "text": "Haven’t used this as of yet but it seems sturdy and well built. I have played with it and it seems solid.",
      "rating": 5.0,
      "verified": true,
      "author": "Jonny",
      "helpful_votes": 0,
      "publication_date": 20180610
    },
    {
      "title": "Smaller than I expected.",
      "text": "I bought this for my Jeep just in case. I have not used it yet but it seems like it will be sturdy enough. it is very small however so if you're planning to use this shovel to dig out of prison you better have a life sentence to get the job done.",
      "rating": 4.0,
      "verified": true,
      "author": "Keith C.",
      "helpful_votes": 0,
      "publication_date": 20160422
    },
    {
      "title": "Strong, Metal, and Convenient.",
      "text": "Very well built, sturdy, all metal, and the tools are very convenient. I got this to keep in my car in winter for if i get stuck in a snow, and this is perfect for that. It's strong, easy to assemble, and packs away nicely in the carrying case making it easy to store in the car.",
      "rating": 5.0,
      "verified": true,
      "author": "T. Proctor",
      "helpful_votes": 0,
      "publication_date": 20160218
    },
    {
      "title": "Works well",
      "text": "Good shovel, very compact and lightweight. Fits into my day bag with no issues and while I really wish there was an extension for the handle, making it longer, I'm totally satisfied with this product.",
      "rating": 5.0,
      "verified": true,
      "author": "B. Wade",
      "helpful_votes": 0,
      "publication_date": 20170411
    },
    {
      "title": "Solid...",
      "text": "Very solid tool, there is no bending at all. It's compact enough to fit under my seat. The extra items are a nice bonus and the fire starter works on the first try. I added a few drops of oil on the threads and hinge mechanism just to keep everything nice and smooth.",
      "rating": 5.0,
      "verified": true,
      "author": "Tony A",
      "helpful_votes": 0,
      "publication_date": 20160308
    },
    {
      "title": "sort of on the  small size",
      "text": "should have paid more attention to size the shove part is about 3X as big as a hand trowel but will work in a pinch. Other wise the shoves seems fine",
      "rating": 3.0,
      "verified": true,
      "author": "Dixie",
      "helpful_votes": 0,
      "publication_date": 20180114
    },
    {
      "title": "Pretty darn good for a $25 folding shovel",
      "text": "Pretty darn good for a $25 folding shovel. I wouldn't put any real hard work to this, but having it packed in my truck gives me an extra sense of security. Be aware though, there is no \"bowl\" to the blade. You are pushing more then picking up dirt.",
      "rating": 4.0,
      "verified": true,
      "author": "Chris Winow",
      "helpful_votes": 0,
      "publication_date": 20160407
    },
    {
      "title": ".",
      "text": "Good thing to have in the car in areas with bad winters.",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew K",
      "helpful_votes": 0,
      "publication_date": 20181209
    },
    {
      "title": "Handy little shovel",
      "text": "Bought this to dig out some broken pipes under my house very tight quarters works great as described",
      "rating": 5.0,
      "verified": true,
      "author": "Marcus Barnett",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "tough things sometimes come in small packages!",
      "text": "a lot smaller than expected, however still useful and easy to store/carry. The seperate parts are also potential useful weapons.",
      "rating": 4.0,
      "verified": true,
      "author": "Scott MacKenzie",
      "helpful_votes": 0,
      "publication_date": 20171025
    },
    {
      "title": "but other than that the quality is great and its not cheap its strong metal and good ...",
      "text": "This shovel is smaller than expected, but other than that the quality is great and its not cheap its strong metal and good quality product.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161121
    },
    {
      "title": "Works for MTB trail maintainance.",
      "text": "This item is a spade that is perfect for carrying in my back pack. It does the job for very light trail work. If you are a mountain biker that likes to maintain your trails, this might just be the item for you to carry on your rides.",
      "rating": 5.0,
      "verified": true,
      "author": "CooperXP",
      "helpful_votes": 0,
      "publication_date": 20151018
    },
    {
      "title": "Not A Military Shovel!",
      "text": "This is not what I expected when it stated it is a military shovel. This is not a military shovel and should not be advertised as one. The ones we used in the Marines was 4 times the size of this shovel. It would work great in the flower garden but other than that is is basically useless to me. The quality is good but definitely not what I had expected to see when it arrived. When advertising in the US the measurements should be stated in Inches and feet, not metric.",
      "rating": 2.0,
      "verified": true,
      "author": "GJ",
      "helpful_votes": 0,
      "publication_date": 20160713
    },
    {
      "title": "Beautiful little shovel",
      "text": "Beautiful little shovel, pickaxe, emergency tool. Extremely well made and no size or weight problem I have put one in each car bag and my go bag.",
      "rating": 5.0,
      "verified": true,
      "author": "Frank C. Dayton",
      "helpful_votes": 0,
      "publication_date": 20170905
    },
    {
      "title": "Very heavy duty",
      "text": "I wasn't expecting this level of quality for the price. I was pleasantly surprised. Should last a long time",
      "rating": 5.0,
      "verified": true,
      "author": "Shawn",
      "helpful_votes": 0,
      "publication_date": 20160820
    },
    {
      "title": "Four Stars",
      "text": "Great little shovel for camping or the trunk of your car in case you get stuck.",
      "rating": 4.0,
      "verified": true,
      "author": "B. F.",
      "helpful_votes": 0,
      "publication_date": 20180614
    },
    {
      "title": "Better than my old boy scout shovel",
      "text": "It's well made and very versatile. I'm sure it will last many years of good service. The fine metal threads of the securing nut work well and enable the user to lock in a shovel position with robustness. I would recommend it to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris F.",
      "helpful_votes": 0,
      "publication_date": 20151106
    },
    {
      "title": "This is a very small shovel. I was expecting ...",
      "text": "This is a very small shovel. I was expecting the military size but it's about half the size. Other than that, seems well built.",
      "rating": 3.0,
      "verified": true,
      "author": "Randall Boddy",
      "helpful_votes": 0,
      "publication_date": 20161213
    },
    {
      "title": "Cheaply made",
      "text": "Arrived with the spear knife broken, obviously it’s made out of cheap material",
      "rating": 1.0,
      "verified": true,
      "author": "Amanda Nichole Villard",
      "helpful_votes": 0,
      "publication_date": 20190723
    },
    {
      "title": "Compact and very sturdy",
      "text": "The shovel is super compact and very sturdy and versatile. It might feel a little heavy but it is worth it if you want something that really works. Very good camping item.",
      "rating": 5.0,
      "verified": true,
      "author": "Lona",
      "helpful_votes": 0,
      "publication_date": 20160819
    },
    {
      "title": "It's great that it comes with its own bag and everything ...",
      "text": "It's great that it comes with its own bag and everything fits right in it. Perfect size and seems durable! I've only had it for a couple of months and used it maybe twice. So far so good!!",
      "rating": 5.0,
      "verified": true,
      "author": "John C.",
      "helpful_votes": 0,
      "publication_date": 20161115
    },
    {
      "title": "but I love how versatile it will be on a camping trip",
      "text": "taking it out this weekend, but I love how versatile it will be on a camping trip! Very sturdy and well made.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170523
    },
    {
      "title": "Rough threads on the handles",
      "text": "The threads on the handles are very rough. After several spritzes with a lubricating oil and about 20 minutes of twisting and twisting, I'm still trying to get the handles completely screwed together.",
      "rating": 3.0,
      "verified": true,
      "author": "Stevewf1",
      "helpful_votes": 0,
      "publication_date": 20160523
    },
    {
      "title": "I dig it!",
      "text": "Best shovel ever! I love the multiple uses and its ease of access. Great for camping trips and emergencies.",
      "rating": 5.0,
      "verified": true,
      "author": "Justin Knaus",
      "helpful_votes": 0,
      "publication_date": 20181011
    },
    {
      "title": "Solid tool.",
      "text": "The carry pouch seems a little cheap, but the tool seems solid and I expect years of service. I'm impressed with just how small this thing packs up. I'll likely be buying at least one more for leaving in the truck.",
      "rating": 5.0,
      "verified": true,
      "author": "R. T.",
      "helpful_votes": 0,
      "publication_date": 20160817
    },
    {
      "title": "Great little utility shovel",
      "text": "Great little utility shovel. Comes with a case that it folds/breaks down to fit into. Excellent for minimalist campers. 🙂",
      "rating": 5.0,
      "verified": true,
      "author": "KC Photographer",
      "helpful_votes": 0,
      "publication_date": 20170904
    },
    {
      "title": "It's like the size of a hatchet after you screw on ...",
      "text": "It feels durable & tough. I haven't used it yet so I don't know for sure but I believe it'll get the job done. It's like the size of a hatchet after you screw on the handle. I have no complaints.",
      "rating": 5.0,
      "verified": true,
      "author": "Briyan",
      "helpful_votes": 0,
      "publication_date": 20160418
    },
    {
      "title": "I love it.",
      "text": "It's solid. All metal parts fit together very tightly. I use it in my garden and for digging soil in side dirt lots. It can get you from point A to B if you have the time. I love it.",
      "rating": 5.0,
      "verified": true,
      "author": "ekingt",
      "helpful_votes": 0,
      "publication_date": 20170704
    },
    {
      "title": "Rugged shovel. Highly recommended",
      "text": "Very solid design & feel I was expecting flimsy metal. I'm delighted I was proven wrong! I expect this to last me years. In addition to camping I'm keeping this in my jeep emergency bug out bag.",
      "rating": 5.0,
      "verified": true,
      "author": "WranglerJKtrooper",
      "helpful_votes": 0,
      "publication_date": 20160801
    },
    {
      "title": "Small but appears well made.",
      "text": "This was much smaller than I realized, my fault for not reading. I would give it 5 stars if they sold a separate extension so I could have it be a touch longer.",
      "rating": 4.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 0,
      "publication_date": 20180607
    },
    {
      "title": "good design",
      "text": "Very nice design. Intelligently thought out. I use this for car camping. It's not light for long distance backpacking but works perfectly at a camp sight without taking up a lot of room in the car",
      "rating": 5.0,
      "verified": true,
      "author": "Alexandra B.",
      "helpful_votes": 0,
      "publication_date": 20160519
    },
    {
      "title": "Survival companion",
      "text": "I bought this to keep in my car survival kit. Has a ton of essentials in a single product. Would recommend for someone looking for a multi tool shovel.",
      "rating": 5.0,
      "verified": true,
      "author": "B",
      "helpful_votes": 0,
      "publication_date": 20160930
    },
    {
      "title": "$$$$Quality and affordable$$$$",
      "text": "Your search ends here. This is a high quality product for your money hands down. It's small for your pack yet durable for the job. I'm extremely happy with my purchase and I hope you enjoy it too.",
      "rating": 5.0,
      "verified": true,
      "author": "Ja Ja",
      "helpful_votes": 0,
      "publication_date": 20160226
    },
    {
      "title": "Very sturdy. Metal isn't thin so it shouldn't bend like ...",
      "text": "Very sturdy. Metal isn't thin so it shouldn't bend like other small shovels. Came with a small pouch to break it down and store. Handle grip is nice. Easy to assemble into a shovel, pick or both.",
      "rating": 5.0,
      "verified": true,
      "author": "Nick",
      "helpful_votes": 0,
      "publication_date": 20160108
    },
    {
      "title": "This is perfect for what I needed",
      "text": "This is perfect for what I needed. Slightly smaller than expected which is a good thing. It's easy storage is the key to having it when I need it. It is now in my vehicle extraction bag for trips to the beach. No more using my hands to dig out hot sand to help pull someone out.",
      "rating": 5.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 0,
      "publication_date": 20160313
    },
    {
      "title": "it was good.",
      "text": "The locking mechanism had some issue holding the shovel head in place. Beside that, it was good.",
      "rating": 3.0,
      "verified": true,
      "author": "M",
      "helpful_votes": 0,
      "publication_date": 20180410
    },
    {
      "title": "Now I can bury my poo like no other!",
      "text": "Great folding shovel for taking care of business in the wilderness.",
      "rating": 5.0,
      "verified": true,
      "author": "The Infamous",
      "helpful_votes": 0,
      "publication_date": 20160203
    },
    {
      "title": "Does not do what it's advertised to do",
      "text": "The locking mechanism does not stay secured when using the e-tool as a sort of pick axe. Makes it difficult to use efficiently, because you have to stop every 10 seconds to tighten the screw mechanism back down.",
      "rating": 2.0,
      "verified": true,
      "author": "Virginia Stanton",
      "helpful_votes": 0,
      "publication_date": 20160620
    },
    {
      "title": "Four Stars",
      "text": "sturdy and heavy for hiking, handle could be better grip for chopping",
      "rating": 4.0,
      "verified": true,
      "author": "Johnny",
      "helpful_votes": 0,
      "publication_date": 20171208
    },
    {
      "title": "Works great but has a SUPER strong smell",
      "text": "Works great but has a SUPER strong smell. Had to put it in a ziplock before putting it in the back of the car.",
      "rating": 4.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20171126
    },
    {
      "title": "Just finished using it on a camping trip. I ...",
      "text": "Just finished using it on a camping trip. I wish it was a bit lighter, but then it would not be as solid and reliable as it is.",
      "rating": 4.0,
      "verified": true,
      "author": "Steve Smith",
      "helpful_votes": 0,
      "publication_date": 20170912
    },
    {
      "title": "Much heavier duty than expected. Works exactly as advertised ...",
      "text": "Much heavier duty than expected. Works exactly as advertised and shown although I have to use any of the extras. So far only used as a shovel/firepoker.",
      "rating": 5.0,
      "verified": true,
      "author": "rocketsauce",
      "helpful_votes": 0,
      "publication_date": 20161005
    },
    {
      "title": "Amazing Multi Tool",
      "text": "Wow. I love this set up. Very compact but very heavy duty. Lots of tools combined into one package. A backpackers dream come true. If you like hiking or camping, this is a must for you.",
      "rating": 5.0,
      "verified": true,
      "author": "David W.",
      "helpful_votes": 0,
      "publication_date": 20160325
    },
    {
      "title": "Four Stars",
      "text": "A little smaller than I expected, but will store well in our travel trailer.",
      "rating": 4.0,
      "verified": true,
      "author": "James Baumgartner",
      "helpful_votes": 0,
      "publication_date": 20171021
    },
    {
      "title": "very good for intended purpose",
      "text": "it ok, kinda small, appears well built, very good for intended purpose.",
      "rating": 3.0,
      "verified": true,
      "author": "Ken C",
      "helpful_votes": 0,
      "publication_date": 20180511
    },
    {
      "title": "What I was looking for,!",
      "text": "Perfect for bug out bag. Very compact with ok quality.",
      "rating": 3.0,
      "verified": true,
      "author": "michael cooper",
      "helpful_votes": 0,
      "publication_date": 20180816
    },
    {
      "title": "A bit small.",
      "text": "This guy is a bit too small for digging, unless you're in sand. It's convenient, tho!",
      "rating": 3.0,
      "verified": true,
      "author": "Luvinlife",
      "helpful_votes": 0,
      "publication_date": 20161016
    },
    {
      "title": "I LIKE IT.",
      "text": "MAKE SURE YOU ARE AWARE OF THE SIZE...ITS SMALL BUT MIGHTY...IT REALLY DEPENDS ON YOUR FRAME OF MIND AND USE'S YOU PLAN TO DO WITH THIS VERY SMALL SHOVEL....I LIKE IT ..EASY TO CARRY...VERY TUFF...",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Gentile",
      "helpful_votes": 0,
      "publication_date": 20170127
    },
    {
      "title": "it's perfect for the beach and building sand castles",
      "text": "I tried using this shovel to build a small trench to sleep in, and had nothing but problems. The dirt was fairly soft, and the shovel is too small to efficiently dig with. However, it's perfect for the beach and building sand castles.",
      "rating": 3.0,
      "verified": true,
      "author": "James Musick",
      "helpful_votes": 0,
      "publication_date": 20160422
    },
    {
      "title": "Five Stars",
      "text": "Good quality, it's a shovel it does what a shovel is ment to do lol.",
      "rating": 5.0,
      "verified": true,
      "author": "Jared",
      "helpful_votes": 0,
      "publication_date": 20170127
    },
    {
      "title": "fit and finish is excellent.",
      "text": "i have not used it yet, but I put it into every position and it appears to be very well built. Edges of shovel are very sharp, fit and finish is excellent.",
      "rating": 4.0,
      "verified": true,
      "author": "Bowtie29",
      "helpful_votes": 0,
      "publication_date": 20160310
    },
    {
      "title": "Four Stars",
      "text": "Kinda small but seems like decent quality and good for a backpack.",
      "rating": 4.0,
      "verified": true,
      "author": "Ryan",
      "helpful_votes": 0,
      "publication_date": 20171106
    },
    {
      "title": "Good for the snowy season",
      "text": "Always put OUT your camp fire, all the way out! Good for the snowy season also",
      "rating": 5.0,
      "verified": true,
      "author": "BJones",
      "helpful_votes": 0,
      "publication_date": 20161206
    },
    {
      "title": "Made very well, just a little small...",
      "text": "It's a little small for any kind of serious digging, but OK for putting out campfires and such..",
      "rating": 3.0,
      "verified": true,
      "author": "Norma Lopez",
      "helpful_votes": 0,
      "publication_date": 20170131
    },
    {
      "title": "but does appear to be sturdy.",
      "text": "The photo and description lead one to believe this is similar in size to a US Army surplus folding shove. It is about half the size, but does appear to be sturdy.",
      "rating": 3.0,
      "verified": true,
      "author": "Roger Rayda",
      "helpful_votes": 0,
      "publication_date": 20180130
    },
    {
      "title": "great to carry",
      "text": "compact easy to carry and use. breaks down to compact size and has case for carrying. nice actually.",
      "rating": 5.0,
      "verified": true,
      "author": "Joyce E. Stoesser",
      "helpful_votes": 0,
      "publication_date": 20160423
    },
    {
      "title": "Great for camping.",
      "text": "First of this shovel is smaller than the military e-tool you might expect but it is rugged, well built and completely as functional.",
      "rating": 5.0,
      "verified": true,
      "author": "Will",
      "helpful_votes": 0,
      "publication_date": 20160507
    },
    {
      "title": "Five Stars",
      "text": "This is very good quality for the price, I carry it in my off-road vehicles and off-road motorcycle",
      "rating": 5.0,
      "verified": true,
      "author": "That 1 guy",
      "helpful_votes": 0,
      "publication_date": 20170528
    },
    {
      "title": "Nice compact shovel",
      "text": "This is an ideal small shovel to keep in a vehicle in case you get stuck in snow or mud. You're not going to dig yourself out of a snow bank with it but if you're stuck on a trail it's going to do the job and then some.",
      "rating": 5.0,
      "verified": true,
      "author": "James McCabe",
      "helpful_votes": 0,
      "publication_date": 20160414
    },
    {
      "title": "Good Shovel",
      "text": "Very nice shovel. The head was a little smaller than I expected but shovel is very nice quality. Would recommend",
      "rating": 4.0,
      "verified": true,
      "author": "Albert",
      "helpful_votes": 0,
      "publication_date": 20161117
    },
    {
      "title": "I was pleased with this product",
      "text": "I was pleased with this product, bit smaller than what I was issued in the USMC but appears to be duruble and services my purpose",
      "rating": 5.0,
      "verified": true,
      "author": "phillip waalkens",
      "helpful_votes": 0,
      "publication_date": 20160419
    },
    {
      "title": "Five Stars",
      "text": "Cool little shovel. It will fit anywhere and I think everyone should have one.",
      "rating": 5.0,
      "verified": true,
      "author": "Maverick",
      "helpful_votes": 0,
      "publication_date": 20170906
    },
    {
      "title": "bought this as a just in case needing to dig ...",
      "text": "bought this as a just in case needing to dig something. very compact, i used this once on snow gave me no problems",
      "rating": 5.0,
      "verified": true,
      "author": "EL",
      "helpful_votes": 0,
      "publication_date": 20160210
    }
  ],
  "product_meta": {
    "title": "FOBACHI Military Survival Folding Shovel and Pick with Carrying Pouch for Camping, Hiking, Backpacking, Fishing, Tactical Army Surplus Multitool, Trench Entrenching Tool, Car Emergency Shovel",
    "description": "The Fobachi Mini folding shovel is an ultra lightweight, smart multi-function, super compact tools for your gardening and Outdoor activities. \n\nHandles of the folding shovel fold twice. It has a extension pipe that can be added as needed. It is made to be compact in size when folded so it can easily be packed on a camping or beach trip or carried out to the garden. It comes in a convenient carrying pouch with a loop so the shovel may attach to a belt or backpack. \n\nMade of strong tempered forged steel, the shovel measures 24.8\" (63cm) long when unfolded, include a serrated on one side of the blade so it can be used to saw off lightweight branches. \n\nThe Folding shovel can be used to dig tires out of dirt if a car becomes stuck. These tools also make mini snow shovels for digging tires out of snow banks. It include a pick tool that can help crack ice or remove rocks. Since it's so compact and space-saving in design, a folding shovel is a great tool to have in any vehicle. The shovel can even be used to build sandcastles complete with trenches during trips to the beach. \n\nTrenching shovels are another name for the folding shovel since its pointed type of blade makes it suitable for digging trenches around campsites to collect water away from the campsite. A folding camping shovel can also be used to scoop out rocks and flatten a surface for a tent as well as dig holes for tent stakes. Folding shovels can also be used to create a fire pit. A folding mini shovel is often used in gold panning to scoop and dig through rocks to search for pieces of the valuable mineral. \n\nMaterial: high-carbon steel body and steel handle. \nTotal unfold length: approx. 630mm. \nFolding length: approx. 175mm \nWidth: approx. 110mm. \nPickaxe length: approx. 120mm. \nWeight: approx. 670g.",
    "rating": 4.1,
    "feature_bullets": [
      "Multi-function: digging, sawing, chopping, cutting, picking, prying, hammering, bottle opening, shoveling.",
      "Material: high-carbon steel body and steel handle.",
      "Accessories Includes: extension pipe(can be added as needed), fire starter, whistle, life hammer, sawtooth knife, rubber grip handle and thickened spade.",
      "Foldable with a carrying pouch with a loop so the shovel may attach to a belt or backpack.",
      "The military original issue e-tool entrenching shovel can be used either straight or at a 90 degree angle."
    ],
    "specifications": {
      "Date First Available": "September 5, 2017",
      "ASIN": "B075D846ZR",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Outdoor Recreation",
      "Knives & Tools",
      "Sports & Outdoors",
      "Shovels",
      "Camping & Hiking"
    ],
    "price": ""
  }
}