{
  "website_summaries": [
    {
      "verdict": "Simple dog ID tag that has printing on both sides for easy-to-read identification.",
      "pros": [
        "Uses polished stainless steel in the tag to create a mirror finish that's attention-grabbing",
        "Offered in 2 sizes",
        "Uses a laser engraving method of personalizing the tag, so the printing will remain visible over time",
        "Select up to 4 lines of text per side of the tag",
        "Good price point"
      ],
      "cons": [
        "Thin wire ring that ships with the tag will not hold up well under stress"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Pet Tag Unreadable After 6 Months",
      "text": "I received the tag in December 2015. The tag arrived quickly, with the correct information. Now, less than 6 months later, the information on the tag is all but invisible. Apparently the engraving is very shallow or non-existant? The easily readable (and erodible) black paint has worn off.",
      "rating": 1.0,
      "verified": true,
      "author": "Eric",
      "helpful_votes": 519,
      "publication_date": 20160516
    },
    {
      "title": "Stains my dog's coat",
      "text": "As mentioned by many reviewers, the attachment ring that comes with the tag is way too weak. Ours lasted three days. I had other rings in my junk box, so fixing it wasn't a big deal for me, but I shouldn't have had to do it. The real problem is that it stains my dogs coat an unattractive gray. This stain does not wash out with standard pet shampoo. I'm not a metallurgist, but I've never seen stainless steel that goes from bright to pewter gray in a few weeks. The whole tag is dull now. Certainly not 18/8 or something else decent. I'm replacing this tag with something else.",
      "rating": 1.0,
      "verified": true,
      "author": "RK",
      "helpful_votes": 168,
      "publication_date": 20170423
    },
    {
      "title": "Can't Even Read... Tag and Font Size Way Too Small to Read.",
      "text": "I ordered a heart for my cat. They say they are appropriate for dogs and cats. They sell 2 sizes and since they also make them for dogs (retrievers and labs), i thought the smaller size would be appropriate for my medium/small sized cat. I relied in large part on the 4.8 score on over 10,000 reviews in deciding to buy. I find that hard to believe after seeing what the tag they made. The text is so small, you can't even read it. If nothing else, the seller should have layout guidelines and suggest character limits based on what fits on various sized/shaped tags.",
      "rating": 1.0,
      "verified": true,
      "author": "Randy R",
      "helpful_votes": 75,
      "publication_date": 20170403
    },
    {
      "title": "My Tags Were Not Engraved!",
      "text": "Received my two tags yesterday and was disappointed to see that they are NOT engraved but had my pet's name and my information stamped on the tag in bronze lettering. The lettering was already wearing off on the packing slip the tags were sent in so I don't expect the lettering will last very long. A waste of money!",
      "rating": 1.0,
      "verified": true,
      "author": "Nooni",
      "helpful_votes": 69,
      "publication_date": 20161203
    },
    {
      "title": "took pictures and wasted time for nothing",
      "text": "tag was defective but seller didn't offer a replacement bc I missed the 14 day mark. took pictures and wasted time for nothing. disappointing...",
      "rating": 1.0,
      "verified": true,
      "author": "KKF",
      "helpful_votes": 199,
      "publication_date": 20151028
    },
    {
      "title": "Incorrectly described—tag is NOT engraved",
      "text": "I specifically chose this seller because it stated in the description several times that the front a back are \"engraved.\" It is NOT engraved, but rather printed. The tag itself feels sturdy and is a good size, but I have no doubt this will last, at most, a couple months and be unreadable. As I pulled it out of the envelope, my nail came into contact with the tag and immediately scratched off part of my pet's name. Classic \"you get what you pay for\" type of purchase. Lesson learned and I'm back to square one.",
      "rating": 1.0,
      "verified": true,
      "author": "Franny Glass",
      "helpful_votes": 7,
      "publication_date": 20200815
    },
    {
      "title": "Tag is great but does not appear to be engraved as advertised",
      "text": "The tag looks great when received with nice black lettering although the lettering is raised not recessed like it would be if engraved. Tag we have that is a year old for the other dog (same tag) is still readable although most of the paint is worn off and she only wears it on her collar when we travel or go for a walk. Ideal would be engraved/etched with paint in the etching, but that does not appear to be the case here.",
      "rating": 4.0,
      "verified": true,
      "author": "MikeF",
      "helpful_votes": 4,
      "publication_date": 20200722
    },
    {
      "title": "I don't like it.",
      "text": "For me, this is too small for my 7 pound dog. And it is not engraved at all, it is \"painted\" on letters which appear to be smearing after only a few days. The attachment ring is so very, very small, and the hole in the tag only fits a very, very small attachment ring. I would have paid much more for a true 5 star, deeply engraved, hi quality, and larger name tag for my dog. Obviously for $8 bucks I'm not sending it back, but I will be searching Amazon and other vendors looking for a higher quality product. I'm disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "ElvisG",
      "helpful_votes": 7,
      "publication_date": 20180604
    },
    {
      "title": "Bad quality, bad returning service.",
      "text": "The tag looks nothing like the photos. The font is not the same, it looks stretched and it is not even centered. I asked for a refund and I have to pay to send them back which will cost me almost as much as what I payed initially for the tag. I payed for something cheap and that's what I got... Petco has really nice ones, with a couple of options of fonts and at least it will be centered. Photos attached...",
      "rating": 1.0,
      "verified": true,
      "author": "Rosita Thinks",
      "helpful_votes": 20,
      "publication_date": 20160405
    },
    {
      "title": "Easy to read print, but falls off due to the metal ring.",
      "text": "The tag is great, allows for front and back printing in several shapes. I prefer the bone shape since I can print more on it. I put the dog's name and my cell on the front, also \"Microchipped\" , and my address and her county license # on the back. I had got another tag printed from the same company, but it fell off because the metal ring given with the tag is a bit flimsy and pulls open after a while. It would be great if the metal ring was of better quality even if they charge a few more cents so I wouldn't have to keep replacing the entire tag.",
      "rating": 4.0,
      "verified": true,
      "author": "Zen",
      "helpful_votes": 2,
      "publication_date": 20200830
    },
    {
      "title": "Engraving not centered, asked for refund",
      "text": "Received product yesterday, 10 days after ordering. Was disappointed to see that they had not centered the engraving on either the front OR the back, almost as if it was put into the machine crooked. I'm also disappointed that they shipped it anyway, after seeing it was not centered. It makes the tag look like the cheap ones they stamp at Animal Control. Quality of the actual tag is good, it feels sturdy and is chrome-shiny. If you have a large dog, you may want to use your own ring to attach to a collar - the one included is a little light for big dog play. Engraving is a little \"dull\" but still readable since it is black inside.",
      "rating": 2.0,
      "verified": true,
      "author": "Christine Herron",
      "helpful_votes": 0,
      "publication_date": 20200712
    },
    {
      "title": "Info will rub off after several months which defeats the purpose",
      "text": "I bought 1 for each of my dogs based on the fact that they were engraved and based on the high reviews. My dogs hike with me and love playing outside so I needed something durable. Sadly, these are NOT durable. 8 months later I can barely read the information. 12 months and all of the info is gone. The original engraved info is more of a light etch, not engraved - meaning the info will be rubbed off! ! I was afraid this would happen when I received it but I put too much emphasis on the great reviews. My bad",
      "rating": 1.0,
      "verified": true,
      "author": "V L.",
      "helpful_votes": 7,
      "publication_date": 20170706
    },
    {
      "title": "Rusty look, NOT engraved!",
      "text": "I had this tag before, but since the little hook is so flimsy it fell off. So I ordered it again, this time to attach it to my dog’s collar with a sturdy keychain circle. The quality definitely went down. Now, instead of engraving your dog’a name, it looks like they print press it with some materieal to make the metal rusty. You can definitely feel the extra surface of the text, it is not engraved - just the opposite: the text is bumpy. And I really dislike the rusty looked, I liked it much better when it was all shiny metal. Won’t be ordering again.",
      "rating": 2.0,
      "verified": true,
      "author": "noway",
      "helpful_votes": 3,
      "publication_date": 20181208
    },
    {
      "title": "Barely visible text, and less so after one week.",
      "text": "Just as the headline says. The seller listing shows dark clear text. The text on my tags looks colorless. I've purchased other brands in the past that were just as bad, but this tag looked more promising in the listing. My contact info on the reverse is even worse. I have no confidence I will get my dog back because of this tag. This is advertised as engraved, but etched would be a better description. The only thing I likes was the sturdiness of the stainless steel, but the product does not serve its purpose. You can compare the depth of the engraving on the rabies tag. That's what I'd hoped to get.",
      "rating": 2.0,
      "verified": true,
      "author": "Cherie",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "Extra ID for the Greys for home and Vacation",
      "text": "Nice tags, got a set for home and a set for the hotel we stayed at. A security thing for when you take your pets on vacation. If they get away, they know where you are staying. Also got some with the vets name at home on them, so if they got lost, they know where to find history for our pets. Got tags with where we adopted them from, since greyhounds have numbers in their ears as well and can be reunited with their family. 2nd time I have purchased this product from the vendor.",
      "rating": 5.0,
      "verified": true,
      "author": "Lawrence DeLuca",
      "helpful_votes": 0,
      "publication_date": 20200422
    },
    {
      "title": "Sharp looking tag, very pleased!",
      "text": "Before putting the tag on the collar I honestly didn’t know what I thought. I was under the impression that it was engraved (maybe it is or isn’t), but it looks like it’s something on the metal itself, like a sticker or something. However I am very pleased with the tag. It looks very sharp and seems to be very good quality. Our dog is our livestock guardian so he is outside and so far none of the environmental factors have hurt the tag, several weeks later it still looks brand new. Very pleased with this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Katelyn",
      "helpful_votes": 0,
      "publication_date": 20200609
    },
    {
      "title": "Quality product.  Looks Beautiful",
      "text": "Stainless Dog Tag with beautiful finish. Clearly etched with a laser makes for easy readability. This is a quality product and it arrived quickly. Although I have puppies they already had their tags. I purchased this to place on my small garage door remote, which I use this when I take neighborhood walks. Since it is a small the tag, one side is marked with my phone numbers and the other side has a lyric from favorite song. Again this is a very quality product and as it is manufactured from stainless steel, it should be extremely durable. Beautifully done. The small ring to attach to dog collar was in the envelope. Open the envelope fully to find it .",
      "rating": 5.0,
      "verified": true,
      "author": "Kath",
      "helpful_votes": 0,
      "publication_date": 20200626
    },
    {
      "title": "Great Quality",
      "text": "Arrive quickly. Ordered 2. Both came exactly as ordered. Thick, sturdy & looks great! Has message on both sides. Back side includes phone no., city/state & brief message - 4 lines total, all of which is legible and easy-to-read. Would recommend & likely time purchase again in the future.",
      "rating": 5.0,
      "verified": true,
      "author": "LacyJune",
      "helpful_votes": 2,
      "publication_date": 20200514
    },
    {
      "title": "Best tags EVAR!!!!",
      "text": "I’ve been rescuing dogs for 30 years now, and have bought a LOT of tags, and these are by far the finest quality I’ve EVER gotten. Flawless transaction from start to finish, and I REALLY appreciate the fact my deaf Girl’s tag seemed to be expedited on a fast track compared to my other goober kids tag. I don’t know if that was coincidence or deliberate, but it was incredibly appreciated. I will never buy tags for my fuzzy kids anywhere else. A+++++",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle L",
      "helpful_votes": 0,
      "publication_date": 20200705
    },
    {
      "title": "GARBAGE",
      "text": "placed order with line by line instructions. 8 line of text. what I got was all 8 lines squeezed into 5. with words bunched up without spaces in-between making it unreadable. a complete waste of money. can't even understand how it could be screwed up this bad. GARBAGE, then they send coupons REALY!!!!! have sent several e-mails to gotag but they don't even bother to reply. just how bad can you get ??",
      "rating": 1.0,
      "verified": true,
      "author": "magnacharger",
      "helpful_votes": 5,
      "publication_date": 20171211
    },
    {
      "title": "High quality, very attractive",
      "text": "— I'm very pleased with these stainless steel ID tags. I have miniature dachshunds so have to buy small-size ID tags so they don't drag on the ground. The double-sided personalization enabled me to get all the information I needed on the tag. We've had these about 6 weeks now, and so far they've held up beautifully. I would definitely order these again the next time I need ID tags. I got the small bow tie for my 11-pound male dachsie and the small flower for my larger (16 pounds) female. I put the name on one side and contact information on the other.",
      "rating": 5.0,
      "verified": true,
      "author": "LuvDachsies",
      "helpful_votes": 2,
      "publication_date": 20171216
    },
    {
      "title": "Not Engraved, Just Printed Onto Metal",
      "text": "These tags are NOT engraved but merely printed. And the attachment collar rings are too flimsy. I've ordered many collar tags before and these are far worse than any bought elsewhere. Why are they describing these as engraved when they're obviously printed? The ink even transferred to the tape holding them to the mailer! I returned 2 tags on the same order. This company only refunded me for one of the tags...beware...not an honest vendor!!",
      "rating": 1.0,
      "verified": true,
      "author": "beezoo",
      "helpful_votes": 0,
      "publication_date": 20200309
    },
    {
      "title": "Do your research before buying this one.",
      "text": "The tag is flimsy and does not meet expectations. We tried to return it but the seller wants us to pay for shipping which is going to cost half of what we paid for this product. Not worth the hassle.",
      "rating": 1.0,
      "verified": true,
      "author": "DEAL",
      "helpful_votes": 5,
      "publication_date": 20181018
    },
    {
      "title": "Great tags!",
      "text": "These GoTags Stainless Steel dog tags are great! My dog Jelly (Magellan--named after the explorer) is a great explorer. He also has a narrow head, so he tends to lose his collar in the woods. I needed durable tags that are affordable. In the past I have ordered inexpensive aluminum tags that broke (the rim of metal around the hole for the loop), and a more expensive, pretty, decorated stainless tag that lasted a couple of weeks. These tags are cute, sturdy, and can be engraved on both sides. I ordered four, and put them on 4 different collars. I'm hoping they last a full year! I expect they will!",
      "rating": 5.0,
      "verified": true,
      "author": "J.McG.",
      "helpful_votes": 0,
      "publication_date": 20201009
    },
    {
      "title": "Custom Name tag",
      "text": "This is the second time I've ordered my cat's name tag from GoTags. The ordering process is simple for the text you need on the tag, nice selection of sizes and shapes. As you can see, I added bling to the printed name and around it and I'm very happy with how it turned out. I only used the 1 line of text so his name would be nice and big. Although my order status never updated to show it was delivered, it arrived in just a few days. As this tag wears over time or I feel like blinging a new one, I will definitely reorder again.",
      "rating": 5.0,
      "verified": true,
      "author": "Punahele",
      "helpful_votes": 0,
      "publication_date": 20200717
    },
    {
      "title": "Nice tag, flimsy ring",
      "text": "The tag itself is nice, letters are easy to read, but the round ring that came with it to attach to the collar is completely flimsy. I noticed it when I first put it on him, but what happened next was really dangerous. Our dog got it caught on his crate while we were gone and it could have ended pretty bad. It was mangled and we found it laying on the floor next to the crate. We are very grateful he didn’t swallow it or hang himself. I would not order this again. Buyer beware",
      "rating": 1.0,
      "verified": true,
      "author": "RTNJP",
      "helpful_votes": 0,
      "publication_date": 20191112
    },
    {
      "title": "Not really engraved. Printed on letters.",
      "text": "These are not engraved as advertised. Contacted seller after I received and they informed me they are LASER engraved and will last as long as the surface doesn’t get damaged. How is a dog tag going to stay pristine jingling and jangling around my bouncing dogs neck all day. Complete scam.",
      "rating": 1.0,
      "verified": true,
      "author": "SJ",
      "helpful_votes": 5,
      "publication_date": 20180427
    },
    {
      "title": "Really like these tags",
      "text": "Really do believe that the integrity of the tag is strong, durable, and easy to order - the little envelope that they came in was very nicely put together as well - My only thought is that if you could do (2) sizes of tags - naturally, you wouldn't have as much room/words, but for my (2) kitties, these tags are large, and so it bugs them to hang so much lower than the other tags - truthfully, I didn't think about that part when I ordered them, or I would have checked into it more, That said, these are well made. Thank you.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Oyler",
      "helpful_votes": 0,
      "publication_date": 20200927
    },
    {
      "title": "Not engraved and not legible...",
      "text": "I was so excited to receive our puppies name tag in the mail only to discover that the tag says \"Noma\" instead of \"Norma\". On top of that the details on the tag are not engraved, just stamped on. Very sad and this order will go back.",
      "rating": 1.0,
      "verified": true,
      "author": "Nick",
      "helpful_votes": 2,
      "publication_date": 20200718
    },
    {
      "title": "VERY PLEASED WITH THIS PRODUCT!!!!",
      "text": "This item just arrived today so I can’t speak for how it lasts overtime. However, I’m very impressed with its quality! I’ve ordered these cheap collar tags before and the engraving has always worn off very quickly. I don’t expect that to happen with this one. It feels very durable. The engraving is thick and quality looking. The ring the collar came with is also very sturdy and durable whereas most collar tags I’ve bought have the cheap rings that never stay tight, enabling the tag to fall off eventually. VERY PLEASED WITH THIS PRODUCT!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "DMC",
      "helpful_votes": 0,
      "publication_date": 20200711
    },
    {
      "title": "Great tag quality, well done!",
      "text": "We just adopted a senior dog and needed to get him an updated tag. They give you plenty of space on both the front and back of the tag to list important information. The tag was delivered earlier than expected which is always nice, but the quality is great! The lettering is strong, easy to read, and seems durable. I guess we'll see about that in the long run. Great value for price, very easy to order! (We didn't think to take a pic of the tag prior to having it on him so apologies for the blurry picture!)",
      "rating": 5.0,
      "verified": true,
      "author": "Erin Rose",
      "helpful_votes": 0,
      "publication_date": 20200910
    },
    {
      "title": "Might be etching, but not engraving",
      "text": "I expected a stainless tag that had engraving, which I define as the letters being cut into the steel. This tag has what appears to be etching, which sits \"over\" the steel - so how it will wear (off) is yet to be determined. It does look nice, but what the future brings will tell whether we need to get a tag that is truely engraved.",
      "rating": 3.0,
      "verified": true,
      "author": "Livininthewoods",
      "helpful_votes": 0,
      "publication_date": 20200724
    },
    {
      "title": "Fast shipping, quality tag, clever packaging, attachment ring too large",
      "text": "Great experience overall! Easy to read, fast shipping, accurate, good quality, and clever packaging. The only concern is the ring to attach the tag to our cat's collar was too large. So, when our cat was licking his chest, his (admittedly large) fang got caught in the ring which pinned his lower jaw to his chest. (Yes, the collar was fitted properly.) Luckily, he was inside and I was home, but it was difficult getting the collar off to free his tooth/jaw while he panicking. I moved the tag to the smaller ring that holds the bell on his collar and everything has been fine since then.",
      "rating": 5.0,
      "verified": true,
      "author": "Stalphonzo",
      "helpful_votes": 0,
      "publication_date": 20200707
    },
    {
      "title": "Love It",
      "text": "A little before Christmas I lost my Husky. Somehow he got out of our backyard. He was missing for a week. So I drove to all the local shelters. No Raider Austa. I post on all social media networks. Nothing. Then I printed out flyers and posted around my neighborhood. Finally Christmas Eve I got him back. Now he has tags plus he’s microchipped as well. I recommend this company. I would buy from them again and he came early",
      "rating": 5.0,
      "verified": true,
      "author": "Tasha",
      "helpful_votes": 0,
      "publication_date": 20200305
    },
    {
      "title": "Easy to read, holds a lot of info, great value for the price",
      "text": "I usually go into a pet store and use the kiosk when I need new tags for the dogs. Because of COVID-19, though, I haven’t been going into any stores (family members are in the high risk group) so I had to shop online. I was pleasantly surprised at how the tags turned out. Frankly, I didn’t expect them to look this good, especially since they were so inexpensive. They’re much easier to read than the ones I’ve gotten at the kiosks and they hold more information. They arrived a day earlier than I expected, too. I’ll be ordering these again the next time I need new tags.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "Great and quicker than I thought!",
      "text": "Just got my tag today much sooner than I expected. It looks to be well made, easy to read, and should be real durable. I think it's etched and not just painted. I will revise down my review if it turns out to be just paint and the lettering scratches off, but my first impression is that this is a great product that should be real durable. I plan to order a new one every year whenever I get a new Rabies or county license tag for the dog. It's better than having 3 tags jingling around, to just have all the info printed on one nice tag front and back. Much easier to read, and quieter too.",
      "rating": 5.0,
      "verified": true,
      "author": "Timmayyy",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "Great!",
      "text": "This name tag is super sleek, sturdy and easy to read. Its also the perfect size, without looking too big/bulky on my small dog. The color will go with any collar and we've gotten many compliments on it, it just looks a little off in the photo because of the flash. Definitely a great price for such a great quality tag! Also, there was an issue with the shipping and my initial package got lost :( but whenever I messaged the seller, they were super understanding and I received a replacement within a week (which is a big deal since it was during the christmas time frenzy). So not only was the tag beautiful, but so is the customer service!",
      "rating": 5.0,
      "verified": true,
      "author": "Mya",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "My dog is a little confused since I started calling her Tucker.",
      "text": "Just kidding. This was a better purchase than I expected. I have a Mini Dachshund so we wanted something small. The small heart is a bit bigger than my thumb nail, the finnish is bright and shiny and looks as though it will last a long time even jingling against her license and rabies vac tag. The lettering is clear and easy to read even though it's quite small. The order took only a couple days. I don't know who that John Smith guy is but I googled 55 D Street Northwest, Ephrata, WA and lets just say I hope Tucker is bigger than my dachshund. kind of a rough neighborhood. (it might be an empty lot by now.)",
      "rating": 5.0,
      "verified": true,
      "author": "Pete from Mass",
      "helpful_votes": 0,
      "publication_date": 20181002
    },
    {
      "title": "VERY Nice Dog ID Tag!",
      "text": "This is a very durable and nice dog tag. I think it will hold up nicely! Of course, over time as it rubs against the other tags my dog wears, it will wear down. That is inevitable. But the engraving is actually engraved and not just printed on the tag so I know it will last. I turned the writing of my phone numbers to the most outerward tag so it won't rub against the other tags. That should help it last. But honestly people....it's less than EIGHT DOLLARS to protect you beloved pet. If it only lasts a year or two, SO WHAT? That is a pretty cheap price to pay for your baby!!",
      "rating": 5.0,
      "verified": true,
      "author": "Lewisfamily503",
      "helpful_votes": 0,
      "publication_date": 20200207
    },
    {
      "title": "How cute",
      "text": "First this is tag is just cute. I bought the house and had our dogs name printed one side and under it I wrote”I want to go home”. I put our address and our phone number and my cell number saying to text me there. It’s about the same size as his chip disk and the his license and they all hang together perfectly. I bought the small size and maybe the larger one might have been better, but we like the small one for our rather terrier. I hope we never have to use it, but if we do I think with all his ID he is covered.",
      "rating": 5.0,
      "verified": true,
      "author": "Sandra V. Henson",
      "helpful_votes": 0,
      "publication_date": 20200616
    },
    {
      "title": "Customize how you want. Sturdy.",
      "text": "I love these. 2nd time ordering them. Very easy to order. Quick delivery!!! My Greyhound lost his, just gone one day. And for my Lurcher, I needed to correct her chip#. I had missed a digit on the 1st order. (*I searched back to the initial order and you had sent an email questioning the chip#, but I never saw it. Sorry. My fault.) Here are Whiskey and Boots. Both rescues. He's my handsome 4yo blue Greyhound. I adopted him, foster fail, Oct 2019 from the China meat trade. She's my beautiful 6yo brindle Lurcher. (Greyhound & JRT) I adopted her Mar 2015 from the flooded streets of Puerto Rico.",
      "rating": 5.0,
      "verified": true,
      "author": "Michaella Steiner",
      "helpful_votes": 0,
      "publication_date": 20200812
    },
    {
      "title": "Great engraving. Well worth the money which was a wonderful price",
      "text": "Our Furbaby Zoe has gotten out of our back yard. I ordered this and it meets my expectations. Great engraving. Easy to read on BOTH SIDES of the tag. She just got out again yesterday and thank goodness I purchased this tag. Being on a canal in FL is dangerous for pets. Our neighbors found her heading right into the canal. They were 10 houses down so they don’t know us. They said they loved how much information was on both sides of this tag. They went to order 1 for their 2 fur babies.",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle Holt",
      "helpful_votes": 0,
      "publication_date": 20200903
    },
    {
      "title": "Very nice product",
      "text": "I bought 24 of these for various uses. We have several ATVs, side-by-sides, a tractor, pool shed, out buildings, etc. I bought two for each so I always know where the spare is and to what building/vehicle it belongs. We always name our stuff for fun and have little vanity plates so we know what is what especially since some are identical because they are the same make/model/year. The hole is a little small and has a bit of difficulty with the larger rings but that is to be expected since I am not using these as a dog tag. The printing is well done and clear. the tag, itself, is a good gauge. I would buy them again.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason M. Massaro",
      "helpful_votes": 0,
      "publication_date": 20190826
    },
    {
      "title": "Check your data twice.",
      "text": "These tags are heavy duty and deeply engraved. They are also big enough for your name, address and phone. I dont think they will wear out like my dogs existing tags have. Also, even though I transposed two digits of my own phone number when I ordered this product, Gotags went the extra mile and sent me a corrected tag. I am ordering another today for my other dog whose ID tag is now unreadable after 2 years. Great vendor!",
      "rating": 5.0,
      "verified": true,
      "author": "Janet O.",
      "helpful_votes": 0,
      "publication_date": 20191130
    },
    {
      "title": "Great Tag",
      "text": "This is one of the best products I have ever purchased on Amazon. This is a strong and very durable tag. I bought the bone shaped one for my Stafford shire Terrier. That shape seemes to show off his name in a bigger way due to it's size. I would recommend this company and this product most definitely. Thanks so much for a serious great tag for my fur kid. I used a plastic zip type tie to attach it to his collar, as they have worked better than the little metal loop for my dogs in the past.",
      "rating": 5.0,
      "verified": true,
      "author": "Toni",
      "helpful_votes": 0,
      "publication_date": 20200702
    },
    {
      "title": "Sturdy, visible printing to keep your pet safe",
      "text": "I ordered this tag for our blue heeler, who sometimes wanders out of sight here on our farm while we’re out working or just walking. Just in case he gets lost, we have his name, our address and two phone numbers on this tag. The tag came in about a week and I’m very pleased with the silver tag and crisp black type on it. We ordered a tag from a different company once, and the words rubbed off in a few months as the tag jingled against his rabies tag. So far this one seems much sturdier and long lasting.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa Kearns",
      "helpful_votes": 0,
      "publication_date": 20200329
    },
    {
      "title": "Great Quality! VERY Pleased!",
      "text": "Just got my first puppy in 40 years! Over the moon excited at new addition to our family. One of the first things I bought him ... mostly out of fear of him getting out ...was the ID tag. I was thrilled with the quality of the product! It's sturdy and easy to read. My dog is a small breed so I bought the smallest size. I love it! It's perfect for now but also something he will grow into! I highly recommend this product. PS ... It even arrived earlier than expected!!! Kudos!",
      "rating": 5.0,
      "verified": true,
      "author": "siney60",
      "helpful_votes": 0,
      "publication_date": 20200913
    },
    {
      "title": "Didn’t meet expectations, sadly",
      "text": "I’m only giving three stars as the description is not correct. It is definitely NOT engraved or etched INTO the metal. It is raised and almost like a chemical burnt letting. Simular to acid washing onto a mirror but black not frosted (I hope you understand what I mean here..like frosted or a design onto a window or mirror). It is also off center on the lettering. Which won’t bother me like a crooked painting because I’m not going to be looking at it all the time. Just didn’t meet expectations all around. We’ll see how long it lasts.",
      "rating": 3.0,
      "verified": true,
      "author": "Megan",
      "helpful_votes": 0,
      "publication_date": 20181217
    },
    {
      "title": "Ok for the price , not a forever tag",
      "text": "Its alright for what its worth, shouldnt expect much from a 7 dollar personlized tag. But it will do for now for us. He doesnt wear his collar unless we go outside for a walk in case he somehow gets loose, so im sure that will help it last longer. It looks like the engraving could be easily erased. However i recieved what i paid for, i wasnt expecting a goldmine with the price i paid, but it will do its job",
      "rating": 3.0,
      "verified": true,
      "author": "Kelsey eliz",
      "helpful_votes": 0,
      "publication_date": 20190914
    },
    {
      "title": "Shallow engraving not suitable for years of wear.  However, far superior to aluminum.",
      "text": "Shallow engraving not suitable for years of wear. However, far superior to aluminum. These will serve my purpose of being used for guest pets 2-3 weeks per year. The Laser engraving and paint which forms the characters is very shallow. The thickness of the Large Bone tag material is 0.121mm. The depth of the engraving is so superficial that it can not be measured. I do not believe that these would serve well for years of wear on a dog collar or for use on a key chain. They are attractive and the order was accurate/received within a few days.",
      "rating": 3.0,
      "verified": true,
      "author": "JGAmazon",
      "helpful_votes": 2,
      "publication_date": 20180102
    },
    {
      "title": "Now if our cat would just wear his collar",
      "text": "We ordered a small tag for our new kitten. It's stainless steel and, although we included a lot of information, the text is very legible. Being able to have text on both sides of the tag was especially beneficial for us because we listed several phone numbers and that he's microchipped besides his name. There was even enough room to have \"Poop. I'm lost.\" on it. Very please with this tag! We just have to get our cat to wear his collar now...",
      "rating": 5.0,
      "verified": true,
      "author": "SupportOurTroops",
      "helpful_votes": 0,
      "publication_date": 20200822
    },
    {
      "title": "This is awesome!  Exactly as shown, perfect.",
      "text": "I have a pomchi dog, which is quite small so I was looking for something not heavy or overbearing on my little dog. I was so surprised and satisfied when this came. There are no flaws in the material or workmanship and the size is perfect for my little companion. I was afraid with four lines on the smaller tag, that it would be difficult to read. And it is not. It is so well done and I am singing praises for the manufacture. I have been passing this on to my friends with pets!",
      "rating": 5.0,
      "verified": true,
      "author": "Shelly Alger",
      "helpful_votes": 0,
      "publication_date": 20200912
    },
    {
      "title": "Clear engraving, generous spaces",
      "text": "Great tag! I appreciate the number of spaces and lines it allows you to add. Besides the dog’s name, my name and address, I added my phone #, son’s phone # and my local vet’s phone number as well. The envelope it came in could possibly look like junk mail so make sure to watch your mail closely so you don’t miss it. The envelope was marked. I also bought a tag for my boyfriend’s dog and had it sent to him and I worried he might mistake it for junk mail and pitch it before opening it but he didn’t.",
      "rating": 5.0,
      "verified": true,
      "author": "H. B.",
      "helpful_votes": 0,
      "publication_date": 20200626
    },
    {
      "title": "appears more printed than engraved",
      "text": "Very helpful customer service, my order was lost and they resent immediately with no charge. I ended up going with another product after receiving this, because it appears more printed than engraved. I understand it is engraved, but it was the appearance of not being that made me want something more long-lasting. what you get looks exactly like the photos in product description, digital printed letters, should not be a surprise. But when I received, I decided I wanted true deep engraving. I would still recommend this to someone who wants exactly what is pictured.",
      "rating": 4.0,
      "verified": true,
      "author": "A",
      "helpful_votes": 0,
      "publication_date": 20191020
    },
    {
      "title": "Yes, it's worth it.",
      "text": "For the price I was happily surprised. The writing I figured would be printed on, but no. It's embossed. The pigment may fade, but the message will remain lol. Mine says \"Hi, my name is Miricle I'm scared and lost. Can you help me? Please turn over. \" And on the other side it has my and my wife's names with both our phone numbers. I shared that, because it seems like a pretty good template, and fits the available letters. I'm gonna double check when I get home from work, but I'm pretty sure that's the wording I used. The package also arrived well ahead of schedule with no issues at all.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Biggerstaff",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "Ok but NOT engraved! Caution if buying for durability...",
      "text": "Tag is bright and shiney, text is clear and easy to read. BUT! I do not believe it is engraved... The text looks and feels \"raised\" on the surface instead of \"cut in\" to the metal. This is not engraving! Looks more like stuck-on lettering. Thus l do not believe the lettering will last very long. If l am incorrect then maybe the seller could include a photo of their engraving machine ??? Happy to rewrite if seller can show it is engraved But, sorry, until then l can NOT recommend this product!",
      "rating": 2.0,
      "verified": true,
      "author": "Nicc",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "Have to question all those reviews.",
      "text": "I always wonder when a product has a very large number of glowing reviews, can they all be real? Well, in my case I have to seriously question the validity of all these reviews and the company itself. We received our dog tag in a reasonable amount of time and without any visible damage so that was good. However, it is worthless and cannot be used. The fact that the text is not centered is rather annoying, but what makes the product unusable is the font and engraving process used makes our phone number unreadable. Without a readable phone number, a dog tag loses it functionality completely.",
      "rating": 1.0,
      "verified": true,
      "author": "P.J.",
      "helpful_votes": 0,
      "publication_date": 20190312
    },
    {
      "title": "Excellent product and customer service!",
      "text": "We very much liked both the product and the service given by Go Tags. We have two Bullmastiff ladies-a Mom and her daughter that we rescued. There were many choices of tags on the internet but something set this company apart. We were right, because after ordering the dog tags-rectangle-the company contacted us to tell us the phone numbers were slightly different on each tag, and wanted to know if that was what we wanted. It wasn’t-we corrected it. I wonder how many companies would have noticed and would have made contact with the customer.",
      "rating": 5.0,
      "verified": true,
      "author": "Sandy Barone",
      "helpful_votes": 0,
      "publication_date": 20191005
    },
    {
      "title": "Sturdy name tag piece.",
      "text": "Although I really liked this name tag. It is very heavy duty, the engraving is fantastic and it is just the right size, We ran into an issue with the chain ring. After the weekend of walking my pup I noticed she was scratching like crazy, the ring had opened up and was poking her in the neck. Which is kind of amazing because the metal was too tough for me to bend back in to shape. It looked almost like a cursive I with both ends being sharp. Side note and more of my own ignorance,the stainless steel smudges pretty bad, so hard to keep looking new and fancy.",
      "rating": 3.0,
      "verified": true,
      "author": "momof3",
      "helpful_votes": 0,
      "publication_date": 20190903
    },
    {
      "title": "It’s a nice tag",
      "text": "I ordered this tag on 11.27.2019. I didn’t get it until 12.19.2019. I contacted the seller because a month had passed and we still hadn’t received our product. Seller was very easy to do business with and was willing to send another tag. The tag is a great size and shiny. I don’t know if it will fade but i will come back and update my review as time goes on. Overall, I am happy the merchandise.",
      "rating": 4.0,
      "verified": true,
      "author": "SABRINA LOPEZ",
      "helpful_votes": 0,
      "publication_date": 20191221
    },
    {
      "title": "Nice engravings, very small though.",
      "text": "Nice product, I ordered the large one, but this came in pretty small. It's about the size of a quarter. The engravings are nice but u have to actually be holding the tag almost in your hand to read it. I guess for the price I just expected to be around 2 to 3 times its size. I also didn't like the way it was shipped in like almost as postcard type deal. Anyways it's beautiful but really small.",
      "rating": 2.0,
      "verified": true,
      "author": "Bighomey36",
      "helpful_votes": 0,
      "publication_date": 20190905
    },
    {
      "title": "Use this company.  Quick service and quality products.",
      "text": "Loved my two tags. Using it for our new puppy with tags for just our cellphone #s and one tag for our address. We have had animals for most of our married life (45yrs) and always have tags on our pets. Trying to cram all our different phone numbers and such makes the writing too small to read sometimes. So we opt for two tags. One with the pets name and our cell phone numbers, and one with the pets name and our address. This is just a personal preference because of the size of the font. It’s all in what you choose. Quality and quickness of delivery were the best we have ever had. Would definitely recommend them",
      "rating": 5.0,
      "verified": true,
      "author": "Paula W.",
      "helpful_votes": 0,
      "publication_date": 20190415
    },
    {
      "title": "Perfect Dog Tag!!!",
      "text": "I just ordered two of these tags for my medium sized dogs. They are nice combination of being both lightweight and sturdy with a quality spiral loop to connect to the collar. I love that you can include many lines of text on the front and back! Since my dogs travel between two houses, I was able to include an address on each side. They arrived much sooner than expected and were in a nice recyclable envelop, so no wasted packaging. These tags were the least expensive metal tags I could find on Amazon. I am pleased to recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazonshopper",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "Awesome Tag",
      "text": "I ordered this for my Great Pyrenees. I am very happy with it. It is very easy to read and looks very professional. I liked it so much I ordered more. I have several collars for my dog. I am getting one for each of his collars so I don't have to move the tag around or worry about him wearing a collar that doesn't have one. The seller was super easy to contact and work with. If you need a tag for any reason. This is where I would get it!",
      "rating": 5.0,
      "verified": true,
      "author": "Fred M",
      "helpful_votes": 0,
      "publication_date": 20200814
    },
    {
      "title": "Heart Shape is at least 20% smaller than the other tags",
      "text": "Ordered regular three tags with different shapes. Good quality for the price. The Heart came in quite small, at least 20% smaller than expected in comparing the other two shapes. Noted, I ordered a Flower and Ranger, both came pretty and good size/regular size. Had contacted the Seller thinking they might have sent the small size/wrong size, but they said that's their regular Heart size. Seller is willing to exchange other size for the same writing, but I thought it still can be used only it is a bit smaller than my other goat's tag. This is why I took out 1 star.",
      "rating": 4.0,
      "verified": true,
      "author": "Pepper & Ginger",
      "helpful_votes": 0,
      "publication_date": 20201004
    },
    {
      "title": "Look Nice New, but Fade with Time",
      "text": "These tags are very nice when new, but as time wears on the letters have become faded. A thin film of dirt is enough to almost obscure the lettering completely, and wiping it off doesn't seem to have improved it much. We've had it on our dog for about 8 months now, and sometimes I can't see the lettering unless I wipe it off with a damp paper towel. The letters themselves are still fading, though. I imagine the lettering will be gone completely by the end of the year. I don't think I will be going with this brand again, but rather with something that is engraved so the lettering cannot fade.",
      "rating": 2.0,
      "verified": true,
      "author": "LillithTop Contributor: Pets",
      "helpful_votes": 4,
      "publication_date": 20160803
    },
    {
      "title": "Love it!",
      "text": "I really like this pet tag, especially the minimalist design. My pup's name is easy to see on the tag, and she seems very comfortable with it. I purchased the round tag. My dog is about 50 lbs--lab/shepherd mix and this tag is the perfect size, not too small or large. I do expect that the metal will scratch with time and wear, however this tag works perfectly for her! It definitely seems more durable than others I have purchased. It did take a little longer to arrive than expected, but I was very excited to finally receive the tag and put it on my pup's collar!",
      "rating": 4.0,
      "verified": true,
      "author": "Ella",
      "helpful_votes": 6,
      "publication_date": 20151215
    },
    {
      "title": "If I knew that was the final product, I wouldn't have ordered.",
      "text": "The tag arrived quickly, but letters came in brown color. I'm very disappointed. I was expecting to be black as the pictures as they described. When I used the 4 lines (front), they weren't centered on the tag, my number was almost cut out. On the back when I used 2 lines only, they were very centered. I don't know if the letter will last long. The engraving is very shallow and was already wearing off. For this reason I don't think this tag will last that long. If I knew that was the final product, I wouldn't have ordered.",
      "rating": 1.0,
      "verified": true,
      "author": "J.M.W.",
      "helpful_votes": 0,
      "publication_date": 20191104
    },
    {
      "title": "Perfect and totally fit whatever you need.",
      "text": "I got the small heart shape tag, and it is perfect for my little dog! It is a nice and simplistic tag. The pet stores around here only had large and gaudy tags that were expensive anyway. My whole address and phone number fit on one side and it is completely readable. They also center the text for you if you just have a name on the other side. You can customize however you like. Very happy, going to order more from here for sure!",
      "rating": 5.0,
      "verified": true,
      "author": "Peter McGrail",
      "helpful_votes": 17,
      "publication_date": 20150824
    },
    {
      "title": "FALSE ADVERTISING Beware!",
      "text": "Bone tag itself is great however the font is a cheap brown color that seems like it's going to get scratched off. Although the bone tag meets my standards, I am giving this product one star for false advertising. All the pictures they provide make it look like the font is black and it even says \"engraved\" in their description which if you look at the definition of engraved it says \"carved\" or \"cut\". The information they put on your tag is neither. It's cheap, won't last and is an ugly brown color.",
      "rating": 1.0,
      "verified": true,
      "author": "meckmeck",
      "helpful_votes": 0,
      "publication_date": 20190605
    },
    {
      "title": "Ring missing, questionable durability of writing",
      "text": "I like the tag but my complaint is I didn’t get a ring so that I could hang it in the collar. I don’t know what to use. I have other key rings which I can use but they are too big for this tiny tag. I just wish they would also provide a tiny ring that goes with it. Or maybe it wasn’t in my package when its supposed to. The inscription is readable but seems too shallow. I will try update after few months about it.",
      "rating": 3.0,
      "verified": true,
      "author": "Acharya_a",
      "helpful_votes": 0,
      "publication_date": 20201003
    },
    {
      "title": "Good tag, the letters for the name are kinda too big though",
      "text": "This is my own fault for not analyzing how big the name “Tucker” looks in the pictures relative to the tag, but WOW I wasn’t expecting the letters to be so huge. I have a 4lb chihuahua with a short name that’s been supersized to fill the whole tag, so the letters look extra disproportionately large, pretty funny actually. The quality is good, exactly what you’d want and expect from a dog tag. It’s sturdy, shiny, comes with a ring to attach it to the collar, and the letters look perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Paula H",
      "helpful_votes": 0,
      "publication_date": 20200229
    },
    {
      "title": "Great tag!",
      "text": "Great metal quality which is nice and thick, but not heavy. The size is good. .I got a large for a small cat (7 pounds) and while it hangs down a bit long, the size is great for her neck size. Any smaller and the writing would be miniscule. The etching quality, while not incredibly deep, is good and sturdy. The name stuck out great on the tag and the information on the back is easily readable. I would recommend putting the name all in upper case letters on the front if there is room, as it looks better and stands out more.",
      "rating": 5.0,
      "verified": true,
      "author": "Miss Campbell",
      "helpful_votes": 0,
      "publication_date": 20191025
    },
    {
      "title": "Great Quality Dog Tag",
      "text": "I am very pleased with the quality (stainless steel (SS)). I have purchased plastic tags & found they do not wear as well & had to replace two tags. This SS tag should last thru my dogs lifetime. I have a toy Yorkie & needed a small tag. I purchased the small heart & now wish I had purchased the small dog bone. The text on each line (other than the name) is lengthy & a little hard to read (but not impossible). I think it would have fit better on the bone. Overall, I am pleased with my purchase and highly recommend this company.",
      "rating": 5.0,
      "verified": true,
      "author": "Kraftyaya09",
      "helpful_votes": 0,
      "publication_date": 20191101
    },
    {
      "title": "Scratches easily",
      "text": "Good quality very shiny, but gets scratched up easily. The writing comes off and gets rubbed away. I would recommend this product but only if it is the only tag on your pets collar, adding a rabies tag behind it scratches the writing off. Only thing I would suggest is for it to be engraved.",
      "rating": 4.0,
      "verified": true,
      "author": "Alaina",
      "helpful_votes": 9,
      "publication_date": 20160627
    },
    {
      "title": "Great company",
      "text": "I ordered a tag in May and never received it. I’m sure it was lost I the mail as Go Tags wanted me to review it. I contacted them recently and they sent another one within days. That was wonderful and I am so appreciative. I had gone to pets mart and bought one and it wasn’t engraved, the name plate was painted on. That won’t last, but the one I received from Go Tags is sturdy and engraved. I love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Jackie Scott",
      "helpful_votes": 0,
      "publication_date": 20200912
    },
    {
      "title": "I have reservations about the quality of the etching.",
      "text": "Received product today in the USPS. There was no tracking provided. Item appears to be very very cheap. The laser etching they speak about, almost appears to be a “raised paint” of some sort on the surface of the tag. I suspect it will wear off very quickly. Time will tell and I will provide an update down the road.",
      "rating": 1.0,
      "verified": true,
      "author": "justolebob",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "Awesome tags!",
      "text": "Love these!! I have two kitties who are headstrong On trying to get outside. I got these for both kitties on the front it has their name with my phone number and on the back it has name, address and phone number again. It’s super easy to read, nice big print, they wear them constantly and there has been zero wear on it like some others have said. They’ve been wearing them about a month or so now. They shipped way faster than the estimated shipping time. Definitely worth the money. Only one of my cats let me take a photo of them lol",
      "rating": 5.0,
      "verified": true,
      "author": "Allie Huckle",
      "helpful_votes": 0,
      "publication_date": 20200702
    },
    {
      "title": "Not worth 7.95",
      "text": "The phone number is almost impossible to read-the 8 looks like a 6. I thought for $7.95 the quality would have been better. I ordered this tag as the one I got last year (different seller that sold for $1.99) was getting worn and hard to read but it's not as hard to read as this brand new one. Really disappointed.",
      "rating": 2.0,
      "verified": true,
      "author": "Louisiana Arky",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "Excellent quality, fast turnaround and shipping.",
      "text": "Great tags that arrived quickly! We needed these to put on various elements of horse tack (bridle, halter, saddle, breastplate) to serve as identification for an upcoming Pony Club Show Jumping Rally. I chose this particular company because they were well rated AND located in WA state where we live, meaning we’d hopefully get it quickly w/o anything being lost in the mail! The only “complaint” I had is that there wasn’t any font choices, as I would have probably gone with a different font had one been offered. Aside from that, they look like the best we’ve had so far, and seems as if they’ll outlast the cheap aluminum tags we’ve gotten in the past.",
      "rating": 5.0,
      "verified": true,
      "author": "Renaissance Farms",
      "helpful_votes": 0,
      "publication_date": 20171103
    },
    {
      "title": "Such a Reassurance!",
      "text": "I just put this (the flower shape-it’s so cute!) on my Am Pit Bull Terrier yesterday. It is just the right size-enough to be noticed but not so big it gets in her way. I can’t comment on durability yet but it seems strong. I do plan to find a little bit stronger ring to attach it to her collar ring with, but this one’s ok for now. I am very happy with the quality of the tag and the printing!",
      "rating": 5.0,
      "verified": true,
      "author": "Melinita",
      "helpful_votes": 0,
      "publication_date": 20200912
    },
    {
      "title": "Exactly what we needed!",
      "text": "The tag is surprisingly lightweight but sturdy. No flimsy bending metal here, and the engraving is really deep. Our Alaskan Malamute Juneau has had her tag on for about 2 months now and it doesn’t have a scratch. We paid up for a tag from a dog store last minute for our other dog Loki which is much heavier, surface engraving that is almost illegible now, and costs 3x as much. See photos for a comparison. Just ordered Loki a new tag from here. 😊",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200319
    },
    {
      "title": "Great, just be sure personalization is compatible with shape...",
      "text": "We got the rectangle shape for our male dog last year, and loved it... Really sharp looking. This time, we ordered the heart shaped tag for our female dog. I would give it a five-star rating, except that it doesn't look as nice as the rectangle tag. The personalization looks a little weird because of the way the heart shape tapers at the bottom, and the figures end up getting too close to the edges. Not much anyone can do about it... I just want to share so that buyers will be aware and make adjustments, and not be disappointed. Other than that, it's a durable, handsome tag.",
      "rating": 4.0,
      "verified": true,
      "author": "Andi Edwards",
      "helpful_votes": 0,
      "publication_date": 20190113
    },
    {
      "title": "The engraving is already disappearing",
      "text": "I read the reviews that were good and I had checked others that said theirs didn't last-- So I ordered the \"bone\" because of all the information I wanted on it front and back. Unfortunately it's only 3 months old and it's losing the info because it wasn't engraved deep enough I guess. It looked great at first but it just doesn't measure up to the old \"free\" Milkbone Ones that I actually still have from 15 years ago from another dog! wish they still offered them! Should have named this dog the same name and I could have used it again!",
      "rating": 2.0,
      "verified": true,
      "author": "orchid",
      "helpful_votes": 0,
      "publication_date": 20190708
    },
    {
      "title": "These tags deserve a 10 by me!!!!!!!!!!",
      "text": "It is sooo sweet on my little Chihuahua, if she wasn’t asleep I would take a picture of the tag on her. She really seems to really like it because it because it jingles with her rabies tag. The jingle also helps me keep up with her movement because her back hips aren’t working properly. It is shiny, Chloe’s name is big and is carved out beautifully in black. Our phone numbers are right on the back is as good as the front. I recommend this very very much!!😊",
      "rating": 5.0,
      "verified": true,
      "author": "Little foot",
      "helpful_votes": 0,
      "publication_date": 20200128
    },
    {
      "title": "Surprised when it arrived",
      "text": "For some reason, I had forgotten that the lettering wouldn't be an open-work style. So when it arrived and the letters were filled in solid, I was skeptical about what I had ordered and immediately scratched at it to see if it was painted on. It withstood my abuse test. Lettering is clear and easily visible. Time will tell how it stands up to scratching... Thanks GoTag for the speedy shipping!",
      "rating": 5.0,
      "verified": true,
      "author": "s34w33d",
      "helpful_votes": 0,
      "publication_date": 20200430
    },
    {
      "title": "Not Etched writing wears off",
      "text": "I ordered 3 different tags for my 3 different dogs .. each one is more or less active then the other.. that being said I would think each dog would Have different wear on the tag.. nope..after about a year I could barely make out the print. The print is not etched into the metal it is printed on and almost looks smudged after some wear. My oldest husky is 10yrs old and sleeps a lot ..my youngest 3yr old lab is always swimming and playing.. both tags look the same. You get what you pay for .. if my dog runs off or something god forbid I want somebody to be able to contact me by reading their tags.",
      "rating": 1.0,
      "verified": true,
      "author": "Brooke",
      "helpful_votes": 0,
      "publication_date": 20191111
    },
    {
      "title": "Very good quality, very good value, arrived promptly.  I'm a repeat customer.",
      "text": "Every pet should have a tag with his or her name, address, and phone number. Then again, if you're reading this review you already know that. So now you're down to evaluating quality and value. If you've ever bought a tag from a self-serve kiosk, you've almost certainly been disappointed. Aluminum tags wear down and look like crap after a few years. That's not what you're ordering here. These tags are stainless steel and hold up well to years of running, playing, and clanging against your pet's rabies tag. This is probably the one and only pet ID tag you'll ever need for your furry friend.",
      "rating": 5.0,
      "verified": true,
      "author": "Clever User Name",
      "helpful_votes": 0,
      "publication_date": 20181222
    },
    {
      "title": "If you have a Dog or Cat it’s a must have!!!",
      "text": "I Love the Bone shape all though it was a hard choice, I find paying a few more dollars for Stainless Steal over aluminum is very well worth it, but my dog does once in a while take a run from us and lays on someone’s deck crying till we find her so this is a really big help,,, I had My husbands & Mines phone numbers on it & said please call or text, that was the back the front I wrote her name Missy, I’m lost please call my mom or dad, so then they just turn it around & were there,,,, Very Much peace of mind TyIf u have a Dog or Cat",
      "rating": 5.0,
      "verified": true,
      "author": "Sheryl H.",
      "helpful_votes": 0,
      "publication_date": 20200311
    },
    {
      "title": "Stainless Steel, Should Last",
      "text": "In the past I went to Walmart and played around with a machine that generated a personalized tag. It worked and it was a pain. Very little flexibility while imputing info and no ability to go back and make corrections; only start over. This service is superb in ease of use and the outputted product. Time is the only reliable measure of durability and sturdiness. However, I would be surprised if the tag does not last all of my Airedale's life.",
      "rating": 5.0,
      "verified": true,
      "author": "G. E. Druce",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "Good for the Price",
      "text": "This tag is the perfect size. I wish the writing had been darker but it has held up even though 10 mos later the writing is very faint so now we will have to get a new one. If you don't need one to last forever this is OK but I'll buy a different kind in the future so our contact info will stay clearly legible on the back. For just your pet's name on the front it's fine.",
      "rating": 4.0,
      "verified": true,
      "author": "K",
      "helpful_votes": 0,
      "publication_date": 20201014
    },
    {
      "title": "Awesome quality and amazing customer service!",
      "text": "These tags are wonderful! For years, I’ve bought tags from the machines inside Walmart. These are far superior. Well made and sturdy. I ordered 3 tags for my dogs and accidentally typed my phone number incorrectly on one of them. When I called the company, they fixed it and immediately shipped a new one...free of charge! Now THAT’S Outstanding customer service! I’m a customer for life!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200829
    },
    {
      "title": "High Quality, Great Buy",
      "text": "The metal is shiny and feels very solid. The writing is etched into the metal and painted (?) black for contrast. I like that there's enough space front and back for information including my name, mobile, home address and email address. Along with the implanted chip, if my best friend is ever lost, I can be contacted quickly to get him back. Very fair price. Arrived in just 2-3 days.",
      "rating": 5.0,
      "verified": true,
      "author": "Mid-Century Todd",
      "helpful_votes": 0,
      "publication_date": 20200730
    },
    {
      "title": "Great buy",
      "text": "I love this ID tag. I think the old one getting lost turned out to be a good thing. We have been using it now for about a month. It has some scratches on it from his other tag rubbing on it. The text is small but easy and clear to read. Next time I will pick the larger text. All in all I am very happy with the tag.",
      "rating": 5.0,
      "verified": true,
      "author": "Dandybell",
      "helpful_votes": 0,
      "publication_date": 20191109
    },
    {
      "title": "Durable, easy to read, can fit lots of text, & great value",
      "text": "Durable, easy to read, can fit lots of text, & great value - this is the 2nd of these tags we have bought. One of the great things is you can fit a lot of text if you need to. We have two homes & with this tag, I was able to fit all the info on once side for one location & the other side for the other location. Most tags don't let you have this much text on both sides.",
      "rating": 5.0,
      "verified": true,
      "author": "Tim",
      "helpful_votes": 0,
      "publication_date": 20200901
    },
    {
      "title": "Very nice tag",
      "text": "I ordered a new ID tag for my little terri-poo because his old one had the wrong phone number on it. I didn't pay attention to size, so I must have ordered a larger tag....but that being said, it is a very nicely done tag. His name is in large, visible letters and all my info fit nicely on the other side. I received it very quickly, as well. I think I will order a smaller tag from this same company!",
      "rating": 5.0,
      "verified": true,
      "author": "Dben9",
      "helpful_votes": 0,
      "publication_date": 20190405
    },
    {
      "title": "Almost perfect...great tag for those expensive remote keys",
      "text": "I've ordered several of these to put on each set of keys. I simply write IF FOUND RETURN TO: Last Name, next row add the phone number. The etching could be a little deeper and more pronounced. It needs a bigger hole in the tag so a key ring fits better. It's too tight of a fit as is. All of these new remote keys are so expensive a simple tag on them will help ensure they get returned if lost. I few small improvements would help but they are just fine.",
      "rating": 4.0,
      "verified": true,
      "author": "ZOIKS",
      "helpful_votes": 0,
      "publication_date": 20191218
    },
    {
      "title": "Well made and our 4-legged family member is proud to wear it",
      "text": "This is the second dog bone tag we've gotten for our lab. They are well made and printed very clearly. The first one held up to about 5 years of wear and tear. Even after that time and all the rubbing with other shots and license tags, still able to read the tag info. Needed to replace the tag after the first one wore through the top of the hole for the ring. That's my only knock on the tag and the one star off the durability. If there were more metal around the hole, that would be a help with the wear.",
      "rating": 5.0,
      "verified": true,
      "author": "Miniappleman",
      "helpful_votes": 0,
      "publication_date": 20190820
    },
    {
      "title": "Great, sturdy & cute!",
      "text": "I LOVE this tag! My pup has worn it for almost 2 years & it looks almost new. She had a different tag that was colored & softer-aluminum I think- and when she & her sister woul play fight, the tag would get chewed up. In a matter of 2 months that tag was illegible from the teeth marks. Even her rabies tag is illegible. This tag is sturdy & cute on my puppy!",
      "rating": 5.0,
      "verified": true,
      "author": "DJO",
      "helpful_votes": 0,
      "publication_date": 20190621
    },
    {
      "title": "great product, great value",
      "text": "These tags arrived within days. The data is accurate and easy to read, the design colorful and cheerful. They don't last forever - the print will become worn in a few years - but they're so cheap and easy to replace, it hardly factors. I always buy a couple of extras. Great tags for your dogs. Even if your pet is micro-chipped, it still needs that tag!",
      "rating": 5.0,
      "verified": true,
      "author": "vesta2016",
      "helpful_votes": 0,
      "publication_date": 20200906
    }
  ],
  "product_meta": {
    "title": "GoTags Stainless Steel Pet ID Tags, Personalized Dog Tags and Cat Tags, up to 8 Lines of Custom Text, Engraved on Both Sides, in Bone, Round, Heart, Bow Tie, Flower, Star and More",
    "rating": 4.8,
    "feature_bullets": [
      "GREAT IDENTIFICATION FOR YOUR DOG & CAT - When it comes to durability and quality our stainless steel tag holds up to the most active pet. To see all our pet ID products, click on our brand name GOTAGS above the product listing title.",
      "FAR STRONGER THAN ALUMINUM TAGS AND LESS PRONE TO WEAR, stainless steel lasts longer and is unlikely to wear thin and break like aluminum tags. The laser engraving is clear, permanent, and attractive on a polished mirror-finish surface.",
      "WITH 2 SIDED ENGRAVING & UP TO 8 LINES OF PERSONALIZED TEXT, there's plenty of room for all of your pet's important information - up to 4 lines on front of tag and 4 lines on back of tag. Please follow the ordering instruction below to place your order.",
      "TO ORDER: SELECT SHAPE & SIZE FROM THE ABOVE CHOICES. After selecting shape & size, click CUSTOMIZE NOW to add your personalization details to the tag. When personalizing, you may include up to 4 lines of text on each side by selecting FRONT surface & BACK surface. Add to cart ONLY AFTER you have completed both surfaces with your information.",
      "Small Size = Approx. 1.3 inches x 0.9 inches. An example of how to customize your tag can be seen in the ORDERING INSTRUCTION image on the product page."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "August 17, 2015",
      "Manufacturer": "GoTags",
      "ASIN": "B0141G8E3S",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "ID Tags & Collar Accessories",
      "Dogs",
      "Pet Supplies",
      "ID Tags",
      "Collars, Harnesses & Leashes"
    ],
    "price": 7.95
  }
}