{
  "website_summaries": [
    {
      "verdict": "A good option for those who want a classic controller for their Wii U.",
      "pros": [
        "Connects wirelessly to the Wii U and features a classic controller layout",
        "Comes with a charging cable",
        "Good quality buttons that hold up to lots of gameplay"
      ],
      "cons": [
        "The analog controllers have a little more tension than those from Nintendo"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Lots of fun",
      "text": "Great controller for the Wii U. We use it to play Splatoon (two player mode) and it's a lot of fun. At first I thought it was way too jerky/sensitive but I found that there's a Splatoon setting to change the sensitivity of the controller (in the screen where you choose your weapon, press the + key and you'll go into controller settings). A few adjustments and it is working great.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff",
      "helpful_votes": 12,
      "publication_date": 20160420
    },
    {
      "title": "For some games this is a good thing, for others it isn't",
      "text": "Nothing wrong with it. I'm always weary with 3rd party controllers, but I directly compared it to my on brand one and they're identical to the smallest detail, to the point I'm convinced they're made from the same lots of parts. There are only two differences. One: the markings (obviously) and Two: the thumb sticks are tighter. That's actually a significant difference. They're more firm. For some games this is a good thing, for others it isn't, depending on the types of inputs required of the game. But only a high level gamer, like a speed runner, would notice a difference in performance either way.",
      "rating": 4.0,
      "verified": true,
      "author": "Sam Poling",
      "helpful_votes": 6,
      "publication_date": 20170526
    },
    {
      "title": "Great Controller",
      "text": "I bought a few of these controllers in order to play Mario Kart 8 and some other multiplayer games. They feel great and respond really well. I noticed that they're were times where the controller would hold down A all by its self or move to the left or right but I figured out that it just takes a quick re-sync to fix it. I give it 5 stars great alternative to the Wii U Pro Controller and at great price!",
      "rating": 5.0,
      "verified": true,
      "author": "Lucas Moro",
      "helpful_votes": 4,
      "publication_date": 20170227
    },
    {
      "title": "Half the Price of Nintendo version,  just as good!",
      "text": "As good as the wiiU pro controller. Games that are specific about usage of the pro controller recognize it as a pro controller! Slightly lighter than the original but feels as good in ur hands. At Half the price of the OEM pro controller, the purchase is well worth it! I was also able to use it on my PC via Bluetooth or the enclosed USB cable.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Mondi",
      "helpful_votes": 3,
      "publication_date": 20170313
    },
    {
      "title": "Great Controller",
      "text": "We've only had this controller for about a week or so but at this point it works great and we've had absolutely no problems. I would highlight that the WiiU console has to be on in order for the controller to charge. We thought it was a dud at first because we plugged it in and thought it had been charging overnight but it wouldn't work. Once I realized what happened, it charged very quickly and paired very easily. How long it will work I have yet to find out but as for now, for the price, it's great.",
      "rating": 5.0,
      "verified": true,
      "author": "kjharder",
      "helpful_votes": 3,
      "publication_date": 20170502
    },
    {
      "title": "First impression: GREAT",
      "text": "I got to run this controller for a few hours today. It REALLY feels good. I normally refuse to try third party controllers but the insane price for a Wii U Pro new left me no choice. This one feels as good as a first party controller. My only gripe is with the charging port. Why couldn't it be micro USB so I could use any of my millions of cables to charge it? I even have a micro USB cable threaded through the couch for my phone and other devices. A wall adapter would have also been helpful as I had to dig deep to find one that wasn't in use on micro USB device.",
      "rating": 4.0,
      "verified": true,
      "author": "Allan Beasley",
      "helpful_votes": 0,
      "publication_date": 20190506
    },
    {
      "title": "Great Controller for a Great Price!",
      "text": "I’ve never had a pro controller before so I can’t make a comparison with the Nintendo brand. Having said that, this controller feels really good in my hands, the buttons are responsive and the joysticks are nice and tight. I’m playing Twilight Princess HD and the controller is working perfectly. I haven’t had it long enough to rate durability but so far I’m completely satisfied with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Rebecca E. Lutz",
      "helpful_votes": 0,
      "publication_date": 20181218
    },
    {
      "title": "Well Worth It",
      "text": "I recently purchased a WiiU and have been loving it. However, with Nintendo no longer supporting the console, official accessories are scarce and expensive. I took a shot on this 3rd party controller and am so glad I did. It arrived quickly, synced instantly and has worked flawlessly. The battery life seems solid. I would recommend this item and seller to anyone looking for an affordable, quality WiiU controller.",
      "rating": 5.0,
      "verified": true,
      "author": "Neil D. Miranda",
      "helpful_votes": 0,
      "publication_date": 20181122
    },
    {
      "title": "Great So Far.",
      "text": "This controller is exponentially better than the Afterglow controller I own. The differences between the two are as follows: Less slippery grip It has motors for rumble Rechargeable through mini-usb Sturdier controller sticks As far as cons go, the D-pad is a bit sensitive, but doesn't seem to affect any games, just the menus. I love this controller, and will update if anything changes, but I'm confident I won't. 5/5",
      "rating": 5.0,
      "verified": true,
      "author": "7e3zndo6x1m9",
      "helpful_votes": 0,
      "publication_date": 20180219
    },
    {
      "title": "despite being able to move the whistle cursor just fine; a clear sign that the deadzones were programmed ...",
      "text": "The deadzones on the left stick are too large. I am completely unable to play certain games such as Pikmin three because the stick doesn't input far enough up, down, left, or right to move the character. The character will only move when holding the stick diagonally, despite being able to move the whistle cursor just fine; a clear sign that the deadzones were programmed improperly.",
      "rating": 1.0,
      "verified": true,
      "author": "Victoria",
      "helpful_votes": 0,
      "publication_date": 20180226
    },
    {
      "title": "Great alternative to the \"Pro-Control\"",
      "text": "The design is beautiful and handling is great. I use to have the clear controller that they sell at Gamestop that were the \"cheap\" pro-controls and they felt exactly that, cheap, too light weight and started giving me issues with in a week. As soon as I got my hands on Kommendable's controller, I KNEW it was NOTHING like those clear controls. They are totally worth it, they feel great, and I had no troubles connecting to my console. If you own a pro control but think getting a second or third one is too pricey, I HIGHLY recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Jesse",
      "helpful_votes": 0,
      "publication_date": 20170712
    },
    {
      "title": "After a few months of moderate use the joystick got ...",
      "text": "After a few months of moderate use the joystick got stuck to the left. Now when my son plays his character goes left on its own. I've tried cleaning it but it didn't help. It works for a few moments after I blow into the joystick but that's it. My kids are 4 and 6 years old and are rough on controllers so it doesn't surprise me. It probably would have lasted but this controller is not durable enough for a child.",
      "rating": 3.0,
      "verified": true,
      "author": "Casey",
      "helpful_votes": 0,
      "publication_date": 20180131
    },
    {
      "title": "Cheap analog sticks",
      "text": "The analog sticks are bad. It takes a lot of travel for the sensors to pick up movement and once they do, the screen jerks very quickly. It makes aiming difficult. The rattling sound some other reviews mentioned is just the shoulder buttons. They fit looser than the Nintendo controller and they have a little rattle. It's not a big deal. The rest of the buttons work almost as well as the original but presses sometimes aren't registered.",
      "rating": 2.0,
      "verified": true,
      "author": "Jeff Walters",
      "helpful_votes": 0,
      "publication_date": 20180208
    },
    {
      "title": "Poor Quality",
      "text": "The first thing I noticed is that the sticks were a bit stiff. But worse than being stiff, the right stick has a fairly large dead spot: at least 25% of the range from center to the top. This wasn't all though... Both of the trigger buttons, ZR and ZL, only work if they're pressed a very specific way. To be more clear, if I squeezed them toward the right or left, anywhere but directly down, they would fail to register. The biggest problem I've found with generic controllers is that the range in quality is usually quite large. In my case, I got a very low quality one which I returned.",
      "rating": 1.0,
      "verified": true,
      "author": "Kevin",
      "helpful_votes": 0,
      "publication_date": 20180912
    },
    {
      "title": "You get what you pay for",
      "text": "Got it because of the price. I did have some issues with mine though. The sensitivity in the analog sticks are really low, so it makes games that require aiming or precision like Breath of the Wild a bit difficult. I emailed about the problem and was told it was because of the games themselves and not the controller. I also have issues with buttons not registering while playing Mario Maker and Zelda. I bought a different controller from a different store and have not had the sensitivity issue nor the button registration issue. For the price, I understand though. You get what you pay for.",
      "rating": 3.0,
      "verified": true,
      "author": "Revvy",
      "helpful_votes": 0,
      "publication_date": 20170502
    },
    {
      "title": "it's essentially impossible to make fine adjustments to your bow aim",
      "text": "This controller's analog sticks require a fairly high level of effort to move, compared to the stock Wii U gamepad, and have very short travel. While playing Breath of the Wild, it's essentially impossible to make fine adjustments to your bow aim; you instead jump past where you intend to aim, and then jump back the other direction, and eventually just give up and power this controller off, in favor of the Wii U gamepad. It's a cheap controller; probably ok for games you don't need precision on, but seriously -- it's not good.",
      "rating": 1.0,
      "verified": true,
      "author": "Omas",
      "helpful_votes": 0,
      "publication_date": 20170830
    },
    {
      "title": "Great controller",
      "text": "I really like the controller. Using the Wii U gamepad hurts my hands, so I really needed something else to play with. This controller definitely fills that gap. It's lightweight, it's snappy, and it's infinitely better than the controller Nintendo included with the console. I compared it with the Wii U pro controller as well, and I prefer the snappiness of the Kommendable controller. The sticks and buttons are all crisp, although the D-pad can be a little annoying. This is something it has in common with the normal pro controller. When you press left or right on the D-pad, it's a little too easy to hit up or down accidentally. Otherwise, the controller is great. 5 stars.",
      "rating": 5.0,
      "verified": true,
      "author": "Jared S.",
      "helpful_votes": 0,
      "publication_date": 20171228
    },
    {
      "title": "Very happy customer",
      "text": "I am very pleased with this controller. I've used others and experienced a lag time in responses. This pro wireless is excellent. Makes game play a breeze and no annoying cord. Highly recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Jim Scaggs",
      "helpful_votes": 2,
      "publication_date": 20170226
    },
    {
      "title": "Nothing but trouble.",
      "text": "We've had this controller for maybe a month and it's given us nothing but trouble. The left trigger never worked, but now the buttons are starting to lose function. At this point, five weeks later, it's unusable. I should have just gotten the actual Nintendo brand and saved myself the headache.",
      "rating": 2.0,
      "verified": true,
      "author": "bri047",
      "helpful_votes": 0,
      "publication_date": 20170508
    },
    {
      "title": "Broken joystick after 6 hours. no charger. POS.",
      "text": "Joystick already getting stuck after 6 hours. Didn't come with a charging cable (even though it said it does). Thankfully I had an old PlayStation 3 charger because this thing doesn't even use the same USB as the Wii gamepad. Just suck it up and spend the $30 on the Nintendo brand. update: the seller was very accommodating and issued me a full refund without my asking. The issue with the controller may have been a fluke.",
      "rating": 1.0,
      "verified": true,
      "author": "Jess J",
      "helpful_votes": 0,
      "publication_date": 20170621
    },
    {
      "title": "Very nice",
      "text": "This controller fits nice in my hands, I hate playing with the game pad, it's too bulky and heavy, this controller is just right for many hours of play without my hands falling off. It's well made and the battery charge lasts a very long time.",
      "rating": 5.0,
      "verified": true,
      "author": "Cheryl",
      "helpful_votes": 0,
      "publication_date": 20190304
    },
    {
      "title": "If you want a \"standard\" style gaming controller for your WiiU this is it.",
      "text": "Just having a controller for gaming that is shaped like the normal PS/XBox style controllers makes transferring skills easier. This isn't for your Wii motion control games, but for driving, fighting, and platform style games this will do nicely. It fits well in the hand, and the battery lasts as long as my son needs it to.",
      "rating": 5.0,
      "verified": true,
      "author": "John Rezz",
      "helpful_votes": 0,
      "publication_date": 20180805
    },
    {
      "title": "boxed excellent, no damage",
      "text": "Received it, boxed excellent, no damage, and got it fast. Charged it up used it to play Breath of the Wild ... WiiU, and the \"A\" button started sticking. Its pretty stiff too compared to the previous brand I have. Oh well. Maybe it'll work better with another game.",
      "rating": 3.0,
      "verified": true,
      "author": "lawmaiden",
      "helpful_votes": 0,
      "publication_date": 20171226
    },
    {
      "title": "Unusable after a week",
      "text": "Controller worked for about a week. Joysticks were too stiff and sensitive, but other than that it worked fine. After a week the buttons started becoming wonky. When you press a button it'll perform the wrong action. Sometimes the joysticks don't work at all now. The controller is completely unusable after 2 weeks. Don't waste your money. Do what I should have done and buy a real WiiU controller.",
      "rating": 1.0,
      "verified": true,
      "author": "Jaime",
      "helpful_votes": 0,
      "publication_date": 20170318
    },
    {
      "title": "Awesome quality!",
      "text": "Very nice controller for the price. I’ve had no issues with this controller. The battery lasts me hours of gameplay and I never have to worry about charging it while playing. I’ve dropped it several times on hard wood flooring and it hasn’t broken or stopped working at all. Good quality and very nice. Also love that it is wireless. :) Great and cheaper alternative to the Wii U pro controller.",
      "rating": 5.0,
      "verified": true,
      "author": "Hannah",
      "helpful_votes": 0,
      "publication_date": 20181210
    },
    {
      "title": "Cheaply made",
      "text": "The controller is very cheaply made and it disconnects every few minutes. Also the charger that comes with it is probably 6 inches long and makes it hard to play games for a long period of time.",
      "rating": 1.0,
      "verified": true,
      "author": "Wilson",
      "helpful_votes": 0,
      "publication_date": 20180725
    },
    {
      "title": "The third party controller we deserve",
      "text": "Is it as solid and precise as the normal gamepad? No. Was it adequate enough to be used for the entirety of Breath of the Wild (barring certain sections that required the gamepad)? Absolutely. This is what I turn to when the awful glare of the Wii U gamepad has worn me down (seriously, why is that thing always on?).",
      "rating": 4.0,
      "verified": true,
      "author": "Devin Lewis",
      "helpful_votes": 0,
      "publication_date": 20180510
    },
    {
      "title": "Great controller!",
      "text": "Overall, this is a great controller. It's a major upgrade from the wii remotes, and the controls are smooth and very responsive. I must mention, however, that one time I was playing and the in game pointer wouldn't stop going to the left. This was fixed by re-syncing the controller. I strongly recommend this controller to anyone seeking a new way to play.",
      "rating": 5.0,
      "verified": true,
      "author": "IAdkins",
      "helpful_votes": 0,
      "publication_date": 20171226
    },
    {
      "title": "I will be sending this back and I would not recommend buying this controller",
      "text": "Two out of two would not connect or even transmit a bluetooth signal. A friend of mine bought the first one and it would not connect, thinking it was just one defective device in the mix I ordered another but only to get the same result. No connection with WiiU or even when monitoring on a bluetooth signal meter. All other WiiU controllers will ping the signal meter soon as the sync is pressed. I will be sending this back and I would not recommend buying this controller. Two out of two failure rate out of the box is enough for me. This is a piece of JUNK Do not BUY.",
      "rating": 1.0,
      "verified": true,
      "author": "Kenny Keating",
      "helpful_votes": 0,
      "publication_date": 20170825
    },
    {
      "title": "Got 3 months use out of it.",
      "text": "Purchased to play multiplayer WiiU Minecraft. It worked great and was a big hit for 3 months. Now it randomly walks/moves when buttons are not pressed and stops working altogether (with charge or plugged in). We average 2-4/week usage. I’m disappointed.",
      "rating": 2.0,
      "verified": true,
      "author": "S H",
      "helpful_votes": 0,
      "publication_date": 20191008
    },
    {
      "title": "Worth the money. Will likely buy a second.",
      "text": "Best controller I've ever purchased. Very happy with the quality, functionality, delivery speed, and customer service. Thank you! Really comfortable controller. Best one I have now. Works great on WiiU. Immediately sinc'd.. and has complete functionality (minus gyro) with LoZ BoTW. Saving a ton of wear and tear on my pad controller.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170904
    },
    {
      "title": "Not working",
      "text": "Doesn't work... the controller does not sync to the WiiU",
      "rating": 1.0,
      "verified": true,
      "author": "Thomas O.",
      "helpful_votes": 2,
      "publication_date": 20170621
    },
    {
      "title": "Kind of a cheap Product.",
      "text": "Save your money and get an official Nintendo product. This was ok but the buttons quickly became cumbersome to use.",
      "rating": 3.0,
      "verified": true,
      "author": "Eric Ferguson",
      "helpful_votes": 0,
      "publication_date": 20181129
    },
    {
      "title": "I would recommend actual Nintendo when buying accessories",
      "text": "Freezes up sometimes and can be a little laggy. I would recommend actual Nintendo when buying accessories, even if they are a bit more expensive. If you are on an absolute budget, though, it will suffice. I'll give it 3 stars instead of 2 because the recharge works well. I like that.",
      "rating": 3.0,
      "verified": true,
      "author": "Coke Man & family",
      "helpful_votes": 0,
      "publication_date": 20171002
    },
    {
      "title": "It works!",
      "text": "Got this for my daughter to take to her friends house since her friend has a big family and controllers are often missing or in short supply. Havn't heard any complaints. Which is a miracle itself.",
      "rating": 5.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20171119
    },
    {
      "title": "Perfect controller at a basic level",
      "text": "Great substitute for the first party controller. I purchased this so I could have a fourth for my WiiU. I wouldn't use it at an incredibly technical level (i.e. Smash Bros) but it serves it's purpose real well for less technically demanding games (in my case games like Bomberman 64 and Mario Party 2 on the VC)",
      "rating": 5.0,
      "verified": true,
      "author": "Cale McClure",
      "helpful_votes": 0,
      "publication_date": 20180707
    },
    {
      "title": "Garbage",
      "text": "Very cheap and the triggers rattle.... The left joystick was faulty so when paying games character would run on its own .... Tried using it for 20 min then it turned off on its own to never come on again ...would suggest buying the offical controller and just spend the extra on a quality Nintendo product",
      "rating": 1.0,
      "verified": true,
      "author": "Gary McCann",
      "helpful_votes": 0,
      "publication_date": 20190222
    },
    {
      "title": "It died... but worked fine under pressure",
      "text": "I bought this control in the end of 2018. I used it a lot playing Smash Bros with my sons. It stopped working by the beginning of 2020, actually it works, but some keys are stuck, for example, in Mario Kart, it keeps accelerating even when you are not pressing anything, so, it's life use for me was a bit more than 1 year, playing almost every day for 1 or 2 hours. You can calculate that quality/price and take your choice based on that. Hope this review helps",
      "rating": 4.0,
      "verified": true,
      "author": "Oscar",
      "helpful_votes": 0,
      "publication_date": 20190123
    },
    {
      "title": "The kids love the controller",
      "text": "The kids love the controller. I had great online ordering experience but cant really give a review because i dont play video games. However what I can say is that the item does seem to work very well as the boys have a lot fun with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Edna Connors",
      "helpful_votes": 0,
      "publication_date": 20170325
    },
    {
      "title": "Good Pro Controller for Wii U",
      "text": "Works great. Seems to be good alternative to overpriced Nintendo item. Can't comment on battery yet, as I've only had it for a few days. But I charged it once and it is still full after using it with Mario Kart for an hour or so.",
      "rating": 5.0,
      "verified": true,
      "author": "Private Joker",
      "helpful_votes": 0,
      "publication_date": 20170311
    },
    {
      "title": "Cant go wrong with this remote!",
      "text": "Super fast shipping, just in time! Both my younger siblings had a slightly rough time adjusting to the fact that the joy sticks were on top and the buttons were on the bottom lol. Other than that it works just fine! Has a long charge and looks and operates great! The kids played splatoon and minecraft together all night long! Great value and quality! So glad i chose this remote first! Thank you for your product and great customer service! Much appreciated and very impressed!",
      "rating": 5.0,
      "verified": true,
      "author": "Caresa",
      "helpful_votes": 0,
      "publication_date": 20170613
    },
    {
      "title": "Kommendable seems like a very good product!",
      "text": "I checked it out and charged it no problem but have not really used it just waiting on grand-kids after Christmas to see what they think. I'm not a avid player like the younger generation. Will let you know in about 4 months if you would like a follow up?",
      "rating": 5.0,
      "verified": true,
      "author": "rickrt",
      "helpful_votes": 0,
      "publication_date": 20181120
    },
    {
      "title": "Works Great and Saved us $15 from brand name!",
      "text": "We've been using this wireless controller for about a week now. It works great! It feels very sturdy and was about $15 less than the Nintendo Brand controller. I would recommend this to anyone who is looking for a pro controller but doesn't care about brand name.",
      "rating": 5.0,
      "verified": true,
      "author": "JMCMommy",
      "helpful_votes": 0,
      "publication_date": 20160105
    },
    {
      "title": "Would Buy Another",
      "text": "From dealing with cheap PS3 generic controllers I expected this one to have a USB dongle, weird button layout, or some other drawback. But honestly there is not much to complain about. Has all the same buttons as the Wii U gamepad but much lighter. So far I've enjoyed using it for Minecraft. Pros Rechargeable Good battery life comes with the charging cord. Lightweight. Looks great. Affordable. Cons Trigger buttons are somewhat insensitive, gotta press them a certain way",
      "rating": 4.0,
      "verified": true,
      "author": "Dakota M.",
      "helpful_votes": 0,
      "publication_date": 20170423
    },
    {
      "title": "Controls",
      "text": "If you just need a controller just to look good, you got it here. The controller looks nice, and it says for pro gaming but it’s difficult pressing the buttons and when you move the controller around, it rattles because the amount of space between the buttons and the plastic covers on it.",
      "rating": 1.0,
      "verified": true,
      "author": "Martin V.",
      "helpful_votes": 0,
      "publication_date": 20181007
    },
    {
      "title": "Great other than battery life.",
      "text": "I like the controller, but battery doesn't last long enough. I'm only a part time gamer.",
      "rating": 5.0,
      "verified": true,
      "author": "Lorrie Gutierrez",
      "helpful_votes": 0,
      "publication_date": 20181206
    },
    {
      "title": "Worthless right out of the box.",
      "text": "My son was really looking forward to getting this so we could play minecraft together. The wait was for nothing. Right out of the box it hooks up and basically the right stick is stuck doing the upward movement and the left is doing a down/left movement. Waste of time. Don't buy it.",
      "rating": 1.0,
      "verified": true,
      "author": "Daddy Woot",
      "helpful_votes": 0,
      "publication_date": 20170501
    },
    {
      "title": "Good option.",
      "text": "It feels kind of cheap in the joysticks, they doesn't react as well as the original ones and the bottoms to, I use it to play BotW and is kind of difficult to use the bow. Beyond that, is a good control comparing with others at the same or even higher price. Is a really good option, I really liked it and if I had to resume what I just said, it will be like this: you get what you paid.",
      "rating": 4.0,
      "verified": true,
      "author": "Cesarturo",
      "helpful_votes": 0,
      "publication_date": 20171221
    },
    {
      "title": "Really well made for how little you're paying.",
      "text": "The right analog stick feels a bit stiff compared to the left (can make it hard to aim in Zelda), but otherwise I love the \"click\" on all the buttons. A lot of controllers have mushy buttons. I don't know if the right analog stick is meant to be a bit stiff compared to the left, but I would like a response to see if I have to get it replaced. It's really well made otherwise, especially since it's only $20.",
      "rating": 4.0,
      "verified": true,
      "author": "Robert R.",
      "helpful_votes": 0,
      "publication_date": 20170311
    },
    {
      "title": "Doewnt work at all",
      "text": "Never got the chance to use it for I had the Wii U remote but was trying to use it and it doesn't work at all never in my life, next time use right away just incase",
      "rating": 1.0,
      "verified": true,
      "author": "escale",
      "helpful_votes": 0,
      "publication_date": 20171230
    },
    {
      "title": "Doesn't have the legs to justify the discount over OEM",
      "text": "We haven't used them often. Maybe 15 hrs over 6 months. We bought two and one has recently continued to register input from left stick. In other words the stick is getting stuck and makes games like MARIO 3D perilous on bridges, etc. The character just keeps moving! Anyway. When they work they are great, but that was just too short of a time for a control stick to blow. I am unable to return or exchange at this point. Too bad. I was feeling good about the savings.",
      "rating": 2.0,
      "verified": true,
      "author": "David H",
      "helpful_votes": 0,
      "publication_date": 20170714
    },
    {
      "title": "Nice controller",
      "text": "I will start by saying that I have not used any other Wii U pro controllers. With that said, I do find this controller to be of excellent quality. It's light, has a nice shape and feel in my hands, and is rechargeable. Over all great controller for the price. The only issue I had with it was that I had to Press a little harder on the buttons for them to register than on the game pad but I think this has improved with use. I would still recommend this product.",
      "rating": 4.0,
      "verified": true,
      "author": "Nitty",
      "helpful_votes": 0,
      "publication_date": 20170316
    },
    {
      "title": "Exceeded expectations.",
      "text": "Great product. Controls feel great and overall feels high quality. Battery life is excellent. Price was excellent. I am always skeptical about off brand controllers, but this is probably the best one I've ever purchased. I will likely get another.",
      "rating": 5.0,
      "verified": true,
      "author": "fti100",
      "helpful_votes": 0,
      "publication_date": 20170423
    },
    {
      "title": "As good as the Official one",
      "text": "Controller is awesome. I charged it right away. Synced up perfectly, works perfectly. Moderate use and after 4 days still has 3/4 charge. Glad I didn't waste money getting the official one. It's so good, I ordered a second.",
      "rating": 5.0,
      "verified": true,
      "author": "Pezzman",
      "helpful_votes": 0,
      "publication_date": 20170625
    },
    {
      "title": "D-Pad is low quality.",
      "text": "Firstly the Pros: The look an general feel of the remote is good. The battery held a charge really well. At first, the buttons felt in good quality and response. The only con I've had, is the D-pad. I bought the remote for Mario Maker and the fine tuned movements quickly brought forth issues. The d-pad easily swaps from down+right to down+left, often causing a ton of issues. I've had to retire the remote permanently.",
      "rating": 2.0,
      "verified": true,
      "author": "James T",
      "helpful_votes": 0,
      "publication_date": 20180704
    },
    {
      "title": "I would recommend this controller only for playing classic NES",
      "text": "I found that while the controller felt okay the responsiveness wasn't comparable to a Nintendo controller. Also, it went to sleep way quicker. Also, the bictures make the controller look black and silver but is all glossy black. I would recommend this controller only for playing classic NES games",
      "rating": 3.0,
      "verified": true,
      "author": "thomas",
      "helpful_votes": 0,
      "publication_date": 20170711
    },
    {
      "title": "Great controller at a great price",
      "text": "Great controller at a great price! We bought this for my 9 year-old son. He is extremely happy with it & it is completely compatible with his Wii-U system. I would definitely buy from this company again!",
      "rating": 5.0,
      "verified": true,
      "author": "The Little Generals' Mom",
      "helpful_votes": 0,
      "publication_date": 20161230
    },
    {
      "title": "Worked better than the original",
      "text": "I bought this for my son since the original controller broke. I am always skeptical about not buying the original products. But this controller worked very well after it was opened and was played almost non-stop since then. My son loved how responsive it is and he told me how the grip just fits.",
      "rating": 5.0,
      "verified": true,
      "author": "EdMaclarean",
      "helpful_votes": 0,
      "publication_date": 20171230
    },
    {
      "title": "Great Value - Working Great",
      "text": "Great value. No one in our household could be considered a \"pro\" or even a \"serious\" gamer, but we play a lot as a family and these remotes are working flawlessly. Many hours of fun with Mario Cart and Super Smash Bros. without any issues!",
      "rating": 5.0,
      "verified": true,
      "author": "Johnny J. Lopez",
      "helpful_votes": 0,
      "publication_date": 20170103
    },
    {
      "title": "Bought three and all broke in less than a month",
      "text": "Purchased a few of these and then they all started to break as soon as they were played with everyday. All three lasted less than a month or so. Kind of surprised by all the good reviews.",
      "rating": 1.0,
      "verified": true,
      "author": "Kayeos",
      "helpful_votes": 0,
      "publication_date": 20190620
    },
    {
      "title": "Bought new received used.",
      "text": "I order a new controller. The item I received was not new. It came to look like it was new in a good box with bubble wrap. But there was masking tape with pen ink writting. Very upset. Controller looks nice tho.",
      "rating": 2.0,
      "verified": true,
      "author": "Tabitha Wingler",
      "helpful_votes": 0,
      "publication_date": 20180605
    },
    {
      "title": "Good Wii U controller",
      "text": "So far so good. The controller is very responsive and is being used by a kid and an adult.",
      "rating": 5.0,
      "verified": true,
      "author": "jose",
      "helpful_votes": 0,
      "publication_date": 20181027
    },
    {
      "title": "Excellent controllers at a great price.",
      "text": "My boys are very pleased with the overall quality and design of these controllers. They easily charged and synced. The only recommendation is to consider matte black plastic vs glossy as the glossy tends to gather fingerprints. However, the finish is consistent with the WiiU tablet that came with the unit.",
      "rating": 5.0,
      "verified": true,
      "author": "J Cushing",
      "helpful_votes": 0,
      "publication_date": 20170227
    },
    {
      "title": "Sticky Right Analog stick",
      "text": "The controller is identical to the wii u pro controller the one I received though has a sticky right analog stick I have email the manufacturer back but had not Hurd if this will send a replacement has been 4 days since email",
      "rating": 2.0,
      "verified": true,
      "author": "Craig Schepens",
      "helpful_votes": 0,
      "publication_date": 20180218
    },
    {
      "title": "Buttons...",
      "text": "The Controller is exactly the same as a Wii u pro controller, except it is not as hearty. When it arrived the top trigger buttons were already having issues, and in the short month or two that I have used it, the A button is already giving out. It's a good product, but it could be better.",
      "rating": 2.0,
      "verified": true,
      "author": "Tim Turner",
      "helpful_votes": 0,
      "publication_date": 20190415
    },
    {
      "title": "remote lags",
      "text": "I bought this remote but when we used it we noticed it lags. It has a 2-3 second delay. And sometimes just doesnt work. We returned and got a refund through Amazon",
      "rating": 1.0,
      "verified": true,
      "author": "Zuniga Family",
      "helpful_votes": 0,
      "publication_date": 20190325
    },
    {
      "title": "The Wii Pro controller we use at The GamePad",
      "text": "Hands down the absolute best 3rd party Pro controller out there for the Wii U. We've purchased over a dozen of these for our gaming bar and they've withstood and incredible beating, whether it be professional Smash players, or a little kids birthday party, Kommendable's controllers maintain their durability and pro grade, swift and precise movements - all at a fraction of the cost of Nintendo's own Pro controller. 5/5 - Highly reccomended",
      "rating": 5.0,
      "verified": true,
      "author": "Keyvan Asdigha",
      "helpful_votes": 0,
      "publication_date": 20170404
    },
    {
      "title": "Kids are happy with the controllers so far",
      "text": "Kids are happy with the controllers so far... Hope they don't break anytime soon... New wii u minecraft game requires these controllers for each player. I certainly recommend this manufacturer a a bit cheaper same quality pro controllers.",
      "rating": 5.0,
      "verified": true,
      "author": "Luis Suarez",
      "helpful_votes": 0,
      "publication_date": 20160713
    },
    {
      "title": "Love this product!",
      "text": "This has been a great controller so far! It has a nice and comfortable feel and so far is working fine and seems like a good product for the money. My only criticism is that the charging cable that it comes with is too short. I would have preferred it to be 6ft. or somewhere close to that length.",
      "rating": 5.0,
      "verified": true,
      "author": "Riley Prudhomme",
      "helpful_votes": 0,
      "publication_date": 20190410
    },
    {
      "title": "Great Product!",
      "text": "This is a very nice controller, I play with it on my games more than the game pad for the Wii-U unless I have no other choice. It's very comfortable I do recommend this controller for anyone looking for a less expensive alternative to the Nintendo Wii-U Pro-Controller.",
      "rating": 5.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 0,
      "publication_date": 20160804
    },
    {
      "title": "I purchased two of them for the price it would ...",
      "text": "I purchased two of them for the price it would cost me for one Nintendo name brand controller. You'd think its a little fishy and somethings up, but I've had these controllers for months now with still no problems in connectivity, charging, or anything else. This is the controller you'd wanna buy instead of spending 50$ for 1 Nintendo controller!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161017
    },
    {
      "title": "Great value and totally worth the purchase!!",
      "text": "Love it!! It connects like the originals but costs half the price and my son actually loves the look and feel better than the originals!",
      "rating": 5.0,
      "verified": true,
      "author": "AL",
      "helpful_votes": 0,
      "publication_date": 20180205
    },
    {
      "title": "I love this controller and so will you!",
      "text": "This controller is great. It fits nicely in my large hands (even better for medium or small hands; the size is just right), it's convenient to charge it by cable from the Wii U then use it wirelessly, and the design is attractive to the eye. The layout of the buttons will be instantly familiar to anybody who has held a standard game controller. I would definitely buy this controller again and recommend it to others.",
      "rating": 5.0,
      "verified": true,
      "author": "RB",
      "helpful_votes": 0,
      "publication_date": 20161120
    },
    {
      "title": "Wii U use",
      "text": "purchase a Wii U and to play the stored game in the memory when there is more than one player, they are perfect",
      "rating": 4.0,
      "verified": true,
      "author": "Joann G.Pratt",
      "helpful_votes": 0,
      "publication_date": 20170506
    },
    {
      "title": "Bought this because I'm not a fan of the Wii U Gamepad and so far this does the job well.",
      "text": "I bought this because the Gamepad is too big for my hands and games like Zelda Ocarina of Time don't handle well when using inventory on that so I needed more traditional controller. It's been great so far, the only thing that bothers me a bit is battery life but it's not a huge deal for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Nicholas Pruett",
      "helpful_votes": 0,
      "publication_date": 20181205
    },
    {
      "title": "Whats going on?",
      "text": "Just got it, charged it up, and gave it a whirl with Xenoblade Chronicles X. While it mostly functions the way it should. Any time you are pushing the joysticks in a locked position and not diagonally, the falter and my character won't run. Also experiencing some ghosting with character walking on its own. Seems like it only kinda works? Gunna test with a few other games and see if its just this game.",
      "rating": 2.0,
      "verified": true,
      "author": "Sumner and Peter Gray",
      "helpful_votes": 0,
      "publication_date": 20170924
    },
    {
      "title": "The charging cable is ridiculously short and it's so unresponsive ...",
      "text": "The charging cable is ridiculously short and it's so unresponsive that it's nearly impossible to aim your bow in Breath of the Wild.",
      "rating": 2.0,
      "verified": true,
      "author": "Reston Eilers",
      "helpful_votes": 0,
      "publication_date": 20180416
    },
    {
      "title": "The controller handles well but (I dont know if this ...",
      "text": "The controller handles well but (I dont know if this is a personal thing or an issue with the product itself) there is noticeable input delay that makes it extremely frustrating to play with.",
      "rating": 3.0,
      "verified": true,
      "author": "Lord Sutton",
      "helpful_votes": 0,
      "publication_date": 20180716
    },
    {
      "title": "GREAT alternative to the expensive remotes.",
      "text": "I have bought two of these controllers and have been very impressed. My young children have had absolutely zero issues. They work great with every game. Definitely worth it and a lot cheaper than the pro controller.",
      "rating": 5.0,
      "verified": true,
      "author": "Cornelius",
      "helpful_votes": 0,
      "publication_date": 20180227
    },
    {
      "title": "I like this controller",
      "text": "I like this controller. The only issue I've had so far is that one of the joy sticks will get stuck in the forward position.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180207
    },
    {
      "title": "Zero stars would be better",
      "text": "Buttons don't respond joystick is a joke I'm surprise this controller turns on horrible",
      "rating": 1.0,
      "verified": true,
      "author": "Pauli",
      "helpful_votes": 0,
      "publication_date": 20180804
    },
    {
      "title": "Perfect",
      "text": "I love the controller! Good weight and balance, and it's just the right size. It paired easily with my Wii U right out of the box with no issues. This is just as good as the Nintendo brand controller! Thanks for a great product! Update 10/1/17: The left trigger only sometimes works now.",
      "rating": 4.0,
      "verified": true,
      "author": "A. Pelletier",
      "helpful_votes": 0,
      "publication_date": 20170408
    },
    {
      "title": "Does the job",
      "text": "Works great with most Wii u games, only thing I have trouble with is the USB charger....it's soo loose, it feels like it will break very easily. Just recently, one of the joy sticks if that's what it's called gets stuck.",
      "rating": 3.0,
      "verified": true,
      "author": "Itemseeker",
      "helpful_votes": 0,
      "publication_date": 20160825
    },
    {
      "title": "Great controller",
      "text": "Overall I love this controller. It's incredibly comfortable and the battery life is great from what I've seen. My only issue with it is that the D pad is a little sensitive and will sometimes go a different direction than what I want, though that could also be due to my fat thumbs. Great product overall though.",
      "rating": 4.0,
      "verified": true,
      "author": "Nathan Lovano",
      "helpful_votes": 0,
      "publication_date": 20190313
    },
    {
      "title": "Good quality and price",
      "text": "This is our second controller from this company. The first one was reasonably priced and has worked well, so when we needed another we ordered the same item again.",
      "rating": 5.0,
      "verified": true,
      "author": "TriHouse",
      "helpful_votes": 0,
      "publication_date": 20170914
    },
    {
      "title": "Buttons and sticks feel good and it's comfortable to hold",
      "text": "Works as it should. Buttons and sticks feel good and it's comfortable to hold. Our kids don't have problems holding it either, so it's good for both kids and adults. I ended up buying two.",
      "rating": 5.0,
      "verified": true,
      "author": "Siannopollo",
      "helpful_votes": 0,
      "publication_date": 20170626
    },
    {
      "title": "Cheap, reliable, would buy again.",
      "text": "Works like a champ: no connection issues, great battery life, reliable. Also, it's half the price of the Nintendo branded one, so buy two for the price of one!",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Howington",
      "helpful_votes": 0,
      "publication_date": 20170505
    },
    {
      "title": "Great controller for the money",
      "text": "Very good controller, buttons have a very good feel and have not gotten spongy after a couple weeks of use. I use it for Mario maker and everything works as it should. Also great company they had made contact to confirm that I was happy with their product and we're very quick to answer questions I had",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160602
    },
    {
      "title": "Package instructions were simple and easy to pair with our console",
      "text": "We bought this controller for our WiiU. It arrived safely and on time. Package instructions were simple and easy to pair with our console. Great addition to our set and the price can't be beat!",
      "rating": 5.0,
      "verified": true,
      "author": "Jen Oloo",
      "helpful_votes": 0,
      "publication_date": 20170221
    },
    {
      "title": "Right stick very touchy.  Not recommended for 1st person",
      "text": "Right stick not precise. Slight touch has no response and then accelerates the response out of nowhere. Nearly impossoble to accurately control camera in 1st person view. Would bot recommend if intending to use right stick to control camera",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171015
    },
    {
      "title": "which is nice! No more buying tons of batteries",
      "text": "Loving these new controllers for my kids' WiiU. They can be plugged in to charge after each game play, which is nice! No more buying tons of batteries! They love them, and have used them several times with no issues with connection. Setting them up was simple for a not-so-tech-savvy person like me. :-) This is a great small business, and they care about your satisfaction. THAT IS HUGE!",
      "rating": 5.0,
      "verified": true,
      "author": "jennifer atkinson",
      "helpful_votes": 0,
      "publication_date": 20170407
    },
    {
      "title": "Great product, amazing customer service.",
      "text": "Ordered three for the kids, when they arrived one didn't work right, but Kommendable contacted me, and refunded my money right away. The kids love the controllers, they are sleek and very comfortable. Highly recommended!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Dana",
      "helpful_votes": 0,
      "publication_date": 20170419
    },
    {
      "title": "I've never used Nintendo's 1st party controller to compare but ...",
      "text": "I've never used Nintendo's 1st party controller to compare but I can't see how this can be improved; it works perfectly well and costs half as much.",
      "rating": 5.0,
      "verified": true,
      "author": "SS21",
      "helpful_votes": 0,
      "publication_date": 20170424
    },
    {
      "title": "They work nice but aiming is a little hard to do in ...",
      "text": "They work nice but aiming is a little hard to do in breath of the wild. Other than that they work as advertised",
      "rating": 4.0,
      "verified": true,
      "author": "Jenn",
      "helpful_votes": 0,
      "publication_date": 20180405
    },
    {
      "title": "Recommended buy",
      "text": "Excellent product, easy to set up. Seems to be of high quality. Bought another controller, both are WAD so far, thanks!",
      "rating": 5.0,
      "verified": true,
      "author": "Doug_Dollahan",
      "helpful_votes": 0,
      "publication_date": 20160406
    },
    {
      "title": "Save your money - Never worked",
      "text": "Worthless. Didn't work from the start, We have had it for a week, charging the entire time to see if maybe it just needed to charge up, and it hasn't worked yet.",
      "rating": 1.0,
      "verified": true,
      "author": "NH Bella",
      "helpful_votes": 0,
      "publication_date": 20170503
    },
    {
      "title": "Love it. It synced quickly after we opened it ...",
      "text": "Love it. It synced quickly after we opened it today. Charged quickly I think, I was busy rearranging the house so I am not sure but I know 2 hours after it arrived, I was able to use it fully charged",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20170128
    },
    {
      "title": "Extremely satisfied!!!",
      "text": "My son absolutely loves it. I was emailed directly asking about my product satisfaction and to also let me know that if I had any issues to contact them and they would be resolved. I didn't have any issues at all but it was really great to know that they stand behind their products. Will definitely buy from again.",
      "rating": 5.0,
      "verified": true,
      "author": "Erin K Vidrine",
      "helpful_votes": 0,
      "publication_date": 20170203
    },
    {
      "title": "Poor quality. This only lasted a few months of ...",
      "text": "Poor quality. This only lasted a few months of VERY light use. The left joystick malfunctioned and always registers a LEFT signal. We tried resetting the controller without success. Like other reviewers of the Kommendable controller, it looks like we got a defective product.",
      "rating": 1.0,
      "verified": true,
      "author": "Hausmaus314",
      "helpful_votes": 0,
      "publication_date": 20170610
    },
    {
      "title": "I'm coming for you Ganon",
      "text": "Great controller! I got this for the Wii U so I could play Zelda And Zelda did I play! Lasts very long on a charge and works perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20170508
    }
  ],
  "product_meta": {
    "title": "Wii U Pro Wireless and Rechargeable Controller (Midnight Black) Includes Charging Cable by Kommendable",
    "description": "AMPLIFY YOUR GAMING EXPERIENCE WHILE SAVING TIME AND MONEY\n\nDont waste your hard-earned money on an overpriced controller, but dont settle for a low-quality controller!\n\nINTRODUCING the MIDNIGHT BLACK WII U CONTROLLER by Kommendable! \n\nWHAT ARE THE FEATURES OF THIS AMAZING CONTROLLER?\n\n· This Wii U Controller is PERFECT for ANYBODY. Whether youre a CASUAL gamer who only plays occasionally or a HARDCORE veteran who breathes videogames, this is THE controller for you!\n\n· This controller is ERGONOMICALLY designed to be COMFORTABLE to play for HOURS of gameplay!\n\n· WIRELESS connectivity to the Wii U. Sync to the Wii U Console and play anywhere in the room!\n\n· RECHARGEABLE controller to save you MONEY on expensive batteries! This controller also comes with a BONUS CHARGING CABLE that will charge the controller FAST so you can worry about whats important: the game!\n\n· The analog sticks have the right amount of friction for PRECISE and ACCURATE gameplay. Whether you're playing a shooter, an intense fighting game, or a casual family game, these controllers are PERFECT for you!\n\nWHATS IN THE BOX?\n\n- 1 x Midnight Black Wii U Controller by Kommendable\n\n- 1 x BONUS Charging Cable\n\nSO WHAT ARE YOU WAITING FOR? THIS CONTROLLER IS AMAZING AND A BARGAIN SO STOCKS ARE SELLING FAST!\n\nORDER NOW for this awesome, high-quality controller that is built to last with a BONUS charging cable!\n\nNote: This is not the Nintendo branded controller",
    "rating": 4,
    "feature_bullets": [
      "★ BUILT TO LAST - Our Kommendable controllers are built to last! Made with the highest quality materials and build quality possible so you don’t have to worry about controller problems! ★",
      "★ PERFECT FOR ANYONE AND MADE SPECIFICALLY FOR THE WII U- Whether you’re a casual gamer who only plays videogames once in a while, or a hardcore veteran who breathes videogames, this controller is perfect for you! This controller is specially designed to be played on the Wii U and will not work any other console. Please check game compatibility before purchasing as Pro style controllers will NOT work on every game! Also, this controller does work with Minecraft! ★",
      "★ WIRELESS – This controller connects to the Wii U wirelessly so you don’t have to worry about wires and cables getting in the way of your game! We all know how frustrating it is to be in an intense moment in a game and the controller gets yanked out of the console, never again! ★",
      "★ RECHARGEABLE – Are you tired of spending your hard earned money on countless batteries which just stopped working after you bought them new last week? Well now you don’t have to because this controller is fully rechargeable and best of all, this controller comes with a FREE CHARGING CABLE! ★",
      "★ 100% 30-DAY MONEY BACK GUARANTEE- We are a small business and stand by our products so if for any reason you don’t like the controller, refund it within 30 days for a full refund, no questions asked! ★"
    ],
    "specifications": {
      "Brand": "Kommendable",
      "Hardware Platform": "Nintendo Wii U",
      "Item Weight": "9.6 ounces",
      "Product Dimensions": "6.4 x 4.6 x 3 inches",
      "Item Dimensions  LxWxH": "6.4 x 4.6 x 3 inches",
      "Color": "Black",
      "Manufacturer": "Kommendable",
      "ASIN": "B014SKR9H4",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "September 2, 2015",
      "Customer Reviews": "4.0 out of 5 stars498 ratings4.0 out of 5 stars",
      "Best Sellers Rank": "#27,853 in Video Games"
    },
    "categories": [
      "Accessories",
      "Controllers",
      "Video Games",
      "Electronics",
      "Legacy Systems",
      "Wii U"
    ],
    "price": ""
  }
}