{
  "website_summaries": [
    {
      "verdict": "This video game bundle is a great way for fans to relive the terror of combating leeches, a giant scorpion, and hordes of zombies roaming these classic games.",
      "pros": [
        "Includes both Resident Evil and Resident Evil Zero",
        "Experience the origin of the T-virus outbreak",
        "Slick 1080p visuals for early 2000s games",
        "Excellent price and value"
      ],
      "cons": [
        "New players may not enjoy the retro “tank” character controls"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Dissapointing",
      "text": "Originally wrote a 5 star review when i started playing due to nostalgia factors but getting far into the games it becomes apparent these need a complete remake from the ground up, not just nicer graphics. The fundamental physics/mechanics should not be a \"challenge\" in a game. Save yourself the headache and frustration, skip this purchase. If you do get it, play on Easy mode and hack it with cheat codes.",
      "rating": 2.0,
      "verified": true,
      "author": "cipi",
      "helpful_votes": 10,
      "publication_date": 20180922
    },
    {
      "title": "Thank you, Capcom.",
      "text": "Any Resident Evil fan know that this is a good collection. I'm excited to get a chance to play this. Resident Evil 0 was the first RE game I beat and I can't wait to play Resident Evil remastered for the first time! Ol' skool RE. It's one disc but each game installs separately on your hard drive. And it doesn't install like other games I have. So keep that in mind and you can play offline. I haven't played this origins collection yet but if it's remastered and if the disc work. This easily get 5 stars. Thank you, Capcom. I wish those Silent Hill people would remaster those games for present and future consoles. Just saying....",
      "rating": 5.0,
      "verified": true,
      "author": "Tute",
      "helpful_votes": 5,
      "publication_date": 20180302
    },
    {
      "title": "One of my favorite video games EVER.. made better!",
      "text": "I LOVED the original Resident Evil. Though I've never been a hard core gamer, I've always enjoyed video games in moderation. This is won of the few games that I could play for hours. My wife and kids got this new HD version for me for Father's Day and I love it! Its still creep and intelligent. I'm sure a lot of people like it for the \"killing zombies\" aspect but I always liked it most for the problem and puzzle solving aspects, and the storytelling. The first RE was a great game and this is made even better to enjoy of HD TVs. Nicely done! Applauds. LOL",
      "rating": 5.0,
      "verified": true,
      "author": "The Narrator",
      "helpful_votes": 6,
      "publication_date": 20180803
    },
    {
      "title": "Great Game beware of sellers.",
      "text": "10/10 on the game itsself. 0/10 on Packaging of used game. 10/10 Amazons quick shipping. 0/10 on Packaging of used game. Again.. 0/10 on Packaging of used game. At least the disc works.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20200210
    },
    {
      "title": "My R.E 0 Problem",
      "text": "I bought this for my husband , he loves Everything RE but the movies. R.E 1 was great. We were highly disappointed in Resident Evil 0. It stops doing story lines ,then turns off the game. So I returned it thinking defective game. The second one come new . Same problem. It not the seller but the game it self. No matter were I'll buy it from. found others have this problem to . He never got a chance to play it just part 1.",
      "rating": 3.0,
      "verified": true,
      "author": "Grape",
      "helpful_votes": 4,
      "publication_date": 20190224
    },
    {
      "title": "Itchy. Tasty.",
      "text": "Creepy and fun, and one of the best editions of the original game in the Resident Evil series. Haven't played Zero yet but I'm looking forward to it. You can select original \"tank controls\" or use a more modern controller scheme, right now I'm using the original controls and it's a fun challenge! Capcom did a very good job with these games; they really nailed the presentation with not just the graphics but in creating an ominous atmosphere with great sound design.",
      "rating": 5.0,
      "verified": true,
      "author": "LPetal86",
      "helpful_votes": 4,
      "publication_date": 20171012
    },
    {
      "title": "You get what you ordered",
      "text": "Game arrived earlier than expected. Perfect condition. Good entertainment. These were some of the last good Resident Evil games, before action started becoming more of a focus (until VII). Much more horror-driven here.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190806
    },
    {
      "title": "A remake done right.",
      "text": "Loved it. Only downside is the controls if you're accustomed to the old scheme. High replay factor.",
      "rating": 5.0,
      "verified": true,
      "author": "R",
      "helpful_votes": 0,
      "publication_date": 20180607
    },
    {
      "title": "I recommend buying this product",
      "text": "For the fans of the series Resident Evil, I recommend buying this game that is very enjoyable",
      "rating": 5.0,
      "verified": true,
      "author": "Tariq H. Abdullah Alnajdi",
      "helpful_votes": 0,
      "publication_date": 20180824
    },
    {
      "title": "Four Stars",
      "text": "$20 is a great price for these (2) classic games game store was $40, ordered here for $20",
      "rating": 4.0,
      "verified": true,
      "author": "Chelsea",
      "helpful_votes": 0,
      "publication_date": 20180607
    },
    {
      "title": "Great games! If you're a RE fan this game is a must buy!",
      "text": "Resident evil? Yes, please! I'm still waiting for the Resident Evil 2 remake. But while I wait this will definitely work. I bought it for the Resident Evil 1 remake. If you haven't played any resident evil game, or only played Resident Evil 4, 5, or 6, then this is definitely a must play!",
      "rating": 5.0,
      "verified": true,
      "author": "vahe",
      "helpful_votes": 0,
      "publication_date": 20170315
    },
    {
      "title": "Two great games for the price of one.",
      "text": "Two great games for the price of one. I love the Resident Evil series and this is a great addition to my collection on Xbox One.",
      "rating": 5.0,
      "verified": true,
      "author": "Advocate",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "Ridiculous controls",
      "text": "Controls, even with the alternative controls this game is hard to enjoy. Saving progress is crazy. I played this twice and gave up. Save your money and skip this purchase.",
      "rating": 2.0,
      "verified": true,
      "author": "william d wright",
      "helpful_votes": 0,
      "publication_date": 20190222
    },
    {
      "title": "Quick delivery.",
      "text": "The only thing I dislike is that my husband wont stop playing it since we have recieved it",
      "rating": 5.0,
      "verified": true,
      "author": "Brittani Arnold",
      "helpful_votes": 0,
      "publication_date": 20200427
    },
    {
      "title": "Pretty good, I mostly play when I get bored ...",
      "text": "Pretty good, I mostly play when I get bored with other games. Always love the RE games, original was great and the remake is fun with better graphics",
      "rating": 3.0,
      "verified": true,
      "author": "Stephney A.",
      "helpful_votes": 0,
      "publication_date": 20160817
    },
    {
      "title": "a good buy for Resident Evil fans of young and old",
      "text": "Classic games on new age consoles; a good buy for Resident Evil fans of young and old.",
      "rating": 5.0,
      "verified": true,
      "author": "shaolin step",
      "helpful_votes": 0,
      "publication_date": 20170304
    },
    {
      "title": "Resident Evil is The Best!",
      "text": "These Two Games are Great I had them on the original playstation-RE1 and Gamecube-RE0 and its awesome to see Capcom remastering them for the new consoles!",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony Wilfong",
      "helpful_votes": 0,
      "publication_date": 20170322
    },
    {
      "title": "11/10",
      "text": "Really loving the gameplay so far, and the condition was brand new",
      "rating": 5.0,
      "verified": true,
      "author": "HoudiniPunch",
      "helpful_votes": 0,
      "publication_date": 20190703
    },
    {
      "title": "Five Stars",
      "text": "Enjoyed playing these games again. I felt comfortable with the conversion to the xbox one platform gameplay",
      "rating": 5.0,
      "verified": true,
      "author": "Miguel",
      "helpful_votes": 0,
      "publication_date": 20170711
    },
    {
      "title": "He's very happy with it",
      "text": "I bought this for my gamer husband as a gift. He's very happy with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Carie R.",
      "helpful_votes": 0,
      "publication_date": 20160825
    },
    {
      "title": "Fun but awkward",
      "text": "Story mode for both game are fun af however, if you're not familiar with the of controls you'll know why the game has the nightmare qoute one the back of the cover.",
      "rating": 4.0,
      "verified": true,
      "author": "Brandon Volkmar",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "Five Stars",
      "text": "I was excellent to live again those good old days!",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel Areiza",
      "helpful_votes": 0,
      "publication_date": 20180506
    },
    {
      "title": "They kept it original the only difference was the character ...",
      "text": "They kept it original the only difference was the character controls but that can be changed in the options to have an authentic feel.",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew C.",
      "helpful_votes": 0,
      "publication_date": 20160421
    },
    {
      "title": "Brings back great memories of playing back in the day",
      "text": "Loving this. Brings back great memories of playing back in the day. Still makes me jump.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 0,
      "publication_date": 20170329
    },
    {
      "title": "Two Stars",
      "text": "The classic mechanics make these hard to enjoy when used to the later releases, my opinion anyway.",
      "rating": 2.0,
      "verified": true,
      "author": "Raphael",
      "helpful_votes": 0,
      "publication_date": 20180201
    },
    {
      "title": "Four Stars",
      "text": "Its cool and gets you thinking about what is going on.",
      "rating": 4.0,
      "verified": true,
      "author": "Monkey man",
      "helpful_votes": 0,
      "publication_date": 20170113
    },
    {
      "title": "Resident Evil Sandwich",
      "text": "REmake is a masterpiece and RE0 isn't half bad either.",
      "rating": 5.0,
      "verified": true,
      "author": "Revan_Deschain",
      "helpful_votes": 0,
      "publication_date": 20170222
    },
    {
      "title": "Amazing games!",
      "text": "Probably the best games in resident evil series. The remaster is amazing and the graphics looks pretty cool.",
      "rating": 5.0,
      "verified": true,
      "author": "Sol",
      "helpful_votes": 0,
      "publication_date": 20170206
    },
    {
      "title": "Resident evil origins collection-xbox one",
      "text": "I loved the old one and this is just as good, very happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. Big",
      "helpful_votes": 0,
      "publication_date": 20170206
    },
    {
      "title": "Great!",
      "text": "I like the return of Resident Evil. And can play my favorites again with extra!",
      "rating": 5.0,
      "verified": true,
      "author": "Donald D. Carney",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "its fun to play these again",
      "text": "its fun to play these again. i love this version of resident evil. i played them both on the gamecube years ago so its great to have this, i recommend this to fans of resident evil.",
      "rating": 5.0,
      "verified": true,
      "author": "Christopher",
      "helpful_votes": 0,
      "publication_date": 20160707
    },
    {
      "title": "classic action and fun. good way to start the whole series",
      "text": "classic action and fun. good way to start the whole series.",
      "rating": 4.0,
      "verified": true,
      "author": "Edmund G. Dombrowski",
      "helpful_votes": 0,
      "publication_date": 20170116
    },
    {
      "title": "Satisfaction",
      "text": "My son is enjoying his self. great Easter basket stuffer",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth",
      "helpful_votes": 0,
      "publication_date": 20200414
    },
    {
      "title": "first timer here. overall pretty okay",
      "text": "this is my first resident evil. it feels like old school n64 mechanics. very refreshing, but its hard to get through the first time around.",
      "rating": 3.0,
      "verified": true,
      "author": "david r.",
      "helpful_votes": 0,
      "publication_date": 20170330
    },
    {
      "title": "Two Stars",
      "text": "I was looking for scary FPS like Cod Zombies, it didn't work for me.",
      "rating": 2.0,
      "verified": true,
      "author": "S.J. Amirault",
      "helpful_votes": 0,
      "publication_date": 20171129
    },
    {
      "title": "Original Survival Horror Game!!!",
      "text": "Awesome game!!! O'l school survival game!!! A must for Resident Evil Fans!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Marty H. Curley",
      "helpful_votes": 0,
      "publication_date": 20160220
    },
    {
      "title": "games are exactly like the original remakes I remember",
      "text": "Worked perfectly, games are exactly like the original remakes I remember; perfectly tailored for the new system. Very good quality, satisfied with order.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160927
    },
    {
      "title": "Five Stars",
      "text": "One of the greatest horror series from the daus of Playstation and GameCube.",
      "rating": 5.0,
      "verified": true,
      "author": "NAM",
      "helpful_votes": 0,
      "publication_date": 20160218
    },
    {
      "title": "Awesome R.E. ORIGINS Game",
      "text": "Awesome game for xbox and resident evil fans. I've never played the first and prequel games of R.E., now I got to play it the story and characters is interesting and exciting like R.E. Code veronica, 4- 6, Revelations 1-2. Hope capcom remakes/remastered Resident Evil 2, Resident Evil- Nemesis, and Resident Evil 3 for xbox consoles soon.",
      "rating": 5.0,
      "verified": true,
      "author": "xArkSlade08x",
      "helpful_votes": 0,
      "publication_date": 20170506
    },
    {
      "title": "Good old fashioned resident evil!",
      "text": "If you want good old horror then get this. It is the resident evil games from the GameCube days. Very worth picking up. If your want to fly through levels round house kicking zombies in the face that are carrying machine guns.. then just pickup resident evil 6.",
      "rating": 5.0,
      "verified": true,
      "author": "tony",
      "helpful_votes": 0,
      "publication_date": 20170211
    },
    {
      "title": "Survival horror at its finest",
      "text": "If you want to play two of the best survival horror games, this is for you!",
      "rating": 5.0,
      "verified": true,
      "author": "Rosario M.",
      "helpful_votes": 0,
      "publication_date": 20160218
    },
    {
      "title": "Still great after all these years!",
      "text": "Classic game and still love RE and RE0! Pretty good price considering you get 2 games in 1 and both take several hours to completely get through. Both games are as creepy as ever and a lot of fun to play.",
      "rating": 5.0,
      "verified": true,
      "author": "JTA212",
      "helpful_votes": 6,
      "publication_date": 20160125
    },
    {
      "title": "to much waste of time in game play",
      "text": "to much time wasted on out clips with doors opening and closing, going up and down stairs. I feel it ends up a waste of time in the fact you have to back track from one point all the way back to the typewriter in order to save your status only to re-step the path just to go on.",
      "rating": 2.0,
      "verified": true,
      "author": "Robert Lahr",
      "helpful_votes": 0,
      "publication_date": 20180513
    },
    {
      "title": "I love Resident Evil and have been a fan since beating ...",
      "text": "I love Resident Evil and have been a fan since beating RE2 back in the day (one of my favorite games of all time). I haven't played 0 or RE1 yet so I'm really excited to get into it! The graphics may not be the best but the gameplay with the puzzles and the fright factor makes the game so fun. I can't wait to play these two and I also can't wait for other remasters to be released for the current gen consoles.",
      "rating": 5.0,
      "verified": true,
      "author": "Jamboogles",
      "helpful_votes": 2,
      "publication_date": 20160122
    },
    {
      "title": "Arrived New, Didn't Work On My System Though",
      "text": "Didn't work on my Xbox one for some reason, no starches on disc and arrived in new like condition.",
      "rating": 3.0,
      "verified": true,
      "author": "Latravis C",
      "helpful_votes": 0,
      "publication_date": 20160206
    },
    {
      "title": "Great collection",
      "text": "Two great games for one low price. If you love old school resident she'll you can't go wrong.",
      "rating": 5.0,
      "verified": true,
      "author": "pitchaj",
      "helpful_votes": 0,
      "publication_date": 20190529
    },
    {
      "title": "Five Stars",
      "text": "Everything that was said came and it was on time.",
      "rating": 5.0,
      "verified": true,
      "author": "Jerwin Maximo",
      "helpful_votes": 0,
      "publication_date": 20180312
    }
  ],
  "product_meta": {
    "title": "Resident Evil Origins Collection - Xbox One Standard Edition",
    "description": "Platform:Xbox OneTwo full HD remastered games!",
    "rating": 4.8,
    "feature_bullets": [
      "Return to the series origins - Discover the truth behind what led to the horrors at the Mansion in Resident Evil in this fan-favorite and popular prequel title to the series.",
      "Completely enhanced visuals - New high-resolution textures have been created from scratch, including 1080p support on next-gen consoles, while still preserving the classic appearance of the original release.",
      "Fan-favorite Resident Evil characters - Rookie S.T.A.R.S. member Rebecca Chambers and wanted criminal Billy Coen combine skills and buddy up to survive the undead and infected nightmares that await them.",
      "All original difficulty levels plus new Very Easy Mode for novice players"
    ],
    "specifications": {
      "ASIN": "B014KXME60",
      "Release date": "January 19, 2016",
      "Customer Reviews": "4.8 out of 5 stars270 ratings4.8 out of 5 stars",
      "Best Sellers Rank": "#9,476 in Video Games",
      "Pricing": "The strikethrough price is the List Price. Savings represents a discount off the List Price.",
      "Product Dimensions": "0.5 x 5.3 x 6.7 inches; 2.08 Ounces",
      "Binding": "Video Game",
      "Rated": "Mature",
      "Item model number": "55013",
      "Is Discontinued By Manufacturer": "No",
      "Item Weight": "2.08 ounces",
      "Manufacturer": "Capcom",
      "Date First Available": "September 2, 2015"
    },
    "categories": [
      "Xbox One",
      "Games",
      "Video Games"
    ],
    "price": 19.22
  }
}