{
  "website_summaries": [
    {
      "verdict": "UE has improved upon one our favorite portable Bluetooth speakers with some small but key design upgrades, including full waterproofing and enhanced sound.",
      "pros": [
        "The UE Boom 2 is a compact, durable wireless Bluetooth speaker that plays louder than the original Boom and sounds a little better",
        "It's stain-resistant, shock-resistant and now fully waterproof",
        "Battery life is a strong 15 hours, and it can be paired with a second UE speaker for stereo sound"
      ],
      "cons": [
        "Somewhat pricey"
      ],
      "aspects": {
        "Design": 9.0,
        "Features": 8.0,
        "Sound": 8.0,
        "Value": 8.0
      },
      "publication_date": 20150915,
      "rating": 8.4,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great speaker, when it works",
      "text": "Great speaker, when it works. Every other month or so I have problems with pairing. It will connect to my phone but it will be ignored as a speaker, meaning all sound will still come out of my phone speaker. Then I spend the next five to ten minutes pairing and forgetting and then re-pairing yet again to get it to connect.",
      "rating": 3.0,
      "verified": true,
      "author": "Charles",
      "helpful_votes": 5,
      "publication_date": 20170503
    },
    {
      "title": "Volume has two modes: low and loud asf. Good luck with that.",
      "text": "Pros: - Great sound - Bluetooth works fine Cons: - It makes a really loud and annoying sound every time you turn it, every time it connects to a device and every time you turn it off. It's really, really annoying - The volume control is totally bust. The range between the various volume grades is enormous. What I mean by this is that if the volume is a little low and you crank it up one notch (whether it's on the Boom or on your Bluetooth device), the volume goes from low to holy freaking @#$@# it's loud in here. No in-between. This issue almost breaks this product Not recommended. Get yourself a Bluetooth speaker with actual volume controls.",
      "rating": 3.0,
      "verified": true,
      "author": "Kat/Seb",
      "helpful_votes": 9,
      "publication_date": 20170522
    },
    {
      "title": "No Alexa",
      "text": "In their great wisdom, UE decided to opt out of Alexa a while back. I do not remember seeing on the description of the product that it is not compatible with Alexa. That is a huge disappointment. My DOSS speaker works so well with Alexa, so I was hoping this speaker, with more significant sound, would do the same. What was UE thinking?! That is why 3 stars and not 4 or 5.",
      "rating": 3.0,
      "verified": true,
      "author": "FrDocOk",
      "helpful_votes": 0,
      "publication_date": 20190912
    },
    {
      "title": "Crazy good sound quality",
      "text": "There are plenty of reviews online about this but this is a great speaker for the price. Fills up a huge room and WOW the bass is great. The model above this is amazing but over $200 currently. This for $150 or less is a great deal. Highly recommend this over the Roll 2. It might be double the price but it is 4x better.",
      "rating": 5.0,
      "verified": true,
      "author": "KB",
      "helpful_votes": 3,
      "publication_date": 20170609
    },
    {
      "title": "Great sound quality. Charger apparently made of wet tissue.",
      "text": "As the headline reads, the sound quality on this speaker is great. The app stopped working for us pretty quickly (couldn't 'see' the speaker anymore) which is fine, we still connect and play music just fine anyway. I use this while working on the house and the battery life lasts about a full work day. The charger is hot garbage though. The flip out prong design, while a cute idea, is very very bad. One prong because loose almost immediately, but still functioned. The plastic eventually just disintegrated and the prong fell off. The second one fell out literally after taking the attached photo. Very poor design and quality charger, but excellent speaker with great range.",
      "rating": 4.0,
      "verified": true,
      "author": "Larry Padilla",
      "helpful_votes": 0,
      "publication_date": 20200907
    },
    {
      "title": "Awesome Sound",
      "text": "I am in love with the UE BOOM 2 speakers. I plan on purchasing one in each color to add to my collection. These speakers create AWESOME sound for being so small and portable. The colors are so much fun, and the speakers are very user friendly when connected to the app on my iPhone. UE products in general have been a hit in my family.",
      "rating": 5.0,
      "verified": true,
      "author": "Brady-D",
      "helpful_votes": 0,
      "publication_date": 20170917
    },
    {
      "title": "Quality sound",
      "text": "This is a great product and is easy to use. The app used to control the speaker is user friendly and intuitive. Bass doesn’t get distorted at high volumes. In fact I haven’t been able to turn it all the way up. Puts out a ton of sound. I take it with me to work and listen to quality sound instead of the awful speakers from my phone. It Doesnt feel cheap when you hold it in your hand. I haven’t used the multiple user capability yet but I think that’s really cool. VERY happy!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180214
    },
    {
      "title": "Great Outdoor Speaker",
      "text": "Great sound, easy setup, portable, and perfect for outdoors. I like its size, like a regular water bottle, which makes it easy to carry. The only think i can think of is that these UE Boom 2 do not have a base, and since the charging port is at the bottom, you cant have it charged and stand up. I did manage to print in 3D a base that solves this problem. Also you can get them now at a lower price.. This is my go to speaker for my beach vacations this year!",
      "rating": 5.0,
      "verified": true,
      "author": "Rolando Aguillon Aguilar",
      "helpful_votes": 0,
      "publication_date": 20180214
    },
    {
      "title": "I also like that, unlike other Bluetooth speakers I’ve used",
      "text": "I waited to leave this review until using the product for nearly 6 months. We use this inside as well as when we’re out at the beach and it is plenty loud for either. I also like that, unlike other Bluetooth speakers I’ve used, the music player (in this instance my phone) can be a considerable distance away from the speaker and find no connection issues. Highly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "Patrick",
      "helpful_votes": 0,
      "publication_date": 20171212
    },
    {
      "title": "this is an excellent product. Have used this product in the past ...",
      "text": "For a home or travel solution, this is an excellent product. Have used this product in the past and new what it is capable of. Puts out sound as good as, if not better than, my Bose products. Like that it is small, and that I never have issues with bluetooth connections.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Wilde",
      "helpful_votes": 0,
      "publication_date": 20170930
    },
    {
      "title": "What a great speaker. Used many Bluetooth speakers and really like ...",
      "text": "What a great speaker. Used many Bluetooth speakers and really like the ease of connection of UE’s. We joined a couple and had a great quick little portable sound system. Great for outdoor activities. Everyone needs one of these!",
      "rating": 5.0,
      "verified": true,
      "author": "Ian",
      "helpful_votes": 0,
      "publication_date": 20180318
    },
    {
      "title": "A quality speaker",
      "text": "We have had many small speakers for our computer but this one outshines any product I've seen. It has great sound, is portable and easy to work with. I may consider getting a second one to create an even better sound. Don't bother with other portable speakers. Spend the money and you will be so glad you did.",
      "rating": 5.0,
      "verified": true,
      "author": "GuanajaSharon",
      "helpful_votes": 0,
      "publication_date": 20170507
    },
    {
      "title": "Product broke in a year",
      "text": "The product broke in a year from a like new condition and has a horrible buzzing sound and no longer works efficiently",
      "rating": 1.0,
      "verified": true,
      "author": "Nelson Flores",
      "helpful_votes": 0,
      "publication_date": 20200928
    },
    {
      "title": "I love my UE Boom 2",
      "text": "I love my UE Boom 2. The size is perfect. The sound quality is pretty good. I thought that the bass sound would be a little better but it is still pretty good. The first time I used it, the charge lasted 16+ hours on medium volume. The speaker charges fast and seems to last a long time (longer than expected). It seems very durable and easy to use. I wish the price was lower, but it is a good speaker.",
      "rating": 4.0,
      "verified": true,
      "author": "A. G.",
      "helpful_votes": 0,
      "publication_date": 20161203
    },
    {
      "title": "Love this!",
      "text": "Love this! Great sound from such a tiny speaker. It is very portable and bluetooth ranges throughout the house. I enjoy turning it on and off from the app on my phone. The app also has a great feature where 3 different people were on the speaker at once and could take turns playing songs from their own phones.",
      "rating": 5.0,
      "verified": true,
      "author": "luckyegirl",
      "helpful_votes": 0,
      "publication_date": 20170512
    },
    {
      "title": "Amazing",
      "text": "As always the boom delivers. This is my second one, I have one for the garage gym. And it’s amazing",
      "rating": 5.0,
      "verified": true,
      "author": "Desirae",
      "helpful_votes": 0,
      "publication_date": 20200928
    },
    {
      "title": "Fantastic sound",
      "text": "AWESOME!!! I couldn't believe how much sound comes out of this little speaker so when my friend had his out I knew I had to have one!! And then too see all the great color choices! You won't be disappointed",
      "rating": 5.0,
      "verified": true,
      "author": "MicheleNapaValley",
      "helpful_votes": 2,
      "publication_date": 20170625
    },
    {
      "title": "Was not satisfied with it at all",
      "text": "WOW, this is it! A bunch of kids on a beach in Hawaii had this speaker and I asked them what it was. Promptly forgot once I got back home and ended up getting a cheaper one. Was not satisfied with it at all. Spend a little more dough and get this one. The sounds is phenomenal!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "The Larsonator",
      "helpful_votes": 0,
      "publication_date": 20180322
    },
    {
      "title": "LOUD",
      "text": "SO LOUD! I teach outdoor fitness classes and I’ve bought three other speakers that get lost in the noise. This speaker does not!! I’m going to love using it for outdoor bbqs too. I can’t talk to the battery life as I haven’t had it long enough. It has a little loop at the top to hold with a finger or put a carabeaner on. Happy so far!",
      "rating": 5.0,
      "verified": true,
      "author": "KimiD",
      "helpful_votes": 0,
      "publication_date": 20200223
    },
    {
      "title": "Good volume and great sound",
      "text": "Good volume and great sound. Good battery life (though obviously the volume will affect this). If you plan on using the alarm function with a song you should leave plugged in at night, otherwise it will work but it will just be a generic noise since it will have turned off during the night and won't have reconnected at the time it turns on for the alarm. Love the waterproof aspect since it means I can use it in the kitchen, laundry room and the shower without worrying.",
      "rating": 5.0,
      "verified": true,
      "author": "Snowy Owl 81",
      "helpful_votes": 6,
      "publication_date": 20171001
    },
    {
      "title": "Convenient size with brilliant sound quality...",
      "text": "The sound quality for this size speaker is impressive. It's a convenient size for travel and tough for rough environments. It is only loud enough to stream within one large room or a small space. The Bluetooth normally works well, but there have been times it wouldn't connect right away. Overall, I am quite pleased with my purchase and appreciate the durability and quality of sound this speaker produces.",
      "rating": 4.0,
      "verified": true,
      "author": "ItsyBitsy",
      "helpful_votes": 0,
      "publication_date": 20161231
    },
    {
      "title": "Good sound, bad battery",
      "text": "Great speaker. Probably one of the best for its size. However, battery is a joke. Went from 60% to 0 in an hour and a half. Then went from 100% to zero in a few hours. AND, died while it was plugged in so don't rely on them for a long day. Again, great sound though.",
      "rating": 4.0,
      "verified": true,
      "author": "Arielle",
      "helpful_votes": 0,
      "publication_date": 20171003
    },
    {
      "title": "Three Stars",
      "text": "I have the UE Boom.....for some reason this UE Boom 2 is crackly in the sound delivery.",
      "rating": 3.0,
      "verified": true,
      "author": "razyraej",
      "helpful_votes": 3,
      "publication_date": 20170513
    },
    {
      "title": "Best rugged and portable bluetooth speaker",
      "text": "If you buy it for under $100? Best rugged and portable bluetooth speaker. Amazing sound",
      "rating": 5.0,
      "verified": true,
      "author": "A",
      "helpful_votes": 0,
      "publication_date": 20180827
    },
    {
      "title": "Best speaker ever and an even better customer service",
      "text": "Best speaker ever and an even better customer service, recently had this serviced, it was unbelievable how quickly and professionally UE was.",
      "rating": 5.0,
      "verified": true,
      "author": "Frank . Y",
      "helpful_votes": 0,
      "publication_date": 20180415
    },
    {
      "title": "Solid speaker",
      "text": "I've had this for nearly two years, and it is still going strong. Very good sound quality, waterproof, and easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "D.S.",
      "helpful_votes": 0,
      "publication_date": 20180809
    },
    {
      "title": "Very happy with the purchase",
      "text": "Very happy with the purchase. Bought it for sue in the kitchen while cooking--super useful in that context.",
      "rating": 5.0,
      "verified": true,
      "author": "Swazicar",
      "helpful_votes": 0,
      "publication_date": 20180718
    },
    {
      "title": "Very nice to know a small spill or splash won't kill ...",
      "text": "Incredibly clear and powerful for the size. Very nice to know a small spill or splash won't kill it. I have owned and used almost all of the others big names in Bluetooth speakers and this one for the money is the best one that you can still throw in any bag or suitcase.",
      "rating": 5.0,
      "verified": true,
      "author": "Jonathan",
      "helpful_votes": 0,
      "publication_date": 20161115
    },
    {
      "title": "I loved these speakers",
      "text": "I loved these speakers. I got them for my wife to replace her \"old\" Bose speakers. The material is good, the size is perfect, the sound is as good as my old Bose, easy to use and pair although you need find the Bluetooth button. Water proof!",
      "rating": 5.0,
      "verified": true,
      "author": "Neto",
      "helpful_votes": 0,
      "publication_date": 20171010
    },
    {
      "title": "Love it, awesome battery life",
      "text": "I use this for my yoga classes. It has a great clear sound and since its 360 it projects nicely around the room. Battery lasts for about 10 one-hour classes without being charged!",
      "rating": 5.0,
      "verified": true,
      "author": "bellaree",
      "helpful_votes": 0,
      "publication_date": 20170425
    },
    {
      "title": "Great speaker just note it doesnt float.",
      "text": "Really like the speaker. Very load and has great battery life. I've had numerous waterproof Bluetooth speakers most of them coming from Eco x-gear but since they're all broken I decided to switch and I really wasn't disappointed except the Eco X gears have one thing in common, that UE misses, every single speaker they make floats. this one doesn't, great speaker, can't enjoy it cuz it's at the bottom of the lake. I should have tested it. Still a hard recommend.",
      "rating": 4.0,
      "verified": true,
      "author": "Kathy",
      "helpful_votes": 0,
      "publication_date": 20180316
    },
    {
      "title": "Really good quality portable speaker",
      "text": "I got one of these in college a few years ago and was so impressed that I got another one as a gift to someone. The speaker quality is so good and loud. I go days without charging it because I use it for about 1-2 hours everyday.",
      "rating": 5.0,
      "verified": true,
      "author": "Abim O ",
      "helpful_votes": 0,
      "publication_date": 20200519
    },
    {
      "title": "AWESOME❗️",
      "text": "This is my companion walking my dog every day. The sound is crisp and loud.",
      "rating": 5.0,
      "verified": true,
      "author": "Christina",
      "helpful_votes": 0,
      "publication_date": 20180408
    },
    {
      "title": "UE Boom 2 Mobile Bluetooth Speaker",
      "text": "Its sound belies it's size. We took it with us to the beach last month where we set up our chairs and beach umbrella. After playing 15 minutes of smooth jazz and light rock, our neighbors next to us complimented both the speaker's sound and the music we were listening to! Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "carlos rodriguez",
      "helpful_votes": 0,
      "publication_date": 20170719
    },
    {
      "title": "Dead after 3 years",
      "text": "Bought this product brand new, used it frequently, but cared for it well and typically kept it more than 50% charged. It died after 3 years and UE customer support failed to do anything or offer any incentive or discount toward repair or replacement.",
      "rating": 1.0,
      "verified": true,
      "author": "Joseph Kliegman",
      "helpful_votes": 0,
      "publication_date": 20200907
    },
    {
      "title": "Perfect portable speaker, fun colors",
      "text": "Love this! I was surprised it was so small, but that makes for easy storage and portability. The sound is crisp and clear. I really enjoy the range of the signal, I can move about my property with my cell phone on me, but the music plays without interruption. I'm not sure I am getting a full 15 hours of battery life as stated, more like 8 hrs. Can't wait to try at the beach!",
      "rating": 5.0,
      "verified": true,
      "author": "Manouk",
      "helpful_votes": 7,
      "publication_date": 20161223
    },
    {
      "title": "Great quality speaker!",
      "text": "Great speaker! I took it out kayaking for 8 and used it around the house and it still has battery life 14+ hours later. The sound is amazing. Very loud and clear. Easy to pair with iPhone and the app is easy to use as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180618
    },
    {
      "title": "Best speaker I've owned",
      "text": "Best speaker I've owned. The bluetooth works much better compared to a similarly priced Bose, and the sound quality is excellent. I can't believe that battery life this this has either. All-around excellent purchase, considering buying another.",
      "rating": 5.0,
      "verified": true,
      "author": "Max Beckerman",
      "helpful_votes": 0,
      "publication_date": 20171115
    },
    {
      "title": "Great sound, easy to move around",
      "text": "Great sound, easy to move around. Not much in the way of directions - had to look online how to connect it with my phone. (You hold the bluetooth button down until you hear a sound and then your phone can connect with it.) Love the fun colors:)",
      "rating": 5.0,
      "verified": true,
      "author": "Monica A.",
      "helpful_votes": 0,
      "publication_date": 20160503
    },
    {
      "title": "Disapointed",
      "text": "It is really loud like I want it to, but the battery life is not what is advertise. On mid voulme between nothing and full voulume the speaker seems to only last between 2 and 3 hours at most no where near the 15 hour advertised limit. I am really disapointed now that i bought this becuase i cant return it or ask UE to send me another since they dont care about their customers. Just a bad experience witjh this thing.",
      "rating": 3.0,
      "verified": true,
      "author": "gb",
      "helpful_votes": 0,
      "publication_date": 20170114
    },
    {
      "title": "such a great speaker! agree the bass is better on the ...",
      "text": "such a great speaker! agree the bass is better on the mega but this is such a reliable speaker- i think the best part is the pairing and the app capabilities",
      "rating": 5.0,
      "verified": true,
      "author": "TM",
      "helpful_votes": 0,
      "publication_date": 20170820
    },
    {
      "title": "not the best sound",
      "text": "for the money the sound is kind of tinny not much if any bass. we did like the color selection though!",
      "rating": 2.0,
      "verified": true,
      "author": "chris scherry",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "Battery is garbage",
      "text": "Sound quality was great. Battery life was pretty good. But only been using now it for about 6 months and it won't take a charge and it won't play at all, just says \"Charging please wait\" even after it has been charging for an hour using the UE charger. Wishing now I would have gone JBL. Thing is pretty and really great at first, but it's lifespan is crap.",
      "rating": 2.0,
      "verified": true,
      "author": "Joah Pohl",
      "helpful_votes": 0,
      "publication_date": 20180623
    },
    {
      "title": "Great sound that you can take everywhere",
      "text": "This is a fantastic speaker and it travels almost everywhere with us. It gets regular use in our kitchen and lounge room but then is also with us when we go camping. Highly recomended",
      "rating": 5.0,
      "verified": true,
      "author": "Philip McDermid",
      "helpful_votes": 0,
      "publication_date": 20160923
    },
    {
      "title": "Awesome",
      "text": "Great speaker! The only thing that worried me a bit was that on the very first day I got it, the bluetooth connection wasn't great. However, I just charged the speaker and used it the next day and it was perfect. I got the tropical edition speaker, and I love the vibrant orange and purple. I would definitely recommend this to a friend.",
      "rating": 5.0,
      "verified": true,
      "author": "AJ",
      "helpful_votes": 0,
      "publication_date": 20160103
    },
    {
      "title": "great speaker, works well",
      "text": "great speaker, works well, easy to use, and the helper act works as expected. haven't been able to try it in sync with an alt unit, but i remain hopeful",
      "rating": 5.0,
      "verified": true,
      "author": "Arkanjil",
      "helpful_votes": 0,
      "publication_date": 20170322
    },
    {
      "title": "Great sound. Fills a room",
      "text": "Great sound. Fills a room. We used it for our new year's eve party. It lasted til 5AM. Great for small get together. I love being able to use it in the shower.",
      "rating": 5.0,
      "verified": true,
      "author": "Bill P",
      "helpful_votes": 0,
      "publication_date": 20170106
    },
    {
      "title": "great bedside speaker, nothing else!!",
      "text": "great for listening to music at quiet to moderate levels, not much bass or treble though once you go above about 70% volume. Also, this speaker is not very loud. DO NOT BUY THIS IF YOU ARE HOPING TO HOST A PARTY WITH THIS AS YOUR ONLY SPEAKER SYSTEM. you will be very dissapointed",
      "rating": 3.0,
      "verified": true,
      "author": "Sam A.",
      "helpful_votes": 0,
      "publication_date": 20161226
    },
    {
      "title": "Great portable sound",
      "text": "Great portable sound! We take it everywhere! Definitely worth the price for the quality. I haven't got it wet though but hope it's really water resistant just in case!",
      "rating": 5.0,
      "verified": true,
      "author": "Carmelina F. Nelson",
      "helpful_votes": 0,
      "publication_date": 20160728
    },
    {
      "title": "Five Stars",
      "text": "Sounds good. Blasting tunes on my patio and enjoying myself.",
      "rating": 5.0,
      "verified": true,
      "author": "Jesse Wallace",
      "helpful_votes": 0,
      "publication_date": 20170411
    },
    {
      "title": "Great outdoor speaker",
      "text": "Have the Bose mini soundlink speakers, the Boom has the same bass and depth of sound, with the addition of being waterproof. Love both products, one for indoor use, the other for outside. The boom is little more difficult to get into the charging port, but that is for waterproofing. Excellent speaker",
      "rating": 5.0,
      "verified": true,
      "author": "Drew F",
      "helpful_votes": 6,
      "publication_date": 20170416
    },
    {
      "title": "If you are looking for a portable speaker then this is it!",
      "text": "In my mind undoubtedly the best portable speaker there's in the market right now, I love everything about this speaker, excellent!!",
      "rating": 5.0,
      "verified": true,
      "author": "AZ44",
      "helpful_votes": 0,
      "publication_date": 20170312
    },
    {
      "title": "I'm pleased",
      "text": "Golly, this performs just like promised and was just what I was looking for. It sure is nice to be satisfied with a purchase. My wife doesn't like the color scheme, but this is mine, not hers!",
      "rating": 5.0,
      "verified": true,
      "author": "Kennethq S. Manning",
      "helpful_votes": 0,
      "publication_date": 20170226
    },
    {
      "title": "Great speaker--able to connect multiple for stereo sound",
      "text": "This speaker sounds great. It's a little tough to get multiple boom2's to connect through the UE app, but otherwise, I like the speaker. Connect to Amazon Echo Dot for a great way to listen to tunes in the shower.",
      "rating": 5.0,
      "verified": true,
      "author": "Nicki F",
      "helpful_votes": 0,
      "publication_date": 20170814
    },
    {
      "title": "Love it! Best speaker ever",
      "text": "Love it! Best speaker ever. Loud too. I use it at the pool all the time and it's loud and clear. It's awesome to have the block party feature too.",
      "rating": 5.0,
      "verified": true,
      "author": "Lovelyoak14",
      "helpful_votes": 0,
      "publication_date": 20160715
    },
    {
      "title": "EXCELLENT PRODUCT",
      "text": "Love Love Love UE Boom Speakers. We already own two and now I bought one for myself. Do not waste your money on Bose.",
      "rating": 5.0,
      "verified": true,
      "author": "Damiano",
      "helpful_votes": 0,
      "publication_date": 20161231
    },
    {
      "title": "Got kudos from music loving wife for this gift. ...",
      "text": "Got kudos from music loving wife for this gift. Bought two and linked them to her phone. Not MegaBoom. Better",
      "rating": 5.0,
      "verified": true,
      "author": "RCR",
      "helpful_votes": 0,
      "publication_date": 20170212
    },
    {
      "title": "Great bluetooth speaker",
      "text": "Great speaker! I have used it out at the pool without issue. Good range for bluetoth and great sound",
      "rating": 5.0,
      "verified": true,
      "author": "BikerBill",
      "helpful_votes": 0,
      "publication_date": 20170515
    },
    {
      "title": "so far",
      "text": "Nice piece sturdy,well built.works well sound quality is good volume is decent for its size.lets see if it will hold up as I put it through its paces!",
      "rating": 5.0,
      "verified": true,
      "author": "Donad P.Pinder",
      "helpful_votes": 0,
      "publication_date": 20161203
    },
    {
      "title": "Buy!! Buy!! Buy!! Look no more!!",
      "text": "Great great great speaker, super loud, the bass its amazing im spanish we love loud music this speaker its perfect !!!",
      "rating": 5.0,
      "verified": true,
      "author": "jennifer",
      "helpful_votes": 0,
      "publication_date": 20161219
    },
    {
      "title": "Best speaker out there",
      "text": "Such a great speaker all around. Great battery life and put out great sound.",
      "rating": 5.0,
      "verified": true,
      "author": "Morgan",
      "helpful_votes": 0,
      "publication_date": 20170602
    },
    {
      "title": "Good tough speaker",
      "text": "Works good, nice and loud inside still decent outside. At full volume the battery doesn't last more then 2 to 3 hours if you are lucky. It is tough and has taken a few tumbles and still looks good and works the same as before.",
      "rating": 4.0,
      "verified": true,
      "author": "Drschlecht",
      "helpful_votes": 0,
      "publication_date": 20160715
    },
    {
      "title": "Great sound for this little speaker",
      "text": "Prompt delivery and great product, with great sound. I am sooo happy with this purchase!💕",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170112
    },
    {
      "title": "I'm so happy to have a portable speaker form UE its really ...",
      "text": "I'm so happy to have a portable speaker form UE its really amazing and i hope that i can to double up with another speaker Enjoyyyyyyyy",
      "rating": 5.0,
      "verified": true,
      "author": "muhammad a.",
      "helpful_votes": 0,
      "publication_date": 20161103
    },
    {
      "title": "this is great for use out by the pool or just around ...",
      "text": "this is great for use out by the pool or just around the house. the sound is clear and it is super easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Puzzled puzzler",
      "helpful_votes": 0,
      "publication_date": 20161103
    },
    {
      "title": "The battery life is better than 1st generation of Ue the sound is better ...",
      "text": "The battery life is better than 1st generation of Ue the sound is better however the software is not as easy as the 1st Ue generations.",
      "rating": 3.0,
      "verified": true,
      "author": "R. Gabriel",
      "helpful_votes": 0,
      "publication_date": 20161226
    },
    {
      "title": "Good on the go!",
      "text": "Very good product, great volume, low to no distortion at high levels. Let's hope it lasts over the long haul.",
      "rating": 4.0,
      "verified": true,
      "author": "J.",
      "helpful_votes": 0,
      "publication_date": 20160524
    },
    {
      "title": "Skip this one",
      "text": "Sound isn't great, broke within a month of purchase and had to return..",
      "rating": 1.0,
      "verified": true,
      "author": "Anya",
      "helpful_votes": 0,
      "publication_date": 20161228
    },
    {
      "title": "The battery life was very good as we can play music on it thru out ...",
      "text": "The sound is clear and the bass was moderate. The battery life was very good as we can play music on it thru out the whole day.",
      "rating": 5.0,
      "verified": true,
      "author": "Danny P",
      "helpful_votes": 0,
      "publication_date": 20161206
    },
    {
      "title": "which is great, and the sound is loud without losing quality",
      "text": "You can adjust the levels (bass etc.) in the app, which is great, and the sound is loud without losing quality!",
      "rating": 5.0,
      "verified": true,
      "author": "CT",
      "helpful_votes": 0,
      "publication_date": 20180308
    },
    {
      "title": "Great overall sound and volume",
      "text": "Great overall sound and volume. Only complaint is that it does not hold up in direct sunlight when it's hot outside (Arizona hot) and will shut down after a warning. My $30 speaker had better performance in the elements.",
      "rating": 4.0,
      "verified": true,
      "author": "Dino",
      "helpful_votes": 0,
      "publication_date": 20160826
    },
    {
      "title": "Great sound!!",
      "text": "We have 3 of these in our home! Love them! Great sound and water proof (great for music by the pool)",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170312
    },
    {
      "title": "LOVE IT!!",
      "text": "I love this UE Boom. Music plays super loud and it's easy to connect. Awesome quality speaker, would highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Rina",
      "helpful_votes": 0,
      "publication_date": 20160115
    },
    {
      "title": "Four Stars",
      "text": "Love this speaker, but the battery gets drained super fast if left out in the sun or in heat.",
      "rating": 4.0,
      "verified": true,
      "author": "Melody Chu",
      "helpful_votes": 0,
      "publication_date": 20160728
    },
    {
      "title": "Loud!",
      "text": "The sound quality is great! I switched from Bose to this product and I am happy with the product!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161230
    },
    {
      "title": "Impressive sound but can be a bit annoying when you have t too close to your phone ...",
      "text": "The speaker works well. Impressive sound but can be a bit annoying when you have t too close to your phone and you decide to watch a movie or take a call on the phone but it auto links. Not a hard problem to fix but surprising when you hear your video playing in the next room over.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170119
    },
    {
      "title": "Five Stars",
      "text": "Great sound around our pool. Better than I expected. Love the color I chose.",
      "rating": 5.0,
      "verified": true,
      "author": "Sherry Adams",
      "helpful_votes": 0,
      "publication_date": 20180612
    },
    {
      "title": "Boom! Yes",
      "text": "these are great, Good solid sound, great for kids and back yard",
      "rating": 5.0,
      "verified": true,
      "author": "tim a patelzick",
      "helpful_votes": 0,
      "publication_date": 20170223
    },
    {
      "title": "Like it",
      "text": "Sound is great. Easy to tote around house and for travel.",
      "rating": 5.0,
      "verified": true,
      "author": "TXLuLu11",
      "helpful_votes": 0,
      "publication_date": 20161224
    },
    {
      "title": "I've wanted this item for a while now after hearing what it sounded like from others who had it",
      "text": "Nowhere in the description does it say compatible with Iphone, Ipad and other Apple devices. I've wanted this item for a while now after hearing what it sounded like from others who had it. I was very disappointed to find out that my Samsung phone doesn't work to well with it. The sound output off my phone itself is louder than the speaker, and the bass in the speaker is terrible. It sound like it is being played inside a wooden box. I was just very upset they don't tell you it's meant for Apple products, HUGE waste of time and waiting for it to finally get here.",
      "rating": 1.0,
      "verified": true,
      "author": "Addie G.",
      "helpful_votes": 3,
      "publication_date": 20170515
    },
    {
      "title": "While the sound quality is great, you only get about 30 minutes on a ...",
      "text": "I bought 2 of these. While the sound quality is great, you only get about 30 minutes on a full charge. Very disappointed that they go dead so fast.",
      "rating": 3.0,
      "verified": true,
      "author": "Gary",
      "helpful_votes": 2,
      "publication_date": 20170522
    },
    {
      "title": "I love everything about the speaker",
      "text": "I love everything about the speaker. Multiple people can connect, loud and clear music, long lasting charge. Great product, highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20170206
    },
    {
      "title": "Great sound. Long battery life",
      "text": "Great sound. Long battery life. Easy to set up and use.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul A. Correia",
      "helpful_votes": 0,
      "publication_date": 20170727
    },
    {
      "title": "Great speaker, but keep your charger near by!",
      "text": "This speaker is amazing and the sound is great, but don't plan on using it for an 4 mile float trip! It literally died after an hr and a half after being fully charged before our float trip. The whole point of purchasing it... Also it is not water proof. It was kept on my kayak and never submerged in water yet water got into the plugged charging port. (I'll include pictures) Great speaker for at home use and keep the charger near by!!!",
      "rating": 3.0,
      "verified": true,
      "author": "Miranda",
      "helpful_votes": 6,
      "publication_date": 20170530
    },
    {
      "title": "Five Stars",
      "text": "Came on time and not damaged and pretty color !!",
      "rating": 5.0,
      "verified": true,
      "author": "Tina",
      "helpful_votes": 0,
      "publication_date": 20161218
    },
    {
      "title": "Worth it",
      "text": "I researched around a lot, and sat on buying this for a while to make sure I really wanted another device in my life before pulling the trigger. This has been a great sounding speaker around the apartment and at the beach. I was pleasantly surprised by the sound quality in a small package. Totally worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "Indrajit Khare",
      "helpful_votes": 0,
      "publication_date": 20160722
    },
    {
      "title": "Faaaaantastic!",
      "text": "I got this as a Christmas gift for my husband and when I tested it out I was blown away. This speaker is amazing. Great sound, loud, small and easy to travel with, and really easy to use. I would recommend this to anyone. And it's a huge plus that it's waterproof and shockproof.",
      "rating": 5.0,
      "verified": true,
      "author": "Taylor Done",
      "helpful_votes": 0,
      "publication_date": 20161206
    },
    {
      "title": "it's literally the best. it's portable and clutz proof",
      "text": "it's literally the best. it's portable and clutz proof. so for me that's great. the sound is pretty clear and gets loud so I love it. you can also connect it to other ue booms and create a sound system.",
      "rating": 5.0,
      "verified": true,
      "author": "Jasmin Centeno",
      "helpful_votes": 0,
      "publication_date": 20170331
    },
    {
      "title": "Built well. A bit pricey but loud, clear ...",
      "text": "Built well. A bit pricey but loud, clear, and this thing booms!",
      "rating": 5.0,
      "verified": true,
      "author": "George Eckhart IV",
      "helpful_votes": 0,
      "publication_date": 20180208
    },
    {
      "title": "Best decision I've ever made in my life the one ...",
      "text": "Best decision I've ever made in my life the one thing that can handle anything in the world drop it water anything love it",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170314
    },
    {
      "title": "Good buy",
      "text": "Excellent sound and easy to operate. Have not attempted to ascertain maximum distance regarding wireless. However still great sounds up to 30 feet.",
      "rating": 5.0,
      "verified": true,
      "author": "Neil",
      "helpful_votes": 0,
      "publication_date": 20160531
    },
    {
      "title": "This speaker is awesome. I use it just about every day",
      "text": "This speaker is awesome. I use it just about every day. It holds battery charge for a really long time.",
      "rating": 5.0,
      "verified": true,
      "author": "Angela R. H.",
      "helpful_votes": 0,
      "publication_date": 20180330
    },
    {
      "title": "frustrating waste of money",
      "text": "this item worked one month then company difficult to contact or deal with for replacement which also only worked about one month. terrible product and service.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170529
    },
    {
      "title": "Awesome sound",
      "text": "Awesome sound and holds a charge for a long time",
      "rating": 5.0,
      "verified": true,
      "author": "Rainbofla",
      "helpful_votes": 0,
      "publication_date": 20160531
    },
    {
      "title": "Awesome for projecting sound from laptops or mobile devices",
      "text": "Powerful little sound machine! Easy to pair with devices too. I am a professional speaker and I use it to project sound from my laptop presentation throughout my venue. It does the job whether I use it wirelessly or directly hooked up to the laptop, though I recommend using it hooked up to laptop to minimize interference from other wireless Bluetooth devices. Small size allows me to pack it in checked or carry-on luggage. It's a little tricky to insert the charging device into the unit because it is so small. I'd like to see this changed for the next model release.",
      "rating": 5.0,
      "verified": true,
      "author": "Bill Bevins",
      "helpful_votes": 0,
      "publication_date": 20170421
    },
    {
      "title": "Connecting the first device is super easy, when we connected it to our computer ...",
      "text": "This was a gift for my husband and he loves it. Everyone in the family uses it. Connecting the first device is super easy, when we connected it to our computer I just had to read the online instructions on how to add an additional Bluetooth device. Both pair easily now. Being able to pair up to 10 devices is a great feature. The sound is very good, much better then our last Bluetooth speaker! I have been very happy with the range we have been able to play music from the computer upstairs to the far end of the basement. We have not really tested the battery life but it has no difficulty playing for several hours straight.",
      "rating": 5.0,
      "verified": true,
      "author": "Mom of 3",
      "helpful_votes": 0,
      "publication_date": 20170201
    },
    {
      "title": "Decent sound, beautiful-looking, slightly pricey speaker.",
      "text": "PEOPLE - Please note that you CANNOT get loud, deep bass from a small speaker cone. It's against the laws of physics. Therefore, I am being reasonable when I review small speakers. Overall, this very cool-looking speaker sounded pretty darn good. Of course, it sounds better indoors, where is does not \"work\" as hard. The battery lasts a pretty long time. It's an object of beauty (in my opinion). The only down side is - $179 is a tad pricey. The UE Boom 2 would sell out of it was $149. Overall, I'm pretty happy with it.",
      "rating": 4.0,
      "verified": true,
      "author": "Veritas13",
      "helpful_votes": 0,
      "publication_date": 20160724
    },
    {
      "title": "Five Stars",
      "text": "Sound is AMAZIMG. Within minutes I ordered a second unit to sync for surround sound.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Tina Bruce",
      "helpful_votes": 0,
      "publication_date": 20160806
    },
    {
      "title": "Five Stars",
      "text": "This is my favorite speaker - great for travel. Sound quality is very good",
      "rating": 5.0,
      "verified": true,
      "author": "Eeckenrod",
      "helpful_votes": 0,
      "publication_date": 20180413
    },
    {
      "title": "Five Stars",
      "text": "One of the best bluetooth speakers I've ever had, super loud and clear. Great bass.",
      "rating": 5.0,
      "verified": true,
      "author": "Stacie",
      "helpful_votes": 0,
      "publication_date": 20160112
    }
  ],
  "product_meta": {
    "title": "Ultimate Ears BOOM 2 Portable Waterproof & Shockproof Bluetooth Speaker - Tropical Edition",
    "description": "Ultimate Ears BOOM 2 is the 360-degree wireless speaker that blasts loud, insanely great sound with deep, powerful bass in every direction–everywhere you go. It was designed to get wet, muddy, and beat up. PartyUp allows you to wirelessly connect to up to 50 Ultimate Ears speakers and takes your party where no other sound system can go. Caves. Mountains. Lakes. Rooftops. You name it. It's waterproof*, shockproof and crafted from the sexiest and most uninhibited premium materials in the known universe. And with Siri + Google Now voice integration***, you just open your mouth and use your words — so instead of reaching for your phone, you can pick up BOOM 2 so nothing comes between you and the music. *IPX7-rated waterproof (up to 30 minutes and a depth of 1 meter). ** Requires latest firmware & software update.\n\nMANUFACTURER CONTACT INFORMATION\n646-454-3200",
    "rating": 4.5,
    "feature_bullets": [
      "Insanely good, loud 360 degree sound with deep bass",
      "Portable design so you can bring the music anywhere",
      "Waterproof*, shockproof, designed for adventure (* IPX-7 rated waterproof up to 30 minutes and a depth of one meter)",
      "PartyUp from Ultimate Ears allows you to wirelessly connect more than 150 Ultimate Ears speakers",
      "15-hour battery life and 100 ft. Bluetooth wireless range (Actual battery life will vary with use, settings and environmental conditions. Rechargeable batteries have a limited number of charge cycles)",
      "Tap the speaker to play, pause or skip songs",
      "Companion app and ove-the-air speaker updates",
      "These are FCC regulated products: FCC ID JNZS00151"
    ],
    "specifications": {
      "Product Dimensions": "2.5 x 2.5 x 7 inches",
      "Item Weight": "1.2 pounds",
      "Manufacturer": "Logitech",
      "ASIN": "B014M8ZNZM",
      "Item model number": "984-000553",
      "Batteries": "1 Lithium Metal batteries required.",
      "Customer Reviews": "4.5 out of 5 stars327 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#2,021 in Portable Bluetooth Speakers#15,283 in MP3 & MP4 Player Accessories",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "September 15, 2015"
    },
    "categories": [
      "Portable Audio & Video",
      "Portable Bluetooth Speakers",
      "Electronics",
      "Portable Speakers & Docks"
    ],
    "price": ""
  }
}