{
  "website_summaries": [
    {
      "verdict": "A loom that comes with a stand ready for easy warping and weaving.",
      "pros": [
        "Made from hardwood",
        "This set is available in four different widths",
        "Assembly is easy",
        "Very sturdy",
        "Good quality construction on this product",
        "Includes two shuttles and an instruction book that is good for beginners"
      ],
      "cons": [
        "The stand is not adjustable",
        "Holds the stand at lap level for the average person sitting in a chair"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great choice before going to a floor loom.",
      "text": "I am happy with this loom and stand. I waxed them before I put them together and will rewax after 1 month because it is very dry in my house in the winter. What I don't like is the way the reeds slip out in the upper position. I am trying different things to prevent this and still make it easy to change reed position. I have made several pillow covers, table runners, and shawls so far. The hardest part is warping the loom. The rest is easy.",
      "rating": 5.0,
      "verified": true,
      "author": "kathryn hill",
      "helpful_votes": 3,
      "publication_date": 20190821
    },
    {
      "title": "Good value",
      "text": "Great quality, easy to assemble. Instructions for dressing loom are clear and easy to follow. 24” width allows for a variety of projects. Great beginner loom.",
      "rating": 5.0,
      "verified": true,
      "author": "MSW",
      "helpful_votes": 3,
      "publication_date": 20171107
    },
    {
      "title": "Great New Hobby",
      "text": "This loom made it easy for a beginner to get started and helps me produce products that look like I've been weaving for years.",
      "rating": 5.0,
      "verified": true,
      "author": "pamspig",
      "helpful_votes": 0,
      "publication_date": 20190723
    },
    {
      "title": "Order smaller one first",
      "text": "Love the product but if I would do it again. I would order smaller one. It’s easier to use",
      "rating": 4.0,
      "verified": true,
      "author": "Angela Phares",
      "helpful_votes": 0,
      "publication_date": 20181216
    },
    {
      "title": "Love the loom but not the stand",
      "text": "Love the loom but the stand doesn't fit properly after following the directions for putting it together. It's still workable but kind of an eyesore. The angle on the rear legs is off, which means the little side shelves slope downward toward the back and the back of the loom will not fit into its grooves. Kind of a pain.",
      "rating": 3.0,
      "verified": true,
      "author": "Sonoran Rat",
      "helpful_votes": 5,
      "publication_date": 20171128
    },
    {
      "title": "Great quality loom!",
      "text": "I don’t normally write reviews, but this deserves a 5 star rating. I have never used a loom before, and found it easy to assemble and even easier to start a project following the videos in the Ashford website. Shipping was lightening fast, arriving almost two weeks earlier than stated.",
      "rating": 5.0,
      "verified": true,
      "author": "Kimberly Clark",
      "helpful_votes": 0,
      "publication_date": 20181228
    },
    {
      "title": "It makes rolling the warp onto the back really difficult and adjusting your work annoying.",
      "text": "After making 3 scarves, the ratcheting mechanisms seem to be not working properly on the back. They were working, and now they aren't. I'm a little flustered. It makes rolling the warp onto the back really difficult and adjusting your work annoying.",
      "rating": 4.0,
      "verified": true,
      "author": "Ms. Long",
      "helpful_votes": 3,
      "publication_date": 20180324
    },
    {
      "title": "Highly recommended",
      "text": "A good deal providing the loom and stand at once. Assembly is required but it was easily accomplished.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary  A",
      "helpful_votes": 6,
      "publication_date": 20170825
    },
    {
      "title": "Love My Loom!",
      "text": "Everything I expected! Great loom. Packed well. Instructions very clear and logical. Easy to assemble. I love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Eve C.",
      "helpful_votes": 7,
      "publication_date": 20170102
    },
    {
      "title": "It was easy to assemble",
      "text": "This loom has more than met my expectations. It was easy to assemble, is sturdy, and easy to pack for travel. I would recommend it to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Jean R.",
      "helpful_votes": 0,
      "publication_date": 20180307
    },
    {
      "title": "Good loom light stand but works",
      "text": "I like the loom, its easy to use & the whole thing was relatively easy to set up, the stand is light weight but is quite ok just a kittle flimsy",
      "rating": 5.0,
      "verified": true,
      "author": "jfos",
      "helpful_votes": 0,
      "publication_date": 20201124
    }
  ],
  "product_meta": {
    "title": "Rigid Heddle Loom & Stand Combo (48)",
    "description": "Size:48This affordable and portable rigid heddle loom is quick and easy to use. Everything is included in the kit, including the stand. Quick and easy to assemble and warp. The rigid heddle is a great introduction to hand weaving but is also very versatile. Create beautiful and unique garments and home ware. With color and texture weave unique fabrics or with pick-up sticks create beautiful designs. The loom can also make woven tapestries and wall hangings. Made from Silver Beech hardwood the loom is very strong and robust. Four great weaving widths 16, 24, 32 and 48ins.",
    "rating": 4.3,
    "feature_bullets": [
      "Loom and Stand Combo",
      "Four weaving widths 16\", 24\", 32\", 48\"",
      "Quick and easy to warp and weave",
      "Includes 7.5 DPI Reed, two natural shuttles, step by step instruction booklet, threading hook, warping peg and clamp",
      "Made from natural Silver Beech hardwood"
    ],
    "specifications": {
      "Product Dimensions": "48 x 3 x 12 inches",
      "ASIN": "B014T9Y5GM",
      "Customer Reviews": "4.3 out of 5 stars20 ratings4.3 out of 5 stars",
      "Best Sellers Rank": "#239,227 in Arts, Crafts & Sewing",
      "Is Discontinued By Manufacturer": "No",
      "Item Weight": "22 pounds",
      "Manufacturer": "Ashford",
      "Date First Available": "September 2, 2015"
    },
    "categories": [
      "Weaving & Spinning",
      "Arts, Crafts & Sewing",
      "Weaving Looms",
      "Crafting"
    ],
    "price": 705.0
  }
}