{
  "website_summaries": [
    {
      "verdict": "A basic window vac with a squeegee head that has been known to have some performance and quality issues.",
      "pros": [
        "A rechargeable window vac that includes a rotating squeegee and microfiber pad",
        "Vacuum offers decent suction that helps reduce dripping"
      ],
      "cons": [
        "Tends to leave streaks",
        "Some reports of lemons",
        "Design is on the bulky side",
        "Only gets about 25 minutes of use per charge"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "This is a 5 STAR + Product",
      "text": "This is a amazing product. Works so well. Couldn't be happier . Not sure why they are giving it a 3 star rating. The is a 5 star product if I have ever seen one.",
      "rating": 5.0,
      "verified": true,
      "author": "BNP93",
      "helpful_votes": 0,
      "publication_date": 20181114
    },
    {
      "title": "It died after less than 2 weeks!",
      "text": "It only lasted 2 weeks and then it wouldn't charge or turn on. It is a total waste of time and money. It could be the switch. It could be the battery. It could be the motor. It could be any of the connections in between. It was excellent for cleaning up small dog accidents... until it wasn't.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180327
    },
    {
      "title": "Lasted More Than One Washing!",
      "text": "This wireless window washer would be great if it lasted more than two uses. It didn't! Hope I can get my money back.",
      "rating": 1.0,
      "verified": true,
      "author": "Will Lofft",
      "helpful_votes": 5,
      "publication_date": 20161206
    },
    {
      "title": "Did not work!",
      "text": "Did not work and so difficult to return threw it out",
      "rating": 1.0,
      "verified": true,
      "author": "Tamara P.",
      "helpful_votes": 2,
      "publication_date": 20170313
    },
    {
      "title": "Glass cleaner and paper towel works so much better :(",
      "text": "I was really disappointed in this. It takes up space and save you no work. In fact, it takes more time to clean a window than old glass cleaner and a paper towel. That is, once I figured out how to use it as the directions are a series of pictures that are not clear. When I finally did figure it out, I had to go over a dirty window several times and still had places dirty. I'd gotten to review thinking would be great in the bathroom to help clean the shower stall, but am not going to waste my time trying after trying it on several windows. I wouldn't recommend that anyone waste their money.",
      "rating": 1.0,
      "verified": false,
      "author": "Kirstein Howell",
      "helpful_votes": 2,
      "publication_date": 20160126
    },
    {
      "title": "Good for spills, not so much for anything else",
      "text": "Like so many others I saw this 'powered squeegee vac' and thought it would be a really useful cleaning item, but not so much. The included directions are useless, and this does not do well on cleaning glass tables, windows, or doors. It leaves streaks and is honestly kind of a pain in general compared to simple windex and paper towels. It did work really well cleaning up a couple spills, but it's also just awkward to handle and personally I think I'll still stick with using paper towels/dish towels and a mop.",
      "rating": 2.0,
      "verified": false,
      "author": "T.L. Walker",
      "helpful_votes": 2,
      "publication_date": 20160215
    },
    {
      "title": "It works fine, but not much of an improvement over using three separate tools",
      "text": "This is kind of an odd duck. Once I got the hang of using it, it worked OK, but I'm not sure it's really worth the price. Essentially, it's a combination spray bottle, squeegee, and wet vac. Having them all together in one unit is convenient, but it's much heavier than a spray bottle or squeegee. Is the convenience worth the cost over getting those three tools (two of which are only a few bucks each) separately? Hard to say. It depends on your personal tolerance for spending money on potentially frivolous gadgets (to be honest, mine is pretty high :) ).",
      "rating": 4.0,
      "verified": false,
      "author": "Aaron Silverman",
      "helpful_votes": 0,
      "publication_date": 20160311
    },
    {
      "title": "Black & Decker Power Squeegee",
      "text": "Overall I am happy with this Black & Decker powered squeegee. Note that this squeegee has both clean water spraying and dirty water suctioning capabilities. Below are some pros and cons. Pros: - Simple to use - Easy to empty both the clean and dirty liquid tanks - Good suction power - Good grip / design Cons: - Not the best for indoor detailing (fine for outside car windows and such but leaves streaks on indoor windows that need to be touched up) - Not the long battery life that I had hoped for People who have a lot of spills to clean or lots of windows to clean might find a lot of use with this product.",
      "rating": 4.0,
      "verified": false,
      "author": "C. A. Boswell",
      "helpful_votes": 0,
      "publication_date": 20160202
    },
    {
      "title": "Good but pricey",
      "text": "This is a pretty good product, but at a $70 price point, I'm not sure it's entirely worth it. The powered squeegee is an effective cleaning tool, but I'm not sure it's really any better than a regular squeegee. The instructions were a bit confusing to me, and there were stickers all over the squeegee that further confused me at first. Once you get it going, though, it's not too confusing. It does exactly what it's supposed to do, and does it fairly well.",
      "rating": 4.0,
      "verified": false,
      "author": "Conway Stern",
      "helpful_votes": 0,
      "publication_date": 20160206
    },
    {
      "title": "Good for some applications",
      "text": "A little tricky to figure out how to use at first, but for certain window cleaning applications this is a good way to go. We are using it for the inside of our large patio door windows where letting the water from a traditional squeegee fall on the carpet would be a bad idea. Battery life could be longer, and it takes a while to recharge.",
      "rating": 4.0,
      "verified": false,
      "author": "John T. Horner",
      "helpful_votes": 0,
      "publication_date": 20160126
    },
    {
      "title": "Instructions Are Awful",
      "text": "It works quite well but the instructions are nonsense. Only images. No words. It was a pain the rear to figure this out. Sorry but there's no reason not to have written instructions as well. Once I got passed that, the squeegee did a fine job on the hard water stains in the shower. I really liked it once we figured out how to run it. It's light weight and very maneuverable.",
      "rating": 3.0,
      "verified": false,
      "author": "Arwen in NM",
      "helpful_votes": 0,
      "publication_date": 20160114
    },
    {
      "title": "It's okay",
      "text": "Not the best tool I've used but still pretty cool. I tried it on my car windows... Not perfect but okay.",
      "rating": 3.0,
      "verified": false,
      "author": "Natalie V. Galasso",
      "helpful_votes": 0,
      "publication_date": 20160114
    }
  ],
  "product_meta": {
    "title": "BLACK+DECKER Squeegee & Hand Vac, Cordless (BDH100WW)",
    "description": "The BLACK+DECKER BDH100WW Powered Squeegee Vac offers easy one handed, one step cleaning. It is designed with fade-free lithium powered suction for a streak free clean. It features a built in spray and a powered squeegee for one-step cleaning. This squeegee vac also has a rotating head with micro fiber scrubbing pad for easy removal of stubborn grime. This is ideal for windows, shower stalls, mirrors, cars, tables and everyday spills. Includes: Powered squeegee base, 11\" squeegee head, micro fiber scrubbing pad, micro USB charger.",
    "rating": 3.4,
    "feature_bullets": [
      "Built in fluid spray",
      "Fade free lithium technology",
      "Rotating head",
      "Easy one handed, one step cleaning",
      "Easy removal of stubborn grime"
    ],
    "specifications": {
      "Product Dimensions": "7.38 x 11.56 x 5.94 inches",
      "Item Weight": "2.54 pounds",
      "Manufacturer": "Stanley Black & Decker",
      "ASIN": "B014UVC2YQ",
      "Item model number": "BDH100WW",
      "Batteries": "1 Lithium ion batteries required.",
      "Customer Reviews": "3.4 out of 5 stars39 ratings3.4 out of 5 stars",
      "Best Sellers Rank": "#441,648 in Health & Household",
      "Is Assembly Required?": "No",
      "Warranty Description": "2 year limited warranty.",
      "Batteries Required": "No",
      "Import Designation": "Imported"
    },
    "categories": [
      "Household Supplies",
      "Home & Kitchen",
      "Health & Household",
      "Squeegees",
      "Cleaning Tools"
    ],
    "price": 69.99
  }
}