{
  "website_summaries": [
    {
      "verdict": "A low price renders mixed reviews. Some love it, some hate it. Darker colors seem to show dust and hair.",
      "pros": [
        "1-piece loveseat cover fits furniture 57\" to 70\" wide",
        "Comes in black, blue, chocolate, coffee, gray, off-white, orange, and wine",
        "85 percent polyester, 15 percent spandex",
        "Machine wash cold, tumble dry low"
      ],
      "cons": [
        "Attracts dust, won't stay in place"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Not very attractive",
      "text": "If you just want something to keep pet hair off your couch or cover up torn fabric or something, this will probably work just fine... but if you're trying to makeover an ugly old couch, this will only result in an uglier old couch. Opted for the grey, and my loveseat now looks like a sad, wrinkly old elephant.",
      "rating": 2.0,
      "verified": true,
      "author": "Kieli",
      "helpful_votes": 32,
      "publication_date": 20170120
    },
    {
      "title": "Had a small hole appear after only 9 days on my couch!",
      "text": "I really liked this product when I put it on my couch, but I’m really disappointed that I’ve had it 9 days with some of those days being out of state (and therefore not home using the couch) and there’s already a small hole in the cover where your back leans against. It should be more durable to last more than 1 week of use.",
      "rating": 2.0,
      "verified": true,
      "author": "Ms. Kl Anderson",
      "helpful_votes": 12,
      "publication_date": 20180829
    },
    {
      "title": "It will change your furniture quickly and affordably",
      "text": "I have not had it long enough to give a 5 star on Cleaning and Durability. Otherwise this product would receive a 5 star across the bar. I had an 2008 Flexsteel chair that I loved. I didn't care for the material though anymore and found Subrtex. I've had other brands that don't fit the T-cushion shape. this had a specific stretch area for this pillow shape. It was easy to put on too and it has elastic around the bottom that holds tight to the chair. this arm chair is 47\" across (arm to arm). this color is Cream Taupe color. I'm Really pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "stephslakelifeinsc",
      "helpful_votes": 7,
      "publication_date": 20200211
    },
    {
      "title": "Used to cover peeling leather sofa",
      "text": "Works well to cover peeling leather sofa. The white is more off white than ivory. Sofa feel. Used a twin fitted sheet over our seat cushions and then put cover over to prevent sliding. Before photo attached so you can see the ivory white sofa with fitted sheet and more cream colored cover in the lower left corner. Then the after photo with the cover in place. Excited that this could possibly give us another year of use out of this sofa/love seat set.",
      "rating": 4.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 8,
      "publication_date": 20180331
    },
    {
      "title": "Not too bad!",
      "text": "I love this slip cover, but have only one con... it's not all that for a leather couch. It's great for what it's worth and it definitely gets the job done. I'm a little OCD, so the snug issues isn't really that bad.",
      "rating": 4.0,
      "verified": true,
      "author": "Angie",
      "helpful_votes": 18,
      "publication_date": 20161104
    },
    {
      "title": "Nice couch cover",
      "text": "This fits our sofa perfectly. I got it since we have three huskies who like to sit on this couch and the fur is out of control. This way I can just toss this in the wash. The fabric is super soft. You do need to tuck it back in if anyone sits on it, but I don't mind that. It was pretty easy to fit on the couch. Update: This lasted like less than 24 hours before our puppy ate it. I ended up getting a Linen one that didn't bunch so the puppy didn't find anything to chew :)",
      "rating": 5.0,
      "verified": true,
      "author": "PK",
      "helpful_votes": 37,
      "publication_date": 20160126
    },
    {
      "title": "I had to go down a size",
      "text": "This cover solved the problem of my peeling couch. The seller was prompt provided great communication and helped me work out the problems that I had with the cover. Although I have a three seat couch, the XL cover was too large making it look messy and droopy. When I went down a size, it made all the difference.",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole W.",
      "helpful_votes": 0,
      "publication_date": 20200409
    },
    {
      "title": "Do not purchase! Get a better brand",
      "text": "This is an inferior product. The color they sent me does not even closely match that which is listed in the pictures. It also seems very thin, there is no way to hold the cover down in the grooves whereas other brands come with the foam sticks. It's poorly designed an seems to only hold couches of a certain design.",
      "rating": 1.0,
      "verified": true,
      "author": "D. George",
      "helpful_votes": 0,
      "publication_date": 20200819
    },
    {
      "title": "Good couch cover",
      "text": "I wanted something bold for my tropical living room. It turned out better than I expected. I was a little surprised it was as bright as it was but it worked out. The only reason I gave this 4 stars and not 5 was as you can see in my first picture, the bottom does not quite come down far enough despite being in the measurement range for this cover. I readjusted it multiple times but could never get it all the way to the bottom.",
      "rating": 4.0,
      "verified": true,
      "author": "Amanda Victoria",
      "helpful_votes": 0,
      "publication_date": 20200717
    },
    {
      "title": "Easy & affordable way to upgrade an old couch!",
      "text": "Such an easy way to transform your old couch! We have been redoing my family’s lake cottage (on a budget) and trying to reuse all of the existing furniture. My grandparents had an old couch that was really comfortable but now looked like a complete mess. It’s a pretty big couch and has the “L” shaped cushion sides so I was worried the cover wouldn’t fit but it’s perfect! I could definitely spend some more time tucking it and adjusting but this was just throwing it on along with new pillows and it looks 100% better!! So happy with this cover!",
      "rating": 5.0,
      "verified": true,
      "author": "Matt Danenberg",
      "helpful_votes": 0,
      "publication_date": 20200613
    },
    {
      "title": "Nice slip",
      "text": "I needed something to conceal my worn couches until Im ready to replace them. These slips are decent value. The sofa slip was perfect. Fits like a glove. Unfortunately the love seat slip wasnt as fitted. Abd they do move around as you sit and move around. Either way, not too shabby for $35-$40 a piece",
      "rating": 4.0,
      "verified": true,
      "author": "Bella",
      "helpful_votes": 0,
      "publication_date": 20191119
    },
    {
      "title": "Perfect Color",
      "text": "Delivery was fast and my color is off-white in size large, which is perfect not too light not yellow. Best part is that is machine washable, I have a 3 years old and I'm relaxed knowing that I can remove it anytime and put it in the washing machine. I'm always changing the decor in my home and this is a bargain, not expensive at all so with that said I need more colors.",
      "rating": 5.0,
      "verified": true,
      "author": "Gaucho Farmhouse ",
      "helpful_votes": 2,
      "publication_date": 20200414
    },
    {
      "title": "Looks nice",
      "text": "This looks very nice on our couch and it's nice and soft. The downside is that it's not very durable for large dogs. We already have a little hole after only a week or so of use with our boxer. It looks great and feels great but needs to be made with better material. I think it's perfect for use with smaller pets if you're trying to keep your furniture looking nice.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "Serves it's purpose. Fits well. Great color.",
      "text": "Bought this for our playroom Sofa. I needed something to keep the kids from pulling off the cushions all the time and a bonus was that it covered up the ugly old sofa. The color is great. The fabric is comfortable. It does get a bit bag-like occasionally, but it is always being climbed on and jumped on and rolled around on by my 3.5 yr old and 17 month old twins. I just readjust and tuck as necessary. I think the two piece cover would be less work as far as adjusting, but would leave the cushions accessable to be removed, therefore undoing the whole reason I bought it. Also *bonus* toys don't fall down into the sofa anymore.",
      "rating": 4.0,
      "verified": true,
      "author": "Rachael Brooks",
      "helpful_votes": 2,
      "publication_date": 20180408
    },
    {
      "title": "Soft and clean fit",
      "text": "I was concerned it would not fit. But as you can see it worked out. Or stretches well and fully covers my sofa. It’s very soft too. So far seems durable. I can only speak for a one person home with a small dog. After sitting on it a while, it moves some. I’m told putting small dowels in the couch folds out a broomstick will help with that. It’s just as easy for me smooth out back into place. The color is pretty good. Not quite the brightness I wanted but for an out of the box cover, or works nicely",
      "rating": 5.0,
      "verified": true,
      "author": "Margarita",
      "helpful_votes": 0,
      "publication_date": 20200723
    },
    {
      "title": "Beautiful, doesn't protect from liquid at all.",
      "text": "UPDATE: very fast considerate customer service. I must have received a defective cover and the whole situation was taken care of in less than 48 hours. Beautiful rich color, soft, releases pet hair easily. I dont find this protects from spills very much though. Any liquid goes right through very quickly. I've had these for 3 months and they are getting holes in them. I've emailed the company to see if perhaps I just got a bad lot or what. It would be a shame if these didn't last long at all. Again, this was taken care of immediately. Would certainly use this buyer again.",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs. Mulk",
      "helpful_votes": 0,
      "publication_date": 20200802
    },
    {
      "title": "Fantastic Purchase",
      "text": "This SUBRTEX slip cover is Fantastic! I’ve had my older sofa for quite awhile now. I was ready to get rid of it, but my husband just loves it , even though it was not very attractive. This has definitely made both of us happy, pretty and comfy! Not to mention the pocket book!🙌🏻",
      "rating": 5.0,
      "verified": true,
      "author": "Stacey Grimes",
      "helpful_votes": 0,
      "publication_date": 20200619
    },
    {
      "title": "very stretchy",
      "text": "I love the material of this, feels soft and plushy. It stretches really big, enough to cover my entire couch. But it's not built for dogs... my dog's long nails put a few holes in it after jumping up and down on it... I guess that's on me or my dog..",
      "rating": 4.0,
      "verified": true,
      "author": "Stan",
      "helpful_votes": 0,
      "publication_date": 20200326
    },
    {
      "title": "They updated my livingroom",
      "text": "Absolutely love these! Ordered the couch and love seat cover. Completely updated my livingroom. The fabric could be a little thicker just be careful not to pull to hard when putting on couch. I have a dog and I was affraid these would hold the hair but it completely just wipes off!",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa Hanks",
      "helpful_votes": 9,
      "publication_date": 20160119
    },
    {
      "title": "Not impressed at all...",
      "text": "The cover is terrible there is some white substance that comes out of it ever time you sit on it and leaves it on your clothes. I attempted to wash it and that did not help then I had the loveseat professional cleaned and that did not help. Then I realize that it only had a 30 return policy and I did not put it on the loveseat till May 11 2018. Really disappointed in this product.",
      "rating": 1.0,
      "verified": true,
      "author": "Cinamon Thompson",
      "helpful_votes": 4,
      "publication_date": 20180604
    },
    {
      "title": "Almost, but not quite..",
      "text": "Could have been a great, inexpensive update to boring loveseat BUT immediately out of the package, I found 2 holes in the fabric. Ultimately, I'm not sure how durable this fabric will be. The holes are where the \"fuzzy chenille\" squares meet the smoother weave. Slipcover went on easily, fit well, looked pretty good on the loveseat, and stayed in place during a trial sit. Had a slight chemical smell- don't know how much laundering it would take to eliminate the smell since I will be returning it due to the holes. It is a great, bold, orange color.",
      "rating": 3.0,
      "verified": true,
      "author": "Poliorcetes",
      "helpful_votes": 0,
      "publication_date": 20190412
    },
    {
      "title": "I love it!",
      "text": "This slipcover is absolutely amazing! I got mine in beige and I’m using it for my oversized chair. The quality is superb! It is so soft and fits like a glove! If your on the fence about this one, just do it. You won’t regret it.",
      "rating": 5.0,
      "verified": true,
      "author": "Jenna",
      "helpful_votes": 0,
      "publication_date": 20200219
    },
    {
      "title": "Well-made. Fabric might trap a lot of fur/lint/etc.",
      "text": "Well made. I liked the fabric’s texture, but it seemed like it would attract and trap all the lint, crumbs, and cat fur. It was a bit big for my slimmer design, mid-century style loveseat, so it was a bit baggy and I returned it.",
      "rating": 3.0,
      "verified": true,
      "author": "Kristy VandeKerckhove",
      "helpful_votes": 0,
      "publication_date": 20191018
    },
    {
      "title": "In love",
      "text": "I have spent way too much money on slipcovers for my loveseat. Can I finally found a winner!!!! This is perfect. I have an overstuffed loveseat. And this is a perfect fit. It doesn't even look like I have a slipcover on. It was easy to put on. It stays in place.",
      "rating": 5.0,
      "verified": true,
      "author": "Denise Fixsen",
      "helpful_votes": 2,
      "publication_date": 20180920
    },
    {
      "title": "Very pleased with these cover. I bought them for a couch and chair.",
      "text": "I love these furniture covers. I bought them to keep my sofa and chair clean and protected from older kids and pets. They do wear out where the pets like to nap and I have had to replace them, but they stand up to cat scratches well. They are easy to wash and put back on, and look tidy when tucked in. The are easy to whisk off when you are entertaining, and any wrinkles stretch back out when you put them back on. They are only durable to a point, but that is not unexpected with soft stretchy fabric. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "RegedornTrixie",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "Super way to keep your couches clean.",
      "text": "Just the color I expected and needed. I have 3 couches and their average age is 25 yrs old. I have 2 dogs who love to lay on the furniture. So this allows me to hide all of the ugly patterns and rips with easy to use covers. I wash them 1-2 times a week. Now, these covers are stretchy and thin, so if your doggoes dig in the corners vigorously, they can rip. But I can tuck in the tiny holes. I love these covers. Definitely cheaper than new furniture; which isn't happening. 😊 Check out the fabulous 90's plaid.",
      "rating": 5.0,
      "verified": true,
      "author": "Noelle H",
      "helpful_votes": 0,
      "publication_date": 20200821
    },
    {
      "title": "Great slipcover for the price",
      "text": "I had ordered a slip cover for my sofa in the past and was very disappointed with the quality but this one is perfect. It has a waffle weave texture to it and fits my sofa perfectly. The add spandex allowed it fit great at the bottom. The color is not as white as I wanted - it's more of a cream but I still like it.",
      "rating": 5.0,
      "verified": true,
      "author": "Sharon West",
      "helpful_votes": 0,
      "publication_date": 20200128
    },
    {
      "title": "The fit is right on!",
      "text": "When they say it fits a 70\" couch it fits and snuggly. I love that it fits my couch perfectly. You would think that it was upholstered that way. We've been covering the couch with a blanket to protect it and it always looked so frumpy. Now it looks very neat and tidy. One thing though when looking online it looked orange. but when it arrived it was way brighter than it looked online. It is almost fluorescent.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190416
    },
    {
      "title": "This one doesn't come with the foam for the sofa cracks",
      "text": "It doesn't come with the anti slip off foam like other brands. I was comparing this with other products and missed to see that it doesn't come with the foam. I would definitely recommend the one with the foam.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200917
    },
    {
      "title": "AMAZING",
      "text": "This slipcover is super soft to the touch! I love being able to sit on it with shorts on bc it’s so soft! It was easy to put on and fit over my chair really well! It’s also easy to wipe clean if you spill something on it",
      "rating": 5.0,
      "verified": true,
      "author": "Pam Cooper",
      "helpful_votes": 0,
      "publication_date": 20200218
    },
    {
      "title": "Already torn. Poor quality.",
      "text": "So I ordered the orange one and it is a TRUE orange. Like bright orange. Think Clemson Tigers orange. While I was spreading it out, getting ready to put it on my sofa, I noticed it already has a hole!! Poor quality. Returning to Amazon.",
      "rating": 2.0,
      "verified": true,
      "author": "mspinkberry08",
      "helpful_votes": 0,
      "publication_date": 20200409
    },
    {
      "title": "great cover, just as described",
      "text": "This is soft and easy to clean. It fits nicely. I also have the recliner cover and it also is nice. I recommend this cover.",
      "rating": 5.0,
      "verified": true,
      "author": "KimC",
      "helpful_votes": 0,
      "publication_date": 20191221
    },
    {
      "title": "Perfect fit on RV sofa",
      "text": "This fit an RV jack-knife fabric sofa perfectly and the color was as expected. I have not washed it yet as we have not used RV yet since the cover was put on so I don't really know how it will clean or stay in place but it seems like it will stay in place pretty well. I tried many different covers before someone recommended this one.",
      "rating": 5.0,
      "verified": true,
      "author": "jms",
      "helpful_votes": 0,
      "publication_date": 20190908
    },
    {
      "title": "Not attractive covering or color.",
      "text": "The product did cover my camel back sofa due to the fact that the material stretched but the material isn't very attractive and the color isn't very attractive either. I would not purchase again if I had it to do over.",
      "rating": 3.0,
      "verified": true,
      "author": "jvanarck",
      "helpful_votes": 0,
      "publication_date": 20190211
    },
    {
      "title": "Very nice!!",
      "text": "Bought these for my sofa set and am very happy with them. They went on quite easily (just be aware that the labels may not be on correctly so just do it without using those as a guide). They had more than enough stretch to tuck into the cushions and have stayed on well, just need to straighten and stretch occasionally. The covers also feel really great - soft and comfy. Haven't washed as yet so can't comment on that aspect.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190111
    },
    {
      "title": "The best furniture covers we have ever purchased",
      "text": "We love these sofacovers, they fit nice, and keep our furniture clean. We have several in fun colors. We, that is my wife and I, would recommend them to others.",
      "rating": 5.0,
      "verified": true,
      "author": "ejsherwood51409",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "Ugly Color",
      "text": "The color is ugly, it looks like pink it is not like in the photo",
      "rating": 1.0,
      "verified": true,
      "author": "Wendy Cepeda",
      "helpful_votes": 2,
      "publication_date": 20200614
    },
    {
      "title": "Sofa Cover",
      "text": "i like it, sizes of the sofas are different. still it fits",
      "rating": 4.0,
      "verified": true,
      "author": "Mahe",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "Easy solution for your ugly RV jack knife!",
      "text": "Perfect solution for hiding the ugly brown and turning slippery leather surface into more comfy fabric. Several have commented about it not staying put. I solved that problem by cutting up a small pool noodle and stuffing pieces of it into the creases. Worked like a charm!",
      "rating": 5.0,
      "verified": true,
      "author": "Clarice Rogers",
      "helpful_votes": 0,
      "publication_date": 20190618
    },
    {
      "title": "Nice cover",
      "text": "Holding up well to 7 Dobermans in the house. Easy to wash/clean. Looks nice & neat",
      "rating": 4.0,
      "verified": true,
      "author": "tommiller",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "I recommend this to buy",
      "text": "This is really nice and comfortable. I'm glad to buy!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200620
    },
    {
      "title": "Beautiful Color",
      "text": "The orange couch cover is bright and vibrant. I love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Misty Chapman  Thompson",
      "helpful_votes": 0,
      "publication_date": 20200223
    },
    {
      "title": "Really easy to wash and",
      "text": "Made my old, terrible-looking recliner look brand new! Really easy to wash and, once you get the hang of it, really easy to put back on. So soft and fits perfect. I highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Brad Y",
      "helpful_votes": 4,
      "publication_date": 20170306
    },
    {
      "title": "Great cover",
      "text": "We bought this for a love seat recliner that was trashed (from kids and cats). I wasn’t sure it would stretch all the way over the tall back but it does. It feels great and has given the loveseat a new life. Great investment!",
      "rating": 5.0,
      "verified": true,
      "author": "TaraFru",
      "helpful_votes": 0,
      "publication_date": 20190607
    },
    {
      "title": "Great cover",
      "text": "I bought one before that was two pieces, however I have the pottery barn feather stuffed sofa and the one piece is way easier to put on and take off for washing. This worked great and my sofa while comfy is not the easiest shape.",
      "rating": 5.0,
      "verified": true,
      "author": "theyankeesgirl",
      "helpful_votes": 0,
      "publication_date": 20190620
    },
    {
      "title": "Love it!",
      "text": "It wasn’t that hard to put on, tucked in on the sides perfectly, nothing more to say :)",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa ",
      "helpful_votes": 2,
      "publication_date": 20200606
    },
    {
      "title": "Literally fell apart the first day I used it. ...",
      "text": "Literally fell apart the first day I used it. Got holes everywhere just from my dogs getting on and off the couch. Any stretching and it just falls apart.",
      "rating": 1.0,
      "verified": true,
      "author": "Briana",
      "helpful_votes": 2,
      "publication_date": 20180222
    },
    {
      "title": "Color is pretty.",
      "text": "What ever you do, it makes your couch into a shapeless lump. It’s not waterproof. But better than nothing.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200917
    },
    {
      "title": "Good sofa cover",
      "text": "Looks like I have a new sofa, I love it. It fit perfectly on my couch. When you sit on it, it moves around a little but that is expected.",
      "rating": 5.0,
      "verified": true,
      "author": "Mandy",
      "helpful_votes": 5,
      "publication_date": 20170614
    },
    {
      "title": "Subrtex couch slip cover",
      "text": "I am in love with our Subrtex couch slip cover! It fits over our couch perfectly..no hassle. The material is super soft & machine washable. I highly recommend this company & their products. A++++😊",
      "rating": 5.0,
      "verified": true,
      "author": "Laurie H.",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "3 out of 5 stars",
      "text": "This didn't fit my 3-seat sofa. The material isn't snug over the arms, nor over the back rest to sit flush between the cushions and the back rest. The material is soft though.",
      "rating": 3.0,
      "verified": true,
      "author": "ShellyB",
      "helpful_votes": 0,
      "publication_date": 20190814
    },
    {
      "title": "Saved my sofa",
      "text": "Was going to throw my sofa out...decided to try this cover. Going to keep the sofa! So soft and lovely color.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200719
    },
    {
      "title": "Worth the buy",
      "text": "Everything about this product is great. It makes it look like I have a whole new sofa. I would recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Malary D.",
      "helpful_votes": 0,
      "publication_date": 20200903
    },
    {
      "title": "color is not what I expected",
      "text": "I like the material, however the colors are not what I expected. I wanted an olive green and I got a grey.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201017
    },
    {
      "title": "was super soft and brought a splash of color to an ...",
      "text": "The slipcover was purchased for a dorm room couch. It arrived quickly, was super soft and brought a splash of color to an otherwise dreary dorm room. Love it!!",
      "rating": 5.0,
      "verified": true,
      "author": "Missy",
      "helpful_votes": 2,
      "publication_date": 20171105
    },
    {
      "title": "It is not bad but has some issues",
      "text": "If it pretty good. It looks nice when it is fitted. It is missing tie straps that hold it underneath the couch or chair, so has a tendency to slide up. But this is the third one I have tried it is actually the best of the three. Scott a nice look, a nice feel. The wife is going to so on some strings on the bottom for we can tie together to see if it holds it in place.",
      "rating": 3.0,
      "verified": true,
      "author": "Ed",
      "helpful_votes": 0,
      "publication_date": 20170130
    },
    {
      "title": "Easy to put on the furniture and isn't confusing as some covers tend to be.",
      "text": "Fits my recliner perfectly. Very soft and comfortable. Love the color. Is exactly what I was hoping for when I ordered. Would like more in other colors! My husband loves it. It doesn't slide out of the crease in the chair as my old one did before. It doesn't need to be straightened constantly.",
      "rating": 5.0,
      "verified": true,
      "author": "Amber",
      "helpful_votes": 0,
      "publication_date": 20190820
    },
    {
      "title": "Good quality for a great price.",
      "text": "Like the quality buy it was too big for my loveseat.",
      "rating": 5.0,
      "verified": true,
      "author": "Mariline",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "Superb product",
      "text": "These are wonderful . The fit is fantastic. The fabric is so soft and comes so clean. Even the arm shape matches my couch .",
      "rating": 5.0,
      "verified": true,
      "author": "angelina rodriguez",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "great cover",
      "text": "Great color very soft. It was a little difficult to put on and you have to fix the wrinkles every time you sit on it. Otherwise its great.",
      "rating": 4.0,
      "verified": true,
      "author": "shauna ",
      "helpful_votes": 0,
      "publication_date": 20200902
    },
    {
      "title": "Don’t buy the white",
      "text": "The color is not white, second time I got taken, it a cream color. It’s not the color they show you. There’s definitely no white color in this material.",
      "rating": 2.0,
      "verified": true,
      "author": "Abuela",
      "helpful_votes": 0,
      "publication_date": 20201014
    },
    {
      "title": "Great quality for price",
      "text": "Loved the ivory color and it was just the right shade of off white. It lit up my living room and went well with my teal living room. It covered my sofa well and doesn't feel cheap. I would definitely buy again.",
      "rating": 4.0,
      "verified": true,
      "author": "Ms Medina",
      "helpful_votes": 0,
      "publication_date": 20181017
    },
    {
      "title": "Pleasantly surprised",
      "text": "It turned our cat-scratched chair into a presentable seat. Sand color was nice and neutral. Cheaper than re-upholstering and works well for now.",
      "rating": 5.0,
      "verified": true,
      "author": "Cecil B. Cole",
      "helpful_votes": 0,
      "publication_date": 20190708
    },
    {
      "title": "Stays On",
      "text": "It stays on our couch fine but can't figure out how to get it on properly. We just use it to cover the couch because we have dogs and want to cover it from the dog hair.",
      "rating": 4.0,
      "verified": true,
      "author": "Debbie Stanley",
      "helpful_votes": 0,
      "publication_date": 20190227
    },
    {
      "title": "Possibly the best thig ever ever orderd !",
      "text": "Decided to get this instead of spending hundred on a new sofa , I absolutely love it fits and looks great Getting some for Xmas gifts lol",
      "rating": 5.0,
      "verified": true,
      "author": "CATRIN DAVIES",
      "helpful_votes": 2,
      "publication_date": 20171024
    },
    {
      "title": "Soft sofa covers",
      "text": "I just received this awesome sofa cover set! It was so easy to put on and I loved the softness of it. Amazing!",
      "rating": 5.0,
      "verified": true,
      "author": "Thalia Yanez",
      "helpful_votes": 0,
      "publication_date": 20200329
    },
    {
      "title": "Color not as expected",
      "text": "The color shown in the picture is not the actual color. Inordeee the orange, which looks to be a deep vibrant orange, but what showed up was a bright neon orange.",
      "rating": 2.0,
      "verified": true,
      "author": "Jeffrey L Trujillo",
      "helpful_votes": 0,
      "publication_date": 20200327
    },
    {
      "title": "bright!",
      "text": "very bright orange.. almost a neon. other than that.. soft and textured. fit a small recliner rocking chair like a glove.",
      "rating": 4.0,
      "verified": true,
      "author": "Adaja",
      "helpful_votes": 0,
      "publication_date": 20190821
    },
    {
      "title": "I am glad i bought this for my sofa",
      "text": "I am glad i bought this for my sofa ...took some time to fit but once i got it on it made a significant difference . Will be ordering for the other sofas",
      "rating": 4.0,
      "verified": true,
      "author": "Carol",
      "helpful_votes": 0,
      "publication_date": 20180305
    },
    {
      "title": "Love my chair cover",
      "text": "I love this complete chair cover. It's soft and looks great. Very easy to put on and it stays in place.",
      "rating": 5.0,
      "verified": true,
      "author": "Lyndsy",
      "helpful_votes": 0,
      "publication_date": 20191210
    },
    {
      "title": "Not as advertised",
      "text": "This was advertised as white but is actually an ivory. Also the fabric is thin and cheap. There was already a snag. I returned it.",
      "rating": 1.0,
      "verified": true,
      "author": "RK",
      "helpful_votes": 2,
      "publication_date": 20170802
    },
    {
      "title": "Unfortunately it picks up every tiny spec of lint. ...",
      "text": "Unfortunately it picks up every tiny spec of lint.....and does not stay in place well after sitting on the sofa.",
      "rating": 1.0,
      "verified": true,
      "author": "Therese M. McElroy",
      "helpful_votes": 7,
      "publication_date": 20161217
    },
    {
      "title": "easy to put on and beautiful",
      "text": "I've been wearing this protection for three weeks. It is incredible, easy to wash, with excellent quality. my sofa is protecting and beautiful with this cover!",
      "rating": 5.0,
      "verified": true,
      "author": "Jaqueline Rocha Franca",
      "helpful_votes": 0,
      "publication_date": 20200816
    },
    {
      "title": "New look",
      "text": "Didn’t want to purchase a new love seats while the fame and everything was good. I bought sofa cover now it looks like I have a new love seat. Quick fix.",
      "rating": 5.0,
      "verified": true,
      "author": "lillie keefer",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Love it! as long as know one sits on ...",
      "text": "Love it !as long as know one sits on it. If you have a large family it becomes a hassle fixing it all day as each one gets up. Aside from that i will order again.",
      "rating": 5.0,
      "verified": true,
      "author": "bay",
      "helpful_votes": 0,
      "publication_date": 20170907
    },
    {
      "title": "theyve saved me thousands of dollars so I don't have to replace my couches that my kids destroy and they are easy to pull off and clean",
      "text": "I've had these for over 2 years...theyve saved me thousands of dollars so I don't have to replace my couches that my kids destroy and they are easy to pull off and clean!",
      "rating": 5.0,
      "verified": true,
      "author": "zachary bishop",
      "helpful_votes": 0,
      "publication_date": 20170730
    },
    {
      "title": "Nice Quality",
      "text": "This fits well considering that all covers are some what of a pain. It is soft and very nice quality. It went on easy with the tab in the back to let you know where to start.",
      "rating": 4.0,
      "verified": true,
      "author": "Diane Caudill",
      "helpful_votes": 0,
      "publication_date": 20180607
    },
    {
      "title": "Disappointing",
      "text": "I bought this because I have a cat who on occasion urinates on the sofa. The description says: \"And this sofa cover can protect your furniture from spills, stains, clothes and tear.\" To ME that means spill proof. I poured a small amount of water on the cover and it was deterred but still went through - so disappointed. And I cannot find a full cover that is spill proof so now I need a matching disappointing cover for the love seat...I just hope this can stand to be washed every month.",
      "rating": 2.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20180820
    },
    {
      "title": "Not your ‘regular’ orange.....",
      "text": "Well made product(my second set of this brand), but beware if you’re thinking along the lines of tangerine or a ‘spicier’ orange. This is straight up traffic cone orange!!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Erica",
      "helpful_votes": 0,
      "publication_date": 20191112
    },
    {
      "title": "Sofa cover",
      "text": "I bought this to protect the sofa of my cats and it didn't work very well... But is the best solution I found until now",
      "rating": 4.0,
      "verified": true,
      "author": "Mara",
      "helpful_votes": 0,
      "publication_date": 20180904
    },
    {
      "title": "Comfortable but not durable",
      "text": "It is not very durable material. Very comfortable. Static cling is a little issue as well.",
      "rating": 3.0,
      "verified": true,
      "author": "Katie",
      "helpful_votes": 0,
      "publication_date": 20180823
    },
    {
      "title": "Poor Quality- Holes",
      "text": "Mine came with several holes and I ended up just returning it. It did not fit my furniture that well, but the poor quality was what led to me returning this item.",
      "rating": 1.0,
      "verified": true,
      "author": "LY",
      "helpful_votes": 0,
      "publication_date": 20200916
    },
    {
      "title": "Easiest and most wonderful slipcovers ever",
      "text": "These slipcovers were the exact color I needed. They were super easy to put on and off. They are so soft too.",
      "rating": 5.0,
      "verified": true,
      "author": "Donnalynn ",
      "helpful_votes": 0,
      "publication_date": 20200424
    },
    {
      "title": "overall it is reasonably priced and looks fine and serves the purpose",
      "text": "It does the job but two issues: 1) it is very thin and 2) it slips and moves around; wish it had a backing to firmly stick to the furniture. However, overall it is reasonably priced and looks fine and serves the purpose.",
      "rating": 3.0,
      "verified": true,
      "author": "Mehran Habibi",
      "helpful_votes": 0,
      "publication_date": 20170526
    },
    {
      "title": "sketch Jacquard couch slipcover",
      "text": "I was very please with the way the slipcover fit on my couch,it fit very tight and the color purple looked good with my color scheme. I will buy more when I chance my color scheme for the fall. A happy customer.",
      "rating": 4.0,
      "verified": true,
      "author": "Linda Walton",
      "helpful_votes": 0,
      "publication_date": 20200904
    },
    {
      "title": "Comfortable, but in no way durable.",
      "text": "Very easy to install, fit nicely, and was very comfortable. Unfortunately it only took two weeks before it started coming apart at the seems.",
      "rating": 2.0,
      "verified": true,
      "author": "Cynthia Gawthrop",
      "helpful_votes": 0,
      "publication_date": 20200726
    },
    {
      "title": "It’s like I have a new couch!!",
      "text": "I’ve been covering my couches with blankets for a while now but no more. This cover fits perfect and doesn’t shift. It’s so soft and easy to clean. It’s like I have a new couch!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200915
    },
    {
      "title": "Very pleased",
      "text": "These were as advertised, easy to put on and fit my furniture well.",
      "rating": 4.0,
      "verified": true,
      "author": "LB",
      "helpful_votes": 0,
      "publication_date": 20180413
    },
    {
      "title": "OMG! It looks incredible!",
      "text": "Just received it today and I'm in heaven! Looks amazing and of great quality. The durability will be a factor of the future. Highly Recommend😎",
      "rating": 5.0,
      "verified": true,
      "author": "Glen S. Hoffman",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "Stunning Color and Very Soft!",
      "text": "Stunning Color and very soft to the touch! I bought three, 2 for couch to interchange between washings, one for love seat . Yes it washes very well in the washing machine and dryer. Wish you made a cover for the footstool that goes with the couch.",
      "rating": 5.0,
      "verified": true,
      "author": "ADoriables",
      "helpful_votes": 4,
      "publication_date": 20161212
    },
    {
      "title": "Set ofCovers for the sofa and loveseat",
      "text": "Like the way the covers fix the sofa, however I dislike the fact that every time I sit down when I get up I need to fix the cover.",
      "rating": 4.0,
      "verified": true,
      "author": "Esperanza R.",
      "helpful_votes": 0,
      "publication_date": 20191104
    },
    {
      "title": "Chair cover",
      "text": "Fits very well but the color has a pink tint to it.",
      "rating": 5.0,
      "verified": true,
      "author": "Berenice S.",
      "helpful_votes": 0,
      "publication_date": 20191223
    },
    {
      "title": "Wash it a lot",
      "text": "We have a two year old so got this. Only problem I see is after our foirth wash it started to get holes on the seams. For the price I expected it to be sooner and will buy agin",
      "rating": 5.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20171025
    },
    {
      "title": "best!",
      "text": "Best slipcover I've ever bought! Its durable, easy to apply, and the color is beautiful 😍!",
      "rating": 5.0,
      "verified": true,
      "author": "MissPrimrose ",
      "helpful_votes": 0,
      "publication_date": 20200816
    },
    {
      "title": "very nice product",
      "text": "I purchased the x large could have went with the large. I fix a little loose but I was still satisfied.",
      "rating": 4.0,
      "verified": true,
      "author": "Marie",
      "helpful_votes": 0,
      "publication_date": 20200528
    },
    {
      "title": "Great bright color",
      "text": "I love the color but not so much the texture.",
      "rating": 4.0,
      "verified": true,
      "author": "Chiriathaim Hernandez",
      "helpful_votes": 0,
      "publication_date": 20200404
    },
    {
      "title": "Good to keep the dog for staining loveseat",
      "text": "A bit big but I was able to tuck it in",
      "rating": 4.0,
      "verified": true,
      "author": "MDPinto",
      "helpful_votes": 0,
      "publication_date": 20190701
    },
    {
      "title": "Got here quickly",
      "text": "Used on a love seat. Was not very well explained how to put it on the loveseat. It did what I wanted for the most part. Had some excess coverings that did not fit a true loveseat.",
      "rating": 4.0,
      "verified": true,
      "author": "Susan M",
      "helpful_votes": 0,
      "publication_date": 20190730
    },
    {
      "title": "Great and fits well",
      "text": "So glad I purchased these for when my granddogs visit. They fit great and was so easy to just pull off and wash",
      "rating": 5.0,
      "verified": true,
      "author": "Sandra A. Richards",
      "helpful_votes": 0,
      "publication_date": 20170724
    },
    {
      "title": "Fit",
      "text": "Fit was just a bit to large for my chair. But there was no other listed to order so I just ordered this paticular size.",
      "rating": 4.0,
      "verified": true,
      "author": "Mrs. Patty",
      "helpful_votes": 0,
      "publication_date": 20181106
    }
  ],
  "product_meta": {
    "title": "subrtex Stretch Sofa Cover 1-Piece Couch Slipcover Furniture Protector for Arm Chair Loveseat Coat Soft with Elastic Bottom, Polyester and Spandex Jacquard Fabric Checks (Small, Gray)",
    "rating": 4.3,
    "feature_bullets": [
      "85% Polyester/15% Spandex",
      "PREMIUM FABRIC: Crafted from 85% polyester and 15% spandex thick jacquard fabric, makes sofa slipcover more resilient and durable. Fit for most types of couches such as loveseat sofa, barrel chair, ikea sofa, T-cushion sofa, leather sofa and so on. Use unique dyeing technology to keep the color unchanged after repeated washing.",
      "AVAILABLE SIZES: 1 PIECE stretch sofa slipcover is compatible with most sofa sizes. We offer suitable sofa covers in 4 sizes: Small size (32-47 inches wide), Medium size (57-70 inches wide), Large size (72-92 inches wide), and X-Large size (95-118 inches wide). Please contact us if you have questions, we are willing to assist you.",
      "SIMPLE CHANGES: Decorate your home furniture with new style and elements to keep your couch fresh and tidy. Various colors can be matched with your living room, even the sofa that is already a bit worn can have new changes. Ready-made sofa covers are a fast and cost-effective way to protect your furniture and renew your home decor.",
      "FULL PROTECTION: The soft, bouncy and comfortable sofa slipcover can prevent your sofa from accidental spills, pet scratches, daily stains and tears. Stretch fabric provides all-round protection, with thick elastic loops sewn at the bottom to securely attach to each edge, and ensure the slipcover stay in place firmly.",
      "CLEANING TIPS: Easy to care and maintain, machine washable in cold water, mild detergent, gentle cycle, tumble dry low. Please do not bleach, do not iron. High quality materials are durable for repeated cleaning, keep soft touch and high elasticity after time, refresh your sofa slipcover’s appearance and wrinkle free."
    ],
    "specifications": {
      "Product Dimensions": "15 x 12 x 3 inches",
      "Item Weight": "2.05 pounds",
      "Manufacturer": "subrtex",
      "ASIN": "B014M2J6KG",
      "Item model number": "sofa cover 7",
      "Customer Reviews": "4.3 out of 5 stars718 ratings4.3 out of 5 stars",
      "Best Sellers Rank": "#13,688 in Home & Kitchen",
      "Is Discontinued By Manufacturer": "No",
      "Fabric Type": "85% Polyester/15% Spandex",
      "Material Care Instructions": "Machine Wash, Warm Iron, Do Not Bleach, Tumble Dry",
      "Batteries Required": "No"
    },
    "categories": [
      "Home & Kitchen",
      "Home Décor",
      "Armchair Slipcovers",
      "Slipcovers"
    ],
    "price": 21.99
  }
}