{
  "website_summaries": [
    {
      "verdict": "A stylish post light that will add a little bit of charm and a lot of light to your outdoor space.",
      "pros": [
        "Oil-rubbed rust design gives it a vintage feel",
        "Comes with a 1-year warranty",
        "Simple to install",
        "Large lights that illuminate a big area",
        "Made of durable materials that won't rust or corrode when out in the elements"
      ],
      "cons": [
        "Users have said that the mounting screws included are a tad short"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Looks great at a very reasonable price.",
      "text": "I bought this to use with a LED bulb the looks like a flame. The socket was too high up so my bulb didn't look right but it was very easy to adjust the socket. I will buy another one soon. You can't beat it for the price. The large base makes it so that you can add a cord and use it as a lamp or can be hard wired and permanently mounted to a flat area. Not suitable for a post mount.",
      "rating": 5.0,
      "verified": true,
      "author": "Parrothead",
      "helpful_votes": 0,
      "publication_date": 20180401
    },
    {
      "title": "MUCH Larger Than Expected",
      "text": "CAUTION. While it is in the description this light is not for a standard 3\" home light post. It is for one MUCH larger as the base is about 8\" wide. It is a lovely fixture but can't be used like many pole lights you see around the neighborhood. It's BIG.",
      "rating": 2.0,
      "verified": true,
      "author": "Ryan Healey",
      "helpful_votes": 3,
      "publication_date": 20160712
    },
    {
      "title": "Great looking yard lamps",
      "text": "These lamps look great! I've installed two of them along my driveway on dock styled pilings. The lamps are large and look great with the new \"Edison bulb\" look alike LED bulbs sold at local home stores. Much nicer than the typical plastic yard lamps.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric Nefflen",
      "helpful_votes": 2,
      "publication_date": 20160919
    },
    {
      "title": "The product is nice but some of the screws were broken.",
      "text": "The product is nice but some of the screws were broken in half on shipment and others broke when screwing in. Be prepared to buy new screws.",
      "rating": 3.0,
      "verified": true,
      "author": "Me",
      "helpful_votes": 0,
      "publication_date": 20180227
    },
    {
      "title": "true to size",
      "text": "This lamp is really big. Perfect for my light house look. I love it",
      "rating": 5.0,
      "verified": true,
      "author": "Melodee D. Barnett",
      "helpful_votes": 0,
      "publication_date": 20180820
    },
    {
      "title": "Not only is this a great product but the company and customer are way above ...",
      "text": "Not only is this a great product but the company and customer are way above all the others! We have 2 of these fixtures on our patio and they always get compliments for our guests. Again, we highly suggest not only the products but the Eachpole Company as well!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Pen Name",
      "helpful_votes": 0,
      "publication_date": 20170814
    },
    {
      "title": "The lamps have been fine. I received one of the lights with a ...",
      "text": "The lamps have been fine. I received one of the lights with a cracked glass insert. The replacement I just received today was also cracked. I am hoping to get this resolved quickly",
      "rating": 4.0,
      "verified": true,
      "author": "Frank",
      "helpful_votes": 0,
      "publication_date": 20170323
    },
    {
      "title": "Two Stars",
      "text": "Cheap aluminum. Thin glass ... ok for staging and temporarily use.",
      "rating": 2.0,
      "verified": true,
      "author": "G. Bianco",
      "helpful_votes": 0,
      "publication_date": 20161114
    },
    {
      "title": "Post lamp",
      "text": "It's a great lamp, well packaged, well made, cool design, so I'm sorry to be returning it, but it's just too large for our front porch - especially since we'd be putting up two of them, which would be overwhelming. If it came in a smaller version, I'd buy it in a heartbeat.",
      "rating": 4.0,
      "verified": true,
      "author": "Sarah L. Nemeth",
      "helpful_votes": 0,
      "publication_date": 20160401
    },
    {
      "title": "They came very well packaged and they look very nice. I used with dusk to dawn bulbs and ...",
      "text": "Ordered 4 of these and they are much nicer than I expected. They came very well packaged and they look very nice. I used with dusk to dawn bulbs and they work great. I would order these again and recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "PWMac",
      "helpful_votes": 7,
      "publication_date": 20160110
    },
    {
      "title": "These are beautiful! We plan to install them on our pillars ...",
      "text": "These are beautiful! We plan to install them on our pillars for our driveway gate. They look so regal!",
      "rating": 5.0,
      "verified": true,
      "author": "Stacy L",
      "helpful_votes": 0,
      "publication_date": 20170517
    },
    {
      "title": "Great fixture -",
      "text": "This is a great product , they look beautiful and what a great price !",
      "rating": 5.0,
      "verified": true,
      "author": "Attilio Figliozzi",
      "helpful_votes": 0,
      "publication_date": 20160526
    },
    {
      "title": "Five Stars",
      "text": "Looks great! I added a sensor to have it turn on/off automatically.",
      "rating": 5.0,
      "verified": true,
      "author": "Casey Jones",
      "helpful_votes": 0,
      "publication_date": 20160725
    }
  ],
  "product_meta": {
    "title": "eTopLighting Bella Luce Collection Exterior Outdoor Pillar Lantern, Rust Body Finish Clear Seeded Glass",
    "description": "Provides warm, charming, and welcoming light to the exterior of your place with etoplighting Bella Luce Collection. This post pole pillar lantern exudes antique warmth with its sturdy steel and an oil rubbed rust color finish with clear seeded glass. Install this lantern in your front or back entryway or by your garage door. It is also a great accent for your porch, deck, patio, or balcony. Wherever you mount it, you will enjoy the traditional look and the bright light of the lantern. This fixture uses one Incandescent or Compact Fluorescent bulb and also Underwriter Laboratories (UL) listed for safety. This fixture is backed by one year limited manufacturer's warranty against defects in materials or workmanship under normal use after date of purchase.",
    "rating": 3.8,
    "feature_bullets": [
      "Bella Luce Collection: One-light exterior post pillar light with oil rubbed rust color finish steel and clear seeded glass.",
      "Use one Incandescent or Compact Fluorescent bulb (Max 60 watt)",
      "Dimension: 24\" x 9\" (Height x Width) Mount size: 8\"",
      "One year limited manufacturer's warranty against defects in materials and workman ship",
      "Please note: For safety reasons, installation by a professional electrician is required."
    ],
    "specifications": {
      "Manufacturer": "ETOPLIGHTING",
      "Part Number": "OT0081-PF",
      "Item Weight": "4.3 pounds",
      "Product Dimensions": "9 x 9 x 20 inches",
      "Item model number": "OT0081-PF",
      "Is Discontinued By Manufacturer": "No",
      "Size": "9 x 9 x 20 inches",
      "Color": "Bronze",
      "Style": "Post",
      "Finish": "Antique",
      "Material": "Die-Cast Aluminum",
      "Voltage": "120 Volts",
      "Item Package Quantity": "1",
      "Type of Bulb": "Ncandescent or Compact Fluorescent bulb",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "ASIN": "B014QE0AEG",
      "Customer Reviews": "3.8 out of 5 stars18 ratings3.8 out of 5 stars",
      "Best Sellers Rank": "#519,709 in Tools & Home Improvement",
      "Date First Available": "February 24, 2016"
    },
    "categories": [
      "Lighting & Ceiling Fans",
      "Outdoor Lighting",
      "Porch & Patio Lights",
      "Pendant Lights",
      "Tools & Home Improvement"
    ],
    "price": ""
  }
}