{
  "website_summaries": [
    {
      "verdict": "An elegant-looking wine opener that operates smoothly and seamlessly.",
      "pros": [
        "This rabbit-style wine opener stands out not only for its attractive design, but it is extremely easy on the hands",
        "Even those with arthritis can easily open bottles of wine with this model",
        "Many consumers also report this is a long-lasting design"
      ],
      "cons": [
        "Quality control could be improved",
        "while it lasted for years for some, others had issues with the unit malfunctioning or breaking after only months of use"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Falls apart",
      "text": "At first I thought that the opener was great. Smooth mechanism and appeared to be well made. The silver shaft that keeps the mechanism in place started coming out of its hold causing the opener to not work (see photo). I would pound it back in, but it keeps coming out. Returning it and would not want another one. Too bad as I really thought that this was the one.",
      "rating": 1.0,
      "verified": true,
      "author": "Jim Stevens",
      "helpful_votes": 105,
      "publication_date": 20170310
    },
    {
      "title": "Doesn't last",
      "text": "This is the second HQY Best Rabbit Wine Opener that I've owned. The first one stopped working within 2 months. The seller graciously replaced it with another. The replacement did the same thing. The opener simply won't last more than a few months before it gets out of alignment and pushes the cork into the wine while splashing it everywhere. Customer service is great to work with, but they can't improve the product.",
      "rating": 1.0,
      "verified": true,
      "author": "Onelady",
      "helpful_votes": 14,
      "publication_date": 20171018
    },
    {
      "title": "THEY DON'T MAKE RABBIT LIKE THEY USED TO! SECOND ONE BROKE ON 4TH BOTTLE!",
      "text": "UGH! This is the second Rabbit wine opener that has broken in a month!! Our first one lasted 10 years! Loved it! Then I replaced it with the Original Rabbit, which lasted exactly 4 months before completely falling apart. I then replaced that with the HQY Best Rabbit Wine Opener and it opened 3 bottles of wine before it completely broke. I guess they don't make them like they used to! This one is going back and I will try another brand.",
      "rating": 1.0,
      "verified": true,
      "author": "frenchy",
      "helpful_votes": 9,
      "publication_date": 20170407
    },
    {
      "title": "Ended up being great! Love the customer service.",
      "text": "Opened 3 bottles of wine so far - 1st one went as expected and similar to the original rabbit I had prior. But the last 2 pushed the cork (these were the foam kind) into the bottle. Never had that happen before with the other one I owned. ** update - the seller contacted me and replaced my first unit. The new one works perfectly and is very well made. Definitely happy now. I like the metal versus the plastic on others that you see around. Customer service was great.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason T",
      "helpful_votes": 2,
      "publication_date": 20170814
    },
    {
      "title": "Ignore the good reviews. This thing is terrible and ranks in ...",
      "text": "Ignore the good reviews. This thing is terrible and ranks in the worst 1% of all my Amazon purchases. It opened the first bottle correctly, and then pushed the cork into the next two bottles. Read the >10% bad reviews of this product and you will see this is a common problem. I wish they could pay me back for the 2 ruined bottles of wine as well as the dilemma of cleaning up a bottle of wine with a cork jammed into it. It doesn't even seem to be made out of poor quality materials, just a really poor engineering design. I had an easier time taking a cork out with a butter knife.",
      "rating": 1.0,
      "verified": true,
      "author": "a reader",
      "helpful_votes": 6,
      "publication_date": 20170727
    },
    {
      "title": "Five Stars",
      "text": "When we first purchased this product, it was amazing! But, that lasted a few weeks. It keeps falling a part. After a few months of dealing with this, I used the replacement cork screw thinking maybe that would help. That was not the problem. The silver metal pin comes lose after only a few uses and you have to hammer it back in. I have had cheaper wine openers that lasted longer than this. Very disappointed. I really want a refund.",
      "rating": 1.0,
      "verified": true,
      "author": "Spaceman",
      "helpful_votes": 4,
      "publication_date": 20161227
    },
    {
      "title": "Stopped working after five months",
      "text": "It worked...for a while. But after five months of nightly wine-opening duties, it has failed. Not in the sense that the screw got distended or dull, but the gears no longer engage correctly, so it won't pull corks. The price may seem appealing compared with the name brands (which also aren't perfect), but this was a bad deal. I'd like to get my money back, but I guess it's too late. UPDATE: after the seller read my review, they offered to ship a replacement at no charge, which they did, and that replacement has been working perfectly for months. So there may be some quality issues with the product, but the service was outstanding.",
      "rating": 4.0,
      "verified": true,
      "author": "David Kay",
      "helpful_votes": 0,
      "publication_date": 20171201
    },
    {
      "title": "Worked the first time now it pushes the cork into ...",
      "text": "Corrected review. Works fine now, the secret to resetting the cork screw mechanism after opening a bottle is to push the large top leaver down towards the claps with enough force to hear a \"click\". Works every time if you do that, hope i was clear enough! Original review: Worked the first time now it pushes the cork into the bottle every time. There is a small piece that allows this Corkscrew twist into the cork. Then it rises up with the screw to keep it in place. That piece does not go back down after the cork comes off, so then every time after the screw does not spin.",
      "rating": 5.0,
      "verified": true,
      "author": "Tyler R. Hathaway",
      "helpful_votes": 0,
      "publication_date": 20170921
    },
    {
      "title": "Did I get a lemon?",
      "text": "I had a Rabbit opener for several years till it broke without possibility of being repaired. Loved it. This replacement was a terrible mistake: firstly, it pushes the corks INTO the bottle. I have to use a manual corkscrew to get them out. Secondly, the gears don't properly mesh, and it hangs up the action. Came in impressive packaging. Looked terrific. But, it's junk. I'd give it a lower review, but it did work, with some difficulty, for a few times.",
      "rating": 2.0,
      "verified": true,
      "author": "RDFarr",
      "helpful_votes": 0,
      "publication_date": 20170710
    },
    {
      "title": "Perhaps I'll have better luck.",
      "text": "I seem to go through rabbit openers which often break when working on a particularly difficult cork. Usually it is the collar that connects to the geared slider. I've generally just thrown them away. It would be a tremendous help if the current seller could identify a repair facility for this one if needed. I must say this is the most attractive Rabbit I have owned and is working flawlessly. Perhaps I'll have better luck.",
      "rating": 4.0,
      "verified": true,
      "author": "Malcolm J. McAuley",
      "helpful_votes": 4,
      "publication_date": 20170119
    },
    {
      "title": "After only a few uses, it no longer pierces the cork, but simply pushes it into the bottle.",
      "text": "I do not recommend this product. I previously owned the original Rabbit wine opener, and to replace it I ordered this knock-off imitation. But after only a few uses the corkscrew no longer pierces the cork, but simply pushes it down into the bottle. Of course the malfunction came at the worst possible time, a dinner party for ten. I'm throwing it away and ordering another original.",
      "rating": 1.0,
      "verified": true,
      "author": "Paperback Writer",
      "helpful_votes": 2,
      "publication_date": 20171203
    },
    {
      "title": "We love this tool",
      "text": "I am impressed with Amazon and HQY as they resolved my problem. We love this tool, but our's didn't seem to work correctly. I wrote to Amazon inquiring about the warranty 3 days ago. I was VERY surprised to find that a replacement Rabbit opener had been sent and delivered to our home before I even checked to see if HQY had received my message. Very impressive! I would recommend this Rabbit wine opener to all. It is especially easy for my wife to open a bottle. We love it! Again, Thank you.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert D Bartell",
      "helpful_votes": 21,
      "publication_date": 20161023
    },
    {
      "title": "I took it out of the box and the first ...",
      "text": "I took it out of the box and the first time I went to use it it pushed the cork into the bottle and a piece broke off. Returned it immediately. Review update. This seller cares very much about having happy customers. After my return they provided me with another one. And although I have only used it once so far, the product seems to be working much better than the original one I was sent. I am upgrading my review somewhat for the product but more importantly because of the proactive approach the seller has taken on this issue. After I use it a while I will update this review again.",
      "rating": 4.0,
      "verified": true,
      "author": "Louis F.",
      "helpful_votes": 2,
      "publication_date": 20161213
    },
    {
      "title": "like Jim Stevens' review",
      "text": "Unfortunately there is no zero stars. I purchased this in October to bring to our cottage at Christmas, used it 3 or 4 times and, like Jim Stevens' review, it came apart. Pounding it back in doesn't do anything because there's less and less friction each time. I don't have the box anymore and cannot return; more's the pity. Junk.",
      "rating": 1.0,
      "verified": true,
      "author": "David Thompson",
      "helpful_votes": 2,
      "publication_date": 20171228
    },
    {
      "title": "pretty, but useless",
      "text": "Updated review*** HQY very kindly delivered a new opener to me. It works beautifully so far (have opened about 10 bottles with it). The service was excellent and prompt when I left a poor review. I hope they solve the manufacturing problem because it's a good company. It's beautiful, I just wish it worked. I purchased for a friend, and they just opened it, and it doesn't work properly. Unfortunately, I missed the return window...so now I'm stuck with it",
      "rating": 4.0,
      "verified": true,
      "author": "rituali",
      "helpful_votes": 0,
      "publication_date": 20170925
    },
    {
      "title": "Smooth, Easy to Use",
      "text": "We prefer the Rabbit-style wine openers for being quick and easy-to-use. This one is just that, with its smooth mechanism and easy cork removal, both from the bottle and from the opener itself. It's advertised as \"luxury gold\", but its finish is actually more of an antique copper. We don't care; we just wanted to be able to open wine easily and effectively, and this opener does that. Since we just received it a couple of weeks ago and have only opened a few bottles, I could not give it more stars, not knowing how long it would last. But so far, so good.",
      "rating": 4.0,
      "verified": true,
      "author": "N.J.",
      "helpful_votes": 0,
      "publication_date": 20170508
    },
    {
      "title": "the ease of using the product",
      "text": "we had one we were using for a few years we loved how it worked but it eventually wore out. so when i seen this one on amazon i ordered it, i didn't think it would be so much better, its easy to use and feels like its a much better one, its a heavy duty one it doesn't feel cheap, but it only lasted about 3 to 4 weeks and came apart.",
      "rating": 1.0,
      "verified": true,
      "author": "ronnie",
      "helpful_votes": 0,
      "publication_date": 20181122
    },
    {
      "title": "How to modify it so it won't break",
      "text": "There is a design flaw in the way the guide rod is fixed to the top of the corkscrew. As others have noted, it is held only by friction. After several months of use the guide rod works loose and the device stops working. As shown in the photo, I drilled a 1/8 inch hole, tapped it to make screw threads, and secured the guide rod with a set screw. Pity the manufacturer couldn't figure out how to do it for us.",
      "rating": 2.0,
      "verified": true,
      "author": "Ramos Washington",
      "helpful_votes": 0,
      "publication_date": 20191004
    },
    {
      "title": "Wish I would have purchased sooner!",
      "text": "The wife and I drink a bottle of wine pretty much every night and there is no telling how may countless hours have been spent fishing broken corks out of bottles or dealing with other nonsense. This thing has changed my life for the better. The opener has a bottle ready to drink in 10 seconds....without issue, always. I have not encountered a single problem with the product since its arrival.",
      "rating": 5.0,
      "verified": true,
      "author": "Jesse Rohr",
      "helpful_votes": 0,
      "publication_date": 20190115
    },
    {
      "title": "Excellent Product - Excellent customer service",
      "text": "Superb - All metal, sturdy, works perfectly. Product delivered on time. Recommend to anyone needing a great wine opener. 11/19/2017 Follow-up Comments Original product broke after the 3rd use. I contacted the company and they promptly replaced it with no questions asked. and no requirement to ship broken one back to them. Excellent customer service. One never likes to have issues with products, but having a company stand behind them and correcting any deficiencies is all one can ask for.",
      "rating": 5.0,
      "verified": true,
      "author": "Beagaloo",
      "helpful_votes": 0,
      "publication_date": 20171008
    },
    {
      "title": "This design wins",
      "text": "I love this style of corkscrew. This replaced one I literally found near a garbage dump (I know tacky but really they were just to lazy to donate it to Goodwill). I used it for 10 years! When it finally broke I found this one and love it just as much even though its new (LOL). I look forward to another 10 years.",
      "rating": 5.0,
      "verified": true,
      "author": "KC",
      "helpful_votes": 0,
      "publication_date": 20200229
    },
    {
      "title": "Sturdy and Works Well",
      "text": "My previous Rabbit died and I had to replace it. This is the best type of wine bottle opener that I have had, so I looked for another. The HQY looked good in the descriptions, as compared to others of the same type. So far it has performed as expected. It is sturdy and opened the bottle with ease. The foil cutter is superior to the one I had before.",
      "rating": 5.0,
      "verified": true,
      "author": "Dean S. Hartley",
      "helpful_votes": 0,
      "publication_date": 20180119
    },
    {
      "title": "It seems to be well constructed and very sturdy. Works exactly as claimed",
      "text": "Arrived promptly. I immediately tried it out. It seems to be well constructed and very sturdy. Works exactly as claimed. I followed directions and did not try to push the screw into the cork quickly. You don't need to be glacially slow, but don't be in a great rush. Cork extraction from the screw also works just fine, although you do have to squeeze the handles tightly because the cork is considerably smaller diameter than the neck of the bottle. The only drawback is that with a kitchen already full of various types of utensils, it would be nice if this were collapsible or smaller. I know, that's too much to expect. Buy one, they're great!",
      "rating": 5.0,
      "verified": true,
      "author": "emcguy44",
      "helpful_votes": 0,
      "publication_date": 20170531
    },
    {
      "title": "Very poor quality metal, broke after 60 days",
      "text": "This corkscrew is made of very poor quality metal. It only lasted 2 months before it broke in two. It doesn't matter if they give you an extra corkscrew worm if the basic unit breaks into two pieces. My only wish is that I could give it zero stars. I mean, I can see if it broke after a year or two but 2 months is ridiculous.",
      "rating": 1.0,
      "verified": true,
      "author": "Chris J",
      "helpful_votes": 0,
      "publication_date": 20190511
    },
    {
      "title": "It acts like the screw is stripped out but there is no ...",
      "text": "I'm not one to give one star reviews over trivial things, but this wine opener broke the first time I used it. The screw that holds the corkscrew in place popped off when I attempted to use it. I tried to put it back on thinking it was loose, but nope, it kept popping off. It acts like the screw is stripped out but there is no sign anything is wrong. Maybe a bit of threadlocker would fix it, but I'm not taking that chance. I cannot recommend this product.",
      "rating": 1.0,
      "verified": true,
      "author": "Bugalaman",
      "helpful_votes": 0,
      "publication_date": 20170803
    },
    {
      "title": "Rabbit Wine Corkscrew is a work of art!",
      "text": "This excellent product is an engineering marvel and works beautifully. This is the second one of these devices I have owned. My other lasted seemingly forever. I can't remember when I bought it but it has to be at least ten years ago. The device smoothly extracts wine corks and then when you reverse the motion it unwinds itself so to speak making the cork easy to remove and discard. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "A. A. Walsh",
      "helpful_votes": 0,
      "publication_date": 20170519
    },
    {
      "title": "2nd Opener to Die",
      "text": "I’m on my 2ndRabbit. The first one had a gear problem that made it inoperable. The manufacturer graciously replaced it with a new Rabbit. The 2nd one pushes the corks into the bottle. This is caused by the corkscrew being out of alignment.another one bites the dust. I think I will look for other a different opener.",
      "rating": 3.0,
      "verified": true,
      "author": "tb123102",
      "helpful_votes": 0,
      "publication_date": 20181229
    },
    {
      "title": "Four Stars",
      "text": "I was asked to give a review right away. I replied \"so good so far.\" Well, not anymore. In less then a year it broke. I did read other reviews that stated the same and chose to ignore them because the price was reasonable. DO NOT IGNORE THOSE REVIEWS!",
      "rating": 1.0,
      "verified": true,
      "author": "mrsclaps",
      "helpful_votes": 0,
      "publication_date": 20170516
    },
    {
      "title": "I returned it",
      "text": "A lot of people have good reviews. And a lot of people seem to have problems. For me, the screw went into the cork great, but rather than lift the cork out, it just unscrewed and came out of the cork when trying to open it. Returned first one for replacement. Second one did exactly the same thing. Seems like a hit-or-miss item, and both of mine missed. Returned both for a full refund.",
      "rating": 1.0,
      "verified": true,
      "author": "Joe Oppelt",
      "helpful_votes": 0,
      "publication_date": 20190112
    },
    {
      "title": "Works but only for a short time...",
      "text": "This wine opener initially worked as advertised but after opening only 8 bottles in the 60 days since purchase the opener simply does not work anymore. I hoped it would work longer. Update: I contacted the Seller and they worked quickly to resolve my issue and send me a new unit. I was pleasantly surprised by the great customer service I received and I could not ask for more as a customer. Thank you!",
      "rating": 4.0,
      "verified": true,
      "author": "Sean",
      "helpful_votes": 0,
      "publication_date": 20180304
    },
    {
      "title": "Removes cork maybe 5% of the time",
      "text": "I've long used other brands and thought I'd give this inexpensive model a try, especially because the reviews are strong and the replacement worms are cheap. Alas. The opener simply inserts and removes its own worm, sans cork, nearly every time. It managed to remove a cork only a few times after 20 or 30 tries with several bottles. Returning promptly and looking elsewhere.",
      "rating": 1.0,
      "verified": true,
      "author": "Meg Houston Maker",
      "helpful_votes": 2,
      "publication_date": 20170530
    },
    {
      "title": "This is NOT a high quality wine opener.",
      "text": "I thought that the opener was great - smooth mechanism and appeared to be well made. But after using it for a year or so, the silver shaft that keeps the mechanism in place started coming out of its hole, causing the opener to not work. I have pushed the shaft back in, but it keeps coming out. I am really disappointed that this opener has failed. I really believed that this would be a high quality wine opener. This opener is made to look good, not perform. I am now suspicious of Amazon's ranking system.",
      "rating": 1.0,
      "verified": true,
      "author": "D. Fischer",
      "helpful_votes": 0,
      "publication_date": 20170729
    },
    {
      "title": "Broke within 6 months",
      "text": "I bought the first Rabbit wine opener in August of 2017, 5 months later it was broken. Ordered another in January of 2018, 6 months later that one broke. The lever separated from the cork screw mechanism both times. Save your money.",
      "rating": 1.0,
      "verified": true,
      "author": "V J",
      "helpful_votes": 0,
      "publication_date": 20181104
    },
    {
      "title": "Solid costruction",
      "text": "I had a former \"Rabbit\" pattern corkscrew - a knock-off with flimsy plastic handles which finally fell apart. At a store, I examined the current model of genuine Rabbit corkscrews that had stronger, but still plastic handles. I have an older Rabbit corkscrew of all-metal construction that I will expect to live forever. I was delighted to find on Amazon's site the\"HQY Best Wine Opener Corkscrew\" that appeared to also be all-metal, and at a reasonable price. Upon receipt, my expectations were fulfilled, and I expect a lifetime of good service from this item.",
      "rating": 5.0,
      "verified": true,
      "author": "Lin Wilson",
      "helpful_votes": 0,
      "publication_date": 20190306
    },
    {
      "title": "2 years and still perfect!",
      "text": "I used to have the rabbit brand opener, and it broke in like 6 months. I bought this instead, and omg it's been 2 years and it still works perfectly. Even came with an extra corkscrew which I haven't had to use yet. I highly, highly recommend this product to any wine drinkers!",
      "rating": 5.0,
      "verified": true,
      "author": "Sam",
      "helpful_votes": 0,
      "publication_date": 20190124
    },
    {
      "title": "Easiest bottle opener currently available.",
      "text": "I like the most that it's the 2nd best wine opener I've owned. I bought the original version of this same opener through Costco and it was made substantially better. My gripe: this version does not unscrew the cork easily because the cork slips up and I must hold it down with my thrumb. The original did this perfectly.",
      "rating": 4.0,
      "verified": true,
      "author": "Richard E. J. Burke",
      "helpful_votes": 0,
      "publication_date": 20180702
    },
    {
      "title": "Great opener",
      "text": "Not quite as big as our previous rabbit opener but just as sturdy and easy to use. Great quality and love the copper finish. It came in a nice box to store it in which is great as our last opener probably got banged around in our utensil drawer. Altogether a great purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "Melinda Bush",
      "helpful_votes": 3,
      "publication_date": 20161203
    },
    {
      "title": "Fell apart, opened maybe two wine bottles",
      "text": "I followed all the instructions even the extra instructions included because they know this is a poor product. The corkscrew pushed the cork into the wine bottle. Per instructions I replaced the screw part with the spare included, since the first one seemed to have a little bend on the end that didn't allow it to go into the cork via its point. The second one worked a few times but other parts began to loosen up (the rod that the lever slides up and down on). I would return it but I am so angry that the effort doesn't seem worth the $24.",
      "rating": 1.0,
      "verified": true,
      "author": "marjory brzeskiewicz",
      "helpful_votes": 0,
      "publication_date": 20190409
    },
    {
      "title": "Not Bad",
      "text": "I recently bought this opener to replace one that I had for YEARS. It works just as easily as the one I loved but the tool to cut and open the foil on the bottle is NOT very sharp so you have to repeatedly use it to open the bottle. Also, a little black \"knob\" on one side has already fallen off so I keep putting it back on . For now..... doesn't affect the ability to open a bottle.",
      "rating": 3.0,
      "verified": true,
      "author": "Jane Tonkin",
      "helpful_votes": 0,
      "publication_date": 20190202
    },
    {
      "title": "This opener worked great the first 5 times I used it",
      "text": "This opener worked great the first 5 times I used it. Then the silver shaft that keeps it in place came out. I would get it back in place but it would still come out and could not get the cork out of the bottle. I am seeing this same complaint from other purchasers here. Very frustrating. I requested my money back from the seller and it was promptly refunded. I would not recommend this opener.",
      "rating": 1.0,
      "verified": true,
      "author": "CeeBee",
      "helpful_votes": 0,
      "publication_date": 20171127
    },
    {
      "title": "Poor Quality/Lacks Durability.",
      "text": "Just trashed my 4th one of these over the last several years. No issues other than they do not last even under moderate use. Product looks nice, easy to use, does the job designed for but simply is not durable - even under moderate use. Reverting to a simple manual corkscrew. Not as convenient but then again I don't have to replace every 7or 8 months. Grant, Southlake, TX",
      "rating": 2.0,
      "verified": true,
      "author": "grant whitt",
      "helpful_votes": 0,
      "publication_date": 20190827
    },
    {
      "title": "Five Stars",
      "text": "came quickly and broke after the 4th use. Return window closed (apparently I don't drink enough to have noticed the change in functionality in time to return!!) so disappointed",
      "rating": 1.0,
      "verified": true,
      "author": "Dina",
      "helpful_votes": 0,
      "publication_date": 20170720
    },
    {
      "title": "jams the cork into the bottle",
      "text": "The first time I used this opener it worked like a charm. The next 2 times it just pushed the cork into the bottle, which is extremely frustrating - i tried pushing the cork deep into the bottle but that pushed wine out the top and made a huge mess. Does anyone have a suggestion for how to fix or is it hopeless? Thanks",
      "rating": 1.0,
      "verified": true,
      "author": "Vercin",
      "helpful_votes": 0,
      "publication_date": 20170725
    },
    {
      "title": "Disappointed and Do Not Recommend",
      "text": "I wish the original Rabbit was still available. Half the time, it works correctly. The other half the time, the corkscrew comes out without the cork, or the corkscrew pushes the cork into the bottle, or it pulls the cork out correctly, but doesn't easily release the cork and you have to hand unscrew the cork to get it off, which is not easy. I normally don't write a review, but I and very dissatisfied by this product.",
      "rating": 2.0,
      "verified": true,
      "author": "Sophia S. Boyd",
      "helpful_votes": 0,
      "publication_date": 20171207
    },
    {
      "title": "This thing is just plain awesome. It's heavy",
      "text": "This thing is just plain awesome. It's heavy, smooth operating, and very visually pleasing. Like, you can leave it and/or the nice box it comes in out as a functional decoration. The actual action of the thing is just as awesome. This thing is gonna turn me into a wine-o just because it's so satisfying opening bottles, haha. Big fan.",
      "rating": 5.0,
      "verified": true,
      "author": "Sam Bartell",
      "helpful_votes": 2,
      "publication_date": 20161130
    },
    {
      "title": "A Real Hand Slammer",
      "text": "While opening the third bottle of wine with the unit, the threaded cap which holds the screw in place broke loose while I was trying to drive the screw into the cork. This resulted in my hand slamming into the head of the screw. One bleeding ring finger and one bruised pinky later, I found the cap and threaded it back onto the opener. I successfully opened the bottle but then went and put a bandage on my finger. I'm giving the unit 2 stars because that's how many bottles I've successfully opened (out of three). It has nice construction (lots of metal not plastic) but the assembly process needs some help.",
      "rating": 2.0,
      "verified": true,
      "author": "i heart flamingos",
      "helpful_votes": 0,
      "publication_date": 20170726
    },
    {
      "title": "Excellent or better than the rest..",
      "text": "Without a doubt, the best wine opener we have. I have two; one here at home and one at our cabin in the NE Georgia mountains.. Same as most men, I abhor throwing anything away. After I bought the HQY opener, I threw the others away.. Added: I bought my daughter one and she says the HQY opener is the best.. There is no better rating than a repeat customer.",
      "rating": 5.0,
      "verified": true,
      "author": "Ken",
      "helpful_votes": 0,
      "publication_date": 20170424
    },
    {
      "title": "We have used it about once a week and it worked fine both removing the cork from the bottle and removing ...",
      "text": "Purchased this as a gift to my husband in December 2016. We have used it about once a week and it worked fine both removing the cork from the bottle and removing the cork from the corkscrew. Makes the process fast and easy. Then it stopped working. Contacted the seller and had a replacement within five days. This product has a five year warranty. It's great!",
      "rating": 5.0,
      "verified": true,
      "author": "E. Szrom",
      "helpful_votes": 0,
      "publication_date": 20180111
    },
    {
      "title": "Great opener for a great price!!!",
      "text": "Thought I was ordering a different brand name of opener, but this wine opener performs just as good for a lot less than it's over priced counterpart. I would highly recommend this purchase. Have been using if for a couple of months now.",
      "rating": 5.0,
      "verified": true,
      "author": "Michele P.",
      "helpful_votes": 0,
      "publication_date": 20200921
    },
    {
      "title": "One HUGE Problem",
      "text": "After using this about 5 times, it started pushing the cork down into the neck of the bottle instead of screwing into the cork. It now does this in about 1 of 3 bottles. If you have ever had this happen you know this is a recipe for disaster. Your only option is to push the cork all they way into the bottle, which means you will shoot wine all over the place. Think red wine geyser in your kitchen. The device is well-made, but does not work correctly.",
      "rating": 2.0,
      "verified": true,
      "author": "Jimmy D Ballard",
      "helpful_votes": 0,
      "publication_date": 20181226
    },
    {
      "title": "High Quality, Easy to use",
      "text": "We have bought several cheap openers over the years that eventually break. I blindly bought this during the Amazon Prime sale for $21.20. I am glad I did now! I have carpal tunnels and opening wine bottles is a daunting and sometimes painful task. I can open a bottle easily and quickly. It also comes with a foil/cork cutter and it is in a really nice storage/gift box. It is high quality and worth every penny even at regular price. I have seen similar openers for $50 in a retail store. HQY beats all competitors, sale price or not. I would definitely recommend to buy this opener and I will be shopping HQY for other products.",
      "rating": 5.0,
      "verified": true,
      "author": "CKT",
      "helpful_votes": 0,
      "publication_date": 20170720
    },
    {
      "title": "I loved this when i first got it but after about ...",
      "text": "I loved this when i first got it but after about 15 bottles the top piece keeps popping off and it wont work at all now! VERY VERY DISAPPOINTED : ( i WANT TO RETURN IT BUT I CANT FIND ANYTHING ON Amazon TO RETURN???? DON'T WASTE YOUR MONEY",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171022
    },
    {
      "title": "Falls Apart After Normal Use",
      "text": "It worked great at first and then after about 5 months of normal use it just started to fall apart while in the middle of trying to open wine bottles, leaving the screw stuck in the cork instead of pulling it out. We tried to screw it back together after it happened once but it just kept happening after that. Not great for long term/frequent use. Updated Review: After seeing my original review above, the manufacturer did reach out to offer a free replacement or full refund so I give them an additional star for the customer service. I appreciate the refund.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171221
    },
    {
      "title": "It breaks under normal use :-(",
      "text": "I loved this wine opener for 1 month. Then it broke. Hasn’t “fallen” apart, but does not operate any longer. The part do not work. The last wine opener I had like this, lasted 20 years! **** I do not know how to contact the company for a replacement, so I have to post here.",
      "rating": 1.0,
      "verified": true,
      "author": "Tracy M.",
      "helpful_votes": 0,
      "publication_date": 20200214
    },
    {
      "title": "Great quality set in a unique color.",
      "text": "The corkscrew set was nicer then I expected. Since it was a Rabbit wine opener, I figured the quality would be good, but I really like the burnished bronze color of the tool as it compliments my copper and stainless steel bar tools. I was a bit weary to order initially because of the big price cut noted by the seller, but there were no issues at all with the product and I am quite happy with the purchase and would order from this seller again. The set arrived in great condition and earlier than anticipated. It is boxed beautifully and everything in the set is a useful addition to my bar.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott G Mattox",
      "helpful_votes": 0,
      "publication_date": 20170731
    },
    {
      "title": "Excellent, High Quality Opener",
      "text": "The wine opener is very high quality and works perfectly. I would expect it to last a very long time. Also, the packaging presentation (the package it came in) was excellent. It was fun and interesting to open it up even though I knew exactly what was inside. This would make a great gift for others.",
      "rating": 5.0,
      "verified": true,
      "author": "ROB IV",
      "helpful_votes": 2,
      "publication_date": 20170522
    },
    {
      "title": "That it works as avertized",
      "text": "It looks like the other wine openers of this type on the market, but it does not work. The wine cork screw goes into the cork and unscrews on the way out. Does not pull the cork out.",
      "rating": 1.0,
      "verified": true,
      "author": "Boise Camper",
      "helpful_votes": 0,
      "publication_date": 20190210
    },
    {
      "title": "We bottle our own wine and use number 9 corks ...",
      "text": "We bottle our own wine and use number 9 corks and this opener pushes more corks in then pulls out... i have had similar wine openers with no problems... I think we will be returning as every bottle it pushes the cork into is one less we have to refill with wine... UPDATE..AWESOME CUSTOMER SERVICE, I WAS OFFERED A REFUND OR REPLACEMENT AND WAS CONTACTED BY HQY..I HAVE TO SAY EVEN IF ONE DOSN'T WORK OUT I WILL BE SHOPPING WITH HQY IN THE FUTURE UPDATE, HQY sent me a new opener free of charge and we have had zero problems with the new opener. I changed from a one star to a 5 star...",
      "rating": 5.0,
      "verified": true,
      "author": "Tim M",
      "helpful_votes": 0,
      "publication_date": 20170608
    },
    {
      "title": "Nice rabbit opener",
      "text": "Nice rabbit opener. Excellent look with the brushed bronze color. I couldn't figure out how to use the opener at first, but a little research and I realized I needed to grip it all the way down and push the screw until it locks. Only thing that prevented a five star was that the little black plastic covers for the bolt on the sides are fragile.",
      "rating": 4.0,
      "verified": true,
      "author": "Lilredpanda",
      "helpful_votes": 0,
      "publication_date": 20180324
    },
    {
      "title": "Poor design, don't buy.  Still poor, still don't buy.",
      "text": "Poor design, chrome plated alignment rod is press-fit into assembly and force required to remove cork from opener causes the rod to come loose. Other reviews confirm this is a common problem. Don't buy unless design is changed. UPDATE: Received new opener after complaining to seller, so customer service is excellent. Regretfully, replacement has same design flaw as original, so future performance is problematical. Time will tell. UPDATE #2: Second opener failed during first use when attempting to remove cork from bottle. The corkscrew backed out of the cork without removing it, another common problem as evidenced by other reviews. Buyer beware!",
      "rating": 1.0,
      "verified": true,
      "author": "Bob",
      "helpful_votes": 0,
      "publication_date": 20171226
    },
    {
      "title": "Sturdy, sylish and balanced",
      "text": "Sturdy, well designed and actually stylish looking with contrasting metal colors. Update: Totally stopped working and don't have a clue why. Changed the cork remover as directed if a problem etc. Only opened about 6 bottles and this sturdy looking instrument totally fails. Will try to get replacemnt but probably too late.",
      "rating": 1.0,
      "verified": true,
      "author": "Anthony J. Arangio",
      "helpful_votes": 0,
      "publication_date": 20180114
    },
    {
      "title": "Stopped working...",
      "text": "Initially, I loved the product, but now after using it only a few times, it stopped working! The corkscrew goes into the wine bottle and then comes right out without removing the cork. I thought that I was doing it wrong so I had my fiancé try, but he couldn't get it to work either. I reviewed the instructions, and still no luck with it working...",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180107
    },
    {
      "title": "Effortless wine opener",
      "text": "This is a durable and easy to use “rabbit” wine opener. Others I’ve had in the past have cheap plastic handles that break off. After a year of opening numerous wine bottles, the lever still operates smoothly and effortlessly.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180716
    },
    {
      "title": "This broke after about 30 uses. Tried repairing it ...",
      "text": "This broke after about 30 uses. Tried repairing it; however, the gears pull apart when extracting a cork....leaving the cork halfway in the bottle with the screw pin stuck within. It is NOT (nowhere near) a \"Best Rabbit....\" Follow-up: Seller contacted me with desire to know what specifically went wrong. They went out of their way to correct the problem, and they sent me a replacement without my asking for it. The new one seems to work just fine. Maybe just a faulty one the first time. Anyway, customer service was unsolicited and much appreciated.",
      "rating": 3.0,
      "verified": true,
      "author": "Dan Black",
      "helpful_votes": 0,
      "publication_date": 20170124
    },
    {
      "title": "AVOID IT - FLIMSY JUNK",
      "text": "Absolute piece of.... junk. Arrived broken and is so flimsy that it won't last a week. Nothing like the original (other than the design, which isn't executed very well) - Funny.. there was an quality inspection card inside - pre-printed and in broken English. AVOID this one..",
      "rating": 1.0,
      "verified": true,
      "author": "Jam-i",
      "helpful_votes": 0,
      "publication_date": 20171129
    },
    {
      "title": "Works 50/50",
      "text": "This pushes the cork into the bottle half the time, the other half of the time the corkscrew is misaligned and comes through the side of the cork. When everything is set up and securely held against the bottle, the corkscrew seems like it's set up to fail because the screwpoint doesn't start out in the middle of the cork (not even near the middle) I've had multiple different people try to use it with no improvement.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171028
    },
    {
      "title": "Useless",
      "text": "Update: when I asked if there was a warranty on this product, the business responded quickly and apologized for my issue. THey are sending me a new on for free. I’m excited to try it again because it did work great at first. Hopefully it was just a fluke! Initial post: I enjoyed this opener for the first few times I used it. Now, all it does is push the cork INTO the bottle. My old school, cheap opener works mjch better. I wish I could return it because It's useless.",
      "rating": 4.0,
      "verified": true,
      "author": "kroyal",
      "helpful_votes": 0,
      "publication_date": 20170928
    },
    {
      "title": "Broke too soon",
      "text": "Never worked quite as smoothly as my old original Rabbit did when I first bought the Rabbit, and now, it has failed. The link of vertical gears to which the screw itself attaches cracked , and no longer engages with the rounded gear on the handle.",
      "rating": 1.0,
      "verified": true,
      "author": "Jim Bob Moffet",
      "helpful_votes": 0,
      "publication_date": 20180718
    },
    {
      "title": "Does not work!",
      "text": "This opener does not work. It’s a pretty simple concept, pushing down on the lever causes the cork screw to twist in, and then pull up and the cork comes out. But that’s not what happens! The cork screw just twists back out. I complained to the seller and they sent me a new one. Problem is, the new one does the same thing! Wast of money",
      "rating": 1.0,
      "verified": true,
      "author": "Dustin Moody",
      "helpful_votes": 0,
      "publication_date": 20180726
    },
    {
      "title": "Product didn't work for me as intended",
      "text": "The concept and operation of the wine opener was very easy to follow and use. The main problem we had was that the corkscrew simply slid into and out of the cork and had no grab to it. We had to resort to using another type of cork remover in order to get it out. That may never happen again but unfortunately it was on our first try. We left the product at our vacation home and haven't had a chance to try it out again. Plan to use it again soon and verify if it was a one time snafu or something chronic with the corkscrew itself.",
      "rating": 3.0,
      "verified": true,
      "author": "JB",
      "helpful_votes": 0,
      "publication_date": 20190117
    },
    {
      "title": "Ornamental Qualities Only",
      "text": "Hate writing bad reviews but have to speak out. This product broke beyond repair in the New Year, under normal use, about 5 months after purchase. Put that another way: we open a bottle of wine about one a week, so after opening 20 bottles, the device is useless - and outside of Amazon's return guarantee. Unacceptable workmanship. On the bright side, it LOOKS good. Yet I recommend you do not buy, unless you're planning to use it as an ornament.",
      "rating": 1.0,
      "verified": true,
      "author": "John Pepper",
      "helpful_votes": 0,
      "publication_date": 20180115
    },
    {
      "title": "The best wine opener I’ve ever used.",
      "text": "Product is amazing. I’ve owned rabbit wine openers and it seems over the years the construction has gotten cheap and easily breaks or wears out. This HQY wine opener reminds me of the rabbit openers when they first arrived in the market. You can feel the durable construction in the weight and the opener works perfectly. Definitely will buy again, not for myself because the product won’t need to be replaced for years to come, but for gifts for family and friends.",
      "rating": 5.0,
      "verified": true,
      "author": "Boots",
      "helpful_votes": 0,
      "publication_date": 20171116
    },
    {
      "title": "Too dull, waste of money",
      "text": "The worm on the corkscrew is actually too dull to penetrate a natural cork. On first use it pushed the cork into the bottle of wine, rendering it almost impossible to remove the cork (wound up having to use a different corkscrew to get it back out). Do not waste your money on this piece of junk – 1/2 the price of similarly designed items for a reason.",
      "rating": 1.0,
      "verified": true,
      "author": "Jacob Weiskoff",
      "helpful_votes": 0,
      "publication_date": 20181223
    },
    {
      "title": "Very pleased - value for money spent",
      "text": "I am very pleased with my new rabbit wine bottle opener. I have used these for over 20 years and occasionally they break. Perhaps a bit too much wine ;-). From what I can tell having just received this particular opener, it appears well made and of quality materials. Time will tell. All the best, Richard",
      "rating": 5.0,
      "verified": true,
      "author": "Richard A. Woodruff",
      "helpful_votes": 5,
      "publication_date": 20161027
    },
    {
      "title": "Good looking and works great!!",
      "text": "works incredibly well, and looks as good as it works. Opens wine bottles in less than 5 seconds with surprising ease. Strongly recommend this for any wine drinker looking for the best/easiest/quickest way to open a bottle.",
      "rating": 5.0,
      "verified": true,
      "author": "Joseph Pinero",
      "helpful_votes": 0,
      "publication_date": 20171207
    },
    {
      "title": "Poorly constructed",
      "text": "When we received the unit, it repeatedly pushed into the bottle the corks, including corks that were in good shape. Additionally, one of the cover of the pivot points on the side popped off, and a plastic retaining widget popped out. It was clear that this part was also broken.",
      "rating": 1.0,
      "verified": true,
      "author": "David M",
      "helpful_votes": 0,
      "publication_date": 20170626
    },
    {
      "title": "Classy and solid",
      "text": "Classy looking and well made I've used others for years this one feels solid in your hand and looks good.",
      "rating": 5.0,
      "verified": true,
      "author": "Rocco Gervasi",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Broken after 2 months. Do not purchase.",
      "text": "This opener broke after about 2 months of use. Initially I liked the look and feel but it is completely useless now and I feel ripped off. I've been using this type of opener for many years so I know it's not user error or abuse. I would not recommend you buy this item. As you can see in the picture the silver metal splined component came unseated from it's position and this renders the device useless.",
      "rating": 1.0,
      "verified": true,
      "author": "crawdad",
      "helpful_votes": 0,
      "publication_date": 20170830
    },
    {
      "title": "HQY rabbit pushes cork into the wine bottle - back it goes to Amazon.",
      "text": "The HQY rabbit wine opener corkscrew pushes the cork into the wine bottle rather than screwing into the cork to remove it - that was my experience the first time I used it. I thought maybe I was dealing with a cheap bottle/cheap cork, so ok. Tonight was the second time I used the HQY rabbit and it happened again. This time it was with an expensive bottle of wine. So back goes the HQY rabbit to Amazon.",
      "rating": 1.0,
      "verified": true,
      "author": "Elan",
      "helpful_votes": 2,
      "publication_date": 20170304
    },
    {
      "title": "Cheap, flimsy knockoff.",
      "text": "Self destructed after only six months. Get the ORIGINAL Rabbit, NOT this one. Sure it’s cheaper but it’s also a flimsy knockoff that won’t last.",
      "rating": 1.0,
      "verified": true,
      "author": "george mcfarlane",
      "helpful_votes": 0,
      "publication_date": 20191205
    },
    {
      "title": "Awesome Corkscrew",
      "text": "I love this corkscrew, it's so easy to use. You just push the top handle all the way up, squeeze the top of the bottle with the double handles, pull the handle back down which drives the corkscrew into the cork and push the top handle back up again while continuing to squeeze the double handles.",
      "rating": 5.0,
      "verified": true,
      "author": "Dog Lover",
      "helpful_votes": 0,
      "publication_date": 20170601
    },
    {
      "title": "Disappointed.",
      "text": "When I first received the wine opener, the company reached out and asked that if I had a problem, I contact them first. I did. I never heard back. It looks heavy duty, but ours stopped working within a couple of months. As others have said, it now pushes corks into the bottle. Yes, I changed the screw. Even the foil cutter was cheap. Buyer beware.",
      "rating": 2.0,
      "verified": true,
      "author": "Annie",
      "helpful_votes": 0,
      "publication_date": 20180127
    },
    {
      "title": "It will not last.",
      "text": "While it worked it was very good. The first screw broke after a dozen or so bettles, and the years stripped after a few more. It looks and feels solid an durable, but that was not my experience. If it is still under warranty I might have considered communicating with the manufacturer, but for $19.95 it is not worth the trouble, and I would have no confidence in a replacement.",
      "rating": 1.0,
      "verified": true,
      "author": "Donald Swanton",
      "helpful_votes": 0,
      "publication_date": 20190918
    },
    {
      "title": "Broke in less than 5. Months!",
      "text": "I have tried join the naysayers here. Purchased in April 2017 broke in Aug 2017. I had the original for 15 years. This seemed To fit the bill, but didn't. Very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "A. Cox",
      "helpful_votes": 0,
      "publication_date": 20170923
    },
    {
      "title": "good value",
      "text": "This bottle opener works well. We had a more expensive one that felt a little sturdier, but for the price this is awesome!",
      "rating": 4.0,
      "verified": true,
      "author": "The Flyin' Dutchman",
      "helpful_votes": 0,
      "publication_date": 20191114
    },
    {
      "title": "Only lasts a short time",
      "text": "I ordered two of these on September 11. One for a gift and the other for personal use. The opener broke after only a couple of months use and the company did send replacement which didn't last as long as the first one. I think it is a design flaw and the product simply won't work. I now have two unusable openers plus the one I gave to a friend. I am unable to find correspondence to connect with provider.",
      "rating": 1.0,
      "verified": true,
      "author": "Dennie Crowe",
      "helpful_votes": 0,
      "publication_date": 20180312
    },
    {
      "title": "Great Wine Bottle Opener",
      "text": "Purchased as replacement for one we had. Husband liked it a lot! He is happy with the opener.",
      "rating": 5.0,
      "verified": true,
      "author": "Sam",
      "helpful_votes": 0,
      "publication_date": 20200130
    },
    {
      "title": "The easiest wine opener I’ve ever seen.",
      "text": "This wine opener is the best ever. It’s sturdy and very easy to use. No hassle. I’ve never seen any like this before. I bought one for myself n one for a gift. 👍🏼👍🏼",
      "rating": 5.0,
      "verified": true,
      "author": "Olivia ",
      "helpful_votes": 0,
      "publication_date": 20200204
    },
    {
      "title": "Well Built and Great Value!",
      "text": "This is an amazing value. Seems very well built and works perfectly. I expect this to meet my needs for many years.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Skootsky",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "What a wonderful device",
      "text": "I really love my new HQY wine opener....what a wonderful conversation piece both in style and operation.....so easy to use and so efficient in removing a cork without having to use any pressure...I highly recommend this unique product!",
      "rating": 5.0,
      "verified": true,
      "author": "mikeff",
      "helpful_votes": 0,
      "publication_date": 20170122
    },
    {
      "title": "Lasted about 6 months / 75 bottles",
      "text": "Great while it lasted, which was about six months The handle \"hole\" separated from the corkscrew \"post\" that drives the corkscrew into the cork. I've tried to press them back together, but it seems the hole is too worn to carry the post anymore, then the handle gear sheared from the corkscrew. Broken beyond repair. I'd guess we opened about 75 bottles with it before it blew out.",
      "rating": 3.0,
      "verified": true,
      "author": "J. Redburn",
      "helpful_votes": 0,
      "publication_date": 20180223
    },
    {
      "title": "Perfect for personal use or gift-giving!",
      "text": "Good, sturdy construction. Actually works easier than my electric wine opener. Arrived in a very nice package. I will order this product again and give it as a wedding gift (along with a good bottle of wine). I would use this seller again as, apparently, they only sell quality products.",
      "rating": 5.0,
      "verified": true,
      "author": "Bean Counter",
      "helpful_votes": 0,
      "publication_date": 20170706
    },
    {
      "title": "My wife loves it",
      "text": "Was a Christmas present for my wife. After the first couple of uses she decided it was her favorite wine opener. Very easy to use and it does a good job.",
      "rating": 5.0,
      "verified": true,
      "author": "Terry N",
      "helpful_votes": 0,
      "publication_date": 20190120
    },
    {
      "title": "Poior Quality",
      "text": "There are several items about this opener that are bother some. First the teeth don't mesh well which causes the handle to lack the freedom of movement you'd would expect. Second the tip of the worm screw protrudes about 3/8 in when you go to open a bottle. This does not allow the cork to be fully extracted from the bottle because of the lack of throw in the opening sequence.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180809
    },
    {
      "title": "Worked a couple times, then it didn't",
      "text": "Bought this to replace my rabbit opener that I had for years. It was an awesome opener. This one opened about 4 bottles, then started pushing the corks into the bottle. The search continues for a good opener.",
      "rating": 1.0,
      "verified": true,
      "author": "F Bunch",
      "helpful_votes": 0,
      "publication_date": 20180922
    },
    {
      "title": "This company stands behind their product!",
      "text": "I have purchased several of these for gifts and people loved them. We recently bought one for ourselves and had some problems with it - the clamp did not grip the bottle well and it was very difficult to pull the cork out. We were too late for an Amazon return so I contacted the manufacturer directly. They were extremely helpful, sent us a new one right away and did not even require us return the defective one. This is a well made item and the company stands behind their product. Very attractive also. I highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "kristenschott",
      "helpful_votes": 0,
      "publication_date": 20170326
    },
    {
      "title": "Looks good, so so function",
      "text": "I love the design - and the bronze color - BUT...this opener is marginal with the synthetic corks in many wines. I have about 50% success - before having to resort to cussing and the dreaded manual opener. Having severe arthritis, I NEED a good wine opener. This isn't it",
      "rating": 2.0,
      "verified": true,
      "author": "Annie",
      "helpful_votes": 0,
      "publication_date": 20170724
    },
    {
      "title": "not reliable",
      "text": "I ordered this product and at first loved it. I purchased it almost a year ago and didnt use it until I moved into my own house about a week ago. After three uses the screw part that pulls the corkscrew out of the wine bottle began to weaken and not work. I have been struggling to get it to work and wish there was some type of warrantee on a product like this. I am upset!",
      "rating": 1.0,
      "verified": true,
      "author": "Kevin",
      "helpful_votes": 0,
      "publication_date": 20180818
    },
    {
      "title": "Worst crap I've ever purchased",
      "text": "Sometime in July of 2017 Worst crap I've ever purchased. Been fighting it since I bought it. First it sanked the cork, then it just collapsed. What a joke. 8/18/17 Tom from HQY shipped me a replacement at zero cost to me. Excellent customer service. I will just chuck my original purchase as a lemon. I will give this new one a run for its money and expect it to perform well for many bottles and years to come. Thanks again Tom.",
      "rating": 1.0,
      "verified": true,
      "author": "J. P.",
      "helpful_votes": 0,
      "publication_date": 20170723
    },
    {
      "title": "Doesn’t work. Do not buy.",
      "text": "Purchased three of these. After a few uses the one used most frequently stopped working. It pushed the wine cork into the bottle instead of pulling it out. Wine WENT EVERWHERE! The last two straight out of the box did the same thing. I threw them all in the trash. Cheap version of the Rabbit. Should have known they were cheap and cheaply made.",
      "rating": 1.0,
      "verified": true,
      "author": "chuck MacKarvich",
      "helpful_votes": 0,
      "publication_date": 20190416
    }
  ],
  "product_meta": {
    "title": "HQY Best Wine Opener Corkscrew With An Extra Corkscrew Worm/Spiral, Luxury Golden",
    "description": "Features: Easily removes stubborn or fragile corks.\n\nDesign based on the classic lever and corkscrew spiral/worm can be replaceable. \n\nFoilcutter in matching finish included.\n\nPackaged in a classic black gift box ideal for gift-giving and storage.\n\n \n\nMethod: Please read the instruction manual on the box before using it. \n\nThe sharp worm can go into the cork when going down and pull the cork out in a second when going up.\n\nMaterial: Zinc alloy material with plating, durable and attractive. If there is any further question, just feel free to contact us. Thanks.",
    "rating": 3.6,
    "feature_bullets": [
      "· 3.Including: 1* opener,1*foil cutter, 2*corkscrew worms/spirals"
    ],
    "specifications": {
      "Product Dimensions": "8.7 x 2.4 x 6.5 inches",
      "Item Weight": "1.8 pounds",
      "Manufacturer": "HQY",
      "ASIN": "B014R3KUM8",
      "Item model number": "20150901",
      "Customer Reviews": "3.6 out of 5 stars1,547 ratings3.6 out of 5 stars",
      "Best Sellers Rank": "#51,708 in Kitchen & Dining",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "September 1, 2015"
    },
    "categories": [
      "Corkscrews & Openers",
      "Home & Kitchen",
      "Kitchen Utensils & Gadgets",
      "Wing Corkscrews",
      "Kitchen & Dining",
      "Bar & Wine Tools"
    ],
    "price": 19.99
  }
}