{
  "website_summaries": [
    {
      "verdict": "Heavier foot padding makes these guards a better choice for mixed martial arts than for kickboxing or Muay Thai.",
      "pros": [
        "Comfortable for sparring and even heavy bag kicking",
        "Stay in place",
        "Padding is ideally sized and positioned for maximum contact protection on shins and top of feet",
        "Full elasticated body",
        "Hook-and-loop strap secures top of guard",
        "Padding retains your individual leg form throughout workout"
      ],
      "cons": [
        "Bulky",
        "May run small"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "No More Ouchy",
      "text": "Got back into kickboxing and the bags are quite heavy, making kicking painful. Read through the reviews on this and similar products and decided to go with this one. When I tell you I can't feel anything when I kick the bag - even at full power - I mean just that. It's awesome and it helps me correct my technique by making sure I hit the bag right where the padding is. No matter how much I jump, kick or run, these definitely stay in place.",
      "rating": 5.0,
      "verified": true,
      "author": "Lali",
      "helpful_votes": 11,
      "publication_date": 20170110
    },
    {
      "title": "Comfortable, fit perfectly",
      "text": "Purchased these about a month or two ago. They arrived early and were exactly what I expected. Comfortable, fit perfectly, and I could kick the bag/pads as hard as possible with little to no feeling. My only problem with them would be the padding on the tops of the feet. The padding is slightly larger than expected, so it's hard to walk normally on them (where the tops of the foot pads and bottoms of the shin pads meet, they hit each other and make it slightly awkward to walk in). Other than that, these are great shin guards.",
      "rating": 4.0,
      "verified": true,
      "author": "Raymond C",
      "helpful_votes": 14,
      "publication_date": 20160620
    },
    {
      "title": "Works with Wrestling Shoes!!!",
      "text": "Just got em. I use them for pro-ish wrestling everyone said they wouldn't fit over my wrestling shoes and they actually fit quite well. Super comfy and sturdy as hell. If you are buy these to fit over wrestling shoes i suggest a size or 2 bigger then what you actually need.",
      "rating": 5.0,
      "verified": true,
      "author": "Hayden Huscher",
      "helpful_votes": 13,
      "publication_date": 20170707
    },
    {
      "title": "They fit well",
      "text": "The first time putting them on I was a little afraid that they were too tight but after wearing them for a few minutes they loosened up to be comfortable. They hold well, stay in place. The logo on the front is gray instead of black. I chose the S/M size. I'm 170 cm tall with 35 cm/14 inch calves. If you have 14< get L size The paddings are curved so they look less bulky than many manufacturers'",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 11,
      "publication_date": 20170712
    },
    {
      "title": "The right price for beginning MMA classes",
      "text": "I train in Muay Thai//MMA on occasion, but not seriously enough to invest in premium gear yet—these are a great alternative to wearing used/falling apart loaners. Note on size: I am a 5’4” 130 pounds female and the Small/Medium size fit like a glove. Would definitely recommend sizing up to Large if you have thick calves.",
      "rating": 5.0,
      "verified": true,
      "author": "Katie Taylor",
      "helpful_votes": 9,
      "publication_date": 20171126
    },
    {
      "title": "They run small and...",
      "text": "They are simple and minimal style shin guards. The pads are adequate, but If your shins are extra tender or if you're recovering from any shin related / foot related injury, you might consider a heaver style guard. That being said I like em because they are minimalist, so they don't really slow me down or get in the way. I'm using them for Thai Boxing for what it's worth, not MMA. 3 stars due to minimalist / more well padded sock like construction, but good value and they run small.",
      "rating": 3.0,
      "verified": true,
      "author": "Grand n' Huge",
      "helpful_votes": 2,
      "publication_date": 20180905
    },
    {
      "title": "These are reasonably priced, a perfect fit, and do their job well",
      "text": "I ordered these for my 10-year-old son, he uses these for sparring in kickboxing class... The fit is great and the padding is thicker and more shock absorbency than his previous padding that I paid a lot more for. I love these and will be buying again",
      "rating": 5.0,
      "verified": true,
      "author": "Jamie",
      "helpful_votes": 7,
      "publication_date": 20170525
    },
    {
      "title": "If you have big calves, read this!",
      "text": "They seem pretty decent quality, but the sizing chart should include the calf width. I have pretty big calves if I'm being honest, but I went with the shin length in the sizing chart because It claimed to be the most accurate so I went with a medium/small since I'm 5'6 and my shin length met the size on the chart. They're really tight around the part with the velcro strap, so if you have bigger than average calves, just take note. If it were to fit me, it would probably be a phenomenal item.",
      "rating": 3.0,
      "verified": true,
      "author": "Joanne Javellana",
      "helpful_votes": 0,
      "publication_date": 20190820
    },
    {
      "title": "fits well and offers ample protection",
      "text": "I bought this for my 11 year old son. He's been using it at his karate school sparring sessions. He said it fits him well. It doesn't slide down his leg. the hook and loop straps that sits above his calves ensures these don't slide down his leg. The guard also does not rotate around his leg. They stay in place over his shin. Please note this does not have the thickest padding on the shin and foot, but it is thick enough to help protect him and his partner. All in all, I am very satisfied with the product.",
      "rating": 4.0,
      "verified": true,
      "author": "BukoBoy",
      "helpful_votes": 0,
      "publication_date": 20181029
    },
    {
      "title": "Good fit and adequate padding",
      "text": "The fit is per the sizing charts. Just the right tightness around my calves. it does not slide down. These fit just like my old pair did when I used to compete. Perfect for sparring and heavy bag use. I use these mainly for the heavy bag. You can pound away and barely feel a thing. Should be sufficient for sparring. The padding feels to be better able to absorb shock than my old pair. The size of the pads is just right. I purchased the medium. My shoe size is around a size 10-10.5 depending on shoe brand.",
      "rating": 5.0,
      "verified": true,
      "author": "glee",
      "helpful_votes": 0,
      "publication_date": 20200420
    },
    {
      "title": "Awesome Shin Guards",
      "text": "These shin guards are great. The fit and material is great. Totally recommend these to anyone. They feel great whenever you spar, kick a heavy bag, or any other exercise for Muay Thai or kick boxing. They are very comfortable as well, I trained for hours and had no discomfort. Great shin guards for a great price.",
      "rating": 5.0,
      "verified": true,
      "author": "Marco Medina",
      "helpful_votes": 21,
      "publication_date": 20141012
    },
    {
      "title": "I knew it would be cheaply made, but not this bad...",
      "text": "If you're looking for something made very cheap and cheaply made, these are what you want but I'm sure will never use. Plastic packaging the product is in, was torn open (not the amazon packaging) open it, expected something cheaply made, but this is horrible. Very uncomfortable and I have smaller calves yet this squeezes too tight on mine. The shin pad portion is okay, but the the instep portion is the worst I've ever seen. Save your money and buy something that will be comfortable enough to wear. Haven't used them yet on the bag or pad, but I'm thinking of cutting off the instep portion and just use the shin pad.",
      "rating": 2.0,
      "verified": true,
      "author": "Blaine Conley",
      "helpful_votes": 0,
      "publication_date": 20191026
    },
    {
      "title": "Sooooo small!!!",
      "text": "Bought these for my grandson, who is pretty small, and they are so small that they are almost impossible to get on quick enough in a class setting.. he had to lay down and we have fight with the elastic to get them over his calves THEN get the foot part on.. UGH! hate them... they do look and feel like good quality but geez... probably not made for a kid to use in class..",
      "rating": 2.0,
      "verified": true,
      "author": "Tonibugg",
      "helpful_votes": 0,
      "publication_date": 20171126
    },
    {
      "title": "runs small",
      "text": "bought this for light sparring during kumite class. i am 5'3\", not overweight, so i ordered the small/medium recommended by their sizing chart. i could barely get these over my calves. very tight and the the strap at the top barely reaches the velcro. if you have heroin chic thin calves, go for it. they are well made. anyone with a bit of meat on their bones may have difficulty.",
      "rating": 3.0,
      "verified": true,
      "author": "eastcoaster",
      "helpful_votes": 0,
      "publication_date": 20191022
    },
    {
      "title": "Great fit but don't protect much",
      "text": "These are great fitting. They don't move. You see other people with shin guards frequently readjusting them, but you won't have to do that with these. They are relatively comfortable, although they tend to press on my foot a bit weirdly. I would definitively give them 4.5 stars for fit and comfort. However, they don't protect much. I have tons of bruises, including one giant one (about a foot in diameter). I guess they are better than not having shin guards. However, they still fail at their main purpose.",
      "rating": 2.0,
      "verified": true,
      "author": "Jordan",
      "helpful_votes": 0,
      "publication_date": 20200929
    },
    {
      "title": "You get what you pay for! Avoid if possible.",
      "text": "Well, I mean.. not that I had high expectations, but yeah.. not comfortable at all. It really depends how much you use these and how much you value your craft. I strongly suggest to invest a bit more and get a better quality pair than these. You will thank me later. Way too tight and hard to put on and hard to take out. I got the X Large and it said X Large but they are way too tight. Others mentioned the same.",
      "rating": 3.0,
      "verified": true,
      "author": "George",
      "helpful_votes": 0,
      "publication_date": 20200128
    },
    {
      "title": "The protection is pretty good though",
      "text": "Pain in the rear end to take off unless you got a buddy that don't mind getting your sweat on their hands after you workout. The protection is pretty good though. I got a pair for my Daughter and myself, and she has zero complaints. No pain. so they do the job and no loose straps to tape up when you fight in the ring. Thanks Randy \"Brito Kickboxing:.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171109
    },
    {
      "title": "Tight and foot pad touches shin pad too much...",
      "text": "I just received and tried on. It seems that the foot pad is too long and but up against the shin pad making then uncomfortable I wish I could trim the foot pad.. Also the top at the velcro is really tight and I am not a big guy. Very tight may cut circulation???.",
      "rating": 2.0,
      "verified": true,
      "author": "Love Life Light",
      "helpful_votes": 0,
      "publication_date": 20191121
    },
    {
      "title": "Disappointing. After 3 classes, the fabric started to tear apart",
      "text": "I recently started kickboxing classes and I thought these would be just perfect. After all those 5-star reviews I got them and I thought they were really good. Sadly, after 3 classes they started to tear apart at the instep. Maybe this is happening because is fabric and not leather? Really disappointed...honestly, I don't think these deserve this rating.",
      "rating": 3.0,
      "verified": true,
      "author": "Juliana Ardila",
      "helpful_votes": 3,
      "publication_date": 20170117
    },
    {
      "title": "Thin padding, don’t spin on foot and shin from my experience.",
      "text": "Good for light sparring you allready have strong legs and bones. If you do not have strong legs and bones I would not recommend these because padding is minamal.",
      "rating": 3.0,
      "verified": true,
      "author": "Rachel Wood",
      "helpful_votes": 0,
      "publication_date": 20181130
    },
    {
      "title": "Stiff and small",
      "text": "I bought the XL leg guards and the opening is so small that it cuts off the blood supply to my feet. It has a velcro strap at the top that seems to serve very little purpose. They are also very stiff. Good enough for the price, but if you want comfort go with something else.",
      "rating": 2.0,
      "verified": true,
      "author": "Karla Bagley",
      "helpful_votes": 0,
      "publication_date": 20190703
    },
    {
      "title": "Pretty okay",
      "text": "I enjoyed how snug they fit. I used them for about 5 months but the pads never really conformed to my feet well. The top strap just broke but I can still work out with them. I'm not too upset since these weren't very expensive. They could be better made and they could be much worse. Decent bang for the buck.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazonian",
      "helpful_votes": 0,
      "publication_date": 20190308
    },
    {
      "title": "Perfect for Sparring",
      "text": "I use these for sparring in Muay Thai kickboxing. They are easy to slide on when I'm wearing shorts, but a little more challenging when I'm wearing tights. They do the job for the value. My shins feel well protected, but there are times when other students kick harder than they should while sparring and I can feel it through the shin guards.",
      "rating": 4.0,
      "verified": true,
      "author": "MB.Schmidt",
      "helpful_votes": 0,
      "publication_date": 20191103
    },
    {
      "title": "Good Thin Guards",
      "text": "These are fairly thin, so they provide more protection to the shin than to the object you are hitting. You can still feel the impact pretty strongly, but it will help your shins if you are kicking the heavy bag for a long time.",
      "rating": 4.0,
      "verified": true,
      "author": "Jonathan",
      "helpful_votes": 0,
      "publication_date": 20190109
    },
    {
      "title": "Don’t waste your money",
      "text": "Very difficult for my son to put on and take off. Threw them away and buying a different brand.",
      "rating": 1.0,
      "verified": true,
      "author": "Rachel",
      "helpful_votes": 0,
      "publication_date": 20190926
    },
    {
      "title": "Decent Protection For The Price",
      "text": "Save your shins! Decent padding and coverage for the price. Sure the material could be heavier and the padding thicker but I have seen worse materials used at a greater price. I would call these guards medium-duty use items. But, I fully expect them to last a few years for the amount of light to medium sparring (maybe twice a week or so) I will use them for. If you are doing full contact MMA you may want to look for a heavier duty shin guard.",
      "rating": 4.0,
      "verified": true,
      "author": "Marcus Emesarius",
      "helpful_votes": 9,
      "publication_date": 20160613
    },
    {
      "title": "Form fitting, slim, easy to move around, decent padding",
      "text": "I'm 5'7\" and have 14 cm calves and the Small/Medium fit perfectly. It helps to take them off by pulling on the bottom of the heel part while your toes are pointed. This protect the top of your foot and the area of your ankle between your shin and top of the foot which is great for kicks whether you're doing taekwondo, MMA, or kickboxing. Haven't tried washing them yet but they seem good so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Juliana Zhang",
      "helpful_votes": 0,
      "publication_date": 20200607
    },
    {
      "title": "Work great, tight",
      "text": "Really like these overall. I’m a 5’8 145 lb woman. Based on the size chart I got the Small/Med, and they’re definitely tight- it would help to remove the annoying tag. But they work great.",
      "rating": 4.0,
      "verified": true,
      "author": "SH",
      "helpful_votes": 0,
      "publication_date": 20190811
    },
    {
      "title": "Good, comfortable but light on protection",
      "text": "They're good but be careful when sparring, if someone checks your kick with a knee you'll cry using these. EDIT: been using them 3 times a week and they've held up to the abuse without any damage so i've increased it to 5 stars, good shin pads, if you do really hard sparring your better off with harder leather shin pads.",
      "rating": 5.0,
      "verified": true,
      "author": "Luis Angel Perez",
      "helpful_votes": 0,
      "publication_date": 20161210
    },
    {
      "title": "These are the best guards I've ever had",
      "text": "I LOVE these guards! I use them for taekwondo and they are exactly what I wanted. The padding on the top foot area is a bit longer and wider than other guards, which is perfect for protecting my toes since I dislike the foot glove guards. These allow full motion while providing more protection And they are so comfortable. Dry out a bit quicker as well Will absolutely get another pair when these wear out.",
      "rating": 5.0,
      "verified": true,
      "author": "Delaney",
      "helpful_votes": 0,
      "publication_date": 20190416
    },
    {
      "title": "Comfy",
      "text": "They don't shift around like the others do especially when hitting a bag with it. I ordered the Large/Xlarge, only issue I have is taking them off. I have thunder calves apparently so it's a pain taking them off.",
      "rating": 4.0,
      "verified": true,
      "author": "Tom",
      "helpful_votes": 0,
      "publication_date": 20190802
    },
    {
      "title": "Chemical Smell",
      "text": "Got these in the mail today, they are very nice looking quality but smell so badly of chemicals. I have never smelled something so strong in my life.",
      "rating": 3.0,
      "verified": true,
      "author": "Stephanie ",
      "helpful_votes": 2,
      "publication_date": 20181127
    },
    {
      "title": "These were nice guards. My friend got the same pair and ...",
      "text": "These were nice guards. My friend got the same pair and he was satisfied. My only real gripe is it can hurt your feet after a while due to the pressure on the sole of your foot. It is a little tight, which makes sense so it doesn't shift too much, but it made long wear a bit uncomfortable.",
      "rating": 4.0,
      "verified": true,
      "author": "Marcus Bob",
      "helpful_votes": 0,
      "publication_date": 20171203
    },
    {
      "title": "Snug but not too tight and enough padding",
      "text": "Nothing bad to say about these; they're easy to slip on but they do stay put on your shin/foot. The padding is just right for hitting a heavy bag or a sparring partner. Recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "BPB",
      "helpful_votes": 0,
      "publication_date": 20190409
    },
    {
      "title": "Disappointed",
      "text": "They run very small and after 2 wears my son's are already ripped. Not great quality. I'm disappointed. I should have spent a few more dollars for better quality guards.",
      "rating": 2.0,
      "verified": true,
      "author": "Caryn D.",
      "helpful_votes": 0,
      "publication_date": 20191113
    },
    {
      "title": "Lightweight, not for me though",
      "text": "These were purchased for Krav Maga, ultimately I was deterred from using them because they were not heavy enough to withstand kicks during training. I purchased another set of shin protectors that are heavier. I liked these because they were lightweight and wished I could have gotten more use out of them. They are bad, just not for me.",
      "rating": 3.0,
      "verified": true,
      "author": "DarkHunterSimi",
      "helpful_votes": 0,
      "publication_date": 20190424
    },
    {
      "title": "So far so good",
      "text": "My 10 yr. old daughter wears them for kickboxing/sparring class. They are easy to put on and take off and she hasn’t complained about them.",
      "rating": 5.0,
      "verified": true,
      "author": "D Lopez",
      "helpful_votes": 0,
      "publication_date": 20190805
    },
    {
      "title": "Good protection at an affordable price",
      "text": "I’ve tried more expensive shin guards but you can’t bear these for $17.99. I have really skinny legs so opted for the S-M and they still fall off, but still the best I’ve tried.",
      "rating": 5.0,
      "verified": true,
      "author": "Jamie",
      "helpful_votes": 0,
      "publication_date": 20190302
    },
    {
      "title": "Not a long-term solution for serious training",
      "text": "They give some protection, not tons. You get what you pay for. I used these until I was sure I was going to stick with Muay Thai and then invested in a pair from Top King. Good to have temporarily and now as a spare pair for light sparring.",
      "rating": 3.0,
      "verified": true,
      "author": "Thenis",
      "helpful_votes": 0,
      "publication_date": 20170722
    },
    {
      "title": "Work ok",
      "text": "You can feel pain if hitting remotely hard shin on shin. Also the strap on the top is useless, and annoying because you have to take the time to put it on. Ok for beginners practicing on a bag or very light partner training otherwise upgrade to the hard ones.",
      "rating": 3.0,
      "verified": true,
      "author": "DSK",
      "helpful_votes": 0,
      "publication_date": 20180103
    },
    {
      "title": "Great starting pads, long term need more protection",
      "text": "Decent for the price. I don't like the way the fabric shell rides up on the foot pads. Could definitely use a little more toe protection.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200226
    },
    {
      "title": "They work for a little while, but VERY cheaply made.",
      "text": "I bought an XL and the guards are tight, they almost restrict my blood flow. I’m 6’2 and weigh about 175 these are rated up to 6’5. Not to mention the logo on the pads were already faded and cracking right after I pulled them out of the package. In short they work, but very cheaply made not for someone who’s going to use them hard on a regular basis.",
      "rating": 2.0,
      "verified": true,
      "author": "Ocean Tucker",
      "helpful_votes": 0,
      "publication_date": 20190220
    },
    {
      "title": "Not a fan...",
      "text": "The point where the top of the foot cover meets the bottom of the shin cover makes the sparring process difficult. Spend a little more for easy movement.",
      "rating": 3.0,
      "verified": true,
      "author": "J",
      "helpful_votes": 0,
      "publication_date": 20190129
    },
    {
      "title": "Solid pair of shin guards",
      "text": "I use these shin guards just about everyday and I have absolutely no problem, while they are not the most comfortable, I don’t think any device being strapped around your shin is going to be comfortable. I got the white pair and the bottom of the shin guards have turned a red color from the mats I practice on but I mean, they are white so they will satin I guess.",
      "rating": 5.0,
      "verified": true,
      "author": "AnnaB",
      "helpful_votes": 0,
      "publication_date": 20190412
    },
    {
      "title": "Good for the price",
      "text": "They’re pretty good. I like that they’re really snug. You could probably wear these under some sweatpants if you wanted to. They’re really comfortable. The only reason I gave them 4 stars is that the pads are squishy so I don’t feel like they protect as well, but for the price and for a beginner like me, they’re excellent.",
      "rating": 4.0,
      "verified": true,
      "author": "Cassidy",
      "helpful_votes": 0,
      "publication_date": 20190315
    },
    {
      "title": "Highly recommend",
      "text": "Perfect for working out with heavy punching bag and sparring. adequate pricing, great design and quality. Highly recommend, Many Thanks",
      "rating": 5.0,
      "verified": true,
      "author": "SS",
      "helpful_votes": 0,
      "publication_date": 20200509
    },
    {
      "title": "AMAZING!!",
      "text": "So these shin padding were delivered super fast!! The picture made me think that these were not going to be super protection but they actually really are! I recommended these to my sparring partner and he loves them too, I'd recommend these to anyone!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 8,
      "publication_date": 20151102
    },
    {
      "title": "Fits great.",
      "text": "Might be a little uncomfortable but putting pads on is never comfortable. Good amount of padding for cloth guards. Protects my shins enough while still being able to get some conditioning out of it. They were as I expected.",
      "rating": 5.0,
      "verified": true,
      "author": "Tyler",
      "helpful_votes": 0,
      "publication_date": 20200305
    },
    {
      "title": "They are pretty hard to slip on if you have large calves",
      "text": "They are pretty hard to slip on if you have large calves, but by the same token they stay on and don't move around. Also they provide protection, but they won't stop the pain of kicking hard. That being said, if you're conditioning your shins then these provide just enough protection to severely injure yourself.",
      "rating": 4.0,
      "verified": true,
      "author": "Raziel",
      "helpful_votes": 0,
      "publication_date": 20151003
    },
    {
      "title": "Great for kids",
      "text": "These are great for my sons classes at the Dojo!",
      "rating": 5.0,
      "verified": true,
      "author": "Cariscmt",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Good enough",
      "text": "Came as described good padding i wld recommend the ones with the straps after a sparring session these guards are hard to take off",
      "rating": 5.0,
      "verified": true,
      "author": "michael scruggs",
      "helpful_votes": 0,
      "publication_date": 20181215
    },
    {
      "title": "Tough to take off but over all good fit n comfortable",
      "text": "Very difficult to take off... medium coverage for sparing which is good enough. I’m used to the beating on my legs so it’s good for protecting the bone without all the bulk.",
      "rating": 3.0,
      "verified": true,
      "author": "Hana Robinson",
      "helpful_votes": 0,
      "publication_date": 20171108
    },
    {
      "title": "Great for kids",
      "text": "We’re too small for me Great for kids I think",
      "rating": 3.0,
      "verified": true,
      "author": "Gala",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "these help me go into the ring without feeling like my bruises are holding me back",
      "text": "I kickbox 8 times a week and often go bare-shinned, but when I'm feeling particularly beat, these help me go into the ring without feeling like my bruises are holding me back. They stay in place, and the foot pads give great protection in case I take an elbow to the foot. Some people say that the foot pads make it a little difficult to do foot work, but I ordered my size based on the size chart and never feel like my mobility is limited.",
      "rating": 5.0,
      "verified": true,
      "author": "Alexis",
      "helpful_votes": 0,
      "publication_date": 20170819
    },
    {
      "title": "Solid choice for beginners",
      "text": "Great starter pair of shin guards as long as you go easy. I bruised my shin through the guard on my partners leg and they can be a bit tough to get off in a hurry if the class is fast paced.",
      "rating": 4.0,
      "verified": true,
      "author": "timothy kelly",
      "helpful_votes": 0,
      "publication_date": 20200628
    },
    {
      "title": "small",
      "text": "if you have children, may fit them nicely, I'm 18 years old 5'11. The XL could barely go over my calve muscle. extremely small.",
      "rating": 1.0,
      "verified": true,
      "author": "erypto",
      "helpful_votes": 0,
      "publication_date": 20180511
    },
    {
      "title": "Great for pro wrestling",
      "text": "Amazing. Just starting out my wrestling career as an indy wrestler and so far these have worked perfect. Will be back again. One thing i wish, is that it came in black with the writing and logo in red!",
      "rating": 5.0,
      "verified": true,
      "author": "AN",
      "helpful_votes": 0,
      "publication_date": 20180511
    },
    {
      "title": "run large ... seem to be of good quality",
      "text": "runs large, bought for 10 yr old who is on the average/short side. They were also very uncomfortable, most likely because they were too big and the band dug into back of knee",
      "rating": 4.0,
      "verified": true,
      "author": "LiL",
      "helpful_votes": 0,
      "publication_date": 20161108
    },
    {
      "title": "I have the l/xl and at first it was really ...",
      "text": "I have the l/xl and at first it was really tight on my legs and hard to put on and take off,but over time it loosened up. The pads don't shift as much as I was expecting.",
      "rating": 4.0,
      "verified": true,
      "author": "Mr.Melvin",
      "helpful_votes": 0,
      "publication_date": 20170104
    },
    {
      "title": "Great!!",
      "text": "Great material. The sock type support makes it feel like its glued to your leg. Very comfortable. And lightweight.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrea Ferreira",
      "helpful_votes": 0,
      "publication_date": 20190623
    },
    {
      "title": "Good value",
      "text": "They do the job. The foot pads do slip around, but I'm happy with the purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "Ruby-Bird Watson",
      "helpful_votes": 0,
      "publication_date": 20190428
    },
    {
      "title": "Everything I was needing",
      "text": "These guards are Awesome! Be carefully with the size, I Am 1,70M (5' - 7\") and XL size is just for my height",
      "rating": 5.0,
      "verified": true,
      "author": "Camilo echeverry",
      "helpful_votes": 0,
      "publication_date": 20190910
    },
    {
      "title": "I like them. My shins are not bruising any more",
      "text": "I am using for kick boxing. I like them. My shins are not bruising any more. easy to put and take them off. they stay on with out slipping. I have not tried with shoes on because we do kick boxing with bare feet.",
      "rating": 5.0,
      "verified": true,
      "author": "V. Chapala",
      "helpful_votes": 0,
      "publication_date": 20170804
    },
    {
      "title": "Tight fit",
      "text": "My son uses these for his pro wrestling matches. Part of his attire.",
      "rating": 5.0,
      "verified": true,
      "author": "Katrina Holmes",
      "helpful_votes": 0,
      "publication_date": 20190820
    },
    {
      "title": "Four Stars",
      "text": "Good amount of padding, a little weak on the design.",
      "rating": 4.0,
      "verified": true,
      "author": "Trevor",
      "helpful_votes": 0,
      "publication_date": 20180615
    },
    {
      "title": "Love it! Keeps me light & protected",
      "text": "Light and easy to wear. Gave me the protection I needed for sparring and heavy-bag training. No more bruises from the bag! No awkward or uncomfortable guards that limit my agility. I'm 5'5 so most shin guards are designed for larger boys. This one was perfect size for me and I can wash it to keep it fresh.",
      "rating": 5.0,
      "verified": true,
      "author": "Capuli",
      "helpful_votes": 0,
      "publication_date": 20151227
    },
    {
      "title": "I'd have liked some sizing guidelines in the description",
      "text": "I like them so far. I got the medium ones and maybe I should have gotten the large. I can barely get them on, but they're fine after I do. I'm not a huge guy but I've got big calves. I've just done some light sparring and kicked a bag, but they've worked well for that.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171029
    },
    {
      "title": "LUV IT",
      "text": "I really like this product maybe others are long lasting but there are light, comfortable, give me a good protection agains te punching bag and for sparring too. Even with some guys how likes to defend with the elbow",
      "rating": 5.0,
      "verified": true,
      "author": "Ricardo Rey",
      "helpful_votes": 0,
      "publication_date": 20160806
    },
    {
      "title": "Good product.",
      "text": "Pretty good padding but a little stiff initially. Overall good protection for the shins and the feet.",
      "rating": 4.0,
      "verified": true,
      "author": "Emerson Bonoan III",
      "helpful_votes": 0,
      "publication_date": 20180702
    },
    {
      "title": "Five Stars",
      "text": "Great quality and snug. not so easy to pull off when wet with sweat",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 2,
      "publication_date": 20170113
    },
    {
      "title": "Good quality-material... maybe somethings to improve.",
      "text": "This shinpads looks really well and the material which are made of is good. For me the only inconvenient is that the distance between the shinpad and footpad it is inadequate and that makes my protection unfit on my shin-foot leaving some points unprotected.",
      "rating": 3.0,
      "verified": true,
      "author": "David G.",
      "helpful_votes": 0,
      "publication_date": 20190609
    },
    {
      "title": "good.",
      "text": "purchase this for my 10 Year Old son. it's kind of tight and hard to slip on. size chart was kind of difficult to use.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180207
    },
    {
      "title": "Cheap foam, but works for now",
      "text": "Feel cheap but they work. I've only used them one training session but even with an injured shin I was able to kick full force.",
      "rating": 3.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 0,
      "publication_date": 20181010
    },
    {
      "title": "A little snug",
      "text": "Wish i had bought the size s instead of junior L. I am 42 kg 157cm. A little snug on my legs but still works though.",
      "rating": 4.0,
      "verified": true,
      "author": "wan",
      "helpful_votes": 0,
      "publication_date": 20160616
    },
    {
      "title": "Amazing!",
      "text": "Great padding, but a little on the snug side. They didn’t cut off circulation but we’re definitely a tad snug around the top elastic. Other than that these are fantastic for the price!",
      "rating": 5.0,
      "verified": true,
      "author": "Rebecca M. ",
      "helpful_votes": 0,
      "publication_date": 20190409
    },
    {
      "title": "My grandson is happy with these shinguards",
      "text": "These shin guards seem very sturdy. They are just a little stiff at first, but soften with just a little wear. My grandson is happy with them",
      "rating": 4.0,
      "verified": true,
      "author": "Sandy H.",
      "helpful_votes": 0,
      "publication_date": 20200302
    },
    {
      "title": "I really like these but material could be better but for the ...",
      "text": "I really like these but material could be better but for the price its great . good for me i like to save money plus o hate bulky shin guards not comfy at all",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160909
    },
    {
      "title": "Fits good",
      "text": "Fits 5 year old son perfect. He’s 44” inch tall and is in tae kwan do",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190408
    },
    {
      "title": "Tiny Shinguards",
      "text": "Needed these for the USMTO tournament. I would have sworn to you that these were youth sizes. Can't even slip them over my forearm let alone my calves.",
      "rating": 1.0,
      "verified": true,
      "author": "Dani",
      "helpful_votes": 0,
      "publication_date": 20170929
    },
    {
      "title": "Happy",
      "text": "Well made and good fit. Fit is true to size. I would recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Christi Ish",
      "helpful_votes": 0,
      "publication_date": 20190227
    },
    {
      "title": "Simple and easy to put on",
      "text": "Simple and easy to put on. I don't know how long they will hold up for but for the price you can't beat it. They keep my shins and the tops of my feet from getting cut up while kicking my Century Bob XL. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas F Levins II",
      "helpful_votes": 0,
      "publication_date": 20150317
    },
    {
      "title": "these are a huge pain in the butt to put on and take off when you're sweaty and provide terrible",
      "text": "If you have a wider diameter of shin, these are a huge pain in the butt to put on and take off when you're sweaty and provide terrible protection",
      "rating": 2.0,
      "verified": true,
      "author": "D Rivera",
      "helpful_votes": 0,
      "publication_date": 20161226
    },
    {
      "title": "Good price & quality but the padding is a little ...",
      "text": "Good price & quality but the padding is a little wide for my shins & feet. I do have sort of narrow feet but I've had different brands that fit better.",
      "rating": 4.0,
      "verified": true,
      "author": "Samoan Tee Jay",
      "helpful_votes": 3,
      "publication_date": 20150524
    },
    {
      "title": "Flexible, Comfortable",
      "text": "Incredibly happy with these guards! They allow me maximum flexibility on the mat and protection without the bulk. I felt no impacts on my shin or foot and was able to throw down as intended. Fit as designed and breathable.",
      "rating": 5.0,
      "verified": true,
      "author": "Sicily Porto",
      "helpful_votes": 0,
      "publication_date": 20200228
    },
    {
      "title": "Five Stars",
      "text": "they fit great on both my 5 and my 8yr olds well made",
      "rating": 5.0,
      "verified": true,
      "author": "Shana",
      "helpful_votes": 0,
      "publication_date": 20180523
    },
    {
      "title": "Great material",
      "text": "The material is exactly what I wanted and is great! They are pretty tight, I hope they don’t shrink.",
      "rating": 4.0,
      "verified": true,
      "author": "Tarzan",
      "helpful_votes": 0,
      "publication_date": 20180107
    },
    {
      "title": "Nice product",
      "text": "Medium quality but sufficient fast delivery, size is smaller than expected",
      "rating": 4.0,
      "verified": true,
      "author": "DRZ",
      "helpful_votes": 0,
      "publication_date": 20160401
    },
    {
      "title": "Good",
      "text": "it's more than good enough for beginners. I've been using it for almost a year now and the only wear on it is at the bottom which is expected.",
      "rating": 5.0,
      "verified": true,
      "author": "Ivan",
      "helpful_votes": 0,
      "publication_date": 20200506
    },
    {
      "title": "They work",
      "text": "These run a little tight at the top of my calf.",
      "rating": 4.0,
      "verified": true,
      "author": "Fletcher",
      "helpful_votes": 0,
      "publication_date": 20190909
    },
    {
      "title": "Good quality for price",
      "text": "My 14 yr old son wore these for his muay tai competition and they stayed in place and were comfortable throughout the fight. Price is really good.",
      "rating": 5.0,
      "verified": true,
      "author": "Mercedes",
      "helpful_votes": 0,
      "publication_date": 20190512
    },
    {
      "title": "They fit very small but good looking and they protect well",
      "text": "They fit very small but good looking and they protect well",
      "rating": 4.0,
      "verified": true,
      "author": "Thomas",
      "helpful_votes": 0,
      "publication_date": 20170809
    },
    {
      "title": "better than the thicker ones.",
      "text": "They protect me from kicking elbows. And they hold up to washing better than the thicker ones.",
      "rating": 5.0,
      "verified": true,
      "author": "cpu guy",
      "helpful_votes": 0,
      "publication_date": 20170118
    },
    {
      "title": "Five stars",
      "text": "All I need to say is 3 words. Comfy, lightweight and quality is good.",
      "rating": 5.0,
      "verified": true,
      "author": "Oleh",
      "helpful_votes": 0,
      "publication_date": 20170915
    },
    {
      "title": "I like the fit but for hard sparring this isn't for ...",
      "text": "I like the fit but for hard sparring this isn't for you. A hard plastic insert to protect the shin bone would help this product.",
      "rating": 2.0,
      "verified": true,
      "author": "Mr Spike",
      "helpful_votes": 2,
      "publication_date": 20150601
    },
    {
      "title": "Five Stars",
      "text": "Exactly as advertised. A quality product and packaged very well. I will purchase from this store again! :)",
      "rating": 5.0,
      "verified": true,
      "author": "Clifford Alexander",
      "helpful_votes": 0,
      "publication_date": 20170228
    },
    {
      "title": "The M is a bit small for 140lbs 5'7''",
      "text": "i'm 5'7'' 140lbs bought medium and came a bit small, but tolerable nice shield if you aren't doing anything too hard core",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon User",
      "helpful_votes": 0,
      "publication_date": 20170409
    },
    {
      "title": "Love these, I've had them for a year and ...",
      "text": "Love these, I've had them for a year and they are showing no signs of wear and tear yet. Very simple and very effective shin guards at a bargain cost, you can't go wrong with these",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160814
    },
    {
      "title": "Meister MMA Elastic Cloth Shin & Instep Padded",
      "text": "Great quality and perfect fit. Purchased for my eight (8) year old",
      "rating": 5.0,
      "verified": true,
      "author": "Customer",
      "helpful_votes": 0,
      "publication_date": 20181201
    },
    {
      "title": "These do great on protecting your shin and top of the foot ...",
      "text": "These do great on protecting your shin and top of the foot but the cloth is very rough and causes some discomfort when worn to long.",
      "rating": 4.0,
      "verified": true,
      "author": "Cody",
      "helpful_votes": 0,
      "publication_date": 20160530
    },
    {
      "title": "Good product for the money",
      "text": "These do stay snug and don't move around when sparring. Unfortunately, they're a little too thin for my coach's liking when it comes to sparring and protecting your partner, so I had to order some more substantial ones for that. Good product for the money, just depends on your planned usage.",
      "rating": 4.0,
      "verified": true,
      "author": "Rob",
      "helpful_votes": 0,
      "publication_date": 20161207
    }
  ],
  "product_meta": {
    "title": "Meister MMA Elastic Cloth Shin & Instep Padded Guards (Pair)",
    "description": "Meister's Cloth Shin Guards are designed to offer the athlete super-strong and lightweight protection for the whole leg. Exclusively designed and sold by Meister, these Shin & Instep guards are not the generic pads you will find elsewhere. Impact foam padding is ideally sized and positioned to offer maximum contact protection on the shins and top of feet. The elastic body of these shin guards is produced precisely to hug the athlete's leg tightly to hold the guard in place, but still allow you slide them off or on without a major struggle. The hook and loop elastic strap at the top of the guard further allows the wearer to secure the guard to the leg. Don't go for cheap knock-offs or mass-produced guards that don't fit or protect. Get your fight on with Meister.",
    "rating": 4.4,
    "feature_bullets": [
      "Full elasticated body hugs the legs and feet",
      "Slides on easily but stays in place all workout long",
      "Unique hook and loop strap secures top of guard tightly",
      "Padding retains your individual leg form through use",
      "Meister MMA Exclusive - Designed to fit and protect like no other lightweight shin/instep guards"
    ],
    "specifications": {
      "Date First Available": "June 1, 2014",
      "Manufacturer": "Meister MMA",
      "ASIN": "B07BHXH3ZB",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Other Sports",
      "Martial Arts",
      "Shin Guards",
      "Sports & Outdoors",
      "Protective Gear",
      "Sports & Fitness"
    ],
    "price": 14.99
  }
}