{
  "website_summaries": [
    {
      "verdict": "Easily remove your phone and its holder from the clamp with the touch of a button.",
      "pros": [
        "Non-slip rubber grip cradles phone securely",
        "Easy to install and remove",
        "Works with most devices measuring 1.97 to 3.94 inches wide",
        "360-degree rotation",
        "Fits on handlebars measuring 0.71 to 1.57 inches in diameter",
        "Easy push-button release",
        "Bands provide additional security"
      ],
      "cons": [
        "When assembling, be sure to attach rubber tie downs before joining the top to the body of the unit",
        "If you don't, you won't be able to slide the phone holder off the clamp and carry it with you"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Might be good for weekend riders, not so much for daily grinders.",
      "text": "Almost made it a month. 80 miles of road and trail and yesterday it fell apart at the end of my first 20+ mile ride. The only thing that kept my droid turbo 2 from falling out was the rubber holder. Other than that it's useless now. I liked the fact it was adjustable, shame the guts couldn't hold up to any real usage. I'm just glad it gave out now and not in the middle of RAGBRAI or a century ride.",
      "rating": 1.0,
      "verified": true,
      "author": "D. Wenke",
      "helpful_votes": 9,
      "publication_date": 20170525
    },
    {
      "title": "Good if you want a broken phone.",
      "text": "I purchased this to hold my Galaxy Note 5 with Otterbox to my handlebars when biking. Got it all set up and been using it for just over a week when today, after going over a bump, the piece where the screw screws in snapped, and my phone went flying. Good thing I had the Otterbox on it. Immediately went home and took this piece of plastic off. Why can't the critical points of these things be made with metal?",
      "rating": 1.0,
      "verified": true,
      "author": "ironfistr",
      "helpful_votes": 6,
      "publication_date": 20170815
    },
    {
      "title": "Useless garbage that dropped my phone off my bike on ...",
      "text": "Complete trash. Fell apart after first use. The system depends on a cheap plastic joint in the lower half of the mechanism. The springs pressure it apart and after one use it completely opened up. Useless garbage that dropped my phone off my bike on the street.",
      "rating": 1.0,
      "verified": true,
      "author": "Gabriel Reyes",
      "helpful_votes": 7,
      "publication_date": 20170329
    },
    {
      "title": "A great addition to my bike!",
      "text": "I just wanted something to hold my phone while I rode- it seemed silly to purchase both a pedometer as well as a speciality bag and blah blah to hold everything when this really solved the issue. There are so many free apps out there to track mileage and I figured this was the simplest answer. It comes with an extra bungee piece and a spare piece of rubber to protect your bike! I put my phone case in there to show how it works. It even has little teeth and a rubber backing to hold onto your phone. Definitely worth the money!",
      "rating": 5.0,
      "verified": true,
      "author": "Paigii",
      "helpful_votes": 2,
      "publication_date": 20190616
    },
    {
      "title": "Fell off my bike mid-ride",
      "text": "This was awesome for about the first month. After that, it became a bit finicky with rotating and would not hold position well. I was riding home one night after about 2-3 months of use, luckily my phone was in my bag. I heard a sound and a crunch. I realized that the mount had fallen off the bike. I had not checked the adjustment since I initially mounted it. I don't know if it worked itself loose or something else broke. Either way, as soon as it fell off it shattered and then was crushed by a car. I was very thankful not to have my phone on there when this happened.",
      "rating": 1.0,
      "verified": true,
      "author": "D Clark",
      "helpful_votes": 0,
      "publication_date": 20180805
    },
    {
      "title": "Good mount",
      "text": "I have ridden approximately 100 miles with this unit, mostly on paved sidewalk trails and through city streets and intersections. The mount holds my phone very firmly in place without the need to use the elastic bands that are included. It does jiggle on bumps more than I would prefer, and once you attach the mount to the bar clip, there is no easy way to take them apart, which would be necessary to tighten the loose screw that is the source of the excessive jiggles. For this reason I am giving four stars instead of five.",
      "rating": 4.0,
      "verified": true,
      "author": "B. Rogers",
      "helpful_votes": 0,
      "publication_date": 20170703
    },
    {
      "title": "Pokemon go user review",
      "text": "I recently got into biking, and decided this would be a good accessory for playing pokemon go while riding my bike. This product holds the phone very well, and has no give into it. I have done a few rides already, and it hasnt budged at all. The only downside to this thing is it doesnt give the phone alot of room to dissipate heat. I'm sure in regular conditions it works great, but to those that are using this for pokemon go: it will overheat your phone in hotter conditions",
      "rating": 4.0,
      "verified": true,
      "author": "jacob crouch",
      "helpful_votes": 0,
      "publication_date": 20180811
    },
    {
      "title": "Maybe I just had bad luck. I'd used it on a couple of ...",
      "text": "Maybe I just had bad luck. I'd used it on a couple of rides but today I had to buy a new phone because my phone bounced out twice on a bumpy road and it was destroyed. The design probably looks good on paper but the flimsy and bendable plastics (and mechanicals) just failed. The squeeze mechanism came off the track or something because it doesn't function symmetrically any longer. Anyway, this set me back several hundred dollars for a new iphone so I am now looking for a sturdier device that \"truly\" locks the phone in place.",
      "rating": 1.0,
      "verified": true,
      "author": "texasute",
      "helpful_votes": 2,
      "publication_date": 20170819
    },
    {
      "title": "This is a good, solid phone mount",
      "text": "This is a good, solid phone mount. It securely holds my Nexus 6. I have to be careful to properly line up the phone so the side supports do not press the volume or power button, but that is no fault of the mount. My only complaint about the mount is the screw was hard to tighten down initially. It wouldn't turn with the thumb screw and I had to get a ratchet on the backup not to tighten it down. This could be an issue if you are planning on removing and reinstalling it.",
      "rating": 4.0,
      "verified": true,
      "author": "Rik",
      "helpful_votes": 2,
      "publication_date": 20170619
    },
    {
      "title": "So far so good",
      "text": "It looks relatively well made, but we shall see how well it holds up on those trails. It works as described and should be just fine but who knows...my last one (different brand) just snapped. I was lucky to recover my phone. No problems as of now! Revised: After 2 weeks of gravel riding, it has the wobbles! It also has started to rotate randomly? It was looking like it would fail at any moment? I have removed and replaced it with another manufacturer.",
      "rating": 1.0,
      "verified": true,
      "author": "Brewer",
      "helpful_votes": 0,
      "publication_date": 20190616
    },
    {
      "title": "Securely holds my phone",
      "text": "Great design. Securely holds my Note 5 phone. I'm pretty certain it will also hold the larger soon-to-arrive Note 8. I have no concerns about the phone falling out. The only drawback for me is no option for mounting on my top tube (my top tube is too large). My handlebars are the raised style (not flat), so my limited mounting space is already used for my headlight and bike computer. I was able to mount it on my handlebar stem, but that obstructs visibility to the bike computer. No stars off for this since the problems are more specific to the style of bike.",
      "rating": 5.0,
      "verified": true,
      "author": "isosaf",
      "helpful_votes": 0,
      "publication_date": 20170610
    },
    {
      "title": "Great product!",
      "text": "Purchased this to hold my phone for a long distance bike trip. It helped so much to hold the phone so we could have the directions open and easy to read. Most of the time we kept the phone in one of our bags, but it was nice to have a place to keep it secure when we had a lot of turns coming up. The bungees kept the phone secure through rough terrain along with the side clamps. I also liked that you could turn the phone on the cradle so you can look at the screen in landscape orientation.",
      "rating": 5.0,
      "verified": true,
      "author": "Kimmy C.",
      "helpful_votes": 0,
      "publication_date": 20171123
    },
    {
      "title": "Great idea, awful execution.",
      "text": "Mine broke after about 10 uses. The rubber bands that are supposed to secure the phone to the base are too small for larger phones (I have a Galaxy S8), and they end up putting too much stress on the entire unit. I would have returned this after the first use, but i waited too long to try it out. I've generally been pleased with other TaoTronics products I've bought -- but not this time..",
      "rating": 1.0,
      "verified": true,
      "author": "L. Freed",
      "helpful_votes": 2,
      "publication_date": 20171018
    },
    {
      "title": "Broke after 6 months. Replaced by seller.",
      "text": "It worked just fine at first. Everything was pretty straightforward, and it held my phone securely. I was happy right up until the clamp that attaches it to my bike broke about 6 months into owning it for no apparent reason. It snapped in two. ETA: The seller did get in touch with me after my initial review and replaced the broken mount with no hassle. I'm bumping the review up to 3.5 stars. If this one holds up it's a decent phone mount that held my phone securely. My biggest complaint is that it's a little tough to access buttons on the side, but I suspect that's a trade off I'll have to accept to get that secure hold.",
      "rating": 4.0,
      "verified": true,
      "author": "mjunker6",
      "helpful_votes": 0,
      "publication_date": 20180413
    },
    {
      "title": "Plastic broke, phone and case flew off bike",
      "text": "Update 07/28/19 - I have been using this for about 1000 miles on my bike. When riding today, i saw something fly by as i was going downhill. It was the top part of the holder. I just. It just bounced apart. As you can see one of the pieces holding it together is broken. I reattached it, so I could keep rifing, but after about 5 miles, it flew off again. I am giving it two stars, because it did protect my phone both times, and the screen did not get broken, while landing screen down both times.",
      "rating": 2.0,
      "verified": true,
      "author": "Lisa",
      "helpful_votes": 0,
      "publication_date": 20190728
    },
    {
      "title": "Amazing product!!!",
      "text": "My son loves this phone holder! It fits perfect on his bike. It looks really awesome. It comes with 2 rubber phone grips that protect the phone along with the grips on either side of the phone. It is a well made product. It grips the phone safely and there is no worry that his phone would shift or fall out during his bike ride. He loves it so much that I'll probably order one for myself too! It also shipped quickly. I had it 2 days from placing my order and it was packed well.",
      "rating": 5.0,
      "verified": true,
      "author": "lisa-k",
      "helpful_votes": 0,
      "publication_date": 20170323
    },
    {
      "title": "So far it works great. setup instructions were terrible though",
      "text": "So far it works great. setup instructions were terrible though. They give you a QR code for better ones I guess. Either way, put it on the bar you want with the rubber inserts. then using the bottom nut with your fingers, tighten a bit. Then torsion latch at the other end should feel tight as you bend it over. Came with a spare rubber net. Hel my Samsung Galaxy S7 very well. Rotates well and I took it over some small stairs and the phone stayed in.",
      "rating": 5.0,
      "verified": true,
      "author": "Parker",
      "helpful_votes": 0,
      "publication_date": 20170403
    },
    {
      "title": "Did not have a chance to use this until today ...",
      "text": "Did not have a chance to use this until today. It breaks into many pieces the second time my wife put her iPhone 6 Plus on it. It is so poorly made, every piece of part came apart. Luckily it wasn't happening when my wife's phone was on it.",
      "rating": 1.0,
      "verified": true,
      "author": "MT",
      "helpful_votes": 7,
      "publication_date": 20170430
    },
    {
      "title": "Broke after 3 careful uses - don't waste your money",
      "text": "Elastic broke after 3 (careful) uses. Had to stretch quite a bit around the phone to keep it from slipping out (I have an iPhone 6S Plus with a Lifeproof case) and it shook/moved quite a bit while riding anyway, even after adjustments/use of grip tape. Also, either there was never anything keeping the bottom ledge piece folded up when not in use, or it broke off before I noticed it, because now it just flaps freely. A piece of junk - don't waste your money.",
      "rating": 1.0,
      "verified": true,
      "author": "Elise L.",
      "helpful_votes": 2,
      "publication_date": 20170725
    },
    {
      "title": "You get what you pay for.",
      "text": "Long story short, you'll want to look elsewhere if there are better options. I put about 500 miles on my bike this year, and this separated after about 350. I hadn't fallen on it, I didn't drop it, it wasn't broken when I got it, it just is not made to last. It holds your phone incredibly well, but the piece sitting on top of the mount will eventually fall/break off unless you're riding the smoothest of roads 24/7. I'd recommend a different option. I am currently working with hot glue and zipties to keep this from chucking my phone off while riding down the road.",
      "rating": 2.0,
      "verified": true,
      "author": "J D Fridley",
      "helpful_votes": 0,
      "publication_date": 20161201
    },
    {
      "title": "Perfect for Bike Ride.",
      "text": "I bought this so I wouldnt have my phone slip down my waist as I rode my bike, and so I can glimpse the screen better. This is Perfect for Bike Rides for both my Samsung Galaxy and my IPhone 7 Plus. It grips the phone well and the added rubber bands keep it very snug. I can now listen to my books or music easily, and best of all is I can see the screen for \"Map My Ride,\" very nicely. If you don't have the app, get it, it's great for keeping track of your bike rides. This mount is so easy to put on and quick. I'll gladly buy more for my other bikes!!",
      "rating": 5.0,
      "verified": true,
      "author": "rimalaw",
      "helpful_votes": 0,
      "publication_date": 20170814
    },
    {
      "title": "Fits wide handlebars",
      "text": "This fits on theset up nicely. I tried thefirst, but it didn't fit as it wouldn't expand wide enough. I could see this as being heavy for outdoor rides if you cared about drag and weight, but it works great inside to give me a readouts from my iphone7. Easy to attach, adjust, and the one button to release is a nice feature.",
      "rating": 5.0,
      "verified": true,
      "author": "JayJay",
      "helpful_votes": 0,
      "publication_date": 20171228
    },
    {
      "title": "Flimsy, poorly constructed, won't fasten tight to handle bar",
      "text": "I really don't mean to be rude, but this product was terrible. I couldn't figure out how to detach the phone mount from the bike mount once it was attached, which I needed to separate because the elastic holder snapped and I needed to swap it. Beyond that, the damn thing wouldn't tighten enough around my handle bar, which made my phone just swing around while I rode. I had to hold it in place, which then led to the light fastening being loosened further and just coming off entirely. I swear Im not incompetent. I was disappointed that the high reviews did not live up to my expectations.",
      "rating": 1.0,
      "verified": true,
      "author": "Thomas Manteiga",
      "helpful_votes": 0,
      "publication_date": 20171003
    },
    {
      "title": "Good phone holder for your bike with one minor flaw",
      "text": "This is very easy to install and serves its purpose. I can easily access my phone for apps without having to let of go the handlebars now. The only knock I have on it is the bottom of the holder covers the entire bottom of the phone, so you can't use a portable charger with this. It would be nice if there was a hole in the bottom big enough for a microUSB plug to fit into the phone. But as long as your phone is charged up before you put it in here this isn't a huge issue.",
      "rating": 4.0,
      "verified": true,
      "author": "Travieso310",
      "helpful_votes": 0,
      "publication_date": 20170408
    },
    {
      "title": "Great idea, But  materials could be better",
      "text": "Great idea, but mine broke where the phone holder clips into the mount receiver. The “L” shaped guides and back plate broke in pieces the first time I used it, it was mounted to the bike for about two months but I never actually got to ride until recently. . I had it about a year before I used it so I imagine there is no warranty. I gorilla glued it together and am going to try to get some small screws in to fasten it mechanically. As I said it’s a great month and I would still like to use it, I may actually get another one for another bike but I will be super cautious putting it together.",
      "rating": 2.0,
      "verified": true,
      "author": "Doogie",
      "helpful_votes": 0,
      "publication_date": 20180902
    },
    {
      "title": "I’d try a different holder",
      "text": "This holder is two piece one part clamps the the bike the other swivels and holds your phone design wise it’s not bad but the two piece are not secure. It “clicks” together but it’s hope and mild surface tension that keeps it together. Lucky I kept my phone in its case because on two separate occasions the two pieces came completely apart and my phone with its holder went spiraling down the street.",
      "rating": 3.0,
      "verified": true,
      "author": "Sam Helms",
      "helpful_votes": 0,
      "publication_date": 20180815
    },
    {
      "title": "Look no further, this is the bicycle cell phone mount you want to buy",
      "text": "I have an iPhone 6+ with a cover on it, and it fits right into the holder like a glove....then, for added stability the corner rubber bands give it an extra amount of grip for peace of mind. The mount attaches easy right onto your handle bars with a little clamp and it comes with two pieces of rubber to isolate the two surfaces. I have a carbon bike, so it's important to me not to get it scratched up by the mount. The iPhone is easily removed while leaving the mount in place. Someone put a lot of thought into this product. I like this mount so much, I believe I'll order more for the other bikes I have....",
      "rating": 5.0,
      "verified": true,
      "author": "70's Collector",
      "helpful_votes": 0,
      "publication_date": 20170129
    },
    {
      "title": "Perfect solution",
      "text": "I bought this to replace another phone mount I already had because the old one had brackets on the bottom that blocked my headphone jack. This design has no obstructions on the bottom since it is held in place securely by it's curved side brackets. Since my exercise bike sits on the floor I don't even have to use the flexible orange corner mounts when I mount my Galaxy S7 Edge when I do my exercise routine. It was easy to install and easy to use. I couldn't be more satisfied with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Jack L. Minor",
      "helpful_votes": 0,
      "publication_date": 20170321
    },
    {
      "title": "Not for wider handlebars.",
      "text": "Beware that this product doesn't work well with wider handlebars. Even though the product description states it will work on handlebars up to 40mm, I have a lot of trouble keeping it on my 32mm handlebars. It simply isn't designed for it. Also, when I ride, at least one, if not two, of the rubber straps tends to pop off of the phone each time. The phone hasn't fallen out yet, and in fact I am more worried about the entire device falling off the handlebar, but it is worth noting that the design has some challenges.",
      "rating": 3.0,
      "verified": true,
      "author": "moosh",
      "helpful_votes": 0,
      "publication_date": 20170901
    },
    {
      "title": "Handy and sturdy",
      "text": "It holds my phone very steady, between both the adjustable arms and the rubber \"straps\". The mounting base seems somewhat restricted in the tube mounting because of not being able to twist the flip lever but in half turn increments, but it holds it firmly enough that I'm not worried about it coming off, simply that it moves a bit when bumped. After some use the arms don't spring open quite as automatically with the release button, but it still releases smoothly (just with a gentle nudge).",
      "rating": 4.0,
      "verified": true,
      "author": "BC",
      "helpful_votes": 0,
      "publication_date": 20161028
    },
    {
      "title": "Holds iphone 7+ really big and heavy case perfectly.",
      "text": "is the iPhone7+ case. This phone holder solidly holds this huge weight. First on 2000 Kawasaki Drifter. Second on 1978 Suzuki GS-750. Putting my third one on a third bike GSX-S750Z. Its on the V-Strom now, too. Wow. I hate to think how many times on a ride out, the rubber straps were forgotten, and the phone lanyard, and it stayed put. Even off road.",
      "rating": 5.0,
      "verified": true,
      "author": "david",
      "helpful_votes": 0,
      "publication_date": 20180811
    },
    {
      "title": "Clamp works great but don't trust the holder",
      "text": "Installed as directed on my road bike and within 2mi the phone and holder had flown off twice. 2nd time I didn't catch it in time and face down on the road it went cracking my screen. Clamp works great but don't trust the holder. After the initial issues I have ridden several times with no problems. Be sure to get all four prongs to click and it should be good. After giving this device a thorough evaluation period, I can say it came apart 3 times on my ride today. Do NOT trust this with your phone. It has failed too many times to be trusted. I will NOT use it again",
      "rating": 1.0,
      "verified": true,
      "author": "Charles Martin",
      "helpful_votes": 0,
      "publication_date": 20170723
    },
    {
      "title": "Good product for the most part",
      "text": "Did not like how the phone tends to lean one way or another when inserted into the cradle. The phone mount does not hold it's position securely. The cradle swings left or right too easily. The slightest touch changes the perspective of the phone on its mount. Initially, I felt that I must have not mounted holder and the cradle together correctly, but realized that this item has a loose connection between the holder and the cradle. I feel that is either a flaw in the item I received or a flaw in the product design in total.",
      "rating": 3.0,
      "verified": true,
      "author": "James Morsut",
      "helpful_votes": 0,
      "publication_date": 20181223
    },
    {
      "title": "iPhone 7+ Compatible",
      "text": "I have an iPhone 7plus and this holds my phone well. I've tried others that will hold an iPhone 7plus but only without the case. I'm looking forward to riding with it soon when the next warm day rolls in this winter.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Smith",
      "helpful_votes": 6,
      "publication_date": 20161229
    },
    {
      "title": "Detaches too easily",
      "text": "It invariably comes detached from the base within 10-15 minutes of moderate biking in NYC, and so detaches with very little force. Even worse, it's not immediately obvious this happened,, since the rubber banding is still holding it mostly in place. Unless you ride extremely slowly, I wouldn't recommend this. It comes in two pieces, which is a fatal flaw.",
      "rating": 1.0,
      "verified": true,
      "author": "GeekNightsRym",
      "helpful_votes": 0,
      "publication_date": 20170715
    },
    {
      "title": "Warning, the cradle for this mount un-clips from the ...",
      "text": "Warning, the cradle for this mount un-clips from the clamp. Yes, you read that correctly. The cradle (side clamps and rubber bands) is not securely attached to the bar clamp. There are plastic tabs and slots in which the cradle slots in to and \"locks\" with a plastic tab to hold it. On my very first ride, as soon as I rode over a slightly bumpy area, my phone went flying and tumbled 20-30 feet. Don't be fooled by the immensely over engineered cradle and rubber bands. It matters not when the entire cradle flies off. I immediately returned it.",
      "rating": 1.0,
      "verified": true,
      "author": "ShamWow",
      "helpful_votes": 0,
      "publication_date": 20170907
    },
    {
      "title": "Piece of crap",
      "text": "I would not buy this again. It is very high off of the handlebars and is quite loose so even with the four safety straps I have to worry about my $700 iPhone falling to the ground and that is just not something I can live with . I waited too long to send it back and now the opportunity has passed but I would say that run from this item as fast as you can. I would give it zero stars if that were possible.",
      "rating": 1.0,
      "verified": true,
      "author": "RealNewYorker",
      "helpful_votes": 0,
      "publication_date": 20170921
    },
    {
      "title": "Not perfect, if you have a pricey phone spend more",
      "text": "Mediocre construction. Easy to get on/off bike, but rubber band system is iffy. They can slip off. Worst problem is it somehow detached itself after hitting a bump on my bike and went flying, phone included. Apparently it only uses friction for the phone holder to attach to the handlebar mount section of the unit. It seems solid when testing it, but in reality it can pop off.",
      "rating": 3.0,
      "verified": true,
      "author": "Bruno",
      "helpful_votes": 0,
      "publication_date": 20170910
    },
    {
      "title": "Great phone bike mount!",
      "text": "Purchased this product for my Samsung Note for my recumbent bicycle. It works fantastic. It is built very strong and I love the button release. Unfortunately the first one I got had an issue pivoting as it seemed a little loose and contacted Taotronics. Their support folks answered me promptly and sent me another one which was clearly better. I recommend product this to those looking for a really good bicycle phone mount!",
      "rating": 5.0,
      "verified": true,
      "author": "Katrina",
      "helpful_votes": 0,
      "publication_date": 20170623
    },
    {
      "title": "This is a first-class phone holder.  Mounts securely, doesn't rattle nor wobble.",
      "text": "This took a bit of study to figure out how to tighten the clip to the handle-bars. But after realizing that you don't turn the end with the acorn nut on it, the operation went smoothly. For the orange corner straps, a black replacement strap is included. Bottom line is: it holds the phone securely, does not rattle nor wobble, and is adjustable to your preferred viewing angle. If you use a gps tracking system like Strava or Map My Ride, this is a sweet must-have.",
      "rating": 5.0,
      "verified": true,
      "author": "Online Shopper",
      "helpful_votes": 0,
      "publication_date": 20161026
    },
    {
      "title": "It's Ok - Customer Service is great!",
      "text": "it works for small or regular phones. I have a Galaxy Note and my phone is too big to use the rubber stretcher. The clamp is OK. Has some rubber inside of the clamps that get very soft after some use. So you have to constantly readjust the mount. Update 09-16-2016: After being contacted by customer service, they made the whole experience much better! They even offered a full refund! I did not take the offer since I'm using the product with my own modifications but It was great to know that they stand behind their product!! Super recommended!",
      "rating": 4.0,
      "verified": true,
      "author": "jmdloco",
      "helpful_votes": 0,
      "publication_date": 20160912
    },
    {
      "title": "Great phone mount",
      "text": "Great phone mount. I have had similar phone mounts for my car that I've been disappointed with. I was skeptical of this one because of this. I decided to go ahead and get this because the price was low enough to take the risk. The clamps on this are much stronger than I expected. I would feel safe using just the clamps with out the straps. That said the straps are easy to hook over the corners and do not obstruct the screen. My phone is held steady in the mount with little wobble when riding.",
      "rating": 5.0,
      "verified": true,
      "author": "jacob",
      "helpful_votes": 0,
      "publication_date": 20170424
    },
    {
      "title": "Didn't work for me. Pretty disappointed.",
      "text": "Finally got a chance to write this review. I installed it on my road bike. I have an iPhone 5 and mounted to the device. I went for a ride and sure enough the top mout that clips on to the mount that clamps on to the bike came right off my handle bars. The bumps I was going over was your average size cracks in the road nothing big at all. I gave it another try and the same thing happened. Pretty disappointed...",
      "rating": 1.0,
      "verified": true,
      "author": "Calilbc562",
      "helpful_votes": 0,
      "publication_date": 20170823
    },
    {
      "title": "holds the phone just right",
      "text": "I like it so far, it hasnt dropped my beloved phone so we still in good terms ...I may have to update at the end of this next bike season so far looks good feels good and holds the phone just right. I love the feature that you can tilt it, it has a bottom holder and the plastic straps put me at ease to know they are holding the phone just right",
      "rating": 4.0,
      "verified": true,
      "author": "Pier",
      "helpful_votes": 0,
      "publication_date": 20180329
    },
    {
      "title": "Easy to install, easy to use",
      "text": "Just bought a mountain bike and wanted to have easy access to my phone on the handlebars. A friend actually recommended this bike mount to me and I'm so glad he did! My phone doesn't move even when I'm riding on bumpy trails. Not only is there a clamp to hold the phone sides, but it also has an elastic band to grip all four corners of the phone. I have a Samsung Galaxy Note 7 and it holds the phone just fine. Easy to install, easy to use. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle Langston",
      "helpful_votes": 0,
      "publication_date": 20161005
    },
    {
      "title": "Simple and very easy to use product that ends up doing exactly what ...",
      "text": "Simple and very easy to use product that ends up doing exactly what you expect. I confidently ride for miles with my phone securely attached to my bike. The side grips are opened and closed with a single press of a button, the bottom is stabilized with a flipped-out platform, and the phone can be further secured with the rubber corner grips (the phone feels very secure without them, but I still use them). I had considered spending up to $100 on a bike computer, but am very happy I decided to give this bike mount a try first. Find a good biking app, and buy this simple yet perfect tool to make your bike trips that much more enjoyable.",
      "rating": 5.0,
      "verified": true,
      "author": "W. Griswold",
      "helpful_votes": 0,
      "publication_date": 20160809
    },
    {
      "title": "Would have loved to use this.... if my bike wasn't stolen",
      "text": "Great product. Looks great. The box is great. It held my phone very well when I played with it on the kitchen table. However, when I went to attach it to my bike I noticed my bike had been stolen. Of course, this product had nothing to do with my bike being stolen. If anything this product would probably have deterred the thief that took my bike. I'm sure the thief would have seen the amazing phone mount and said, \"Wow, this is really cool. I can't steal this guys bike\". Anyway, it looks like I'll keep having to play Pokemon Go on foot. It's still a great product, and I can't wait to put it on my new bike!",
      "rating": 5.0,
      "verified": true,
      "author": "Logan S.",
      "helpful_votes": 0,
      "publication_date": 20170123
    },
    {
      "title": "Works great",
      "text": "Would give this 5 stars if it turned sideways so we could enlarge our screen. My son is doing rehab for ACL surgery and we put a bike on a stationary stand since we didn’t want to invest in a high end bike for something he would use for 9 months. We bought this to mount on the bike so he could watch his fortnight videos and Netflix while he rides for rehab. Works great, adjust to fit multiple sizes including my iPhone 10x plus with otter box that is bulky.",
      "rating": 4.0,
      "verified": true,
      "author": "Mason",
      "helpful_votes": 0,
      "publication_date": 20181207
    },
    {
      "title": "The mounting bracket for the handlebar broke",
      "text": "Junk.... The mounting bracket for the handlebar broke with less than three uses of this device. Phone hit the ground, but seems ok, thank to the case I have it in. I have been off the bike for couple of months due to an injury... and today was the first day back on the road. Really disappointed in this unit after all of the good reviews. But I guess for $13.00, you can't expect much. See the attached image.",
      "rating": 1.0,
      "verified": true,
      "author": "Charlie Gipson",
      "helpful_votes": 0,
      "publication_date": 20171203
    },
    {
      "title": "I would like it if it had a tiny bit more rotational ...",
      "text": "It works It is basic, but it does the job. On my phone, the Nexus 6p, the clamps hit the volume controls but because of the elastic corner pieces I don't have to clamp the sides down tight at all. I would like it if it had a tiny bit more rotational grain, meaning, being able to 'click' it left or right in small increments. As of now, my phone sits at a small angle. For the money, it is a fantastic buy. (And yes, I play Pokemon Go with it.)",
      "rating": 5.0,
      "verified": true,
      "author": "Mark A. Butler",
      "helpful_votes": 0,
      "publication_date": 20160907
    },
    {
      "title": "Great product!",
      "text": "I’ve waited to put a review on this product to see how well it would hold up under use. I’ve got a couple hundred miles on mine and I’m happy to say it’s a keeper. I’ve only lost my phone once and that was because I didn’t use the orange safety strap.",
      "rating": 4.0,
      "verified": true,
      "author": "Neil Colquitt",
      "helpful_votes": 0,
      "publication_date": 20201005
    },
    {
      "title": "Lasted for thousands of miles of road bike riding.",
      "text": "This is a fantastic phone mount! I bought it March 2017 and it just died this week, July 2020. My phone only fell out of the mount one time and it was because I didn't apply the rubber straps. I came here to buy another one, but it's no longer available. It finally failed at the pivot point where a screw attaches the handlebar bracket to the phone holder. I couldn't have been more pleased with this device. $20 for over 3 years of use and my phone was never damaged when I used the mount correctly. I hope I can find a similar replacement.",
      "rating": 5.0,
      "verified": true,
      "author": "Joshua D Boozer",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "not so strong",
      "text": "I bought one for my daughter and a month later one for my wife. It is ok bike mount. a bit too bulky a bit too flimsy, but worked until it got broken today after 5 month of light usage exactly during the ride. Not sure where all this superpositive reviews are coming from ... I also not sure how it broke . Did I make it too tight?! Check my pictures. Luckily only iphone case had scratches. Buttom line: if you like your phone buy something sturdier.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171202
    },
    {
      "title": "Needs better installation instructions",
      "text": "I think the installation instructions could use improvement. I had every intention of installing this on my bike and getting lots of use out of it this summer. But I failed. I tried to install it while on the go and couldn't quite figure it out. I meant to go back and do it later but then summer flew by and I didn't get to spend as much time riding as I'd hoped. I will try to remember to update my review when I succeed in installing the mount.",
      "rating": 3.0,
      "verified": true,
      "author": "MichelleV",
      "helpful_votes": 0,
      "publication_date": 20171009
    },
    {
      "title": "Slides downwards during bumpier rides",
      "text": "Have been using this phone mount for 2 months. It holds the phone very secure to the mount and is easy to install and adjust, however I can't seem to get the mount to be secure enough on the handle bars. During my rides it usually starts to slide and the phone ends up facing downwards after a few bumps. I've tried tightening it but it still seems to not grip the bars as well as it could. Overall though, it's a great phone mount for $20ish.",
      "rating": 4.0,
      "verified": true,
      "author": "Helen",
      "helpful_votes": 0,
      "publication_date": 20160912
    },
    {
      "title": "Not a great product.",
      "text": "The directions for installation were lacking. It's not that it is tough to install, but there are a few features that aren't intuitive. Once installed it never was very stable. My phone (an iPhone 7 plus) always seemed as if it was going to fall out. It never did, but I become so concerned I took it off and bought another phone mount. Perhaps the issue was due to incorrect installation, but I recommend you find another product.",
      "rating": 1.0,
      "verified": true,
      "author": "Shawn",
      "helpful_votes": 0,
      "publication_date": 20190622
    },
    {
      "title": "Only suggested for the tamest of rides- Too flimsy for road riding",
      "text": "The product holds the phone well and clamped on to the bars easy enough. The weakness is in the clamp mechanism. Looking at the pictures it looked robust, which is why I chose this model. I purchased this for commuting and typical road bumps would cause the mount to jiggle forward, pointing my phone away from me. I turned the clamp one more half turn hoping to lock the phone in position and it cracked. The clamp lasted less than 10 rides. The mount also has the ability to rotate the phone display in any direction. This is a nice feature, but again that pivot point was a weak spot and constantly jiggling.",
      "rating": 2.0,
      "verified": true,
      "author": "Mike T",
      "helpful_votes": 0,
      "publication_date": 20171002
    },
    {
      "title": "Super easy to install and remove",
      "text": "Absolutely love this thing! With it, I don't have to carry my phone in my pocket and I can track my distance and speed. This is better than the other mounts on the market in my opinion. It has a very wide opening so it'll fit a bike tubing of any size. Other mounts have a max opening. This also has a lever that locks and makes it very easy to remove from my bike so if you wanted to take it with you, you can. No tools necessary. I was afraid my phone might fall off, but I've gone over potholes and bumps at jarring speeds and my phone stays intact.",
      "rating": 5.0,
      "verified": true,
      "author": "Anononymous",
      "helpful_votes": 0,
      "publication_date": 20160924
    },
    {
      "title": "My phone doesn't like the shaking of riding on the handlebars",
      "text": "One of the orange straps broke on my wife's unit. My phone doesn't like the shaking of riding on the handlebars. I probably should have just bought a little seat bag, but this could be handy if you need GPS on your ride. I wouldn't take it on rough trails...street/pavement riding only.",
      "rating": 4.0,
      "verified": true,
      "author": "gstevieg",
      "helpful_votes": 0,
      "publication_date": 20180827
    },
    {
      "title": "Nice to have, good quality.",
      "text": "It holds my phone and holds on to my handlebars really well. I use an Otterbox case that's really thick and it holds it in just fine. It does its joba nd nothing more. The clamping system was a bit sticky out of the package so I opened it up and put some Silicone and PTFE lubricant inside and it works fine now. Really helps when using my cycling apps (Strava, MapMyRide, etc.). Seems it's of good quality, no problems yet.",
      "rating": 4.0,
      "verified": true,
      "author": "Yolk",
      "helpful_votes": 0,
      "publication_date": 20160520
    },
    {
      "title": "Convenient and versatile, but rubber wrap breaks easily.",
      "text": "I have had this mount for just one season , but put on two different bikes. Love having my iPhone right there on the handlebars. On my new Verse 2 the mount is a little tilted side to side, but has good adjustments anterior/posterior. Problem is that the stretchy elastic that wraps around the phone from the back of the mouth has broken already. You get two with mount, but I wonder what to do when the second one tears this season., and how much a replacement will be.",
      "rating": 3.0,
      "verified": true,
      "author": "mad",
      "helpful_votes": 0,
      "publication_date": 20190818
    },
    {
      "title": "Purchase a Heavy Duty One for Mountain Biking",
      "text": "This product worked okay in the beginning, but as time went on (I'm talking a matter of months) it didn't work that great. My phone fell off the several times because it did not clip in adequately. It finally broke one day because I was trying to make sure the phone was held tight. I broke the clamp portion pushing it tight. All in all it was kind of disappointing for a \"Best Seller\" on Amazon.",
      "rating": 2.0,
      "verified": true,
      "author": "SpoonerTop Contributor: Cycling",
      "helpful_votes": 0,
      "publication_date": 20171021
    },
    {
      "title": "It is a good unit, only I CRUISE over rail road tracks",
      "text": "It is a good unit, only I CRUISE over rail road tracks. Full speed. After a quick installation I took it out for a test. The phone holder dislocated from the mount and fell with my phone :( It is a really nice holder, easy-to-use, just wish the phone part was connected more strongly to the mount.",
      "rating": 3.0,
      "verified": true,
      "author": "Rainyday",
      "helpful_votes": 0,
      "publication_date": 20180313
    },
    {
      "title": "Highly recommended!",
      "text": "I had a trouble installing it at first because of the confusing user's guide, but after a while I was able to figure it out after watching a video on youtube (please update your user manual). Overall very solid product, I am using it for a week now. Very convenient when listening to music while cycling. Holds the phone firmly even at rough roads. Highly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "CB",
      "helpful_votes": 0,
      "publication_date": 20170619
    },
    {
      "title": "Excellent Customer Service",
      "text": "I just wanted to write a review of this product which I purchased a few months ago. The product worked very well and I was very satisfied until a week ago when the rubberband attachment broke. I wrote TaoTronics about this issue and they replied to my email within 24 hours and had a replacement band in the mail to me within 48 hours. I am very impressed on their prompt customer service on such a relatively low tech and inexpensive item. I will look to TaoTronics in the future when making additional purchases due to this impressive customer service.",
      "rating": 5.0,
      "verified": true,
      "author": "Rick Bartell",
      "helpful_votes": 0,
      "publication_date": 20190926
    },
    {
      "title": "Excellent",
      "text": "It broke. So why am I giving it 5 stars? Because I abused the heck out of it. I really hammered the poor thing. I must have been going over all sorts, at times I would have been close to 30mph, on a road bike with 110psi tires. So in retrospect, this thing has done incredibly well, it’s traveled hundreds of miles. It’s very cheap, give it a little bit of care and it’ll serve you well. I certainly didn’t.",
      "rating": 5.0,
      "verified": true,
      "author": "James R.",
      "helpful_votes": 0,
      "publication_date": 20170308
    },
    {
      "title": "Fits my phone that is in an Otto Case",
      "text": "Well made. Fits my Moto G that is in an Otter Box (pretty thick). The rubber grip easily fit over the 4 corners of the case. Plenty of width adjustment. I used the provided 2 rubber strips that wrap around the handle bar, then you secure the phone mount clamp...fit tight without any other adjustment (although it looks like you can adjust the clamp to fit different diameter handle bars). I have only used it a few times on a ride...had no issues. Believe this was a good choice.",
      "rating": 5.0,
      "verified": true,
      "author": "David W",
      "helpful_votes": 0,
      "publication_date": 20170220
    },
    {
      "title": "This mount holds my Samsung S7 with case easily, and it was easy to mount to the ...",
      "text": "This mount holds my Samsung S7 with case easily, and it was easy to mount to the bike. After using it a couple of times so far, I have found that it is easy to get the phone in and out of it. I have no concerns about it holding even with normal road bump hazards. It is really light but that also make me a little worried about it's long term durability. On the other hand, it is right in line with it's price.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160814
    },
    {
      "title": "Road bumps = bye bye phone",
      "text": "This mount has been working fine for me through about 3 months of road cycling, but today it belly flopped along with my iPhone 7+, and I can only attribute it to a design flaw. The cradle slides on/off the mount via 4 plastic clips. In order to take the cradle off the mount you slide it forward and it pops right off. The issue is that without being able to lock the cradle onto the mount it could inadvertently slide itself off with the help of a few road bumps. Perhaps if the angle I kept the mount at was steeper it wouldn't have happened, but I can't trust it now.",
      "rating": 2.0,
      "verified": true,
      "author": "PJam",
      "helpful_votes": 0,
      "publication_date": 20170825
    },
    {
      "title": "Great holder!",
      "text": "This is my 2nd bike phone mount. After using this holder this summer, I don't think I'll need another! Attaches very tight. Doesn't move on bumps at all. Easy to get phone in and out. And the 4 elastic straps insures the phone isn't going anywhere. Great purchase. Highly recommend. Had to change my original review----I only used for a total of about 12 times, and the plastic cracked putting the phone in. Cool while it lasted, but not I can't recommend.",
      "rating": 2.0,
      "verified": true,
      "author": "Chalkupanother1",
      "helpful_votes": 0,
      "publication_date": 20161115
    },
    {
      "title": "Bad Clamp....... But good customer service",
      "text": "Really insecure clamping mechanism. I tried tightening it with a wrench but it just chewed right through the plastic without getting any more secure. 10/31/2019 Edit: TaoTronics contacted me recently in an effort to improve my product review and offered to send me a free replacement and also the updated model. I tried them both out and actually like this version better and I'm now convinced that the mount I originally got was just assembled incorrectly.",
      "rating": 4.0,
      "verified": true,
      "author": "Batron",
      "helpful_votes": 0,
      "publication_date": 20180925
    },
    {
      "title": "Don't forget the straps...",
      "text": "Holds my 2nd phone very well, as well as my first phone. Unfortunately my first phone was used to take a pic and set back into the holder without the straps. Ran over some train tracks, heard a bang-bam-bang, thought my bike had died a horrible death, but everything was fine. A half a mile later I realized my phone was missing. Found it crushed on a train track. Holds your phone great if you strap it in.",
      "rating": 5.0,
      "verified": true,
      "author": "Phil D",
      "helpful_votes": 0,
      "publication_date": 20170720
    },
    {
      "title": "The spring loaded part is pretty much useless",
      "text": "I was impressed with the holder when training in my basement. Not so much on the road. The spring loaded part is pretty much useless, it doesn't apply enough pressure to really hold the phone. You really only need the corner silicone pieces.... I did have my phone drop once when the corners weren't fully secure, on a smooth driveway. Next purchase will be just a silicone holder with the corner pieces.",
      "rating": 3.0,
      "verified": true,
      "author": "Christina D.",
      "helpful_votes": 0,
      "publication_date": 20170907
    },
    {
      "title": "Second review",
      "text": "This is my second review on this product. On the first review I only gave it one star. The company at no charge replaced the two units I had trouble with. That I appreciated. After taking your time installing and adjusting them they do work much better. There is a fine line on tightening it too much (which breaks them) or not tight enough (it moves around too much).",
      "rating": 4.0,
      "verified": true,
      "author": "Scott B",
      "helpful_votes": 0,
      "publication_date": 20170802
    },
    {
      "title": "it fit my iPhone wonderfully even with my awkwardly shaped iRing on the back",
      "text": "The product itself is very well made, it fit my iPhone wonderfully even with my awkwardly shaped iRing on the back! Unfortunately I was looking for a product that oscillated, not just rotated 360 as I wanted to use it on my double stroller which has a different angle than a bike handlebar. The actual product though is wonderful, and seemed super sturdy. Love the little rubber band that adds extra holding power.",
      "rating": 4.0,
      "verified": true,
      "author": "Mandi C",
      "helpful_votes": 0,
      "publication_date": 20160628
    },
    {
      "title": "(all smooth road) There are all aluminum mounts for under $20 that should hold up better..",
      "text": "Worked well for about 40 miles..... Plastic clamp is weak. Cannot clamp tight enough to keep mount from rotating on the handlebars.. This was NOT over tightened... Not even tight enough to stay in place... Clamp broke at 40 miles...(all smooth road) There are all aluminum mounts for under $20 that should hold up better...",
      "rating": 1.0,
      "verified": true,
      "author": "William L Stopher",
      "helpful_votes": 0,
      "publication_date": 20180516
    },
    {
      "title": "To make matters worse, I can't get the phone mount apart after ...",
      "text": "The mount is delivered in two pieces that clip together. This clip is poorly designed. On my first ride I hit a bump in the road and my mount separated in half, leaving my phone bouncing across the street at +20mph. To make matters worse, I can't get the phone mount apart after putting it back together on the road so I'm always nervous that it's going to fall apart again at any time. If you buy this item I highly recommended putting glue in-between the two mount pieces before locking them together. It also makes a small amount of cheap plastic creaking noises constantly while riding.",
      "rating": 2.0,
      "verified": true,
      "author": "andrew",
      "helpful_votes": 0,
      "publication_date": 20170901
    },
    {
      "title": "Read the directions!",
      "text": "iPhone 7s plus and it fits.. just barely. A little more difficult to put together than imagined but if I would have read the instructions and looked at the pictures a little better then it probably wouldn't have been so difficult. Neat little button on the side that softly expands the sides and a flip out bottom piece to hold the phone. Have not taken the bike for a ride with my new phone holder but will update once I do.",
      "rating": 5.0,
      "verified": true,
      "author": "JKeough",
      "helpful_votes": 0,
      "publication_date": 20170605
    },
    {
      "title": "I thought it was just a bad one so I ordered it again",
      "text": "I had a couple of problems with this item. I ordered this item twice because the first one was defective; the part that holds your phone would not release from the clamp so you can place the rubber band part. I thought it was just a bad one so I ordered it again. I was cycling with it for approximately a month and one day as I was cycling the part that connects the iPhone holder to the clamp snapped off and my iPhone fell off my bike. I like how it holds my phone, but it doesn't seem to hold up long after cycling",
      "rating": 2.0,
      "verified": true,
      "author": "Slapaface21",
      "helpful_votes": 0,
      "publication_date": 20171025
    },
    {
      "title": "It's great, and survived a bike crash",
      "text": "It's great, and survived a bike crash. Love not having to stop and take out my phone to look at the GPS at every intersection when I'm going somewhere unfamiliar. Very easy to put on and take off the bike. The phone platform also rotates. Basically I feel I can adjust this any which way, and in addition to navigation I've also used it for filming time lapses of bike rides.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171217
    },
    {
      "title": "Works great!",
      "text": "The bike mount held my Nexus 6p firm, and I was confident that it wouldn't fall out even over some larger bumps. The stretchy rubber bands that go over the corners fit well, I only use a small profile case on my phone.",
      "rating": 5.0,
      "verified": true,
      "author": "Chad  Bursiek",
      "helpful_votes": 5,
      "publication_date": 20161009
    },
    {
      "title": "Simple, works ok so far...",
      "text": "This item looks and feels like what you paid for - $12. Meaning it's functional but not real \"solid.\" The instructions aren't clear as to where the rubber gasket goes - it's basically around the clamp. Rather than stretch it over the corners I pulled them across the width for more security. It seems \"kinda\" secure.",
      "rating": 3.0,
      "verified": true,
      "author": "galfromdownunder",
      "helpful_votes": 0,
      "publication_date": 20170909
    },
    {
      "title": "Plastic Clamp breaks",
      "text": "The clamp must be tightened to keep the phone mount from rotating around the handlebars. But because the swivel lever that secures the clamp is plastic, it can not handle much torque. They need to use a metal/steel clamp that is stronger for securing large phone (like the Samsung Note).",
      "rating": 1.0,
      "verified": true,
      "author": "Scot A. Shier",
      "helpful_votes": 0,
      "publication_date": 20190609
    },
    {
      "title": "A bit more swivel for that perfect angle",
      "text": "Gets the job done and keeps my phone safe. My only suggestion would be to allow the top part to swivel in all directions. The base sits at an angle on my handle bar due to the position of my brakes this making the screen turn in one direction. This is by no means a show stopper but would prefer not to tilt my head to see the screen straight on.",
      "rating": 4.0,
      "verified": true,
      "author": "wxydesign",
      "helpful_votes": 0,
      "publication_date": 20171011
    },
    {
      "title": "Broke - phone fell off bike",
      "text": "OK, so it's May of 2019 and I bought this about 2 years ago. Today it broke and my phone fell off the bike. Fortunately the phone survived with only a few very minor scratches but needless to say I'll be trying a different mount this time. NOT RECOMMENDED!!",
      "rating": 2.0,
      "verified": true,
      "author": "Ken",
      "helpful_votes": 0,
      "publication_date": 20190518
    },
    {
      "title": "Holds my phone well",
      "text": "This holds my Moto E (4th Generation) very snug and does not vibrate. 1 touch button easily opens the holder to remove the phone. Plastic construction, but feels solid enough. I did feel the elastic bands were slightly small and I had to stretch them really far to get over all 4 corners though. I wish it came with an assortment of band sizes so I could get the best fit.",
      "rating": 4.0,
      "verified": true,
      "author": "Joe",
      "helpful_votes": 0,
      "publication_date": 20181008
    },
    {
      "title": "I took my first ride on Sunday ans this Mount is awesome. With this Mount you no longer need a ...",
      "text": "My wife bought this for my bike, as she was sick of watching me trying to grab my phone from Cycling Jersey's back pocket when riding and waiting for me to fall. I took my first ride on Sunday ans this Mount is awesome. With this Mount you no longer need a trip computer, as you phone can do it all with a good cycling app. The mount held my phone very securely even when I hit a large pot hole on the road. It was easy to install, and great after sale service from seller. Totally recommend this, either for fun rider or serious pro.",
      "rating": 5.0,
      "verified": true,
      "author": "Robin Richardson",
      "helpful_votes": 0,
      "publication_date": 20160308
    },
    {
      "title": "Great Cell Phone Holder",
      "text": "I love this cell phone holder! It works really well and keeps your phone in nice and snug. It also comes with an extra band for when the original looses elasticity. It's easy to install or take off your bike. It's also easy to get your phone in and out of it. I was scared at first that my phone may pop out while going over bumps, but the clamp combined with the elastic band keeps it very secure.",
      "rating": 5.0,
      "verified": true,
      "author": "Erica B",
      "helpful_votes": 0,
      "publication_date": 20160801
    },
    {
      "title": "I bought two of these because even though my wife ...",
      "text": "I bought two of these because even though my wife hasn't ridden her bicycle in a hundred years, if she saw it on mine, she would want one. But I digress. Clamped on with ease. The combination of the two mechanical clamps plus the silicone stretch bands on the corners assures that this thing is going to hold my smartphone. I'm using mine with a Galaxy Note 5. The stretch bands are a little tricky to place (I find I have to do the diagonal corners simultaneously), but it's secure. The price was right too.",
      "rating": 4.0,
      "verified": true,
      "author": "Larry&Delaney",
      "helpful_votes": 0,
      "publication_date": 20160408
    },
    {
      "title": "Neat Product",
      "text": "For the past several years I have been placing my smartphone in a little pouch dangling from the handlebars of my bike so when the phone rang it was a bit of an inconvenience to say the least. Occasionally I like to use an app on my phone to also track my ride which before I was not able to see the phone unless I stopped my bike to retrieve my phone from the pouch. Glad I found this product!",
      "rating": 5.0,
      "verified": true,
      "author": "Ginny G.",
      "helpful_votes": 0,
      "publication_date": 20170509
    },
    {
      "title": "very cheap construction",
      "text": "I bought this bike phone mount based on the good reviews. However, after just the 3rd use of it, bike ride, one of the spring loaded fingers, clamps broke while riding. It happened when I road over a medium size bump. I replaced it with a Widras bike mount. The Widras is much more sturdy, the side clamps are much larger and the mounting system is far superior. Spend the couple extra couple of bucks and buy the Widras.",
      "rating": 1.0,
      "verified": true,
      "author": "Al J.",
      "helpful_votes": 0,
      "publication_date": 20170822
    },
    {
      "title": "OK, for the price",
      "text": "Out of the box, this holder moves a bit... Slips down on bumps. The fix is to put a rubber band or two between this bracket and your handlebar. Even then, however, I think only portrait orientation will \"stick\". I wanted to get a landscape-format timelapse of my commute, but it doesn't hold the position. I regret cheaping out and not buying the $20 step-up version. However, this is \"good enough\", esp. for the low price, that I decided not to send it back.",
      "rating": 2.0,
      "verified": true,
      "author": "W. Tersch",
      "helpful_votes": 0,
      "publication_date": 20161020
    },
    {
      "title": "Um, not a favorite -- still worried about my Samsung Galaxy in the \"arms\" of this thing",
      "text": "I still don't trust it with my phone. It doesn't really fit with the shape of a Samsung Galaxy -- maybe you i-people with have a better time with your iPones. The orange plastic bands to do have enough give to go around the edges of my phone -- tends to squeeze the phone and could damage pixels. No, this was a mistake.",
      "rating": 2.0,
      "verified": true,
      "author": "Idaho Guy",
      "helpful_votes": 0,
      "publication_date": 20170701
    },
    {
      "title": "Not perfect, but well worth the money!",
      "text": "I have had this item for about two weeks now, and I use it on regular biking trips. Nothing extreme. Pro's +Easy to attach to any size handle bar. +Comes with a replacement plastic holder. +Phone seems secure at all times. +Phone swivel is easy to change and stays in place easily. +The ability to release the phone from the carrier is very simple. Con's -Plastic holders are hard to wrap around the phone at times or stay in place. -Plastic sliders seem to want to break over time. -Plastic sliders can press your power or volume up and down button.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160720
    },
    {
      "title": "Great Product",
      "text": "Would give this a 4 1/2 if it was possible. It fits my phone perfect, and built so it won't scratch the side of my phone case. It swivels, which makes it perfect for being able to record video from my phone while riding. Installation was easy, the only drawback is the bright orange mounting bracket. But it has such great features, I can live with the orange. Great ordering process. Shipped quickly and arrived in good shape.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161224
    },
    {
      "title": "Flimsy after three months of use",
      "text": "At the beginning, using the TaoTronics bike phone mount for my Pixel 3 was great. On average I rode about 80 miles a weekend with the phone mount on my road bike. Three months later, however, the mount became very flimsy. I'm afraid my phone will fall out, so I have stopped using the phone mount. Specifically the connection between the phone clamp and handle bar clamp was the issue. The handle bar clamp is sturdy, but on bumpy roads the phone mount will rotate and lunge up and down.",
      "rating": 2.0,
      "verified": true,
      "author": "RenaultAI",
      "helpful_votes": 0,
      "publication_date": 20190425
    },
    {
      "title": "Fortunately my Samsung S8+ was in a hard case and ...",
      "text": "This product dropped my phone off the bike twice due to moderate bumps on the road. Fortunately my Samsung S8+ was in a hard case and was not damaged, although I had a hard time finding the phone which had gone into a weed covered ditch. I would not recommend this holder to anyone.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180523
    },
    {
      "title": "Works Great",
      "text": "Works Great. Holds many different types of phones and fits several different bikes. I have several types of phones; including IPhone 4, all the way to Samsung Galaxy 6 and it holds them all really snug. There are 2 ways it can hold your phone (Rubber bands, or clamp) or use them both together if you are doing stunts or mountain climbing. I've done it together and separate and never had any issues. I'd recommend this.",
      "rating": 5.0,
      "verified": true,
      "author": "Tony",
      "helpful_votes": 0,
      "publication_date": 20160925
    },
    {
      "title": "Fortunate my phone was not damaged",
      "text": "While the bands do a nice job of holding the phone to the mount, I have had the the mount separate from it's base three times when taking a bump -- despite hearing and feeling it click into place. Was very fortunate that my phone was not damaged. Buying a different mount today.",
      "rating": 1.0,
      "verified": true,
      "author": "amazoner",
      "helpful_votes": 0,
      "publication_date": 20170710
    },
    {
      "title": "Was very skeptical of this at first. Read previous ...",
      "text": "Was very skeptical of this at first. Read previous reviews and was nervous about my phone in particular. I own a Kyocera Brigadier (a MIL Spec phone) with very round corners. The band held the top corners down OK but kept slipping off the bottom bands. In the end I just stretched one of the bottom ones across the whole phone and it stuck with out breaking the band. This is rock solid and used primarily for suburban Pokemon Go hunting.",
      "rating": 5.0,
      "verified": true,
      "author": "JustBill",
      "helpful_votes": 0,
      "publication_date": 20160816
    }
  ],
  "product_meta": {
    "title": "TaoTronics Bike Phone Mount Bicycle Holder, Universal Cradle Clamp for iOS Android Smartphone, Boating GPS, Other Devices, with One-button Released, 360 Degrees Rotatable",
    "description": "TaoTronics Bike Phone Mount Bicycle Holder, Universal Cradle Clamp for iOS Android Smartphone, Boating GPS, Other Devices, with One-button Released, 360 Degrees Rotatable, Rubber Strap",
    "rating": 3.9,
    "feature_bullets": [
      "Multiple Protections: Non-slip Rubber Grip Cradles of the Bicycle Phone Mount Secures Your Device All-around to Guard Against Any Accidental Falls. Protect Your Device on Your next Thrilling Bicycle Journey Perfectly",
      "Easy to Install and Remove: Screw the Flipper to Hold Firmly and Remove the Bike Phone Mount Easily by Hand",
      "Compatible for Most Devices: As Wide as 1.97-3.94 Inches; This Phone Holder Frees Your Hands up so You Do Not Miss Any Fun on the Exciting Ride",
      "Rotatable by 360 Degrees: It Presents the Best Viewing Angle on Bike Handlebars Ranging from 18 - 40mm (0.71 - 1.57in) in Diameter",
      "Practical and Useful: Keeps Your Device Within Reach Anytime; Simple Push on the Button to Instantly Release Your Phone"
    ],
    "specifications": {
      "Product Dimensions": "3.7 x 4.5 x 3 inches",
      "Item Weight": "6.2 ounces",
      "ASIN": "B015PS3ME2",
      "Item model number": "TT-SH013",
      "Customer Reviews": "3.9 out of 5 stars4,011 ratings3.9 out of 5 stars",
      "Best Sellers Rank": "#21,046 in Electronics",
      "Is Discontinued By Manufacturer": "No",
      "Other display features": "Wireless",
      "Colour": "Black",
      "Included Components": "An User Manual, A Bike Mount",
      "Department": "MOUNT",
      "Manufacturer": "TaoTronics",
      "Date First Available": "September 23, 2015"
    },
    "categories": [
      "Sports & Handheld GPS",
      "Electronics",
      "Cycling GPS Units",
      "GPS, Finders & Accessories",
      "All Departments"
    ],
    "price": ""
  }
}