{
  "website_summaries": [
    {
      "verdict": "Looks great and is eco-friendly, but is not as versatile as aluminum chairs.",
      "pros": [
        "Eco-friendly, naturally water resistant and easy to set up so it doesn't wobble"
      ],
      "cons": [
        "Heavier than all aluminum chairs and wears out more quickly because it's made of wood",
        "A bit on the expensive side, too, and doesn't swivel or adjust for height"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Solid and really nice looking",
      "text": "Really well made. Adjustable feet make it rock solid in place. Good labeling on which part goes together. The quality, pattern, and finish of the wood exceeded my expectations",
      "rating": 5.0,
      "verified": true,
      "author": "Earle",
      "helpful_votes": 2,
      "publication_date": 20170113
    },
    {
      "title": "Very nice!",
      "text": "Stable, nicely made and really pretty. I am very pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "fox",
      "helpful_votes": 0,
      "publication_date": 20160211
    },
    {
      "title": "Top Quality.",
      "text": "This was one of my best purchases in a vet long time. Well crafted, high quality teak. I'm a happy customer.",
      "rating": 5.0,
      "verified": true,
      "author": "Spa Mom",
      "helpful_votes": 2,
      "publication_date": 20151016
    },
    {
      "title": "Nice bench",
      "text": "Wood is smooth and nicely finished. Went together easily. Haven’t used it in the shower yet, but I’d imagine it would need to be cared for as you would outdoor wood.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Sue N.",
      "helpful_votes": 0,
      "publication_date": 20200301
    },
    {
      "title": "The One We've Been Looking For",
      "text": "We love this bench. Just what we needed. Been looking for just the right one for a long time. This is it. Very sturdy, comfortable and looks really nice.",
      "rating": 5.0,
      "verified": true,
      "author": "Doug Loflin",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "Great Bench at a Great Price",
      "text": "This is a lovely, sturdy bench. It was incredibly easy to put together—took about 8 minutes. Came with info about who makes it and how. Seems like a small, hard-working company that cares about it's quality and customers. I've been using it in my shower for about a month now and it's perfect. A very good value.",
      "rating": 5.0,
      "verified": true,
      "author": "Yve",
      "helpful_votes": 3,
      "publication_date": 20151226
    },
    {
      "title": "Excellent. Beautiful. Sturdy.",
      "text": "Excellent product. Quality materials. Assembly couldn't be simpler. Ordered a second one.",
      "rating": 5.0,
      "verified": true,
      "author": "Dalai Mama",
      "helpful_votes": 0,
      "publication_date": 20200529
    },
    {
      "title": "Sturdy. Fantastic Quality",
      "text": "It is exactly as stated by mfg. even more. color is vibrant too",
      "rating": 5.0,
      "verified": true,
      "author": "patricia Belmar",
      "helpful_votes": 0,
      "publication_date": 20190304
    },
    {
      "title": "This bench is wonderful and such beautiful wood",
      "text": "This bench is wonderful and such beautiful wood. I recommend it to anyone looking for a bench for the shower or bathroom. Very sturdy and easy to assemble.",
      "rating": 5.0,
      "verified": true,
      "author": "Love 2 Cook",
      "helpful_votes": 0,
      "publication_date": 20171025
    },
    {
      "title": "Beautiful bench. Solidly made",
      "text": "Beautiful bench. Solidly made. Adjustable feet allow for leveling in showers that have sloped floor for drainage. Love that it's made with reclaimed materials. Would purchase again without hesitation.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott & Madelyn Russell",
      "helpful_votes": 0,
      "publication_date": 20160629
    },
    {
      "title": "Great table. Very good quality",
      "text": "Great table. Very good quality. Almost didn't bought because of one rating ,but now I am ordering second one. Perfect size. One word- great",
      "rating": 5.0,
      "verified": true,
      "author": "V",
      "helpful_votes": 0,
      "publication_date": 20160429
    },
    {
      "title": "Good size for my shower",
      "text": "The teak bench was easily assembled. The floor levelers worked well on the pitched shower floor. Pleased with the finish and appearance of the teak wood. This small armless bench was just right for our shower.",
      "rating": 5.0,
      "verified": true,
      "author": "Harry Alsdorf",
      "helpful_votes": 0,
      "publication_date": 20201026
    },
    {
      "title": "Most beautiful shower bench.",
      "text": "This is a most beautiful shower bench. The craftsmanship is the best. This is a very rare $ bargain for the quality. Don’t find us very much in the US anymore. I would say any furniture purchase from this supplier will be worth your money.",
      "rating": 5.0,
      "verified": true,
      "author": "patty california",
      "helpful_votes": 0,
      "publication_date": 20201107
    }
  ],
  "product_meta": {
    "title": "EcoDecors Eleganto Teak Shower Bench, 18\", Natural",
    "description": "The compact size of 18\" length x14\" width x 18\" height provides a compact footprint that will fit in most tight areas. These stools include foot leveling pads to provide extra flexibility and stability to allow stabilization due to any minor slope, and uneven surfaces, like shower floors. Teak is naturally water, mold, and mildew resistant due to its natural density and high oil content. It has been the wood of choice for hundreds of years of luxury boat builders. This natural resistance has been supplemented by using our proprietary EcoDecors sealer which is a deep penetrating stain with added mold, mildew, and fungus inhibitors. It provides the ability for this teak furniture to be used outdoors as well as indoors. EcoDecors develops unique home décor & furnishings using recycled, reclaimed, and upcycled materials. We focus on using materials that let the natural beauty of teakwood be highlighted, including the natural wood grains and color variations. We have developed a coating process that both protects the wood, and brings out the natural grains and colors of the teak wood. Every EcoDecors furniture and accessory uniquely highlights its materials. EcoDecors is a small family owned and operated company pricing itself on quality, value, and service. We source directly from small rural workshops in developing countries. Our craftspeople use artisan techniques handed down from generation to generation to craft cast off doors, old boats, buildings, brides, rail road ties, teak roots, and other material into one of a kind functional works of art. To assure our quality we employ our own inspection staff on site and do 100% quality re-inspection in the USA. Made in Indonesia by local crafts people. Sustainably sourced and manufactured. Weight capacity is 250 pounds. Please Note: Some Assembly is required",
    "rating": 4.9,
    "feature_bullets": [
      "SOLID PLANTATION GROWN TEAK- Natural wood grain tone",
      "ADJUSTABLE HEIGHT FOOT LEVELERS- For sloped shower floors",
      "NATURALLY WATER RESISTANT- For use in showers, indoors, outdoors",
      "NEW ECO SAFE DESIGN And DECOR FROM ECODECORS",
      "The compact size of 18\" length x14\" width x 18\" height provides a compact footprint that will fit in most tight areas"
    ],
    "specifications": {
      "Product Dimensions": "18 x 14 x 18 inches",
      "Item Weight": "15 pounds",
      "Manufacturer": "DecoTeak",
      "ASIN": "B0155JSNUY",
      "Item model number": "ED999",
      "Customer Reviews": "4.9 out of 5 stars22 ratings4.9 out of 5 stars",
      "Is Discontinued By Manufacturer": "No",
      "Max Weight Recommendation": "250 Pounds",
      "Specialty": "Organic, Natural",
      "Material Care Instructions": "Wipe clean with soft cloth",
      "Is Assembly Required?": "Yes",
      "Number of Pieces": "1",
      "Warranty Description": "5 year limited manufacturer",
      "Batteries Required": "No",
      "Import Designation": "Imported"
    },
    "categories": [
      "Home & Kitchen"
    ],
    "price": 98.68
  }
}