{
  "website_summaries": [
    {
      "verdict": "A hook that makes it simple to connect a ladder to a roof without endangering shingles.",
      "pros": [
        "Includes rubber-grip T-bar to protect shingled and metal roofs from damage",
        "Constructed from high-quality yellow zinc-plated steel",
        "Designed for seamless attachment to single or extension ladder",
        "Sturdy and versatile hook"
      ],
      "cons": [
        "Wheels tend to move around, even with wing nuts fastened",
        "Pricey compared to similar options"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Heavy! Restocking fee if you don't like them",
      "text": "You might be tempted to use only one of these things (instead of the recommended 2) and that probably wouldn't be a bad idea, if you're careful. Each hook is very heavy duty and consequently two of them together at the end of a ladder makes it difficult to place on a roof peak. I returned them to the seller and was charged a 20% restocking fee, just so you know.",
      "rating": 3.0,
      "verified": true,
      "author": "robosolo",
      "helpful_votes": 10,
      "publication_date": 20180911
    },
    {
      "title": "Heavy duty and perfect for metal roof.",
      "text": "I have a 12/12 pitch roof. These hooks are great. You can use together or separate. Very sturdy. Awesome",
      "rating": 5.0,
      "verified": true,
      "author": "MWells10EC",
      "helpful_votes": 10,
      "publication_date": 20190222
    },
    {
      "title": "A Waste of Money",
      "text": "Will work on a roof with no ridge vent. Otherwise, the hook grabs into the opposite side of the ridge vent. Pretty much useless since most roofs have a ridge vent. Now i have to figure out how I am going to get to the top of roof with a 38 degree pitch to repair the vent.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 12,
      "publication_date": 20180825
    },
    {
      "title": "Works as discribed",
      "text": "Got the job done. Some notes however are that it is only a wing nut that holds the bracket that clamps on to your ladder in place. And, the bracket does keep the ladder hook attached to your ladder but it does not keep the hook from sliding side to side. So, with two hooks attached to the ladder they would not stay spread apart on the ladder. They would slide together.",
      "rating": 4.0,
      "verified": true,
      "author": "Charles Parker",
      "helpful_votes": 7,
      "publication_date": 20190226
    },
    {
      "title": "Poor craftsmanship",
      "text": "Ok, so for the price this isn't exactly what I expected coming right out of the box. I know it's just a reinforcement piece but for fall protection the welds should be much more professional. And, clean up the weld afterwards so it doesn't arrive already rusted.",
      "rating": 1.0,
      "verified": true,
      "author": "Christine",
      "helpful_votes": 8,
      "publication_date": 20190320
    },
    {
      "title": "A Well Constructed (But Heavy) Product.",
      "text": "I've encountered \"pros\" and \"cons\" in using these ladder hooks. The \"pros\" are that the hooks are extremely well constructed and roll easily up the roof of my house. The \"cons\" are associated with their total weight due to the heavy construction. They actually make the ladder quite top-heavy. Also, no matter how hard I tightened them, they slid from side-to-side when rolling them up the ridge of the roof. I had to actually wire tie them to sides of the ladder to prevent this from happening.",
      "rating": 4.0,
      "verified": true,
      "author": "Michael J. Lederer",
      "helpful_votes": 4,
      "publication_date": 20190902
    },
    {
      "title": "Solid Made!!! BUT, the wing nuts don't feel secure enough.",
      "text": "They work and feel solid/well made. My only complaint is that the wing nuts don't feel like they keep it secure enough. With weight it seems to be fine, but mentally I had to get over that I didn't feel as safe as I could have. If I bought it again and on the one I have I may replace the wing nuts with something else.",
      "rating": 3.0,
      "verified": true,
      "author": "Brian",
      "helpful_votes": 3,
      "publication_date": 20191127
    },
    {
      "title": "NOT a solid attachment to ladder rungs",
      "text": "While it is a heavy duty hook the attachment to the ladder is not good. Does not adjust enough and not solid enough so the hook(s) just flop around and it impossible to use the wheels as a result. It is just a wing nut to tighten it up and does not allow you to get the holding bracket down to the ladder rung so it is not tight. Not impressed at all. Would not buy them again.",
      "rating": 1.0,
      "verified": true,
      "author": "Handyman by hobby",
      "helpful_votes": 0,
      "publication_date": 20201016
    },
    {
      "title": "Do not buy",
      "text": "Do not buy this equipment as it is not made for professional use. I would have uploaded a video if I could but I took a video of it as I had it set on a roof and the rubber pieces on the end started spinning on their own and walking off of the peak. This could have resulted in a fatal accident",
      "rating": 1.0,
      "verified": true,
      "author": "Michael Cavanaugh",
      "helpful_votes": 0,
      "publication_date": 20190905
    },
    {
      "title": "Not As Good As Described",
      "text": "This product was overrated in their description. The wing nuts that are suppose to hold them together were horrible and had to be reinforced. The bars move sideways and are not really sturdy as described. We were totally not satisfied after trying them. We have ordered so many items from Amazon and never had a problem. The seller never disclosed there would be a 20% restocking fee, so I paid out $13+ for nothing. The item didn't work as described. Very disappointed and disappointed for being charged for nothing!",
      "rating": 1.0,
      "verified": true,
      "author": "Colette Hassan",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "Safe and they work great.",
      "text": "Safety first especially on a metal 12,12 pitch roof. Our chummy came off in the snow. No one would go up there. So my husband bought these. He left the ladder up until he got it fixed at age 75. He felt safe with these.",
      "rating": 5.0,
      "verified": true,
      "author": "Tracy j. Foye",
      "helpful_votes": 0,
      "publication_date": 20200117
    },
    {
      "title": "Do your own roof and live to talk",
      "text": "Used to hang a ladder on a steep roof. I’m still alive so it worked. Clamp wanted to slip a lot during placement but doesn’t effect safety since it holds from underneath. Sturdy construction",
      "rating": 5.0,
      "verified": true,
      "author": "Supafrt",
      "helpful_votes": 0,
      "publication_date": 20190421
    },
    {
      "title": "Very sturdy.",
      "text": "Used these to secure ladder on a 12/12 pitched roof. Worked very well. A bit heavy but so am I. I thought the clamping system could have been designed better but we just wired them to the ladder rungs and all went well.",
      "rating": 5.0,
      "verified": true,
      "author": "phil",
      "helpful_votes": 0,
      "publication_date": 20190402
    },
    {
      "title": "Roof ridge ladder hooks",
      "text": "These ladder hooks are very durable and strong but heavy. When using a long ladder the added weight requires 2 people to place the ladder with hooks on the ridge. Ladder hooks made of aluminum would be easier to handle.",
      "rating": 4.0,
      "verified": true,
      "author": "Gerry Swecker",
      "helpful_votes": 0,
      "publication_date": 20180910
    },
    {
      "title": "Bad design, too heavy and awkward.",
      "text": "Thought the product was not designed well. I had to make several alterations to get them to securely fit. They are very heavy and a bit strenuous to put on roof. They need to be designed lighter and a better way to safely secure them to the rungs of the ladder. I almost sent these back. I would not recommend these to anyone. There has to be a better and lighter design.",
      "rating": 2.0,
      "verified": true,
      "author": "James T.  Childs",
      "helpful_votes": 0,
      "publication_date": 20190602
    },
    {
      "title": "High quality",
      "text": "Solidly built ( also quite heavy ). My only suggestion when using would be to tighten wing nuts with vise grips or something similar. Hand tightening might not be enough",
      "rating": 5.0,
      "verified": true,
      "author": "Paul M.",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "does its job in a great way.",
      "text": "not light but not a minus for a device you want to be sturdy and solidly footed. the wheels could be bigger or made of another material (softer to not mark the shingles) but for the price they work how they are supposed to work.",
      "rating": 5.0,
      "verified": true,
      "author": "MO",
      "helpful_votes": 0,
      "publication_date": 20181128
    },
    {
      "title": "The best solution for my project",
      "text": "Didn't know this kind of product existed. It was the best inexpensive solution ro help me kn a steep cape cod roof i recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200802
    },
    {
      "title": "ladder hook",
      "text": "it installs easy it works great but they're a bit heavy , once its hooked to the peek of the roof its a very safe tool !",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190819
    },
    {
      "title": "Didn't arrive in time for my need, but ...",
      "text": "Very sturdy and well made. I have confidence they will work when I need them next time.",
      "rating": 5.0,
      "verified": true,
      "author": "Rough Rider",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "Loose fit",
      "text": "These ladder hooks are well built and heavy duty. However, the do not attach snugly to the ladder rungs.",
      "rating": 4.0,
      "verified": true,
      "author": "JG",
      "helpful_votes": 0,
      "publication_date": 20181227
    },
    {
      "title": "Very sturdy!",
      "text": "Other reviewers said they use two of these per ladder. After using them, I would without a doubt trust climbing up a ladder on a roof with one of these hooked over the ridge, in fact I did, with no concern. They are very heavy duty!",
      "rating": 5.0,
      "verified": true,
      "author": "John H",
      "helpful_votes": 0,
      "publication_date": 20191219
    },
    {
      "title": "Very Satisfied With The Ladder Hooks!!! Better than Expected!!!",
      "text": "Haven't been able to use them yet, because of the weather here. But they seem to be rugged and sturdy enough for me to get the job done. Looking forward to using them when the snow and ice clear off of the roof. I was very surprised at how well built they are. And to be able to make a single purchase for a package of 2, for the price, was a Win, Win for me!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Brenda Curtis",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "Good",
      "text": "Little heavy to handle hanging on end of ladder but saved a possibility of ambulance ride.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "must have",
      "text": "Works great on steep roofs. easy to install. rollers are great",
      "rating": 5.0,
      "verified": true,
      "author": "russel g watson",
      "helpful_votes": 0,
      "publication_date": 20200512
    },
    {
      "title": "Item is a must have for metal roof work.",
      "text": "A must have for metal roof access. Good item. I like the design on the front bare that presses on the roof surface.",
      "rating": 5.0,
      "verified": true,
      "author": "Steven L. Lantry",
      "helpful_votes": 0,
      "publication_date": 20181109
    },
    {
      "title": "Safe and sane product",
      "text": "Luv it having been a roofer it is a great safety product",
      "rating": 4.0,
      "verified": true,
      "author": "Darrell Ivie",
      "helpful_votes": 0,
      "publication_date": 20190502
    },
    {
      "title": "Fair",
      "text": "The brace to attach to the ladder is to wide for my ladder and slides ariund",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200804
    },
    {
      "title": "product does not fit ladder",
      "text": "product does not fit on ladders properly cannot use at all",
      "rating": 1.0,
      "verified": true,
      "author": "Michael J Ryley",
      "helpful_votes": 0,
      "publication_date": 20200927
    },
    {
      "title": "They worked really well..",
      "text": "They worked really well ..My only suggestion would be is that the slide attachment with the wheel was at 90 degrees instead of an angle so it would fasten tighter against the ladder rungs",
      "rating": 5.0,
      "verified": true,
      "author": "Raymond R Corlew",
      "helpful_votes": 0,
      "publication_date": 20170729
    },
    {
      "title": "Good product with improvement needed",
      "text": "These are sturdy ladder hooks but the wheels still move around even with the wing nuts fastened tightly and it scared us while trying to maneuver it on the roof. We used gorilla tape to hold the wheels stationery. My suggestion is that the wheels be soldered so they cannot move around.",
      "rating": 4.0,
      "verified": true,
      "author": "CGA",
      "helpful_votes": 3,
      "publication_date": 20180511
    },
    {
      "title": "Very sturdy for use on ridge of house",
      "text": "Heavy duty. Very sturdy for use on ridge of house.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171105
    }
  ],
  "product_meta": {
    "title": "Tie Down Engineering Roof Zone 65005 Ladder Hook with Wheel Roof Ridge Extension (Pack of 2)",
    "description": "Item Package Quantity:2Quickly and safely access steep roofs. Attaches to the top two rungs of any ladder or extension ladder. Simply roll/slide the ladder past the roof peak and turn over, the hook secures to the opposite side of the roof peak.",
    "rating": 4.4,
    "feature_bullets": [
      "Rubber Grip T-bar to prevent damage to shingles and metal roofs",
      "Yellow Zinc plated steel for longer life",
      "2 ladder hooks are recommended for each ladder (this Kit includes 2 hooks)",
      "INCLUDES: 2 Ladder Hooks with Wheel"
    ],
    "specifications": {
      "Manufacturer": "Tie Down Engineering",
      "Part Number": "65005",
      "Item Weight": "13.62 pounds",
      "Package Dimensions": "27 x 11.5 x 8.5 inches",
      "Is Discontinued By Manufacturer": "No",
      "Item Package Quantity": "2",
      "Certification": "",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "ASIN": "B015NC9QF4",
      "Customer Reviews": "4.4 out of 5 stars116 ratings4.4 out of 5 stars",
      "Best Sellers Rank": "#40,152 in Tools & Home Improvement",
      "Date First Available": "September 21, 2015"
    },
    "categories": [
      "Tools & Home Improvement",
      "Accessories",
      "Ladders",
      "Building Supplies"
    ],
    "price": 84.0
  }
}