{
  "website_summaries": [
    {
      "verdict": "With an extra face plate for optional double-sided use and fire-resistant plastic exterior, this energy-efficient model gets top marks for its combination of safety features and functionality.",
      "pros": [
        "Option to use a double-sided face is a nice benefit for users who may have people exiting a building from multiple sides",
        "Plastic is fire-resistant",
        "Bright headlights and the exit sign itself can run on battery backup if the power goes out",
        "Initial assembly and setup is easy to accomplish",
        "Unit consumes an efficient 2 watts when in operation"
      ],
      "cons": [
        "For those who play music through FM radio in a business environment, this unit may interfere with their signal"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Exit Sign",
      "text": "These are easy to install, and quite bright. I'd give it more stars, but it generates a serious amount of radio interference, especially around 100 MHz which is in the middle of the FM band. A favorite radio station on 100.3 was very listenable before installing these exit signs, but now it is impossible to receive. If I turn of the power to the exit signs, the reception is fine. They also seem to wreak havoc on the AM radio band as well. This \"feature\" is not exclusive to this particular brand of sign. I've discovered that most LED exit signs do the same thing, including some that cost a LOT more money.",
      "rating": 3.0,
      "verified": true,
      "author": "chuxgarage",
      "helpful_votes": 8,
      "publication_date": 20160710
    },
    {
      "title": "An exact replacement",
      "text": "This was a replacement for a unit that had quit working at our Church building. It was easy to replace, and it is working fine. There were enough options included that it could have worked in several different places, making it very versatile.",
      "rating": 5.0,
      "verified": true,
      "author": "Ron J",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Flexible install options.",
      "text": "I installed two of these at Church today. The installations were easy. I hung one from the ceiling and one for the side of the sign to a wall. There are other options. I have ordered three more and will installed them next week.",
      "rating": 5.0,
      "verified": true,
      "author": "BobRip",
      "helpful_votes": 3,
      "publication_date": 20160614
    },
    {
      "title": "Huge Savings",
      "text": "Needed to replace one in a store, locally they were $90! This was exactly the same as what I took down. Easy install (you will need to drill out the holes and opening to match your old one) works great.",
      "rating": 5.0,
      "verified": true,
      "author": "Blewzman",
      "helpful_votes": 0,
      "publication_date": 20170502
    },
    {
      "title": "Functions well as emergency exit light at econominical price",
      "text": "An efficient ni-cd backup battery operated emergency/exit light fixture. Instructions packaged inside front cover. Cannot remove rear cover without opening front cover and releasing internal taps. Important to remember to connect battery plug (shipped unconnected) before completing installation.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191124
    },
    {
      "title": "Good price, easy to install",
      "text": "Good price, easy to install. The first one purchased was broken, that was returned and replaced. The replacement installed easily and works fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Lockdown",
      "helpful_votes": 0,
      "publication_date": 20180622
    },
    {
      "title": "Good product.",
      "text": "Great product. The lighting is excellent for a stairwell, where we use it. And to be able to aim the lights is a real plus. The only issue is that the screws provided do not fit a standard box, so I had to use the ones that were in the old exit sign.",
      "rating": 5.0,
      "verified": true,
      "author": "jOHN o.",
      "helpful_votes": 0,
      "publication_date": 20161209
    },
    {
      "title": "Very nice and great price1",
      "text": "I got 5 of these for my business. They were easy to hook up, are very bright and have new LED technology! Lots of mounting options and had the option tomake it a two faces sign. Would buy again if i needed more.",
      "rating": 5.0,
      "verified": true,
      "author": "Chad Miller",
      "helpful_votes": 0,
      "publication_date": 20170228
    },
    {
      "title": "Great light at a great price!!!",
      "text": "Great light. Easy to install and the battery was even charged. Don't forget to plug the battery in like I did. Lights are bright and can be adjusted to aim almost anywhere.",
      "rating": 5.0,
      "verified": true,
      "author": "Andy Potter",
      "helpful_votes": 0,
      "publication_date": 20180205
    },
    {
      "title": "The back-up light doesn't work while push the test button ...",
      "text": "The back-up light doesn't work while push the test button. The battery inside also has a label that say the battery need to be replaced next year. Returned and purchased a different one.",
      "rating": 1.0,
      "verified": true,
      "author": "Maureen Leung",
      "helpful_votes": 2,
      "publication_date": 20170606
    },
    {
      "title": "Well made and easy to install",
      "text": "Easy to install and well made. We were able to replace the existing light in just a few minutes.",
      "rating": 5.0,
      "verified": true,
      "author": "Laura Anne",
      "helpful_votes": 0,
      "publication_date": 20180424
    },
    {
      "title": "An improvement over regular exit signs. The extra lights ...",
      "text": "An improvement over regular exit signs. The extra lights illuminate the area, and the word \"EXIT\" stays lit up even when power goes out",
      "rating": 5.0,
      "verified": true,
      "author": "Fred",
      "helpful_votes": 0,
      "publication_date": 20171127
    },
    {
      "title": "Two Stars",
      "text": "I don't know works good or not. it has arrived broken parts an I returned",
      "rating": 2.0,
      "verified": true,
      "author": "Emily ",
      "helpful_votes": 0,
      "publication_date": 20180720
    },
    {
      "title": "Better Then Expected!",
      "text": "A great deal. Bought these to replace a defective one at our facility, and they are a better quality than the ones that were installed. Bigger battery for the back-up lights too. Really nice.",
      "rating": 5.0,
      "verified": true,
      "author": "Josh Anderson",
      "helpful_votes": 0,
      "publication_date": 20160823
    },
    {
      "title": "One Star",
      "text": "Could not get either of them to light after initial installation",
      "rating": 1.0,
      "verified": true,
      "author": "James L. Shaw",
      "helpful_votes": 3,
      "publication_date": 20160421
    },
    {
      "title": "My husband said it was easy to installed and it passes the inspection",
      "text": "This is the second ones I bought for my business. My husband said it was easy to installed and it passes the inspection.",
      "rating": 5.0,
      "verified": true,
      "author": "Margaret Hudson",
      "helpful_votes": 0,
      "publication_date": 20180509
    },
    {
      "title": "Good product. No issues.",
      "text": "Easy install. Good quality product. Excellent replacement option or for new buildouts. Remember to read the instructions and plug in the battery after wiring up.",
      "rating": 5.0,
      "verified": true,
      "author": "HM",
      "helpful_votes": 0,
      "publication_date": 20160818
    },
    {
      "title": "Much better quality than what I could find at Lowes",
      "text": "Bought 3 of these for our church sanctuary. Much better quality than what I could find at Lowes.",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony Chester",
      "helpful_votes": 0,
      "publication_date": 20171223
    },
    {
      "title": "remember to plug in battery",
      "text": "It works good, just need to remember to plug in the battery. There is no paper instruction or label to tell you to plug it in.",
      "rating": 5.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20170116
    },
    {
      "title": "Five Stars",
      "text": "Smaller than what was before it and does the job.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180319
    },
    {
      "title": "Perfect!",
      "text": "Very pleased ! Red exit light is very bright. Led emergency lights are bright as wel! Nice product. Easy to install.",
      "rating": 5.0,
      "verified": true,
      "author": "John McNulty",
      "helpful_votes": 0,
      "publication_date": 20170514
    },
    {
      "title": "Good buy and fast!",
      "text": "Surprisingly good - A fraction of what they cost locally!",
      "rating": 5.0,
      "verified": true,
      "author": "Chipster",
      "helpful_votes": 0,
      "publication_date": 20180310
    },
    {
      "title": "I have installed one and am very pleased with it",
      "text": "I ordered two lights. I have installed one and am very pleased with it! I now have both installed and have ordered a third. They work extremely well and I'm very pleased!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Dana",
      "helpful_votes": 0,
      "publication_date": 20160409
    },
    {
      "title": "nice that it gives you a 277V option",
      "text": "Replaced some ancient broke down exit signs in our warehouse, nice that it gives you a 277V option. The knockouts are a little tough but I just dremeled out the holes I needed. Whole replacement job took 10 minutes.",
      "rating": 5.0,
      "verified": true,
      "author": "Nick",
      "helpful_votes": 0,
      "publication_date": 20160824
    },
    {
      "title": "Good price good product",
      "text": "Install them on a commercial building but I was working on and they work perfect",
      "rating": 5.0,
      "verified": true,
      "author": "Awesome Dad",
      "helpful_votes": 0,
      "publication_date": 20170413
    },
    {
      "title": "Five Stars",
      "text": "Good work and easy setup. every tool is on the package. bright light. recharge battery also good",
      "rating": 5.0,
      "verified": true,
      "author": "Biba",
      "helpful_votes": 0,
      "publication_date": 20160818
    },
    {
      "title": "Five Stars",
      "text": "Had to replace an outdated sign to pass a fire marshall inspection. Well done.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin Lowry",
      "helpful_votes": 0,
      "publication_date": 20160916
    },
    {
      "title": "Bright, Easy, and Inexpensive",
      "text": "Easy to install. Nice and bright. Much lower cost than the local big box store.",
      "rating": 5.0,
      "verified": true,
      "author": "Keyboard Ray",
      "helpful_votes": 0,
      "publication_date": 20160408
    },
    {
      "title": "Instructions are iffy. I was not sure what a ...",
      "text": "Instructions are iffy. I was not sure what a J-box is. It does not tell to plug in the battery in the wall mount instructions.",
      "rating": 4.0,
      "verified": true,
      "author": "Lawrence D. Meston",
      "helpful_votes": 0,
      "publication_date": 20170410
    },
    {
      "title": "Good value",
      "text": "Good! Knockouts punched through quite easily making for a very quick installation.",
      "rating": 5.0,
      "verified": true,
      "author": "lifeid",
      "helpful_votes": 0,
      "publication_date": 20151030
    },
    {
      "title": "Four Stars",
      "text": "Works great but basically no instructions make sure you plug the wires from the batteries into harness",
      "rating": 4.0,
      "verified": true,
      "author": "dan graham",
      "helpful_votes": 0,
      "publication_date": 20171218
    },
    {
      "title": "Good Light",
      "text": "These lights did the job, and cost a fraction of what I could get locally.",
      "rating": 5.0,
      "verified": true,
      "author": "Dustin Meyers",
      "helpful_votes": 0,
      "publication_date": 20170214
    },
    {
      "title": "Five Stars",
      "text": "Works great, EXIT portion remains lit along with emergency lights during power outage!",
      "rating": 5.0,
      "verified": true,
      "author": "Ernest O.",
      "helpful_votes": 0,
      "publication_date": 20180428
    },
    {
      "title": "Five Stars",
      "text": "easy to mount and it was priced $60.00 below Lowes and Home depot. Glad i check out amazon.",
      "rating": 5.0,
      "verified": true,
      "author": "Papaw",
      "helpful_votes": 0,
      "publication_date": 20160330
    },
    {
      "title": "Five Stars",
      "text": "The best purchase I've made in the last few years. Works great!",
      "rating": 5.0,
      "verified": true,
      "author": "kim clark",
      "helpful_votes": 0,
      "publication_date": 20180516
    },
    {
      "title": "They are perfect for our emergency exits",
      "text": "Ordering seven more of these. They are perfect for our emergency exits.",
      "rating": 5.0,
      "verified": true,
      "author": "Alan",
      "helpful_votes": 0,
      "publication_date": 20161214
    },
    {
      "title": "Five Stars",
      "text": "Good value Commercial Quaility and recieved it in one day free shipping",
      "rating": 5.0,
      "verified": true,
      "author": "William Clink",
      "helpful_votes": 0,
      "publication_date": 20170209
    },
    {
      "title": "Bad Product Description--Not Remote Capable",
      "text": "The specifications say these are REMOTE CAPABLE, which is what I needed. The instruction sheet shows where to find the jack to plug in the remote lights on the circuit board, but the only problem is -- there is only a printed image of a jack, but no jack. THESE ARE NOT REMOTE CAPABLE!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20160518
    },
    {
      "title": "Looks great, reasonable price",
      "text": "Looks great, reasonable price. Aren't as bright as previous styles I've had. Saves money and since its for that once every couple years so doesn't matter",
      "rating": 5.0,
      "verified": true,
      "author": "Tyler Jandrey",
      "helpful_votes": 0,
      "publication_date": 20170117
    },
    {
      "title": "Great Exit Sign",
      "text": "Great exit sign for the price. Installed a month ago working great and brighter then the signs I replaced.",
      "rating": 4.0,
      "verified": true,
      "author": "Tim Sidorski",
      "helpful_votes": 0,
      "publication_date": 20160725
    },
    {
      "title": "Five Stars",
      "text": "Great led exit sign with lights. Worked great and was easy to install.",
      "rating": 5.0,
      "verified": true,
      "author": "Aleesha",
      "helpful_votes": 0,
      "publication_date": 20160831
    },
    {
      "title": "One Star",
      "text": "We went to use these had an electrician put on a cord and neither one of them worked.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160621
    },
    {
      "title": "Five Stars",
      "text": "Great buy. Maybe not for industrial use but great for office or, in my case, church.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Free",
      "helpful_votes": 0,
      "publication_date": 20160724
    },
    {
      "title": "They work great in our nursery",
      "text": "The lights installed very easy and work great in our church nursery",
      "rating": 5.0,
      "verified": true,
      "author": "Gregg Nash",
      "helpful_votes": 0,
      "publication_date": 20161106
    },
    {
      "title": "Easy installation",
      "text": "Lights were easy to install and were exactly what I had wanted.",
      "rating": 5.0,
      "verified": true,
      "author": "Jerod",
      "helpful_votes": 0,
      "publication_date": 20160826
    },
    {
      "title": "P.O.S.",
      "text": "Broken unit showed up looks good but did not work at all",
      "rating": 1.0,
      "verified": true,
      "author": "jon peavey",
      "helpful_votes": 0,
      "publication_date": 20160713
    },
    {
      "title": "... got these installed yesterday but they look and work great.",
      "text": "Just got these installed yesterday but they look and work great.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Miller",
      "helpful_votes": 0,
      "publication_date": 20170709
    }
  ],
  "product_meta": {
    "title": "Sunco Lighting Double Sided LED Emergency EXIT Sign, Two LED Flood Lights, Backup Battery, US Standard Red Letter Emergency Exit Lighting, Commercial Grade, 120-277V, Fire Resistant (UL 94V-0)",
    "rating": 4.5,
    "feature_bullets": [
      "Top Rated Red Double Sided Emergency Exit Sign with Adjustable Flood Lights",
      "✅ SAFETY FIRST - The exit sign has bright adjustable (360 degrees) floodlights on each side of the sign for maximum visibility. US standard red 6\" high letters with 3/4\" stroke are visible from up to 100 feet away. In case of a power outage, the backup battery automatically illuminates (90 minutes) the fixture and light the way to safety.",
      "✅ DUAL MOUNTING - Sunco's LED emergency exit sign includes an extra face plate to convert the fixture from single-sided to double-sided. For single-sided install, mount on the back or top of the fixture. For double-sided install, mount to the ceiling on the top of the fixture. Mounting equipment is included inside of the fixture.",
      "✅ COMMERCIAL GRADE - Our emergency exit sign is built to fit your safety needs from offices, schools, retail spaces and everything in between. Specifications: 120-277V, Test Switch, Backup Battery, ABS Fire Resistant Plastic, Double Sided, Dual Mounting. Certifications: UL Listed.",
      "✅ SUNCO BENEFITS - 3-Year Warranty! We uphold the highest standards for all our products by testing each product for optimal performance and safety. Sunco is proudly based in the USA, offering quality products at affordable prices backed by knowledgeable support specialists."
    ],
    "specifications": {
      "Manufacturer": "Sunco Lighting",
      "Part Number": "JLEC2RW",
      "Item Weight": "4.37 pounds",
      "Product Dimensions": "20 x 8.6 x 2.8 inches",
      "Is Discontinued By Manufacturer": "No",
      "Size": "1 Pack",
      "Color": "Red",
      "Material": "Plastic",
      "Voltage": "120 Volts",
      "Wattage": "2.00",
      "Item Package Quantity": "1",
      "Type of Bulb": "LED",
      "Special Features": "Shatter resistant, Backup Battery, Instant On, Fire Resistant",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "ASIN": "B015YG3O7U",
      "Customer Reviews": "4.5 out of 5 stars139 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#362,678 in Tools & Home Improvement",
      "Date First Available": "September 29, 2015"
    },
    "categories": [
      "Lighting & Ceiling Fans",
      "Tools & Home Improvement",
      "Lighted Exit Signs",
      "Commercial Lighting"
    ],
    "price": ""
  }
}