{
  "website_summaries": [
    {
      "verdict": "A sturdy fire screen with a nice touch of ornate decoration and quality build.",
      "pros": [
        "An aesthetically pleasing fire screen with an attractive leaf design",
        "Users appreciate that it arrives fully assembled and can be used straight from the box",
        "Sturdy feet and quality build mean you don't have to worry about safety"
      ],
      "cons": [
        "The hinges can stick after a few uses"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "VERY happy with this screen",
      "text": "VERY happy with this screen. Love the beautiful leaf detail. Very well made. Got the idea from another reviewer here about drilling it in to keep the littles ones out. Instead of drilling directly into the screen we used these screws with bands( from Home Depot) to keep pinned in. We also used cable ties for the corners to keep it from swaying back and forth from our little 1 year old shaker. This isn't budging.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 14,
      "publication_date": 20170923
    },
    {
      "title": "This screen is attractive, no assembly required and saves you money",
      "text": "The fireplace screen arrived boxed and as a single unit with two “wings” attached. All you have to do is take the screen out of the box and open the two two wings (which are attached to the centerpiece) to fit your fireplace opening— super simple! No tools, no assembly required — just open the box and set it up. The screen adds a nice depth to the face of the fireplace and “disappears” when you start a fire. This screen is a great bargain for the price and was listed on one website as a top ten item based upon quality of workmanship, appearance and price. I believe it has ea4ned that distinction across the board.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 9,
      "publication_date": 20171109
    },
    {
      "title": "I needed something to fit well as she is a great jumper and will open cupboards and other things with ...",
      "text": "I brought because I have a 2 year old cat who is into everything and loves to play in our open gas fireplace. I needed something to fit well as she is a great jumper and will open cupboards and other things with her paws! I needed to be able to move it to light the fire and wanted something with a bit of detail but still have a good view of the fire. Was worried this would be too tall but it's perfect. No room for her to jump over heavy enough she can't move it easily but I can and looks great with the rest of the room. Very happy and no more dirty foot prints, Yay 😄",
      "rating": 5.0,
      "verified": true,
      "author": "Katrina Clarke",
      "helpful_votes": 18,
      "publication_date": 20160907
    },
    {
      "title": "Really like this screen.",
      "text": "We had an old screen in a gold tone that was an insert ,hated it! We cleaned our fireplace and started looking for a new screen. We did not want anything to fancy and this screen is just right.",
      "rating": 5.0,
      "verified": true,
      "author": "Teresa Wyatt-Trujillo",
      "helpful_votes": 10,
      "publication_date": 20171203
    },
    {
      "title": "Pretty, but not very stable.",
      "text": "I got this to make sure pops from the fireplace were adequately stopped. The mesh is small gauge (much smaller than the chainmail screen on my fireplace), and it's pretty. HOWEVER, one of the end pieces doesn't touch the floor. It seings freely. For the money, it suits my purposes, since I have nothing that is actively trying to mess with it. If you're getting this to put up a barricade that isn't easily knocked over by pets, kids, etc - keep looking.",
      "rating": 3.0,
      "verified": true,
      "author": "danaz",
      "helpful_votes": 3,
      "publication_date": 20190118
    },
    {
      "title": "Exactly what we were looking for.",
      "text": "We recently converted our wood-burning fireplace to gas. The glass doors we installed must be open when the fireplace is in use. We bought the Amagabeli 3 Panel Pewter Wrought Iron Fireplace Screen to keep our grandchildren (ages 3, 1.5 and 7 months) away from the fireplace. To add stability, we used four strong magnets to attach the screen to the fireplace doors. We could not be happier with how this worked. We were able to enjoy our fireplace at Thanksgiving without having to worry about our grandchildren getting too close.",
      "rating": 5.0,
      "verified": true,
      "author": "MPS24",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Keeps the cats out and looks beautiful",
      "text": "We bought this cover to keep the cats out of the fireplace. Wanted something to fit in our 1930’s home. Looks great. The cats only knocked it down once and that was enough for them. Heavy enough to keep them out and beautiful too.",
      "rating": 5.0,
      "verified": true,
      "author": "KellyCatLady",
      "helpful_votes": 2,
      "publication_date": 20191116
    },
    {
      "title": "A Beautiful Fireplace Protector!",
      "text": "I like the silver color, and the beautiful leaves decoration at the top of the screen. I think it makes my fireplace look better and it's safer for my pets. My cat once jumped into the lit fireplace and she's not able to get close to it with this screen. I love it. I also think it looks more expensive than it was.",
      "rating": 5.0,
      "verified": true,
      "author": "Carole Lawrence",
      "helpful_votes": 0,
      "publication_date": 20200128
    },
    {
      "title": "Decent, does what it's meant to do",
      "text": "This does what it's supposed to do. We bought this to go in front of our pellet stove and slow down a fall by one of our children if they were to trip and fall into the stove which they have and they have been prevented from getting burned. Impressively the backside nearest the fire gets hot but the frontside stays cool enough not to burn anyone even if the kids lean up against it. It is aesthetically pleasing to look at it as well. My only problem with it is that it's not even across the bottom so one side always wants to swing shut but it's not the end of the world.",
      "rating": 4.0,
      "verified": true,
      "author": "B Schultz",
      "helpful_votes": 0,
      "publication_date": 20200210
    },
    {
      "title": "Exactly what I needed",
      "text": "I ordered this product to protect my great-grandkids from touching my wood burning stove. They are fascinated by the fire. Works perfectly. I love the design. It is easy to set aside to put wood in the stove. It gets warm but never hot. I am very pleased with this product and would buy it again. Very sturdy and I can still see the flames through the panel.",
      "rating": 5.0,
      "verified": true,
      "author": "rizzo",
      "helpful_votes": 0,
      "publication_date": 20181015
    },
    {
      "title": "Beouti-fulllll FPlace Screen",
      "text": "Simply beautiful ... can’t beat the price and sturdiness of this FPlace Screen! The Pewter is awesome which matches well with my Walls, but the fireplace is tiled Cream ... nothing wrong with a little colour right! I adore it and I am not into using a FPlace, didn’t grow up with one. I have shopped around on Amazon, endless selections ... delivery was on time and it was well packaged.",
      "rating": 5.0,
      "verified": true,
      "author": "Myra MLH",
      "helpful_votes": 0,
      "publication_date": 20190622
    },
    {
      "title": "this screen fits and balances well",
      "text": "this screen fits and balances well. Its easy to fold up and move one handed when also holding wood in the other. It doesn't get too hot even with a very hot fire.The mesh holds back all but the finest sparks and those go out before hitting the floor. Well done for the price and attractive.....",
      "rating": 4.0,
      "verified": true,
      "author": "bitbob",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "Please be aware",
      "text": "This product looks great appearance wise. However it didn't work for us and we had to return right away. The panels swivels side to side when placed in front of the fire place and the gaps between the panels can pinch a finger. Almost had my baby's finger pinched while testing it shortly after we received it. I think this problem may not appear if you have a rough type of flooring where you will put the gate.",
      "rating": 1.0,
      "verified": true,
      "author": "JK",
      "helpful_votes": 3,
      "publication_date": 20170301
    },
    {
      "title": "Beautiful screen!",
      "text": "I bought this to replace a cheaper folding fire screen that was well past its prime. This one looks beautiful and really updates the look of my fireplace. The only reason I gave it four stars instead of five is that I wish it folded in the middle too (quad-fold, I guess). I have to pull it completely back to add a log onto the fire. But otherwise, it's great.",
      "rating": 4.0,
      "verified": true,
      "author": "Kimberly",
      "helpful_votes": 0,
      "publication_date": 20180723
    },
    {
      "title": "I love this fireplace screen!",
      "text": "I've been looking for a pewter fireplace screen. This is the exact kind that I envisioned would look good at my fireplace. I love it against the white brick fireplace. This completes my living room, I love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Alex Lang",
      "helpful_votes": 0,
      "publication_date": 20200910
    },
    {
      "title": "Exactly what I wanted",
      "text": "Have had and used through a season and love it. Design, sturdiness, keeps cat out of fireplace and can see the fire. Would definitely recommend. Probably not sturdy enough to keep large dog or small kids out.",
      "rating": 5.0,
      "verified": true,
      "author": "Bg",
      "helpful_votes": 0,
      "publication_date": 20200920
    },
    {
      "title": "Beautiful and affordable!",
      "text": "I received many compliments on the screen. If I were nitpicking I would put a couple more coats of paint on it to my liking, otherwise it’s fine.",
      "rating": 5.0,
      "verified": true,
      "author": "J. C.",
      "helpful_votes": 0,
      "publication_date": 20200416
    },
    {
      "title": "Beautiful and worth the $",
      "text": "Beautiful, Had our other one for our Cabin since 1998. Was so tired of it and it broke, So I wanted a new one for Refreshing and a new look. It's Beautiful.... Thumbs up",
      "rating": 5.0,
      "verified": true,
      "author": "Shilo",
      "helpful_votes": 0,
      "publication_date": 20191201
    },
    {
      "title": "Beautiful addition to our fireplace!",
      "text": "Beautiful, well-made, sturdy and priced affordably! We love this fireplace screen! It gives added protection when our grandson comes to visit.",
      "rating": 5.0,
      "verified": true,
      "author": "Margaret Hammack",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "Seemed good",
      "text": "This gate seemed good. Unfortunatelly, it turned out to be too big for my fireplace base so it tilted over. I blame that on bad design of my fireplace though.",
      "rating": 4.0,
      "verified": true,
      "author": "G",
      "helpful_votes": 0,
      "publication_date": 20190928
    },
    {
      "title": "Exactly what I wanted",
      "text": "It fits all the requirements I wanted and needed. Looks so much more expensive than I paid and it adds beauty and finish to my fireplace. Would definitely recommend to others with my needs",
      "rating": 5.0,
      "verified": true,
      "author": "Lorraine Campanozzi",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "Very happy with it",
      "text": "I have an older home with a wood fireplace. This is perfect & looks nice. No issues with it over the winter",
      "rating": 5.0,
      "verified": true,
      "author": "L Lanham",
      "helpful_votes": 0,
      "publication_date": 20200401
    },
    {
      "title": "Attractive Addition",
      "text": "Seems sturdy & we like the metal design. Our dog, however noticed something new on hearth & ran from it!!",
      "rating": 5.0,
      "verified": true,
      "author": "J M B",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "Adds just the right touch to my fireplace",
      "text": "you can not get easier than taking it out of the box and put it in front of the fireplace. No tools required. I love the decorative top of the screen and it adds just the right touch to my living room.",
      "rating": 5.0,
      "verified": true,
      "author": "Darlene Stokes",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "Not sturdy.",
      "text": "We bought this based on all of the 5 star reviews saying how sturdy it is so a child can not move it. It is not sturdy at all, and I’m terribly afraid of it falling on and injuring one of my 9 month old twins. I will be returning this product unless I find some way to secure it to the fireplace and the ground to prevent it from tipping over with a gentle touch.",
      "rating": 1.0,
      "verified": true,
      "author": "Mario",
      "helpful_votes": 0,
      "publication_date": 20190314
    },
    {
      "title": "Awesome Value",
      "text": "Very nice! It looks great in front of my fireplace :) Very good quality and great quality :) Received it quickly and in perfect condition. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda M. Chute",
      "helpful_votes": 0,
      "publication_date": 20200620
    },
    {
      "title": "Attractive and very sturdy and thick",
      "text": "I was pleasantly surprised on the thickness and sturdiness of this screen since it was not too expensive. It looks very nice and it keeps my kitten out of our open brick fireplace!",
      "rating": 5.0,
      "verified": true,
      "author": "C.  Brown",
      "helpful_votes": 0,
      "publication_date": 20190318
    },
    {
      "title": "Good",
      "text": "Just needs a way to secure it to the fireplace so it won’t fall on the toddler. Otherwise if you don’t have a little this is perfect and beautiful",
      "rating": 5.0,
      "verified": true,
      "author": "Katlyn",
      "helpful_votes": 0,
      "publication_date": 20191213
    },
    {
      "title": "The fire screen is simple yet attractive",
      "text": "I haven't lit a fire yet, but I'm sure it will be fine. As to the comments about children getting their fingers caught in the hinge area, I can see that that is a risk, because the spaces are quite open. However, I don't have young children, so it isn't a problem for me.",
      "rating": 5.0,
      "verified": true,
      "author": "souptonuts",
      "helpful_votes": 0,
      "publication_date": 20181023
    },
    {
      "title": "Very nice",
      "text": "This is a great firescreen for the price. It is just as described. Received earlier than expected",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly",
      "helpful_votes": 0,
      "publication_date": 20200729
    },
    {
      "title": "Nice and sturdy",
      "text": "Nice looking and well built........just as good (and better looking) than some costing $50 more",
      "rating": 5.0,
      "verified": true,
      "author": "Grammy Pammy",
      "helpful_votes": 0,
      "publication_date": 20191220
    },
    {
      "title": "Elegant and Sturdy",
      "text": "Very attractive and well made fire screen. Adds elegance to any fireplace even with having to place it against the brick \"outside\" the open fireplace doors. Sturdy but not immovable. Does the job keeping the pets out of the fire and looks great doing it! Just wish it came in antique brass to match my fireplace doors...",
      "rating": 5.0,
      "verified": true,
      "author": "John Gabbert",
      "helpful_votes": 0,
      "publication_date": 20170122
    },
    {
      "title": "Naughty cats!",
      "text": "This screen is very attractive, and I like the way it looks. However, its main purpose is to keep my two white cats clean and out of the fireplace soot. They are very curious, but getting black soot all over them is not a pretty sight!",
      "rating": 5.0,
      "verified": true,
      "author": "EDF",
      "helpful_votes": 0,
      "publication_date": 20180704
    },
    {
      "title": "Beautiful screen",
      "text": "I was surprised at how nice thesis for the price. I looks lovely in front of my fireplace and the cats are now safe.",
      "rating": 5.0,
      "verified": true,
      "author": "CA Bookworm",
      "helpful_votes": 0,
      "publication_date": 20190819
    },
    {
      "title": "functional and stylish!",
      "text": "Works great, purchased this to keep the kid from touching the surface of our gas fireplace. it doesn't bolt down to the wall or anything, but when he messes with it, we can hear it, and get an early warning! it looks amazing too!",
      "rating": 5.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 0,
      "publication_date": 20170608
    },
    {
      "title": "Not sturdy",
      "text": "Very flimsy came broken and did not have enough time to return. Some my fault because of summer travels. But it was made weak at welds.",
      "rating": 1.0,
      "verified": true,
      "author": "christine",
      "helpful_votes": 0,
      "publication_date": 20190904
    },
    {
      "title": "It's ok for the money",
      "text": "The aesthetic is pretty good. The function is fine. But the decorative leafs on it snap off quite easily. The welds are definitely a tack weld not a tig.",
      "rating": 3.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 0,
      "publication_date": 20190608
    },
    {
      "title": "Quality Product that looks Good!",
      "text": "Very good quality product and wife really thought it looked great! My only disappointment was we bought mainly for keeping granddaughter from getting burned by gas fireplace. If will definitely help, but top railing still gets prdtty hot so will have to come up up with something to cover when she is visiting.",
      "rating": 5.0,
      "verified": true,
      "author": "True North",
      "helpful_votes": 0,
      "publication_date": 20171108
    },
    {
      "title": "NOT SAFE!!",
      "text": "Nice looking screen. Ornate. Solid metal. But the hindges are super flimsy. The screen WILL NOT stay still. So it really serves no purpose in safety to keep children away from the fire place insert as they can very easily push the screen in to get to the insert. Pretty dumb. Wish the hindges were super stiff or had a locking position",
      "rating": 1.0,
      "verified": true,
      "author": "Kevin C.",
      "helpful_votes": 0,
      "publication_date": 20190331
    },
    {
      "title": "Good quality fireplace screen",
      "text": "This fireplace screen has a good quality. It fits our fireplace very well and the size is perfect. The screen was exactly I was looking for and it is actually useful for opening fireplace. The color fits every fireplace and is very beautiful. I absolutely love it and would recommend to my friends.",
      "rating": 5.0,
      "verified": true,
      "author": "Y. Wei",
      "helpful_votes": 0,
      "publication_date": 20171208
    },
    {
      "title": "Like!",
      "text": "I love this fireplace screen. It is even nicer than pictured. Totally satisfied!",
      "rating": 5.0,
      "verified": true,
      "author": "HTC One Case Unhappy Customer",
      "helpful_votes": 0,
      "publication_date": 20200403
    },
    {
      "title": "Not very sturdy",
      "text": "This was too short and not sturdy enough. Nice design though",
      "rating": 3.0,
      "verified": true,
      "author": "Mimi M",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "Pretty, lightweight durable fire screen",
      "text": "Love.this fire screen. Fits in front of our fireplace perfectly. Have been using it for months now. Very durable. Easy light weight to move when building fire. Highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Jane Robinson",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Exactly what I was looking for and what I needed",
      "text": "This fireplace screen is extremely well made and is pretty too! Amazing to find something so well made for such a reasonable price. I highly recommend this item to anyone looking to purchase a fireplace screen!",
      "rating": 5.0,
      "verified": true,
      "author": "Sharon Cantville Williams",
      "helpful_votes": 0,
      "publication_date": 20191102
    },
    {
      "title": "Beautiful",
      "text": "I love this one it is giving a beautiful look as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "Made well",
      "text": "It fit, holds together well and is of a style that fits our home.",
      "rating": 5.0,
      "verified": true,
      "author": "William Peeples",
      "helpful_votes": 0,
      "publication_date": 20191213
    },
    {
      "title": "A Beautiful Reasonably Priced Screen",
      "text": "Terrific screen. The pewter color goes with everything. Heavy and well made ... stands firm on its own with no additional support or bracing register. Only the top portion is decorated leaving the screen unobstructed to see the flames. I couldn’t be happier with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Ronald Jones",
      "helpful_votes": 0,
      "publication_date": 20171017
    },
    {
      "title": "Happy with purchase",
      "text": "I am very pleased with this fireplace screen. It looks very good with my décor although it is more of a dark pewter and I was hoping it would be a little lighter. Looked at several and this was by far my favorite.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "Attractive but not sturdy enough for small children",
      "text": "Fireplace screen but it’s summer and no fires yet. It makes the fireplace look more attractive.",
      "rating": 5.0,
      "verified": true,
      "author": "Dr. C",
      "helpful_votes": 0,
      "publication_date": 20200820
    },
    {
      "title": "Perfect in every way, love it! Well made!",
      "text": "Perfect in every way! Protects kids & animals from getting too close to hot glass on gas fireplaces or to catch embers for wood burners. I bought 2 of them in different styles for different fireplaces. Well made, love them! Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "Sunny ",
      "helpful_votes": 0,
      "publication_date": 20180308
    },
    {
      "title": "Best purchase ever!!",
      "text": "Love this!! Nicely made and beautiful!! Enhanced the whole look of our living room!! Now the fireplace look matches the entire home decor. Couldn’t be more pleased",
      "rating": 5.0,
      "verified": true,
      "author": "bon2203",
      "helpful_votes": 0,
      "publication_date": 20190504
    },
    {
      "title": "Nice looking, great item!",
      "text": "Love this item, it looks nice, heavy, sturdy, looks very nice.",
      "rating": 5.0,
      "verified": true,
      "author": "Cynthia",
      "helpful_votes": 0,
      "publication_date": 20191118
    },
    {
      "title": "I love it inspite of the small hole upon delivery",
      "text": "I waited for the price to drop. I have a small hole punctured during delivery but otherwise I love it",
      "rating": 5.0,
      "verified": true,
      "author": "Sharon Lee Rosenhahn",
      "helpful_votes": 0,
      "publication_date": 20190220
    },
    {
      "title": "Awesome!",
      "text": "We had a baby gate surrounding the fireplace. It was large and gaudy, plus our resilient 20 month old was able to wiggle it just enough that the plastic hardware pieces that connect the sides of the gate together ALL broke. This is heavy enough that our son can't just push it or wiggle it free while lightweight enough to be easily moved by an adult. It also looks great with the rest of our decor!",
      "rating": 5.0,
      "verified": true,
      "author": "Dewey",
      "helpful_votes": 12,
      "publication_date": 20161001
    },
    {
      "title": "A little unsteady",
      "text": "With a toddler running around be careful it can fall easily because its top heavy. Super beautiful and well made piece though.",
      "rating": 5.0,
      "verified": true,
      "author": "Jayda Wise",
      "helpful_votes": 0,
      "publication_date": 20190218
    },
    {
      "title": "Nice decorative screen",
      "text": "I’m using this for a gas fireplace. Perfect for this application. Wouldn’t recommend if toddlers are around. Will easily fall over if pulled upon. Otherwise, I am very happy with the product.",
      "rating": 5.0,
      "verified": true,
      "author": "Dar R",
      "helpful_votes": 0,
      "publication_date": 20191103
    },
    {
      "title": "Stylish fireplace screen",
      "text": "Product arrived on time and in perfect condition. The screen and panels seem to be heavy duty and is a great value for the price. It is a dark pewter color and will go well with any room color.",
      "rating": 5.0,
      "verified": true,
      "author": "Chicago Reviewer",
      "helpful_votes": 0,
      "publication_date": 20161207
    },
    {
      "title": "This screen is so pretty and well made",
      "text": "This screen is so pretty and well made. I have a large dog who liked to poke his head into the fireplace, and this completely keeps him out. I haven't really used it yet, since the weather hasn't called for it, but the material makes me confident it will keep any fly aways in the fireplace.",
      "rating": 5.0,
      "verified": true,
      "author": "Yara",
      "helpful_votes": 0,
      "publication_date": 20161227
    },
    {
      "title": "Falling apart",
      "text": "The vines came loose within a few weeks. The screen was slowly falling apart. Now it's just as dangerous to have it up as it is to not have it up when my baby is running around. I've had my hand scratched just placing in front of my fiareplace",
      "rating": 2.0,
      "verified": true,
      "author": "Nicole Braden",
      "helpful_votes": 0,
      "publication_date": 20200117
    },
    {
      "title": "Nicely made",
      "text": "This fit perfect and is a nice weight. We thought the wrought iron part of the screen would be all black but it is silver with a hammered black texture.The screen is not completely see through on the front panel. The side panels are though. Even when it is dark out and there is no reflection from the sun it is still not totally see through. I suppose none of them are though. The front panel is not pulled completely taught. Which could be the reason it is not completely see through on the front. All in all we are happy with it.",
      "rating": 4.0,
      "verified": true,
      "author": "Shelly Anderson",
      "helpful_votes": 0,
      "publication_date": 20160912
    },
    {
      "title": "Love the design",
      "text": "Even more beautiful than online pictures. Love the design and it matches my decor perfectly. It came assembled and arrived in excellent packaging. I would buy this product again, but I only need one.",
      "rating": 5.0,
      "verified": true,
      "author": "Jamie H.",
      "helpful_votes": 0,
      "publication_date": 20180201
    },
    {
      "title": "A good purchase for the price",
      "text": "I bought this to protect a visiting toddler grandchild from my wood stove insert. It's quite attractive. I'm surprised. I also like the pewter, not as dark as black. It appears to be sturdy and provides a protective area to keep away a child or pet. Thanks for the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Zydeco Fan",
      "helpful_votes": 0,
      "publication_date": 20180919
    },
    {
      "title": "Looks nice and works",
      "text": "The only thing is, it could be heavier, because our infant son knocked it down and was buried under it. You can imagine the crying.",
      "rating": 4.0,
      "verified": true,
      "author": "Alexander Borgwardt",
      "helpful_votes": 0,
      "publication_date": 20180915
    },
    {
      "title": "Nicely crafted",
      "text": "I actually purchase this item to camouflage my 27\" Sony floor model TV. The product is a nice piece of furniture. It is also a good conversation starter.",
      "rating": 5.0,
      "verified": true,
      "author": "Miella Bedell",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "Amazon makes shopping easy for hard to find items",
      "text": "I like the style. The price was fantastic. Not really very much that I did not like. I just needs to stay at a certain position to stay firm but that is no issue. I'm just very happy I was able to buy this product from Amazon. Very convenient and hassle free. Thank You",
      "rating": 5.0,
      "verified": true,
      "author": "Rose sardina",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "Serves purpose I got it for",
      "text": "I don’t have a fireplace, got this to put around gas heater to keep grand children from getting burn.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191220
    },
    {
      "title": "great buy",
      "text": "Great buy, look expensive, but I purchased for a good price. My fireplace is oversized, so the gate didn't reach the top, but I still love it!!",
      "rating": 5.0,
      "verified": true,
      "author": "Doasm Memoir: VBJ",
      "helpful_votes": 0,
      "publication_date": 20180220
    },
    {
      "title": "Good for the price.",
      "text": "Fireplace screens can be spendy. I needed something to keep my new cat from climbing in the fireplace. This did the trick and was affordable. It is not super sturdy but adds a nice touch to our fireplace and keeps the cats out.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190420
    },
    {
      "title": "Works great in front of fireplace and looks good",
      "text": "It didn't work for what we needed but found another use for it.",
      "rating": 5.0,
      "verified": true,
      "author": "Jackie KElly",
      "helpful_votes": 0,
      "publication_date": 20190802
    },
    {
      "title": "Functional and sturdy",
      "text": "Is a beautiful addition to my living room. I bought this to keep my dachshund from sticking his nose in the fireplace. I did not realize how nice it would look there. I am very pleased with this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary",
      "helpful_votes": 0,
      "publication_date": 20190930
    },
    {
      "title": "very sturdy",
      "text": "Bought this to prevent my grandson from being able to touch the glass on our gas fireplace. The screen is the perfect option it is appealing to the eye and very sturdy. Love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Eileen H ",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Great value for your money$",
      "text": "Love it! Fits perfect on my fireplace and gives a nice home accent",
      "rating": 5.0,
      "verified": true,
      "author": "Cynthia L. Westfall",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "Well made.",
      "text": "Absolutely stunning as well as sturdy and everything you could expect for your fireplace. We love it and plan to order other matching accessories.",
      "rating": 5.0,
      "verified": true,
      "author": "pink 29",
      "helpful_votes": 0,
      "publication_date": 20171223
    },
    {
      "title": "Great buy great price",
      "text": "Bought this for my grandparents for a Christmas gift awesome product came as described they love it",
      "rating": 5.0,
      "verified": true,
      "author": "SAHmomofthree",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "Awesome",
      "text": "I bought this item because we do not have doors on our fireplace and our 1 year old granddaughter seems to think its ok to stick her hands in the fireplace. This looks awesome and I'm sure it will work awesome also.",
      "rating": 5.0,
      "verified": true,
      "author": "RHM",
      "helpful_votes": 0,
      "publication_date": 20190120
    },
    {
      "title": "Very classy look",
      "text": "These are beautiful I bought 2 and they really classed up the fireplace.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul M.",
      "helpful_votes": 0,
      "publication_date": 20190119
    },
    {
      "title": "It is beautiful and stylish",
      "text": "It is beautiful and stylish, very good quality. Sturdy, not flimsy. Have it displayed near fireplace now. I love it. Thank you for quality product. It is lovely.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathy",
      "helpful_votes": 0,
      "publication_date": 20180130
    },
    {
      "title": "Best Screen Ever",
      "text": "This is a beautiful and fully functioning screen for in front of the fireplace that was delivered as promised and at a great price. Highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "T. McCaffrey",
      "helpful_votes": 0,
      "publication_date": 20171211
    },
    {
      "title": "Looks and works great",
      "text": "We purchased this to keep our cat away from the fireplace, it looks and works great, stable and durable. It goes well with our living room.",
      "rating": 5.0,
      "verified": true,
      "author": "Shirley C",
      "helpful_votes": 0,
      "publication_date": 20180424
    },
    {
      "title": "The price was right.",
      "text": "The height could have been an inch or 2 higher.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190804
    },
    {
      "title": "Great design",
      "text": "Perfect to protect little ones from the glass on a fireplace",
      "rating": 5.0,
      "verified": true,
      "author": "JC",
      "helpful_votes": 0,
      "publication_date": 20190310
    },
    {
      "title": "Great quality for the value",
      "text": "I wish the product came in black, but for the quality and price point, this product is a steal. My dogs kept getting into the fireplace, so this barrier has worked well in keeping them out.",
      "rating": 5.0,
      "verified": true,
      "author": "🐦",
      "helpful_votes": 0,
      "publication_date": 20190712
    },
    {
      "title": "Beautiful and sturdy, especially for the price.",
      "text": "This is for our living room fireplace. I love the finish and design of this screen. It fits my decor perfectly. I was really surprised at how nice it is for this low price.",
      "rating": 5.0,
      "verified": true,
      "author": "Donna Bridges",
      "helpful_votes": 0,
      "publication_date": 20181112
    },
    {
      "title": "Good product, good price",
      "text": "It’s the perfect product for covering a fireplace rarely used because we live in Southeast Texas where it doesn’t get real cold. It’s pretty, reasonably priced and for not having feet it’s sturdy enough",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200221
    },
    {
      "title": "LOVE! Gorgeous",
      "text": "LOVE! Gorgeous. Looks so much more expensive than it was and doesn’t stick out to much. Just what I wanted!",
      "rating": 5.0,
      "verified": true,
      "author": "Brianne",
      "helpful_votes": 0,
      "publication_date": 20180211
    },
    {
      "title": "Beautiful fireplace screen",
      "text": "Beautiful fireplace screen! This is a great addition to our fireplace and gives it more life. The color and design make this piece stand out well.",
      "rating": 5.0,
      "verified": true,
      "author": "Jordana",
      "helpful_votes": 0,
      "publication_date": 20171203
    },
    {
      "title": "Very well made and looks even better than the picture.",
      "text": "Sturdy and beautiful. Craftsmanship is amazing. So much better than other screens costing much more. Nothing to put together. Just open the box, unfold and place on your hearth. The color, style and quality will give your fireplace an amazing update!",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "Gorgeous Fireplace☺☺☺☺☺",
      "text": "I luv my set and its just what I wanted and needed. It looks beautiful in front of my fireplace.",
      "rating": 5.0,
      "verified": true,
      "author": "vivian y isom",
      "helpful_votes": 0,
      "publication_date": 20190712
    },
    {
      "title": "Looks good",
      "text": "It is beautiful, fits well. Would have preferred if they included couple of clamps to fix it to the wall.",
      "rating": 4.0,
      "verified": true,
      "author": "Venkat M",
      "helpful_votes": 0,
      "publication_date": 20200809
    },
    {
      "title": "Adds so. Much to a room.",
      "text": "This screen is so beautiful, and was was effortless to remove from the box! We love the darker pewter color and it adds so much beauty to the room! Very impressed!",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa Lynch",
      "helpful_votes": 0,
      "publication_date": 20180403
    },
    {
      "title": "Attractive and serviceable",
      "text": "This looks great. We wanted it so the grandkids would not get to close to the gas fireplace. Great value and looks great",
      "rating": 5.0,
      "verified": true,
      "author": "Dorothy Hilt",
      "helpful_votes": 0,
      "publication_date": 20191110
    },
    {
      "title": "Looks Nice",
      "text": "Bought this to replace a terrible fireplace insert prior to putting our house up for sale. Looks nice and is a good product for the price. Much sturdier than I envisioned.",
      "rating": 5.0,
      "verified": true,
      "author": "Carol H",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "Tasteful and attractive",
      "text": "I'm very glad I chose this fireplace screen. It looks great! Highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Cline",
      "helpful_votes": 0,
      "publication_date": 20180327
    },
    {
      "title": "Item arrived on time and in great condition. Purchased for my son and family and ...",
      "text": "Seller provided tracking information within hours of purchase and kept me updated through delivery date. Item arrived on time and in great condition. Purchased for my son and family and they could not be more delighted! They can now enjoy a cozy fire together without worrying about the safety of their three young girls. The screen is a beautiful addition to their decor while providing the necessary safety features! Definitely recommend this product and seller!",
      "rating": 5.0,
      "verified": true,
      "author": "Anita",
      "helpful_votes": 0,
      "publication_date": 20170117
    },
    {
      "title": "I don’t think it’s child safe. Easy to pull over.",
      "text": "Not sturdy. Needs legs to keep from tipping. Gets very hot to touch.",
      "rating": 3.0,
      "verified": true,
      "author": "sandy",
      "helpful_votes": 0,
      "publication_date": 20191121
    },
    {
      "title": "Exactly what I was looking for",
      "text": "Exactly what I was looking for. My dog loves the fireplace and likes to get real close. It works perfectly to prevent my pup from burning her nose or tail on the glass fireplace. It looks really pretty too and it's not heavy either.",
      "rating": 5.0,
      "verified": true,
      "author": "Tamara",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "beautiful screen. It appears to be well made and ...",
      "text": "beautiful screen. It appears to be well made and heavy enough not to tip over easily. Would definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "garden lady",
      "helpful_votes": 0,
      "publication_date": 20171106
    },
    {
      "title": "Love it.",
      "text": "No assembly, cuter than I even thought. Perfect fit. Worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Julie R",
      "helpful_votes": 0,
      "publication_date": 20181030
    },
    {
      "title": "Self standing fireplace screen",
      "text": "Nice look and nice price. Keeps granddaughter away from hot fireplace glass!",
      "rating": 4.0,
      "verified": true,
      "author": "Ed Knight",
      "helpful_votes": 0,
      "publication_date": 20180102
    },
    {
      "title": "I like the color and design of the screen",
      "text": "I like the color and design of the screen. It is not as heavy/sturdy as my old screen, so I am concerned about the durability.",
      "rating": 4.0,
      "verified": true,
      "author": "Mary Burr",
      "helpful_votes": 0,
      "publication_date": 20171203
    }
  ],
  "product_meta": {
    "title": "Amagabeli 3 Panel Pewter Wrought Iron Fireplace Screen Outdoor Metal Decorative Mesh Cover Solid Baby Safe Proof Fire Place Fence Leaf Design Steel Spark Guard for Fireplace Panels Accessories",
    "rating": 4.8,
    "feature_bullets": [
      "DIMENSION: Crafts fireplace screen measures 28.9-inch in height, 50-inch (fully expanded) in width, large fireplace baby proof curtain cover matches with your home deco, gas fireplace, fireplace tools, fireplace grate and holders accessories.",
      "HIGH QUALITY: Pewter folding fire screens cover comes with 2 hinges in arch design can stretch to fit different openings. The fireplace tools wrought iron and powder-coated finish adds a rustic, classic look to the fire place and ensures long-lasting use , as pivacy screen for baby safety proof fencing is also a good choice.",
      "STURDY FIRE SCREEN: Tall steel fire place screens with doors holds firmly to the hearth ground, even for outdoor fire pit, portico fireplace areas.",
      "SPARK GUARD: Large and solid fire place cover guard to block popping embers; fire place baby proofing free with standing, keeps your kids and puppies away from the fireplace and keeps the living room safe.",
      "CUSTOMER CARE: We are dedicated to provide premium products for you and offer impeccable customer care to you. Don’t wait any longer and just enjoy your ideal products today!"
    ],
    "specifications": {
      "Product Dimensions": "50 x 1 x 29 inches",
      "Item Weight": "12.82 pounds",
      "Manufacturer": "AMAGABELI GARDEN & HOME",
      "ASIN": "B015NRQ8GE",
      "Item model number": "S38259SK",
      "Customer Reviews": "4.8 out of 5 stars871 ratings4.8 out of 5 stars",
      "Best Sellers Rank": "#45,427 in Home & Kitchen",
      "Is Discontinued By Manufacturer": "No",
      "Is Assembly Required?": "No",
      "Batteries Required": "No"
    },
    "categories": [
      "Stove & Fireplace Accessories",
      "Home & Kitchen",
      "Parts & Accessories",
      "Heating, Cooling & Air Quality",
      "Fireplace Screens"
    ],
    "price": 49.99
  }
}