{
  "website_summaries": [
    {
      "verdict": "With a trio of repeller types and useful features like additional outlets and 3 convenient sizes, it is extremely easy to protect a sizable indoor space from common pests.",
      "pros": [
        "Kit includes 6 pest repellers",
        "LED light shines when repellers are active",
        "Drives ants, roaches, spiders, mice, and rats away",
        "Nightlight and extra outlet features"
      ],
      "cons": [
        "Will not ship to certain states, such as Hawaii and New Mexico"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Dangerous with pacemakers",
      "text": "These just arrived. Sadly I won’t be able to use them through the house as I I have a pacemaker. This needs to be listed boldly in the description on Amazon and elsewhere, they will be used in rooms I seldom enter.",
      "rating": 2.0,
      "verified": true,
      "author": "Jody B",
      "helpful_votes": 38,
      "publication_date": 20190227
    },
    {
      "title": "Mostly works on ants and beetles.  Does not kill spiders (at least not in my house)",
      "text": "I own a fixer upper that needs new doors. My house was vacant for four years prior to my purchase. It had ant and palmetto bug infestation. After working with a decent exterminator, I turned to these to control the bugs that get under the doors. It works on ants, and roaches/palmetto bugs. For me, it does not work on spiders. I did not have any of the other pests that were addressed on the box. My sister has used in all of her homes and she never sees bugs (her house was new, and did not have a \"door issue\"). My mom also uses successfully. We live in Florida and don't have bug issues with use of this product.",
      "rating": 4.0,
      "verified": true,
      "author": "Tracey Warren",
      "helpful_votes": 19,
      "publication_date": 20190616
    },
    {
      "title": "Works beautifully!!",
      "text": "Does a wonderful job and keeping pests out. I highly recommend the Bell & Howell brand. This is the second set I've bought and I love them!",
      "rating": 5.0,
      "verified": true,
      "author": "abrum",
      "helpful_votes": 23,
      "publication_date": 20190122
    },
    {
      "title": "Stribing light drove us crazy and mice were unaffected by it.",
      "text": "Mice were running around right in front of it for about 10minutes. Didn't seem to bother them at all. Strobing lights are a horrible design; especially if you are trying to sleep in the same room with this thing plugged into the wall.",
      "rating": 1.0,
      "verified": true,
      "author": "BDB",
      "helpful_votes": 21,
      "publication_date": 20180720
    },
    {
      "title": "Has worked for me",
      "text": "I had mice. I had been trapping them and taking them away from the house but when the weather got really cold, I just couldn't put them out and just had decided to put up with them until it got warmer and then begin trapping them again. I ordered these hoping they would work and the mice would find their own survival during the winter. For a couple of weeks I didn't see any change in the evidence they were still in the house and then they were gone!!!! I plugged these in quite a while ago and so far, so good. No mice.",
      "rating": 5.0,
      "verified": true,
      "author": "DD",
      "helpful_votes": 7,
      "publication_date": 20200521
    },
    {
      "title": "Not sure they are doing their job well",
      "text": "I’ve seen multiple bugs since adding these over a month ago. I’m not sure they are actually working.",
      "rating": 2.0,
      "verified": true,
      "author": "Chrys Mims",
      "helpful_votes": 17,
      "publication_date": 20180611
    },
    {
      "title": "These work great for keeping out spiders, ants, and other bugs!",
      "text": "I have not had spiders, ants or other bugs in my house since I got these 2 years ago. I highly recommend them.",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara A Price",
      "helpful_votes": 17,
      "publication_date": 20180920
    },
    {
      "title": "Do not buy......",
      "text": "What do I like about this product? Well it has a nice flashing red light to indicate it's working . However the all the mice I have caught to date says otherwise. This has to be the worst purchase I have EVER made . Please listen when I say DON'T WASTE YOUR MONEY",
      "rating": 1.0,
      "verified": true,
      "author": "David icenogle",
      "helpful_votes": 11,
      "publication_date": 20190324
    },
    {
      "title": "Did not work for mice waste of money",
      "text": "The product is simple. Just plug it in. However for mice it does not work. I have seen mice play around it and run underneath it. The mice have also chewed my basement door leaving wood chippings right below ultrasonic repellant is located. I have three in one room and have seen the mice and their droppings. The problem has continued and progressed. I dont have any soft furniture so the sound isnt being blocked or absorbed by anything... This was a waste of money. The product flashes a red lightband you hear a click but it has zero effect on mice.",
      "rating": 2.0,
      "verified": true,
      "author": "Loving Life",
      "helpful_votes": 4,
      "publication_date": 20191110
    },
    {
      "title": "Junk gimmick, just as I suspected.",
      "text": "I rated it with one star because I don't believe Amazon will allow me to rate it with zero stars, which is about as useful as this product is. If you are mad at your money, enjoy bright flashing red lights, and daily visits from your pet mice, then this product is for you! If you are a normal person, wondering if this dream product will actually work? It doesn't. Please don't discover the hard way (by actually spending your hard-earned American dollars) that this product is absolute junk. It's a gimmick. That's all it is. We have a pest control company coming by here tomorrow.",
      "rating": 1.0,
      "verified": true,
      "author": "Jim Glaser",
      "helpful_votes": 3,
      "publication_date": 20190916
    },
    {
      "title": "watch out for \"re-sell\"",
      "text": "I have purchased these roach repellents before & they work great. But this time they were used already. I could tell because the plastic covering of the package was stapled closed. Seller used them up & then re-sold them.",
      "rating": 1.0,
      "verified": true,
      "author": "Susan Gurley",
      "helpful_votes": 7,
      "publication_date": 20190419
    },
    {
      "title": "They do take some time to work so get frustrated. The results pay off.",
      "text": "We were having trouble with sugar and grease ants and tried everything we knew possible. Let me tell you, these work amazing! We put them through the entire house and within a week we had no more little Invaders. I would definitely recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Keely P.",
      "helpful_votes": 7,
      "publication_date": 20190511
    },
    {
      "title": "Saved us a ton of MONEY",
      "text": "We just got these plugged them up and already see a difference over night. These things work. I hope the longer we have them the better our problem gets. They don't affect the dogs, they cant hear the sound waves. Thank God. And these are safer for them and our grandbabies than chemicals. We will be ordering more of these. And they came on time.",
      "rating": 5.0,
      "verified": true,
      "author": "Calista",
      "helpful_votes": 2,
      "publication_date": 20200717
    },
    {
      "title": "THEY WORK....BUT LESS EFFECTIVE IF YOU HAVE CARPETING and A LOT OF FURNITURE/STUFF IN YOUR SPACE",
      "text": "I live in a large apartment complex--translation...It doesn't matter how diligent you are in keeping your space clean. You cannot control the spacekeeping (or lack of) habits of your neighbors. There will be bugs (cockroaches). I noticed a difference later in the evening when I saw more roaches than usual--they were trying to getting away from the ultrasonic signals! FYI: The repellers are not as effective if you have carpeting (near the outlet that you plug them into) and a lot of furniture or if every corner in your space is occupied with stuff (furniture/boxes/bins, etc.). The signals bounce of these objects and limits their range and effectiveness.",
      "rating": 3.0,
      "verified": true,
      "author": "BoomerWoman",
      "helpful_votes": 0,
      "publication_date": 20201013
    },
    {
      "title": "Doesn't work at all.",
      "text": "We've had ants taking over our kitchen for months and I've tried ant baits (they work for a while, sometimes) and diatomaceous earth around the baseboards where they come in...they always manage to find another way in and they come in large numbers very quickly. These units did absolutely nothing to slow the flow of ants into our kitchen, even when I had multiple units plugged into various locations in the room. Ants were even walking right past the units and all around...probably laughing at my futility. Sending them back for a refund. I checked with a professional pest expert and he confirmed that these are typically a waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "B. G. Phillips",
      "helpful_votes": 0,
      "publication_date": 20201022
    },
    {
      "title": "does not work",
      "text": "i gave this a try since we had a mouse that got into our home. i didn't want to use a trap so i gave this a chance. absolutely nothing, did not work. left the plug ins in socket for a week and my husband had to buy the old fashioned trap. sorry bell and howell, never again.",
      "rating": 1.0,
      "verified": true,
      "author": "Taramarie Morris",
      "helpful_votes": 3,
      "publication_date": 20200427
    },
    {
      "title": "Don't really see the difference",
      "text": "I got this item because my sister told me that they worked for her after I started to see small bugs in my kitchen. I ordered the product and waited to see if it would work. It's been a couple of weeks and I still see the small bugs in my kitchen. They crawl right around the device. Doubt I'll buy this product again.",
      "rating": 3.0,
      "verified": true,
      "author": "TefWife",
      "helpful_votes": 0,
      "publication_date": 20200723
    },
    {
      "title": "Find another option",
      "text": "Came on time, the product is nice. The downsize it is not working as I expected, I read the reviews and was really well recommend, I started reading a little bit more and it says non of the ultrasonic pest repellents work because the sound they emit is to low it won't cause any effect on the pests. Also it needs at least two weeks to do something if it does.",
      "rating": 3.0,
      "verified": true,
      "author": "Mary Salazar",
      "helpful_votes": 2,
      "publication_date": 20200710
    },
    {
      "title": "Works",
      "text": "Put them all around the house enough plug inns to cover several room so far they seem to be doing the job ...have been using them for several months . I live in a rural area with lots of fields so far no sigh of the little darling the true test will come with the weather change in the fall",
      "rating": 5.0,
      "verified": true,
      "author": "KatT",
      "helpful_votes": 0,
      "publication_date": 20200924
    },
    {
      "title": "Bell and Howell pest resellers.",
      "text": "I have used them for a few years now at my travel trailer which is on a permanent site because of a problem with carpenter ants. They seem to work to keep the ants away.",
      "rating": 5.0,
      "verified": true,
      "author": "Gary Towers",
      "helpful_votes": 3,
      "publication_date": 20190615
    },
    {
      "title": "Doesn't work",
      "text": "Didn't work for us, We bought something similar that also didn't work from another company before buying this.",
      "rating": 1.0,
      "verified": true,
      "author": "Donna",
      "helpful_votes": 5,
      "publication_date": 20180901
    },
    {
      "title": "Doesn't work on mice at all",
      "text": "Bought this item since it started getting cold and when you live by fields, it is only a matter of time before a mouse or two find their way inside the house. Plugged these in and they did absolutely nothing. We saw the mouse just stroll on past it like it was nothing. You're better off just using mousetraps at this point.",
      "rating": 1.0,
      "verified": true,
      "author": "Crimson_Valentine",
      "helpful_votes": 0,
      "publication_date": 20201001
    },
    {
      "title": "The lights are annoying",
      "text": "I just got these so I don’t know if they work but the constant blinking red lights are very distracting and bright so it’s impossible to ignore them especially is it’s dark.. will probably return",
      "rating": 2.0,
      "verified": true,
      "author": "Alin810",
      "helpful_votes": 0,
      "publication_date": 20200524
    },
    {
      "title": "Really works.",
      "text": "I had a a really serious problem with those yucky roaches before I started using the plug ins. Don't know how they work but I havent been bothered by my \"visitors.\" May take a little while to get used to the blinking red lights or clicking noise but I hardly notice anymore.",
      "rating": 5.0,
      "verified": true,
      "author": "Sherry in Florida",
      "helpful_votes": 0,
      "publication_date": 20200328
    },
    {
      "title": "Looks great.....verdict pending",
      "text": "Bell and Howell ultrasonic pest zapper arrived quickly and the six pack is wonderful. Three different sizes suited my small home and I was able to cover all areas. Have only had them for a week so the verdict is still out about how well they repel insects as that is why I got them. Pesky gnats and other insect come in whenever doors are opened and my grandson had numerous bites after a nap. Hopeful.",
      "rating": 5.0,
      "verified": true,
      "author": "D. G. Ammons",
      "helpful_votes": 0,
      "publication_date": 20200629
    },
    {
      "title": "Very effective",
      "text": "I love this product. I’ve always used this product and it always works completely! In September I ordered a newer “successful” competitor’s brand of product and have regretted it every since. 3weeks into October I went back to Bell& Howell never to change again!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20181110
    },
    {
      "title": "Pests be gone.",
      "text": "They really work. My dad told me about these. He uses them at his hunting camp to keep bugs and pests away. I was tired of seeing spiders and roaches so I gave them a try. I know knowing is 100% guaranteed but it’s definitely slowed down the amount I’ve seen.",
      "rating": 5.0,
      "verified": true,
      "author": "erinlane",
      "helpful_votes": 0,
      "publication_date": 20200613
    },
    {
      "title": "Keeps em away",
      "text": "These do work and will help keep rodents away! I’m terrified of them so have these all over and u can also use in that RV your storing!!",
      "rating": 5.0,
      "verified": true,
      "author": "Cheryl K.",
      "helpful_votes": 2,
      "publication_date": 20190422
    },
    {
      "title": "Is not really working !",
      "text": "So I get that and they say to give it time so I use it for 3 months now I have small apt and I use all of them in my place Is didn’t work at all!!! It did noting and is cost a lot of money for noting don’t buy it Look at my pic that what I had after using it hopping is will help No no no",
      "rating": 1.0,
      "verified": true,
      "author": "Roy",
      "helpful_votes": 0,
      "publication_date": 20200920
    },
    {
      "title": "Doesn’t Work, still see bugs",
      "text": "I still see bugs I don’t feel like this really works 😂. And yes I gave it at least a month before writing this review!",
      "rating": 1.0,
      "verified": true,
      "author": "Mosh",
      "helpful_votes": 0,
      "publication_date": 20200611
    },
    {
      "title": "doesn't work",
      "text": "These did not work. I was very cautious about buying a branded one just because of tree reviews I had been reading. Less than a month of plug in i found a roach in my bathroom with a plug in right outside the door way and some ants in the hallway and there is a plug less than a feet away. Going back to good and faithful home defense.",
      "rating": 2.0,
      "verified": true,
      "author": "Lakisha Nyack",
      "helpful_votes": 0,
      "publication_date": 20200717
    },
    {
      "title": "Safe for children and animals",
      "text": "These items are sooooo easy to use - does exactly what they were made for. I ordered these for my church - have had a couple spiders and roaches found - if I find any more - they will be dead!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs Willie Jones",
      "helpful_votes": 0,
      "publication_date": 20200128
    },
    {
      "title": "Don’t waste your money",
      "text": "They do nothing waste of money I have plugged in on kitchen counter just suddenly goid all ants crawling up and down back splash they do nothing",
      "rating": 3.0,
      "verified": true,
      "author": "P. Brady",
      "helpful_votes": 0,
      "publication_date": 20200822
    },
    {
      "title": "Bug Zapper",
      "text": "The product has be used for a short time only and seemed to be effective until day 3 when 3 bugs were noticed.1 ant and 2 unidentifiable bugs.",
      "rating": 4.0,
      "verified": true,
      "author": "Kathleen OBrien",
      "helpful_votes": 0,
      "publication_date": 20200713
    },
    {
      "title": "Pest Repellers",
      "text": "I had an ant problem in my home and needed something to get rid of them. THANK YOU, THANK YOU, THANK YOU. What a change.",
      "rating": 5.0,
      "verified": true,
      "author": "Victoria F. Castle",
      "helpful_votes": 0,
      "publication_date": 20200926
    },
    {
      "title": "Didn’t work on mice at my tiny house",
      "text": "This product did not scare away any mice from my kitchen which is tiny and had two of these plugged into outlets I had these plugged in approximately two weeks before mouse droppings appeared in my Silverware drawer. I subsequently caught two mice in snap traps.",
      "rating": 1.0,
      "verified": true,
      "author": "hippatti",
      "helpful_votes": 0,
      "publication_date": 20200721
    },
    {
      "title": "Does it really work to repel mosquitos?",
      "text": "I have these items on the garage, bathroom, bedroom, kitchen and living room. I see the flies buzzing, mosquitos and spiders. Does these ultrasonic pest repeller work? Not to me. It was a waste of money to me.",
      "rating": 3.0,
      "verified": true,
      "author": "Lilian M.",
      "helpful_votes": 0,
      "publication_date": 20200923
    },
    {
      "title": "Product doesn't work",
      "text": "I had a prior model of these in a house with roaches. That product seems to work very well. This product however is not effective. I've had both ants and roaches within 5 feet of the product two weeks after install.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200723
    },
    {
      "title": "This product did NOT work.",
      "text": "I used this product to get rid of mice and ants. It didn't get rid of either one. The ants walked by it like it wasn't even there, not bothered by it at all. I have several plugged in. All I'm doing is wasting electricity. I would not buy these again.",
      "rating": 1.0,
      "verified": true,
      "author": "Yvette C",
      "helpful_votes": 0,
      "publication_date": 20190408
    },
    {
      "title": "See a mouse, plug these in and they will go running!!",
      "text": "Discovered some mice in the house....caught 2 with regular traps and haven’t seen another since plugging these in. I highly highly recommend!!",
      "rating": 5.0,
      "verified": true,
      "author": "Katie ",
      "helpful_votes": 0,
      "publication_date": 20201007
    },
    {
      "title": "Works for roaches",
      "text": "3-4 days now and I see significant changes in the appearance of roaches. Not sure if they are killed or just hiding.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Yu",
      "helpful_votes": 0,
      "publication_date": 20200608
    },
    {
      "title": "DON'T SELL ANYMORE",
      "text": "will it does not work everthing is still in my house mice spiders roachs flies bad product",
      "rating": 1.0,
      "verified": true,
      "author": "Bruce E Larson",
      "helpful_votes": 0,
      "publication_date": 20200928
    },
    {
      "title": "It works!!",
      "text": "So we bought this being skeptical as to if it would really work or not but why the heck not right!! Well day one we did notice a significant decrease in movement in the attic with the rodents.. it’s been a few weeks and I cannot tell the last time I’ve heard anything!! This product works for us as a temporary fix till we get the actual work done",
      "rating": 5.0,
      "verified": true,
      "author": "Breland Dominique Faggett",
      "helpful_votes": 0,
      "publication_date": 20200210
    },
    {
      "title": "no bugs",
      "text": "bugs come in but they don't make it out alive.",
      "rating": 5.0,
      "verified": true,
      "author": "Erica ",
      "helpful_votes": 2,
      "publication_date": 20181107
    },
    {
      "title": "Was highly recommended to me",
      "text": "Been using for 1 week and so far love them!!!! Took about 2 days and the ants are gone",
      "rating": 5.0,
      "verified": true,
      "author": "Jane",
      "helpful_votes": 0,
      "publication_date": 20200629
    },
    {
      "title": "Not very good.",
      "text": "i purchased this item first thru HSN, they sure did the trick. they stopped working, so i ordered a new set thru B & H. Not very good.",
      "rating": 2.0,
      "verified": true,
      "author": "Peggy CY",
      "helpful_votes": 2,
      "publication_date": 20180106
    },
    {
      "title": "Works as advertized",
      "text": "This product is amazing, since installation,I haveseen no evidence of pests at all. Ihave re-ordered this itemto further expandmy no pests zone",
      "rating": 5.0,
      "verified": true,
      "author": "Smilin Jack",
      "helpful_votes": 0,
      "publication_date": 20191020
    },
    {
      "title": "Not impressed",
      "text": "Within 1 week a spider walked right by the thing....unfettered by its presence",
      "rating": 2.0,
      "verified": true,
      "author": "M. D. Schackeel",
      "helpful_votes": 0,
      "publication_date": 20201008
    },
    {
      "title": "That I received what I ordered.  I have only had them a few days.  Time will tell.",
      "text": "Have used them before. Have not had long enough to say what this set will be like",
      "rating": 4.0,
      "verified": true,
      "author": "Louise Jones",
      "helpful_votes": 0,
      "publication_date": 20200615
    },
    {
      "title": "So far not one bug",
      "text": "Purchased to keep the ants, spiders and bugs out. and so far not a one. I have these in every room of my home.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "Good Product",
      "text": "While I have only seen 2 mice since purchasing my home 5 years ago, I think this product works well",
      "rating": 5.0,
      "verified": true,
      "author": "Billie B.",
      "helpful_votes": 0,
      "publication_date": 20200417
    },
    {
      "title": "Totally ineffecitive",
      "text": "These are plastic devices that do nothing but blink red. Rodent camped out right underneath where I had two plugged in. Total waste of money. Also prduct descrption din not mention only for indoor use.",
      "rating": 1.0,
      "verified": true,
      "author": "value consummer",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "Not good",
      "text": "Bought these to replace my ten year old ridx ones. Plugged them in as soon as I got them in June. I saw my first mouse in October less than four months of having them in. It has been fourteen year since moving into my house never had mice before. I’m so disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Jessica O'Hare",
      "helpful_votes": 0,
      "publication_date": 20201013
    },
    {
      "title": "Not All Units Work",
      "text": "Don't know if these keep away bugs yet. About 50% of reviewers say they do so im hopeful. However I ordered a 6 pack and only 5 work. Very Disappointed!!!",
      "rating": 2.0,
      "verified": true,
      "author": "Matt B",
      "helpful_votes": 3,
      "publication_date": 20180920
    },
    {
      "title": "Doesn’t work",
      "text": "I had bought this product for roaches and I thought it would work after seeing the reviews they looked good but it didn’t work at all This morning I woke up and saw a few of them This product doesn’t work at all not satisfied and it says u plug it in and u will see no bugs or anything like that would never purchase this again",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200531
    },
    {
      "title": "Seems to be working",
      "text": "The sonic waves appear to be working, I noticed a decrease in insect activity after installing these throughout the house.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff Coffey",
      "helpful_votes": 0,
      "publication_date": 20191105
    },
    {
      "title": "Don't work",
      "text": "I used them in the garage for a mouse problem, but I still have mice and have to set traps for them. So I don't believe they work the way they were promised to!",
      "rating": 3.0,
      "verified": true,
      "author": "Pat",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "It doesn’t work",
      "text": "This is crap. Does nothing had this for over a month. Still have roaches and mice. I’ve actually caught more mice with glue traps than this had eliminated. I’m discussed.",
      "rating": 1.0,
      "verified": true,
      "author": "Evangeline Counts",
      "helpful_votes": 0,
      "publication_date": 20200919
    },
    {
      "title": "Do not work",
      "text": "I dont like writing negative reviews so I'll make this brief. Sadly they do not work.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190729
    },
    {
      "title": "Unsatisfied",
      "text": "I don’t see what the product is doing, I still see bugs. Maybe it’s more of a preventative method. I was not impressed at all.",
      "rating": 1.0,
      "verified": true,
      "author": "Keisha Hewitt",
      "helpful_votes": 0,
      "publication_date": 20200412
    },
    {
      "title": "Did not repel ant invasion.",
      "text": "Put one in our kitchen. Due to excessive heat in our area of Southern California, we literally had an invasion of hundreds of ants marching across our kitchen in search of water. The ants were literally crawling on the pest repeller.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201001
    },
    {
      "title": "Doesn’t work!",
      "text": "This product doesn’t work. I plugged it in on my countertop and a mouse was literally sitting next to it. Very, very, very disappointed!",
      "rating": 1.0,
      "verified": true,
      "author": "jenny dale thacker",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "Didn't work for us",
      "text": "We put 4 of these around our kitchen, but it did nothing to discourage the ants and spiders to make their way in and explore our countertops anyway. I don't think they were doing anything other than blinking.",
      "rating": 1.0,
      "verified": true,
      "author": "Debbie Rasa",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "Great product great value",
      "text": "This is a great product and very simple. Plug it in & it actually works. I have not seen any roaches in a long time☺️",
      "rating": 5.0,
      "verified": true,
      "author": "EllenG2010",
      "helpful_votes": 2,
      "publication_date": 20190629
    },
    {
      "title": "they do not do anything to deter rodents",
      "text": "do not waste your money This is a pipe dream",
      "rating": 1.0,
      "verified": true,
      "author": "Ruth",
      "helpful_votes": 0,
      "publication_date": 20200917
    },
    {
      "title": "They’re gone",
      "text": "It took a few days .. but I’ve noticed that no more ants are showing up..",
      "rating": 5.0,
      "verified": true,
      "author": "Carol C...",
      "helpful_votes": 0,
      "publication_date": 20200618
    },
    {
      "title": "I Love My Product!",
      "text": "I used these for many years. Love this brand. Well worth it!",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa Cole",
      "helpful_votes": 0,
      "publication_date": 20200501
    },
    {
      "title": "Great product, works great",
      "text": "I've used this product a couple of times, works well, just follow directions for full effectiveness.",
      "rating": 5.0,
      "verified": true,
      "author": "PJ",
      "helpful_votes": 0,
      "publication_date": 20191213
    },
    {
      "title": "rappski1",
      "text": "The product is working ok but I live in an apartment complex and see roaches from time to time even though the units have been installed over a month. Being in an apartment, I don't think I will ever get rid of the roaches completely but 100% better than it was before I installed these",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200802
    },
    {
      "title": "Doesn’t work for fruit flies!",
      "text": "Purchased these in an attempt to get rid of fruit flies. They laughed at me and invited their friends for a tea party! :(",
      "rating": 3.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20201003
    },
    {
      "title": "All dead after 10 months of use",
      "text": "All units were dead after 10 months of use, the indicator lights can still turn on, but NO sound and pests are happy to be back",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201004
    },
    {
      "title": "good chemical free insect remedy",
      "text": "These worked well right from the start, I noticed a dramatic decrease in insects especially the dreaded cockroach.",
      "rating": 4.0,
      "verified": true,
      "author": "nynikki",
      "helpful_votes": 0,
      "publication_date": 20200811
    },
    {
      "title": "Improved version",
      "text": "Now some have a place to plug in other things on the side so you don't waste an outlet. Great idea!!",
      "rating": 5.0,
      "verified": true,
      "author": "Goose",
      "helpful_votes": 0,
      "publication_date": 20200203
    },
    {
      "title": "The only ones that really work !!!",
      "text": "These really work I bought another brand and then didn’t work this is the only brand to buy",
      "rating": 5.0,
      "verified": true,
      "author": "Vickie beers",
      "helpful_votes": 2,
      "publication_date": 20190202
    },
    {
      "title": "Pests",
      "text": "Don't have a problem but want to be safe then sorry. When I see a bug he's already dead.",
      "rating": 4.0,
      "verified": true,
      "author": "Happy",
      "helpful_votes": 0,
      "publication_date": 20201004
    },
    {
      "title": "Product did not work for me !",
      "text": "These things didn't work for me at all the next week after I plug them in icy mice I really would like a refund.",
      "rating": 1.0,
      "verified": true,
      "author": "Linette Jones",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Almost good",
      "text": "I think they work some. Don’t see a lot of bugs after plugging them in. Doesn’t seem to slow the mice much.",
      "rating": 4.0,
      "verified": true,
      "author": "Ben Merckling",
      "helpful_votes": 0,
      "publication_date": 20191106
    },
    {
      "title": "useless gizmo.",
      "text": "ineffective, useless I wish I could get a refund. I've followed instructions very carefully. my mice do not pay attention at all!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191125
    },
    {
      "title": "They work!",
      "text": "I tried everything to get rid of ants and nothing worked. Then I found this product and was amazed that it worked. No more ants, spiders, and centipedes.",
      "rating": 5.0,
      "verified": true,
      "author": "Pat Roa-Perez",
      "helpful_votes": 0,
      "publication_date": 20200610
    },
    {
      "title": "No longer working",
      "text": "I think they were working well in the beginning. But now they make an odd clicking noise when the light flashes and I have had spiders inside again. I've only had them since the beginning of August.",
      "rating": 2.0,
      "verified": true,
      "author": "Alicia",
      "helpful_votes": 0,
      "publication_date": 20200928
    },
    {
      "title": "Bot effective",
      "text": "This product does not work the insects crawl right over it. Does not repel like it says.",
      "rating": 1.0,
      "verified": true,
      "author": "Veronica Melchor",
      "helpful_votes": 0,
      "publication_date": 20200619
    },
    {
      "title": "As advertised",
      "text": "Using these going on 4 years. Have them throughout the house and have never seen a spider, ant, roach or mice. Living in Arizona, it makes these priceless!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200621
    },
    {
      "title": "Pest control.",
      "text": "These really work. Second set for outdoor shop. No more unwanted guests.",
      "rating": 5.0,
      "verified": true,
      "author": "Patricia Pendley",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "They do nothing, blinking red light and a click that says it is working",
      "text": "After a month we still have spiders crawling right by the device THEY ARE GARBAGE!!!!!! DON’T WASTE YOUR MONEY",
      "rating": 1.0,
      "verified": true,
      "author": "LOREN DOUGLAS",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "NOT much different other then more aunts.",
      "text": "Have had this for two months now and my family and I feel like it isn't helping nor working. Not worth the price. We noticed alot more aunts then before.",
      "rating": 2.0,
      "verified": true,
      "author": "Vivi Almanza",
      "helpful_votes": 0,
      "publication_date": 20200807
    },
    {
      "title": "Six Pack Product 'Insect Repellant'",
      "text": "Not all six seem to work. Two of the six have continuous red light. Do not know if they are working. Other four are fine and must be working. The spider infestation is gone.",
      "rating": 3.0,
      "verified": true,
      "author": "Nitin K Bharani",
      "helpful_votes": 0,
      "publication_date": 20200226
    },
    {
      "title": "BRIGHT LIGHT",
      "text": "WOULD BE 5 STARS EXCEPT ONE ITEM DID NOT WORK!",
      "rating": 3.0,
      "verified": true,
      "author": "CHUCK",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "Does not work!!",
      "text": "Does not work!!!! Still see bugs , and still have a mouse, one bug actually crawled into it",
      "rating": 1.0,
      "verified": true,
      "author": "Desarae",
      "helpful_votes": 0,
      "publication_date": 20190720
    },
    {
      "title": "Helped but problem just not as bad.",
      "text": "Was over run with ants. after 2 weeks amount of ants decreased by 90%. But after 6 weeks I still have ants though they are really small. Not sure they may be baby ants so as I kill them hopefully the problem will be corrected.",
      "rating": 3.0,
      "verified": true,
      "author": "Peggy B.",
      "helpful_votes": 0,
      "publication_date": 20200122
    },
    {
      "title": "Trash",
      "text": "What a waste of money the roaches are still living in the outlet that these are plugged in... haven’t seen a change in the 3 months since I have had them!!!",
      "rating": 1.0,
      "verified": true,
      "author": "brittany macbeth",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "They DO NOT work.",
      "text": "I have more bugs now than before I bought these.",
      "rating": 1.0,
      "verified": true,
      "author": "Brenda Jones",
      "helpful_votes": 0,
      "publication_date": 20200609
    },
    {
      "title": "Don’t buy for getting rid of ants.",
      "text": "Plugged the small ones in over my kitchen counter and the ants crawled right by it on the wall. Not what I was expecting. It had no effect on the ants.",
      "rating": 1.0,
      "verified": true,
      "author": "Sherry F.",
      "helpful_votes": 0,
      "publication_date": 20200528
    },
    {
      "title": "Worst product",
      "text": "Does not work at all worthless product and does not do what is advertised on TV or add",
      "rating": 1.0,
      "verified": true,
      "author": "Pedrito velez",
      "helpful_votes": 0,
      "publication_date": 20200926
    },
    {
      "title": "Not effective",
      "text": "I plugged in six devices and spread it out in a 3 bedroom apartment in the city of NY and it didn't work on the mice and flies, or waterbugs.",
      "rating": 1.0,
      "verified": true,
      "author": "Shana",
      "helpful_votes": 0,
      "publication_date": 20200930
    },
    {
      "title": "love it",
      "text": "very easy to use, it doesn't work on spiders tho..... i am still impressed",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201006
    },
    {
      "title": "I appreciate the fast service on my purchase.",
      "text": "Product four star performance. I have used it before and was pleased with the results.",
      "rating": 5.0,
      "verified": true,
      "author": "Amelia Askew",
      "helpful_votes": 0,
      "publication_date": 20200924
    },
    {
      "title": "DON’T WASTE YOUR MONEY",
      "text": "It doesn’t even work, I feel like it made the bugs come more",
      "rating": 1.0,
      "verified": true,
      "author": "Avilasha Tamang",
      "helpful_votes": 0,
      "publication_date": 20200323
    },
    {
      "title": "no reveiew as of yet",
      "text": "just started to use. Not sure how they will work.",
      "rating": 3.0,
      "verified": true,
      "author": "Aldrenia T Gaither",
      "helpful_votes": 0,
      "publication_date": 20200307
    },
    {
      "title": "Don't waste your money",
      "text": "Unfortunately, this product is absolutely useless. Just a waste of money. Does not keep rodents away.",
      "rating": 1.0,
      "verified": true,
      "author": "Lisa Barton",
      "helpful_votes": 0,
      "publication_date": 20200919
    },
    {
      "title": "Does not work on mice",
      "text": "We have had a couple of mice in the house coming behind our stove. The pest repeller has no effect.",
      "rating": 1.0,
      "verified": true,
      "author": "James M Ratcliff",
      "helpful_votes": 0,
      "publication_date": 20200608
    }
  ],
  "product_meta": {
    "price": "",
    "specifications": {}
  }
}