{
  "website_summaries": [
    {
      "verdict": "If the ability to play over 500 songs in a single charge grabs your attention, the slim design and distortion-free audio of the Anker SoundCore will seal the deal.",
      "pros": [
        "Incredible 24 hours of playtime per charge",
        "Balanced audio quality, even at high volumes",
        "Clean bass sound",
        "Drop-proof design",
        "3 colors available",
        "Lightweight",
        "Affordable"
      ],
      "cons": [
        "This speaker is not waterproof",
        "It doesn’t come with the convenience of a built-in travel clip or strap",
        "No companion app"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Impossible to Charge",
      "text": "I love everything about this speaker except for one thing. Unfortunately, the one thing is that it is a complete pain to charge this thing. There seems exactly one sweet spot where the cord and the speaker connect and will actually charge. It can take a very long time to find the sweet spot. Then, it will only hold the sweet spot for a few seconds unless, by some miracle, the forces of the universe align and it will actually charge as it is supposed it. Additionally, this problem seems to be getting worse. Thankfully it lasts a long time on a single charge so I don't have to deal with this too frequently.",
      "rating": 1.0,
      "verified": true,
      "author": "Richard Martin",
      "helpful_votes": 303,
      "publication_date": 20171116
    },
    {
      "title": "usb port broke",
      "text": "It was great for about 6 months. I don't use this speaker very often so I was surprised when one day I heard it constantly beeping. I realized it was because the usb port had come loose--and was losing charge. I have to keep the speaker positioned a certain way now to keep the wire connected. Kinda sucky as I liked the product in general. Unfortunately, I won't be buying this one again.",
      "rating": 2.0,
      "verified": true,
      "author": "reggie nathan",
      "helpful_votes": 205,
      "publication_date": 20170606
    },
    {
      "title": "Was working great ...until it stopped.",
      "text": "Now LED light goes on and claims to be Bluetooth connected but no sound at all. I bought it only 3 months ago. It's not the most expensive speaker but I thought it should have lasted a little longer that that! Too bad because the sound wasn't bad when it worked.",
      "rating": 1.0,
      "verified": true,
      "author": "Vincent Anzalone",
      "helpful_votes": 61,
      "publication_date": 20180105
    },
    {
      "title": "BT capability died after 6 months",
      "text": "Originally gave it a one-star review, as it had stopped pairing with any of my devices after 6 months, and had a hard time changing tha pairing between different devices before that. Have to use the 3.5mm cable, which is not what you expect from a BT speaker. Update: Anker support got back to me and said that holding the + and - buttons will reset the device, and that seems to have helped. They also sent a replacement, which was greatly appreciated.",
      "rating": 3.0,
      "verified": true,
      "author": "HeliophysicsGirl",
      "helpful_votes": 56,
      "publication_date": 20180104
    },
    {
      "title": "Charging port breaks so easily.",
      "text": "I have had two of these speakers. They sound great, they work for a long time without recharging. The problem is the charging port, which soon became unusable on each of these speakers. It's just cheap and breaks easily. Can't charge it, can't use it. Sorry. Addendum: Under warrantee Anker replaced my unit with the new version (Soundcore 2) which they say has new construction and not the same trouble with the mini port.",
      "rating": 1.0,
      "verified": true,
      "author": "Paul Smoland",
      "helpful_votes": 65,
      "publication_date": 20180402
    },
    {
      "title": "The Anker SoundCore speaker worked well until I let the ...",
      "text": "The Anker SoundCore speaker worked well until I let the battery discharge completely while I was traveling for 2 weeks, On returning home, the battery would no longer take a charge turning the speaker into another silent paperweight on my desk.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 49,
      "publication_date": 20170925
    },
    {
      "title": "Amazing customer service",
      "text": "I had purchased this speaker and it had stopped working just after the return period. I posted my disappointment, and the customer support team was unbelievable in following up with me and getting me a new speaker! They really wanted to be sure that I had a working speaker. They were very nice and sincere. I am sure to purchase their products again, knowing that they stand so strongly behind their products. It was a pleasure to deal with them.",
      "rating": 5.0,
      "verified": true,
      "author": "BMH",
      "helpful_votes": 200,
      "publication_date": 20170201
    },
    {
      "title": "Worked and now it doesn’t",
      "text": "Worked for three days and all of a sudden I cannot connect any of my devices via Bluetooth which kind of defeats the purpose of having a Bluetooth speaker. Will be returning this one. Hopefully I can get a new one and it will work for me because I really liked this speaker.",
      "rating": 1.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 28,
      "publication_date": 20180530
    },
    {
      "title": "Got about 6 moths of decent sound.  Now it's garbage.",
      "text": "Paid $25 on a sale in Sept. Never used at full volume, always used inside, really, minimal use. Now it crackles and breaks up. Is pretty much useless. There isn't a link to contact the seller for resolution. Garbage. EDIT!!! The good folks at Anker reached out to me via email to offer a replacement. I am using the replacement now and will update when I have more info. Fingers crossed 🤞",
      "rating": 1.0,
      "verified": true,
      "author": "ann549",
      "helpful_votes": 39,
      "publication_date": 20180330
    },
    {
      "title": "Defected unit",
      "text": "I received this Anker SoundCore today and follow in introduction to charge it before use. The pairing process was clear. I got this paired up to my iPhone 6S and I can see the battery bar in the notification. All the buttons work well ( Skip song, change volume on my phone). BUT THE SPEAKER DOESNT PLAY ANY SOUND! I tried iPad Pro 10.5, old iPhone 5, roommate Galaxy S7 and all the buttons work except there is no sound at all. I have several Anker Chargers and lightning cables, they are all good products. Just unlucky got a defected unit.",
      "rating": 1.0,
      "verified": true,
      "author": "Nhu",
      "helpful_votes": 21,
      "publication_date": 20170715
    },
    {
      "title": "We are very pleased with our purchases of the Anker Soundcores!",
      "text": "This is my second purchase of Anker's Soundcore Bluetooth speakers...My wife kept \"swindling\" mine, so I bought her one of her own! These little speakers are phenomenal and really \"pack a punch\" for their size! Originally, I purchased my first one to mount on my ATV, but never actually installed it, because I found more uses for it around the home (in my garage etc)...I am going to try and link it with my Amazon Firestick, to see if I can run Bluetooth through my TV and enhance our TV's audio. I'm not too \"Techy\" but am going to try and see if it will work through there. We are very pleased with our purchases of the Anker Soundcores!!",
      "rating": 5.0,
      "verified": true,
      "author": "KVW",
      "helpful_votes": 6,
      "publication_date": 20180904
    },
    {
      "title": "Charging port gone bad =(",
      "text": "Speaker works great if charged. Over time the charging port does not connect, therefor not charge the speaker. The cord will not stay intact. It is too late to get a replacement. I will not purchase another since this is a common problem. Anker, please fix this problem.",
      "rating": 1.0,
      "verified": true,
      "author": "Rebee",
      "helpful_votes": 57,
      "publication_date": 20170118
    },
    {
      "title": "After your ears become accustomed to it, the sound ...",
      "text": "After your ears become accustomed to it, the sound will seem clear and crisp with depth. It doesn't have booming bass but it reproduces the thumping sound of the bass really well so if it's in a corner it will sound boomy but without any of the actual movement. The battery life is RIDICULOUS. I gave it a full charge and got over a week play time while playing via bluetooth at around 5 presses below max volume for about 10 hours a day. The volume on my phone is usually right at the orange bit where it warns you about playing for too loud etc,",
      "rating": 5.0,
      "verified": true,
      "author": "Jay Inkredible",
      "helpful_votes": 7,
      "publication_date": 20180712
    },
    {
      "title": "Average with no bass",
      "text": "You get what you pay for. It’s an ok speaker fir the price. It’s loud without distortion, and you can hear the mids and highs fine but you’ll only get a faint whisper of lows and bass. Based on the reviews I read before purchasing, I was hoping for average bass but there is none. I’m returning for something more my speed If you’re looking for a entertaining, party speaker, you’ll be able to pop to the beat but you won’t be able to drop to the baseline because you won’t hear it.",
      "rating": 3.0,
      "verified": true,
      "author": "Jus10",
      "helpful_votes": 10,
      "publication_date": 20180613
    },
    {
      "title": "Looks cute, connects well, sound is mediocre.  Soundcore 2 is much improved - Anker replaced it with a new one at no cost.",
      "text": "It has a nice look, it connects reliably, the sound is mediocre. You think you're getting something like a Bose which I have one of, but the sound is only about one-third the quality of the Bose. There is no bass at all. ANKER contacted me about this review, they sent me a replacement speaker that was the newer model, the Soundcore 2. It DID have much improved sound. There was a moderate amount of bass and the overall I am impressed at how Anker wants to ensure that I am pleased with my purchases from them. Thanks ANKER!",
      "rating": 3.0,
      "verified": true,
      "author": "C.Q. Young",
      "helpful_votes": 6,
      "publication_date": 20180325
    },
    {
      "title": "Not accurate sound range reproduction",
      "text": "Having owned another Anker Bluetooth speaker (different model), I really expected more. Maybe the one I received had a defect, but the low midrange and bass had such an extreme drop off that when I listened to familiar music, I was perplexed due to the missing music. (an analogy would be listening to The Beatles out of only the right or left side, where vocals expected, were silent). Has a lot of punch, midrange, crispness and volume for its size, and price, but without more accurate reproduction, had to send them back.",
      "rating": 2.0,
      "verified": true,
      "author": "B. Petersen",
      "helpful_votes": 3,
      "publication_date": 20190705
    },
    {
      "title": "2-3 second delay when starting",
      "text": "I bought two of these to use with my Echo Dots. While the sound is very good, there is a significant delay between when Alexa responds and when the audio activates. As a result, the first two or three seconds of Alexa’s response is cut off entirely. Ask what time it is, and nothing at all is heard. This happens with both units, whether using Bluetooth or the line-in connection. Once it starts to play it works just fine, but the delay drives me nuts. I would not recommend this product.",
      "rating": 1.0,
      "verified": true,
      "author": "J. Cornwell",
      "helpful_votes": 4,
      "publication_date": 20190115
    },
    {
      "title": "Great speaker, but emits an annoying popping sound when not playing audio.",
      "text": "The speaker itself is a solid little unit. Sound quality is good, physical size is fairly small, no real complaints here. The issue I have with this speaker is that when connected (via Bluetooth) to my Mac, the speakers emit a \"popping\" sound every few minutes (while no sound is being output through the speaker). This does not happen with any other Bluetooth speakers I've used, nor with the laptops internal speakers. Further, the popping sound persists even when the Mac's audio is muted, so it is originating from the speaker itself. This sound is very annoying, and is the sole reason for the 2-star review.",
      "rating": 2.0,
      "verified": true,
      "author": "YB",
      "helpful_votes": 4,
      "publication_date": 20170914
    },
    {
      "title": "Quit charging.",
      "text": "This speaker worked great, until it stopped charging. Disappointing, because Anker is a brand I have come to trust.",
      "rating": 1.0,
      "verified": true,
      "author": "mcgeorge",
      "helpful_votes": 8,
      "publication_date": 20180912
    },
    {
      "title": "Contact Anker if you receive defective units",
      "text": "I bought this speaker. It worked fine for the most part. Then I found the issue of small 'doo' sound every 5 minutes. Also, there is a delay on standby mode. The audio will miss 1 second at beginning, which makes Google Translate nearly unusable. I was mad because my return window was passed. I decided to contact Anker before leaving super negative review. After a couple back and forth trouble shooting, they decided to send me the replacement without charge nor return (sweet!). The new one runs perfect. Note: this whole thing happened 1.5 years ago, I just forgot to leave a review. Plus, the replacement is still working like a champ.",
      "rating": 5.0,
      "verified": true,
      "author": "du@nh",
      "helpful_votes": 0,
      "publication_date": 20200507
    },
    {
      "title": "Great Speaker and Great Service from Anker",
      "text": "This is my second Anker Soundcore and I also own a few other Anker products. I bought this one to listen to music in my office at work, after trying several pairs of speakers and not being satisfied with the sound quality. The Soundcore functioned beautifully for the first few months with excellent sound but then it stopped powering up at all. I tried various combinations of outlets/chargers/cords and nothing. I reached out to Anker and within 3 days, I received a brand new Soundcore! The replacement process was easy and I had several emails from a rep throughout the process, which makes me a continued believer in the company and their commitment to quality (corny, I know, but true).",
      "rating": 5.0,
      "verified": true,
      "author": "JillyB",
      "helpful_votes": 0,
      "publication_date": 20190915
    },
    {
      "title": "Exactly what I was seeking. Cheap, monochromatic color, and BOOMIN'.",
      "text": "UPDATE: ANKER has since updated this speaker to a V2 version. Do not buy this model, although still great. This speaker is regarded for a reason. For this price, I don't think you're going to find better. As much as I love riding with AmazonBasics brand, it doesn't come close [I had the V1 version, and it was extremely disappointing in sound output and battery life]. This one BOOMS. I know people can be picky with their colors (especially red), so I attached (2) photos to give a realistic idea of what this red looks like. It's a bright red, which is what I love. Not a deep red. Love the monochromatic design, also. Not a busy looking speaker. Simple.",
      "rating": 5.0,
      "verified": true,
      "author": "John Khalil",
      "helpful_votes": 0,
      "publication_date": 20191126
    },
    {
      "title": "More powerful sound than it may look",
      "text": "It has an amazing battery life. The sound is very clear and have not experienced any connection problems, I've not used it at a distance of more than 20 ft although sometimes there are two walls between the speaker and my laptop or phone. I found it has a very wide sound range and bass heads will be specially pleased, that said I've found the bass to be a little too overwhelming while listening to some male radio hosts so it's entirely possible that it's not the best for listening to some podcasts. It will also distort the sound when used at the higher volume levels. Overall a great powerful little speaker and a purchase you're not likely to regret.",
      "rating": 4.0,
      "verified": true,
      "author": "Osiris",
      "helpful_votes": 3,
      "publication_date": 20170728
    },
    {
      "title": "powerful speaker",
      "text": "Overall, I like this speaker. It has great sound quality for the size. For some reason, my speaker was losing power after about 3 hours. I just ended up keeping it plugged in more often. One thing I don't like are the buttons on the top of the speaker. They are not a different color, just raised markings. They are very hard to see. It's like reading Braille. I wish they were an offset color so I could see them better. Otherwise, I'm very happy with this speaker.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190125
    },
    {
      "title": "Great speakers for the price, buy. I have compared it to oontz",
      "text": "Excellent sound quality for the price, amazing shrills, originality, base can be great/satisfying if original sound quality is good. Bluetooth connectivity is awesome and quick. Comparing to Ootnz, bluetooth range is far less but in small apartment will work good, basically across one wall will be ok. If you are buying it for base, you might get disappointed at times it has mo base at all but the sound quality is still good. The speakers has a few bugs which you can watch in my video review.",
      "rating": 5.0,
      "verified": true,
      "author": "H Khan",
      "helpful_votes": 0,
      "publication_date": 20200829
    },
    {
      "title": "Very disappointing",
      "text": "I bought this speaker to use in an older car with no Bluetooth so I could listen to podcasts while on the road. It connected via Bluetooth with my phone great and the size is perfect, but the sound quality is very bad. Since I am not listening to music, I can still use it, but the sound is scratchy and raspy and sometimes it is hard to understand what the voices on the podcast are saying. This is the first Anker product I have had that didn't live up to the hype. Everything else I have bought of theirs was great. Very disappointing!",
      "rating": 2.0,
      "verified": true,
      "author": "Pops and Lin",
      "helpful_votes": 3,
      "publication_date": 20190714
    },
    {
      "title": "Blue tooth is terrible. Audio latency.",
      "text": "Pros. Decent sound quality. Cons. Only comes with USB for charging. Audio cord or blue tooth dongle needed for gaming consoles and PC. Blue tooth is shoddy. Noticeable latency in audio. Anything you watch is going to sound like it was voice dubbed like a foreign film, because the audio has atleast a 2 second delay. Sound also cuts in and out and skips really bad. This speaker does not perform well.",
      "rating": 2.0,
      "verified": true,
      "author": "EdgeofTomorrow ",
      "helpful_votes": 2,
      "publication_date": 20191201
    },
    {
      "title": "Our favorite speaker",
      "text": "We have several of these speakers and have had them for years. It is amazing how long they can hold a charge. I rarely have to charge it! The sound quality is amazing and it is the perfect size. I have also given these as gifts and everyone always talks about how much they love them later.",
      "rating": 5.0,
      "verified": true,
      "author": "Molly",
      "helpful_votes": 2,
      "publication_date": 20191127
    },
    {
      "title": "Another win for Anker...  a company with consistently fabulous products",
      "text": "Started out buying cell phone batteries by Anker... and have ventured into hub, cable and charging equipment. This was out first venture into a sound product and we are NOT disappointed. It's great to take on the boat, our ORV, at the campfire and just have in various places around the house while we're working on something. Once paired with your phone or computer, it works instantly the moment it's turned on. The sound quality was adequate to use for a meeting room presentation with video... and is more than enough around the house for general listening. The volume can be quite significant with not distortion and the base and \"EQ\" balance is good for multiple music types.",
      "rating": 5.0,
      "verified": true,
      "author": "YsLadyMN",
      "helpful_votes": 0,
      "publication_date": 20190204
    },
    {
      "title": "Don't buy These!  Bought two and charging ports failed the day after return Deadline!  Junk",
      "text": "Worked great then charging port failed! Was very pleased with the sound, size, run time etc. Then the cable started falling out of the charging port. Using the cable that came with it and tried other cables when the original kept falling out! DON'T BUY THESE,",
      "rating": 1.0,
      "verified": true,
      "author": "Jamtn",
      "helpful_votes": 6,
      "publication_date": 20170701
    },
    {
      "title": "Horrible! I should of listened to all the reviews ...",
      "text": "Horrible ! I should of listened to all the reviews about this thing dying after just a month! Anker has really disappointed me. I used to love their products..NO MORE. Unless I hear back from their customer service, this thing is a paper weight. Won't turn on/charge! Never again.",
      "rating": 1.0,
      "verified": true,
      "author": "Rmor444",
      "helpful_votes": 7,
      "publication_date": 20170923
    },
    {
      "title": "The wake up delay kills using this on my Alexa.",
      "text": "Sound is ok but really is missing the low frequencies, so not much bass comes out of this box. I could live with that, but what I can't live with is the ~3 second delay it has when it comes out of sleep mode. It's paired to my Alexa, so I ask a question or whatever, I don't hear anything except the tail end of her response. Got annoying really fast. So decent product buy poorly implemented design on the wake up response time.",
      "rating": 3.0,
      "verified": true,
      "author": "danji31",
      "helpful_votes": 2,
      "publication_date": 20190114
    },
    {
      "title": "Charge port issues. Fickle and has stopped charging.",
      "text": "Charge port is fickle and has stopped working. Granted, I bought it just over 2 years ago. But rarely used it. Now the 18 month warranty is over. Bummer! Because it sounds great! I had the same problem as stated in another review that the charge port is fickle. Mine was also. I even bought one for my wife and the charge port is also fickle. You have to get the cord in just the right spot to charge. And many times it moves after you get set it just right and it stops charging. I liked it when it worked. But now it won't charge after very limited use.",
      "rating": 1.0,
      "verified": true,
      "author": "D",
      "helpful_votes": 0,
      "publication_date": 20190313
    },
    {
      "title": "I use this every day",
      "text": "The sound quality on this is great and it's easy to use. Pretty simplistic design which I thought at first was overly simplistic, but now that I've been using it for several months, I realize it has everything I need. With the COVID-19 stay at home order, I've been using this every day while I work. It definitely beats the earbuds I have to sue when in the office! All in all I am very happy with this item and the price makes it a no brainer.",
      "rating": 5.0,
      "verified": true,
      "author": "JulieD5671",
      "helpful_votes": 0,
      "publication_date": 20200417
    },
    {
      "title": "Beware of Warranty Issues",
      "text": "The Anker Soundcore I purchased was unable to power on despite being charged overnight within a year of my purchase. While it worked amazingly throughout the time I was able to use it, I am severely disappointed by the misleading warranty, which is stated on the product details to be covered by Anker. Despite this seemingly admirable 18 month warranty, it is instead covered by the third party vendor, Ultimate Electronics, whose warranty does not extend the 18 months which Anker advertises to their products. Thus, I am left with a brick of a speaker which no longer powers on, and did not serve me even a year of regular usage. Severely disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "supedaglup",
      "helpful_votes": 3,
      "publication_date": 20190801
    },
    {
      "title": "Awesome speaker!!",
      "text": "Got this speaker and was really pumped about it. Barely a month later however, it won't charge, turn on, nothing. I had used it at work the day the before and it worked just great. Not sure what changed within 12 hrs...was a great speaker while it lasted though EDIT: I was contacted by their customer service and they sent a replacement that works great! Lena was also very helpful and patient. Everyone at work keeps asking me where I got my speaker and I haven't hesitated to recommend these guys. Found a new company for any future purchases. Thanks!!",
      "rating": 5.0,
      "verified": true,
      "author": "Stephie",
      "helpful_votes": 3,
      "publication_date": 20170902
    },
    {
      "title": "Fab speaker for the money!",
      "text": "So I had a similar $40 speaker that was WAY too heavy to use for travel (stated it's great for travel online) that finally died. I decided to spend less this time around and it paid off big time. Not only is this speaker nicer looking and smaller, it's definitely light weight enough to travel (at least by car). The sound quality is great considering the price. Knocked off a star only due to heavy base when playing fairly loud, and obviously you can't control those functions. The bluetooth works perfectly and I could not be more thrilled with this purchase!",
      "rating": 4.0,
      "verified": true,
      "author": "ATLshopper",
      "helpful_votes": 0,
      "publication_date": 20190116
    },
    {
      "title": "Sound level dropped almost half the original (Updated)",
      "text": "Update: The company sent a new one and I am willing to try it. I will keep updating this review if anything comes up. Looks everything good thus far! I really liked the product thus far, until it dropped the sound level almost half the original after only using for 25 days. I thought it's running low on the battery and charged it to full but did not work. And also when I sync with my Chromebook it does not auto shots off. It was advertised as it would.",
      "rating": 4.0,
      "verified": true,
      "author": "AmazonUser",
      "helpful_votes": 5,
      "publication_date": 20170813
    },
    {
      "title": "Anker does not stand behind product reliability",
      "text": "This is my second Anker Bluetooth speaker. The first \"identical\" unit failed after 19 months. Anker admitted in an email to me that there was a quality control issued with the unit, but since the 18 month warranty had expired, so sorry! My suggestion is that if you buy an Anker unit and it has ANY minor problem(s) prior to the expiration of the warranty, jump on the warranty replacement ASAP. They are extremely inflexible! Hopefully, my new unit will last considerably longer than 18 months.",
      "rating": 1.0,
      "verified": true,
      "author": "Jim Jolley",
      "helpful_votes": 0,
      "publication_date": 20191002
    },
    {
      "title": "BEST BLUETOOTH SPEAKER THAT I'VE TRIED!!!",
      "text": "I am so impressed with this speaker. I purchased this to replace an old Logitech speaker, in my bathroom. I was amazed that the Anker speaker was about 1/4 the size of the old Logitech, but the sound is so much better. I used to turn my Logitech speaker all the way up to be able to hear it, but this would cause very distorted sound. This Anker speaker sounds very clear, no matter what volume I set it to. I think this speaker will be what I give everyone, for Christmas this year. Another hit product from Anker. I own a lot of Anker products and have never been disappointed. I'd like to invest in this company.",
      "rating": 5.0,
      "verified": true,
      "author": "SandmanSWS",
      "helpful_votes": 3,
      "publication_date": 20170511
    },
    {
      "title": "AMAZING speaker but...",
      "text": "This speaker actually sounds better than other expensive speakers I've owned! The reason I gave it a low rating is because since receiving it, I've had to push the on/off button REALLY hard in order for it to work. I thought it was just how the speaker worked but after owning it for a month, the button is starting not to work. I'm afraid that it might eventually stop working completely, which is a shame because I really like this speaker. UPDATE: 10/13 The sellers contacted me and offered to send me a replacement speaker that was free of charge! I just received mine in the mail and it works perfectly! Great customer service! Very happy with my purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Ahnastasia",
      "helpful_votes": 0,
      "publication_date": 20200930
    },
    {
      "title": "Very pleased. People hear this speaker, and then they ask where to get it.",
      "text": "These sound very good, and the battery outlasts any other I have found. I charge mine less than once a month, and it travels everywhere on the dash of my car. So far, I have left it out overnight in the rain (twice), and cooked it on the dash of my car many times. It's still working fine. Given that Anker makes so many battery-booster products, I don't know why they don't put a port on this to allow you to recharge your Bluetooth device...but it won't. You can hook them together, but that ain't gonna charge your phone.",
      "rating": 5.0,
      "verified": true,
      "author": "David L. Little",
      "helpful_votes": 4,
      "publication_date": 20180717
    },
    {
      "title": "LOVE this speaker",
      "text": "I have owned this speaker over a year and I love it. The sound quality is great and I think it is able to get pretty loud compared to some other more expensive speakers my friends have. It holds a charge for FOREVER! I have only recharged it a handful of times in the +1 year I have owned it (I don't use it for hours on end though...just for maybe a couple hours a week). I definitely would recommend this speaker or any of Anker's products (I have their bluetooth headphones as well).",
      "rating": 5.0,
      "verified": true,
      "author": "lrox22",
      "helpful_votes": 0,
      "publication_date": 20200422
    },
    {
      "title": "Want to love it. Bass ruins it.",
      "text": "UPDATE: because the company got back to me and quickly sent a replacement with the updated speaker. I’m enjoying the new one much more! ....... Honestly I want to love this but I don’t understand the “phenomenal sound quality” everyone is raving about. I listen to podcasts and YouTube videos with this and everyone just sounds like the bass is up so high that they’re in box. I can’t find anywhere to fix or adjust this and it’s ruining my experience with it. It’s not clear or enjoyable to listen to. If anyone had tips I’m happy to update my review but 3 stars is all I can do at this point.",
      "rating": 3.0,
      "verified": true,
      "author": "B. Wasko",
      "helpful_votes": 0,
      "publication_date": 20200307
    },
    {
      "title": "Anker = Solid",
      "text": "An Anker speaker at this price point was too good to be true. Anker provides a great alternative to what you'll typically find in a brick and mortar store at a much more reasonable price. Pros: - Anker Brand, They stand behind their product and have great customer service - Low Price, less than half the price of the competition Cons: - Audio quality doesn't offer much bass but this is due to the small speaker diameter. If you are searching for more bass and low end do a search for higher-end Soundcore options. Recommendation: Yes, I'd buy this again. It's a solid product and you won't beat it anywhere",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin Stewart Jr.",
      "helpful_votes": 0,
      "publication_date": 20200820
    },
    {
      "title": "ALMOST got 5 stars....",
      "text": "BUT, I think it is a little lacking in the volume department. I used it with both bluetooth, and a cable, and both ways I was unimpressed with the sudio output. The sound quality is what I'd call very good for a single unit, with good highs and mids, fair bass. BUT the overall audio level is lacking. I bought a cheapo sound cube at Walmart a year ago that is twice as loud as this thing. I think I paid 14 dollars for it.. I'll probably give this one to my GF as a gift since I need more power.",
      "rating": 4.0,
      "verified": true,
      "author": "Patrick",
      "helpful_votes": 0,
      "publication_date": 20190508
    },
    {
      "title": "Not sure what everyone is raving about.",
      "text": "I have some Anker products that are great. It is a good company, but this speaker falls short. While it looks good and well constructed, the sound is not good and bluetooth connectivity is not great. The sound of the speaker is very tinny, muffled, and hollow sounding. Also, while the bluetooth connection connected quickly, the connection is laggy. When you control the volume, it takes a long time for the speaker to respond and makes it frustrating to get the volume set. I guess the speaker is ok if you are using it outside just to hear some music, but if you are a music person that wants their clarity in their music, there are better options.",
      "rating": 2.0,
      "verified": true,
      "author": "Crash Test Dummy",
      "helpful_votes": 0,
      "publication_date": 20200801
    },
    {
      "title": "Easy to Connect",
      "text": "Love this speaker and the sound it projects. Very portable. Very easy to set up (I’m just an old lady learning new tricks). What I did learn was that in order to connect to another device you first have to disconnect the current device. But again, this is easy. When I couldn’t connect my laptop (because already connected to iPad). I received an automated response and then an actual person sent me an email the next day. Our communication was timely, down to earth, professional, yet friendly from their Customer Service. A great product from a customer-service oriented company - what a concept 😸",
      "rating": 5.0,
      "verified": true,
      "author": "Kim Beckwith",
      "helpful_votes": 0,
      "publication_date": 20191206
    },
    {
      "title": "Great Little Speaker",
      "text": "Easy to set up, this little speaker is a little over 6 inches and will work great for campsites, outdoor patios, or get togethers with friends. Very portable. Did not come fully charged so keep that in mind. It didn't seem to be able to get very loud, but it will do the job. Sound is crisp and clear. Personally I bought this speaker to bring outside when I'm out in the yard exercising the dogs. Will update if any issues.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 0,
      "publication_date": 20200626
    },
    {
      "title": "AUX audio ruined by latest firmware version",
      "text": "This used to be the best speaker of this section of the market, but since they updated the firmware to reduce 'popping' sounds when inserting/removing the AUX cable, it basically rendered this speaker useless. I've purchased hundreds of these for my business in the past 3 years. I have asked Anker's tech support to look into it, but I don't think they understand how terrible this is. Basically, if you're trying to listen to music, or be on a video call while connected to AUX, it takes 3-4 seconds for the sound to come on, and often times the sound will not come back. ANKER, if you're reading this, please fix this ASAP!",
      "rating": 1.0,
      "verified": true,
      "author": "Fernando T Gargano",
      "helpful_votes": 0,
      "publication_date": 20191129
    },
    {
      "title": "Best thing ever",
      "text": "My apprentice had one of these. When he went on parental leave...I got one. Its loud enough to get you in trouble at work. And strangely, after I got in trouble for playing my music too loud a few times, other people bought these and started getting in trouble too. For $20, this thing is amazing and lasts all day. Just dont waste capabilities like these on country music.",
      "rating": 5.0,
      "verified": true,
      "author": "AgnusR",
      "helpful_votes": 0,
      "publication_date": 20201003
    },
    {
      "title": "Small with Big sound!",
      "text": "Bought this for my elderly mom (103yo). She uses hearing aids, but likes to listen to Pandora on her iPad when going to sleep (without her hearing aids). It works great! We also take it out on her patio so she can listen to Pandora out there. The sound is clear and it’s so easy to use. We bought one for us after hearing my moms. Oh, bought one for one of my grandson. Would definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "GammaT",
      "helpful_votes": 0,
      "publication_date": 20200725
    },
    {
      "title": "You get what you pay for!",
      "text": "Honestly it’s not a bad product at all for the price point. I have utilized it frequently in my garage since I purchased it. Sound quality isn’t bad. The battery life began getting shorter and shorter after a few months of owning it. The Bluetooth connection began going on and off around the same time as well but that definitely could have something to do with my P.O.S cell phone that I need to upgrade. Over all I’m happy with it for the price I paid.",
      "rating": 3.0,
      "verified": true,
      "author": "T",
      "helpful_votes": 0,
      "publication_date": 20200223
    },
    {
      "title": "Quit working after two weeks.",
      "text": "I'm very disappointed that this speaker, which was supposed to be extra durable, quit working after a couple of weeks. I didn't report it right away because I thought my grandson would be able to find out what was wrong, like maybe I hadn't set it right. By the time he got around to it, it was past the return window. And then, although he'd been able to see what I had set wrong the first time, this time everything was set right, and still no sound. I had expected this to be a plug-and-play device. I'm not tech savvy. But my grandson is, very, and he could see no reason why the speaker was -- and is--silent.",
      "rating": 1.0,
      "verified": true,
      "author": "Mosswoodmatriarch",
      "helpful_votes": 0,
      "publication_date": 20200716
    },
    {
      "title": "Great for the price",
      "text": "I got this for zoom calls during covid, as my laptop speakers stopped working and I wanted a non-headphone option. The sound quality isn't bad at all, but if you want to use this as the main speaker in your home, you might want something larger. The single thing that bothers me is that I feel like it takes forever to turn on and off. I know i'm being very impatient, but I feel like pressing a power button for 5 seconds or so is too long. I've also had some occasions where the speaker suddenly stopped working on a zoom call, needing to turn it off and on again,.",
      "rating": 4.0,
      "verified": true,
      "author": "E. Kfir",
      "helpful_votes": 0,
      "publication_date": 20200908
    },
    {
      "title": "Anker Soundcore Bluetooth Speaker - Value!",
      "text": "The Anker Soundcore Bluetooth Speaker is a decent speaker. While it can't compete with higher priced models, you still get pretty good sound for a low price. Great value for your money!",
      "rating": 5.0,
      "verified": true,
      "author": "DishwasherSafe",
      "helpful_votes": 2,
      "publication_date": 20191126
    },
    {
      "title": "Great Little Speaker for 2 years - then it just quit turning on",
      "text": "Great little speaker - except that after 2 years it just stopped working. Will no longer power on, at all. Was time to charge it, did so, then it would never turn on again. My husband and I have purchased a LOT of Anker products and expected to get a good life out of this one, but we are disappointed. With this experience, any consideration we may have given to Anker products other than chargers or batteries, like their Nebula projector, is now significantly less likely - would hate to fork out a couple hundred bucks and just after the warranty it up and dies like this speaker did.",
      "rating": 1.0,
      "verified": true,
      "author": "4Tillie",
      "helpful_votes": 0,
      "publication_date": 20200709
    },
    {
      "title": "Only Buy If You Like Continuous Blinking LED Lights",
      "text": "Overall a decent product. However, COULD THEY BUILD A WAY TO NOT HAVE TO LOOK AT THE CONTINUOUS BLINKING LED 'CONNECT' LIGHT? IT RUINS THE WHOLE EXPERIENCE OF USING THE PRODUCT. NOT EVERYONE BUYS THIS TO USE AS A BLUETOOTH SPEAKER THERE ARE THOSE WHO WANT TO USE IT AS A WIRED SPEAKER. IF THATS YOUR CASE, ABSOLUTELY DO NOT BUY THIS, UNLESS YOU LIKE BRIGHT BLUE SCREAMING LIGHT BLINKING AT YOU NON STOP.",
      "rating": 1.0,
      "verified": true,
      "author": "76th & Madison 10021",
      "helpful_votes": 0,
      "publication_date": 20200520
    },
    {
      "title": "Top Notch Speaker for this price",
      "text": "You really can't ask more from a Bluetooth speaker priced under 30 bucks. It's the length of my smart phone and a little narrower. Sturdy, pretty rugged for such a small unit. The sound is about as full as you can get without spending more. No, it doesn't have huge bass but it does have a decent little thump. The overall sound is crisp. Often with these little speakers, the sound kind of blares out in one loud blast. With this speaker, I can actually hear the variances in instruments, effects, etc. This is worth every penny. I would buy again and give as a gift to anyone who could use some portable audio.",
      "rating": 5.0,
      "verified": true,
      "author": "bwalk",
      "helpful_votes": 0,
      "publication_date": 20201016
    },
    {
      "title": "A GREAT bluetooth speaker for the money",
      "text": "I have owned a number of bluetooth speakers over the years and this is one of the best. After it has been paired the speaker connects to your phone or computer in seconds, the volume doesn't get incredibly loud but there are a good range of mids/lows for such a small speaker. There is no battery level indicator but it seems to charge rather quickly and I have yet to have it die on me even after several 2-3 hour sessions of it playing. The signal will stay connected to your phone until you are 50-70' away from wherever the speaker is from what I have seen.",
      "rating": 5.0,
      "verified": true,
      "author": "Gallowizard",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Solid build , solid quality , but wish I had more treble and audio controls and turn the speaker up louder in most situations",
      "text": "Solid construction , great quality , but a little too much bass at times and no way to adjust it and many times it wasn't loud enough and it was on full volume. Many times I wish I could turn it up louder , I do not understand why they do not allow you to turn up treble and voice on this speakers. I know the speaker could handle much more treble and highs but its a great speaker just I really thought it would be to loud in almost any situation but its only loud when your source is very good quality and loud as well.",
      "rating": 4.0,
      "verified": true,
      "author": "B R",
      "helpful_votes": 3,
      "publication_date": 20181108
    },
    {
      "title": "Love this little ANKER SOUNDCORE 1speaker!!",
      "text": "Purchased this Anker speaker for my iPad Air—mostly for zoom meetings (some people don’t talk loudly in these meetings) and for watching our church services online! It is awesome!! Packed beautifully and very easy to unpack. Easy to sync with iPad Bluetooth! And the sound is GREAT!! Nearly blasted us out of the room!! I did not realize that I must hold the button down for a few seconds to turn the speaker on, so I called customer service and the young lady was great!! I would highly recommend the Anker Soundcore 1! I picked this speaker because of all the great reviews, and now I add my praises to the list!!",
      "rating": 5.0,
      "verified": true,
      "author": "Marilyn Hammett",
      "helpful_votes": 0,
      "publication_date": 20200924
    },
    {
      "title": "Much Better",
      "text": "I've purchased 3 wireless speakers in the last 3 months and so far this is the best one. The OontZ Angle 3 (awful sound quality) and ZoeeTree (a lot of weird product quirks before it tweaked out and died in 3 months) were garbage. This one was straightforward to set up and has crystal clear sound and some decent bass. It will turn off after not being connected for awhile which is also nice since I always forget to shut it off before I leave work. I recommend this one as a good value purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Charity",
      "helpful_votes": 0,
      "publication_date": 20190124
    },
    {
      "title": "Better than expected",
      "text": "Got this on prime day. It is very loud for how cheap the price was. It even has a some bass, but don't expect anything to start shaking. I use this out at the lake, with a house of 24 people, and you have to talk over it. It is sturdy, and sleek. I love the rubber molding around it. Anker makes good products, and this has only made me more confident in them. Would buy again. I didn't give 5 stars, because for more money, you could buy the Bose version that is even louder, and actually has a subwoofer that hits hard. Not taking anything away from this one, just saying it isn't quite on that level yet.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190819
    },
    {
      "title": "Defective product",
      "text": "As described in other reviews, the connection to boot the speaker with USB does not connect properly. The red light goes off after a few minutes. After two days of trying to get the battery charged, I gave up. I tried to contact the company per insert during their office hours but a message came on saying the employees were \"at a meeting to give better customer service.\" So I gave up on the customer service. Do not buy this product! A headache to have to repackage and drop off at UPS. I needed it for my classes and it was a real disappointment.",
      "rating": 1.0,
      "verified": true,
      "author": "LH",
      "helpful_votes": 0,
      "publication_date": 20191121
    },
    {
      "title": "A winner!",
      "text": "For the small investment I made in buying this speaker, I am very impressed. I don’t actually know how long the battery will last, but I have played music for at least 3 hours at a time without running it completely down. Sound quality is fine for most uses. I suspect that if you are a true audiophile, you will want to spend more on a speaker, but this one fills the bill for general listening in the kitchen and patio, movie audio (better than our old sound bar), and playing my podcasts. Pairing with any bluetooth device is super easy, too. A winner!",
      "rating": 5.0,
      "verified": true,
      "author": "S. SloanTop Contributor: Knitting",
      "helpful_votes": 0,
      "publication_date": 20191202
    },
    {
      "title": "Fantastic little speaker",
      "text": "I have a slightly older bose speaker that has been around for years. It's great, but the battery is showing it's age and might last 6 hours. Bought this to be able to cycle between them for recharging. I have never killed the battery on this, it has lasted over 12 hours each time. The sound quality is not quite on par with the bose speaker that is nearly identical in size, but this cost 1/4 of what the other speaker does and it's not far off on sound. I'm very pleased with it and will consider another when I've worn out the battery on this.",
      "rating": 5.0,
      "verified": true,
      "author": "Charlie",
      "helpful_votes": 0,
      "publication_date": 20200415
    },
    {
      "title": "This speaker is a home run.",
      "text": "I don’t typically give blanket 5 star reviews for products as there is always some room for improvement somewhere. However, this product is performing exactly how I want, and where I want. The battery life is exceeding my expectations but it is new so we’ll have to wait for a few cycles to see how it sustains that performance. This speaker delivers full clear sound, across the entire spectrum. Last year, I purchased the amazon basics model that is similar to this one by Anker, and they are virtually identical to each other in looks and performance. For the price point you’ll be hard pressed to find a better bt sound solution in the same form factor.",
      "rating": 5.0,
      "verified": true,
      "author": "Drew",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "the easiest thing was connecting.. but then..",
      "text": "the sound skips the whole time. I have had this about a week now and nothing I do, has fixed this. I am in the same room as the WIFI connection, the speaker sitting on the desk next to the audio source. I don't understand what else to do.. I am not new to Bluetooth tech, but I'm also not exactly rolling in the $ so this was right up my alley at around $25... and everything I have tried is changing anything about the sound and the sound quality. I will unfortunately, have to send it back. I was hoping it would be the solution I was looking for.",
      "rating": 1.0,
      "verified": true,
      "author": "Richard G. Higgins",
      "helpful_votes": 0,
      "publication_date": 20200912
    },
    {
      "title": "Great Value",
      "text": "I bought this Anker Bluetooth speaker to work with my tablet computer on Zoom meetings. The overall quality is very good. It connected to my device quickly. The sound quality is exactly what I wanted. The volume range is more that adequate. At under $25, I don't think that you can make a better choice. Also, music from my tablet sounds just right on this speaker for my taste. The mid-range is excellent and there is enough bass to enjoy most genres. If you want a lot of bass, you probably should look into the much more expensive choices.",
      "rating": 5.0,
      "verified": true,
      "author": "DanA",
      "helpful_votes": 0,
      "publication_date": 20200818
    },
    {
      "title": "Anker Comes Through!",
      "text": "I absolutely loved this speaker when I received it--it was easy to pair, the sound was great (I'm not watching movies or listening to music--just podcasts!), battery life was terrific, and its range carried throughout my home. After six months, I did have some problems with the speaker, which has an 18-month warranty. I contacted Anker, got immediate customer service (within 24 hours), and they stood by their product. A really good product, and an exceptional company to work with!",
      "rating": 5.0,
      "verified": true,
      "author": "slj",
      "helpful_votes": 0,
      "publication_date": 20181220
    },
    {
      "title": "Affordable dynamo!",
      "text": "When my JBL Flip died, I tried changing the battery 🔥🔥🔥 Because a $89.00 wireless speaker, should offer an easy battery change. NOPE! The JBL Flip is DISPOSABLE. Shame....on JBL. (Roast of JBL intended) Ok, so then what. I listen to audio books, all the time. The lil' Anker is badass! Purchased on sale for $21 Holds a charge, better than JBL The sound is really good. Call me impressed. I'm not going to cry in my cheerios, if it gives up the ghost. It's a great budget speaker. Get half a dozen, they're that good.",
      "rating": 5.0,
      "verified": true,
      "author": "ILoveAmazon",
      "helpful_votes": 0,
      "publication_date": 20191209
    },
    {
      "title": "Great speaker for the value, but AUX jack stopped working in less than 2 years.",
      "text": "I use this speaker for work and it has been a lifesaver. Recently, the AUX jack has stopped working very well as if the connections inside have become loose. I realize that Bluetooth is the future and all that, but I have a 1988 Sony Walkman that still has a working earphone jack. I also have an old set of Harmon Kardon speakers from 1998 that has an operating AUX jack... So I think this should have at least lasted more than 1.5 years of use. I might buy another one to replace this one, but I'll probably be looking for something rather than Anker.",
      "rating": 2.0,
      "verified": true,
      "author": "maou",
      "helpful_votes": 0,
      "publication_date": 20200713
    },
    {
      "title": "Bye, bye Bose.",
      "text": "Bye, bye Bose. This little Anker power pack delivers high quality sound for a fraction of the cost of popular \"high quality\" brands. It's small enough to take anywhere, yet powerful enough to be a primary speaker system. I purchased the Soundcore to use in my office to replace wired speakers. I liked it so much I purchased one as a Christmas gift for my wife and for the office pollyanna. Sound quality: To my ears, as good as our Bose Sounddock or Wave radio. Bluetooth: Easy sync setup, and syncs immediately with the last device connected. Controls: Easily pause and resume music play right on the Soundcore. Battery: Lasts for a full work week of use.",
      "rating": 5.0,
      "verified": true,
      "author": "william malin",
      "helpful_votes": 0,
      "publication_date": 20191218
    },
    {
      "title": "Please add a plug to this product",
      "text": "The speaker is fine but the cord does not have a plug. The plug on my cell phone does not fit this speaker so I have to go out and buy a plug. I do not understand why they wouldn't just include the plug, I'd be happy to pay more.I borrowed a neighbors plug to make sure it works and it was easy enough to get the bluetooth to attach to my laptop. Sound seems ok. Ease of use was my main concern and as nice as this product is had I known it did not have a plug I would not have bought it. No one wants to run around trying to get the right plug to fit.",
      "rating": 4.0,
      "verified": true,
      "author": "mandy",
      "helpful_votes": 0,
      "publication_date": 20200804
    },
    {
      "title": "Wouldn't hold a charge",
      "text": "I had to send it back. The battery would not hold a charge. I fully charged the unit, then, a few hours later tried to turn it on, only to find that the battery had fully discharged and wouldn't turn on. The unit must be defective and I'm returning it (Only had it for a few days, so the return should be no problem). I imagine that this unit was defective. Others may have better luck.",
      "rating": 1.0,
      "verified": true,
      "author": "Barry",
      "helpful_votes": 2,
      "publication_date": 20180604
    },
    {
      "title": "Good sound",
      "text": "The volume did not work on the first one I got, and I called the company. They quickly replaced it and explained how the volume worked with the phone (which was not in paperwork). The new one works fine and sound is adequate, but depends on your phone. I tried to increase volume, but had to do my phone first. I really liked the cheap one I have better because the controls work independent of my phone and controls are visible. I understand that some people want a slick look, but I prefer function and easy access.",
      "rating": 5.0,
      "verified": true,
      "author": "Kellys",
      "helpful_votes": 0,
      "publication_date": 20200205
    },
    {
      "title": "Not a bad speaker.",
      "text": "This is a replacement item. The first speaker did not work properly and I returned it. The seller wanted me to try to make it work but it wouldn't so I sent it back to Amazon. I could not get the Bluetooth to disconnect so I could use the AUX input. This replacement seems to work. The sound quality is very good. If yhou are listening through the Bluetooth and plug in the AUX input, nothing happens unless you press the Bluetooth button to unpair it then the AUX kicks in. When the AUX is disconnected, the Bluetooth once again will re-pair. A little quirky but once you know how to do it it seems OK.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Alien technology?",
      "text": "Update: The battery lasts so long. How do they do it? I have not charged it in two months and it’s working fine. It’s really small and produces great sound. Feels cool to hold something that sounds so nice.Alien technology? It’s easy to pair, but it broadcasts all sound, which can be annoying or catch you off guard.",
      "rating": 5.0,
      "verified": true,
      "author": "Gene Leynes",
      "helpful_votes": 2,
      "publication_date": 20181108
    },
    {
      "title": "Replacement speaker works fine...",
      "text": "Got it turned it on paired it to phone listened to tunes for few hours and it died out. Put on charger using supplied cable and iPhone USB plug. Let it charge overnight and now it just doesn't work at all. Very disappointed. Anker sent me a replacement quickly and this one works. Tested it a few days before updating my review. The sound quality is nothing spectacular but I didn't expect it to be. Does what I expected and wanted.",
      "rating": 4.0,
      "verified": true,
      "author": "John F",
      "helpful_votes": 3,
      "publication_date": 20170811
    },
    {
      "title": "Pretty amazing little gizmo - solid and weighty",
      "text": "I was planning to buy a much more expensive portable speaker but then I found this recommended on a review site I like and looked into it. This is a little workhorse. The sound is very good and the battery life is amazing. It's weighty, probably due to the large battery size, but that makes it perfect for our use. This is our bedroom speaker for background music and audio books. Clear, clean, big sound and a real presence to the sound. Honestly, I can't believe it's this good at this price. Seriously considering it as Christmas gifts for friends.",
      "rating": 5.0,
      "verified": true,
      "author": "JB",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "Owned for 3 years and loved it!",
      "text": "I loved this speaker! But I’ve just replaced it. Okay, so this speaker was awesome. I had it for 3 years. I used it while washing the car, cleaning up around the house and at work. But the thing is, I needed something louder. Great for every activity I mentioned except at work. I drive a diesel truck with no radio so I used this but it’s just not loud enough. But it’s loud, easy to connect to your phone, buttons are straight forward, battery life was the best. No complaints for daily use (if you don’t drive a loud diesel truck) I felt bad replacing it...I’m gonna keep it around because it hasn’t failed me yet.",
      "rating": 5.0,
      "verified": true,
      "author": "Jose Avila",
      "helpful_votes": 0,
      "publication_date": 20200717
    },
    {
      "title": "Excellent speaker.",
      "text": "I'd never thought about buying a Bluetooth speaker before because the ones that I'd heard sounded really awful. Then my brother bought this Anker and when I heard how good it sounded I ordered one right away. I use it to listen to both music and spoken word recordings and it handles both really well. It has a very nice warm mid-range sound with a perfect amount of bass for my taste. I love it. It connects easily to my tablet, laptop and desktop PCs - very simple to use. It's designed and built really well and I love how tactile it is. For the price I'm delighted with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard",
      "helpful_votes": 0,
      "publication_date": 20190528
    },
    {
      "title": "Good quality for the price",
      "text": "We ordered this because my wife wanted a bluetooth speaker to use while working out. The day we got it, she was able to sync it with her iPhone in under 5 seconds. (It also connected to my Android phone in under 5 seconds.) We've only had it for a few days and the battery life out of the box seems good so far. The only thing I noticed was that when it was first connected to my wife's phone, the sound seemed a little off. The sound was a little flat and muted. (It worked fine with my phone.) My wife hasn't complained about the sound, so maybe it was a one time issue.",
      "rating": 4.0,
      "verified": true,
      "author": "KnG",
      "helpful_votes": 0,
      "publication_date": 20200710
    },
    {
      "title": "A solid week of battery",
      "text": "This speaker has the best dam battery ever! Im a dog walker/pet sitting who sleeps with rain sounds; last month I spent two weeks at a client's house sleeping with the rain sounds about eight and a half hours I haven't charged it since. The battery is at seventy percent! I highly recommend this for camping or road trips where the car radio doesn't work. Or idk for the zombie apocalypse😂. The battery life is serious lol",
      "rating": 5.0,
      "verified": true,
      "author": "Amber",
      "helpful_votes": 0,
      "publication_date": 20190715
    },
    {
      "title": "Lasted 19 months",
      "text": "I received this speaker May of 2018, by Dec 2019 it stopped connecting to my phone. I used this great speaker next to my bed, where I would connect it to my phone to play music all night. It stayed plugged in 90% of the time and rarely ever left the table. It still looks like it did the day I got it. The only negative that I have, while it worked, is that it has a tiny blue light on the front that is insanely bight in the middle of the night. I've covered the light with a sticker. I've really enjoyed this speaker and am rather sad that it made it 19 months.",
      "rating": 3.0,
      "verified": true,
      "author": "Katdallen",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "This speaker is equal to a $100+ speaker.",
      "text": "Is this speaker equal to a $200 Bluetooth speaker, no. Is it equal to a $100 speaker, definitely. This is my second Anker speaker. Although, I was completely happy with my first purchase, for this purchase I also shopped more expensive speakers, listening to several high end speakers. The difference was so slight compared to speakers costing 5 times more that I stuck with Anker. The new speaker arrived when expected and was professionally packaged. I charged it overnight and next day it paired with my phone in a few seconds. I replaced a large am/fm radio- CD player in my bathroom with the Anker and listen to Radio.Com and Amazon Prime music with a nicer sound.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Larose",
      "helpful_votes": 0,
      "publication_date": 20171221
    },
    {
      "title": "Doesn't really sound like anything. My laptop sounds better.",
      "text": "So, I got this as a gift for someone and tested it first to make sure I didn't get a dud. First of all is much smaller than I expected, which is not a bad thing. But it doesn't really sound like anything. Maybe it would benefit from a passive bass radiator, I can't hear ANY bass at all. I have an amazon basics speaker that is on a different category. it plays music in my garage and it actually sounds decent. ( this one) I don't think I'll keep this lil guy.",
      "rating": 3.0,
      "verified": true,
      "author": "Nicolas",
      "helpful_votes": 0,
      "publication_date": 20191221
    },
    {
      "title": "Cool purchase.",
      "text": "I randomly came across this just casually looking through amazon. this speaker is small but it does pack a punch. this this is great to take to the beach , at a little gathering with friends or even for the room. the build quality is sturdy and the battery life is fantastic . it does have a bit of lag when connecting but is very minute. defiantly worth the purchase. keep in mind this is a smaller speaker so I would not compare it to one that is bigger , but for the size and price it can't be beat . not to say it isn't loud , because it definitely is . there are reviews on YouTube as well.",
      "rating": 5.0,
      "verified": true,
      "author": "vanessa",
      "helpful_votes": 0,
      "publication_date": 20200818
    },
    {
      "title": "Disappointed",
      "text": "There's an issue with power. It froze and stopped working on the first day. Initially, the battery had died and I charged it. It was playing okay while charging and it was also fine until I unplugged and plugged it back to charge. Now the power button doesn't work, blue light is on and the device doesn't respond. No sound, no turning off, nothing. Disappointed!",
      "rating": 1.0,
      "verified": true,
      "author": "AR",
      "helpful_votes": 0,
      "publication_date": 20200316
    },
    {
      "title": "Fantastic!",
      "text": "I have now purchased two of these. They are so cheap and put out a lot of sound! I use them all the time and my only complaint is that they aren't water resistant. The battery on these lasts for a very long time and I almost forget that they ever need charging. I watch movies and listen to music for a long time before I hear the speaker tell me it is finally needing a charge!",
      "rating": 5.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 2,
      "publication_date": 20180712
    },
    {
      "title": "At first I loved my Anker",
      "text": "At first I loved my Anker, it sounded great and for the price it was fantastic. I had noticed it wasn't connecting to my iPhone 6 plus after a few weeks of use. I thought it was just because my phone was old. I recently upgraded to an Iphone X and again it simply doesnt connect even after charging it completely. I restarted my phone removed bluetooth and turned it back on and once again it is not connecting. I loved the device but this has left me high and dry. disappointed. :-( .",
      "rating": 3.0,
      "verified": true,
      "author": "vicente a duque",
      "helpful_votes": 11,
      "publication_date": 20180118
    },
    {
      "title": "Fantastic speaker! Please buy!",
      "text": "I love this bluetooth speaker! It connects easily with my phone, delivers excellent sound, and the battery lasts basically forever. I think I have only charged it a handful of times in the time I've owned it (definitely more than a year). The only (first world problem) thing about this speaker that is not outstanding is the range from my phone before it cuts out. The non-slip surface of the speaker allows it to sit anywhere without sliding or moving around. This speaker has provided tunes for many backyard bonfires, dairy herd checks (its been dropped a few times too) and Saturday house cleaning sessions. 10 stars!",
      "rating": 5.0,
      "verified": true,
      "author": "Ellie",
      "helpful_votes": 0,
      "publication_date": 20190820
    },
    {
      "title": "BEST VALUE SPEAKER THERE IS!",
      "text": "I'll come back to give a battery life review, but for now I'm pleased. Definitely not my first Anker product, will not be my last. I will be getting a larger unit soon. 6/2/20- Battery holds up as advertised. I used it straight for 24 hours playing music and watching videos, didn't need to charge it once. It took around 24.3 hours to completely drain. Was fully charged in less then 3 hours (I didn't watch it, sorry for no specifics). MY ONLY ISSUE- the mic for speaker phone is not the greatest. I had to switch back to the handset to talk to people. This product is a steal at that price. I will be buying more Anker speakers.",
      "rating": 5.0,
      "verified": true,
      "author": "Maelstrom_master of kaos",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "Love this speaker",
      "text": "Love this speaker. Bass is decent and highs are clear. The battery last forever. Best $30 I have spent in awhile. UPDATE: Battery will not hold a charge only 4 months after minimal use. Pretty disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Teamblend",
      "helpful_votes": 4,
      "publication_date": 20180206
    },
    {
      "title": "A GEM. BUY THIS SPEAKER.",
      "text": "I saw a video on YouTube giving a review of this speaker so I took the plunge. I bought it primarily for my bathroom. It sits on the ledge of a window so I can listen to music while I shower. I make sure it’s a good distance away from intense steam. The bass and volume level is ridiculous for how cheap this is. Honestly it’s probably worth 2-3x what it costs here. The battery life works really well too. I now bring it with my on all of my trips. It’s easy to pack and it’s great in hotel rooms, AirBnbs, and camping. Easy to pair with different phones too if you want to pass around DJ duties. 10/10",
      "rating": 5.0,
      "verified": true,
      "author": "Eric",
      "helpful_votes": 0,
      "publication_date": 20190317
    },
    {
      "title": "Sound quality great",
      "text": "I love the sound quality of this bluetooth speaker. I can hear from the kitchen to the living room, and even upstairs, but the one thing I don't like is that there is a delay between beginning the music to when the actual sound comes from the speaker. I thought it was because I was using Alexa and the speaker was too close, but after moving it to another space, that was not the case. I bought a bluetooth turntable, and the delay was there between the beginning of the song and when the actual sound came from the speaker. Maybe someone can explain if I'm doing something wrong.",
      "rating": 4.0,
      "verified": true,
      "author": "Sher P.",
      "helpful_votes": 0,
      "publication_date": 20200405
    },
    {
      "title": "Battery Indicator?  Don't bother looking",
      "text": "I am giving this product only a 2 star because I know it will cause me a lot of frustration not knowing the percentage left in the unit before I grab it to take it somewhere. It simply has it the light is red it needs to be recharged!!! That's not good enough. I am surprised a product as such does not come with one button press that would say \" battery is at 35%\" Not so smart and user friendly. The sound is good. A bit too heavy ion the base but acceptable. But because of the lack of a battery indicator I would not buy it again.",
      "rating": 2.0,
      "verified": true,
      "author": "PICKY Shopper",
      "helpful_votes": 0,
      "publication_date": 20200604
    },
    {
      "title": "Excellent for Voices",
      "text": "I bought this small speaker mainly for news and talk shows on the radio. I use it with radio station apps on my iPhone. Voices come through very clear with a nice rich tone quality. A huge improvement over conventional radio speakers. It connects quickly to Bluetooth and stays connected. I’m very pleased with it!",
      "rating": 5.0,
      "verified": true,
      "author": "Lone Ranger",
      "helpful_votes": 0,
      "publication_date": 20201005
    },
    {
      "title": "Makes annoying beep when tasing volume via Mac and constantly forgets connection",
      "text": "Absurd that this speaker must make a loud disrupting beep every single time you change the volume --when using a Mac to listen to iTunes. Wth? Who needs a disturbing beep interrupting their music to tell them they've just changed the volume?! And there's no setting that can prevent this. Plus, the speaker loses the connection if I haven't used it in a few days even though its continually plugged in and the bluetooth is always running on my desktop Mac. Not at all impressed with the sound level in a small 14 x12' room either.",
      "rating": 3.0,
      "verified": true,
      "author": "J. Clements",
      "helpful_votes": 0,
      "publication_date": 20200721
    }
  ],
  "product_meta": {
    "title": "Bluetooth Speakers, Anker Soundcore Bluetooth Speaker with Loud Stereo Sound, 24-Hour Playtime, 66 ft Bluetooth Range, Built-in Mic. Perfect Portable Wireless Speaker for iPhone, Samsung and More",
    "description": "Color:BlackSoundCore \nThe Bluetooth Speaker with Superior Sound and Playtime.\n\n\nFrom ANKER, the Choice of 10 Million+ Happy Users \n• Industry-Leading Technology\n\nSuperior Sound Quality \nWherever life takes you, experience your music with powerful stereo sound and crisp, tight bass. Boasting less than 1% total harmonic distortion, SoundCore sounds great even at the highest volumes.\n\nIncredible Battery Life \nAnker's industry-leading power management technology keeps your tunes playing for up to 24 hours on a single charge—that's over a week's worth of playtime (based on average usage).\n\nUncompromised Portability \nTo keep SoundCore small but also sounding great, we've designed it using a unique spiral bass port design. The result is a clean bass sound you can easily pick up and put in your bag.\n\nBluetooth 4.0 Connectivity \nUnlike most other speakers, SoundCore uses the very latest Bluetooth technology to maximize device compatibility and pairing speed.\n\nWorry-Free Warranty \nAt Anker, we believe in our products. That's why we back them all with an 18-month warranty and provide friendly, easy-to-reach support.",
    "rating": 4.6,
    "feature_bullets": [
      "ASTONISHING SOUND: Breathtaking stereo sound with deep bass is delivered with exceptional clarity and zero distortion by two high-sensitivity drivers and a patented bass port.",
      "24H WORRY-FREE BATTERY LIFE: Anker's exclusive, long-life battery technology provides 24 hours of sublime music.",
      "EFFORTLESS CONNECTIVITY: Bluetooth 4.0 ensures instant pairing and maintains a strong connection up to 66 ft.",
      "DESIGNED TO PLAY: Combines a solid, drop-proof build with tactile materials and seamless controls.",
      "GRAB, GO, LISTEN: Lightweight, yet robust unibody design provides the perfect soundtrack for the park, yard, or anywhere else at home or away."
    ],
    "specifications": {
      "Product Dimensions": "6.5 x 2.1 x 1.9 inches",
      "Item Weight": "12.6 ounces",
      "Manufacturer": "Anker",
      "ASIN": "B016XTADG2",
      "Item model number": "A3102011",
      "Batteries": "1 Lithium ion batteries required.",
      "Customer Reviews": "4.6 out of 5 stars37,835 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#4 in Portable Bluetooth Speakers#37 in MP3 & MP4 Player Accessories",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "October 21, 2015"
    },
    "categories": [
      "Portable Audio & Video",
      "Portable Bluetooth Speakers",
      "Electronics",
      "Portable Speakers & Docks"
    ],
    "price": 27.99
  }
}