{
  "website_summaries": [
    {
      "verdict": "A large, multi-function European convection oven with a 5 burner stove.",
      "pros": [
        "The oven in this range offers an impressive 4 cubic feet of cooking space",
        "It has a black ceramic glass cooktop with 5 sealed elements (one dual center)",
        "The body is stainless steel and the control knobs are chrome, which give the unit a crisp, clean look"
      ],
      "cons": [
        "Some individuals have noted that the oven in this model takes a bit longer than expected to preheat"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "safety issue",
      "text": "beautiful stove but major safety issue imo. the vent on the back puts off a ton of heat onto our backsplash and heats up the tile so hot to where i dont see how this isnt dangerous over time. i turn on the exhaust fan above everytime in fear of the stove catching the wall on fire.",
      "rating": 2.0,
      "verified": true,
      "author": "Glenn Chandler",
      "helpful_votes": 8,
      "publication_date": 20190506
    },
    {
      "title": "Excellent Customer Service",
      "text": "Robert from Executive Appliance was great He was in touch and informative throughout the whole purchase and shipping process He really went over and above to ensure I was in the loop at every step and i would highly recommend purchasing from this seller The oven itself is a little flimsy and not exactly what i would have expected for this dollar amount but there really are very limited options for a 36” electric range and overall i am satisfied with the purchase so far",
      "rating": 5.0,
      "verified": true,
      "author": "Skeeter McGee",
      "helpful_votes": 3,
      "publication_date": 20190706
    },
    {
      "title": "Beautiful oven and great customer service",
      "text": "It’s a beautiful addition to our kitchen. Really a stand out feature. The seller was very helpful in making sure we knew about the product and all it’s features. We live in a remote place and the seller took extra care to make sure we received the oven in a timely manner. They went above and beyond. Excited to bake and cook many meals with this beauty.",
      "rating": 5.0,
      "verified": true,
      "author": "Christi Easton",
      "helpful_votes": 5,
      "publication_date": 20190519
    },
    {
      "title": "The stove arrived with a non working burner. It ...",
      "text": "The stove arrived with a non working burner. It has yet to be resolved. I've written, called written & called. Still nada.",
      "rating": 3.0,
      "verified": true,
      "author": "kimberly mae evans",
      "helpful_votes": 17,
      "publication_date": 20160907
    },
    {
      "title": "So beautiful!",
      "text": "I bought this oven to fit in the 36\" space left behind from removing an old drop in. Best choice ever. It looks beautiful and works wonderfully. Can't wait to get the 2\" backsplash to complete the look! Once I'm done refurbishing my cabinets and laying new floor, this oven is going to be the gem of the kitchen. Another note - Robert from Executive Appliance is an absolute gem. So helpful and communicative. I'll be returning to him for other appliance needs in the future!",
      "rating": 5.0,
      "verified": true,
      "author": "Abby",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "Best 36 inch electric range for the price!",
      "text": "I love this Italian Made electric range. This is the best one I have ever cooked on. It has five burners that are all different sizes. Looks beautiful. I would definitely recommend it. Best 36” electric range for the $.",
      "rating": 5.0,
      "verified": true,
      "author": "Galina German",
      "helpful_votes": 0,
      "publication_date": 20200314
    },
    {
      "title": "LOVE THIS STOVE!",
      "text": "beautiful and wonderful stove. Works very well. Customer service was incredible! Highly recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Yelena Aliy",
      "helpful_votes": 0,
      "publication_date": 20200828
    },
    {
      "title": "Phenomenal Customer Service",
      "text": "Can not say enough nice things about Mr. Maxwell. He ensured that this product was shipped out the same day when he found that we were a non-profit long term care home. Our Elders are assured a wonderful Thanksgiving feast. I endorse their products and excellent service. Thank you so much.",
      "rating": 5.0,
      "verified": true,
      "author": "Cynthia R.",
      "helpful_votes": 0,
      "publication_date": 20191122
    },
    {
      "title": "Highly recommend!",
      "text": "I can’t say enough how much I love this range and how amazing the customer service was working with Executive Appliance. Robert went above and beyond to arrange delivery and make sure we were happy with our purchase. Highly recommend!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191111
    },
    {
      "title": "White Glove Delivery and Service",
      "text": "The distributor personally contacts you for shipment details and product information. The range is beautiful, so much room inside! I will be purchasing my other appliances through them in the future!",
      "rating": 5.0,
      "verified": true,
      "author": "stephanie  hodgins",
      "helpful_votes": 0,
      "publication_date": 20200821
    },
    {
      "title": "THE MOST BEAUTIFUL RANGE WE'VE EVER OWNED",
      "text": "Love our new range. It is beautiful and we get so many compliments on it!",
      "rating": 5.0,
      "verified": true,
      "author": "Laura R.",
      "helpful_votes": 2,
      "publication_date": 20190225
    },
    {
      "title": "Outstanding",
      "text": "Outstanding customer service. Delivery was exceptional. Range looks great, and is functioning perfectly",
      "rating": 5.0,
      "verified": true,
      "author": "mike digregorio",
      "helpful_votes": 0,
      "publication_date": 20200501
    },
    {
      "title": "Took a Chance",
      "text": "So we just purchased a new house w/o appliances and needed a stove. We took a chance after reading the reviews and decided to go with this appliance. I'm happy we did! This thing has been amazing since installation. Cooks, bakes, broils and you name it. Not to mention it looks great in our new kitchen. So happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "thomas lane",
      "helpful_votes": 0,
      "publication_date": 20201207
    },
    {
      "title": "Absolutely gorgeous",
      "text": "The seller's (Executive Appliance) customer service is outstanding and the Verona Range is everything I wanted!",
      "rating": 5.0,
      "verified": true,
      "author": "Mary T",
      "helpful_votes": 0,
      "publication_date": 20201123
    },
    {
      "title": "Tranquil",
      "text": "This is the best sleek modern and functional oven ever love it!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Mateo Figueroa",
      "helpful_votes": 0,
      "publication_date": 20201120
    }
  ],
  "product_meta": {
    "title": "Verona VEFSEE365SS 36\" Electric Range with 4 cu. ft. European Convection Oven Black Ceramic Glass Cooktop 5 Burners Dual Center Element Chrome Knobs and Handle: Stainless Steel",
    "description": "Color:Stainless SteelVEFSEE365SS Finish: Stainless Steel Features: -5 Elements. -Convection oven. -Full width storage drawer. -Digital clock and timer. -Comes with gloss top. Product Type: -Free-standing. Control Type: -Knobs. Accessories Included: -Backsplash. Number of Ovens: -Single oven. Fuel Type: -Electric. Convection Oven: -Yes. Cooktop Surface: -Smoothtop. Number of Burners: -5. the top have 5 Sealed (electric)Elements Dual Center Element, Not induction Left Front Element: 1700W - 6.875\" Right Front Element: 1200W - 5.5\" Center Element: 2100/700W - 9-5\" Left Rear Element: 1200W - 5.5\" Right Rear Element: 1700W - 6.875\"Primary Material: -Steel. Oven Capacity: -4 Cubic Feet. Dimensions: Overall Height - Top to Bottom: -37\". Overall Width - Side to Side: -35.88\". Overall Depth - Front to Back: -24\". Overall Product Weight: -250 lbs. Hardwire- 120/240 Volts Amps:50A - Plug Not Included - Residential Use Only",
    "rating": 4.6,
    "feature_bullets": [
      "Made in Italy- Black Ceramic Glass Cooktop 304 Stainless Steel",
      "Multi Function European Convection Oven, Storage Drawer, Racks 2 , Clock Timer",
      "5 Sealed Elements Dual Center Element, Black Ceramic Glass Cooktop Chrome Knobs Stainless Steel Oven Handle",
      "EZ Clean Porcelain Oven Surface,Primary Oven Capacity 4 cu.ft. Oven Width: 29.875\" Oven Depth: 16.5\" Oven Height: 13.75\" Dimensions Width: 35.875\" Height: 35.375\" Depth: 24\" Exterior Width: 36\" Included Backguard 2\"",
      "120/240 Volts Amps:50A - 2 Year Manufacturer Warranty"
    ],
    "specifications": {
      "Product Dimensions": "24 x 35.88 x 37 inches",
      "Item Weight": "250 pounds",
      "Manufacturer": "Verona",
      "ASIN": "B016V2GJLY",
      "Item model number": "VEFSEE365SS",
      "Customer Reviews": "4.6 out of 5 stars22 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#2,097 in Appliances",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "May 14, 2015"
    },
    "categories": [
      "Appliances",
      "Ranges, Ovens & Cooktops",
      "Ranges",
      "Freestanding Ranges"
    ],
    "price": 2899.0
  }
}