{
  "website_summaries": [
    {
      "verdict": "Android and an awesome keyboard make the Priv the best BlackBerry in years, but if you're not a keyboard lover and aren't much of a security seeker, you'll find phones that are cheaper, or offer better features than the Priv.",
      "pros": [
        "The BlackBerry Priv delivers strong performance in a sleek, solid package",
        "The subtle tweaks to Android are useful, and the compact keyboard packs in useful functionality",
        "It's also fun to slide open, over and over again"
      ],
      "cons": [
        "The keyboard is a bit narrow for large hands, and the device feels top heavy when fully extended",
        "This security-focused phone is missing a few modern protection options, like a fingerprint reader or iris scanner"
      ],
      "aspects": {
        "Design": 8.0,
        "Features": 8.0,
        "Performance": 7.0,
        "Camera": 6.0,
        "Battery": 7.0
      },
      "publication_date": 20151105,
      "rating": 7.6,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Beware! Carrier unlocked vs factory unlocked.",
      "text": "The phone is very nice. This is more of a warning to people to confirm what they are getting. Most of these sellers are listing \"Unlocked Priv\" and are showing pictures of the factory unlocked device. Don't be surprised if you get an AT&T branded phone at your door. While it will be \"carrier unlocked,\" this is not the same as a factory unlocked phone. You will get the carrier bloatware along with being at the mercy of the carrier for your software updates.",
      "rating": 4.0,
      "verified": true,
      "author": "Sparks",
      "helpful_votes": 37,
      "publication_date": 20160429
    },
    {
      "title": "Husband loves it!",
      "text": "Got it for my husband, a die-hard blackberry fan. He enjoys the access to android apps while maintaining all the blackberry features. The display is large and HD. Nice looking phone overall! He's had it for over 10 months now and working flawlessly. No complaints.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 9,
      "publication_date": 20161126
    },
    {
      "title": "BlackBerry or Not",
      "text": "After a year+ the battery will not hold a charge for more than a few hours, 3-4. I have been a BlackBerry loyalist for a very long time, but this experience with what is a top of the line phone has influenced me to look at alternative, Samsung. Also, questions on how the Key series compares, guessing the same issue.",
      "rating": 1.0,
      "verified": true,
      "author": "Thom Crossley",
      "helpful_votes": 2,
      "publication_date": 20190705
    },
    {
      "title": "Exceeded Expectations by Far",
      "text": "BlackBerry Hub system is still best way to organize incoming messages of all types. Keyboard is great and as a longtime BB user I find it indispensable for multiple paragraph correspondence. In fact it's better than most tablets. Now with access to Android and Google it is a great phone. I brought it to the ATT store where tech got it going in ten minutes. Only problem has been low phone volume, but that is better after Marshmallow update, which was easily done. So, I got it for Android and keyboard, but it exceeds my expectations in many other ways.",
      "rating": 5.0,
      "verified": true,
      "author": "PTA45",
      "helpful_votes": 3,
      "publication_date": 20170204
    },
    {
      "title": "Okay, not great",
      "text": "This phone is okay, but it's kind of a strange mix of Android and Blackberry features. I use this as well as an iPhone, and the touch screens have very different responses, which makes it hard to get used to. It's also not the best Bb keyboard -- I have small hands and it still feels too small. It is nice to have the benefits of a Blackberry with the access of the Android platform, but it's not very easy to navigate and I would not buy another one. Also, there is no way to block numbers, and even setting an individual ringtone to silent is a twenty-step process, so I get a lot of annoying calls.",
      "rating": 3.0,
      "verified": true,
      "author": "Erin Henderson",
      "helpful_votes": 0,
      "publication_date": 20171203
    },
    {
      "title": "Best Android I have used!  On par with Blackberry quality and security.  I just wish the AMOLED screen were brighter...",
      "text": "This is my fourth or fifth Blackberry phone. This PRIV replaces a Z10, and I still use a Z3 as my business phone. It was a difficult decision to switch to the Android platform, since security is a concern and it seems to me that Android is far from secure. Thanks to Blackberry and myriad additional security measures, I really enjoy this phone. My only complaint is that the screen is not bright enough for use outdoors. While my other BBs are easily bright enough to be used in direct sunlight (Florida sunlight), with the PRIV I have to take off my sunglasses and even shield the screen to adequately see it.",
      "rating": 4.0,
      "verified": true,
      "author": "The Truth and Only the Truth",
      "helpful_votes": 0,
      "publication_date": 20170906
    },
    {
      "title": "Slow, hot with a weak battery",
      "text": "So I've had this phone for about 2 months now. This is what I've found. Pros: - The slider is good - The hardware feels nice - The screen looks nice Cons: - It is SLOW. I cannot over state this. After about a week you'll want to throw it out a window (and watch it slowly fall to the ground). - It gets HOT. Occasionally displaying a warning about the temperature. Usually happens when streaming, charging the battery, or using video chat. - Weak battery life. Don't expect to get through a full (half) day with this phone.",
      "rating": 2.0,
      "verified": true,
      "author": "Gilberto Lawas",
      "helpful_votes": 3,
      "publication_date": 20180205
    },
    {
      "title": "My favorite phone of all time",
      "text": "I've been a BlackBerry lover for a long time and this is my favorite one so far. Actually it's my favorite phone of all time. Easy to use, has both the physical keypad and the electric one so best of both worlds. Has all the apps of an Android phone and the security and feel of a BlackBerry. This might be strange but I love that it says BlackBerry on it. If you like Android or BlackBerry consider this phone, it's very good and much cheaper than the newest smart phones yet works great. Good battery life too.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim Hall ",
      "helpful_votes": 0,
      "publication_date": 20171021
    },
    {
      "title": "Check your carrier first if you need WiFi calling feature. I could not access that, otherwise I'm sure you will LOVE this phone.",
      "text": "As much as I liked this phone I had to return it. Problem is where I am my cell signal is VERY poor so I rely on WiFi calling. While this device has that feature I was unable to use it with my Consumer Cellular because their providers (AT&T and T-Mobile) don't support this phone for WiFi calling via MVNO's Bummer....its a really neat phone. Check first if you want or need to use WiFi calling feature. Otherwise I bet you'd love this phone.",
      "rating": 3.0,
      "verified": true,
      "author": "Paul Kruger",
      "helpful_votes": 0,
      "publication_date": 20180429
    },
    {
      "title": "This is the second BlackBerry Priv I've purchased.. ...",
      "text": "This is the second BlackBerry Priv I've purchased... the first lasted me 23 months, then was bricked during a recent update, coincidently 24hrs after my charging port broke. I was able to charge it wirelessly, but then it was bricked. If anyone knows any reputable business I can mail it to, to restore it and hopefully aquire recent contacts stored on the device, that would be outstanding!!!",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180513
    },
    {
      "title": "Phone came broken.",
      "text": "I don't like that the phone I was sent has a cracked shell and the camera has a grain of something that makes pictures a little off. The microphone that you use to talk with on the phone is broken so in order to call, I have to use speakerphone. That's annoying. The battery lasts all day, so there's that plus. The device also came much earlier than anticipated. There wasn't a box or anything though, just bubble wrapping and a sealed envelope.",
      "rating": 2.0,
      "verified": true,
      "author": "Cotey",
      "helpful_votes": 0,
      "publication_date": 20180921
    },
    {
      "title": "Nice, large screen",
      "text": "Nice, large screen. The only complaint I have is that the keyboard is too small, so typing on it takes some getting used to. Given the overall size of the phone, you might expect that there could be larger keys, and a separate row for the number keys. Other than that, everything is working well.",
      "rating": 4.0,
      "verified": true,
      "author": "owl",
      "helpful_votes": 2,
      "publication_date": 20170123
    },
    {
      "title": "PRIV...well worth the investment!",
      "text": "Absolutely the best phone I ever had!!! I've used either the BlackBerry Classic or Bold for over 12 years and would never consider any phone other than a Blackberry. I was hesitant at first about buying the PRIV, but now that I have had it for about three weeks it's amazing, especially since it's on the Android platform. I now have the best of all worlds regarding Smartphone technology and security. Well worth the investment.",
      "rating": 5.0,
      "verified": true,
      "author": "D2",
      "helpful_votes": 2,
      "publication_date": 20160510
    },
    {
      "title": "Surprisingly great phone",
      "text": "Really good fast phone with a great camera and tons of BlackBerry services and battery life which help make the device standout. I like it more than expected and very satisfied. Only knock is most of the stock Google Apps outside of maps are meh but otherwise I'm impressed.",
      "rating": 5.0,
      "verified": true,
      "author": "joey",
      "helpful_votes": 3,
      "publication_date": 20160206
    },
    {
      "title": "Physically the phone is perfect I love that it has an option for a ...",
      "text": "Physically the phone is perfect I love that it has an option for a physical keypad and it feels pretty solid so no complaints there, but it dos have some odd software hiccups nothing that would break my opinion of the phone just a little annoying besides that I still think it is an amazing phone.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric",
      "helpful_votes": 3,
      "publication_date": 20160613
    },
    {
      "title": "I looked at the key one nice phone but honestly this phone the blackberry PRIV is ...",
      "text": "I looked at the key one nice phone but honestly this phone the blackberry PRIV is still the best android phone that blackberry and tlc put together hands down the slider really makes this phone. Stand alone love it",
      "rating": 5.0,
      "verified": true,
      "author": "lemuel lopez",
      "helpful_votes": 2,
      "publication_date": 20171222
    },
    {
      "title": "Amazing device",
      "text": "This is the best phone I have ever had. The keyboard is amazing as is expected from a BlackBerry. The screen's readability and the camera's image quality are remarkable. I highly recommend this phone.",
      "rating": 5.0,
      "verified": true,
      "author": "Long-time Amazon fan",
      "helpful_votes": 0,
      "publication_date": 20170914
    },
    {
      "title": "\"Un\"locked Phone",
      "text": "The phone is great. But I wanted an unlocked phone, which it is not. The phone keeps asking me for a SIM code. I have to figure out a way to unlock it myself or return it. So, in a way that was not an accurate description of the item.",
      "rating": 1.0,
      "verified": true,
      "author": "Fritzybuzz1",
      "helpful_votes": 0,
      "publication_date": 20180628
    },
    {
      "title": "Great battery life, otherwise...meh...",
      "text": "Pros 1. Great battery life....on my second day and still 45% left. 2. Nice screen Cons 1. The shape of this phone is very uncomfortable to hold. It digs into your hand. 2. The physical keyboard is just ok, but useless, generally speaking. I only use it as a slider for reading. Ergonomically speaking not as natural as they used to be. 3. As another reviewer mentioned, there's a slight movement between the body and the slider part when closed. Sometimes my hair gets stuck in the gap, when I'm talking on the phone... Very annoying.",
      "rating": 1.0,
      "verified": true,
      "author": "Stafsoft",
      "helpful_votes": 8,
      "publication_date": 20160121
    },
    {
      "title": "I love my Priv and was one of the first to ...",
      "text": "Hard, hard fail on the part of the seller, not the device. I love my Priv and was one of the first to order one when it first came out, but I managed to finally drop mine and break the thing so I ordered up a replacement from this seller when it claimed to be a factory unlocked model. IT IS NOT. After a hilariously silly eight days of shipping I finally received a VERIZON phone loaded with Verizon bloatware that could not be deleted. Immediate return. I will not live with that crap. Bad seller. BAD. Do not trust this seller to provide what they promise.",
      "rating": 1.0,
      "verified": true,
      "author": "Benjamin J. Wojdyla",
      "helpful_votes": 0,
      "publication_date": 20180416
    },
    {
      "title": "Out of all mobiles I've owned, this one blows me away!",
      "text": "Best mobile phone i've had. I've tried all of them, everything from iPhone 5s and 6s, Samsung Galaxy, Nokia. This phone blows me away. They've thought about all the little details, it's super responsive, keyboard is the fastest I've experienced. I wanted to add Facebook events to my calendar and wasn't sure how to, spoke with Blackeberry on Twitter and they fixed me up. Very happy, thanks Blackberry!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 6,
      "publication_date": 20160130
    },
    {
      "title": "the only thing i dislike is the size",
      "text": "still my fav android phone even after all these years. the only thing i dislike is the size, a bit too boxy for my front pockets. but it is still supported and i might skip the the next gen android based blackberrys and keep this alive for as long as it is supported. for us older gents that remember using a keyboard for typing, the keyboard is a welcome feature",
      "rating": 5.0,
      "verified": true,
      "author": "Ashvin Boodhun",
      "helpful_votes": 0,
      "publication_date": 20180624
    },
    {
      "title": "Model for this listing unclear",
      "text": "WARNING: While you may have ended up here searching for a STV100-1, the model I received from Mango Wireless was the STV100-2. I don't know why this listing doesn't contain the model number.",
      "rating": 4.0,
      "verified": true,
      "author": "Steven Rossi",
      "helpful_votes": 3,
      "publication_date": 20170812
    },
    {
      "title": "While the item that I received was, in fact ...",
      "text": "While the item that I received was, in fact, an unlocked version of this phone, it was an AT&T branded unlocked phone. It will work on any GSM network, but the unlocked AT&T versions of this phone are currently unable to receive security updates or other software upgrades unless you are connected to the AT&T network with an AT&T SIM card. If this is acceptable for you, then by all means this phone will work well. As for me, I can say that the return process has gone very smoothly.",
      "rating": 2.0,
      "verified": true,
      "author": "Steven",
      "helpful_votes": 3,
      "publication_date": 20160708
    },
    {
      "title": "Very poor product, overheats",
      "text": "I purchased this phone because I liked the physical keyboard. 9 months later, the phone has died. It will not charge and does not turn on. I am very disappointed because I trusted the BlackBerry brand, which until now, I really loved. I disliked the fact that it overheard and gets so hot you cannot put it to your ear. I really liked the physical keyboard and size, but that was it. I do not think In will purchase another smartphone using this method again",
      "rating": 2.0,
      "verified": true,
      "author": "RoseofSharon",
      "helpful_votes": 0,
      "publication_date": 20180419
    },
    {
      "title": "but this is a fine android phone",
      "text": "Using a tiny onscreen keyboard really slows me down, so I got this for the real keyboard. Turns out the screen is big enough to have an onscreen keyboard that is reasonable to use. I never had a blackberry before, but this is a fine android phone. eye candy. It supports the 802.11ac standard for WiFi, so I was able to get 450Mbps d/l speed. (no, that is not a typo) Liked it so much I gave one as a gift.",
      "rating": 5.0,
      "verified": true,
      "author": "Milo Wadlin",
      "helpful_votes": 8,
      "publication_date": 20160826
    },
    {
      "title": "Physical keyboard is awesome.",
      "text": "One of the best phones i used so far. I really like the physical keyboard of this phone. Something unique.",
      "rating": 5.0,
      "verified": true,
      "author": "Vardhaman",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "Quality not good.",
      "text": "It's not a good product lot of problem in this phone. I make a big miss tack to by it.",
      "rating": 1.0,
      "verified": true,
      "author": "Md.Refatuzzaman o.",
      "helpful_votes": 0,
      "publication_date": 20200221
    },
    {
      "title": "It is working good now, but customer support was required from both ...",
      "text": "This is not a factory unlocked phone. It is an AT&T version. It is carrier unlocked. It is working good now, but customer support was required from both T-Mobile and Blackberry several times to achieve this.",
      "rating": 3.0,
      "verified": true,
      "author": "Sparky",
      "helpful_votes": 5,
      "publication_date": 20160702
    },
    {
      "title": "Loved it!",
      "text": "I purchased this product and LOVED it! The seller said it had minor scratches but I HONESTLY reviewed the cellphone carefully once it arrived because YES I was that excited...lol! And barely could see any. I was so happy. It was worth the price! It even came as if I had purchased it from Blackberry itself, I was impressed and VERY HAPPY. I only noticed a month later that when I scroll down in the APPs page that it's slightly glitches. Either way, It's a 5.",
      "rating": 5.0,
      "verified": true,
      "author": "Max Salgado",
      "helpful_votes": 0,
      "publication_date": 20170215
    },
    {
      "title": "So the phone is awesome don't but from this shipper",
      "text": "So the phone is awesome don't but from this shipper. 2nd phone I bought from them n u my opinion it was damaged or faulty n their response was contact blackberry great thank you. Would others buy again.",
      "rating": 1.0,
      "verified": true,
      "author": "ollie",
      "helpful_votes": 0,
      "publication_date": 20180201
    },
    {
      "title": "The shortcut keys on the keyboard works great and the touch pad works great as well",
      "text": "I've been using this phone for 9 days now and I have no complaints. I don't do much on the phone aside from Facebook, YouTube, and PoGo. The shortcut keys on the keyboard works great and the touch pad works great as well. I have no complains. Although one thing that upset me a little was the lack of headphones and the brick it came with was going bad charging the phone in 3+ hours. Still 5 stars because I paid for a factory unlocked phone that wasn't carrier branded and that's what I received and I couldn't be happier.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171119
    },
    {
      "title": "battery life isn't great, but manageable",
      "text": "As expected with most phones, the battery life isn't great. I generally charge it once, maybe twice, in a day. But I'm also overloading it pretty good with a game or two and a lot of messaging. They keyboards (physical and virtual) are amazing as always- accurate and responsive. I have small hands though, so that does factor in to being able to use those small buttons. I love this phone!",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180206
    },
    {
      "title": "Love Having a Keyboard!",
      "text": "It's great to have a smartphone with a keyboard in this era of difficult-to-use smartphones. Some added bonuses are great battery life and advanced security features.",
      "rating": 5.0,
      "verified": true,
      "author": "Dave",
      "helpful_votes": 0,
      "publication_date": 20190213
    },
    {
      "title": "Works good.",
      "text": "Works good unlocked. Placed a US mobile sim card in it an the phone works fine. Love the actual phone itself with some of the old Blackberry swiping features.",
      "rating": 5.0,
      "verified": true,
      "author": "katieok",
      "helpful_votes": 0,
      "publication_date": 20180306
    },
    {
      "title": "Four Stars",
      "text": "Good phone. Battery and keyboard issues sometimes. But aesthetically pleasing and functions just as good as any android phone.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180712
    },
    {
      "title": "I would recommend you turn off all the add all the added ...",
      "text": "I would recommend you turn off all the add all the added display features and disable all the blacberry hub stuff as they use too much battery, after you turn that off it is a great phone, the only problem is the camera is a bit dated",
      "rating": 5.0,
      "verified": true,
      "author": "King",
      "helpful_votes": 0,
      "publication_date": 20170728
    },
    {
      "title": "Excellent product",
      "text": "I'm very satisfied with this product. It has a physical keyboard that is hidden. Android, what else can be said.",
      "rating": 5.0,
      "verified": true,
      "author": "Ashton Ramlogan",
      "helpful_votes": 0,
      "publication_date": 20181212
    },
    {
      "title": "Android phone with a keyboard!",
      "text": "Been waiting a while for another android slider. Keyboard works great, I can almost type without looking at the phone. Nice to be able to answer calls by flicking the phone open (even if you're wearing gloves). Keyboard doubles as a trackpad. Supports HDMI (slimport) and USB OTG. Also wireless charging, as well as QC 2.0. I get about 5-6hr screen-on-time on average. The best part of this phone is the ability to hang up by SLAMMING THE PHONE SHUT!!! YEAH!!!!! ...uh, sorry, got a little carried away there.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin W.",
      "helpful_votes": 6,
      "publication_date": 20160202
    },
    {
      "title": "Dying brand....",
      "text": "Really disappointed. Not even 2 months after buying it, the charging port started acting up. I also have to keep restarting the phone because it keeps freezing up. Wish BlackBerry would make it right. I don't make a whole lot and I needed a phone. Used to love BlackBerry products years ago which was reason why I brought the phone. Expected better and received less.",
      "rating": 1.0,
      "verified": true,
      "author": "God's Child 2016",
      "helpful_votes": 0,
      "publication_date": 20180524
    },
    {
      "title": "Love, love",
      "text": "Love, love, love this BlackBerry. This is my 4th BlackBerry phone, but my first PRIV. The Google Android system is great, texting/emailing is super easy with the slide out keyboard, and it's very quick and clear. Had lots of non-BB users notice this phone and comment on it's sleek look with the rap-around screen and slide out keyboard. Would absolutely buy again!",
      "rating": 5.0,
      "verified": true,
      "author": "megmanderson",
      "helpful_votes": 2,
      "publication_date": 20161017
    },
    {
      "title": "\"This is a great cellphone! \" But the only bad thing was ...",
      "text": "My son says, \"This is a great cellphone!\" But the only bad thing was the screen. It was somewhat \"bubbled\" up... Very odd...",
      "rating": 3.0,
      "verified": true,
      "author": "AF",
      "helpful_votes": 0,
      "publication_date": 20180209
    },
    {
      "title": "Good phone",
      "text": "The only downside is that it cannot upgrade above android 6.",
      "rating": 4.0,
      "verified": true,
      "author": "sanjay ramkissoon",
      "helpful_votes": 0,
      "publication_date": 20190124
    },
    {
      "title": "Awesome big and easy",
      "text": "Love it it is big it is easier for me text sense I have problems with texting with smaller phone with my hand finger issues.",
      "rating": 5.0,
      "verified": true,
      "author": "Rose",
      "helpful_votes": 0,
      "publication_date": 20170328
    },
    {
      "title": "If you like spending hours on the phone with outsourced technical support",
      "text": "Horrible experience. Unreliable and flawed phone. Blackberry tech support couldn't fix a speakerphone problem after hours on the phone with them, so they sent me a new phone. After only 1 month, the screen became unresponsive. Again, after many more hours on the phone with tech support, they advised me to do a factory reset. That did not work either so I had to send it back. I am on my 3rd PRIV, and have already begun shopping a new phone. Don't waste your time or your money. The tiny QWERTY keyboard just isn't worth it.",
      "rating": 1.0,
      "verified": true,
      "author": "Dr. S. Oliva",
      "helpful_votes": 7,
      "publication_date": 20170529
    },
    {
      "title": "Not for Verizon...",
      "text": "This is a great phone. The only problem with the listing is that it says it is unlocked, \"..choose your phone first and carrier second...\" It is unlocked but only for certain towers. So if you have Verizon you will want to make sure that you get the one linked to their towers. If you have AT&T or T-Mobile you should be fine. I do recommend this phone though.",
      "rating": 3.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20170918
    },
    {
      "title": "It works great!",
      "text": "Went from a Samsung S8 to this phone. It works great!",
      "rating": 5.0,
      "verified": true,
      "author": "Moses",
      "helpful_votes": 0,
      "publication_date": 20180222
    },
    {
      "title": "The phone never worked correctly, I tried to have ...",
      "text": "The phone never worked correctly, I tried to have some help from amazon and it made me just walk on circles.",
      "rating": 2.0,
      "verified": true,
      "author": "Karen",
      "helpful_votes": 0,
      "publication_date": 20180302
    },
    {
      "title": "I purchased this phone to replace BlackBerry Priv I purchased ...",
      "text": "I purchased this phone to replace BlackBerry Priv I purchased directly from BlackBerry. I have had dropped called and connectivity issues constantly. I've been told it is most likely because the phone is not unlocked as it was sold.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180305
    },
    {
      "title": "Fantastic mobile",
      "text": "Bought this for my wife as she is a Blackberry fan and needed a replacement for her Blackberry Classic. She really likes the Priv. It takes fantastic photos and she loves the accessibility to more apps via Android but with the qwerty much loved Blackberry keyboard. I'm definitely in her good books for a long time...",
      "rating": 5.0,
      "verified": true,
      "author": "Jordan Ogborn",
      "helpful_votes": 4,
      "publication_date": 20160616
    },
    {
      "title": "Screen Malfunction",
      "text": "About one year and 2 months after I acquired this product, and having never dropped it majorly or have it exposed to humidity, out of nothing I opened the keyboard and half of the screen turned into grey static. It never came back to normal neither was I able to fix it nor find information about this. I loved the time I had it, but I feel like I wasted my money on a one year phone.",
      "rating": 3.0,
      "verified": true,
      "author": "João",
      "helpful_votes": 0,
      "publication_date": 20180620
    },
    {
      "title": "Beautiful phone and works great on T-mobile",
      "text": "Phones is a beauty, works great with T-Mobile, even purchased a Sim car cutter so I can cut my micro Sim to a nano sim.",
      "rating": 5.0,
      "verified": true,
      "author": "Preston Patton",
      "helpful_votes": 0,
      "publication_date": 20170717
    },
    {
      "title": "I received Blackberry purchased from Amazon USA which reached me ...",
      "text": "I received Blackberry purchased from Amazon USA which reached me after one month on 23rd October 2017. When I received the product, it was without earphone. The box demarcated for earphone was empty. It was not expected from Amazon. Dr Munish Chander",
      "rating": 1.0,
      "verified": true,
      "author": "Munish",
      "helpful_votes": 2,
      "publication_date": 20171027
    },
    {
      "title": "Disappointed",
      "text": "Bad devices. Only lasted two (2) months before it shut off by it self while in use with full battery. Amazon kept referring me to BB who could NOT help me because I brought it through Amazon. Overall, learned my lesson to never buy devices, like unlock phones from Amazon.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171120
    },
    {
      "title": "Love this phone",
      "text": "Love this phone, great camera, and still has a keyboard, do not care for the samsung or Iphones have been a loyal Blackberry user since my first one and as long as I can get one will continue to use one, lets me use the features I want and disable those I do not to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda Nordeck",
      "helpful_votes": 0,
      "publication_date": 20171214
    },
    {
      "title": "Blackberry",
      "text": "I like the android features I activated it through ATT an it works great. My wife is jealous",
      "rating": 5.0,
      "verified": true,
      "author": "Austin",
      "helpful_votes": 0,
      "publication_date": 20180316
    },
    {
      "title": "I still love BlackBerry.",
      "text": "Bought this phone in October 2017 and 5 months later the ear speaker won't work properly. I still love BlackBerry...",
      "rating": 2.0,
      "verified": true,
      "author": "Abraham Garcia",
      "helpful_votes": 0,
      "publication_date": 20180319
    },
    {
      "title": "I am not very happy about this phone this phone drains yourself very fast",
      "text": "Why this phone get so hot when you use the swim so quickly I use this one 20 20 minutes and it was out of this one when the back is that normal .",
      "rating": 1.0,
      "verified": true,
      "author": "Constantin Amilea",
      "helpful_votes": 0,
      "publication_date": 20200507
    },
    {
      "title": "Priv is beauty",
      "text": "It is a bit slow as compared to other androids. But I bought it becaue of its beauty... I'm in love with its shape P.S unlocked AT n T phones are lagging marshmallow update, dnt know how much time they will take , rest of all the privs have been updated",
      "rating": 4.0,
      "verified": true,
      "author": "Buyer 1234",
      "helpful_votes": 0,
      "publication_date": 20160610
    },
    {
      "title": "Would not update",
      "text": "Phone would not do the security update other then that a decent phone",
      "rating": 3.0,
      "verified": true,
      "author": "D & M",
      "helpful_votes": 0,
      "publication_date": 20180401
    },
    {
      "title": "Complete waste of time and money",
      "text": "BUYER BEWARE.Turned out the used phone I purchased has been blocked by all carriers, as it's original owner has reported it lost or stolen. The original owner's network carrier cannot do anything unless the original owner--to whom I have no access!--personally releases the device. Complete waste of time and money.",
      "rating": 1.0,
      "verified": true,
      "author": "nal",
      "helpful_votes": 0,
      "publication_date": 20180617
    },
    {
      "title": "Very smooth, different and fast, with lots of options that the regular Blackberry OS don’t have.",
      "text": "I have been using Blackberry for almost 10 years now and the last ones I had was the Z30, and the Passport Silver Edition, but having a BB with is supported by Android just made my life easier. I have a Blackberry phone and access to all Android and play store.",
      "rating": 5.0,
      "verified": true,
      "author": "madack",
      "helpful_votes": 0,
      "publication_date": 20180301
    },
    {
      "title": "Blackberry Priv Is The Truth!",
      "text": "This is the best phone I've ever had. I've had phones that cost more but could not hold a candle to the Priv.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20170720
    },
    {
      "title": "Is like having my own computer all in ONE",
      "text": "Is like having my own computer all in ONE, design , screen, shape, and weight and last the program all perfect for me. Not changing phone anytime soon. I love it.. I did owned a Blackberry before 2007",
      "rating": 5.0,
      "verified": true,
      "author": "El B.",
      "helpful_votes": 2,
      "publication_date": 20170601
    },
    {
      "title": "Best phone I've ever owned",
      "text": "I bought this because it is the only decent phone I could find with an actual physical keyboard. Best phone I've ever owned. Simply does what it is supposed to do in all regards.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171203
    },
    {
      "title": "The phone was excellent for about 2 weeks and then started playing ads ...",
      "text": "The phone was excellent for about 2 weeks and then started playing ads randomly that i couldn't exit out of. Screen glitches really bad and gets overheated on the daily. Sent back today to get a replacement, will update if the replacement phone is any better.",
      "rating": 2.0,
      "verified": true,
      "author": "Roslyn Walhovd",
      "helpful_votes": 0,
      "publication_date": 20180301
    },
    {
      "title": "Great value and performance at current prices",
      "text": "The issues of the early build of the priv seemly have been fixed. Great value and performance at current prices.",
      "rating": 5.0,
      "verified": true,
      "author": "Tom Catalde",
      "helpful_votes": 2,
      "publication_date": 20170603
    },
    {
      "title": "Defective product",
      "text": "The device is clearly defective (processor extremely slow, heats up, runs out of battery in a couple of hours). I contacted seller and told me I have to complain to manufacturer.",
      "rating": 1.0,
      "verified": true,
      "author": "F. O. Guzman",
      "helpful_votes": 0,
      "publication_date": 20180314
    },
    {
      "title": "I been usuing this about a mounth and i liked tha product",
      "text": "I been usuing this about a mounth and i liked tha product. I definately recommend anyone who wants slider phone with a nice keynoard can be really nice alternative to any android or apple device.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170407
    },
    {
      "title": "This phone is working great so far",
      "text": "This phone is working great so far. I haven't had any issues and it moves pretty quickly from page to page load as I've updated the software. I love it but if I notice any changes I'll do an update to this post.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180414
    },
    {
      "title": "Great item",
      "text": "Works great, my husband love his phone. Great for a gift.",
      "rating": 5.0,
      "verified": true,
      "author": "Shelly",
      "helpful_votes": 0,
      "publication_date": 20180921
    },
    {
      "title": "Five Stars",
      "text": "Better than I even thought. Super intuitive, but not too complex. Best phone I've had, yet.",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle Bonner",
      "helpful_votes": 0,
      "publication_date": 20180314
    },
    {
      "title": "Beware that there are a few critical things that only work on AT&T ...",
      "text": "Be aware that although this says \"Unlocked\", it won't get software or security updates or wifi tethering unless you use an AT&T SIM card (not even a Cricket Wireless card, which runs on the AT&T network, is enough it seems). No security updates on a corporate phone kinda defeats the purpose. Returned.",
      "rating": 2.0,
      "verified": true,
      "author": "Ray",
      "helpful_votes": 6,
      "publication_date": 20160723
    },
    {
      "title": "Great phone",
      "text": "Switched from an HTC One M7, which I was very happy with. But this definitely beat out the HTC--is just a fantastic phone. Blackberry has done their best to keep on top of things and am pleased with their new orientation. Hopefully it keeps up.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20160503
    },
    {
      "title": "One Star",
      "text": "One of the slowest phones I've ever had. Overheated, a lot.",
      "rating": 1.0,
      "verified": true,
      "author": "Cybre3",
      "helpful_votes": 0,
      "publication_date": 20180728
    },
    {
      "title": "Great phone! All the Blackberry perks",
      "text": "Great phone! All the Blackberry perks, including reliable email service and a physical keyboard, plus Android for access to every app. This is a fantastic phone!",
      "rating": 5.0,
      "verified": true,
      "author": "pablo donatti",
      "helpful_votes": 3,
      "publication_date": 20160419
    },
    {
      "title": "Great phone",
      "text": "This Phone was working great am using this phone for almost 6 weeks it exceeds all my expectation",
      "rating": 4.0,
      "verified": true,
      "author": "Dinesh",
      "helpful_votes": 3,
      "publication_date": 20170426
    },
    {
      "title": "Spectacular Return for BlackBerry smartphones",
      "text": "Absolutely worth every penny! Cutting edge technology and extremely attractive design! Also be sure to get involved with the BETA program! Come on guys don't delay get your own today!",
      "rating": 5.0,
      "verified": true,
      "author": "Nick Burris",
      "helpful_votes": 3,
      "publication_date": 20160503
    },
    {
      "title": "Best smart phone",
      "text": "I got mine last week and because it was an AT&T, updates are slow to be qualified and that means MM and security updates. Happy to get BlackBerry PRIV. It should list AT&T in detail name and specs. I sold my iPhone 6S plus for this, previously had Note II, S6 and a 5S - this tops all those. Size, weights, screen, how apps behave. But I had hoped now that6.01 is rolled out - for non-ATT to have the improved Security and battery performance-oriented well, have to wait on MM.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20160622
    },
    {
      "title": "Excellent phone for professionals.",
      "text": "Great phone, marvelous screen. Very good sound and speaker mode. Lots of options and modes to set and play with. Love it. Google Play store apps a great plus. Solid build. Great battery life. After a week I get used typing again faster on the slide out keyboard.",
      "rating": 5.0,
      "verified": true,
      "author": "cvdc",
      "helpful_votes": 7,
      "publication_date": 20160122
    },
    {
      "title": "Quality",
      "text": "I bought it for the standard but small keyboard but found the touch sensitive keys on the screen to work very well. The quality of the build is exceptional.",
      "rating": 5.0,
      "verified": true,
      "author": "Alexander Kulpecz",
      "helpful_votes": 0,
      "publication_date": 20170924
    },
    {
      "title": "Overall good",
      "text": "Overall hood quality. Phone was brand new. However, I did not recieve headphones with this device.",
      "rating": 4.0,
      "verified": true,
      "author": "Ryan Potts",
      "helpful_votes": 0,
      "publication_date": 20180310
    },
    {
      "title": "Phone was not unlocked. Multiple technical support with carrier ...",
      "text": "Phone was not unlocked. Multiple technical support with carrier. May have been a stolen phone. Returned for refund.",
      "rating": 1.0,
      "verified": true,
      "author": "C Scott Wilson",
      "helpful_votes": 0,
      "publication_date": 20180719
    },
    {
      "title": "Very disappointed.",
      "text": "Box came without earbuds and don’t for time for return/exchange. Very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Lucas Sábalo",
      "helpful_votes": 0,
      "publication_date": 20180312
    },
    {
      "title": "Phone Screen went black for no reason",
      "text": "My Phone's screen went black right after 2 months for no reason. Did not fall, Nothing happened but all of a sudden the screen went black and is still the same.",
      "rating": 1.0,
      "verified": true,
      "author": "AAC",
      "helpful_votes": 2,
      "publication_date": 20161125
    },
    {
      "title": "phone works just perfect even after updating",
      "text": "Its T-Mobile unlocked but , phone works just perfect even after updating. Had all accessories in and came earlier than expected.",
      "rating": 5.0,
      "verified": true,
      "author": "V3t4l",
      "helpful_votes": 0,
      "publication_date": 20170723
    },
    {
      "title": "Have the worst opinion as i have to again buy another device ...",
      "text": "The phone just died on within 2 months. Have the worst opinion as i have to again buy another device within 2 months.",
      "rating": 1.0,
      "verified": true,
      "author": "Sarat Challa",
      "helpful_votes": 0,
      "publication_date": 20180611
    },
    {
      "title": "absolutely love it. one pointer i'd like to give people",
      "text": "absolutely love it. one pointer i'd like to give people. I found the volume with the included headphones to be extremely low, you can improve it by using your Classic or Passport headphones and you'll see a 50% improvement on max volume",
      "rating": 5.0,
      "verified": true,
      "author": "Justin",
      "helpful_votes": 10,
      "publication_date": 20151123
    },
    {
      "title": "Two Stars",
      "text": "Worst phone blackberry has ever made please do not purchase",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180413
    },
    {
      "title": "One Star",
      "text": "From BAF Distributors I ordered two of these phones. Both came AT&T branded and LOCKED. Be aware!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Dieter S.",
      "helpful_votes": 44,
      "publication_date": 20160705
    },
    {
      "title": "The phone looks cool and has some pretty good features but the perfomance ...",
      "text": "The phone looks cool and has some pretty good features but the perfomance is abhorrant i want my money back.",
      "rating": 2.0,
      "verified": true,
      "author": "Cj Gardner",
      "helpful_votes": 0,
      "publication_date": 20180416
    },
    {
      "title": "Awsome.. but was the phone aopposed to come ...",
      "text": "Awsome..but was the phone aopposed to come with earphones?? Cause i didnt get them in the package",
      "rating": 4.0,
      "verified": true,
      "author": "jocelyn",
      "helpful_votes": 0,
      "publication_date": 20171014
    },
    {
      "title": "Four Stars",
      "text": "Great phone at a great price.. My only complaint with it is that it didn't come with headphones.",
      "rating": 4.0,
      "verified": true,
      "author": "Davin",
      "helpful_votes": 0,
      "publication_date": 20170521
    },
    {
      "title": "Perfect!",
      "text": "This is my second PRIV, so I knew what to expect. Perfect!",
      "rating": 5.0,
      "verified": true,
      "author": "Peter Miller",
      "helpful_votes": 0,
      "publication_date": 20180321
    },
    {
      "title": "If you prefer Android, you should seriously consider this phone for what BlackBerry adds to it, including more security.",
      "text": "So far it has been a great experience with this phone. I am customizing my Android experience nicely and really not missing my BB10 which I thought I would. BB10 is a great OS which world doesn't know about. A big error by BlackBerry, but it seems the latest OS from Android has covering some ground. I think a big plus for this phone is the additions of the BlackBerry integration. I think it really enhances the Android experience and not to mention make it more secure. Plus, the physical keypad. Nice. If you prefer Android, you should seriously consider this phone for what BlackBerry adds to it, including more security in a really nice package.",
      "rating": 5.0,
      "verified": true,
      "author": "Marc Evans",
      "helpful_votes": 7,
      "publication_date": 20160825
    },
    {
      "title": "Five Stars",
      "text": "so far I love it, only the problem i have, it gets hot sometimes, but its a great phone.",
      "rating": 5.0,
      "verified": true,
      "author": "Mohamed A Mohamed",
      "helpful_votes": 2,
      "publication_date": 20160623
    },
    {
      "title": "Four Stars",
      "text": "Cool phone, but battery is rather poor, screen consumes too much battery even when it's the darkest.",
      "rating": 4.0,
      "verified": true,
      "author": "Mateusz",
      "helpful_votes": 0,
      "publication_date": 20180625
    },
    {
      "title": "the best",
      "text": "I was waiting for new version Keyone, but kind of too expensive ( new version, always high price), mine old one is Q10, so change to Andriod OS is not really get used, but turn out better then I expected, lots app to use, large display, still keyboard as I like, will recommend it",
      "rating": 5.0,
      "verified": true,
      "author": "RubberShox",
      "helpful_votes": 2,
      "publication_date": 20170527
    },
    {
      "title": "Very Cool!",
      "text": "I love it very much, it's very cool, and the battery is better than I expected.",
      "rating": 5.0,
      "verified": true,
      "author": "Grace",
      "helpful_votes": 0,
      "publication_date": 20180319
    },
    {
      "title": "perfectly new PRIV",
      "text": "perfectly new and sooo...amazing the PRIV is that I can't love BB more.",
      "rating": 5.0,
      "verified": true,
      "author": "Yuanlei",
      "helpful_votes": 0,
      "publication_date": 20170919
    }
  ],
  "product_meta": {
    "title": "BlackBerry PRIV Factory Unlocked Smartphone",
    "description": "Color:Black (GSM)BlackBerry Secure smartphone, powered by Android. PRIV combines everything you expect from BlackBerry, plus the full eco-system of Android and its apps. PRIV comes with added security to let you know when your data could be at risk, so you can take action to improve it.",
    "rating": 3.7,
    "feature_bullets": [
      "Classic Physical QWERTY keyboard, Optical trackpad and 5.4-inch AMOLED Touchscreen",
      "Android v5.1 Lollipop",
      "18 Megapixel Camera (Schneider-Kreuznach optics) w/ Optical image stabilization, Autofocus, dual-LED (dual tone) flash + Front-facing 2 Megapixel Camera",
      "Dual-core 1.8 GHz Cortex-A57 & quad-core 1.44 GHz Cortex-A53 Processor, Chipset: Qualcomm MSM8992 Snapdragon 808, Adreno 418 Graphics",
      "Internal Memory: 32GB, 3GB RAM + microSD Slot Expandable up to 200GB"
    ],
    "specifications": {
      "Product Dimensions": "7.24 x 3.4 x 0.37 inches",
      "Item Weight": "7.7 ounces",
      "ASIN": "B0169SNI3C",
      "Item model number": "PRD-60027-008",
      "Batteries": "1 Lithium ion batteries required.",
      "Customer Reviews": "3.7 out of 5 stars965 ratings3.7 out of 5 stars",
      "Best Sellers Rank": "#38,074 in Cell Phones & Accessories",
      "Is Discontinued By Manufacturer": "No",
      "OS": "Android",
      "RAM": "3 GB",
      "Additional Features": "Touchscreen, Camera, Smartphone",
      "Display resolution": "1440 x 2560 pixels",
      "Other display features": "Wireless",
      "Device interface - primary": "Touchscreen",
      "Other camera features": "18 MP",
      "Form Factor": "Smartphone",
      "Colour": "Black",
      "Department": "Cell Phones & Accessories",
      "Manufacturer": "BlackBerry",
      "Date First Available": "October 22, 2015"
    },
    "categories": [
      "Cell Phones & Accessories",
      "Cell Phones",
      "Unlocked Cell Phones",
      "All Departments"
    ],
    "price": ""
  }
}