{
  "website_summaries": [
    {
      "verdict": "For cat owners who dread the idea of daily box cleanings. We recommend investing in the \"forever\" tray if changing the disposable ones become a chore.",
      "pros": [
        "Very easy to assemble and clean",
        "Crystal litter minimizes odors better than clay",
        "Automatic rake sifts out feces and redistributes litter"
      ],
      "cons": [
        "Uses a crystal litter that some cats will not use",
        "Urine does not clump, just pools",
        "Larger cat breeds may not fit comfortably"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Miracle Litter Box (if you don’t use the crystals)",
      "text": "Here’s the short and sweet, buy this. Also throw out the crystals and get Arm & Hammer Platinum Slide litter, a Forever Litter Tray, and Arm & Hammer Cat Litter Deodorizer. With those 3 things I can literally stand next to a full, 2 week old litter box and not smell a thing.",
      "rating": 5.0,
      "verified": true,
      "author": "Logan",
      "helpful_votes": 0,
      "publication_date": 20190114
    },
    {
      "title": "I  will buy another one!!",
      "text": "The crystals work so well, I didn't think they were using the box, I thought they were just going in and out. I had to witness them using it to believe it. No smell at all!! I will be buying another down the road.",
      "rating": 5.0,
      "verified": true,
      "author": "gloria silvers",
      "helpful_votes": 160,
      "publication_date": 20160122
    },
    {
      "title": "I have four cats?!!!",
      "text": "Easy to set up and the cats like it!! The litter helps and lasts a long time. I’ve used this same brand/kind with a regular litter box and have four cats. The self-cleaning... now that’s the cats meow!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer Olds",
      "helpful_votes": 12,
      "publication_date": 20190226
    },
    {
      "title": "Next to no smell, kitten loved it immediately",
      "text": "I have a small apartment and hate cleaning litter boxes, and the smell of litter. Once I set this up and placed the old litter box next to it, My 11-wk old kitten investigated and immediately preferred and started using the new PetSafe litter :) The smell compared to my previous clumping litter is WAY less (nearly nothing!) and the crystals are large enough to not cling to my kitten’s paws, so less gets tracked out of the box. I’m comfortable having it in my living room by my desk, rather than hidden in the bathroom with a fan on. It’s more expensive than buying clumping litter, but leagues less work, less gross, and less smell. I’m happy with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Alexandria Graham",
      "helpful_votes": 0,
      "publication_date": 20200918
    },
    {
      "title": "Expensive waste of money",
      "text": "I wasted so much money on this. The rake gets clogged up with poop constantly, and it causes a terrible odor. I change the disposable box every three to four days (which is so much more expensive than a normal litter box), so I know it’s not because of me not changing it frequently, and I only have one cat using it. Unfortunately I’m past the return window but I’d send it back in a heartbeat if I could.",
      "rating": 1.0,
      "verified": true,
      "author": "TheLadyFair",
      "helpful_votes": 2,
      "publication_date": 20200917
    },
    {
      "title": "Waste of money....",
      "text": "I bought this over a year ago but stopped using it probably about 6 months ago. It is not really self-cleaning because it quite frankly has nowhere to push the waste to. We had to empty the receptacle just as often as having to clean a regular litter box. WHAT'S THE POINT. And the number of times it stopped functioning due to the prongs getting stuck is just ridiculous. Unfortunately, I paid a lot more than what it is selling for now but either way, it is still a waste. I threw mine away after getting fed up with seeing it stacked in my garage for months on end. Absolutely WORTHLESS!!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201001
    },
    {
      "title": "Best Litter Box Ever",
      "text": "I purchased this litter box and wasn't sure it would work. I have purchased just about every litter box on the market and I thought this would just be another auto clean box. Was I ever shocked. This litter box is the best litter box I have ever purchased. The odor is eliminated and the waste is moved out of the box on a regular basis. The litter box mechanism is easily moved out of the way to change the litter as needed. I have used mine in the RV and at home. I didn't think the litter would work but after trying it, the cat loves it and I love it. I hope this litter box never stops working.",
      "rating": 5.0,
      "verified": true,
      "author": "Shannon Challender",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "Cat bathroom solution ! Almost 1 year old and still working great.",
      "text": "So we took the advice some of the other reviews and got an additional permanent litter tray and use Arm & Hammer Clump & Seal litter with this Auto Litter box. So far has been the perfect combo & even thou it’s nearby it doesn’t stink /smell & is cleaned 1x a week (we have multiple cats ) All & all best cat purchase ever. We also got a Veken cat water fountain which is also great. We are ordering a second one for upstairs to replace our other regular box because it’s just so handy /less stinky. Use the good litter & buy the separate tray & you won’t be disappointed..",
      "rating": 5.0,
      "verified": true,
      "author": "Carrie A.",
      "helpful_votes": 0,
      "publication_date": 20191114
    },
    {
      "title": "If it doesn't break, it was worth it.",
      "text": "So far, it's way better than our old clump-litter old fashion box(es). Far easier to clean, very little in the way of odor; especially compared to the old ones. Most of the problems we have are feline-anxiety related, which honestly, have improved since we switched to the self-cleaning box. Only caveat for many will be the cost of the maintenance of the box(litter trays). With 2 cats, we're replacing them every 2 weeks, and they aren't cheap... for me, they are worth it, however. Some might disagree, and I wouldn't argue. Research the costs before you take the plunge... I'd absolutely recommend it to a single-cat household, cost-be-damned.",
      "rating": 4.0,
      "verified": true,
      "author": "Scedos",
      "helpful_votes": 0,
      "publication_date": 20200201
    },
    {
      "title": "Worth It!! Would purchase again!",
      "text": "We have2 kittens and one senior cat. We purchase 2 of these and use the arm and hammer glide litter in the reusable tray. Works like a charm and theres very little odor with this litter. I’m on Chemotherapy and can smell everything. The crystal litter didn’t keep the odors down enough for me. The scoop counter lets u know when we need to tidy up the box-we clean it every 40-45 cycles.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan",
      "helpful_votes": 2,
      "publication_date": 20190623
    },
    {
      "title": "Moldy and gross",
      "text": "When we originally got this product, we were super excited to not have to clean it constantly. After three weeks, we had to change it the first time. It advertised four weeks for one cat, but three would still be manageable. About two and a half weeks after the first change, I noticed a smell. I initially thought my cat had just used the box and went on with my day. Today we changed it for the second time, again on week three, to the day. Not only was the poop area over filled, there was mold. Our cat just got his clay litter box back, and this is being returned when we find a large enough box.",
      "rating": 1.0,
      "verified": true,
      "author": "Brittany J",
      "helpful_votes": 2,
      "publication_date": 20200414
    },
    {
      "title": "The idea is great, the litter is not",
      "text": "I had big hopes for that products, but unfortunately, my cat didn't even want to touch this litter. I wanted to check what was wrong with it ,and when I touched the (clean) litter myself, it felt awefull on my hands skin. I was not surprised why he refused to touch it either - it is very rough on their gentle paws. The feeling on the skin this litter leaves is dehydration and non-comfort. I also doubt it's safety on pets as they may leak it's traces from their skin. Going back to safer option of the litter...",
      "rating": 3.0,
      "verified": true,
      "author": "Irca_21",
      "helpful_votes": 0,
      "publication_date": 20200716
    },
    {
      "title": "Overall a fan",
      "text": "Full disclosure. I am only one week into using this litter box but a big fan so far. I haven’t had to change the litter yet so I can’t speak to that. What I can say is that my cat hates it with the lid on the box. She refuses to use it. Prior to this we had another top entry litter box that was no problem. I think there’s something about the size of the hole in the overall depth of the box that is definitely a challenge. Without a lid of some sort on the box litter does go pretty much everywhere.",
      "rating": 4.0,
      "verified": true,
      "author": "JEF",
      "helpful_votes": 0,
      "publication_date": 20200709
    },
    {
      "title": "If it sounds too good to be true it probably is.",
      "text": "I bought this 'self cleaning' litter box after reading the reviews and the claims that it could clean up after a cat for as long as a month. The wildly overpriced litter trays, used exactly as instructed, could not clean up after my one, small, healthy, cat for a single week. The amount of litter in the packages was so inadequate for the job that there is no way to know if it would absorb urine if used in a thicker layer. I am left hoping I can find some kind of clumping litter that will work in this machine. The machine seems OK. I'm dreading cleaning it....I could have bought three years worth of disposable litter boxes.",
      "rating": 1.0,
      "verified": true,
      "author": "njani",
      "helpful_votes": 0,
      "publication_date": 20191004
    },
    {
      "title": "It's everything I wanted it to be!",
      "text": "This has been so great. It's everything I wanted it to be. I can't speak to why other people have had a bad experience but this has literally been perfect for me. It took about a week for our cat to get comfortable with it. We've had it for probably 6 months now and he has no issue with it now. He still runs in the room to watch when it cleans the litter. It has almost eliminated the litter smell. It's easy to clean and empty. It's not loud either. The trays are expensive but its better than daily scooping \"traditional\" litter (which i never did, whoops). 5 stars for sure. I love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Randy Webb",
      "helpful_votes": 2,
      "publication_date": 20180119
    },
    {
      "title": "Works great. No stink after 2-3 weeks of use. Crystals can be tracked around house and bleach stain materials.",
      "text": "Works very well. Only had a smell once due to the small amount of crystals didn't allow the cat to cover up once. But in 20 minutes, the auto clean fixed it. Running for 2-3 weeks now, and no stench. Although the crystals are tracked through the house, onto my couch, in the sunlight, where my cat likes to sunbath. And it's leaving bleached stains on that couch arm. The company reached out to me to help fix the problem. We'll see.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason",
      "helpful_votes": 4,
      "publication_date": 20170705
    },
    {
      "title": "Even better than the original- no leaks!!!!",
      "text": "Our last ScoopFree Automatic Litter Box lasted for 15 years but the motor started struggling so it was time for a new one. I love the Taupe color as it blends in better with our décor. I'm also happy to report that this one does not leak urine like the original one did, which is a huge plus!!! They changed the design so that where it meets the tray, the sides dip downwards which stops the urine from seeping between the tray and the box. One less thing to worry about- yay!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Tyler's mom",
      "helpful_votes": 4,
      "publication_date": 20170612
    },
    {
      "title": "Worth the investment 2.5 years later",
      "text": "We've had this litter box for 2.5 years and it works great! I hate cleaning litter boxes and this does the trick. We have one cat who uses this box almost exclusively and we use the crystal litter that comes with the box. The litter tray usually lasts 40-50 uses before my smell averse husband notices any odor of urine. For us, that is about 3 weeks of use for one tray We have the litter auto delivered and I never have to worry about getting litter at the store. It still works just as well as it did when we got it, and the cat uses it no problem.",
      "rating": 5.0,
      "verified": true,
      "author": "Lindsay M",
      "helpful_votes": 0,
      "publication_date": 20200403
    },
    {
      "title": "Just keep scooping a regular litter box.",
      "text": "It came and 3 days later I was ready to pull my own hair out. It was loud- waking us up at night with loud popping sounds. The smell was horrid. I had 2 boxes, this one and a regular. I was scooping this one every few hours. To top it off, it smeared cat poop from one end to the other and had to be manually run several times just to get some of the left behind poop. The crystal litter also stains everything it touches, while dry! My floors required heavy scrubbing to get it off and I had to toss the scoopers. Not worth that much time and effort, much less the $160 I spent.",
      "rating": 1.0,
      "verified": true,
      "author": "juggalettekt",
      "helpful_votes": 0,
      "publication_date": 20191120
    },
    {
      "title": "Disappointed",
      "text": "Well I really dislike that it took the crystals instead of clumping cat litter. My cats basically laughed at me 😂😂😂😂😂. Neither my old cat nor my youngster cat would use crystal litter. Very disappointed to say the least. But I can only say I didn't have odor or litter mess issues with this box due to the fact that they refused to use it. Giving it 3 stars cause I was looking forward to not scooping a cat box. Big disappointment.",
      "rating": 3.0,
      "verified": true,
      "author": "kjmanx66",
      "helpful_votes": 0,
      "publication_date": 20200201
    },
    {
      "title": "Must have for cat moms/dads!",
      "text": "I could not live without this litterbox. I used to get severe back spasms from cleaning the traditional litterbox. I absolutely dreaded the pain that went with scooping litter. The ScoopFree takes about 5 minutes to change out the litter. I actually look forward to cleaning the litter box because it is so easy, and my cats LOVE scratching around in the new litter. I have two cats, so I change it every 7-10 days. It could not be easier. I highly recommend for all the cat moms and dads out there.",
      "rating": 5.0,
      "verified": true,
      "author": "Fur Mama & the Migraine Saga",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "My cat didn’t want to use it",
      "text": "I wanted to like this product. I put it next to my cats litter box for a week and then took his old litter box away. He started to pee on my rug. I gave him his old box back, next to the new one and he started using his old box. It’s been over a month and I still have this litter box next to the old one and he won’t use the new one. I might have given it a good review if my cat liked it. Currently it’s just a pricey decoration.",
      "rating": 2.0,
      "verified": true,
      "author": "John F Osbourn",
      "helpful_votes": 2,
      "publication_date": 20201004
    },
    {
      "title": "Works Perfectly When Used As Intended!!",
      "text": "PetSafe ScoopFree Ultra Automatic Self Cleaning Hooded Cat Litter Box when used as presented works as it should and is great at doing what it is designed to do. When this self cleaning litter box is used with Arm and Hammer clumping cat litter it fills the box holding area in rapid time. If a cat owner uses this cat litter box with the cat litter box and the cat litter provided and uses either a disposable or a reusable tray it works great.",
      "rating": 5.0,
      "verified": true,
      "author": "William Richard James Crook",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "Fantastic investment",
      "text": "This box is everything I expected. My cat took to it immediately. I sat it out with the kid at first, let her see the lid separately and placed her old box next to the new one as recommended. She never used the old one again. The cat was highly curious when the taking started and ran to check it out every time even days later. The box stays so clean and I haven’t done anything to it. We love the top entry as very little litter hits the floor. I highly recommend this box.",
      "rating": 5.0,
      "verified": true,
      "author": "Laura f",
      "helpful_votes": 0,
      "publication_date": 20190803
    },
    {
      "title": "Life-changing",
      "text": "It's a magic box. Litter disappears. You mostly ignore it. We've had this litter box for about 18 months. It is amazing. Minimal noise, minimal to no smell. With the hood, it's unobtrusive. Super easy to change the litter tray. Two small complaints: The box lid doesn't fit tightly -- we have to double-bag the used trays for disposal. The litter crystals stick to the cat's feet -- we got the accessory mat, which helps a lot, but still have some tracking.",
      "rating": 5.0,
      "verified": true,
      "author": "P. Wood",
      "helpful_votes": 0,
      "publication_date": 20190606
    },
    {
      "title": "Expensive for the value.",
      "text": "Scoopfree makes it easier to forget about daily cleaning of litter box. Beware of few things: 1. You can smell the odor after few days 2. Occasionally some fecal matter will get stuck to the rake. 3. The refill box does not last as long as advertised So take other users advice: set the rake setting to 20 minutes so waste gets a chance to dry up. I have 2 young cats and I change my box every 7 days because it really stinks. For almost $20 a refill, it's way more expensive than it worths. The refill box has simple design. It should not be that expensive to make.",
      "rating": 3.0,
      "verified": true,
      "author": "Amz customer",
      "helpful_votes": 0,
      "publication_date": 20200210
    },
    {
      "title": "Stinky litter.",
      "text": "This was set up perfectly twice and the first two weeks with two cats one litter box was left and they both used it. Periodically we shut the second normal litter box and both cats used this new one. The second the it seemed fine then it stopped at 7. I didn’t notice it until I smelled it. Trust me the new litter smelled worse with pee o it that was a few days old than anything I have ever smelled. I doubt they will let me return it but I would never buy this again and would never recommend it. It only smells ok when perfectly removed. I can’t figure out how to do 1/4 Star.",
      "rating": 1.0,
      "verified": true,
      "author": "Tommy B. McDonell, Ph.D.",
      "helpful_votes": 0,
      "publication_date": 20180715
    },
    {
      "title": "Follow the directions!",
      "text": "This is my second review, not sure what happened to the first. Simply put this litter box is exactly as it claims. When used properly it’s scoop free and oder free. I tried using clumping litter the first go around, thinking the cat wouldn’t use crystals. After a few weeks of having to scoop the litter almost twice a day. And watching the rake get all clogged up. I decided to follow the directions with the crystals. What a difference! I’m not stepping on litter in my bathroom, and there is no oder, and i never scoop. Just dumped and changed litter after four weeks. It was amazing! Thanks PetSafe good on ya!",
      "rating": 5.0,
      "verified": true,
      "author": "K. Decker",
      "helpful_votes": 0,
      "publication_date": 20200316
    },
    {
      "title": "Adjustment period then perfect",
      "text": "Took a little bit to adjust. One complaint if you want the top entry lid you can’t order later. Must buy up front. Don’t think cat would have used up front. Our old cat would pee over side. We ended up blocking entry to cover and cutting hole in side up high so sides would protect from over shooting. Thought of using different litter but this litter really has 0 smell even after 3 weeks",
      "rating": 5.0,
      "verified": true,
      "author": "modawell",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "Best Purchase EVER",
      "text": "I was concerned that this would not be worth the money. It's expensive from the get go, and more than standard cat litter each month. Totally worth it. We have multiple cats and have bought two of these. (One as seen, the other without the cover/lid) We LOVE it. Super easy to switch out the litter when it's time. We've found that the litter box they use most can go about a month before needing to replace. No hassle. Easy. Set it up and forget about it. Great purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Roso's ",
      "helpful_votes": 0,
      "publication_date": 20200701
    },
    {
      "title": "Works as advertised",
      "text": "This kitty potty seems to work as advertised. My kitty freaked at first when it went through its cleaning cycle but has gotten used to it. I don't like that the litter crystals are so expensive and can't for the life of me understand why you can't use regular light-weight litter in it but apparently you can't. Since I only have one kitty, it's not a big deal but if I had more than one kitty I would definitely not appreciate the added expense. Others have mentioned a problem with smell and with their kitties developing a cough. So far, we have not had those problems.",
      "rating": 5.0,
      "verified": true,
      "author": "Teresa Hearne",
      "helpful_votes": 0,
      "publication_date": 20200615
    },
    {
      "title": "Maybe okay for a one-cat home.....",
      "text": "OMG I wasted a lot of money.... waste gets stuck to the rake mechanism, the waste receptacle area is not even remotely airtight so the smell is worse than if you didn't have a rake because the waste is no longer buried. Also, the channel that the waste is raked into is awkward to scoop out. This box is only appropriate for a one-cat home with daily cleaning. Even then I wouldn't recommend due to the odor issues.I bought the permanent tray, used the slide litter as other reviews had recommended... still a complete dud.",
      "rating": 1.0,
      "verified": true,
      "author": "IntheGroove",
      "helpful_votes": 0,
      "publication_date": 20200829
    },
    {
      "title": "Great Design and Works Perfectly",
      "text": "Have 2 of these: inside and outside patio for 2 years. Works great; cats use it; and easy for me to clean. It is pricey for the replacement litter, but it works: reduce smell. I change the whole box every 10 days with 2 cats. I have 2 large Maine Coon. My male is very picky about his “clean” box.; he won’t use it. Reduces me having to clean daily. Keeping forever. Great product!",
      "rating": 5.0,
      "verified": true,
      "author": "Moonlight Glitter Girl",
      "helpful_votes": 0,
      "publication_date": 20190523
    },
    {
      "title": "What a life saver- and back saver!",
      "text": "Got this for my mom who has back problems. Cleaning the litter box everyday was hard on her. After having this for a few months I can definitely say it was worth the money. The crystals only need to be shifted around (to maximize absorbency and scent ) every other day or so, and the crystals we change completely every two-three weeks for our 2, big 15 pound cats. Reaching the third week is a little potent though. We clean the tray and metal rake with cleaning supplies about once a month which makes the box stay pretty clean. Would recommend as long as you are willing keep up with it somewhat (noticeably less than a normal littler box though!",
      "rating": 5.0,
      "verified": true,
      "author": "Alysa",
      "helpful_votes": 0,
      "publication_date": 20190508
    },
    {
      "title": "Easy to use, saves time!",
      "text": "I love this litter box, we have had it for about a year. It took some time (almost a week) for our older cat to trust it but, I believe she loves it too, and no more dragging my socks or washcloths in the litterbox. Its an expensive way to go, no doubt, its worth it to me. I have Amazon automatically shipped the littler trays every 3 months. For an average of 15 dollars a month. I Gladly pay it not to take the littler jug back and forth to the store to refill it and haul the heavy container in and out and up and down.",
      "rating": 4.0,
      "verified": true,
      "author": "C. Wolfe",
      "helpful_votes": 2,
      "publication_date": 20180624
    },
    {
      "title": "Doesn’t scare my scaredy-cat!",
      "text": "My cat is very skittish, so the fact that she isn’t afraid of the litter box is excellent! She seems to be very curious about the cleaning function. Every time she hears the rake start to go she runs over props up on the ledge and watches it clean. Today I caught her inside the litter box as it was cleaning and thought I would share that video with you. I definitely don’t miss cleaning the litter box, and I’m glad it something I’ll never have to do again! Great product, definitely recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Summer-Linn Spence",
      "helpful_votes": 2,
      "publication_date": 20181214
    },
    {
      "title": "Would not recommend with kittens or more than 1 cat",
      "text": "This was not the cat box for our house. The only place we could keep it was the bathroom and the directions are correct that keeping it in a bathroom doesn’t work(the crystals absorbed the moisture and make it smell) The crystals also got everywhere despite having a mat underneath. They’re really big and needed constant vacuuming. I didn’t use the automatic scoops as my cats were kittens, but can’t see how this would help but smear the poop around. This may be better for a single cat but definitely not good for our two cat household.",
      "rating": 2.0,
      "verified": true,
      "author": "Heather A Askay",
      "helpful_votes": 0,
      "publication_date": 20200811
    },
    {
      "title": "Works great so far!",
      "text": "It’s been 20 days and still no odor. I did have to scoop the solid waste out a few times as it filled up the little area. Crystals don’t make as much of a mess as clay litter. Only thing I would change is having a receptacle for solid waste with a liner so you could just pull the liner out and change. Bought a forever tray to try out after this disposable is done.",
      "rating": 5.0,
      "verified": true,
      "author": "Abby Rae Lavergne",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "Stopped working in less than a year",
      "text": "I purchased this in September 2019 on Amazon and its been working fine up until now. I don't know if the motor died or what but the rake no longer moves, even if you press the button. It hasn't even been a year. I tried emailing the company but I kept getting an error message, even though there was. O error. Totally disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "jmsb718",
      "helpful_votes": 0,
      "publication_date": 20200627
    },
    {
      "title": "Stinky! Concept didn't work",
      "text": "We have two kittens. After setting up litter box, they acclimated easily. Problem is when it auto scoops, the pile of poo is moved to compartment that is not tightly sealed. We smelled the litter even more worth the auto bc it left clumps uncovered in cardboard section that was not sealed. We returned it.",
      "rating": 2.0,
      "verified": true,
      "author": "Kenneth W Gee III",
      "helpful_votes": 0,
      "publication_date": 20201019
    },
    {
      "title": "To make things even worse, our cat has started to urinate in the ...",
      "text": "Purchased and received the ScoopFree Ultra last Saturday (11/15/14). I was very excited because setup was simple and fast. Now for the rest of the story...we only have one (1) cat!!! On Monday (11/17/14) urine was leaking out of the box and onto the floor. I checked the unit to make sure it was setup correctly and it was. Urine has continued to leak out of the litter section. To make things even worse, our cat has started to urinate in the dog's bed and today, Friday (11/21/14), the house smells like cat poop. Don't waste your money and time on this litter box!!! I am preparing to take advantage of the 90 day money-back guarantee.",
      "rating": 1.0,
      "verified": true,
      "author": "TNTSparks",
      "helpful_votes": 11,
      "publication_date": 20141121
    },
    {
      "title": "The Petsafe liter box has made owning a cat so much more enjoyable.",
      "text": "The product does exactly what it says it will do when it comes to cleaning. The smell after my cat dedicated sticks around a lot longer then I expected. My thought is the flap that goes down in front of the area to conceal the feces does not go down far enough. Also, sometimes the feces gets caught on the wrong side of the rack and has to be cleaned off. But, in the whole scheme of things I love the freedom the the the Petsafe liter box gives our household and the ease of owniga cat now.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard Shores",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "Totally worth it!",
      "text": "We have three cats, so we have two of these. They work great and the cats love them. The transition from their old litter box took no time at all. Having two kids, this is so easy for me to quickly clean up. I also never smell poop anymore unless I walk in right after they’ve used the litter box. Some people complain about poop sticking to the rake and then the rake getting rusted, but just leave the timer on 20 minutes like the guide recommends. I’ve also seen where people have said that pee soaks through the cardboard. I haven’t had that problem whatsoever.",
      "rating": 5.0,
      "verified": true,
      "author": "Megan Mead",
      "helpful_votes": 0,
      "publication_date": 20190509
    },
    {
      "title": "The fact that it pushes the waste to the front and it supposed to just stay ...",
      "text": "This has not helped with the odor OR scooping. The fact that it pushes the waste to the front and it supposed to just stay in there doesn't work. I end up scooping out the waste in an effort to try and keep it from smelling. The crystals do not help absorb the smell at all and not better then traditional kitty litter. I've also had to replace the trays more frequently because of the smell. This product is expensive at $180, its a total waste for me. Does not: Crystal litter absorbs urine and dehydrates waste to instantly remove odors Covered trap locks away solid waste and odor so you never touch or see smelly waste",
      "rating": 1.0,
      "verified": true,
      "author": "Scott Velicer",
      "helpful_votes": 5,
      "publication_date": 20160829
    },
    {
      "title": "Best thing and no smell!!",
      "text": "SOOOOOOO happy I got this!!, I work 2 jobs and I don't have time to clean their box and it's not fair to them. I tried using the sifter tray, it was too heavy. This is a godsend. Follow the instructions and it works perfectly. I've had it for 2 1/2 weeks and it doesn't smell. I did get the forever so that helps the cost. It took my 14 year old cat and my 1 1/2 a little getting used to it but they use it. They are still very curious about the machine when it rakes but they use it. They haven't messed up. Again follow the instructions and you are good!!",
      "rating": 5.0,
      "verified": true,
      "author": "Lp Solutions",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "Doesn’t work!",
      "text": "This thing is more trouble then it’s worth!! The litter does NOT stay in the box and it does scatter big time. The smell, oh my gosh, the smell is horrible!! If your cat ever has one poo that is looser then most then the tales get clogged with pop and it just scrapes it all through the litter over and over. It’s horrible! We returned it and just went back to the tried and true method of traditional litter and box. I’d rather have to scoop out the box every couple days then deal with this litter box and all it’s maintenance.",
      "rating": 1.0,
      "verified": true,
      "author": "Hannah",
      "helpful_votes": 0,
      "publication_date": 20190306
    },
    {
      "title": "Love it, would never go without one again!",
      "text": "I love this thing! Works every time, I love that it plugs in and especially love the sensor to automatically clean after the cat has been in it. Makes for zero smell even though it is in a closet near our entrance and kitchen, we’ve never smelled anything other than when we go to change the pan. It takes all the stress and hassle of owning a cat away! Best money ever spent I would never own a cat without having one!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190113
    },
    {
      "title": "This thing is awesome",
      "text": "I am amazed with this litter box. I have one cat and this litter box lasted for one month and nobody smelled a thing. I didn’t have to do anything - it cleaned itself. I didn’t have to think about it for a month and then I just changed it because the month was up. I would highly recommend this litter box over any other litter box out there on the market. This thing is amazing. It is worth every dime that you pay for it. Amazing. You can put it out and forget about it for a month",
      "rating": 5.0,
      "verified": true,
      "author": "Denise cupp",
      "helpful_votes": 0,
      "publication_date": 20200907
    },
    {
      "title": "Best Buy ever!!! Don’t look any further! Buy it",
      "text": "I bought this for my cat and I ask myself why didn’t I do this sooner!! I got the extra large one because it’s the size of a bigger litter box I also followed the directions and put her other litter box by this one and put a little of her litter in the new one! It took her about a week but she finally realized this was her new box! She loves it and I love it too! I also purchased the bottom part that can just be cleaned not the ones you throw out to save money. Best purchase ever ! I’m happy and so is she🐾",
      "rating": 5.0,
      "verified": true,
      "author": "Dawn E. Leever",
      "helpful_votes": 0,
      "publication_date": 20200721
    },
    {
      "title": "Great for busy families",
      "text": "I like to wait a few months before leaving a review to assure quality... Bought this in July 2019. Almost November now and couldn't be happier. No problems. Super easy, virtually no maintenance except for once a month. No smell, even after several weeks. I thought about using regular clumping cat litter but opted to give the crystals a try first. Never going back to clumping cat litter. No mess, no smell, no heavy containers to lift. Just what this busy mom needed. It's slightly more expensive but worth it. Buy the 6 pack and you will save $. You're going to need them anyways, just buy them now.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191030
    },
    {
      "title": "It’s a game changer!",
      "text": "Absolutely worth it. I have 1 cat that’s 11 months old. He’s always used your standard LitterBox with TidyCat litter. It was raked 3 to 4 times a day as needed. He took to this unit within minutes of it being setup and continues to use it. I’ve already removed the old LitterBox and this is day 2. Definitely worth it. The scented litter isn’t that bad But I did buy a 3 month supply of the lavender version for later. Plus I set my unit to clean after 5 minutes of use.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer",
      "helpful_votes": 0,
      "publication_date": 20200328
    },
    {
      "title": "Non adjustable cleaning cycle",
      "text": "I have the 1st generation litter and love it. I just don't understand why you would remove the adjustable timer for cleaning. My dog would think she was in a candy shop if this only cleans after 20 min. The ones I have are both set for a 5 min cycle. Because of this reason I am returning it.",
      "rating": 3.0,
      "verified": true,
      "author": "crafter2074",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "Quiet",
      "text": "I have used a lot of automatic cat boxes -most stop working after the warranty period. I have had this for 6 months now and it is the quietest auto litter box I have ever had. I have chronic Urinary Tract Infection kitties so I got the replacement bottom portion so I can use Pretty Litter to detect the kidney health of my cats instead of their crystal litter. Would be helpful if the bottom portion holding the litter was a little higher to keep the litter in better.",
      "rating": 4.0,
      "verified": true,
      "author": "Steve Hindi",
      "helpful_votes": 0,
      "publication_date": 20200823
    },
    {
      "title": "Even with changes, didn’t work",
      "text": "Don’t waste your money on this. The rake doesn’t even get to the bottom of the litter box. You still have to go in and manually clean it. The crystals are DISGUSTING. the cardboard liner it comes with is gross when dirty. I read through all of the reviews and made all of the modifications suggested (specific litter, metal pan, odor control powder on top, etc) and even with the changes it didn’t work because of the rake not reaching the bottom. Sent it back. :(",
      "rating": 2.0,
      "verified": true,
      "author": "C. Areal",
      "helpful_votes": 0,
      "publication_date": 20200309
    },
    {
      "title": "Can't Live Without It",
      "text": "This is an excellent litter box that I recommend to any cat owner. I've had it for three years and it's still going strong. I use it with the Fresh Step crystal litter and a reusable tray. This works for me. I like that I can set a timer for the raking and keep count of my cat's litter use. (I usually change the litter when my cat reaches a certain amount of time using the box and then reset.) This box also helps keep odors at bay. I never get litter odor complaints and my cat has no issues using it.",
      "rating": 5.0,
      "verified": true,
      "author": "foreverjule",
      "helpful_votes": 0,
      "publication_date": 20200425
    },
    {
      "title": "The jury's still out (missing litter tray) - but excellent service from Amazon",
      "text": "I purchased this at a reduced price (still fulfilled by Amazon Prime), in exchange for buying it in damaged packaging. The packaging was just a little dented, but the litter box arrived without a scratch. Unfortunately, the disposable litter tray was missing, along with assembly instructions. Amazon has given me a generous credit for the missing littler tray, and assembly looks easy. Based on Amazon's service alone, this gets 4 stars. If it works as well as I hope, I'll change this to 5 stars. Meanwhile, I'm just waiting for disposable trays so I can try it out. ...Looks and feels well constructed.",
      "rating": 4.0,
      "verified": true,
      "author": "KATHRYN T.",
      "helpful_votes": 0,
      "publication_date": 20170910
    },
    {
      "title": "Much better than brands from 10+ years ago.",
      "text": "So far, so good... this machine is quiet, contains litter fairly well, and doesn't scare the daylights out of my cat (or my family at night). I was confused about the setup initially (I thought the base was plastic), but it appears that the machine sits ON TOP of the disposable boxes (kind of like an elongated shoebox). Pretty novel design, honestly. Would recommend some type of rug or litter catcher because while there isn't much that gets trapped (compared to regular litter), the pieces are much bigger and hurt to step on barefoot. We've had it for a week and I'm very pleased with the transition.",
      "rating": 5.0,
      "verified": true,
      "author": "Chachacha",
      "helpful_votes": 0,
      "publication_date": 20170809
    },
    {
      "title": "Lifesaver for cat owners.",
      "text": "Only had a short time but have instantly noticed a lack of funk smell coming from the litter box. No more tracked litter across your floors. Quiet operation and super easy setup. Wall outlet powered so no battery issues. Wish we had bought this year's ago. Well worth the expense. Refills are also available at the local chain pet stores. Cheaper to order online but locally available in a pinch. Have had zero issues with our cat not wanting to use the box either.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Weeks",
      "helpful_votes": 0,
      "publication_date": 20200926
    },
    {
      "title": "Recommend!",
      "text": "I have tried many different types of litter boxes over the few years I have had my cat. This one is by far my favorite, because it scoops the litter for me and definitely reduces odor. Instead of using the cardboard trays that you need to frequently switch out, I (separately) on amazon purchased a re-usable one that is plastic that can be washed off to avoid using the cardboard bottoms. I noticed this helps reduce the odor even more, since the cardboard bottoms soak up urine and keep the smell.",
      "rating": 5.0,
      "verified": true,
      "author": "Addison Baca",
      "helpful_votes": 0,
      "publication_date": 20200121
    },
    {
      "title": "Just try it",
      "text": "Have to replace tray every 2 weeks for my 20 lb boy, but the process is a huge improvement. I recommend just giving it a try. It comes with one tray, but buy a multipack too. I got a lavender one that smells good. In the end it does give off an odor when it’s ready to change, but it’s different and less strong than traditional litter. And you only have to do something every couple weeks, so really. Pretty life-changing. Finally there’s no litter all over the floor/ anywhere my cat goes. I feel like a better cat mom, too",
      "rating": 5.0,
      "verified": true,
      "author": "Caitlin",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "great for cowardly cats & renters",
      "text": "I rent a room in a house and don't want to be 'that guy'. Also, I like to be super neat. (military trauma?) But, I'm also super busy for friends, family, and 'the man'. This thing was a lifesaver. It lets me stay super accomplished, without provoking any existential crises. It doesn't matter if you have one cat or many. It doesn't matter if your cat is a productive pooper, or the savoring type. This litter box gets it done for you. FYI: Anyone who has met my cat knows that he has ZERO courage, with the slightest novelty provoking a 'full fetal' response. But he had no trouble adjusting to this thing.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew Roy",
      "helpful_votes": 2,
      "publication_date": 20170730
    },
    {
      "title": "One year in, still going strong!",
      "text": "I purchased this item just over one year ago and am still loving it. We are a two cat family and I HATE the smell of a litterbox. This little jewel has saved my nose, AND MY WALLET, for over a year. We switch out trays every 2 weeks because as the \"trap\" area gets full, one of our cats decides to potty elsewhere in the bathroom. She did that with a regular litterbox, too, so I won't fault this product. It's just so nice knowing I don't have to do the back breaking stinky work of changing a litterbox/scoop the stupid box, on a regular occasion. Worth every penny.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah A.",
      "helpful_votes": 0,
      "publication_date": 20171107
    },
    {
      "title": "Not worth it.",
      "text": "I was excited to get this litter box (against the protests of my wife... \"the cats don't care about fancy tech like that\") and unfortunately, I was wrong. First, the special litter for this DOES NOT control odor. Second, the auto rake gets caked with poop and requires cleaning on a regular basis. Finally, the time estimate that each tray of litter will last is WAY off. Combine with the price of each tray, this turns out to be a much more expensive piece of equipment than expected. We have since switched to plain old littler and a covered box. Much happier now.",
      "rating": 2.0,
      "verified": true,
      "author": "Matt K.",
      "helpful_votes": 0,
      "publication_date": 20180904
    },
    {
      "title": "Imagine the SW trash compactor as a litter box",
      "text": "The crystal litter was wretched. After reading reviews I got the forever tray and arm & hammer slide litter and with some coaxing my cats did start using it but litter got everywhere. When you try to clean the collection area litter falls out all over. The rake always left an empty spot in the back corner so I’d have to even it out. All of this defeated the point entirely but the worst was the next bit. It turned on while my cat was inside using it. She was terrified and wouldn’t go back, I didn’t blame her. Returned with a huge sour taste in my mouth for the time, effort, and kitty trama.",
      "rating": 1.0,
      "verified": true,
      "author": "aparks08",
      "helpful_votes": 0,
      "publication_date": 20200228
    },
    {
      "title": "Expensive mistake. Buyer beware.",
      "text": "This has been an expensive disappointment. We have 2 small cats. The rake often lifts and goes right over the top of solid waste. On the return trip it crushed the solid waste behind the rake. With normal use the expensive replacement trays are lasting 7-10 days at most. I would not choose this brand again. UPDATE. I finally gave up. The smell was just too bad and despite all efforts to fix it, it just doesn't work. Company asked me to call them, I asked to communicate via email (keep it in writing) and that was where it ended. $160.00 down the drain.",
      "rating": 1.0,
      "verified": true,
      "author": "Xtian",
      "helpful_votes": 3,
      "publication_date": 20170209
    },
    {
      "title": "Over-priced",
      "text": "This product is so-so. I’ve noticed the biggest change in odor is merely the use of crystals versus clumping litter. I switched my other box to crystals too and my cats still prefer their other litter box. The scooping function moves some poo to the holding area and leaves some. It scoops just as much litter as it does poo. I honestly don’t recommend this product before just switching your cats to crystals. I would return if still within the return time frame window. For the price, it’s not really worth it.",
      "rating": 2.0,
      "verified": true,
      "author": "Dr. Kelsey",
      "helpful_votes": 0,
      "publication_date": 20200222
    },
    {
      "title": "Doesn't control odor very well",
      "text": "Nice concept but after using it for a couple of months it actually is not any better at controlling odor than a cheap one. I spent a lot of money and now it's too late to get my money back. What a disappointment this system turned out to be. Now I will have to spend more money to find yet another one. I have surgery coming up on my arm and won't be able clean one without both hands.",
      "rating": 3.0,
      "verified": true,
      "author": "Marilyn Ferguson",
      "helpful_votes": 0,
      "publication_date": 20181113
    },
    {
      "title": "Highly recommend 👌",
      "text": "Wow should have bought this a long time ago.. easy as 1 2 3 to clean n put new one in. My cats also sit n watch it when the rake goes on. One reviewer mentioned she bought the easy slide litter so i did that with the chrystal litter it comes with mixed them together!! I have no oder. I have 3 cats one clean box we changed in 7 days. No scooping out litter!!! No arguing on changing the cat litter!! I honestly recommend and worth the price.",
      "rating": 5.0,
      "verified": true,
      "author": "CocoaCt",
      "helpful_votes": 0,
      "publication_date": 20201007
    },
    {
      "title": "Very Disappointing, Do Not Recommend",
      "text": "We were super disappointed with this litterbox. We got it so that it would be easy to clean, but it definitely is not easy to clean at all. It does okay at controlling odors, but we still end up having to manually clean out the litterbox on a regular basis.",
      "rating": 2.0,
      "verified": true,
      "author": "Brittany Ellich",
      "helpful_votes": 2,
      "publication_date": 20191102
    },
    {
      "title": "NO SCOOPING FOR ME",
      "text": "I love the scoop free litter box. I have two of them and 2 cats. One does not have the timer, wish it did. The one with the timer is the best. It scoops within 5 minutes and has a counter of how many times a cat is in there. I change my box most of the time every week. Cover it up and trash it. I do take some extra time to wipe down the box with cleaning wipes and put a new box on. No scooping. LOVE IT!!!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Maureen Santosusso",
      "helpful_votes": 0,
      "publication_date": 20181019
    },
    {
      "title": "Awesomeness!",
      "text": "We just moved into an apartment so I needed to make my cat an indoor cat. I also have two dogs. Well we all know dogs love to eat cat poop. That's why I ordered this litter box. At first my cat was a little taken back by the litter but he used it anyway. Then he was surprised by the noise it made when scooping. However, it hasn't stopped him from using it and my dogs aren't ingesting nasty poop. A great benefit is there is no odor. I change it once a month. Amazing. So happy I ordered it.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200911
    },
    {
      "title": "Purchase TODAY!",
      "text": "I did a lot of research and was scared of any thing like this! Omg! This is the best thing ever..why I waited 12 years I don't know. For the first time my house never smellls like kitty litter! Cats took a week or so to get use to it. They refused until I removed their other box permanently. I started with no lid and a week later put that on. Worked like a charm!!! I check it every fews days just to make sure all is ok and a month in with no problems.",
      "rating": 5.0,
      "verified": true,
      "author": "Mandi Van Auken",
      "helpful_votes": 2,
      "publication_date": 20180314
    },
    {
      "title": "This works well!",
      "text": "It took kitty awhile to use this, we sprinkled old brand litter in with the new, it didn't make a difference. Once we removed the old litter box (still in place for a back-up) kitty realized there was no where else to go and used it like a champ. Odor issue: More of a clay litter smell that I would have thought (or cared for) upon initial uses, but all odors were gone in a day or less. It's an awesome product and I'm sad I let negative reviews keep me from buying this for so long.",
      "rating": 5.0,
      "verified": true,
      "author": "M.Larsen",
      "helpful_votes": 0,
      "publication_date": 20200222
    },
    {
      "title": "Best intention for cats. Ever.",
      "text": "Love this litter box. So much easier than regular ones. You should check the disposal area every couple of days but otherwise you're good until its time to change out the litter tray. If you change the Crystal's every week or so, the tray will last up to a month and a half before they need to changed. Always check for wet spots to make sure its clean enough to keep using. I bought one for my house and my fathers house and I will never go back to regular \"scoop yourself \" litter boxes.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie",
      "helpful_votes": 0,
      "publication_date": 20200620
    },
    {
      "title": "Too shallow",
      "text": "While I like the concept, and the rake works well most of the time, poopies would occasionally get stuck behind the rake. But, we had to quit using it, since we could not afford to change the litter trays often enough. The device just could not keep up with the urine output of our elderly kitty who has failing kidneys. The litter tray is very shallow and needed to be changed about every 4 days.",
      "rating": 4.0,
      "verified": true,
      "author": "Becky Harman",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "What the smell is wrong with you?",
      "text": "This does not cover the smell of the extracted feces. It just doesn't. Now it helps, a lot, but it does not cover it completely. I simply doesn't. Or maybe I got a bad unit. I doubt it, but you never know. Anywho, it's great. The cleaning and replacing of the trays is super easy and those are the great things. But the bad things: 1.) the smell, and 2.) the stupid litter being tracked all over the laundry room floor and having to be vacuumed every five minutes. If this could solve those two issues... we'd have a winner of epic proportions.",
      "rating": 4.0,
      "verified": true,
      "author": "CajunDragon",
      "helpful_votes": 0,
      "publication_date": 20190829
    },
    {
      "title": "Great litter box but litter doesn’t work as long as it says",
      "text": "I LOVED this when I first purchased it but I agree with the reviews below. Something in the litter changed and I went through 3 treys in 1 month for 1 cat. That’s $40+ for kitty litter for one month which is way more than I usually spent. When I first used the product I didn’t smell anything but now I do and have to change the treys more. If the treys lasted longer I would totally give this 5 stars but for the price of the treys/litter it’s disappointing. If they fix the litter I will ajust my rating.",
      "rating": 3.0,
      "verified": true,
      "author": "Lauren",
      "helpful_votes": 0,
      "publication_date": 20190424
    },
    {
      "title": "Worth Every Penny!!!",
      "text": "I've recently tried several automatic kitty litters with TERRIBLE results. I finally decided to bite the bullet and purchase the PetSafe ScoopFree kitty litter even though it's one of the most expensive in it's category. I COULDN'T BE MORE SATISFIED!! This scoop free box is amazing and worth every penny! I have the nose of a bloodhound and the odor elimination is top notch. I have just one 11 pound cat. This litter box has been set up for 3 weeks and I've done literally NOTHING to it (except sweep up the few loose crystals my cat tracks out with her)!! She transitioned easily from her old traditional litter to the crystals. I wish I would've purchased this years ago!",
      "rating": 5.0,
      "verified": true,
      "author": "Paul",
      "helpful_votes": 0,
      "publication_date": 20200616
    },
    {
      "title": "Disaster",
      "text": "This arrived and we set it up with our issue. Soon started finding cat pee. Turns out it’s defective and blinking jammed. We’ve only had it a week. So it was jamming in different phases, freaking out feline, causing her to seek a new spot to pee.",
      "rating": 1.0,
      "verified": true,
      "author": "Erica",
      "helpful_votes": 0,
      "publication_date": 20200927
    },
    {
      "title": "BEWARE - PetSafe ScoopFree Ultra Automatic Self Cleaning Hooded Cat Litter Box",
      "text": "This system is NOT for kitties that urinate a lot, or have loose stools. The crystals do not absorb liquids, the urine goes into the cardboard box and eventually soaks through to the floor. The loose stools get stuck to the rake requiring manual daily cleaning. There is NO odor control. It takes much longer to clean this box than it takes to clean a regular old fashion litter box. Just not worth the extra cleaning, the odor, and hassel!",
      "rating": 1.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "Just not worth it",
      "text": "I bought this item when I was pregnant, that way I wouldn't have to clean it out or anything and my husband could just change the whole box when needed. The 5-minute timer sucks. If your cat poops and it's not so pretty, the poop gets stuck to the prongs that are supposed to push it under the container lid. Then the poop spreads onto the sides of the box. The smell of the pee is worse than having a regular litter box and the actual litter is super dusty and just not good at masking any kind of odor. I wouldn't recommend this item at all.",
      "rating": 1.0,
      "verified": true,
      "author": "Amber ",
      "helpful_votes": 0,
      "publication_date": 20190715
    },
    {
      "title": "no thank you",
      "text": "Not really liking this product. One of our cats doesn't use it what-so-ever. The other cat uses it. When used it works about 50% of the time, when it doesn't work its because the cat blocked the sensor with liter. The feces gets swept away but the urine remains on the crystals and the whole house smells horrible. (This is even after i spent about $50 on the forever tray and liter) Wouldn't recommend.",
      "rating": 1.0,
      "verified": true,
      "author": "jeremy keough",
      "helpful_votes": 0,
      "publication_date": 20200622
    },
    {
      "title": "Well worth the money",
      "text": "This is amazing 😉 got tired of constantly reminding my teen to clean litter box every day so solution for the smell and mommy nagging was this product. Place a little of the old litter in the new box on the top of the crystals best to use perhaps a scoop of actual dirty litter. Our cat was complexed by it at first but within hours was using it and she actually stands in front of it and waits for the rakes to clean it lol 😂 sooo worth the money",
      "rating": 5.0,
      "verified": true,
      "author": "Kailene",
      "helpful_votes": 0,
      "publication_date": 20200604
    },
    {
      "title": "Stop Scooping Your Cat Litter",
      "text": "We were very hesitant to purchase this litter box because we have three weirdo cats. They make a mess of our litter area but we never thought they’d use a litter box with a lid. All three of my cats took to this litter box within the day and use it with no issues. We also got the one with just the sides and they use both interchangeably. We’ve had them a couple of months and I will never go back to scooping litter. I change them once a week and it’s painless and not stinky. I dump the used litter in our big trash bin and then still recycle the boxes. A steal for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Joel",
      "helpful_votes": 0,
      "publication_date": 20200825
    },
    {
      "title": "Love it!",
      "text": "I think this is a lifesaver! Yeah it's not perfect and sometimes stuff sticks to the bars but I would rather take 10 minutes once a week to clean this and having to scoop twice a day. I have no problem with the noise level , but it's not right next to me when I sleep either it's in a whole different room. And yeah sometimes you do still smell it especially when someone just goes, but it's cat poop so you have to expect a little something. I would definitely recommend this product if you have the money but not the time because it is a little pricey.",
      "rating": 4.0,
      "verified": true,
      "author": "L. Bowers",
      "helpful_votes": 0,
      "publication_date": 20190530
    },
    {
      "title": "No clear advantage over normal litter boxes",
      "text": "It was easy to assemble and my cat used it right away. However, the crystals do not trap the odour at all. I just have one cat and it starts smelling really bad within 3 days. I have to keep cleaning it as I would clean a regular litter box which beats the purpose. I had hoped that by changing the crystals to Lavender scent it would solve my problem but that didnt work at all. My return window closed in September so I am stuck with the stupid thing. Honestly, I dont think its worth the $100+ dollars.",
      "rating": 3.0,
      "verified": true,
      "author": "Joy",
      "helpful_votes": 0,
      "publication_date": 20181226
    },
    {
      "title": "So much easier!",
      "text": "I love our cat, but gag anytime I had to scoop the litter box. This ScoopFree box has been AMAZING! I literally don't have to do anything until it's time to change the box. For one cat, the litter trays last about two weeks. I only have two complaints so far. The refills are so expensive! It gets pricey. Also, I was hoping it would really help with the smell, but there isn't a significant improvement, even though I clean the inside whenever I change the trays. For me, it's worth not having the hassle of scooping the litter box every day.",
      "rating": 4.0,
      "verified": true,
      "author": "Virginia",
      "helpful_votes": 3,
      "publication_date": 20160616
    },
    {
      "title": "THIS THING SAVED MY LIFE!!!!",
      "text": "THIS THING HAS SAVED MY LIFE! I have two cats and I don't know how I lived before this product! The refills say they only last about 15 days with 2 cats using the litter box but after 15 days, if you remove the lid and scoop the poop that has been pushed to the end, you can make it last 20-25 days SOMETIMES 30 DAYS with TWO cats without any odor. IF YOU HAVE MULTIPLE CATS THIS IS A MUST!!!! It is worth the money! A 3 pack of refills is $45 on amazon. With one cat, one refill can last you over a month. It pays for itself!!! GET IT NOW!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer",
      "helpful_votes": 0,
      "publication_date": 20170731
    },
    {
      "title": "So much better than Litter Mate",
      "text": "This product works great. We have two cats that use it frequently. This product had a counter to track usage. They may go as many as 100 times in a week. Once we get to 7 or 8 days it becomes yellowed and a slight odor is noticeable. We don’t use the lid as one cat won’t enter. Very quiet when running. We went through a Litter Maid almost yearly over the past 14 years. This is so much better. We use the disposable pans, expensive but no cleaning as compared to permanent pan. Based on two months usage I highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191015
    },
    {
      "title": "It broke barely after one year.",
      "text": "Won't turn on anymore after grinding noises. Took very good care of it. Extremely overpriced for this cheap plastic fisher price junk, probably designed to fail after warranty expirations. Just moved into an overpriced new apartment (and no, it was moved clean in car very carefully last along with my kitties themselves) and it broke in one week being here, cool. Never trusting this company again.",
      "rating": 1.0,
      "verified": true,
      "author": "Rise",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "Love!",
      "text": "I lobe this litter box. While I do not get a month out of my kitty litter as suggested in the product description, that may change after my cat is older, he is under a year and still goes often, It is nice not to have to scoop every morning or if we go away for the weekend to know he has a lean litter box and just have someone stop by and feed and play with him. He took right to it with no problems",
      "rating": 5.0,
      "verified": true,
      "author": "Debreda R",
      "helpful_votes": 0,
      "publication_date": 20200226
    },
    {
      "title": "Litter scam!",
      "text": "I really wanted to like this product, but it seems like a scam to order expensive crystal litter. The crystals do not absorb, and I ended up having to throw away the disposable trays after a week of use, spending almost $100 a month on litter and trays. I finally caved and bought a plastic reusable tray, and had to dump it and clean it once a week still. I’m now at least subbing clay clumping litter, at least to save on money. I’ll end up caving and buying another litter box, I’m sure.",
      "rating": 2.0,
      "verified": true,
      "author": "reeseypie",
      "helpful_votes": 0,
      "publication_date": 20190915
    },
    {
      "title": "Do not waste your money!!",
      "text": "I’m really disappointed that this didn’t work because I despise litter boxes and all the reviews have said it was great and my friends that use it haven’t had issues. I’ve had this litter box for a few months now and I have had nothing but trouble out of it (Doesn’t scoop litter well, constantly sticking to the scraper, etc) and the litter does not last very long for the price. I’ve got probably $300 invested in this between the device and the litter and am switching back to regular litter. It just doesn’t work. Save your money.",
      "rating": 1.0,
      "verified": true,
      "author": "Victoria",
      "helpful_votes": 0,
      "publication_date": 20191104
    },
    {
      "title": "I’m loving Not having to scoop every day!",
      "text": "I am so grateful that I do not have to clean the cat box every day. Even though it says it can go up to two weeks I would not leave it that long. Definitely going to be switching to regular litter that other people have recommended in their review. But I really love this product I wish I would’ve bought it way sooner. Both cats had no problem using this new fangled invention that we brought into the home LOL",
      "rating": 5.0,
      "verified": true,
      "author": "amstudentofjc",
      "helpful_votes": 0,
      "publication_date": 20200804
    },
    {
      "title": "Works great",
      "text": "took some time for kitty to adjust, he was freaked out by the crystals, so I used the old litter box with new crystals, and he adjusted , then removed old box and he adapted to the new one, took about a week to transition, now I am so happy, self cleaning works excellent, crystals control any order in-between changes . a lot less work for me,",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190303
    },
    {
      "title": "Great if you can afford the changes",
      "text": "I have had this cat box several months now and it works as advertised. I bought the reusable box so I can clean and refill myself as the throw away boxes can get quite expensive. In doing so I now need to clean the cat box and it sort of misses the point of buying this box in the first place. I get 2 weeks out of a change with 2 cats before it reaches\" critical mass \" and at $14 per change that can get spendy. I dont think I would purchase this one again, I'd look at other options. But if you can afford the expensive changing kits go for it.",
      "rating": 3.0,
      "verified": true,
      "author": "Jon360",
      "helpful_votes": 0,
      "publication_date": 20191111
    },
    {
      "title": "EFANTASTIC!",
      "text": "Delivered & installed June 24. According to counter has used 85 times. Still plenty of room in potty storage section & plenty of litter left for peeing. Disabled & need easy clean/disposal box. Cat weighs 10 - 13 lbs. Highly recommend! No odors! Cat loves it. Have had other self-cleaning boxes before.but this beats others. Lasts much longer if only 1 cat. UPDATE: Single cat has used 100 times. Still has plenty litter left for peeing & potty section not full.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190707
    },
    {
      "title": "Waste of money",
      "text": "Such a waste of money.it smells horrible I can’t believe they sell this product for this expensive. Don’t waste your money on this. The urine and the waste will smell all over the living room. It doesn’t work at all",
      "rating": 1.0,
      "verified": true,
      "author": "JYU",
      "helpful_votes": 0,
      "publication_date": 20201005
    },
    {
      "title": "Works great but my cat is an idiot",
      "text": "Works great and it’s easy to clean and set up. The only issue isn’t about the actual litter box, it’s my cat deciding to be a jerk lol. He thinks it’s ok to pee in the box, and then once it starts to clean he will JUMP BACK IN and poop. So instead of going into the place it’s supposed to, it’s stuck in the box. I’ve tried changing the times multiple times but he still manages to do it and I don’t get it. I love him but wow hahaha",
      "rating": 5.0,
      "verified": true,
      "author": "Casey",
      "helpful_votes": 0,
      "publication_date": 20201021
    },
    {
      "title": "cats use it, but favor front entry",
      "text": "We have 3 cats and I needed 2 litter boxes, so I chose 1 of these and 1 of the front entry style. They use this one far less frequently than the front entry. I recommend buying 2 front entry boxes if you need 2 litter boxes. As for convenience, it's the best invention I've come across. The odor is far less, the cats seem much more content and healthy. It's worth the expense if you can afford it.",
      "rating": 4.0,
      "verified": true,
      "author": "Carma Chan",
      "helpful_votes": 0,
      "publication_date": 20200612
    }
  ],
  "product_meta": {
    "title": "PetSafe ScoopFree Ultra Automatic Self Cleaning Hooded Cat Litter Box – Includes Disposable Trays with Crystal Litter and Hood - 2 Colors",
    "description": "Style:Ultra| Color:TaupeStrike scooping the litter box off your to do list. With the ScoopFree Ultra Self-Cleaning Litter Box, there’s no scooping, cleaning or refilling your cat’s litter box for weeks. It uses crystal litter that provides 5 times better odor control than traditional clumping litter by absorbing urine and dehydrating solid waste. This low tracking litter also helps keep your floors clean because it is 99 percent dust free and doesn’t stick to your cat’s paws. Safety sensors ensure that the scooping cycle only occurs when your cat is out of box. It uses disposable trays that have a plastic lining to help protect against leaking, and each tray comes with a lid for quick and easy disposal. There’s even a health counter that tracks how many times your furry feline uses the box, which is a convenient way to detect early signs of a health issue, and the included privacy cover gives your cat a secluded bathroom. PetSafe brand is here to help you and your pet live happy together.",
    "rating": 4.1,
    "feature_bullets": [
      "Automatically removes waste: No scooping, cleaning or refilling your cat's litter box for weeks",
      "Unbeatable odor control: Crystal litter removes smell by absorbing urine and dehydrating solid waste",
      "No more messy floors: Low-tracking crystals are 99% dust free and don’t stick to your cat’s paws",
      "Leak protection: Disposable trays have plastic lining to help protect against leaking and keep your floors clean",
      "Easy cleanup: Simply remove the tray and throw it away; each tray includes a lid for quick disposal",
      "Monitor your cat's health: The health counter and motion sensors keep track of how many times your furry feline uses the box",
      "U.S. based customer care: Let our pet product experts help",
      "Quality guaranteed: PetSafe brand has been a trusted global leader in pet behavior, containment and lifestyle innovations for nearly 30 years; We help pets and their people live happy together"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "27.5 x 19 x 17 inches; 21 Pounds",
      "Item model number": "PAL00-15342",
      "Date First Available": "October 5, 2015",
      "Manufacturer": "Waste Management",
      "ASIN": "B016PXH9R2",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Self-Cleaning Litter Boxes",
      "Litter & Housebreaking",
      "Litter Boxes",
      "Pet Supplies",
      "Cats"
    ],
    "price": 169.95
  }
}