{
  "website_summaries": [
    {
      "verdict": "A set of beads that are bouncy, squishy, and uniform when they expand.",
      "pros": [
        "Package will fill the bottom of a baby pool when expanded",
        "Also comes in solid colors for flower arrangements and wedding or party decor",
        "Very bouncy when filled",
        "Relaxing for play",
        "Adults and kids enjoy these beads",
        "This set has a container with a nice lid so you can safely store those you are not using"
      ],
      "cons": [
        "While these are very durable, they can and do break",
        "It is best to use them in a place that you do not mind getting wet"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "YOU JUST NEED TO EXPEIRENCE YOURSELFA AND THIS BOTTLE WILL BE ENOUGH PLUS ....",
      "text": "These are really cool. You need to just buy them yourself. I don't feel like I'm wasting anything because the ones I've allowed to absorb water have almost all been used to put water back into my houseplants :) Super Cool Feeling ~ Relaxing ~ Fun !!! Not Really Messy ... They Do Go Bouncing All Around Though :) Have Had Some In A Little Air Tight Container On My Window Sill Since Christmas As Decoration??? I Find Ways To Use All Types Of Things As Decor As Well As Whatever Other Purposes :)",
      "rating": 5.0,
      "verified": true,
      "author": "MELLY Z",
      "helpful_votes": 5,
      "publication_date": 20180217
    },
    {
      "title": "Endlessly Entertaining",
      "text": "These were a total hit for my 3 year olds birthday party. The adults and big kids loved them too. The day of the party was a little chilly so we put them in the water table for the kids instead of water. I had used two jars which was too many for the water table but would have been great for the kiddie pool. They are definitely messy, slippery and crush underfoot but they don't stain and were easily swept up and off the deck. They have also rehydrated after it rained so we continued to play with them in the water table. Very cool.",
      "rating": 5.0,
      "verified": true,
      "author": "Erin",
      "helpful_votes": 4,
      "publication_date": 20180508
    },
    {
      "title": "This item is fun! You don't realize how big the beads get",
      "text": "This item is fun! You don't realize how big the beads get. The only thing is that I thought the container was larger than the picture provided here but now that I look at it, it looks about right! You get a ton of beads in this little package and so far we have used just about 1/4th of the bottle just to play with. These beads last forever. At first I thought they would pop like a water bubble but they are gel. They are just really cool. So many things you can do with these. I'm going to use them as a \"fishing tank\" for my kid's birthday. Can't wait!",
      "rating": 5.0,
      "verified": true,
      "author": "Becky",
      "helpful_votes": 0,
      "publication_date": 20161208
    },
    {
      "title": "Worth money",
      "text": "I had a sense that they are easily broken with some pressure but since they are SO MANY of them, I honestly don’t care about the broken ones. I only used not even 1/10 of the bottle and still got full of big containers. My toddler squeeze them for fun anyway. I recommend playing with this outside 😂 Perfect combination with a toddler water table 👍🏻 Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Max Venturi",
      "helpful_votes": 0,
      "publication_date": 20200514
    },
    {
      "title": "Sensory stimulation",
      "text": "Sensory therapy. But open outside over growing things! They are tiny beads in the jar, charged up with the Small Force and take off when opened. I opend in the kitchen and was worried about escapees. Well beads are about 1/2”diameter full grown, and very slippery, nontoxic, so probably will let this stay in the cupbord for now - I planned to make a sort of water table toy for our two year old with them, but will wait a while. I think they would be super,for people who have a sense of touch and understand “rules” (these are for touching only), for sensory stimulation. Very colorful, with a unique, smooth texture.",
      "rating": 4.0,
      "verified": true,
      "author": "SaraBeing",
      "helpful_votes": 0,
      "publication_date": 20171121
    },
    {
      "title": "Fun for days",
      "text": "If you’ve never seen these in person you don’t know what you’re missing. The tiny sprinkle-sized beads swell into gelatinous bubbles of squishy goodness. But if you have very small children beware- You need to supervise closely so they don’t eat these! They’re bright and colorful and provide a unique tactile experience. Have older kids? They will love them too! Everyone does. Finally, we have had success with dehydrating these beads and reusing them. This bottle might be small but the beads will surprise you with the volume they grow to.",
      "rating": 5.0,
      "verified": true,
      "author": "Sears",
      "helpful_votes": 0,
      "publication_date": 20171018
    },
    {
      "title": "Beads... Beads.... Beads... but not Mardi Gras",
      "text": "These things grow about the size as marbles (and shrink back again if you dry them out well). When they say use a teaspoon they aren't kidding. Like rabbits they multiply quickly lol. This kept my 2 year old entertained for HOURS day after day. She puts them in a big size 10 can with water and shoves her hand in them. They have helped her learn to grab slimly things with great accuracy and frankly in a balloon its like a stress ball. so many uses. I've seen her eat them on occasion (it happens people) and they are truly non toxic. Completely save for kids and pets.. Great product",
      "rating": 5.0,
      "verified": true,
      "author": "NordstromJunkie",
      "helpful_votes": 0,
      "publication_date": 20170725
    },
    {
      "title": "Great product",
      "text": "I bought these as a Christmas gift for my daughter and wanted to let her get some good use from them before posting a review. While I can gripe about the nature of the product in general (is anyone thrilled by beads ending up all over the house?), these are an excellent buy for this type of product. The beads grow to a good size in a fairly short time (about marble-sized) and hold up well. Unlike some others I've seen, they seem to be fairly durable and don't break apart easily. Most importantly, my daughter has been thrilled with them.",
      "rating": 5.0,
      "verified": true,
      "author": "ChadwickND",
      "helpful_votes": 0,
      "publication_date": 20170910
    },
    {
      "title": "These little beads are amazing! I ordered a 6oz jar for my son ...",
      "text": "These little beads are amazing! I ordered a 6oz jar for my son so that he could 12\" balloons with them to use as stress balls for \"just because\" gifts to family. Two teaspoons will make several balloons. We also still have a basically full jar. We are searching for more ideas to use these beads for. They are great. My son LOVES them. This was definitely a great buy.",
      "rating": 5.0,
      "verified": true,
      "author": "AndiQ",
      "helpful_votes": 2,
      "publication_date": 20170301
    },
    {
      "title": "These are awesome to watch grow",
      "text": "These are awesome to watch grow. You can also have them shrink and watch them grow again, at least we tried it once. They come in a small bottle but just a measure gets you a full large bowl so they are going to lasts us a very long time. After weeks of playing with them they then used them a couple of days to \"soak their feet\" in the balls and then of course we discarded them. They did enjoy the feeling of the cool little balls on their feet.",
      "rating": 5.0,
      "verified": true,
      "author": "Morena",
      "helpful_votes": 0,
      "publication_date": 20161215
    },
    {
      "title": "Good buy!",
      "text": "Holy cow this little jar makes a TON of water beads! My kids love playing with them, but I love how they can be put it my plants to keep them watered and alive while we’re out of town.",
      "rating": 5.0,
      "verified": true,
      "author": "Meg J.",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "These are really fun but be sure you start small when you soak ...",
      "text": "These are really fun but be sure you start small when you soak the beads. We put a couple of tablespoons of beads into a large bowl of water to soak overnight. By morning they were overflowing all into the kitchen floor! My daughter put them in our foot spa. They are kind of irresistible to play with but we don't keep a batch of them around long for sanitary reasons. All in all, a fun toy and a great value!",
      "rating": 5.0,
      "verified": true,
      "author": "Oregon Mom",
      "helpful_votes": 0,
      "publication_date": 20170121
    },
    {
      "title": "Great for science party",
      "text": "I bought this for my daughter's \"Mad Science\" party and had a bowl of them out for the kids to touch and feel. they LOVED it. they all got a small container with more magic beads to use at home. Perfect!",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190417
    },
    {
      "title": "Great fun for toddlers!",
      "text": "These Magic Beadz are a huge hit with my twins! It was so fun to watch them grow, and now the kids are loving being able to pick out colors and play with them. It makes so many beadz that it's hard to know what to do with them all for only two 4-year-olds. These would be great to dole out in little goodie bags and hand out at kids' birthday parties!",
      "rating": 5.0,
      "verified": true,
      "author": "Purse Lover",
      "helpful_votes": 0,
      "publication_date": 20160705
    },
    {
      "title": "Obsessed!!",
      "text": "Purchased these for my daughter science themed birthday party. Filled a under bed storage tote with a bunch of these and water....it was like swimming in a sea of awesomeness lol. It's such a cool incredible feeling. Get two bottles because you'll be obsessed but they make SO many water beads!!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "HCMG4",
      "helpful_votes": 0,
      "publication_date": 20170216
    },
    {
      "title": "Super fun for kids!",
      "text": "Super fun for kids. Doesn't take too long for the beads to start growing, and get pretty large if they are soaked for long enough.",
      "rating": 5.0,
      "verified": true,
      "author": "Juls S.",
      "helpful_votes": 0,
      "publication_date": 20200924
    },
    {
      "title": "My kids ( and myself) love these magic beads",
      "text": "My kids ( and myself) love these magic beads. At first we really weren't into watching how they grow but when we made a bowl and checked they were shocked! It kept my 3 and 7 year old busy for hours just touching them and moving them around. And I loved them too! A little goes along way with these so the bottle can last you along time. Would definitely purchase again!",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley N Ruffolo",
      "helpful_votes": 0,
      "publication_date": 20160806
    },
    {
      "title": "Great fun",
      "text": "This was a huge hit with my 2 & 3 year olds. They loved watching them grow and were so excited to play with them. The jar looks tiny but a tea spoon made enough to fill a pretty large basin and 1/4 full. Their favorite thing was to stand in the basin. I'm going to get more and fill a huge under-bed container with them so they can get in and go wild.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah S",
      "helpful_votes": 2,
      "publication_date": 20151210
    },
    {
      "title": "Fun summer toy",
      "text": "Kids loved them...I didnt love picking up, but knew they were environmentally safe so didnt worry too much.",
      "rating": 5.0,
      "verified": true,
      "author": "Buyer in USA",
      "helpful_votes": 0,
      "publication_date": 20200711
    },
    {
      "title": "Smaller than marbles..",
      "text": "I like the idea of them, will hopefully find some more golf ball size, just smaller than I expected, even after filled with water.. Says fun for all ages, and I'm sure it is, but not recommended for kids that like to put stuff in their mouth, or will leave them laying around.. ( filled with water that will leak back out over time)",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20180302
    },
    {
      "title": "Child Pleaser! So many BeadZ in one tiny package!",
      "text": "When I read in other reviews that these little beads (sorry, beadZ) would somehow entertain my kids for hours, I was a little skeptical. But sure enough. Give your kids a bowl, a spoonful of these bad boys, and some patience (for them to grow) and sure enough -- they DO play with them for hours! Definitely an outside toy though. The slippery beadZ get everywhere and our cat tried to eat them.",
      "rating": 5.0,
      "verified": true,
      "author": "Brianna",
      "helpful_votes": 0,
      "publication_date": 20190424
    },
    {
      "title": "Awesome",
      "text": "Nice colors. Good size. Great for sensory play. Recommended for children who do not put objects in mouth/nose",
      "rating": 5.0,
      "verified": true,
      "author": "Heather B.",
      "helpful_votes": 0,
      "publication_date": 20190309
    },
    {
      "title": "Magic Beadz were a great choice.",
      "text": "My 2 year old twin grandchildren give them 2 thumbs up. We made a happy mess this weekend! These will look spectacular in a vase with flowers- my second use for these.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda Lafon",
      "helpful_votes": 4,
      "publication_date": 20160919
    },
    {
      "title": "These are so cool. Really good for kids with sensory issues",
      "text": "These are so cool. Really good for kids with sensory issues. My minion loved playing in these. I would suggest using warm water when inflating them because they get really cold, and trying to drag a toddler away from them to get warm is definitely an exercise in patience.",
      "rating": 5.0,
      "verified": true,
      "author": "BadPenny",
      "helpful_votes": 0,
      "publication_date": 20171019
    },
    {
      "title": "They absorb quickly, with relevance to the other brand ...",
      "text": "They absorb quickly, with relevance to the other brand I had, appear to be holding up well, and time will tell how they do as a soil alternative for my Botany class experiment. My rating of the product will not be contingent upon my students' results.",
      "rating": 4.0,
      "verified": true,
      "author": "Ramona Underwood",
      "helpful_votes": 0,
      "publication_date": 20161103
    },
    {
      "title": "Really cool and pretty",
      "text": "These are really cool! Just fun to play with and look at. We did an experiment to see how large they got every two hours. The kids enjoyed comparing the sizes over 24 hrs. The final size is smaller than I anticipated, but still fine. A bit smaller than the size of a little gumball.",
      "rating": 4.0,
      "verified": true,
      "author": "RKD",
      "helpful_votes": 0,
      "publication_date": 20171219
    },
    {
      "title": "Five Stars",
      "text": "These are awesome! It is a small jar, but you only use a teaspoon at a time and from the looks of it, it will last for a very long time! Our kiddo spent all day going back to check on growth progress and had a great time playing and straining these. They are also multi-colored which is cool too.",
      "rating": 5.0,
      "verified": true,
      "author": "Allison Williams",
      "helpful_votes": 0,
      "publication_date": 20170114
    },
    {
      "title": "Christmas gift.",
      "text": "Don't know much about this product, it was given as a Christmas gift.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe Wall",
      "helpful_votes": 0,
      "publication_date": 20200218
    },
    {
      "title": "Good quality, we love them.",
      "text": "My ten year old ordered these to play and experiment with and he loves them. There are so many in one container and they go so far. We are still experimenting to see how big we can get them to go. I really like that they are in a jar and not a plastic bag because they are easier to put away.",
      "rating": 5.0,
      "verified": true,
      "author": "Leslie VanBrunt",
      "helpful_votes": 0,
      "publication_date": 20170309
    },
    {
      "title": "Recommend age and saftey warning are because they start small ...",
      "text": "Bought for my children who are 6 and 9. Recommend age and saftey warning are because they start small which I think where the negative reviews came from, obviously will be a hazard for toddlers. Honestly I really loved these and like them more than Orbeeze. They kept their shape and did entertain my kids so mission accomplished. Friendly staff. We also live onbase in Japan and for them to get here so quickly was a blessing as most mail takes forever to be sent out and then actually get here on time was a nice change. Santa needs to buy more.",
      "rating": 5.0,
      "verified": true,
      "author": "Sara M.",
      "helpful_votes": 0,
      "publication_date": 20161126
    },
    {
      "title": "LOVE, LOVE, LOVE these magic beads.",
      "text": "This bottle has lasted us a few months and we use them all the time. Fun texture, even adults like to play with them. And when I'm done with them, I put them in the plants and it helps keep them hydrated! Great for 3 and up to adult. Great product!!!!! Love it!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Veronica ",
      "helpful_votes": 0,
      "publication_date": 20160825
    },
    {
      "title": "Big hit!",
      "text": "My grandsons (all 4 of them ranging in age from 2-8) loved these! Fun to watch expand, and squishy! Perfect for supervised fun. The younger ones may see these as jelly beans and try to eat them!",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa  Warren",
      "helpful_votes": 0,
      "publication_date": 20170502
    },
    {
      "title": "Guaranteed Family Fun",
      "text": "This really is \"fun for all ages\". Fill up a pool with these bad boys and your going to have a fun time. And the children will love them too.",
      "rating": 5.0,
      "verified": true,
      "author": "Justin Johnson",
      "helpful_votes": 0,
      "publication_date": 20190715
    },
    {
      "title": "Two Stars",
      "text": "Far from the best deal by volume for this product.",
      "rating": 2.0,
      "verified": true,
      "author": "L.C.B.",
      "helpful_votes": 0,
      "publication_date": 20180605
    },
    {
      "title": "they just kind of crumble and are easy to clean up",
      "text": "My 3 year old son loves playing with these beads! They are squishy but do not pop and make a mess all over the place if squeezed too hard; they just kind of crumble and are easy to clean up. Very bouncy. A LOT of beads are in this little container!! Good purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Keight1414",
      "helpful_votes": 0,
      "publication_date": 20170130
    },
    {
      "title": "Great buy! Enjoyable for all.",
      "text": "I am an aide in a special needs preschool and was introduced to these there. So they are supposed to be helpful for the littles with sensory issues...but they helped me too! So relaxing :) I gave these to a friend who has a daughter struggling with autism and overload. She loves them!",
      "rating": 5.0,
      "verified": true,
      "author": "Steph",
      "helpful_votes": 0,
      "publication_date": 20160616
    },
    {
      "title": "Great purchase for sensory bin",
      "text": "Jelly water beads have become my 3 year olds favorite and he has had all sorts of sensory bins. We use a 6X9 shallow container and it took just a few teaspoons of Magic Beads to fill it, which makes this a great value! I haven't had to replace the Magic Beadz at all.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161220
    },
    {
      "title": "Awesome! Work just like orbees",
      "text": "Awesome! I wanted them to fill up a kiddie swimming pool, I should have got 2 containers but it worked for us. My daughter loved them for her birthday. The lasted a long time too!",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "Fun projects for kids",
      "text": "My daughter loves these and does all kinds of experiments with them that she sees done on YouTube. After she's done she just crushes them and puts them in the dirt for the flowers. This small container provides thousands of beads. She got them for Christmas and it's July, she still has more than half the container left",
      "rating": 5.0,
      "verified": true,
      "author": "Lara",
      "helpful_votes": 0,
      "publication_date": 20170630
    },
    {
      "title": "Fun",
      "text": "Just a good time for 5 yo and her spd",
      "rating": 5.0,
      "verified": true,
      "author": "lv",
      "helpful_votes": 0,
      "publication_date": 20190404
    },
    {
      "title": "Don't let the price fool you - you get A LOT!",
      "text": "Good things come in small packages! This is a go-to instant science project and a little bit makes a lot of beads - and fun!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190421
    },
    {
      "title": "In a bowl outside is a GREAT place to play with these",
      "text": "My son and I are having a blast with these. However - DO NOT put them into the bathtub with your kiddo - getting all of them out is nearly impossible as they sink to the bottom, they are slippery and they bounce. In a bowl outside is a GREAT place to play with these.",
      "rating": 4.0,
      "verified": true,
      "author": "tashu",
      "helpful_votes": 0,
      "publication_date": 20170117
    },
    {
      "title": "cool product",
      "text": "my four-year-old grandchild will love these at Christmas not sure that her parents will oh well nice thing about being a grandparent is paying your children back",
      "rating": 5.0,
      "verified": true,
      "author": "Craig ebert",
      "helpful_votes": 0,
      "publication_date": 20171129
    },
    {
      "title": "AMAZING MAGIC BEADS DONT WASTE YOUR TIME ON ANY OTHER BRAND",
      "text": "FORGET ANY ORBEEZ OR ANY PRODUCT LIKE THIS. THESE BEADS IMMEDIATELY START TO GROW AND GET HUGE. NOT STICKY AND THEY can be used over and over and again! Awesome product my girls love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Love Leigh Angel",
      "helpful_votes": 0,
      "publication_date": 20161204
    },
    {
      "title": "These are great! We filled a water table with them at ...",
      "text": "These are great! We filled a water table with them at my daughter's 3rd birthday party and the table was so popular we ended up filling her old toddler pool with them, too. The kids couldn't get enough of them and several parents asked about this product for their own kids. I will note that we had a ton of these all over our yard. For a few weeks, whenever it would rain they'd swell back up and make a slippery spot.",
      "rating": 5.0,
      "verified": true,
      "author": "Haywire",
      "helpful_votes": 0,
      "publication_date": 20160929
    },
    {
      "title": "Hours of fun",
      "text": "My kids and their friends played with the magic beads for hours. They can be a pain to pick up. We played with them outside and used a shop vac to clean up my porch. Would buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "CindyLou",
      "helpful_votes": 0,
      "publication_date": 20180510
    },
    {
      "title": "Great Sensory Toy",
      "text": "My 2.5 year old loves these beads. It keeps him occupied for a long time plus it helps him improve his fine motor skills by using his pincer grasp to pick up a bead. This is definitely something to keep & reorder when needed.",
      "rating": 5.0,
      "verified": true,
      "author": "Sandra C. Varela",
      "helpful_votes": 0,
      "publication_date": 20160617
    },
    {
      "title": "Lots of fun for the kids",
      "text": "Lots of fun for the kids. They enjoy the squishy feel of the beads and clean up is simple. Nice rainy day activity",
      "rating": 5.0,
      "verified": true,
      "author": "Timothy W. McQueen",
      "helpful_votes": 0,
      "publication_date": 20170806
    },
    {
      "title": "Easy to use... Going to fill a baby pool with them nex!!!",
      "text": "I bought these for my son with autism and he loves them! We took them to school for his \"sensory\" breaks. My hubs and I plan to fill a small baby pool with them! Thanks for an awesome OT item!",
      "rating": 5.0,
      "verified": true,
      "author": "Courtney Ann",
      "helpful_votes": 0,
      "publication_date": 20160909
    },
    {
      "title": "These are by far the best sensory beads I have ever used",
      "text": "These are by far the best sensory beads I have ever used. I work with delayed children and often bring these beads to their therapy apts, for sensory play. I have recommended these to all of my clients and will definitely buy from this seller when I run out.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie",
      "helpful_votes": 0,
      "publication_date": 20160901
    },
    {
      "title": "these are awesome. i have couple kids with sensory issues",
      "text": "these are awesome. i have couple kids with sensory issues. they love the feel of these. They worked really fast. the colors are great. You have to add water to them of course. I liked them myself:)",
      "rating": 4.0,
      "verified": true,
      "author": "Danielle Barnhart",
      "helpful_votes": 0,
      "publication_date": 20151226
    },
    {
      "title": "Way cool!",
      "text": "These are so fun! You have to let them sit overnight but my three year old had so much fun playing with them",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole",
      "helpful_votes": 0,
      "publication_date": 20170210
    },
    {
      "title": "my grands love",
      "text": "4th time I have ordered this product in past 2 years..... my grands love them",
      "rating": 5.0,
      "verified": true,
      "author": "Brenda",
      "helpful_votes": 0,
      "publication_date": 20170326
    },
    {
      "title": "An awesome way to keep kiddos entertained!!",
      "text": "My daughter loves these!! They are very cool and a kid friendly thing for them to do. Put them in water and watch them grow!!",
      "rating": 5.0,
      "verified": true,
      "author": "Jonyardbird",
      "helpful_votes": 0,
      "publication_date": 20170418
    },
    {
      "title": "Amazing!",
      "text": "These beads are amazing! Worth the price and seller and service was great!!! Like others have mentioned it reallu does keep year old amazed for a long time! We like to use them in her water table! Even great for ages up to 7 and im sure older!!! Hey im 29 and i love them!",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley Nielsen",
      "helpful_votes": 0,
      "publication_date": 20160625
    },
    {
      "title": "I love looking at them",
      "text": "These are really entertaining for my kids. I love looking at them. Idea! Use them for an Inside Out movie party! My four year old calls them \" core memories\" and they really do look like the movie.",
      "rating": 5.0,
      "verified": true,
      "author": "Yessenia Acosta",
      "helpful_votes": 0,
      "publication_date": 20160922
    },
    {
      "title": "Just as good as Orbeez",
      "text": "Just as good as Orbeez but much cheaper. They dry and easily regrow when placed in water.",
      "rating": 5.0,
      "verified": true,
      "author": "Donohue2010",
      "helpful_votes": 0,
      "publication_date": 20190223
    },
    {
      "title": "Lots of fun",
      "text": "The beats are smaller than I expected but they are colorful, shiny and bounce like Crazy! I got it for my 19 months old son but My husband and I love to play with it! It's so much fun to touch it!",
      "rating": 5.0,
      "verified": true,
      "author": "Viviane",
      "helpful_votes": 0,
      "publication_date": 20170524
    },
    {
      "title": "They are fun and my 4 year old loves to play with ...",
      "text": "The balls turn out to be about a 1/4 inch in diameter. They are fun and my 4 year old loves to play with them. They would be a choking hazard for babies and toddlers. It's great that you can put them in soil afterward.",
      "rating": 5.0,
      "verified": true,
      "author": "CR",
      "helpful_votes": 0,
      "publication_date": 20160629
    },
    {
      "title": "Super fun!!!!",
      "text": "I bought these for my daycare to put in the sand and water table. They have been a huge hit! They have lasted submerged in the water all week. They're a diverse activity item that will lead to lots of explorative play!",
      "rating": 5.0,
      "verified": true,
      "author": "Leslie S",
      "helpful_votes": 0,
      "publication_date": 20160507
    },
    {
      "title": "Good, fun product.",
      "text": "These are great. They're fun, and since they start out so small and end up so large, you get a lot of the beads for your money.",
      "rating": 5.0,
      "verified": true,
      "author": "Polyjubjub",
      "helpful_votes": 0,
      "publication_date": 20160706
    },
    {
      "title": "I LOVE these things",
      "text": "I LOVE these things. We saw them at a preschool we were touring and my daughter fell in love with them. They are so cool. Great packaging and great price.",
      "rating": 5.0,
      "verified": true,
      "author": "KCG69",
      "helpful_votes": 0,
      "publication_date": 20170126
    },
    {
      "title": "These things are awesome. They are very cool to touch and interact ...",
      "text": "These things are awesome. They are very cool to touch and interact with once there expanded. Careful though as they're slippery and run all over the place if you drop them in the floor. The kids have loved playing with them so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Zachary Currier",
      "helpful_votes": 0,
      "publication_date": 20171231
    },
    {
      "title": "She absolutely loved",
      "text": "This product was a hit with my 4 year old daughter. She absolutely loved it",
      "rating": 5.0,
      "verified": true,
      "author": "Ross Taylor aka: CodedInk",
      "helpful_votes": 0,
      "publication_date": 20180108
    },
    {
      "title": "These are too amazing. Daughter and her cousins always want to play ...",
      "text": "These are too amazing. Daughter and her cousins always want to play with them and they go everywhere so yeah.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170329
    },
    {
      "title": "The kids love it and oh boy",
      "text": "The kids love it and oh boy, they really bounce well. No smell, nice colors and make sure they play outside or else it will be a mess if they step on it.",
      "rating": 5.0,
      "verified": true,
      "author": "NYC squatter",
      "helpful_votes": 0,
      "publication_date": 20160725
    },
    {
      "title": "worth it",
      "text": "Hours of fun. A little goes a long way. Kids love them",
      "rating": 5.0,
      "verified": true,
      "author": "Raymond Betts",
      "helpful_votes": 0,
      "publication_date": 20200510
    },
    {
      "title": "So fun for my six year old",
      "text": "So fun for my six year old! When left out, they take several days to \"re-shrink\" to original size.",
      "rating": 5.0,
      "verified": true,
      "author": "Shelly Winter",
      "helpful_votes": 0,
      "publication_date": 20160823
    },
    {
      "title": "tons of fun",
      "text": "I will give it five stars as an awesome sensory activity. I have one child with autism and another who is a toddler and they both have tons of fun with this. I'm very glad I ran across the product.",
      "rating": 5.0,
      "verified": true,
      "author": "Nia_921",
      "helpful_votes": 0,
      "publication_date": 20160629
    },
    {
      "title": "these are AMAZING!!",
      "text": "If you have a sensory seeking or autistic kid, heck any kid, these are AMAZING!!! They'll love them so much! They're very bouncy. And don't let they go down the drain. But it'll keep them engaged and giggling for a good hour!",
      "rating": 5.0,
      "verified": true,
      "author": "Cathy D. Jeffery",
      "helpful_votes": 0,
      "publication_date": 20160128
    },
    {
      "title": "Great quality product that will last!",
      "text": "These are great! Only takes a couple teaspoons to make plenty of fun for young kiddos! Also love using these for sensory bottles.",
      "rating": 5.0,
      "verified": true,
      "author": "Emily A.",
      "helpful_votes": 0,
      "publication_date": 20170109
    },
    {
      "title": "They make a great birthday gift for friends",
      "text": "My daughter loves these! They make a great birthday gift for friends.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180112
    },
    {
      "title": "to also do your foot massage this was absolutely a perfect gift for my daughter she loved them",
      "text": "This is prefect for the orbeez to crush and make pictures, to also do your foot massage this was absolutely a perfect gift for my daughter she loved them.",
      "rating": 5.0,
      "verified": true,
      "author": "Melanie",
      "helpful_votes": 0,
      "publication_date": 20161229
    },
    {
      "title": "He has been fascinated with them and happy with his purchase",
      "text": "My son ordered these beads to use on some creative projects and to learn how they work. He has been fascinated with them and happy with his purchase. They are smaller than he anticipated, but the description accurately detailed their size.",
      "rating": 4.0,
      "verified": true,
      "author": "jenc377",
      "helpful_votes": 0,
      "publication_date": 20160912
    },
    {
      "title": "Awesome!! Extremely entertaining for kids!",
      "text": "Fast shipping, exactly as described. I set up a free kids activity at many local events. These water beads are by far the most popular thing I've ever set up. Kids from 1-12 all love them. We put 1.5-2 containers worth in a kiddie pool with measuring cups, dinosaurs etc & kids didn't want to leave. Highly recommend. We reused the same bunch 3 x. Non toxic and biodegradable are a huge plus. FUN!",
      "rating": 5.0,
      "verified": true,
      "author": "Kara A",
      "helpful_votes": 71,
      "publication_date": 20160812
    },
    {
      "title": "Lots of fun!",
      "text": "My 3 year old son has been watching videos on youtube for water beads for several weeks so we thought we would give them a try. We've made one batch and he has really enjoyed himself. The water beads are working well and the directions are clear. We're looking forward to a summer of fun with these.",
      "rating": 5.0,
      "verified": true,
      "author": "Kara",
      "helpful_votes": 0,
      "publication_date": 20160527
    },
    {
      "title": "Fun Fun Fun",
      "text": "I purchased these for my at the time 4 year old daughter and since then bath time has turned into a fun time. They are very colorful, bouncy and squishy. I definitely recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Diana Cushnie",
      "helpful_votes": 0,
      "publication_date": 20180805
    },
    {
      "title": "These are fun! Great sensory for children",
      "text": "These are fun! Great sensory for children. A little goes a long way so this container will last a while. Also brings a fun twist to vases and center pieces.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly D",
      "helpful_votes": 0,
      "publication_date": 20160710
    },
    {
      "title": "They are awesome! My 3 year old son loves them because ...",
      "text": "They are awesome! My 3 year old son loves them because he got to watch them grow and now loves playing with them. We only used a couple spoonful's so far and it makes a lot, so these will definitely last a long time. They are fun to play with and a great sensory activity!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170116
    },
    {
      "title": "Super cool",
      "text": "super fun new toy. Feels amazing. My kids loved it. Played for hours!!",
      "rating": 5.0,
      "verified": true,
      "author": "Christina",
      "helpful_votes": 0,
      "publication_date": 20170219
    },
    {
      "title": "THE BEST!!!",
      "text": "Finally.....a GIANT bottle of water beads!!! Thanks for fast shipping and a product that was exactly as described!!",
      "rating": 5.0,
      "verified": true,
      "author": "Linda",
      "helpful_votes": 0,
      "publication_date": 20161119
    },
    {
      "title": "Five Stars",
      "text": "We had so much fun with these. Our kiddo couldn't believe how these transformed into bouncy balls!",
      "rating": 5.0,
      "verified": true,
      "author": "Kansas Diesel",
      "helpful_votes": 0,
      "publication_date": 20170225
    },
    {
      "title": "Magic Beadz are a wonderful product. Our family loves them",
      "text": "Magic Beadz are a wonderful product. Our family loves them. Our son who just turned 2 loves playing with them everyday in his water table. We just bought a 2nd case for a friend's son, who loved playing with them at our house. Great fun for the whole family.",
      "rating": 5.0,
      "verified": true,
      "author": "G. Oseff",
      "helpful_votes": 0,
      "publication_date": 20170512
    },
    {
      "title": "These things are so awesome! We tossed them into the tub and my ...",
      "text": "These things are so awesome! We tossed them into the tub and my daughter spent an hour and a half having fun! I’m buying more!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Dustin",
      "helpful_votes": 0,
      "publication_date": 20180102
    },
    {
      "title": "So fun!",
      "text": "These beads are so much fun! One teaspoon makes two cups so you can make a lot!",
      "rating": 5.0,
      "verified": true,
      "author": "Cherbear08",
      "helpful_votes": 0,
      "publication_date": 20160518
    },
    {
      "title": "Great for Kids",
      "text": "These little guys are great for children. This jar has a high variety of colors, and they last forever. Timely delivery from seller, and arrived in perfect condition. Thanks!",
      "rating": 5.0,
      "verified": true,
      "author": "Holly Downs",
      "helpful_votes": 0,
      "publication_date": 20160404
    },
    {
      "title": "So much fun!",
      "text": "So much fun!!! My 3 and 5 year old love these. Super fun. A bit bouncy so watch out ha ha ha",
      "rating": 5.0,
      "verified": true,
      "author": "JanetteL",
      "helpful_votes": 0,
      "publication_date": 20170115
    },
    {
      "title": "Five Stars",
      "text": "My son loves these! He even took them to school to share with his counselor.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161110
    },
    {
      "title": "Great surprise for my autistic grandson",
      "text": "Great surprise for my autistic grandson. Played with this for a good hour. Can be messy but worth every moment to see him having fun.",
      "rating": 5.0,
      "verified": true,
      "author": "Christine Harlow",
      "helpful_votes": 0,
      "publication_date": 20160401
    },
    {
      "title": "As described and a cool little product that can have multiple uses",
      "text": "As described and a cool little product that can have multiple uses . There is plenty in the bottle and I mean PLENTY",
      "rating": 5.0,
      "verified": true,
      "author": "Gabriele",
      "helpful_votes": 0,
      "publication_date": 20170814
    },
    {
      "title": "grew nicely. My kids love playing with these",
      "text": "Works very well, grew nicely. My kids love playing with these things",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda Chipman",
      "helpful_votes": 0,
      "publication_date": 20151219
    },
    {
      "title": "Amazing.",
      "text": "These were fantastic! Definitely worth buying if you have a small one at home. It will keep them busy for hours and it's something that they can also use as a learning tool.",
      "rating": 5.0,
      "verified": true,
      "author": "Danielle Williamson",
      "helpful_votes": 0,
      "publication_date": 20170105
    },
    {
      "title": "Perfect Jar of beads!",
      "text": "This is exactly what we needed for my daughters orbeez spa! They arrived very quickly and I love that they are in a sealanle jar rather than little plastic packets!",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer Broadhead",
      "helpful_votes": 0,
      "publication_date": 20160107
    },
    {
      "title": "Fun& Relaxing",
      "text": "My kids were introduced to these by a therapist. They fell in love right away. They kept asking when they were going to arrive. We received them on time and had fun watching them grow. Now they're enjoying playing with them, I enjoy them too. My kids are 7 & almost 14.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170323
    },
    {
      "title": "Five Stars",
      "text": "Little jar made for a lot of fun. Nephews loved them.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160611
    },
    {
      "title": "Love these!",
      "text": "Arrived on time and package was as described. We ordered them for my daughter - who loved playing with these in school. My son and her have had hours of fun playing with the magic beads.",
      "rating": 5.0,
      "verified": true,
      "author": "Lorenzo Collado",
      "helpful_votes": 0,
      "publication_date": 20160731
    },
    {
      "title": "I love this product",
      "text": "I love this product. I got it for the kids but I play with them daily as a stress reliever.",
      "rating": 5.0,
      "verified": true,
      "author": "P. Reece",
      "helpful_votes": 0,
      "publication_date": 20170104
    },
    {
      "title": "Five Stars",
      "text": "The kids absolutely love them. I hate them because I have to tidy up the mess afterwards ;)",
      "rating": 5.0,
      "verified": true,
      "author": "Kriss Watt",
      "helpful_votes": 0,
      "publication_date": 20161207
    },
    {
      "title": "and I love how many comes in this",
      "text": "Item is exactly as described, and I love how many comes in this. My 3 y/o son loves these things and has been asking for them for months",
      "rating": 5.0,
      "verified": true,
      "author": "Houston",
      "helpful_votes": 0,
      "publication_date": 20151203
    },
    {
      "title": "Five Stars",
      "text": "My daughter loves these. We put them in her sand/water table.",
      "rating": 5.0,
      "verified": true,
      "author": "CK",
      "helpful_votes": 0,
      "publication_date": 20170518
    }
  ],
  "product_meta": {
    "title": "Magic Beadz - Jelly Water Beads Grow Many Times Original Size - Fun for All Ages - Over 20,000 Beads",
    "rating": 4.6,
    "feature_bullets": [
      "💦 BOUNCY, SQUISHY, SUPER-FUN WATER BEADS – Keep your little ones entertained with the ultra-vibrant & exquisite Magic Beadz. These amazing gel beads start as tiny hard balls but quickly grow many times their original size to become beautiful, smooth jelly beads when you add water.",
      "😄 YOUR KIDS’ NEW FAVORITE ACTIVITY – No reason for your kids to be bored. These water marbles keep kids busy for hours and make a fun game, great learning tool, science project, or sensory bin item. Science made fun – kids are fascinated with the growing process and the squishy feel.",
      "✅ TOP QUALITY & 100% SAFE - Let them play for hours worry-free. Magic Beadz are non-toxic, colorfast (won't fade or bleed!) and non-flammable. Fully tested and exceed all children's toy safety requirements.",
      "🌈 MULTI-USE, VIBRANT COLORS Perfect budget-friendly and safe refill or replacement for all spa bead products. Long-lasting after they reach their maximum size. This rainbow mix includes 12 unique colors.",
      "🛒 GUARANTEED SATISFACTION - Try Magic Beadz risk-free with our 100% GUARANTEE. Click \"Add to Cart\" or \"Buy Now\" and introduce your kids to the amazing world of Magic Beadz."
    ],
    "specifications": {
      "Product Dimensions": "3.3 x 2.3 x 1 inches",
      "Item Weight": "7.2 ounces",
      "ASIN": "B0160CH4E6",
      "Manufacturer recommended age": "3 years and up",
      "Best Sellers Rank": "#87,603 in Toys & Games",
      "Customer Reviews": "4.6 out of 5 stars540 ratings4.6 out of 5 stars",
      "Is Discontinued By Manufacturer": "No",
      "Mfg Recommended age": "3 year and up",
      "Manufacturer": "MagicBeadz"
    },
    "categories": [
      "Toys & Games",
      "Novelty & Gag Toys"
    ],
    "price": 14.99
  }
}